{
    "category": "Amsterdam", 
    "entity": "Herengracht", 
    "avg_rating_stars": 4.530523255813954, 
    "review_count": 688, 
    "rating_stats": {
        "poor": 2, 
        "average": 38, 
        "terrible": 0, 
        "very_good": 241, 
        "excellent": 407
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "Beautiful Canal Area. The Herengracht Canal is one of the prettiest canal areas in Amsterdam. We stayed at the Banks Mansion Hotel which has canal view rooms overlooking the Herengracht. Banks Mansion is a very nice hotel in a very nice pretty area of Amsterdam. A stroll or canal boat ride along the Herengracht is a must if you visit Amsterdam."
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "Awe...some buildings. The architecture in this area is great. Walk or cruise along taking note of the facades of these buildings. It's awesome. I've never seen anything like it."
        }, 
        {
            "index": 3, 
            "rating": "4", 
            "review": "Beautiful Canala. Along with the rest of the Amsterdam canals, it is worth visiting Herengracht. It is a beautiful canal that represents the traditional Dutch architecture."
        }, 
        {
            "index": 4, 
            "rating": "3", 
            "review": "Good walking street to get across part of the city. Stayed just a block off Herengracht for 8 days, and found it to be relatively quiet in most areas. Allowed us to circumnavigate the busy streets when we wanted to just walk, and look at houses."
        }, 
        {
            "index": 5, 
            "rating": "4", 
            "review": "Picturesque Amsterdam Canal. I have always enjoyed the views afforded by the bridges over the Herengracht. So typical with boats moored on the sides, trees on the banks and a canal boat treading the water."
        }, 
        {
            "index": 6, 
            "rating": "4", 
            "review": "Gentleman's Canal. The Herengracht is considered the most important canal in the city. In the 17th century, the richest and most influential people of the city lived on this canal. Even today, an address on the Herengracht is seen as prestigious. There are several hundred heritage sites located on this canal, including beautiful homes and at least 5 different museums."
        }, 
        {
            "index": 7, 
            "rating": "5", 
            "review": "Stunning. Well, what can you say about a leafy lazy canal on a sunny day. With the most beautiful houses on show, a lovely walk with much to see..Just listen out for bike bells lol!"
        }, 
        {
            "index": 8, 
            "rating": "4", 
            "review": "lovely place to visit, quaint buildings all on a canal. We stayed on the Herengracht at The Hoxton Hotel. Great central place to stay when visiting Amsterdam. Everything within a decent walk. A great experience."
        }, 
        {
            "index": 9, 
            "rating": "4", 
            "review": "Beautiful stretch of canal. Very picturesque canal with lots of fantastic (slightly wobbly!) buildings. It is very plesant to sit out with a coffee and watch the boats go by."
        }, 
        {
            "index": 10, 
            "rating": "5", 
            "review": "lovely street. our B and B was located on this street. Loved walking up and down this canal street. Many beautiful homes along the street."
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "Great canal boat tour.. Took a canal boat tour on a smaller boat ......just 8 of us. Very informative guide knew the answer to all our questions. Most impressive."
        }, 
        {
            "index": 12, 
            "rating": "5", 
            "review": "Lovely walk. Herengracht is one of the three big old canals of Amsterdam. They're all just beautiful to walk along. Herengracht is a little different from the others because it doesn't have many shops or restaurants along it, just beautiful houses,giving it a more peaceful atmosphere. Definitely allow time for a walk along this lovely canal."
        }, 
        {
            "index": 13, 
            "rating": "5", 
            "review": "Wonderful. The canals are amazing in Amsterdam, just rent a bike and cycle to get lost. The best way to visit in a different way."
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "A must see. There is the possibility of taking a beautiful boat trip and admiring the sumptuous houses around it."
        }, 
        {
            "index": 15, 
            "rating": "4", 
            "review": "weekend trip to Amsterdam. we done a boat trip round some of the canals it is a very good experience to see all the different types of town houses and boats well worth the visit there is a lot of history associated with the canals,"
        }, 
        {
            "index": 16, 
            "rating": "4", 
            "review": "Beautiful canal. There are many canals and most of them you would think look the same , but this canal definitely has more to offer with more restaurants and cafes !"
        }, 
        {
            "index": 17, 
            "rating": "4", 
            "review": "Lucrative canal. There are some canals in Amsterdam, this one is the lucrative one. There are many restaurants, boats, shops around the canal. One can have houseboat also. One can use boat or bicycle or can have a walk around. It is around 1-2 km away from the central station."
        }, 
        {
            "index": 18, 
            "rating": "5", 
            "review": "Authentic Amsterdam. The canals, the boats, the shops, the bridges, the houses and smalls shops makes this a wonderful location in the heart of amsterdam. This is something not to miss. Grab a boat, a bike or just take a walk. You'll be amazed!"
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "Our favourite Canal. Ok we used to live here over 10 years ago (289), but we went back recently and it's still one of my favourite canals. It's called the Gentleman's Canal and was once considered as the most important canal in the city. It's where the wealthier merchants lived. It also happens to be one of the most interesting canals to walk along. It has Amsterdam's oldest house on it (No.81) 364-370 you find the four Cromhout houses. And further down are the Seven bridges of Reguliersgracht. One of the most photographed sights in the city and very beautiful. We enjoyed a morning stroll to De Herengracht cafe (435) for in our opinion one of the best breakfasts in Amsterdam. Coming back in September of this year, we noticed a few shops and cafe's had gone or changed but it's still one of the best looking canals in the city as far as we are concerned. And definitely worth a stroll down."
        }, 
        {
            "index": 20, 
            "rating": "4", 
            "review": "Canal trip. We took two canal trips on our stay and this was one of the canals we travelled down. Pretty area lots of houseboats ."
        }, 
        {
            "index": 21, 
            "rating": "5", 
            "review": "Night and Day - a Delight. We love strolling down this gracious canal at any time of the day or night...so peaceful and lovely. And how generous the residents are to let us peek inside their gorgeous homes in the evening, as we wander by the twinkly-lit bridges."
        }, 
        {
            "index": 22, 
            "rating": "3", 
            "review": "Typical canal in Amsterdam. Crowded like all of Amsterdam, dirty water and sidewalks filled with trash and dog excrement. Safer to view from a canal boat ride."
        }, 
        {
            "index": 23, 
            "rating": "4", 
            "review": "Great walking canal. We enjoyed several strolls along this canal. Our hotel was locked in the area so it made it perfect for us."
        }, 
        {
            "index": 24, 
            "rating": "5", 
            "review": "fascinating canal. Great to sail down and even more so to sit at a cafe along it and have herring with onions, accompanied by a great Dutch beer"
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "Charming and crowd free. Beautiful canal lined with hotels, houses and restaurants. Quiet, safe and charming. Many restaurants from fancy to small, neighborhood cafes. Sidewalks are very narrow and bike traffic is heavy, although confined to the bike lanes, which are easy to mistake for sidewalks--beware!"
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "Picture postcard of Amsterdam. This is what you think of when you hear about the city of Amsterdam. Beautiful canals, house boats, cafes, and historic building. A great \"canal ring\" to see from a boat and to walk around and enjoy a cup of coffee."
        }, 
        {
            "index": 27, 
            "rating": "5", 
            "review": "love this place. love this place cannot wait to go back, so beautiful and peaceful we had a great time, the Ann Franc museum is a must to see and hear what they went though just made it so real and so moving an experience"
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "Great Street!. Of all those beautiful streets in Amsterdam, this is one of the best. Well worth the visit. The homes are incredible and the canal is outstanding."
        }, 
        {
            "index": 29, 
            "rating": "4", 
            "review": "Typical Amsterdam. The Herengracht is nice to visit if you want to see the typical 'Amsterdamse Grachten' and Amsterdam architecture. Usually very busy, like the rest of Amsterdam."
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Great views. Just a 5 minute walk away from the busy Dam Square this canal ring is great for seeing the canals at their best , great coffeeshop there called Amnesia"
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "Great Service and food. We ate on two consecutive evenings at this friendly bar. We had tables by the canal. It was busy but the staff are super friendly and welcoming and create a great atmosphere. Originally planned to stop just for drinks but the food around us looked so good we stayed to eat. Delicious, perfectly cooked Dorado fish with crispy muscles and peas was the favourite but excellent burgers too."
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "A Room with a View of the Herengracht from Our Hotel. The Herengracht is one of a series of parallel canals forming part of a ring of waterways that are characteristic of Amsterdam. The buildings fronting the Herengracht are mostly respectful of the architectural style that evolved as housing for Amsterdam's citizenry. The Herengracht exudes authenticity and a sense of the benefit of protections for the structural and developmental heritage in which Amsterdam takes great pride."
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "Beautiful. Lovely and typically Amsterdam. There is a bench off this street where the bench is which was filmed on The Fault in our Stars. Well the actual bench was stolen but you can visit the replacement which is in the same location. The bench has many locks fastened to it so you can't miss it."
        }, 
        {
            "index": 34, 
            "rating": "5", 
            "review": "Pure Amsterdam.. Staying in this area and overlooking this canal. It is fascinating just strolling and watching the river traffic go by. Lots of little shops and restaurants along the way."
        }, 
        {
            "index": 35, 
            "rating": "5", 
            "review": "Relaxing. Strolling along the canal is relaxing. Seeing all the historic buildings that many have not changed in centuries."
        }, 
        {
            "index": 36, 
            "rating": "4", 
            "review": "Beautiful view!. Herengracht canal is beautiful with an assortment of gorgeous architecture all around - it's a lovely spot for a photo op or to just wander taking in the views while exploring the city."
        }, 
        {
            "index": 37, 
            "rating": "5", 
            "review": "Gorgeously beautiful canal!. We stayed on the Herengracht Canal at Banks Mansion. The canal is beautiful and the bridges, cafes, and boutiques are numerous! We walked along the canal, as well as took a canal boat tour and loved every minute!"
        }, 
        {
            "index": 38, 
            "rating": "4", 
            "review": "Nice View. Ive pass by many canals in amsterdam but this one is really nice to look at. I have a my picture and its a night version of this."
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "The beauty of Jordaan district of Amsterdam. Piece and tranquility of Amsterdam. Heregracht canal is the essential part of Jordaan district with lots of painting galleries along side the canal, cozy cafes cute houses. It's spectacular in the evenings when the bridges over the canal with all illuminations."
        }, 
        {
            "index": 40, 
            "rating": "4", 
            "review": "Nice. This canal looks very cozy. Not wide and the buildings looks pretty. Nice walking on the border with canal but pay attention with cyclists"
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "The perfect Amsterdam canal. Our hotel (Ambassade) was centrally located on the Herengracht. The canal evoked all of our visions of what an Amsterdam canal should be! Charming."
        }, 
        {
            "index": 42, 
            "rating": "5", 
            "review": "Walk here to take in the architecture. This is where you want to be if you like 17th century architecture. The oldest house I am aware of in the city, from the 16th century, is still standing along this beautiful canal, too."
        }, 
        {
            "index": 43, 
            "rating": "5", 
            "review": "Excellent part of the canal system. Herengracht goes on for quite a long distance along the canal system and is well worth a visit. There are numerous beautiful old gabled houses along the canal and is a photographers dream."
        }, 
        {
            "index": 44, 
            "rating": "4", 
            "review": "Best to see from a boat tour. We've been sailing through this area in a boat. It was a nice execursion giving overview of Amsterdam's history and most prominent people living here. In a boat you can see more within an hour than exploring this area by foot. The boat was leaving from pier near Central Station."
        }, 
        {
            "index": 45, 
            "rating": "5", 
            "review": "Great cafes, amazing vibe. Lovely spots by the canal, ideal to enjoy a coffee or wine after shopping and boat watching. Essential Amsterdam"
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "Wonderful stroll along this canal, full of historical buildings. Living in Amsterdam is always a pleasure, strolling along the Herengracht in the sunshine is always a calming and exciting experience. Looking at the different architecture and enjoying people watching."
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "The Most Prestigious Street in Amsterdam. We stayed at the Ambassade Hotel located right in the middle of the Herengracht area. This is considered to be the most important canal neighborhood in the city. Only the richest merchants, influential people and mayors lived in lavish homes on this canal. The oldest house was built in 1590 near 81. It's a traditional merchant's house with a beautiful step gable.The mayor of Amsterdam's house is located at 502 with the white pillars. This 45 room home was originally built in 1665 for Paulus Godin, slave trader and director of the Dutch West India Company. Later, in 1926, the house became mayor's residence. The mayor lives on the third and fourth floors. The merchant's house on 497 was built in 1664. In 2004, the house was the main location for the Amsterdam sequence of the movie 'Ocean's Twelve' with with George Clooney, Brad Pitt, Matt Damon, Catherine Zeta-Jones, Andy García, Julia Roberts, Don Cheadle, Bernie Mac. Today it's the Cat's Cabinet, a museum with works of art dedicated to cats."
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "Loved the Herengracht area. Stayed at the Ambassade with a lovely view of the canal. Many nice places for shopping and for eating. As a vegan was thrilled by how many places served healthy food midst the classic cheese shops and lovely pastry places."
        }, 
        {
            "index": 49, 
            "rating": "3", 
            "review": "Nice for a stroll but nothing more. Like all the areas in amsterdam, You will see a few nice bridges, canals, and have to dodge crazy bikers. All the areas look very similar."
        }, 
        {
            "index": 50, 
            "rating": "4", 
            "review": "Take the boat tour!. I would suggest you take one of the canal tours to truly appreciate the houses, houseboats and the scenery. You won't have to keep dodging the suicide cyclists if you are on the boat!"
        }, 
        {
            "index": 51, 
            "rating": "4", 
            "review": "You cannot vitit amsterdam without walking the canals and taking a boat ride.. You cannot vitit amsterdam without walking the canals and taking a boat ride. Fascinating, historic and up to date since all these wonderful looking old (and some new) buildings have been lovingly maintained."
        }, 
        {
            "index": 52, 
            "rating": "4", 
            "review": "Yes, the typical and expected picture of Amsterdam. you see the typical and expected picture of Amsterdam. it is hectic arround this area: pedestrian, cylists, motorcyclists. Then this nearby picture of silcend under the streed - the Gracht. This is exactly why we are going here."
        }, 
        {
            "index": 53, 
            "rating": "4", 
            "review": "Beauty and calm. Beautiful and calm river place for visitors.\nAnyway you can see too many sights in Amsterdam like this.\nRiver, small bridge are a part of Amsterdam beauties."
        }, 
        {
            "index": 54, 
            "rating": "5", 
            "review": "Beautiful grand conaal of Amsterdam away from Tourism.... Take time to walk along the canaal, and further out into the residential areas of The Amsterdaamers, and Dutch life. You miss so much remaining in the tourist areas of the city, so break out, go out and along.\nFind many bars, places to eat, micro economy stores, and great character in little sub districts."
        }, 
        {
            "index": 55, 
            "rating": "5", 
            "review": "Beautiful homes on a beautiful canal. We stayed at a nice apartment on Herengracht near Raadhuistrat, the cross street. lots of activities and people watching and on the weekends, boats boats boats. Some people playing music and some singing, a very upscale street to roam around and find special shops and restaurants. A really nice canal to make a home to live in. Nearby grocery shopping."
        }, 
        {
            "index": 56, 
            "rating": "4", 
            "review": "One of the Trinity of Canals. Known as the Gentlemen's Canal in a neighbourhood filled with canals attracting tourists. The Canal cruise offers a different perspective from the walk along the banks featuring the beautiful and ornate architectural homes of the rich bourgoise of the past."
        }, 
        {
            "index": 57, 
            "rating": "4", 
            "review": "I bet the film crew ate here !. I found this place when out looking for the bench form the movie, 'the fault in our stars'. It had been a long walk. There were an infinite number of points between our lodging and this location, but had we been lodging twice as far away, then there would have been twice that number in that larger infinity. Anyhow... The restaurant provided a welcomed place to dine after our first attempt at a photograph at the bench and a place to gather our strength for the second ! .... Yes you may have to queue to sit on the bench. We both opted for the burger which in itself was delicious and well prepared. The fries were hot and crispy on the outside and served with mayo and Tom ketchup. There was also a delicious little salad that was beautifully dressed and prepared. The only negative is that the burgers did cost 17.50 euros (although I might still be adjusting to the pound's devaluation post brexit vote). There might be faults in our stars, but not in this food."
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "Beautiful canal district. You can pay for a canal tour or just stay in a canal district hotel. Particularly if you are mobility limited, staying in teh Herngracht, the neighborhood surrounded by canals, will give you the experience of Amsterdam with little walking. Just look out your window!"
        }, 
        {
            "index": 59, 
            "rating": "5", 
            "review": "such a wonderful place to stay. Our hotel was in this area and you are in walking distance to so many attractions. The canals are truly wonderful."
        }, 
        {
            "index": 60, 
            "rating": "4", 
            "review": "Good for a leisurely, carefree stroll. One of the posh localities in Amsterdam. Great for a leisurely stroll. Beautiful buildings all around."
        }, 
        {
            "index": 61, 
            "rating": "5", 
            "review": "By far my favourite!. My favourite canal we visited in Amsterdam as it is a little out of the way from the main 2. We were here on a lovely sunny day and it was just beautiful. The people that live here are very lucky."
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "Another Lovely Canal. Sailed down here on our boat cruise. It is known as the Gentleman's Canal. You will see some extremely beautiful houses on either side of the canal that originally were owned by rich merchants."
        }, 
        {
            "index": 63, 
            "rating": "4", 
            "review": "The Gentlemen's Canal. The Herengracht is lined by some of the finest houses in Amsterdam which were owned by merchants in the centuries after the canal was dug.A canal boat trip should take you down this canal where again you can see the narrow houses with elaborate gables and furniture hoists for bringing in large heavy items.The bottom end of the canal is called the 'Golden Bend' because of the larger elaborate, and probably very expensive, houses here."
        }, 
        {
            "index": 64, 
            "rating": "5", 
            "review": "Beautiful. One of the several sections of Amsterdam that encourages people to stay after one visit. Easily manageable because of the layout and size, but you can get lost in the fantastic Dutch architecture, great food and mesmerizing canals."
        }, 
        {
            "index": 65, 
            "rating": "5", 
            "review": "Lunch by the canal. On our second day in Amsterdam we sat by the canal and ate some tapas we had bought from the local supermarket. It was magical. A really lovely part of the city with barges floating past with tourist waving and smiling at eachother. It was one of my most enjoyable experiences sitting with my legs dangling above the water surrounded in the most beautiful flowers and people :) A lovely feel for how Amsterdam was in the early 1900's. Alot of architecture fully intact and well maintained. Streets kept very well with a nice local ambience about it. Can't wait to do it all over again <3"
        }, 
        {
            "index": 66, 
            "rating": "4", 
            "review": "More canals, plus some shopping. Herengracht, is one of the main rings of canals in Amsterdam, some of the main attractions such as the nine streets (small shopping boutiques) and intersections are on Herengracht."
        }, 
        {
            "index": 67, 
            "rating": "4", 
            "review": "Delicious dinner . Had a great dinner and was fairly priced. Had outside plaza downstairs that was really nice. The burger was delicious!! Definitely recommended."
        }, 
        {
            "index": 68, 
            "rating": "5", 
            "review": "Herengracht in the Jordaan neighborhood. Good for seeing historical classic Dutch architecture. Grand canal houses, along with the Nine Streets\" shopping area. See also the Keizersgracht and Prinsengracht canals."
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "Such cute part of the many canals that enchant the city. As with many other canals of the city, this is another one worth walking by. Nice area with nice old buildings and shops plus cafes around."
        }, 
        {
            "index": 70, 
            "rating": "3", 
            "review": "Always lovely to walk down. Walking around is a pleasure but watch out for bicycles. We walked along it several times and it is pretty and clean."
        }, 
        {
            "index": 71, 
            "rating": "4", 
            "review": "Lovely Walk. This canal is lovely to stroll beside, the are a few bars and shops to visit too. There are various styles of canal houses to see too."
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "Old world charm. The grachts in Amsterdam are a travellers delight. The buildings lining these grachts are old with their own unique architecture."
        }, 
        {
            "index": 73, 
            "rating": "4", 
            "review": "So charming - beware the bikes. This area captures the spirit of the local charm. One thing that stunned us was the massive number of bikes on the narrow cobbled streets driven by people who didn't follow directions, without helmets and also had toddlers sitting in front or behind of the rider. At night, they don't use their headlights and its dangerous at the intersections when they cut in front of themselves. It all adds to the memory of visiting this unique area. But be careful, we were nearly hit 8 different times."
        }, 
        {
            "index": 74, 
            "rating": "5", 
            "review": "Typical Amsterdam-ish feeling. The walks around the cannal are the best way to experience Amsterdam and its potential. We stopped in Herengracht for a beer on the cannal side and it was lovely. We recommend to walk a lot when in this city, to fully feel its glory!"
        }, 
        {
            "index": 75, 
            "rating": "5", 
            "review": "Lovely!. Herengracht is one of the Canals/streets that runs right the way around the city. Beautiful, and peaceful. Great place for a stroll."
        }, 
        {
            "index": 76, 
            "rating": "4", 
            "review": "Nice canal view. It's really a wonderful experience when in Amsterdam. Even all canals looks the same, it's such a beautiful view during the cruise"
        }, 
        {
            "index": 77, 
            "rating": "3", 
            "review": "Nothing special. Hi there,I been in Amsterdam in January,This place is nothing special maybe if I would be summer could be different,Amsterdam is only good for a weekend."
        }, 
        {
            "index": 78, 
            "rating": "5", 
            "review": "Oh! Gone back to Dreamworld !!!. This is one of the most beautiful spots in Amsterdam to spend time with your partner , holding hands, and feeling n expressing your love for each other.It's just amazing , what a beautiful, serene n happy place can do to you..... Create magic in the Air.That's what is what you feel here. Do spend a good , quality time with your family/ friends/ kids here... It does bond You.Getting hereis easy. Just follow the map, n be sure of the canal side u r walking on, as there are many canals in Amsterdam, you might get confused."
        }, 
        {
            "index": 79, 
            "rating": "5", 
            "review": "Quiet and fun at the same time!. This is a great walking canal with beautiful houses and side streets going off in many directions for unique shopping and small places to eat."
        }, 
        {
            "index": 80, 
            "rating": "5", 
            "review": "MAGICAL. For me amsterdam its all about the canals , and the herengracht is one of the best. in the past the rich people were living there, well also today, but thanks to the past youll find there amazing cnal houses and beautiful shops and restaurants. you should go to the jordaan area"
        }, 
        {
            "index": 81, 
            "rating": "4", 
            "review": "Old Amsterdam. Like the Jordaan a walk aroound the Gracht is like talking a walk around old Amsterdam. Interesting views of the old houses and the canal itself. Take a leisurely stroll and stop for a coffee."
        }, 
        {
            "index": 82, 
            "rating": "4", 
            "review": "Calendar view canal !. Refreshing & clean canal. Lines of boats gives you a kind of calendar photo shots. Restaurants abounds."
        }, 
        {
            "index": 83, 
            "rating": "4", 
            "review": "canal tour. a must in Amsterdam in the canal boat trip 1 hour for about 10 euros, It is worth just to get off your feet and a great way of seeing all the history and sights of the city with a commentary"
        }, 
        {
            "index": 84, 
            "rating": "5", 
            "review": "Terrific canal views. Nice canal in central Amsterdam with good views. Nice place to go on a sunny summer afternoon. Plenty of boats on the canal."
        }, 
        {
            "index": 85, 
            "rating": "3", 
            "review": "Nice scenic canal. One of the many Canals in Amsterdam.\nDefinitely work a walk to it if you are out and about exploring amsterdam."
        }, 
        {
            "index": 86, 
            "rating": "5", 
            "review": "some of the wealthiest Dutch lived here (and probably still do). any canal tour will include this gracht. The boat operator will explain anything worth seeing and taking pictures of (and there are many); the buildings are wonderful and you just have to marvel at how old these structures are."
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "Beautiful. Great views over the lovely canal, Herengracht is one of Amsterdams most beautiful streets! Great place for a wander!!"
        }, 
        {
            "index": 88, 
            "rating": "5", 
            "review": "One of the Three major canals in Amsterdam. The Herengracht canal is one of the prettiest canal. The Golden Bend is filled with lovely mansions."
        }, 
        {
            "index": 89, 
            "rating": "5", 
            "review": "our hotel was in this beautiful street. A mixture of beautiful houses running each side of the canal\nSome of the canal cruise boats travel down this canal to point out the Mayor's house and other very grand 17 century residences"
        }, 
        {
            "index": 90, 
            "rating": "3", 
            "review": "It's a canal. So... this is a canal. Largely in picturesque parts of town. I guess you can look at it? I'm not clear on what there is to say about a canal."
        }, 
        {
            "index": 91, 
            "rating": "5", 
            "review": "Major canal in Amsterdam with coach houses. You can enjoy from a canal cruise and check the coach houses or floating houses in the canal. You can also walk by its sides among the trees and catch the details of the lovely mansions along side. *Tip: very useful to download Amsterdam map on your mobile or tablet and it will walk you through. It is the perfect guide."
        }, 
        {
            "index": 92, 
            "rating": "4", 
            "review": "Lovely canal. Quintessential Amsterdam, a tree lined canal with traditional 17th century mansions behind. A lovely place to wander with the odd canal side cafe to stop and grab a drink in."
        }, 
        {
            "index": 93, 
            "rating": "4", 
            "review": "Another nice Gracht. This is yet another nice Gracht ( canal) . You could take a pleasant stroll on its banks or do a river cruise. Plenty of lovely buildings all around and looks pretty much the same as the rest of Amsterdam !"
        }, 
        {
            "index": 94, 
            "rating": "5", 
            "review": "Lovely to view by canal boat. Spent an hour cruising the canals on a lovely spring day. To look up at the walkers, hot and crowded made us appreciate the ride even more. We did walk the area in the evening and it was wonderful. There are nice shops and restaurants."
        }, 
        {
            "index": 95, 
            "rating": "4", 
            "review": "Lovely Canal. One of the 3 main canals in Amsterdam, where the rich built their houses. It is very pleasant to walk along beside the canal or go on a boat trip down it."
        }, 
        {
            "index": 96, 
            "rating": "5", 
            "review": "As much canals in Amsterdal you visit, so much delighted you are. Another of the Amsterdam´s beautiful canals to be visited either by walking or on boat trip... The advantage of a boat trip is a lacking temptation to visit all the attractive boutiques, restaurants, bars and other places and subsequent danger of expenses...or better: the temptation is there but hard to be materialized."
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "Every Gracht is a nice to see. The view of the gracht is unique. I'd buy a sight seeing tour by boat to see the gracht. costed me about 9 euro for an hour."
        }, 
        {
            "index": 98, 
            "rating": "4", 
            "review": "Perfect place to walk and watch. The path by the canal is always a delight with the house-boats, small cafes and so many lovely old house fronts. When you wander down here - perhaps heading to the Jewish Quarter - it's hard to realise how close you are the busy main streets. Take your time, and take lots of pictures to capture the essence of Amsterdam."
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "Nice \"gracht\". One of the main canals in the middle of the city. If you take a boat you can make excellent photos from the old houses on both side of the gracht."
        }, 
        {
            "index": 100, 
            "rating": "5", 
            "review": "Beautiful area. This was a lovely area to visit and close to Central Station. Lovely canals and buildings along the edges. Worth a stop."
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "Amazing attraction. The most photogenic gracht in the centre of the city. Especially with the sunset or sunrise. You can take the boat from the pier close to the Central Station and see all grachts (channels),"
        }, 
        {
            "index": 102, 
            "rating": "5", 
            "review": "Great for an evening stroll. Take in the ambience of the gentleman's canal. Great for a stroll after your evening dinner and extremely nice around the 9 streets."
        }, 
        {
            "index": 103, 
            "rating": "3", 
            "review": "Golden views of merchants homes. The rich merchants built homes here, some resplendent with gables of unique shapes, so this canal displays the rishes of centuries past."
        }, 
        {
            "index": 104, 
            "rating": "5", 
            "review": "Lovely area to wander slowly through. We stayed in this area, and found it to be a wonderfully relaxed location in which you could potter in and wander slowly about. It has a few places to eat, and lies in the nine steet district with all its wonderful and unique shops to explore."
        }, 
        {
            "index": 105, 
            "rating": "5", 
            "review": "Lots of History Here. Called the Gentlemen's Canal because of the wealthy residents, today it has businesses, a museum, hotels and restaurants. To see it from the canal, take one of the canal cruises. It's very scenic and kept well. At one time it was at the outer edge of the city, now it's convenient to many sights.On nice days we saw many people eating lunch or just passing time on the side of the canal."
        }, 
        {
            "index": 106, 
            "rating": "4", 
            "review": "Lovely walk. As Herengracht is one of the most famous streets in Amsterdam, it gives a lovely impression of how Amsterdam used to be. You can see the history in the buildings and the canals, as well as the modern adaptation. There are many offices now in many buildings. Walking along Herengracht makes a nice, away from the crowds, look into the picturesque tree lined canals and gorgeous and luxurious town houses."
        }, 
        {
            "index": 107, 
            "rating": "4", 
            "review": "Even more astonishing as there 400 years old. Known as the gentleman's canal, is first the first of the major canals within the city, as history has it peter the great once stayed here during a visit. Like all the canals this one is nice to stroll along taking it all in."
        }, 
        {
            "index": 108, 
            "rating": "5", 
            "review": "Number 2 of the 5 old canals. Walk or bike, there's no other or better way .... well, by sightseeing boat of course :-)) which gives you an even better view of the old houses + a (hopefully) interesting and/or very informative lecture. You can easily spend a whole day (boat/bike/legs) if you add the four other semi circular canals of the older center."
        }, 
        {
            "index": 109, 
            "rating": "4", 
            "review": "Can't miss this gracht. Whatever you go to do in AMS, you will eventually stumble upon this gracht. Located in the center of the center, this gracht has some of the most impressive buildings of Amsterdam to show ..."
        }, 
        {
            "index": 110, 
            "rating": "4", 
            "review": "the best place to take a walk. nice view of the canal and building nearby. connecting to Dam square making it easy to reach. getting a map is a must as the maybe a bit confusing with a lot of lane."
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "Good views. A great place to take some memorable photographs, beautiful canal side scenes and very pleasant and relaxing"
        }, 
        {
            "index": 112, 
            "rating": "5", 
            "review": "Fantastic . We walked along that street in the afternoon and loved the buildings and architecture all around. The canal was so peaceful with tons of boats floating around. This is a great place for a stroll."
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "It is where I have lived for 5 years, one of the best grachts of Amsterdam. I have lived at number 342 and worked at 442 for 5 years. It is one of the best area of Amsterdam, a must walk when you are there."
        }, 
        {
            "index": 114, 
            "rating": "4", 
            "review": "Beautiful canals cruise. Highly recommend taking the canals cruise to see a lot more than you can on foot. They give you a running commentary on interesting places and facts."
        }, 
        {
            "index": 115, 
            "rating": "4", 
            "review": "A Must!. When visiting Amsterdam for the first time, and with intention to get a grasp of what this place was during the Golden Age, go and stroll along Herengracht and fantasize,.... Just a little."
        }, 
        {
            "index": 116, 
            "rating": "5", 
            "review": "A beautiful place to stay. A great location , within walking distance of everywhere we wanted to go . Lots of good coffee houses and restaurants nearby ."
        }, 
        {
            "index": 117, 
            "rating": "4", 
            "review": "Pretty walk. You can't get lost, so you may as well enjoy strolling. Find the \"9 Streets\" and go shopping! Take plenty of pictures, but remember that people actually live along this street."
        }, 
        {
            "index": 118, 
            "rating": "5", 
            "review": "Beautiful canals of Amsterdam. The canals in Amsterdam are a treasure. See them both on foot, and from the canal bus. Many great restaurants and cafes everywhere!"
        }, 
        {
            "index": 119, 
            "rating": "5", 
            "review": "Hotel and restaurants. Stayed at the ambassade here which is amazing. But the whole street makes the experience. So nice and quiet yet literally two blocks from the center of the hustle/bustle of Amsterdam. Herengracht the restaurant has great cocktails! Day or night."
        }, 
        {
            "index": 120, 
            "rating": "4", 
            "review": "Nice stroll through the Gracht. This area with the Herengracht canal as its centre, is a lovely place for a stroll.\nSaw many museums and historic buildings along the way. Good to digress from the main Central - Damrak square and walk down the canal roads near the Centrum"
        }, 
        {
            "index": 121, 
            "rating": "5", 
            "review": "Museums, small hotels and restaurants. Lovely, quiet, attractive area. Visited Van Loon historic house, Museum of bags and purses, stayed in hotel on Herengracht."
        }, 
        {
            "index": 122, 
            "rating": "4", 
            "review": "Strolling in history. A day trip to Amsterdam, to visit several smaller museums, you have to stroll though the \"grachten\" to get there. Currently all was nice and clean, what was different in the past!!!!"
        }, 
        {
            "index": 123, 
            "rating": "5", 
            "review": "Pretty. Stayed at the Hoxton on Herengracht. Went on a canal cruise that took you down Herengracht, so pretty."
        }, 
        {
            "index": 124, 
            "rating": "4", 
            "review": "Amazing.... Lovely to walk around... Or bike and just relax watching the water... Simply magic\nThere are several street crossing this area full of nice cafe and snack bar.. Super recommended"
        }, 
        {
            "index": 125, 
            "rating": "4", 
            "review": "Canal Trip. Did an hour canal trip and really enjoyed the sights and sounds of Amsterdam as we cruised down the Herengracht."
        }, 
        {
            "index": 126, 
            "rating": "4", 
            "review": "great stroll. Enjoy the views. Children's rating 3/5. As the other canals that surround Amsterdam Centrum, this is a great one for a stroll. It is also the one that crosses the posh areas of downtown with the nicest and most expensive houses alongside it. Again, if you carry a stroller make sure you look ahead before you chose which sidewalk you walk in because not all of them are good for strollers and can be a challenge. This area is quiet and nice and charming. Make sure you also see the canal in a boat cruise, it changes the perspective of it."
        }, 
        {
            "index": 127, 
            "rating": "5", 
            "review": "The Best. the Herengracht has the biggest and sumptuous houses, ” The Canal of the Aristocrats” was the noblest address in Amsterdam during the golden age, but shorter houses in another canals( especially in Jordaam area) are also pretty.I recommend to the romantics (like me) to try the two-hour night cruise with wine and cheese or a two- or three-hour dinner. The former run nightly year-round for 25€. Dinner cruises run nightly April through November, around twice per week in winter for 70€. Reservations are required."
        }, 
        {
            "index": 128, 
            "rating": "5", 
            "review": "Just Meander and Enjoy. Take some time to wander through the canals on the Herengracht, Kaisergracht, Princegracht etc. Some brilliant camera angles here. Sit and watch the world go by. Look up at the amazing houses which date from the early 17th Century. Amazing."
        }, 
        {
            "index": 129, 
            "rating": "4", 
            "review": "Nice peaceful area. If you find yourself on your own in the city this entire area really is a must do. I took a morning to myself to explore these beautiful canals and was not disappointed. The surrounding area was beautiful with all of the slanted buildings really flexing the character of the older areas of the canal belts of Amsterdam. The one drawback (being my own fault), was the rain!"
        }, 
        {
            "index": 130, 
            "rating": "4", 
            "review": "Nice area for a stroll. This is a typical canal street in Amsterdam and a nice area for a stroll. However the footpaths are narrow and there always seems to be some work going on on them so be careful stepping off them and onto the cycle paths. There are not too many shops worth talking about here but there is the odd lovely corner bar!"
        }, 
        {
            "index": 131, 
            "rating": "5", 
            "review": "lovely area for walking and restaurants. this is a great area away from the main commercial shopping area. Close to the 9 streets, boutique shopping. Some great restaurants and cafes. friendly and quiet."
        }, 
        {
            "index": 132, 
            "rating": "3", 
            "review": "Just a walk to have an idea about Amsterdam. It is one of the most known canals in Amsterdam. Due to the fact that there are various shops, restaurants and cafés around it many tourists, choose to have a walk next to it. Overall it was not something special but provided an idea about what Amsterdam wants to show that is."
        }, 
        {
            "index": 133, 
            "rating": "5", 
            "review": "Beer Heaven. The Arendts Nest is one of Amsterdams premier beer bars. It has 30+ beers that are brewed in Holland only . This is the only bar in Amsterdam to have only Dutch beers. It is also the start of a four bar pub crawl which if you complete in a day you get a free t-shirt. .We did it with ease and all four bars were superb , really top top pubs!"
        }, 
        {
            "index": 134, 
            "rating": "4", 
            "review": "A lovely walk, with great places to eat and drink. We walked a lot along the banks of this canal, and enjoyed the Arandsnest pub , and a superb meal at Brasserie Ambassade, both of which are on Herengracht. But it is beautiful to admire the Dutch architecture from years gone by."
        }, 
        {
            "index": 135, 
            "rating": "5", 
            "review": "Herengracht one of the main canals in Amsterdam. CANALS OF AMSTERDAM – DE AMSTERDAMSE GRACHTENAmsterdam, the capital of the Netherlands, has more than one hundred kilometres of canals, about 90 islands and 1500 bridges. The three main canals, Herengracht, Prinsengracht and Keizersgracht, dug in the 17th century during the Dutch Golden Age, from concentric belts around the City, known as the Grachtengordel. Alongside the main canals are 1550 monumental buildings. Some other beautiful canals are, Singel, Zwanenburgwal, Brouwersgracht & Kloveniersburgwal."
        }, 
        {
            "index": 136, 
            "rating": "5", 
            "review": "Wonderful mansions all along this canal. Magnificent mansion houses along this canal, old merchant houses.Fine houseboats moored either side. Great views on the canal cruise boats"
        }, 
        {
            "index": 137, 
            "rating": "4", 
            "review": "Nice area. The 9-straatjes area is very nice and has many interesting little shops which turn this area in a sweet discovery."
        }, 
        {
            "index": 138, 
            "rating": "5", 
            "review": "Great city walk.. breathe it all in. Herengracht is a great site to take in on your city walk. You are surrounded by water, the history of the city, and the modern dynamic ans diverse workforce running to and from meetings. When visiting you not only seem to enjoy their busy-ness in slow motion, but you also have a great opportunity to take great pictures of the canals of Amsterdam, enjoy the architecture and there a dozens of small, affordable, good cafes and restaurants available around the Rembrandt Plein."
        }, 
        {
            "index": 139, 
            "rating": "5", 
            "review": "Herengracht. The Herengracht is considered to be the most important canal in the city. In the 17th century, the richest merchants and the most influential regents and mayors of the city lived on this canal. Even today an adress on the Herengracht is seen as prestigeous and chique."
        }, 
        {
            "index": 140, 
            "rating": "5", 
            "review": "great location. Many boutiques, beautiful canal area, near bustling flower market. Elegant area- many good restaurants."
        }, 
        {
            "index": 141, 
            "rating": "5", 
            "review": "Convenient. We popped in for a late lunch, not realising how popular the place is for locals...no wonder, good food, good service and good price."
        }, 
        {
            "index": 142, 
            "rating": "5", 
            "review": "PLEASANT AND WELL SITUATED. right in the heart of Amsterdam\nvery clean and comfortable\nfriendly and helpful staff\ngood coffee and good food\na good meeting place for business and friends"
        }, 
        {
            "index": 143, 
            "rating": "4", 
            "review": "Great Place to See from the Canal Boat Tour. Great place to see from the canal sightseeing boat tour. Beautiful old Dutch styled buildings and bridges."
        }, 
        {
            "index": 144, 
            "rating": "4", 
            "review": "Canalboat sightseeing. Went with a sightseeing boat around the canals. This was one of the area we went by. Did also walk there a couple of times during the stay. Nice place."
        }, 
        {
            "index": 145, 
            "rating": "5", 
            "review": "Walking zen. I love this area. It gives opportunity to walk alongside canal, beatiful buildings on both side, Bridges. You can sit dow for a coffee or quick lunch."
        }, 
        {
            "index": 146, 
            "rating": "4", 
            "review": "boat along. Herengracht is one of the main historic canals of Amsterdam . Best seen by boat as are all the canals . Don't take the big tourist boats. hire your own electric boat , don't take a pedalo its a long way.. With your own boat you can tie up next to a café and get a snack or bear"
        }, 
        {
            "index": 147, 
            "rating": "4", 
            "review": "great for a long walk, great winding street with beautiful canal. the herengracht is a long and winding street, extra beautiful because of the canal in the middle and the great houses. Unesco site !"
        }, 
        {
            "index": 148, 
            "rating": "5", 
            "review": "Lovely area.. Spent the day walking along the Herengracht canal. Some lovely bars and restaurants in this area. A lot quieter than the other side of Amsterdam central. Lots of little cafes you can sit outside and watch the world go by. Worth a visit."
        }, 
        {
            "index": 149, 
            "rating": "5", 
            "review": "Fantastic area. We stayed in a hotel on the herengracht, the nine streets area.\nIt's a very good location , central to most of the sights.\nWe walked along this canal with its many bridges & tour boats passing by .\nVery nice."
        }, 
        {
            "index": 150, 
            "rating": "5", 
            "review": "A walk with lovely, delightful views. The Herengracht is one road that runs an entire canal length, I would recommend one of the boat trips that picks out some of the history, this is what we did. They inform you as to why the buildings lean forward or are wonky (we still find it amazing that they are still standing), with many bridges to cross, lovely architecture to see, many cafes to sit outside & enjoy watching the local life. Just watch out for cyclists!"
        }, 
        {
            "index": 151, 
            "rating": "4", 
            "review": "Boat trip. One of the main canals of Amsterdam.The streets that follow its banks has also the same name.Old buildings,old bridges,thousands of bycicles.A good way to admire all of them is a boat trip on the canal.Or you can just stroll alongside it..."
        }, 
        {
            "index": 152, 
            "rating": "4", 
            "review": "Very pretty part of Amsterdam. I have spent a whole day in Herengracht, such a nice part of the city with cafes, museums and galleries and shops."
        }, 
        {
            "index": 153, 
            "rating": "4", 
            "review": "Lively walking. As with most of the canals this place provides a peaceful place to stroll on a sunny afternoon. Generally few cars, but plenty of bikes to avoid."
        }, 
        {
            "index": 154, 
            "rating": "5", 
            "review": "Stayed in this neighbourhood. We parked our car outside Amsterdam and took the train to central station. It was an easy walk with luggage to Herengracht. Many restaurants to choose from as well as supermarkets. We took the canal boat ride near here and was very close to Anne Frank House etc. Great area to stay and visit."
        }, 
        {
            "index": 155, 
            "rating": "5", 
            "review": "great place to walk. On a cold winter's day pouring with rain, it was perhaps not at its best, nevertheless, you can't help but admire the architecture"
        }, 
        {
            "index": 156, 
            "rating": "4", 
            "review": "take a canal tour to explore that. Prinsengracht, Keisersgract and Herengracht are 3 of the main canals in Amsterdam. I would take a free canal tour leaving at Central Station, if you will purchase I Amsterdam card to see all 3. They all have nice houses around but the nicest is Keisersgracht. (Having the Greenswood restaurant we visited 2 times on a 3 day tour)"
        }, 
        {
            "index": 157, 
            "rating": "5", 
            "review": "Wonderful wandering. Spent happy hours strolling along the canal looking at the canal houses., stopping along the way at a cafe or dipping down one of the radial streets for some shopping."
        }, 
        {
            "index": 158, 
            "rating": "4", 
            "review": "The Gentlemen's Canal!. One of the nicest canals to walk along in Amsterdam - there are some spectacular buildings along this canal. The previously grand old residences of the wealthiest families in Amsterdam, and the beautiful Waldorf Astoria hotel really have a significant presence in this area. The best way to see this is actually by walking along the loop, rather than taking a canal boat. Take a long walk around to truly experience the canal and its fabulous architecture."
        }, 
        {
            "index": 159, 
            "rating": "5", 
            "review": "lovely little part of the city. Excellent walk , various shops along the way , nice hotels to stay it , only a short walk to the city centre. A pleasant way to spend an hour walking besides the canal."
        }, 
        {
            "index": 160, 
            "rating": "5", 
            "review": "make sure you have time to walk the canals.. For us Amsterdam is about strolling along the canals and enjoying the sights. There is so much architecture on both sides and life on the canal. Even on bitterly cold days in January this is a treat and we always find a 'brown bar/cafe' to warm up."
        }, 
        {
            "index": 161, 
            "rating": "5", 
            "review": "beautiful city. very much enjoyed as a family, but suitable for everyone so much to do and see, the shopping is amazing, the nightlife suits everyone from first class cuisine, to steak houses, to McDonalds, it has something for all, the city is very clean, beware of bike traffic,,,you do have to have your wits about you when crossing the roads, amazing variety of hotels to choose from, and the P&O ferry travel was excellent"
        }, 
        {
            "index": 162, 
            "rating": "4", 
            "review": "Beautiful...... Just love walking in Amsterdam Herengracht is one of the most interesting all the little shops in the Jordan along the way...must do"
        }, 
        {
            "index": 163, 
            "rating": "5", 
            "review": "beautiful architecture, best Dutch beer bar.. Herengracht is a beautiful street in a wonderful area that has a great nightlife scene with the best Dutch beer bar.We alway's make a couple of trip's to ARENDSNEST on Herengracht and it's made even better by the superb architecture, the building's both sides of the canal's look amazing as do the canal's and bridges. Go of a night and it looks truely fabulous, there are some cool bar's,cafes and restaurants to enjoy while strolling arounnd this area.We were here in January and one night it snowed and everywhere looked amazing,especially the canal's,just magical. A great street, a wonderful area and well worth checking out."
        }, 
        {
            "index": 164, 
            "rating": "5", 
            "review": "Day or Night. Day or night the canals are a real treat. enjoyed walking the streets and taking in the surroundings."
        }, 
        {
            "index": 165, 
            "rating": "5", 
            "review": "Old, yet fascinating.. I have known this area for so long but never really explored it. I read somewhere that Herengracht is considered as the most important canal in Amsterdam. The reason being, many important businessmen and mayors of the city had lived here in the 17th century. On a Christmas day, I felt so bored and decided to get out of my cozy nest. It was a cold day but I guess Amsterdam never ceases to surprise me. What fascinated me most is the houses/ buildings at the canal. Depending on the shape or design of the gable, you can predict the year when the house/ building was built. I learned something new again that day. Some of the buildings have interesting stories. For example, the House of Bartolotti on Herengracht 168-170. The name does not sound Dutch at all. It's Italian. Well, the house was an inheritance from a successful merchant of Bologna for his Dutch nephew (who later adopted his uncle's family name).Or take the house on Herengracht 81. The physical appearance isn't as \"stylish\" as the Bartolotti house. But there is a story for that too. The house is the oldest building where people used to live in (Dutch: woonhuis). It was built in 1590. It was used by a merchant family. The lower floor was used as dwelling area. The upper floor functioned as a warehouse. These two houses are just a couple of examples of the many interesting canal houses in Herengracht.There were many bars/ cafes around the canal. So, don't worry if you feel tired or hungry from all the walking. If you take a walk in winter time (as I did), bear in mind that the day is quite short. That day the sun set at around 4 pm. There was no sun during the whole day."
        }, 
        {
            "index": 166, 
            "rating": "5", 
            "review": "Canals. Fabulous route to walk through from shopping to coffee shops. Looks better from the boats on a canal trip."
        }, 
        {
            "index": 167, 
            "rating": "5", 
            "review": "what a place. perfect street to see the real Amsterdam rain sleet or snow this is real Amsterdam catch a ferry to take you all the way around the city by water way and it is free!"
        }, 
        {
            "index": 168, 
            "rating": "4", 
            "review": "One of many in Amsterdam. The city of Amsterdam is laced with canals that radiate outward in semi-circles. The Herengracht is one of these canals. It offers some remarkable architecture that date back from the Golden Age when merchants display their wealth by commissioning the building of luscious housing. The more wealthy the merchant, the more extensive the outside ornaments and architecture."
        }, 
        {
            "index": 169, 
            "rating": "5", 
            "review": "Old Amsterdam. Very Serene away from the crowd with some interesting shops and restaurants...I would recommend a nice walk in the evening after dinner."
        }, 
        {
            "index": 170, 
            "rating": "4", 
            "review": "walk along the canal. in Amsterdam is a light festival. Over the canals light sculptures are suspended, giving a fairytale appearance"
        }, 
        {
            "index": 171, 
            "rating": "4", 
            "review": "beautiful canal of 9 streets. This is one of the beautiful \"U\"canals that is well worth walking along the whole thing if exploring the city. Will walk past the nine streets of Jordaan also which is lovely in itself! Stop off to see the boutique shops."
        }, 
        {
            "index": 172, 
            "rating": "4", 
            "review": "good for a walk. We preferred Prinsengracht, but this is another street round a canal that is great for walking and exploring."
        }, 
        {
            "index": 173, 
            "rating": "5", 
            "review": "great canal. this is also a great canal from amsterdam, big and with great buildings with a lot of charm. Very nice bridges...a must in the city"
        }, 
        {
            "index": 174, 
            "rating": "5", 
            "review": "Beautiful canal to wander along. This is such a lovely walk along this beautiful canal. Lovely architecture and ambience. So many interesting boats and the light display was great too."
        }, 
        {
            "index": 175, 
            "rating": "4", 
            "review": "Just as lovely as any of the inner ring canals. Harengracht is a delightful canal to walk along or to visit with one of the many canal cruises available in Amsterdam. Lovely also to stop at any of the cafes and watch the world go by. If you are into Design the Handbags and Purses Museum is a great little place to visit too!"
        }, 
        {
            "index": 176, 
            "rating": "4", 
            "review": "If you go to Amsterdam you need to visit the canals!. If you are in Amsterdam, you need to see the little bridges and the canals. You can do it by boat or bike, or just walking around the city. The Herengracht is a canal with a lot of old building to see."
        }, 
        {
            "index": 177, 
            "rating": "5", 
            "review": "Very pleasing to the eye. Herrengracht (or the Gentlemen's Canal) has some of the most imposing houses on its side. There is a special area called the Golden Bend to its south section near to the Amstel which ought not to be missed."
        }, 
        {
            "index": 178, 
            "rating": "5", 
            "review": "Beautiful. Gorgeous area even in mid December. Canals are awesome. Really festive of an evening all lit up with Christmas lights. Felt very safe walking around late at night. Plenty nice places to sit for a drink or something to eat."
        }, 
        {
            "index": 179, 
            "rating": "5", 
            "review": "Hip lounge type setting for drink and food. Had a few good beers here and small snacks. Seems popular with young and some older patrons. Great atmosphere and attentive wait staff. I'd been here about 5 years prior and not much had changed...which was good. Has some nice outdoor tables if the weather permits by the canal."
        }, 
        {
            "index": 180, 
            "rating": "5", 
            "review": "wicked place. done the light festival by boat around all the canals it was a stunning trip, all the lights was constructed by artists.\ntrip lasted 1hour 30 mins for 17.50 euros great value"
        }, 
        {
            "index": 181, 
            "rating": "5", 
            "review": "Beautiful water! . The canals are definitely something to investigate, so many various canals going in various directions but herengracht was by far my favourite."
        }, 
        {
            "index": 182, 
            "rating": "5", 
            "review": "All times of the day this canal is worth a trip.. From your boat, bike or feet the canal is worth a proper look. At day time when the sun light and shades play their game but preferably at night time when the Dutch lighten their houses and you can look into their rooms, since the Dutch hardly use blinds or curtains. Enjoy the look of their furniture, their art against the walls, the either plastered or wooden beamed ceilings, ... and get eventually envious."
        }, 
        {
            "index": 183, 
            "rating": "5", 
            "review": "Lovely no matter where you are on the Canal. Every time I visit I end up walking this canal all the time. Mostly because I stay on the next canal south. It's beautiful to stroll along. The houses range from lovely and old to striking and new. You'll find many cafes and shops along it's length. Mostly on the corners. House boats all over the place and lots of things to see."
        }, 
        {
            "index": 184, 
            "rating": "4", 
            "review": "Man (Men) Canal... you have to love that, except that (to my knowledge) there is no Damesgracht (Ladies Canal). Herengracht is a beautiful canal/street in an upscale area of Amsterdam...Think Waldorf Astoria Hotel address. While we were there, an unusual Christmas light show was installed over one section of the canal, which was unique in the installation (across the canal). We could not figure out how it was installed or the (power) source of the illumination (decided it must be chemical), but it was awesome and indicative of 'free treats' along the canal.You can visit the Bag and Purse Museum there, (we did not go), but the best Museum is the Canal House Museum, which we highly recommend."
        }, 
        {
            "index": 185, 
            "rating": "5", 
            "review": "Break out your camera. This is the most picturesque photo opp, or at least one of in the city. To really expereince this area and all the canals you need to get on the water. Recommend to book a tour."
        }, 
        {
            "index": 186, 
            "rating": "5", 
            "review": "The most beautiful canal. Had the pleasure of staying at The Hoxton Hotel right on Heregracht. This is by far the most beautiful canal in Amsterdam with loads of delicious restaurants, quaint shops, and peaceful spots. Highly recommend strolling up down this beauty, snapping pictures, and relaxing."
        }, 
        {
            "index": 187, 
            "rating": "5", 
            "review": "Stunning, mesmerizing, riveting canal walk. A walk or a boat trip in this canal represents the idyllic typical Amsterdam image: beautiful preserved gabled old houses lined with a string of trees and the canals. The bridges are also appealing and you will find lots of cafes and eateries in the way, so it is a good idea to start having breakfast at one of these side canal cafes. A must walk in Amsterdam!"
        }, 
        {
            "index": 188, 
            "rating": "5", 
            "review": "Lovey and stunning. Covered this whilst walking round the city following the Amstel walk route in our guide book. Excellent views of the various canals and lots to see and plenty cafes to choose from. Whilst wandering about."
        }, 
        {
            "index": 189, 
            "rating": "5", 
            "review": "My Favourite Breakfast Spot!. This is one if the nicest morning spots in Amsterdam where you get to enjoy breakfast on such an amazing view and feed the birds right before you start your shopping tour at the flowers market .. it's a very busy spot, so you might need some time to find an available spot."
        }, 
        {
            "index": 190, 
            "rating": "5", 
            "review": "One of four beautiful canal. It is hard to say which canal is more beautiful, I like them all. I used hop on hop off canal bus ( it is a boat) for a day.For me and my wife I paid €54.It passes most of important sightseeing and you can leave the boat , see for example Anne Frank house and get the boat again to continue.  About Herengracht, we passed by boat and one night we walked along a part of it.I love Amsterdam for these canals.Next time try to get B&B beside a canal."
        }, 
        {
            "index": 191, 
            "rating": "5", 
            "review": "Herengracht. Stayed on the herengracht during 3day visit. Beautiful tree lined canal with amazing houses along the way. Pure Amsterdam experience. Quiet and respectful area. Very nice"
        }, 
        {
            "index": 192, 
            "rating": "4", 
            "review": "nice day stroll. You can head for the flower market, then botanical garden, then zoo, and park after the zoo. That should keep you well entertained for a day if your a walker."
        }, 
        {
            "index": 193, 
            "rating": "5", 
            "review": "Be transported back into the Amsterdam's Golden Age. A stroll - or boat trip - along the concentric canals in the 'Grachtengordel' (Canal Ring) is a must, and few of them are grander than the Herengracht. Many of the impressive, often gabled, houses now contain bars, restaurants and upmarket hotels, a far cry from when they were built by the richest merchants in the world's then richest city."
        }, 
        {
            "index": 194, 
            "rating": "4", 
            "review": "picture perfect. A beautiful spot for a picture of your typical Amsterdam scene.\nOne of the larger canals.\nYou'll probably just stroll by it."
        }, 
        {
            "index": 195, 
            "rating": "5", 
            "review": "Pretty and Convenient. The Herengracht is one of the major canals. It is easy to access streets with trams from this canal and many restaurants are located adjacent to and near this canal."
        }, 
        {
            "index": 196, 
            "rating": "5", 
            "review": "Locks on the bridges. It seems a ttoken of love or recognition, folks attach locks to the bridges....I saved doing that till my next trip as though I needed a reason to return. One of the best places on earth. And I'm a world traveler..."
        }, 
        {
            "index": 197, 
            "rating": "4", 
            "review": "Pretty. Although most boat trips take in some parts of the Herengracht, my preference would be to walk it. If you're walking in the day, maybe start with the specialist shopping of Haarlemmerdijk (close to Central Station) first. Or deviate from the canal to find The Nine Streets with their oddball shops and boutiques.The canal-side architecture is fabulous, the bridges appealing and there are plenty of places along the way to eat or drink something. As the canal is tree lined, the autumn colours made the walk even more inspirational. Just watch out for the mad cyclists. They take no prisoners!"
        }, 
        {
            "index": 198, 
            "rating": "5", 
            "review": "Go strolling day or night. The Herengracht take your time strolling is the best speed to take it all in autumn golds a still canal every view is wonderful ,take your time and take it all in ."
        }, 
        {
            "index": 199, 
            "rating": "4", 
            "review": "very nice. One of the most beautiful areas in old town..a must walk by...Autumn the best season to go, to be able to enjoy colours..."
        }, 
        {
            "index": 200, 
            "rating": "5", 
            "review": "my favourite. i left a locket therei want to live thereviews are awesomeeven when its rainningit might be even betterits cleanbrick streets are beautiful"
        }, 
        {
            "index": 201, 
            "rating": "5", 
            "review": "The best canal of them all. The Herengracht was really the upscale canal of Amsterdam were the riches of the riches build their huge mansions. And you can still see this. It is also the largest canal and brings you all the way from the Haarlemmerstraat (THE best shopping street) to the Amstel. You go straight through the heart of the Jordaan and pass the Spiegelstraat, loaded with antique stores. On of best strolls through the center of Amsterdam"
        }, 
        {
            "index": 202, 
            "rating": "4", 
            "review": "Herengracht 9 street. In the 9 streets area in one part of this street you can find a bit of everything - from super nice second hand stores to Amsterdam hat-filled souvenir shops. The area around Herengracht 9 streets is cute and cozy, and though it is a bit touristy its an area definitely worth walking through."
        }, 
        {
            "index": 203, 
            "rating": "5", 
            "review": "Great 17th Century Canal!. The largest canal buildings are on this semicircular canal. Buildings date back as far as the early 1600's. Spectacular views, bridges, gables etc."
        }, 
        {
            "index": 204, 
            "rating": "5", 
            "review": "Peace and Quiet. We stayed at the Hoxton Hotel. This canal is the perfect location to walk to all the attractions Amsterdam has to offer. There are lots of restaurants in every direction to choose from. It was nice to walk back to the hotel away from the crowds and noise."
        }, 
        {
            "index": 205, 
            "rating": "5", 
            "review": "Ideal location to stay. We stayed at the Max Brown Hotel, not far from the station, within walking distance. The canal is quiet it's mainly a residential area but with plenty of places to eat and drink. If you follow the canal to the end you can visit so many places en route."
        }, 
        {
            "index": 206, 
            "rating": "5", 
            "review": "Walk this and the Emperor's and Prinsengracht. These are the 3 main canals in Amsterdam. They are all slightly different in look and function at the time they were built. Make sure you get a guide to explain. Best to see by boat, too."
        }, 
        {
            "index": 207, 
            "rating": "5", 
            "review": "Quiet canal. Beautiful, quiet canal, though one of the main ones, our hotel was situated on it and we were delighted. So easy to walk to the side streets with the quirky shops and boutiques and esy to make your way to the sites of Amsterdam(eg dam square, anne frank house etc) watch out for cyclists!!"
        }, 
        {
            "index": 208, 
            "rating": "4", 
            "review": "another canal. the usual beautiful for photos nothing more especial than other canals after some time you feel all canals looks the same"
        }, 
        {
            "index": 209, 
            "rating": "5", 
            "review": "One of the ring canals. It's very instagram worthy. If you're lucky enough, you might even see it during spring or summer, when flowers are everywhere and when you just wish you live here."
        }, 
        {
            "index": 210, 
            "rating": "5", 
            "review": "Spectacular view. You can't forget to walk several times here, with different light of the day: cloudy, sunny or by night. Simply spectacular views"
        }, 
        {
            "index": 211, 
            "rating": "4", 
            "review": "Very beautiful. Its not really the best in our view, but its still beautiful. You can take so many pictures here. Its very nice to walk around or just sit to enjoy the beautiful view."
        }, 
        {
            "index": 212, 
            "rating": "3", 
            "review": "Makes for a nice stroll. I was able to stay with a resident on this canal thanks to couchsurfing.com. The canal is beautiful like all the other canals in Amsterdam. I wouldn't go out of my way to see it because nothing cries out, \"exceptional\". Exceptional events are sometimes held on or around Herengracht which makes it significant yet beyond that it is an average canal."
        }, 
        {
            "index": 213, 
            "rating": "5", 
            "review": "Pleasant Walking. A lovely canal going all around the city we stayed on it at THE HOXTON and it made for a good reference to return to our base also the NINE STREETS are on it lovely for getting around without having to go through DAM SQ"
        }, 
        {
            "index": 214, 
            "rating": "4", 
            "review": "Autumnal Colouring. Not our favourite of all the canals but nevertheless a nice canal to walk along and for us in October the autumnal Colouring of the trees enhanced the experience."
        }, 
        {
            "index": 215, 
            "rating": "5", 
            "review": "Trendy area. Great bars and restaurants direct on the canal. Long street dotted with huge selection of places to eat"
        }, 
        {
            "index": 216, 
            "rating": "4", 
            "review": "Beautiful scenery. Enjoyed walking along this canal. It was very picturesque. The houses were beautiful and the flowers were still in bloom overhanging into the canal."
        }, 
        {
            "index": 217, 
            "rating": "3", 
            "review": "Pretty Canal. Herengracht seems easier on the eye than the other canals and I don't honestly know why! May be it is because the buildings and houses are more decorative and the area was quieter than Prinsengracht when we visited. The canal is nearer the city centre than Prinsengracht and Keizergracht if you don't want to walk too far."
        }, 
        {
            "index": 218, 
            "rating": "5", 
            "review": "Love this canal!. I really enjoyed walking around this canal. We saw locks on a bridge the first day we were there and we decided to come back but we could not remember where we had seen the bridge. On our last day in Amsterdam we walked up and down this canal until we found our bridge and locked our love on it and threw the key in the canal. Very pretty area!"
        }, 
        {
            "index": 219, 
            "rating": "5", 
            "review": "Realluy great.. Along with the Pinzengracht and the Kaisergracht it is part os the main set of canals which you have to visit. Look around and go shopping and visit the nice stores there are around."
        }, 
        {
            "index": 220, 
            "rating": "5", 
            "review": "Love It. we love Herengracht - its a peaceful and pretty street with gorgeous buildings along a canal but mostly we love it for Amnesia coffee shop"
        }, 
        {
            "index": 221, 
            "rating": "4", 
            "review": "Nice strolling avenue. Beautiful canal street,some nice shopping and some peaceful walking.streets are always great for people watching and window shopping"
        }, 
        {
            "index": 222, 
            "rating": "5", 
            "review": "Picturesque. Herengracht is quite a busy waterway as it is on the Hop on Hop off Canal bus route. I quite enjoyed seeing it from the water."
        }, 
        {
            "index": 223, 
            "rating": "5", 
            "review": "According to the locals: most beautiful canal. If you can do only one canal: take the Gentleman's Canal. The walk from the Brouwersgracht to the Amstel is 60-90 minutes and showcases the most beautiful canal houses."
        }, 
        {
            "index": 224, 
            "rating": "4", 
            "review": "Must see. Beautiful piece of Amsterdam. When I am in Amsterdam I sometimes go there at dusk to take pictures of the canal while it reflects the colours of sunset."
        }, 
        {
            "index": 225, 
            "rating": "5", 
            "review": "The best. Our hotel was there, the canals, the bridges and the stores are very nice. it is nice to just walk around. if you found a hotel in that area, know that you are close to everything there is to do"
        }, 
        {
            "index": 226, 
            "rating": "4", 
            "review": "Residental and Homey. It's a nice canal. On balance, it feels very work-a-day and by this I mean that you are very aware that folks live here. At one point we were called off for not getting out of the way of the cyclists quickly enough. In honesty, we didn't find that super easy to do because it is so narrow, but I get their point -- share the road. Since I was looking over my shoulder so fully to stay away from the bikes or down to my feet to make sure I wasn't running into a bag on the sidewalk, I can't say I saw much. If it's your shortest point from A to B, go for it. If not, there is a bit more room to maneuver on the Keisergracht."
        }, 
        {
            "index": 227, 
            "rating": "4", 
            "review": "Glide down former opulence. When you take a boat trip down the Herengracht you are reminded of the splendour and opulence that once flourished here. You can conjure up images of wealthy merchants living with their families in what were splendid homes. Worth the trip."
        }, 
        {
            "index": 228, 
            "rating": "4", 
            "review": "so pretty. The most beautiful areas of Amsterdam occur around the canals and bridges,We got some fantastic photograph of the sunset bouncing off the top of the waters.Lots of bars and cafes to sit and chill.Great atmosphere and feels very safe.We spent hours sitting and watching all the canal boats going past."
        }, 
        {
            "index": 229, 
            "rating": "5", 
            "review": "Go for a stroll along the canals.. Our hotel was in the Herengracht so we spent a bit of time in this area. Picturesque canals follow one after another. A beautiful place for a stroll or to take photographs of a lovely side of Amsterdam.Recommended."
        }, 
        {
            "index": 230, 
            "rating": "5", 
            "review": "Lovely houses. If you like to take a lot of nice photos this is the place, combine the river with the houses and the bikes and you have a great time!"
        }, 
        {
            "index": 231, 
            "rating": "5", 
            "review": "Take in the View From the Canals, Even in Rainy Weather. We were fortunate to take a guided canal cruise while in Amsterdam and would highly recommend it. It is a good option to enjoy the beauty and history of the canals and get an overview of the city. Most of the boats are covered and we had an interesting tour, despite the rain."
        }, 
        {
            "index": 232, 
            "rating": "5", 
            "review": "The Gentlemans Canal. We were very lucky to find a Canal House on Herengracht to stay in for 5 nights ...convenient to everything and a beautiful area to stay. Boats, bikes and plenty of places to visit and dine!! Loved Herengracht, loved Amsterdam.!!!"
        }, 
        {
            "index": 233, 
            "rating": "5", 
            "review": "Peace and calm in Amsterdam. Wonderful to walk along, lots of beautiful buildings and fascinating side streets to distract you! I stayed in the Ambassade Hotel on the Herengracht - highly recommended."
        }, 
        {
            "index": 234, 
            "rating": "5", 
            "review": "tax was paid by the size of entrance door,herengracht has many very bif doors. the most beautiful canal from amsterdam, where the super rich of the 1600-1700 lived\nin that time tax was paid for the size of the entrance door and the herengracht has many very\nvery big doors. To walk , by bike and also by rondvaartboat"
        }, 
        {
            "index": 235, 
            "rating": "3", 
            "review": "I disappointment at Anne Frank Haus. We had tickets which we booked on line 3 months earlier. When we arrived, there were at least 100 people standing in line outside the building waiting for tickets. While we were inside some of those people were allowed in. Before long, the house was so crowded we couldn't get close to the displays. There were too many people in each room. It ruined our experience"
        }, 
        {
            "index": 236, 
            "rating": "4", 
            "review": "A talk . A very nice walk if the weather is ok. U can also talk a boat. A romantic one too.We really enjoyed it in sept although it was a bit cold"
        }, 
        {
            "index": 237, 
            "rating": "4", 
            "review": "The Canals of Amsterdam. Canals are definitely an iconic part of Amsterdam. You can walk along them and admire the scenery or take some photographs. Another very popular choice is to take a canal boat tour which is also a nice experience."
        }, 
        {
            "index": 238, 
            "rating": "5", 
            "review": "Get your comfy shoes on. We acquired a local map and waked as many of the canal sides we could manage. It isn't just the water and boats there are plenty of beautiful houses/flats you can see along the way"
        }, 
        {
            "index": 239, 
            "rating": "5", 
            "review": "Our favorite Canal. Walking up and down the Canal - its one of the most beautiful. Very clean, few shops, mostly a residential feel."
        }, 
        {
            "index": 240, 
            "rating": "4", 
            "review": "Canal walk. Lovely to stroll around the canals again with friends, and appreciate the beautiful city we live in."
        }, 
        {
            "index": 241, 
            "rating": "5", 
            "review": "Beautiful but.. . It's very romantic place for a couple.\nBut If you never visit Amsterdam, you don't need to \"mark\" this place.\nThere is a 50,000 bridges in Amsterdam.. You gonna see one every 500 meters.. So, it's romantic but you have a lot of that."
        }, 
        {
            "index": 242, 
            "rating": "5", 
            "review": "Best part of A'dam - canals. The canal tour by boat is the best attraction in A'dam. We liked it so much, that took two boat tours with different companies and routes. This canal boasts amazing views of A'dam's upscale housing and intricate ironwork on the bridges."
        }, 
        {
            "index": 243, 
            "rating": "4", 
            "review": "Nice canal. Beautiful canal , lovely to visit and great photos . Like Keizergracht & Princengracht , the canals have great character and worth a visit - they are similar to each other but nearby so worth a stroll to each if you can."
        }, 
        {
            "index": 244, 
            "rating": "5", 
            "review": "Justifiably famous. Every bit as visually enjoyable as I recalled it from 50 years ago. Walking along here was a real pleasure, especially watching all the water-bourne passers-by."
        }, 
        {
            "index": 245, 
            "rating": "4", 
            "review": "Nice quieter, main canal. Quieter main canal with lots of superb private houses and also pubs, restaurants and trendy shops. Explore on foot or by boat"
        }, 
        {
            "index": 246, 
            "rating": "4", 
            "review": "Prestigiuos canal. One of the most important canals in A'dam. The mayor lives here.Important governors used to live here, the importance being shown by the width of their house (compare: Herengracht 532 houses, to Prinsengracht 1131 e.g.) There are 423 monuments here. Plan has been designed from 1613 onwards, by the mayor of A'dam (Mr. Oetgens and his city-carpenter, Mr Staets). The first city plan in the world at the time."
        }, 
        {
            "index": 247, 
            "rating": "5", 
            "review": "One of the beautiful canals in Amsterdam, close to museums. Stayed at the Ambassade Hotel which is located along the Herengracht Canal. Boats cruise on this canal all day long, a beautiful site to see."
        }, 
        {
            "index": 248, 
            "rating": "5", 
            "review": "Sun lit canal walks.. Fabulous area of the city. Beautiful views, and lovely walk. Even at night it feels safe and you can roam easily."
        }, 
        {
            "index": 249, 
            "rating": "4", 
            "review": "beautuful canal. the houses on both sides of this canal are the most beautiful. you can also visit some of the houses and see what it looked like when people lived there with very nice gardens."
        }, 
        {
            "index": 250, 
            "rating": "4", 
            "review": "One of Amsterdam's special canals. Another one of Amsterdam's beautiful canals - see it on foot, on bike, or by boat. And make sure to find a cafe, sit on the terrace, and watch the world go by."
        }, 
        {
            "index": 251, 
            "rating": "5", 
            "review": "amazing and quiet canal. An amazing and quiet canal to walk. It has some different shops and nice bars\nDon't miss day or night"
        }, 
        {
            "index": 252, 
            "rating": "4", 
            "review": "A lovely scenic walk by day or night. This is one of the most beautiful canals by day and especially by night. It is lined with a variety of architecturally interested buildings and comparing the differences between the roof gables is fascinating."
        }, 
        {
            "index": 253, 
            "rating": "5", 
            "review": "Our home canal. (for 48 hours). Walking along the Herengracht Canal is a waterman and old house lover's delight, especially on an early August Sunday morning when one is nearly alone with the atmosphere."
        }, 
        {
            "index": 254, 
            "rating": "5", 
            "review": "Beautiful Street/Canal in a beautiful Neighboorhood!. The Herengracht Canal and the Streets along side is the most beautiful of all the Canals in Amsterdam, and also the most expensive, residentially. Homes beautifully maintained and a feast for the eyes. Wish we could have seen it lit up at night, but sunset wasn't until 9:50 pm during our August visit and we were too tired from our very full days to stay out that late, being in our late '70's. But younger decades will absolutely enjoy the warm nights and lights."
        }, 
        {
            "index": 255, 
            "rating": "5", 
            "review": "By foot or by boat, there's a romance to this canal. So my husband and I did the lovers canal cruise that sails along Prisengracht, Brouwergracht and Herengracht. All canals are picturesque and a sunset cruise is a fantastic idea. Herengracht canal is the most chique of all three, but we loved the 1 hour cruise tremendously and would do it again."
        }, 
        {
            "index": 256, 
            "rating": "5", 
            "review": "An amazingly beautiful street. Go for a stroll, stop and have a coffee and watch the locals ride by on their bikes. The houses were built in the 17th century and it is interesting to spot those that have developed a bit of a lean to one side. On another day get a boat trip and see the houses from the water and listen to the commentary about the history of some of the houses."
        }, 
        {
            "index": 257, 
            "rating": "4", 
            "review": "Canals are a site to see but nothing special. After visiting Venice, these canals are not really anything special. They are main waterways for people and freight to move about. The canal tours cruise up and down but the boats move so slow that is really much slower to take a boat than walk or hop on the bus."
        }, 
        {
            "index": 258, 
            "rating": "5", 
            "review": "Beauty!. I find it one of the most beautiful canals in amsterdam, the architecture of the residential houses and the bridges makes it a wonder. Best experienced with a boat!"
        }, 
        {
            "index": 259, 
            "rating": "4", 
            "review": "Watching life go by..... A great place to rest and study your maps, have a coffee, and people watch in a VERY Amsterdam setting."
        }, 
        {
            "index": 260, 
            "rating": "5", 
            "review": "15/10 WOW you must eat here - you won't regret it and we challenge you to find better food or service. OMG this was an accidental find. Staff were amazing friendly and went above and beyond. Only wanted a quick refreshment stop but ended up staying for dinner and so glad we did. Had the set meal of 3 courses and have to say that it was the most delicious meal I have ever had and they even happily obliged to take off the beetroot as I have a phobia of the stuff and they didn't batter an eye lid. Chef came out and talked us through the meal, a starter of noodles, white bait and cray fish, followed by the most succulent dish of lamb chops, lamb stew and seasonal vegetables and then the most decedent white chocolate and raspberry cheesecake, the lightest chocolate moose and raspberry sorbet that had me wanting to scrap the plate clean. Will be back for our 10th Anniversary dinner!"
        }, 
        {
            "index": 261, 
            "rating": "5", 
            "review": "Attracting canal with typical beautiful residential houses. One of the four concentric canals in Amsterdam with typical dutch houses, narrow and tall, with different facades and steps. This and Princengracht are the most elegant. Some houses have been transformed in boutique hotels, some in restaurants or shops but it is still a residential area. A nice hour walking will permit to walk the entire gracht and come back to the same starting trough the parallel Pincengracht."
        }, 
        {
            "index": 262, 
            "rating": "4", 
            "review": "Amazing. Again amazing so relaxing to just watch the world go by and take in the wonderful suroundings whilst having a coffee"
        }, 
        {
            "index": 263, 
            "rating": "5", 
            "review": "Beautiful Area. The former Gentlemen's Canal retains its old world elegance. It looks great from a boat, although walking is a good way to go too-as long as you are mindful of the ubiquitous(and sometimes reckless) bicyclists."
        }, 
        {
            "index": 264, 
            "rating": "3", 
            "review": "Get on a boat tour to see it best. The most central of the main canals, once again this is probably best seen by boat tour. Herengracht is closest to things like the Flower market and some of the museums."
        }, 
        {
            "index": 265, 
            "rating": "5", 
            "review": "Great for strolling. Loads to look at places to stop and eat, drink. Nice little shops along the canal side. Watch out for bikes!!!"
        }, 
        {
            "index": 266, 
            "rating": "4", 
            "review": "Stargate. Cool place. We stayed at a hotel that was a conversion of three Amsterdam houses. Perfect location, within 15 minutes walk of the railway station. At the top, closest to our hotel was a blue ring over a canal bridge. Its stargate, really it is. We came fed up to the Dam and found a fantastic, experience."
        }, 
        {
            "index": 267, 
            "rating": "4", 
            "review": "Another pretty canal. Since I stayed in the neighborhood I was wondering a lot in this street. Many bridges over the water and many cafes on the canal and in the streets nearby."
        }, 
        {
            "index": 268, 
            "rating": "5", 
            "review": "Great street. Great food and shopping, and sites on this street. Go to the Herengracht restaurant for dinner or a drink"
        }, 
        {
            "index": 269, 
            "rating": "5", 
            "review": "Lovely!. Another lovely canal. Take a stroll or bike and just soak in the sceneries. Don't forget to take pictures too."
        }, 
        {
            "index": 270, 
            "rating": "5", 
            "review": "A wonderful place . It was in our way from flower market to the museums area , it is wonderful view over the bridge that is decorated with colorful flowers in the corners with the boats passing inside it , we took a lot of nice photos and we enjoyed the view so much , it is realy beautiful"
        }, 
        {
            "index": 271, 
            "rating": "4", 
            "review": "Uniqueness at its best.. Again very different building and streets to look at. So using your eyes to look up and down is a bonus. To be able to see the bridges and canals is worth a visit."
        }, 
        {
            "index": 272, 
            "rating": "5", 
            "review": "This is where the 1% live. The Herengracht has some of the largest and most elegant of the canal houses (homeowners in the old days were taxed based on the width of their houses, which is why there are so many narrow, tall houses in Amsterdam). Many of the canal boat tours spend time on the Herengracht; it's a great way to see it."
        }, 
        {
            "index": 273, 
            "rating": "5", 
            "review": "Architecture, History and canal life. Hotel was on the Herengracht and we walked it everyday. It is a beautiful canal with lots of additional bridges and canals to explore."
        }, 
        {
            "index": 274, 
            "rating": "4", 
            "review": "Splendid. The \"Herengracht\" is supposed to be the most beautiful of all the \"grachten\" of Amsterdam. Indeed you can spot here some beautiful mansions. The \"Gouden Bocht (\"Golden Bend\") between Leidsestraat and Vijzelstraat, is the most prestigious part of this \"gracht\"."
        }, 
        {
            "index": 275, 
            "rating": "4", 
            "review": "A beautiful canal in the old area of Amsterdam. A beautiful canal in the old area of Amsterdam. Lots of lovely residential and commercial establishments nearby."
        }, 
        {
            "index": 276, 
            "rating": "2", 
            "review": "Was really disappointed. Was really disappointed when I went to have drinks at the bar at De Hernengracht. According to Dutch law, restaurants and bars are now non-smoking. Yet customers were smoking at De Herengracht and the staff was providing them with ashtrays. This to my knowledge, is against the current Dutch non-smoking law. When I pointed it out to the staff, I was rudely told that De Herengracht had decided to disregard the law. If you're looking for a nice smoke-free evening, avoid De Herengracht"
        }, 
        {
            "index": 277, 
            "rating": "5", 
            "review": "a must on the canals. this is also an area you must explore beeing in Amsterdam , it gives you so much back , just enjoy and experience the life og amsterdam"
        }, 
        {
            "index": 278, 
            "rating": "5", 
            "review": "The oldest and the most important canal of Amsterdam, and just as beautiful as others. It is considered to be one of the oldest canals of Amsterdam. It is still very important as it serves the purpose of commercial communication through the canal, tourist rides, etc. From the 17th century the area was used for settlement by the rich, the wealthy and the most important people of Amsterdam. The settlement here is still considered as prestigious. The canal is well maintained and is beautified with colorful flowers. It was lovely taking snaps here, just walking beside the canal aimlessly, taking a ride in the water, or just having food beside the canal in one of the many eateries beside it. There are multiple other shops here and tourist information centers as well. The place is very crowded and touristy for all these reasons."
        }, 
        {
            "index": 279, 
            "rating": "5", 
            "review": "beautiful. It was so prety walking this canals. All the canals of Amsterdam, but especially this one. The houses by the side ar e so pretty and elegant."
        }, 
        {
            "index": 280, 
            "rating": "5", 
            "review": "Dutch Architecture. You should definitely have a walk along the canals to have a view of the architectural pattern of the city. Herengracht is one of the canals that shouldn't be missed."
        }, 
        {
            "index": 281, 
            "rating": "4", 
            "review": "Wider, grander, impressive, the heart of empire?. Like Prinzengracht, but in some ways grander and not so intimate.\nWide variety on an architectural theme, and a passage through the very grand to the somewhat run-down. Worth the leg work and the hazard of silent bicycles with imperious bells!"
        }, 
        {
            "index": 282, 
            "rating": "5", 
            "review": "Enjoy a walk and sit for a drink. A dreamy walk around one of my canals in the city. You can find stores and restaurants around. Sit and enjoy!"
        }, 
        {
            "index": 283, 
            "rating": "3", 
            "review": "to be visited. impressive but a bit \"cold\" with large houses and buildings. a famous canal to visit as one of the amsterdam styles"
        }, 
        {
            "index": 284, 
            "rating": "4", 
            "review": "Comfortable bistro on the canal. We stopped in while walking by and were happy with the experience. Remember, however, that they have an internal courtyard that you might want to try."
        }, 
        {
            "index": 285, 
            "rating": "5", 
            "review": "The highlight of our trip was The refurbished Ryjks Museum!!. We experienced The Herengracht included in our booking with the river cruise.\nThe local guide was very good, much better than the short 2 hr cruises booked on the river!"
        }, 
        {
            "index": 286, 
            "rating": "5", 
            "review": "Buy the DK Eyewitness Travel Guide. I would recommend buying this travel guide just for the extensive section on the Canal Walk, which explains in detail many of the buildings along the 3 main canals."
        }, 
        {
            "index": 287, 
            "rating": "5", 
            "review": "Just as beautiful as the other canals. Great views, beautiful houses and a perfect activity to stroll around and hop in one of the many stores and cafes at the canal."
        }, 
        {
            "index": 288, 
            "rating": "4", 
            "review": "Very interesting and picturesque. The canal route is covered by the canal cruise but would recommend a walk along this canal. Get a real feel of old amsterdam , really worth the slow , random walk. What better way to get a good look at amsterdam?"
        }, 
        {
            "index": 289, 
            "rating": "5", 
            "review": "Gorgous canal. This was a quiet, peaceful, picturesque canal. Our B&B, 4. Sunhead of 1617, was located on this canal. I could not image a more lovely canal."
        }, 
        {
            "index": 290, 
            "rating": "5", 
            "review": "Nice walk along the canal. Beautiful houses all along the canal, it is sure an amazing place to wonder around day or night... I recommend"
        }, 
        {
            "index": 291, 
            "rating": "4", 
            "review": "Has it all. A great place for shopping, having a quiet drink, fairly quiet on a sunday, lovely for a morning walk."
        }, 
        {
            "index": 292, 
            "rating": "4", 
            "review": "Herengracht canal sightseeing tour. Beautiful buildings and street life and great camera and photoshot opportunities seen from a canal cruise and also allowing us to drift slowly past the houseboats at the same level"
        }, 
        {
            "index": 293, 
            "rating": "4", 
            "review": "For early sunday morning. In you want to feel the richt atmospher, visit this part of Amsterdam on a early sunday morning when there is no traffic."
        }, 
        {
            "index": 294, 
            "rating": "4", 
            "review": "nice gracht. you can feel the Flair of Amsterdam in this road. Many bars and also Shops you will find here. Come an see yourself - it's beautiful."
        }, 
        {
            "index": 295, 
            "rating": "5", 
            "review": "A must see when in Amsterdam. Great mall with unique shops in a turn of the century building. You would never know it was a mall from the outside. It looks like 1st floor shops and offices upstairs, but it is 4 floors of shopping."
        }, 
        {
            "index": 296, 
            "rating": "3", 
            "review": "One of the nicer canals, visit by boat. This is one of Amsterdam's prettiest canals, but it is best experienced if you are going by boat or peddle boat, that way you have a lower position and really can enjoy all the different houses and their facades."
        }, 
        {
            "index": 297, 
            "rating": "5", 
            "review": "Homely Herengracht. Along this magnificent street, you will see the homes built by the wealthiest traders and merchants. We not only walked it but saw if by the canal which gave you a different perspective. Most of the best buildings are now occupied by banks and embassies."
        }, 
        {
            "index": 298, 
            "rating": "4", 
            "review": "Picture Worthy. Worth visiting and taking a picture. Nothing says Amsterdam quite like a picture with the canal. This is the perfect spot to show all your friends that you've visited Amsterdam :)"
        }, 
        {
            "index": 299, 
            "rating": "5", 
            "review": "You did not visit Amsterdam if you did not walk this canal.. For tourists this is a must see when you visit Amsterdam. Take a map of Amsterdam and locate the canal for a tour through a typical Dutch canal. Winter or summer, it has all its own charm."
        }, 
        {
            "index": 300, 
            "rating": "4", 
            "review": "Amazing Amsterdam. Cosmopolitan city.....Friendly and inviting people. Canals and its design were clear built around Central Station area."
        }, 
        {
            "index": 301, 
            "rating": "4", 
            "review": "Typical Amsterdam experience. Very pretty view, there are canals all over Amsterdam buzzing with life of people and multiple bicycles."
        }, 
        {
            "index": 302, 
            "rating": "4", 
            "review": "Herengracht canal in Amterdam. Beautiful canal with lovely stores, restaurants and cafes. Great are for people watching. Many interesting and electic places to eat."
        }, 
        {
            "index": 303, 
            "rating": "4", 
            "review": "The Gentleman's Canal. Living here for 4 years, this was a great place to ride the bicycle! The wideness of it, the prettier houseboats, the cafes and restaurants, and the shops all make this a great place to stroll or ride on."
        }, 
        {
            "index": 304, 
            "rating": "3", 
            "review": "Beautiful but crowded. Best street of Amsterdam, but very busy with tourists. It's hard to get around as a local. Great place to read a magazine watching the boats on the canals."
        }, 
        {
            "index": 305, 
            "rating": "5", 
            "review": "Herengracht Amsterdam, the Gentleman is the highest rank attainable.. The Herengracht, Gentlemen's canal, is home to the most fancy houses on all canals. It shows the Dutch mentality of the 17th century. There are several canals, the Prinsengracht (prince's canal), Koningsgracht (king's canal), keizersgracht (emperor's canal) and the Herengracht. Each one is a little more fancy then the next, and the most important were the rich tradesmen, the gentlemen in the Netherlands, so the most fancy canal is the Herengracht. It has the most beautiful houses and is certainly worth to walk along the canal and explore the gables of the houses"
        }, 
        {
            "index": 306, 
            "rating": "5", 
            "review": "Beautiful canal. We enjoyed this canal on a boat trip. The views are spectacular. The information provided while on the boat made it an experience that will last for a long time."
        }, 
        {
            "index": 307, 
            "rating": "5", 
            "review": "nice. Stayed here and loved, quite a nice area to stay, really calm and safe, I walked far during the night and felt like home.There some places opened during the night so if you want to grab something to eat is nice and easy."
        }, 
        {
            "index": 308, 
            "rating": "5", 
            "review": "Wonderful food and service. Very cool courtyard in the back, so don't stop and sit in the main area. Also very nice outdoor right on the canal dining as well."
        }, 
        {
            "index": 309, 
            "rating": "5", 
            "review": "My favourite canal!. We stayed on this canal and it is peaceful & beautiful. Very calm & appreciated after the chaos of the red light district & Dam square. Lots of shops, lots of great architecture. A definite must stroll"
        }, 
        {
            "index": 310, 
            "rating": "5", 
            "review": "Together with the other canals the highlight of Amsterdam. If you don't have a lot of time, better to walk along the canals and like inside the curtainless houses than doing a museum..."
        }, 
        {
            "index": 311, 
            "rating": "5", 
            "review": "Yummy, but the service could be better. Best meal we ate in Amsterdam. Appetizer Chef Special was a surprise and amazing.\nMy son loved the Steak Tartar and I enjoyed the day's fish/risotto special."
        }, 
        {
            "index": 312, 
            "rating": "5", 
            "review": "Sail through might, money and history.. By all means one of the strong parts of the city. Why ? here was the money ! heren means lord, sir, not necessary with a title like in the UK but with a very high level in society. They made their mansions at this canal, which wealth was measured by its width, as taxes were paid by width of the houses (there fore most houses are narrow and high). Today multinational corporations have aquired many of the buildings and the scent of money and might still hangs in the air. herengracht is charming, beautifull, tasteful and very green from April to October. It must be sailed in one of the tourist boats, the perception is the right one from the water."
        }, 
        {
            "index": 313, 
            "rating": "5", 
            "review": "Lovely Canal. This is the \"toniest\" of the Amsterdam canals and rightfully renowned for its loveliness. Lovely trees, lovely houses, peaceful water."
        }, 
        {
            "index": 314, 
            "rating": "5", 
            "review": "Do not miss Amsterdam's canals!. f you're in Amsterdam, make sure you take a canal boat trip down the network of beautiful canals...the perfect way to see the city with tranquility! Taking a stroll will offer up Amsterdam's many coffee shops, boutique's & creperies! Do not miss out!"
        }, 
        {
            "index": 315, 
            "rating": "5", 
            "review": "More than Just Another Canal. There is a reason as to why this canal is known as the \"Gentleman's Canal.\" One gentlemanly thing to do is to help people - it helped me get around the city as the Herengracht became my safe spot - if I can get to it I can get home (our lodging was on this canal).I got out a few nights to photograph the happenings on this man-made link. This image is what I got for my efforts."
        }, 
        {
            "index": 316, 
            "rating": "5", 
            "review": "Amnsterdam's most glorious canal. The Herengracht is the Amsterdam canal where you can find the most expensive houses fromn the 17th century. Rich merchants built their city palaces there. And can still enjoy the sight of then. Take a tour on one of the round about boats, eliminate the cars from your mind and look at the richest architecture Amsterdam ever produced. Remember that the upper floors were only used for store. People lived on the lower floors where the windows and ceilings are extremely high to catch as much light as it possible in wintertimes. During the summer months people moved to theirlarge summerhouses in the country side, away from the buzz of the city and the stench of the canals. The buzz is still there, but the stench has gone since the construction of the sewerage system in the 19th and early 20th century."
        }, 
        {
            "index": 317, 
            "rating": "5", 
            "review": "Amsterdam's canal network. It is so easy to get around Amsterdam on foot. There are a series of canals that encircle the city at intervals of several streets. Like the spokes of a wheel another set of canals radiate from the centre making a spiders web. Each canal (gracht) has a road along either bank. The only hazard is from cyclists. The motorists are very careful of pedestrians. This cannot be said of Dutch cyclists. they are generally rather self centred and arrogant. they don't make any allowance for pedestrians who are forced to walk in the road as the pedestrian paths are blocked with parked cycles. They ride straight at you and don't slow down at all. Herengract is one of the circular canals that we walked along side many times on our travels to town centre and the various attractions we visited."
        }, 
        {
            "index": 318, 
            "rating": "4", 
            "review": "Superb place with back garden. If its a chilly day and you want to sit out then the back garden is really cosy with a fire and comfy seats to chill out from the hub bub and hectic life of Amsterdam."
        }, 
        {
            "index": 319, 
            "rating": "5", 
            "review": "Beautiful canal. A good place to take your pictures of all the bridges over the Amsterdam canals. Look for a bridge that has one or two bicycles leaning against the wall. That makes for an authentic Amsterdam picture."
        }, 
        {
            "index": 320, 
            "rating": "5", 
            "review": "Bags of joy !!!. Visit the Bag Museum here- its just great. Fantastic cafe for afternoon tea or a bite. Don't fancy that-? nip across the canal to the Waldorf for a right royal treat !"
        }, 
        {
            "index": 321, 
            "rating": "5", 
            "review": "Amazing Cityscape. Easily one of the most beautiful architectural parts of Amsterdam. We stayed on this canal during our last visit, and would definitely recommend touring the area."
        }, 
        {
            "index": 322, 
            "rating": "4", 
            "review": "One of the canals in the canal ring. Beautiful walking area. We stayed on Nieuw Herengraght which is an extension on other side of Amstel River."
        }, 
        {
            "index": 323, 
            "rating": "5", 
            "review": "Iconic canals. The canals are the most iconic attractions in Amsterdam and you will definately see a lot of them on Herengracht. This a very good area for relaxing and romantic walkings and good photographs can be taken. There are a lot of cafes and restaurants in this area, as well."
        }, 
        {
            "index": 324, 
            "rating": "5", 
            "review": "Graphic. A centrally located beautiful and graphic canal.Lots of bars,cafes,restaurants.Crowded.Parallel tothe Singel gracht (canal)"
        }, 
        {
            "index": 325, 
            "rating": "5", 
            "review": "Shopping. Our hotel was near this section. So many unique cafes and shops. Lots of fun walking the canals and enjoying the architecture."
        }, 
        {
            "index": 326, 
            "rating": "5", 
            "review": "Another great neighborhood. Many things to see and do on Herengracht! Leads to such interesting and wonderful neighborhoods, restaurants, shops, and people..."
        }, 
        {
            "index": 327, 
            "rating": "5", 
            "review": "Amsterdam. As you will see all over Amsterdam that you are never far a way from a canal but they are beautiful and sum up amsterdam in one picture with bikes all chained to the canal railings and boats sailing down the canal with shops and bars along each side of the canal it really is a beautiful city."
        }, 
        {
            "index": 328, 
            "rating": "4", 
            "review": "Good all year round. The main canals of Amsterdam are picturesque all year round. For us this time it was May so the greenery just added to the beauty of the canals."
        }, 
        {
            "index": 329, 
            "rating": "5", 
            "review": "Beautiful all together !. The entire city of Amsterdam is absolutely stunning but I have had the chance to spend 20 days of internship working in on of the stunning buildings of herengracht street, chich left me a lot of time to get to know the area and vue in all its details. It's really a must-see, also in one of the most dynamic areas of the city (Rembrandt Plein). Highly recommend to see the canals by boat of course, which does give you an other perspective and gives photo lovers an amazing opportunity to do what they love most !"
        }, 
        {
            "index": 330, 
            "rating": "5", 
            "review": "Look up!. Lined with some of Amsterdam's most interesting architecture - take the opportunity to look up as you stroll alongside the canal, but watch out for the looney cyclists!"
        }, 
        {
            "index": 331, 
            "rating": "4", 
            "review": "Crowded, Be careful of Cars, Bikes, Trains, Locals. I stayed on the Herengracht for 10 days and while it's the most peaceful of all the centrally located canals, it's still busy. After a crowded day in Amsterdam, this canal is the best to call home. It is the most elegant I believe, but it won't shelter you from the city's noises, construction, or irritants."
        }, 
        {
            "index": 332, 
            "rating": "5", 
            "review": "Wonderful. Enjoyed canal cruise and walking along this canal lined by fantastic houses. Especially interesting if you have read The Miniturist."
        }, 
        {
            "index": 333, 
            "rating": "5", 
            "review": "Just as you imagine. Herengracht is all you expect an Amsterdam Canal to be. Charming and Elegant, Just stroll or cycle day or night and soak in the atmosphere of this wonderful canal then take a boat along it and look up at the gables. Hard to think that it is so old."
        }, 
        {
            "index": 334, 
            "rating": "5", 
            "review": "Popular place for fun and good food.. We were taken to the Herrengracht Restaurant & Bar by an in-the-know friend who lives in Amsterdam. Much of the city is filled with beautiful canals and buildings with wonderful, iconic character. The Herrengracht is one of them and is surrounded by the same near the corner of Leidsestraat and Herrengracht (canal of the same name). It seems to be quite popular and was crowded when we visited and every time we passed by. It has a terrace overlooking the canal, inside seating, and then a nice patio out back. While a lot of the patrons were there just for drinks, we had just arrived on an early morning flight from the US, so we wanted an early dinner. The menu includes some Dutch items and several generic offerings of wide appeal. I had the Chilean sea bass, which had a great sear and was beautifully done. Everyone had a very nice meal and a good time. Service was great. All in all, one of our nicest experiences in Amsterdam!"
        }, 
        {
            "index": 335, 
            "rating": "5", 
            "review": "Beautiful historic canal side buildings.. 17th century town houses line this canal, with lovely elm trees either side of the the narrow one way streets. This is a most attractive quiet upmarket area with a few nice shops and restaurants including top notch Johannes."
        }, 
        {
            "index": 336, 
            "rating": "5", 
            "review": "Nice canal with intersting buildings. A nice place with old buildings from rich people from 2 or 3 centuries ago. I recommend the Willet-Holthuysen museum, so nice to visit !"
        }, 
        {
            "index": 337, 
            "rating": "5", 
            "review": "Very nice!. Very nice canal! Very diverse crowd. Better walk not too late at weekends if not out to party)) Nice shops opened until 7 PM - disappointment..."
        }, 
        {
            "index": 338, 
            "rating": "5", 
            "review": "Gorgeous buildings. We were lucky to spend some time here and enjoyed our daily walks. Although we wandered around many canals and beautiful streets in Amsterdam, Herengracht was the most elegant and picturesque in our opinion!"
        }, 
        {
            "index": 339, 
            "rating": "5", 
            "review": "Beautiful canal and neighborhood. Our hotel was on this canal and it was a beautiful place to stroll during the day or evening. Architecture is wonderful with lots of surprises as you walk along the street."
        }, 
        {
            "index": 340, 
            "rating": "4", 
            "review": "Lovely street...take a canal cruise to appreciate fully. Our hotel was on the Herengracht (Banks Mansion- lovely FYI) and they suggested a canal cruise. We took a canal cruise that went quite a way down the Herengracht and I must say that the perspective from the boat is MUCH better. Trying to get a good view of the buildings when you are on the sidewalk looking up is hard (careful to avoid getting hit by the cars and bicycles) and looking across the canals at the other side ....well the trees get in the way. From the canal you can look up through the trunks and get a great view of the canal houses....LOVELY. I am so glad we took the time to do this. I have been to Amsterdam before but didn't want to waste my time on past visits. My husband pushed for the canal cruise...I am so glad he did. It really made the Herengracht come alive."
        }, 
        {
            "index": 341, 
            "rating": "4", 
            "review": "Beautiful canal. Again a canal so is very Nice to walk along.\nAll about the beautiful arkitekture.\nWe also Walked this along the whole canal.\nBeautiful"
        }, 
        {
            "index": 342, 
            "rating": "4", 
            "review": "Great to wander around. You can just wander around the HG and Prinsengracht and it's great to view the house styles as well as the house boats. If you can take a boat tour as well to see these streets. Look carefully at the houses and you'll notice they lean forward, so they can hoist heavy good up on the small gantries at the top of the house."
        }, 
        {
            "index": 343, 
            "rating": "4", 
            "review": "One of the main canals in the central ring. Lots of shops, houses and restaurants on one of the historic canals in the central ring. This one was defined by the number of wealthy personages residing here and many of the homes are bigger and more elaborate than elsewhere."
        }, 
        {
            "index": 344, 
            "rating": "5", 
            "review": "Gentlemens Canal. Amsterdam's most important canal where the Mayor of Amsterdam residence sits besides. Great boat trips to view the historic buildings along this canal and pick up general information such as this!!"
        }, 
        {
            "index": 345, 
            "rating": "5", 
            "review": "Elegance combines with history. Our hotel was located on the Gentlemen's Canal. Great architecture, probably best seen from a canal cruise, but also worth a wander along the streets. Take care of the traffic, bicycles everywhere!"
        }, 
        {
            "index": 346, 
            "rating": "4", 
            "review": "Venice of the North. This is considered the most important canal in the city as the rich and influential folks of the city have an address here. Take a canal tour and you will be able to see one of the most photographed views of Amsterdam, the famous seven bridges of Reguliersgracht. Admire the prestigious and historical houses here at leisure."
        }, 
        {
            "index": 347, 
            "rating": "5", 
            "review": "Wonderful place. loved this area - full of history, beautiful architecture, buzzing with life and interesting people. take time to take in the atmosphere and stop and people watch."
        }, 
        {
            "index": 348, 
            "rating": "5", 
            "review": "Famous Canal in Amsterdam. The Herengracht is one of the Famous Canals in Amsterdam. The many canalhouses are a few hundred years old and all different. They are sooo pretty? I just love it. You can take a walk and simply admire them or take a canalboattrip.."
        }, 
        {
            "index": 349, 
            "rating": "5", 
            "review": "Take a canal tour!!. This was a very inexpensive way to see all around Amsterdam and the canals. I think it cost us 15 euros a piece. The guided tour has head phones for each passenger and the tour is narrated in a variety of languages so that no one is left out!"
        }, 
        {
            "index": 350, 
            "rating": "5", 
            "review": "Herengracht. No trip to Amsterdam is complete without having undertaken a tour of their famous Grachten! Even when it's raining, it's a trip worth taking. It's a great way to see Amsterdam! This gives you the opportunity to see the quaint and lovely architecture of many of the buildings. You will be astounded at how old some of the buildings really are! Some are really beautiful and you will be in awe most of the time! Also, you will get a chance to see along the Grachten the various kinds of houseboats that people actually live in! A visit to the Grachten is definitely one of the highlights of any visit to Amsterdam! All you have to do is sit back and enjoy!"
        }, 
        {
            "index": 351, 
            "rating": "4", 
            "review": "Pretty and Regal Residences on the either side!. The Regenten or the Rulers of the old Dutch republic lived here. Hence, of all the canals, the buildings on either side of this one are more lavish and regal!"
        }, 
        {
            "index": 352, 
            "rating": "4", 
            "review": "one of the best canals in terms of gorgeous buildings. take time for a stroll on this elegant refined canal with some of the best buildings in amsterdam . also some nice shops and cafes"
        }, 
        {
            "index": 353, 
            "rating": "5", 
            "review": "AMSTERDAM - IF YOU LOVE FOOD AND INDEPENDENT SHOPS, DON'T MISS THIS GEM!! - HERENSTRAAT (OFF HERENGRACHT). Near to the top of Herengracht, toward Central Station, lies a very sweet side street 'Herenstraat'. Here you will you find a scattering of independent quality shops offering everything from Asian Art, leather goods, clothes but above all, no less than FOUR superb little restaurants. They say 'healthy competition' is a good thing, hence this maintains the high standards offered by these very different establishments. Short menus are also a good sign of freshness and quality, large menus often mean some elements are prepared long in advance or even frozen to avoid waste. There is SO little to distinguish between these four, however, I will try my best!! MAX RESTAURANT, don't be fooled by the slightly stark minimalist interior, especially during the day. At night, this place 'glows' and once full, becomes very cosy. Service is impeccable, professional and 'not in your face'. The food is exciting with an Indonesian twist. For example, I had the amazing lamb fillet with a wonderful sauce infused with a gentle spice and coconut, not obvious but just enough to excite! The menu is fairly short but there will be something for everyone and priced for either a two or three course meal, depending how much you want to spend or how hungry you are. Check this out online. MAX is HIGHLY recommended, great for a romantic meal for two or a party of eight or more!! SEASONS RESTAURANT - WOW!!! We hit this place the night before it closed for just a few days for a new paint job, hence there were some items off the menu. Despite this, the service, food and ambience were outstanding!! I can't comment on the decor as I haven't seen the refurbishment but it's a very cosy place. Again the menu is fairly short but exciting and full of amazing tastes and textures. I had the 'Upside Down' Beef Wellington, a deconstruction of this classic dish with prime beef served ON TOP of a light puff pastry crust infused with a whiskey/mushroom sauce, incredible!! Google the new menu online as there will again be various price options depending on the number of courses. This place ranks JOINT NUMBER 1 with MAX, I simply can't separate them. TASTE OF VIETNAM - WOW!! This has to rank as one of Amsterdam's BEST Vietnamese restaurants, a hidden gem!! Service, menu and decor/ambiance makes this a total must. Too much to say here but check out online and add to your list!! Finally CHEZ GEORGE - You will love the white table cloths, impeccable attentive service, presentation and menu. This is fine dining but not at fine dining prices. There was a fixed menu on offer the night we visited offering a good choice of meat and fish dishes in typical French style. This is the perfect place for a very quiet and intimate dining experience, very romantic. The Chef and owner takes a very front of house approach and will take great pride in serving and talking you through the various dishes. Highly recommended. IN SUMMARY, this little side street has a LOT to offer with plenty of choice in a small area and will save you trekking up and down the canals to find something special. PLEASE RATE if you found any of this helpful on your visit."
        }, 
        {
            "index": 354, 
            "rating": "5", 
            "review": "Beautiful. Beautiful. Walk, run, or people watch. Great outdoor space. A short walk from liedsplein. You pass by it on bus 197 to and from airport. Lots of hotels nearby. Lots of people."
        }, 
        {
            "index": 355, 
            "rating": "5", 
            "review": "Life on the Canal. This a a beautiful quiet part of Amsterdam, especially near the Bowersgraht. But also close to many restruants and bars"
        }, 
        {
            "index": 356, 
            "rating": "4", 
            "review": "Grand Houses of times gone by. We took in most of this area on a canal trip as well as walking a lot of it. The old merchant houses all have their own stories."
        }, 
        {
            "index": 357, 
            "rating": "5", 
            "review": "Walked and cruised. This is a lovely area to walk in and cruise in. We went on the Hop on and of cruise boats.It was a quiet time of year and it wasn't too crowded or noisy.Lovely architecture and good informative commentary if you go on the boats."
        }, 
        {
            "index": 358, 
            "rating": "5", 
            "review": "Beautiful characteristic Amsterdam. Eating fresh herrings on bridge overlooking Herengracht and purchasing flowers . Did not appreciate tourist laden boats with boom boxes traversing the water .."
        }, 
        {
            "index": 359, 
            "rating": "4", 
            "review": "Lovely area to walk around. Beautiful area to have a wander around! Many of the footpaths beside the canals have no barrier, be careful not to get too close to the edge!"
        }, 
        {
            "index": 360, 
            "rating": "5", 
            "review": "Great area. When in Amsterdam what do you do? You see canals!! This area is very picturesque with beautiful homes and trees on both sides of the canal. Make sure as to not fall in after a few drinks!!"
        }, 
        {
            "index": 361, 
            "rating": "5", 
            "review": "A beautiful canal, lined with beautiful houses in a beautiful city!. Herengracht is so central - just five minutes' walk from the central square, Rembrandtplein, and five minutes in the other direction to the Rijksmuseum - yet it is so peaceful and calm, so beautiful, lined with mediaeval houses and dotted with picturesque bridges.....take a walk along the banks of the canal - but watch out for the cycles and the occasional vehicles coming down the narrow cobbled streets! Herengracht is full of old world Amsterdam charm - and also happens to be the location of my favourite hotel!"
        }, 
        {
            "index": 362, 
            "rating": "3", 
            "review": "Tja ?. I don't know so much what to say about this place for somebody who is born in Amsterdam exept its the second canal from the 4 rampart moats we have and where Amsterdam is famous about and are called canals today Initially it was dug in 1585 and get his name in 1612. Maybe nice for tourists.... but for me there is nothing nice to see there."
        }, 
        {
            "index": 363, 
            "rating": "4", 
            "review": "Historical architecture. Another of the wonderful canal walks amongst 17th century architecture invoking an atmosphere of history exuding from the walls. Take your time and observe the architecture,the boats, the welcoming cafes and it's quiet ambience....enjoy!"
        }, 
        {
            "index": 364, 
            "rating": "5", 
            "review": "A nice walk and no red lights!. Unlike Singel, you won't come across any red lights walking down the Herengracht. Full of 17th houses it takes about 20 minutes to walk, and there are plenty of cafes to visit and the 9 streets (which is a nice shopping area) is halfway down.I'd recommend this walk: pretty at night, full of twinkling lights at night and completely different during the day where little details on the buildings are revealed"
        }, 
        {
            "index": 365, 
            "rating": "4", 
            "review": "Another stunning place to walk. Cute shops, narrow houses, house boats...blissfully same old. Easy to add this to your list of things to see as it runs through the center of everything."
        }, 
        {
            "index": 366, 
            "rating": "4", 
            "review": "Herengracht. The best of the Graachts Probably best to walk the Golden Bend Don't forget to visit Rembrandhuis The Canal Museum is also very worth visiting"
        }, 
        {
            "index": 367, 
            "rating": "5", 
            "review": "Most fantastik canal. Rigth in the center of Amsterdam, 10 minuts from Amsterdam CS walking . Walking along the canal and simply looking at all those fantastik houses, one more spectacular than the next. All well restauratet and telling a lot of history of trading and a rich city. Do take a walk on both sides to make sure you see all the buildings from the other side. Very important do also walk in the evening and enjoy the the lamps and the special Atmosphaere. Will be back in spring and can only recomend a walk very highly."
        }, 
        {
            "index": 368, 
            "rating": "5", 
            "review": "Simply stunning architecture. Walk along the Herengracht early on a Sunday morning and you could be time travelled back to he 18th century.Beautiful architecture."
        }, 
        {
            "index": 369, 
            "rating": "3", 
            "review": "Nice arhitecture. We stayed on this canal in the near are of Dam, it s quite easy to find major attractions waling along it, the buildings look lovely, perhaps though not so majestic as on Prinsengracht. Anyhow, nice stroll to take."
        }, 
        {
            "index": 370, 
            "rating": "5", 
            "review": "Posh canal. This canal is where all the industry owners had their properties so the houses are wider than the norm (with gardens apparently at the back)."
        }, 
        {
            "index": 371, 
            "rating": "5", 
            "review": "Absolute Amazing!. I loved to walk around the old town of Amsterdam and just enjoy the old architecture of the great place!\nA must see for everyone!"
        }, 
        {
            "index": 372, 
            "rating": "5", 
            "review": "Grachten: 1, Little Streets: 2. Yes, the grachten (Amsterdam's main semi-circular canals) are all magnificent, and the Herengracht is the grand-daddy of them all. But for really interesting discoveries of a shopping, culinary or historical nature, be sure to wander and lose yourself in as many of the little streets between the grachten."
        }, 
        {
            "index": 373, 
            "rating": "4", 
            "review": "Very pleasant. I was near the Herengracht and had a stroll up and down it. A very pleasant 45 minutes in the early spring sunshine."
        }, 
        {
            "index": 374, 
            "rating": "3", 
            "review": "Pleasant area. OK for a casual stroll and a beer or koffee wit melk in the cafes and bars that are in the immediate vicinity. Walking in Amsterdam is pleasant due to the flat terrain"
        }, 
        {
            "index": 375, 
            "rating": "5", 
            "review": "Picturesque canal.. Having stayed in a hotel on Herengracht Canal you will enjoy a walk along its banks. A river cruise also comes along this canal and points out many impressive buildings."
        }, 
        {
            "index": 376, 
            "rating": "5", 
            "review": "Loads of information about the resistance movement. For adults and children. There are multiple rooms showing the different events that took place during the war from the bombing of Rotterdam to the liberations by the allies. The audio is available in Dutch and English. Allow a full hour to go through the rooms. A new section has been added which will allow visitors to follow four children through the period. While interesting for adults, this area allows children to listen to stories told by the four children and enter into rooms designed to show how families lived during the period. This museum is well done and I would recommend for anyone interested in that period of history."
        }, 
        {
            "index": 377, 
            "rating": "4", 
            "review": "Canal Cruise. This is the one of the main canals visited by canal cruises. Translates to Gentlemens Canal. Good views of Amsterdam architecture."
        }, 
        {
            "index": 378, 
            "rating": "4", 
            "review": "Cute and authentic. The Herengracht (Or gentlemans canal translated) is one of Amsterdams main canals. It's definitly worth the visit. I would recommend going on a canal tour. Don't book one at home!! If you go to central station, there is a really cheap canal tour company. It only costs €10 an adult."
        }, 
        {
            "index": 379, 
            "rating": "5", 
            "review": "Best canal view's in the city. Love walking in this wonderful part of the city,make a point of going to ARENDNEST,a great Dutch beer bar in this area and the view's of the canal is just fantastic.Lovely looking bridge and building's covering several centuries make this a great walk,very scenic with great little shop's and bar's on both side's of the canal ,mean's it well worth a visit.We like to go in the afternoon when this area is buzzing,stopping for a coffee or a beer in one of the cafe's,just superb."
        }, 
        {
            "index": 380, 
            "rating": "4", 
            "review": "Craft beer. Arendsnest, must visit for local beer, 20+ on tap and bilingual staff. Small cheese boards for hungry folk"
        }, 
        {
            "index": 381, 
            "rating": "5", 
            "review": "Prettiest section of Amsterdam. This is by far the most gorgeous area of the city. Fab to see walking as well as from the canal tour boat. There was a nice canal-side bench scene for The Fault in our Stars filmed here. Quite the photo op spot. A lovely walking area."
        }, 
        {
            "index": 382, 
            "rating": "5", 
            "review": "loved the canal cruise. this is another of Amsterdams beautiful canals. lots of trendy shops, and interesting buildings (historic former warehouses)\na canal cruise is a must here"
        }, 
        {
            "index": 383, 
            "rating": "4", 
            "review": "Canal Beauty. With the Light Festival on, this specific canal is beautifully illuminated with lighting designs by artists however, even without this is it a beautiful canal to visit! Whether you walk, cycle or take a cruise, you'll fall in love with the canal's beauty!"
        }, 
        {
            "index": 384, 
            "rating": "4", 
            "review": "Nice walk. Our hotel was located on this canal. It's a nice walk and interesting to look at all the architecture. It is more residential so you need to look for cafes and shopping off on the side streets."
        }, 
        {
            "index": 385, 
            "rating": "5", 
            "review": "A canal street worth the walk. Nice canal street right out side the center on Amsterdam. I have walked and biked it many times it is filled with shops and restaurants nice and quit compared to the center of town. A good place to stroll and just take in the sights of town. I think it is worth checking out all the main canal streets because they a have their own different feel."
        }, 
        {
            "index": 386, 
            "rating": "5", 
            "review": "One of the best. Well you probably knew that already. Loads of quirky boutiques and shops, lovely bridges and pretty canals. Don't forget the coffee shops of course!"
        }, 
        {
            "index": 387, 
            "rating": "5", 
            "review": "our favourite canal. we stayed on this canal at Sunhead, it's a gorgeous canal made for walking as previous reviews say a different direction/time of day changes the views. As previously stated watch out for bikes although everyone is soooo friendly even if you're at fault."
        }, 
        {
            "index": 388, 
            "rating": "5", 
            "review": "Lovely. The great thing about Amsterdam is it is very walk-able and Herengracht Street offers a wonderful walk. It is a ring street that circles through the old city and ends in Amstel which is the old original part of Amsterdam. On both sides of Herengracht street are rows of old buildings covering the 15th, 16th, 17, 18th and 19th centuries. A canal runs down the centre and there are many cross streets and bridges. It crosses many other important city streets and runs parallel to other canal streets like Singel and Keisiersgracht. I stayed ay the Best Western Dam Square and was able to walk each day to all key sots along Herengracht."
        }, 
        {
            "index": 389, 
            "rating": "5", 
            "review": "Elegant Amsterdam. We stayed at hotel Ambassade on Herrengracht. Great location in lovey part of Amsterdam lots of nearby eating options and less noisy and seedy than other parts of Amsterdam."
        }, 
        {
            "index": 390, 
            "rating": "3", 
            "review": "Handbags and Purses. The Museum of Handbags and Purses was interesting. I thought it was free entry but it was actually 9 Euros. My husband was not impressed. The old house is charming and they have turned a couple of rooms into a cafe and it overlooks the canal in Herengracht."
        }, 
        {
            "index": 391, 
            "rating": "4", 
            "review": "A groovy canal. Walk the canals, stop at the bars, check out the market, some great arty bookshops too, what's not to love about wandering in the streets here? Oh - look out for the cyclists, often to be seen texting rather than looking where they're going, and being from the UK, I was mystified about cycle/pedestrian/tram priorities - made it home in one piece though."
        }, 
        {
            "index": 392, 
            "rating": "5", 
            "review": "Herengracht canal. Stunning location, stayed in a beautiful little hotel on this canal. Close to shopping, museum (Anne Frank), transport and dining. Try Arendsnes (brown cafe) on this canal. Great beer and bar snacks."
        }, 
        {
            "index": 393, 
            "rating": "5", 
            "review": "Canals, canals everywhere. You won't understand why the fascination regarding canals until you have been in Amsterdam. Although they all look the same, the culture, the neighbourhood, the time of the day gives great unique photo opportunities."
        }, 
        {
            "index": 394, 
            "rating": "4", 
            "review": "amazing canal. This is also one of the special canals that must be visited while in Amsterdam. It will give you a taste of the culture and making of the city. you can also do a boat tour. highly recommend it."
        }, 
        {
            "index": 395, 
            "rating": "4", 
            "review": "Another beautiful canal that must be experienced in Amsterdam. This is also one of the special canals that must be visited while in Amsterdam. It will give you a taste of the culture and making of the city. We visited it both by foot and by boat. The others in my group were not ready to do it by bike, but I would highly recommend it. Each of the major canals have a character of its own and must be experienced."
        }, 
        {
            "index": 396, 
            "rating": "5", 
            "review": "One of the many Canals. Great walks or take a canal trip to see the variety of houses along the canal. The various canals have different styles."
        }, 
        {
            "index": 397, 
            "rating": "5", 
            "review": "Nice street in the center of Amsterdam. Herengracht is very much in the center of Amsterdam, and is lined by canals and iconic eateries. With Rembrandtplein being in close proximity, there are multiple entertainment options to choose from. This area is serviced by almost all trams and accessibility is a breeze."
        }, 
        {
            "index": 398, 
            "rating": "5", 
            "review": "Lovely to stroll along. I had a lovely long walk along this canal before dipping into the 9 straatjes and the jordaan to look for a new home... It helped inspire confidence that the jordaan is an area wortgt considering to be close to such a nice place for a walk. That the surrounding streets are so busy makes this an island of tranquility amongst the hustle and bustle."
        }, 
        {
            "index": 399, 
            "rating": "5", 
            "review": "Nicest Canal. Home to all the wealthy merchants of Amsterdam at one time, now a lot of embassy are located there. very nice residences with double staircases which is rarely seen elsewhere in Amsterdam"
        }, 
        {
            "index": 400, 
            "rating": "5", 
            "review": "Classic Amsterdam. Along with Prinsengracht and Keizersgracht, these principal canals show Amsterdam at its finest. Beautiful, charming and with much architectural interest."
        }, 
        {
            "index": 401, 
            "rating": "5", 
            "review": "The true Amstersam perhaps?. This is such a lovely area - fantastic architecture that is so typical of this beautiful city. You want to sit a little and walk a little and have a drink or lunch in one of the many eateries. Take your time and take it all in. Then go shopping..."
        }, 
        {
            "index": 402, 
            "rating": "5", 
            "review": "Romantic.... Perfect place to stroll and have coffee along the canals. Different time of day you will see different colors of the canal. Do take the canal cruise for an overall cruise tour. Need not say, this is a must. Same goes for all the canals!"
        }, 
        {
            "index": 403, 
            "rating": "4", 
            "review": "Beautiful, like the others. All grachts are beautiful, border the centrum, this one is used also for canal cruises and for me was special, because our hotel was situated here."
        }, 
        {
            "index": 404, 
            "rating": "5", 
            "review": "amazing canal around amsterdam. this is one of the best canal site in amsterdam, very long surrounded to amsterdam, love to walk around this canal site. centrally located."
        }, 
        {
            "index": 405, 
            "rating": "4", 
            "review": "Exeptionally exeptional. The Herengracht (Canal of the Overlords) boasts the unique architecture of the Dutch Golden Age. The facades of the houses have distinctive shapes. The street that runs on both sides of the canal is narrow, making it difficult for a car to pass a bicycle. Try to get an invitation to see one of the not modernized house from inside. Some of them have cellars that go way to the back. Some are connected to a building behind, that no passer-by ever sees. Some have a labyrint and all are beautiful. Read up on their history. You'll enjoy your visit even more."
        }, 
        {
            "index": 406, 
            "rating": "5", 
            "review": "peaceful oasis in busy city. We stayed in an apartment in a canal house along Herengracht and loved the neighborhood, the canal scenes, the nearby activity."
        }, 
        {
            "index": 407, 
            "rating": "5", 
            "review": "Great starting point. As pretty as most of the canals in Amsterdam and everything one could wish to see lies nearby either side of it."
        }, 
        {
            "index": 408, 
            "rating": "5", 
            "review": "Herengracht canal. We stayed at a B&B on the Herengracht canal. It is a beautiful canal and a perfect location to see the sights. We walked from the train station and were around the corner from the Anne Frank house. We could walk to Dam Square. We did walk to the Rijks Museum but took the tram back to Dam Square."
        }, 
        {
            "index": 409, 
            "rating": "4", 
            "review": "nice canal area. Actually, all the \"gracht\" streets kind of look alike; you can walk for hours along the canals, old buildings, cross the old bridges and even take boat rides."
        }, 
        {
            "index": 410, 
            "rating": "5", 
            "review": "Enjoy architecture.. Enough said. Bike ride or canal trip is the thing. This will take an hour or two days depending on your involvement.Great place not far from center."
        }, 
        {
            "index": 411, 
            "rating": "3", 
            "review": "Nice walk. We had dinner on Herengrecht one night and so had a lovely walk back and forth. It was quiet and interesting to look into the canal houses."
        }, 
        {
            "index": 412, 
            "rating": "5", 
            "review": "lovely for a stroll. A calm quiet canal with lovely homes from the 1600s where most of the houses that have been restored to perfection. Some of which one can visit. Worth the detour. We visited 2 of the homes and were impressed with the quality of the restoration."
        }, 
        {
            "index": 413, 
            "rating": "3", 
            "review": "Just a street. But interesting buildings for a walk around the canalside - but not a lot more interesting than many of the other streets nearby"
        }, 
        {
            "index": 414, 
            "rating": "5", 
            "review": "The gentle men's canal. If you collect those little blue and white Dutch houses this canal abounds with them. The gentle men's canal, one the best inner canals."
        }, 
        {
            "index": 415, 
            "rating": "5", 
            "review": "Business man's canal in days of yore. I have stayed on this canal three times now. The buildings are very nice as this was where the businesses were, Today some consulates are housed along this canal. Nice restaurants round and about the canal and it is so close to the centre of Amsterdam and the flower market and Ann Frank house and Dam Square"
        }, 
        {
            "index": 416, 
            "rating": "5", 
            "review": "This is the area we stayed in. This is a beautiful area. Quiet all day and evening with a scattering of small restaurants and bars. Houseboats line the canal and it is as lovely at night as it is during the day."
        }, 
        {
            "index": 417, 
            "rating": "4", 
            "review": "One of the Three great canals. This is one of the three great canals for us. Stroll the length and take in Amsterdam from top to bottom. Not our favorite but still a great canal to walk along"
        }, 
        {
            "index": 418, 
            "rating": "5", 
            "review": "Fancy wide houses. This is the only street where you'll find that the houses are more than 6m wide! They are beautifully decorated as they symbolize the wealth of the occupants of the buildings once this part of town was developed in the 17th century."
        }, 
        {
            "index": 419, 
            "rating": "5", 
            "review": "Beautiful. Whether you explore this area on foot or in a canal boat, it is still magnificent. Splendid architecture interrupted by small outdoor cafes or bars makes this a very relaxed place to walk around. It has to be seen of you are visiting Amsterdam."
        }, 
        {
            "index": 420, 
            "rating": "4", 
            "review": "Beautiful Architecture. If your here for the Architecture... well you might be, or are just enjoying it, this is the canal to be. This is where all the grand old houses of Amsterdam are, and it can be fun to look at the carving above doors to try and guess what the family did. A pleasant afternoon walk."
        }, 
        {
            "index": 421, 
            "rating": "5", 
            "review": "\"The\" most known. You haven't been in Amsterdam unless you walked at the Herengracht, the houses are so different, each with their own special gables , the elite neighborhood."
        }, 
        {
            "index": 422, 
            "rating": "4", 
            "review": "A leisurely stroll through the Grachte. Amsterdam is not one of the prettiest cities in the world but the Grachte are about the one thing that does make an impression. It is worth strolling along and crossing the bridges to view the buildings along the rivers. I loved all the bicycles and flower baskets hanging at random interval on the bridges."
        }, 
        {
            "index": 423, 
            "rating": "5", 
            "review": "Classy. Very classy old traditional street we have friends that live there and the buildings are typical stunning Dutch homes."
        }, 
        {
            "index": 424, 
            "rating": "5", 
            "review": "Beautiful Homes. The Herengracht is one of the loveliest canals in Amsterdam. There you will find some of the finest homes and beautiful architecture in Amsterdam."
        }, 
        {
            "index": 425, 
            "rating": "5", 
            "review": "What a Decor!. Take a walk , follow the canal .... look at the houses and read about their history .... Beautiful architecture."
        }, 
        {
            "index": 426, 
            "rating": "5", 
            "review": "Lovely street view. It is very close to the Flower Market, hosts beautiful buildings in the typical old Dutch architecture, heard that in the past only rich people could afford living there."
        }, 
        {
            "index": 427, 
            "rating": "3", 
            "review": "Not really about the canals. The displays were well put together but we were interested in the canal system, how it works and the locks but there was really no information about that."
        }, 
        {
            "index": 428, 
            "rating": "4", 
            "review": "Another bikeride to work. Also on my way to work, enjoy the Grachten all together, you won't get bored. The cosy and curious streets make you want to wander around for quite some time, try some cute coffeeplaces or sandwich corners. Enjoy Amsterdam."
        }, 
        {
            "index": 429, 
            "rating": "4", 
            "review": "great walk in Amsterdam. Great street to talk along while in Amsterdam. Lot's of random clothing, cheese and food shops all along, even a few \"coffeeshops\" along the way if you wan't to take advantage of that. Great walk on a nice afternoon going along one of the canals and even bringing you past the Red Light district so a very good option if you're only there for a day or two and want to get in as much of the city as possible."
        }, 
        {
            "index": 430, 
            "rating": "5", 
            "review": "Elegant and charming. One of the most famous, and probably the most photographed canals of the Amsterdam. Lined with traditional gabled houses, tall and narrow, their leaning forward façades are beautifully reflected in the water. Romantic and atmospheric place, yet trendy and full of life."
        }, 
        {
            "index": 431, 
            "rating": "3", 
            "review": "Walking along Herengracht. Walked from close to the Palace to Amstel River along the scenic Herengracht. Beautiful mature trees, great views of some of the best old houses in town, lots of activity on the canal, few shops. Very dangerous traffic conditions for newly-arrived tourists: bicycles and trams sneaking up on you from all directions, cyclists not always stopping for red traffic lights, some drivers stopping to let you cross - but then a bike comes tearing down the road. Little patience from other pedestrians if you forget to walk on the right-hand side of often narrow sidewalks. In terms of road surface the bikes are best off, followed by the cars. You have to look where you are going not to trip over cobblestones and manhole covers. In parts the sidewalk is taken up by parked service vehicles and thousands of locked-down bicycles. But we survived and learnt a lot. Also: when trying to find your way back to your hotel, remember that Amstel (Street) is not the same as Amsteldijk."
        }, 
        {
            "index": 432, 
            "rating": "4", 
            "review": "Main canal!. Shops, dining, people watch, sailing by or walking thru. This is one of the main canals where everything happens."
        }, 
        {
            "index": 433, 
            "rating": "5", 
            "review": "Lovely Canal. Our hotel, The Ambassade Hotel, was located on this canal and it is fabulous! With so many bicycles flying by and so many interesting things to look at, this canal is sure to please any visitor. The shops, cafes, boaters, bikers, flowers all make this canal one of the most beautiful."
        }, 
        {
            "index": 434, 
            "rating": "2", 
            "review": "1 Dali and The Silk Road. This museum has the most famous Dali. In addition it had a development of the silk road. Can be read online. Save thy dollars."
        }, 
        {
            "index": 435, 
            "rating": "5", 
            "review": "Prettiest street on Earth. My boyfriend and I rented an apartment here during July 2014. Just looking out the windows made you smile. It really was one of the prettiest streets I have ever seen! Plenty of bar and restaurants to cater fr all budgets, and lots of cute little boutique shops. Perfect!"
        }, 
        {
            "index": 436, 
            "rating": "4", 
            "review": "Fantastic area. We stayed at a hotel in this area, and we loved it. The old buildings that tower over the canals are amazing and so well kept. You feel the rich history of the area. When going to Amsterdam, a walk here is a must. Many small cafes, restaurants and shops to visit and prices are for the most part very reasonable."
        }, 
        {
            "index": 437, 
            "rating": "4", 
            "review": "Canal. Herengracht is the first of the three major canals in the city centre of Amsterdam. The canal is named after the heren regeerders who governed the city in the 16th and 17th century."
        }, 
        {
            "index": 438, 
            "rating": "4", 
            "review": "A nice place for a leisurely stroll.. A nice quiet part of Amsterdam which is a pleasure to just chill out away from the crowds in the town center.A few small shops that have been there for years and when you look in their windows you wonder why they have managed to stay viable.Well worth a visit though."
        }, 
        {
            "index": 439, 
            "rating": "4", 
            "review": "The most beautiful \"Grachtenhuizen\" (Canalhouses). This canal is lined with beautiful houses.However the best way to look at them is from the water, so take a canaltour. They are the prettiest in the evening, when the houses are lighted and you can see also the beautiful interior through the large open windows! A sight to behold!!!"
        }, 
        {
            "index": 440, 
            "rating": "4", 
            "review": "Great cafes to sit and watch the world go by. Herengracht was a canal we spent a lot of time by. The tram stop was right there and when we got off there were cafes to sit and watch the world go by. Also a good stop to get off to buy shoes at the many shoe shops in the area. Wandering, sitting, watching the canal traffic, wandering some more - lovely area to spend some time."
        }, 
        {
            "index": 441, 
            "rating": "4", 
            "review": "Great Canal walk!. It is a great walk, where you can look at wonderful Dutch architecture. Flower boxes in the Canals provide a great frame for picture perfect canals. Sit in a neighborhood cafe and enjoy the view. On the. Way back, take one of the perpendicular streets to get back and enjoy the shops and ambiance."
        }, 
        {
            "index": 442, 
            "rating": "4", 
            "review": "Perfect Photos. I've seen this area in a lot of photos particularly over the canal on the bridge. I wanted to go and get some nice photos of my own and I am happy I did because it is such a nice place. Over looking the Herengracht on the bridge especially in the night time is heaven."
        }, 
        {
            "index": 443, 
            "rating": "5", 
            "review": "Canal Tour Recommended. Takes a good hour to do this..but travels through one of the nicest neighborhoods of town. A nice lunch/afternoon snack followed by this tour is a good way to go. Can buy tickets near the Amsterdam Centraal (tourist information office here)"
        }, 
        {
            "index": 444, 
            "rating": "5", 
            "review": "Nice place. Great place to take a walk. It's one of the many channels that make Amsterdam so unique. I recommend to go for all its length."
        }, 
        {
            "index": 445, 
            "rating": "5", 
            "review": "Our Home. We stayed a week in an apartment on the Herengracht. It was a fantastic location with everything close by, lovely in itself, and very beautiful."
        }, 
        {
            "index": 446, 
            "rating": "5", 
            "review": "together with Keizersgracht worth the walk. just stroll along this canal and see the locals living there and go to the areas where you are the only tourist. See how the locals enjoy living there. Just be careful not to start envying them ;)"
        }, 
        {
            "index": 447, 
            "rating": "4", 
            "review": "I love the canals. This is another canal which is beautiful. Go walking around the city and that is all you see, beautiful canals and nice photos you can make on them. Just can't get enough of it."
        }, 
        {
            "index": 448, 
            "rating": "4", 
            "review": "Dont forget the Diver. After the Prinsengracht, I love the Herengracht. There is still a Viskhausje (Fish House) on the bridge at the Utrechsestraat crossing, which I remember from 40 years ago (although it iss now up-market) This part of Amsterdam is peaceful and quiet yet each major crossing produces more interesting cafes, bars and shops."
        }, 
        {
            "index": 449, 
            "rating": "4", 
            "review": "Best canal and view. Great canal and beautiful, lots of cafés, shootings, little markets, specially if you go by bike, it is cool and you will feel like a local one, it is great for walking too."
        }, 
        {
            "index": 450, 
            "rating": "4", 
            "review": "Scenic and photogenic. Our boat tour passed by this area. We walked Passed this area while en route to ann frank house . Nice spot to take pictures ! We also try out dinner at a Thai restaurant here ; the food n service is above average ."
        }, 
        {
            "index": 451, 
            "rating": "5", 
            "review": "One of many many lovely canals. I could write about many of the canals in this city but will only bore you about this one. It is lovely. Very photogenic. Very pretty both the canal & homes surrounding it. Definitely one to see ... Plus plenty of watering holes to lounge in if you want to."
        }, 
        {
            "index": 452, 
            "rating": "4", 
            "review": "A ride through History. Was scenic , I enjoyed the trip through the water ways.\nVery scenic, the big buildings that were used for storage those days ++++\nThe architecture is simply fantastic. an insight into the riches of the handlers those days.\nI visited Amsterdam in 1993. We had a tour guide on our boat who explained every thing.\nGive it a try."
        }, 
        {
            "index": 453, 
            "rating": "4", 
            "review": "Most Famous of the Canals. In centuries gone by the Herengracht became the grandest of all the canals and arguably still is. This is reflected in the grand houses that populate this area.\nYou can walk it and stop at some of the nice bars and restaurants or take a boat down the canal and surrounding areas."
        }, 
        {
            "index": 454, 
            "rating": "4", 
            "review": "The Gentlemens Canal.. Known as the Gentlemens canal;the richest and most famous of Amsterdams merchants came to live alongside this hotel,and building some of the most beautiful and imposing houses in the whole of Amsterdam.Many of the houses are today considered to be National Monuments,bordering one of the citys most attractive canals."
        }, 
        {
            "index": 455, 
            "rating": "4", 
            "review": "Beautiful views. Herengracht is one of the three important canals of Amsterdam and that is why it is also one of the most visited and must visited places in Amsterdam. The view is spectacular and to enjoy the canal you could opt for a bike ride or a simple stroll. There are a whole lot of restaurants and pubs where you could enjoy a peaceful evening. The place is best for photo enthusiasts as the whole structure and layout of buildings around the place makes for gorgeous pictures."
        }, 
        {
            "index": 456, 
            "rating": "4", 
            "review": "High Jinks on the river. We sat on a bench and watched the locals, the tourist boats, and the party boats float by. Terrific weather helped, as did a laid back attitude!"
        }, 
        {
            "index": 457, 
            "rating": "4", 
            "review": "Nice place to stroll and enjoy Amsterdam. The architecture alone is a good reason to spend some time strolling along this canal. Very picturesque. There are shops, pubs and cafes. People are eating and enjoying life as it is on the Herengracht. I had a beer at one pub and coffee at another. It was great just watching the other revelers."
        }, 
        {
            "index": 458, 
            "rating": "4", 
            "review": "Canal with the most museum. Herengracht is one of the canals in Amsterdam. Not only beautiful buildings on the both side of the canal but also the one with the most museum. \" The Grahtenhuis\" (no.386), \"The Bible Museum\" (no.366-368), \"The Museum Geelvinck-Hinlopen Huis\"(no.518), \"Tassenmuseum Hendrikje\"(no.573), \"Museum Willet-Holthuysen\" (no.605). You can find a lot buildings with history and beautiful architecture. If you come in the winter or spring you can see the beauty of the buildings more because of no trees in front of them."
        }, 
        {
            "index": 459, 
            "rating": "5", 
            "review": "Gentleman's Row. The architecture alone is a reason to spend some time strolling here. Very picturesque. There are shops and places for coffee or eating to enjoy life as it is on the Herengracht."
        }, 
        {
            "index": 460, 
            "rating": "4", 
            "review": "A must-see. All the canals are worth a visit, as they vary quite a lot in character. However, this is one of the more applealing ones."
        }, 
        {
            "index": 461, 
            "rating": "5", 
            "review": "Historical sightseeing. Herengracht #81 is the oldest residential house in Amsterdam. I'm so passionate about this city, so I highly recommend stopping by one of the bridges crossing the canal (there are many of them!) or sitting by the water jsut to absorb some of the city's energy."
        }, 
        {
            "index": 462, 
            "rating": "4", 
            "review": "nice boat ride. Took a 60 min canal cruise which took us around the city, we mainly went through Herengracht. It was a beautiful journey."
        }, 
        {
            "index": 463, 
            "rating": "5", 
            "review": "Probably the nicest canal. Probably the nicest of the three great canals of Amsterdam. Picturesque and close to the best shopping areas."
        }, 
        {
            "index": 464, 
            "rating": "5", 
            "review": "Another fine Amsterdam canal. Like most of the canals of Amsterdam (certainly the inner rings) this is a great route to walk in the city with all sorts of sights and plenty of watering holes."
        }, 
        {
            "index": 465, 
            "rating": "5", 
            "review": "A walk in the spring sun. Herengracht is a fascinating area in which to walk and soak up the atmosphere of the city. Incredible buildings..how some of them stay up defies physics! Boats pottering up and down the canal, people on bikes going about the business and lovely places to stop and sample the local beverages and fare."
        }, 
        {
            "index": 466, 
            "rating": "4", 
            "review": "Nice to be outside. To walk around with friends it is perfect, you can entertain yourself by just looking at all kind of people going back and forth."
        }, 
        {
            "index": 467, 
            "rating": "5", 
            "review": "Wonderful place, very central. Very peaceful, whilst being in the heart of the city and close walking distance to all the good places. We rented a house there."
        }, 
        {
            "index": 468, 
            "rating": "5", 
            "review": "Beautiful!. This is another lovely place to walk along. It is one of the three best canals in Amsterdam. There are many cafes, shops, restaurants and it is so peaceful to just stroll along on a beautiful day."
        }, 
        {
            "index": 469, 
            "rating": "5", 
            "review": "The upmarket canal.. Lovely place to walk along. Some good restaurants and cafes enroute and some smart shops. Very peaceful and pretty."
        }, 
        {
            "index": 470, 
            "rating": "4", 
            "review": "Canal and beautiful buildings. So tranquil and interesting to wander through particularly on an hour long canal cruise boat.Sun was shining the day we were there which made it even more pleasant."
        }, 
        {
            "index": 471, 
            "rating": "5", 
            "review": "one of the best canals in Amsterdam. herengracht is one of the best three canals of Amsterdam with Keizergracht and prisengracht.\nThere are many wonderful historical buildings and houses, bridges, shops, streets with beautiful architecture.\nIt is worth walking around and around besides having a canal cruise here."
        }, 
        {
            "index": 472, 
            "rating": "4", 
            "review": "A walk through history. The \"Gentleman Canal\" was one of the two canals which was created for the residences of the Elite of Amsterdam. No warehouses were allowed to be built and the frontages appear much larger than the warehouses in other canals. One of the bends in the canal is meant to be called \"the golden corner\" as that is where the wealthiest residents lived.At one end of the canal is the Amstel River. At this junction is the Hermitage Museum and the \"Skinny Bridge\".I visited 3 museums along the Herengracht. All of which are based in stately town houses. They were :- Cat Cabinet : object d'arte of a cat nature- The handbag and purse museum, it was literally that, four floors of handbags etc. Very interesting, and a lovely café.- Museum Willet-Holthuysen, this is a mainly period furnished merchants town house.Worth the walk, but all of the canal cruises travel along this route"
        }, 
        {
            "index": 473, 
            "rating": "5", 
            "review": "Herengracht, Prinsengracht & Keizersgracht (Emperor's Canal) -- 3 Great Amsterdam Streets On Canals. The Prinsengracht, Herengracht and Keizersgracht are 3 of Amsterdam’s most famous streets located on canals within the city center. These 3 streets and canals are south of Central Station (train depot) and Dam Square. They radiate south and outward from Dam Square in a curved or convex pattern, akin to the 5 lower sides of an octagon. Large sections of all 3 are walkable in a morning or afternoon. The ambiance of the canals, the architecture, the bicycles, the people and the shops, bars and cafes are what Amsterdam is all about. They are the contemporary live museums of Amsterdam. If you are interested in how and when these canals and houses were built, and good stories about some of the people you know that lived in these houses, along with the history and culture of Amsterdam and its place in the world, then read Russell Shorto’s Amsterdam, a wonderful and inspiring book, that will also inform you about the roots of individual freedom and the great advances of the Enlightenment."
        }, 
        {
            "index": 474, 
            "rating": "5", 
            "review": "Beautiful Water/Walk Way. The main boulevard of Amsterdam with some of the city's best architecture. Canal boat is good way to tai it all in, but the walk will give you the best chances to see Ye Olde Amsterdam. Nice shops and watering holes along the route."
        }, 
        {
            "index": 475, 
            "rating": "5", 
            "review": "View!. I walked along here several times. It is a breathtaking spot especially if you sit down to relax and just look around. Worth a visit or walk through."
        }, 
        {
            "index": 476, 
            "rating": "5", 
            "review": "Check out the KittenKabinett. Lovely walk along the Herengracht to number 497 where you'll find a lovely museum which displays all things to do with cats. Pictures and sculptures all about cats. Not busy at all when we were there (February 2014) and only 6 euros to get in.Also cats wandering about and asleep on cushions!"
        }, 
        {
            "index": 477, 
            "rating": "5", 
            "review": "beautiful. the canal is amazing, even the rain and cold could not put us off doing a canal trip. wonderful. if you walk along the canal there is so much to see and do."
        }, 
        {
            "index": 478, 
            "rating": "5", 
            "review": "Beautiful. On our visit to Amsterdam. we walked up and down the Herengracht several times and took the canal boats for a more relaxed travel and view of one of several main canals. Beautiful architecture of which there are so many wonderful historical buildings and houses, bridges, shops, streets etc the list is endless of what to see. People watching is good fun too. A must to visit!"
        }, 
        {
            "index": 479, 
            "rating": "5", 
            "review": "Fantastic canal to slow down and soak up the atmosphere. Strolling down the tree lined, cobble stoned streets of the Herengracht was one of my favorite pastimes while in Amsterdam. Beautiful, picturesque homes line either side of the canal with plenty of photo taking opportunities. Canal boats often drift silently by as they pass underneath the numerous bridges crossing over this serene canal. You get a true idea of what living in Amsterdam is really like by letting the atmosphere wash over you while slowing down to explore one of the most stunning canals in Amsterdam."
        }, 
        {
            "index": 480, 
            "rating": "4", 
            "review": "Picturesque. One of the main canals in the ring in central Amsterdam, well worth a browse either on foot or on a canal trip. Lots of historic houses, the narrowest house in Amsterdam, varying gable styles, bridges, trees, bicycles, cobbled streets, cafes, shops, house boats, flower market, the list goes on, so much to see and all evoke the picture postcard vision of the city."
        }, 
        {
            "index": 481, 
            "rating": "4", 
            "review": "One of a kind. With Prinz and Keizersgracht, just one canal to enjoy walking and looking around. The light, the colors, the quaint bars and cafes... It makes you enjoy the city for it has to offer."
        }, 
        {
            "index": 482, 
            "rating": "4", 
            "review": "full of interest. lots to see. Particularly enjoyed the Willem Hothouzen (spelt wrongly) canal house you can visit at the SE end, furnished as per 17 th century"
        }, 
        {
            "index": 483, 
            "rating": "5", 
            "review": "So atmospheric!. We loved wandering along this canal, and others in the canal district. The bikes parked on the bridges, the barges and cruise boats sailing along below, lots of cafes, little shops and the flower market are all just so atmospheric and typical of what we expect in Amsterdam, as tourists.We had lunch in De Prins. What a fantastic authentic Dutch cafe - across from Anne Frank's House."
        }, 
        {
            "index": 484, 
            "rating": "4", 
            "review": "Lovely.. We took a 2-hour cruise in the main canals of Amsterdam.They are absolutely lovely, with many boats that are actually homes of people, a lively atmosphere and great architecture all around.Highly recommended."
        }, 
        {
            "index": 485, 
            "rating": "5", 
            "review": "Canal Cruise is Worth the Line. I have taken the canal cruise many times and never tire of seeing the beautiful homes and business along the canals. Definitely worth it."
        }, 
        {
            "index": 486, 
            "rating": "4", 
            "review": "Beautiful canal. We enjoyed staying in a hotel on the Herengracht. Fun little cafes to sit and enjoy the views. Spent many hours strolling in all the neighborhoods and shopping nearby. Easy access to many of the museums in the area. From Herengracht, we walked to the National Museum, Anne Frank's House, and The Dam."
        }, 
        {
            "index": 487, 
            "rating": "5", 
            "review": "Best city restaurants. We found here at least three of the restaurants that are counted among the best here in Tripadvisor. All were very good. Season, MAX, and Tasca Bellota. Greatly recommended."
        }, 
        {
            "index": 488, 
            "rating": "5", 
            "review": "good !. good....a bit fashion....and the people working here are sweet and efficient...specially this butch blonde nederlander man ...surounded by a team of very nice girls"
        }, 
        {
            "index": 489, 
            "rating": "5", 
            "review": "Check out the market. One of favourite locals in the Dam. Great market plus fantastic choice or cafes, bars, restaurants etc"
        }, 
        {
            "index": 490, 
            "rating": "5", 
            "review": "check it out by boat. Loved the one hour cruise around the Herengracht, a lot to take in, especially the smallest house in AmDam, only 1 metre wide!"
        }, 
        {
            "index": 491, 
            "rating": "5", 
            "review": "Great place for a drink.. Great place for a drink and some bites.\nAtmosphere was stellar and really enjoyed the service- friendly staff."
        }, 
        {
            "index": 492, 
            "rating": "4", 
            "review": "Market. We looked around the market at Herengracht and it was a lovely typical market with loads of lovely food goods and plants. It was very atmospheric and surrounded by great bars and restaurants. Well worth a visit."
        }, 
        {
            "index": 493, 
            "rating": "5", 
            "review": "wonderful old merchant houses. This canal holds special memories for me as my grandmother used to live here - good to see her old house again from the outside, albeit inside, it's now been carved up into very expensive apartments"
        }, 
        {
            "index": 494, 
            "rating": "4", 
            "review": "A relaxing walk along the 'gentlemen's canal'. I used to stay at a hotel on Herengracht (the Ambassade) and always loved the walk along the canal, particularly at quiet times, when one can appreciate the beauty of the large buildings and the tranquility of the area. I still enjoy the walk along this canal in one of the most beautiful areas of the City."
        }, 
        {
            "index": 495, 
            "rating": "5", 
            "review": "walking along the channel. a day with clouds but with a romantic moode walking with my friend along the channel...superb experience!!!....don't miss to visit Herengracht...after that you will feel piece in your spirit...try it either at 11 in the morning either early in the night when the lights give a magic atmosphere...enjoy it!!!"
        }, 
        {
            "index": 496, 
            "rating": "5", 
            "review": "Clean & Nice Street. Clean & Nice street to walk around, especially if you are into photography. Close by the Dam and the place of action, but far enough to be quieter than the Dam."
        }, 
        {
            "index": 497, 
            "rating": "5", 
            "review": "My favourite. My favourite of the 3-canals , great architecture, the \"Golden Bend\", shops and Restaurants, not too touristic either."
        }, 
        {
            "index": 498, 
            "rating": "5", 
            "review": "One of the most beautiful canals in Amsterdam. Do make sure you walk alongside this canal, which with the Keizergracht is one of the most majestic in Amsterdam,"
        }, 
        {
            "index": 499, 
            "rating": "4", 
            "review": "Quiet posh district..... Take a walk down this street and admire the bourgeois houses.\nEnjoy the stroll along the canal and step back in time...."
        }, 
        {
            "index": 500, 
            "rating": "5", 
            "review": "Very lovely canal and buildings. My wife, two daughters (14 and 12), and I stayed in a hotel along the Herengracht canal and found it to be a wonderful choice. The canal, and the buildings along the canal, are what you think of when you imagine Amsterdam. There are some nice food options close by and we very much enjoyed \"people watching\" in this area of town. Just walking around and soaking in the sights and sounds of this section of town was a treat. We were surprised at how much we liked Amsterdam and this area of town is part of what we liked."
        }, 
        {
            "index": 501, 
            "rating": "5", 
            "review": "Next canal belt. Herengracht is a very uppmarket canal belt, with beauty. Houses and hotels reside here mostly. amazing classic amsterdam, the street runs on both sides \"one way system\", of the river and can be a bit confusing to find your way to the hotel or the right number.If lost just look at the other side!!  I mean it feels like your some kind of lord straying the night at this canal belt. Very quiet at night time and a lovley place to go outside take a seat and breath in Amsterdam."
        }, 
        {
            "index": 502, 
            "rating": "5", 
            "review": "Beautiful. Another great street to walk on. Great architecture to admire as well as the beautiful canals. This is one of the three major canals in Amsterdam."
        }, 
        {
            "index": 503, 
            "rating": "5", 
            "review": "Canal life is good. Staying in a houseboat on the canals is a great way to enjoy a holiday in Amsterdam. The Herengracht offers a great selection of shops and restaurants. Walk all the way down it and look at the shops on the side streets. It's sometimes nice to get away from the crowds and a walk here is perfect x"
        }, 
        {
            "index": 504, 
            "rating": "5", 
            "review": "Aquatic avenues.. Just like all grand cities Amsterdam has its tree lined avenues. However unlike most cities they are wonderfully reflective canals awash with colour and images of the beautiful architecture. We were there in autumn, the trees were still leafy but the colour was starting to turn from green to golden. A walk along the canal during the day was for studying the buildings but at night the water and reflections changed it into a sparkling wonderland, romantic almost ethereal place."
        }, 
        {
            "index": 505, 
            "rating": "5", 
            "review": "Happy Wandering. This is an amazing area to wander through. Lots of people - if you are into people watching. There are so many different shops. You can eat just about anything you can think of. The buildings around are so interesting - very well preserved and maintained. We stayed at Sunhead of 1617 - a B&B located on the canal. A great place because we could go out and wander at all times. I would highly recommend strolling at night - a totally comfortable spot to be. Hoping to go back sometime."
        }, 
        {
            "index": 506, 
            "rating": "5", 
            "review": "Love the stroll. Beautiful walk especially at night after having a dinner. Some great benches to watch the activity of the canal boats."
        }, 
        {
            "index": 507, 
            "rating": "5", 
            "review": "Take lots of pictures and then. Take lots of pictures and then visit the City Archives where you can buy a book detailing the history of every house on the street."
        }, 
        {
            "index": 508, 
            "rating": "4", 
            "review": "The most attractive of the principal canals. The 17th century place to live for the fashionable nouveau-riche of the time, the architecture is varied and interesting. It's boardered by small quiet streets and the occasional shop and bar, as all the principal canals are, but it seems calmer."
        }, 
        {
            "index": 509, 
            "rating": "5", 
            "review": "fun neighborhood. lots of activity, small restaurants (choose carefully, a lot of them are horrible), families and youths roaming the streets, very cool spot."
        }, 
        {
            "index": 510, 
            "rating": "4", 
            "review": "Where the stately houses are.. What's not to like in this city of canals! Do a canal tour to orient yourself, and then stroll along the canals, avoiding the cyclists. Pity the parked cars prevent you walking along the edge of the canal."
        }, 
        {
            "index": 511, 
            "rating": "3", 
            "review": "Nice. Great for a quick snack and coffee although the service can be a bit slow. Been several times and enjoy the atmosphere of sitting on the canal."
        }, 
        {
            "index": 512, 
            "rating": "5", 
            "review": "just sit and relax. our hotel, rembrandt classic, was located on Herengracht Canal and we spent half an hour every evening sitting on its side, smoking a spliff, enjoying the amazing view and great smooth wind!"
        }, 
        {
            "index": 513, 
            "rating": "5", 
            "review": "How People Live. We spent a week in an apartment overlooking Herengracht at Herenstrasse, a virtual parade of insights to the daily life of Amsterdam's residents. From the party boats and tour boats on the canal (I highly recommend taking a canal tour), to seeing the inventiveness of what people transport on bicycles, this was a fascinating parade. The walk along this street, with electric cars being charged and metal gutters for bringing bicycles up and down steep subterranean apartments, is interesting. It's a tranquil step back in time with lots of places to shop or enjoy refreshments."
        }, 
        {
            "index": 514, 
            "rating": "4", 
            "review": "lovely canal with pretty Amsterdam frontages!. nice to wander along in the sunshine soaking up some of the special Amsterdam atmosphere and enjoying those wonderful Dutch gables"
        }, 
        {
            "index": 515, 
            "rating": "3", 
            "review": "Its a canal and there is water. Was I supposed to see something unique or special? It was a perfectly fine canal --water and all. I must say, though, that it looked much like all the other ones did. Some of the leaning houses were pretty cool."
        }, 
        {
            "index": 516, 
            "rating": "5", 
            "review": "There are lots of tourist places around here.. Our hotel was situated on Herengracht with fabulous views over the canal. There are lots of tourist places around here. We were only a short stroll to Rembrantplein, a bustling square with lots of bars and restaurants.Also nearby is the Cat Cabinet, and the Museum of bags & purses. And you will also find Waterlooplein near here, for busy street markets, the floating garden markets, and the Botanical Gardens."
        }, 
        {
            "index": 517, 
            "rating": "4", 
            "review": "a lovely walk. Excellent sites with some shops, museums (try the Bible museum) and canal as you walk this way in Amsterdam - worth the walk from the station and not to far....."
        }, 
        {
            "index": 518, 
            "rating": "5", 
            "review": "always a nice walk. a nice coffeeshop there :) and don't forget about bikers while sightseeing! have nothing to add here, you better take a walk there yourself, enjoy and smell the Amsterdam."
        }, 
        {
            "index": 519, 
            "rating": "5", 
            "review": "Beautiful!. Our hotel was on this street! Gorgeous!! (The Rembrandt Classic Hotel) Quiet street with lots of caracter. Residential, people take care of their property - nice canal for people watching passing in boats!"
        }, 
        {
            "index": 520, 
            "rating": "5", 
            "review": "Beautiful canal - nice bar. If walking along the Herengracht, take time to stop at the Herengrach Bar and Grill at the intersection with Leidsestraat. In the evening it is an oasis of calm and tranquility with just the right ambience to really put you in a relaxed frame of mind. Pleasant staff and owner and reasonable prices."
        }, 
        {
            "index": 521, 
            "rating": "3", 
            "review": "Lovely strolling along the canal. Another beautiful and lovely Canal of this wonderful city, but it is exactly like the others, enjoy the strolling and the amazing panoramic view all around.\nThe Canal is nice and offers a stunning view, I really appreciated the beautiful buildings along it and all the typical boat sailing the Canal.\nNice and romantic atmosphere."
        }, 
        {
            "index": 522, 
            "rating": "4", 
            "review": "Lovely canal. One of the main canals in Amsterdam . This one is lovely with numerous good restaurants and cafes nearby. Good place for a meal since it is very lively all day there."
        }, 
        {
            "index": 523, 
            "rating": "5", 
            "review": "Lovely Place. the Herengracht is one of the beautiful canals in Amsterdam. If you are in spring, fall or summer at the Herengracht and it is a sunny day you see all the Amsterdam people on their boats. Just a lovely place."
        }, 
        {
            "index": 524, 
            "rating": "5", 
            "review": "Walking tour. We walked about half the length of the canal. Important to look up and admire the gables. The houses are more imposing than on other canals as this one was home to the wealthy."
        }, 
        {
            "index": 525, 
            "rating": "5", 
            "review": "Best part of Amsterdam!. The waterways in Amsterdam are unique and so full of character! Take some time to get a boat cruise around and take in the architecture of the buildings - some as old as the 1500's. it was a first for me. I'm sure it is even more interesting in the different seasons, but the summer sun did it a world of justice! Every corner is a picture perfect scene!"
        }, 
        {
            "index": 526, 
            "rating": "4", 
            "review": "Beautiful canals!!. Did a boat hop on hop off pass the area and had a walk through the area as well. Very nice canals and bridges and is a good place to have a wander especially on cooler days and in th evening. Stop by one of the pubs or restaurants by the canal if you can and have a relaxing time watching boats pass by on the canal."
        }, 
        {
            "index": 527, 
            "rating": "4", 
            "review": "Another beautiful Canal. They are all pretty good in Amsterdam aren't they! The boats, the architecture, lined with trees and the street lights at night. It is a beautiful city. I could walk the canals all day!"
        }, 
        {
            "index": 528, 
            "rating": "5", 
            "review": "Stately Homes. We stayed at a hotel (Banks Mansion) on this canal. It is lined by well-kept homes (including the mayor's). The name \"Herengracht\" means Gentlemen's canal, more or less. Be sure to look up at the ornamental roof decorations on many of the homes. One interesting incident we witnessed while eating at a canal-side restaurant was a dredge fishing out derelict bicycles and other things. The attached garbage barge was nearly filled as we ate lunch. When you see the hundreds of bikes locked to railings around each canal bridge, you can believe the numbers that are dumped!"
        }, 
        {
            "index": 529, 
            "rating": "5", 
            "review": "Just go for a wander.... Prinsengracht and its neighbours Keisergracht and Herrengracht are amongst the nicest avenues in the city, and well worth a prolonged stroll. You'll find a wide range of shops and cafés, but also lots of hidden-away little-known galleries, institutes with open libraries, and other attractions. Each side street opens up into more bars and cafés and sometimes considerably more including some of the more famous attractions and squares."
        }, 
        {
            "index": 530, 
            "rating": "4", 
            "review": "Take a step back in time. I love Amsterdam and you can never get enough of the canals and bridges... I'm here for 6.5 weeks so i thought it was useful to buy a cheap bike for €65. I rode from the Haarlemmerstraat to the Bags and Purses museum and it was such a wonderful and tranquil ride, big beautiful canal houses and house boats and characteristic bridges. You feel like you're not in Kansas anymore! Put on your most comfortable walking shoes and make sure to visit if you're in town."
        }, 
        {
            "index": 531, 
            "rating": "5", 
            "review": "Beautiful streets with lovely historic buildings. A must-see while in Amsterdam, every building has some interesting feature. Lovely to meander along on a summers day but be careful of the cyclists who don't always ring their bells to alert jaywalking tourists!"
        }, 
        {
            "index": 532, 
            "rating": "5", 
            "review": "Quiet canal just minutes away from most major attractions.. My wife and I really enjoyed the Herengracht canal and street for its convenient location, and for its beautifully characteristic bridges and views of Amsterdam."
        }, 
        {
            "index": 533, 
            "rating": "3", 
            "review": "Typical Amsterdam Canal. The eastern end of the canal held more interest being near Rembrandtplein and the Museum of Bags and Purses. Should have walked down here at night to see more of the lights (but in June that is very late). Not as many restaurants on the canal as Prisengracht it seems. Taking a canal tour is a good way to get an orientation."
        }, 
        {
            "index": 534, 
            "rating": "5", 
            "review": "Heaven. This is a very lovely picturesque canal conducive to walking and boat watching. We enjoyed the streets along the canal with lovely homes and flowers"
        }, 
        {
            "index": 535, 
            "rating": "5", 
            "review": "Beautiful at Night. Along the Herengracht, you will find the Bridge of 15 Bridges, which looks exceptionally beautiful at night. I would recommend either taking a boat cruise or walking, alternatively cycling if you have one available. There are also some good cafés scattered around the Herengracht."
        }, 
        {
            "index": 536, 
            "rating": "3", 
            "review": "Boat tour. A fun and relaxing thing to do. The cost was good for what you get. The recorded audio explanations were sometimes hard to hear and could have been better. We would do it again or maybe try a different company or route."
        }, 
        {
            "index": 537, 
            "rating": "4", 
            "review": "Lovely walk. Walking by Herengratcht is a must do in Amsterdam. Its cafes and beautiful lights at night during summer months were unforgetable."
        }, 
        {
            "index": 538, 
            "rating": "5", 
            "review": "Great paintings. The Rembrandt collection is amazing, especiallly the Nightwatch.Also they have many other famous paintings, the Italian collectiion is lovely."
        }, 
        {
            "index": 539, 
            "rating": "4", 
            "review": "Walk or take a boat. A must-see if you're in Amsterdam. Lovely canal houses speak of the character and styles of Europe's middle class at the time when it was just emerging."
        }, 
        {
            "index": 540, 
            "rating": "4", 
            "review": "park your bike, cultural tour. best to park your bike here when visiting the Bible Museum, its' on this canal and there's a bike rack right outside. You can also bring a lunch and eat on the canal and then on your way."
        }, 
        {
            "index": 541, 
            "rating": "5", 
            "review": "Every bit as wonderful as the other inner-ring canals. I have spent a lot of time over the years walking along this canal and snapping photos of its houses and their gables. This is a place to bring not only your camera, but also your binoculars. Fabulous ornate mansions and canal houses line both sides. I can't recommend highly enough this wonderfully educational (architecturally and historically speaking) slice of Amsterdam's elegant past. Many buildings here were built before 1750, and some before 1700."
        }, 
        {
            "index": 542, 
            "rating": "5", 
            "review": "More gardens. we were lucky enough to meet some of the owners of these unique spaces and they were charming and welcoming and pleased to talk to visitors."
        }, 
        {
            "index": 543, 
            "rating": "3", 
            "review": "As beautiful as the other canals of the Grachtengordel. The Herengracht is, as any of the Amsterdam canals go - pretty! The oft-mentioned Golden Bend is a beautiful stretch to see but did not find that it stood out over other stretches of fine houses lining Prinsengracht and Keizersgracht, or even the smaller canals. One cannot go inside many of the listed historic buildings along Herengracht (eg., oldest house and Bartolotti house) and therefore these can only be appreciated from the outside for their architecture. As such, a boat cruise would suffice for this endeavour, although strolling along the canals is equally enjoyable with comfortable stops to be had in cafes or benches."
        }, 
        {
            "index": 544, 
            "rating": "5", 
            "review": "One of Three Major \"Belt-way\" Canals. See it!. Seeing the canals of Amsterdam is, to me, an essential part of a visit to the city. The Herengracht (Patricians' Canal or Gentlemen's Canal) is the second major ring canals, the first of the three major canals dug around the city centre in the 17th century. The other two are the Prinsengracht (Prince's Canal) and Keizersgracht (Emperor's canal). The canal is named after the heren regenders who governed the city in the 16th and 17th century. The most fashionable part is called the Golden Bend, with many double wide mansions, inner gardens and coach houses on Keizersgracht. If you travel around Amsterdam very much, it is hard to avoid encountering this large canal. It is a bit hard to tell one canal from the other, having a map and giving it a look before traveling the city is probably a good idea. This canal can be seen by various means, one of the canal boat tours may be the easiest."
        }, 
        {
            "index": 545, 
            "rating": "4", 
            "review": "Consider the Canal Museum. Apart from being the \"smartest\" canal in terms of buildings and a very nice walk or boat ride, the canal museum opened in 2012 is worth a visit. It's not very big, in a very well maintained building along the canal and an extremely well done multimedia experience. Good for a 45 minute to one hour visit."
        }, 
        {
            "index": 546, 
            "rating": "4", 
            "review": "Gentleman's canal. We visited both on foot and by boat, the trees, the lovely houses and the elegance. There are plenty of other similarly elegant canals and streets. A walking tour is the way to get to know them properly- with someone who has a good historical knowledge"
        }, 
        {
            "index": 547, 
            "rating": "5", 
            "review": "Gorgeous homes along the canal. The buildings on this canal are among the most elegant in Amsterdam and well worth seeing. Our hotel was on this canal so we had the pleasure of following it almost every day of our five day stay. The mayor's house is there as are many other gorgeous homes."
        }, 
        {
            "index": 548, 
            "rating": "5", 
            "review": "nice canal. It was very beautiful. We walked the whole street to the Amstel river. There is one street where you can see all the bridges. We walked by it but saw it on the canal cruises. I took many pics of the buildings and canals!"
        }, 
        {
            "index": 549, 
            "rating": "4", 
            "review": "Grachten-cruise to relax and explore. You are of course a tourist, you are not alone, but instead of a Touristbus-tour, you take a Grachten-cruise. You ship through the harbour and along the three most important and scenic Grachten. You see all kinds of houseboats, you cross some noisy \"party-boats\", you experience Amsterdam from an attractive and different ankle, you will see picturesque places to visit again afterwards by bike.And if you board your boat in the late afternoon (before sunset) with a small white wine and some snacks, it's a totally relaxing one-hour-cruise! Don''t miss it."
        }, 
        {
            "index": 550, 
            "rating": "5", 
            "review": "Central yet quiet. This is a great location,and my residence for the stay in Amsterdam.It's right on the 9 streets and central for all the attractions."
        }, 
        {
            "index": 551, 
            "rating": "3", 
            "review": "nice. Nice area, typical of Amsterdam and not very special one to be honest! I just enjoyed walking around .."
        }, 
        {
            "index": 552, 
            "rating": "4", 
            "review": "9 streets. Small boutique shops selling everything and anything cool. There are 9 streets of these small streets.definitely worth a stroll."
        }, 
        {
            "index": 553, 
            "rating": "5", 
            "review": "Best canal in Amsterdam. Our hotel, the Ambasade was on Herengracht. One might expect a street with access to restaurants and attractions might feel busy and hectic. Not so. Although we were within minutes of everything, it was so quiet and picturesque."
        }, 
        {
            "index": 554, 
            "rating": "4", 
            "review": "Beautiful canals. Take the \"Hop on hop off\" canal bus and see all the major canals. The view is different from the water."
        }, 
        {
            "index": 555, 
            "rating": "4", 
            "review": "Another beautiful canal. Herengracht is the first canal past the Singel canal, and like the Singel its full of beautiful townhouses, bridges, and typical quaint Dutch architecture. Far enough away from the hustle and bustle of Damrak and Dam square but still only a leisurely 10 minute walk from either. Also you'll find some nice cafes and places to grab a bite to eat. Definitely worth a stroll along the Herengracht on a nice afternoon or early evening, just remember to wrap up warm if its not in the summer months as the wind can get pretty chilly between the tall buildings either side of the canal."
        }, 
        {
            "index": 556, 
            "rating": "5", 
            "review": "Admiring architecture!. What a way to admire Amsterdam architecture! We first took the canal boat cruise to see the houseboats from the canal and then we walked to admire the surroundings at our own pace. Not to miss while in Amsterdam."
        }, 
        {
            "index": 557, 
            "rating": "4", 
            "review": "Central. Stayed here for three nights before travelling to Tilburg for a wedding. Can't remember the name of the hotel,but it was located on the Herengracht canal. The canal is very close to the centre and the railway station but far enough away for there to be no crowds or noise.Lovely canal for a leisurely walk. There are cafes and restaurants and the odd \"coffee\" shop.Would recommend"
        }, 
        {
            "index": 558, 
            "rating": "5", 
            "review": "Canal Cruise. We passed through Herengracht on a night canal cruise and it was wonderful seeing the grand old houses along this canal."
        }, 
        {
            "index": 559, 
            "rating": "5", 
            "review": "Great place to walk. This canal is worth wandering along, preferably with a good guide book. We stayed around the corner and regularly walk along it to find, cafes, eateries and some funky galleries."
        }, 
        {
            "index": 560, 
            "rating": "4", 
            "review": "As beautifull as the rest of the center of the old Amsterdam.. A nice part of the \"canals\" area... :-) Close enough to the central station and to the very center of the city, plenty of nice restaurant around !"
        }, 
        {
            "index": 561, 
            "rating": "4", 
            "review": "Beautiful and relaxing. Beautiful and relaxing canal with varieties of architetures and shops. One stop for walk, scene, food, drink and etc. Worth a visit."
        }, 
        {
            "index": 562, 
            "rating": "5", 
            "review": "Beautiful. I really recommend that everyone takes a trip on the canal.... It is beautiful and you really see what the city is all about"
        }, 
        {
            "index": 563, 
            "rating": "5", 
            "review": "Great architecture. The canals are a world attraction and its well worth investing in a good guide book so you can more fully appreciate the history of this part of Amsterdam. Yes, you can just look at the facades but a few facts and pointers to interesting buildings add to its visual value."
        }, 
        {
            "index": 564, 
            "rating": "4", 
            "review": "One of the fluid trademarks of Amsterdam. If you walk from the Rembrandtplein to the the Utrechtsestraat, you will have a perfect start to experience the Amsterdam 'grachten' with their bridges. Many rich and famous Dutch artists,musicians and tc personalities own a house that is situated on a 'gracht', like this Herengracht."
        }, 
        {
            "index": 565, 
            "rating": "5", 
            "review": "A gorgeous canal from end to end. This canal has a lot to offer, from gorgeous views to places to shop and eat, as well as museums. It's worth walking end to end."
        }, 
        {
            "index": 566, 
            "rating": "5", 
            "review": "We saw it from our Hotelwindow.. One of the great sights in town. Lovely houses allong the gracht and plenty great bridges to explore its beauty"
        }, 
        {
            "index": 567, 
            "rating": "5", 
            "review": "Great Canal walk. In my opinion:\nJust as nice as the Prinsengraht.\nBut did not walk as long as I did on the Prinsengracht.\nWalked to Haarlemstraat from the Herengraght from Rozengracht.\nLoved the walk."
        }, 
        {
            "index": 568, 
            "rating": "5", 
            "review": "Beautiful and elegant. We stopped in a bed and breakfast (Sunhead of 1617) on the Herengracht and were witnesses to the canal boats and many bridges, all lit up at night. Great place to walk."
        }, 
        {
            "index": 569, 
            "rating": "4", 
            "review": "Good. Walking along the canals, its sometimes difficult to believe how close they are to the centre of Amsterdam. Strolling along the canals next to the beautiful houses is like walking in another world. Rather than just walking over the bridges to the next canal, make sure you take time to walk alongside the canals and take in the beautiful scenery.."
        }, 
        {
            "index": 570, 
            "rating": "3", 
            "review": "Not so great on a winter evening. We took a boat tour of the Herengracht around 6pm in January. The tour was shortened compared to the brochure and was generally disappointing as there was not much to see after dark from the boat."
        }, 
        {
            "index": 571, 
            "rating": "5", 
            "review": "beautiful in all weathers. Both walking and boating along the Herrengracht is lovely. The architechture is just amazing. Such elegance! One can easily remember a time gone by when Amsterdam enjoyed a golden age. Walk all the way along the canal as far as the Westerkirk. Museums to visit en route. Windows to peep into. Art galleries. The 9 streets (an area of lovely boutiques and restaurants) All offers a visual feast"
        }, 
        {
            "index": 572, 
            "rating": "3", 
            "review": "canels!. one of the most iconic peices of Amsterdam must be the Canels. The Herengracht is no exception on this rule. a beautiful piece of the city, and a joy to walk past the boats, and perfectly conserverd houses gives you an insighht in what the golden age of Amsterdam must be like."
        }, 
        {
            "index": 573, 
            "rating": "4", 
            "review": "Beautiful canal, nice place for a stroll. The Herengracht is a nice plce for an afternoon or evening stroll depending on the season. This canal is on the itinerary of most canal trips as it is one of the three major canals in Amsterdam. There a lot of typical Amsterdam homes and also good restaurants and hotels. There are also a couple of places which are interesting, an institute for gender equality and emancipation of women and a place where dedicated to cats. Good place for pictures and to enjoy the clean air."
        }, 
        {
            "index": 574, 
            "rating": "5", 
            "review": "Canals. amazing view, amazing canals!this street is lively and full of shops! I have loved everything I saw, especially the little and cute shops, together with bars and cafés"
        }, 
        {
            "index": 575, 
            "rating": "5", 
            "review": "Beutiful canals :). We were lucky enough to pass here a lot since our friend lived there whilst our stay in Amsterdam. It is so close to Dam Square or the main Central Station (some 5-10 min walk) and offers a great view on the canals - just perfect for taking pictures by day or night :)"
        }, 
        {
            "index": 576, 
            "rating": "5", 
            "review": "lovely canal with some striking architecture. We did one of the canal cruises and saw a bit of Herengracht, so we went back and walked the entire length. A good way to see a cross section of the canal ring and some beautiful buildings along the canal."
        }, 
        {
            "index": 577, 
            "rating": "4", 
            "review": "All those Grachts. If you like just to walk and see more and more of these unique houses, boats, boat houses, bridges and more and more little grachts - just walk along the Herengracht, or any of the other surrounding canals. Ice, broken ice, ducks, seagulls, swans and many beautiful views are all there. Lovely."
        }, 
        {
            "index": 578, 
            "rating": "4", 
            "review": "Beautiful area. Another beautiful area to walk through in Amsterdam. The canals are very helpful as a guide when trying to navigate the area. Watch out for bicycles, of course."
        }, 
        {
            "index": 579, 
            "rating": "4", 
            "review": "Pretty area. Walking along the canals, its sometimes difficult to believe how close they are to the centre of Amsterdam. Strolling along the canals next to the beautiful houses is like walking in another world. Rather than just walking over the bridges to the next canal, make sure you take time to walk alongside the canals and take in the beautiful scenery and quirky buildings."
        }, 
        {
            "index": 580, 
            "rating": "4", 
            "review": "Canal boat trip. There are various routes taken by the different Canal boat companies. The one I chose travelled along much of Herengracht. Lovely to see the old houses and hear something of their history."
        }, 
        {
            "index": 581, 
            "rating": "5", 
            "review": "What makes Amsterdam unique. The canals and tipical dutch houses are some of the architecture aspects what makes Amsterdam unique"
        }, 
        {
            "index": 582, 
            "rating": "5", 
            "review": "Very romantic canal & central hotel. We centered our recent visit on this canal, staying in the excellent Banks Mansion. Please see my review there for details- They told us about the Canal Bus, it's a hop on hop off.. which has several stops on this canal. Also the Rembrantplein is close by with shops, bars & resturants. We walked this canal from end to end, with it's house boats, intresting gabled ended buildings & bridges."
        }, 
        {
            "index": 583, 
            "rating": "5", 
            "review": "Herengracht, prinsengracht, keizersgracht.... All canals are beautiful. It is worth the trip to Holland. I am grateful that I can always go to Amsterdam for a day.don't miss it!"
        }, 
        {
            "index": 584, 
            "rating": "5", 
            "review": "lovely quiet area. we stayed at the Banks Mansion fabulous hotel in this area and couldn't have been happier. We had a choice of very regular trams to take us really close and Rembrants plein/ square around the corner for bars and resturaunts...what more could you ask for !! Would definately stay there again, best hotel I have ever stayed in !!"
        }, 
        {
            "index": 585, 
            "rating": "4", 
            "review": "Beautiful canal. Nice views of the canal with XVII to XIX houses, take your time to enjoy it, nice to see with day light and in the evening"
        }, 
        {
            "index": 586, 
            "rating": "5", 
            "review": "Quiet, Nice. I stayed along Herengracht for 3 nights. It's pretty quiet. Some canal tours came by, but little traffic and almost no tourists in the area we were in. Beautiful canal."
        }, 
        {
            "index": 587, 
            "rating": "5", 
            "review": "Beautiful. I stayed along here a few nights. It is stunning, there is everything you need within walking distance. It's worth seeing at night too, all the lights around the canals it looks beautiful. If you stay near here check out Spui, lots of good shops. Some stuff pretty cheap compared to Australia."
        }, 
        {
            "index": 588, 
            "rating": "5", 
            "review": "Brilliant. Loved everything - must see! Absolutely stunning and lots to see. The canals are beautiful and the boutique shops are great. Leads you to lots of little places you might have missed! Very stylish and quiet part of The Dam but also easily accessible to the main parts and dining areas"
        }, 
        {
            "index": 589, 
            "rating": "5", 
            "review": "Beautiful canal. The architecture of the canal houses is brilliant; the boats tied up along the main \"gracht\" and the smaller ones feeding into it. Herengracht is elegant, and has terrific, well-curated shopping. Leisurely, lovely and worth walking along... heaven!"
        }, 
        {
            "index": 590, 
            "rating": "5", 
            "review": "Nice quiet canal. Of the main canals in West Amsterdam, this is the quietest one. Don't miss 't Arendsnest for the best dutch beer selection in town. The Belgisch Restaurant Lieve next door has great food!"
        }, 
        {
            "index": 591, 
            "rating": "4", 
            "review": "Canal boat rides were the way to go.. The boat captains were very kind and informative. Also when we came to a stop which we thought was going back to where we came we discovered that our stop was across the canal which entailed retracing out steps up the street across a bridge and then back down on the other side of the canal. It was POURING rain so the captain of the canal boat offered to take us across to the correct stop, which he did. He radioed the correct boat and they transferred us directly from boat to boat. They could not have been kinder or more helpful."
        }, 
        {
            "index": 592, 
            "rating": "5", 
            "review": "The spirit of Amsterdam. Actually, all the main canals, Hernegracht, Keizersgracht & Prinsengracht are beatiful. Walk anticlockwise from the station end. Cross and re-cross the bridges and wind around, look up to the gabled ends of the buildings. This is Amsterdam at its best. You will find fine houses, strange houseboats, beautiful churches, cats on doorsteps, small cafes, but few shops. Watch out for bicycles - they don't like pedestrians."
        }, 
        {
            "index": 593, 
            "rating": "4", 
            "review": "Herengracht vistas. Simply a lovely area to wander and view the canals and bridges and of course the bike riders galore."
        }, 
        {
            "index": 594, 
            "rating": "4", 
            "review": "Great for rainy day. 100 sites of Amsterdam leaves from in front of Centraal Station. Worthwhile trip on a comfortable boat."
        }, 
        {
            "index": 595, 
            "rating": "4", 
            "review": "Nice bridge. It's really a nice place and area in Amsterdam. It's romantic and very nice during the evening. it's a must -do during your trip in Amsterdam."
        }, 
        {
            "index": 596, 
            "rating": "5", 
            "review": "thats great. during I'm visit, there was has rainbow.... :)It was wonderfull..I go there with my collegue. hopely i can saw the rainbow again.."
        }, 
        {
            "index": 597, 
            "rating": "5", 
            "review": "Another sterling canal. Located along the same parallel lines as the Prinsengracht, this is another canal [gracht] that rings the centrum of the sity."
        }, 
        {
            "index": 598, 
            "rating": "5", 
            "review": "Beautiful area with historical houses. I recommend to find a hotel by that canal! It situates both near the central area and gives you the peace you 'd need while visiting big cities."
        }, 
        {
            "index": 599, 
            "rating": "5", 
            "review": "Gentleman's Canal. They say it is the noblest canal with its towering houses. I also enjoyed the Keizersgracht and Prinsengracht. We took the canal bus for a city ride, which was wonderful. Also we took a Candlelight Cruise through Amsterdam, the canals and gable houses look fantastic in the dark!"
        }, 
        {
            "index": 600, 
            "rating": "4", 
            "review": "Very nice canal. We found the western area of the \"Gentlemen's Canal\" very lovely and enjoyed exploring the areas especially closer to the Dam. After a while, all the canals begin looking alike so hit it early in your trip. If you attend the ANne Frank House attraction, walk to the Dam across all three central canals for a nice comparison and contrast."
        }, 
        {
            "index": 601, 
            "rating": "5", 
            "review": "The 3rd one. You really do need to go along these canals, either on foot or in a boat to appreciate the layout of the city and it's history"
        }, 
        {
            "index": 602, 
            "rating": "4", 
            "review": "Strolling Amsterdam. As with Prisengracht, the homes are lovely, the architecture is delightful and the calm walks are wonderful."
        }, 
        {
            "index": 603, 
            "rating": "3", 
            "review": "Canal Boat Could have been better.. I would have picked a tour with a more interactive guide. The guy driving our canal boat never said a word, just played the canned tape; I feel that he could have added some interesting tips, had he wanted. Needless to say, he did not get a tip from us. We paid way too much money for 1 hour trip. Otherwise, the Herengracht is a gorgeous canal and worth riding around to see the city and the homes. I would have preferred an open boat, not one of the glass topped low canal boats."
        }, 
        {
            "index": 604, 
            "rating": "4", 
            "review": "Canal...... ....Boat tour is the best way to see all the canals and get your bearings in the city but, once you've done that, walk, walk and walk some more..., if your feet can cope you will run into some amazing sight, people and pubs...:-)"
        }, 
        {
            "index": 605, 
            "rating": "5", 
            "review": "Charm of the City. Like the other such as Prinsengracht, a unique canal. The canals are a large part of the charm of the city!"
        }, 
        {
            "index": 606, 
            "rating": "4", 
            "review": "The Lord's Canal. Being one of the three major canals in Amsterdam, Herengracht is a residential area housing beautiful double wide mansions. You can discover Herengracht by canal cruise tours, but my advice is to also to wander around."
        }, 
        {
            "index": 607, 
            "rating": "4", 
            "review": "go a long the main shopping street and you will find it. its one ofthe streets crossing there are some nice cafe and restaurants on it nad its one of those streets with a canal . gracht means canal. part of the nine streets you can walk along this one almost from one end to the other of the city"
        }, 
        {
            "index": 608, 
            "rating": "5", 
            "review": "Really beautiful canal. The history Amsterdam lives in its canals - do not miss this one. Take a boat or take a walk but go see it. We loved it!"
        }, 
        {
            "index": 609, 
            "rating": "5", 
            "review": "Magnificent Canal and History. The Canal Cruise traveled the Herengracht from end to end. The history is fascinating. It is clear that life on the Canal is the center of Amsterdam culture."
        }, 
        {
            "index": 610, 
            "rating": "4", 
            "review": "superb area. the very heart of Amsterdam. Superb houses ; I like the quietness of the area, the homogeneity as well"
        }, 
        {
            "index": 611, 
            "rating": "5", 
            "review": "Simply beautiful.. Take a moment or two to walk along the waterside, see the many old houses there, enjoy the view along the gracht, sit down for a coffee ... Herengracht is a splendid location and will give you some grand Amsterdam feeling."
        }, 
        {
            "index": 612, 
            "rating": "5", 
            "review": "Very posh canal. Take a boat or walk down this canal. It is rather posh and there are some lovely houses. The blue line on the canal cruise takes you down there."
        }, 
        {
            "index": 613, 
            "rating": "4", 
            "review": "\"When does this place close?\". No, this place doesn't close, this is an actual residential area and not a sight built for tourists, as this particularly ignorant American thought. It's authentic and beautiful and well-worth a visit - either by way of a canal boat or a lovely stroll."
        }, 
        {
            "index": 614, 
            "rating": "5", 
            "review": "All canals are beautiful in summer. Amsterdam is fantastic in summer, and 96 % of the reason is the canals. Take a stroll and get lost in the labyrinth of canals and winding streets."
        }, 
        {
            "index": 615, 
            "rating": "5", 
            "review": "Beautiful canal. All the canals are beautiful and fascinating. This is one of the major ones with lovely canal homes and fascinating boats going to and fro. Many flowers everywhere."
        }, 
        {
            "index": 616, 
            "rating": "4", 
            "review": "Another delightful canalside walk. A pleasant contrast to the hustle and bustle of Damrak or the seedier East side of the city. Ideal for an evening stroll."
        }, 
        {
            "index": 617, 
            "rating": "5", 
            "review": "Best of the canals. This canal boasts some of the most beautiful of the old city homes. It worth exploring via boat or foot."
        }, 
        {
            "index": 618, 
            "rating": "5", 
            "review": "most gorgeous canal. the hearth of classic Amsterdam with most beautiful buildingsand two completely different museum - the Biblical and the Kattencabinet - a museum of cats. Very enjoyable canal just for walking around and have a beer or coffee with an unforgettable view"
        }, 
        {
            "index": 619, 
            "rating": "5", 
            "review": "Canal Trip. The Herengracht is part of the over-all canal trip, again interesting in Amsterdam's history as it represents kind of a bourgeois pinnacle of achievement, or as an interesting book about Holland once put it \"embarrassment of riches\" that the country achieved during its peak mercantile endeavors"
        }, 
        {
            "index": 620, 
            "rating": "4", 
            "review": "Are you in Amsterdam? Are you going to the canals? Make sure this is part of it!. With each canal presenting a different view on the city, and the rich tapestry of history woven in to every street, every canal passing, be sure to have a good guide."
        }, 
        {
            "index": 621, 
            "rating": "5", 
            "review": "staying in amsterdam. great area to stay in safe / great shopping and reastaurants and cafes and close to everything."
        }, 
        {
            "index": 622, 
            "rating": "4", 
            "review": "Boat trip view. This canal is lined with beautiful luxury houses, a boat trip here is a must."
        }, 
        {
            "index": 623, 
            "rating": "4", 
            "review": "Lovely. Stroll and enjoy. Have to see at day time and at night. Enjoy!"
        }, 
        {
            "index": 624, 
            "rating": "4", 
            "review": "beautiful canal. lovely canal lined with cafes - great for people watching"
        }, 
        {
            "index": 625, 
            "rating": "5", 
            "review": "Stroll and enjoy!. Little boutiques and shops. Private homes and churches."
        }, 
        {
            "index": 626, 
            "rating": "4", 
            "review": "Very nice!. Another good stretch of the water....great for wandering around...."
        }, 
        {
            "index": 627, 
            "rating": "4", 
            "review": "A true gem. The houses along the canals are true gems to see.\nUnfortunately AMS is not always clean, so trash is floating in the canals or on the strrets."
        }, 
        {
            "index": 628, 
            "rating": "5", 
            "review": "Beautiful Walk. This is probably the most beautiful canal in Amsterdam. Lots of 16th and 17th century canal houses. A stroll here as the sun is setting is spectacular."
        }, 
        {
            "index": 629, 
            "rating": "4", 
            "review": "Great Bar on Canal at Leidseplein & Herrengracht. Great hang-out spot right on the canal, for lunch or dinner or in between. Mix of locals and tourists, we spent over an hour here, met a neat lady college instructor.\nBeing on the canal is wonderful seeing the tour boats and other little canal boats going back and forth."
        }, 
        {
            "index": 630, 
            "rating": "5", 
            "review": "One of the most beautiful canals. This canal definitely shows off its good looks. The architecture along this canal is stunning and it is peppered with little shops, galleries and restaurants."
        }, 
        {
            "index": 631, 
            "rating": "3", 
            "review": "Upscale Houses. It was along the Herengracht that the wealthy merchants chose to live. So there are many houses that are upscale and are well cared for. There are also many stores and restaurants."
        }, 
        {
            "index": 632, 
            "rating": "5", 
            "review": "A Beautiful Canal. This canal combines residential and commercial properties. Wear a good pair of walking shoes and enjoy Amsterdam."
        }, 
        {
            "index": 633, 
            "rating": "5", 
            "review": "\"Gentlemen's canal\". This canal is lined by beautiful, old and some new homes. Very lovely and relaxing."
        }, 
        {
            "index": 634, 
            "rating": "5", 
            "review": "Walk The Canals. Gracht means canal - this, and the other canals that define old Amsterdam are beautiful. They are all walkable and are a core part of the charm of this wonderful city."
        }, 
        {
            "index": 635, 
            "rating": "4", 
            "review": "Nice canal. Similar to other canals. If its a nice day, put on your running shoes and run around this canal."
        }, 
        {
            "index": 636, 
            "rating": "4", 
            "review": "Another great canal. There are loads of canals in Amsterdam - this is one of my top 3 - lots to see and do and plenty of places for a nice coffee and sit down."
        }, 
        {
            "index": 637, 
            "rating": "4", 
            "review": "one of the famous canals in the old district. Together with the Prinsengracht and the Keizersgracht one of the loveliest places in the old town to walk through. , Magnificent views on the water, beautiful houses, some interesting shops too, especially in the neighbourhood of the 'Negen straatjes' district. A very peaceful & cosy atmosphere."
        }, 
        {
            "index": 638, 
            "rating": "5", 
            "review": "great house fronts. I loved strolling along this canal and visiting museums as the house interiors are something to see as are the gardens in the back."
        }, 
        {
            "index": 639, 
            "rating": "4", 
            "review": "Canal street going through central Amsterdam. Major thoroughfare in Amsterdam. Cobbled streets line either side. You can walk or rent a bike and go the entire length of the canal. Amsterdam is so small a city, you just walk the streets, stopping to see a historic sight or shop or grab a snack. Perfect city break"
        }, 
        {
            "index": 640, 
            "rating": "5", 
            "review": "Great for a walk on a sunny day. Buildings, bars, cafes, restaurants.\nThe canal curves between the two main shopping streets. And if you are tired you can always hop on a tram"
        }, 
        {
            "index": 641, 
            "rating": "5", 
            "review": "Beaytiful architecture and cosy cafes to pop into. Seeing Amsterdam on foot and wandering these canals is a must...just watch out for the cyclsts!"
        }, 
        {
            "index": 642, 
            "rating": "4", 
            "review": "Very nice walk. Herengracht canal is one of Amsterdam canals, very quite neighboudhood. You cam walk all along the canal, see the house boats, the buildings, people riding bikes, you ll never forget it!"
        }, 
        {
            "index": 643, 
            "rating": "5", 
            "review": "Boho. Twisty narrow streets, crammed town houses, unique shops and cafes. Great vibe and lovely to meander around the area."
        }, 
        {
            "index": 644, 
            "rating": "5", 
            "review": "Great little shops and cycle heaven. Try 309 Herengracht for a cosy hot chocolate, watch the cyclists try to find a bike parking spot."
        }, 
        {
            "index": 645, 
            "rating": "5", 
            "review": "Peaceful. Such a lovely neighbourhood. Came to the Herengracht to find the Handbag museum and Cat Cabinet and such the neighbourhood so beautiful, it's really worth taking a stroll if you have spare time in the city."
        }, 
        {
            "index": 646, 
            "rating": "4", 
            "review": "Best Orientation. Boat tour was the best orientation to learn about Amsterdam and I enjoyed this more than the one in Venice.It was very relaxed on the boat watching the beautiful houses dating back to the 16th-17th centuries, the lined old trees, the historical landmarks, the carillon churches, the charming bridges, the busy city cyclists, markets…The lord’s canal (Herengracht), the first of the three major canals in the city was one of the most popular spot and it was quite scenic to pass the so called “Golden Bend”, where the elegant Dutch mansions of the wealthy people were located."
        }, 
        {
            "index": 647, 
            "rating": "5", 
            "review": "Just stroll and look out for bicycles. OK, so you did the canal tour and, chances are, had no idea where you were after 5 minutes. If you want to enjoy this great canal, stroll along it, stand on its bridges and just keep looking. I like to cross back and forth; there are always details on the buildings that catch your eye from a new angle, and every view from the bridges is worth pausing for."
        }, 
        {
            "index": 648, 
            "rating": "5", 
            "review": "Beautiful. I love walking here... it is a typical AMS street."
        }, 
        {
            "index": 649, 
            "rating": "4", 
            "review": "Peaceful. Lovely to wander along, looking at the houses and stopping in the canal side bars and coffee shops."
        }, 
        {
            "index": 650, 
            "rating": "5", 
            "review": "Most picturesque area in the city. The neighborhood is full of early 17th century houses along the canals. Very few cars, good restaurants and boutiques."
        }, 
        {
            "index": 651, 
            "rating": "4", 
            "review": "High on My List. A lot of interesting, well maintained houses on this canal."
        }, 
        {
            "index": 652, 
            "rating": "4", 
            "review": "We stayed on the Herengracht. A vibrant part of the city - full of life and colour"
        }, 
        {
            "index": 653, 
            "rating": "5", 
            "review": "Great Walking area. Our bed and breakfast was on this street - -close to just about everything ..within easy walks! just watch out for the bicycles..That would go for all over the city. You have to get used to what are the bike paths and where you can walk"
        }, 
        {
            "index": 654, 
            "rating": "5", 
            "review": "Nice area. This is a nice area to stay in close to Prinsegracht"
        }, 
        {
            "index": 655, 
            "rating": "5", 
            "review": "Canal. Old canal street in the historical area, nice to walk"
        }, 
        {
            "index": 656, 
            "rating": "3", 
            "review": "Herengracht. This feels like a little bit of a different, more gentle time than the bustling city all around."
        }, 
        {
            "index": 657, 
            "rating": "4", 
            "review": "Very picturesque canal. Like the other canals, this one is beautiful and very picturesque on a fine day. Lovely walking along the canal, just need to watch out for the bicycles as they come whizzing past."
        }, 
        {
            "index": 658, 
            "rating": "5", 
            "review": "Great to watch from a boat ride.. During the boat ride in the Amsterdam canals, you can watch the Herengract's houses and it is amazing. Really worth taking the ride just to watch them from the canal."
        }, 
        {
            "index": 659, 
            "rating": "5", 
            "review": "The Gentlemens Canal. This is the second most important and largest of three canals that semi circum vent the whole city, along with over 700 adjoining canals and more than 1200 bridges crossing those canals, it all makes for a very exciting and marvelous place to explore.\nThis canal has some beautiful examples of grand Amsterdam canal stately homes."
        }, 
        {
            "index": 660, 
            "rating": "5", 
            "review": "Lovely. The old houses and people skating on the ice, on the canal, what more do you want..."
        }, 
        {
            "index": 661, 
            "rating": "3", 
            "review": "Food and drinks is great. Food is decent, but both food and drinks are on the expensive side. However I will probably not go back as there was smoking downstairs and the service was slow."
        }, 
        {
            "index": 662, 
            "rating": "4", 
            "review": "Hours of aimless wandering. Spend plenty of time walking up and down Herengracht and the other Grachts - you will never be short of places to see / visit / eat / drink / shop!"
        }, 
        {
            "index": 663, 
            "rating": "5", 
            "review": "skatetastic!. This canal was the big draw over our weekend. It was frozen solid and was the centre of a whole day of races - televised races at that!"
        }, 
        {
            "index": 664, 
            "rating": "4", 
            "review": "A lovely walk. This was a very nice walk along the canal, albeit frozen, to view the wonderful architecture."
        }, 
        {
            "index": 665, 
            "rating": "5", 
            "review": "Excellent view in winter. The canal is actually same as the others; but every canal has its own beauty. When I was there, the canal was almost frozen like the others.\nHerengracht is an amazing place to take a stroll and to take many great pictures."
        }, 
        {
            "index": 666, 
            "rating": "5", 
            "review": "Street of the Times Hotel! Very nice canal street!. Very nice canal street, very close to the nine streets, the centraal station and many DAM square."
        }, 
        {
            "index": 667, 
            "rating": "3", 
            "review": "A standard canal.... Obviously a beautiful city, but this canal is the same as the others... We did a canal cruise, and we didn't see anything you can't see walking around the city.."
        }, 
        {
            "index": 668, 
            "rating": "5", 
            "review": "Typisch Amsterdamse. We stayed at the Rembrandt Classic Hotel, which looks over Herengracht. It's a very beautiful backwater within minutes of Dam & ever so quiet. Beautiful old Dutch architecture with buidings several storeys high. Was confused by one, whch had the name Cornwall painted on it just below the roof..."
        }, 
        {
            "index": 669, 
            "rating": "5", 
            "review": "Beautiful canal. Here you can see the wealth of the past and the wealth of today. Although a lot of houses are commercial buildings nowadays."
        }, 
        {
            "index": 670, 
            "rating": "4", 
            "review": "Love Amsterdam!. The Herengracht is amazing; if you love water and canals. I find this to be a peaceful atmosphere (meaning anything around the water). This is a great place to take a stroll, ride a bike, sit and read a book or just hang out and take pictures. If you have the opportunity take a boat tour which sails along the Herengracht so you get a better picture of this fantastic city called Amsterdam!"
        }, 
        {
            "index": 671, 
            "rating": "5", 
            "review": "Class. This is a really classy area, stroll and submerge yourself in luxury."
        }, 
        {
            "index": 672, 
            "rating": "5", 
            "review": "Beautiful dutch buildings.. So wonderful to walk the canal which hasnt really changed for centuries"
        }, 
        {
            "index": 673, 
            "rating": "4", 
            "review": "one of some canal rings. it's good to walk or to travel with a boat. Some good galleries and plenty of bikes and cars!!!"
        }, 
        {
            "index": 674, 
            "rating": "5", 
            "review": "by boat. is the best way to see these houses. the all tell a story. bikes, people, dogs are everywhere and that makes this street."
        }, 
        {
            "index": 675, 
            "rating": "5", 
            "review": "fantastic. We were blessed with a gorgeous, dry sunny day in Mid January. My partner couldn't stop taking photos. This area is every bit as enjoyable as the more formal places to see in Amsterdam. Relax, stroll, enjoy!"
        }, 
        {
            "index": 676, 
            "rating": "5", 
            "review": "good place to stroll. This street is at the centre of amsterdam life. It is a wonderful place for a romantic stroll with lots of little streets and shops to investigate. The buildings are magnificent but if you wish to get the most out of an architectural visit, I suggest that you take the green line canal taxi to get a brief commentary and a leisurely look at the magnificent opulent town houses."
        }, 
        {
            "index": 677, 
            "rating": "5", 
            "review": "Magnificent architecture. A great canal to stroll along and see the magnificent canal houses built for the rich Dutch merchants in the 17th century."
        }, 
        {
            "index": 678, 
            "rating": "4", 
            "review": "Nice Views. Really pretty section of the city. Nice area to walk around in and stop by a cafe. The boat tour of this area is a great way to see it."
        }, 
        {
            "index": 679, 
            "rating": "4", 
            "review": "Most elegant canal. Here is where the Rich lived and traded. Now large parts of it are office buildings. But still it breaths chique....."
        }, 
        {
            "index": 680, 
            "rating": "5", 
            "review": "nice and cosy. nice and cosy place, a little away from the big crowd. nice stroke to walk, drink a coffee and do some art shopping"
        }, 
        {
            "index": 681, 
            "rating": "5", 
            "review": "Classic Dutch architecture. Just beautiful buildings - with the odd bar and restaurant to slow your journey down."
        }, 
        {
            "index": 682, 
            "rating": "5", 
            "review": "Stunning. Did the canal trip which takes in the Herrengracht. Stunning views and very atmospheric."
        }, 
        {
            "index": 683, 
            "rating": "5", 
            "review": "Canals and big houses, great trip by boat!.. What can i say, beautiful setting, old big houses and the water..."
        }, 
        {
            "index": 684, 
            "rating": "4", 
            "review": "Worth A Visit. An old historical part of the city with interesting houses and canals."
        }, 
        {
            "index": 685, 
            "rating": "4", 
            "review": "Pretty street away from busy town, nice for a walk. There is thre Gracht (Canal) in the middle, very pretty with all the houseboats, cyclists, little wonky street and typical old dutch houses. This is one of the oldest street in Amsterdam and the upper class was used to live here. It still looks like that."
        }, 
        {
            "index": 686, 
            "rating": "5", 
            "review": "Very nice walk.. I understand this is a very prestigious street. We enjoyed looking at the buildings. I think this was on the route of the canal cruise we took."
        }, 
        {
            "index": 687, 
            "rating": "5", 
            "review": "very nice canal houses. I took a boat trip which took me past a part of the Herengracht, along with the other canals, this is Amsterdam, this is what makes the city different from any other city in the world... very beautiful houses indeed!."
        }, 
        {
            "index": 688, 
            "rating": "5", 
            "review": "A must. Beautiful and well worth a visit. Take a night-time boat trip if you can"
        }
    ]
}