{
    "category": "Amsterdam", 
    "entity": "Dutch-National-Opera-&-Ballet", 
    "avg_rating_stars": 4.699346405228758, 
    "review_count": 153, 
    "rating_stats": {
        "poor": 2, 
        "average": 2, 
        "terrible": 2, 
        "very_good": 28, 
        "excellent": 119
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "1", 
            "review": "German Regie Theater should be banned form the operastage. Last night there was Manon Lescaut in the National Opera and Ballet. The music was fine (except the tenor who had just one volume, too loud and no acting qualities). Eva Maria Westbroek was great. But the staging was terrible. Please keep this German Regie Theater home in Germany. It spoiled my night at the opera"
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "Like a dream!. I just loved the ballet. It was like an opera without music, or a theater play without words. Hope that's the right way to appraise a ballet. It was totally captivating. The dancers and musicians were in total harmony. I greatly enjoyed. Did not see time passing by. Warmly recommended. Access is easy, by tram or by subway. Or on foot. Or by taxi, of course. As you like it."
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "Fantastic Opera performance of Le Nozze di Figaro. We had a wonderful evening in the Dutch National Opera & Ballet theatre showing a post-modern version of the Nozze di Figaro by David Bösch. We much enjoyed the performance with funny scenes and funny 'finds', such as a ''selfie'' taken by the main players.Both the orchestra and the choir (of the National Opera) were great.For me the highlight was Marianne Crebassa in her role of Cherubino. She has a wonderful voice. My wife preferred Eleonora Bratto in her role of countess.I am not sure there are further performances in Amsterdam, but if there are I would highly recommend trying to get a ticket."
        }, 
        {
            "index": 4, 
            "rating": "5", 
            "review": "Hollandse Meesters. This is a fantatstic program honouring not only Toer van Schayk but also the other two \"van's\". The four dance performances were all made all the more special by fantastic live music: piano, orchestra, choir, soloist. With the Requiem the ensemble wasn't always as sharp and together but the program deserved a big standing ovation nonetheless."
        }, 
        {
            "index": 5, 
            "rating": "5", 
            "review": "Beautiful, exciting performances.. The Dutch National Ballet has always given exciting performances. The three choreographers, Hans van Manen, Toer van Schaik and Rudi van Danzig, have made it into an internationally famous ballet with their choreographies. Be it a classical ballet, be it a modern dance performance, it is always worth a visit."
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "Performances can compete with best in the world. The Dutch national opera has become truly outstanding under Pierre Audi. It's a pity the audience refuses to dress up a little."
        }, 
        {
            "index": 7, 
            "rating": "5", 
            "review": "Must see opera 'le nozze de figaro'. A beatifully sung opera, with a nice mix of funny and sensitive moments. The decor was very impressive as well. Three hours of excellent entertainment, totally worth any penny (or euro in this case)."
        }, 
        {
            "index": 8, 
            "rating": "5", 
            "review": "A great performance. The National Opera and Ballet in Amsterdam are of a world class order. We watched the premiere of Marriage of Figaro this week and were once more impressed by the quality of the production. If you get a chance to see an opera at the Dutch National Opera House do take it!"
        }, 
        {
            "index": 9, 
            "rating": "4", 
            "review": "my first experience - wow wow wow. may 2016 - my 1st experience to visit a opera . I saw the dance show there which was so beautiful . One of the best nights i got to experience such talented artists performing at the venue"
        }, 
        {
            "index": 10, 
            "rating": "5", 
            "review": "Great experience seeing Don Giovanni!. I saw Don Giovanni at the Dutch National Opera and it was a wonderful show. The facility is very modern, but also very grand. I waited in line in a queu to get tickets a couple of hours before the show and managed to snag a 15 euro student ticket (Even with the show is sold out they often have returned tickets so it's likely you could still buy one). The staff were extremely friendly and helpful in assisting me in purchasing my ticket. I was sitting in the 8th row in the center of the orchestra and the view was stupendous. The english translations/ subtitle screen could have been a bit better, but the cast and set were phenomenal. I would love to go back here!"
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "Wow wow wow!. What a beautiful entourage! Love the inside, don't let the outside fool you. I passed by it a million times and always thought I have to get inside to see how it looks like. Trust me you will now be disappointed."
        }, 
        {
            "index": 12, 
            "rating": "4", 
            "review": "Excellent Value for Students. Highly recommend for students. If the performance is no sold out you can purchase a 15 euro ticket an hour and a half before the performance and you will be given the best seat available!"
        }, 
        {
            "index": 13, 
            "rating": "5", 
            "review": "Opera and ballet. Visited there twice in June. I saw first the excellent Transatlantic. Four different ballet choreographies. Every one of them were so amazing and fabulous. And the next evening the famous and dramatic opera Pique Dame by Pyotr Ilyich Tchaikovsky. Music was by the famous orchestra Concertgebouw conducted by Mariss Jansons. So great experience and worth visiting."
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "Amazing show, choreography and experience!. The experience in general was great. We listened to the introduction with an explanation of each of the choreography's, music, artists, dress, etc. The dancers were young and talented. We were very satisfied with the show!"
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "Outstanding performance of Don Giovanni, May 2016. The National Opera and Ballet building is easily seen from several streets and not hard to get to although getting in the building was a bit confusing. We ended up following a lot of other people and eventually found the front and the entrance. A contemporary opera house, red velvet decor inside, it was comfortable and from our seats the action on the stage was easily visible. We were on the main floor, having paid quite a bit for our tickets. You should buy tickets well in advance of your desired visit, as opera does sell out in Europe, and this was no exception. I bought tickets about 2 months prior and had to get the 2nd most expensive seats to get in. It was worth it. This interpretation of Mozart's Don Giovanni was contemporary which isn't normally my favorite (I prefer traditional sets and costuming) but it was incredibly well done. The orchestra was outstanding, the soloists, the staging, everything about it was amazing. We attended a Sunday afternoon performance, then went wandering a bit as it stays light so late in the summer, and dined early somewhere else in the city. If you are an opera buff and the season is on while you are in Amsterdam, it's worth a few hours and some $$ to attend."
        }, 
        {
            "index": 16, 
            "rating": "5", 
            "review": "Excellent performance of Pique Dame. What a fabulous performance of Tsjaikovski’s Pique Dame I heard and saw yesterday, both from a visual and musical point of view. Outstanding!"
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "Fantastic open day. We just happened to be in Amsterdam at the beginning of April when they were holding an open day. It was mostly local families, but we thoroughly enjoyed it. We arrived just in time for a one hour preview performance of excerpts of dance and theatre.Afterwards we went backstage andwalked through all the workshops and watched and chatted to the staff who make costumes, sets, devise special effects, make wigs etc,etc. A really enjoyable tour (at your own pace, you can just wander around at your own pace) and all the staff talked enthusiastically about working here.Keep a look out for dates they are running the open days. I'm not sure if it's once a year or more frequently but do make an effort to come if you're here"
        }, 
        {
            "index": 18, 
            "rating": "4", 
            "review": "Beautiful building by the Amstel. Located in a charming and central position, this building is worth a visit. If you like classical music than every Tuesday at 12 30 they host a lunch concert, free of charge. It lasts only 30 minutes, and is better to come a little earlier stand in the line to guarantee your spot. You can check their program on the website."
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "Dutch National Opera is great!. The opera house (also for ballet) is a wonderful building, overlooking the best part of the Amstel river. There are different opera and ballet productions, and you might prefer one production over another. But they are all good, and many are excellent.Yesterday I enjoyed Don Giovanni by Mozart and DaPonte. An interesting decor, a big rotating platform with large trees, where the different scenes took place. And with a lot more variety than you might imagine from my description of rotating woodland. All singers were good, the title role excellent. But I thought the three ladies (Donna Anna, Elvira and Zerlina) had great arias, as well as Leporello (\"Mille e tre!\"). I enjoyed many greag operas in the last ten years or more, so if you can go to an opera you never heard of. Try it!"
        }, 
        {
            "index": 20, 
            "rating": "5", 
            "review": "Do Giovanni. Great performance of cast and orchester. The role of don Giovanni was played superbe. The mise en scène was simple but powerful."
        }, 
        {
            "index": 21, 
            "rating": "5", 
            "review": "Don Giovanni by mr. Mozart. Each visit to an opera or ballet of the NOB is so amazing. Again this time with Don Giovanni. I got chills at the last scene, the Commendatore scene."
        }, 
        {
            "index": 22, 
            "rating": "5", 
            "review": "Beautiful performance. Always a pleasure to see het Nationaal Ballet. From classical to modern as well. Amazing \"Prima ballerina's\" and I always get swept away by the music and the artists on stage."
        }, 
        {
            "index": 23, 
            "rating": "4", 
            "review": "Modern building. The opera house is a modern building on the shore of the Amstel. They have very good opera performances, ballet. Some years ago we have seen a Carmen - director of the production was Robert Carsen. This was the CARMEB, the best what we had ever seen. (Just 8 times till today). Also the cast was excellent.We also had Olga Peretyatko in Rossini opera - also a great performance."
        }, 
        {
            "index": 24, 
            "rating": "5", 
            "review": "Beautiful cheerful show with the kids. From time to time, there are shows for kids. We just saw The little big chest with our 2.5 and 6 years old and we all loved it ! Long enough (40 min), colorful, cheerful, full of actions and emotions, well done to the Junior company !"
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "Don Giovanni *****. Beautiful performance of Don Giovanni at the Muziektheater. Decor and mise-en-scène by Claus Guth same as for the Salzburger Festspiele 2008 with same Juan: Christopher Mailman. Particularly enjoyed Véronique Gens (Donna Elvira)."
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "Very nice and entertaining youth ballet. This was the first time I went to a show by the international balletschool of the Dutch National Ballet. It was highly entertaining, also for adults. The ballet dancers interact nicely with the kids on a small and cozy stage. My daughter of three was mezmerised by the whole show.I would go again without a second thought."
        }, 
        {
            "index": 27, 
            "rating": "5", 
            "review": "Highest level of performance; tailored for the kids. A ballet specially designed for children, performed by world class performers from the national ballet. My daughter of close to 4 loved it, and so did I. Only lesser point was that the show was held in the basement of the Stopera hall; not in the beautiful main hall."
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "Great experience for small kids!. My 5 years old daughter was very excited and she really enjoyed the show!The dancers were very good and some kids were even invited to join some of the action on the side of the scene. Kids were able to sit in the front row on some pillows which made it even more immersive for them!"
        }, 
        {
            "index": 29, 
            "rating": "4", 
            "review": "Fantastic: Roméo et Juilette. Great combination of classical and modern ballet. Truely moved me.Stopera is well equiped for large amounts of people coming in or leaving (opposed to f.i. Concertgebouw). Great night out!"
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Well worth a visit. If you are lucky, you can see Balanchine rarely staged in Europe. Ballett company is very good, acoustics superb, orchestra & singers are brilliant. The descorations were a bit weird to me, but I am not a fan of contemporary productions. There are always queque at the wardrobe (in Covent Garden I have never waited for longer than couple of minutes). Coffee is up to high Dutch standards."
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "Always a highway quality Gesamtkunstwerk. This Opera House traditionally offers a high quality performance by the soloists, the choir, orchestra, technicians, costume makers and visagists together. Don't expect egoistic world stars here, but a production of so many different people who have worked together for a long period, to be noticed very clearly for the audience."
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "Great experience! Top quality, perfect execution. Very high level of performance! it is a pleasure! good atmosphere at good prices! the opera can easily be reached by public transport and during the breaks you have a great view onto the canal. I can recommend it to anyone."
        }, 
        {
            "index": 33, 
            "rating": "3", 
            "review": "Good. Good from the outside. Quite a big building. One time visit. Worth you if you have the time to go. Not in Amsterdam centre tho."
        }, 
        {
            "index": 34, 
            "rating": "5", 
            "review": "Online Student Tickets!. As a student traveling in Amsterdam I thought tickets would be way out of my price range but thought I would check out the website anyways. There were 15 euro tickets for students in all of the seat ranges! I couldn't believe it! I had to send an email to the company and call them before I would believe it. They told me that they don't offer this for every opera or ballet, but that they do for some shows. Even for the shows that they don't offer online tickets, you can show up an hour and a half before a performance and get un-sold tickets with a student id. I sat three rows back, in the orchestra pit and saw an amazing performance of Chovansjtsjina. I feel so lucky and fortunate to have had this experience while on my trip in Amsterdam, it's one of the best things my student id has ever gotten me, including my education ;). Thank you thank you Dutch National Opera for giving me the opportunity to see it!"
        }, 
        {
            "index": 35, 
            "rating": "4", 
            "review": "Go and see the NationaleOpera in Amsterdam. When you are in Amsterdam go and visit the NationaleOpera. Their level is ver high. I am a regular and i am never disappointed. It is one of the best things in Amsterdam. Hope to meet you in the Nationale Opera!"
        }, 
        {
            "index": 36, 
            "rating": "5", 
            "review": "Lunch Concert. We went to one of the free Lunch time concerts offered here, and it was wonderful! We really enjoyed listening to Handel played on the violin and piano. Since the show is free, lots of people do turn up to watch. I recommend arriving early so you can line up for good seats."
        }, 
        {
            "index": 37, 
            "rating": "5", 
            "review": "Excellent production rather austere building. The building is shared with civic building and cannot ,under any circumstances , be regarded as of architectural interest, but if you enjoy opera well worth a visit. We had stall seats for €78 about half the price of London's Covent Garden. They stage many operas not produced in UK , eg we saw Mussorgsky's opera Khovanshchina , convoluted plot but had English sur-tiles. Great production with excellent orchestra and singers. Tickets were very easily purchases from the Opera House' web site from the UK so no need to buy tickets through an agent. The home printed the ticket which has a bar code . No restaurant but there is a variety of snacks and wine which is is very cheap at €4.10 per glass"
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "Opera Khovanschina. Great performance of the beautiful opera Khovanschina. This opera house has an outstanding reputation for great opera and ballet. Special tip from me as a a frequent visitor: enjoy a buffet style diner with other visitors in the opera lounge prior to the show. Just € 28,50 (March 2016) wine included. Dessert served during the first break, coffee/tea also included. Have a great evening!"
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "Beautiful!. We went to see Mata Hari this week, what a beautiful experience! The dancers of Dutch National Ballet were amazing and the costumes designed by Francois-Noël Cherpin were absolutely stunning. I'm definitely going back there again to see another ballet !"
        }, 
        {
            "index": 40, 
            "rating": "5", 
            "review": "What a dream. Last night we experienced the performance of Mata Hari. I was already intriged by the subject, but what I have seen was more than I ever could imagine. It was an overall experience beyond any expectation.The costumes were so creative and attractive , the music so very special and the dancers amazing. Although I have seen in many countries many ballet performances, I think this was the best I have seen in yeras. CHAPEAU for eveybody involved.Some people mentioned the missing dress code in the Dutch theaters. And I do agree. Very anoying that so many people don't show any respect by al least trying to dress up.I feel ashamed to be Dutch in that respect."
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "Great performance, wonderful show!. The Dutch National Ballet aims to reach a wide public, they have succeeded with Mata Hari. We have enjoyed the ballet enormously, I would absolutely recommend this show for all ages."
        }, 
        {
            "index": 42, 
            "rating": "5", 
            "review": "Amazing and spectacular \" Mata Hari\" ballet!. Mata Hari is great ballet.\nLibretto, music,dancing and decorations - all done on the highest level of art.\nWe received a lot of positive emotions . Bravo!"
        }, 
        {
            "index": 43, 
            "rating": "5", 
            "review": "Worth every Euro cent!. From start to end a wonderful experience. Wish we could shake everyone involved a hand and a pat on the shoulders. Well done. Everything was beautiful!"
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "Great performance!. A great piece of choreography with a wonderful execution. Lovely location, great sound, nice hall. Definitely place to be and show to see!"
        }, 
        {
            "index": 45, 
            "rating": "4", 
            "review": "Amazing Ballet Company. For most productions of this amazing ballet company I would give top marks. Mata Hari was not entirely go my liking. Choreography lacked power."
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "Worth a visit. Super friendly crew, superb acoustics, little queueing during sold out house (1600 people), good seats"
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "Fabulous Mata Hari. Truly perfect show. Everything is well balanced, the music, the set, the costumes and the choreography. It absolutely computes. And Anna really carries the ballet, whát a performance!"
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "Super perfect. Great performance, great dancing, it was unbelievable beautiful and we enjoyed our time. It is totally recommended. check the website for the performance. 10/10"
        }, 
        {
            "index": 49, 
            "rating": "4", 
            "review": "Great experience (but for the dress-code). I've been to the Nationale Opera en Ballet several times now. I absolutely love being there. Perhaps, calling the Opera house \"cozy\" is unorthodox, yet this is how it feels to me--it makes me feel at home. Maybe because it's not as big as some other European Opera houses (or so it's seems like). I think that the Dutch creativity can certainly be seen in the choreography, costumes and the overall look & feel of the performances. There's only one thing that takes away from the experience--the way some visitors dress. It seems to me that the Dutch are not educated about the standard dress-code for visiting the Opera/Ballet. Many are dressed in sneakers, and some even wear sweatpants. Some look like they are out for the weekend in the woods. I think that the visit to a National Opera house is a comprehensive experience--it consists of so many tiny details, and dressing the part is one of them. To me at least, it's something special (and for whom is it not?), because it doesn't happen too often. I wish people were more respectful to the setting and let it translate into the way they dress for the occasion."
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "Mata Hari. Beautiful new Ballet by Het Nationale Ballet company.A wonderful afternoon to spend on Valentine's Day with my husband who also enjoyed the ballet enormously.Audience gave a well deserved encore. Fab."
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "National Opera & Ballet: Top of the bill. National Ballet really is top of the bill in the world: great quality of dancing, original and challenging programming from classical to modern productions. Mata Hari is a successful addition in the NOB reperetoire!"
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "fantastic new ballet. Mata Hari is a beauty, all hail to choreographer Ted Brandsen\nThe best new ballet I have seen at Het Nationaal Ballet in years"
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "Excellent performance!!. Mata Hari is a must see for évery lover of beauty! The National Ballet at it's very best in all theatrical aspects."
        }, 
        {
            "index": 54, 
            "rating": "5", 
            "review": "Indrukwekkend. World-class performance by Anna, we felt touched by her expressions, gestures and dance. The orchestra performed brilliantly and the entire evening was a great pleasure for all our senses. We highly recommend this ballet."
        }, 
        {
            "index": 55, 
            "rating": "5", 
            "review": "Vibrant, Beautiful and Unique Ballet!. Beautiful Costumes, great dancing and all around fun ballet. Yes, its not Swan Lake, but they can't all be composed by Tschaikowsky."
        }, 
        {
            "index": 56, 
            "rating": "5", 
            "review": "Amazing performance,. Really stunning portrayal of the story of Mata Hari. This was my first ever ballet and I'm really glad I chose this one, it was very accessible and I was really impressed. Beautiful costumes, amazing dancers and generally very enjoyable evening. The music was a huge part of the storytelling and this was also excellent.The theatre itself is very nice, we sat in row 3 which, in hindsight, might not have been the greatest seat... especially as we had a tall Dutch guy with his big-haired friend in front of us! Just bad luck I guess. If I go again, I will pay for one or two rows further back to get a better view."
        }, 
        {
            "index": 57, 
            "rating": "5", 
            "review": "Pure Art! Amazing Ballet and Performance.. This ballet is something Holland needs to be extremely proud of and promote. Amazing storytelling with a perfect balance of choreography and music. Don't miss it!"
        }, 
        {
            "index": 58, 
            "rating": "4", 
            "review": "Solid dancing, feels more like a musical than a ballet. The dancing in general and the soloists in particular were excellent, Igone de Jongh was especially graceful and elegant as Mata Hari. The music can be both fun and bombastic as well as very uncomfortable. Interesting choices by the composer. The choreography was good, although the last pas de deux between Mata Hari and her husband was intense and vivid, an almost uncomfortable watch with the sheer power and violence being depicted on stage. The staging was done well, looking impressive and conveying a sense of constantly being on the move (which the different parts of the stage were).Costuming was, for me, the most arresting and brilliant thing of the performance. All the outfits were matched to the scene, the dancing and the dancers themselves. I was very impressed.The overall feel of Mata Hari is like watching a grandly produced musical. The acting in Mata Hari is more direct and visceral than you would normally see in a classical ballet performance. All in all, if you are not sure about ballet but love theater and musicals, this would probably suit you. If you are expecting to see a performance like Giselle or the Swan Lake, Mata Hari does not have that same painterly and abstract quality. The costuming and the dramatic acting and choreography are the standouts here."
        }, 
        {
            "index": 59, 
            "rating": "5", 
            "review": "Am amazing experience.. I was lucky enough to get a front row seat for the production of Haendel's Ariodante.The floor of the orchestra pit was raised to the level of the front row and I was literally seating next to a violonist, as if I was inside the music.The Cologne orchestra was exceptionally good and the singers too. This was reflected by the absolute silence in the fascinated audience. A must."
        }, 
        {
            "index": 60, 
            "rating": "5", 
            "review": "Wonderful ballet Mata Hari. I went to the Mata Hari ballet and it was simply amazing! The choreography, the scenarios, the light effects and sound were combined into a perfectly designed masterpiece. The life of Mata Hari, as dreadful as it was, is shown into a beautiful way by the dance, and all the impressions are so well constructed you easily get cought by the atmosphere of the story being told. I recommend it very much."
        }, 
        {
            "index": 61, 
            "rating": "5", 
            "review": "Mata Hari is a gorgeous modern ballet. Young or old, if possible you definitely should go to the Mata Hari balletpiece at Dutch National Opera & Ballet. It's a beautiful modern piece that keeps you on the edge of your seat the whole time."
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "I don't know about you, but I love opera!. I took opera lessons, so visiting this place just touches me. It's phenomenal and everyone that went with me agreed! I loved the ballet, and that's nothing but the truth. Everything was brighter, we felt more in tune with the times. It just gave me the sense of youth that was long lost!"
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "Exciting Ariodante and other Opera's. Try to get tickets: at prices well below those in other major operas an opportunity to have an exciting evening with high quality music (or ballet). Ariodante which is on at the moment is one of those gems!"
        }, 
        {
            "index": 64, 
            "rating": "4", 
            "review": "Nutcracker was FABULOUS!. We went to the National Opera & Ballet on December 19 for The Nutcracker. I've seen so many versions of the Nutcracker over the years and this was a fantastic version. I enjoyed the ice skating scene so much. The kids did a fabulous job and the \"country\" dances were fabulous. We had the last row in the house on the aisle and we could still see everything and enjoyed it so much. My husband can't stop raving about the treats he ate at intermission. Overall such a fun experience!"
        }, 
        {
            "index": 65, 
            "rating": "5", 
            "review": "Excellent company. Dutch National Ballet is definately one of the best companies in the world. Loved Nutcracker, wonderful production!"
        }, 
        {
            "index": 66, 
            "rating": "5", 
            "review": "Great version of the Nutcracker. Wonderful ensemble work and marvellous, magical stage set and stagecraft. The orchestra playing was also a great performance in its own right."
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "Opera (Hansel und Gretel) and Ballet (Nutcracker). Exceptional performances, beautiful venue and outstanding service (all in fluent English). The Opera had English and Dutch subtitles (performed in Dutch), which made it extra fun working out the language. Our seats were first row Mezzanine and first row balcony. Both were great seats (if you're on a budget, the front of he balcony is perfectly fine seating). We've been to Lincoln Center in NYC and the performance was as good. Dress was predominantly \"smart casual\" - dockers and a shirt, pant suits or winter dresses for the ladies. There were people in nice jeans and sweaters as well. There were no ugly dressers, so that was kind of nice. We bought our tickets while still in the US and printed them at home on 8 1/2 x 11 paper. No problem. We had a great time and very highly recommend it."
        }, 
        {
            "index": 68, 
            "rating": "5", 
            "review": "One of world's best ballet companies!. The Dutch National Ballet is one of world's greatest ballet companies, with their high quality productions, enchanting costumes and incredibly talented dancers. And it's great to see this cultural institution making efforts to keep improving the overall experience of the visitors."
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "The Nutcracker. Fantastic; The best Christmas production I have ever seen. The sets, costume, music, dancers and choreography were all fabulous. So pleased to have seen this production in our short stay in Amsterdam. The building in itself is also a beautiful space."
        }, 
        {
            "index": 70, 
            "rating": "5", 
            "review": "A great evening at the ballet. We booked from England (in July!). The whole process was so easy. It was very nice to have your coat taken for free (that doesn't happen here). The ballet itself was very charming, especially including the frozen canal. We thought the mice were really quite frightening! For us the best thing was the orchestra, as it was so god to hear familiar music played with such passion. We will come again."
        }, 
        {
            "index": 71, 
            "rating": "5", 
            "review": "Nutcracker and the Mouse King . This was absolutely the highlight of our Christmas visit to Amsterdam. It is a fantastic opera house with very spacious and comfortable seating. The Christmas Eve performance was brilliant, beautifully choreographed and staged and the sets were amazing. We were all quite moved by the beauty and grace of the production and the principal ballerina was just breathtaking. Loved the orchestra too who are often the unsung heroes of these great productions. We will definitely make the visit back as Amsterdam is so easy to get to."
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "Het Nationale Ballet!. We try to attend as many ballet performances as possible. Het Nationale Ballet is wonderful. Tickets are reasonably priced and the whole experience is fantastic from start to finish!"
        }, 
        {
            "index": 73, 
            "rating": "5", 
            "review": "Superb absolute feast for the eyes!. Perfect ballet for all ages and great for kids. So much attention to detail, the set design and costumes and wonderful and of course the dancing and orchestra first class!"
        }, 
        {
            "index": 74, 
            "rating": "5", 
            "review": "Magic. Enchanting from beginning to end. Loved every minute! From the music to the costumes and the dancers, everything was done to perfection!"
        }, 
        {
            "index": 75, 
            "rating": "5", 
            "review": "The nutcracker was Magic. the children loved it and so did we. Top performance and for anyone who visits Amsterdam do not miss out on our national ballet just like you should visit the Concert gebouw orkest, THE orkest in a magical building."
        }, 
        {
            "index": 76, 
            "rating": "5", 
            "review": "Top performance \"as usual\". Top performance \"as usual\". Went to the Nutcracker in December 2015. As the Dutch national ballet is in the world top five, expectations were high. Went with our young adult children. We were not disappointed! A top performance \"as usual\". We will definitely come back again!"
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "Prachtige en geengageerde uitvoering. A phenomenal performance by the orchestra. Unique conductor and soloists eeven the chorus! The solo duo: technically outstanding: timing, elegance, sparkling and symbiose. It is heartwarming and provides you chickenskin icw the music. The rest of the ballet: engaged, high quality. Decors exciting: brings you back to Middel ages Amsterdam. Dreaming away. One point of attention: chronicity of he dancing. A real must-see in and for Amsterdam."
        }, 
        {
            "index": 78, 
            "rating": "3", 
            "review": "Nutcracker. Generally, the ballet was beautiful. The set was spectacular and all the changes happened seamlessly. I did not like Michaela dePrince as Carla. I found her dancing stunted and without passion. Her arms are not graceful and she was not an ideal choice in my opinion. I have seen her before and feel that she is better placed in a lesser role. I understand her life story and her challenges, but I paid good money to see good ballet and her dancing left me feeling cheated.On the contrary, Remi Wortmeyer was wonderful!! He is graceful, athletic and totally superior. Maybe it was his excellence that made Michaela look so dumpy and ungracious. The music was beautiful! The other dancers were spectacular .... it is a pity that the one Russian dancer lost her balance, but even that can be forgiven.... it happens. I think that if I had known that Michaela would be dancing Carla on Monday (28th), I would not have spent €400 on the tickets. It would have been good if the dancers were noted on the programme beforehand."
        }, 
        {
            "index": 79, 
            "rating": "4", 
            "review": "Nice production, but dancing level was a bit low. The production was lovely, beautiful costumes and great dancing.However, there seemed to be some issues with synchronicity of the dancers, and some partnerwork went wrong, and didn't seem clean.Michaela de Prince was nice, and is a promising star, but after having seen the principal dancers in previous performances, it's impossible for her to measure up."
        }, 
        {
            "index": 80, 
            "rating": "5", 
            "review": "Great Experience. I absolutely loved the decoration and the costumes. It goes without saying that the ballet itself is a must on your list of cultural entertainment when in you are in Amsterdam."
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "Dance talent and some more. A combination of xcellent dancers and a wonderfull ambiance supported by an orchestra of magnificent musicians."
        }, 
        {
            "index": 82, 
            "rating": "5", 
            "review": "A wonderful experience. This is a most beautiful performance...everything is perfect, the dance, the music, the costumes and the lighting...we visit almost every year...!"
        }, 
        {
            "index": 83, 
            "rating": "1", 
            "review": "Hansel and Gretel -avoid!. Dreadful staging and set for this opera. Unpleasant allusions to paedophilia. No gingerbread house, instead a huge pile of coloured cushions. The family lived in a Kellogs Cornflakes box. Strange film of children going to bed. The set was very unpleasant to look at. This was not what I hoped for Boxing Day. Mea Culpa. I will do more research next time before visiting Stopera. Waste of money."
        }, 
        {
            "index": 84, 
            "rating": "5", 
            "review": "The nutcracker. Beautiful ballet. Those pas de deux were mesmerising. Really a great production. The opera house itself is fantastic, very comfortable seats, great amenities and they have great ballets and operas. Looking forward to the 2016 season."
        }, 
        {
            "index": 85, 
            "rating": "5", 
            "review": "Lovely ballet. Enjoyed a lovely evening at the production of The Nutcracker. The dancing was beautiful and we enjoyed the music and the enchanting sets. Great experience overall."
        }, 
        {
            "index": 86, 
            "rating": "4", 
            "review": "Grand ballet and orchestra. Dress up and treat yourself to an evening of inspirational beauty. The Stopera as a building isn't as grand as other opera and theatre houses in the Netherlands. No worries : the ballet inside makes up for it !Recently, I have seen the Swan Lake and the Nutcracker. Especially the Swan Lake I found impressive. The Nutcracker is fun to go to as a first experience with the ballet for kids."
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "Wonderful evening. I have seen the production \"Notenkraker en Muizenkoning\" (Nutcracker) of the National Ballet in the Opera Building of Amsterdam (called Stopera). It was a wonderful performance, the story of the Nutcracker is like a fairy-tale. The performance of the National Ballet was beautiful. Wonderful evening in a nice ambiance."
        }, 
        {
            "index": 88, 
            "rating": "5", 
            "review": "Great production. The Dutch Opera Ballet is greatly located by the Amstel. The lights from the Amsterdam Light Festival just add up to the beauty of the location. The theatre itself is very cosy and everything very well organised. The spectacle was great. Not only the production, costumes, scenarios, special effects, but the perfomances both by the orchestra and dancers were outstanding."
        }, 
        {
            "index": 89, 
            "rating": "5", 
            "review": "Great way to spend your evening!. There is this novel idea here in Amsterdam where you can purchase last-minute student tickets for as little as €15. I simply waltzed up to the box office an hour and a half before the show and bought a ticket for the Hänsel und Gretel opera (not one of those miserable standing/back row spots, as my seat was just 10 rows away from the centre of the stage). This is a great venue and and the show was excellent as well - a dystopian (and camp?) take on the classic fairytale.The location is not very convenient (at least for me) as public transport services were nowhere to be found, probably an attempt to keep out tourists. Jokes aside, I think that this is a great way to spend your evening instead of going to sex or torture museums."
        }, 
        {
            "index": 90, 
            "rating": "5", 
            "review": "Fabulous!. What an amazing performance and ambiance! Well worth every penny spent! We loved it! The dancers were matched to perfection and the orchestra was flawless!"
        }, 
        {
            "index": 91, 
            "rating": "5", 
            "review": "Enchanting!. What a pleasure to have seen this performance, the dancers, the music, the stage sets, everything was perfect! The atmosphere was magical and even my husband who was visiting the ballet for the first time was full of praise and thoroughly enjoyed it.\nA lovely way to start the Christmas season!"
        }, 
        {
            "index": 92, 
            "rating": "4", 
            "review": "Great performance. It was my first time at the Nationale Ballet Theater and I had a great time. We were up in the first balcony and the seats were great; it's a great view from the surprisingly intimate-feeling venue\nIt was an interesting, Dutch take on the Nutcracker"
        }, 
        {
            "index": 93, 
            "rating": "5", 
            "review": "Imaginative and unusual productions. I have visited this opera house many times over the last 20 years. There have been particularly memorable productions such as their Ring Cycle, the Makropolos Case, Parsifal, Die Gezeichneten and Gurrelieder and more, plus a truly awful Salome.Seats are very comfortable, acoustics and sight lines are good. One is not ripped off by extravagant drinks prices - Covent Garden please note. There is no \"house\" orchestra, instead it hosts various excellent Dutch orchestras and that means from time to time we hear the Concertgebouw - which was voted the world's best just a few years ago. I love the funereal bongs which signal that it's time to enter the auditorium."
        }, 
        {
            "index": 94, 
            "rating": "5", 
            "review": "First time and won't be the last!. For our 2 year anniversary we decided to see our first ballet. We had tickets to see the nutcracker and the mouse King, sitting the the first balcony in the centre. The hall is not a typical old style theatre but it is well designed with an impressive stage. The seats were fantastic. The sound was also very crisp. What we found really sensational were the set changes and costumes. The Dutch national ballet put on a tremendous production with superb attention to detail in these aspects. The espresso in the break was even pretty decent!! We found a hidden gem to eat at before hand called morena on the Amstel, hidden across the road around the corner. Amazing home style Greek food and lovely service!"
        }, 
        {
            "index": 95, 
            "rating": "5", 
            "review": "Giselle. Fabulous performance! Enjoyed every minute! Have seen various ballets performed by the Dutch national ballet and all have been amazing!"
        }, 
        {
            "index": 96, 
            "rating": "5", 
            "review": "Perfection!. I have been to very, very many operas over the last 50 years but Dialogues des Carmélites at the DNO is one of the most perfect productions that I have ever seen. Robert Carsen makes total sense of a complicated moral issue and Poulenc's music is beautiful beyond words. The whole cast (bravo Doris Soffel) gave their all, and Stéphane Denève and the Residentie Orkest covered themselves with glory. All opera productions are about problem solving and the last scene in this production solves a very difficult problem in a breathtakingly impressive way."
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "We liked the house, and the perfomances are high class. The location is perfect. It was a lot of trouble building the opera, protest actions. It was called Stop Opera, today many people call the Opera for Stopera. We actually liked the place, from the outside and the inside. (It is built together with a kind of City Hall) There are lots of area for strolling. The opera itself is nice. The artistic level is extremely high, we saw an opera and a ballet. Both were impressive, and we have visited most operas in Europe. If you come to Amsterdam, please make a visit, book through internet in advance. Last time for us was in 1998, we will not wait for sol long before we return."
        }, 
        {
            "index": 98, 
            "rating": "5", 
            "review": "Heaven and earth in Poulenc's Dialogues. Dutch National Opera presented a simple, moving, wonderfully staged rendition of Poulenc's Dialogues des Carmélites. The music is versatile, mobile, poetic. The story about Blanche renouncing her noble life in favour of severe devotion, obsessive almost, opposite the dying prioress, who cannot believe anymore and the true heroine, the simpleminded Constance, who simply believes and believes simply. DNO's staging is evocative, stellar. The direction and choreography most effective. A triumph."
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "Powerful performance of Dialogues de Carmelites. A gripping performance under the baton of Stephane Deneve. Staging was sober but highly effective. Sally Matthews was a very good Blanche was, but she could have sounded younger if she used less vibrato. "
        }, 
        {
            "index": 100, 
            "rating": "5", 
            "review": "A five star experience. This is opera at its best! Never before experienced an audience that was dead silent throughout the whole performance. This due to the perfect singing, staging and performance of a splendid cast that made you part of the story. The last scene is of an immense beauty, and therefore heartbreaking!"
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "Giselle. This is exactly the ballet you want to see on Halloween, of course. The Dutch National Ballet is extremely good with captivating lead dancers. If you are a ballet enthusiast, this is not to be missed. The theater itself is conveniently located and modern but with a classic feel."
        }, 
        {
            "index": 102, 
            "rating": "5", 
            "review": "giselle dutch national ballet. this performance by the Dutch National Ballet was just fantastic; especially the second act. What a skills, what a beauty!"
        }, 
        {
            "index": 103, 
            "rating": "5", 
            "review": "Sensational performance. Excellent singing and acting and utterly brilliant sets and staging, highly recommended performance!"
        }, 
        {
            "index": 104, 
            "rating": "5", 
            "review": "Magical. I have been to many different shows of the Dutch National Opera & Ballet. Classical ballet, modern ballet some opera's and it never disappoints and it is always very good."
        }, 
        {
            "index": 105, 
            "rating": "5", 
            "review": "Lunch time concert was a real treat. Every Tuesday the Dutch Opera puts on a free lunch time concert in their foyer. Be there at 12pm because the concert starts at 12:30 and it fills up fast.What a great way to bring the arts and culture to anyone no matter economical status and or knowledge and understanding. More cities should take this lead to make the arts accessible."
        }, 
        {
            "index": 106, 
            "rating": "4", 
            "review": "Magical!. Watched this at the Stopera last night. An evening of exquisite ballet! Wish there had been more Dutch ballet dancers, though.  "
        }, 
        {
            "index": 107, 
            "rating": "5", 
            "review": "Compared with the Met?. The Durch National Opera is well deserving of its reputation and indeed is easily comparable to the Met in NY. Their productions are well crafted and imaginative with creative staging and excellent voices both solo and chorus. The 50 piece orchestra is excellent with both conducting and playing. The productions are first rate and you will have a wonderful evening of opera."
        }, 
        {
            "index": 108, 
            "rating": "4", 
            "review": "Verdi conquers all. Deze boodschap publiceerde ik de dag na de première op Facebook: Yesterday's Trovatore in the Stopera was a musical triumph. Great singers and an orchester that was really inspired. Don't know why it was all set during the 1st World War. Stage directors occasionally have their ways. But Verdi's music was the absolute conqueror!"
        }, 
        {
            "index": 109, 
            "rating": "5", 
            "review": "excellent. Excellent, best Dutch tradition of the 70ies: hans van Manen,emancipating inspiring and relaxing (no wories nu hurry goo dprice, nice people)"
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "Most comfortable opera theatre in Europe. Great views and sulime acoustics. Plenty of legroom. But above all the domestic. Opera and ballet companies are both worldclass"
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "Hans van Manen possibly the world's greatest living choreographer. The \"Live\" program presents four very different modern dance choreographies from Van Manen's long career (\"Live,\" \"Metaphors,\" \"Two gold variations,\" and \"Twilight). The name-giver of the programme is a reprise of a 1979 ballet of a dancer's pas-de deux (Igone de Jongh) with a cameraman (Marijn Rademaker) who follows her dancing -- even to outside of the theatre. What an innovative piece this was, all those years ago, breaking the constraints of stage-space, but also anticipating the notion of a narcissistic love of camera's.The music Van Manen chooses to inspire his choreographies ranges from high-classical (Liszt) to daringly experimental (Cage, ter Veldhuis).It is amazing how Van Manen has always explored new ideas, bored by the prospect of repeating himself.\"Live\" is a fantastic opportunity to see four of the master's creations in one programme! Don't miss it ...."
        }, 
        {
            "index": 112, 
            "rating": "4", 
            "review": "Acomfortable and modern venue for first class Opera and ballet. The Opera house stands on Waterlooplein,and overlooks the Amstel river.It must be one of the most modern and comfortable Opera Houses in Europe,and provides first class performances of both Opera and Ballet.Performances of popular works sell out quite quickly so it is best to book in advance via the internet if possible."
        }, 
        {
            "index": 113, 
            "rating": "4", 
            "review": "Ballet. I have been here for both ballet and opera.It is a really nice place,the staff is really nice. The singers wardrobe was amazing and they have really nice special effects."
        }, 
        {
            "index": 114, 
            "rating": "2", 
            "review": "Very unprofessional staff. I've bought two tickets for the ballet \"Jewels\". After a while I found out that the theatre has charged me twice for them. One of the transactions had been made by the theatre itself, and the other by their souvenir shop, where I never bought anything. I've called them to ask for an explanation and every time a different person answered, always blaming somebody else for the situation. To this day, still no refund and no explanation as to why their shop had access to my credit card! Then when we arrived at the venue we were stuck in a queue after some girls who were claiming to have bought tickets and could prove it through a confirmation email on their phone, but the ticket office had lost their reservation and lost lots of time looking for it. People working at the overpriced cafe seemed like they were doing so for the first time in their lives. Very slow and confused. The first part of the ballet (Emeralds) was definitely bad and boring. We were not impressed by the performance of the cast. Luckily the two parts that followed (Rubies and Diamonds) were fantastic and saved the night. Altogether disappointing, we'll definitely think twice before coming back."
        }, 
        {
            "index": 115, 
            "rating": "4", 
            "review": "Nice Ballet. I went to see the Ballet Cinderella in December 2014 when I was in Amsterdam. The building itself is very comfortable and acceptable but as a Canadian a bit disappointing since it is always a better experience to see such things in a great old European Opera House. The National Opera House in Amsterdam is too much like home. The opera itself was nice but the dancing did seem a little clumsey and perhaps they did not have enough time to practice. Otherwise I had good seats and the costumes and stage effects were fantastic.The food and drink aspect was impossible due to line-ups but this is not an uncommon experience at these kinds of events."
        }, 
        {
            "index": 116, 
            "rating": "5", 
            "review": "A Beautiful Performance. We got to see Cinderella while staying in Amsterdam at the end of December. The show was lovely and performed by many talented dancers. I was taken aback at how strong yet delicately they moved across the stage and the emotion you could feel from their movement.The theater was really beautiful without a bad view. We got balcony tickets far on the side and saw everything and paid less (~50 euro per person). I imagine the less expensive tickets would be as equally great.This is an incredibly amenity to have in a wonderful city!"
        }, 
        {
            "index": 117, 
            "rating": "5", 
            "review": "Suprisingly awesome. We went to see Cinderalla (ballet) and as two people who know nothing of ballet we were pleasantly surprised. Anybody can enjoy the decor, coreography and music, without having a clue about the dance."
        }, 
        {
            "index": 118, 
            "rating": "5", 
            "review": "An outstanding La Boheme. I started the year with my best friend seeing Puccini's glorious romantic drama in Franco Zefferelli's exquisite production at the Met. We ended it in Amsterdam with this marvelous production. Updated to the 1980s, with cell phones and plastic water bottles, it was as visually appealing as the Zefferelli, but what made it so magnificent were the vocal performances of the Rodolpho and the Musetta. We saw a waiflike young Italian singer whose vocal performance as Mimi was marvelous, but whose acting left a lot to be desired. She was directed to be weird, too. This is, I believe,after the Met, my favorite opera house in the world. (I haven't been to La Scala yet, though)"
        }, 
        {
            "index": 119, 
            "rating": "5", 
            "review": "Enchanting. We saw Cinderella performed by Nationaal Ballet last night. Very impressive. I am neither a aficionado nor connoisseur of ballet, but I felt moved and sensed a high level of performance. I understand New York Times considers Netherlands National Ballet company among top 5 in world. Would recommend gladly."
        }, 
        {
            "index": 120, 
            "rating": "5", 
            "review": "Exceptional.. Saw La Boheme on Christmas Day,a really professional and polished performance,comfortable seats and an excellent venue.Well worth the money."
        }, 
        {
            "index": 121, 
            "rating": "2", 
            "review": "Unimpressive by international standards. Both interior and exterior, the Muziektheater reminded me of some local or provincial theatre - well below what I'd expect of a national theatre. I saw a ballet.Quality of music and performance was fine, although again, quality of costumes and staging was below international standards (hardly Covent Garden). What was awful was the noise generated by the audience: constant chatter, both from mothers with their children (don't ever go during the school holidays) and indeed from groups old enough to know better. The kind of thing I'd expect from a pantomime at your local town theatre, not from a venue which is supposed to represent a nation's best. I'll stick to the Concertgebow next time - although I might try an opera here. Would be interesting to see if the audience can behave themselves for that..."
        }, 
        {
            "index": 122, 
            "rating": "5", 
            "review": "Great facility with a good range of programmes. We went to see Puccini's La Boheme opera here, and had a really good experience. The opera itself was a world-class production with major Dutch and international performers. The theatre is spacious, attractive inside and very well run. Food and drinks were easy to find without huge queues."
        }, 
        {
            "index": 123, 
            "rating": "5", 
            "review": "It's worth visit. Everyday I see this building as I always take the subway 'Waterlooplein', which is under this building. The location is in the same building with the city hall, and the complex is called stopera. The ballet is a top class. I've never been to the opera. Even if you don't come for the theatre, it's worth visit. It's a building with a lot of artworks inside. Walk around bij the end of the day, There is not so many people as the office windows of the city hall are already closed. You can find sculptures, painting, sometimes photo exposition and also see the water level of Amsterdam. For this last one, you have to come during the day."
        }, 
        {
            "index": 124, 
            "rating": "5", 
            "review": "acoustics, inside architecture great. The outside is not really attractive, but once inside there is a lot to enjoy. First the view over the canals, next the architecture of the theatre and its spectacular ceiling, and finally the acoustics."
        }, 
        {
            "index": 125, 
            "rating": "5", 
            "review": "Must go if you love ballet or opera. Have been here many times to see a ballet performance or an opera and have loved every single time. Great akoustics and high grandeur."
        }, 
        {
            "index": 126, 
            "rating": "5", 
            "review": "perfect. premiere of the Opera L'etoile. By pure coincidence we managed to get tickets for this premiere. It was amazing and fits to Amsterdam as a houseboat in the canal. Raelly worth to go there."
        }, 
        {
            "index": 127, 
            "rating": "4", 
            "review": "L'etoile. I was fortunate to be able to visit the opera here for the first time on this trip. I found the building, seating and production excellent overall. Unfortunately I personally was less impressed by the opera itself. Perhaps there is good reason for it rarely being performed. Having said that most of the audience appeared to thoroughly enjoy it and it had a standing ovation which may,or may not, be the norm here. Good to see so many young people in the audience and seemingly having a good time."
        }, 
        {
            "index": 128, 
            "rating": "5", 
            "review": "Movement forward. Everyone who is interested in music and choreography should to visit this place. I’ve seen ballet “The Tempest”. It’s fascinating – structure of performance, scenic composition, facilities of dancers. By the way it’s absolutely not classical ballet (in Russian point of view), it’s modern, dynamic, inspired and very talented choreography.Building is also contemporary, well-done concert-hall with excellent acoustics and comfortable positions of seats (you can see the scene from everywhere). It’s not classic opera&ballet palace, this round building intends for movement forward."
        }, 
        {
            "index": 129, 
            "rating": "5", 
            "review": "Nice ballet. Went to enjoy an amazing ballet: The Tempest. Nice building, really good work, we enjoyed and will repeat"
        }, 
        {
            "index": 130, 
            "rating": "5", 
            "review": "Beautiful theater. I've been here four times. The theatre is acoustically perfect. I've seen four productions by the Netherlands Opera. Two were terrific: Peter Grimes and Handel's Samson, and two were awful: The Bassarids and Daphne. It won't keep me from returning, though. The sound is so good, it makes a visit worth any troubles you may have getting to it!"
        }, 
        {
            "index": 131, 
            "rating": "5", 
            "review": "theater. This is a beautifull theatre, with around 1800 seats, more or less all with good vieuw on the stage. Mostly opera and klasical ballet"
        }, 
        {
            "index": 132, 
            "rating": "5", 
            "review": "Top class opera.. Building does not look like much from outside but the seating is perfect - clear views of the stage- and the acoustics are wonderful. Performance of Arabella by Richard Strauss was memorable."
        }, 
        {
            "index": 133, 
            "rating": "4", 
            "review": "Consistently good company. The National Ballet is based in the Muziektheater in Amsterdam. I've been to many productions of this company and always enjoyed them. Perhaps the standard is not quite the best I've seen (I think the Royal Ballet in London for example is better), but it is still very high. Moreover, the prices are very reasonable, so I can go as often as I like. The Muziektheater is a pleasant environment to watch ballet. It is located near the centre of the city and is easily accessed via public transport. I always enjoy the view over the Amstel when having a glass of wine during the interval."
        }, 
        {
            "index": 134, 
            "rating": "5", 
            "review": "Allways perfect.. The great performers (National Ballet, Dutch Opera house etc.) for ballet and opera are allways here and a visit to the Stopera (the other name for the Musictheater) is allways value for money. Try to make a reservation in time, so that you have a good place in the theatre. This theatre is almost any time sold out."
        }, 
        {
            "index": 135, 
            "rating": "4", 
            "review": "Ballet at its best. Not only the ensemble but also the choreographie are again and again of high quality...creative and simply a pleasure to see, enjoy and admire!"
        }, 
        {
            "index": 136, 
            "rating": "4", 
            "review": "Affordable opera and ballet. Going to the opera and ballet is not the realm of the elite in Amsterdam. Tickets are cheaper than many rock concerts. Not as cheap as eastern parts of europe but still great. I went to the ballet and found men not in tie. This was great."
        }, 
        {
            "index": 137, 
            "rating": "5", 
            "review": "Excellent Dance Company. My wife and I attended two performances of this company in our visit this September. The performance hall is conveniently located in the middle of the city. The seats were comfortable and the sight lines excellent. The quite varied pieces we saw over two nights were performed with the highest level of perfection. The live orchestra was excellent. If you like ballet you will enjoy seeing this company during a visit to Amsterdam."
        }, 
        {
            "index": 138, 
            "rating": "5", 
            "review": "Architecturally debateable outside, the venue is superb inside. I love that Amsterdam is so serious about its cmmitment to the arts that City Hall is in the same building as the National Opera & National Ballet! Love or hate the exterior of the red brick and white(ish) marble it is a wonderful place to spend the evening if you are lucky enough to get tickets."
        }, 
        {
            "index": 139, 
            "rating": "4", 
            "review": "Wonderful ballet perofrmance. The place was just next to the river . Easy access by tram from Main station . My family with two teens , watched the ballet group performing \" Romeo and Juliet \". The seats feel very comfortable and we enjoy the performances very much .As for the building I would rate it good ."
        }, 
        {
            "index": 140, 
            "rating": "5", 
            "review": "Super high quality opera!!!!. I have been to this concert room many, many times. I have seen many operas. The quality is always very good. They always find the perfect soloists. The directing is always creative and often quite modern. The atmosphere is nice! Highly recommended!!! When you love opera and go to Amsterdam you must go there!!!!"
        }, 
        {
            "index": 141, 
            "rating": "5", 
            "review": "A wonderful finish to our vacation. My wife and I attended a performance here of Romeo & Juliet by the National Ballet on our last night in Amsterdam. What a wonderful ending to a specular vacation. The seats where in the 2nd balcony and we had a perfect view of the stage and the seat very very comfortable especially with 2 intermissions and a 3 hour performance. Superb!"
        }, 
        {
            "index": 142, 
            "rating": "4", 
            "review": "Beautiful show with a nice view of the Amstel. I have already been twice to the Muziektheater to see a ballet. I enjoyed both very much even though I don't know much about ballet. The theater itself is very nice, with comfortable seats and a good view even from the 2nd balcony. I especially like the view from outside the theater where you can have a drink during intermission, to the Amstel. It is very beautiful at night. The tickets are easy to buy online and you can arrive easily by public transport with tram or metro to the Waterlooplein stop."
        }, 
        {
            "index": 143, 
            "rating": "5", 
            "review": "A night at the ballet. A really good night out. Tickets easy to get and reasonably priced. No restaurant. Tea, coffee and cake available as well as beers and wine. Great seats and all with good views of the stage. Just one interval which was not too long. Metro station beside the theatre. Really good night at the ballet."
        }, 
        {
            "index": 144, 
            "rating": "4", 
            "review": "Glass concert. Great seats with little lights to help read your programme. Great interval snacks. Toilets not easy to find or clearly signposted. Too discrete!"
        }, 
        {
            "index": 145, 
            "rating": "5", 
            "review": "A great night for ballet. We saw the ballet Cinderella here, and loved it. Our seats were at the back of the 2nd balcony, but it had no impact on our experience. We saw everything, the sound was great, and our seats were comfortable. People with long legs might have a somewhat tight spot here, but it was no problem for us (178 cm tall).Efficient wardrobe and an OK bar."
        }, 
        {
            "index": 146, 
            "rating": "4", 
            "review": "example for the world. Go not only to see an opera of a ballet, but let them give you a guided tour and see how this great building is constructed, how costumes are made. Justa very special experience"
        }, 
        {
            "index": 147, 
            "rating": "5", 
            "review": "Stopera. Amsterdam's Opera building is dubbed \"Stopera\", as it is combine with city hall (ST-adhuis). The much anticipated and richly disputed building was opened in the late 80's and is worth a visit. If you can get tickets for an opera, go for it: their productions are always top notch, with spectacular decors and costumes and the world's best singers. There are also tours in the building."
        }, 
        {
            "index": 148, 
            "rating": "5", 
            "review": "World class performances. We saw Parsifal here with the Concertgebouw orchestra and some great voices. It is definitely a place of world class level. The acoustics are good, but it's not advisable to book places at the back as the sound gets a bit muffled by the balconies covering it. If you cannot afford seats in the front rows, go for the balconies instead. The operas are also subtitled in English, which is great."
        }, 
        {
            "index": 149, 
            "rating": "5", 
            "review": "More than a Music theatre. The Muziektheatre is built as part of the \"Stadshuis\" of Amsterdam. During the day it is mainlyfor mundane business, such as for Amsterdamers applying for passport, driving licences, building permits, etc., while the Muziektheatre part is busy with dancers and musicians, stage-hands, etc. doing their rehearsals and preparations for performances.We went a few times during our several visits to Amsterdam, to concerts, operas and dance performances in the evening - both classical and contemporary, and we enjoyed the evenings spent there. We had friends who booked the tickets ahead for us.It is recommended to go online to view the season's or the year's programme listing dates, times and performances, and go on to do your seat booking online. The accoustics are very good. There is a special restaurant within the building serving theatre menu. Upstairs in the theatre, just outside the entrances to the seats, are bars and counters serving drinks that can be pre-ordered and are waiting for you during the intermissions."
        }, 
        {
            "index": 150, 
            "rating": "4", 
            "review": "Home stage to Dutch National Ballet Company and Opera, view at Amstel and canals at night. If you are visiting Amsterdam for a few days, and are an opera or ballet fan, do not miss ´Het Muziektheater´ - The Music Theatre. The productions are very good and something you will not have seen elsewhere. It is a new building overseeing the river Amstel, so you can admire the night view of the canals during the break. (Not everyone will agree with choices of interior design, but this is Holland). The organisation is superb, see the web site for details."
        }, 
        {
            "index": 151, 
            "rating": "4", 
            "review": "Get rid of that salmon on the floor. So much was destroyed to build the Muziektheater annex City Hall, but the result is quite acceptable. The Muziektheater is an impressive building and one of it's habitants, The National Ballet, is a world renown ensemble. If you have a chance when you're in town to visit one of their performances, don't hesitate. And don't let your evening be spoiled by the awful pinkish salmon like carpet which should be ritually burned a.s.a.p."
        }, 
        {
            "index": 152, 
            "rating": "5", 
            "review": "Stunning performance. I was visiting Amsterdam by myself for a few days and thought a trip to see the National Ballet Company perform at the Amsterdam Music Theatre (Stopera) would be a good way to while away an evening. I'm so glad I went - I've seen Swan Lake a couple of times before but this production was in another league. The music and dancing were excellent and even though the show was three-and-a-half hours long I could have watched more! The auditorium is lovely and huge, with seats for 1,600 people - and almost every seat was full. It's not cheap (43 euros) but it was well worth it and I would definitely watch another show if I visit Amsterdam again."
        }, 
        {
            "index": 153, 
            "rating": "5", 
            "review": "Swan-Lake. Went to het Muziek theater Amsterdam...Amazing, Stunning Emotional just Beautiful !!!"
        }
    ]
}