{
    "category": "Budapest", 
    "entity": "Budapest-Pinball-Museum", 
    "avg_rating_stars": 4.795918367346939, 
    "review_count": 392, 
    "rating_stats": {
        "poor": 2, 
        "average": 11, 
        "terrible": 0, 
        "very_good": 52, 
        "excellent": 327
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "Even if you're not a huge fan. I really enjoyed this place. I am not a huge fan of pinball but this Museum has so many machines you can play that are in perfect working condition. I could have stayed there for an entire day and come back numerous times if I had more time in Budapest."
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "So much fun!. Worth a visit. One price to enter and you can play all day on over 150 pinball machines. Some of the machines are over 60 years old."
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "One of the best places in Budapest. We went to the pinball museum on a dry sunday afternoon and we had the time of our lives. We were able to play on every machine without waiting in a line.They even have very old machines and a variaty of other games. Plenty of pinball machines to play a nice game on.Only thing that bothered us after a while of playing was all the noise, because all machines make sounds and play music it became kinda intense after 1.5 hour."
        }, 
        {
            "index": 4, 
            "rating": "5", 
            "review": "Awesome.. Hard to find but totally worth it! Pure 80s heaven. New and old stool arcade machines in perfect working order!Word.of.warning don't put a drink on top of the machine as it is frowned upon!Would 100% recommend going!!"
        }, 
        {
            "index": 5, 
            "rating": "5", 
            "review": "Pinball Wizard! . We had a great time in here, spent a good couple of hours playing in 4 rooms filled with every kind of pinball machine imaginable.We found it not so busy on a Wednesday evening so that means we could get around to playing all of the machines without waiting around, but still had a pleasant atmosphere. A great place to visit being a fan of Pinball or not and very cheap entry makes it well worth it."
        }, 
        {
            "index": 6, 
            "rating": "3", 
            "review": "Cool, if you're a gamer. I would imagine if you're a gamer or kid, this would be really cool. For me, it was alright. I think it's great that something like this exists for that niche audience."
        }, 
        {
            "index": 7, 
            "rating": "5", 
            "review": "So much fun for so little money. Pinball held no attraction for me as a kid. Money was tight, it was too much of a frivolity but here one low entry fee is all you have to pay. Even so as we descended into a dark cauldron of flashing lights and intense noise of adolescents screaming I mentally apologised to my three companions doubting we'd last 5 minutes. Two hours later they dragged me kicking and screaming out of the place. \"Can't I play just one more game? I'm trying to beat my record.\"And that's my big tip. If you go here in anymore than a group of one you'll disagree on how much time you want to spend there. [so work out a plan beforehand]. I could easily have stayed until closing, some 6 hours later. 150+ different machines and not all pinball. You can take a break for a beer and return whenever you like. A huge part of the fun is the time it takes you to work out how each machine works and the just keep improving your score.And if you're over 62 [I just missed out] you enjoy a half price discount."
        }, 
        {
            "index": 8, 
            "rating": "5", 
            "review": "very impressive collection. there must be 5 dozen machines in there. amazing collection of pinball machines, with just a few video games as well."
        }, 
        {
            "index": 9, 
            "rating": "4", 
            "review": "For everyone who wants to have fun. I was little bit skeptic about this place when I saw it in TripAdvisor, but my girlfriend made me to visit it and how fun it was. Definitely would recommend to come there and spend some time playing with different pinball machines. For just around 8 euros, You can be there all day - that means that You can go out and come back later."
        }, 
        {
            "index": 10, 
            "rating": "4", 
            "review": "Fun diversion . Saw the reviews on trip advisor so decided to give it a try. Glad we did. Fun to play so many old games; nostalgic; interesting date spotting; and a fun diversion from the usual sightseeing. Not expensive. Wasn't busy on a Sunday so never had to wait for machines"
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "The most fun I've had in years!. This little pearl in the middle of Budapest might have gone unnoticed, if not for the awesome reviews it gets, and rightly so!The idea is simple: pay a small entrance fee, and enter a world of endless fun mashing a couple of paddles for the instant gratification of hundreds of blinking lights. What else do you need?The wide selection of games, the awesome atmosphere and the nostalgic blast from the past feeling you get a second after entering the first of 4 halls, all left me speechless and aching for more, more, MORE!I nearly cancelled my flight back home just to keep going at these machines.A must visit for everyone!"
        }, 
        {
            "index": 12, 
            "rating": "5", 
            "review": "Pinball. Pinball, pinball, pinball, pinball and a few arcade games. It's all for free after the cheap entry which is even cheaper with student card. So much pinball it makes your head spin and its open late. Only one downside: no beer."
        }, 
        {
            "index": 13, 
            "rating": "5", 
            "review": "SO MUCH FUN!. We loved it! It took some finding, but when we did eventually find it, we loved it! Very nostalgic. Well worth visiting!"
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "Addictive!. Must admit that I had so much fun at the Flippermuzeum the first time round that I had to go again on another visit to Budapest. Once I'd marvelled at what it must take to upkeep these machines, some dating from the 1930's, fun started to take over and you then want to play on as many of the pinball games as you can. Fortunately there is no rush as you pay an entrance fee of about £6-£7 which allows you to come in and out as you please for the day. Also a juice type bar on site. Great fun for the kids as well as the big kids"
        }, 
        {
            "index": 15, 
            "rating": "4", 
            "review": "If you like pinball, visit. Came across this on TripAdvisor and we went because husband is a bit of a fan of pinball. Spent a couple of enjoyable hours there one night after dinner. Good value, good fun, free WiFi. You pay an entry fee and play all the machines for free. Maybe not as many machines as the one in Las Vegas, but still worth a visit if it's your kind of thing."
        }, 
        {
            "index": 16, 
            "rating": "5", 
            "review": "More than just pinball :). I was expecting it to only be pinball machines, but there were a bunch of other old and new machines of other sorts. Like hockey ball, and shooting and arcade. It was definitely worth the 8 euros to play all the games for as long as you want. I brought a date there and she loved it."
        }, 
        {
            "index": 17, 
            "rating": "2", 
            "review": "Amusing for boys. 10 minutes by walk from Keleti Pályaudvar train station, metro and bus. Two big rooms in a pavement full of old pinballs from 1050's onward. It is an amusing and interesting stop for travellers with boys, You can spend there 1 hour in a very noisy but unique place, Ticket low cost"
        }, 
        {
            "index": 18, 
            "rating": "5", 
            "review": "Amazing and addictive!! . We arrived late on a Fri night but the place was open till midnight luckily. You pay a one off day fee of about £7 / €8 and they will give you a wrist band so you can go in and out. Great range of pinballs from various decades it's so easy to spend hours in there!! We really loved our time there. Would do it again!! Note that it's closed all day Mon and Tues. "
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "If you like pinball, you should go!. I went by myself to check it out and ended up spending 3 hours playing games! There are SO many pinball machines - and they all have information about when they were created (year, inventors, etc.). It was interesting to see how the games evolved from the 1940's to today.Once you buy an admission ticket, you get a wristband and can play all the games for no charge. There are a few rooms so you aren't too crowded but the machines are right next to each other. There are also a few non-pinball games (regular video games).For something different to do, I would highly recommend this place! It's something I'll remember about Budapest!"
        }, 
        {
            "index": 20, 
            "rating": "5", 
            "review": "Big choise!. When I knew about this museum I decided that I really want to visit! I have never tried pinball (only pc game), so I was shocked by quantity them! This museum has a lot pinball, kicker, mortal combat and different shooters."
        }, 
        {
            "index": 21, 
            "rating": "4", 
            "review": "Hard to Find - But Loads of Fun!. We had a little difficulty finding the museum. But once we did we enjoyed the experience. You pay a small cover charge (around $10) for unlimited play time. You can go from room to room exploring different pinball and arcade machines from the 1930's to present. We had a blast!"
        }, 
        {
            "index": 22, 
            "rating": "5", 
            "review": "Flipping good. Found this place by accident after walking by on way to the Danube. Absolutely love it. Has my all time favourite pinball machine there. South park pinball :) . Even my fiancee loved it. Has arcade games too. Bargain for 2500 forrint ."
        }, 
        {
            "index": 23, 
            "rating": "5", 
            "review": "AWESOME!!!. Went here Sep 16 and it is one of the best and coolest places i have ever been, could have spent all day here!Only cost about £6 to get in and for that you get unlimited play of all the machines. About 50 or so pinball machines as well as loads of retro 80's arcade games. One thing to bear in mind is that it doesnt open until late afternoon most days - we went there midday and found it to be closed so had to come back a few hours later. Excellent way to spend a couple of hours."
        }, 
        {
            "index": 24, 
            "rating": "4", 
            "review": "Really fun!. Really great visit, lost track of time a bit. But was fantastic for escaping from the rain and having some harmless fun for a few hours. Would recommend if you have a bit if spare time in Budapest after all the sight seeing."
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "So many options, so little time!. This was probably my favorite place in Budapest during the one week I spent there. You pay an entrance fee and can then come and go as you please throughout the day. The museum offers a variety of old school machines, ranging from The Who's Tommy and Q-Bert to some more modern varieties like South Park and Family Guy. Some other arcade favorites such as Space Invaders and MK are also available. It's easy to lose the day spending time here, so one should be aware of that before entering. Can't recommend more highly."
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "Excellent. Excellent museum for pinball fans. Entrance fee but you can play the machines. A good place to have fun"
        }, 
        {
            "index": 27, 
            "rating": "5", 
            "review": "The best interactive museum in the world. A brilliant few hours were spent playing loads of Pinball machines, the entry price was very affordable and there is a discount for EU students.Everything was free play once you are in, and a few are multiplayer, you could bring a paper and pen and write down your highscores and get a mini competition going with friends!A perfect activity during the day, we turned up at 4 when it opened and it didn't get busy until 7pm.It isn't open on Mondays and Tuesdays.Some really old games were playable, a few were temporarily broken, but what doesn't have a few screws loose after 40 years? ;)"
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "A bit of nostalgia. A fun way to spend a few hours - if you like playing pinball machines.A nice touch was that each machine has some information about it.The entrance fee includes free games on all the machines."
        }, 
        {
            "index": 29, 
            "rating": "5", 
            "review": "Great piece of gaming history . Both brilliant as a record of gaming history, and a fun way to spend your day. At about 8euro in, you can spend as long as you want playing pinball, and a few other arcade classics. If you can put up with the noises and flashing lights, it's well worth a visit."
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Fantastic. Growing up in the 80's I have fond memories of pinball so when I heard of this place in Budapest through trip advisor I had to check It out. Like previously stated this is less a museum & more a huge pinball hall with 200 plus? Pinball machines from the 70's & 80's including classics such as Terminator, Last Acton Hero, (my favourite) and The Simpsons. Pay one price on the door & you can play as many machines, as many times as you like,for as long as you like, great concept. I can't remember how much I paid to get in (it wasn't much) so I really found this value for money & great fun! Stay for a few hours, only reason I left (reluctantly) was because it was 30 degrees plus outside & I had lots to do on my itinerary still, otherwise I could have stayed here all day! But do check the opening times before you go as normal hours are from 16:00 to 00:00 but on Sunday was open from 10:00 till 16:00 so worth checking, plus only a 5 minute walk from a nearby metro station. Personally I'd say it is best to go in the evening or on a rainy day as it was getting pretty hot in there, but an absolute must if you are in Budapest!"
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "Give your fingers a workout. This was one of those great quirky finds. Turned out to be walking distance from where we stayed, so i popped over with my two kids (12 and 14) to show them he \"video games\" of my childhood. We had a blast. It was just a few euros each, and well worth it. The one odd thing was being able to play continuously...if you played pinball as a kid part of the excitement was that you had to win extra games through points or luck (or both). We spent an hour or so, and if it hadn't been so hot 9and if my fingers weren't cramping up) would have stayed more."
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "Amazing place. We spent 4 hours there, amazing experience, we would definitely return. We fell in love with those machines.. We appreciate that the staff was kind and helpful. This place has really fascinating atmosphere."
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "Great Atmosphere. Greeted by friendly owner. Great atmosphere. Extensive selection. Well maintained machines. Would definitely return."
        }, 
        {
            "index": 34, 
            "rating": "5", 
            "review": "Pinball Wizard. Wizard place, full of all kinds of pinball machines as well as other arcade games, all fee to play for about 1250 florints. Don't underestimate how long you want to spend here, I didn't want to leave."
        }, 
        {
            "index": 35, 
            "rating": "5", 
            "review": "Fun night out. If you love the old pin ball games.and want to be surprised by MANY that you have never tried.this is the place to go. Simply a fun night. Only draw back...it gets pretty darn hot in there if the weather outside is warm......no air conditioning or if there is...it is not working."
        }, 
        {
            "index": 36, 
            "rating": "5", 
            "review": "Great way to burn a few evening hours and bring the nostalgia. The pinball museum was great fun. As a lover of mechanical whimsy, it was a rush to play with games dating back to the Great Depression! Don't forget to claw a candy on your way out!"
        }, 
        {
            "index": 37, 
            "rating": "5", 
            "review": "Pinball Magic. Spent about an hour in there could have spent longer but as it was such nice weather didn't want to spend too long indoors. They have a large range of pinball machines from different years- and a few other arcade style games, quite a few football themed ones. You are able to buy soft drinks in there but not alcohol."
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "Cheap and cheerful. We spent 2 hours in here playing pinball games (and Pacman and Space Invaders). It was a lot of fun and my son could have stayed much longer. As it got later (we left about 6 o'clock) it got busier and hotter, but you didn't have to wait for a go as there are so many. It was a lovely day so we didn't want to stay any longer, but on a rainy day it would be great. It is hard to find (not signposted and called The Flipper Museum) There's just one little sign and then you go down into it."
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "Very impressive. We stumbled into this museum completely on accident while walking around in the city. For you are not looking for it, it is very easy to miss as it is in the basement of a building in a side-street. The staff was very nice and their huge collection of machines was very impressive! Although we did not play, there were many people playing and the staff gave us a brief history on some machines. This is a very interesting museum for children as well as adults!"
        }, 
        {
            "index": 40, 
            "rating": "5", 
            "review": "Great museum. We loved our time at the Pinball Museum. They allow you to play on most of the machines which is great. The staff were very friendly and welcoming. We cycled to the museum and they allowed us to store our bikes inside, and they offered student discount.If you are looking for a place to spend a couple of hours gaming the traditional way, visit the Pinball Museum."
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "The coolest thing n Budapest!. You have to go for a couple hours and play at the Budapest Pinball Museum. Its interactive, so most of the machines are up and running. Its really a blast from the past playing all these different pinball machines from the past. Afterwards stop at a pizza place called Local Korner for delicious pizza!"
        }, 
        {
            "index": 42, 
            "rating": "5", 
            "review": "Must-See in Budapest. Came here as a couple, planned on looking around for an hour - played for three hours and still wanted more. Special museum, very worth the money and the time."
        }, 
        {
            "index": 43, 
            "rating": "4", 
            "review": "Lovely nostalgic place to visit. If you want to spend an hour or more playing old school pinball machines for a low price this is the place to go. With no windows it let's you completely emerge in the games and forget all about time. They do serve drinks and snacks but no alcohol."
        }, 
        {
            "index": 44, 
            "rating": "4", 
            "review": "Great for pinball lovers. I love pinballs and it's always hard to find places with many machines in good condition. Budapest Pinball Museum scores 10/10 in both, loads of machines and nearly all very good taken care off.How ever the place needs some better ventilation, as it was hot outside and no AC this basement was super humid and hot. Also I really enjoy a beer with my pinball playing which you can't get here (it's a museum, not a bar). Around 2 hours of great fun for anyone that likes pinballs =)"
        }, 
        {
            "index": 45, 
            "rating": "4", 
            "review": "Great fun for a few hours. Great place for any fans of vintage arcade games - you can play on all of the Pinball machines for free once you've payed the entrance fee and the games span from the 1930's to the present day, so it's a great way to see how the game has developed. Mainly, it's just a really fun way to spend a few hours in the city."
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "What a pleasant surprise!. My girlfriend was a little afraid of to expect, but in a few minutes she enjoyed everything almost like me, a convinced nerd."
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "Budapest pinball museum. Great experience for a small price. It is fun seeing all the old forgotten pinball machines being brought back to life and have unlimited plays to live out your childhood dreams and chase your personal high-scores."
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "Great fun and great value. . Great day out. Loads of machines. Not too crowded so get to go on all you want. Pay 2500ft then stay and play as long as you like. Some other classic games including mortal combat and space invaders. Loved it!"
        }, 
        {
            "index": 49, 
            "rating": "5", 
            "review": "Great fun!. This place is great - loads of machines, older and newer, really good fun and very addictive. Will be back as the time just disappeared. Trust the reviews and enjoy!"
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "Awesome way to spend an evening with friends, partner or even on your own.. Great fun. You pay a fee and have the ability to play on all the pinball machines for free dating back from the beginning of the pinball machine to present day. I would recommend a stay of between 1 and 2 hours as any longer and my feet were hurting and I had the sound of pinball machines stuck on my head."
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "A lot of fun!. It s 80% a museum. It s 100% funI m 27 years old but i was like a child in there. You will find all the existent pinball machines from around the worldOld and new ones. And many more!You can stay and play how much you want. It s about 12 euro for adults and 6 euro for students and <26 yearsFree wifi"
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "Weird. Personally, I don’t think it is a museum. It is more like an entertainment center. However, if you go with friends and family, it could give you much fun."
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "Can I stay forever?. This is one of my absolute favourite attractions I've ever been to. I went with two friends and my boyfriend and we had so much fun. Honestly, I could have stayed all day."
        }, 
        {
            "index": 54, 
            "rating": "4", 
            "review": "Great fun for all ages!. Go here with a friend or family - much more interesting than an arcade, with the history all around the machines. Especially recommend the games to play against each other. Only point off is that a few of the games weren't functioning, and it was too hot to last for more than a couple of hours. Good fun though!"
        }, 
        {
            "index": 55, 
            "rating": "4", 
            "review": "Pleasantly surprised. This isn't a museum but a fullon arcade history trip. Interesting machines you can get into for hours. No time limit, no extra charges (but there are lovely tshirts for 3000forint). The only downside is the poor information about the machines."
        }, 
        {
            "index": 56, 
            "rating": "5", 
            "review": "Finally a museum our teenagers begged us to see!. Great exhibition for all fans of amusement games. Pinball games from several decades, most I believe were from the 1980's and 1990's. When you have paid a reasonable entrance fee, you can play all you want for as long as you want. Beware, the museum is not open everyday, and does not open until the afternoon (check their website for details)."
        }, 
        {
            "index": 57, 
            "rating": "5", 
            "review": "Really fun place to visit. With one admission fee you can play as much as you want. Lots of flippers from 1940's to this time. Also couple of arcade games. You can easily spend several hours over here. And it's also for the no-gamers too. There is also a small bar where you can buy some soft drinks."
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "Something different. Great fun! We were bored of the same old kind of sightseeing yawn! So this place was a breath of fresh air. One admission price and you can play games until your heart is content."
        }, 
        {
            "index": 59, 
            "rating": "4", 
            "review": "A unique place. A great way to spend your time especially if you like pinball/flipper games. I have never seen anything like this. We spent 2 1/2 hours playing dozens of machines, hundreds of games. It serves as a museum as long as you look at the signs describing where and when the machines were built. One complaint: it was a hot day, but there is no excuse to have no air conditioning in the museum constructed in an underground basement room system."
        }, 
        {
            "index": 60, 
            "rating": "5", 
            "review": "Fun!. We had so much fun visiting this place! We were traveling with our children and my in-laws. There are so many games to play! What a fun stop during our sightseeing. The only down side is that it needs more a lot more a/c units. It gets hot! But fun, nonetheless."
        }, 
        {
            "index": 61, 
            "rating": "5", 
            "review": "a must visit attraction. fantastic fun for the family - children, teenagers and even over 65's who get in for half price. Interesting to play the older machines which now seem very basic."
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "Cannot recommend strongly enough. This place was great value for money at about 3-4euros for students (under 26). We could play as many of his 150+ machines as we liked for as long as we liked. Ended up staying for hours.\nCannot recommend strongly enough. Amazing place to see and also to play."
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "SO MUCH FUN !!. We had our 14 year old son with us and thought this would be a fun way to while away the hours one evening. We were right - but I didn't realise that I too would have so much fun. We stayed right up until closing at midnight. All games are free once you pay the approx A$10 entry fee. We had a blast and my arms and hands ached the next day!!"
        }, 
        {
            "index": 64, 
            "rating": "5", 
            "review": "Awesome place. I have spent a great evening here. A wild array of pinball machines. Apart from highly sought after machines (like i.e. Sacred Stiff), there are many old yet fully electromechanical pinballs (oldest from 40s if i recall correctly!), and a nice collection of oddities that I have never seen before. One of the reasons why I plan to come back and revisit Budapest ;)"
        }, 
        {
            "index": 65, 
            "rating": "5", 
            "review": "This place is the shiznet!. So much fun! Just ran in to get out of the rain and ended spending the afternoon, so many beautiful and crazy , intricate machines Good value for the money, unlimited play."
        }, 
        {
            "index": 66, 
            "rating": "5", 
            "review": "Flipping fantastic. I happily spent an evening in this 'Museum' and it was excellent value for money. You pay once then you can play any machine, they are all on free play. When I visited on a Thursday night it was not busy and I played a lot of pinball.They also have some retro arcade machines :)The refreshments were reasonably priced."
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "Fantastic hidden gem . This place has been one of the highlights in both of my trips to Budapest. It consists of an underground arcade where you can track the history of the pinball machine through tens of the games. The oldest and most classic and separated to give you an easy timeline and most still function!The place has an excellent vibe of fun and the people who work there are enthusiastic and engaged.It can get rather hot down there in the Summer however although there is a bar located inside.Definitely worth a visit."
        }, 
        {
            "index": 68, 
            "rating": "5", 
            "review": "Less money, more fun!. I've been here last week w/ my friend. Tiney place with lots of Pinball, old games e.g.: Mortal Combat,Space invaders etc.Try it if you are in the capital!"
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "Fabulous. Just fabulous. Loads of machines on free play. Nice atmosphere and so much to have a go at. Once paid you can go back same day. We spent a total of 5 hours there broken down into 3 visits. My teenagers were entranced. Thoroughly recommended."
        }, 
        {
            "index": 70, 
            "rating": "5", 
            "review": "An awesome night. You go in a bit skeptical, and than 4 hours later you leave with a huge smile across your face. Going in with a group of friends who like pinball is a guaranteed night to remember as you will enjoy every single one of 50+ machines. A really strong recommendation"
        }, 
        {
            "index": 71, 
            "rating": "5", 
            "review": "Perfect rainy day destination. Still an off the beaten path location, the museum is am underground arcade with nothing but pinball machines. You pay a flat rate (about $10/person) and then it's unlimited play on everything. No coins required. I never had to wait for machine and we easily spent 2-hours here when it was a rainy day out. Definitely recommended for families!!!"
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "Be a kid again. Simply good fun. Very retro. If you are a bit older like me and used to enjoy pinball and some of the older 2 player fighting games then you wont be disappointed."
        }, 
        {
            "index": 73, 
            "rating": "5", 
            "review": "Good fun. Pros:You get to play all machines unlimited times with a flat feeFriendly staffA lot of machines!!Most machines workBonus: also a small number of non-pinball arcade machines fun for couplesNot crowded, no one rushing you or staring at your back waiting for their turns. A good deal if you are european studentCons:A few machines didn't work"
        }, 
        {
            "index": 74, 
            "rating": "5", 
            "review": "Best thing to do in Budapest. Went here to fill in some time and take a break from the rest of the city. I never even really liked pinball that much but ended up spending 5 hours here without even noticing! It's 2500ft for entry (1250ft for youth concession with id I think) and unlimited play on over 100 pinball machines from 1930s to present and other arcade machines such as space invaders, mortal kombat, pacman, gun shooting games and quite a variety of two player table games. It's open from 4pm-late on Wednesday - Saturday and 10am - 10pm on Sunday so keep in mind it's closed on Monday and Tuesday. Good to go on Sunday when a lot of other things are closed in Budapest. Wasn't particularly crowded as there are so many machines to choose from and you don't have to worry about being terrible and losing a lot like me."
        }, 
        {
            "index": 75, 
            "rating": "5", 
            "review": "fantastic. even if you are not lovers of pinball is a place worth visiting.you get there and you remember when you were young-as adele sings-and you spend for sure 2 hours there.The entrance fee is 1250huf.is not so difficult to find the place is near west end city center and you have to stop at lehel ter metro station(blue line)"
        }, 
        {
            "index": 76, 
            "rating": "5", 
            "review": "Amazing!. Real value for money!This should be on your list when you visit buda! Most are pinball machines but a few arcades like Mortal Kombat and Terminator.We spent around 3 hours there and also drinks were pretty cheap :)"
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "So good and great value. Me and my partner both enjoyed this place so much which was a bonus as I didn't think she would, there were so many machines to play on brought back many memories for me as a kid playing in arcades and it was not over crowded when we visited so we had as much time as we wanted, the staff were friendly the woman ordered us a taxi for our departure, there is also a little café inside if you need to use, we spent around 2 hours in here and just about managed to try all the machines."
        }, 
        {
            "index": 78, 
            "rating": "5", 
            "review": "Great fun. This is a hidden gem of Budapest. For a small fee, you have access to the pinball museum and all of it's vintage arcade games for the entire day. I am not a gamer myself but I had a lot of fun here and wish I could have stayed longer."
        }, 
        {
            "index": 79, 
            "rating": "4", 
            "review": "A lot of fun. I have never seen such a great collection of classic pinball machines. They have machines dating from the 1940's all the way up to present day. And you can play them all! My brother and I had a blast."
        }, 
        {
            "index": 80, 
            "rating": "5", 
            "review": "Very special place for Pinball lovers and not only. Great expiriance , one of kind.Pay one and play for any time you want. A lot of history and childhood memories.They even have Terminator machine :)"
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "Fun!. We walked here from the jewish quater...took about 40mins.\nDidnt cost much to get in and we spent a good hour or more there. A few of the machine were broken but still more than enough in there to keep you entertained.\nLoved playing the really old school machines, made all of wood.\nReally nice place to visit."
        }, 
        {
            "index": 82, 
            "rating": "3", 
            "review": "Fun for 2 hours . Mom and boys at 16 and 18 years payed 5000 ft and had a good time playing for 2 hours. We walked for about 5 min from the West End Shopping to get there."
        }, 
        {
            "index": 83, 
            "rating": "5", 
            "review": "Flipping Fantastic. This is honestly one of the most fun places I've been to. We spent a good 2 hours here one afternoon, and I could have easily stayed for longer or returned another day. After you pay your entry fee you gain entrance to the 'museum' where all the pinballs are set to free play and you can play away to your hearts content! There are some really old basic ones that show what folk would have played in the past, and more modern ones that are just mad.Some of the machines are pretty old and over used, so you have to be quite patient as those ones can be a little slow. When we went some of the machines were broken too, but there were still plenty of others to play with, so it was no problem at all. There's a little shop selling drinks and snacks where you can go to for a little sit down before getting back to the games. A great place to spend some of your time in Budapest. Loved it!"
        }, 
        {
            "index": 84, 
            "rating": "5", 
            "review": "Brilliant. Absolutely loved this place. Talk about taking a step back in time. There's loads of cool games to play, not just pinball. Pay your 2,500fl and you get unlimited game time. It's a bit off the beaten track so make sure you do your research and you know where you're going!"
        }, 
        {
            "index": 85, 
            "rating": "5", 
            "review": "Pinball Heaven. What an amazing place. I could have spent my entire Budapest stay here. Pinball machines dating back to 1923, and some of my favourite games from the sixties & seventies. Two downsides - it's very hot& clammy in this cellar based building; it's closed on Mondays and Tuesdays (they probably need two days to repair the machines after the hammering some people were giving them). Awesome, wish I could give them six stars."
        }, 
        {
            "index": 86, 
            "rating": "5", 
            "review": "Really fun. Came there a short while before closing time so didn´t have much time for playing. But we had time to play a few of the machines and liked it, if I go back to Budapest I will definitively go back there to play some more."
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "best place ever. this is the first tripadvisor review ive written completely on my own initiative. this was the greatest place ive ever been, and i didnt even know i was a fan of pinball until today. please just go. there's something that pinball has that no modern game can hope to recreate. lights, scale, sound, mechanics, whirring, clicking, flashing. was a good time. will be back."
        }, 
        {
            "index": 88, 
            "rating": "3", 
            "review": "Cool but missable. There were over 50 pinball machines with different themes to play and its all quite cool. There were even some old fighting and shooting games. It was fun initially but gets boring after awhile. Max 1 hour to spend at this place unless you are a pinball fan"
        }, 
        {
            "index": 89, 
            "rating": "5", 
            "review": "Worth (at least) one visit. Amazing place, absolutely worth a visit, really good fun. You pay the entrance fee and play as much as you want to on all the pinball and other pub machines."
        }, 
        {
            "index": 90, 
            "rating": "5", 
            "review": "Suede. Perfect place to spend some hours at when it rains! Now they also have a bar with snacks and drinks.The Suede fans"
        }, 
        {
            "index": 91, 
            "rating": "5", 
            "review": "Nostalgic and great fun.. It took us a while to find, but when we did, it was fantastic. So many old school gaming machines, not just pinball. It was a great experience."
        }, 
        {
            "index": 92, 
            "rating": "5", 
            "review": "A great find!. Stumbled on this place as we were heading back to our accommodation. I've always been a lover of Pinball machines and they have some greats here!\nSpent a lot more time (and money) in here than I should have done! If you're a fan of arcades/pinball - go visit!"
        }, 
        {
            "index": 93, 
            "rating": "5", 
            "review": "Best fun in a museum!!!. Super cheap entry fee, access to play all the pinball amusements and machines dating back as far as the 1920's still in working order - honestly could not have wanted more! Best fun to be had ever!!We spent about 2 hours in there and it was enough to try out the machines that interested us to our hearts content :)"
        }, 
        {
            "index": 94, 
            "rating": "5", 
            "review": "Awesome experience. My wife and I decided to go after the weather turned to thunderstorms, and we managed to spend more than 4 hours here. The collection of machines is excellent and there is quite a few including some football and shooters. Nice drinks available as well!"
        }, 
        {
            "index": 95, 
            "rating": "4", 
            "review": "Fun time in museum. Undoubtedly it is one of the museums with the best ideas I have ever visited. There will be a museum about history, about arts in every country, but rarely games, let alone pinball.In the museum there is a variety of games, mainly pinball but also some table football and shooting games etc.. For pinball machines are set in different themes and hence different layout.The reason to deduct a point was that quite a number of machines are broken or not functioning well. For example, there is a table football game where you can control 8 players individually up and down the pitch to kick the ball. Sadly a number of figures in the table were broken. Some other controls were sluggish due to mechanical problems. Would be perfect otherwise."
        }, 
        {
            "index": 96, 
            "rating": "5", 
            "review": "Best Museum ever. Now this is what I call a good night out. 2500fht (£6.60) to get in, free use of all the machines inside. So many different types to use. Cash only and snack bar there. I found one dating back to 1925 it's not often you can go to a museum where you can touch and play!! Why don't we have these arcades anymore??! Staff friendly and spoke enough English for my interactions I am glade I went and would suggest you go as well."
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "This is better than heaven!. I was really looking forward to visit this museum... And it fullfilled more than my expectations!!!Around 130 pinball machines was waiting for me. I think I played 50-60 machines in almost 5 hours.If I could, I should give the rate 6 of 5!!!I will surely visit it agan <3!!!"
        }, 
        {
            "index": 98, 
            "rating": "5", 
            "review": "Just one more game.... If you like pinball machines then this is the place for you! Even if you don't think you like pinball machines this is still the place for you. For the price this will easily give everyone some great entertainment. Not to be missed."
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "Flipping Out. I didn't actually play any pinball at the Pinball Museum, but the English-speaking staffer was kind enough to let me wander around and soak it all up at no charge. It was actually drizzling the night I stopped by, so I was thinking that this basement bursting with pinball machines would be a perfect activity for the weather. I was impressed; it seemed like each turn of a corner ponied up more and more machines. The website states that there are about 130 machines. The place is cash only (there are ATMs a brief walk away), and there are some cool t-shirts for sale. Closed Mondays and Tuesdays. From the vintage to the modern, you'll find plenty of flippers to flip here!"
        }, 
        {
            "index": 100, 
            "rating": "5", 
            "review": "So much fun!!. Had one of the best times in here. Small entry fee and all games are free-play which almost lead to playing the night away. Highly recommended!!"
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "Great 2 hours spent one evening - brought back many memories. We'd seen this on TripAdvisor and decided to visit one evening after eating. We spent 2 hours in here and had a great time.Mainly pinball machines but also classics like Space Invaders etc.Machines range from 1930s to modern day (1990s).All usage is included in the entry fee.Highly recommended if you have a couple of hours to spare."
        }, 
        {
            "index": 102, 
            "rating": "5", 
            "review": "Interesting and fun.. You pay a reasonable flat fee (€8 fpr adults when I went), get a wristband, and play over 100 machines spanning at least 5 decades for no additional fee. Place is in a basement with a lot of character, arched brickwork, themed decorations. It was a lot of fun, and I got to play machines I hadn't seen since I was a kid. Bring cash for admittance, snacks, and the colurful souvenir tshirts (couple of banks with cash machines just a short walk). Attendant was friendly and helpful. A must do if you have a pinball fan with you."
        }, 
        {
            "index": 103, 
            "rating": "4", 
            "review": "Off the beaten path. Off the beaten path, but worth the walk. This \"Museum\" allows you to play unlimited pinball on all the machines. Take a trip down memory lane and show your children a time before Internet and iPads!"
        }, 
        {
            "index": 104, 
            "rating": "4", 
            "review": "A bit of fun. An absolute Mecca for pinball lovers and unbelievably great value for a family with late primary/secondary school age .Some of the older machines are quite fascinating and still engaging, but if you have a favourite pinball machine, chances are its here, and you'll be flipping away for hours...."
        }, 
        {
            "index": 105, 
            "rating": "5", 
            "review": "Brilliant fun for a great price. I've not played many pinball machines in my life, mostly because in the UK they charge you a pound a time and that's just daylight robbery. So the idea of paying a single entrance fee and in return getting limitless goes on all of the machines sounded too good to be true.Actually, it was even better: this place is HUGE! I got distracted by the first room of machines and thought that was good enough, but after going around and playing all of them (some of them multiple times), we wandered into the next room and discovered about 50 more pinball machines plus even more rooms with other old arcade games. It's amazing how good you can get when you can just keep playing until you get that one monster that's continually trying to evade you.Most of the machines had details on top of them giving date and country of manufacture, but it's perhaps a bit of a stretch to call it a \"museum\" - although that is a very minor quibble. And honestly who doesn't like an interactive collection anyway?! It's the best kind! They even had a few pieces from the very beginning of arcade games, including a shooting game from the 1920s and an early pinball from the 1950s which could actually still be played (it seemed remarkably lethargic after the fast-paced flashing-light versions from the 90s, but was awfully quaint and conjured up a simpler time...) I also liked how they had bagatelle boards, both at eye-level and hung on the walls. I used to play bagatelle with my grandmother but it wasn't really until I saw the very old pinball machines that I realised the similarity between the two and made the connection that bagatelle must have inspired pinball. At that point I rather wished that there had been some actual information boards, as in a \"normal\" museum, to further detail the crossover and perhaps give background on the first automated machine . . . but perhaps I'm being overly enthusiastic. I'm probably the only person who's ever visited this place hoping to genuinely learn the history of arcade games!!We spent about an hour and a half in here - the time honestly flew by, I thought we'd only been inside for 20 minutes - which was probably enough. After a while even free pinball gets a bit wearying. Still I imagine that it'd be a great place for kids. Beware that if you're at all obsessive then you might be in there for considerably longer than you'd planned!!!"
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "More than a museum!. This place offers a lot more than a regular museum. Here you can not just watch pinball machines, you could even play with them! And there is no time limit! The childrens loved it, we spent almost the whole afternoon there."
        }, 
        {
            "index": 107, 
            "rating": "4", 
            "review": "Good value attraction. We only had time to spend about an hour here, but if you had longer then it would be excellent value for money. We found some of the machines unclear as to how to reset them, so could only play the ones that were ready to go, but it was still fun."
        }, 
        {
            "index": 108, 
            "rating": "5", 
            "review": "Perfect for a rainy day or relaxing evening. In the afternoon/evening of our last day in Budapest it was raining hard. I had read about this place beforehand so figured it was a great place to spend some time indoors. My wife and I both loved it! It's easy to spend a long time here as all the machines are free-play. It's interesting to see how pinball machines have evolved since the late 1930's."
        }, 
        {
            "index": 109, 
            "rating": "5", 
            "review": "So great! Time machine. We loved it! Entering this place is like entering a time machine. So many fun games from the last. It was amazing."
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "Unique place and definitely worth a visit!!!. The entrance fee is small, and then you get to play on around 130 pinball machines (and a couple of other machines too) for an unlimited time.It's not really a museum, but on every machine you can see the manufacturing year and place of the machine.It's fun even if you didn't play Pinball as a child! We were there for almost 2 hours (21 years old)."
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "Pinball pilgrims' mecca. ~130 machines to play. Most of them pinball machines grouped by the era of their origin (or flippers as they're called here). Really family friendly but please respect the machines not to let kids break or misuse any of the especially older machines by having an eye to your children's gaming. Some of them might break easily.It is important to keep pinball enthusiasm alive by introducing these wonderful pieces of art to your offsprings as well. Flippermuzeum is definately their part by having a Super Mario Bros pinball available for the smaller guests and light portable \"toilet podiums\" made of plastic available for the kids to enable them to reach and see the game fields. They also have a nice cozy little soda bar there.Don't forget to support the muzeum by investing 2500 HUF to the coolest short sleeve tee or 4000 to a long sleeve version. In addition to a greatest souvenir you'll get a free refridgerator magnet if you have been playing nicely and showing respect to the machines ;) ask for a flyer two to be left to your accommodation to tell about this wonderful place to the other travellers as well.Definately worth a visit even if you are not an enthusiast like me and my 4 year old son. Please book one hour more than you originally planned for, at least two hours in total as the time flies in a place like this!"
        }, 
        {
            "index": 112, 
            "rating": "4", 
            "review": "You'll have great fun but don't expect a museum!. All in all a great experience: after paying 2500 HUF (about 8 EUR) you have unlimited gameplay on machines (not only but mostly pinball) from 1930s until present. I played more on machines than ever before in my life and liked it a lot.There are over 60 machines.Some machines were broken and we expected more history/stories/extra informaiton as the place's called a museum.Have fun, enjoy the games, expect to spend quite a few hours!Opening hours:M-Tu: CLOSEDW-Fr.: 4 pm - midnightSa: 2 pm - midnightSun.: 10 am - 10 pmYou can find great restaurants nearby on Pozsonyi utca/street."
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "Amazing!!. What a great place! You pay an entrance fee (about £7.50) and you get unlimited time and plays on hundreds of pinball and vintage arcade machines! Some really great pinball machines just fab! Would recommend this place so much."
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "Great selection of machines. What a day! We loved playing all of the machines. It was great that you paid a fixed price to get in and then you could play as much as you like from then on."
        }, 
        {
            "index": 115, 
            "rating": "5", 
            "review": "Nice and nostalgia. Near the westend mall. The children liked it very much and they paid 1\\2 the price of the entrance ticket.Some thing you must do with kids who live in the smartphone world to understand that their parents played with a big machins"
        }, 
        {
            "index": 116, 
            "rating": "4", 
            "review": "Memory Lane. Had a fun time introducing my two teen aged boys to the pinball machines of my youth. It was easy to spend several hours comparing the play of so many machines from the 1940s through 2006. Located an easy walk from the main train station and surrounding hotels, a visit to the Pinball Museum will be a fun and unique way to spent an evening. Reasonably priced for unlimited play. Some machines were not functioning but they were clearly very few."
        }, 
        {
            "index": 117, 
            "rating": "5", 
            "review": "Great Fun. If you enjoy pinball then paying €7 to play a hundred different machines, including some from the 1950's is a great way to spend a few hours."
        }, 
        {
            "index": 118, 
            "rating": "5", 
            "review": "Great last night in Budapest. My husband and I spent a few hours on our last night in Budapest and it was worth it. Only 2500 Huf per person it was very reasonable. We played so many different machines and here's more than just pinball. Great find. Only word of caution is make sure you know the metro schedule. We left before the place closed but right after the metro stop closed so had to spring for a not so chap cab ride back to our hotel. Oh well."
        }, 
        {
            "index": 119, 
            "rating": "5", 
            "review": "What a find, great way to spend an evening. We messaged on Facebook to check they were open as it was a national holiday. They got back to us in under ten minutes. Easy to find, reasonable price and a variety of machines. What more could you ask for. We spent nearly 2 hours here and will return the next time we are in Budapest. Add it to your must do when in town!"
        }, 
        {
            "index": 120, 
            "rating": "5", 
            "review": "Unlimited fun!. I loved the place. It has the underground experience of old game rooms, because it's dark and literally, underground! You will love it.Bring on a t-shirt because it will get hot! Alcohol gel may be useful to bring along, if you are a bit germophobic."
        }, 
        {
            "index": 121, 
            "rating": "5", 
            "review": "I was a kid again. This is a must! Totally worth the 2500 huf. We spent hours playing vintage pinball games and had the most fun! One was from 1939! Incredible!!"
        }, 
        {
            "index": 122, 
            "rating": "4", 
            "review": "Great fun, good option for a different kind of touristic experience. The good reviews that you probably read about this place are for real! The machines are authentic and almost all are in good working condition. We had a lot of fun playing the machines for almost two hours and even the presence and noise of many children that came for a birthday celebration there, couldn't interrupt our enjoyment..."
        }, 
        {
            "index": 123, 
            "rating": "2", 
            "review": "Probably not worth your time, unless you just want to kill some time. Nothing wrong with the Pinball Museum, it is just not really an attraction to go out of your way for. They have a wide selection of pinball machines, and you play for as long as you want. It was just ok, would not recommend nor repeat."
        }, 
        {
            "index": 124, 
            "rating": "5", 
            "review": "Hey . Was fantastic. Definitely worth visiting. Great price. Go earlier than you think as can play for hours . Check hours of operation."
        }, 
        {
            "index": 125, 
            "rating": "5", 
            "review": "Blast from the Past. You pay a small cover fee (approx $5 USD) to play unlimited pinball games ranging from machines from 1960's to 2000... Most of the machines were made in the USA but there were some European machines which were interesting to try. My 11 year old son had a great time and in no time, we were there for over 3 hours! It wasn't crowded. We went on a Thursday night at around 5pm."
        }, 
        {
            "index": 126, 
            "rating": "5", 
            "review": "Awesome. We spent a few hours here playing the machines. They ranged from current back to the 50's. This is a cool place to hang out. If you teenagers are getting tired of sightseeing, take them here."
        }, 
        {
            "index": 127, 
            "rating": "5", 
            "review": "Definitely go . We had such a good time it's a lot better than I expected it was about £6 each, you get a wrist band then you can come as go as you please. We went to Hero's square and around the park then went back to the museum after. They were really nice, you can play on 99% of the machines all for free, have a drink there and they even let me charge my phone up behind the counter. Look for our names on the globe. Craig and Kelly Nottingham"
        }, 
        {
            "index": 128, 
            "rating": "5", 
            "review": "You could spend hours in here. Once you pay your entry fee then you are free to play as many of the games inside as you wish, for as long as you like. There are pinball machines of various vintages, and it would be easy to while away hours in here without noticing. Definitely not a stuffy museum!"
        }, 
        {
            "index": 129, 
            "rating": "5", 
            "review": "A Must!. If you were born at the 80's this is the place for you, even thou all the age ranges will find this place difficult to resist, from a 70's vintage machines to more modern ones, there is dozens of pinball games which are just waiting to be played with for hours.We definitely lost track of time here and didn't want to leave at about 11 p.m., wanted to return on some other day but lack of time didn't allow us.If you're at Budapest be sure to stop by."
        }, 
        {
            "index": 130, 
            "rating": "4", 
            "review": "A unique and fun way to spend an afternoon!. We looked on Tripadvisor and this was one of the top hits and saw this is as a must do, and boy did the wife and I have fun, for around £5-6 you get to go on as many of the 150+ pinball machines for however long you want. We burnt about 2-3 hours here and we had a great laugh. Please note this isn't easily identifiable on the street but just go with the marker on the map and its accurate enough that you will eventually spot it. Have fun!"
        }, 
        {
            "index": 131, 
            "rating": "4", 
            "review": "Something different!. We were very intrigued to see what this would be like after reading reviews on trip advisor. We had a great time for over an hour playing on the different pinball machines as well as table football. It was definitely something different to do, although a bit further out from the centre."
        }, 
        {
            "index": 132, 
            "rating": "5", 
            "review": "Enormous Fun!. At the end of me and my friends trip we decided to pop into this museum. For a low price you can play on a staggering amount of pinball machines. We had so much fun there and ended up staying for an hour or two longer than we had expected. It's really worth a visit."
        }, 
        {
            "index": 133, 
            "rating": "5", 
            "review": "LOVE IT!!!. Could not wait to visit and exceeded our expectations. So many machines, we were in our element! You will easily spend 2 hours here. So much fun!!"
        }, 
        {
            "index": 134, 
            "rating": "5", 
            "review": "Many hours could be spent here. This place is so much fun. You pay a small fee to go in and play pinball as long as you want on the dozens of machines dating back to the beginning of pinball. We spent 3.5 hours playing here and only left because our feet were starting to get tired of standing and we needed to go find dinner."
        }, 
        {
            "index": 135, 
            "rating": "5", 
            "review": "Great if you have subtle wrists.. Hidden away in a basement. You pay an entrance fee then you can play on all the machines. Excellent way to spend a couple of hours."
        }, 
        {
            "index": 136, 
            "rating": "5", 
            "review": "i asked a local..... Hardly a review...but i asked a young Hungarian which one thing he would do in Budapest that would be a bit different...he smiled and then suggested the Budapest Pinball Museum...so there you go!"
        }, 
        {
            "index": 137, 
            "rating": "5", 
            "review": "Best night time spent in pinball games!. This is the best place in the evening and day to play pinball machines into the late night hours. On weekdays, they're open everyday until midnight. Wide selection of machines from the 1970s through the 1990s in different rooms. Pinball machines are easy to understand to know how to play. The staff is available to help if any of the balls are stuck or if the machine needs to be reset; they're friendly folks who want to help. I was only there for an hour on Saturday night and enjoyed all the pinball games. I've played on the pacman machine, the mario bros machine, the star wars machine, the batman machine, the circus machine, and so many more. Several rooms are open containing themed pinball machines. There are also foosball and toy shooting games in the rooms. You can stay for an hour or even several hours, you'll have a lot of fun here. This place is my new favorite night time games place in all Budapest; it's a must-see place if you're visiting briefly in the city or living here."
        }, 
        {
            "index": 138, 
            "rating": "5", 
            "review": "Two hours went by like 15 minutes!. this place is a \"must visit\" for anyone who is visiting Budapest ! you enter through a small door to a pretty big space with pinball machines of all sorts and kinds. there are machines from the 1950's and up until 2008. we had so much fun, definitely one of the best places we got to see in Budapest!"
        }, 
        {
            "index": 139, 
            "rating": "5", 
            "review": "Great Fun. Great place. Make sure you have a few hours to spare as time goes fast!. So many different machines to play. Make sure you check the opening times as not open on some days"
        }, 
        {
            "index": 140, 
            "rating": "4", 
            "review": "Rainy day fun. If you're under 26, you can get a discounted entry price. You'll be given a wrist band to wear. There's a small cafe inside, a toilet (with a plastic door) and free WiFi. They open after 4pm.Near the entrance there's an original grabbing crane machine that you can use twice per person to try and grab some sweets.After that, walk around the basement where you'll find 100+ pinball machines of all ages and brands. They also have a few arcade machines too (shooting games, football, bowling) All machines are free to play for as long as you want.Although the service was friendly and the experience was fun, a few of the machines were broken (due to overuse I guess) and the toilet wasn't very private. There wasn't much order to the machines either, it would have been cool to see them in order for oldest to newest."
        }, 
        {
            "index": 141, 
            "rating": "5", 
            "review": "Best night ever! . We had so much fun here, two hours were too few. It costs almost nothing and you can play all you want at all these different pinball machines - there are A LOT of them. There is also a small \"café\" where you can buy sweets and drinks - you'll need drinks. I was so into playing that I got super hot. I also broke two fingernails - totally worth it though!"
        }, 
        {
            "index": 142, 
            "rating": "5", 
            "review": "Great fun place to visit. This was one of the highlights of our trip for me. You pay a fee to get in, and then get to play on all the pinball machines. They have a lot of machines so plan to spend a few hours here. Possibly not everyone's cup of tea, but I thought it was lots of fun, and not something you would get to do anywhere else. As well as pinball machines they had an original space invaders machine and a pac man machine, proper blast from the past."
        }, 
        {
            "index": 143, 
            "rating": "5", 
            "review": "Biggest surprise of our trip. Never expected this \"museum\" to be what it is.. A massive fully playable pinball arcade. Great fun for a few hours!"
        }, 
        {
            "index": 144, 
            "rating": "5", 
            "review": "An adventure of nostalgia and fun. Didn't really expect to enjoy this as much as I did. My partner begged me to go and we had a great time playing all the little games. Wasn't too busy either so we were free to play whatever we wanted. Would recommend just because it's a little different."
        }, 
        {
            "index": 145, 
            "rating": "5", 
            "review": "Amazing - go!. If you remember spending hours of your time (and money) at the arcade when you were younger then prepare to be taken back in time. This place was fab! There are over 100 games to play (mostly pinball) all included in the entrance fee.My husband and I spent a little over an hour here just playing all the games and reliving our youth. We went on a Sunday unsure of whether it would be open, but were delighted to find that it was. It's about a 5 minute walk from the metro station and has a small bar for refreshments. One of the highlights of our trip!!!"
        }, 
        {
            "index": 146, 
            "rating": "5", 
            "review": "Fun museum. Had a great time visiting this museum. It is a little loud in there, but that's to be expected. Make sure that you check the hours before you go. It is in a not so touristy but easily reachable area. I got to play my favorite pinball game (Addams Family) many times which made me really happy!!"
        }, 
        {
            "index": 147, 
            "rating": "5", 
            "review": "what a delight. I saw the pinball museum on trip,advisor before going to Budapest , and convinced my wife it was worth spending half an hour there. Well we ended up being there for nearly 2 hours. It was great playing all the old pinballs but the highligtht was all the old football machines. They brought back great memories and i was still as bad as i used to be ! On the pinball front, nearly every macine was working perfectly and had no problem with tilts. Its on entrance fee for everything but remember to hang your coat up as you go in...it can get a bit warm especially if you get into one of the machines. tricky to stop playing until you have beaten your personal best! We took the 15 bus which dropped us almost outside the door, then walked back a couple of blocks to catch the 4 tram to a restaurant over on the Buda side. Great place, highly recommended"
        }, 
        {
            "index": 148, 
            "rating": "5", 
            "review": "The best two hours of the whole holiday!. I visited Budapest Pinball Museum recently, and can only say that it was the highlight of my entire trip. For a small entrance fee you have access to over 130 pinball machines, all of which are in great condition, well-maintained and ready to play. There was such a variety of machines from different manufacturers, and they were displayed chronologically, with machines from as far back as the 1930s! My favourites all seemed to be from the 80s and 90s, but I tried to play a selection from each decade, as I'd never had the chance to play such vintage machines before. There is also a cafe bar there where you can get refreshments. The staff were really friendly and helpful, and you can tell that museum is a labour of love. I only wish I had more time there to play! Will definitely visit again."
        }, 
        {
            "index": 149, 
            "rating": "5", 
            "review": "While away a few hours . If you're into pinpall this is a must place to visit all the best pinball from last twenty years and more totally consuming 2500 ftn entrance fee worth every penny"
        }, 
        {
            "index": 150, 
            "rating": "4", 
            "review": "Good cheap fun activity . Worth a visit only 2500 forints (£6) for unlimited time. Lots of fun games to play. There is a little shop there to buy drinks and snacks. Worth a visit!"
        }, 
        {
            "index": 151, 
            "rating": "5", 
            "review": "Pinball paradise !. Οne of the most interesting museums that we've been in the world.You will spend the most beautiful time during your visit if you love PINBALL.Just do it !"
        }, 
        {
            "index": 152, 
            "rating": "5", 
            "review": "throw back to simplier times. enjoy a relaxing hour or many more at this collection of vintage arcade games. terrific for rainy day or when your mind is numb from learning all about hungarian history!"
        }, 
        {
            "index": 153, 
            "rating": "4", 
            "review": "Perfect for classic pin lovers. How can you not have fun in a building full of games? Many classics, some antiques but certainly enough to entertain for hours. If you're not a fan of pinball, there are a few other arcade games. Overall, a really cool experience and great for a rainy day or a Sunday evening. I would have given a fifth star if they had Medieval Madness (my all-time favorite pinball game) but, alas, they owner had sold it some time ago."
        }, 
        {
            "index": 154, 
            "rating": "5", 
            "review": "Ideal for travelling in time. You move back in time when you enter this place. Lots of pinballs from the 2nd half of XX century and some very funny and creative other games (table bowling being my favourite). You can spend hours here."
        }, 
        {
            "index": 155, 
            "rating": "4", 
            "review": "Pinball Heaven. This place is excellent, a real find and only approx £5 entry fee, all the pinball machines and old school arcade games to play, all free to play"
        }, 
        {
            "index": 156, 
            "rating": "5", 
            "review": "Lots of fun. Actually not that hard to find: once you turn the corner into the street, it's a door one step below street level with a clear sign. You then walk down into the series of cellars which are decorated brightly and when we went around 9pm on a Wednesday it was quite busy with a party in one of the back rooms. It therefore feels cosy, enjoyable and companionable, as everyone moves between the free pinball museums. We rediscovered some childhood games. There are a few alternative machines similar to table football which were cool, and a few historical games from the 1930s which were also cool. Very reasonably priced, and has a bar."
        }, 
        {
            "index": 157, 
            "rating": "3", 
            "review": "Missable unless you're a die hard fan. We came here based on TA recommendations and left slightly disappointed. At first glance it looked like we'd walked into an Aladdin's cave of gaming. We were excited to try all the machines and have some fun. What I hadn't realised however was that around 50% of the games just didn't work. Pretty disappointing really! Having said that we stayed around an 45 minutes and did have fun, it just wasn't anything amazing for us. If you're a super fan you'll love this place, but for the average tourist there are much better ways to spend your time in Budapest- save this for a rainy day!"
        }, 
        {
            "index": 158, 
            "rating": "5", 
            "review": "Amazing! . Amazing! I didn't expect to have so much fun! Made my day, heck the whole trip to Budapest! Place is run by great fellas, thank you so much! Awesome!!!Plus excellent prices, really a business from the heart."
        }, 
        {
            "index": 159, 
            "rating": "5", 
            "review": "Whacky fun. Hidden behind a black door in a back street in Budapest you'll find a strange little place that is the pinball museum. Go down some stairs and the place is a wash of lights and pings of the many machines.Once you have paid your fee to enter all of the games are free.We spend a few hours going round the different games, there is about 3 different rooms to wonder in to.If it's a rainy day and would like something different to do then try this"
        }, 
        {
            "index": 160, 
            "rating": "5", 
            "review": "flippers and old videogames, must visit :). If you love pinballs machines and flippers, also arcade retró games, this is the place for you. Pay a day ticket and enjoy more than 100 machines in the Muzeum basement. I played on 60-50 years old pinballs, still perfectly working. I also found games long forgotten. it is a real big jump back in time. Try it."
        }, 
        {
            "index": 161, 
            "rating": "5", 
            "review": "Hidden gem. They have a ton a games from ancient to new and not just pinball. Old school bowling and roller ball soccer were really fun. The guys who work there really love the games."
        }, 
        {
            "index": 162, 
            "rating": "5", 
            "review": "Great place for grownups and children. There are so many types of pinball machines, but not only them and other arcade games, the place is ideal to lose a rainy day or two. After you pay the entrance fee you can play on any machine you like. There is even a bar ready for your refreshment. Next time in Budapest I'm coming here again :)"
        }, 
        {
            "index": 163, 
            "rating": "5", 
            "review": "Different and really fun!. After looking on TripAdvisor for things to do in Budapest, this has to be a must! We spent our last evening looking around here, there are so many different sorts of machines to explore, some must be so so old but had great fun playing and looking around. There are other games other than ping ball and the staff are really engaging and friendly making the experience much more interesting. There are refreshments and other products available to buy here. MUST VISIT!"
        }, 
        {
            "index": 164, 
            "rating": "5", 
            "review": "Brilliant. Spotted this first on TripAdvisor and very glad. It was a great evenings entertainment and would highly recommend. It is undoubtedly off the beaten track but you can take the metro to one of two equidistant stops then it's about fifteen minutes walking. You can check your coats as part of the entrance fee. The noise inside is like being in Vegas with all the machines going off at different times but it's such fun. Each machine is set to free play and its history Is displayed on a board on top. They go way back to the fifties and even earlier so it is a real trip down memory lane for all ages - and all ages were represented when we were there. The tables are spaced enough to play side by side but packed into combed underground cellars making the whole network of caves glow with the warm, bright, colourful lights. It is spotlessly clean and there's a little bar area to have refreshments or just a seat. Toilets are clean too. Highly recommend for pinball fans and their families/spouses who don't even realise yet how much they will enjoy it."
        }, 
        {
            "index": 165, 
            "rating": "5", 
            "review": "Really fun place. So much fun,they have not only pinball machines but old arcade games like pacman and space invaders plus old table football machines. Great for a rainy day!"
        }, 
        {
            "index": 166, 
            "rating": "5", 
            "review": "Incredible range of machines!. My boyfriend and I had so much fun at this place, the hours just flew unknowingly. We're actually planning to return the next day. Beyond pinball machines, there are other old school arcade machines. I rank this the most engaging museum. It's also the highlight of my trip to Vienna and Budapest. I'm a converted fan.2 thumbs, 8 fingers and 10 toes up for this place! LOVE IT."
        }, 
        {
            "index": 167, 
            "rating": "5", 
            "review": "A must for those who like, or remember playing pinball machines.. If you are over 62 then admission is half price, and if of that vintage like us you probably played pinballs is your younger days. The museum has a very large selections of machines from the 1940's types through to current times. All the machines are set to free play and you can stay as long as you like playing them, there are soft drink refreshments you can buy if you have time. The owner is happy to talk about his machines, many are classics which he has renovated. The place is not to far from the Parliament building heading towards the train station but a map is needed to find it. If your into Pinball machines or just want a nostalgia trip then this is the place for a great couple of hours and its not expensive. Its a great contrast to the traditional museum visit."
        }, 
        {
            "index": 168, 
            "rating": "5", 
            "review": "Fun Evening. Fun way to spend an hour or two. After you pay the entrance fee all the Pinball machines are free to play on. There are around 40-50 machines.  A few older ones are broken, but its to be expected when they are up to 60 years old!!"
        }, 
        {
            "index": 169, 
            "rating": "5", 
            "review": "Had a great time. Very interesting and fun museum. Helpful staff and entrance price very reasonable. Would highly recommend for people of all ages."
        }, 
        {
            "index": 170, 
            "rating": "5", 
            "review": "A highlight of our trip!. I found out about the pinball museum on Trip Advisor, and having dragged our kids all over the place looking at churches and museums, we knew they deserved a stop at fun, kid-friendly place. The place is a little hard to find, especially in the dark, but since we had the address, and I knew what I was looking for, it wasn't too bad. They had a blast! Our boys are 8 and 6, and even my 66 year old mother had a great time. They have machines that date way back to the 1930's, and once my mom found one from her birth year (1949), she was hooked. The boys easily spent a good 2 hours playing and I had to drag them out of the place. We are going back to Budapest at the end of this month and this is definitely on our list of places to revisit!"
        }, 
        {
            "index": 171, 
            "rating": "5", 
            "review": "Incredible breadth of machines from every decade. What a great way to spend a few hours lost in machines from years gone by. I thought I'd played or seen them all, but found a few new ones, and my wife found a new favorite. The best part is no need to lug around a bunch of coins...one price gets you a full day's worth of play time. Definitely near the top of my list when I return."
        }, 
        {
            "index": 172, 
            "rating": "5", 
            "review": "All what is Pinball :). The best place in Europe for the Pinball Fan! Very friendly staff and well maintained machines, the widest selection I have ever seen! Affordable price and flexible opening hours. Highly recommended!"
        }, 
        {
            "index": 173, 
            "rating": "5", 
            "review": "Unique retro-experience.. As someone who grew up playing pinball machines this was a great museum to visit. I went at around 9pm one night and it was crowded but it wasn't a problem. There are so many machines available that there was never a wait to play. I highly recommend a visit for those who enjoy a good game of pinball!"
        }, 
        {
            "index": 174, 
            "rating": "5", 
            "review": "Great fun. Loved this place, hundred free pinball machines once you've paid to get in of course, fun and great guys who run it."
        }, 
        {
            "index": 175, 
            "rating": "5", 
            "review": "Great fun!. This museum is so much fun. Entrance is cheap (about £6 per person) and all machines are free to play for as long as you like. My partner and I lost several hours in here just having fun and being kids. Would highly recommend visiting if you get the chance."
        }, 
        {
            "index": 176, 
            "rating": "4", 
            "review": "Most interactive museum of Budapest. I was here with my friends and it was an awesome occasion for meeting them and see many kind of pinball gaes from 20s to today."
        }, 
        {
            "index": 177, 
            "rating": "5", 
            "review": "Absolutely wicked for kids and grown ups alike! . We chose to walk here from the chain bridge so it was lengthy but well worth the walk! What a great way to kill a couple of hours and given that there's nothing else in Europe to compare, it's really something. For around a fiver a head you can play on the machines for free and for as long as you like! Such great fun, I don't think anyone realises how much they enjoy a pinball machine until you start playing them.My husband was like a kid in a sweet shop!Your coats get taken at the door and you get given a ticket which is great because the last thing you want to do is lug a coat around. There's a small bar serving soft drinks and snacks but it's not huge, though it's also not the reason people go here.Enjoy!"
        }, 
        {
            "index": 178, 
            "rating": "5", 
            "review": "Sooooooo much fun. My partner had read about this on Trip Advisor and had decided it was something we needed to do while in Budapest and YES!!! sooooo much fun. Could be a little tricky to find, and some locals we spoke to hadn't even heard of it, have to say again, it was awesome fun, we ended up spending nearly 3 hours there, our wristband allowed us entry all night (we had had enough, 3 hours later), the guy on the desk was so helpful as we were unsure as to how to get back to our accomodation, he pointed us in the right direction. Do yourself a favour, go do it, relive your childhood.... sooo much fun!!!"
        }, 
        {
            "index": 179, 
            "rating": "5", 
            "review": "All positive. Currently the most unique indoor experience in Budapest. Recommended for anyone ever played with (and liked) pinball - so everyone above 30 i think - and of course for all children when they can reach the table. Place is said to be crowded sometimes but i don't think you can't find a functioning machine from the variety of 100+"
        }, 
        {
            "index": 180, 
            "rating": "4", 
            "review": "A lot of fun!. I went to the museum by myself, and I had a really good time. I just began at one end and went over almost all of the machines! Some did not work, but they were old, and probably put up for exhibition. The museum even had very new machines, and it was fun to be able to roam freely and try everything without thinking about coins or tokens. If you are under 26, you save a lot on the ticket!"
        }, 
        {
            "index": 181, 
            "rating": "5", 
            "review": "The coolest place!. If you have free time in Budapest don't miss! A fun, cool place to stay away from the cold. We spent almost two hours playing all the machines. Be ready to go back to being a kid.\nאחד המקומות המגניבים שהייתי בעיר! אם נשאר זמן, אל תפספסו! פשוט מדליק לשחק בכל המכונות מהילדות!"
        }, 
        {
            "index": 182, 
            "rating": "5", 
            "review": "Hours of fun. Looked at this as an option if it was raining, however, despite the nice weather we still went along with intentions of staying for an hour. Due to the choice of games and pinball machines we ended up staying for a few hours longer than planned. Great fun and very reasonably priced."
        }, 
        {
            "index": 183, 
            "rating": "4", 
            "review": "Good value but only for people who like pinball. There were sooo many pinball machines and all of them are free to play once you have paid the entry fee. However, there isn't a lot else to do there and some of the machines had seen better days"
        }, 
        {
            "index": 184, 
            "rating": "4", 
            "review": "More arcade heaven less museum. The 'museum' features various but mostly (99%) pinball games ranging from 1925 to the 2000s. There are also a few older pinball like games piled up in one corner but I couldn't figure out when were they made.Playing the machines is just pure fun - we've spent about 3 hours there. What I expected and did not see was the museum itself - ie. a chronological setup where I, the regular guy from the street, would get an explanation on how the machines evolved. I expected to see some explanations for the major milestones in the games development just like last year's Games exhibition in Edinburgh.Without such an explanation all you will get for your money is unlimited gaming all day - again, this is also a good offer for any geek!"
        }, 
        {
            "index": 185, 
            "rating": "5", 
            "review": "Superb Fun. It was great visiting the Pinball Museum. It took me back to my student days. It is priced just right. With your ticket/ band you can get in all day (come out for a bit and go back in no problem). It has a small cafe with a great selection of soft drinks. I stopped for a drink and was sitting when the man on the cafe put some popcorn in the microwave. When it was ready he just came over and gave me it. A lovely touch from the great people who run this Museum. It was a Sunday and it was very busy but there are plenty of machines to play so that added to the atmosphere. The toilets are clean and easy to find."
        }, 
        {
            "index": 186, 
            "rating": "5", 
            "review": "Wonderful!. We were recommended to visit by a friend - my husband had to convince me to go and so glad we did! So many games, all free once you've paid entry. Lovely little bar serving soft drinks and snacks. Well kept, great fun! Open til late!"
        }, 
        {
            "index": 187, 
            "rating": "5", 
            "review": "So much fun!!. For someone into retro gaming, this is heaven. Loads of pinball machines and games from late 1950's to early 2000's. Loads of fun"
        }, 
        {
            "index": 188, 
            "rating": "5", 
            "review": "Pinball Paradise. Amazing selection of pinball tables going back decades, we spent a couple of hours in here on 30th Dec and could have spent longer. It was very busy when we went but due to the amount of tables we had no trouble getting on one. You pay approx £6, you get a wrist band and a ticket for your coat which they will hang up for you, once you have your wrist band you can stay as long as you wish or leave and return as many times as you want in that day. You can also buy snacks and drinks in there. Well worth a visit."
        }, 
        {
            "index": 189, 
            "rating": "5", 
            "review": "Brilliant place to visit. Recommend this place to everyone - great nostalgic experience for all ages. Places like this museum are rare and worth seeking out and finding."
        }, 
        {
            "index": 190, 
            "rating": "5", 
            "review": "Wow!!. Simply the best!!!!!Great time, even if we are a adult couple, we love pinball, so this museums era the best, clean, very good condition and cheep"
        }, 
        {
            "index": 191, 
            "rating": "4", 
            "review": "Great fun for all ages . A great trip into pinball nostalgia. Entertaining for people of all ages. A great atmosphere and interesting to see how the machines have changed over time.\nWould be even better if it served alcohol"
        }, 
        {
            "index": 192, 
            "rating": "5", 
            "review": "can't believe this place exists!. unbelievable! you pay $9 and you can play pinball whole night on several hundreds of pinball! time flies FAAAAAST here! I just did not want to go home! ever :) must must must see"
        }, 
        {
            "index": 193, 
            "rating": "4", 
            "review": "Pinball Wizardry. We were unsure if our tech-head kids would enjoy this experience as they have never played pinball before. Anyway,within minutes of entering we had no bed to worry. They loved it. So did we. My son even bought a mento t- shirt. It was great. Loads of machines (some in need of repair)but around 150 working and another 30 odd old games, like Space Invaders. Staff are friendly too. I would recommend a visit. So would my kids."
        }, 
        {
            "index": 194, 
            "rating": "4", 
            "review": "A great place if you have kids - or not!. This was the perfect spot to take a break on a cold winter's day walk in Budapest. For an entry fee of 2,500 HUF you can play a wide variety of well maintained pinball machines, and a few other video games. The atmosphere is cozy and warm, and there is a refreshments bar as well. The cashier attendant was gracious and you can store your coat safely behind the counter if you wish. The only reason I did not give this an \"Excellent\" rating is that the back room is a bit crowded and tight, and it would be even better with a few additional vintage video games."
        }, 
        {
            "index": 195, 
            "rating": "5", 
            "review": "Excellent! . The Budapest Pinball Museum was a real treat. They have machines from 1930s to present and almost all of them are playable. Every machine is set to Free Play mode allowing you to try out all of them. It was quite inexpensive and the ticket is good all day, you can come and go as you please."
        }, 
        {
            "index": 196, 
            "rating": "5", 
            "review": "Funny place !. This place is amazing ! There are most of flippers inside the place and just you pay 2500 forint for unlimited play.. When we enter the place we couldnt go out.. We spent 4 hours there and its not enough ! This is the most exciting place in town.."
        }, 
        {
            "index": 197, 
            "rating": "4", 
            "review": "Great Fun!. Really enjoyed the Museum. The staff were really friendly. I'd recommend this for anyone to try. My girlfriend was hesitant at first but ended up enjoying it more than I did!"
        }, 
        {
            "index": 198, 
            "rating": "5", 
            "review": "Life before X-Box. I was in nerd heaven. I grew up finding deposit bottles to return to the shop in order to feed the one and only pinball machine in town, often walking several miles with a frend, carrying a crate of bottles to feed our habit. We did get very good at playing pinball, and attempted the world record for non stop playing in the school holidays one year. To me this place was a serious gem and there were lots of familar machines that had emptied my change pockets over the years. There were some very interesting games from the fifties and sixties that are in great condition and really help tell the story of pinball. I spent about five hours there and only left because my wrists were aching. Some of the machines are serious museum pieces and it's a real wake up to be reminded of how old most of the games are. If you've ever played the silver ball you have to drop in here. Fantastic value for money and all sorts of games to enjoy."
        }, 
        {
            "index": 199, 
            "rating": "5", 
            "review": "Don't hesitate. Don't hesitate to go inside! It's so much fun. Me and my girlfriend sent ger and had a really good time. Lot's of fun games besides the pinball machines."
        }, 
        {
            "index": 200, 
            "rating": "5", 
            "review": "Awesome if you're into pinball!. All pinball machines are set to 'free play' and thus your hour long planned visit easily becomes 2 or 3 hours! Experience first hand the history of the flipper game. Some really great and imaginary pinball games. It does get a bit busy and noisy but that's almost part of the experience. Entry is 2500Huf - we didn't get a refund as we stayed so long but worth every penny, especially on a rainy day! Games for the whole family to enjoy. Even a few shooting games and an original Space Invaders and Pac Man! Brilliant fun!"
        }, 
        {
            "index": 201, 
            "rating": "5", 
            "review": "unique. Not much to say other than i'd definitely recommended this place!\nspent about an hour here with my boyfriend, but could have definitely stayed for hours, so many amazing machines to play with, also has a little cafe area.\nGood for any age!\nIf you're planning a trip to Budapest 100% check it out."
        }, 
        {
            "index": 202, 
            "rating": "5", 
            "review": "Great Fun. Large collection of old and new pinball and amusement machines. All free to play once you have paid the small admission fee (2500 huf). Great fun."
        }, 
        {
            "index": 203, 
            "rating": "5", 
            "review": "Fantastic place real walk back into the old school arcades. Where do I start, this place is awesome and I hope will start to work up the tripadvisor rankings. They have I guess around 2-300 pinball machine and also a bunch of old video games.Having grown up in the 80's and 90's myself this was a real blast from the past (almost any old pinball you can think of is represented here, guns n roses, kiss, new and old Simpsons, Indiana jones etc.) they also have a lot of really old ones from the 20's 30's 40's and onwards. It's kind neat to think your playing on a machine that is still working that your grandfather or great grandfather might have played when they were kids.For the kids they even have small step chairs so they can also see and play. For my 4 year old he absolutely loved it, although it might have been the first pinball machines he ever played on.The format is great you pay an entry fee and then have unlimited access to the games for that day. All of the games are in free play mode. The whole place is an old basement with brick walls etc, but real good fun. They had a snack bar but to be honest we didn't try it.They open at 16:00 on mon-Friday and stay open until late. Weekends seems like they have additional hours. Would be nice if they were open during the day mon-fri but I guess the turnout might be lower then.Either way will definitely come back next I am in Budapest!!"
        }, 
        {
            "index": 204, 
            "rating": "5", 
            "review": "You will need to plan this visit carefully!. This place WILL pull you in and absorb you. The nostalgia here is incredible. It's my favorite kind of museum: a museum where touching is allowed. I could have lost a whole day here, but I was hungry and my pop-in visit became an hour-long flipper and plunger play session. Beware!"
        }, 
        {
            "index": 205, 
            "rating": "5", 
            "review": "Great retro entertainment! . Very nice place to spend few hours playing pinball and video games. Some of the games are very old but still in good condition and you can play them (almost) all. Highly recommended cave to visit!"
        }, 
        {
            "index": 206, 
            "rating": "5", 
            "review": "retro flashback. A must see attraction for everybody but for those who know what is classic gaming is a true paradise. This is not only a pinball arcade. They also have video games like space invaders, mortal kombat and much more...It is recommended to arrive earlier because they charge you for a daily entry but you may leave and come back anytime.It really worth it!!"
        }, 
        {
            "index": 207, 
            "rating": "5", 
            "review": "super (even with kids). My son really enjoyed this interactiv \"museum\", amazing old pinball machines. The museum not even for eyes, but the hands also!"
        }, 
        {
            "index": 208, 
            "rating": "5", 
            "review": "Trip down memory lane. If, as a child, you spent a lot of small change playing pinball, this certainly is a must visit. For a small price (2500hut) you can play games from the 1940's-1980's to you hearts content. The collection amassed here is truly amazing. We had to tear ourselves away, totally engrossing."
        }, 
        {
            "index": 209, 
            "rating": "5", 
            "review": "FunFunFun. Meet one of europe bigget pinballhalls and some of the oldest machiene which still work like on their firsst day!they also host international tournaments"
        }, 
        {
            "index": 210, 
            "rating": "5", 
            "review": "I hate this place, my girlfriend kept beating me and now she's being mean. You pay hardly any thing to go in and then you're left with about 120 pinball machines to play on and they're all set to free play. It's a really good place to go and kill some hours (we were there for about 4). Like I said there's about 120 machines which cover all genres and ages of pinball machine so if you like pinball you'll be catered for, if not then you probably wouldn't be reading a review about a pinball museum."
        }, 
        {
            "index": 211, 
            "rating": "5", 
            "review": "This is gave me fun. This place is one of that place what i recommend for everyone who ever played with pinball. You will never forget this place :)"
        }, 
        {
            "index": 212, 
            "rating": "5", 
            "review": "The place to visit. If you only have time to visit a few places in Budapest, this must be one of them. Remember to bring some earplugs, the sound of all the pinballmachines can bring some headache."
        }, 
        {
            "index": 213, 
            "rating": "4", 
            "review": "Great fun. We visited here on a Sunday evening and the guy working kindly gave us a discount as they were only open for another 2 hours- this was plenty of time for my husband and I. The machines are great but it does get a little hot down there."
        }, 
        {
            "index": 214, 
            "rating": "5", 
            "review": "Interesting place. Fairly easy to find (me and one of my friends walked there from the parliament, wasn't too far). The museum was great fun either by yourself with others, plenty to do and can easily spend a night here instead of being on a bar or pub crawl."
        }, 
        {
            "index": 215, 
            "rating": "5", 
            "review": "Unique and great fun. If you enjoy pinball, and if you don't then you will, you absoutely must go. The range of machines is mind blowing and they are all well maintained. They have everything from pure analogue machines to more recent stuff like Addams family. Just go. Such good fun."
        }, 
        {
            "index": 216, 
            "rating": "3", 
            "review": "Interesting place, good fun. We enjoyed spending an hour or two at this place. Would recommend on a rainy day :) quite a wide range of machines for everyone to have good fun. All machines can be tried with entrance fee."
        }, 
        {
            "index": 217, 
            "rating": "5", 
            "review": "Cool place to check out and kill a few hours. Visited this place cause I had a couple of hours to kill...well worth it. Time flew playing a few old favourites like South Park and Simpsons.\nWorth while checking out if you have the time."
        }, 
        {
            "index": 218, 
            "rating": "5", 
            "review": "Absolute Blast!. I loved this place! Unlimited pinball games for a reasonable entrance fee. There were so many interesting machines with every theme you could think of. It was also neat to see the machines in a subterranean space with exposed brick arches. The whole place was perfect and just so cool. I had a blast playing for what seemed like hours. The staff was incredibly nice and friendly too! This was truly a unique experience and I urge everyone to check it out. You will not be disappointed."
        }, 
        {
            "index": 219, 
            "rating": "5", 
            "review": "Good fun. So cheap for unlimited play. So many machines and so interesting reading all the statistics about the machines. Easy to find and great for a rainy day :) ☁️☁️☁️☁️☁️☁️☁️☁️☁️☁️☁️☁️☁️"
        }, 
        {
            "index": 220, 
            "rating": "3", 
            "review": "For pinball and arcade video game fans.. This arcade has so many pinball games and video games. The admission price is cheap by US standards. If you have time in Budapest it would be worth stopping by for a few hours."
        }, 
        {
            "index": 221, 
            "rating": "5", 
            "review": "Coolest ever. This was a awesome place even though I am not a pinball expert. The entrance fee is very low since you can play as much you want."
        }, 
        {
            "index": 222, 
            "rating": "5", 
            "review": "Crazy Fun Night. For one price you can spend the entire night playing. It costs between 9 & 10 US dollars/person. There are literally more pinball machines then you can play in one night. All of the classic ones are there. This was just a ton of fun. We took public transport to get there and it was quite easy. We took the yellow tram that travels along the Danube to the end of the line and then just walked about 6 blocks to get there."
        }, 
        {
            "index": 223, 
            "rating": "5", 
            "review": "Pin Ball Wizards Unite, this rocks. What a great place, so many varieties of pin ball magic. It is fantastic...highly recommend. :) One fee at the door and you play all night. Only downside is if it is a super hot day or night, it is quite muggy inside too."
        }, 
        {
            "index": 224, 
            "rating": "5", 
            "review": "Great way to spend a couple of hours. This museum is great fun and a perfect way to spend a couple of hours (especially if it's raining)We spent two hours playing on the various 1 and 2 player machines without even glancing at our watches."
        }, 
        {
            "index": 225, 
            "rating": "4", 
            "review": "COMPELLING. Tucked in a back street on the Pest side of the city and quite easily missed as the entrance is a door to a basement. There must be at least 100 plus working pinball machines of all vintages. Time flew. Certainly worth a visit. Be advised it doesn't open until 4.00pm in the afternoon."
        }, 
        {
            "index": 226, 
            "rating": "5", 
            "review": "Great fun for all ages. Visiting this museum was great fun for me and my partner. It is not actually a museum, as you not only look at the veteran machines, but you get to play with every single one of them. Allow a few hours for the visit."
        }, 
        {
            "index": 227, 
            "rating": "5", 
            "review": "most amazing place!!!. the place full with hundreds of games and not only pinball. this is a perfect game room and not a museum! must go for two hours at least..."
        }, 
        {
            "index": 228, 
            "rating": "5", 
            "review": "Superb attraction for a few hours . We had a great time at this so-called museum. They have over a hundred pinball machines from the 1940s till today, almost all of them still working and all are free to play. What makes this a \"museum\" are the details provided near each machine - when was it made, how many of this model were manufactured etc. The history is interesting (especially for the real old machines), the owners are very friendly, and being able to play endlessly was great fun!!"
        }, 
        {
            "index": 229, 
            "rating": "5", 
            "review": "Quirky brilliance . I'm so so glad this place didn't have to close down. The government in Hungary is keen on getting rid of odd little places like this, but it's stayed strong and is attracting tourists from all over. It's literally a museum about the pinball machine, so if you're not into this retro game this attraction probably isn't for you. Note, it's in the 13th district (behind Westend shopping centre) so take a look around whilst you're there. It's still a fairly traditional area with lots of local shops and restaurants. The streets are tree lined and the whizz of the trolley buses is very nostalgic. This museum is an asset to Budapest and a really wonderful thing to still have."
        }, 
        {
            "index": 230, 
            "rating": "5", 
            "review": "Pinball Galore! Who could ask for more??. Excellent pinball hall with loads of machines!!! This place has a sizable number of some of the oldest playable machines I've ever seen; and I've been to many arcades over the years. The place is great for the entire family. I had a blast!"
        }, 
        {
            "index": 231, 
            "rating": "3", 
            "review": "Very much wanted to visit but closed Mon & Tuesday. Just learned about this as I was reviewing Trip Advisor when we arrived in Budapest (on a Sunday). Sounds wonderful. But unfortunately, like many museums and attractions in Budapest, this one is closed on Monday and Tuesday. We're leaving after 2 days here and I won't be able to visit.\nVery sorry about that as it sounds wonderful."
        }, 
        {
            "index": 232, 
            "rating": "5", 
            "review": "Museum where you can play with the exhibits!. It is basically a big arcade filled with pinball machines from the 1930's up to the present. You pay at the door (reasonable price) and play on what you want for how ever long you want. All the machines are on 'free play'."
        }, 
        {
            "index": 233, 
            "rating": "5", 
            "review": "A special museum. I was a little scared when my friend told me, that our Friday night spend a museum, but I nodded and did not regret it! It was the best museum, I 've ever been! There are lot of games and you can also play with them! The staff is very professional and helpful, the old pieces can give the museum experience. I can recommend to anyone, who likes to play! (sorry for my mistakes, I don't speak in english very well)Egy kicsit féltem mikor a párom azt találta ki, hogy a péntek esténket töltsük egy múzeumban, de rábólintottam és nem bántam meg! Ilyen tuti múzeumban, még nem voltam! Rengeteg a kiállított gép és mindet ki lehet próbálni! A személyzet nagyon profi és segítőkész, a régi darabok pedig megadják a múzeumi élményt is. Csak ajánlani tudom mindenkinek, aki kicsit is szeret játszani!"
        }, 
        {
            "index": 234, 
            "rating": "5", 
            "review": "Super fun!!. I have no idea how long we spent in the pinball museum...at least 3 hours bit maybe more. It was brilliant! One of the highlights of our trip. When I first read about it, I hadn't realised you could play all the machine so almost didn't go. So glad we ended up there! It's open from the afternoon until late so a great way to spend an evening!"
        }, 
        {
            "index": 235, 
            "rating": "4", 
            "review": "Surprisingly a great deal of fun!. I was a little skeptical about visiting the pinball museum, I have never really been interested in arcade games. I went along with a friend out of interest and was surprised at how much fun it was! we spent a good couple of hours trying the different pinball machines (which are all free, you just pay an entry fee) and you get a little bit of history about each pinball machine. It was a good laugh and pretty good fun."
        }, 
        {
            "index": 236, 
            "rating": "5", 
            "review": "The most amazing museum!. I went on a free walking tour and this place was highly recommended by our tour guide who is a Budapest local. I did not know what to expect at all at a pinball museum, but what a surprise! Once you walk down into the museum, you're greeted by a man at the counter who is very nice and speaks English. Pay your 2500 florents and you won't regret a thing! All of the games and modified so you can have unlimited turns on them. Honestly, this is one of those places the whole family could go to. There are games as old as 1925 all the way to modern day family guy so there's something for everybody. Once you're on a roll with a game, it's so easy to lose track of time! I spent three and a half hours there and thoroughly enjoyed every minute of it. I'm so happy this gem of a place was recommended. It is one of the most fun nights I've had in all my traveling."
        }, 
        {
            "index": 237, 
            "rating": "5", 
            "review": "wow relive your youth. The first thing to say, IT DONT OPEN TILL 16.00.WHEN YOU DO GET INSIDE THIS PLACE IS MASSIVE.And great fun. Once you pay your fee every thing is free!We loved this place and would go back again.The guy who owns it is so friendly and honest its a pleasure to chat to him.I promised him I would write this revue, 11/10 give it a go its a right laught"
        }, 
        {
            "index": 238, 
            "rating": "5", 
            "review": "My youth. When I looked on Trip Advisor and found this place, I had to go there. I am 60 years old and my youth was one giant pinball game. We didn't have IPADS and smart phones. The only drawback was that I arrived at 3pm and didn't realize it didn't open till 4pm. It is a hole in the wall and the ONLY reason to gothere is to play pinball. I tried 6-7 games and finally found one that was really old that was simple to understand how to rack up points and I played it for over an hour. Simple fun."
        }, 
        {
            "index": 239, 
            "rating": "5", 
            "review": "Fun place!. This was great! About £7/8 to get in and there are loads of pinball/arcade machines that you can play on for as long as you like. Some great 2 player games as well so you can play against each other. Really recommend as something a little different and fun to the other more cultural sights of Budapest!"
        }, 
        {
            "index": 240, 
            "rating": "4", 
            "review": "Brilliant fun. Soo much fun... loved playing on the pinball machines. I wasn't sure what to expect as it said it was a museum but you can be hands on and have fun with all of the machines. Only down side was that they didnt have a bar. We went in the evening and felt that a bar would've made this an ideal place to start the evening and probably would have stayed for longer, that being said we easily lost a couple of hours here"
        }, 
        {
            "index": 241, 
            "rating": "5", 
            "review": "Re live your Miss spent youth..... Very glad we visited this attraction which my husband found while searching trip advisor for things to see in Budapest. It is open fron 4pm until midnight most days. Entrance fee is 2500forints (£5.56 - bargain) and You have to pay in cash. On entry you are given a wrist band and this entitles you to come in and out until midnight. There are a hundred and eighty pinball machines in the museum and your entrance fee means you can play on all of them all night long. My husband and I arrived at 6pm and before we knew it the time was 22.00! We had a great time. The machines are all set to free play so you can try them all or just concentrate on a few to improve your skill. It took us both back to our youth and was a great way to spend an evening at such a cheap price."
        }, 
        {
            "index": 242, 
            "rating": "5", 
            "review": "Heaven!. This place is amazing! When I walked in I was pleasantly surprised by how many games you could play so I spend the entire evening playing different pin-ball machine and I had great fun! During my trip I visited this place 3 times however it was quite far from were I stayed. I definitely recommend this place if you want to have a great night!"
        }, 
        {
            "index": 243, 
            "rating": "5", 
            "review": "It's a \"must\" :-) - Kötelező!!!. We used to play with pinball games often at Lake Balaton when I was a child. I really enjoyed it that time, but recently it is not easy to find pinball at ordinary places... When I heard about the museum I became really curious and tried to go as soon as possible. And finally I got there! It is a really great place, lot of game in nice condition, almost all of them works. The location (near Western Train station) is good, easy to find, and you can spend a whole day there without getting bored... Thanks for the owners and pleeeease keep up the good job!Gyerekkoromban Balatonon rengeteget játszottunk flipperekkel, akkor ragadt rám az őrület. Nem is tudtam mennyire, amíg el nem mentem a múzeumba. Zseniális, jó a helyszín, rengeteg gép, és jó állapotban, szépen karbantartva. Köszönet mindenkinek, aki hozzájárult a gyűjtemény illetve múzeum létrejöttéhez, sokunknak szereztek élményteli órákat. Jó volt a nosztalgiázás."
        }, 
        {
            "index": 244, 
            "rating": "4", 
            "review": "Good fun afternoon out. We attended this with our child for the afternoon. It was a fun experience and great way to entertain a child (took us back to our childhood with all the games). If you are in Budapest with children worth a visit if you have a spare afternoon. Just check the opening times prior to attending."
        }, 
        {
            "index": 245, 
            "rating": "5", 
            "review": "If only every museum were this much fun!. This was on my list of quirky things to do in Budapest. I wouldn't normally identify myself as a Pinball Wizard, but this place really is amazing. A week later: I'm still wearing the Flippermuzeum wristband with the same braggardly self-righteousness as if I'd been up three nights slaying the mosh-pit at a mud-soaked music festival. Three hours disappeared like I'd been sitting in a pretty girl's lap. This is not entirely coincidental: there were a couple of somewhat ...risqué... machines. However, this is entirely legitimate, as it functions as a bone fide museum. The oldest pinball machine there heralds from 1939. If all museums were this fun, we'd be a highly educated species!"
        }, 
        {
            "index": 246, 
            "rating": "5", 
            "review": "What a Place !. I would have never imagined this to be a good idea but let me tell you it is a load of fun ! This place helps you understand the magic behind the era of the Pin Ball machine which made way for an incredible amount of entertainment."
        }, 
        {
            "index": 247, 
            "rating": "5", 
            "review": "Great fun, friendly staff and well worth a visit. Decided to visit after reading very positive reviews. It didn't disappoints, it was better than I expected. So many different games to try and not just pinball machines. We spent around two hours playing on the machines, making this place amazing value for money. The staff are friendly and speak good English, which really helped as my Hungarian is, sadly, non-existent. "
        }, 
        {
            "index": 248, 
            "rating": "5", 
            "review": "Excellent way to spend a Saturday night. . Have just visited this place and felt the urge to leave a review. Spent about 2/3 hours inside playing all the pinball machines and games. My girlfriend and I both aged 27 really enjoyed it. We payed around £6 to get in and it open until midnight. The staff where friendly and the place looks great with all the pinball machine lit up. Highly recommend."
        }, 
        {
            "index": 249, 
            "rating": "5", 
            "review": "Worth a visit!. Price: 2.500 HUF (Adult) / 1250 HUF (Student) - totally worth it. Lots of pinball machines, some quite exotic (ever played pinball facing each other?), all free to play. Some didn't work, but most were in quite a good condition. I used to play pinball in my childhood and indulging in those memories was amazing. My girlfriend, who had never played pinball before, was amazed as well. Staff is friendly. It got a bit crowded in the evening, so try to go there as early as possible."
        }, 
        {
            "index": 250, 
            "rating": "4", 
            "review": "Blast from the Past fun!. The pinball machine museum has a very large display of pinball machines, shooting range machines, and some video game machines, ranging from 1925 (shooting range machine) to 1980s (Mortal combat). Some of the pinball machines are very retro, and others are multi-layered mindbogglers. After paying the entrance fee to the museum, ALL machines are FREE to play!! This is a most fun \"museum\", and a real blast from the past. Well recommended!!!"
        }, 
        {
            "index": 251, 
            "rating": "5", 
            "review": "Awesome Experience a the Flipper Muzeum. I wasn't entirely sure what to expect when my boyfriend and I took the metro to this museum, but I am so glad we did. It's huge - there's probably over one hundred pinball machines and similar games that are totally free to play once you pay admission. I thought it was really cool how they had signs on the top of each pinball machine with it's description, year of manufacture, company that produced it, how many were made, etc. My boyfriend had a blast and stayed for 2 hours playing game after game. I highly recommend this museum on a day where you want to take a break from sightseeing, or maybe a rainy day. Oh, they also had cool t-shirts for sale! Overall, I loved this experience - the staff were very nice, and it was a ton of fun!"
        }, 
        {
            "index": 252, 
            "rating": "5", 
            "review": "A trip through memory lane. I love pinball so this was a no-brainer. We arrived about 90 minutes before closing so they were kind enough to discount the admission ticket without our asking. I could have stayed for just the Indiana Jones pinball but walked around and played at least 20 machines. All worked just fine and were very clean. I highly recommend this wonderful place."
        }, 
        {
            "index": 253, 
            "rating": "5", 
            "review": "Fun fun fun!!!!. We spent over two hours in here without noticing the time passing and only left to obey our growling tummies! The pinball museum 'Flipper' is fun for kids and grown ups. I spent ages trying to get past the first level of space invaders and my husband and daughter played on the mortal kombat 2 arcade game for ages. This attraction is big, from the outside it looked like a relatively small place but there are hundreds of machines in here to play on. Pinball is fun and after a while you'll find a machine you really like and before you know it you're hooked and an hour has passed! There are machines from the early 1900s here and from every decade up to now. You don't appreciate how popular pinball has been throughout modern times but it is displayed here in all its neon glory. This is a must if you have fussy kids to occupy, or fussy husbands!"
        }, 
        {
            "index": 254, 
            "rating": "4", 
            "review": "Fun for at least one hour. If you have one or two hours to spare, just visit this nice museum. It's nice to see something else, and you are able to play on all those 130 machines."
        }, 
        {
            "index": 255, 
            "rating": "5", 
            "review": "Fantastic, addictive, super fun, Hidden Gem. We spent a week in Budapest and we visited this fantastic place twice during our stay. My husband wasn't really sure about visiting this place as he said that he never really liked pinball machines... (unlike me) ......Until he walked into this place, he quickly changed his mind. The museum is filled with pinball machines, and each and one of them comes interesting facts about model/number of machines produced/year .............some are nearly as old as Queen Elizabeth.. :) Once you pay the entrance fee, which is around £5, you don't have to worry about inserting coins into the machines as games are free. If you go with your friends, I would recommend you play tournaments mode if possible, or just simply challenge your friends to see who scores the most. It's really good fun. You won't find anything else like this anywhere in Europe, so please do not miss this hidden gem."
        }, 
        {
            "index": 256, 
            "rating": "5", 
            "review": "Could be absolutely amazing, is \"just\" great.. Really enjoyed my time here but unfortunately it was cut short due to the heat (still quite warm even in an air-conditioned basement, though it was 38c outside - wish the air-con had been more powerful!) - and also because I was nagged by the other half who wasn't really \"feeling it\".If the museum had a 'nice' seating area / chill out zone / cafe with a bar (or even soft drinks and snacks) I'm sure it would be very popular - as it is, there are a couple of buffets and a nasty vending machine...I still think it's excellent though - just couldn't spend as much time as I wanted there..."
        }, 
        {
            "index": 257, 
            "rating": "4", 
            "review": "Lots of fun!. Lots of fun! We went with our seven year old and four year old boys, they loved it as did my husband! It was a bit hot inside though.."
        }, 
        {
            "index": 258, 
            "rating": "4", 
            "review": "You need see it one time in Budapest. This a great local to take few hours and enjoy more as 100 pinballs. It is a near of the Westend City shopping center. You can travel with metro and walk 10 minutes. We spend 2 afternoon with our doughter, she liked it too. I offer with kids over 10 years."
        }, 
        {
            "index": 259, 
            "rating": "5", 
            "review": "A time travel to the world of arcades. The biggest pinball collection in Europe, a must see.You can also play arcade videogames and old electromechanical games here."
        }, 
        {
            "index": 260, 
            "rating": "5", 
            "review": "Brilliant fun. Go. It's so much fun. 2500 Huf for unlimited play. there's loads to choose from 1940s to 90s including lots great ones from the 70/80s - plus an original space invaders machine. Don't go if you have to be somewhere though as time disappears quickly! "
        }, 
        {
            "index": 261, 
            "rating": "4", 
            "review": "Retro. Retro cool and fun to see and experience a good friend from the past the pinball machine. Found a copy of my favorite from my ternageyears :)"
        }, 
        {
            "index": 262, 
            "rating": "5", 
            "review": "You cannot stop. Fantastic place. Wide range of pinballs even from 80's. Be careful because if you start to play and try them one by one you will lost your sense of time."
        }, 
        {
            "index": 263, 
            "rating": "5", 
            "review": "FUN!!. What a great time! Pinball machines from the 1930's all the way up to modern day, all set for free play and ready to go! I paid a very reasonable flat fee to get in and spent several fun hours just wandering from machine to machine. There were many I'd remembered from my childhood and teen years as well as several I'd never seen before. The great thing about the flat rate was if I found myself getting bored with a particular machine I didn't feel guilty about walking away and trying a different one. Even the guy at the front desk was helpful, calling a taxi for me and making sure I knew when and where it would meet me. Like I said, Great Fun!!"
        }, 
        {
            "index": 264, 
            "rating": "5", 
            "review": "If you like pinball this is heaven . This is a great place, we spent like 4h here playing a lot of different games. If you don't like pinball, but your company does, go shopping instead. This place is impossible to do in half an hour."
        }, 
        {
            "index": 265, 
            "rating": "5", 
            "review": "One of my favourite places in Budapest. Wasn't too sure what to expect with this pinball museum but my boyfriend wanted to go so why not. It was brilliant, with a student card it worked out about £2/£3 in and all the pin ball games are unlimited usage which was great. if your looking something chill to do in the afternoon defiantly go here!"
        }, 
        {
            "index": 266, 
            "rating": "5", 
            "review": "Go go go. So much fun. Go to see the lights and hear the sounds of tactile gaming. Takes some digging to find, but worth going too. Reminds of something similar in san Francisco."
        }, 
        {
            "index": 267, 
            "rating": "5", 
            "review": "Awesome. We visited to the Pinball Museum today and spent there an amazing two hours. I haven't had such a fun time for ages. Even my girlfriend who wasn't a fan of pinball beforehand fall in love with the place. Once you pay the entry fee you get to use the machines all day. It's highly recommended!"
        }, 
        {
            "index": 268, 
            "rating": "5", 
            "review": "Vintage Fun!. We stumbled into this place one day having only heard random rumors about it and only having a vague idea of where it even was in the city. It was very much worth the trip. It is very cheap and you pay by the hour so you can play as many games as you want. They have EVERYTHING here. If it's pinball, they have it. I didn't even know I liked playing pinball that much until we came here. Worth a trip!"
        }, 
        {
            "index": 269, 
            "rating": "5", 
            "review": "Flipping Great Pinball :-). Im not particularly a pinball fan and hadn't even played one for over 10 years, but really enjoyed the visit, loved all the artwork and history that comes with the machines ranging from the modern to 1950's pinball machines. Probably enough to keep you entertained for 2 to 3 hours unless your a crazy pinball fanatic then you could stay all day from 4pm til midnight and come out with blisters on your thumbs all for a fixed price of 2500Ft."
        }, 
        {
            "index": 270, 
            "rating": "5", 
            "review": "Wow. Amazing place for free time.you cant stop playing.i definitely come back to this museum.highly recommended!!!"
        }, 
        {
            "index": 271, 
            "rating": "5", 
            "review": "Stay tuned! it is coming back in August 2015!!!. This was my third visit to this amazing museum. Stumbled across the closed door with CLOSED sign - decided to knock - i was lucky enough to meet the owner. He is a really kind person. has let me in to see - THE NEW MUSEUM IS COMING - Machines are being serviced, bulbs replaces, new games arriving, new rooms opened! STAY TUNED FOLKS - he is going to REOPEN in early AUGUST! I will be back!! :)"
        }, 
        {
            "index": 272, 
            "rating": "5", 
            "review": "Great Time-filler!. I had a couple of hours free between things and saw this place was pretty close to everything (maybe five minutes from Nyugati station tops?). Have never played pinball in my life but was interested in checking it out regardless. Had a blast of a time sucking at pinball games from all periods, seeing the kinds of improvements and gimmicks which were used over the ages, think the oldest machine I saw in there was about 1938 or so and they go right up to the last decade. There's also a fair few other arcade machines, including some videogame systems such as Space Invaders.Could easily have spent another few hours in there and for about €4 (student rate), that's a bargain!Obviously not something you plan a trip around but as a brief diversion (I'd say most people at all interested could get anything between 1-4 hours of fun out of it), it's fantastic!"
        }, 
        {
            "index": 273, 
            "rating": "5", 
            "review": "Brilliant - lets hope it stays open. The authorities are trying to close this place down. let's hope they don't suceed. There are machines from the 30's right up to date and you can play them all for the cost of an extended admission."
        }, 
        {
            "index": 274, 
            "rating": "5", 
            "review": "Best value and fun activity in Budapest. This little gem is worth finding. A set entry price of around A$10 that gives you unlimited games over a 8 hour period. Three hours just flew by. The range of pinball machines is fantastic, many quite old, and even for those people who may think they're not going to enjoy it, they will find it addictive and fun. The dark, cool room was also a pleasant respite from a 30C day. Sincerely hope the museum can stay as we heard the bureaucrats say it's a gambling establishment and want them closed down."
        }, 
        {
            "index": 275, 
            "rating": "5", 
            "review": "What a rush! Best place. Ever.. Well, your basic entrance fee lets you in to play any machine for as long as you like. Well, until they close. My daughter had to drag me out, kicking and screaming. I had, after all, just been introduced to Apollo 13, which can release 13 balls all at once. And I knew I still had 100s of games to try. This place is amazing.What I loved the most was seeing all people, of all ages, laughing out loud, giggling, and smiling. Forgetting the troubles of the day.Last, but certainly not least, is the customer service this place offers. I asked for a discount after showing my disability ID. He thought about it for a second and let me in at half price. Later, I noticed his coworker giving helpful tips to everyone.I want one of these in my basement."
        }, 
        {
            "index": 276, 
            "rating": "5", 
            "review": "Flipping Fantastic. We had a little trouble getting there but once we were inside, awesome! Paying up front for a block of time is so much better than feeding the machines! You can play any machine you want and there are more than I have ever seen outside the US. The gentleman we met at the counter was so very helpful and accommodating. He spoke good English and we enjoyed conversing with him. It was not very crowded so we could play almost any machine without delay! I did not see any machines which were not working! Some of the machines date back to the 40's. It appears to be well maintained and I consider it to be a very well kept secret in Budapest. Even the cruise ship staff had never heard of it before we had asked to arrange a taxi for us! If you like pinball, this is a must do on your trip through Budapest!"
        }, 
        {
            "index": 277, 
            "rating": "4", 
            "review": "Unique Museum. Cool spot with lots of old pinball machines and video games. Really brings you back to your childhood. For about $6 you can play anything you want as long as you want. Worth checking out if you're in the area."
        }, 
        {
            "index": 278, 
            "rating": "5", 
            "review": "Briliant. I so glad to I have heard about the museum. It was lot of fun.A few hours I went back to my teenager years. There is a big banch of old machine. Nice to see how was the beginning...Good luck guys and keep going. I wish to come back few years time"
        }, 
        {
            "index": 279, 
            "rating": "3", 
            "review": "Lots of pinball machines. There are a wide variety of pinball machines (example Star Wars, Shrek, football, car racing, Pacman, time machine, etc.)"
        }, 
        {
            "index": 280, 
            "rating": "5", 
            "review": "Best £4 I ever spent!. What a fantastic way to spend a few hours out of the sun in Budapest. This was high on my list for places to visit and so glad we made the effort to go. A brilliant collection of pinball and vintage arcade machines all with free play. Always wanted to play the Kiss and Creature from the Black Lagoon machines so one very happy lady indeed! Just be aware it's open from Wednesday onwards. It's been a while since I played so managed to rattle my way through about 40 machines in 90 mins haha. Would have spent a fortune in a normal arcade!"
        }, 
        {
            "index": 281, 
            "rating": "5", 
            "review": "Brilliant . Very unique and quirky place with pinball machines from 1931 until current,definitely worth a visit and plan at least two hours here but you're probably end up staying longer"
        }, 
        {
            "index": 282, 
            "rating": "5", 
            "review": "A very unique museum. This venue is a very unique attraction in Budapest! The museum has an intresting combination of old and modern pinball machines which are available for playing! I played over a 100 different machines ranging from 1930's to this this centry. It was great fun! It's for anybody interested of pinball machines and/or arcades, and it's suitable for all ages."
        }, 
        {
            "index": 283, 
            "rating": "5", 
            "review": "Amazing find, wish we had one in London. We spent a couple of hours here late evening, amazing value at only 2000 HUF per person (just under £5). Once you're in all of the machines are free. Lots of pinball machines and even Mortal Kombat 2, made me very nostalgic! The fact that I managed to get on the scoreboard for Super Mario Pinball, definitely enhanced my experience! A real gem!"
        }, 
        {
            "index": 284, 
            "rating": "5", 
            "review": "Stumbled across this by accident. Two hours later we were still there! Fantastic selection of pinball machines and games and a very friendly atmosphere."
        }, 
        {
            "index": 285, 
            "rating": "5", 
            "review": "Great for pinball junkies. The location is about 10 minutes walk north of the Parliament building and a bit to the north of downtown, on the Pest side. It was great. For one price, you can play any of the many, many pinball machines until closing time at midnight. A group of us went, and everyone had a blast. There's a wide variety of machines from different decades, so there's something for almost everybody."
        }, 
        {
            "index": 286, 
            "rating": "5", 
            "review": "Nice place to time travel. Nice guy at the reception, they can help if you are lost with machines. Interesting games, not only pinball. The soccer and the basketball games I enjoyed the most."
        }, 
        {
            "index": 287, 
            "rating": "5", 
            "review": "fantastic in friendly environment. fantastic in friendly environment, if it's in any way unique, this place has just about every pinball machine you could imagine"
        }, 
        {
            "index": 288, 
            "rating": "5", 
            "review": "Felt 12 years old again. What a special place to go and have fun for a few hours in the centre of Budapest. The flipper machines are fantastic. Just to hear the popping noises of the machines when you get an extra turn brought back brilliant memories. It's so cheap and you can spend a few hours there as if it was 5 mins . Loved it."
        }, 
        {
            "index": 289, 
            "rating": "5", 
            "review": "We had a ball!. We visited on a rainy day so it was a day well spent there. They offer student prices at 1000 HUF for over 2 hours which is great. We spent 3 and half hours there and it just flew by. They have Pinball machines from the 20s up to the most recent so lots to get stuck into. Really great fun its a must if your in Budapest."
        }, 
        {
            "index": 290, 
            "rating": "5", 
            "review": "Those were the days!. This cave museum is offering a wide range of old an newer pinball machines in almost mint and beatiful restorated condition.The playfields are clean and show very little wear and tear, and all but the oldest models can be played for a fixed fee. Nice to do with children on a rainy day. There is a fee for entrance and viewing only, or if you want to play a fixed fee is asked and all 130 machines are set on free play without coins.I liked it very much!!!"
        }, 
        {
            "index": 291, 
            "rating": "5", 
            "review": "Fantastic!. It's a must in Budapest, really amazing museum where I spent 6 hours playing flipper and other games!"
        }, 
        {
            "index": 292, 
            "rating": "5", 
            "review": "Idéal for pinball fans or people with kids. I had a great time there, nice range of pinballs in good to Very good conditions and privons is ok\nThe owner is friendly and place is tidy\nVery pleasant in a saturday afternoon"
        }, 
        {
            "index": 293, 
            "rating": "5", 
            "review": "Time Vacuum. Had so much fun here time seemed to disappear, so make sure you leave enough! They have well over 100 machines in perfect working order with many great classics. The Flipper Museum was an unsuspecting highlight of my trip to Budapest."
        }, 
        {
            "index": 294, 
            "rating": "5", 
            "review": "Felt like a kid again. This is unique, well as far as I know, and it took me back to my kindergarten years. Its a bit out of the way, in a residential neighborhood, but its worth your time."
        }, 
        {
            "index": 295, 
            "rating": "5", 
            "review": "Save it for the end. Why? Otherwise you want get to see any of Budapest :)\nIt sucks you in and suddenly you realize you've been inside for hours.\nNever heard of such a museum before and to get to play all of them...my wrists were sore the next day :)"
        }, 
        {
            "index": 296, 
            "rating": "5", 
            "review": "Magic land. A wonderful place, created and managed by pinball maniacs. A great number of machines from the eldest to the high-tech ones. You can spend hours here, kids are mesmerized. Only downfall, that it's a bit loud. Perfect place to spend some time with friends too."
        }, 
        {
            "index": 297, 
            "rating": "5", 
            "review": "Fun for hours. Pinball museum is great! After paying the entry fee (max HUF 2000, based on the time you spend there), you can not only see a lot of pinball machines (some of them are really unique), but also play with most of them.\nIf you go there and you love pinball, plan a few hours, because 30 minutes won't be enough..."
        }, 
        {
            "index": 298, 
            "rating": "5", 
            "review": "A lot of fun!!!. I love this place. If you are a pinball fan, this is an absolute must. The owner is a great guy who is genuine in his love for pinball and making it accessible to those lucky enough to live or visit here. While I am typically on a tight time schedule, I have stayed 2+ hours on occasion playing 20+ pinball machines (there has to be at least 60 different machines). I enjoy learning about the specific pinball machine, as most have a bit of background on a information card on top of the display (in English and Hungarian). Great place. Worth every minute. And a great value by the way.Have fun (and don't beat my score on Indiana Jones!)Jeremy"
        }, 
        {
            "index": 299, 
            "rating": "5", 
            "review": "must see!!. Cool place to visit we went on a rainy afternoon great for kids & adults. You can pay to play the machines or free just to have a look around must see!!"
        }, 
        {
            "index": 300, 
            "rating": "4", 
            "review": "Hidden Gem. If you are in Budapest and want something different to do then come to this museum. I wouldn't even say I was that into pinball machines but we were in here for a good 2 hours before I first looked at my watch. Perfect for a rainy day, but also just for something a bit different. They have pinball machines from all eras and we had a lot of fun playing on some of the older ones! The staff were lovely and were very helpful. Great value for money, and you get some back depending on how long you stay! Highly recommend for anyone looking for a bit of fun."
        }, 
        {
            "index": 301, 
            "rating": "5", 
            "review": "A real time zapper, so much fun!. We visited the Pinball Museum on the our final night in Budapest, and it was brilliant! It's a must for any fan of games and/ or amusements.I went in there expecting it to be just a few pinball machines lying around but it was so much more than that. The pinball museum comprises of a whole range of pinball machines - there must be a couple of hundred of them - from basic 1930s incarnations (with no flippers) right up to more modern day machines, and everything in between. All the classics are there such as 'Ripley's Believe it or Not' and 'Arabian Nights.' Other great tables are 'Star Wars Episode I' (mush more enjoyable than watching the film!) and the Simpsons table. Each exhibit in the museum (i.e. each pinball machine) has a little info card on it stating the year of manufacture, the manufacturer and the designer for that bit of extra info, and each is set to Free Play so you can stay and play on each machine as many times as you want.You pay an entrance fee to get in (500 HUF) and a 2000 HUF deposit, so around £6 in total. For every 15 minutes you stay there, an amount is deducted from the deposit, until the entire deposit is gone. So if you leave after an hour, you get around 1200 HUF back. Although I can't imagine many people leave in time get get any money back, it's far too addictive :-) Once you've gone past your allotted time and used up all of your deposit, you can stay in the place until it closes, and can even go out for food and come back in, as they give you a wrist band on entry.As well as the pinball machines, there are some retro arcade machines such as the original Space Invaders, and some old school amusements such as machines with BB guns to aim at targets.The museum itself is in the basement of a really cool building and has a great atmosphere. There were quite a few people in there when we were in, and the noise of pinballs, arcade machines and people having fun added to the atmosphere. 4 hours flew by, and we only dragged ourselves away because we had to get to the airport for our final hotel check in. If you go, be prepared to give up an entire day to this place!"
        }, 
        {
            "index": 302, 
            "rating": "5", 
            "review": "Definitely come here!. It is only a pinball hall, but if you like pinball with amazing rates its a great way to pass a few hours! Send your partner to the shopping centre at the end of the street if they don't want to tag along. Check their website for opening hours and rates. When back in Budapest, I will be back here!"
        }, 
        {
            "index": 303, 
            "rating": "5", 
            "review": "Awesome!. Best museum ever! Had a great time during the visit. Lots of machines in very good conditions.The staff was helpfull and nice."
        }, 
        {
            "index": 304, 
            "rating": "5", 
            "review": "Extraordinary. Wow, what a fantastic place!Play as much as you want on machines from the 50`s to date for £5! Having read other reviews was curious to see the Pinball Museum. Tucked away in a residential district in Pest, this little place is enjoyable for little ones (step provided) and adults alike. Not a great pinball fan myself, I had a great time, could not stop trying more machines."
        }, 
        {
            "index": 305, 
            "rating": "5", 
            "review": "Fantastic. Had a brill afternoon here, noisy but boy was it fun. You will never see so many machines in one place,...anywhere. A great way to spend a rainy afternoon"
        }, 
        {
            "index": 306, 
            "rating": "3", 
            "review": "Remember the good old days of pinball. Very easy to loose track of time in this small place, It's packed full of machines which you can play to your hearts content.One room has pac-man, table football (of a kind) hockey and early tv games, but mostly its immersing yourself in the many twists on basic pinball"
        }, 
        {
            "index": 307, 
            "rating": "5", 
            "review": "Unique and thoroughly enjoyable experience. We went to the Pinball Museum not really knowing what to expect - the next hour and a half flew by and was one of the highlights of our trip. Neither of us are arcade enthusiasts but it would be impossible not to become completely immersed in the huge variety of games the museum has to offer. On arrival you pay an flat entry fee (HUF500) and an additional cost of HUF2000 to use the machines. Use of the machines is charged at HUF200 for every 15mins and you'll be partially refunded from the HUF2000 at the end of the trip based on the length of your visit (and provided you didn't spend over 2.5 hours there!).Even if you're not a massive fan of pinball, don't be put off by the name - there are plenty of other machines, including classic electronic arcade games (Space Invaders, Mortal Kombat), old school shoot 'em ups and mechanical games that date back to the 1930's. I defy anyone to visit this place and not have a brilliant time - there's something for everyone to enjoy!"
        }, 
        {
            "index": 308, 
            "rating": "5", 
            "review": "Fun for everyone. We showed up about 10 mins after opening. We were giving a quick run down of the establishment. Our kids loved every pinball machine they tried. Pricing was reasonable, with kids under 10 being free. We could of definitely stayed there the whole day. Favorite place in budapest for our kids!"
        }, 
        {
            "index": 309, 
            "rating": "5", 
            "review": "Best collection in Europe!. An amazing collection of pinballs available to the public. You can actually play over a 100 pinballs and a number of arcade machines. Parents and kids love it, much more intensive gaming experience than playing on consoles, pc-s or smart phones.A must see in Budapest, do not miss it."
        }, 
        {
            "index": 310, 
            "rating": "5", 
            "review": "An entertainment oasis. My family and I spent a highly enjoyable afternoon at the pinball museum. It is a bit tricky to find, just look for the circular sign. This subterranean entertainment oasis has a huge variety of pinball machines from all decades. You pay your entrance fee and play as much as you like. Highly recommended!"
        }, 
        {
            "index": 311, 
            "rating": "5", 
            "review": "Amazing. Years disappeared during the 3 (!) hours I played there. From the mechanical of the 50s to the full electronic models of the early 2000, I lost track of time while trying many of the pinballs of my teen age. Do not miss it if you're into games!"
        }, 
        {
            "index": 312, 
            "rating": "4", 
            "review": "Flipping marvellous! . A hidden gem in the heart of Budapest. The curator was extremely helpful, it was very well priced and we had hours of amusement with the vast amount of pinball machines on offer."
        }, 
        {
            "index": 313, 
            "rating": "5", 
            "review": "Good Fun. We planned to visited here on our trip to Budapest, great fun! not too expensive and just a different thing to do while you are in the city! I would recommend you to pop in and try out the machines"
        }, 
        {
            "index": 314, 
            "rating": "5", 
            "review": "Flipping Marvellous!. I went with my 9 year old daughter and we spent just under 2 hours there having the best time ever.Please be aware that it's closed Mondays and Tuesdays. Open 4pm-Midnight Wednesday-Friday. 2pm-Midnight on Saturday. 10am-10pm on Sundays. It's 500HUF to go in, and you pay 2000 HUF to play as much as you want. The clever thing is, that they refund you at the end depending on how long you've played. You have to play more than 2.25 hours not to get any money back, but at that point, you'd happily pay them again! You can stay there all night if you like for the money you pay up front.They have more machines then you can ever really play, both old and new, as well as a Space Invaders, some shooting games, and our favourite, Sega Basketball (at the very back, furthest point from the entrance).Staff are also really lovely, and friendly. I really can't recommend this place enough. If you've got a heart and like fun, then go here. It's like no other museum I've ever been to!"
        }, 
        {
            "index": 315, 
            "rating": "3", 
            "review": "Enjoyable hour at the end of a busy day. Great fun playing on pinball machines and some other arcade machines. If you like pinball then you'll have a great time but we had enough after an hour.It was relatively easy to find but did need a specific metro journey"
        }, 
        {
            "index": 316, 
            "rating": "5", 
            "review": "Best museum in Budapest!. Amazing array of pinball machines from old to new and all working! We spent a couple of hours there and played on the majority of the machines. Indiana Jones has always been my favourite machine, so was great to see and play that one. Used to play Fun House when I was younger at a camp site in Devon so that was also great! Would recommend a visit to anyone of any age!"
        }, 
        {
            "index": 317, 
            "rating": "5", 
            "review": "Bring back the memories . Hard to find. Its labelled FLIPPER MUSUEM ! once u find the entrance which leads underground. You will be amazed by the collection of pinball machines that are freely available to play for a low price."
        }, 
        {
            "index": 318, 
            "rating": "5", 
            "review": "Simply Brilliant!. We went here for an hour and a half before dinner- but we definitely could have spent much- much longer! My favourite machine was the Star Wars one- it was awesome!! A must visit for anyone!"
        }, 
        {
            "index": 319, 
            "rating": "5", 
            "review": "A really unique and fun afternoon in Budapest!. We thoroughly enjoyed our trip to the Flipper Museum last week! So many machines, and a really, really fun way to spend a few hours. The staff were all super friendly and helpful and would chat to you about the machines you were playing if you wanted them to. If I'm ever back in Budapest, this place will be top of my list to return to!"
        }, 
        {
            "index": 320, 
            "rating": "5", 
            "review": "Excellent! Best fun we've had in ages!. This place was fab! Bit of a nightmare to find but once we were there it was just brilliant. The guys were very very helpful, keen to show us everything and even joined in to show us how some of the games machines worked. It was really really cheap as well. We could have spent all night here if we'd found it earlier!"
        }, 
        {
            "index": 321, 
            "rating": "5", 
            "review": "Magical. All I need say is that I came here and felt my feet ache as though I had been climbing a mountain for days, then looked at my watch and realised I'd spent 4 hours playing pinball. I didn't want to leave."
        }, 
        {
            "index": 322, 
            "rating": "5", 
            "review": "Amazed!. First, we couldn't find the entrance and when we got there it was still closed. So we were bummed that we had to wait. But it was so DAMN worth it. :))It's cheap, it's awesome and it brought us so many good memories from our childhood when we used to go play pimball.They have SO MANY pimball machines. All of them have a brief explanation from when and where it's from. I couldn't choose one to play... but right at the entrance there's this Family Guy pimball that I got addicted to and right next to it there's a The Simpsons one that my boyfriend stayed forever there... and I believe were the newest ones from their collection.And as you walk around you are like \"WOW\" the whole time, every little space was filled with pimball machines.Of course this is a place that you go to have fun... it's NOT a boring as* museum.We stayed almost for 2 hours but the time flies there. I'm pretty sure if we weren't so tired we would have stayed longer. The staff was so nice! We even got some candy when we left... we really did feel young again.If you ain't going you are REALLY missing it."
        }, 
        {
            "index": 323, 
            "rating": "5", 
            "review": "Really fun.... so this is the number 1 attraction in Budapest according to TripAdvisor...!I am baffled by this to be fair - given the many other great and well established tourist attractions that Budapest has to offer...Let me assure you though that this is fun... If you want to play Pinball and a few other retro arcade type games this is well worth a visit.The guy on the front desk is really great and softly spoken... He clearly loves pinball and I'm guessing has really got TripAdvisor sussed... As to be fair I would never have found this place without TripAdvisor and I'm still totally mystified how it ranks as no.1 attraction in all of Budapest... However I can't help but recommend this for quirky, unusual and very enjoyable fun... This place does what it says it should... I do think they could really take this to the next level by adding a wider range of old classic arcade games, maybe do a proper cafe to add to it... It's nicely done right now but I implore more people to visit as given more investment and development I think this place is really on to something...Andy"
        }, 
        {
            "index": 324, 
            "rating": "5", 
            "review": "I love this place!. it's not located in the city centre, and the entrance is not the easiest to find, but once you go in, it's magical. I could have spent hours there."
        }, 
        {
            "index": 325, 
            "rating": "5", 
            "review": "Flipping brilliant. A little off the beaten track, the pinball museum wasn’t to be found in our guide book. However, if you find yourself on the Pest side of the river near Margaret Island, it’s a diverting attraction worth checking out for an hour or two – assuming you like pinball! The collection of pinball machines – and a few other arcade attractions – is vast and dates back to the 1930s if I remember rightly. Most of the machines are playable, and for free - what it costs to go to the museum depends how long you spend there!"
        }, 
        {
            "index": 326, 
            "rating": "5", 
            "review": "Amazing Find. For all retro gaming fanatics this is a must a true gem. It was 2500 HUF entry but if you do not stay for two or more hours you get a partial refund plus I hasten to add that for this price you get FREE play of all the machines!! That's aprox £6 p/p well worth it and a great way to spend a couple of hours winding down after walking around and taking in the sights."
        }, 
        {
            "index": 327, 
            "rating": "5", 
            "review": "Pinball extravaganza. this is a pinball fan's dream...from old to new there is a wide range of amazing pinball machines all on free play....there were also a number retro arcade games....we had a great night....a must if you want to do something slightly different...also kids will love it."
        }, 
        {
            "index": 328, 
            "rating": "5", 
            "review": "Amazing, Addictive Place!. Me and my friend came to see this place to take pics, never thought we'll spend hours there actually playing on the machines. Owner is super friendly and so is the staff. there are about over 100 pinball machines dating back in the days to present. There are also many other game machines that are so cool. Very addictive place worth visiting!"
        }, 
        {
            "index": 329, 
            "rating": "4", 
            "review": "for all ages. Its a fun place with older pinball machines to different types with details about design, make, historical information, etc. you'd love it, especially if you are into gaming. Overall a good place to spend couple of hours..."
        }, 
        {
            "index": 330, 
            "rating": "4", 
            "review": "Blast from the past. Called in as it was raining, what a great way to treat tourists. Pay your entrance fee, play around on pinball machines...and a space invader machine. If you don't stay two hours the owner refunds some of your entrance fee. Really enjoyed our 90 minutes."
        }, 
        {
            "index": 331, 
            "rating": "5", 
            "review": "Out of this world fun!. I cannot rave about this place enough. It was so so much fun! It took me back to my childhood and more. It is packed with so many classic arcade games that you can no longer find anywhere else. The owner was super friendly and helpful. We even bought their t-shirts as souvenirs."
        }, 
        {
            "index": 332, 
            "rating": "4", 
            "review": "If you like reliving your childhood in arcades then this is the place for you. A huge range of pinball machines to play on from over the last 50 years. It is easy to say the older pin ball machine the harder it is to play. The are also some other antique games that can prove testing. If you get addicted to games then you could spend hours within this establishment."
        }, 
        {
            "index": 333, 
            "rating": "4", 
            "review": "great way to spend a couple of hours. Brilliant underground pinball cellar with all sorts of pinball machines dating from the originals to modern day. Fascinating to see how they evolved plus it only costs a fiver to get in and have unlimited use on all the machines for two hours. Great fun!"
        }, 
        {
            "index": 334, 
            "rating": "5", 
            "review": "Great!. Spent a couple of hours here and it was fantastic. Loved the pinball machines, not only for playing them but also studying their designs. Staff was very welcoming and friendly."
        }, 
        {
            "index": 335, 
            "rating": "5", 
            "review": "Great place to go. Lots of Pinball or as Hungarians call them- Flipper machines. Above each one there is a plague explaining when it was made, by whom, where and how many copies. Went there with my husband and was prepared to be so bored as I am not fan of things like this, but I was converted when inside. It is addictive and what a great fun! Not every day you can play on something which was made in 1830! It is not the easiest place to find as even receptionist from our hotel didn't know about it and she lives on the same street, but it is close to Western Railway Station and West End Shopping Centre. Don't miss it when in Budapest and I can guarantee that you will have a great time!"
        }, 
        {
            "index": 336, 
            "rating": "5", 
            "review": "If you are with friends or kids, nice hour to spend!. What a small entrance, hard tot find. But it is worth in when you in there. I had a great amount of fun for an hour and then i was tired. The guy/owner was really nice and helpful. Entrance fee is low paid +-1000 huf each. I recommend this tot anyone!"
        }, 
        {
            "index": 337, 
            "rating": "5", 
            "review": "A must! Bizarre but loads of fun!. Myself and my friend visited be museum and were initially deterred because we couldn't find it anywhere! Turns out it doesn't open until 4pm . . . Keep this in mind.The staff are very friendly and on first instinct we were a little put off (being two young females in a dungeon full of pin ball museums) but we realised they are just VERY passionate about pin ball! Very. And are keen to show you the best machines etc. Worked out very cheap for us as we didn't stay longer than an hour and so you get some of your money back when leaving.There are some excellent machines (namely some of the multiplayer ones) and it's a must if you have time!"
        }, 
        {
            "index": 338, 
            "rating": "5", 
            "review": "A M A Z I N G. love it,very friendly environment,you can stay there as much as you want and play but after a hour and half ,we got a bit tired.Definitely you must visit!"
        }, 
        {
            "index": 339, 
            "rating": "5", 
            "review": "Utterly amazing place!. This place is absolutely fantastic. I spent quite a lot of time here I can tel you! Inexpensive to get in and the staff there are friendly and enthusiastic.I've no idea if it's in any way unique (probably not) but I've never come across anything like it.A further tip is, when you come out and make your way back to the station, you might be feeling a bit peckish. About 100 yards up on the left is a Chinese. Incredibly huge portion and a cola for about £2.50. Doubtful if you could eat it all!"
        }, 
        {
            "index": 340, 
            "rating": "5", 
            "review": "Amazing. This place in amazing, the amount of machines alone is spectacular but the price for what you get is fantastic, 2500 HUF but if you spend less then 2 hours the get partly refunded which i think is genius ad should be done in other place. Its not just the machines the manager her was the nicest bloke you can meet. the machines vary in age which i great seeing how they have changed.only downside was gettng my highscore beaten by my brother which means the machine was clearly broken lol"
        }, 
        {
            "index": 341, 
            "rating": "5", 
            "review": "WOW! Incredible place!. I have honestly never seen anything like this place! We visited the Pinball museum on our last evening just before going out for a bite to eat and it was a great way to spend a hour or two. Over 100 pinball machines, dating back to 1939 all set in a beautiful brick exposed cellar.It's not cheap.. 2500HUF per person.. but you get a refund if you don't stay two hours which is a really lovely touch (we managed 1.5 hrs). A real mix of ages in this place, we are in our twenties, but plenty of older adults about!It puts a smile on your face for sure - would absolutely recommend this place for anyone and everyone! If I'm ever back in Budapest, I'll make sure to re-visit!AWESOME!"
        }, 
        {
            "index": 342, 
            "rating": "5", 
            "review": "It's a unique museum. There are 130 pinball machines and some other games in a very nice cellar. It's not just for your eyes, so you can try them all!"
        }, 
        {
            "index": 343, 
            "rating": "5", 
            "review": "Must visit :). I recommend you to see this pinball museum. There are lots of different pinballs and other games, some almost 100 years old. Prices for museum and playing are not expencive and the owner is very friendly!"
        }, 
        {
            "index": 344, 
            "rating": "4", 
            "review": "Great value for a few hours of fun. Good variety of games, not just pinball - old school basketball game, skittles, 2 player shooting games. Highly recommended if you get the chance to visit!"
        }, 
        {
            "index": 345, 
            "rating": "5", 
            "review": "Great value!. Spent about hour and a half inside, playing around and testing Pinball machines, but also arcade games machines.If you don't want to stay until the closing, or stay less than 2h, they will refund money to you.There is also student discount and these people are very nice! If you don't know how to use some very old machines, they will show you and spend time with you as long as you need their help.The 2h+ stay is priced at 2500 HUF (which is about 8 EUR/10 USD) and as I said, you'll get refund in case of leaving the museum earlier."
        }, 
        {
            "index": 346, 
            "rating": "5", 
            "review": "Huge smile on my face. Friendly owners, warm atmosphere. This place has just about every pinball machine you could imagine. I'd say there are about 50 machines. Some of these include arcade machines and ultra retro shooting fair games. Machines date back to the 1930s up to 2000s. I'm a generation Y kid who grew up on 90s pinball machines but since I was poor I never had a decent go at them. Now for only 2500ft you can play all day! Just loved it.All the sounds, feeling and smells of a proper pinball parlour. Nostalgia to the max."
        }, 
        {
            "index": 347, 
            "rating": "5", 
            "review": "Hidden gem!. Wanna have but of fun? Go to the pinball museum! Very friendly staff and lots of great old and new pinball games. It was easy to find too!"
        }, 
        {
            "index": 348, 
            "rating": "5", 
            "review": "Great fun. Everyone who likes pin ball will have the time of their life at the Pin BallMuseum in Budapest. It is easy to find (Close to West End and Nyugati), inexpensive and the staff is helpful and nice to talk to. Recommended!"
        }, 
        {
            "index": 349, 
            "rating": "5", 
            "review": "Best way to spend your evening. This was an underrated place as we hadn't heard anything about it but stumbled across it. The place is full of pinball machines all different and unique! You could spend hours in this place but one of the best things is that if you spend less than 2 hours here you get some of your money back. Bargain for a night of pinball machines!"
        }, 
        {
            "index": 350, 
            "rating": "5", 
            "review": "A must see for pinball lovers. Never have seen so many pinball machines in one location and great working order.It was very welcoming and a lot of fun.The owner was very nice and was able to get us a taxi back to our hotel as soon as we needed one"
        }, 
        {
            "index": 351, 
            "rating": "5", 
            "review": "Amazing! Feels like a time machine. Well, I was a bit sceptic before I went to the pinball museum- why would I pay 2500 fl for a pinball museum and why is it rated so high?! But I think 'pinball museum' does not capture how magical this place is - the owner is extra nice and attentive and all the machines are working. We went in and spent 3 hours in there. It is like a time machine- going back to my childhood but without having to pay for each game. I loved it. Def deserves the rating."
        }, 
        {
            "index": 352, 
            "rating": "3", 
            "review": "Really?. Whilst there is nothing inherently wrong with this place it cannot be right that it's rated the best place to visit in Budapest as it really isn't."
        }, 
        {
            "index": 353, 
            "rating": "4", 
            "review": "If you like pinball you'll love this.... Lovely owners happy to talk to you about the history of pinball machines. An amazing collection that stretches back to the 30's. Would have liked some more literature."
        }, 
        {
            "index": 354, 
            "rating": "5", 
            "review": "Amazing fun. We had so much fun! We stayed much longer than we planned. Recommend this for everyone. The owner is really nice as well :)"
        }, 
        {
            "index": 355, 
            "rating": "5", 
            "review": "So much fun!. Pinballs of all styles and epochs. Dozens and dozens and dozens of them - and you can play all you want, for as long as you want! Great place, tons of fun, highly recommended!"
        }, 
        {
            "index": 356, 
            "rating": "5", 
            "review": "Hilarious experience. Wonderful place to visit, very trippy experience! The staff so lovely and helpful. Seem to love what they do! Highly recommended."
        }, 
        {
            "index": 357, 
            "rating": "5", 
            "review": "Thumbs up!!!. This place was much cooler than I was expecting. We played a bunch of pinball. Left and went to Aqua World for a while then came back and played more pinball. So great!"
        }, 
        {
            "index": 358, 
            "rating": "5", 
            "review": "Super fun. Came here with two other friends and we had a great time playing the games! You should definitely play if you plan on visiting otherwise you probably won't enjoy it much and will be done within 10mins. They have soo many pinball machines and also other types of fun arcade games! Obviously you should only visit if you are interested in arcade games. But I would definitely recommend it, it is very cheap and so fun."
        }, 
        {
            "index": 359, 
            "rating": "5", 
            "review": "Epic experience. Although I'm not a big pinball wizard I loved the pinball museum over 130 machines to play on varying from new ones to very old ones from the fifties. You can stay untill closing time for just 2500 forint which is a steal. If you want something to do while in Budapest this is a great excursion."
        }, 
        {
            "index": 360, 
            "rating": "5", 
            "review": "An exciting journey back in time. Well worth a visit, if not for a longer stay. Not too many places like this exists - even in Europe scale. Have a blast from the past! Try out some pinballs (which there are plenty of), but be warned: you might start to like em! Go with a full belly, as I'm quessing you won't be leaving soon!"
        }, 
        {
            "index": 361, 
            "rating": "5", 
            "review": "Best pinball ever!. This is amazing place! so many great machines in excellent condition and you can not only watch but u can PLAY THEM ALL all day long! For sure i will be back!"
        }, 
        {
            "index": 362, 
            "rating": "5", 
            "review": "A load of balls..NOT. Loved this place, found a little bit off the beaten track, but well worth the effort. Row upon row of brightly flashing techno sounding pinball machines.Great welcome by the Manager who charged HUF 2500 but said if we there fir only an hour or so he would give us half our money back. He did a real gent and PB Expert.I found the Elton John pin ball machine that I had last played in my home town of Masham in John Ellis's chip shop in 1976. Still couldn't get the high score of the week. My mates said it was all in the wrist action... I declined to comment...Yes a must visit even if you have never played a pinball machine..."
        }, 
        {
            "index": 363, 
            "rating": "5", 
            "review": "Amazing!!!. Unique and fun, I think it made my trip... Nice People, good vibes,Special vintage chic! Reminded me of my childhood:)Don't miss out!!!"
        }, 
        {
            "index": 364, 
            "rating": "5", 
            "review": "Great fun. We didn't imagine we'd spend so much time and have so much fun there.We planned to stay for 30 minutes and ended up staying whole 2 hours.The number of machines is endless, 90% pinball machines and the remaining 10% are casual arcade machines like Space Invaders, Pacman, Bowling, kind'a foosball etc..The staff are very friendly and kind. They go around and check the machines every now and then. They also give you tips how to play some of the games."
        }, 
        {
            "index": 365, 
            "rating": "5", 
            "review": "Love Pinballs? Don't miss this place.. You'll find most of the 'famous' pinball machines in this establishment. One flat fee will get you unlimited playtime on the machines. The pinballs are well looked-after."
        }, 
        {
            "index": 366, 
            "rating": "5", 
            "review": "130 pinballs!. Great collections of pinballls and other electronic games.Could spend a week here.Clean place,nice staff,very cheap entrance fee"
        }, 
        {
            "index": 367, 
            "rating": "5", 
            "review": "Not bad if you already know Budapest. .....Many other things to see, but still not bad if you like it. It is important to check prices and working hours prior arrival."
        }, 
        {
            "index": 368, 
            "rating": "5", 
            "review": "A must for anyone who ever played pinball. 130 pinballs in perfect condition.This is the only gaming room in the world where you can try such a quantity.Very friendly owner and staff.The entrance fee is symbolical"
        }, 
        {
            "index": 369, 
            "rating": "5", 
            "review": "Nice owner . We were there on a Wednesday but it was not open. However the owner welcomed us and explained every question we asked very patiently. I'll go there next time I go to Budapest!"
        }, 
        {
            "index": 370, 
            "rating": "5", 
            "review": "Great fun. This place is a gem. Pinball machines from all ages and all set to free play. The staff are friendly and helpful and it costs peanuts too which makes it a fantastic way to while away a few hours when it's freezing outside."
        }, 
        {
            "index": 371, 
            "rating": "5", 
            "review": "So much fun!!! Definately worth a visit or two!!. This place is amazing!! After paying a small entry free...$10 you get unlimited use of all the pinball and arcade games for as long as you would like to stay (or until it closes at midnight)The owner and workers love their jobs too and come around making sure everyone is having fun and showing how to use older style pinball and arcade games if you have never seen them before!!They have clean snacks and t-shirts for sale and clean bathrooms!!Not open Monday's :( but luckily we had an extra day and definitely glad we decided to go back and try this place out!!! An absolute must stop for a visit to Budapest!!!Make sure you play the basketball n bowling!!! Amazing!!"
        }, 
        {
            "index": 372, 
            "rating": "5", 
            "review": "Very interesting!. There are about one hundred pinball machines of different years and some are really old and well preserved. You can play the machines as long as you like (about 200 hf per 15 mins) and we spent 2 hours there after dinner. Staff are friendly. An interesting activity in Budapest!"
        }, 
        {
            "index": 373, 
            "rating": "5", 
            "review": "Great fun!. Had a great time at the pinball museum. Lots of machines and a few shooters and bowling arcade games. The guy at the desk was so nice, as was the guy wandering round helping and showing how some of the old machines work. Machines are both old and newish, but good retro feel. Would definately go again!"
        }, 
        {
            "index": 374, 
            "rating": "5", 
            "review": "fantastic fun. I went there last Dec 14 at night.It open untill midnight with various pinballs and classic machine uou have ever wish to play.Me and my friend never play a virtual pinball before and I can say that it is worth to play it in real!!The ower very kind and nice, he offer me to look around before I pay.He have very classic machine like 1940-1950 old and it incredibly fun with that old ball to kick it up!!"
        }, 
        {
            "index": 375, 
            "rating": "5", 
            "review": "what a hoot. Read about this on tripadvisor while looking for something else. It's in walking distance of my apartment. I was never much of a pinball player as a kid, but I was quite delighted by this place. I only stayed and played an hour though I paid for the 'all day' just in case I decided to get dinner and then come back. Busy place in a good way. Lots to look at, probably some of you favorite games are there. Just plain fun."
        }, 
        {
            "index": 376, 
            "rating": "5", 
            "review": "A must see. Over 50 pinball machines! Very good environment and friendly stuff! If you are in budapest you must visit it!"
        }, 
        {
            "index": 377, 
            "rating": "5", 
            "review": "Great getaway. What an amazing place it was. Hundreds of old pinball and arcade games. The staff was nice and kind enough to voluntarily come show us some of the cool games in the back end of the area; check out bowling and basketball! They speak some english too. If you miss the arcade halls go here. All machines are free once you pay entrance."
        }, 
        {
            "index": 378, 
            "rating": "5", 
            "review": "A must do! :). A really fun and nice place.This place is both museum and \"playground\" for pinball fans.For a really good price (2500HUF - 16:00-24:00) you can try all the games (all of them in the \"free play\" mode)And the guys working there are really friendly and keeps the games in a very nice condition.The place and the mashines are really clean.You can feel, that these people put great time and effort to make it NOT like a business, but a place to share their love and interest about pinball :)So go ahead and spend a couple of hours at this place, you wont be disappointed. :)"
        }, 
        {
            "index": 379, 
            "rating": "5", 
            "review": "Awesome night. We decided to visit due to the reviews and it being very close to our hotel. Did not really know what to expect. You pay a very small entrance price and get unlimited goes on literally hundreds of pin ball machines. There are some very old ones and also a few other old arcade games. We ended up staying for close to three hours!"
        }, 
        {
            "index": 380, 
            "rating": "5", 
            "review": "Pinball heaven!!!!. Wow....if you love pinball they you will love this place. Literally hundreds of pinball machines dating from the 60's to present day. Its cheap to get in though i was entirely confused about the entrance fee. Something along the lines of you pay 2000ft to enter and if you leave before the next entry quarter starts then you get your money back. If you decide not to leave then you can stay until around midnight playing pinball for free.There are a few other arcades too....space-invaders. pac-man, street fighter and some awesome bowling, basketball and shooting games from the 60's that are awesome.They did have a cafe but unfortunately it wasn't open at the time. Would be great to have a snack and drink break in between playing.Seriously though, great place which you should try and visit."
        }, 
        {
            "index": 381, 
            "rating": "5", 
            "review": "I love Pinball!. Best place ever for real pinball lovers. So many machines I could not really decide which one to choose for playing. Really great staff, and perfect place for fun!"
        }, 
        {
            "index": 382, 
            "rating": "5", 
            "review": "Sooo great!. This is perfect place, especially for these cold days, me and my boyfriend enjoyed in playing games. Your cart is valid for the whole day, just check the opening hours. Spend here at least one hour, you won't regret it, it is so great!"
        }, 
        {
            "index": 383, 
            "rating": "5", 
            "review": "Retro Fun in a trendy area!. If you remember the days of arcade playing - you must visit. Enormous underground area with several pin ball machines and other arcade games. We particularly liked the bowling putt game! They do a great deal where you pay and get a wrist band, so you can come and go as you please until 12am. The guy running the place was very friendly - What a great place! - A must see!"
        }, 
        {
            "index": 384, 
            "rating": "5", 
            "review": "Pin it!. Best place ever! Gotta see it to beleive it! And they have Twilight Zone! The classic machines - not just the pinballs but the shooters, pacman etc. - are all good fun and a fun time travel! The kids love it too.Come, come!"
        }, 
        {
            "index": 385, 
            "rating": "5", 
            "review": "Should be ranked in the top!. This place is just amazing and great fun. A bit of retro feeling, but also younger non-pinball generation will enjoy the place big time. Kids are welcome when accompanied by their parents. I live in Budapest and keep going back with an increasing amount of friends being into the place. Go, play, enjoy!"
        }, 
        {
            "index": 386, 
            "rating": "5", 
            "review": "In Budapest? You must see this!. One of the amazing place in this city. Over 150 pinball machines including some arcades. Stay there for couple of hours and you will fall in love in this world of steel ball :)"
        }, 
        {
            "index": 387, 
            "rating": "5", 
            "review": "Great experience. The Pinball Museum is one of the most unique places to go in the hear of Budapest.The galery represents the history of pinball with more than 100 machines from the beginning until nowadays.All the pinball machines are playable ,including the oldest generations.If you need any information about the pinballs,don't hesitate to ask the friendly staff ,they always ready to help!It's a great fun for all the family,including kids,parents and grandparents!"
        }, 
        {
            "index": 388, 
            "rating": "5", 
            "review": "A real curiosity!. PBal Gallery is the only one place in Hungary, where you can find about 130 perfectly working pinball machines, and some other video games related to pinballs.If you know pinballs or don't, you must check this place.It's amazing!Stuff is very kind, and if needed, they can guide you through the pre-machines from the end of 1800's til the classics and nowadays modern pinballs.This is a real must see."
        }, 
        {
            "index": 389, 
            "rating": "5", 
            "review": "Sommething really special... Great Pinball museum..... I visited several times this place in 2014. Pball Galery has just opened its doors in 2014 and become the biggest Pinball (open)collection all over Europe. After paying some Hungarian Forints (approx 8-9 EUR) you can play unlimited free games on all machines... There are more than 130 pinballs, and of course the biggest names are included, like Indiana Jones, Addams Family or Arabian Nights. If you want some unique experience You can find also some really old games (also in playable condition) and some specialities from the middle of the 20 century.I suggest this place not only for families, but also for party, or just having some fun alone, too...."
        }, 
        {
            "index": 390, 
            "rating": "5", 
            "review": "Most fun in a museum!. We found this place not far from the river in budapest. Nearest metro station is blue line Nyugati Palyaudvar. The its half way down a road called Radnoti Miklos.The staff are very friendly and helpful and speak good english. Nice toilets and clean. We had great fun using all the machines! There are so many. Some really new ones and really old ones plus a few other 2 player games. Best museum i have ever been to!Opening times are 4pm - midnight."
        }, 
        {
            "index": 391, 
            "rating": "5", 
            "review": "Pinball Time Warp!. During our casual exploration of the city we stumbled upon this side-street gem, home to over 130 pinball machines dating back to the 1930s. All of them are functional and unlimited play is included in the modest admission price. We had a blast in this pinball time warp and recommend it as the perfect distraction from the more recognized sights."
        }, 
        {
            "index": 392, 
            "rating": "5", 
            "review": "Awesome place. A fine collection of both classics and modern pinballs. The machines are in good conditions and lovely and helpfull staff."
        }
    ]
}