{
    "category": "Budapest", 
    "entity": "Music-Fountain", 
    "avg_rating_stars": 4.614617940199335, 
    "review_count": 301, 
    "rating_stats": {
        "poor": 3, 
        "average": 19, 
        "terrible": 0, 
        "very_good": 69, 
        "excellent": 210
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "Must see!. Must see attraction! Beautiful fountain! We visited the island at 9pm to see a 50 minutes show. It was amazing."
        }, 
        {
            "index": 2, 
            "rating": "4", 
            "review": "fun. we caught this by chance when walking through the park - well worth hearing - was fun. Lots of seats and cafe near by."
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "Beautiful fountain. Our last walk in the rain in Budapest. We went in search of Margrit Island. Crossing the bridge you hear the music first, then you see the syncronized water to music. You can't help but just stand and soak up the atmosphere. Even thou it was drizzling, and chilly it was a great entertainment."
        }, 
        {
            "index": 4, 
            "rating": "4", 
            "review": "A miniature of Bellagio Fountain at Las Vegas. Going to Margaret Island you cannot miss the dancing water fountain. At particular times in the morning and in the evening the dancing water is synchronized to music. During the evening the fountain is lit up and one can enjoy the beauty of this fountain."
        }, 
        {
            "index": 5, 
            "rating": "5", 
            "review": "A real spectacle. We visited for the 19.00 hrs performance and were expecting 8 tunes but we're delighted to find 50 minutes of music and fabulous displays from the fountain and all for free. You really must pop in to see it if visiting before November."
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "Worth a visit. I really enjoy this fountain, the fountain is synchronized with music and it's really joyful and addictive to watch it!"
        }, 
        {
            "index": 7, 
            "rating": "5", 
            "review": "Really nice sightseeing if visiting the Island of Margaret. We were going on a sunny day to visit the Island of Margaret. We didn't know there was a Music Fountain but arrived to the plaza from main street. We ended up sitting 40 minutes and following the show. The music started to play 14 sharp, most likely it is playing during all hours for max. 30 minutes."
        }, 
        {
            "index": 8, 
            "rating": "4", 
            "review": "A pleasant interlude. Sat and listened to the fountain dancing to the music in the sun. One of my favourite songs was played so that made it even better."
        }, 
        {
            "index": 9, 
            "rating": "3", 
            "review": "I would not make a detour for it. It is a nice fait divers in a mediocre park on a mediocre island in the Danube...It is fun to watch the water dance on classical music, but every senior tourist will have a big feeling of déjà-vu. It is the same as all these other music fountains in all of these cities all over the world..."
        }, 
        {
            "index": 10, 
            "rating": "5", 
            "review": "Lights at night. This was a lovely relaxing point in our trip. We sat in the park next to the musical fountains it was wonderful. At night they have lights."
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "Light up your Night. Really enjoyable light show which responds to modern day music such as Coldplay and the Stones. Definitely something worth doing and within walking distance from most hotels and free."
        }, 
        {
            "index": 12, 
            "rating": "5", 
            "review": "Romantic evening on Margaret Island. We were walking by and heard the music.. it seemed near but no restaurant or building nearby. Suddenly it was clear.. it was coming from the fountain, changing colours, the different twirly fountain squirts at the sound of music dancing, like magic! It was a lovely experience and we sat there spellbound, holding hands like other couples and enjoying a balmy evening in Budapest. I can recommend it! Try for extra romance!"
        }, 
        {
            "index": 13, 
            "rating": "4", 
            "review": "Pretty island. Margaret Island is a very pretty parkland. It is a long narrow 31 km island where many locals go for a peaceful retreat or to exercise by running around the island. We found it very pleasant to walk from one end to the other. However we did think it needed some attention to the gardens. Unfortunately when we visited workman were digging up areas around the fountain to lay pipes."
        }, 
        {
            "index": 14, 
            "rating": "3", 
            "review": "Not my type of entertaining.. Walked by when I visited Margaret Island. If you like fountains and music it can be interesting and fun. Just not my type of entertaining."
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "The power of the water. The fountain and all the area with the old, high trees gives you a really pleasent time to be there. Whenever i can i visit."
        }, 
        {
            "index": 16, 
            "rating": "5", 
            "review": "A beautiful palce. It's a very nice place to visit at margit island. There are different songs every hour (for 15 min) and a longer concert at 21:00. There are also benches for sitting"
        }, 
        {
            "index": 17, 
            "rating": "4", 
            "review": "Tranquility Plus. The best thing about not researching everything before you travel is that you occasionally stumble across a gem of a surprise. We stumbled on this one during a cycle around the park. To add to the tranquillity and beauty of the park we were treated to a splash of classical music with accompanying dancing water fountain. What a great place to chill out. If you want to b completely transported to paradise grab one of the excellent ice creams from the nearby café."
        }, 
        {
            "index": 18, 
            "rating": "4", 
            "review": "Soothing place. You can easily spend an hour here enjoying the calming combination of the music and the water sounds. It is an excellent break from the intense sightseeing, as Budapest is really a walking city. The fountain is right behind the Buda and Pest reunification monument, at the south of Margaret Island. There are several chairs and benches facing the dancing waters so you can comfortably enjoy the show."
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "Fantastic. Fantastic views on Margaret Island. We only saw the fountain during the day, but it was still beautiful. It was very clean and well kept."
        }, 
        {
            "index": 20, 
            "rating": "5", 
            "review": "Enjoyable show. The Music Fountain on Margaret Island is good entertainment especially if the weather is bright and sunny."
        }, 
        {
            "index": 21, 
            "rating": "4", 
            "review": "Nice 30 minutes. Interesting fountain. We arrived on 20:40 and stared at the fountain. On 21:00 the fountain began to run according to the (good) music on the background. There were not many people at that time so we could take a seat. There are several chairs around."
        }, 
        {
            "index": 22, 
            "rating": "5", 
            "review": "What a surprise!. We had heard about the fountains on Margaret Island, but they were much more than we were expecting. They run continuously, but there is a display to music on the hour every hour which lasts for about 20 minutes, and they all seem to be different. Would be worth seeing at night too."
        }, 
        {
            "index": 23, 
            "rating": "4", 
            "review": "Saw it on my Segway Tour. Our Segway Tour took us the the Margaret Island where we saw this beautiful fountain. It may not be the greatest fountain but the area it's in adds a lot to the experience. At about 9 I think, they do a water show. We couldn't stay to watch but I hear it's beautiful."
        }, 
        {
            "index": 24, 
            "rating": "3", 
            "review": "Beautiful but not a must . If you have few more hours to spent, or you're in Budapest for 5-6 days, it can be a nice and peaceful place to visit, especially the fountain and the Japanese garden at the end of the island"
        }, 
        {
            "index": 25, 
            "rating": "4", 
            "review": "Margaret Island - spoilt by construction works. Stopped off on Margaret Island from the boat pier immediately to see the Fountain. No music but the changing display was very good. and an array for usually fixed seating to view it. On going construction work did take the edge of what should have been a tranquil stroll.."
        }, 
        {
            "index": 26, 
            "rating": "4", 
            "review": "Lovely. Very nice and the music was lovely.think it's every hour on the hour for about 10 minutes. When we were there it was pop music from the 70 s.very busy place but plenty seats around the fountains"
        }, 
        {
            "index": 27, 
            "rating": "4", 
            "review": "Dancing along the waters. Don't expect to see the music fountain of Pelagio Hotel (Las Vegas) but it is still very nice. The kids were dancing along the waters and the music and the general atmosphere was pleasant. It is the first thing you see once on the Margaret island, so you do not really need to look for it :-)"
        }, 
        {
            "index": 28, 
            "rating": "4", 
            "review": "See how the water jets into the air. The only notable attraction on Margaret Island. Sit on the chairs provided and see how the water jets into the air. See the different patterns formed."
        }, 
        {
            "index": 29, 
            "rating": "5", 
            "review": "Great spot with music and patterns day and night. This is a must see. Wait for the full programme to complete.At night it is magnificent.Again wait for the full programme ."
        }, 
        {
            "index": 30, 
            "rating": "4", 
            "review": "Very clever!. We spent half an hour sat in our peddle car in the rain listening to the music, and watching the show! Great fun!"
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "Mesmerizing. This fountain is on Margaret Island, and it was a nice surprise to stumble upon. We came by river cruise and were dropped off at the edge of the island, near a runners path but we managed to find a detour and stumbled upon these fountains and a lovely garden. Definitely worth a visit,we really enjoyed just sitting down and watching the fountain whilst listening to the music."
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "Nice place to relax. Made our way there while waking around Budapest. There were quite a lot of seats to sit down and it was very nice when the music started playing. It would be perfect to have a pick nick there during the summer. Definitely worth the visit."
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "Brilliant - and free!. Impressive fountain round the clock which on the hour launches into a spectacular display coupled with music - even better at night when coloured lights add another dimension. The displays go on for 10 to 15 minutes."
        }, 
        {
            "index": 34, 
            "rating": "4", 
            "review": "Great music show. We waited for 15 minutes and it was definitely worth it. The show was great, although they ended with a poor song choice which made it a bitt of an anti-climax. How high can this water go though :o We had the show with old rock music and I loved it."
        }, 
        {
            "index": 35, 
            "rating": "4", 
            "review": "ON THE HOUR DISPLAY. we visited Margaret Island, used the \" noddy train \" to ride the length and back then enjoyed the fountain display where there are plenty of seats. The lsland is well worth visiting. The hop on / ferry calls there."
        }, 
        {
            "index": 36, 
            "rating": "5", 
            "review": "Very Nice. We visited during the day and enjoyed the music and dancing water of the fountain . It is the best part of the trip to Margaret Island and worth seeing .."
        }, 
        {
            "index": 37, 
            "rating": "4", 
            "review": "Part of a bike tour stop - very enjoyable. Stopped off as part of a bike tour and luckily the music and fountain show had just started and was very enjoyable. This was in the daytime and I understand that the night time version is also worth a visit....enjoy."
        }, 
        {
            "index": 38, 
            "rating": "4", 
            "review": "Fun. We took the ferry to the Island, had an icecream and sat in the lovely garden waiting for the 'performance'. We certainly weren't disappointed. There was an amazing display of co-ordinated water movement to some interesting music. Well worth the trip."
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "Marvellous creativity.. We stood to watch the water show and were a bit unsure of what we were seeing. Patience pays, however, and we were rewarded with a beautiful show! There are moveable benches to sit and enjoy the water some in shade and some in sun. It is fun and relaxing to watch how water can be well manipulated."
        }, 
        {
            "index": 40, 
            "rating": "5", 
            "review": "Charming. One of the best attractions in Margit Island. A beautiful 30 imnute show, with and without music. Definitely Worth visiting."
        }, 
        {
            "index": 41, 
            "rating": "4", 
            "review": "Enjoyable. On our last afternoon we took a ferry over to Margaret island. The fountains are to be found immediately after you disembark. We happened to arrive just around 11am, as the musical performance began.I assume it is every hour on the hour. Four classic orchestral pieces accompanied the dancing fountains. Later when we were leaving and passed by, the fountains were dancing to some Beatles songs so there is obviously a variety of routines.There was a number of benches/seats around the fountains.Though not in the same league as the dancing fountains at The Bellagio L V, these were very enjoyable, especially on a lovely summers day."
        }, 
        {
            "index": 42, 
            "rating": "5", 
            "review": "Magical. Another must! This is our 2nd visit to Budapest - and we didn;t manage to see Margaret Island the 1st time. Could sit and watch this all day - there is just something about water, music & different colours!"
        }, 
        {
            "index": 43, 
            "rating": "5", 
            "review": "Breath-taking. Probably one of the best moments in my whole life! It was stunning and I highly recomend going there!! Plus its free and close to city centre;) (my personal advice - definitly visit in the evening!! Much stronger experience:) enjoy❣"
        }, 
        {
            "index": 44, 
            "rating": "3", 
            "review": "Pleasant place to sit and admire the views.. The music fountain is very easy to find on St. Margarets island and there is plenty of outdoor space to sit and enjoy the musical show. There is limited seating but you can sit on the grass on on the edge of the fountain - I admit I did dip my toes! The fountain is pleasant to see but nothing spectacular, simply a series of fountains with background music at varied intervals. I did not visit at night so it may look more impressive then."
        }, 
        {
            "index": 45, 
            "rating": "5", 
            "review": "Cool place to have your coffee. It is located in Margaret island. It is a nice place to rest. you can have your coffee and move on. It is not a must to see in Budapest."
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "Fun few hours.. Fountain dances to music. Fun area to sit and eat snack with stunning wooded area around it. Worth a visit."
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "WATER AND MUSIC - WHAT A GREAT MIX!. A spectacularly impressive multi-jet fountain display expertly choreographed to classical music. It displays throughout the day and into the evening, and is located at the end of Margaret Island closest to the Margaret Bridge."
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "A must see if you like music . The dancing water with the sound of music, the different colors of light and the splashing of water makes this place a soothing sight for the eyes and heart.My favorite place in Budapest, this is a good place to relax after a hard day or long city walks if you are a traveller."
        }, 
        {
            "index": 49, 
            "rating": "5", 
            "review": "2016 Summer vacation. This amazing fountain has a music program ... from classical to Rock and pop. Have a quick picnic while in Margaret Island and listen and see the water dance with the music."
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "Great attraction in a fantastic park. I had only really heard about this place a few days before travelling to Budapest. The fountain is one of the first things you'll see as you walk down the main street in to the Margaret Island park. The musical shows, when the water fountains create amazing patterns in the sky to songs and pieces of music, are fantastic to watch. We found ourselves sat here for nearly an hour, watching the water and listening to the music when it came on. Its very well done and wonderful way to pass some time. Grab a drink, an ice cream and relax."
        }, 
        {
            "index": 51, 
            "rating": "4", 
            "review": "Nice. A nice thing to see if in the area!\nWhen the lights and music and the fountain are playing together it is quite a sight. I managed to arrive at sunset. an added bonus!"
        }, 
        {
            "index": 52, 
            "rating": "4", 
            "review": "Nice show, water not so well composed. I enjoyed sitting directly at the fountain with my feet in the water on a hot summer day. Perfect to relax! I just wished the water fountains would be better composed to the music, seems kind of random. Seen better composing in Planten und Blomen (Hamburg) with more enthusiasm. Nevertheless a good amusing part of the day"
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "awesome and romantic. a good place for romance, ice cream and cooling weary feet in the fountain. local restaurant Champs is great."
        }, 
        {
            "index": 54, 
            "rating": "5", 
            "review": "magical!!!. We visited this fountain 2 times, once during the day and once during the night. It was so beautiful and relaxing during the day, but during the night it was just marvelous. It was such a magical show."
        }, 
        {
            "index": 55, 
            "rating": "5", 
            "review": "Lovely attraction for a sunny day. One of our favourite places in Budapest! The fountain choreography is really impressive and the music choice is great. There's plenty of shade and you can sit around the edge and dip your feet in a special fountain layer for this purpose (something more fountains should have). Between musical performances you can also hire pedal cars nearby to tour the island. We went twice in two days! :)"
        }, 
        {
            "index": 56, 
            "rating": "4", 
            "review": "interesting to watch. Located in the south end of the park. It is a nice place to sit and relax and watch the water patterns. Many shady seats for your viewing pleasure. come early in the summer before the heat of the day."
        }, 
        {
            "index": 57, 
            "rating": "5", 
            "review": "So cute!. Definitely worth visiting. The water coordinates with the music every hour on the hour and it's absolutely beautiful!"
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "A nice break. A nice little place to relax, and liten to some music. The water dances to The music.A big turist place.No Food around. Only some Icecream and smal café"
        }, 
        {
            "index": 59, 
            "rating": "5", 
            "review": "Magic music fountain. Came across this by chance - we went for an evening walk across the Margaret Bridge and looked down the road onto the island, saw a colourful fountain but had no idea it was musical - spent a wonderful and magical hour watching it"
        }, 
        {
            "index": 60, 
            "rating": "5", 
            "review": "Beautiful and relaxing. Margaret island is one of the must place to see. We thoroughly enjoyed our time there. wonderful music and water show was good."
        }, 
        {
            "index": 61, 
            "rating": "5", 
            "review": "Love it. This is such a great fountain, the seats are in the shade under a tree. You can see the fountain do tricks with the water and performs with the music. A great place to chill in Budapest"
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "Nice!. I have seen many attractions of the kind but this is one of the nicest. We experienced it only during the day time and I can only imagine how beautiful if us at night. Spectacular water play and good music. Impressing."
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "Nicest place in Budapest.. Great fountain. Great performance of the water, music and lights. Definitely to visit. Very relaxing and dutiful."
        }, 
        {
            "index": 64, 
            "rating": "3", 
            "review": "Nice stop. On its own, not much. But adds to the ambience of a stop on the island. Also a good place to cool your heels on a hot day."
        }, 
        {
            "index": 65, 
            "rating": "5", 
            "review": "Beautiful. Lovely fountain with music, up one end of the island. Nice to enjoy as part of an afternoon walking around the island."
        }, 
        {
            "index": 66, 
            "rating": "4", 
            "review": "Good fun. Lovely spot to sit and watch the fountain doing it's routine. Good for people watching as well. Lovely shade under the trees on a hot day."
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "Very interesting to watch. I really enjoy things like this and this did not disappoint. Not quite the Bellagio in Vegas but still very fun to watch,"
        }, 
        {
            "index": 68, 
            "rating": "4", 
            "review": "Relaxing. What a great way to relax.We bought an ice cream, took of our shoes and sat on the edge dangling our feet in the water. The light/ water shows were accompanied by a broad range of music so all ages and nationalities can enjoy and best of all - it was free :)"
        }, 
        {
            "index": 69, 
            "rating": "4", 
            "review": "A delightful sight on Margaret Island. The fountain dances and moves continuously with one surprise after the other. Around the fountain is a moat of water in which you can dangle feet while enjoying the fountain show."
        }, 
        {
            "index": 70, 
            "rating": "4", 
            "review": "Worth it. We got to know about this place last minute and we had to rush for it. 15 minutes from our hotel and totally worth it. One of its kind. Starts at 21:00 for about an hour."
        }, 
        {
            "index": 71, 
            "rating": "5", 
            "review": "Absolutely Fascinating. We must have spent close to an hour just watching the different combinations of fountains that this wonderful place has. My particular favourite was the rifle shots, where a sharp bang heralds a shot of water thrown high in the air. It doesn't seem to repeat, so you can watch it for as long as you like."
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "Fantastic show. Loved the fountain show at night. We were able to get seats eventually which made it much more comfortable to watch the whole thing; I'd recommend getting there early. The lights and music worked really well together. There was an eclectic mix of songs, which was fun. A fun and relaxing show, easy to get to the park even in the evening via public transport - brilliant."
        }, 
        {
            "index": 73, 
            "rating": "4", 
            "review": "Kids loved it. It's located at the start of Margaret Island as soon as you walk off the bridge. Nice selection of music played every hour. The kids loved it well actually everyone did."
        }, 
        {
            "index": 74, 
            "rating": "5", 
            "review": "Possibly the best thing on Margaret Island. I absolutely loved this fountain! I spent some time on the island, but most was spent by the fountain! I loved the music and the water shows and what I loved more was that around the fountain there is like a well around the fountain so you can sit really close to the fountain with your feet in the run off water! perfect cool down! also the people are so happy! at one moment Frozen \"let it go\" song came on and people started singing! haha! Brilliant!"
        }, 
        {
            "index": 75, 
            "rating": "5", 
            "review": "Relax. Located on Margaret Island close to city centre, the show starts at every hour.The island is also fantastic to visit by foot or bicycle."
        }, 
        {
            "index": 76, 
            "rating": "5", 
            "review": "Brilliant!. Dancing waterfountain on Margaret Island to various pieces of music - was just fab! Lasted about 20 minutes. Worth a watch"
        }, 
        {
            "index": 77, 
            "rating": "4", 
            "review": "Stunning waterfalls to music!. Very cool sitting on the edge of the water watching stunning waterfalls cascade to music! Possibly went on a bit too long though..."
        }, 
        {
            "index": 78, 
            "rating": "4", 
            "review": "The best place to spend a sunny morning in Budapest. We went in the Marg. Island early in the morning. We took a seat and we have enjoyed our coffee watching the amazing water-dance of the music fountain listening to classical music. Great experience."
        }, 
        {
            "index": 79, 
            "rating": "4", 
            "review": "Beautiful at night.. An hour long show which is free. It is very impressive at night when all the coloured lights are on. Not crowded either so a great view."
        }, 
        {
            "index": 80, 
            "rating": "5", 
            "review": "Never miss this place !. Early afternoon. When it is not to hot.... Visit this place ! Take some good pictures ! Close to Margarita Bridge. A healthy promenade from Pest !"
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "Wow. You HAVE to visit this if you're in Budapest in Summer. It dances in time to music. Fabulous choreography. Seems to be on the hour. We fell upon it by chance and were totally mesmerised. We listened to 'Feeling Good' and another popular song. Feel-good factor of 10!"
        }, 
        {
            "index": 82, 
            "rating": "5", 
            "review": "water dancing to music. just as good as disney but you don't have to pay to watch it . Excellent to sit and watch on a hot sunny day"
        }, 
        {
            "index": 83, 
            "rating": "5", 
            "review": "Refreshing. A good place to relax, refresh, listen to music, spend some time after sightseeing in a noisy city. There are some nice cafes and pathways nearby."
        }, 
        {
            "index": 84, 
            "rating": "5", 
            "review": "Relax and enjoy. As soon as you get into the park, on Margaret Island you will find lots of people waiting for it and it is worth it. Every hour and for 15-20min the fountain gives its best performance, sit under a tree and enjoy. Free, relaxing and groovy!"
        }, 
        {
            "index": 85, 
            "rating": "5", 
            "review": "Fun and a lovely way to relax. I loved loved loved seeing the musical fountain. We had done a lot of walking so this was a perfect way to sit down, buy an ice cream and enjoy the show!"
        }, 
        {
            "index": 86, 
            "rating": "5", 
            "review": "Stupenda !. Don't miss this spectacular and unusual show. Just go on the island, take a seat next to the fountain and wait for the next music and water concert.\nDa non perdere !"
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "Great. One of the coolest things to see in Budapest. Combined with the fact it's free makes it truly a must-see.\nLocated at the near end of the island when you come via the bridge.\nGreat place to relax and unwind, while enjoying the great show which this fountain brings.\nHighly recommended."
        }, 
        {
            "index": 88, 
            "rating": "5", 
            "review": "Free spectacle. Probably best time to catch is the 9 pm display when it goes through the full 45 minute or so cycle of illuminations and music ranging from classical through to Beatles, Dire Straits and George Ezra. Good chilled out way to end your day."
        }, 
        {
            "index": 89, 
            "rating": "5", 
            "review": "The fountain plays music. I loved this fountain - and you can even sit down and put your feet in there. It is worth a visit and to get there we crossed the bridge over the Danube onto the island."
        }, 
        {
            "index": 90, 
            "rating": "5", 
            "review": "Relax. You can find many benches to sit and relax by the fountains in Budapest. It is safe to sit and relax there with many families and people. Plus there is wifi there."
        }, 
        {
            "index": 91, 
            "rating": "5", 
            "review": "Absolutely beautiful . The fountain is such a great attraction to take the family to. At certain times of the day (6pm and 9pm, not certain of the other times) a light, water and music performance takes place and it is beautiful! A mix between well known songs (Budapest by George Ezra) and classical. It's truely stunning"
        }, 
        {
            "index": 92, 
            "rating": "5", 
            "review": "Mesmerizing and unmissable. DO NOT LEAVE BUDAPEST IF YOU HAVEN'T DONE THIS!It was honestly one of the most beautiful displays I've seen in my travels. I was so emotional I nearly cried. Truly a beautiful show. The lights, the water and the music were all incredibly beautiful.I recommend this to everyone! We went at sundown and it was one of the best things we could've done after a very busy day."
        }, 
        {
            "index": 93, 
            "rating": "5", 
            "review": "Excellent place to relax. A great way to wind down after a long day. On the hour, every hour in the evening, the fountains and music combine to enable one to forget that they are in the middle of a vibrant European Capital!"
        }, 
        {
            "index": 94, 
            "rating": "5", 
            "review": "Great spot for a break!. We sat down and put our feet in (like many others) after a long day of walking! The fountain is big and a nice setting for a little break :-)"
        }, 
        {
            "index": 95, 
            "rating": "5", 
            "review": "worth to relax and calm their when you visit the Margaret island.. The first thing to see when you go to Margaret island is that fountain. Relax their, take a video and see the beautiful flowers."
        }, 
        {
            "index": 96, 
            "rating": "5", 
            "review": "Beautiful . 10 minutes from the closest public transport (numbers 4,6)I went because my girlfriend wanted to, but i enjoyed itIt a beautiful lighted fountain. Best to see by night I was here at 21.30 (august) and still played it"
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "Really nice treat. I visited this fountain on Margaret Island and really enjoyed it. I visited at night with friends and thought it was quite special."
        }, 
        {
            "index": 98, 
            "rating": "4", 
            "review": "Fun!. Myself and my boyfriend really enjoyed the 9pm musical fountain display. The choice of songs could have been a bit better (but I guess that is down to opinion). However, the show put myself and my boyfriend in a very good mood before heading out to the ruin bars!"
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "Great for a sunny day. Loved the fountain and the park that is on the island. This is a great place to take a family picnic for an afternoon, wander the island, see the Danube, etc. You can rent bikes, jog, or just sit in the park and watch the fountain. This wouldn't be a place to go in the colder months but the summer is perfect."
        }, 
        {
            "index": 100, 
            "rating": "5", 
            "review": "Fountain. Such a nice thing to do on a hot day! Nice to take a break and put your feet in the water and watch the show, would recommend to anyone visiting Budapest!"
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "Really nice music-water performance. The fountain has a nice music show on every hour. Really cheered us up on a hot day. You can even buy drinks from the nearby restaurant and sit by the fountain and admire the show."
        }, 
        {
            "index": 102, 
            "rating": "5", 
            "review": "Water Music. Nothing to do with Handel, but this fountain is really nice and it merits a full vote. The only problem is the insufficient number of sit places in a good shadow, but if you arrive on time it is easier to find a seat"
        }, 
        {
            "index": 103, 
            "rating": "5", 
            "review": "Greatest fountain I've seen. I've never seen anything like that before. The fountain is great and the water games going with the music are one of the great things to see in BP."
        }, 
        {
            "index": 104, 
            "rating": "3", 
            "review": " . This was just as you get into the main park area of Margaret Island it was a hot day and there were loads of people sat around drink water, beers and the kids with ice creams this listing to music. The fountains weren't in time with the music but it was nice to watch and listen to the music, we didn't stay more than ten mins as it was too hot, but a great fountain nice to get a bit of spray off it to keep us cool."
        }, 
        {
            "index": 105, 
            "rating": "5", 
            "review": "A must to see at night. The fountain is a must see as the water jets are in sync will amplified music especially at night as the jets are combined with a wonderful light show, giving the impression of a firework display."
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "Mesmerising. Excellent way to spend a half hour. The music is great and fits with the water fountain. Lots of different kind of music and plenty seating. Children really,love it and you van sit round the edge and dip your feet in the waters edge if you are hot!"
        }, 
        {
            "index": 107, 
            "rating": "4", 
            "review": "Good fun. We rented bikes in the park an accidentally came across the music fountain, and we stopped to enjoy it for a while. Good fun!"
        }, 
        {
            "index": 108, 
            "rating": "5", 
            "review": "Fantastic. Just go and enjoy. Nothing more to be said other than it was great fun and a highlight of what was a fantastic 4 days."
        }, 
        {
            "index": 109, 
            "rating": "5", 
            "review": "Fountain dancing to music!. We had been having a very busy time visiting Budapest and it was really nice to just sit and relax a while and watch the fountain dance to the music, we could have sat for hours here. You can also cool off by putting your feet in the outer part of the fountain."
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "Awesome........ What a wonderful experience It was a true magical event.Liquid fireworks.Dip you feet on a hot day and enjoy the moment.Bring your family"
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "Beautiful evening show.. The whole island is a great place to walk, bike run, etc.There are a few short shows with music at the fountain but the best time to see it is at 21:00 (9pm). The show lasts for an hour and is really nice - broad variety of music (from classical to rock and roll). The fountain is lit up and it looks amazing."
        }, 
        {
            "index": 112, 
            "rating": "5", 
            "review": "Awesome show. The water show was very nice, and lasted a whole hour. I thought it was considerate of the tourists the variety of songs for the show. There was a great variety of music from many different countries as well as several Hungarian songs to introduce the culture. There were many annoying salespeople trying to sell light up objects that were very persistent even during the show that kept interrupting everything. I understand that they're just trying to make a living, but it would have been nice if they didn't stand in front of the fountain. Overall a great experience with lots of snack and beverage options around."
        }, 
        {
            "index": 113, 
            "rating": "4", 
            "review": "Musical fountain . When on Margaret Island you can't miss the musical fountain. The water dances in time to the music. Worth sitting and watching for a while. Very relaxing. Saw something similar in Las Vegas. As we got there at the fond of a very long day, I found this lovely fountain and music great respite"
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "brilliant show. You can sit in the shade and watch the show which is repeated at various times through the day.Each show seems to have a different theme but everyone is mesmerising. Its also great to see the reaction of all the children when one of their favourite songs is played. It is close to the entrance to the park and well worth a visit even if you are not able to explore the whole of the island."
        }, 
        {
            "index": 115, 
            "rating": "5", 
            "review": "what a shaw. In the heart of Margit island lies the musical fountain which performs it's show every hour to the sound of beautiful music - very nice and fun to watch"
        }, 
        {
            "index": 116, 
            "rating": "5", 
            "review": "Musical fountain with seeing. Musical fountain taken to new levels with super synced with a range of modern and classical music. Night show is best where the lights through the waters are at their best. In warm night sitting round the fountain with feet in the cool water is an unforgettable experience."
        }, 
        {
            "index": 117, 
            "rating": "5", 
            "review": "I love this place!. This is one of the peaks of my trip to Budapest. We were there twice because I just love it. It wasn't too crowded & we could always find the place around the fountain to cool down our feet while listening to music & generally just chill. Pack some drinks and come around 4-5pm and just enjoy the nature & surround by happy children and people."
        }, 
        {
            "index": 118, 
            "rating": "5", 
            "review": "Jog past. Had a job one evening and decided to go around Margaret island. Fountain with music - i think is a nice place to hang out in the evening."
        }, 
        {
            "index": 119, 
            "rating": "5", 
            "review": "Dont miss it.. Easy to go there with public transport or by foot, close to the Parlament. This show last 20 minutes ans is very nice, even more at night. Best of all, it is free for every body, very nice park to have a peaceful walk after the show."
        }, 
        {
            "index": 120, 
            "rating": "5", 
            "review": "Excellent. This is really worth staying for a while to watch when on Margaret Island. Easily accessible from Margaret Bridge"
        }, 
        {
            "index": 121, 
            "rating": "3", 
            "review": "Let down. Expected a bit more. Although visited in morning. Expect it would be better when lit up at night. Rest of the park is worth the visit."
        }, 
        {
            "index": 122, 
            "rating": "5", 
            "review": "Lovely. A nice walk around this park topped off by watching this intricate fountain display is a lovely way to spend a few hours of your day. Would definitely recommend."
        }, 
        {
            "index": 123, 
            "rating": "5", 
            "review": "Very peaceful . Great peaceful spot. Take a picnic blanket and some cold drinks and just chill in the park all day. Very easy to access and it's a nice walk from the centre."
        }, 
        {
            "index": 124, 
            "rating": "4", 
            "review": "Great activity. Really enjoyed this fountain. We were on our way to the outdoor pools on the island and stopped here for a quick ice cream. It operates every hour for the first 15-20 minutes."
        }, 
        {
            "index": 125, 
            "rating": "4", 
            "review": "Interseting to look and listen. Water and music together. Good to look at and to listen to. Various types of music including some for the kids from 'Frozen' If you're on the island stay and watch."
        }, 
        {
            "index": 126, 
            "rating": "5", 
            "review": "You will enjoy it.. Nice, renovated fountain on a beautiful island in the city center.\nBeautiful harmony between the music and the water."
        }, 
        {
            "index": 127, 
            "rating": "5", 
            "review": "Great fun!. This is a beautiful fountain and plays music at the hour every hour. The fountain moves in time to the music which is fun to watch! Definitely work a quick visit."
        }, 
        {
            "index": 128, 
            "rating": "5", 
            "review": "This is Budapest. Music fountain is a must! And a great place on a warm day. You can sit by the fountain and enjoy soaking your feet in a cold water while listening to Vivaldi and Dvorak."
        }, 
        {
            "index": 129, 
            "rating": "5", 
            "review": "Sweet child 'o mine . Epic fountain... A must see\nITS great in daytime but even better at Night even the lights go on as well.\nThe mixture of songs is great"
        }, 
        {
            "index": 130, 
            "rating": "4", 
            "review": "Different. Children - and adults - love to sit watching the Fountain, which comes in different tempos and patterns and ends in a firework like cascade!,"
        }, 
        {
            "index": 131, 
            "rating": "5", 
            "review": "Wonderful synchronised water feature.. Came upon this on my visit to Margaret Island which I got to by hired bicycle. Sitting in front of this very large fountain the different water jets were synchronise to music and built to a very impressive crescendo which can not fail to delight. What a wonderful surprise. Go see!!!"
        }, 
        {
            "index": 132, 
            "rating": "5", 
            "review": "Lovely on a sunny day. It was a lovely hot sunny day when we visited so getting a little damp in the breezy water was no problem. It is amazing the hight the water fountain gets to. A nice pattern emerges with sounds to match. Well worth a visit if in Margaret island."
        }, 
        {
            "index": 133, 
            "rating": "3", 
            "review": "The island has more to offer. I have been to Margarit Island and I enjoyed the nature and the walking bath. The fountain didn't attract me that much in between all this beauty."
        }, 
        {
            "index": 134, 
            "rating": "5", 
            "review": "Definitely worth a visit!. Not sure what to expect when visiting but I wasn't disappointed! Great tunes and fabulous display with no gimmicks or charges. Pure entertainment and definitely worth a visit :)"
        }, 
        {
            "index": 135, 
            "rating": "5", 
            "review": "Loved this!. Andre Bocelli music played when we walked by! The water soared in time to his lovely voice. Not only classical music is played and on a hot summer day the mist in my face was a welcome relief."
        }, 
        {
            "index": 136, 
            "rating": "5", 
            "review": "Good for summer time day out.. Slightly cheesy (in a good way) when they play the song \"Budapest\" by George Ezra and start the dancing fountain. In hot summer afternoon with the music and water splashing on you and an ice cream on hand. Good time indeed. Will recommend to have a look there. (Rent a bike, the park is huge). Some spot of the park gets free wifi."
        }, 
        {
            "index": 137, 
            "rating": "5", 
            "review": "Amazing. This was such a beautiful sight. Lovely music and so many children dancing along with the music when we were there"
        }, 
        {
            "index": 138, 
            "rating": "5", 
            "review": "Wow. Lovely to sit and watch. Very entertaining. A welcome break from walking to sit and listen in the beautiful Margrit Island"
        }, 
        {
            "index": 139, 
            "rating": "5", 
            "review": "Kids loved the fountain. The children loved watching the fountain when it went off at noon. The music and show lasted about 15 minutes."
        }, 
        {
            "index": 140, 
            "rating": "5", 
            "review": "Fantastic show. The fountain show at the end of everyday was fantastic, as the sun set the fantastic musical light and fountain show began. The show lasted nearly an hour and was worth the wait."
        }, 
        {
            "index": 141, 
            "rating": "5", 
            "review": "Strange but lovely. We happened upon the musical fountain on a sunny afternoon. It was great fun to watch the various fountains go up and down with the various pieces of music. Small children cooled down in the channel of water surrounding the main fountain and some people even danced the tango."
        }, 
        {
            "index": 142, 
            "rating": "5", 
            "review": "Unexpected find. I already wrote about this when reviewing Margaret's Island. This is such an entertaining venue that you have to plan to head over there after dark. Easy to get to by walking or by tram."
        }, 
        {
            "index": 143, 
            "rating": "5", 
            "review": "Nice Afternoon!. We spent the afternoon here. Rented a cycle car and ended our time in front of this great fountain. Once the music starts playing the area gets packed. It was a nice break."
        }, 
        {
            "index": 144, 
            "rating": "5", 
            "review": "Amazing magical fountain. We absolutely loved this fountain! After seeing the reviews online, the main reason we went to Margaret Island was to see this music fountain. Every hour between 10am-9pm this fountain performs to music and is lit up. We went in the evening so saw the 7pm and 8pm show and it was beautiful with the sun setting too. These 2 shows had different music . There are lots of seats around the fountain so you can relax and watch. It's difficult to describe but it's a bit like watching fireworks."
        }, 
        {
            "index": 145, 
            "rating": "5", 
            "review": "Water choreography. It is quite entertaining and kind of cute to see all happening in sync, don't get to distracted by making videos! The fountain is mostly enjoyed by being present ;)"
        }, 
        {
            "index": 146, 
            "rating": "4", 
            "review": "Enjoyable!. If you make a trip to Margaret Island, then do make time to sit and enjoy the musical fountain (check the timings beforehand to be sure to catch it!) .. There are many free chairs so you can sit around - perhaps have an ice cream or a snack - and enjoy the fountain's performance!"
        }, 
        {
            "index": 147, 
            "rating": "5", 
            "review": "Lovely. We were there on beautiful day. The park was busy bot not rammed. Children enjoying the fountain which was so much fun. All cities should have one. Enjoyable afternoon listening to the music"
        }, 
        {
            "index": 148, 
            "rating": "3", 
            "review": "wonderful on a hot day. Cool off and joining the locals. Sit around on the edge and dangle your feet in the refreshing water while watching the water jets dance."
        }, 
        {
            "index": 149, 
            "rating": "5", 
            "review": "Hit all the right notes. Definitely worth a trip to Margaret Island just for this. Dipping your toes in the water, watching water displays perfectly set to a great variety of songs and it didn't cost a single Forint! So good we came back again a couple days later."
        }, 
        {
            "index": 150, 
            "rating": "5", 
            "review": "Terrific. Go and sit and enjoy for free. Water jumping around to music. Plenty of seats. The water is very cleaverly done."
        }, 
        {
            "index": 151, 
            "rating": "5", 
            "review": "Evening concert. The fountains on Margaret Island are stunning. There are several performances during the day evening where the fountains are lit up and 'dance' in time to music played over speakers. We went twice to the 9pm show, very well attended by locals and tourists alike. Take a picnic, bottle of wine, sit back and enjoy."
        }, 
        {
            "index": 152, 
            "rating": "5", 
            "review": "Unusual. Not actually music but more percussion. The water makes a rhythm as the display of the fountains changes - very unusual. Probably not worth going just for this but Margaret Island is s strong recommend from me."
        }, 
        {
            "index": 153, 
            "rating": "5", 
            "review": "Lovely idea. delightful with the lights and music in the evening lots of people enjoy the ambiance and sounds of the fountain"
        }, 
        {
            "index": 154, 
            "rating": "5", 
            "review": "Absolutly Brilliant, do not miss it. Do not miss this, it is on St Margaret's Island, and on a sunny day it is beautiful to sit, eat an ice cream, (from the stall nearby) listen to the variety of music and watch the fountains move in time with the beat, we have been twice on two trips, and if we go again we will go a third time"
        }, 
        {
            "index": 155, 
            "rating": "4", 
            "review": "Cute fountain. Cute fountain on a nice island to stop by. Lots of chairs and benches around the fountain to take a break from walking. They had little carts to rent as well, which we were unable to do as we stopped by too late, but it seemed nice."
        }, 
        {
            "index": 156, 
            "rating": "5", 
            "review": "As fountains go this is pretty great. This is free to access and on a sunny evening it is a lovely place to walk to. The fountain seemed to be on constantly but on the hour the fountain jets were synchronised to music for a 15 minute display."
        }, 
        {
            "index": 157, 
            "rating": "5", 
            "review": "Yes, I know they are a bit corny. However I loved them. Plenty of seating areas to sit in sun or shade and enjoy the music and fountain display."
        }, 
        {
            "index": 158, 
            "rating": "5", 
            "review": "Wonderful water dance. Music plays every hour so be sure to get there on time. You'll see wonderful water dances in the air. It's like fireworks but with water."
        }, 
        {
            "index": 159, 
            "rating": "4", 
            "review": "Great spot on a hot day. Interesting varied patterns emirate from the powered fountains, with music every hour. A very relaxing spot that could while away the time under the cover of many large trees on beautiful Margaret Island."
        }, 
        {
            "index": 160, 
            "rating": "4", 
            "review": "Fun to experience. The fountain goes every hour on the hour to a mix of pop and classical music. It's particularly fun on a hot day, as children can bathe and play in the front part of the fountain."
        }, 
        {
            "index": 161, 
            "rating": "5", 
            "review": "Absolutely beautiful. We were strolling through the park when we heard music, we turned the corner and saw a fountain \"dancing\" in time to music, it was like a wet firework display, very refreshing as it was a hot day, there were plenty of chairs, both in and out of the shade to sit and enjoy this breathtakingly display."
        }, 
        {
            "index": 162, 
            "rating": "5", 
            "review": "Well worth a visit. Margaret Island is 15 minutes walk from Parliament and a car free oasis in Budapest. Each end of the island has a musical fountain that performs every hour for 20 - 30 minutes. There is a wide selection of music from classical to rock and everything in-between, including a longer show at 9 pm at night.The fountain is surrounded by seating so you can relax and take in the spectacle. The fountains are stunning in daytime, judging by the video footage on the web it is even better at night and that is what we plan to see next trip. Well worth a visit as is Margaret Island."
        }, 
        {
            "index": 163, 
            "rating": "4", 
            "review": "Very clever!. We just stopped and stared with amazement. Really clever fountain on Margaret Island. Well worth seeing!"
        }, 
        {
            "index": 164, 
            "rating": "5", 
            "review": "A magnificent spectacle!!!. The spectacle of the fountain's water dancing at the music sound at the entrance of Margaret Island is really magnificent. There are several places around the fountain on which visitors can sit and enjoy it. It must be more spectacular at night when the waters are lighted."
        }, 
        {
            "index": 165, 
            "rating": "5", 
            "review": "Really pretty and romantic!. I had a chance to view this fountain when I visited Margit Island to ride a bicycle in the afternoon! It was really pretty and could enjoy some really good music too! :)"
        }, 
        {
            "index": 166, 
            "rating": "5", 
            "review": "Real beauty in the night. We were looking the show in the night, wery attractive and interesting. You may listen as classic as modern music and enjoy the fontain"
        }, 
        {
            "index": 167, 
            "rating": "5", 
            "review": "Lovely. Well planned out with plenty of seats around the fountain be warned these seats do tend to fill up when the music starts but not a problem as vast grassed areas in the sun and shade to sit.Peaceful and relaxing so much so my other half fell asleep ;-)"
        }, 
        {
            "index": 168, 
            "rating": "4", 
            "review": "An expected surprise . We stumbled across this musical fountain when visiting Margret island, with seats situated around the fountain in the sunshine it was great! We could have stayed for an hour the music changes throughout the day, it's just relaxing and enjoyable."
        }, 
        {
            "index": 169, 
            "rating": "4", 
            "review": "free and fun. This fountain displays lots of water acrobatics constantly but every hour on the hour it plays music- anything from children singing to Vivaldi and show music"
        }, 
        {
            "index": 170, 
            "rating": "3", 
            "review": "nice. it should be on in the evening, however, I think they maintain the fountain in the day time. i was luck to view the fountain with music."
        }, 
        {
            "index": 171, 
            "rating": "5", 
            "review": "Beautiful dancing fountain . We visited Margaret Island during our short stay in Budapest and the Music Fountain is one of our highlights. Yes, this might only be a fountain but it's more spectacular then anything I've seen so far. And once the music started, all of a sudden, and the water shot up in all sort of waves in rhythm to the music, I was really impressed.In the first round they played rock & roll, like the Beatles and Rolling Stones. About an hour later they played slow music, and I have to admit that once they played \"Time to say goodbye\" with Andrea Bocelli, I got tears in my eyes... it may sound lije a clique, but it was soooo beautiful. In the third round (yes, we stayed for around 3 hours) they played classical music. I also really liked the benches around the fountain. Each is for one person and are scattered around, some side by side, but others opposite each others. Something really different. And people danced to the music and dipped their toes into the water - simply a great place to hang out and meet with locals."
        }, 
        {
            "index": 172, 
            "rating": "5", 
            "review": "Amazing and Entertaining. Decent sound system (could be improved) synchronized to beautiful classical music. Easy to listen and watch....a real delight!"
        }, 
        {
            "index": 173, 
            "rating": "4", 
            "review": "Lovely place to visit day and night. The music fountain is a real gem on Margaret Island. On nice days it's lovely to join in and dip your feet in the fountain listening to the music and fountain display. At night it's amazing when lit up and a lovely place to watch having a picnic on a lovely evening."
        }, 
        {
            "index": 174, 
            "rating": "3", 
            "review": "GoMargaret Island. So glad we got off the day cruise boat to see Margaret Island. You can't do that on a dinner cruise. This was the most fun my daughter and I had in Budapest. Make sure you don't take the last day cruise or no one can pick you up on the return trip. We rented bicycles and had a very affordable casual lunch. Not to be missed. The locals are all there!"
        }, 
        {
            "index": 175, 
            "rating": "5", 
            "review": "A MUST SEE. This is on margarget island and is a must see....the shows seemed to be about 1x per hour but worth waiting around for!!! So much fun"
        }, 
        {
            "index": 176, 
            "rating": "4", 
            "review": "Simpelt beautiful!. I Used the fountain as a surprise for my love! Although she is a woman from Budapest, she never visited this place! The Margitsziget yes, but not the fountain.The repertoire was recently renewed and they combined it well with the choreography of the fountain water!A wonderful oasis in the middle of the Danube! By the way... The nine o'clock show is to prefer because the sun is down :-)"
        }, 
        {
            "index": 177, 
            "rating": "4", 
            "review": "Surprise. We sat down to eat an ice cream and suddenly the music started and the fountains danced. Really enjoyed the experience."
        }, 
        {
            "index": 178, 
            "rating": "5", 
            "review": "Absolutely stunning. I love the way it makes people feel so happy, watching the fountain along with the music and people dancing."
        }, 
        {
            "index": 179, 
            "rating": "5", 
            "review": "Well worth a visit.. We went to Margaret Island on a lovely sunny day. We sat by the fountain and the music began. The water moves in time to the music and is quite spectacular and it' makes everyone smile. Depending on the breeze you might get a little spray but this just adds to the fun."
        }, 
        {
            "index": 180, 
            "rating": "5", 
            "review": "Nice and relaxing. Good for relaxing from the day's action. Sit and enjoy the music and fountain show.Times for the show are posted next to the fountain. I advise arriving when there is not too much sun. The light show with the water will be better visible when it's darker."
        }, 
        {
            "index": 181, 
            "rating": "5", 
            "review": "Mesmerizing. Margaret Island in general is absolutely lovely; rent a bike and pedal around. The fountain is just one of the great attractions; get away from the bustle of the city for a few hours and take in the scenery."
        }, 
        {
            "index": 182, 
            "rating": "5", 
            "review": "Amazing color show. We loved the fountain show! It was just about sunset and we walked down to wait for the water show. When the clock hit 9 the amazing dance of water started! It was worth watching every minute! We loved this attraction it is definetly worth visiting!"
        }, 
        {
            "index": 183, 
            "rating": "5", 
            "review": "interesting ...... Reminds me of the waltzing waters in Aviemore Scotland many years ago ....lovely touch in a beautiful park"
        }, 
        {
            "index": 184, 
            "rating": "5", 
            "review": "Dancing water Fountain. We loved walking around the Island and seeing all the sights but this in particular was lovely to watch and listen to."
        }, 
        {
            "index": 185, 
            "rating": "5", 
            "review": "What a lovely surprise!. We were on our way to Palatinus spa and all of a sudden we saw this fountain. Far away it looked like an ordinary fountain, until I saw that something was going on... then the music started! It's like fireworks, but with water! I could have been watching it for hours!"
        }, 
        {
            "index": 186, 
            "rating": "5", 
            "review": "Enjoy!. The fountains move in time to a variety of Hungarian and international music-very enjoyable and worth seeing."
        }, 
        {
            "index": 187, 
            "rating": "5", 
            "review": "Love the dancing fountain!. The fountains \"dance\" to a selection of songs every hour, on the hour, throughout the day. Very fun place to relax before exploring the rest of the island!"
        }, 
        {
            "index": 188, 
            "rating": "4", 
            "review": "Water delight. Thanks to our Zebra segway tour the previous day we discovered this little gem & decided to bring my mother to see the show with her friend. Because of their age we decided to travel to the island by public transport to keep the walking to the minimum. As UK pensioners my mother & friend could travel for free, my partner & I had Budapest cards which also have us free travel. The 261 bus goes on to the island & stops near the fountain. The 261 bus connects with No 2 tram close to the Margaret bridge. The fountain is entertaining when the music show is on which appears to be every hour for approx 15mins. We also hired 1 of the electric cars to explore the island, €15 for an hour which alloward us to discover the beautiful Japanese water garden at the other end of the island, but found the ice creams expensive at €5 each. See if you can discover how the island got it's name or why the locals call it Rabbit Island ?"
        }, 
        {
            "index": 189, 
            "rating": "5", 
            "review": "Music fountain. It's really worth a visit. If you like running, put on your trainers and walk around the island . On a hot spring or summer day, it's cool and fresh. You can hire different bikes."
        }, 
        {
            "index": 190, 
            "rating": "2", 
            "review": "Summer-time only :-(. Closed. Only operates May-October.This information would have been very helpful, but alas, despite searching, I found no opening times listed. Travelled across the city to watch this fountain only to find complete darkness and wire fences. Only when I asked a local walking their dog did I discover it's a purely seasonal attraction. Very disappointed. There's a lovely view of the Danube from the bridge though, which made it not such a wasted journey."
        }, 
        {
            "index": 191, 
            "rating": "4", 
            "review": "Nice Fountain. We went to Margaret Island and happened to be there while it was \"playing\". There didn't seem to be any sync between the water and the music, which I think is a missed opportunity."
        }, 
        {
            "index": 192, 
            "rating": "3", 
            "review": "Nothing special. It plays music in every hour of the day. At night it has some nicely coloured lights. Located in Margaret island. Make a bypass if you are in the near, but nothing special..."
        }, 
        {
            "index": 193, 
            "rating": "4", 
            "review": "Great playlist!. More of the music fountains have a classic playlist, well, this one has modern great hits, at least when I was there. There are some chairs, around so you can take a seat and enjoy the show."
        }, 
        {
            "index": 194, 
            "rating": "5", 
            "review": "Very nice and relaxing!. When there is music it's very nice to sit and listen.\nIt's better to check at what time there is music before you come!"
        }, 
        {
            "index": 195, 
            "rating": "4", 
            "review": "Fun for the kids. One of the many things to do on St Margaret's Island is to sit down on a bench, listen to the musical fountain and watch the spurts of water. Fun times for kids under 8."
        }, 
        {
            "index": 196, 
            "rating": "5", 
            "review": "Nice stop along the way. We arrived to the fountain after a long walk to the island. There were a lot of seats and plenty of shade around the fountain. The funniest thing was, it played modern music, I was expecting traditional Hungarian music -still great! Would recommend."
        }, 
        {
            "index": 197, 
            "rating": "5", 
            "review": "Dance with the fountain. On our last day in Budapest, we timed a visit to Margaret island perfectly...sun, hired tandem and tasty burger from a cute stand followed by relaxing in front of the fountain only to find it's a 'music fountain' where the fountain dances in time with the music. It's not Las Vegas, a lot more cosmopolitan Central European vibe - you can sit here forever (as long as the storms hold off!)"
        }, 
        {
            "index": 198, 
            "rating": "4", 
            "review": "Musical experience every hour. The fountain plays 2-4 songs every hour on the hour. At the end of the day, all songs are played.You can sit around the fountain on available seat. They play everything from classic to rock."
        }, 
        {
            "index": 199, 
            "rating": "5", 
            "review": "Amazing - could spend the entire day here. A true gem neseled in the heart of the city at the entrance to the citys main island is he musical fountain with is so mesmerizing that hours can be lost here. It a great people watching spot and the great meeting point before exploring the rest of the Island."
        }, 
        {
            "index": 200, 
            "rating": "3", 
            "review": "Not worth a visit off season. We went in April but no fountain!p so would be worth checking if on before you set off. All under maintenance . Still, the island itself worth a visit!"
        }, 
        {
            "index": 201, 
            "rating": "3", 
            "review": "was off when we arrived, dissapointed.. when we arrived on the island we looked everywhere to find the fountain and when we eventually did it was off with no reason to why it was and when it would be put back on."
        }, 
        {
            "index": 202, 
            "rating": "5", 
            "review": "Good surprise. At the entrance of the park, you have this musical fountain. I didn't know about it before seeing it, so it was a nice surprise. I don't know how often it goes but make sure you know the next show to attend. You have bicycles you can rent to go around the IJsland which is rather big. Go there on a sunny day otherwise it wouldn't be as nice. I would suggest you go there on your third day."
        }, 
        {
            "index": 203, 
            "rating": "3", 
            "review": "Music fountain with a Hungarian touch.. This music fountain is located on the Margaret Island. The fountain and the whole area around were built/rennovated quite recently. As a result, it is supposed to be good, but it is not.The first problem is brand-new seats that are attached to the ground. The fact that these seats are immobile could be ok if they wouldn't be randomly placed eveywhere. If you have a company of 5 people, then you will need to sit 10 meters away from each other. Most likely you will just end up sitting on the ground.Another problem is the fountain itself. Even that it is new, it is already partially broken. Some tubes don't throw water making the whole image of jumping waters wrong. Finally, the selection of music is simply horrible. Most of the songs sound like Hungarian music of 90s even that they might be new. It would be nicer if the music would be more international. At least, the music could be written by famous Hungarian composers that are known abroad but not that bad taste!All in all, it might be a great place for Hungarian standards. However, we (a couple) doubt that it can be very attractive for people from other countries."
        }, 
        {
            "index": 204, 
            "rating": "3", 
            "review": "In march no attraction. Unfortunately as it was winter we could not hear music and see fountain. Of course we have seen the place , but not filled with water, so that means we must come again in summer...."
        }, 
        {
            "index": 205, 
            "rating": "5", 
            "review": "Great to see beauty free to the world. As part of our bike ride through Margaret Island, we really enjoyed watching and listening to the Music Fountain - it's enchanting and hypnotic, a creative masterpiece."
        }, 
        {
            "index": 206, 
            "rating": "5", 
            "review": "A must stop on the island!. Do not miss the fountain while relaxing on the island! Just sit back and relax, soak your feet in and enjoy!"
        }, 
        {
            "index": 207, 
            "rating": "5", 
            "review": "Simple pleasures. We got there about 1145 and grabbed a good seat facing away from the sun then watched the fountains 'dance' to a selection of tunes for about 15 minutes then cycle round the island. Great fun and simple pleasures to enjoy over a couple of hours."
        }, 
        {
            "index": 208, 
            "rating": "2", 
            "review": "No music fountain in the winter. We came to the island to see the music fountain, but was told that there was no music fountain in the winter. Very disappointed indeed."
        }, 
        {
            "index": 209, 
            "rating": "4", 
            "review": "Margaret Island Music Fountain. We took a self-driving bicycle cart trip around the island. We were delighted when we found this fountain! It was entertaining to listen to the music from the fountain. It is an excellent spot for people watching."
        }, 
        {
            "index": 210, 
            "rating": "5", 
            "review": "Great program for a hot summer night. It operates from May to end October between 11 am to 10 pm daily. The music blocks start hourly with different programs (the first block includes tunes for children). During the summer months, it is a very popular attraction on Margaret Island. Easy to reach by trams 4 or 6 as these ones stop at the island entrance on Margaret Bridge and the fountain is a few minutes walk from here. The evening music and light show starts at 9 pm and lasts an hour, while the music blocks during daytime are much shorter. After a long day, spent with sightseeing, it is good fun to enjoy the cool air beside colourful water jets dancing for the rythm of beautiful music ...highly recommended!"
        }, 
        {
            "index": 211, 
            "rating": "5", 
            "review": "Light and Night. We went here twice during our short trip and it was great experience every time. First we were lucky as we headed here without any knowledge when the performance starts and what is it all about, but we have arrived just a minute before the start and that was nice. Sitting around, watching water streams in different colours dancing round the fountain. It was interesting how many people were attracted as well as we were. The second time we were wandering round the island and when it was getting colder, we decided to leave it and went along a stand, bought a mulled wine a had some rest by the fountain and then suddenly the performance started. It was nice as the songs were different from last time… I think everyone will enjoy this not so rigorous attraction."
        }, 
        {
            "index": 212, 
            "rating": "5", 
            "review": "Awesome. I didn't even know about this fountain before I saw it and wow, it was big and beautiful. The place wasn't even crowded so I really recommend this if you are somewhere near."
        }, 
        {
            "index": 213, 
            "rating": "5", 
            "review": "Water Delight. A highlight of my visit to Margaret Island was to see the water fountain display suddenly 'appear' as I sat relaxing with a cup of coffee. It went for a good 20 minutes to the delight of visitors and locals alike."
        }, 
        {
            "index": 214, 
            "rating": "5", 
            "review": "Best music fountain. Newly renovated but Good fountain with really Heart soothing music.....visit in summer is advisable..."
        }, 
        {
            "index": 215, 
            "rating": "5", 
            "review": "Wonderful. We firstly visited by day and sat and watched the fountains perform to music. Good entertainment. Later that week we visited again after dark, that is when it is at its best. Absolutely superb light and sound show."
        }, 
        {
            "index": 216, 
            "rating": "5", 
            "review": "Romance on the Saint Margaret Island at Budapest. If you are visiting Budapest with your boyfriend or girlfriend and you are into romance, the Margaret Island is the first place you should visit, have a walk here, round the Island and finally visit the Music Fountain which is quite a nice visual and audio experience."
        }, 
        {
            "index": 217, 
            "rating": "5", 
            "review": "RELAXING AND ATTRACTING MANY PEOPLE. This was closed in November, but you can enjoy music for appr. 30 minutes, several times a day during the warm season. Traditional pop, opera is being played, there are many stools around this fountain and you can just relax and watch you fellow human beings sitting or dancing around the fountain."
        }, 
        {
            "index": 218, 
            "rating": "4", 
            "review": "Not much to see. My friend and I were a bit disappointed with the music fountain as it was not operating when we were there. There was no water shooting up and there wasn't any music. There was no one in the area to ask if the fountain only operated at certain times of the day, or if it even operated at all. Margaret Island is huge, so even though a lot of locals frequent Margaret Island, there was absolutely no one in this particular area of the park. We were here in 2009."
        }, 
        {
            "index": 219, 
            "rating": "5", 
            "review": "Music for the eye. Just walk to the Margaret Island and you just cannot miss this fountain. It was music for the eyes and ears! :-)"
        }, 
        {
            "index": 220, 
            "rating": "4", 
            "review": "Lovely place to sit and rest. Wait for the dancing fountains. Cheesy music but a great place to sit and people watch, or just to get respite from the sun in summer."
        }, 
        {
            "index": 221, 
            "rating": "4", 
            "review": "Good indeed. What a lovely way to relax and enjoy music. A must do and see whenever in Budapest. Easy to get there by tram as well and worth 30 minutes of your time.\nSo do plan for this stop as we enjoyed it and do recommend it."
        }, 
        {
            "index": 222, 
            "rating": "5", 
            "review": "Impressive and Romantic.. A must see for any trip to Budapest. Head down to Margaret Island (Tram stops directly on the Margaret Bridge) Take a stroll down towards the main roundabout on Margaret island and the Fountain is located directly behind the city bike parking station.On the hour the fountain displays a spectacular light, music and water display! The lights and water go along with the music! FANTASTIC."
        }, 
        {
            "index": 223, 
            "rating": "5", 
            "review": "It's so kitsch and so great!. This fountain is so much fun. You sit around it and every hour on the hour music will start playing and the water will be performing along with the music. The musical program changes every year. Personally, I prefer the classical pieces, but they're as likely to dig up Rolling Stones, Roy Orbison or other dated, rustic acts and dust them off (Pretty Woman danced by a fountain, anyone?). I've even heard a medley of horrible children's songs. Still, it's always fun.NOTE: If there are a lot of people present but still some seats left in the good middle section, don't give up your not-so-good seats and rush over there. This would be where the wind blows the water..."
        }, 
        {
            "index": 224, 
            "rating": "5", 
            "review": "A very special fountain. Located on the famous island called Margaret Island, it is one of the biggest attractions that the island has. I was fortunate that it was playing at the time I visited the place. A lot of young people, probably student from universities always gather up here and have fun."
        }, 
        {
            "index": 225, 
            "rating": "5", 
            "review": "Amazing place to chill out. Be there at full hour to enjoy the show! At 21.00 there's a complete playlist, which covers many different music styles. A good place to stop for some time when you visit Margaret Island"
        }, 
        {
            "index": 226, 
            "rating": "5", 
            "review": "one of the highlights of Budapest!. Take some time to escape from the noises of the city and stroll around on this carfree island. Wonderful fountain!"
        }, 
        {
            "index": 227, 
            "rating": "5", 
            "review": "Great Entertainment on a lovely Sunny Day !. One of the best part of the Island is this musical fountain. We spent good few hours lazing on the grass near by, listening to the melodious tunes played and the spectacular display of the water along with the music. People danced to the tunes near by, kids and grown ups gazed at the fountain for hours. Lovely feature and great part of the garden. You won't miss it, once you are in the Garden. Enjoy !!"
        }, 
        {
            "index": 228, 
            "rating": "5", 
            "review": "Lovely sounds. As part of our walking visit to the island we encountered the fountain. It was beautifully syncronised to the music and if it wasnt raining we would have happily sat by for hours."
        }, 
        {
            "index": 229, 
            "rating": "5", 
            "review": "Great Fun. Worth seeking out on a sunny day, we were there on a Sunday and the large crowds were enjoying the choreographed fountains, the classical music worked really well; Four Seasons, the Blue Danube but the pop music not as well."
        }, 
        {
            "index": 230, 
            "rating": "5", 
            "review": "Great suprise!. Good place to relax with music. It was playing +- 30 minutes. Near fountain are few chairs. Romantic place :) I recommend with glass of wine"
        }, 
        {
            "index": 231, 
            "rating": "5", 
            "review": "smile. nice ending/beginning of a Margaret island walk, listen to the music, watch the water, and people staring at it"
        }, 
        {
            "index": 232, 
            "rating": "4", 
            "review": "Worth a visit. We went at night, lovely dancing fountain, couples and families gathered to watch. We walked from the Sofitel at chain bridge, took about 30 minutes leisurely. Worth a visit but try and get there for the \"on the hour\" displays with music that lasted for 15 minutes."
        }, 
        {
            "index": 233, 
            "rating": "2", 
            "review": "Music fountain. Not that interesting; it's run electronically now and was only working for a few minutes on the hour."
        }, 
        {
            "index": 234, 
            "rating": "5", 
            "review": "Love love love!. Amazing! We sat for an hour just watching the colours change and water \"dance\" to different tunes, a magical experience!"
        }, 
        {
            "index": 235, 
            "rating": "5", 
            "review": "Musical Fountain on the island. A beautiful fountain. Around the well-kept area, lots of benches. You can spend the whole day. Quiet place. Near the entrance to the island by a bridge"
        }, 
        {
            "index": 236, 
            "rating": "4", 
            "review": "surprising find. Found this by accident whilst having a stroll over the bridge, its amazing to watch as the idea is quite simple, but I found it quite mesmerizing. Lots of people are drawn to it and just sit and watch and listen, very pleasant."
        }, 
        {
            "index": 237, 
            "rating": "5", 
            "review": "Fabulous and FREE. We are so glad we visited Margaret Park and the Music Fountain! It was relaxing and so entertaining that we did not want to leave. The fountain show varies significantly to a variety of music. We wish we could have also visited the lighted evening show as well. Budapest has numerous beautiful attractions, but this is a hidden gem that deserves a ranking in at least the top 15. And it is FREE!Margaret Park has a nice walking path, several gardens and food vendors making it a relaxing place in the city to stop while sight seeing. The Music Fountain is conveniently located at the main entrance but Margaret Park is worth a walk around. Highly recommend making the time to enjoy the Music Fountain in Margaret Park!"
        }, 
        {
            "index": 238, 
            "rating": "5", 
            "review": "WOW!. I wasn't sure about this Island when my friend suggested I go. (she is Hungarian and lives in Budapest) However, I had the morning to myself and I decided to go check it out. I spent the entire morning on the island and had a little picnic lunch. It is just beautiful. The history is interesting, the gardens are beautiful and the island overall is so well kept. It was amazing to believe that this little island is pretty much downtown and walkable. The musical fountain was a nice touch. The only problem is I would not suggest it on a rainy or cold day."
        }, 
        {
            "index": 239, 
            "rating": "5", 
            "review": "Brilliant find. Brilliant find and the light and music show that goes with it superb! Well worth a stroll down there after dark"
        }, 
        {
            "index": 240, 
            "rating": "5", 
            "review": "Loved this spot. We came across this by chance on our walk to Margaret Island. The fountain changes its pattern constantly and at certain times of the day to music . Great fun to watch!"
        }, 
        {
            "index": 241, 
            "rating": "5", 
            "review": "Perfect for a Summer day..A world away from the hustle and bustle of the city.. Margit Island is not just the Music Fountain which is delightful..It is the feeling that you are miles away from the city...There are places to eat ,Or take a picnic..In the evening when there are special events what can be better than a hamper of Hungarian food and a bottle of wine.. On many days special musical events (Take a look at the event guide)..Stroll , sit and enjoy the beach like river front..In the evenings it is a romantic place whether you are 18 or 80 ..I have lived here for 10 years and never tire of strolling accross the Margit bridge and then taking the steps down to this delightful venue...There is so much to do and places to see here in the capital but try to find time to take those steps down from the Margit Bridge...You will not be disappointed.."
        }, 
        {
            "index": 242, 
            "rating": "5", 
            "review": "Wonderful Fountain. Amazing fountain, go and see this! Lovely colours and well synchronized with the musical numbers they play to go along with it :)"
        }, 
        {
            "index": 243, 
            "rating": "4", 
            "review": "Well worth a visit. We went down to Margaret Island on our first day in Budapest and were really pleasantly surprised by the music fountain. We spent half an hour plus transfixed by the fountain spouting to the music - kids would love it..... It's one of those accidental discoveries that strangely became one of the memorable parts of our trip. The whole island is worth seeing but the fountain is a definite bonus!"
        }, 
        {
            "index": 244, 
            "rating": "4", 
            "review": "Well done. A little bit of the Bellagio in Las Vegas but more intimate and in a much nicer setting. This island is a beautiful place to stroll through and sitting down to watch the fountains in action is the topper. Different music from all over and well orchestrated. Lots of locals out for the show."
        }, 
        {
            "index": 245, 
            "rating": "5", 
            "review": "Lovely !!!!. Spent 10 minutes watching the fountain to music and everyone was so happy. Really lovely. Definitely worth a look"
        }, 
        {
            "index": 246, 
            "rating": "5", 
            "review": "lovely feature on Margaret island. really lovely attraction on Margaret Island, fantastic music working in time with the fountain jets, think it goes every 30 minutes"
        }, 
        {
            "index": 247, 
            "rating": "5", 
            "review": "Wonderful surprise. Happened upon the fountain by chance as we entered the island. Synchronised water fountain and wonderful music. Worth visiting for this alone. It was great to see how much those watching the 'show' really enjoyed the spectacle. It was a pity we didn't have time to visit at night, when I believe it's even more impressive."
        }, 
        {
            "index": 248, 
            "rating": "5", 
            "review": "entertaining. get there on the hour to listen and watch the show with different music every hour. very cleverly done"
        }, 
        {
            "index": 249, 
            "rating": "5", 
            "review": "Enchanting. Enchanting view & sound.I like the seen very much, you can hire a small car or bike to take a round in the island ."
        }, 
        {
            "index": 250, 
            "rating": "4", 
            "review": "nice in the summer. really lovely at night when its lit up!! nice atmosphere. go in the summer, in nice weather this is a lovely thing to visit."
        }, 
        {
            "index": 251, 
            "rating": "5", 
            "review": "Totally fascinating!!. A fascinating foundation that dances to classical music. It changes shapes, and delights whether you are very young or old."
        }, 
        {
            "index": 252, 
            "rating": "5", 
            "review": "Water laugh!. Kids, adults, grannies and pets will love this display.....it's great fun and the assortment of music makes you giggle."
        }, 
        {
            "index": 253, 
            "rating": "5", 
            "review": "Hidden Gem. Arrived just in time to see and listen to the fountains. They are very well managed and the timing with the music was brilliant. They were also very popular judging by the size of the audience."
        }, 
        {
            "index": 254, 
            "rating": "4", 
            "review": "A pleasant surprise when wandering around Margaret Island. We stumbled on the Music Fountain by accident and loved it. A very eclectic mix of songs (classical followed by the Beatles followed by more classical) and a great way to spend some time relaxing on the chairs dotted around the fountain. Very clever."
        }, 
        {
            "index": 255, 
            "rating": "5", 
            "review": "A pleasant half an hour. Dancing fountain to music. Just sit back and relax and listen to the music. Modern and classical. Not sure if fountains were actually in time with the music but a pleasant way to spend some time."
        }, 
        {
            "index": 256, 
            "rating": "5", 
            "review": "amazing!!!!. we loved it a lot and came back for few times to watch it and listen to the music with the lights. must see!"
        }, 
        {
            "index": 257, 
            "rating": "5", 
            "review": "Lovely. If you go to the island try to make sure you are there for the music fountain. It's a lovely way to spend a few minutes."
        }, 
        {
            "index": 258, 
            "rating": "5", 
            "review": "A very relaxing interlude in between all the sight-seeing - easy to get to by tram.. We spent an afternoon on Margaret Island (Margetsziget) and found the fountains close to the attractive memorial for the unification of Buda and Pest into one city.We knew of the fountains doing a dance to music but thought this was only a couple of times each day. In fact the fountains were dancing on the hour from 12 noon when we first arrived until 5pm when we left. We saw three of the performances - the final one being for children with Hungarian children's music. I understand that they continue after dark - which must be a great sight as others have reported here.The fountains are easy to reach by the tram which crosses Margit bridge and stops in the middle where you can find a slip road / path leading down from the bridge to the island. The fountains are behind a big roundabout (with the unification memorial in the middle). There are many seats around the fountain. It was delightful to sit in the warm sun and watch the waters dancing.We have been delighted with all we have seen in Budapest and this was one of the highlights."
        }, 
        {
            "index": 259, 
            "rating": "5", 
            "review": "Very suprising place.... it is the small version of Las Vegas....but very nice to rest, to dream and to listen. Small, but beautiful place to listen and to dream! Liked the place to stay for couple of minutes...."
        }, 
        {
            "index": 260, 
            "rating": "4", 
            "review": "A worthwhile diversion. We arrived just after a performance of the fountain had started. It was very good and held our attention throughout. I don't think that we've seen a fountain display as good as that anywhere else."
        }, 
        {
            "index": 261, 
            "rating": "5", 
            "review": "amazing and off the beaten path. This fountain danced in sync to a wide variety of modern and classical music numbers. Go at night, the fountain is lite up with different colors that really add to the experience."
        }, 
        {
            "index": 262, 
            "rating": "5", 
            "review": "Fun for all ages. went here at night at the end of a Danube dinner cruise. What a delightful surprise. It truly is magic!"
        }, 
        {
            "index": 263, 
            "rating": "5", 
            "review": "Great Experience. Margaret Island is a nice island you reach on boats from Buda on the Danube . Not just the fountain is nice (not in the same league as that in Dubai) but the entire island beckons for a picnic like time. Rent bikes, good fun, makes one realise how unfit one is"
        }, 
        {
            "index": 264, 
            "rating": "5", 
            "review": "Dancing fountains. These fountains located at the end of the slip road to Margaret Island just off Margaret Bridge are a must see. Take time out to relax and sit back and watch these fountains dance to music....magical."
        }, 
        {
            "index": 265, 
            "rating": "5", 
            "review": "Magic waters. Fantastic fountains, dancing waters to the fairytale music. Great for kids and adults alike.Plenty of \"ooohs\" and \"aaahs\" from the bystanders"
        }, 
        {
            "index": 266, 
            "rating": "5", 
            "review": "Beautiful. I enjoy so much this fountain like a ballet performance!!\nSo relaxing and pioneering ,worth the visit!!"
        }, 
        {
            "index": 267, 
            "rating": "4", 
            "review": "Hungarian love of Art & Music.. Constructed in memory of a famous Hungarian musician ( name don't remember ), it is simply the reflection of love of art & music by Hungarians. Unfortunately when we visited, couldn't witness live programme. Suggest check timings before visiting."
        }, 
        {
            "index": 268, 
            "rating": "5", 
            "review": "really cool. really nice the seating around the fountain are really confortable. p[peaceful environment and it is really cool to watch and listen to the fountain."
        }, 
        {
            "index": 269, 
            "rating": "5", 
            "review": "Water music - lovely. This is wonderful to watch. Everyone stops and enjoys. Margaret Island is very pleasant with restaurants and areas to jog if the desire takes you!"
        }, 
        {
            "index": 270, 
            "rating": "3", 
            "review": "music fountain margaret island. something different and quite entertaining. Missed dramatic music but listened to some children's music which was nice and the children were dancing to it."
        }, 
        {
            "index": 271, 
            "rating": "4", 
            "review": "musical fountain. The fountain water jets are sychronised with the music which makes it a entertaining time. There are 4 or 5 songs played on the hour during the day and early evening and there is a program placed near the fountain so you can see which songs will be played. The show goesmfor 10 to 15 minutes and itsmgood free entertainment for the family."
        }, 
        {
            "index": 272, 
            "rating": "5", 
            "review": "Colorful too. It is placed at the very beginning of the island so that you can't miss it. On top of music the colors change all of the time as soon as it gets dark enough."
        }, 
        {
            "index": 273, 
            "rating": "5", 
            "review": "Relax in the tranquility of Margaret Island. A lovely place to sit and watch the world go by on a hot (35C the day we went there) day. No traffic (except pubic buses), plenty of seats available, or sit at the edge of the fountain and dip your feet in the cooling water. Take a picnic or buy from the various stalls dotted around. It was just sooooooo goo to have a rest from the sightseeing for an hour or so!!"
        }, 
        {
            "index": 274, 
            "rating": "4", 
            "review": "lovely dancing fountains to great music. If you are on Margaret Island, then these are worth seeing dancing to a great selection of music. However not worth visiting the Island if the fountains are all you wish to see"
        }, 
        {
            "index": 275, 
            "rating": "5", 
            "review": "Fantastic experience. Wonderful experience and set in the grounds of the stunning Margaret Island, a day which we enjoyed very much!"
        }, 
        {
            "index": 276, 
            "rating": "5", 
            "review": "really entertaining. Just stumbled upon this treat, so good we went back to see it at night. A good mix of classical and popular music playing for quarter of an hour on the hour, with a full hour starting at 9pm. Well worth seeing after dark."
        }, 
        {
            "index": 277, 
            "rating": "5", 
            "review": "A delight. We loved this - could lhave watched it all day. The music was tasteful and not too loud, and the fountain really fascinating."
        }, 
        {
            "index": 278, 
            "rating": "5", 
            "review": "Worth a visit. A fun place to spend some time relaxing. Ideally visit early evening when the lights are added to the sound and dancing fountains. Fun and free on a very peaceful part of Budapest (traffic free)"
        }, 
        {
            "index": 279, 
            "rating": "5", 
            "review": "Magical & enchanting :-). Never enjoyed anything like the Music Fountain on Margaret Island. It will appeal to young & old alike :-) It completely lifted my spirits as I sat down and marveled at what a unique attraction it is. The sun shone brightly and the heat of day added to the magic. If visiting Margaret Island definitely stop here to absorb the magnificence of it. Absolutely top class!!!!"
        }, 
        {
            "index": 280, 
            "rating": "3", 
            "review": "when you are a margaret island take time to enjoy. Nice place nice stop in the middle of the dayOnly kids dance and fully enjoy the music it is amazing to see themthere is a small sign stating the schedule of the fountainat night you can see the lights play too"
        }, 
        {
            "index": 281, 
            "rating": "5", 
            "review": "Beautiful. Beautiful fountain in idyllic surroundings. We would highly recommend a visit due to it being one of Budapest's landmarks."
        }, 
        {
            "index": 282, 
            "rating": "4", 
            "review": "Relax max. After walking around the island, a great spot to stop and gather your breath before catching the boat back to Buda or Pest"
        }, 
        {
            "index": 283, 
            "rating": "3", 
            "review": "Music fountain Maragaret Island. Nice to visit when you are on the Island, they play four different songs almost every hour. you can relax at the fountain and then take a walk on the island"
        }, 
        {
            "index": 284, 
            "rating": "5", 
            "review": "Fabulous\". Amazing fountain that pulses and dances to varied mix of music. Shows on the hour from 12 noon and last 12 minutes"
        }, 
        {
            "index": 285, 
            "rating": "5", 
            "review": "It is what it says.. Lovely to watch, especially when music playing. Cleverly programmed and worth spending time watching."
        }, 
        {
            "index": 286, 
            "rating": "5", 
            "review": "quite and green, worth a walk to it to sit down and relax. Needless to say, the music fountain is on the Island that is off one of the bridges. Busy to get to. but once there, it is all clean and quite and that is different to the whole city\nlots of transport to hire, bicycles etc.\nit is the sports area there with football and running fields etc."
        }, 
        {
            "index": 287, 
            "rating": "5", 
            "review": "Great stop. Make sure you make this island a stop on one of your day trips. Very family friendly but also very romantic. Sit at the fountain with your feet in the fountain and enjoy being alive."
        }, 
        {
            "index": 288, 
            "rating": "5", 
            "review": "Don't miss this, especially in the summer!!! Great for kids. Awesome!!! There's a ring built into the outer edge of the fountain, and you can sit and soak your feet (or in my son's case, most of him) in the water. Visiting in August, this was SUCH a welcome stop and with kids, it just can't be beat. The music and water choreography was impressive, and to match it was in a park location with lots of trees for shade and ambience. We sat for about 45 minutes in this location, and my four-year-old stayed entertained during that time as well. The water is constantly moving and changing and the music starts every hour and lasts about 15 minutes."
        }, 
        {
            "index": 289, 
            "rating": "5", 
            "review": "Awesome . You could sit here all afternoon listening to the music and watching the fountain dance away, especially in the toasting hot sun. Loved it"
        }, 
        {
            "index": 290, 
            "rating": "5", 
            "review": "Margaret Island`s Spectacular Fountains. The Musical Fountains located at both the northern & southern ends are the most important spectacles on the Margaret island,my daily evening haunt ( Reviewed earlier).The northern end fountain is called the Bodor fountain which plays old Hungarian melodies every hour.While the southern one, after its many renovations has become more spectacular than any one in Europe.Its water surface exceeding thousands of square meters with a radius of 35 meters.It plays modern melodies from Rolling Stones likes & also classical music from Verdi,Brahms etc.There is also a grand program of light & water shows based on spectacular night & day video starting at 10 A M playing two pieces every hour.I used to visit every evening for their full repertoire played twice at 6 Pm & 9 PM.All pleasing & eye catching.Must visit the island."
        }, 
        {
            "index": 291, 
            "rating": "5", 
            "review": "Relaxing music in a beautiful setting. The Island really is very pleasant for an afternoon stroll, with plenty of options for a drink and snack. Then finish at the fountain close to the entrance from bridge and watch the fountain move to a wide selection of music. A nice way to relax after a long days tourism in which you will walk a lot to enjoy this city!"
        }, 
        {
            "index": 292, 
            "rating": "5", 
            "review": "Fountain of fountains. Great for evening chill, the fountain dances in the tones of music and colorful lights and it is awesome"
        }, 
        {
            "index": 293, 
            "rating": "5", 
            "review": "Must see if you go to Margaret Island in the evening!. I have seen some nice music fountains like the one at Belaggio in Las Vegas but I enjoyed this one even more. It is rather small (compared with Belaggio's) and found the selection of songs a bit bizarre - American pop songs alternated with some classical music - but nevertheless, it is an enjoyable experience. For some people, it may be best if you go with something you can sit on because sitting down opportunities are scarce. And of course, while you are at Margaret Island, make sure you explore it!"
        }, 
        {
            "index": 294, 
            "rating": "4", 
            "review": "Entertaining Show. We've seen a few musical fountain shows on this trip, and I think this might be the best of them. We weren't expecting to see it going when we were on the island but the shows seem to be running a lot more as I saw it twice. I think classical music works better but the more contemporary stuff was good too. A fun diversion."
        }, 
        {
            "index": 295, 
            "rating": "5", 
            "review": "One of Budapest's highlights (seriously!). This fountain is beautiful - the water shoots up in time to music and it's so lovely to sit nearby and watch people marvel as they walk past!"
        }, 
        {
            "index": 296, 
            "rating": "5", 
            "review": "Come at twilight! Best of both worlds!. We thoroughly enjoyed this fountain and watched it before the sun set. After walking around Margaret Island we returned and enjoyed the light show at night. The music varies. One minute it's classical and the next minute they are playing a current musical selection. There are benches around the fountain or you can sit at the water's edge."
        }, 
        {
            "index": 297, 
            "rating": "4", 
            "review": "Stay A While . We happen to come across the Music Fountain by chance while walking around Margaret Island. What a great attraction, i found it to be mesmerising watching the water shoot up and down, making various shapes to different genres of music. Everyone seemed captivated. As it was a hot day many people were round the edges of the fountain dipping their feet in to cool off. The area is surrounded by greenery so makes a nice backdrop for a picnic. Alternatively there are chairs provided for you to enjoy the show."
        }, 
        {
            "index": 298, 
            "rating": "4", 
            "review": "Peaceful and Tranquill Area. Lovely to come and sit around the fountain , chairs are provided that unusually are individual chairs that you can move about to your own grouping. Makes a change from a park bench. Fountain dances away and is mesmerising."
        }, 
        {
            "index": 299, 
            "rating": "5", 
            "review": "Great place!. This fountain is located at Margaret Island. It's a really cool island to visit if you want to relax and have a good time. We arrived at the beginning of a show; ended up staying there for a while. You could just sit by the fountain, dipping your feet in the refreshing water (it was super hot when we were there) and enjoy the moment. There are smaller shops around so you can buy a beer/water/soda and snacks. You can rent tucktucks and ride around the island as well."
        }, 
        {
            "index": 300, 
            "rating": "5", 
            "review": "My favorite activity of our vacation.. Our son had previously visited Budapest and wanted to surprise us. He took us to Margaret Island on a perfect summer evening and we loved being entertained by the magical music fountain. There was a great variety of music (we watched the full set at 9:30) and the confluence of music and these beautiful colored fountains dancing to the tunes was truly wonderful. This is not to be missed!"
        }, 
        {
            "index": 301, 
            "rating": "4", 
            "review": "A Symphony of Water and Lights. The music fountain located on beautiful and serene Margaret Island is something to see.During the day at several times it performs a magical water dance but at night is when it really springs to life with an exquisite and beautiful light show adding to the water dance. The light and water shows are both accompanied by a broad range of music so all ages nationalities and tastes can enjoy from classic Hungarian composers to the Rolling Stones to CCR to Verdi and Simon and Garfunkle to name a few. The schedule of music playing: every day is at 10.30 and 17.00 4 musical pieces, at 18.00 the complete music list is played, at 19.30 4 pieces, at 21.00 complete list againThe Music fountain is one of the main and best attractions on the island highly recommend spending some time relaxing by it with a small picnic basket and waiting for the show to start."
        }
    ]
}