{
    "category": "Budapest", 
    "entity": "Miniversum", 
    "avg_rating_stars": 4.605960264900662, 
    "review_count": 302, 
    "rating_stats": {
        "poor": 3, 
        "average": 12, 
        "terrible": 1, 
        "very_good": 82, 
        "excellent": 204
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "Interesting for All. Our guide took us here after learning of the spouse's model railroad at home. It is beautiful & authentic & we've been to many of the best layouts in the USA. Along the walls are Exceptionally Well Done educational posters describing & picturing the real places being modeled. We stayed only an hour but with just 2 days in Budapest, we gave the guide an ambitious list of things of must sees."
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "Positive suprise. I thought I was going to see mini-trains. I did. But there is a lot more than that.It is bigger than I thought it will be, and the details that went into building that is pretty amazing. You can find unexpected scenes everywhere too (dinosaurs, Star Wars references, UFO-s, and Back to the Future-car is hidden in there as well)Definitely check it out, even without kids, but they would probably like it even more."
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "Miniversum Trip. Nice place to visit. Aldults and/or children MUST go and get fun from this mini wonderful world. Enjoy!"
        }, 
        {
            "index": 4, 
            "rating": "5", 
            "review": "Great activity for the kids in Budapest. If you are stuck for something to do with the kids - take them to Miniversum in Budapest! It's the second time I've been there with my daughter and it's great. There are miniature landscapes with trains, cars, miniature people and a load more scenes to take in. There are buttons to press and get interactive with. Normally - as a dad- I'd give something like this a wide berth.. I mean I'm not into miniature people, trains or landscape miniature scenes but after 2 hours of being interactive I was quite proud of myself:-) It's a kids thing... and they just light up when they go in there. There is a small cafe, and also a play / drawing area for ages 4/5 to 11 /12 ish. I can't exactly remember the price for a child but it's around 1,350HUF and on a rainy day they'll be glad you took them. I'm attaching some pics... enjoy"
        }, 
        {
            "index": 5, 
            "rating": "5", 
            "review": "from 5 to 100. Very interesting place to come to with kids of any age - from 5 to 100. It's not just that you can admire small models. We spent there more than one and half hour finding our what you do with the models by pressing various buttons on panels for visitors. Go and try!"
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "Loved it, great fun for young and old alike !. Went here not really knowing what to expect but was very pleasantly surprised. We were greeted by very friendly staff who explained the layout of the place before offering a cloakroom and locker for our valuables, we were then shown through to the start of the route, around what is basically a very very detailed and interactive model landscape of various cities and towns in Hungary, Austria and Germany.At points around the model there are buttons you can press that bring the model to life by either moving vehicles or other parts of the landscape, lighting up areas, or making sound effects, we had a great time trying to spot them all as some are really small details and harder to find. There are also many many trains running as part of a continuous loop of animation which really brings the whole thing to life.As you travel round there are also information panels with separate miniature dioramas detailing the communist period in Hungarys history, which I personally found really interesting to read. Also there is a nice little refreshment area at the end.This place definitely ticked all the boxes for me and I thoroughly enjoyed my visit."
        }, 
        {
            "index": 7, 
            "rating": "4", 
            "review": "Nice experience . Good place to spend time with kids specially on rainy days. You can spend about an half an hour- hour in the place pressing buttons that activate the mini models. It's fun and interesting experience."
        }, 
        {
            "index": 8, 
            "rating": "5", 
            "review": "So many details and great fun!. Our family noticed this museum as we walked and decided to go inside. We spent several hours enjoying the exhibit with models of places in Hungary, Germany and Austria. There were many hidden pieces and we enjoyed pushing the buttons and finding what would happen with many small details. The price was very reasonable and both children and adults in our family enjoyed it. There was also additional exhibits and information on communism which was very interesting. We would highly recommend it."
        }, 
        {
            "index": 9, 
            "rating": "4", 
            "review": "Great rainy day activity. We visited here on a rainy day, it was practically empty as we were worried about many children so we were happy. They have tried to make the models interactive but we don't think all the buttons worked which was a shame. However for those who can appreciate attention to detail this is great fun. Lots of info boards around too. Young kids would probably get bored. You can sign up to have a discount on future visits too."
        }, 
        {
            "index": 10, 
            "rating": "5", 
            "review": "Real fun for kids (and adults...). Real cool place. Mini models of places in Hungary, Germany and Austria. In every model the exhbition react to bottoms that you can press on (trains and cars moving, lights goes on, ext...).We've been with a 1 year old kid and she loved it. A bit bigger kids can spend hours.Great fun and the price is reasonable (less then 10 us$ for adult speaciel prices for families)."
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "Great and creative. I visited this museum today with my 12 years old daughter. I didn't want to come at first, but children can go by without adults only from age of 14. So I joined. And it was so great! We both enjoyed so much, all the details made with great care, some funny things hidden beside the realistic views, like the giant robot from the Star World)) The museum is large, with some historic details, working railway, active buttons. I recommend to visit this museum"
        }, 
        {
            "index": 12, 
            "rating": "2", 
            "review": "Not very interesting. We wanted to see how life under communism was; we saw miniature trains. Not very spectacular or informing. A Wikipedia page gives more information."
        }, 
        {
            "index": 13, 
            "rating": "4", 
            "review": "Great If You Love a Model. This was really good value for money. It was relatively quite when we wondered in and came across it as we were on our way to the opera house. The models are extensive and offer many interaction if you like that kind of thing. The models covered many of the sights in Budapest and the surrounding areas. This was a really good exhibition the only down side was the actual construction of the models. I always prefer hand crafted, intricate buildings that are pain staking replicated. These were a little more flat pack."
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "Tons of fun!. It's great for all ages, lots of buttons to be pushed and stuff to be seen.Totally recommend this to everyone!"
        }, 
        {
            "index": 15, 
            "rating": "4", 
            "review": "Fun and creative. Great detail and fun additions make this museum a fun place to visit. You will see trains, cars, buses and more moving around the mini city. There are places for you to interact with the set. If you are a \"Where's Waldo\" fan, this place is filled with lots of fun extras. I never found a Waldo - I do not think one is there - But it would be a fun place to hide one. Maybe they will do that at sometime!! Fun and relaxing!"
        }, 
        {
            "index": 16, 
            "rating": "5", 
            "review": "Good for big kids and little kids alike. We absolutely loved this place. We're both in our mid 30s and were mesmerised by it all.The attention to detail on the buildings, people, animals at the zoo and locations was fantastic. There is an interactive part were you can press buttons to make cars, vans and trains go round, turn lights/sirens on etc. There is also information on the buildings all in different languages. Keep an eye out for the little items that are unrelated to Budapest and the surrounding areas! We had fun spotting them. The display is bigger than I thought. Felt like we're were only in the a hour, 2-3 hours later we came out."
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "For all ages. A must see for those who like to experience the miniature world. With a press of a button one could make a train or car move and lights to switch on..... Awesome"
        }, 
        {
            "index": 18, 
            "rating": "4", 
            "review": "Very enjoyablr. I was walking by this place and decided to pop in for a visit. Very enjoyable - loved the attention to detail, and being able to make things move and light up was fun! Also learnt done things from the interesting display on communism. The only reason I'm giving it four stars instead of five is that I found the entry fee a little expensive."
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "Surprised. As we are walking it started rai if and we saw this and decided to check it out. What a great surprise this place was and worth the price of admission."
        }, 
        {
            "index": 20, 
            "rating": "5", 
            "review": "Entertaining exhibit for everyone . Spent a wonderful few hours looking at the trains and scenes. The detail of the scenes and trains were impressive and the interaction with the many buttons to press makes it an engaging experience. This is a fun activity for all ages."
        }, 
        {
            "index": 21, 
            "rating": "5", 
            "review": "Don't miss this place, it's amazing.. We had so much fun here. The level of details on the models is fascinating. We felt like children again. Give it a visit, you won't regret it."
        }, 
        {
            "index": 22, 
            "rating": "5", 
            "review": "Great attraction for all family.. Very interesting attraction for all family. Kinda quest. Lot of moving parts. Every button activate something."
        }, 
        {
            "index": 23, 
            "rating": "5", 
            "review": "Fun for all ages. My partner and I spent an enjoyable couple of hours here today. We loved the detail (all the tiny little people seem unique!) and the interactive element. We also found the snippets of social history interesting. The staff was informative, friendly and spoke good English. Lastly we had a refreshing lemonade from the cafe before leaving."
        }, 
        {
            "index": 24, 
            "rating": "5", 
            "review": "In case you have kids or you let your internal kid out.... Its a big interactive exhibition that shows main train stations of Hungary but also Austria and Germany. If you have time take the adult tour as well ;-)I took a Swiss train model company owner to this place and he was amazed! And now there is also running a Swiss locomotive on the site."
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "Better than I expected. I did not expect much from this, but it turned out to be very very interesting. There is so many details there that you really need to take some time to scope everything. Do not rush through Miniversum cause you might miss something. There is around 50 push-able buttons that trigger certain things to move which is very fun for kids."
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "Great Way to Spend a Rainy Day. We decided to check this place out with our 2 year old on a super rainy day in Budapest and it was the best 3 hours! It's pretty much miniature Budapest all the way to Vienna with all of the awesome little towns in between. Miniversum is very interactive with buttons to make trains go, mini fountains spout water, and lights flicker and so much more. Great cafe and playroom as well. It was truly a wonderful sight."
        }, 
        {
            "index": 27, 
            "rating": "5", 
            "review": "Fab.... Even for adults.😀. We did not know about this museum but we were only staying a few minutes away and thought we must go.A great museum and a pleasure to walk around as an adult even I wanted to let my imagination run wild and have a play!!"
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "Surprisingly interesting and fun. When I first saw the Museum, right next to my hotel, I wasn't very interested in visiting it. But after reading the reviews here at Trip Advisor I've decided to give it a shot - and I'm glad I did it. The exhibition is fun for kids and adults, and also somehow informative. It's not a cheap attraction, but it's a fair price."
        }, 
        {
            "index": 29, 
            "rating": "5", 
            "review": "excellent place for a rainy day and not only. This is a museum type of attraction that has miniature display of Budapest and several surrounding cities plus a few from Austria and Germany. It is a magnet for kids, especially those over 4 yo, as it provides them with different quizzes to guess things that are one the display [unfortunately, only for HU speakers at the moment]."
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Amazing detail. The miniver sum doesn't strike you as anything special on first impression but appearances are deceptive!!! We really loved it the details are truly amazing . Definitely worth a visit my eight year old and forty six year old thought it was fantastic. The snapshots of life during communist rule were well presented and fascinating. It was a really interesting and fun mini adventure!!"
        }, 
        {
            "index": 31, 
            "rating": "4", 
            "review": "Mini Budapest. Budapest version of Legoland including Hungarian, German and Austrian cities/towns. Lots of moving trains and cars plus sights and sounds to pick out. Good for kids and adults alike."
        }, 
        {
            "index": 32, 
            "rating": "4", 
            "review": "Place to fulfill your nerdish needs. Nice details for all You little nerds to check. Not too big, but one can spend hours spotting what those little miniatures are doing."
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "Wow! . From the outside this place looks like a small place but in fact it is an amazing, huge collection of mini cities that are moving and living their own lives! There are many things to find in Miniversum world starting with UFO, sniper on the city roof and even an ATAT from movie screen. So much to see. It might take over an hour to see everything."
        }, 
        {
            "index": 34, 
            "rating": "5", 
            "review": "Astonishing. Amazing place, truly unique. There are couple of rooms, each one with different city.Two main represented cities are Budapest and Vienna. Gyor, big hungarian city, is also great.Much of the setup is interactive so you decide what sounds you hear, what vehicle moves and when etc. Only constant are numerous trains which are everywhere and are very interesting to follow on tracks.Must see."
        }, 
        {
            "index": 35, 
            "rating": "5", 
            "review": "Not to be missed!. Although this is a model exhibition with lots of trains etc. it also tells a lot about the history of the country and so is a fun learning experience for all ages.It is in the heart of the city and so you can pop in for a visit when the rain suddenly starts to pour down as we did."
        }, 
        {
            "index": 36, 
            "rating": "4", 
            "review": "Great little place!. Took my 5yo & 3yo here & they loved it! It's great as there are wooden benches everywhere so they can get high enough to see everything. And lots of buttons to press then they need to figure out what they just turned on. And there's a little play area & coffee shop at the end that we spent an hour in."
        }, 
        {
            "index": 37, 
            "rating": "5", 
            "review": "Impressing presentation. If you visit Budapest, please take a trip here. It is well-made and impressing with all details and affects."
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "Fabulous little attraction in the centre of Budapest. Our apartment was in the street behind Miniversum so my children could see the children's play area every time we walked into town. One afternoon we decided to visit and they were desperate to play with the trains and we had a fabulous time! Its a model version of Hungary (with bits of Austria and Germany as well), but there are lots of interactive buttons to press to make things work as you go around. My kids loved making the buses and trains move! Once you've been round the main display there is a children's play area with lots of Brio wooden trains and track, plus a remote control train track (not sure on the brand) and that kept our kids amused for a long time. At the end there is a shop you can buy trains and track to take home with you. There is also the option as you leave to register for discounted return tickets.This is a definite must do for visitors with train-loving young children!"
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "The best mini world. Fantastic and unique Hungarian speciality for everyone. Trains and famous places and wide moveing sceneries. Strongly recommended."
        }, 
        {
            "index": 40, 
            "rating": "4", 
            "review": "Excellent little gem.... I am not typically a big fan of museums, but this one was right up our ally...it is exactly what the name says...a min version of the various places. The main part of the museum covers Hungary and its major cities, but it also covers, austria, and parts of germany. The detail is absolutely gorgeous and even though we did see a lot of kids, i really do wonder why this doesn't attract more adults. The idea is fab...the artists are great...with little variations like trains, lights, horns, and some quite known characters as well. I am so glad we went to see this. Highly recommended!"
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "Walk around Hungary (and a bit of Germany) in Miniature. Visited this place on my final day after reading the reviews on Tripadvisor, I was not disappointed. It is an interactive exhibit, by each section as well as information, there are 'action' buttons you can press, the fun is seeing what they do. The models were detailed and well presented.The museum also had a poignant display on life under Communism as you walked around.Look for the AT-AT, Millenium Falcon, Aliens landing, Submarine on a train and the outside loo!"
        }, 
        {
            "index": 42, 
            "rating": "4", 
            "review": "Good fun. Fun place with interesting historical facts about the city. Some amusing little situations going throughout the exhibit and some Star Wars fun hidden in clear sight! Think was around £12 for 2 adults. Cafe looked nice but we didn't visit. Play area for kids and raised platform which good to peer into the intricacies of the exhibit."
        }, 
        {
            "index": 43, 
            "rating": "4", 
            "review": "Good for young and old. The buttons are VERY confusing , poorly labelled. The landmarks aren't to scale, relative to each other. Not are they geographically positioned, but once you get over that, it really doesn't matter.Very interesting history in the posters to read along the exhibit walls.Our 14mth old was able to toddle safely around the exhibit.Our 4 year old very much enjoyed the moving parts and buttons. Both enjoyed the playroom at the end, we parents were and to sit down and read for a while!"
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "Nice short stop with suprisingly much info. The miniversum is easy to reach with metroline M1 (station: Opera) or from the Oktogon station/crossing. I mainly went there because I had time to kill and have a big interst in the small trains and cars.In the past I have visited MiWuLa which is an XXXL version of miniversum.Nevertheless did I like my visit here alot. It offers some nice cuts from budapest and the hungarian landscapes. When I visited the museum it was almost empty which was nice. The entrance fee isn't very low compared to other attractions in Budapest. The museum  isn't very big either. Took me about 1 hour to see evrything.The museum does offer alot of information about the stuff you see in hungarian, english and german. The museum is mainly focussed on hungary but also shows a bit of austria and germany. To conclude, the museum is a nice short stop. I would defo recommend it to the enthusiastic modeltrain fans. Also for kids this place offers lots to see."
        }, 
        {
            "index": 45, 
            "rating": "5", 
            "review": "Kids paradise. From 3 years to 99 years this is a very good place to watch the running trains, the different landscape. You even can involve pushing the buttons on the side of the tables. It is really very enjoyable."
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "Brilliant! . So having read about this place on Trip Advisor & having a train mad 4 year old we had to add this place to our intinary for our recent trip to Budapest! In all honestly Budapest has that many things to see & do that we actually forgot about this place until we stumbled across it following an afternoon stroll. As soon as our 4 year old spotted the display outside there was absolutely no way we were going to be able to carry on walking/I'm so glad we didn't the attention to detail in this place is phenomenal! My little boy absolutely loved it (as did we) great way to pass an hour or so & the interactive buttons were great! Be sure to spot the medic doing CPR! We also had a sandwich in here which although small was very tasty. All staff we encountered were warm & friendly and should we ever return to Budapest we will come back!"
        }, 
        {
            "index": 47, 
            "rating": "4", 
            "review": "Pleasant find. I happened to be walking past and I'm a sucker for anything miniature so thought I'd give it a look. Very enjoyable way to pass an hour with interactive displays."
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "Great place for all to enjoy . I really enjoyed my visit to Miniversum. Fantastic models with great detail and fun mini scenes. I initially thought it was a little small, before turning a corner and realising that I hadn't even seen half of it! You can spend hours here!Staff are very friendly too. The only problem was that some of the buttons either didn't work or it was difficult to see what they did."
        }, 
        {
            "index": 49, 
            "rating": "3", 
            "review": "Little models for big kids. Good fun for children and grown up children alike! Great attention to detail with a few bits of humour thrown in."
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "Enjoyed the miniature world. Our family of four including two teenagers all had fun walking around a miniature version of Budapest. If you have an hour or so to spare and want to do something different, I would recommend this."
        }, 
        {
            "index": 51, 
            "rating": "4", 
            "review": "Unique and good fun!. I had seen Miniversum on TripAdvisor but being honest, wasn't that bothered about visiting. However, my husband and I wandered past on our way from the opera house and he was keen, so in we went. Well, I'm glad we did as this was a great, unique and very fun attraction. The staff involved in creating the exhibits clearly work very hard and do a great job maintaining it! Lots to it, and the interactivity is good too. Kids would love this attraction! If you have time, it's definitely something different and fun to do in Budapest."
        }, 
        {
            "index": 52, 
            "rating": "4", 
            "review": "Interesting little attraction. Saw the advert on the bus tour and used the money off coupon to visit. Probably a good place to take small children and kids of any age as it is hands on and lots of fascinating detail has gone into building these scale models even done to a simulated lightning storm and firework displays projected on to the walls in the Alpine section. Good fun."
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "Spur of the moment. Noticed this as we were exploring so went in for a visit...Very detailed mini landscape....Interactive for kids/adults."
        }, 
        {
            "index": 54, 
            "rating": "4", 
            "review": "A must for children. A lovely, very well made miniature of Hungary complete with railway tracks and trains going through. Wheelchair accessible and the staff are very happy to help if needed."
        }, 
        {
            "index": 55, 
            "rating": "5", 
            "review": "Wonderland . Thought we'd stop by for a dose of mini-a-ture and were rewarded with some interesting historical insight, highly absorbing miniature diorama and some thoroughly engaging interactivity. A delight I'm sure for Kidd but also great fun for adults. We were quite surprised when we realised just how long our visit had lasted. Utterly charming and good value."
        }, 
        {
            "index": 56, 
            "rating": "5", 
            "review": "Mini attraction, MAXI enjoyment!. We came across this place quite by accident. Someone in front of us stopped to take a photo of a display outside the premises and that caused us to pause and pick up a leaflet.Our first impression, on going indoors, was that it seemed quite a small (excuse the pun) area that the exhibition occupied. However there was much more than we could initially see. Having just walked from Heroes Square we found the first exhibit (which depicting that site) to be astonishing in its detail. We loved the interactive facility - allowing you to move vehicles, listen to sounds, activate lights etc.There was just so much going on at each exhibit, it was a real feast to the eyes. The number of trains and vehicles on the move at any one time added astonishing realism to the already realistic static models.I couldn't help but compare it with Madurodam in the Netherlands that I visited a number of years ago. Madurodam is, however, much larger, being on a scale of 1:25 as opossed to the scale of 1:100 used at Miniversum. The much smaller scale makes Miniversum all the more fascinating, not only the detail in the models, but the attention to detail in the many figures. I particularly liked the group of divers and the accident victim receiving CPR!Some reviewers have remarked that this is great for children. I'd say it is suitable for all ages. It was an unexpected highlight to our visit to Budapest. We spent around two hours taking in all the sights and could have stayed longer had our feet not been a bit sore. My only question is: Why is this not advertised at Tourist Information or in Travel books about Budapest?"
        }, 
        {
            "index": 57, 
            "rating": "5", 
            "review": "Wow. If you are in to miniatures or if you're in to toy trains or just for the novelty, you must go here. Multiple cities and towns have been created in miniature and trains run from city to town; passenger, freight, tanker, etc. You could easily spend an hour being fascinated by the activity. The only negative is that they have a book to buy on the creation and operation of the place, but it's only in Hungarian."
        }, 
        {
            "index": 58, 
            "rating": "4", 
            "review": "Very cool & not crowded!. Didn't come with high hopes, but this is really a cool place to spend an hour in. The attention to details here is nothing short of amazing, and the trains, cars - and other hidden objects actually move!The only downside is that this place is really small."
        }, 
        {
            "index": 59, 
            "rating": "4", 
            "review": "Release your inner kid..you will like this :). Easy to access to this museum & they open on monday. Remember to flash your Budapest Card for the discount on tickets. Be prepared to spend at least 1 or 2 hour inside. Everything is made with so much detail and some have cute storyline. Love the idea of the interact where you can press some coloured buttons to make movements or sounds. We enjoyed ourself a lot inside."
        }, 
        {
            "index": 60, 
            "rating": "5", 
            "review": "Delightful . For the kids inside us. Marvelous details with challenging hidden features and cool descriptions of life under Soviet Communism made this more than just a vast display of model trains"
        }, 
        {
            "index": 61, 
            "rating": "4", 
            "review": "Lots to see for grown ups and kids alike. Large playing room for the little ones and a cafeteria as well. Extremely friendly staff. The Austria-part of the Miniversum even had the brand new main train station. Great!"
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "Fun. Certainly a place to visit. It is quite cheap ( only 76 SEK per face ). The exhibition is done really well, a lot of fun and even few funny situations/solutions."
        }, 
        {
            "index": 63, 
            "rating": "4", 
            "review": "A Great attraction. Miniversum is a very well detailed model of various parts oh Hungray with very well detailed scenes. There is plenty for adults and children to do and see with plenty of hidden features that you have too look out for along with history of days past. Surprising how a couple of hours can pass."
        }, 
        {
            "index": 64, 
            "rating": "5", 
            "review": "Excellent Attraction - something for everyone!. Not sure what to expect, however, the scale of Miniversum and attention to detail was very impressive I was surprised at how long I stayed and the number of pictures I took. Tghe models were certainly kept busy with train movement. Recommend this highly as appropriate and engaging for children of all ages!"
        }, 
        {
            "index": 65, 
            "rating": "4", 
            "review": "Brilliant for kids of all ages. Spent an enjoyable hour plus in here partly to avoid the rain and partly to indulge in being a kid again. Massive train/model layout with plenty of historical notes and interactive buttons to play with. Great value for money."
        }, 
        {
            "index": 66, 
            "rating": "3", 
            "review": "Addictive places and definitely one for the kids. It took nearly all my power to yank my family out of this place. If I hadn't been in a rush to see Parliament, I'm sure they would have spent all day there. There all these buttons which allow you to move the miniature trains and cars, flash lights and let off noises. It's like a giant toyland, but unless you are a giant toy lover. I would say its more for families with kids."
        }, 
        {
            "index": 67, 
            "rating": "4", 
            "review": "Nice place to visit in a cloudy day.. Very nice service speaking English. Yo can see a lot of funny situations and turn on/off light, sound and make vehicles to move."
        }, 
        {
            "index": 68, 
            "rating": "5", 
            "review": "A must-go for a kid. It was an interesting attraction for me as a grown-up, but it completely blew my 5-yr old son's mind away! It's been a while since I've seen him so hyperactive and excited! Dedicate at least a couple of hours to explore the exposition, press all the buttons and test-run some train models."
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "Absolute Gem!. After taking to a couple on our first day they recommended going to see. We were pleasantly not let down. A lovely surprise and would suggest anyone coming to Budapest to have a tour!!! Very happy and a little gem!"
        }, 
        {
            "index": 70, 
            "rating": "5", 
            "review": "An unexpected national treasure. Came across this by accident on the internet and we took our two young girls thinking it would be a quick visit. When we were done, we had spent three hours admiring the recreation of famous landmarks in Hungary, Austria and Germany. What a revelation! Even if you are not into train sets, you will love this; we did!!!"
        }, 
        {
            "index": 71, 
            "rating": "5", 
            "review": "Ideal for children. You may easily spend hours watching it. A must for the families with children. A great gifts shop although expensive a bit."
        }, 
        {
            "index": 72, 
            "rating": "4", 
            "review": "Small Museum - But does what it says on the tin!. The very thought of seeing miniature models was attractive; but was initially hesitant thinking it will just be for kids. Good, I did not ignore this attraction. It was well worth a visit for both kids and adults (of course who is interested in mini trains, working models, etc.) alike. A perfect family attraction. The place is very small compared to what we usually think of the work 'museum'. If you look through the whole place with attention to detail, it could take up to 2 hours; but if you skim through, you could finish it even in 20mins. Choice is yours!"
        }, 
        {
            "index": 73, 
            "rating": "5", 
            "review": "Miniature in Budapest. The minature display was amazing. Great history about the communist history of the country. The display is inside so you can either escape the heat/rain/ cold or whatever of the Budapest weather. When in you must hunt well for all the details as there are so many. A guide book in English would be a great help. Lovely friendly staff. Great cafe and very clean washroom provided."
        }, 
        {
            "index": 74, 
            "rating": "4", 
            "review": "Loved It!. The display of the miniature was amazing - detailed and having some fun jokes too (but they are very tiny so hunt them with eyes VERY open!). The place is indoors, so the displays are maintained clean, protected from the wear & tear of weather (& visitors can escpae from heat or rain in Budapest too).It was also interesting to learn quickly about the communist history of the country with miniature.I'd have definitely bought a guide book or picture book if they had an English version (unfortunately it seemed that they were not selling one).We spent around 2 hours. Located in the city centre, a cafe & a wash room provided.Highly recommended!"
        }, 
        {
            "index": 75, 
            "rating": "5", 
            "review": "Detailed models, a surprisingly good cafe. Huge model with lots of details down to a field of individual sunflowers. We took over an hour to go round. Can you find window cleaners, someone on a stretcher, a coal mine, grain silos, wind farm, solar farm, circus, ...The cafe does have crisps and chocolate for the children, but also different teas, a variety of hot chocolates, enough variety for adults also."
        }, 
        {
            "index": 76, 
            "rating": "5", 
            "review": "Amazing. Despite being so tiny, the scale of this exhibition was staggering! So precise and well executed. We both had fun working out what was going on in the different scenes and found out lots of interesting information information. It was a welcome change of pace to the full speed tourist trail!"
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "Kids or no kids this is a must visit place in Budapest. This is a fantastic day out for anyone going to Budapest. The worlds that have been created and level of detail is immense. My son loved it and we actually went twice in the 4 days we were in Budapest. Even if you haven't got kids I would 100% guarantee that you visit this great place you won't regret it. Very reasonably priced too."
        }, 
        {
            "index": 78, 
            "rating": "5", 
            "review": "Find your inner child!. Really enjoyed miniversum. Excellent attention to detail and a bit of history thrown in. Very entertaining way to while away an hour and lovely to see reactions and excitement of the younger visitors. Very well designed, original and entertaining."
        }, 
        {
            "index": 79, 
            "rating": "5", 
            "review": "Lovely surprise. I don't trust too much the quality of the hungarian shows, but this was very well prepared. A great fun for kids and a good value for money. Good job!"
        }, 
        {
            "index": 80, 
            "rating": "5", 
            "review": "Interesting both for kids and adults. Miniversum was our the very first place to visit. Thankfully it opens at 9 a.m. To be sure you enter the museum at planned time, you can book your visit on their web-site. But I think it’s more about weekends or for later hours. We were on Sunday 10.00 and although we had booking, we entered without any problems. There were not many people inside.The exhibition takes 3 rooms and lights places in Budapest, Hungary, Germany and Austria. Tiny models of people, small cars, buses, running trains… The exhibition is interactive and by pushing buttons you may turn on street lights, transport or just hear sounds of nature. You may find a short historical info about the part of model you are looking at. In an Austrian part there is also a light and music presentation. We spent there about an hour and I personally was not less enthusiastic then my kids!"
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "Mini things but lots of fun. Loved this place- spent a good couple of hours spotting little bits and pieces. The level of detail is fantastic. Cost 2500 florin to get in but was worth every penny!"
        }, 
        {
            "index": 82, 
            "rating": "4", 
            "review": "good fun for kids. Miniversum is a great fun for kids and parents to see lovely miniature scenes of Hungary and nearby countries. It tries to be interactive, but this is rather limited. It is more to watch than to actually play with."
        }, 
        {
            "index": 83, 
            "rating": "5", 
            "review": "Amazing!!!. Our friend told us about this model museum and said it might be worth a visit. We decided to pop in here as the weather was fairly awful and we were soaked to the skin. It was definitely worth a visit. We couldn't believe how detailed all the countries were and the models. They say it's likely to take 60 mins to get round the whole museum well we spent nearly 2 hours in here as we were mesmerised by the models."
        }, 
        {
            "index": 84, 
            "rating": "5", 
            "review": "The best place for your inner child. I absolutely loved this place. I visited with my mum (we are both all grown up) and we had just as much fun as the children there. They also have the best gift shop where you can buy puzzels and models: I even bought a hoodie that came in useful on this chilly day."
        }, 
        {
            "index": 85, 
            "rating": "5", 
            "review": "Short break to Budapest- good find recommended to visit . We stumbled upon knowing this on a hop on hop off brochure and glad we went to see the place. The place was amazing, exceptionally well maintained and created. Full of wonders. Created of putting miniatures of landscapes from Hungary Austria and Germany it has 100,s of trains moving on with impeccable timing and grace. The landscapes are too real, even the miniature animals eg chicken over to feed, paramedics giving treatment moving along with gondolas and a light show on the palace have amazing sights. Trains I loved them all kinds of trains passing onto a web of tracks and tunnels. Ticket cost is huf 2400 for an adult a family Ticket costs huf 5900 child above 2 is charged. On the museum you have cafeteria and rest rooms. A play area for kids where they can create their own train tracks and play with lots of trains. A must see and visit for all ages."
        }, 
        {
            "index": 86, 
            "rating": "4", 
            "review": "Surprisingly fun for adults. We only went because we were a street away in the cat cafe, but it is reasonably priced at around 1200 forints per adult and it was a very enjoyable hour. I'm sure it's designed for children but we were very engaged in interacting with the buttons, sounds, find the moving bits, etc. Free cloakroom and clean toilets. Also has a cafe. I learnt a bit about communist Hungary too."
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "Great Find. I'd seen this advertised and wasn't that bothered about visiting but we stumbled across it on a wet and windy morning so decided to step in. A free cloakroom and free lockers to dump wet coats and bags is always a good start and friendly staff to boot.This is basically a model railway layout which goes on, and on, and on. A great layout with lots of interactive detail - obviously built by a team with a great sense of humour - lookout for the aliens and a dinosaur!The panels with information about life in communist Hungary were very interesting.Well worth a visit by all kids, young and old!"
        }, 
        {
            "index": 88, 
            "rating": "4", 
            "review": "Great for a rainy day. We stumbled across this place by accident but had noticed it on trip advisor before but thought it was too far away from our hotel.This is fun, if you were ever in to model railways as a kid or adult then this is for you. Also really good to amuse the kids plus it's inside so good for a rainy dayYou wonder round a few city's and there are interactive parts when you press buttons and find what is moving or flashing. It has been really well made and attention to minute details are also good.Took us about an hour to wander round. Only down side would be if it was busy, lots of folk wanting to press buttons and not giving you space to see all the little bits."
        }, 
        {
            "index": 89, 
            "rating": "5", 
            "review": "Awesome museum of miniatures. This place is fantastic. Super well done - a great place to spend a couple of hours. The exhibit is fairly large and incredibly detailed with a lot of easter eggs sprinkled throughout."
        }, 
        {
            "index": 90, 
            "rating": "5", 
            "review": "Amazing Display. Miniversum is great for adults and kids alike. It's along Andrassy Ut about halfway between the Danube River and Heroes' Square. It is a large building with an incredibly amazing set of scale buildings and trains designed to look like Budapest during the communist era. You also get other scenes of Hungary, Austria and Germany. It's one of those things you have to see to believe.There are exhibits to the sides where you can read and learn more about Hungary during communist times, and you can also interact with the exhibit through buttons spread out through the entire building. You can make things make noises, move or light up. It's very well thought out and really cool.If you love history and also want to see an incredibly and different exhibit about Budapest and Hungary, you must go to Miniversum. It's a great value for everything you get to see."
        }, 
        {
            "index": 91, 
            "rating": "4", 
            "review": "Great fun for all the family. We had seen a flyer and I had said to the children that we would try and pop in - so finding ourselves walking past it on the way to the Opera, I decided to take a break from proper sightseeing and have a look around. This is such great fun for all the family - the adults can read the interesting pieces on Communist Hungary, and look for the subtle \"adult\" tongue in cheek pieces- the drunken brawl outside the pub; the CSI team digging up the body; Hans Solo watching a film; the couple rolling in the hay (to name but a few). Children will be diverted by the buttons and huge choice of things to look at. The whole family will be thrilled by the miles of tracks and trains and trams - just a super way of filling a couple of hours. Great fun."
        }, 
        {
            "index": 92, 
            "rating": "4", 
            "review": "Great programme for a rainy day.. Fantastic, spectacular mini world (rich in details, spiced with a little humour) in the heart of Budapest, built in 2 huge and 1 small rooms. Ideal interactive indoor program for smaller children who are fans of tiny electric railways and trains, specially when its bad weather outside.Worth to go!The possibilities of the kids' corner should be developed.Cafe with couple of tables,Cloakroom,toilets and gift shop are available."
        }, 
        {
            "index": 93, 
            "rating": "5", 
            "review": "Train Sets Galore. I've not seen such a smile on my son's face for a little while! This is the most amazing model museum with trains and cars everywhere. Dotted amongst that is serious information about life under communist rule. Educational and fun ."
        }, 
        {
            "index": 94, 
            "rating": "3", 
            "review": "If you don't have anything better to do. We went to Miniversum because it was raining and we had a few hours to spare. It's not worth the price. It's interesting and fun because you get to press the buttons and move things, although it is more for the people that are interested in Hungarian history than the ones that just are just looking for some fun."
        }, 
        {
            "index": 95, 
            "rating": "4", 
            "review": "Kids loved it!. Go during the week as not busy. Helpful staff who speak English. Lots of buttons to press, my boys loved it (3&5) - there's a runner board all round the exhibits so kids can see plus a room with train tracks to make and play with."
        }, 
        {
            "index": 96, 
            "rating": "4", 
            "review": "Very Cool Place. We came across this small museum by accident. Inside, the museum lays out \"life scenes\" from parts of Hungary, Austria and Germany in Miniature. It is an opportunity for kids to learn about \"Life Under Communism\" with very cool towns and villages laid out in front of them with trains and other vehicles running through the detailed scenes. The best part was manipulating the buttons to make certain vehicles move, make farm animals move (or sound off) or windmills turn. We all really enjoyed it."
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "I want it in my room!. We had lots of fun there, trying to spot all easter eggs! Book at least an hour and have fun like we did:)"
        }, 
        {
            "index": 98, 
            "rating": "5", 
            "review": "A well spent hour. Great little place if you like miniature villages and railway sets etc. Kids will love it, but as an adult I enjoyed it too; you also get a quick insight into what life was like under communism in Hungary."
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "Clever and Quirky. To be honest my other half and I came in to waste an hour or so and I'm so glad we did. It was entertaining trying to workout which buttons turned on which lights or made vehicles move and all very clever. The attention to detail in incredible.Entrance was cheap (approx £5 per person) and the young lady who greeted us was so friendly and welcoming. Loved the small movie references as we were going round. Keep your eyes out for those storm troopers!"
        }, 
        {
            "index": 100, 
            "rating": "5", 
            "review": "Pretty cool. We popped in here to waste a couple of hours & we're not disappointed.You can interact with the sets & they switch the lights off to represent the towns at night.Cool place to go even if your not interested in this kinda thing! (I wasn't to be honest but was pleasantly surprised! "
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "Great Place for kids who love trains.. Spent almost 3 hours there with my 2 y/o son who loves trains. Great interactive place where kids can press buttons to move trains, buses, etc. and interesting history reading material on walls for parents to learn while the kids play. Also a play area in the back so kids and play with trains, cars, etc as well while parents have coffee/tea."
        }, 
        {
            "index": 102, 
            "rating": "5", 
            "review": "Totally Worthwhile. Best thing we did in Budapest. Prices were good and the models both interactive and interesting. Staff were friendly and we enjoyed every second"
        }, 
        {
            "index": 103, 
            "rating": "4", 
            "review": "A nice attraction for kids and for adults. This miniature railway exhibition is a nice attraction that allows good times spent with children in the very center of Budapest."
        }, 
        {
            "index": 104, 
            "rating": "5", 
            "review": "Great hour spent. Great value for money here 2 adults and 1 child was around £13. When we went in we thought it looked really small and we would be in and out in no time but it is actually a really good size and we ended up being in for just over an hour. The detail in all the models was lovely. Would recommend"
        }, 
        {
            "index": 105, 
            "rating": "5", 
            "review": "Fantastic trip.... As is not as big as you want to be, its a pleasure and a must do when you are in Budapest. it's a friendly environment for family's with young kids. They have interactional buttons for most of the scenery they also have a workshop and play room for kids. You can also see the control room that its just very ''cool''. Given the price, i believe it's a good experience for family's with kids. Staff its very helpful and nice!!!!"
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "Fun place for kids and adults. Would recommend to young and old, amazing detail has been put into this attraction. Behind the scenes tours also interesting"
        }, 
        {
            "index": 107, 
            "rating": "5", 
            "review": "Night & Day. We had it selected as one of the spots to visit it but ended up going around until we find it. We entered before night and had the oportunity to see the Miniversum with day and night themes!! LOVED the night themes and the communication we can have with it. So many details and love spread around it! Great for children and adults! See all the special effects click all the buttons you can find :D"
        }, 
        {
            "index": 108, 
            "rating": "5", 
            "review": "Not a one more museum. I liked very much that they focused not on reproducing places of interest but on reproducing real life of people. You can spend hours here by exploring this mini world"
        }, 
        {
            "index": 109, 
            "rating": "5", 
            "review": "We loved it!. Me (25) and my mum (54) visited this little gem today and we both absolutely loved it, my mum maybe even more than me. ;) Everything is SO detailed and we liked how interactive it is! We went on Friday evening and it wasn't crowded at all. The lady at the entrance was very polite and spoke excellent English. I will tell everyone who comes to Budapest to visit Miniversum. We spent 1,5 hr there and the time flew by!"
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "Amazing for those who played with LEGO while being child. Models of different parts of Budapest (and not only). Roads, buildings, trains and even people - beauty in details. It's really hard for me to imagine how much time it took to make these models. Especially cool when light fades in the room."
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "Adults will enjoy this as much as the children do!. We both thoroughly enjoyed this museum of miniatures of Budapest, Melk, and Vienna. Trains, villages, displays of life around the towns. You'll even see the iconic Durnstein Blue Bell Tower in miniature here that you may have seen if you cruised down the Danube River to Budapest. Look for the some of the unique and fun displays such as the \"Golden Arches\", the aliens, and the accident across the train tracks (they have thought of everything!). A fun museum for the whole family....young and \"older\" alike. Very friendly staff too."
        }, 
        {
            "index": 112, 
            "rating": "5", 
            "review": "Amazing model train display. Incredible detail, with Hungarian, Austrian and German scenes. They are always working on new displays, adding different scenes and details."
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "Tiny and slightly amusing. Massive tiny village with of Budapest and surrounding areas. Was queit when we went and some people get really into it but over all a good way to kill a bit of time."
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "Unexpected joy. Almost missed this little gem. The models are so detailed and have interactive switches so you can move some of the buses etc. Fun way to pass an hour."
        }, 
        {
            "index": 115, 
            "rating": "5", 
            "review": "Don't miss it! . It's a great place, I was amazed by all the details and diversity. Day and night alternate every 20 minutes, and I can't decide if I like it more on day or night, both has it's own advantage. I could stay there all day long because of the details. Staff is very polite and speak english. Ticket price is responsible. I would recommend this place for everyone, it's not only for kids, my boyfriend and I are 23 years old and we enjoyed it very much."
        }, 
        {
            "index": 116, 
            "rating": "5", 
            "review": "amazing. Such great detail and expanse of display. This is not just for the kids but suits all ages. Even my wife was impressed."
        }, 
        {
            "index": 117, 
            "rating": "5", 
            "review": "Found it by accident on the way to Opera. Come by and spend an hour or two. My wife and I loved it. Lots to see and do with interactive controls. Not just for kids. Great."
        }, 
        {
            "index": 118, 
            "rating": "1", 
            "review": "DONT DO IT. its a kids place, very very small museum, waste of time, waste of money.. i don't advice anyone to go"
        }, 
        {
            "index": 119, 
            "rating": "5", 
            "review": "Excellent. Pros:Nice exhibits. Had platform so todddlers dont need to be carried all the time- they could stand on platform themselvesReplicas of sights in the city and of areas.of interest from history. Eg what a mining town looks like. Complmented by posted that had explained the scene (eg during the past regime, main industry was... etc)Had play area. Our toddler tired of watching the trains after a couple of hours and wanted some interavtive play. The room beside the cafe allowed him to play woth model trains and build out tracksConvenient to get to, subway stop < 5mind walk awayCons:Staff did not speak english- were friendly though."
        }, 
        {
            "index": 120, 
            "rating": "5", 
            "review": "Brings back childhood memories. I went in on a whim based on some comments from other trip advisor members, in short I was pleasantly surprised at the scale and quality of detail....brought out the kid in me! Do spend time looking inside the buildings etc...so much detail has been put into it.I agree with another member's comment that some of the buttons either don't work or hard to figure out what they were meant to do..some signs on what the buttons do would help with the experience.In total I spent a good hour looking around taking pictures. I originally wanted to check out the one in Hamburg (looks bigger and more advance) but to be honest for the price I paid and the enjoyment factor i got out of it...if you are in Budapest I highly recommend taking the time to check this place out.Price 9/10Enjoyment 9/10Recommend to anyone young or old. Even if you've been to the one in Hamburg...still come and see this place and support the local business."
        }, 
        {
            "index": 121, 
            "rating": "5", 
            "review": "Miniature towns and Story of Communism. I chanced on this and was pleasantly surprised. The models are really detailed and the railways kept running. I was interested in the way they combined a history under Communism and Soviet rule (on wall plaques) with similar models in the mini-world. Those times must have been awful."
        }, 
        {
            "index": 122, 
            "rating": "3", 
            "review": "OK - aimed at kids though. Looks like this would be nice for kids. For adults, it's not as big as you would think and if you're considering coming along I'd recommend buying the combination ticket with the River Cruise as it's significantly better value than the ticket for Miniversum on its own."
        }, 
        {
            "index": 123, 
            "rating": "4", 
            "review": "Good for kids and adults . My partner and I enjoyed miniversum, it took us about 50 minutes to see everything without rush. The lady at reception was very friendly and welcoming. The models are exceptional and you could see how much effort went into it. The price is affordable and worth the visit."
        }, 
        {
            "index": 124, 
            "rating": "4", 
            "review": "Surprisingly Good. I'm not really into modeling as a craft, but we were looking for things for our grandchildren to do, aged 5 and 7. They loved the trains and trying to find the moving parts on the models themselves. I certainly gained a better appreciation for the art of modeling from this visit. The onsite cafe has an area where the kids can draw and entertain themselves afterward while we enjoyed a coffee. The staff were very nice."
        }, 
        {
            "index": 125, 
            "rating": "5", 
            "review": "Take a Walk on the Child Side. Took advantage of the later opening times on Saturday (like Friday, open until 20:00) to tour this facility, before eating supper, and really enjoyed myself. Partly because it was not overly busy at the time I visited, allowing me to explore at my own pace. But also because it was such a different place from most I visited plus it wraps what you learn in fun.And you can learn stuff. With display monitors offering you insight of different areas (in multiple languages) across Hungary, Germany and Austria, I probably learned more about Hungarian life under communism here than in any other place.As for the fun, well it is easy to have a fascination with miniature trains. I think all of us who has ever owned a set imagined creating something similar to the Miniversum. And as much beyond a play set as it is, it still offers buttons to push, trains to move, lights to flicker and sounds to make. A smile inducing hour and twenty minutes."
        }, 
        {
            "index": 126, 
            "rating": "5", 
            "review": "An unexpected delight.. We weren't intending to visit this attraction, but seeing it in a brochure and walking past one afternoon, we decided to go in and were very pleased we did.The size of the display, the intricate detail of the layout and the complexity of the whole thing was amazing. This is a must for any gadget fan."
        }, 
        {
            "index": 127, 
            "rating": "5", 
            "review": "Micro-city, maxi-fun!. This is a fun way to spend a couple of hours. Although it is a family friendly activity, when we went it was mainly adults looking around. The time and effort that has obviously gone in to making the Miniversium is impressive. As well as being enjoyable to look at there is also some history to learn from some of the displays. I really enjoyed it here they have set up as a working Mini City with accurate building and working trains. There were toilets and lockers provided for free. It was worth coming here but be aware there is a second section as we spent a lot of time on the first area and then needed to rush the second part as we have not given ourselves enough time. I would recommend coming here with children, just as a couple or as group of adults. I think small children would not appreciate it and although it does have interactive buttons, there only make small changes and you really need to look out for them. I think small children may become disinterested after time."
        }, 
        {
            "index": 128, 
            "rating": "5", 
            "review": "Loved it! So much fun!. We loved it! Lots of little scenes happening. There are buttons to press and you have to figure out what's happening. It was so much fun! You have got to visit it! There are funny scenes and some incredible ones too :) Fun for adults as well as for kids. There is a wooden board all around the attractions so you can stand on it and get a better view."
        }, 
        {
            "index": 129, 
            "rating": "5", 
            "review": "Easily overlooked. You have to fall over it! Excellent on a rainy day. Miniversum ( just down main road from the opera house towards chain bridge) Unless you fell over this attraction you wouldn't know it was there as there are no posters or promotional material outside and we nearly walked right past. Inside is a massive network of model railways complete with people, animals, famous buildings and landmarks with a whole host of interactive buttons to push to bring the model world alive, including movement, sound and vehicular movement, some of which is so slight it takes a while to work out what's moving. We entered free after filling out a questionnaire but I would definitely recommend this for children (or adults) on a wet afternoon as it will keep them amused for hours. There is also a child's play area and a small coffee bar."
        }, 
        {
            "index": 130, 
            "rating": "5", 
            "review": "Good for the casual observer but a real treat for the railway model hobbyist. Miniversum is not as large as the model railway display in Prague, and certainly not as large as the biggest in Europe (in Hamburg Germany), but what this display lacks in size (it is not small, being the 3rd largest after the above two), it makes up for in detail. We haven't seen the Hamburg layout yet but certainly in Prague, detail was sacrificed in favour of size. Miniversum made no such sacrifice and as a railway modeller myself, i can say that the detail here is superb. Everything is very well done, from greenery through to little street scenes. What it doesn't do which Prague does is cycle through night & day, but the layout has lights nevertheless.There are also many self-actuated aspects via push-buttons around the layouts. They are not labelled and you have to work out by observation what they do. Sadly though, many seemed not to work.There were many trains running, more than in Prague, and like Prague, there were scenes of the local city which can be recognised by tourist & local alike.IN SUMMARY, an excellent attraction if you are a railway modeller, or have young kids in tow, or are just interested in the hobby."
        }, 
        {
            "index": 131, 
            "rating": "5", 
            "review": "Really, really well done.. Brilliant! Such detail and so much to see. Hard to take it all in. Really good fun, especially with the buttons to press creating extra model movement, lighting and sounds. Many railway tracks / trains crisscrossed throughout.As an aside, the Hungarian / communist history boards were very interesting and easy to understand.Small cafe which we didn't try. Small shop.Very good value, we spent a very enjoyable 90 minutes there."
        }, 
        {
            "index": 132, 
            "rating": "4", 
            "review": "Fun for big kids too.. This is a gigantic model railroad with some history through in. I was not sure what to expect here. I thought it had to do with Hungary under the communists. There is some of that, blown up photos of Hungarian life during the 50's and 60's and some models of industry, one of the border fence with Austria. But mostly this is big train layout with tons of scenery of every sort. There are probably at least 50 trains running at any one time. The scenery is quit well done but there are some little things (intentional) that don't quit fit. There are buttons to push that cause little movements or lights or such, often hard to spot but that's part of the fun. A nice diversion for people of all ages, worth a visit."
        }, 
        {
            "index": 133, 
            "rating": "4", 
            "review": "Very interesting indeed!. We must have spent over 2 hours admiring the miniature buildings and moving modes of transport at Miniversum. Well done to all for the persons involved in this interesting project."
        }, 
        {
            "index": 134, 
            "rating": "4", 
            "review": "Better than expected. For a very small museum it packs a lot in, great for kids and adults who turn to kids when they see models. Doesn't take too long to see it all but a good rainy day activity with lots of interactivity."
        }, 
        {
            "index": 135, 
            "rating": "3", 
            "review": "Cute little miniature museum. Cute little miniature museum of places in Hungary and Austria. There were lots of interactive buttons to press, which made it quite interesting, but many of these were quite hard to spot, and only led to tiny amount of movements/lighting. This was quite fun to begin with, but starts to begin quite tedious after a while. There are some quite interesting details when one looks carefully, but nothing spectacular which would really impress. I personally enjoyed my trip here, but I've also been to more impressive miniature museums."
        }, 
        {
            "index": 136, 
            "rating": "4", 
            "review": "Wonderful Attention To Detail & Design. Since its opening a year back the Miniversum located in the historic Krausz Palace on Andrassy Avenue has grown in to one of the most popular sights of Budapest.You have to pre-book in advance the date & time & then buy the ticket on the spot.We had gone with some family friends & the Tkts for us was 1900 HUF & for kids 1300 HUF & thus proved to be affordable,easily accessible & open all the year round in a beautiful palace with so much fun for kids.The kids can make railway models in the playhouse activities.The beautifully constructed huge model railroad layout goes through important landmarks of Hungary,Austria & Germany.The road goes from the city park through the `Dracula`s Castle` in Budapest.The museum enhances the experience of the visitors with many interactive features.On the streets & squares through which the above train passes one can see forests & fields in great attention to detail & design which adds to the extra spice to the exhibition.There is a control room from which you can see the basic functioning of controlling the vast network of the rail lines from the control tower. You can also visit the small cafe for coffee & snacks. Worth while visit for a short time for both adults & kids."
        }, 
        {
            "index": 137, 
            "rating": "5", 
            "review": "trip through Hungary in miniature. Charming interactive model starting in Budapest, then more of Hungary, Austria and Germany. Very well organised so that children can become involved in the detail, pressing buttons for actions, lights and sounds. These are often hard to spot so all the wealth of little activities within the miniversum world has to be noticed to find the particular thing. Very pleasant staff, small cafe and playroom. Well worth visiting with children or model railway fanatics."
        }, 
        {
            "index": 138, 
            "rating": "5", 
            "review": "Brilliant. The attention to detail is amazing. The interactive displays really add to the experience, as you spend a good portion of your time looking for what you have just switched on and then noticing the little details as you look."
        }, 
        {
            "index": 139, 
            "rating": "5", 
            "review": "Brilliant model village. We visited here based on other trip advisor reviews and we were not disappointed - one of the biggest miniature model villages I have seen. The various parts of the city along with parts of Germany and Austria were so detailed - we felt like big kids! Highly recommended and dirt cheap to enter!"
        }, 
        {
            "index": 140, 
            "rating": "4", 
            "review": "So much detail - zoom in and explore.... A very detailed mini world. Added this to our itinerary at the last minute and glad that we did. I like the fact that hidden in the models are little details that remind you that the world is not perfect. For example a man on crutches with a broken leg,police arresting bank robbers, even a sniper on a roof top! The model builders have introduced some dark humour here and there. The trains are controlled by an impressive control room that you can also see."
        }, 
        {
            "index": 141, 
            "rating": "5", 
            "review": "Kid Sized Fun. A fun place to spend some time, the exhibit here is amazing in its detail and design. Take the time to examine each little scenario - the tiny protest riot in one place, the little house painters in another. And look for fun surprises, like the t-rex eating a family in their yard, the delivery man who took a face plant and dropped all his goods, and as a bonus, see if you can find Superman flying over the city!"
        }, 
        {
            "index": 142, 
            "rating": "2", 
            "review": "Okay for a 20 minute downpour. Very nice and interesting, but too small and not to focused on the details. Good for kids though, but they get bored quickly."
        }, 
        {
            "index": 143, 
            "rating": "5", 
            "review": "Mini world, mega fun!. We were passing by when we saw the sign. At first, we were not sure about visiting this place, but we finally got inside. Mini Budapest is almost as fun as the real version. We took tons of pictures and played with all the buttons and interactive controls they have there (you get to move trains, create sounds, turn on the lights...)It's good fun for kids AND adults. It's a must visit."
        }, 
        {
            "index": 144, 
            "rating": "4", 
            "review": "Delightful. Nice way to spend an hour in Budapest.Conveniently located in Andrassy near the Opera House. Very detailed models of parts of Hungary, Austria etc with some challenges on the way to press buttons and try and find the moving part of the model (not as easy as it sounds!)."
        }, 
        {
            "index": 145, 
            "rating": "5", 
            "review": "You have to see this to experience the whole of the model railway layout, excellent. As this was a model train layout, had to see the exhibit. I have never seen anything quite like this before, a huge layout with all sorts of trains running. Spectacular and a must if you like trains!"
        }, 
        {
            "index": 146, 
            "rating": "3", 
            "review": "Exactly what you expect it to be. A city of miniatures. It's pretty cool at first but once the novelty wears off of looking at European country side it gets a little dull. The detail in some parts is very good and the trains add a bit of life to the static. There are bits that move when you press certain buttons but we couldn't always figure out what bits.Some of the detail is very charming, I really liked a farm scene with tiny chickens that dance when a button is pushed.If you look closely there's a lot of humour in the everyday scenes, such as people falling over fruit, alien ,landings and general lots of little stories you can see being played out. I think it'd be better if there was more diversity in the displays, but it all put a smile on my face anyway. "
        }, 
        {
            "index": 147, 
            "rating": "5", 
            "review": "Be immersed in the details. If you are a fan of trains / modeling / architecture, or if you are with kids in Budapest, this place is a must-see!The level of details is amazing, the creators clearly put a lot of effort into this exhibition. I especially enjoyed the hidden \"easter eggs\" and the pop cultural references.Although some of the interactive functions did not work, it was really amusing when we discovered which button triggered which effect."
        }, 
        {
            "index": 148, 
            "rating": "5", 
            "review": "Stumbled across this am glad we did. It was a cold day and we were walking past with our nearly 3 year old saw this and thought we would go in. We were so glad we did as it was great fun and really interesting. Felt like we had a tour of Budapest without getting cold and wet!Our daughter loved all the buttons that she could press.Cafe not great but was fine for a drink and snack."
        }, 
        {
            "index": 149, 
            "rating": "5", 
            "review": "Fun for all ages. We spent a lot more time here than we thought we would. Someone here really loves building models and the detail is incredible. Lots of small children here having fun, but my kids are 19 and 21 and they were just as fascinated."
        }, 
        {
            "index": 150, 
            "rating": "4", 
            "review": "What a great museum for all ages!. Seemed like something different, and the whole family really liked it! Found ourselves spending lots of time here looking for fun details a la \"Where's Waldo.\" Educational historic signs with photos of communist era was also interesting. Plus we all liked pushing the buttons to see what happens. Better than we expected. Would recommend for all ages."
        }, 
        {
            "index": 151, 
            "rating": "5", 
            "review": "Must see for adults and kids. We planned to visit this place for 15-20 minutes, but stayed here for 3 hours. Lots of buttons, where you can influence the action. Everything is so real and so well designed and thought about.Kids and adults can find a lot of interesting to see and watch. Trains go, stop, change destination, a lot of scenes (car crashes, windmills, aliens coming, godzilla, firefighters in action, ambulance etc.)There's a room where you can also try making railway with such trains, cafe, children's room.I could hardly talk my husband and son to finally finish watching it all."
        }, 
        {
            "index": 152, 
            "rating": "4", 
            "review": "Nice place for kids . Nice place for kids. Miniatures to see with interactions for kids (trains moving, lights turning on and sounds to play.) Recommended."
        }, 
        {
            "index": 153, 
            "rating": "5", 
            "review": "Family . Beautiful place to spend one to two hours with kids on rainy day. Panels with miniatures will make you feel like a child. Miniversum world of trains is perfect coordinated with real technical solutions. Go there you won't be sorry."
        }, 
        {
            "index": 154, 
            "rating": "5", 
            "review": "Be kids - have fun!. Joyful place for kids and adults alike. Just forget adulthood for 1-2 hours and return to the time when everything could bring joy :-)"
        }, 
        {
            "index": 155, 
            "rating": "5", 
            "review": "A real history lesson. A walk through the main part of Miniversum is an authentic lesson about the communist period in Hungary. Apart from the models themselves, there are clear and interesting panels on the walls with a lot of pictures and info about the post war period. Of course, the model trains are worth a visit even if you are not interested in history at all!"
        }, 
        {
            "index": 156, 
            "rating": "5", 
            "review": "Try something different than museums. What makes a 30-year old man feel like a child in a candy store? This place.Though as a model train enthusiast it's easy to see f.e. the buildings are just built model kits and it is not of the best quality what comes to model railroading, it is awesome. The biggest display is Hungary-themed, and is made well to look like it. There is also displays themed Vienna and Germany, and some small Eastern Europe-themed scenes on windows. The scenes are filled with funny details and interactive visitor-controlled gadgets like flashing lights etc.Ticket price was only a few euros, so it is highly recommended. Very nice and friendly staff that have an interest of your visit. Also a small shop at the end of the tour to buy model trains, accessories, toys or Miniversum-themed stuff like coffee cups (i had to buy one)."
        }, 
        {
            "index": 157, 
            "rating": "5", 
            "review": "It is a lovely place. my guide Tamas suggested to go there. lovely ploting board you can see where the trains are going, and see the miniatures of Budapest, Hungary, Austria and part of Germany. It is quite interesting for children, but for adults aswell."
        }, 
        {
            "index": 158, 
            "rating": "5", 
            "review": "Not just for kids. This exhibition is a miniaturized display of Budapest as well as fascinating photography and displays describing life under Soviet occupation. The exhibit is quite fascinating in its detail and the history and pictorials are excellent. Worthwhile adults as well as families with children."
        }, 
        {
            "index": 159, 
            "rating": "4", 
            "review": "Interesting. Though the entrance fee was bit higher than regular , it was an interesting find during our trip. Could have been better if we were travelling with kids. The place has potential and can imporve more. Trains are fascinating :)"
        }, 
        {
            "index": 160, 
            "rating": "5", 
            "review": "Amazing Surprise. When my boyfriend wanted to do this I thought it was too silly. We ended up spending 2 hours learning about Hungary, and communism in Hungary. It was very informative and fun. There are buttons that control different parts of the exhibition, and it's a fun game of \"I spy.\" The staff and exhibits are multilingual. They accepted card and local currency. There is also a little cafe in middle! It was the most information I got on life in communism my entire trip, and seeing the sights here helped me later around the city and when we drove out of the city."
        }, 
        {
            "index": 161, 
            "rating": "4", 
            "review": "Interesting place. I think this is a place to take children but we enjoyed it too. The models are amazing and it is quite good fun watching the model trains go round. The detail is what makes this attraction worth visiting. We enjoyed it very much"
        }, 
        {
            "index": 162, 
            "rating": "5", 
            "review": "Fascinating. Model train buffs and kids will love this. Fabulous to-scale models of Hungarian cites with trains running throughout. Interactive buttons allow viewers to turn on/off various functions through the exhibit. Loved it!"
        }, 
        {
            "index": 163, 
            "rating": "5", 
            "review": "Amazing, fantastic. Very precise details. I liked the most the part where they show a place selling new cars - when you get closer you can see the small replika TRABANT cars :DDD"
        }, 
        {
            "index": 164, 
            "rating": "4", 
            "review": "MIniversum. It is a very nice place. Try to go in the evening, when they close the light. Not only for families."
        }, 
        {
            "index": 165, 
            "rating": "5", 
            "review": "IT'S A MUST!!!. Please don't miss this place. You won't regret. Don't listen to that couple reviews that say negative things about Miniversum. I could have spent all day here. There's a lot of detail in everything. The scenes are great. You will find things you wouldn't imagine. Best train model I have seen so far! Congratulations."
        }, 
        {
            "index": 166, 
            "rating": "5", 
            "review": "Very well modelled. Looks like a museum for children but very interesting.The models are superb with fantastic railways.Worth a visit"
        }, 
        {
            "index": 167, 
            "rating": "4", 
            "review": "Small trains. The layout is really large, there are model trains going back and forth. Unfortunately the controls are incorrectly labelled so it is sometimes difficult to spot if a button controls the lights or the movement of something. The buildings, the vehicles and the people are really detailed. There are hidden jokes everywhere. The only problem is the price, 16 euros for a family with two adults is too much in my opinion."
        }, 
        {
            "index": 168, 
            "rating": "5", 
            "review": "Miniature Lovers Stop Here. We really enjoyed an hour here one morning. Displays are great and have buttons you can push to make sounds or make things move. They have huge areas set up with displys on Budapest, the countryside, Germany, etc. So much to observe."
        }, 
        {
            "index": 169, 
            "rating": "5", 
            "review": "Really fun. A must for all the big kids out there. Really good fun with some lovely models, but it was also really informative. Loved seeing the control room where they monitor the trains."
        }, 
        {
            "index": 170, 
            "rating": "4", 
            "review": "Worth visiting. I had this on my itinerary after seeing it on tripadvisor. Children would love it, but it is also pleasant for adults to see. The detail is sensational with some guidance text in English, German and Hungarian. Good activity if you hit a spot of rainy weather."
        }, 
        {
            "index": 171, 
            "rating": "5", 
            "review": "Fun time. Me and my friend visited Miniversum and it was very good, but it is probably more appropriate for kids."
        }, 
        {
            "index": 172, 
            "rating": "3", 
            "review": "Bwah. It was nice to look at, but the details were not really good. There were some interactive spots, but it was hard to figure out what the point is. It's also difficult to know what you're seeing if you have only been in Budapest, because there is not much explanation"
        }, 
        {
            "index": 173, 
            "rating": "5", 
            "review": "Great fun. Found this by accident after going to Hungarian State Opera House. Had a good hour and a half here acting like big kids and pressing all the buttons to activate lights, actions or sounds. Beautifully constructed."
        }, 
        {
            "index": 174, 
            "rating": "5", 
            "review": "Don't miss this when you got to Budapest!. It was purely by chance that we came across Miniversum and what a gem it proved to be! My partner and I were completely bowled over by the amazing model railway layouts of Budapest, Vienna and many other towns and cities in Hungary, Austria and Germany. The attention to detail was amazing and we loved pressing the different buttons to activate sound, light or motion. (Our 6 year old grandson would have loved it too!!). An added bonus was the detailed information and photos on the walls about Hungary in the Communist era which was fascinating. I would recommend Miniversum to anyone visiting Budapest. We spent 2 hours there and loved it. Apparently Miniversum has only been open a year which explains why it didn't feature in our guide books. Our hotel (only 5 minutes away) had many interesting brochures on display - but not Miniversum. A pity, as Miniversum was one of the highlights of our trip and I'm sure would benefit from extra publicity."
        }, 
        {
            "index": 175, 
            "rating": "5", 
            "review": "Way cool. Excellent. Miniature Hungarian, Austrian and German villages set around incredible model trains. It is life under communism and they really do a great job of telling the story. Loved it. Right up there with the National Gallery. A must for any visit. Close to the Basilica on Andrassy."
        }, 
        {
            "index": 176, 
            "rating": "5", 
            "review": "Nice expirience for adults and kids. Miniversum visit was one of things I planned in advance.We have great fun, myself but also my two sons (10 and 4 yr).Its true, there are that kind of attractions in many European cities, but we had very nice 60 minutes there."
        }, 
        {
            "index": 177, 
            "rating": "5", 
            "review": "History in miniature. Truly remarkable train display in miniature! The display itself is a modellers nirvana, with the quality of the models, landscaping and shear attention to detail quiet extraordinary. The main section covers the communist occupation period of Hungary, with smaller areas covering other significant periods of history. All sections are linked and some interactivity is possible. Irrespective of gender, age or background, whether you like model trains or not, there is something about this display that will not only leave you smiling, but will make you just that little bit more knowledgable and informed about Hungary.Located on one of the major city streets in the CBD, the venue is easily accessible and inexpensive."
        }, 
        {
            "index": 178, 
            "rating": "5", 
            "review": "quirky little attraction. We went on a rainy thurs morn so it was quiet. Great little place so much to look at. Basically its a modal village with interactions but there is so much detail to look it. Its lots of fun & reasonable price aswell"
        }, 
        {
            "index": 179, 
            "rating": "4", 
            "review": "Something for train models lovers. Miniversum is a really wonderful place both for children and adults. You will find miniature versions of several Hungarian, Austrian and German towns and cities with their train stations and top attractions. And an innumerable amount of trains rushes through all this miniature country. We've seen a greater miniature railway world in Prague but this one is very nice too."
        }, 
        {
            "index": 180, 
            "rating": "5", 
            "review": "Excellent attention to detail. This is an exceptional model village. Buildings from Budapest and beyond are accurately represented but what makes this exhibit really special is the attention to detail and in the interactive features. Every scene features either moving parts, lights or sound or all 3. A combination of buttons allow you to make vehicles, animals, people or other features move, light up or make sound. The movements can be very subtle so it is very effective in getting you to look closely at the details. In addition to this, the characters in each come to life in the way they have been thoughtfully arranged and fit together so that each scene tells a story. Careful observation will show you hens pecking in the farmyard, a fire engine at the scene with moving 'water', flashing lights and sirens, paramedics giving CPR at the scene of an accident to name just a few. A miniature masterpiece that needs a lot more advertising to give it the attention it deserves."
        }, 
        {
            "index": 181, 
            "rating": "4", 
            "review": "Nice to see ... not particularily spectacular but OK. It's nicely done ... displays are well made ... buttons are there to switch sounds and lights on and off ... very funny, especially for kids ... worth spending an hour there"
        }, 
        {
            "index": 182, 
            "rating": "4", 
            "review": "Extremely well done. The strength of this attraction is in the small details. The more you look; the more you see. It's utterly fascinating and, if you like miniatures, you'll love this."
        }, 
        {
            "index": 183, 
            "rating": "4", 
            "review": "Such attention to detail. We came on this almost by accident and it is a gem. It kept us occupied for almost two hours and I'd happily go back. The kids were mesmerised and it was a great way to introduce them to some of the history of Hungary."
        }, 
        {
            "index": 184, 
            "rating": "5", 
            "review": "great for all ages. We loved the Miniversum! The \"Life under communism\" exhibition was fabulous....running alongside the miniature display it gives the adults something to learn about while the children enjoyed the various interactive options the display gives (which button makes what happen??!)I would highly recommend doing this early in your trip to Budapest. It was not expensive and we spent longer in there than I would have thought (about an hour or so). The \"Control Room\" is fascinating and the operators are more than happy to talk - while they are controlling the many are varied trains! Easy to get to, on the way out to Hero's square and the Baths. A definite to do in Budapest."
        }, 
        {
            "index": 185, 
            "rating": "5", 
            "review": "Really relaxing first stop on our holiday. Just half an hour after arriving in Budapest, we visited this attraction. We were all pretty tired after a long journey from the UK, and Miniversum turned out to be the perfect first stop. The railway has been beautifully created and there is so much amazing detail to see. In addition, the display boards with information about life under communism were really informative and an excellent introduction to Hungary for our teenage boys."
        }, 
        {
            "index": 186, 
            "rating": "5", 
            "review": "Fascinating display . I visited this with my husband today and we both really enjoyed it. It is beautifully put together with lots of attention to detail. We could have spent hours looking at it. The interactive buttons were a lot of fun and the \"Life under communism\" exhibition was really interesting."
        }, 
        {
            "index": 187, 
            "rating": "4", 
            "review": "Great experience for both children and adults. Very nicely made, giant sand table.You can spent 3-4 hours there with your chidlren without getting bored.There playhous part and a small coffee shop on the area of the exhibition.But it is a little bit expensive..."
        }, 
        {
            "index": 188, 
            "rating": "5", 
            "review": "Unbelievable. I saw this advertised on one of the bus trip leaflets and as we happened to pass it on our way back to the hotel, we dropped in. What a surprise, a miniature view of parts of europe with a model train persons paradise mixed in. I could have stayed there for hours, every section including parts on the cold war had a small panel of buttons which did things in the scene.I was delighted to find a one inch paramedic carrying out CPR on a body actually moving up and down when the right button was pressed. Every scene had trains rushing to and fro and out through walls to appear in another country before returning. The best part was that in every little corner there was a little story happening, a wedding, an oompah band, a crashed lorry, police arresting someone, etc. It was absolutely wonderful, I just wish I had more time to spend looking around."
        }, 
        {
            "index": 189, 
            "rating": "5", 
            "review": "Perfect place for a rainy day. Fascinating place for not only a children. Truly speaking there are not many things to visit with a child in Budapest, for me that one was the best one."
        }, 
        {
            "index": 190, 
            "rating": "5", 
            "review": "Return to childhood!. This is an must see place in Budapest, especially for kids but for adults also.You will admire the trains and the details of each scene - they are just incredible!"
        }, 
        {
            "index": 191, 
            "rating": "4", 
            "review": "nice way to spend an hour or so. we have three teen daughters and we're all kind of geeky -- we really enjoyed walking around and looking at the HO scale trains and representations of various areas around hungary and austria. so much detail -- mountain climbers, ski lift, monastery, hippies camping out, outhouses, chickens, fountains, accidents galore, one guy performing cpr, etc. posters explaining life during communism were interesting and you could push buttons around the exhibit to light certain things up or make things whirr. we enjoyed our time here. about USD$20 for 3 kids and two adults."
        }, 
        {
            "index": 192, 
            "rating": "4", 
            "review": "Nice Find!!!. My family stumbled upon this relatively new Budapest attraction on a walk to Heroes Square. We never made it to Heroes Square instead choosing to take a chance here. Our kids loved this place. The exhibits extremely well done and highly interactive. Most fascinating to me was the exhibit Life Under Communism that runs through the Hungary exhibit. As someone who never lived under Marx's great mistake it is highly educational to walk among those who did and endured. The placards are highly worth reading as you stroll the exhibit."
        }, 
        {
            "index": 193, 
            "rating": "4", 
            "review": "Great but not for small children.. Great venue, but NOT for children under 6. Really fantastic if you love trains. Thats all l i Can say abort this"
        }, 
        {
            "index": 194, 
            "rating": "5", 
            "review": "Great place for kids. Giant model railroad. Simple as that. Nice break from museums and other serious stuff. Some interactivity too. And of course nice for us photography enthusiast to do some miniature photography."
        }, 
        {
            "index": 195, 
            "rating": "5", 
            "review": "Weird and Wonderful!. I went with my 9 year old daughter and we had a great time. It's a rather strange collection of scenes. Many are interactive too, although not always easy to spot what the buttons actually do. We had a great time looking for the 'romantic couple' who always had a red love heart balloon. My favourite ones were spotting Tarzan and Jane ones and also a couple doing the final scene from Dirty Dancing in a lake. There were also some rather odd little details if you look carefully. We did enjoy giving stories to some of the scenes. I wish the communist scenes were a bit more authentic, with relevant minitures. Sometimes new Mercs, Mini's etc would pop into them! But that's me being pedantic. We spent about 1.5 hours there and were glad we went."
        }, 
        {
            "index": 196, 
            "rating": "5", 
            "review": "I love miniature anything. My boyfriend and I passed by this little museum by our hotel late at night and we had to go in and visit when it was open the next day. We had visited Wein by train the day before so it was really neat to see the mini versions of the train stations and some of the popular sites that we recognized from Wein and Budapest. The detail is just amazing! I enjoyed looking at the tiny people figurines and looking at what they were doing, my boyfriend was just floored by the technical aspect of it all. So many trains, lights and moving parts. So cool! Totally worth the visit!!"
        }, 
        {
            "index": 197, 
            "rating": "4", 
            "review": "The mini mini funny Budapest.... This museum was really beautiful, full of little miniatures, trains and interactive buttons, I loved it and I completely recommend it :)"
        }, 
        {
            "index": 198, 
            "rating": "5", 
            "review": "Loved it!. We spent a lot more time there than we expected - there was so much to see, and tons of details in miniature. There is also a small cafe, and a kids play area in case they get bored of looking at the miniatures. None of us got bored though. Fantastic!"
        }, 
        {
            "index": 199, 
            "rating": "5", 
            "review": "Well built and lots of fun. You can spend hours walking and looking at all the small details on the makett table - where Hungary's main cities and present and past life and culture unfolds in front of your eyes. A lot of interactive elements too. Great with kids, but recommended for adults as well."
        }, 
        {
            "index": 200, 
            "rating": "5", 
            "review": "I start to love miniatures. there is a place for age 5-555... Magic town is build with a lot of trains and historical buildings. Also there is classes for kings how to build their own railway. Highly recommend to visit."
        }, 
        {
            "index": 201, 
            "rating": "5", 
            "review": "Place for all ages fro 8-108. The staff is very friendly and, and the exhibit is very rich and interactive.I'm a miniature lover, and therefore I was amazed with the details. The trains are incredible, and all the scenarios are amazing. During my visit my mini me traveled by train trough Hungary and Austria with huge delight.There is a space for kids to play with trains, and get there first contact with this wonderful mini universe, and also a shop for the less young and even for the collectors. The prices are quite fair for the miniatures. You can also have a nice coffee and a quick snack wile you visit, and the prices at the miniversum cafeteria are quite good.Is a time well spent, and if you have small kids they will love it. Only one thing to point out, there should be more information in English, anyway is not a show stopper for the visit.I loved it very much."
        }, 
        {
            "index": 202, 
            "rating": "4", 
            "review": "Tiny little museum, big story. The staff are very friendly. I wandered in here the first time looking for the English language used book store, but was so taken with the idea of the miniversum I came back. This is a kid friendly place that does a good job telling the difficult story of Eastern Europe"
        }, 
        {
            "index": 203, 
            "rating": "4", 
            "review": "Mini..ature. Its nice to see the smaller version of Budapest and Vienna, with so much details. Good place for families, especially a lot of the visitors with children. Well worth a visit.."
        }, 
        {
            "index": 204, 
            "rating": "5", 
            "review": "Really fun for adults and children. Took my grandchildren who loved it, but I did too! Hungary and Austria re-created in miniature, with interactive buttons to make parts move or light up... the best fun for a couple of hours."
        }, 
        {
            "index": 205, 
            "rating": "5", 
            "review": "Unsuspected. When we were planning our trip to Budapest, my partner and I put this exibition on our 'if we had time' list. So when we visited, it left us apsolutrly in awe. The tiny figures and the architecture is apsolutely amating and paired with tiny train it was apsolitely phenomenal."
        }, 
        {
            "index": 206, 
            "rating": "5", 
            "review": "Surprise visit!. Walking down the street and saw this exhibition. Was attracted to bit about life under communism but a bit put off by the fact that it appeared to be all model railways. However in the end we were enchanted by the whole thing and it would be a must for under 12's"
        }, 
        {
            "index": 207, 
            "rating": "5", 
            "review": "Spectacular. On a recent visit we came accross this building. It is spectacular and well worth seeking out. It is every child's dream and is of interest to adults also"
        }, 
        {
            "index": 208, 
            "rating": "5", 
            "review": "Cooooooooool. Definitely the best museum ever! :DI was so devastated and tired when i came across this museum! Tickets weren't so expensive so bf and me entered! I felt like kid again! It was sooooo cool playing with trains and people!It is cool to see that someone payed attention to every detail! I mean, people are 1/5 mm high and everything is according to their size! Some of them you can move with some remote controls given! And details! What more to tell that the lace is painted on the windows like curtains! Fruit in supermarkets, only few micrometers big!! If you have respect to this such of work, then this museum is a definitely must see!"
        }, 
        {
            "index": 209, 
            "rating": "5", 
            "review": "Family fun. We visited Miniversum with our 10 year old twins and they really loved it, especially the interactive parts. The attention to detail is fantastic and will appeal to all ages. It is a good break from culture for children (and adults!) and we would definitely recommend it."
        }, 
        {
            "index": 210, 
            "rating": "4", 
            "review": "Fun little place . We were walking on the shopping street and passed by this place. We decided to go in. Small admission fee. It didn't take long to see everything ... an hour at most. You can see Budapest and Vienna in miniatures. Very detailed. I don't think all the lights, sounds, and movements worked for the miniatures. Nonetheless, it was fun for the kids."
        }, 
        {
            "index": 211, 
            "rating": "4", 
            "review": "Lots to find. We spent maybe an hour here and it was great for all ages. There are buttons to press and loads of hidden secrets - we managed to find Tarzan and a dinosaur in someone's back garden, but I'm sure there are more to find! The history and information screens were also really insteresting. Only downside - we wanted to stop in the cafe but there was no one around to serve us although we waited a while."
        }, 
        {
            "index": 212, 
            "rating": "4", 
            "review": "Well worth a visit.. In essence it's a large model railway. However, the attention to detail is spellbinding, with plenty of buttons to press to keep the young and young at Heart amused."
        }, 
        {
            "index": 213, 
            "rating": "5", 
            "review": "A must see for families. For any model train fans or families travelling with kids this is a must see. Very reasonable entry fee and the interactive displays keep the kids amused for quite a while."
        }, 
        {
            "index": 214, 
            "rating": "4", 
            "review": "What a little gem!. We found Miniverse in the hotel guide book. It was such a lot of fun. At first we thought that it seemed a bit expensive for a model railway but this was simply fabulous and the four of us were entranced and entertained for much longer than we had expected. The model making is of a really high standard and the dioramas are full of llittle everyday incidents and surprises. Oh, it's also a pretty good representation of bits of Budapest along with neighbouring areas and even a station in Vienna. The trains are fab - on your way out don't miss taking a look at the complex control systems that allow the staff to spot any mechanical errors and sort them out. Small it may be, missable it's not."
        }, 
        {
            "index": 215, 
            "rating": "5", 
            "review": "Fantastic for all ages!. this has to be the best model of the city, villages, countryside and trains I've ever seen. Fantastic for the kids as it's interactive and we all had a ball trying to work out what button operates what. They also liked recognising places we'd been too!"
        }, 
        {
            "index": 216, 
            "rating": "5", 
            "review": "Crank the childish you up a notch. I went there with my girlfriend, both of us in our mid 30s and loved it a lot. Spent 2 hours there. You cannot compare it to the one in Germany, but these guys have put a lot of effort into the project and deserve to get a lot of support as well. I absolutely loved it, played with all the interactive buttons trying to figure out what they start or what actions they are linked to. Some buttons need to be fixed, as they haven't worked properly, but they got the action started in the end. If you are not into doing childish things, just have a look at the trains and engines which work and travel on the boards. The price is good (around 6 EUR/adult) for the time spent. If you are obsessed with details, you probably need to book some more hours in there.There is a nice cafeteria inside, where we got a free drink with the mini-cards we got from the hotel."
        }, 
        {
            "index": 217, 
            "rating": "4", 
            "review": "Lovely surprise. Popped in off street. Chatty girl welcomed us and we wandered around watching &listening to chuffy train's while enjoying the beautiful mini landscape."
        }, 
        {
            "index": 218, 
            "rating": "3", 
            "review": "Ok.... I think this was ~€5 entry and it was nice but really for kids as it only takes a very short time unless you've got some childlike wonder handy :) it's not somewhere I'd pay to go again although there was some interesting info provided about Hungarian history. I didn't try the cafe. Spent ~20 mins walking through"
        }, 
        {
            "index": 219, 
            "rating": "5", 
            "review": "Miniature Fun. Came here with my fiancée after seeing a poster on the metro. Its a great use of and hour or two and worth the visit.A miniature replica of Budapest and other European cities. There are plenty of interactive buttons which set something moving or a sound going off or lights flashing, a big part of the fun is finding what each button does.The models are so detailed, a huge amount of effort must have gone into this place. There are so many model trains traversing these huge mini cities that there is a control room monitoring all the train lines.Kids and big kids will love this place, I did!"
        }, 
        {
            "index": 220, 
            "rating": "4", 
            "review": "Exactly as it sounds. A must if you love trains.exquisite miniatures of the famous landmarks of Budapest, took about 90 minutes to walk through. There are interactive parts, which I considered more like a hunt for what moves. It is not always clear what the buttons do so you will often have to scour the scene to find a man chopping grass or something. Regardless, it was a really enjoyable experience and contained some of the history of the city as well which was very interesting and would not have found elsewhere. Appropriate price."
        }, 
        {
            "index": 221, 
            "rating": "4", 
            "review": "Meant for kids but had a ball. Mini town museum of Hungary. Suppose it is meant for kids but my wife and I ventured in and ended up having a ball. Got there between 6.30 and 7 pm when they switch of the main lights to bring mini town to life. Was great fun. Also lots of details with towns and running trains."
        }, 
        {
            "index": 222, 
            "rating": "5", 
            "review": "Please make the time to go here. We don't have kids on this trip with us, but we behaved like kids ourselves. The displays are fantastic and at 6pm they turned the lights off so that we could experience the mini towns with their own lights on as a night time scene. Well worth the small entrance fee"
        }, 
        {
            "index": 223, 
            "rating": "3", 
            "review": "5 mins from the opera and not expensive. if you go to the opera then pass by minversum its small and nice wont take half an hr and very cheap and the staff are super nice"
        }, 
        {
            "index": 224, 
            "rating": "5", 
            "review": "Fantastic. We stumbled upon Miniversum accidentally and made plans to go back there. We weren't disappointed.While model railways and miniature landscapes may not be everyone's cup of tea (their loss) - if you have even one gram of child-like wonder left in you, you will be delighted by the level of detail captured in every scene. To rush is to miss everything. Whether it's the stocked shelves in barely visible shops, rioting skinheads or paragliding adrenaline junkies in the alps, the depth of detail and life in the layouts is staggering. Visitors can observe the operators in the control room and workshop, and presumably ask questions (we didn't) There's also a coffee shop and children's play area on site. Highly recommended. Lose yourself for an hour!"
        }, 
        {
            "index": 225, 
            "rating": "5", 
            "review": "World class miniatures. Excellent indoor version of Rotterdam's Madurodam and Brussel's Mini Europe. Great level of detail, lively miniature replica of Budapest, and other Hungarian and Austrian cities. We were lucky to catch the half hour night time, when main lights go off, and models turn into evening mode."
        }, 
        {
            "index": 226, 
            "rating": "5", 
            "review": "Minature masterpiece. Enthralling attraction with never ending detail to wonder at. It is brilliantly crafted and very well presented. Lots of buttons to press and the night scene when they turn off the lights is spectacular. Helps if you like model trains !"
        }, 
        {
            "index": 227, 
            "rating": "5", 
            "review": "Great place to visit while in Budapest, with or without children. We visited the place early on a Saturday afternoon, we had the luck to arrive when it was still quite empty, it got fairly crowded later that afternoon. My girls loved the place, it is really well done with a lot of things to look at, and some interesting information for both children and adults. It's a great way to spend 2 hours if the weather isn't great..."
        }, 
        {
            "index": 228, 
            "rating": "4", 
            "review": "Interesting place for kid and adult. This place is perfect for everybody including kids.During our visit to Hungary, for my 8 yrs old daughter, this place is the highlight of the trip.There basically we can see mini version of Hungary and Austria famous places.It is so interactive because there are so many buttons that anybody can press to activate certain movement/action in this mini world.If you have kid and you are in Budapest, I suggest to visit this place.Easily you can spend 1-2 hrs here."
        }, 
        {
            "index": 229, 
            "rating": "4", 
            "review": "Perfect for a rainy afternoon with kids. A very detailed miniature world down Andrassy utca. The world includes several areas of Hungary and surrounding countries. Lots of interactive buttons for lights and sounds, kids will love it. (And so will some adults that are still young at heart)"
        }, 
        {
            "index": 230, 
            "rating": "5", 
            "review": "MORE THERE THAN MEETS THE EYE. Stopped here to kill time while waiting for the Opera House Concert.It is a delightful model train display.From the outside it simply looked like a storefront exhibit.We almost walked away until an employee showed us that there was a hallway to vastly larger display rooms. Hidden from view was a vast wonderland of scenery representing Germany and Austria. It included country villages,castles,churches and mountains.I was most impressed with an incredible scale model of the train station I had just arrived at; Keletti in Budpest.It was unbelievably real.Hero's square is also represented.This is a train buff's delight. I was pleased to see that they are considerate of their customers furnishing a clean available restroom. There is a small snack bar where parents can relax while the kids explore the whole layout. They don't take advantage of you either charging reasonable prices. Model train buffs have a lot to see: 600 villages, 5000 little people,1000 autos, and 100 trains. I like the fact that they accommodate tourists with a 19:00 closing on weekdays and 2100 on weekends- no locking up at 5 here.I thought 1900 HUF adult fare a little pricey but there is a family ticket that covers 2 adults and 3 children for under $20 US dollars and the rent on Andrassy ut is not cheap. I predict this newattraction will soon be number 1 in Budapest.Glad I didn't miss it."
        }, 
        {
            "index": 231, 
            "rating": "5", 
            "review": "miniversum a world of wonder in miniature. Stumbled across this wonderful place on our first night in Budapest, absolutely fantastic few hours."
        }, 
        {
            "index": 232, 
            "rating": "5", 
            "review": "Utterly charming. Miniversum is a wonderful little world of Hungarian, Austrian and German cityscapes and countryside. It's complete with running trains, interactive elements and incredible detail of tiny people going about their varied lives. It's an utterly fascinating and beguiling way to spend some time and kids would love it."
        }, 
        {
            "index": 233, 
            "rating": "5", 
            "review": "Fun! for kids and adults. Miniversum is a display of models of some Hungarian and Austrian cities, all connected by a vast network of railroads constantly roamed by multiple little trains. I was impressed by the impeccable details that show how much the creators of these models love their job! Small people attending to their business, protesters, Christmas deer on the roof, - these cities live their own lives, and you can take some part by pushing buttons. Fans of trains can buy postards with trains in the gift shop.This wonderful place made me want to get a railroad set for Christmas! I guess I got too carried away!By the way, keep your entry ticket - it gives discount for the Ferris Wheel on Deak Ferenc Ter."
        }, 
        {
            "index": 234, 
            "rating": "5", 
            "review": "Enjoyable with kids. I visited this place with my 9 year-old niece - she absolutely loved it! There are not only the constantly moving little trains, but also tiny people, mini versions of real landmark buildings. Boys and even girls are totally absorbed here!"
        }, 
        {
            "index": 235, 
            "rating": "4", 
            "review": "Nice option for kids. Interesting details, nice small city. Our son very interested in miniversum especially trains. You can spend reasonable money and time."
        }, 
        {
            "index": 236, 
            "rating": "4", 
            "review": "Good thing to do at night, especially kids. Many things close at 4 or 5. This is good to do on a rainy day or at night. I usually whip through museums and things very fast. I would've done it here as well (like 20-30min) if they hadn't shut off the lights for 30min and lit up the display so I waited until the lights came in so I could take pics. It's hard to take pictures when dark but kind of fun. I'm not sure if they make it dark and turn on the lights when it is light outside, maybe it's just after dark. Costs 1900 Hungarian"
        }, 
        {
            "index": 237, 
            "rating": "4", 
            "review": "Worth visiting!. Larger than I expected. Childrend really enjoyed it. There are many interesting details to investigate. There is also a playroom for smaller children. The tour takes about 60-90 minutes."
        }, 
        {
            "index": 238, 
            "rating": "4", 
            "review": "Fun little museum . This place was a cute little model museum, and a nice way to spend an hour or so in a lighthearted environment. While probably more targeted towards kids, if you like model cities, trains etc it is quite a good setup. There are various buttons to push that set off lights, motion and sounds. Some other reviewers have said that they are not working, but that isn't true. Rather, it's a bit of a 'where's Wally' where you have to look hard for the motion or lights - but they're definitely there!If you had kids this would be a great little stop."
        }, 
        {
            "index": 239, 
            "rating": "4", 
            "review": "A great little spot for an hour or so.... A fun, interactive miniature museum. Kept myself and my twelve year old daughter occupied for an hour or two. It's fun trying to figure out what the interactive controls move or light up. Although I'm not convinced every one of them was working! Really glad we went."
        }, 
        {
            "index": 240, 
            "rating": "4", 
            "review": "Amazing place for miniature lovers. Went in chance as we've stumbled upon it while walking on Andrassy Blvd - and it was an amazing experience. This was the first time I saw a miniature expo so I really enjoyed it.If you want a even better view of the miniature and attention to details you should sit on the benches and look thru the window - like this you can better appreciate the details and effort put into this."
        }, 
        {
            "index": 241, 
            "rating": "5", 
            "review": "Spectacular.. This is a new centre. Up to the minute electronic computer controls. It is a must for train and model railway enthusiasts.my wife found it interesting too!"
        }, 
        {
            "index": 242, 
            "rating": "5", 
            "review": "simply amazing. For big and small, an amazing indoor activity. So much effort put in these detailed models. Even in the characters of people if you pay close attention. Some stops show the real picture that you can compare with. My child (5 y) and myself where so happy to have been here. Will go again ...."
        }, 
        {
            "index": 243, 
            "rating": "5", 
            "review": "worth visiting for miniature lover!. we definitely enjoyed the detailed models in this museum. The miniatures,buildings, landscape and figures are soooooooooo detail and nice! feel free to interact with the miniatures and explore on some of the funny stories hidden within the models. stay and enjoy longer. we appreciate the hard work."
        }, 
        {
            "index": 244, 
            "rating": "4", 
            "review": "See Wee Bits of Hungary, Austria and Germany. The Miniversum is a refreshing stop along the wealthy Andrássy ut. In about an hour or less you can get a taste of various scenes of life along the Danube in 3 countries. There's interactive buttons to make sounds, flash lights, and start windmills or open an outhouse door. The creators evidently have a passion as well as a sense of humor - the Dinosaur in Austria and the man relieving himself on a military installment in Hungary were fun finds."
        }, 
        {
            "index": 245, 
            "rating": "2", 
            "review": "Much better exibitions in Europe. Found on the net (search for model train exhibition in Budapest). Easy to find, good web site description. Although recommended by the vendor to book advance (maybe just a good marketing tool), we were there Sunday noon, no crowd.Disappointed to my son (4ys old) and to me since the model layout is narrow due to the room provided limits and the exhibition lacks any logic how its sections continue from one room to the next one. No interactivity although kids can push some bottoms to switch on and off some lamps. More than half did not work by the way.As shown on the photos, many elements were a bit weird such as shape of the football stadium is trapeze due to the room shape where the model was laid down, a highway is cut off. There is a lake which is plastic painted into green. I have seen so many models where water was used for various purposes (lakes, waterfalls, fountains, etc).The price was 15 EUR for 2I will not return"
        }, 
        {
            "index": 246, 
            "rating": "5", 
            "review": "Miniversum, Budapest. As a young boy, I wanted to be a train driver, back in the days of steam ;-) I recently saw this attraction on a well known video sharing website and was inspired to visit.Miniversum is located on Andrassy Street, not far from the centre of town and easy to get to by walking or by Metro Line 1. I think the cost of entry (HUF1900 for adults, HUF1300 under14's and family tickets available) was very reasonable. It is possible to book tickets through their website, and this seems to be aimed at making sure that there are not to many people there during peak times, which would reduce the experience. The three main layouts take you on a journey through parts of Hungary,Austria and Germany, and show many well known landmarks in each of these areas. The buildings are, as far as I am aware, all hand built, and clearly to a very high and detailed standard.There is an interactive element to the layouts where visitors can press colour coded buttons to activate motions, light or sound on the layout. Some did not appear to be working, but that really didn't take much away from the experience. There is a lot of small detail and humour built into the layout. Figures are seen sun bathing on a roof terrace, police attending an accident, tramps sleeping by the side of the street, and much more. The layouts are computer controlled and you can see the monitors and handling software in operation at the end of the layouts.A small cafe operates in the building, which is very reasonably priced, a good point considering that the attraction is in a very touristy area of the city.All in all, it was a good experience, and one that I would be happy to recommend to anyone who has an interest in trains or modelling."
        }, 
        {
            "index": 247, 
            "rating": "4", 
            "review": "Spot the famous landmarks. See how many famous landmarks of Budapest you can spot as you walk around.The exhibit covers 3 countries; Hungary, Austria and Germany and 4 or 5 cities from each country.You begin in Budapest and here there is Heroes Square, Andrássy út, Budapest Zoo, Nyugati railway station and many others before moving on to other cities.Well made and with a number of interactive options to keep kids (of all ages) amused and entertained."
        }, 
        {
            "index": 248, 
            "rating": "5", 
            "review": "A treat for enthusiasts. We visited this after looking through the window when we were walking around Budapest. It is a very detailed 00 and n-guage railway model of Hungary, Germany and Austria. It is an enthusiasts dream."
        }, 
        {
            "index": 249, 
            "rating": "5", 
            "review": "Unexpected surprise. Walking about the streets we discovered this special place where we could see the city miniaturized. Very cool!"
        }, 
        {
            "index": 250, 
            "rating": "5", 
            "review": "lovely place with kids to go on rainy day.. As expected, family ticket makes it affordable. very nice and attention to detailed work. I was amused, didn't know, should I touch them, watch, or take a picture ;-)"
        }, 
        {
            "index": 251, 
            "rating": "3", 
            "review": "Not a big scale enough and not enough of Hungary. Children under 12 will have lots of fun and any train enthusiasts too as trains are everywhere in the landscape. But ...1,900 HUF for the entrance fee is rather expensive when you spend much less than an hour here (no senior discount but discounts for the 2nd or 3rd visits). I extended as much as possible my visit by clicking on every interactive button (some of them not working) but I managed barely 40mn, my friend zapped in 10mn!It is cute and well done but really tiny (the scale), I thought the scale would be much larger but it is the smallest possible to have running trains. What I really regretted because I was going there for the cultural aspect of what to visit in Hungary is that they only featured north western Hungary: Pannonhalma, Sopron, etc. and then some Austria & Germany but I would have like to see more of Hungary."
        }, 
        {
            "index": 252, 
            "rating": "4", 
            "review": "Decent opportunity to spend your free time.. After wathcing videos about different miniatire worlds, we (a couple) were more than excited to visit one of them in real. The one, which is located right on Andrassy, combines Hungarian, Austrian and German cities on the territory of 300 square meters. It is not comparable to Hamburg's \"Miniature Wunderland\" (1,150 square meters) because of Miniversum's simplicity. Nevertheless, we still got a lot of excitement while visiting it.This place didn't look busy at the time of our arrival around 6pm, so we were able to watch miniatures in peace. All cities were connected with a complex system of railroads (even above your head) that made this place quite dynamic. Some of the trains was possible to control yourself with a use of provided spinning wheels. There were also buttons, which activated movements of some objects in the little world. However, it was challenging to find them because of so small and unrecognizable movements of the objects itself.What disappointed us is that this exibition supposed to have Budapest and Vienna. However, there were literarly 3-5 familiar buildings in these cities. The miniature, which is located outside of Miniversum to advertize it, was much more Budapest-like than miniatures displayed inside.Another disappointment was that besides trains, there were no other transport in motion. It looked quite simple in contrast to Hamburg's one, where cars, busses, ships and airplanes move.Anyway, it is great to have such a unique opportunity in Budapest to stare at everyday's objects shink in 100 times!"
        }, 
        {
            "index": 253, 
            "rating": "4", 
            "review": "Impressive. A detailed model of Hungarian life with interactive items. Great concept and worth a visit. Inside so we were able to avoid the rain for an hour or so."
        }, 
        {
            "index": 254, 
            "rating": "5", 
            "review": "Great place. It is a great place! I went there with my boyfriend and we really enjoyed our visit! It's interesting for everyone, is very well organized and made:) we had a lot of fun finding the different effect and lights:) i recommend to everyone to go!! The team who works there are very friendly and helpful!"
        }, 
        {
            "index": 255, 
            "rating": "4", 
            "review": "Interesting. This model world is amazing for children and adults alike, you can spend hours just trying every button as they have thousands of functions. Real fun and even more if you have visited those places!"
        }, 
        {
            "index": 256, 
            "rating": "5", 
            "review": "Something you never expect in the middle of the town. Our guide brought us to walk around the area to kill about 40 min before we leave for the airport. My friend and I didn't want to do any shopping. So, we just walked around and found a promotional cart in front of this mini museum. Wondering what it's for, we looked inside and saw the admission cost. So, we went in to check in. We were surprised to see this amazing mini museum which perfect served our purpose."
        }, 
        {
            "index": 257, 
            "rating": "5", 
            "review": "Fantastic attraction. This place is great, the layout is enourmous and there's so much to see. The interactive elements are good fun, and there's something for everyone, if you're just looking at the layouts or if you're interested in how they work and are put together.A must see!"
        }, 
        {
            "index": 258, 
            "rating": "5", 
            "review": "Great way to spend an hour. We visited this place yesterday, very interesting and fun. Great for kids or adults with an interest in an overview of Budapest or model making. The trains alone are excellent"
        }, 
        {
            "index": 259, 
            "rating": "3", 
            "review": "Nice for Model Train Enthusiasts. This is perfect for anyone into model trains. It is very well done, and you can see the time and effort which must have been involved in putting this together. I enjoyed seeing it, but I wouldn't go again."
        }, 
        {
            "index": 260, 
            "rating": "4", 
            "review": "while a nice idea but not enough to see. idea behind is nice but they should put more details explanation for visitors like us to understand the history behind the places inside ."
        }, 
        {
            "index": 261, 
            "rating": "3", 
            "review": "nice but not good value for money. Miniversum is a mini train show - it was fun and interesting, but more for children, rather than for adults. It's also very expensive for the value / amount of time you spend there. Ok for a rainy day and if you have children, but there are more interesting things in Budapest."
        }, 
        {
            "index": 262, 
            "rating": "5", 
            "review": "A mini museum for all. Lots and lots of tiny figures and building. A model of Budapest and other Hungarian towns on a mini scale. Maybe more interesting to local Hungarians who know the areas well, although just as interesting for tourists."
        }, 
        {
            "index": 263, 
            "rating": "5", 
            "review": "Fun not only for kids. Very nice place, liked all the moving trains and cars and really had fun. I think this can be even more exiting for kids :)."
        }, 
        {
            "index": 264, 
            "rating": "5", 
            "review": "Being a Child again. You can be a little child again. Funny scenes, nice details on this train model heaven. Well worth it."
        }, 
        {
            "index": 265, 
            "rating": "5", 
            "review": "Mimiature world - in the heart of Budapest. It is easy to find Miniversum in a central location of Budapest - ground-floor 12, Andrássy street . This is a great H0 size world- but not only for model-railway fans, but for everyone.You can see the landcapes and cities of 3 countries composed into the frame of railways, the focus of course is on Hungary. You can see some great views of parts of Budapest, Sopron, Pannonhalma and Győr - and the POIs created in miniature versions are like the real ones- beautiful and detailed ones. There are also interactive parts implemented - you push a button and something starts to happen on the fields- we came with kids and their favourite activity was to find these hidden secrets.There is a small buffet,shop also available and if the kids wants to try themselves, they can also play with small remote controlled trains in the kids play area.If you come with kids - add one more hour to let them play here...This is a must to see attraction in the heart of Budapest"
        }, 
        {
            "index": 266, 
            "rating": "5", 
            "review": "Excellent fun. As a group of adults we decided to visit here and see what it was like. The place itself was much bigger than we thought and covered areas of Hungary, Austria and Germany. It's amazing how much detail they've gone into and if you look closely you'll see amusing little things that they've put in. Spent a good couple of hours here and loved every minute of it. We all enjoyed the interactive parts as well even though the youngest is twenty five!"
        }, 
        {
            "index": 267, 
            "rating": "5", 
            "review": "Fun time for two adults!. My husband and I had a great time at Miniversum! As others have noted, it is most fun to watch from the kids' eye level...and pack your patience if you're going to test all of the buttons. We couldn't spot all of the moving parts, and some of them take awhile to materialize."
        }, 
        {
            "index": 268, 
            "rating": "4", 
            "review": "Nice relaxing break from the heat. Great fun.. This is a model village with loads going on. We went on our last day in Budapest where we were just looking for a bit of a chill out and some air con. We enjoyed it much more than we thought we would. Each 'city' has a load of activity including bits to be controlled by the user. Bonus points for the ludicrously bad taste of being able to control a paramedic giving somebody chest compression CPR!"
        }, 
        {
            "index": 269, 
            "rating": "4", 
            "review": "A fantastic family attraction, but room for improvement. Miniversum is a a brilliant family attraction; rooms and a large enclosed courtyard full of miniture models, railways and buildings. The attraction is well designed, has an incredible level of detail, and variety of models and locations to keep the kids excited and entertained throughout. Everything from Heros Square, villages, circus, lakes, historical castles, mountains, ski slopes, military and so much more. I didnt count, but there are miles of train tracks and trains constantlz moving around the scenes. There's a cafe with good snack food, and a play area where children can build their own railways.Recommendations:Adults, when looking at the minature scenes sit down on the wooden ledge so that you're at eye level with the layout. It's singificantly better than always viewing from above. Look out for the dinosaur!Improvement:every few feet they provide buttons which can be pressed by visitors. Some flash lights, some turn wind turbines, or switch on little fountains. There's no guidance as to what button does what. I'm assuming Miniversum thinks its a fun challenge trying to spot what button does what action. It's not. It gets really frustrating for kids and adults pressing a button and having no idea what it does. Either I'm bad at this game, or by estimates 30-40% of the buttons don't work. I wish they could be labelled."
        }, 
        {
            "index": 270, 
            "rating": "4", 
            "review": "Go there if you like model trains. It is worth a visit! Very nice models of Hungarian (and Austrian/German) cities and of course many railroads and trains."
        }, 
        {
            "index": 271, 
            "rating": "5", 
            "review": "It's supposed to be for kids?. Went in here because it was raining.....and 6 adults had a fun couple of hours.The detail is fantastic. It is semi -interactive and we had a lot of fun with this .\nHighly recommended."
        }, 
        {
            "index": 272, 
            "rating": "5", 
            "review": "A fun little place. I think this miniature model of Budapest and its surrounding is very impressive and fun with the action buttons, especially after you have seen the big places and you can compare from your memory :)Reminds to the ones of us who had train toys how fun it was to be a child and compensates a bit for the ones who didn't have the opportunity to play with such things in their childhood."
        }, 
        {
            "index": 273, 
            "rating": "5", 
            "review": "Interesting, novel and fun place to visit.. Very detailed buildings and cities. Really liked the interactive features but sometimes you have to look very closely to see exactly what light / sound you are activating. Bigger than we expected so it felt like good value for money. Took about an hour to get round."
        }, 
        {
            "index": 274, 
            "rating": "5", 
            "review": "Stumbled upon this excellent family stop!. Walking home from dinner we saw the Miniversum and knew we had to go in. On the weekends it is open until 9pm, so we went in and were glad we did! Our son loved looking at all the cars, trains, trucks, and people. There were many rooms with different cities represented, and a great kids room at the end where the kids can get hands on time with train sets. We would have stayed much longer if it wasn't already after dinner!"
        }, 
        {
            "index": 275, 
            "rating": "5", 
            "review": "European Rail Adventure. Very impressive model railway with realistic train operations. Watch the OBB Railjet as it travels from Budapest to Germany via Austria. See Heroes Square and the Castle in Budapest, very accurate models of both. Spot the Dinosaur lurking. My Wife and I were only going to spend a short time there, but ended staying for 2 hours. Staff are very friendly."
        }, 
        {
            "index": 276, 
            "rating": "5", 
            "review": "Not only for children :). To tell the truth, I was tired after an hour to see the miniature figures, but at all I enjoy it. We spend there 2 hours with children to see the miniversum - the all. Try the buttons ant look for the moves, lights, sounds... It was super for the children, but also interesting for adults, too.The playroom was closed for painting, but the personnel let the children to paint also - it was a nice idea."
        }, 
        {
            "index": 277, 
            "rating": "5", 
            "review": "Must-see for everyone. This place is absolutely brilliant! I was curious before visiting Miniversum and it met all of my expectations. I was happy to see the Hungarian landscape and city streets besides their Austrian and German counterparts. \"Muki' (freight trams in Budapest), Ikarus buses of various transportation companies as well as the passengers pushing the Ikarus Ik260T trolley bus. :)There's also a small café as well as a children's corner. Lots of small, lovely details, functioning scenes and a friendly, helpful staff. The only thing I missed from the souvenir shop were the Miniversum's own refrigerator magnets."
        }, 
        {
            "index": 278, 
            "rating": "5", 
            "review": "This place is amazing. Visited it with my young children. Not sure who was more amazed looking at this model train universe, the children or myself. Apparently it took 30 people a year to build it. It shows. The details are very fine from clucking chicken to funeral on the hillside for a backdrop. All the while over 80 trains roam the tracks disappearing in tunnels just to reappear at some unexpected corner next. If you are into model trains, set aside a few hours for this one."
        }, 
        {
            "index": 279, 
            "rating": "5", 
            "review": "Who needs kids to enjoy this?. Don't be fooled. Almost all the families you see there will be using the kids as a smokescreen to cover their own fascination! The layouts were seriously lifelike, a result of the larger HO gauge. Too many model railways forsake reality because they cram too much in by using a tiny scale. Here the spacious building (an old palace) affords enough room to spread out. Geographically the scenery progressed from Hungary through Austria, and eventually into Germany, affording a good mix of rolling-stock.We took the \"Behind the Scenes\" tour which we found fascinating and would definitely recommend."
        }, 
        {
            "index": 280, 
            "rating": "5", 
            "review": "The wonder of Europe. I visit this place with my family on the way to the St.Stephan Cathedral and it was a wonderful place to visit. The staff were friendly and the overall place is wonderful"
        }, 
        {
            "index": 281, 
            "rating": "5", 
            "review": "Absolutely Excellent. This place is absolutely brilliant! There are so many different locomotives and trains to see run around the fantastically detailed layouts. Every little detail is represented beautifully, right down to little dustbins on the street, and people sitting in the station. The whole place is just wonderful, and I highly recommend it to anyone who loves trains, or for someone who is looking for a place to take their children to."
        }, 
        {
            "index": 282, 
            "rating": "4", 
            "review": "Fun for children and men of a certain age. Very well set out and rather enjoyable if you like trains, transportation and technical stuff ( I do ). It's is a beautiful building so look up. There a cafe, small shop and toilet and the access is good. I managed to press all the buttons"
        }, 
        {
            "index": 283, 
            "rating": "5", 
            "review": "cool place especially with family and kids. I was there with my 5 year old son and we both loved it. Cool place and so central. Huge train table covering regions of 3 countries with lots of sights from Budapest as well."
        }, 
        {
            "index": 284, 
            "rating": "5", 
            "review": "Amazing fun for kids. I was with my two 10-year old kids. In summary:- wonderful attraction set in a beautiful building- unique, never seen such a thing before- great how accurate the copy of the real sights has been: you see it in Budapest in real size then you come in and it's just awesome to see the same in miniature size- must-see, brand new- packed with interactive action- easy entertainment, can learn interesting fun facts about Hungary- a lot of entertainment and fun- well worth its price for HUF 1900 (adults)- separate section for kids, easy to spend 2-3 hours for families"
        }, 
        {
            "index": 285, 
            "rating": "5", 
            "review": "Nice place. Nice place. WE were with two boys and we and the children are very enjoyed. Not many people know where it placed. The place is family freindly."
        }, 
        {
            "index": 286, 
            "rating": "5", 
            "review": "Wonderful attraction set in a beautiful building. This is a wonderful attraction set in a beautiful building in the middle of the city. I had not been a fan of such models before but we went because the children wanted to see it. I must admit I did not regret that I came along. It is great how accurate the copy of the real sights was: you see it in Budapest in real size then you come in and it's just awesome to see the same in miniature size. They opened a few months ago so everything is brand new and at the same time still a secret tip, I am sure it will be a much bigger crowd in a year or two. It is packed with interactive action and therefore everyone can learn interesting fun facts about Hungary. To summarise: it is a lot of entertainment and very well worth its price, you can easily spend 2-3 hours with the family for a family ticket at a price of less than 20 €."
        }, 
        {
            "index": 287, 
            "rating": "5", 
            "review": "Mini the place, Maxi the fun! . We were a bit hesitate to go in at first since we were thinking it seems like a toy store for 5 year old. We were so glad that we did it! Very amazing miniature city models. It's hard to believe that anyone could make such exquisite things! It's eye opening for both adults and kids!"
        }, 
        {
            "index": 288, 
            "rating": "5", 
            "review": "Amazing trraction in the heart of Budapest. We recently visisted Miniversum in Budapest.The whole atosmphere is amazing, family freindly, the exhibition itself is in a beautiful, top detailed old, but very nice building in the heart of Budapest. It is a real good deal for a model train fun, I would say must see thing, everything is brand new, heavy railway tarffic on the layouts, very nice details and proffesional work can be identified there everywehre. The layouts are worked out perfectly, very unique deatils, nicea and perfect details as you just can see the in the real world in Budapest. Further to that certain locations from Germany and Austria also can be found on the layouts Hope these guys will keep up this quality work and they will extend their exhibitions with new themes. Also worth mentioning that entrance fee is very reasonable €6,5 for an adult."
        }, 
        {
            "index": 289, 
            "rating": "5", 
            "review": "One of the best in Budapest. Me and my friend just walked by and saw the miniversum and immeditly we entered. This was really great! Well built and alot of trains driving all the time. They built some of the citys nicest buildings and had som information about it. One of the few things I will remember from this city is miniversum! :D Thanks for the visit!"
        }, 
        {
            "index": 290, 
            "rating": "5", 
            "review": "A must see place at Andrássy boulvard. We really underestimated the size of this attraction, it is a crazy sized sand table. 2 hours was not really enough for catch all the details, we will be back for an other round for sure.It is highly recommended not only with children, if you are older you will find some extremely funny details:)"
        }, 
        {
            "index": 291, 
            "rating": "5", 
            "review": "Excellent time at Miniversum. My sister and I went after walking past while visiting Budapest. We enjoyed it immensely, there was information about each city depicted and we enjoyed the interactive buttons. There were numerous trains going in all directions, lots of tunnels and towns. There was much more there than we originally thought. It took us about one hour to go from start to finish. Highly recommended."
        }, 
        {
            "index": 292, 
            "rating": "5", 
            "review": "Great with small children (3 years and up). I absolutely loved it! Pay attention to all small details, kids will love the \"treasure hunt game\" when you push the buttons and explore the what will happen. Please do not spoil it for them, let them discover! You can do the tour in one hour but if your kids are train enthusiastics you may spend here easily 2-3 hours - especially if you try the pencakes in the café too! :-)"
        }, 
        {
            "index": 293, 
            "rating": "5", 
            "review": "FANTASTIC!. We just noticed this place as we were walking along Andrassy ut, and thought we would have a look inside (I am a devout train enthusiast). This is a truly magical experience for anyone interested in trains, travel or central Europe. The layout is such that it depicts different towns and cities from around Hungary, Austria and Germany with trains running around the display which are small-scale versions of real-life trains from each country. Lots of well-designed model buildings and streets in each town (I particularly liked the townscape of Eisenach) and you can actually feel the different atmospheres of each country as you move between each display (I have been on trains in each of these countries and the atmosphere created here is what is felt on each country's real rail network)! I was particularly impressed by the very accurate train station announcements at Wien Hauptbahnhof, having been at the actual station only a few days before. Very friendly and helpful staff. There is even a play area for kids where they can create their own model train consists and then run them on small electrically-controlled tracks. A must for all visitors to Budapest who are interested in this sort of thing! And very easy to get to too by Metro line 1 to Opera station."
        }, 
        {
            "index": 294, 
            "rating": "5", 
            "review": "Great for Model Train Enthusiasts and Others. A model train layout featuring sites in Budapest, Austria and Germany. A fun thing to visit, it is interactive and plenty of trains to watch move through the towns, cities and even the Alps. Great for model train lovers an of course kids. You can also take photos and videos."
        }, 
        {
            "index": 295, 
            "rating": "5", 
            "review": "Excellent and unique experience for adults and kids. We have visited Miniversum with our 6-year-old son today. We have arrived around 11am on Saturday and found only a few people (as time passed more and more people showed up). If we had known in advance that we are going we would have the opportunity to book time online - great service (!). The location of the place is excellent even for local people. It is downtown Budapest in a very nice surrounding, however parking can be challenging and expensive - yet you can get 25% discount if you visit Miniversum - make sure to check online before.The place is exciting. It worth every penny on have to pay. They have good package for families with one or more kids. The exhibition takes you from Budapest all the way to Germany through Austria with model trains. Several famous buildings, typical landscapes are built up. The builders made efforts to make it interactive as much as possible and according to discussion with the employees even more developments are planned. Not only the landscape and buildings are amazing but you find lots of joke and \"easter eggs\" on the board watching the people on the streets, the cars and the landscape. It is fun just to visit, but if you can afford and you have the time participate in the tour behind the scenes!!! It is around 40 minutes and even my young son enjoyed it!I am convinced we will visit the place again!!AND if you are visiting with young kids make sure to go back to the \"playground\". There are tracks to build with, there are trains the control and even houses you can build!Plan at least 2 hrs to visit but you can easily spend there more!!!!"
        }, 
        {
            "index": 296, 
            "rating": "5", 
            "review": "Awesome place!. I just went to Miniversum and I can't wait to bring some more friends. It's a really fun place, there's all this ungarian and austrian train stations and the trains are actually moving, you can even entertain yourself pushing the buttons!There were many kids but a lot of adults as well. My friends and I had a blast! I definitely recommend it!"
        }, 
        {
            "index": 297, 
            "rating": "5", 
            "review": "Excellent place. I visited Miniversum during a family trip to Budapest with my children (9 and 6 years). The first impression when I entered the Miniversum was \"overpriced\", but when I noticed that it is not just one hall but several halls full of exciting miniature worlds, we all fell in love with the place. It was interesting to press the buttons and see what will change. There were also nice funny extra things hidden in the miniature worlds, which rewarded a visitor who looks the details carefully. Miniversum's clean toilets are a good bonus during a city trip with family."
        }, 
        {
            "index": 298, 
            "rating": "5", 
            "review": "unique place, great adventure. When visiting Budapest I strongly recommend to go and see Miniversum. Great location, unique amusement and high quality. Great for kids and adults at the same time. This place is one of a kind - was cool to be there."
        }, 
        {
            "index": 299, 
            "rating": "5", 
            "review": "Beautifully designed and realised model railway exhibition. Miniversum is a superb idea: a realistic model railway museum with fantastically thought out scenes that captivate and enchant. A delight for children and adults alike, the smooth motion of the trains really brings the detail in the scenes to life, and the child-like wonder on visitors' faces shows the value of the experience. There's also a convenient café making it ideal as a lunchtime stop on a stroll down into town from Heroes Square. Highly recommended!"
        }, 
        {
            "index": 300, 
            "rating": "5", 
            "review": "Great miniatures, family friendly place!. If you & your children love trains, you should go to Miniversum. You'll see many trains go across the city, in the tunnel, on the bridge... Your children can also play with trains & have some snacks there."
        }, 
        {
            "index": 301, 
            "rating": "5", 
            "review": "Place that full of brilliant stuff.. I was traveling budapest with my partner and read the information about the Miniversum on the map. It seem interested, so we decided to go there. It was really nice. Many cool stuff there. We both enjoyed it. I also had been to the one in Hamburg before. Both of them are same the theme, but i found each of them have their own unique thing in it. It was really fun to visit. I do hope the gifts shop can be more bigger and more choices from the souvernir. I do know that it just opened about a week ago when we were there. So that is fine. We would like to visit again next time when we are in Budapest."
        }, 
        {
            "index": 302, 
            "rating": "5", 
            "review": "What great fun for kids and adults!. Although only 7 days since it opened, we had a great experience. My 4 year old son and I both had an equally fun time enjoying this train utopia for over 2.5 hours. Although you can walk through the exhibit in 15 minutes, you are not doing it justice. You should stop and marvel at the amazingly intricate details and hidden secrets in this incredibly realistic recreations of various real places (at least one hour). Take a break in the café and then spend the real time allowing your child or you (I admit I participated), in building your own tracks and playing with real models.I am not a train aficionado, however my son and I spent over 1.5 hours playing with trains. One tip: read the brochure and learn the code for pressing buttons throughout the exhibit so that you can make things light up, move or make sound. Enjoy!"
        }
    ]
}