{
    "category": "Buenos-Aires", 
    "entity": "Basilica-del-Santisimo-Sacramento", 
    "avg_rating_stars": 4.385474860335195, 
    "review_count": 179, 
    "rating_stats": {
        "poor": 4, 
        "average": 19, 
        "terrible": 0, 
        "very_good": 60, 
        "excellent": 96
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "Breath-taking and Beautiful. My husband and his family and I visited this church twice when we were in Buenos Aires. The first time we went to mass on Sunday at 9 AM. It was a beautiful experience to be able to worship among believers in a place that people have worshiped at for hundreds of years. We came back on a weeknight and got to listen to the organist play during evening mass. My brother in law played the organ afterwards due to his connection with the organist. We were in awe of the way the music flowed through the church! I would highly recommend visiting this church if you are in Buenos Aires."
        }, 
        {
            "index": 2, 
            "rating": "4", 
            "review": "Nice Old Church. We stumbled upon this was we were walking around the neighborhood. The inside is really incredible and has been taken care of beautifully. The coolest thing is that they were playing music of monks chanting, which created a spectacular ambiance. We walked around and took picture ms with no issues, there were only two people on the pews."
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "A spectacular church. I read about this church while researching attractions in Buenos Aires and decided to visit it during a walk in the area. I was not disappointed. It has one of the most beautiful interiors I have seen. It has lovely stained glass windows, intricately carved stone, wood and marble, intricate mosaics and tiled floors. The chapel in the crypt is also beautiful."
        }, 
        {
            "index": 4, 
            "rating": "3", 
            "review": "Is this Pope Francis' first assignment?. We read in a few sources that this was Pope Francis' first assignment as a priest but aren't sure if that's true or not. Nevertheless this is a pretty church near the Plaza San Martin, the bus stations and the Edificio Kavanagh. It only opens at 1pm on weekdays though so we were only able to access the chapel below."
        }, 
        {
            "index": 5, 
            "rating": "5", 
            "review": "Spiritual Energy. I've traveled the world and visited many churches. This is one of the most beautiful I have visited...it's modern nouveau gothic architecture in all its simplicity is a sight to behold. I appreciated the quiet of the church to take a few moments to meditate during my visit to BA."
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "Incredible! My favorite tour in BA.. The most incredible place. Since this is where the Pope was Bishop, they have a little gift shop where you can buy rosaries and lots of other things for very cheap. I loved this cathedral so much."
        }, 
        {
            "index": 7, 
            "rating": "4", 
            "review": "Beautiful Holy Place. I stopped in the Basilicia del Santisimo Sacramento while near Florida Street for a little respite from the busyness of the day. The outside is beautiful though surrounded on 3 sides by other buildings, so you can only really appreciate the front edifice. The inside is gorgeous and well lit. You immediately feel a peace when you walk in. It's an active church, so there were a few locals coming out of confession and praying while I was there. It was the perfect place to sit, gather my thoughts, and appreciate the blessing of being there."
        }, 
        {
            "index": 8, 
            "rating": "5", 
            "review": "Traditional church.. A little hide in between Kavanah building and Alem Av. This church, is part of the old argentinian tradition."
        }, 
        {
            "index": 9, 
            "rating": "5", 
            "review": "Pope Francis' Parish. We attended Sunday mass here, knowing that it was Pope Francis' 1st assignment as Parish Priest. The outside Architecture was simple, but the interior was rich and majestic. The floor lamps was so grand but its illumination radiates with subtlety and peace. It was hard to find because it was on a side street.It was worth a visit."
        }, 
        {
            "index": 10, 
            "rating": "4", 
            "review": "Beautiful and charming. The Basílica is well known and much visited, close to Praça de San Martin is glorious and well ornamented.Beautiful colonial pieces share the room with notorious art work!Worth a visit"
        }, 
        {
            "index": 11, 
            "rating": "4", 
            "review": "Stunning and worth a stop. The basilica is gorgeous and absolutely ornate, but it's not overwhelming in size; it feels more intimate than St. Peter's in Vatican City or St. Paul's in London. Not a single detail in the design was overlooked. Personally, I don't think you need more than 30 minutes here, unless you'd like to attend a service."
        }, 
        {
            "index": 12, 
            "rating": "5", 
            "review": "Beautiful. The trip to all of these places in Argentina are just amazing. We were lucky to have a very good tour guide and we enjoyed all of the awesome building. There are some of the most beautiful architecture buildings I have ever seen here. The Basilica is very dramatic as is the paintings and the furniture. The Pope has been in this building as well.The history of this building is just amazing. It is a must see."
        }, 
        {
            "index": 13, 
            "rating": "4", 
            "review": "Must see in this area. When visiting plaza St Martin make sure you take the time to visit this beautiful Basilica. Not overly impressive from the outside (especially with roadworks going on out the front when we visited). Step inside and the splendour is amazing. Interesting bit of history inside as well. We were there for the changing of the guards. I felt that this was a bit over rated and there were too many tourists around at the time. Other travellers have noted how peaceful it was. Choose your timing. If a bunch of tourists are not your thing, don't try to incorporate the changing of the guards."
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "Ornate, peaceful...worth the visit.. It was cold and raining so stopping in seemed like a good idea. We happened upon a mass so kept it quiet and enjoyed all the beautiful pieces and architecture."
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "Very Beautiful and Peaceful. Had a nice time exploring the Cathedral. Definitely something to do and see when visiting the city center."
        }, 
        {
            "index": 16, 
            "rating": "5", 
            "review": "Stunning Aesthetic Beauty. From the outside the Basicilla wasn't impressive. Some relief sculptures and the obligatory columns but nothing architecturally remarkable. Maybe that's why I was blown away when I went inside. Every corner of the Bascilla reflects a masterpiece of art. Really an awe inspiring church."
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "Simply beautiful. Walking distance from hotel. The hours are limited - check the schedule posted outside. Well worth it."
        }, 
        {
            "index": 18, 
            "rating": "4", 
            "review": "Beautiful and historical visit. A beautiful Basilica near the \"Casa Rosada\" and part of the historical Plaza de Mayo. It is worth the visit in the reason of the great architecture and style."
        }, 
        {
            "index": 19, 
            "rating": "4", 
            "review": "Beautiful architecture. This Basilica is beautiful inside and has an amazing Choir and very good acoustics. Get inside when there is a wedding!!"
        }, 
        {
            "index": 20, 
            "rating": "4", 
            "review": "Amazing . Beautiful and quite pompous, assisted to the 7pm service it was quick 40 minutes only.Entrance is free no need to pay for a tour, located behind the shopping street Florida."
        }, 
        {
            "index": 21, 
            "rating": "4", 
            "review": "Very nice church.-. You must remember that in Argentina nothing is more than 200 years old with a few exceptions.- Is a impressive church in a very interesting surroundings.-"
        }, 
        {
            "index": 22, 
            "rating": "5", 
            "review": "Beautiful. I went in to this church is just like the ones in Spain, full of history very well kept. The paintings in the dome are stunning\nLoved it"
        }, 
        {
            "index": 23, 
            "rating": "4", 
            "review": "Beautiful Inside. Rather austere outside, the inside altars and stained glass are beautiful and worth a look When we were there there was a celebration for local Croatians going on."
        }, 
        {
            "index": 24, 
            "rating": "5", 
            "review": "Beautiful old church. It is a nice option if you are into churches and architectural sightseeing. It is a block away from Plaza San Martin and a couple more from Florida street."
        }, 
        {
            "index": 25, 
            "rating": "4", 
            "review": "Beautiful interior. The day we visited it was raining yet priests were outside giving blessings to visitors, mostly locals. I would suggest visiting on a Sunday for mass. Otherwise it's filled with a few people praying at various alters and visitors milling around. It is a beautiful church, very opulent."
        }, 
        {
            "index": 26, 
            "rating": "4", 
            "review": "beautiful church. A truly beautiful church well worth a look inside to see the ornate decoration within. I understand that this was the church where the pope served."
        }, 
        {
            "index": 27, 
            "rating": "5", 
            "review": "A must see. This basilica was amazing! A must see. The changing of the guards was something we were not aware of and a unique surprise."
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "Amazing. This is worth a stop during your tour. The inside is truly amazing and well kept. We ended up spending more time than we originally planned. The alter was breath taking in its beauty."
        }, 
        {
            "index": 29, 
            "rating": "5", 
            "review": "Crazy Catholics!!!. Over the top Place of worship. The flowers were beautiful on the altar. So much opulence...it makes you question......."
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Stunned by the beauty and history of this Basilica. This is a very beautiful church. Elegant and much larger than appears from outside. Very historical Basilica including posted soldiers at the tomb and monument to the separation of Argentina from Chile and Peru."
        }, 
        {
            "index": 31, 
            "rating": "4", 
            "review": "Tranquil pretty church. Tranquil pretty church tucked away in a back street with a frontage that doesn't do the interior justice. Inside its beautiful and tranquil. Worth a visit."
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "The best church. Beautiful church, every surface covered with decorations and an interesting story to go with the site."
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "Beautiful. I attended mass for Palm Sunday. The church was busy & beautiful. I would love to return when it is not so busy & take the time to look around. Very beautiful."
        }, 
        {
            "index": 34, 
            "rating": "4", 
            "review": "Beautiful church. Not very special on the outside, but beautiful inside. One of those very old churches with very ornate fixtures."
        }, 
        {
            "index": 35, 
            "rating": "5", 
            "review": "Worth Visiting. 5 years ago we stopped in the Basilica and were impressed by its beauty. Last month with the help of our B A guide our visit to the Basilica was so much better than our first visit. You can do a comprehensive visit in 45 minutes but if you have the chance to do so with a knowledgable guide, or at least do a bit of research before hand, you will be so pleased at the enriching experience."
        }, 
        {
            "index": 36, 
            "rating": "4", 
            "review": "confernce visit. This is a beautiful Cathedral on the heart of the city and one of the most beautiful spots to spend time in. I was lucky enough to arrive just I time for a very smart wedding and so experienced the Cathedral in all its glory, with 7 priests officiating and brass ensemble. Even without this is still a lovely space to spend some quiet time in"
        }, 
        {
            "index": 37, 
            "rating": "3", 
            "review": "Hidden behind big buildings. Even if you follow a map, finding this place takes some effort. Firstly it does not look like a Basillica - and you could easily miss it because it is located behind big edifice. Locals told me a story about how the powerful family who did not like the \"basillica\" and had therefore built the big building to block their view. Well, the cathedral at the main square (where the Rosada is located) certainly is more grand and the inside more lavish. Unless you are in the neighbourhood, and have lots of time on hand, probably do not need to include this stop as part of your itinerary."
        }, 
        {
            "index": 38, 
            "rating": "4", 
            "review": "Beautiful church. We happenned to go there on Sunday morning, just when they had misa going on.It was my first misa, so i did not know what to do, but the music from a 100-years old organ was very good.The church is old and beautiful (just like many other churches), but you do not need much time to appreciate its beauties. Just going inside and looking around for 10 min will be enough, I think. The most interesting part about this church is about knowing its history. I do recommend to take Free Walks in Buenos Aires, where they will tell you the tragic love story connected with the church. After knowing they story, it will be more exciting to visit it, I think."
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "Beautiful Basilica in the Heart of Buenos Aires. Constructed in Classical Greek Architecture the Basilica, located in the heart of Buenos Aries, does not resemble a church at all. Step inside away from the hustle and bustle of the city and enjoy a few moments of tranquility. Beautifully appointed. Well worth your few minutes."
        }, 
        {
            "index": 40, 
            "rating": "5", 
            "review": "Ornate cathedral. We had not planned on visiting this church, but just happened to walk by and thought a look would be nice. It rivals anything in Europe and is with a visit."
        }, 
        {
            "index": 41, 
            "rating": "4", 
            "review": "Wonderful example of Latin Churches. Off the bus and into a world a century ago. The Argentine's have a way with making their religious institutions very special to their culture. Wonderful comparison to other countries."
        }, 
        {
            "index": 42, 
            "rating": "5", 
            "review": "Beautiful Cathedral!. This Cathedral was beautiful. We were able to walk to it from the Hilton Hotel where we were staying, and although we were tired after traveling over 26 hours, we went there, because I didn't want to miss seeing it during our recent visit to Buenos Aires. A lot of the tours that you can take in Buenos Aires do not include going inside this church. It is the church where Pope Francis officiated masses when he was the Arch Bishop in Buenos Aires. It is a must see!"
        }, 
        {
            "index": 43, 
            "rating": "5", 
            "review": "STUNNING detail. Stopped into the Basilica after a tour of the Plaza de Mayo (this sits directly across from it) The Basilica itself has one main very large atrium that springs off into many different smaller chapels that are held within it.The mosaic tile work on the floor as well as the gold gilding at the altars is truly stunning. Worth a visit!"
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "Really an amazing place. . In one of the side areas they have a great exhibit honoring the Jews who came to Buenos Aires after the holocaust. Worth spending a good amount of time walking around inside."
        }, 
        {
            "index": 45, 
            "rating": "4", 
            "review": "Basilically, a stunning church...!. The outside represents a very different architectural style to the interior. The icons and statuary are very impressive. A must see in BA."
        }, 
        {
            "index": 46, 
            "rating": "4", 
            "review": "A beautiful Cathedral in the Spanish style. We enjoyed looking at all the statues and works of art. Very interesting and worth visiting if you have the time."
        }, 
        {
            "index": 47, 
            "rating": "3", 
            "review": "Nice. A nice church but nothing too special. Make sure you know Shen it's open, we managed to get in on the third attempt, it's closed between 12-5pm."
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "Beautiful Basilica, quite place. Very beautiful church, where you can spend some time on your own with your thoughts and prayers. The paintings are beautiful and impressive!"
        }, 
        {
            "index": 49, 
            "rating": "4", 
            "review": "Beautiful. What a beautiful Cathedral. The whole building is a place to enjoy. The body of San Martin is in a section off to the right where it is guarded.the stonework carving on the outside is just stunning."
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "Beautiful Cathedral. We just happened to be at the cathedral for the changing of the guards. San Martin is laid to rest in this church but the room is 'outside' of the actual church because it was said he was a mason. The guards stand on the line 'inside' the church."
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "Pretty place, pretty expensive too. The place is very pretty, finished in gold guild, lavishly. Super extravagant. Couldn't this money have been spent better?"
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "Spectacular sacred space. Beautiful monstrance, spectacular gold and wood work, but also check out the Alhambra/Moorish style arches and non representational art of the sides of the apse"
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "Pope Francis' Church. The Church is very beautiful on the inside. A site not to be missed. The exterior is very deceiving- very plain."
        }, 
        {
            "index": 54, 
            "rating": "4", 
            "review": "What a place!. Even if you're not a follower of Catholicism it's still worth a visit. Very impressive inside. Some great pictures to be had."
        }, 
        {
            "index": 55, 
            "rating": "4", 
            "review": "Absolutely beautiful architecture. Even for the non-Catholic, there is still a lot of value in visiting this Cathedral. The exterior is absolutely beautiful, And on the interior, one find some of the most intricate gorgeous detail carving and stonework that you'll find in the region. Absolutely breathtaking. Well worth every visit given that there are several other things in the area as well."
        }, 
        {
            "index": 56, 
            "rating": "5", 
            "review": "Wow. For those who are Cathoic, this is a must see. The cathedral itself is amazing, but the Holocaust Memorial inside and the fact that this was the home of the current Pope are added bonuses."
        }, 
        {
            "index": 57, 
            "rating": "4", 
            "review": "Interesting. This cathedral is worth a visit not just for the fact that it is where the Pope was stationed when a Bishop in Buenos Aries.It is an interesting building internally (not particularly attractive from the outside) and has a number of great altars and small chapels/prayer places.It is a working church and thus respect for people attending mass or other activities is a must. However, it is very welcoming and taking of photos is not discouraged."
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "Mass visit. Beautiful church with lots of interesting statues and alcoves for prayer. We attended mass here and although not fluent in Spanish it was a moving experience. This church is worth visiting whether you are Catholic or not. It is a beautiful example of Argentine culture"
        }, 
        {
            "index": 59, 
            "rating": "5", 
            "review": "Beautiful church. It is one of the most beautiful churches in the city. It is not very big, but it is superb. Don't miss the crypt."
        }, 
        {
            "index": 60, 
            "rating": "4", 
            "review": "Grand. The interiors are beautiful and as all churches give an atmosphere of brevity and peace. Not as grand as the European churches, but definitely worth a visit."
        }, 
        {
            "index": 61, 
            "rating": "4", 
            "review": "It's a church. We've visited a lot of churches and this is one more beautiful church. Interesting to see the school groups going through."
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "Beautiful Cathedral. Every City we visit we try and find a classic cathedral. A beautiful mix of classic Spanish, French and Italian cathedral designs with amazing stained glass and carvings."
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "Seek it out!. Beautiful church with a stunning altar, lovely tiled floor, mosaic frescos, ornate pulpit and confessionals of carved wood....well worth a visit!"
        }, 
        {
            "index": 64, 
            "rating": "4", 
            "review": "Smaller than it looks. A simple interior design without stained glass windows. Elaborate tabernacle and altar area, several shrines to various saints line the sides. Candle free zone."
        }, 
        {
            "index": 65, 
            "rating": "5", 
            "review": "Beatiful Church!. Great story behind this church! We heard of it and we decided to visit it! It was worth it, looks like a real palace! Amazing indeed!"
        }, 
        {
            "index": 66, 
            "rating": "5", 
            "review": "simply beautiful. Unbelievably beautiful place! Must see it in BA.\nI do not add more details because you must see it, the art inside is incredibly beautiful. If you are catholic, you are going to appreciate more this place!"
        }, 
        {
            "index": 67, 
            "rating": "3", 
            "review": "Pope Francis' old home.... As with most churches...they are all pretty much the same...a lot of gold, paintings, etc. This one is an exception as the home Basilica of the current Pope Francis."
        }, 
        {
            "index": 68, 
            "rating": "4", 
            "review": "chandeliers. came across this Basilica by accident and well worth a visit especially liked the chandeliers down the aisles. If you get the chance to hear the organ - go for it there are concerts advertised out side and happen fairly often"
        }, 
        {
            "index": 69, 
            "rating": "3", 
            "review": "The Popes Church. We visited the church of the current Pope Francis. The people of Buenos Aires have every right to feel proud of this neo classical style Basillica, it is definitely worth a visit."
        }, 
        {
            "index": 70, 
            "rating": "4", 
            "review": "A hidden jewel. The Basilica is located in a touristic area (Plaza San Martin), but on a side street, which makes it easy to miss it. Architecturally impressive, this 100-years-old church is worth a visit. Its fine organ is used in evening concerts."
        }, 
        {
            "index": 71, 
            "rating": "4", 
            "review": "Beautiful Church. We stumbled upon this after walking around the park nearby and it is very pretty. Nothing unusual but definitely a beautiful church."
        }, 
        {
            "index": 72, 
            "rating": "3", 
            "review": "Nice but not impressing. Once you start wandering around Buenos Aires's microcentro you'll finally bump into this other main church of the capital and, if you like sacret art, visit it. Like most churches here, also this one is only a couple of centuries old, so the paintings and pieces of art here cannot impress you as much as they would in the churches of other catholic countries in Europe or Latinamerica. Yet, with the right light coming in through the roof windows you might still be able to take some good shots of the upper architecture."
        }, 
        {
            "index": 73, 
            "rating": "5", 
            "review": "Not to miss Pope's church .. and beautiful.. A must see for its beauty, wonderful ambiance and place in history as past home of Pope. Very serene escape from bustle of city."
        }, 
        {
            "index": 74, 
            "rating": "5", 
            "review": "Beautiful Church. My son and daughter-in law got married in this beautiful church. This is down a side street across from San Martin Square with beautiful vaulted ceilings."
        }, 
        {
            "index": 75, 
            "rating": "5", 
            "review": "Worth a Visit. Small but beautiful and worth a half hour of contemplation. Wonderful wood carvings and mosaic floors."
        }, 
        {
            "index": 76, 
            "rating": "5", 
            "review": "Nice church to visit. This is one of the most beautiful churches in Buenos Aires, located in downtown Buenos Aires very close to Recoleta neighborhood."
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "Pope's Parish, well worth a visit.. A beautiful cathedral which now carries special significance in that it was the parish over which Pope Francis presided, if you have time and the inclination you may want to visit the museum dedicated to him there."
        }, 
        {
            "index": 78, 
            "rating": "3", 
            "review": "Yeah, why not?. First all, I'm a big fan a churches and religious architecture and seen some really nice stuff. This is ok, not more not less.The location next to Plaza De Mayo and Casa Rosada makes it easy to go in and relax for and half an hour and get away from the street noice. This place really is just another church and doesn't impress, it's not bad, it's just \"why not?\""
        }, 
        {
            "index": 79, 
            "rating": "5", 
            "review": "VISIT THE CHURCH WHERE DIEGO MARADONA GOT MARRIED. This beautiful church is located in the Retiro area, close to Plaza San Martín, in downtown Buenos Aires. The church was built by a rich woman called Mercedes Anchorena, who used to live across the Plaza San Martín (park) in building that today is the San Martín Palace (Argentine Ministry of Foreign Affairs). Many famous people got married here, including the soccer player Diego Maradona and the Argentine top model Valeria Mazza."
        }, 
        {
            "index": 80, 
            "rating": "5", 
            "review": "The church is beautiful.. Its very interesting i recommend visit this church . No doubt that this is a beautiful church If you're in Buenos Aires and you love photography, you must visit."
        }, 
        {
            "index": 81, 
            "rating": "2", 
            "review": "Check if they are open before you go on weekends. I rated \"Poor\" just because it was closed when we visited there on Saturday. It maybe better to just check if they are open particularly on weekends. Staff at the hotel we stayed did not know the place and it was not on the tourist map as well."
        }, 
        {
            "index": 82, 
            "rating": "4", 
            "review": "Beautiful church . This church is definitely worth the stop. It's beautiful on the inside and out with lots of photo opts."
        }, 
        {
            "index": 83, 
            "rating": "3", 
            "review": "Interesting History. The history behind the church is very interesting and worth reading prior to your visit. Though the building itself is unspectacular."
        }, 
        {
            "index": 84, 
            "rating": "2", 
            "review": "Just another church. Unless you are really into churches there is nothing special here. There are many other things in this for example you could have a pint of dark beer in Kilkenny bar"
        }, 
        {
            "index": 85, 
            "rating": "5", 
            "review": "Beautiful church. Well appointed Basilica, have been to many churches in Europe and this is very comparable. It´s a very nice part of our private city tour and we're happy the tourists love it !"
        }, 
        {
            "index": 86, 
            "rating": "5", 
            "review": "Visit if you have the time, just next door to Beautiful Plaza San Martin and Retiro station. one of the most amazing and magical churches in town, not very well know, yet fantastic architecture, acoustics, spiritual retreat..."
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "Small Church, amazing interior!. Situated on a side street, this small church is a must see off the beaten path near capital federal district. Best to spend a day walking florida and make a side stop here to see the impressive interior of this unforgettable spot."
        }, 
        {
            "index": 88, 
            "rating": "4", 
            "review": "Its a beautiful church !. This church is visited by many tourist from different countries , i like this place because has interesting pictures with marble around the church , its very interesting , i recommend visit this church ."
        }, 
        {
            "index": 89, 
            "rating": "4", 
            "review": "Beautiful church!. This church has beautiful architecture inside and out; plus great craftsmanship and ornate details inside. Our visit was limited as church was in session when we visited. A must see!"
        }, 
        {
            "index": 90, 
            "rating": "5", 
            "review": "Beautiful Architecture. This place is absolutely BEAUTIFUL! The architecture is stunning. It is well worth a couple hours of an afternoon walking around."
        }, 
        {
            "index": 91, 
            "rating": "4", 
            "review": "Beautiful interior. To look at it from the outside, you would not naturally be interested, wander on in and be surprised, it is just beautiful on the inside. Make sure to make your way to the right and find the guards in full traditional dress. Certainly a sight to see."
        }, 
        {
            "index": 92, 
            "rating": "5", 
            "review": "Sunday Mass at the Basilica. We attended a Sunday Mass in this Basilica and it was very moving as the inside of the place is so calm, clean and well maintained with beautiful religious art in wood and glass.We pass this Basilica a different times and it was always open, if you are not a believer just to sit there for a few minutes to have a rest is a must.Very near la Estacion Retiro that it is worth a visit as well.Very near the Monument to the Soldiers that fought in the in the Malvinas/ Falkland conflict, hundred of names of young people that lost their life, quite sad."
        }, 
        {
            "index": 93, 
            "rating": "5", 
            "review": "Beautiful hidden place. You might pass nearby 100 times, and not see it. Practically hidden, its style and beauty makes it a must see. It is one block away from Plaza San Martin (near subway and train) and it is free. Not to be missed!"
        }, 
        {
            "index": 94, 
            "rating": "5", 
            "review": "Beautiful Church. I went during the week. This is an old church surrounded by larger, more modern buildings. The Blessed Sacrament is on display in a lower chapel and, I understand that this is perpetual. The main part of the church was closed and I am not sure when it opens. For a Catholic or someone interested in Church architecture and history, this a 5 star visit."
        }, 
        {
            "index": 95, 
            "rating": "4", 
            "review": "Beautiful architecture. If you are a religious person then I don’t need to explain why this is a good place to visit but if you are not then perhaps the architecture and the beautiful interiors is a good reason for you to visit. Every corner of the cathedral is a photographer’s dream. Camera just loves this place. Another interesting thing about this cathedral is that this was the home parish of our current pope, Pope Francis. I saw many people who were visiting out of this fact alone. But if these are not good enough for you then this is just another cathedral decked in the best of Spanish architecture."
        }, 
        {
            "index": 96, 
            "rating": "3", 
            "review": "A large basilica that was the church of the present pope. This is also where General San Martin the libertador is buried. It enjoy a permanent guard and fire.The basilica is ver spacious and has a mixture of architecture styles."
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "Awe Inspiring!. The beauty and reverence in the Basilica was outstanding. The whole area was a lovely experience and I am so happy that I made the effort to visit."
        }, 
        {
            "index": 98, 
            "rating": "4", 
            "review": "Freud Plaza. Interesting mix of archictectural styles on this church, but more interesting for me was that the plaza is known as Freud´s plaza after the phsycotherapist. Apparently there are more therapist´s in this neighbourhood per resident than anywhere else in the world! 1-650 ... explains all the dogs I guess."
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "Cathedral were myparents got maried!. Ther priest checked in his archive the register. Heopened thechurch in the cellar, where the wedding took place. Great experience."
        }, 
        {
            "index": 100, 
            "rating": "4", 
            "review": "Fine if you like Churches. No doubt that this is a beautiful church,especially on the inside,however,i found it rather anticlimactic since I've visited so many churches before. One should make a visit only if you don't find churches to be tedious."
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "Pope Francis' Church!. The church is beautiful and is especially wonderful considering it was the home parish of our current Pope. Plus a wonderful memorial to Jose de San Martin who led the revolution against Spain."
        }, 
        {
            "index": 102, 
            "rating": "5", 
            "review": "Hidden yet still Impressive....... This small stunning French styled basilica was built by the Anchorena family in 1916. But now obscured by the giant Kavanagh building from the San Martin palace, former home of the Anchorena family as revenge for a failed union between Corinna Kavanagh and the son of the Anchorena family...The basilica itself is still impressive as it stands sandwiched between buildings with its beautiful spires clearly visible. Inside there are wonderful stained glass windows, the original mosaic floor and a very prominent organ. The unique tiered altar, surrounding stone columns, elaborate woodwork and many arches all add to the majesty. A must see especially as our current Pope Francis was said to conduct masses here..."
        }, 
        {
            "index": 103, 
            "rating": "3", 
            "review": "nice small church. Every South American city has one main Spanish built church ( Lima, Cusco, Santiago etc., ) of medieval architecture with stained glasses and colorful altars with lot of gold and silver embellishments, This is Buenos Aires version! This is significant as the present Pope comes from this church. We visited this place on 10th March and you can skip this if you are not that much spiritually oriented!"
        }, 
        {
            "index": 104, 
            "rating": "5", 
            "review": "Awe Inspiring. Watching the changing of the guard, visiting the incredible altar--totally amazing. Do not miss it. I had to buy the small book that shared the highlights of her phenomenal history and her short life. This is a \"do not miss\" place."
        }, 
        {
            "index": 105, 
            "rating": "5", 
            "review": "Very interesting church - must see!. The church is very large and has many artistic paintings and statues along with very nice stained glass windows."
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "A very beautiful church. I might have spent an hour with my DSLR dissecting every corner of this church. It's lovely. If you're in BA and you love photography, you must visit."
        }, 
        {
            "index": 107, 
            "rating": "3", 
            "review": "CLOSED. Sadly, it was closed for the afternoon, 130pm to 5pm i think. so i could only look at the front (its sandwiched between other buildings). The facade has been restored, and quite ornate and beautiful"
        }, 
        {
            "index": 108, 
            "rating": "5", 
            "review": "A must-see when in BA. A beautiful cathedral with great architecture, very much like the ones in Europe. It contains some old paintings and statues of saints and the blessed Virgin Mary. It is a solemn and quiet place to pray when no mass is going on. The cathedral has also beautiful mossaic tiled floors and the stained glass windows are outstanding."
        }, 
        {
            "index": 109, 
            "rating": "4", 
            "review": "Beautiful, Meaningfull Church. The beautiful altar, gorgeous stained glass windows, the woodwork of the pulpit and confessionals make this an attractive church. If you look up in front of the church, the spires are sandwiched between buildings but are still impressive.This is a smallish church compared to the great basilicas. Its ceiling is not decorated but it has an incredible organ.The mere thought that the current pope may have carried out his vocation there is enough to make the visit worthwhile.The crypt is also worth a short visit.Beware if frequent closings.It is open Sundays until 8pm."
        }, 
        {
            "index": 110, 
            "rating": "3", 
            "review": "Nice Basilica but Confusion with Catedral Metropolitana. This is a nice, small, basilica, but not a major attraction in the overall scheme of Buenos Aires.There is a lot of confusion among Trip Advisor reviews between this basilica, Catedral Metropolitana, and San Pedro Gonzalez Telmo Church. The Catedral Metropolitana is in the Plaza de Mayo which you will likely visit anyway, and the Greek Revival exterior is different from the other churches close by including this one. Even some of the photos shown are not of this basilica. The foundation stone was placed in March 1908. In November of 1916 Pope Benedict XV established this it as a Minor Basilica. It has some interesting history but is much smaller than the Catedral Metropolitana.If this review is helpful then please indicate so below."
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "Another outstanding thing to see. This is a gem just behind our hotel and was very interesting. The wood work as well as the rest of the church was outstanding. It was also nice to sit and reflect on everything. Worth seeing."
        }, 
        {
            "index": 112, 
            "rating": "2", 
            "review": "I don't get the hype... I don't understand how this is ranked as the 2nd best attraction. It's absolutely not. There are 20 places I'd recommend you visit before coming here, like the Recoleta Cemetery, Palermo Soho, MALBA, Teatro Colon... how this basilica made it to the top of the list makes no sense to me. It's a pretty church, but nothing compared to what you'll find in Europe."
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "One of the city's must sees. A real testament to the vibrant Catholic culture of Argentina. A beautiful place to be and to have time to reflect. The souvenir shop was a bit sparse but it is supposed to be a cathedral and not a shopping centre, so no complaints."
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "Beautiful and hostorical. I thought this was a beautiful basilica. It's unique, governmental architectural style is another point of interest. Given the connection with the current Pope, it adds an extra twinge of interest."
        }, 
        {
            "index": 115, 
            "rating": "4", 
            "review": "EL Santisimo. It is an historic building close to Plaza San Martin, This Catholic Curch is a very usual place to be visited during your trip around the city."
        }, 
        {
            "index": 116, 
            "rating": "5", 
            "review": "do not miss. very antique catholic church in downtown Buenos Aires. If you happen to be near, it's worth visiting it."
        }, 
        {
            "index": 117, 
            "rating": "5", 
            "review": "the pope. It was beautiful inside and the daily guards who go everyday in their old fashioned uniforms looked very impressive."
        }, 
        {
            "index": 118, 
            "rating": "3", 
            "review": "Beautiful Basilica. Our guide explained that Argentina had wanted to become like Europe and indeed this Bascilica reminded me of a European cousin!"
        }, 
        {
            "index": 119, 
            "rating": "5", 
            "review": "Church of the current Pope plus grave of San Martin. we got to see the changing of the guard for San Martin's grave vault, side room in the Cathedral. The church is beautiful but not overdone. this was the home church for the current Pope and it has a beautiful silver altar. worth a visit"
        }, 
        {
            "index": 120, 
            "rating": "5", 
            "review": "Beautiful cathedral with attached room for San Martin vault. This Cathedral is across the street from the Plaza de Mayo. It does not look like a cathedral from the outside; it is in neoclassic style. Inside there is a silver lectern from which the current Pope Francis officiated when cardinal. There is what appears to a side altar with the remains of San Martin, the liberator of Argentina. he was alsoleader of the Army of the Andes seeking liberation from Spain in the 19th Century for Peru and Chile as well. However, this \"room\" is not really a part of the Cathedral, as San Martin was a free mason. The vault is guarded by army sentinels in uniform. Beautiful building with lots of history. "
        }, 
        {
            "index": 121, 
            "rating": "4", 
            "review": "Nice Church in Buenos Aires. The Blessed Julian Pedro Eymard on the most important sculptures of the Church, was founded by the Congregation of the Holly Sacrament, neo roman architetonic facade was designed by the French architects Coulomb and Chauvet. It was finished in 1916 after eight years of construction ."
        }, 
        {
            "index": 122, 
            "rating": "4", 
            "review": "The cathedral of Buenos Aires. When we were in plaza de mayo we wanted to know the cathedral and see where has lived our papa! Interesting, powerful and many people ."
        }, 
        {
            "index": 123, 
            "rating": "4", 
            "review": "Near Recoleta. Make the effort after the cemetery visit. It's a small church but well worth the visit. We didn't spend too much time here as they were cleaning it when we arrived"
        }, 
        {
            "index": 124, 
            "rating": "5", 
            "review": "Don't miss. So glad we had this Basilica recommended to us! It was beautiful, with much to see if you take the time; but even for a quick visit it is quite a wonder to behold."
        }, 
        {
            "index": 125, 
            "rating": "4", 
            "review": "A spiritual experience.... We attended mass while we were there and it was a spiritual and moving experience despite all the tourists taking pictures. The locals still attend mass. Its a beautiful elaborate old church and definitely worth a visit.\nThe only down side is that there are absolutely no public toilets there and the store in the foyer closes during mass."
        }, 
        {
            "index": 126, 
            "rating": "5", 
            "review": "Beautiful Church. This is apparently the church that Pope Francis was attached when Cardinal. It is welcoming & allows for contemplation away from the traffic and business outside its doors."
        }, 
        {
            "index": 127, 
            "rating": "4", 
            "review": "Beautifull. The architecture is worth seeing. Must see, a good place to say a little prayer and get away from the sun."
        }, 
        {
            "index": 128, 
            "rating": "5", 
            "review": "Awesome. Very beautiful. It was the pope Francisco's Cathedral in Buenos Aires!!! Near you can walk at the Plaza de Mayo."
        }, 
        {
            "index": 129, 
            "rating": "4", 
            "review": "Beautiful church. This beautiful little church is well worth a visit. Entry is free and the atmosphere and decor inside the church are lovely. Well worth a visit."
        }, 
        {
            "index": 130, 
            "rating": "4", 
            "review": "Not to be missed. We went through this church with our tour guide who informed us about the significance of the Jewish dedication wall and importance of being the church Pope Francis was a practising Cardinal in. From the outside the architecture doesn't look like a typical church but inside the gold trimmed altar is stunning.this is not to be missed when visiting Buenos Aires."
        }, 
        {
            "index": 131, 
            "rating": "4", 
            "review": "Worth a visit. Beautiful church but erratic visiting hours. It may have been due to Christmas week but it was closed at least once when I tried to visit. Once I found it open, it was much more interesting than the Metropolitan Cathedral."
        }, 
        {
            "index": 132, 
            "rating": "4", 
            "review": "Really nice to see, lovely church.. Well appointed Basilica, have been to many churches in Europe and this is very comparable. It was a part of our city tour and we're happy we got to see it."
        }, 
        {
            "index": 133, 
            "rating": "3", 
            "review": "Quite nice. This is not the most attractive church in the world but still worth a visit. Nice and cool inside when the outside temperature is high."
        }, 
        {
            "index": 134, 
            "rating": "5", 
            "review": "Don't forget to say a prayer. This is one of the nicest Church you will find in Argentina. Pictures are welcome as is every faith."
        }, 
        {
            "index": 135, 
            "rating": "4", 
            "review": "Nice preview to cemetary. Lovely little church. Beautiful and open to public. Free. Loved the intricate tile work on the ceiling."
        }, 
        {
            "index": 136, 
            "rating": "5", 
            "review": "Excellent place to know a little about Argentine history. I liked the beautful architecture, its history totally connected to the history of the city. If you like to know about the history of the city you are visiting, this is one the many places offered for its purpose in Buenos Aires"
        }, 
        {
            "index": 137, 
            "rating": "4", 
            "review": "Interesting church. Worth visiting for a bit of tranquility in a busy city. Interesting but not as grand as the cathedrals of italy."
        }, 
        {
            "index": 138, 
            "rating": "5", 
            "review": "A beautiful and well preserved tribute to the faith of the Argentine People. This was my first visit to a cathedral & opened my eyes to a new kind of attraction when visiting around the world. This cathedral is extremely well preserved and gorgeous throughout. I particularly enjoyed the paintings at each of the stations of the cross. The craftsmanship and art is wonderful and inspiring. Worth a stop on your way through the main square in BA."
        }, 
        {
            "index": 139, 
            "rating": "5", 
            "review": "Beautiful church. It's big and very imposing. Weddings there a quite an event. Watch one if you can. You won't regret it."
        }, 
        {
            "index": 140, 
            "rating": "5", 
            "review": "Beautiful House of Worship. We stopped here in the late afternoon. Plenty of people buzzing around on the street as it was rush hour, yet the basilica was nearly empty. A beautiful piece of architecture and a peaceful spot in the midst of a busy day. Definitely worth a visit."
        }, 
        {
            "index": 141, 
            "rating": "5", 
            "review": "beautiful. breathtaking beautiful the alter witth the white flowers just towering as you walk in the bueauty and spiritual feeling truly a beautiful cahtedrial and worth your time to visitt"
        }, 
        {
            "index": 142, 
            "rating": "5", 
            "review": "A real jewel. If you are in Buenos Aires, you really cannot miss this Church.Delicate and beautiful, it will keep your eyes and attention for a long time. The choice of marble, wood, decorations has been done with a lot of expertise and attention. The result is outstanding. You will hardly believe that the Basilica has been built at the beginning of the 20th century, its athmosphere and perfection will bring you much behind..."
        }, 
        {
            "index": 143, 
            "rating": "4", 
            "review": "Glorious. This is one beautiful church, much more impressive, ironically, than the cathedral. I wonder if there's a story behind that as there is about the two competing churches on Cuzco's Plaza de Armas???"
        }, 
        {
            "index": 144, 
            "rating": "5", 
            "review": "Nice place to check your mind. This was a big surprise to see this nice place that were hidden behind Florida business center in Buenos Aires downtown"
        }, 
        {
            "index": 145, 
            "rating": "4", 
            "review": "Impressive. Located close to Casa Rosada (President´s place) and the \"Obelisk\", the Basilica´s definitely worth visiting. Impressive architecture."
        }, 
        {
            "index": 146, 
            "rating": "4", 
            "review": "Dazzling!. I liked the dazzling ornate nature of the inside of this Church. It's not much to look at from the outside but the inside glows."
        }, 
        {
            "index": 147, 
            "rating": "5", 
            "review": "Beautiful Church. This beautiful church was located outside our hotel room window, so we decided to walk over to have a look. While the outside was intriguing, the inside was exquisite. The architectural details of the walls and ceiling, along with the sculpted alter, make it a memorable experience. It's open to the public, located close the the business center, but tucked in on a quiet street. It's worth seeking out!"
        }, 
        {
            "index": 148, 
            "rating": "4", 
            "review": "Worth the walk. Close the city center. Go and enjoy French-style church built by the Anchorena family in 1916. Check out the original tiled floor, stained-glass windows, stone columns and wedding-cake-like altar"
        }, 
        {
            "index": 149, 
            "rating": "5", 
            "review": "Outdoor excellence. The location is central, beautiful garden for lunching outdoors, especially in summer. Very good menu, and very good wine list. Excellent for lunch."
        }, 
        {
            "index": 150, 
            "rating": "5", 
            "review": "Old elegant church. One of the nicest and most elegant churches in Buenos Aires.High society weddings have usually taken place in this chuch over the years and still do. Interesting classy place to visit!"
        }, 
        {
            "index": 151, 
            "rating": "5", 
            "review": "Great site.. Awesome!!! historic church in the old part of Buenos Aires = San Telmo. Well worth the visit not only to the church but to the whole neighborhood."
        }, 
        {
            "index": 152, 
            "rating": "5", 
            "review": "BEAUTIFUL place to visit. Very old and beautiful to tour. Within walking distance of the downtown area. Open to the public during the day."
        }, 
        {
            "index": 153, 
            "rating": "4", 
            "review": "great!. I loved all of it!\nyou must go to see the celebration of church while the chorus is there!\nit's also the place were traditional people get married"
        }, 
        {
            "index": 154, 
            "rating": "4", 
            "review": "Grandiose Church. Beautiful church near downtown, can be part of day tour around downtown.\nReserve at least one hour for the tour, or attend sunday mass, unique local flavor."
        }, 
        {
            "index": 155, 
            "rating": "5", 
            "review": "Very nice church. Very well conserved church, where the pope used to pray mases.\nHistorical place, there is a very nice cript, a special place for independency hero Juan de San Martin guarded by 2 soldiers. Around noon we were able to see the guard change"
        }, 
        {
            "index": 156, 
            "rating": "5", 
            "review": "Classy church. This was one of the finest church and very we'll maintained and it has a lot of historical importance attached to it. The current pope was the cardinal In this church . Moreover it is a well maintained church . Worth a visit"
        }, 
        {
            "index": 157, 
            "rating": "5", 
            "review": "BEAUTIFUL CHURCH!!! WRONG PHOTOS!!!. The Basilica del Santisimo Sacramento is located near Plaza San Martin. It´s a little bit hidden from viewers and passers-by, so you need to take passage Kavanagh in the back of Kavanagh building. THere´s an interesting love story behind this church and the Kavanagh building, which explains why the church appears to be hidden by Kavanagh building.WARNING: most tourists have been posting and dropping comments on Buenos Aires Cathedral which is next to Plaza de Mayo, and nowhere near Retiro!!! So the address associated with this church is wrong as well. Also, THIS IS NOT THE CHURCH WHERE POPE FRANCIS USED TO WORK! IN FACT, WHEN HE WAS BUENOS AIRES BISHOP, HE´D WORK AT CATEDRAL METROPOLITANA NEXT TO PLAZA DE MAYO!!PS: CHECK THE PHOTOS I´VE UPLOADED TO SEE THE CORRECT PICTURES."
        }, 
        {
            "index": 158, 
            "rating": "2", 
            "review": "No wonder attendances are poor. Went to 1100 o clock Sunday service and soon realised why the congregation was so small. Priest mumbled incoherently for a long time and clearly inspired no one. Church is nice but the inspiration was appallingly low."
        }, 
        {
            "index": 159, 
            "rating": "5", 
            "review": "\"Radiant Wedding\". Very beautiful Basilica, with an incredible story! The wedding ceremony was lovely. You just feel great pleasure and comfort by just being there. Maybe I should go to church more often."
        }, 
        {
            "index": 160, 
            "rating": "5", 
            "review": "Beautiful cathedral with a great story. This is Pope Francis's former church home when he was a Bishop in Argentina, and is a beautiful place to visit."
        }, 
        {
            "index": 161, 
            "rating": "5", 
            "review": "A most see. Loved everything about it! A very peaceful and Beautiful Church!! very large!!spend about an hour, the New Bishop happen to be there and people were line up to greet him, very friendly, it was a wonderful place to pray, rest and relax after a very busy day of walking in the city."
        }, 
        {
            "index": 162, 
            "rating": "5", 
            "review": "Beautiful Chrch next to Plaza San Martin. Situated on one of the most elegant places in Buenos Aires close to Kavanagh building. Mass every day and several services on Sunday."
        }, 
        {
            "index": 163, 
            "rating": "4", 
            "review": "Worth a visit--church of Pope Francis. Enjoyed our visit after visiting the Presidential Palace. This is a special place because Pope Francis was the Bishop here prior to becoming a Cardinal.\nLarge beautiful catholic church in the European style."
        }, 
        {
            "index": 164, 
            "rating": "5", 
            "review": "Majestic church. You can´t miss it! Near Retiro Railroad Station, and just a block away from San Martin square, a beautiful church with a magnificent main altar and wood crafts."
        }, 
        {
            "index": 165, 
            "rating": "5", 
            "review": "Beautiful. There was a mass taking place when we visited. The interior is beautiful with all the side exhibits."
        }, 
        {
            "index": 166, 
            "rating": "5", 
            "review": "Spectacular... One of the most beautiful churches in So. America.. this is definitely worth seeing!\nGorgeous chapels and side altars...beautiful art everywhere...timeless and uplifting!"
        }, 
        {
            "index": 167, 
            "rating": "5", 
            "review": "A Beautiful Place!!. Passed by this church and went in due to the sounds of the organ music. Attended the mass and the beauty of this church is beyond words."
        }, 
        {
            "index": 168, 
            "rating": "3", 
            "review": "Lovely church. It's a beautiful church with great exhibits inside.we enjoyed the weekend market just outside the famous cemetery and this basilica.lots of craftsman and artist with music and maybe a tango dancer or two.great experience"
        }, 
        {
            "index": 169, 
            "rating": "5", 
            "review": "Cemetery was amazing and our tour guide Liz was superb. The Mausoleums and the amount of high quality design that went into so many of these was truly amazing. What also amazed us were the prices paid for these. Again our personal guide Liz, recommended by trip advisor was very experienced and knew exactly where to take us then to share the history of a number of families buried there."
        }, 
        {
            "index": 170, 
            "rating": "4", 
            "review": "Like Le Madelaine in Paris. I was surprised at how beautiful this Basillica is inside. I didn't expect that judging from the outside. Two military guards in impressive uniforms are honor guards at the memorial to General San Martin on the right side. It reminded me of Napoleon's tomb in Paris but a bit smaller. While in Plaza de Mayo definitely take a few minutes to go inside and look around."
        }, 
        {
            "index": 171, 
            "rating": "4", 
            "review": "Pope factor helps. The Basilica is impressive on it's own but when you factor in that this is where the Pope used to serve mass the interest level rises. We did not spend much time there but the architecture of the interior is stunning."
        }, 
        {
            "index": 172, 
            "rating": "4", 
            "review": "Beautiful church. The church if you like to visit and compare is a nice one. The audio for the ceremony is not good, you probably have problems to understand if you dont seat in the first rows."
        }, 
        {
            "index": 173, 
            "rating": "3", 
            "review": "Spectaular Views of the Recoleta Cementary from the Windows. It was worth it to pay the price to go to the upper floors just to look out of the windows onto the Recoleta Cementary"
        }, 
        {
            "index": 174, 
            "rating": "5", 
            "review": "cool!. i like the day i had with these people, they love what they do and they really put the hard on it. I really love the experience, i strongly recomend to my fellow friends back home!!!"
        }, 
        {
            "index": 175, 
            "rating": "3", 
            "review": "Interesting---but the National Cathedral is much better. This was a nice Basilica for a quick view. However, the must see is the National Cathedral near the main plaza. If you have a limited amount of time, skip the Santisimo Sacramento and see the National Cathedral."
        }, 
        {
            "index": 176, 
            "rating": "3", 
            "review": "Don't expect St-Peters basilica.... For all the hype this church seems to get, it's not the most glamorous or ornate one I've seen, and believe me, I've seen many! The paint peeling off the top walls and ceiling lend well to some good photography if you bring a tripod... The Hotel is very nice, the rest a bit straight."
        }, 
        {
            "index": 177, 
            "rating": "5", 
            "review": "Santisimo Sacramento. Very nice traditional Buenos Aires Basilica. I was even get married in it, and one of my daughters was baptized at the Santisimo Sacramento too, in a very nice Chapel underground. I don not know if the Chappel can be always be visited. They used to have a very well known and wonderfull \"coro\"Generally ,there was on saturdays one of the last hours mass (9 p. m) I recomand it."
        }, 
        {
            "index": 178, 
            "rating": "3", 
            "review": "average basilica. really BsAs could be Worth of a bette basilica. such a big city with a such common Church is curious. the grenadiers Inside is the only interesting thing to see."
        }, 
        {
            "index": 179, 
            "rating": "4", 
            "review": "hidden on Plaza San Martin. it is easy to overlook this quick pop to this church, right next to Plaza San Martin, behind Edificio Kavanagh, on San Martin 1035. I suggest when you are at the Plaza San Martin, and you want to see the obvious - Palacio San Martin, Palacio Paz, the monuments, the tower, take a peek behind Kavanagh. Facing tower to the right. The basilica was built in 1916 by the same family - Anchorena, who owned the San Martin Palacio. The church as very nice tiles, and is typical of this period."
        }
    ]
}