{
    "category": "Buenos-Aires", 
    "entity": "Bosques-de-Palermo", 
    "avg_rating_stars": 4.542307692307692, 
    "review_count": 260, 
    "rating_stats": {
        "poor": 6, 
        "average": 11, 
        "terrible": 1, 
        "very_good": 75, 
        "excellent": 167
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "2", 
            "review": "Okay park but not woth spending the time. On a nice day it is an okay visit, but Buenos Aires has so much to offer that it is not worth spending the time. Aside from this, the garbage collection is in need of help, and depending on the day and time it may not be the safest place to be."
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "Perfect for a sunny afternoon. The Bosques de Palermo parks are a great place to do almost any kind of outdoor activity you could imagine doing in a city. On a nice day, you'll find people working out, biking, roller blading, walking their dogs, taking yoga classes, drinking mate, and just enjoying the parks. The parks are also conveniently located near quite a few museums (MALBA, Museo de Arte Decorativo, Evita Museum) so you can enjoy some people watching and then easily walk to any of these museums. As the nicer days of spring approach, this is the perfect place to spend a sunny afternoon."
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "REBUILD YOUR SOUL. Had the chance to stay very close to the Bosques de Palermo, actually chose this place, because seating there in an autumn afternoon to read a book, equals to anything... just walk and walk and walk, is a beautiful park !"
        }, 
        {
            "index": 4, 
            "rating": "5", 
            "review": "For a nice walk. I use to go with a friend or my wife and walk for an hour.It´s very nice and plenty of sun and green.Trees, water, ducks.It´s free and I recommended it."
        }, 
        {
            "index": 5, 
            "rating": "4", 
            "review": "Workout, walk, and jog with the geese!. Great open space...perfect for running, jogging, walking or just watching and feeding the swans (probably geese). Exercise equipment is available, but you need to get there early....Also a little-known jewel of a museum - the Silvori - within the park featurig local artists and their works..which few tourists get to see Silvori has its own indoor and outdoor coffee shop and tables surrounded by sculptures. Art classes are available for children and adults. No crowds..and a beautiful diversion."
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "Green Space. This is a very nice large park filled with walking trails, plazas, and areas to workout. There are many people here taking advantage of the beautiful area, so it can be very busy with cars as well. We didn't get a chance to walk around, but drove through the whole park. I would recommend giving yourself at least 2-3 hours to explore. Beware that there are scantily clad hookers advertising in some areas, so do not go off the beaten path. There are bars and restaurants under the bridges, have fun!!"
        }, 
        {
            "index": 7, 
            "rating": "5", 
            "review": "Beautiful park in the middle of the town. This is a huge extension of lawn, water, rose gardens and other beauties that make this space a place to go with the family or on your own for a walk, to rent a boat or feed the geese. Although very popular with \"porteños\" it is so big that it doesn't feel overcrowded at all. There are a few places for a refreshment and it is situated in the centre of the town and easily approachable by public transport."
        }, 
        {
            "index": 8, 
            "rating": "4", 
            "review": "beautiful relaxing walk. This is a beautiful park to wander around. There are nice paths and interesting sculptures along the way. There is a beautiful lake with many swans and ducks. There are also paddleboats, however I did not see anyone in them, perhaps because it is now their winter. Many locals come to this park to jog. There is also a beautiful rose garden, however you need to come in the right season to appreciate. There is an interesting art museum in the park (I don't remember the name), where we stopped to view the exhibits and have lunch."
        }, 
        {
            "index": 9, 
            "rating": "3", 
            "review": "The standard sunday picnic. If you wanna have a quiet afternoon on a sunny day, it is always nice to have a walk or a picnic at the park. Nothing to special about it but it is certainly confortable, specially when it's not too crowded (on school holidays)."
        }, 
        {
            "index": 10, 
            "rating": "5", 
            "review": "Very nice place for an afternoon walk. When I arrived in B. A. in april 2015 I asked a little to the hotel people about the nice places to see in town. They suggested a few ones as B.A. is quite a big city. So I took the subway and got there shortly after. Palermo is one of the upscale sectors of Buenos Aires so you can expect parks to be well arranged and most of the seing sites to be beautiful. Of course if you decide to stop and have a coffee in one of their beautiful restaurants you have to expect a higher price as the sector is a little expensive. But of course everything is relative! I walked for a few hours in Bosques de Palermo and the surrounding sites taking nice pictures and relaxing in it's beautiful nature. There are many monuments and pounds all around with nice trees and birds . . . everything you want to see. It was so nice ! It's quite a big place I can tell you that ! WSo don't miss it and go for a walk you'll love it."
        }, 
        {
            "index": 11, 
            "rating": "4", 
            "review": "Beautiful walks. Nice gardens and squares for morning walks. The Japanese garden is paid, unfortunately. The Rose Garden is a must see."
        }, 
        {
            "index": 12, 
            "rating": "5", 
            "review": "Amazing. Great place to hang out and run in the morning or just to walk your dog... one of my favorite things to do..."
        }, 
        {
            "index": 13, 
            "rating": "4", 
            "review": "a nice ride by bike. I spent a beautiful afternoon ride a bike in BS AS and I arrived till Bosques. very nice and wide space, where you can see the portenos on Sunday spending time with their families, playing futbol!"
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "Best place for a Sunday. What a great place to enjoy a Sunday Argentinian mate with friends, ride a bike or simply run... the best relaxing part of Buenos Aires"
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "Loved this park. Spent an afternoon wandering around this area, and I really loved this park! So much to see. It's pretty large and just so pretty. You don't feel like you're in a city really, even though you can still see the city."
        }, 
        {
            "index": 16, 
            "rating": "4", 
            "review": "A hot spot for runners at the heart of Buenos Aires. It's one of the top destinations for running and other sports in a free outdoor space. The park and the lakes are very tidy and well maintained. Worth visiting."
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "Perfect Palermo Parks!. Living just half a block from Parque Tres de Febrero, which is part of the Bosques de Palermo, I have occasion to enjoy this lovely bit of BA greenspace, on a daily basis. For my walk. Full of families, couples and singles of all ages; with a lagoon, flower gardens, a rose garden, ducks/ gees, live music concerts, workout classes, street hockey field, summer \"drive-in\" movies and the spectacular Museo de Eduardo Sivori; this is merely the beautiful beginning of the Bosques. They continue on, in a NW direction, into neighboring zone, Belgrano, for kilometers of bike paths, lagoons, football fields and horsetrails, taking full advantage of BA's riverside openspaces. Providing huge greenspaces, for all of BA's residents and visitors."
        }, 
        {
            "index": 18, 
            "rating": "5", 
            "review": "Amazing. Relaxing and peaceful, a home away from home. Palermo is my favorite neighborhood in Buenos Aires. The best place I have ever been to in my life! Loved it."
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "Big green park in Buenos aires. Excellent to ride boats, feed ducks, drink \"mate\" and have a good time. May be dangerous at night, cause it is a very dark place."
        }, 
        {
            "index": 20, 
            "rating": "5", 
            "review": "beautiful walk, BUT! during the day a NO Go after 6 Pm. Enjoy the beauty of Palermo lakes , the son, and the beautiful park, especially early in the morning, is our central park in small dimension, You will find people walk , skating, biking, and doing all kind of outdoor of activities, After 5 or 6 in the afternoon, the dynamic changes completely and you can find yourself in the middle unpleasant situations, transvestites and prostitutes choose this place to work every night, and you might find people selling drugs so don't go there during the night even if you are in a group of people."
        }, 
        {
            "index": 21, 
            "rating": "5", 
            "review": "Beautiful park, charming restaurant, great afternoon activity. The bosques are a great escape withint he city. It's really well maintained, and you'll see more locals and families. Make sure to check out the rose garden!"
        }, 
        {
            "index": 22, 
            "rating": "5", 
            "review": "Very pleasant park. If you like walking around in parks, this is a beautiful one. It's well taken care of and even when it's not a sunny day, the walk can be fun (don't forget a windbreaker, though, and an umbrella, in May)."
        }, 
        {
            "index": 23, 
            "rating": "5", 
            "review": "Beautiful park, rose garden and museum with courtyard cafe . The park is huge so there's lots of space for picnics, running, roller blading, you can hire boats or pedalos on the lake. There is a small museum with a hidden courtyard cafe which is lovely. Great any time of the day and the road around the lake is closed to traffic at the weekend to allow more space. The rose garden is lovely, free to enter but closes around 6pm. There are lots of different parts to the park so keep walking around and find the right spot (there's another lake closer to Las Cañitas)."
        }, 
        {
            "index": 24, 
            "rating": "5", 
            "review": "Huge, beautful park in the mddle of the city.. Huge, beautful park in the mddle of the city. We were there on a weekend and the park was full of locals. Running, sun bathing, dog walking, etc. There are water park rides, food carts, restaurants, etc. The rose garden is beautiful. Perfect place to walk around and have a picnic."
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "Stunning. Its very recommended if you are planning to take a morning walking or jogging trough the Palermo woods"
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "relaxed walk. We live in a relaxed walk in this park, it's very nice, like us, it's wonderful settled, if you love to be out its perfect"
        }, 
        {
            "index": 27, 
            "rating": "5", 
            "review": "Too big. The \"Jardines de Palermo\" are too big to make a concise relate.- Inside the parks there are a Planetarium, a Japanese Garden, lakes, roads to bycicles, rollers, etc.- And a lot of monuments.- The most important is the \"Monumento de los Españoles\" in Avenida del LIbertador corner with Avenida Sarmiento.- The zoo is in the same corner.- The monument to President Avellaneda is a good example of Art-Decó.- It is plenty of exotic trees.-"
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "Must Vist. One of the few open parks at BA, very well maintained, Very clean and very safe, use boats they´re not cheap."
        }, 
        {
            "index": 29, 
            "rating": "5", 
            "review": "Great Parks. Palermo is to Buenos Aires what Central Park is to New York. If it didn't exist the city would not be the same. Simply beautiful!!"
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Don't miss this park if you are in BA. You love Central Park, Luxembourg Place or Hyde Park ... well, here you have your BA version. Trees and art mingle here smoothly and you may even watch some baby ducks going in row after their mother if you are lucky. Several restaurants nearby as well."
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "Favorite spot in BA. These parks are a silence spot in the middle of the bustling city. In the weekends the roads inside the parks are closed off for traffic. So locals and tourists ride their bikes, rollerblades, run and chill for a picnic. Just walking around is super nice and defiantly worth a visit when in BA."
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "Beautiful Gardens. The gardens are very nice and well used. It was nice seeing people walking, talking, boating without talking on cell phones - just enjoying a nice day and the beautiful scenery."
        }, 
        {
            "index": 33, 
            "rating": "4", 
            "review": "Peace in a big city.. BA is a place where green space is at a premium and this is like an oasis of green. It covers a large area and has many different types of gardens."
        }, 
        {
            "index": 34, 
            "rating": "5", 
            "review": "Best place in Buenos Aires to be at. I loved my experience here. Loved the way I felt here. There is always a peaceful sense of environmental health."
        }, 
        {
            "index": 35, 
            "rating": "5", 
            "review": "Beautiful slice of green in the city. We visited on a cloudy day, but it was still a lovely experience. There are plenty of plants and animals to take in and you can spend a good amount of time wandering around (we brought sandwiches and had our lunch on a bench, taking in our surroundings).I would advise putting plenty of anti-mosquito spray on, though, as there is lots of standing water."
        }, 
        {
            "index": 36, 
            "rating": "5", 
            "review": "Parque Holanda is my favorite in the city!. This park has more roses than I've ever seen! Even more than near Buckingham Place in London! They were still in full bloom in late March. Walk over to the corner of the park towards the brick arched elevated railway, under which there are nice restaurants, a carousel, and Starbucks. This free park is better than the Japonese Garden next door, which charges about $8 US pp."
        }, 
        {
            "index": 37, 
            "rating": "5", 
            "review": "Beautiful area. There are a numbers of parks concentrated in Palermo neighborhood. All of them are very green, cleaned, well maintained and mostly, beautiful. Make sure to save half a day to spend and enjoy the view there, in a sunny day of course."
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "Nice day out. A very nice and free activity to do during the day!If you would like to get away from the hustle and bustle of the city and would like to get some sun and relax, this is the place to be!The rose garden is very pretty and the park is very nice and quiet.The whole park is massive so plan for a 3 hour visit, and bring some water with you!There are a few snack and drinks stalls available too."
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "Always beautiful when visiting in a sunny day. Wide spaces with a lot of green, best park in Buenos Aires for a good walk, with a beautiful scenario and a lake. Centrally located in Palermo."
        }, 
        {
            "index": 40, 
            "rating": "5", 
            "review": "Lovely area to visit !. Buenos Aires is home to 21 million people and this park is a bit of heaven to get away from the city. Bikes are available for rent, but strolling is just as nice."
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "One of the best places in the city. Whether you need a place to get some fresh air, drink a mate, have a picnic, hang with friends or get in your morning run, I recommend here! It is this beautiful little oasis in the city."
        }, 
        {
            "index": 42, 
            "rating": "5", 
            "review": "Enjoy Nature in BsAs. This is my favorite place to go for a run. It is less busy on weekdays but fun people watching on weekends. On one side, under the archways, you can take a break in one of the beautiful cafes or at the creperia."
        }, 
        {
            "index": 43, 
            "rating": "4", 
            "review": "Part of a good walk around Palermo and Recoleta. We walked through this park as part of a longerPalermo/Recoleta and thoroughly enjoyed the scenery. We had been through Soho and Vieja looking at shops and eating and this was a pleasant addition to the route. Not as many birds as I thought we might see but lovely scenery"
        }, 
        {
            "index": 44, 
            "rating": "4", 
            "review": "Nice walk. Very nice and friendly walk in the busy Buenos Aires. Some sidewalks are not great for a stroller. Also good place for open space sports"
        }, 
        {
            "index": 45, 
            "rating": "4", 
            "review": "Great park!. Its a very beautiful park, its very big. Its good to spend one afternoon doing something different in Buenos Aires. Near this park you can find the Japanese Garden, and its worth a visit."
        }, 
        {
            "index": 46, 
            "rating": "1", 
            "review": "The worst park I ever been. This is by far the worst park I ever been . It is not worth a visit if u don't have much time . There are plenty of roads in a middle and on every side of the park, with crazy traffic and of course the loud noise of the cars and the smog."
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "Great Park To.... Visit on a sunny day. Bosques de Palermo is located in an upper scale neighborhood of Buenos Aires. The park is well maintained, the environment is safe and there are several activities that people with or without kids can participate including rowing around the lake."
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "Great place to visit in day time. This is a great place to visit and enjoy during the day time. There aré Many things to do and see and It is free. You can walk or Rum or take your talk for a walk around the lake. It is clean and Safe and is fun during the day time. I advise not to go There at night as It is not Safe"
        }, 
        {
            "index": 49, 
            "rating": "5", 
            "review": "Love this place!. Want to work out outdoors? This is THE place! Here people come jogging, running, skateboarding, doing, crossfit and all kind of excercise, day and night! Also a nice place for a walk or to sit on the green grass, or take a paddle boat on the lake. Love it!"
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "Gorgeous park. BA has a lot of beautiful parks and this one is among the best. You can get a boat for the lake--walk around the beautiful gardens, sunbathe--jog--read etc..."
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "Great walk! . Really loved this place!! Amazing to go for a walk, skate, cycle and enjoy with family and friends too! Very nice, neat, safe and taken care of! Hope you enjoy it!"
        }, 
        {
            "index": 52, 
            "rating": "4", 
            "review": "Very good. Great place to share with friends. Peaceful and quiet. Really nice to have a different setting besides the busy Buenos Aires."
        }, 
        {
            "index": 53, 
            "rating": "4", 
            "review": "Nice park area with lots of flowers. BA has so many green areas, I suggest a city tour hop on hop off bus, BUT BEWARE many stations only accept Pesos and when you try to exchange only be careful. Inflation was about 30% last year. Take the tour, 3 hours and stop where you like."
        }, 
        {
            "index": 54, 
            "rating": "4", 
            "review": "A great public park.. One of the grand parks in Buenos Aires. Nice to walk around sit on its benches to relax from the heat under a tree. To watch passerby and simply to relax from the hum of the city."
        }, 
        {
            "index": 55, 
            "rating": "5", 
            "review": "Bosques de Palermo - A Lively Weekend Outing for Locals and Tourists. We loved the Bosques de Palermo park, from what I understand, the city's largest. It sprawls for acres and acres - and since we were there in Argentine summer, we enjoyed full blooms on every tree, plant and flower. The lake is quite lovely and there are flocks of long-necked white geese that sail around - in between the small paddle boats that are available for rent. There's a neat white iron bridge that connects both ends of the park and we walked over it and saw a small food stall that sold ice cream and soft drinks. A new addition, near the wonderful carousel, is a series of about 12 restaurants - Mooi is one, Lucca is another - that are housed underneath the red brick railway bridge. Mooi was very cute and had a Santa Fe style flair and what looked like good food. We had our standard cafe con crema outside under their blue umbrellas."
        }, 
        {
            "index": 56, 
            "rating": "5", 
            "review": "Spring in Buenos Aires. Spring never looked so good as it does in the Bosques de Palermo . After a long and damp chilly winter, Spring with warm sunshine and flowers blooming everywhere will lift your heart."
        }, 
        {
            "index": 57, 
            "rating": "5", 
            "review": "Paradise for the runner!. Great view, there's water, many trees, looked secure and a Starbucks is well located for a refreshment. Definitely an excellent option for running!"
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "A mini Central Park in Buenos Aires. A wonderful green space in the city. A mile long track is used by everyone that can move . . . whether walking a dog, in a wheelchair, on a bike, rollerblading, walking or jogging. The pretty lake which the track surrounds is big enough to take out a paddleboat, canoe, etc which can be rented at a reasonable rate. The highlight is arguably Rosedal, the Rose garden full of flowers and statues. Just as in Central Park in New York City, people can be found using the green space to picnic, sunbathe or play with a ball/frisbee, etc. It's a lovely urban oasis in the heart of Palermo."
        }, 
        {
            "index": 59, 
            "rating": "5", 
            "review": "very nice. a very nice (immense) green space right in the middle of the city. just what every person who loves nature is looking for."
        }, 
        {
            "index": 60, 
            "rating": "4", 
            "review": "Perfect for a walk or run. Nice wide pedestrian and bike lanes and a big park for a little getaway from the city craziness. I even saw people fishing out of the small ponds."
        }, 
        {
            "index": 61, 
            "rating": "5", 
            "review": "A gorgeous park. This is one of my favorite parks in buenos aires. We stayed close by so it was a fantastic place to walk to for a good run and outdoor exercise. There are outdoor gym options available and it's fantastic for kids to play and enjoy nature. The jacaranda trees in full bloom just add to the beautiful setting!"
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "The Central Park of Buenos Aires. Since 1875 the residents and visitors of Buenos Aires city have been enjoying the Bosques de Palermo (Palermo Woods) for leisurely time and outdoor activities in the heart of this mega city. The parkland incorporates the Botanical Gardens, the Zoo, the Japanese Gardens, the Rosedal (Rose Garden), the Planetarium, and much more open green spaces. Sundays are a particularly special day when the circular road around the Rosedal is closed to vehicular traffic and cyclists, joggers, bladers, pedestrians, enjoy the scenery without having to avoid traffic. Throughout the park vendors set up their booths to sell snacks and beverages plus, of course, ice cream. The Rosedal always has flowers in bloom year round and the Japenese Gardens provide a unique Feng Shui experience in the heart of the city. An Edwardian-style mansion on the grounds became the Eduardo Sívori Museum in 1996 and includes a charming café with sculpture garden. Boat rides are available on the three artificial lakes within the park. Close to the lake is the Poets' Garden, with stone and bronze busts of renowned poets, including Jorge Luis Borges, Luigi Pirandello and William Shakespeare. This green oasis in the heart of the city is one of the main attractions to escape the bustle of the city and relax and enjoy nature. Note there is a very small nominal admission charge for the Japanese Gardens for help with maintenance."
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "A beautiful respite from the city.. There are some wonderful features here, including the rose gardens, the lake, and the Spanish fountain. We didn't get to spend much time here, but I imagine it is quite a nice place to spend a few hours and walk or picnic or rent a paddle boat."
        }, 
        {
            "index": 64, 
            "rating": "5", 
            "review": "We used horse carriage to travel the area. On weekends no cars are permitted in the area.. Weather you walk or use Horse Carriages, it is great. You can enjoy the boats or the Japanese Botanic Museum. Lots to do."
        }, 
        {
            "index": 65, 
            "rating": "5", 
            "review": "A green break from Buenos Aries city dust and noise. The \"woods\" really a series of city parks are worth a visit if your tired of tramping the hot rough concrete of the city. Nice to just wander around, but the zoo and some museums are here. The Japanese gardens are particularly pleasant. Perhaps avoid the weekends when they're really busy. Tip... 15 min taxi ride from the cruise terminal."
        }, 
        {
            "index": 66, 
            "rating": "3", 
            "review": "Nice and peacefull!. A nice quiet area to visit but a bit dirty! People dont pick up their dog's poopoo so you litteraly have to look where you walk!!! I suggest you walk in the street and not on the sidewalk along the shore. Once you have passed the area you will gain access to the Rose Garden which is sublime!"
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "Great place to spend a lazy sunny day with the kids. I´ve always loved the Palermo forest and park, with it's lake and long walk paths. Great for bike riding, walks and picnics, although people did not always pick up after their dogs, so watch out for that. It´s a little tricky to get to and a taxi would be the best option unless you know how to get around on the public transport. Not very many eating options, but overall very pleasant."
        }, 
        {
            "index": 68, 
            "rating": "4", 
            "review": "Trees, open air, easy to get there: Palermo. This is a huge garden in the area known as Palermo, very close to downtown and to other neighborhoods such as Belgrano, Palermo, Colegiales. There are several trails you can take and you may walk past garden roses, old trees and a small lake (actually there are two lakes in the Gardens). You may rent a small rowing boat or pedal boat to stroll on the lake as well as you may also rent bikes to stroll around the gardens. Beautiful, easy access, nice morning walk."
        }, 
        {
            "index": 69, 
            "rating": "4", 
            "review": "I run here every day!. Get for sports activities, and a nice stroll! Great for people watching, pick nick and beautiful lawns. Museo Sivori has the best lunch restaurant in town!"
        }, 
        {
            "index": 70, 
            "rating": "5", 
            "review": "Bosques del Romance. ES - EN Había una vez... mucho antes que Palermo se desarrollo, una zona boscosa que era las afueras de Buenos Aires ciudad ,donde vivían médicos y gente de dinero. Entre sus árboles se formaron los romances de aquellos días, que llegarían a poblar la ciudad. Hoy sigue un pedacito de ese mundo mágico, pulsando con sus historias de amor que cantan las cotoritas entre sus ramas... vayan a escucharlas.Once upon a time... long before it was developed, Palermo was the outskirts of the city of Buenos, a rustic forested area where doctors and the well-off lived. Among the trees of those forests, many a romance was nurtured, that formed the couples who went on to populate the city. Today, we still have a small piece of that magical world, pulsing with its love stories that the wild parakeets continue to sing about among its branches... go listen to them."
        }, 
        {
            "index": 71, 
            "rating": "5", 
            "review": "Gorgeous!. Wow, like more than central park. People jogging, children playing, feeding ducks, beautiful/ natural ecology. Within a few blocks walk in Palermo I saw more than 50 restaurants. Nice garden, lake, walking paths."
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "Beautiful !. If you like a break from the buzy streets of BsAs this park offers you just that! It's beautiful for just stroling, having a lunch, renting a small boat or visiting the Galileo observatory."
        }, 
        {
            "index": 73, 
            "rating": "5", 
            "review": "Cool place to relax. The park is diverse and large to traverse. The variety of plant materials offer a history of BA and how they arrived in Argentina."
        }, 
        {
            "index": 74, 
            "rating": "4", 
            "review": "Some Green in Buenos Aires. This is one of the biggest park in Buenos Aires. It's very popular especially during the summer nights as the city ussually do some free activities which you can check at the web page. The only down that this has is that during summer, there's no much places where to hide from the hot summer sun.I recommend to avoid it during summer days, but that's just me.You'll find people doing all kind of sport in the park during the day, and afternoons.So, Go! Take a look and make your own opinion!!"
        }, 
        {
            "index": 75, 
            "rating": "4", 
            "review": "Ideal for a healty stroll in Buenos Aires. Walking, running, skating, bicyling, paddling... you choose your activity and here you can exercise it. Well organised, safe and clean, the large Parque Tres de Febrero (Bosques of Palermo) allows for a nice day out when the heat beats the town. Well served by public transportation and quite close to major Art Museums. Recommended."
        }, 
        {
            "index": 76, 
            "rating": "5", 
            "review": "Nice area to recover from bustling buenos aires. This is my green favorite in Buenos Aires - free of charge, plenty of water, cozy gardens - wander around and enjoy!"
        }, 
        {
            "index": 77, 
            "rating": "4", 
            "review": "beautiful scenario. We have been there at the beginning of January. Almost desert.Very hot. Many places were closed. The overall sensation was anyway to be in a tropical city. Beautifully decorated and preserved. Top."
        }, 
        {
            "index": 78, 
            "rating": "5", 
            "review": "Huge park. We walked a very long way to visit the rose garden. It was lovely and there were many people enjoying the gardens. There is a lake with boats to rent. Lots of other activities. Definitely could be an all day activity."
        }, 
        {
            "index": 79, 
            "rating": "4", 
            "review": "Refreshing. Nice and beatutiful park. So many plantskola and trees from all the would. Just sit down and relax and enjoy. This is A nice place After all walking around Palermo."
        }, 
        {
            "index": 80, 
            "rating": "5", 
            "review": "Absolutely stunning. Next to the gardens, this is such a peaceful, serene location. In my opinion, I must visit for those going to the city. One of our favorite attractions."
        }, 
        {
            "index": 81, 
            "rating": "4", 
            "review": "Really nice park. In the middle of the busy city, this space is great to relax, and to run around. The streets of B.A. heavily favor cars over people, so being able to not worry about being run over was a plus when I went running."
        }, 
        {
            "index": 82, 
            "rating": "5", 
            "review": "Free and beautiful!. This another huge green area in our capital city. There is a big lake with friendly ducks, a golf court and Cafeteria, tennis clubs and Selquet bar and restaurant. You can get there by train Mitre, from Retiro station or by buses 130, 118, 29, 59, 60, 15 and 55. It's a healthy place for jogging or simply havving a picnic. You can combine this with a visit to China Town area nearby or to River Plate Museum."
        }, 
        {
            "index": 83, 
            "rating": "5", 
            "review": "Lungs of Buenos Aires. Large park with beautiful grounds. Not typical of Latin America at all. Maintenance is good. I went on Dec 8, Feast of the Assumption. While very crowded with people off for the holiday, it was very enjoyable seeing the Porteños having a great time the park."
        }, 
        {
            "index": 84, 
            "rating": "5", 
            "review": "Massive Park...!!. One of the biggest city park in Latin America, this massive forest its in the nearby of the metropolitan airport and in the coastal side of the city. If you are staying in the region of Palermo, Belgrano, Nunez or Recoleta, this park its an easy gateway to relax during the weekdays.During the weekends, its a popular spot for runners and families that visit the park. There is no entrance fee and services are rare to find around the park so be prepared and try to used the nearby restaurants. In my opinion, the only day to avoid the park its during spring day (09/21) and when they have concerts around since the flock of people its unmanageable. Besides that, its a great place to visit, specially with one of the city bikes. You can access the park by train or bus easily so plan around it."
        }, 
        {
            "index": 85, 
            "rating": "5", 
            "review": "Transfered to England a couple of centuries back. Well worth a visit if you like parks and flowers and peacefulness. Especially beautiful the rose garden when in bloom and the Patio Andaluz. During the whole day there are joggers, bike riders and skaters. Here is where you meet. There are also small row boats to rent."
        }, 
        {
            "index": 86, 
            "rating": "4", 
            "review": "Nice in Spring. As i have mentioned before I walk daily there and it is nice for that purpose.There is a large lake with a lot of goose and ducks but it is dirty and in some days are smiley."
        }, 
        {
            "index": 87, 
            "rating": "4", 
            "review": "The green lung of the city. Originally planned to be a Buenos Aires Central Park, (the 3 Of February Park) this huge green place is beautiful for a fun day outdoors. It's so big there are many different activities to do. You can visit the Japanese garden, or rollerblade or bike around the place, jog or even pic nic anywhere.It was planned by President Sarmiento around 1870s, where the house of former Governor of Buenos Aires, Juan Manuel de Rosas, was placed. The president demolished the place of his former enemy and created a huge public park, named after the date in which Rosas was defeated in the Battle of Caseros. This place is full of argentinian history, and the anecdotes around the most emblematic places in the city should not be forgotten."
        }, 
        {
            "index": 88, 
            "rating": "5", 
            "review": "Fantastic place to walk as the sun goes down. What I love about Buenos Aires is the parks and the wide wide avenues. Bosques de Palermo is the finest and biggest of all the parks. There is so much going on and the beauty of the park and lakes makes iit well worth your taking time to go for a long stroll.There are all sorts of people in the park and it feels so safe - even as the sun goes down and you are left in the dark.Its worth going up near the far end of the park to see what comes out after dark. It is a show in itself !"
        }, 
        {
            "index": 89, 
            "rating": "5", 
            "review": "join the locals on a sunny day. I joined an outdoor Zumba class before enjoying a welcome cup of tea in the little Sivio Museum's cafe and a quick circuit of the rose garden.Sunny weekends entice the hordes to cycle, rollerblade, walk or picnic in this large greenspace. Very pleasant to walk or cycle. It is a vast space so be prepared with water, sunscreen, etc.You need a whole day to explore the nearby gardens, and this whole area."
        }, 
        {
            "index": 90, 
            "rating": "5", 
            "review": "Relaxing day in the park. Don't expect the Central Park in NY or London's Hyde Park, but it is certainly one of the cities biggest green areas. On Sunday's you will find it packed with people walking, jogging, riding bikes and skateboards or simply taking a walk along the pounds. You can also hire a paddleboat and get closer to swans an ducks on the water."
        }, 
        {
            "index": 91, 
            "rating": "4", 
            "review": "Visit this park on a Sunday. It is a different experience. A beautiful park, extremely crowded on Sundays. A social experience. You can see all kind of people, every social class, every race, all together, enjoying peacefully and joyfully the pleasant Buenos Aires climate. Great place for strolling or jogging, Have a coffee or lunch in the patio of the Museo Sivori! Free entrance. If you are in Buenos Aires, it´s a must."
        }, 
        {
            "index": 92, 
            "rating": "5", 
            "review": "The most beautiful park I have been in. The most beautiful park in South America I have been in, specially The Rosedal section. There are people all the time around park walking, biking, and skating. It is good for exercise as well as take a relaxing picnic as many of locals take on Saturday and Sunday! You can also take a boat in the lagoon with gooses around you."
        }, 
        {
            "index": 93, 
            "rating": "3", 
            "review": "A Very large Park. This is a very large park on the edge of the city and provides a large area of opens spaces, small lakes and fountains and a sporting facilities and on a Sunday it is packed with people. If you want to get away from the hustle and bustle of the city take a walk."
        }, 
        {
            "index": 94, 
            "rating": "5", 
            "review": "Leafy splendor. Going to or from Palermo this park is a must. It is a simply delightful stroll or a nice place to just sit surrounded by such beautiful plants and trees if you're weary of pounding thee pavement of Buenos Aires."
        }, 
        {
            "index": 95, 
            "rating": "5", 
            "review": "Beautiful!. If you are in BsAs on a sunny day and want to enjoy the weather, this is a beautiful spot to walk around."
        }, 
        {
            "index": 96, 
            "rating": "5", 
            "review": "Green green green. Do you want to run? Come here. Do you want to relax with your friends? It's perfect. Do you want to enjoy some good live music? This is the place to be! Beware this 'park' is huge and it's definitely easy to get lost just walking around. The sunsets by the lake are amazing though. Worth getting lost."
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "nice place to chill. great place in the city, very relaxing to just sit and chill on a bench. Very green, the japonese gardens are wonderful. Should be on every tourist's lists of things to do."
        }, 
        {
            "index": 98, 
            "rating": "3", 
            "review": "Joggers, Sunday picnic crawl and an amazing Rose Garden. This is the typical city park with the typical city park activities, such as: People on rollers or jogging on the morning, picnics on weekends, lake activities and some people playing music here and there. It is big and well preserved, but not that amazing, the main thing to do here is going to the Rose Garden, which is in the middle of the park and that is beautiul, mostly in Spring and Summer. Open until 6pm. Another high point on this park is the Planetarium, often housing multiple open events."
        }, 
        {
            "index": 99, 
            "rating": "3", 
            "review": "Just a park. October 26th - 2015 - This park is one of the favourite destinations for Sunday joggers both of the Palermo and Belgrano boroughs. The park is nicely kept, but has nothing more than any other city park of the same kind you can find anywhere around the world."
        }, 
        {
            "index": 100, 
            "rating": "5", 
            "review": "Beautiful big Green areas. This park invites you to walk it, run it or just sit on the grass and drink mate. The day we visited it could not be more perfect, sunny but with an amazing temperature of around 20 °C. Me and my wife went with our 18 month boy and he could run freely and enjoy watching the different birds that habit the park. A great place to spend the day, we visited the Japanese Garden there and had lunch (japanese) in the restaurant of the garden."
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "The wonders of Buenos Aires. If you like freedom, fresh air, silence and peace, than you're in the right place in Buenos Aires, this is one of the best places to chill out during hot days. Around it there are many others attractions like the planetarium the zoo, and etc.The parks offer a good infrastructure for the practice of sports between others things. In Buenos Aires those Bosques are definitely a must visit place. Go and check it out."
        }, 
        {
            "index": 102, 
            "rating": "4", 
            "review": "A Nice Park to Walk In. While on my way to Museo Evita I walk through Bosques de Palermo. There were people out jogging, biking, walking their dogs and a few rollerbladers. Nice place in the city to unwind."
        }, 
        {
            "index": 103, 
            "rating": "4", 
            "review": "Nice for a Sunday stroll whilst people watching. Attractive park in the city. Very busy at the weekend with joggers, bikes, skaters and walkers. But still worth a stroll."
        }, 
        {
            "index": 104, 
            "rating": "5", 
            "review": "Love this place. My favorite place to spend time at on a sunny day! It is a beautiful park with many things to do. There are always lots of people running, biking, rollerblading etc. There are also many free activities on the weekends including yoga and dance classes. They offer bike and paddle boat rentals, both an excellent way to spend a day outside!"
        }, 
        {
            "index": 105, 
            "rating": "5", 
            "review": "I wish. I wish:I had a dog to walk thereI had Kid to take thereI had a bike to cross thereI liked to jog to run there"
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "Great place. Really nice place to walk around, have pic-nic, do any kind of workout, alone or with kids. More quite from Monday to Friday."
        }, 
        {
            "index": 107, 
            "rating": "4", 
            "review": "Wonderful space. The open spaces in Palermo are great - the ducks, joggers, peddle boats all make for an interesting time.It's a wonderful outdoor space away from the concrete jungle of Buenos Aires"
        }, 
        {
            "index": 108, 
            "rating": "4", 
            "review": "Great park to feel free in the city. Great Park Loved all the skaters and the crazy work out sessions going on.....top place to grab some fresh air in the city"
        }, 
        {
            "index": 109, 
            "rating": "5", 
            "review": "Green space great for a morning run and. There is a recreational trail here which is designated for rollerbladers, cyclists, runners, walkers and joggers. This seems to be the principal place for portenos to do their morning exercise, and we were very happy to join in"
        }, 
        {
            "index": 110, 
            "rating": "4", 
            "review": "Nice park.... Walked all around the park...sunny day and lots of people out and laying in the sun and picnicking...would have been nice to see the flowers in bloom..."
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "A beautiful park in the middle of the city. A beautiful park in the middle of the city. There is a lake, and ducks and even the option of renting a boat to padlle around or a bike or rollerblades to stroll around. Its a wonderufl place to catch some sun, relax and enjoy the scenery!"
        }, 
        {
            "index": 112, 
            "rating": "4", 
            "review": "Resting after eating. Enormous park and green areas to rest, be with nature. People resting, walking and jogging. Very nice views"
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "Perfect place to walk and rest. I was enchanted by the 'lagos park'. Don't miss it. I could even join a zumba dance class. It is a great place to go"
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "Nature in the middle of the city. Beautiful, quiet piece of nature. Bosques de Palermo is a great park for an early morning or late afternoon walk. Relax and enjoy the nature in the middle of one of the most historic cities of Latin America."
        }, 
        {
            "index": 115, 
            "rating": "4", 
            "review": "nice place to walk and relax.. It is a great place to walk during your trip and have some contact with the nature. So beatiful greens and some incredible lakes."
        }, 
        {
            "index": 116, 
            "rating": "5", 
            "review": "Great place. This place is surely the lungs of Buenos Aires! Great place to relax or do some exercise! Really big with great views! Definitely a must when coming to Buenos Aires!"
        }, 
        {
            "index": 117, 
            "rating": "5", 
            "review": "Fresh air. if you want to spend a day relaxing , a picnic with te family, friends, or just you, this is the ideal place to do it! bring a blanket where you could lay on the grass and enjoythe view,there arealso many optiosto do sports! People gather here on weekendsto spend the day, play, and rest"
        }, 
        {
            "index": 118, 
            "rating": "4", 
            "review": "Relaxing afternoon. Nice way to spend an afternoon and relax. Bring some sandwiches and have a picnic or go to the Japanese Garden next door and eat sushi. In the morning it is full of joggers and mothers with young children."
        }, 
        {
            "index": 119, 
            "rating": "4", 
            "review": "Jogging in Buenos Aires 1. Bosques de Palermo. If you enjoy early morning jogging in a warm climate and among interesting scenery and places, then you will enjoy jogging in Buenos Aires. In this series of notes, I will recommend to you a number of jogging routes. I propose to describe the route pointing out some highlights along the way. Depending on where exactly you are and how far you want to jog, you will be able to determine where to join and if you wish to run the whole or only part of the route. You will need your map handy to highlight the route, or the part of the route you wish to cover. In this note I will describe a jogging route in the Recoleta / Palermo area. The route runs along Avenida Del Libertador and what is known as the woods of Palermo “Bosques de Palermo” which are really a series of grand parks on the east side of “Avenida Del Libertador”. However, you will find it interesting to run on either side of the road. I usually start at the bottom of “Calle Rodriguez Peña” at Avenida Del Libertador. I run a short distance on the west side of the road with “Parque Carlos Thays on the right [east] side. I cross to the east side of the road at “Avenida Pueyrredon” and the ” Buenos Aires Design” and run in front of the museum of fine arts “Museo Nacional De Bellas Artes”. Continuing on the east side, the woods of Palermo will be on your right. As you run, you will see on the left side the “Argentine Automobile Club” followed by the museum of decorative art “Museo de Arte decorativo”. The woods on your right will, after a while, give way to some elegant apartment buildings and soon you will pass by the museum of popular art “Museo de arte popular”. All the way you will see on the west side of “Avenida Del Libertador” some of the area’s fine restaurants and cafés such as “Dandy”, “Croque Madame” [in the museum of decorative art] and “Tabac Cafée” [currently being renovated]. At “Calle Cavia”, the woods reappear on the right. At Avenida Sarmiento and the magnificent white Statue in the circle of “Los Españoles”, you will see the “Buenos Aires Zoo” on your left. Cross Avenida Sarmiento and continue on Avenida Del Libertador. The “Plaza Intendente Seeber” is on the west side and next to it is the US embassy. Continue along Avenida Del Libertador till Avenida “Infanta Isabel”. Make a right and go around the famous Rosedal gardens [which are within the Palermo woods. The road will loop around and you will pass the entrance to the garden with its famous white wooden bridge. You will also see on your left hand side the “Museo Eduardo Sivori”. Continuing around the small lakes of the Rosedal, you come back to Avenida Sarmiento. Now, you have two choices; either you retrace your route on Avenida Del Libertador, or you take a slightly longer route, making a left on “Avenida Sarmiento” and a second right on “Avenida Alcorta”. The latter route, along “Avenida Alcorta” gives you an opportunity to run through this prestigious and elegant part of Palermo. You will see magnificent apartment buildings and houses. From “Avenida Sarmiento” to “Avenida Casares”, the woods will be on your right. A few more blocks you will see on your left the famous “MALBA museum” “Museo de Arte Latinoamericano”. Continue on Avenida Alcorta all the way back until you pass by the famous “Floralis Genérica” in the “Plaza de Las Naciones Unidas”, the park of the United Nations. Next you will see the Faculty of Law on the left and you will be at the back of the “Museo Nacional de Bellas Artes”. You can cross through the park to Avenida Del Libertador, completing the route. You can also continue on Alcorta till “Avenida Callo”, where both “Avenidas Libertador and Alcorta” merge into Avenida Del Libertador.The full loop is just under 6 miles [10 Km], but you can choose the distance you want by crossing anytime from Libertador to Alcorta [or the reverse] on any of the many side streets and go back, or of course retrace your route on Libertador. I must say, however, that the Rosedal area is quite nice to run through. I would recommend starting the run around 7am. This will allow you to avoid any major traffic and it will not be quite hot at that time – you still will have a good sweat by the time you finish.In the next note, I will describe a jogging route in Puerto Madero. Enjoy your run."
        }, 
        {
            "index": 120, 
            "rating": "5", 
            "review": "Very Interesting and Historic Place. Some of the most interesting and elaborate mausoleums in the world. A must see. Evita's mausoleum is the most famous on the property."
        }, 
        {
            "index": 121, 
            "rating": "5", 
            "review": "Rent a bike and go to visit it!. The Palermo Bosques are huge. So the best way to explore is renting a bike to get a different perspective of the city.\nAsk in your hotel a place to rent or try to find a bike rent in Jorge Luis Borges street, one of the main streets of Palermo."
        }, 
        {
            "index": 122, 
            "rating": "5", 
            "review": "Highly Recommended. Los Bosques de Palermo are amazing, and a great way to explore the Palermo neighborhood. There are so many different parks to wander around, and it's really great to see a lot of families spending time here. Buenos Aires does get pretty hot in the summer, and the sun is very strong, so make sure you are prepared. Definitely make a point to order some Choripan, which you can find near the entrance to some of the parks."
        }, 
        {
            "index": 123, 
            "rating": "3", 
            "review": "big park. is a nice park to run, or even cycle around. During the week is a lot nicer, as the weekends gets too many people. Sad to see the lack of public toilets around, besides that, is a nice place."
        }, 
        {
            "index": 124, 
            "rating": "4", 
            "review": "Great place but keep your eyes on the ground. Bosques de Palermo is one the big breathing lungs of Buenos Aires, and this city, one of its beauty, is that is has many all over the place. We went a few times with our children to play around and have picnics. Space is open and big surrounded by streets of vehicles that give life to the city. You will find some old colonizer and independence heroes and new sculptures for an artistic touch. Just make sure you keep your eyes open for the pet (mostly dogs) excrements that are left behind and are abundant in park (there seems to be no pet excrement removal culture while a visible abundant pet population). We had to clean the soccer ball a couple of times as well as our shoes.Enjoy your visit.jr"
        }, 
        {
            "index": 125, 
            "rating": "4", 
            "review": "Not such a fresh walk. I love the artwork in the park, the only thing that perturbed me was the amount of dogs in the parks even if they were on leaches"
        }, 
        {
            "index": 126, 
            "rating": "5", 
            "review": "beautiful walk. After 2 days of heavy rain, we went for a walk. It was beautiful and safe, the fall leaves gave it a bucolic feel. Well maintained and landscaped. A gem! We loved it!"
        }, 
        {
            "index": 127, 
            "rating": "5", 
            "review": "The most beautiful green area of the city. This park is the most beautiful green area of the city.Easily accessible by bus or car, this beautiful park was designed by French landscaper Carlos Thays (1849-1934), on the lands of the former ranch of Juan Manuel de Rosas.For those who have visited Paris, this park is a bit reminiscent in part of the Bois de Boulogne, but with the rough touch of native trees.For those who know New York, the Palermo woods are the City of Buenos Aires, what Central Park is to Manhattan.The rose garden, the lakes, the Planetarium, the Victorian Buenos Aires Zoo, the Japanese Garden, Art Museums, created in the late 1880s, wide boulevards, beautiful monuments donated more than one hundred years ago to celebrate the centenary of the Revolution of May, beginning of the independence of Argentina, make this park a unique place to enjoy the sunny days."
        }, 
        {
            "index": 128, 
            "rating": "4", 
            "review": "a nice walk. I was lucky enough to have a very sunny day to walk across the rosedal. Nice place, full of people on saturday morning, mostly locals."
        }, 
        {
            "index": 129, 
            "rating": "4", 
            "review": "Very very nice. Great place, gets cleaned regularly, got lots of space, has a zoo, a planetarium and the rosedal and a lot of things nearby that are good too. Very green, also has a lake (not sure if it's clean; certainly not swimable) where there are ducks.There is a bike track, where people go around in bikes, do tricks with skates or rollerblades, run or rent a pedal car (which aren't really good). There are stands where you can buy food and drinks, but they tend to be on the expensive side.Overall, very nice.Not at night, though. Heard stories that people 'go to work' there, if you know what I mean. And aparently, they aren't exactly women."
        }, 
        {
            "index": 130, 
            "rating": "5", 
            "review": "Vast Green Area. These beautiful decorated parks and gardens are the paradise for visitors to rest and spend leisure time outside, especially during the sunny weekends (do not forget to use sunblocks!!!). It's a great place for family walks, meditation and contemplation of nature.There are three beautiful artificial lakes within the park and many gardens. Jardin Botanico Carlos Thays (Botanical Garden) with large gardens and great varieties of exotic and local flora is definitely worth visiting. Also located in this area is Jardin Zoologico (Zoological Garden), Jardin Japones (Japanese Garden) and Rosedal (Rose Garden) and the city planetarium with its distinctive architecture, Planetario Galileo Galilei.Definitely a \"must\" when going to Buenos Aires."
        }, 
        {
            "index": 131, 
            "rating": "5", 
            "review": "Great Parks. The Bosques of Palermo is a great place to simply relax,and escape all the noise and traffic of Buenos Aires. It's particularly pleasant to come here during the week. I just loved the rose gardens."
        }, 
        {
            "index": 132, 
            "rating": "5", 
            "review": "Nature in the city. If you want to see some nature and smell some plants, it is the place to enjoy.Nice parks, beautiful statues...."
        }, 
        {
            "index": 133, 
            "rating": "5", 
            "review": "Fabulous parks. One of the highlights of our 6-week stay in Buenos Aires were the parks in Palermo. Scarcely, a day went by when we did not work through one of the parks that seems to extend for 5 miles or so from Recoleta to Belgrano. We probably spent at least 15 days in the Rose Garden literally smelling the roses and people watching while sitting on one of the benches next to the Lake. From here, you could see the countless roller bladers, bike riders, joggers, walkers, families, etc. enjoying their day in the park."
        }, 
        {
            "index": 134, 
            "rating": "5", 
            "review": "Has to be seen. Bosques de Palermo are a group of parks in the neiborhood of the same name. These parks are huge, and are a must to visit when in BA. There are lakes where you can rent boats, feed the ducks, picnic, go jogging, etc. Is a great place for outdoors activities. The view is breathtaking, one of the best in BA"
        }, 
        {
            "index": 135, 
            "rating": "5", 
            "review": "a magnificent large park in the middle of the city. This magnificent and vast park is located in the Palermo district, along the Rio de la Plata. It includes many features such as the hippodrome, the botanical garden, a planetarium, tennis clubs, lakes, etc.It is a great place for doing sports, jogging, skating, etc. or having picnic or take the sun with friends or with a family."
        }, 
        {
            "index": 136, 
            "rating": "5", 
            "review": "One of the Great Urban Parks in South America. This is the local take urban parks like in your home country. Each seeks something different and deals with different climatic and urban environments. Los Bosques has a bit of something for everyone and on the weekends and holidays of Spring, Summer, and Fall, it is well used by the porteños of Buenos Aires. Closed to automotive traffic during weekends and middays, its a great place to wander, picnic, roller blade, grab a snack (choripan or bandiola!). The lagoon is nice, great little museum with a cafe at the northwest end, and of course the Paseo Rosedahl, the rose gardens. Family friendly, great for couples and singles. Need a break, take a walk around here. Morning and weekend joggers flock here. Guitarists busking, exercise groups stretching, kids kicking footballs around. Don't miss the jacaranda trees in bloom in October/November."
        }, 
        {
            "index": 137, 
            "rating": "5", 
            "review": "cool place!. We visited this park on 10th March, 2015. This is not a real Tourist spot. This is a place for local residents of Buenos Aires to relax, jog, hang around or simply enjoy the cool clime of BA. Spend an hour or so watching the activities of BA residents. You can see lot of dog walkers with 10-12 dogs of different breeds!"
        }, 
        {
            "index": 138, 
            "rating": "5", 
            "review": "Beautiful park to relax in. Beautiful park to relax in or if you don't want to relax there are plenty of pedalos, bikes or skates to hire. Don't forget to get a choripan whilst there, too good to miss."
        }, 
        {
            "index": 139, 
            "rating": "5", 
            "review": "the lungs of Buenos Aires. It's 400 hectares of nature, where you can enjoy of a great walk, camping or just chill out there in the grass. You can see a lot of people doing sports activities, also some groups playing or doing art. It has everything for everyone."
        }, 
        {
            "index": 140, 
            "rating": "4", 
            "review": "Nice trip to see the nature in a big city. The small forest that sorrounds the Lago de Regatas is very nice and you can walk or ride a bicycle without worring for vehicles"
        }, 
        {
            "index": 141, 
            "rating": "4", 
            "review": "Nice place to take a walk. It is a nice place to take a walk. Enjoy, take your time and have an ice cream. Don't forget to take pictures."
        }, 
        {
            "index": 142, 
            "rating": "5", 
            "review": "While away an hour in the shade. After the bustle and noise of the city, a long walk in Palermo's parks is a welcome chance to idle, relax and people-watch the gorgeous Portenos."
        }, 
        {
            "index": 143, 
            "rating": "4", 
            "review": "Bosque de Palermo. Green Island to relax,walk, very neat. To enjoy with friends and family. Áreas for cycling . Actually it is being improved. Lake With ducks and other birds that nest in a sort of península. Paddle boats can be rented. Very quiet specially on week days. Many use the area to go jogging, mornings when weather is fine. Nearby restaurant and bar."
        }, 
        {
            "index": 144, 
            "rating": "5", 
            "review": "Island in the middle of the city. Amazing park with great walking space and tons of green space. There is a 2 mile track along the outside for a great run or bike ride, but a walk through the flower garden is great at any time of the day. Locals run and enjoy this park at night. If you want to see hundreds of Argentines out on bikes or rollerblades or walking come here after work, always busy. Great stop to relax in the city."
        }, 
        {
            "index": 145, 
            "rating": "5", 
            "review": "Highly recommended if you like the outdoors.. Very nice place to take the family due to ample space for kids and dogs to play.The adults can drink wine or \"mate\", the typical Argentinean tea, and eat empanadas (meat pies).In the past, it was permissible to bring a portable grill and cook a barbecue ( \"parrillada\" in Spanish). I don't know if at present time cooking is permissible.During our visit with family members and small children, and 2 dogs. We brought empanadas, mate and soft drinks.We spent about 8 hours there and enjoyed every minute.The weather cooperated and the summer heat was tolerable."
        }, 
        {
            "index": 146, 
            "rating": "4", 
            "review": "Go where Argentinians go. Palermo has several small green squares where you can see where many Argentinians like to enjoy their free time. Those small parks are always full of people walking their dogs, reading books, meeting friends or playing their instruments. Normally tourists don't even stop to appreciate those places... and miss the opportunity to have at least a small sensation of what it would be to live in Buenos Aires like the locals do. It is a nice place to drink wine and eat some cheese, while enjoying the view and the people!Remember that in Argentina you are allowed to drink in the streets and in the parks! ;) Don't miss that opportunity! :)"
        }, 
        {
            "index": 147, 
            "rating": "5", 
            "review": "Ideal for jogging. Ideal for jogging or enjoy a warm sunny day besides the lakes. Once there don't miss the Panetario and the Japanese Gardens"
        }, 
        {
            "index": 148, 
            "rating": "2", 
            "review": "Shame. What a shame, that a garden copy of the Paris parks, place where I've spent part of my youth, now is a open space for Transgender to practice open sexual activ ites at down. Refrain yourvisit."
        }, 
        {
            "index": 149, 
            "rating": "5", 
            "review": "Very nice, specially on weekends. Going to the parks of Palermo on a weekend is a very nice experience. There are so many Argentinians seizing the day: doing picniks, little shows, or just resting in the lawn. The park itself is beautiful and with plenty of things to do. Don't miss it, with or without kids."
        }, 
        {
            "index": 150, 
            "rating": "4", 
            "review": "Come celebrate the 100 year anniversary of “El Rosedal de Palermo” in Buenos Aires.. Yesterday, January 6, 2015, was a good day to visit the “Rosdal de Palermo or Paseo del Rosedal”. It was warm and a bit overcast which gave the garden a delightful feeling. I usually walk from Recoleta along “Avenida Del Libertador” on the tree shaded west side of the Avenida, enjoying the beautiful apartment buildings and watching the diligent porters polishing the brass handles of the buildings’ doors. Just before you get to Avenida “Coronel Dias”, you will notice what used to be Caffé Tabak [yes with a double “f”] all boarded. Like many who have enjoyed the excellent food and service at Tabak, I am hopeful it will soon reopen after renovations. Shortly afterwards, you will arrive at the huge monument of “Los Espanoles” [picture 1] in the middle of the crossing of Avenida Del Libertador and of Avenida Sarmiento and to the north east you will be able to see, the “Parque tres de Febrero” that the “Rosedal de Palermo” is part of. The “Parque tres de Febrero, or Bosques de Palermo” is just under one thousand acres and is located in Palermo between “Avenida Del Libertador and Avenida Alcorta”. It was proposed by congressman Vicente Lopez and by President Sarmiento and named after the date of defeat of Juan Manuel de Rosas, the previous governor of Buenos Aires 3 Febrero. The Idea of a rose garden within the park of 3 Febrero was that of Joaquin Anchorena and the park was designed by Benito Carrasco and Carols Thays and inaugurated in November 1914. 100 years later, the Rosedal garden continues to be one of the most important in Buenos Aires with its 3.4 hectares that contain ~ 8,000 roses from ~ 90 different species, numerous sculptures, a Greek bridge at the garden entrance, five fountains and an Andalusian garden [added in 1920] and patio [added in 1929]. In 1994, the Argentinean state oil company [YPF] and the government program to promote the green spaces of Buenos Aires, made it possible to renovate the whole park. In 2008, ~ 5000 new rose plants were donated by YPF. In 2012 and 2014, the gardens received the distinguished international “Garden Excellence Award” offered by the world federation of rose societies. I usually walk around the pond “Lago Del Rosedal” anti clock wise to arrive at the main gate [east side] with a Greek bridge [the White Bridge]. I walk over the “White Bridge” crossing the surrounding lake [El Lago del Rosedal] into the garden and take the left path through the lake Pergola which is of a similar design to the bridge [pictures 2], watching the small leisure boats pass by. A large bush of Jasmine flowers fills the air with the smell of Jasmine. As I step down towards the centre of the gardens, I begin to smell the strong and almost intoxicating aroma of the roses. The roses bloom early in the spring [South American spring that is], late September early October when you can see the gardens in all their glory. Even in the early summer, the gardens are still gorgeous [pictures 3,4]. As I continue to walk towards the centre, I see the garden of poets on my left, and I turn to admire the sculptures [busts] of such famous Poets as Jorge Luis Borges [picture 5, note the bird standing on Borges’ head], Dante Alighieri, Federico Garcia Lorca, Antonio Machado and Alfonsina Storni. I continue to walk west towards the Andalusian garden and Patio, a gift to Buenos Aires from Seville, Spain in 1929. The square patio has a fountain in the middle and the grounds, stairs and sides of the patio are decorated with colourful Spanish tiles [picture 6,7]. I spend some time in the shade of the trees surrounding the patio, humming parts of “Manuel de Falla’s” “Concierto de la Aranjues” and almost lose track of time. On the way out I have to walk back to the main entrance on the east side of the gardens; the west exit to the gardens is only open on weekends, so allow time to walk back to the main entrance and around the lake, if you go during week days.I hope you will go and enjoy these beautiful gardens, participating in the celebration of the magnificent effort of so many individuals, private organizations and different government departments who over the past 100 years made it possible for the people of Buenos Aires to enjoy these gardens."
        }, 
        {
            "index": 151, 
            "rating": "5", 
            "review": "just precious. it is amzing how much green they have in argentina and all the water that they have compared to other counties in Latin Amarica."
        }, 
        {
            "index": 152, 
            "rating": "5", 
            "review": "Wonderful!. Green places to spend the day and to walk. It is nice to find these place in the middle of the big city of Buenos Aires."
        }, 
        {
            "index": 153, 
            "rating": "5", 
            "review": "After the museums the nature. After having visiting some museums , we needed to relax a little bit in the beautiful parcs of Palermo, nice and fresh"
        }, 
        {
            "index": 154, 
            "rating": "5", 
            "review": "beautiful gardens. great place to have a picnic, ride bicycle or Rollerblade. huge green gardens in the middle of the city."
        }, 
        {
            "index": 155, 
            "rating": "4", 
            "review": "Nice park to visit. This park is one of the lungs of Buenos Aires and is definetly a place to go to wander a little and escape from the busy Buenos Aires. You can find many interesting places here to look and to make some pictures. Specially if you are going with your couple."
        }, 
        {
            "index": 156, 
            "rating": "4", 
            "review": "A beautiful place for a walk. Don't miss a beautiful walk in this large park. It can be tranquil and nice here and a good way to get away from the noise of BA. Be smart and only walk here during the day and stay well clear of the park after dark."
        }, 
        {
            "index": 157, 
            "rating": "4", 
            "review": "Beautiful. Really nice gardens, lots of pathways to walk through - it is closed on Mondays - but worth a visit and it's free!"
        }, 
        {
            "index": 158, 
            "rating": "5", 
            "review": "Excellent. Most wonderful place in Buenos Aires!!! A place for families and friends. Great place to relax and take a walk!"
        }, 
        {
            "index": 159, 
            "rating": "4", 
            "review": "Small but an oasis from the city. This area is gorgeous and is a much needed oasis on a hot city day. It's small, and you never really get away from the city sounds when you're there, but it's everything you'd want a park in BA to be when you're in need of a little nature and leaves."
        }, 
        {
            "index": 160, 
            "rating": "5", 
            "review": "people watching and tanning. Any sport that doesn'y involve water or engines, you'll find it being practiced here. This is truly where all portenos come to chill and enjoy the sun. Very few parks in the world can compare to the atmosphere you find here. Maravilloso"
        }, 
        {
            "index": 161, 
            "rating": "4", 
            "review": "Beautiful park. The Bosques de Palermo park on Av Del Libertador & Dorrego y Figueroa Alcorta is a wonderful huge green space in teh city. Beautiful gardens, lovely trees and gorgeous water features. A haven of tranquility & beauty in the middle of the city. Highly recommended!"
        }, 
        {
            "index": 162, 
            "rating": "4", 
            "review": "Our own central park. Parque Tres de Febrero would be the name though we all call them \"los bosques de Palermo\". It's big and it's lovely and there are bicycle races and people running marathons and lakes and boats and lots of trees and Thays did a superb job here. Not to be missed."
        }, 
        {
            "index": 163, 
            "rating": "4", 
            "review": "Put on your trainers.... Lovely to walk along the Bosques de Palermo. Depending on where you are, you may begin your walk in Plaza Francia and continue walking all along Del Libertador Ave or Figueroa Alcorta Ave, thru the Rosedal, to the Hipódromo, till Parque 3 de Febrero. You may also rent a bike and use the bikepath..."
        }, 
        {
            "index": 164, 
            "rating": "5", 
            "review": "Wonderful Park in the City. This wonderful park was only a few blocks from where we stayed and so we were able to walk to and enjoy it several times. Just a beautiful place. A great place to relax and watch the families enjoying the park and their family time."
        }, 
        {
            "index": 165, 
            "rating": "5", 
            "review": "Walkabout. Amazing walk through the woods, lakes and rose gardens. I recommend to go in spring to enjoy the beauty of the landscape."
        }, 
        {
            "index": 166, 
            "rating": "4", 
            "review": "Palermo. an oasis in the middle of the city, good for walking, jogging,bikes, or just lay on the clean grass. the smell of \"choripanes\" coming from the street vendors is amazing , you can't resist the temptation of enjoy am argentine sausage sandwich and a coke."
        }, 
        {
            "index": 167, 
            "rating": "4", 
            "review": "A magical park. i lived in BA and I think this is one of the greatest parks worldwide. It's large with gardens, places to picnic, a lagoon where one can rent a boat. Beautiful Trees, lush green. There is something for everyone in this park."
        }, 
        {
            "index": 168, 
            "rating": "5", 
            "review": "Incredible. As a little girl I rode horses here. As an adult I appreciate the zoo, Japanese Gardens and the myriad of other sections."
        }, 
        {
            "index": 169, 
            "rating": "4", 
            "review": "The running track of the Portenos. During my visit to Buenos Aires, I enjoyed very much running around this park and its lakes. And apparently I'm not alone - many Portenos run here, too, and sometimes, there are public running events taking place here."
        }, 
        {
            "index": 170, 
            "rating": "4", 
            "review": "Nice place to go during the spring/summer. This is a nice place to go during the spring and summer. you can seat and be for hours in this beautiful parks and enjoy a nice day.\nThis is an ideal place to have a picnic and to be in a blue-sky afternoon."
        }, 
        {
            "index": 171, 
            "rating": "5", 
            "review": "Worth an afternoon. There is plenty to see in the Bosques de Palermo. To start, the recently renovated Planetarium shows typical planetarium shows, the delight of kids and grown-ups. Look for the meteorite at the entrance. Regretfully, reservations cannot be made online and standing in a line is required. Then the Rosedal is a very quiet and peaceful place, in the middle of the city. An hour's worth stride. Then is the Japanese Garden."
        }, 
        {
            "index": 172, 
            "rating": "4", 
            "review": "Great Place to Visit. Safe, peaceful, great place to relax. Add this attraction to your list of things to enjoy on your trip to Buenos Aires."
        }, 
        {
            "index": 173, 
            "rating": "5", 
            "review": "Feel the air BsAs. If you need to take a break, or the rush of Buenos Aires is consuming you... then Bosques de Palermo is THE spot to spent at least, one hour. You can do a picnic, go for a long walk, run, go with your kids (you have the Planetarium and the Zoo right there). And during the weekends is full of people enjoying a large variety of activities out on the fresh air. I call it our own Central Park in Buenos Aires... :)"
        }, 
        {
            "index": 174, 
            "rating": "5", 
            "review": "Must go place. A must go place! An amazing atmosphere and near to amazing restaurants. There's a lot of people enjoying the place by taking a rest or just doing some sports."
        }, 
        {
            "index": 175, 
            "rating": "5", 
            "review": "The best green area of BA. During the day is a great park to visit, walk around, feat the ducks. During the night be extra carefull. People running, having sport but watch out for your belongs."
        }, 
        {
            "index": 176, 
            "rating": "5", 
            "review": "Lovely park. Didn't go at night so missed the \"adult\" activities but in a city full of parks, this is one of the better ones. Full of families enjoying time off."
        }, 
        {
            "index": 177, 
            "rating": "5", 
            "review": "best place to be during the weekend. i loved my experience here we went running all mornings you can also use your bike it´s great to be there with friends on a sunny day! best place to be during the weekend!"
        }, 
        {
            "index": 178, 
            "rating": "4", 
            "review": "Nice Park!. There can be a lot of people but it's beautiful! Wonderful to go roller skating or to ride your bike!"
        }, 
        {
            "index": 179, 
            "rating": "5", 
            "review": "the most beutifull park in Buenos Aires. Rosedal, Golf, Planetario, all the lakes from Belgrano to Palermo are incredible!! something you can not miss if you visit Buenos Aires, you can walk, you can rent a bycicle, feed the swams,...lovely place to visit !!"
        }, 
        {
            "index": 180, 
            "rating": "5", 
            "review": "Perfect to relax. Union of various parks and squares (El Rosedal, Japanese Garden, Zoo ...), the Bosques de Palermo provide the most enjoyable tours of Buenos Aires. Walking through the woods of Palermo is a great experience. It's quiet, safe and great to come off a bit from the busy city.Walking one afternoon, sitting on the edge of one of the lakes, goofing off and / or taking many pictures in their beautiful locations is something that gives a sense of tranquility and amazing joy. Worth taking the time to wander and enjoy the climate."
        }, 
        {
            "index": 181, 
            "rating": "5", 
            "review": "Interesting. I set myself a round trip to cover on foot, from Congreso to Bosques... well worth it. Bosques de Palermo was a nice tranquil oasis in the busy city. Not too much going on, but definitely nice for a walk/jog/run/chill out"
        }, 
        {
            "index": 182, 
            "rating": "5", 
            "review": "Beautiful. Beautiful big gardens. Great place to go cycling, walking, drinking mate with friends and much more!"
        }, 
        {
            "index": 183, 
            "rating": "4", 
            "review": "Parks and Japanese Gardens. This was a really nice walk. I stayed in Palermo Soho while in BA. We walked from our apartment to this area and it was a really nice walk. The park and the gardens are beautiful."
        }, 
        {
            "index": 184, 
            "rating": "5", 
            "review": "An escape from the city. We were eating so much (and so well!) in Buenos Aires that we wanted to take a run one morning and our hotel concierge recommended we go to the forest of Palermo, just about 10 blocks from the middle of busy Palermo. There were miles of nice running trails, lakes, gardens and lots of great people watching."
        }, 
        {
            "index": 185, 
            "rating": "5", 
            "review": "Great outdoors place. You can't go wrong here. The lakes and the trails provide for a wonderful stroll, and in the middle off the city. Or you can just sit down on one of the many benches and enjoy the fresh air."
        }, 
        {
            "index": 186, 
            "rating": "2", 
            "review": "Just see it from your car. What it once was a great park it is now a poorly cared one. Nvertheless try dirve through Avenida del LIbertador and the views from your car willb astonishing. Do it with daylight but much better by night."
        }, 
        {
            "index": 187, 
            "rating": "2", 
            "review": "Crap. In this place someone opened my sister's car and stole everything that we had inside. Besides if you stay until late you can feel that someone is about to rob you.\nGo, have fun, run, ride the bikes and then get out of there before it gets dark. :)"
        }, 
        {
            "index": 188, 
            "rating": "5", 
            "review": "Best Place to Run. I ran here everyday and was very impressed by how large it was! I was able to make a good 8 mile run out of it and all the way have lots of people doing the same which was very motivating to me. If you don't like running when it is super crowded, I recommend going before 9am on weekdays. Also forewarning - during holidays there is a part of the park that is crawling with prostitutes so I would recommend going during a later time those days.."
        }, 
        {
            "index": 189, 
            "rating": "5", 
            "review": "The most beautiful place in town.. Great parks next to each other, with artificial lakes, trails for running and biking. A public golf course and plenty of fresh air. Beautiful place if you like being outside"
        }, 
        {
            "index": 190, 
            "rating": "5", 
            "review": "Green Areas. Green parks, lakes, ducks, birds, parrots, jogging, rollers, bike, walk... Enjoy the green areas under the sun if you have plenty of time in Buenos Aires!"
        }, 
        {
            "index": 191, 
            "rating": "5", 
            "review": "Buenos Aires Central Park. This large green area, was designed by french landscape architect Charles Thays, as many other parks in the city. It´s quite similar to the Bois de Boulogne in Paris. It has 2 artificial lakes, many local trees with amazing flowers, and it is always crowded during weekends. Worth visiting !!"
        }, 
        {
            "index": 192, 
            "rating": "2", 
            "review": "Overrated. Not much to see here, your time can be better spent elsewhere. Go to Tigre for the day, or over to the Cemetery. If you are in BS AS for a while, check it out... but if you are time constrained, it isnt worth it."
        }, 
        {
            "index": 193, 
            "rating": "4", 
            "review": "Wow. Very nice park, lots of activity. We were doing our own walking tour of Buenos Aires and made this part of agenda. We walked through on a weekend and found this park to be very nice. It's huge and is a beautiful green space.There were so many people out enjoying the park, lots of roller blading (yes, shocking but they love it still), and just seeing everyone enjoying the day. We spent a few hours walking around and just relaxing. Make a point to stop by if you're in Buenos Aires."
        }, 
        {
            "index": 194, 
            "rating": "5", 
            "review": "Breathe and delight yourself!. Lovely place to go for a relax stroll and enjoy the beautiful,parks or train, run while enjoying the beauty of the place!"
        }, 
        {
            "index": 195, 
            "rating": "4", 
            "review": "Great for mate!! a little bit dirty dough. Our argentine friends invited to the park in a sunny day to have mate! the place is perfect, very big green spaces with nice sculptures and flowers, you can really enjoy the calmness of the place to get a little relax from the city chaos. There were a lot couples and people having fan, and also drinking the tradiltional mate so the atmosphere was perfect. The only critic I would do is that it is a little bit dirty, if not I would rate 5 stars."
        }, 
        {
            "index": 196, 
            "rating": "5", 
            "review": "stay in Palermo. What a wonderful area, beautiful cobbled streets and café society. Even an ice cream, shop open at midnight. the place really hums."
        }, 
        {
            "index": 197, 
            "rating": "4", 
            "review": "Great park to hangout in. When I was in BA I was in the middle of writing my 3rd novel and this park is where I used to go everyday and write.It is large, sunny, comfortable and bring up good memories.If you are in the city for only a few days, no need to visit this park but if you have more time - it's a very nice place to simply hangout."
        }, 
        {
            "index": 198, 
            "rating": "5", 
            "review": "people gathering. I was there many times. Portenos gather there to enjoy and make sports or a pic nic...i went on sunday and there was a great free yoga meeting. I was told every morning there are sports teachers giving lessons for free."
        }, 
        {
            "index": 199, 
            "rating": "5", 
            "review": "Beautiful. Centrally located and very nice to take a walk in. Especially on a beautiful sunny day. This isn't something I'd go only one time, I could walk around in this place forever. Very Beautiful"
        }, 
        {
            "index": 200, 
            "rating": "5", 
            "review": "Enormous park to relax. This park offers a peaceful place to wander around with its trees, grass patches and ponds. There is also an art museum free on Wednesdays and Saturdays but pretty cheap on other days, anyway! You can also find the Japanese Gardens, the planetarium and the Rosedal over there.It's so popular that a lot of people jog, run or bike over there."
        }, 
        {
            "index": 201, 
            "rating": "2", 
            "review": "Not well kept. Large patches of grass are missing throughout. It's very dirt in certain areas (many ppl picnic in the park so you would expect the city cleaning more frequently.) The rose garden was closed (right in the middle of high season and summer!). I'm not sure why many suggest to visit. If you have plenty of time and time to kill, sure go for a stroll but otherwise skip."
        }, 
        {
            "index": 202, 
            "rating": "5", 
            "review": "day out. Great for a day out, we went for a pic nic there with the people from our hostel. Nice if you can rent a bike and spend the day there."
        }, 
        {
            "index": 203, 
            "rating": "4", 
            "review": "Very much needed. It is a definite benefit to have this park in the middle of a concrete jungle. Usually full of families on a hot sunny day, this huge park can be a nice escape from the noise and pollution of the rest of the capital. Ideal for walking, relaxing, reading, picnics, children, dog walking etc."
        }, 
        {
            "index": 204, 
            "rating": "5", 
            "review": "The green soul of Buenos Aires. It's hard to believe you are still at the center of such an enormous metropoli as Buenos Aires once you get to Palermo. Sitting by the lake, maybe listening to some music, just resting and enjoying a cone of icecream while you look at all that green around you. A place to be romantic, to make some great pictures over some small enchanted bridge. Maybe even take a book and spend some hours breathing great air."
        }, 
        {
            "index": 205, 
            "rating": "5", 
            "review": "I LOVE RUNNING AROUND THE LAKE HERE. This is the best place in Buenos Aires to run. I came here many times to run around the lake. Morning is quieter. Come at 8 pm and the track is absolutely filled with runners, constant stream, such a nice group atmosphere, like nowhere else. The rest of the park is cool too. Weekends are popping. You can see birds like parakeets here."
        }, 
        {
            "index": 206, 
            "rating": "5", 
            "review": "Quiet and beautiful. This is a place for a nice quiet stroll or even to go running or hiking. It´s a huge park, filled with trees and flowers. You can algo go pic nic here and enjoy the shade of the many trees. I recommend this place."
        }, 
        {
            "index": 207, 
            "rating": "5", 
            "review": "Great place to chill with a book. The bosques is a lovely park to spend an afternoon chilling on the grass with a good book! There are beautiful trees a lake and some winding pathways to enjoy! Good for rollerbladers!"
        }, 
        {
            "index": 208, 
            "rating": "5", 
            "review": "A beautiful place to go. It is indeed a very beautiful and big park, with beautiful trees, lakes and the fantastic Rosedal with statues of great writers from all over the world. \"El Patio Andaluz\" is also a lovely place to see. A must."
        }, 
        {
            "index": 209, 
            "rating": "5", 
            "review": "Beautiful green areas. Very nice area to walk and enjoy the day. We visited the Japanese gardens and walked around the park. It was a beautiful sunny day and most enjoyable."
        }, 
        {
            "index": 210, 
            "rating": "3", 
            "review": "Worth Walking Through-Not at Night. Beautiful to see in summer or spring but do not walk around at night as it may be dangerous. Right off the area is a museum of modern art wirth visiting as well (MALMA)."
        }, 
        {
            "index": 211, 
            "rating": "5", 
            "review": "walking. if you want to walk and try to forget the city noise, it is a way to beath a little.\nsome market at the end of the week, a lot a parrots crying the day..."
        }, 
        {
            "index": 212, 
            "rating": "4", 
            "review": "oasis of green. great if you want to get away from the big city...and it's right there. running, yoga, people watching, inline-skating, boot camp fitness. Everyone is here"
        }, 
        {
            "index": 213, 
            "rating": "4", 
            "review": "Busy on the weekends.. There is great people watching to be done here. Between the roller bladers to the pedal boats, it is a great place to go and have an active day or a picnic."
        }, 
        {
            "index": 214, 
            "rating": "4", 
            "review": "The lungs of Buenos Aires. The best and most popular green space in the city. The 'Rosedal' (Rose Garden), in particular, is very well maintained and has roses almost all through the year, even in Winter! It also has a small boating lake. Recommended time is Spring (November), when the jacarandas are in bloom! or Summer for the bouganvillas."
        }, 
        {
            "index": 215, 
            "rating": "3", 
            "review": "ONCE YOU`VE DONE A LOT OF OTHER THINGS. Also part of the ancient residence of caudillo Juan Manuel de Rosas, this public woods were modeled with the Paris precedents in mind. They are wonderful, but not extremely well cared. I recommend to visit them with the Rosedal, for they are alongside that flower garden. Avoid lonely moments, for safety reasons."
        }, 
        {
            "index": 216, 
            "rating": "5", 
            "review": "Green!. The Bosque de Palermo is the biggest green space in Buenos Aires, so it is my favorite place to be. I go all 4 seasons of the year. Go for a business meeting, to have mate with friends, spend the day with family, take your dog, go for exercise, fun, relaxation, etc! It is split in two parts both with a beautiful lagoon in the middle for paddle boating and enjoying nature. one side has many tourist attractions like the Japanese Botanical Gardens and the Planetarium."
        }, 
        {
            "index": 217, 
            "rating": "5", 
            "review": "Beautiful!. Great place to take a jog or simply escape the hustle and bustle of city life. There are also plenty of museum located close by on Avenida Libertador so you can split your time between the Bosque and some of the museums."
        }, 
        {
            "index": 218, 
            "rating": "4", 
            "review": "Good for jogging.. too much cars. Excellent park for a 10k run, nice track, some lakes, but unfortunately too many roads crossing the park and too many cars. Net net a good place in Buenos Aires for jogger."
        }, 
        {
            "index": 219, 
            "rating": "5", 
            "review": "Good place to relax. I live close to it so whenever I need to step away from the city rush I walk around and stay looking at the landscape and enjoy some fresh air from this big green patch of the city"
        }, 
        {
            "index": 220, 
            "rating": "5", 
            "review": "an escape from the city. Very nice park filled with locals. Good people watching in the early evening. The rose garden looked like it would be beautiful when the flowers were blooming."
        }, 
        {
            "index": 221, 
            "rating": "4", 
            "review": "sweet parks. I love the bosques. Went there as a kid, and still go there now. Girls on rollerblades, panchos, frisbee, mate, and all kinds of extracurriculars."
        }, 
        {
            "index": 222, 
            "rating": "5", 
            "review": "Good for after office. Yeap. I finish my working day and decided (after my tour guide suggestions , Liz) to spend a lovely walking at this park. Is full of people running and doing sports."
        }, 
        {
            "index": 223, 
            "rating": "5", 
            "review": "Definitely visit. Under basques de Palermo are several parks. The nicest ones The Japanese garden and the Rose garden. They both have lakes and beautiful flowers. Like many parks in big cities, hey should be visited during the day. Wear comfortable shoes and walk them. They are also full of sculptures and old trees. Take a pic-nic or buy a \"choripan\" ( a sausage sandwich) from one of the street vendors and enjoy the promenade."
        }, 
        {
            "index": 224, 
            "rating": "5", 
            "review": "rose garden is a must. This is a big park in Palermo. Several lakes, the rose and japanese garden among others. Nice escape from the busy city center."
        }, 
        {
            "index": 225, 
            "rating": "5", 
            "review": "Wonderful place for a run or a stroll!. This is a great place to jog, run or simply stroll. Definitely, to be avoided when it gets dark, though"
        }, 
        {
            "index": 226, 
            "rating": "4", 
            "review": "Great parks with phenomenal trees. Buenos Aires certainly has beautiful trees all over and especially in this part of town, where one park continues into next one creating an evergreen spacial continuum. For tree lovers local specimens in very mature states add to the delight."
        }, 
        {
            "index": 227, 
            "rating": "4", 
            "review": "rest and space. The first morning in BA we walked through the bosques. You don’t have the idea that you’re in one of the biggest city’s of Latin America. A great way to get out of the chaos of the city."
        }, 
        {
            "index": 228, 
            "rating": "5", 
            "review": "amazing break from the city. Just a few miles from downtown this park was a nice break from the craziness of buenos aires. We even ended up meeting a local couple and sharing mate tea with them!"
        }, 
        {
            "index": 229, 
            "rating": "5", 
            "review": "Lovely Parks. Parks are very beautiful, and on weekends are filled with people playing sports, walking, and picnicking. All the plants and flowers are well-kept and green, and it's very clean. The parks are really quite peaceful and the perfect getaway from the hustle and bustle of the big city."
        }, 
        {
            "index": 230, 
            "rating": "5", 
            "review": "a place to stay. Spend a full thay in Palemo's neighborhood is one of the most interesting experiences in Buenos Aires. The local government really care about their parks. All of them during the summer season are clean and flowered"
        }, 
        {
            "index": 231, 
            "rating": "5", 
            "review": "Green Green Green. This is what is so adorable about Palermo, there is this great park, simply constructed with loads of lawns to rest, paths to stroll along, trees and blooming bushes - here you can just enjoy nature - it is well kept, safe during daytime for sure and shady. there are some street vendors offering freshly squeezed orange-juice and empenadas, very good!"
        }, 
        {
            "index": 232, 
            "rating": "5", 
            "review": "Nice and green. The perfect place for a picnic, run, rollerskating, walk or just chilling out.. It's nice and peaceful, so green.. That you don't find so much in Buenos Aires."
        }, 
        {
            "index": 233, 
            "rating": "4", 
            "review": "Consider this the same as Lagos de Palermo. I consider this and the Lagos de Palermo to be the same review as both are about the 3 de Febrero park. Great to have green space and a place to walk away from the crazy drivers. Also fun people watching. They recently put a Starbucks in under the train track and closer to Libertador is a relatively new McDonalds so slowly they are doing away with the seedy area near/under the train track. This park is a great place to spend a lazy afternoon-bring your mate!"
        }, 
        {
            "index": 234, 
            "rating": "5", 
            "review": "Wonderfull. Vey rich parks, with small lakes, birds, dogs running. Very clean. Good for a gym and to see local people."
        }, 
        {
            "index": 235, 
            "rating": "5", 
            "review": "Great escape in the city. The bosques (forests) was a great way to get out of the chaos of the city and relax by the lake or walk around a little."
        }, 
        {
            "index": 236, 
            "rating": "5", 
            "review": "Truly spectacular. I took a bike tour last week. We pass through here and I couldn't stop thinking how much It looks to Paris. I strongly recommend everybody to come and visit this area. This is my first time in Latin America and I'm loving it."
        }, 
        {
            "index": 237, 
            "rating": "5", 
            "review": "Great Neighborhood. A great tree-lined walking neighborhood with plenty of restaurants, shops, parks, and interesting buildings. Lots of people strolling or walking dogs. A little touch of grit, too, which gives it a more lived-in feel than some other areas."
        }, 
        {
            "index": 238, 
            "rating": "5", 
            "review": "A great thing to do during the day. The palermo parks are just bealtiful. You can go to have amazing pictures, do some exercise o just to relax and apreciate the view."
        }, 
        {
            "index": 239, 
            "rating": "4", 
            "review": "A quiet place in a hectic city. If you want to be in touch with nature and hang out without leaving the city there´s no better place in Bs. As. than this one."
        }, 
        {
            "index": 240, 
            "rating": "5", 
            "review": "Beautiful landscapes. Such a pleasant place, great to hang out with friends, family, or even alone to read, contemplate, relax."
        }, 
        {
            "index": 241, 
            "rating": "4", 
            "review": "Lovely area of greenery. It's a great large area of BA where you really can relax and get away from the traffic. The rose garden is one of the highlights for me tucked away to one corner of the park. As the description says; stay away at night, even during the day you can come across a noticeable amount of used condoms lying on the ground. This is only in one particular part though which was quite quiet even during the day where there's a long line of particularly big trees."
        }, 
        {
            "index": 242, 
            "rating": "5", 
            "review": "Very beautiful place, worth the visit.. A must go place in Buenos Aires! Probably the most beautiful pictures of the trip will be taken there..."
        }, 
        {
            "index": 243, 
            "rating": "4", 
            "review": "good walks, but pickpockets!. Beatiful parks but be aware of pickpockets and the typical scam of stained jacket /friendly (?)helpers then clean you out, I mean wallet and all...."
        }, 
        {
            "index": 244, 
            "rating": "4", 
            "review": "Beautiful park, saw Arnold but dont eat the choripan. Beautiful park we walked everywhere, I segwayed had a hoot, you can rent 4 seater bikes, if you visit BA just make sure you spend some quiet time at this beautiful park. I had the choripan at the kiosk, tasted great but did not agree with my usual mikey eats everything stomach, so a suggestion dont eat it, save your appetite for all the great restaurants."
        }, 
        {
            "index": 245, 
            "rating": "5", 
            "review": "Lots of attractions close by. These bosques are a group of parks and gardens which are located all in Pallermo. The rosedal (or rose garden) is stunning to look at, it is a relativetely quick tour and free of charge. The Japanese garden is a paid attraction but is very worth it. Set in japanese style, this garden reminisces japanese places for relaxation and reflection. Make sure you eat there, if you crave for japanese food. Don't wait for another time or you'll have to pay the garden ticket once more. There is also a zoo close by, which features lots of animal attractions for the young ones. But for me the real star is the park itself, which at sundays and hollidays is closed off to traffic and people come from all around the city, to enjoy themselves running, playing sports and rollerskating around the park."
        }, 
        {
            "index": 246, 
            "rating": "4", 
            "review": "Not as nice as \"Palermo Woods\". We decided to check out the Bosques after a recommendation from a local friend. We didn't like it as much as \"Bosques\" as it was 20 times as dirty. We were not aware, but as the sun started going down (around 6-7 in the afternoon) various prostitutes came out and openly solicited cars passing by. Some of them were VERY scantily dressed. We had our kids with us so we quickly took the next cab out of there."
        }, 
        {
            "index": 247, 
            "rating": "3", 
            "review": "imagine no more litter. love the park but portenos need to learn or come to regard littering as something not to do. the pond is gross. the park is polluted. the part the the oil company pays for is clean and has bathrooms. overall, nice place to bike without a helmut as long as you have NO expectations."
        }, 
        {
            "index": 248, 
            "rating": "5", 
            "review": "A spot of green in the concrete jungle. Very nice park for Buenos Aires (don't think it will be like central park). There are a lot of rollerbladers, walkers, runners, people on skateboards, and people sitting the grass chatting and drinking Mate, a traditional argentine drink. There are a lot of good street food stands (although we didn't get sick while in Argentina, you should still be careful with what you eat from the street). Try a choripan (sausage on bread), or a bondiola sandwich. Try and leave the park before nightfall, as it becomes filled with transvestites who we were told can be quite unpredictable and a bit dangerous."
        }, 
        {
            "index": 249, 
            "rating": "3", 
            "review": "It's a park.... This city park, like all city parks, is a welcome bit of green space. Its well planned French garden, lake with a circular track for the bikers, runners, and roller skaters are all very nice. On a busy weekend, it's a nice place to grab a choripan (sausage) or to bring a picnic. When the weather is nice (which it usually is) the porteño families and couples come here in droves, so it's a nice place to people watch as well. I am more into real nature, so I much prefer visiting the Ecological Reserve in Madero, which is bigger, much farther away from traffic, and opens out onto the Rio Plata. If your time is tight, go there first. If you are here for an extended stay, however, definitely make an afternoon of it in Palermo."
        }, 
        {
            "index": 250, 
            "rating": "5", 
            "review": "Green place for residents. Palermo offers a great green place where all locals can enjoy from its green place, including lakes and forest in center of buenos aires. Can practice sport such as skating, biking, running or presence cultural events promoted by the government."
        }, 
        {
            "index": 251, 
            "rating": "5", 
            "review": "This is a must!!. Beautiful and very clean. It's a must when visiting Buenos Aires. Don't visit after 20:00 though"
        }, 
        {
            "index": 252, 
            "rating": "5", 
            "review": "Walk, bycicle, rollers... you'll enjoy this beautiful forest. We go quite frequently, by bike, with rollers, or just to walk. A beautiful lake, tall and nice trees, walking and cycling paths that take you to an unpredictable natural beauty that contrasts with the city view. If you are in Buenos Aires, its a must!"
        }, 
        {
            "index": 253, 
            "rating": "5", 
            "review": "beautiful park in the the middle of BUE. Very good place to exercise yourself, very clean, beautiful people ad easy access."
        }, 
        {
            "index": 254, 
            "rating": "4", 
            "review": "Fragant and colorful!. The gardens in Palermos are an enormous area, full of lakes, sculptures and birds. The sunset here is very beautiful, but the best time to visit is in the morning, when flowers are exhaling fragrances of all kinds, and the smell of the air is already an atraction. The birds here are making a big party, mainly in the very early morning and in the end of the afternoon. The Botanic Garden is a good option in sunny days, very fresh and full of water fountains. And the Rosedal, the garden of roses, is a perfect choice for couples in romantic trips."
        }, 
        {
            "index": 255, 
            "rating": "3", 
            "review": "Green on the city, nice for a walk. A huge green patch on the city. Great for outdoors people, to walk, run or rollerskate. You can also rent a boat (for an important contribution). However, if you want to do this for a more affordable and reasonable price, you can do it while visiting the city of La Plata, on its forest.The Bosques de Palermo are at walking distance from the Jardin Japones, the Zoo, the Botanical Garden and the Rosedal (Roses garden). They are all around Plaza Italia.You can use a whole day to visit them all, but make sure you avoid Plaza Italia"
        }, 
        {
            "index": 256, 
            "rating": "4", 
            "review": "The Big Green. The biggest green spot in town : Lots of joggers use it daily for their morning or evening runs. It's also love to walk along the park or take a boat ride on the lake"
        }, 
        {
            "index": 257, 
            "rating": "5", 
            "review": "The Buenos Aires Central Park. Like NY Central´s Park, Palermo is a very nice place to relax or fitness."
        }, 
        {
            "index": 258, 
            "rating": "4", 
            "review": "Excellent. One of the things we loved about BA was the amount of trees everywhere but also the number of parks in such a big city. This for us was the best park with so much to see and do. Walk around and watch (or join in) the sporting activities. We were fortunate to be staying nearby so could really appreciate the beauty of this place. Visit during the day but do not go there at night."
        }, 
        {
            "index": 259, 
            "rating": "5", 
            "review": "For relax and enjoy nature in a big city. If you want to enjoy the nature in when you are in a big city this is the place, drink mate, do jogging or just see beautiful trees"
        }, 
        {
            "index": 260, 
            "rating": "5", 
            "review": "Fantastic Park for using a Sunny Saturday or Sunday.. Nice Big Park is a mix between Central Park, NYC and Versailles, France. The park was designed for Thays, a very famous Urban designer. Excelent for kids and people that like to do sport ( Rollers, Bicking, Using Botes, Running )The local ZOO is close to Palermo Park. ( I recommend it )"
        }
    ]
}