{
    "category": "Buenos-Aires", 
    "entity": "Palermo", 
    "avg_rating_stars": 4.422680412371134, 
    "review_count": 485, 
    "rating_stats": {
        "poor": 8, 
        "average": 39, 
        "terrible": 1, 
        "very_good": 174, 
        "excellent": 263
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "Wonderful neighborhood. This district is one of the easier neighborhoods to walk around in Buenos Aires. There are a ton of great restaurants, boutique shops and nightlife. We really enjoyed our 3 nights in Palermo."
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "Another beautiful part of the city. Don't miss this upscale section of town with its restaurants and museums. Quick taxi or public transport ride from downtown."
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "Flavorful food and Pleasant Service. The Melanzane is a must and for the Tiramisu lovers: this is your place to go.I visited during lunch time and was presented with a 3-course meal optikn that was very affordable (approx $25 per person). It was two of us: ordered six different plates (two appetizers, two entrees, two desserts) and none of them disappointed. Plus the portion sizes were just right.I recommend this restaurant over other tourist traps in Bs As. Let's not forget the Italian influence in Argentina. This restaurant is worthy of your time regardless of the fact that you're in a city where steak restaurants are the main gastronomical attraction."
        }, 
        {
            "index": 4, 
            "rating": "5", 
            "review": "Great Place to Stay. We were in BsAs for a month and chose an Air BnB on Jorge Newbery (Jorge Newbery 3454 5 pisoBuenos Aires, Ciudad Autónoma de Buenos Aires C1427Argentina \"Be at Home in Buenos Aires\", Host: Florencia)Palermo was a lovely place from which to enjoy all of the City. We highly recommend Bs As and Palermo!"
        }, 
        {
            "index": 5, 
            "rating": "5", 
            "review": "Best place in BsAs. Residencial area with great night life. Take your time to explore the streets in this gorgeous neighborhood."
        }, 
        {
            "index": 6, 
            "rating": "4", 
            "review": "No Poop in Palermo!. Several travel guides and reviews have mentioned that dog owners and walkers in Palermo don't pick up after their dogs, with resulting hazardous and unpleasant walking on the sidewalks. No more! I don't know if they passed an ordinance or what, but people walking dogs are now conscientious about cleaning up. Some parks have bag dispensers. Palermo isn't my favorite place--it can be a little bland ana shopping oriented, but dog poop is no longer a factor. Good going, Palermo!"
        }, 
        {
            "index": 7, 
            "rating": "4", 
            "review": "Cool neighbourhood . Great place to walk around and discover coffee shops and restaurants as well as boutique shops. Pretty buildings, especially nice on a sunny day."
        }, 
        {
            "index": 8, 
            "rating": "5", 
            "review": "Real local experience. If you want to experience real local \"taste\", Palermo is the place. Many cool small shops, cafes, bars, restaurants and nightclubs.This place is even (we could say) safe to walk, just dont show your iPhone too much :)"
        }, 
        {
            "index": 9, 
            "rating": "5", 
            "review": "Bustling and fun neighbourhood. Lots of great bars,restaurants and shops. Very easy to walk around and felt very safe. Most restaurants are mid-range with their prices."
        }, 
        {
            "index": 10, 
            "rating": "5", 
            "review": "Loved it. Great Palermo nieghiboorhood full of trendy people and bars you can also have a great time at the plaza serrano"
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "Interesting area. Interesting district for shops, museums, parks, etc. Be forewarned that tour buses won't do pickups at hotels in Palermo because of the distance from \"downtown\"."
        }, 
        {
            "index": 12, 
            "rating": "4", 
            "review": "Nice area but choose carefully. Nice area, but choose carefully where to stay. Look at Palermo Soho in the map and try to find something around that area, perhaps. I would avoid staying close to Avenida Santa Fe (I feel this area is better in the Recoleta neighborhood than in Palermo). If you go north of avenida santa fe, If you are just visiting the area, I recommend the parks and Palermo Soho."
        }, 
        {
            "index": 13, 
            "rating": "5", 
            "review": "Just a great area. Full of bistros and bars and little cafes with energy to give away - this is the heart of the city - with always something to do and see."
        }, 
        {
            "index": 14, 
            "rating": "4", 
            "review": "Continuation of Soho. Continuation of the Palermo Soho review as this is an adjacent area. I really liked the green space of the bosques, but the traffic is horrible. Try to avoid peak times when drinking or in a cab, try to walk as much as possible- this area is safe. Try the metro (Subte), it is real easy!"
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "Fell in love with BA in Palermo. This is a really cool/\"hip\" part of BA with some awesome shopping, delicious eats and generally great vibes. We stayed in the area for a few nights and definitely want to return one day. There is also a little street art in this area which we love in a city, it really brightens things up."
        }, 
        {
            "index": 16, 
            "rating": "5", 
            "review": "Very fun. This is a fun and colorful area. It's very small, but the bright colors and the Argentinian feels is awesome. Its a must visit is you're in Buenos Aires."
        }, 
        {
            "index": 17, 
            "rating": "4", 
            "review": "Funky neighbourhood. We made the trek to Palermo for a restaurant recommendation. It has streets of cool places that you want to eat at...Nice one Palermo, easy access via the Metro"
        }, 
        {
            "index": 18, 
            "rating": "5", 
            "review": "Fun area!. This area is super cute and fun to walk around in during the day with lots of food and shop options!"
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "Nice Neigborhood. Nice neighborhood with lots of cafés, restaurants and bars. Enjoyed strolling around the neighborhood and discover places. It is definitely one of the safer neighborhoods of Buenos Aires. Highly recommend staying in this area."
        }, 
        {
            "index": 20, 
            "rating": "5", 
            "review": "Nice, Safe, and very convenient part of BA. We stayed in an apartment in Palermo for 2-weeks and had a wonderful time. Parks, buses, subways, restaurants, bakeries, everything is close, available and nice."
        }, 
        {
            "index": 21, 
            "rating": "3", 
            "review": "Cultural visit. Interesting eats with some kind of bazaar over the weekends. If you have time hang around with local kids playing football (soccer) at hard courts. Look out for street peddlers selling freshly baked buns and some fried fritters, pretty good"
        }, 
        {
            "index": 22, 
            "rating": "5", 
            "review": "Great area for kids and, well, everything. My family stayed in this area and it was fantastic. There were parks nearby for my 5 year old son. There were numerous restaurants that were inexpensive but very tasty. And if you like to shop - this is your area. Everything you need to have a great vacation. The people were also very helpful and kind. I was alone with my son for the majority of the trip because my husband got the flu and everyone was kind to me and my son. I never felt scared or threatened. Also, the metro is close so you can get to just about any area in the city for pennies (which we did and my son loved it)."
        }, 
        {
            "index": 23, 
            "rating": "5", 
            "review": "Palermo felt safe and convenient, even at night! . We rented an apartment in Palermo, on Sinclair St, for two weeks. We always felt very safe and walked at night to and from dinner and to and from church , also at night. The area is on the green D line for the metro and bus line takes you all the way into town. We took many taxi's and only one cost us more than the equivalent of $5 US . They are very reasonable. Porteños, as they call themselves are very very kind and helpful. They do not walk around smiling at you on the street but when asking for directions, in my bad Spanish, a woman walked us nearly to our door only leaving us when we told her we recognized where we were. Then she kissed our cheeks (common there) and walked BACK toward where she come from! This is only one of several such incidents of help received. People went out of their way making sure we found the right bus stop or street. Palermo was a perfect choice as a location for our vacation. Safe, well located, not super expensive, lots of close restaurants. You'll love it!"
        }, 
        {
            "index": 24, 
            "rating": "5", 
            "review": "Great neighborhood...... .....to walk around. Go to the ALTO PALERMO shopping. Walk around LIBERTADOR..., go to the horse track. There many things to observed by just walking around...., and there are restaurants for all tastes and pockets!"
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "Palermo pales others. The Palermo neighbourhood is an absolutely brilliant place to stay. It feels like the 'real' Buenos Aires in that you really are living with the locals. So much to do and see - in every street. The street art is outstanding as are the restaurants. I recommend it very highly"
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "Stellar Area. Personal favorite part of town. I'm a twenty-something who enjoys both the daytime crowd of Palermo and the nightlife. It's got everything to offer: beautiful art, lots of cafés, romantic bars, and overall cool vibes. The neighborhood reminds me of an eclectic mix of Berlin and Savannah, GA. Random, but it's colorful, lively, and pretty safe."
        }, 
        {
            "index": 27, 
            "rating": "5", 
            "review": "Beautiful street market. (May 2015) I enjoyed the nightlife in this area. Well lit, easy to walk around, and later on find a taxi home. I was so impressed with the marketplace in Palermo - I absolutely intend to return to this area."
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "All the restaurants and bars you will need. Palermo is the largest suburb in BA. It has a vast number of restaurants (Spanish, Italian and Argentinian mainly). Bars range from very small rustic places to modern very 'cool', so depending on what your mood is you have many choices. It also has the largest green space in BA, stunning parks and forest area. Fabulous area to stay."
        }, 
        {
            "index": 29, 
            "rating": "5", 
            "review": "Beautiful charming and diverse along Palermo Hollywood , palermo Soho, and Palermo viejo. You can find in Palermo one of the safest places to stay, you will find especially in Palermo Hollywood one policeman on each corner. beautiful restaurants , a lot of independent designer of clothes and all range of products. a must see and a place to fall in love and to miss,"
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Must See!. Palmero is such a unique barrio of Buenos Aires, much higher end than San Telmo or the Business district, but worth a visit. Lots of cute shops and quaint cafes!"
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "Nicest area of town. A nice and lively area, with a lot of shops and restaurants.\nEnjoyed a stay in a small \"wine hotel\", with only a few rooms and a wine tasting in the courtyard."
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "Beautiful part of the city. I loved Palermo. Great shopping, great restaurants and a lot to do.\nA lot of nice green space as does most of Buenos Aires has to offer. I would highly recommend adding this on the list of things to see or visit when in Buenos Aires."
        }, 
        {
            "index": 33, 
            "rating": "4", 
            "review": "Fancy place. After hours of meetings, we decided to walk around by the surroundings and it was lovely. There are lots of cool restaurants and bars."
        }, 
        {
            "index": 34, 
            "rating": "5", 
            "review": "party neighborhood. If you wanna get to know the best pubs, bars and parties in Buenos Aires, you must go to Palermo area."
        }, 
        {
            "index": 35, 
            "rating": "5", 
            "review": "Awesome Sauce. Lots of great places to eat and grab a drink while you are taking in the sights. Lots of great art and just a nice cool vibe for the area."
        }, 
        {
            "index": 36, 
            "rating": "5", 
            "review": "great area to walk. We stayed at a nice little hotel in Palermo Soho and loved how walkable the area was. Filled with cafes, restaurants, shops and parks."
        }, 
        {
            "index": 37, 
            "rating": "5", 
            "review": "Wonderful to wander around, discover cafes and hidden corners. Every street corner has a different cafe, individual shop or piece of great street art. You can while away an hour, an afternoon or a day discovering all the secret hidden corners, bakeries, bars, cafes or seeing the huge variety of street art on pretty much every street."
        }, 
        {
            "index": 38, 
            "rating": "2", 
            "review": "Tasteless tourism. A rather tacky and tasteless tourist trap. Might have had some resonance once but now not worth the time"
        }, 
        {
            "index": 39, 
            "rating": "4", 
            "review": "Fun area to visit. This is a funky, younger area of the city. Lots of restaurants and bars and good areas to just walk around and see a part of the city that is outside the main downtown area."
        }, 
        {
            "index": 40, 
            "rating": "5", 
            "review": "Great place to just walk around leisurely. If you have no set destination and just want to experience the city Palermo is an excellent area where you will find street markets, restaurants, bars, etc Go forth and explore."
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "The best suburb to stay. I have stayed at San Telmo, Recoleta and other suburbs in Buenos Aires but Palermo was the best place I have stayed. Here some of the lists why I liked the place:- It's SAFE - At night, there are policemen walking around as well as police cars patrolling around the suburb. - People - it is where middle-class ppl live and people are generally warm and friendly to you - Foods and places - there are many restaurants you can try and I can guarantee that most of them will give you pleasurable experience in both taste and vibe. The buildings are very fancy indeed - very Argentine (not Paris)- Location: It may be a bit far from touristy places but if you plan to stay for a long time, definitely the choice to make."
        }, 
        {
            "index": 42, 
            "rating": "5", 
            "review": "Stay in Palermo. Really nice and quite place to stay, just a short drive away from the attractions. Affordable and stylish hotels. Lots of dining/shopping option but nothing much for sightseeing."
        }, 
        {
            "index": 43, 
            "rating": "5", 
            "review": "A Smash Up of Old and New. Fascinating area to walk around in. Old, crumbling buildings next to restored versions of the same next super-modern houses and apartment blocks. Lots of interesting shops and great restaurants."
        }, 
        {
            "index": 44, 
            "rating": "3", 
            "review": "A good visit. Visited this place with my travel buddy. It's pretty average. There are plenty of shops with overpriced items. Cafes around this area are good. With visiting if you have some time in Buenos Aires. Avoid visiting on Sunday and Monday."
        }, 
        {
            "index": 45, 
            "rating": "4", 
            "review": "Tourist Visit stop. Great little shops and fun place to visit on our tour. I bought a few souvenirs and took lots of pictures."
        }, 
        {
            "index": 46, 
            "rating": "4", 
            "review": "Nice area to visit or stay in BA. This area is full of nice trendy shops, restaurants, bars, cafés, etc. Don't miss the ice cream from Freddo, e.g., dulce de leche flavour or milk shake. Delicious! Night time is full of young people who come to Plaza Serrano. Very good steak restaurants and calle Armenia is the best for me."
        }, 
        {
            "index": 47, 
            "rating": "4", 
            "review": "Second time in Palermo. I stayed here for the second time this week. I understand various negative comments regarding tourism and not being as clean or interesting as other more historic areas but it feels really safe and there are always quite a few people about. The are lots of restaurants and shops, just make sure you get a map because I always get lost."
        }, 
        {
            "index": 48, 
            "rating": "2", 
            "review": "A grubby bit of (what has sadly become a grubby city). Its a pity that after so many years of Santa Christina's rule the city is falling to bits but at any stage its a mystery to me why they take tourists to this fake piece of the city's \"history\".It's inauthentic dirty and a waste of your valuable time."
        }, 
        {
            "index": 49, 
            "rating": "5", 
            "review": "Trendy Neighbourhood. Palermo is the artsy neighbourhood in Buenos Aires where our accommodations were located. We loved walking through this area of the city. Many of the streets are cobblestoned and lined with trees. The buildings are low and house many restaurants, cafes, bars, fashionable stores, and design shops. The area hustles during the day with children heading to school, shoppers on the go, and everyday activities. In the evening, the area maintains a chic vibe with restaurant clientele spilling onto the sidewalks and streets."
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "Interesting area in Buenos Aires. Very interesting to walk the Palermo district of Buenos Aires and see who people live in the area. It's known for it's restaurants, a definite plus."
        }, 
        {
            "index": 51, 
            "rating": "4", 
            "review": "I liked barrio de Palermo. I liked barrio de Palermo in Buenos Aires. I went to all great nightclubs and bars. It was a fun and enjoyable experience."
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "Good place to stay. This area is composed by smaller neighborhoods close to huge green areas excellent to visit, walk and exercise. It felt very safe and with many choices for cafes and good restaurants."
        }, 
        {
            "index": 53, 
            "rating": "3", 
            "review": "It is not possible to make a review.-. Palermo is a very big district with so much different areas.- There are areas with big palaces and luxury houses, and others with mid-class predominance.- It's impossible to make a description of the whole district.-"
        }, 
        {
            "index": 54, 
            "rating": "4", 
            "review": "Old and New mixed together. Walking around the Palermo neighborhoods is a challenge, since the architecture varies from late 19th century to modern no-personality structures. Small kioscos are tucked in amongst the houses and apartment towers, with garages blaring warnings and people going somewhere quickly. Sidewalk cafes beckon one to sit and have a coffee, and the nightclubs lure the youngsters at night. An eclectic blend of the old and the new Argentina, not sure what the outcome will be, but take a moment and walk through it....I did!"
        }, 
        {
            "index": 55, 
            "rating": "4", 
            "review": "Fabulous safe area. I really enjoyed staying in this area. There are heaps of restaurants and lots of parks and plenty of shopping. As mentioned previously this is no place to wear stilettos."
        }, 
        {
            "index": 56, 
            "rating": "5", 
            "review": "Fancy Palermo. Gorgeous suburbs. Fancy shops, clothing, restaurants, cafes, bars. Went to Palermo Soho and Palermo Hollywood many nights for dinner. Very safe. Delicious variety"
        }, 
        {
            "index": 57, 
            "rating": "4", 
            "review": "Great area to stay in. Lovely area- felt very safe there. I am glad i did not pick Recoleta. Palermo has many decent priced restaurants- in fact too much choice. One thing ladies- watch for the uneven paving!"
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "Nicest neighborhood . Really really great neighborhood, very safe and romantic feeling. Feel free to walk around anytime of the day and you'll likely run into many things to do. Don't be shy about approaching people and sparking a conversation, people here are amazing and friendly"
        }, 
        {
            "index": 59, 
            "rating": "4", 
            "review": "Fun, green neighborhood. Everyone says you've got to stay in Recoleta, but we found the hotels a bit pricey and chose Palermo, described as the SoHo of Buenos Aires. I felt safe and green, with lots of street trees and parks (the most of any district in BA). The area was convenient for shops and restaurants, just a few blocks form the beautiful Botanical Garden and close to the subway to Recoleta. And our boutique hotel was a gem. Look for that in a separate review."
        }, 
        {
            "index": 60, 
            "rating": "4", 
            "review": "Big neighborhood w many flavor a and shops. Some parts have hip shops and restaurants, esp soho and he part near Recoleta. Very walkableSome parts have hip shops and restaurants, esp soho and he part near Recoleta. Very walkableProbably my favorite part of BA"
        }, 
        {
            "index": 61, 
            "rating": "4", 
            "review": "Tango dancing on the street corners ..... Tourist attraction.....had a coffee and was tango danced around us ... The usual tourist gift shops ."
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "Middle class heaven. Great restaurants, bars, shops and hotels. Cool, trendy with prices to match. Safe to walk around and close enough to walk to the centre of you don't mind walking."
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "What's Not To Love?. One of the coolest barrios in the city if you like eating and shopping. Great hotels. Awesome plazas. Do not missed this hood if you are visiting BA. Safer than most too and lots of English spoken here."
        }, 
        {
            "index": 64, 
            "rating": "4", 
            "review": "Great place to stay. What a great place to stay in BA. Close to cafes, restaurants and shops. The area feels safe and its great to wander the streets looking at shops, just make sure you watch underfoot for uneven paving and dog doo."
        }, 
        {
            "index": 65, 
            "rating": "5", 
            "review": "Beautiful Palermo. Palermo is a great neighborhood, during the summer a lot o people run, walk and skate and ride their bikes at the Bosques de Palermo (Palermo Woods), In order for you to use public trasportation in Buenos Aires you just can't have cash and get a bus for example, you need a subte card which is a prepaid card, you can purchase at any subway machine and put credit, so with that you can use the metro (subway which they call subte), and buses."
        }, 
        {
            "index": 66, 
            "rating": "5", 
            "review": "Beautiful area. Walking in this neighborhood is so beautiful with many embassies, tree lined streets, and a bookstore in an old theater, with greta ice cream nearby."
        }, 
        {
            "index": 67, 
            "rating": "4", 
            "review": "Touristy but important to see. Filled with tourists and people wanting to take your picture but it is a wonderful area with all the different and brightly colored homes. It is near the harbor and you can take a walk on the riverfront after to get away from the crowds."
        }, 
        {
            "index": 68, 
            "rating": "5", 
            "review": "Pleasant. This is an easy place to walk as a tourist. Pleasant and friendly. Shop keepers and restaurant staff are helpful. Its interestingand a pleasure to enjoy an afternoon or two."
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "Full of history and culture.... Palermo is the largest neighbourhood of Buenos Aires, situated to the northeastern end of the city. There are upmarket streets, zoological garden, botanical and Japanese gardens, excellent shopping and much more."
        }, 
        {
            "index": 70, 
            "rating": "4", 
            "review": "Shopping, bars and Restaurants. We stayed in the soho and Hollywood districts of Palermo. If I was to choose I would say Hollywood just edges it as there were more bars and restaurants and quirky shops. Soho has I suppose more clothes shopping. It's really edgy around Palermo I would say the Argentinan version of Shoreditch. Would definitely stay around this area again"
        }, 
        {
            "index": 71, 
            "rating": "5", 
            "review": "Something for everybody. Palermo district is not to be missed. I would like to highlight two areas called palermo soho and palermo hollywood. Soho is very vibrant, full of trendy bars and restaurants and quirky shops (quite expensive though). Hollywood has an excellent selection of gastro pubs and restaurants and is quieter. Both are leafy and lovely with an ample selection of private rental apartments. A must while visiting Buenos Aires!"
        }, 
        {
            "index": 72, 
            "rating": "4", 
            "review": "Love the neighborhood .. We rented a apt here for a week and loved the atmosphere , parks , neighborhood and food. People friendly and helpful."
        }, 
        {
            "index": 73, 
            "rating": "5", 
            "review": "Really nice funky town. Thought this was a nice funky little town, with really nice restaurants, burger bars, drinking bars and very sociable place. I really recommend coming to Palermo while your visiting Buenos Aries, Its quite suitable for everyone."
        }, 
        {
            "index": 74, 
            "rating": "5", 
            "review": "Upmarket uptown Buenos Aires. This is the neighbourhood you aspire to, where all the successful and famous live in beautiful apartments and mansion style homes. Nicely treed avenues so you walk arounhd even on the hottest day. Great coffee shops and bars"
        }, 
        {
            "index": 75, 
            "rating": "5", 
            "review": "Nice, cool little neighborhood. I stayed a week in a Palermo Airbnb and it was really nice. Easy and safe to walk around too many quaint little shops, cafés and restaurants. It was easy to get taxis to go anywhere in Buenos Aires. Very convenient base."
        }, 
        {
            "index": 76, 
            "rating": "4", 
            "review": "Colourful and busy area of Buenos Aires. A very colourful nod busy part of Buenos Aires. Went to this area with our guide on a local city tour. Went back to appreciate the feel me life of little Italy in Buenos Aires......Mist visit."
        }, 
        {
            "index": 77, 
            "rating": "4", 
            "review": "Mix of Old and New. Palermo is home to several neighborhoods that seem to blend into one another - Veijo, Soho, Chico, Hollywood, Alto, etc. While each has its own distinct flavor, they all are home to great restaurants, charming cafes, bakeries, leafy parks, old-world (late 19th century) architecture, newly constructed luxury condos, cobblestone streets, bars, museums/galleries and tons of shopping. Its youthful vibe also attracts a large number of ex-pats hence an international gastronomy scene. My advice is to spend as much time possible exploring each of Palermo's neighborhoods on foot - but watch where you step as apparently no one picks up after their dog!"
        }, 
        {
            "index": 78, 
            "rating": "4", 
            "review": "Colourful Place. Colourful place with many shops and restaurants in all different colours. Lots of places to see and eat out at. Much going on, an up market neighbourhood of Buenos Aires."
        }, 
        {
            "index": 79, 
            "rating": "4", 
            "review": "Colorful Neighbood, lots of places to eat. Probably one of the most popular places for locals. The buildings are colorful and well kept. Fun to see and walk through from the hop on hop off bus."
        }, 
        {
            "index": 80, 
            "rating": "4", 
            "review": "Worth a visit. During a city tour of Buenos Aries,Lots of tourists busy looking around this area ,lots of photo opportunities ."
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "Great place to drive around and see the sites. This is a colourful place to drive around and stop at the shops. The colour of the buildings is great and the cameras will run hot. A must place to see."
        }, 
        {
            "index": 82, 
            "rating": "3", 
            "review": "A safe place. We used to live in Palermo. It's a good, safe and clean part of the city. If you wants colors and life, go to Palermo Soho instead"
        }, 
        {
            "index": 83, 
            "rating": "3", 
            "review": "Good place to stay, but BA not for everyone. We only stayed in Buenos Aires a couple of nights, having many other places to visit in Argentina, but 2 nights was enough. It's baking hot in January, so not pleasant to get around. We should have booked a guided tour, by air-conditioned car, as that would have been easier and more pleasant way to see the sights. As it was, we visited the Opera House (great), a cafe (fun), the Eva Peron Museum (mixed), and a tango show (great). I had seen the cemetery on a previous trip but that's a must. However, that's enough of Buenos Aires for me. But then I'm not 25, not into night clubs nor shopping, don't like the heat, and struggled with the state of the pavements. Ditto the other half who was even more unhappy."
        }, 
        {
            "index": 84, 
            "rating": "4", 
            "review": "interesting. Visited this area during a city tour. Did not have but 20 minutes or so here but there is shopping etc. Seemed like a very touristy area."
        }, 
        {
            "index": 85, 
            "rating": "5", 
            "review": "Bohemian Bario Palermo. Palermo is divided into five different regions each with a very distinctive look and feel. It is one of the more residential communities of the city and has a mix of historic and new architecture. It is renowned for a variety of restaurants and boutique shops. Here you can enjoy a relaxed atmosphere and a multi-cultural feeling of residents and tourists."
        }, 
        {
            "index": 86, 
            "rating": "5", 
            "review": "Great. Nice place to walk in the evening and have a good dinner. Restaurants are a bit pricey but the food was worth it."
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "Delicious food and chic. This neighborhood is a place to goIt's a lot to do and funNice bars, restaurants and ambienceI certainly recommend this place as a must"
        }, 
        {
            "index": 88, 
            "rating": "5", 
            "review": "A must in Buenos Aires. This is an old/new neighborhood in Buenos Aires, where you can find old buildings, fancy restaurants, classic ones and all type of food you can imagine (sushi, argentine, asado, Italian); also a lot of bars that are incredible, discos. You can also do shopping from decoration shops to shoes and all kind of clothes. Do not miss this magical place"
        }, 
        {
            "index": 89, 
            "rating": "3", 
            "review": "Artsy neighbourhood. Lots of arts, crafts and design shop around, one of local (and snobby) people´s favorite places in Buenos Aires, to me it lacks of character, it´s great to visit only if you're looking for art and design. But if you want to breathe Buenos Aires people and history go to San Telmo!"
        }, 
        {
            "index": 90, 
            "rating": "4", 
            "review": "Katz whiskers. Artisan shops and very good too. Isaac Katz at Pasaje Santa Rose, bought two lovely silver rings with extraordinary stones embodied in them,all made by Isaac. Got through to him in Yiddish ! And very good prices"
        }, 
        {
            "index": 91, 
            "rating": "3", 
            "review": "Central to the northern city. A good place to see the middle class slowly taking over an area, lots of old places and more and more new buildings. Wander around and take in the vibe of Palermo and its people's. Lots of bars and restaurants to enjoy, the locals are very helpful. Try the restaurant Carniceria it's amazing."
        }, 
        {
            "index": 92, 
            "rating": "3", 
            "review": "Where they want the tourists to go. Visit to suburbia why come to South America. Suggest you go to La Boca or San Temo cafe with vibe and historynot another mall"
        }, 
        {
            "index": 93, 
            "rating": "5", 
            "review": "A must when in Buenos Aires . We visited this are twice - once by foot and once as part of a city bike tour. Brilliant atmosphere with lots to look at - really interesting history with a fantastic setting."
        }, 
        {
            "index": 94, 
            "rating": "4", 
            "review": "Great area for Pub hopping, dinner, drinks. Hard to find a bad place here for any type of food and Bev - easy to wander around, great coffee near by"
        }, 
        {
            "index": 95, 
            "rating": "4", 
            "review": "Looking for parks. I am most interested in some green area like parks and squares. So you can find such places in Palermo district what is very good. Also there are a lot of restaurants, shops, etc. Well-off tourists mostly."
        }, 
        {
            "index": 96, 
            "rating": "4", 
            "review": "Great spot for dinners, shopping and clubs. Still rough around the edges, it has potential to be amazing. Best place to stroll around and check out the numerous cafes and some of the best restaurants in the city"
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "Lively!. I spent two days in Buenos Aires and out of all the neighborhood, this was my favorite!! Architecturally it is interesting and also lively. I am so glad that my guide took me there!"
        }, 
        {
            "index": 98, 
            "rating": "5", 
            "review": "The best area to stay. Away from the hustle and bustle and yet walking distance to the zoo, botanical gardens and many great restaurants makes this area our number one pick to stay in and if would like a quality boutique hotel, stay in FIERRO HOTEL, it was fabulous."
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "Trendy and Busy. In Palermo you'll always find something to do. Plenty of shops and restaurants are around this area. It's a nice place to walk of an evening and stumble into a bar or grab a bite to eat."
        }, 
        {
            "index": 100, 
            "rating": "4", 
            "review": "Two sides of Palermo. The two photos show the contrast of the more upmarket Palermo end and the more 'earthy' Palermo Hollywood end. We stayed in Recoleta which was closer to the centre of Buenos Aires but did some walking in Palermo.\nBoth areas quite safe in the daytime and evening before about 11pm."
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "Fun and safe. I lived in this area when I was in BsAs and i just love it. I went to BsAs at 31 dec and at 1 jan all shops were closed but luckily they all opened again at 2 Jan so i could feel how beautiful and interesting this area is. It's a safe area and a lot of restaurants and bars are in here. It has lots of trendy shops and during the weekend there are some street markets around the park area. If you like the nightlife you should go to this area as there are a lot bars here. If not you can still visit this area cos the small shops are interesting."
        }, 
        {
            "index": 102, 
            "rating": "4", 
            "review": "Very pretty. A great barrio with in Argentina. We walked through here on a detour out to Recoleta. I have no idea the Italian influence in the immigration Waze that occurred in Argentina. In many ways, I find when BA to be similar to New York City in that there are several sectors that are culturally very different from the rest of the city. This is certainly one of them."
        }, 
        {
            "index": 103, 
            "rating": "5", 
            "review": "Very nice district. Nice apartments and restaurants. Full of places where u can eat or buy stuff. Relaxed atmosphere. Really enjoyable to stay there for almost a week, I felt a \"porteno\" and not a a tourist. The park is also really beautiful, I really enjoyed to go there for some running."
        }, 
        {
            "index": 104, 
            "rating": "4", 
            "review": "Extensive Area with parks and gardens. We seemed to drive through Palermo for ages on the tourist bus. It is a big area with many stately homes and extensive parks and gardens."
        }, 
        {
            "index": 105, 
            "rating": "4", 
            "review": "Wonderful street scapes. I stayed in Palermo as I had heard it was a rather funky part of Buenos Aires, a mix of urban decay and trendy stores and cafes. I got a lot of great street photos, many building have been painted by good graffiti artists so the frontages make great photos, particularly around Gurruchaga and Soler and two blocks either side. There is a certain amount of street theatre (actually everyday life) in Palermo. On the avenida Santa Fe centre strip are a lot of book stalls."
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "Great shopping and dining area. We were pleasantly surprised with the range of boutiques in Palermo. I would advise anyone to start at plaza Serrano and en walk in a large square around the area. We discovered some wonderful shops. Most shops were mid to high end prices. The restaurants and bars are numerous. Also, many shops open at 14.00 hours. Go for lunch and shop after."
        }, 
        {
            "index": 107, 
            "rating": "3", 
            "review": "Nice restaurants and busy street scene, but a little \"touristy\". Palermo has some interesting spots, botanical garden, zoological garden etc. However, the heart of Palermo Viejo was very vibrant, but too much geared towards superficial tourism and I found it a little tacky."
        }, 
        {
            "index": 108, 
            "rating": "5", 
            "review": "Trendy place to Party. We went to the Palermo neighborhood to party and have a good time. The Discos and bars are all there as well as some really great restaurants. Lots of shops and the Market where you can street shop was there . Like going to Six street Austin Texas."
        }, 
        {
            "index": 109, 
            "rating": "4", 
            "review": "good food. the staff were excellent, and good advise gave us a good meal, good english too.Very easy to find in the main street."
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "Trendy fun neighborhoood. We were lucky to stay in this neighborhood. It is full of life. There are a great many terrific places to eat from cafes to fine dining. Lots of boutique shops. A great area to walk around or to just people-watch from an outdoor table."
        }, 
        {
            "index": 111, 
            "rating": "4", 
            "review": "Beautiful neighbourhood. I grew up here, it's a lovely place for tourists and locals alike. I love it because it's my home, and it has changed a lot since i was a child.\nAny tourist should walk through here - no car or transport, just walk!!!"
        }, 
        {
            "index": 112, 
            "rating": "5", 
            "review": "Location. This place screams tourist/native/locals/market.\nSunday market, local foods, inexpensive mall and great location to everywhere else."
        }, 
        {
            "index": 113, 
            "rating": "3", 
            "review": "3.5 stars really- I wasn't wowed. Perhaps we didn't see the best side of Palermo, but I wasn't sold. Whereas Recoleta is clearly old and wealthy, and San Telmo full of hipsters, Puerto Madero the yuppies....Palermo was....what? It felt a bit like the cheap end of an overrun Greek island with long suffering waiters, kids coming in to the restaurant to beg for change, and neon lit bars around the square. We went late in the evening, but many of the surrounding streets were dark and unwelcoming, lined with shops with their shutters down - the action seemed to be mainly around the square. I'm willing to bet there are nicer places that we just missed, but I won't be rushing back when there are so many other more interesting places which feel so much more authentic."
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "Like a city by itself. The Palermo section of Buenos Aires is like a city all by itself. It has as much diversity as most major cities in the world. You won't find more restaurants of all prices - - very reasonable places to eat and very expensive places to eat. And, some of the most beautiful scenery and green space in Buenos Aires he is here in Palermo. But be ready to walk in Palermo. The metro line runs on the outskirts so if you're headed toward the lakes you're in for at least a 25 minute walk. But it's a beautiful walk so take it if you can."
        }, 
        {
            "index": 115, 
            "rating": "5", 
            "review": "Best place at night. I went to there after 4 pm and there are many cafes,restaurants and. Shops there so local drinks are cheaper then import drinks and food is great so it's safe town so if you go out after 10 pm getting more busy but daytime it's ok so you can by busy or tax but if you take a bus to Palermo it's very cheap so great place to go eat there"
        }, 
        {
            "index": 116, 
            "rating": "5", 
            "review": "Cute. Palermo was by far the favorite place I went in Buenos Ayres. It has lots of restaurants and coffee places. It also has lots of stores along the cobblestone streets. It is nice to go there in warm days or nights that is not raining. Try to avoid to walk alone in quiet streets during the night. I was told by one of our waitress that there are robbers in the area. Beside that it is a great place to visit. I recommend it."
        }, 
        {
            "index": 117, 
            "rating": "5", 
            "review": "Another lovely area to visit. It's a great place to go for a walk. Lots of shops, restaurants and cafes. We wanted to sit in a lovely restaurant, however our Argentinian peso was out and we couldn't pay by dollar or card so we had to miss it out."
        }, 
        {
            "index": 118, 
            "rating": "5", 
            "review": "In my opinion the best district in Buenos Aires. I love Palermo spirit with its green leave trees decorating almost all streets. This district has many sections, there many restaurants in Palermo Soho and Palermo Hollywood that you can visit at night and then you can walk in pedestrian streets. It is safe to walk in at any hour."
        }, 
        {
            "index": 119, 
            "rating": "2", 
            "review": "Bars and Restaurants, That's About It.. Like the Recoleta section of Buenos Aires which I also reviewed Palermo is considered to be one of the nicer areas of the city. Our boutique hotel was located Palermo and it was very nice. There are also a few good restaurants. Other than that Palermo is packed with lots and lots of small restaurants and bars. Not much variety to offer tourism wise and my wife and I felt somewhat unsafe even in the daytime. We took taxis when we went out after dark. Overall I cannot recommend Palermo or anywhere in Buenos Aires to tourists. If you would like more detail as to why see my review on Recoleta and the opinions I expressed there."
        }, 
        {
            "index": 120, 
            "rating": "4", 
            "review": "Interesting With Some Class. This is one of the more interesting parts of Buenos Aries and has some interesting restaurants and better than Soho across the train tracks.Worth a walk around."
        }, 
        {
            "index": 121, 
            "rating": "5", 
            "review": "Best Shopping District in BA. There are various parts of Palermo, take your time, get a good map, or better yet, download the off line map of Buenos Aires from TripAdvisor, and be on your way. Great shopping for clothes, and leather items, coats, boots, shoes, belts, purses, etc. Dont miss Palermo SOHO. Take your time and enjoy, there is a lot to see and do and many fine restaurants, and some good wine tastings as well."
        }, 
        {
            "index": 122, 
            "rating": "3", 
            "review": "Nice Area. Palermo is a very nice place with lots of good quality restaurants. It is a bit more expensive than most places in BA so that's why I give it a low mark. It is where most international people hang out and it is the big party area. However you can get better experiences elsewhere like in San Telmo or Almagro."
        }, 
        {
            "index": 123, 
            "rating": "5", 
            "review": "Eat your way through Buenos Aires here.. We stayed in an Arbnb in the heart of Palermo for the first couple of days, and really enjoyed the tranquility of the area, the cobblestone streets, and the large amount of fabulous restaurants that we could walk to."
        }, 
        {
            "index": 124, 
            "rating": "5", 
            "review": "I'm going back. Went to Buenos Aires on business and friends told me to stay in the Palermo area. It reminded me of the old SoHo neighborhood in NYC. Great walking, artisans, restaurants, stores and good looking people. All the ingredients are here for an interesting visit. If you love steak, this is your nirvana. One should be reasonably fluent in Spanish as there is less English spoken than I expected."
        }, 
        {
            "index": 125, 
            "rating": "4", 
            "review": "Interesting place to explore. Part of the fun of Buenos Aires is exploring its varied neighborhoods. From leafy parks to interesting shopping and plenty of restaurants, it is a definite must see part of town. Parts of it are a bit gritty and are gentrifying but it is neat to hang out with locals who are exploring Palermo with you"
        }, 
        {
            "index": 126, 
            "rating": "5", 
            "review": "Best Place in BSAS. Charming place, cool restaurants, coffe shops and book stores !Quite expensive nowadays, but it's the best area in the city for my.3 times in BsAs with my wife, this time with my kids, and everybody loved!"
        }, 
        {
            "index": 127, 
            "rating": "4", 
            "review": "Great place. to walk around in and people watch .. quaint and exotic --- take the subway there for the whole experience!"
        }, 
        {
            "index": 128, 
            "rating": "5", 
            "review": "great neighborhood. we stayed in this neighborhood. lots of interesting bars, coffee shops and shops. easy to walk around and an outdoor market on the weekend."
        }, 
        {
            "index": 129, 
            "rating": "5", 
            "review": "one of our favorite places to go and eat at in Buenos Aires. Palermo was our jam for our time in Buenos Aires. The ambiance and atmosphere, the restuarants, the pace of life, it was all awesome. we recommend doing a food tour with Allie Lazar of pickupthefork.com she took us all over the place, mostly in this area and we got a taste of Buenos Aires with a local flair. Must Do while in Buenos Aires"
        }, 
        {
            "index": 130, 
            "rating": "5", 
            "review": "Our favourite neighbourhood in BA. We love Palermo - individual and unusual shops, a wealth of great cafes, restaurants and bars, and interesting street art. Also art galleries over in Palermo Hollywood, and a really good weekend craft and art market in Plaza Serrano and Plaza Vieja. Safe and fun to wander, with something interesting round every corner. Great place to base yourself in BA - stay here and it's easy to visit the rest. And the OUTLET shopping precinct is worth a look if you like shopping!"
        }, 
        {
            "index": 131, 
            "rating": "4", 
            "review": "Only in good weather. Palermo is an interesting neighborhood with a variety of shops, cafes and restaurants. It is cute and very pleasant for a walk when the weather is fine. Good news is: weather in Buenos Aires is mostly fine. But if it's raining or too hot, better look for other places. The \"olas\" (= \"waves\", of high temperature) can happen in January or February and newspapers and TV warn people not to go out between 10:00 A.M. and 3:00 P.M. during them!"
        }, 
        {
            "index": 132, 
            "rating": "5", 
            "review": "Best night out in town. Palermo is a very trendy neighbourhood in Buenos Aires and it is full of cool bars, cafes and restaurants. It reminded me of Shoreditch, Argentinean style. A must when visiting the Argentinean capital,"
        }, 
        {
            "index": 133, 
            "rating": "5", 
            "review": "Smart and Vibey. A quaint little town. Its a little distance from Buenos Aires. It has a lot of restuarants with outside seating. The biggest mosque in Buenos is situated in Palermo."
        }, 
        {
            "index": 134, 
            "rating": "4", 
            "review": "Very chic and upscale. Beautiful buildings, clean, be careful crossing the huge boulevards. Stores here are very expensive. To be honest, I felt underdressed in my jeans and sneakers. But the area is beautiful, very natural. For astronomy buffs, the planetarium is located here. You can knock that out, along with MALBA, and visit the huge, beautiful metal flower in the UN plaza."
        }, 
        {
            "index": 135, 
            "rating": "4", 
            "review": "Most \"sparkling\" borough of Buenos Aires. If you just can't live in a too quite area and need any kind of stores, malls and transport means right in front of your home, this is the area of Buenos Aires where you wanna live or stay during your holiday. Here you hardly need to walk more than 50 yards to find anything you need. Endless series of shops, bars, restaurants and oputlets line up along the main avenue of Santa Fe as well as along all the side alleys."
        }, 
        {
            "index": 136, 
            "rating": "5", 
            "review": "Best neighborhood . If you have the chance to be in Buenos Aires, try to stay in Palermo. Either Palermo Hollywood or Palermo soho with the bunch of bars and restaurant on Honduras street, you'll find everything in this neighborhood, all the most famous brands are there and also the tango schools are nearby."
        }, 
        {
            "index": 137, 
            "rating": "5", 
            "review": "Palermo is Perfect for Extended Stays. I lived in Palermo for the 5 weeks I was in Buenos Aires. I lived near Guatemala and Gurruchaga in a studio apartment. Very nice apartment, big city style. Buenos Aires is a big city, much like New York in that the buildings are narrow but tall and packed in right next to each other. Many have store fronts or kiosks at the street level and flats above. Palermo is very cosmopolitan and trendy with lots of great boutique stores and restaurants. Palermo is safe to walk the sidewalks at any hour and there's usually some little store open all the time. Palermo is easily navigated by walking. Everything you need for an extended stay is walking distance. It really helps to speak Spanish in Buenos Aires, but in Palermo, you will find plenty of people able and willing to speak English. I highly recommend the Palermo area for short or long-term stays in Buenos Aires."
        }, 
        {
            "index": 138, 
            "rating": "5", 
            "review": "A favorite. My favorite Sunday afternoons were shopping at the flea markets in Palermo Soho and having lunch at an outdoor cafe. I never tired of the shops, there was always something new to look at and people watching at its best !"
        }, 
        {
            "index": 139, 
            "rating": "2", 
            "review": "Nothing special . Walked around open areas which were covered in dog faeces. Botanical gardens were closed on the Monday. Shops nothing special and not that many that were a reasonable price "
        }, 
        {
            "index": 140, 
            "rating": "4", 
            "review": "Great food.. This is a nice little city. Great food, love the steaks especially! Would definetely return for the food."
        }, 
        {
            "index": 141, 
            "rating": "4", 
            "review": "Total Cultural Immersion. This was a great place to walk around and really immerse yourself in the local culture. Great shopping!"
        }, 
        {
            "index": 142, 
            "rating": "5", 
            "review": "A great shopping day out. Great shopping in this upscale neighbourhood. We enjoyed soho however Hollywood on the other side of the train tracks has restaurants only, no shops. Great for a couple of hours exploring."
        }, 
        {
            "index": 143, 
            "rating": "4", 
            "review": "Beautiful area. Did a walking tour thru the neighborhood. Very interesting. I truly enjoyed it and learning about the area."
        }, 
        {
            "index": 144, 
            "rating": "5", 
            "review": "Defintely worth a visit. Wonderful food, walking, shopping and people watching in a modern yet still traditional neighborhood that keeps getting more modern"
        }, 
        {
            "index": 145, 
            "rating": "5", 
            "review": "Trendy bars and good vibes. If I could live anywhere in Buenos Aires, this would be it. This is a mix of the Village in New York and Williamsburg in Brooklyn, with a splash of Argentinean culture. If any of these neighborhoods in New York are to your liking, you'll definitely enjoy Palermo."
        }, 
        {
            "index": 146, 
            "rating": "5", 
            "review": "A nice place to visit in Buenos Aires. This is a wonderful place in Buenos Aires, full of shops, cafes, restaurants, etc. A very nice place for walking and seeing beautiful clothes, shoes and so on"
        }, 
        {
            "index": 147, 
            "rating": "4", 
            "review": "Another must do.... Went through by bus, car and walked... nice shops interesting buildings could have spent more time there..."
        }, 
        {
            "index": 148, 
            "rating": "4", 
            "review": "Fun neighbourhood!. I stayed in Palermo during my recent visit to Buenos Aires and was able to spend a lot of time exploring the area. It has everything - shops, restaurants, cafes, museums, public transportation, bookstores, chocolate, etc. Palermo Viejo is especially interesting. Palermo is a very vibrant area where a lot of Buenos Aires residents have chosen to live. Some of the best restaurants in BA are here."
        }, 
        {
            "index": 149, 
            "rating": "4", 
            "review": "Bohemian chic. Palermo Soho has a unique character of its own. The streets have great small shops ans restaurants in each block, people are really attentive, very chic and bohemian atmosphere"
        }, 
        {
            "index": 150, 
            "rating": "5", 
            "review": "You'll want to move here, seriously. This place is worth visiting MORE than once, its a massive area. So many lovely shops and restaurants plus cafes and deseert places every few blocks. Really you want to walk it. The architecture is stunning, so many old buildings in pristine condition, the entire place has a very European feel. Lots of graffiti/street art but most of it really excellent. Bring your camera!! you'll regret not doing it.Can't wait to go back early next year!"
        }, 
        {
            "index": 151, 
            "rating": "5", 
            "review": "Palermo has a little bit of everything. This neighborhood is near where I grew up and my grandparents lived when I was a little kid. It's such an amazing neighborhood full of Argentinian Culture, Great Shopping, Amazing Food and much more. Buses go through here all day long with many routes so make sure you plan a visit."
        }, 
        {
            "index": 152, 
            "rating": "5", 
            "review": "Really nice suburb. Great place to stroll around a saturday, having a brunch and good coffee, go for nice shopping and meeting friends...."
        }, 
        {
            "index": 153, 
            "rating": "4", 
            "review": "Love to live here!. Great neighborhood! You can find everything you need. The food is wonderful and once you try everything in Palermo Soho and Palermo Hollywood you can head down to the next neighborhood over, Villa Crespo, for more wonderful options. Needless to say, this is Argentina people! Things are not as polished and new as in other countries... But its definitely part of its charm."
        }, 
        {
            "index": 154, 
            "rating": "5", 
            "review": "Great neighbourhood. Very charming place, with a lot of nice restaurants, coffee places and stores. A great place to spend a sunny afternoon walking, and visiting some street markets"
        }, 
        {
            "index": 155, 
            "rating": "5", 
            "review": "Bustling, Beautiful, Diverse Palermo. Palermo is an intriguing combination of old-world charm and modern trendiness. I especially enjoyed the window shopping and the beautiful parks, including the Jardin Botanico."
        }, 
        {
            "index": 156, 
            "rating": "5", 
            "review": "a must visit. beautiful and enchanting, a must visit, you will easily fall in love with the people and spirit around the neighborhood"
        }, 
        {
            "index": 157, 
            "rating": "3", 
            "review": "See it before its all gone.. A well regarded neighbourhood close to the botanical garden and with plenty of food choices, now regrettably losing its character as the inevitable build-out of high-rise apartments destroys the character."
        }, 
        {
            "index": 158, 
            "rating": "5", 
            "review": "Laid back and a nice place to live.. We lived in Palermo and found it a wonderful place to live. There's plenty to see and do. There's lots of nice restaurants and bars."
        }, 
        {
            "index": 159, 
            "rating": "5", 
            "review": "Worth a visit. One of my favorite neighborhoods in Buenos Aires. Lots of bars and restaurants. In this part of town it is easy to see why they call Buenos Aires the Paris of Latin America"
        }, 
        {
            "index": 160, 
            "rating": "4", 
            "review": "Lots to do, great shops supporting local artists. Great neighborhood full of lots of shops that feature local artists. Great cafes, restaurants, and bars too. Very pedestrian-friendly with lots to do!"
        }, 
        {
            "index": 161, 
            "rating": "5", 
            "review": "Best zone in BsAs. I love the Palermo zones. Great hotels, restaurants and bars...and its safe! The Europe of BsAs...highly recommended is the Full City Coffee Shop...."
        }, 
        {
            "index": 162, 
            "rating": "2", 
            "review": "Nothing special. I don't know if I have missed the part, but nothing special is there: just normal buildings as anywhere else in the city."
        }, 
        {
            "index": 163, 
            "rating": "5", 
            "review": "Buenos Aires' bohemia. Don't miss the city's neighborhood that's full of bohemia. A place filled with cafes and restaurants. On Sundays experience the market places and search for beautiful handcraft pieces. Grab a bite at night in a small restaurant that will certainly exceed your expectations."
        }, 
        {
            "index": 164, 
            "rating": "4", 
            "review": "This is the place to be in Buenos Aires. This is what Buenos Aires is about, relaxing atmosphere, beautiful place to wander around, may bars, restaurantes and cafes, museums, highly recommended!"
        }, 
        {
            "index": 165, 
            "rating": "5", 
            "review": "Walking through Palermo, getting to know Buenos Aires. Palermo is a brilliant day out when visiting Buenos Aires! Take a local with you if you can: it makes all the difference. Some hotels do arrange tours in English. Just a very interesting part of this vibrant city. We love Buenos Aires!"
        }, 
        {
            "index": 166, 
            "rating": "5", 
            "review": "CUTE neighborhood. What a great area to visit and just wander around. All the colorful buildings and shops and people out on the streets. This is a must see."
        }, 
        {
            "index": 167, 
            "rating": "4", 
            "review": "Great for funky bars, restaurants and shopping. My favourite area of BA for a great meal or a few drinks. Most of the places worth visiting are in and around Avenidas Costa Rica, Guatemala, Fitzroy, Gurruchaga and everywhere in between."
        }, 
        {
            "index": 168, 
            "rating": "5", 
            "review": "Great for walking, browsing, eating and shopping. Palermo is one of Buenos Aires' bet known fancy neighbourhoods. Located in the northern part of the city (north of Recoleta but south of Belgrano) and named (perhaps but opinions vary) after the area's' Italian immigrants, its known for its fine restaurants, cafes, bars, shops, theatres, hotels, embassies and apartments and this attracts huge crowds, especially at night and on weekends. Its worth it just to stroll around (go early in the day to avoid crowds but you will miss the sparkle and street life as a result), or head out to Palermo at night and see the fancier and best heeled part of Buenos Aires at play. Note that in recent decades Palermo has become divided up into specialist areas like Palermo-Hollywood (named for the presence of television and movie facilities and the people they attract) and Palermo-Soho. The parklands of Palermo are also definitely worth visiting as are the Botanic Gardens and Zoo."
        }, 
        {
            "index": 169, 
            "rating": "3", 
            "review": "Not very lively during the day, but otherwise nice neighborhood. This neighborhood was highly recommended to us for the shops and the night life. Unfortunately we are travelers who prefer going out during the day, so Palermo was a little disappointing in that regard. There were not many people out on the streets during the day. Still, there are some very nice shops and I would recommend spending half a day there even if you are not quite the night-life type of person."
        }, 
        {
            "index": 170, 
            "rating": "5", 
            "review": "Loved Living Here. Loved this neighborhood. Just really cool and comfortable to walk around. All types of stuff do: shopping, eating, drinking, etc. Had a blast living here for a couple weeks."
        }, 
        {
            "index": 171, 
            "rating": "4", 
            "review": "Such a lovely neighborhood. This is a great place to walk around and explore. Great shopping and green spaces. The market is interesting but I didn't find anything to purchase."
        }, 
        {
            "index": 172, 
            "rating": "5", 
            "review": "Must visit area in BA. You should go here twice - once during a normal day/night and once during the weekend market. It gets packed, and thus you will not be able to see anything else. There is loads of musicians during the weekend and also a tango performance on the square in the middle. So many shops, cool places for lunch and drinks. Think it was the best place to wander around in BA by far!"
        }, 
        {
            "index": 173, 
            "rating": "5", 
            "review": "Great area to stay. Stayed in Palermo. One of my favourite parts of Buenos Aires. Has everything you need from Hotels, shopping, restaurants and a good night life."
        }, 
        {
            "index": 174, 
            "rating": "5", 
            "review": "Walk, watch and embibe.. Good for eating and shopping- not so much for touristic venues. The streets are full of a mix of people. Fun place to have a drink and people watch- a lot of locals."
        }, 
        {
            "index": 175, 
            "rating": "4", 
            "review": "Buenos Aires Soho. A known neighbourhood in Buenos Aires which has a little market during the weekend. It gets packed with people and sometimes in certain areas is even difficult to walk. You have many bars and places where you can have tea. During the week there are many shops open and less peolpe on the street. If you want to buy something or if you are just walking around Palermo is a good place to visit."
        }, 
        {
            "index": 176, 
            "rating": "5", 
            "review": "Palermo district for shops restos etc.. Huge number of Resaturants, bars, small quirky shops. Follow THames and streets around it and you will find many interesting shops etc Serrano Square has lively bars."
        }, 
        {
            "index": 177, 
            "rating": "5", 
            "review": "Great Neighbourhood with Trendy Restaurants. A wonderfully colorful hip neighborhood which we stayed in, with restaurants and parks surrounding us at every turn. It was also very easy to travel on the subway from here to just about anywhere in Buenos Aires. We really loved this neighbourhood and would like to spend more time here on our next visit."
        }, 
        {
            "index": 178, 
            "rating": "4", 
            "review": "Great night life, good restaurants. Fun younger area of BA where twenty-somethings go to hang out as well as party. Great little bars and clubs throughout. You must spend at least one night here."
        }, 
        {
            "index": 179, 
            "rating": "5", 
            "review": "Perfect for a Day out Shopping. LOVED this place! So many gorgeous little boutiques and alleyways. You will totally get lost wondering around the shops. Lots of yummy places to eat also for lunch and dinner."
        }, 
        {
            "index": 180, 
            "rating": "5", 
            "review": "amazing!. one of the most amazing places in buenos aires and in all of argentina ! i recomend to go there and spend the day there"
        }, 
        {
            "index": 181, 
            "rating": "3", 
            "review": "sketchy area. more bars on windows and graffiti than anything else. There is a small roundabout with a playground & restaurants at it's center that makes a trip to this area worth it."
        }, 
        {
            "index": 182, 
            "rating": "4", 
            "review": "Funky area. I enjoyed Palermo much more than Recoleta. The restaurants were better and prices were generally better as well or at least better value for money. Many places with character, some with an offbeat feel. I liked the neighbourhood in general and chose to stay here rather than in a more central part of BA. It's not that far to walk to the more popular and busier parts provided you enjoy walking as it's not as if it's around the corner, so to speak. Nice coffee shops and smaller shops apart from designer shops, and a few nice bars in the area as well. Finding affordable accommodation is very difficult though."
        }, 
        {
            "index": 183, 
            "rating": "3", 
            "review": "The hipster part of BA. Palermo is nice. But some places a bit to hip to my liking. Still, some amazing bars and cafés, etc, can be found around Palermo, if you have the patience to go around finding them. For the best drinks in town I would recommend The Hookah Bar."
        }, 
        {
            "index": 184, 
            "rating": "5", 
            "review": "Best neighborhood of Buenos Aires. Shopping, restaurants, safe, comfortable, and clean- what's not to like about staying in Palermo?! You are not in the city center but it's an easy metro ride away. We found Palermo Viejo to be a great home base for a week of traveling around the city"
        }, 
        {
            "index": 185, 
            "rating": "5", 
            "review": "Great escape. Buenos Aires is one of the greenest cities in South America and is full of parks, hidden green squares and plenty of places to explore, enjoy BA !."
        }, 
        {
            "index": 186, 
            "rating": "5", 
            "review": "COLORFUL PALERMO. Palermo is known for the colorful houses of the neighborhood and a haven of many artists. They sell their own artwork and luckily i got the chance to buy some pieces in miniature and support them.There are a lot of souvenir shops and you'll love it."
        }, 
        {
            "index": 187, 
            "rating": "4", 
            "review": "quaint area visited as part of a city tour of BA. Visited as part of a city tour. fun during the day and worth a visit. Guide gave an interesting account as to the history of the area."
        }, 
        {
            "index": 188, 
            "rating": "4", 
            "review": "Cultural heart of the city. A great place where art and culture seem to flourish without end. it feels like culture is in the air and swings through the many little shops and antiquity stores. My personal highlight was the monument to comic book character Mafalda."
        }, 
        {
            "index": 189, 
            "rating": "5", 
            "review": "One of the most beautiful neighborhood in Buenos Aires City. One of the most beautiful neighborhood in Buenos Aires City.Palermo is surrounded by gorgeous green areas. The traditional old houses and petit hotels of \"Palermo Viejo\" were refurbished during the last 10 years, and they had been transformed into small restaurants, bars, design stores and boutique hotels.It is a safe neighborhood that it can be enjoyed during the day but also at night."
        }, 
        {
            "index": 190, 
            "rating": "4", 
            "review": "Nice to spend one evening!. This is one of the richest places in BA. You will find beautiful and very tall residential complex along with embassies for various countries. Good but bit expensive eat out options in this area."
        }, 
        {
            "index": 191, 
            "rating": "5", 
            "review": "Beautiful neighbourhood. Love the neighbourhood. Full of coffee houses and restaurants. It was quite secure at night, lots of live and people around"
        }, 
        {
            "index": 192, 
            "rating": "5", 
            "review": "In Palermo, perfect for exploring Buenos Aires. Where the Portenos live and eat, Palermo is a perfect spot from which to explore Buenos Aires. The subte (metro) has stops at Palermo and MInisterio de Carranza, so it is convenient for getting around."
        }, 
        {
            "index": 193, 
            "rating": "4", 
            "review": "Really good area to walk around.. Lots going on in this part of town and several exceptional restaurants and bars. Be a bit careful at night though."
        }, 
        {
            "index": 194, 
            "rating": "4", 
            "review": "Neighborhood feel. Was just there with friends shopping for furniture so my experience was limited to that and a dog almost peeing on us from a second story balcony as we walked under it. But it looked like a nice place to live."
        }, 
        {
            "index": 195, 
            "rating": "5", 
            "review": "Great Neighbourhood. Whatever you like doing, this is an area not to be missed. Full of restaurants, bars and great boutiques, Palermo has such a great vibe - I could sit here all afternoon people watching."
        }, 
        {
            "index": 196, 
            "rating": "4", 
            "review": "Beautiful part of the city. This area has lots of nice restaurants - grills, pasta, et al, many interesting restaurants ranging from casual to very fancy (Unik was amazing).\nThe shopping is also excellent in this area - Bolivia, while a bit on the expensive side had some excellent bargains on shoes."
        }, 
        {
            "index": 197, 
            "rating": "4", 
            "review": "Loads of bars and restaurants. We stayed in the aparthotel in Palermo and it was perfect. Loads of things going on all the time and loads of places to eat and drink. I felt really safe walking around at night even though some of the streets and buildings would suggest otherwise."
        }, 
        {
            "index": 198, 
            "rating": "4", 
            "review": "beautiful area. went for a walk around the streets. although it was raining all day it was still well worth the visit. will be back"
        }, 
        {
            "index": 199, 
            "rating": "5", 
            "review": "cool shops and restaurants. if u want to see different restaurants or bars as well as shops from clothes to shoes to souvenirs, this is where u can go... i bought shoes here by perro blanco - localy made shoe brand in AR. which is cheap and awesome. :)"
        }, 
        {
            "index": 200, 
            "rating": "4", 
            "review": "Upscale neighborhood. Had an extra day due to transportation strike so walked around Palermo. Nice shops, treelined streets, good restaurants and several great ice cream shops. So many flavors, so little time!\nThey let you put two different flavors in a cup. Anything with Dulce de Leche is amazing."
        }, 
        {
            "index": 201, 
            "rating": "5", 
            "review": "Quaint and charming. If you like staying in quaint, charming neighbourhoods, Palermo would be your choice if you visit Buenos Aires. Filled with beautiful tree-lined streets, this is a quiet area, With plenty of shopping and dining options."
        }, 
        {
            "index": 202, 
            "rating": "5", 
            "review": "The best neighborhood!. In my opinion the best and most beautiful part of the city! a bit far from the sights, so I wouldn't stay here just because of that, you need to take a cab to go to them, but this is not a big deal as cabs are quite cheap. The streets are amazing, the restaurants, beautiful people and shops and of course, the place are more expensive. Nice to spend half day walking around and have lunch somewhere."
        }, 
        {
            "index": 203, 
            "rating": "5", 
            "review": "The coolest neighborhood in BA. If you are below 40 you will probably want to stay in or visit Palermo. Very cool and large neighborhood, it has a european vibe to it and the people here are mostly the younger crowd of BA. Palermo has 2 main areas Hollywood and Soho. Hollywood in my opinion is nicer, perhaps not ascetically but it has more restaurants and more of a hipster and local vibe. Palermo Soho is more beautified and definitely better for shopping in general (clothes etc) Both areas are great and nearby, there is a few streets and a train track dividing them."
        }, 
        {
            "index": 204, 
            "rating": "5", 
            "review": "Place to be in Buenos Aires. We have enjoyed staying in an hotel in the center of palermo Hollywood,bars, restaurants, flee market, shopping nearby"
        }, 
        {
            "index": 205, 
            "rating": "5", 
            "review": "Palermo soho. Palermo Soho is great to shop (outlets are close) and to wander around! I like the bars and restaurants with the good food with the lively and beautiful argentinean people. There is a lot of great architecture combining modernity in old building, which is very creative.Las cañitas night life is also very fashionable and very porteña. Palermo viejo is the more traditional part."
        }, 
        {
            "index": 206, 
            "rating": "3", 
            "review": "eating. lots of trendy hip restaurants, but you are paying more for the bling bling than an awesome steak. but still lots of nice restaurants and cheaper than puerto madera."
        }, 
        {
            "index": 207, 
            "rating": "5", 
            "review": "Beautiful, as usual. One of the most stilish yet laid back neighbourhoods in Capital. It has ist own vibe, either to visit during the day or go out for Drinks, dinner or a night out, either week day or weekends."
        }, 
        {
            "index": 208, 
            "rating": "5", 
            "review": "Go-to place. Very nice restaurants, bars and lots of people. This is like the hub for buenos aires and has a lot of cute coffee shops and dessert places too."
        }, 
        {
            "index": 209, 
            "rating": "5", 
            "review": "Foodie's food. Olsen's for brunch! AMAZING Food!! The outdoor seating was a nice & quite space. Food was so fresh and the pastrami was nothing like we thought it would be and absolutely the BEST!!!"
        }, 
        {
            "index": 210, 
            "rating": "5", 
            "review": "Palermo is amazing!!!!. I Love Palermo especially Palermo Soho which is the hot area. great cafes, coffee shops (havanna, bonafide, starbucks etc) and restaurants. amazing shops really fun colorful and relaxing, safe area and fun to walk around."
        }, 
        {
            "index": 211, 
            "rating": "5", 
            "review": "Best place to hang out. Palermo Hollywood is the place to go for restaurants. It's young and vibey. Its a must place to visit. ."
        }, 
        {
            "index": 212, 
            "rating": "5", 
            "review": "Buenos Aires nicest area. This is the largest neighborhood in Buenos Aires, with over 2580k people. Its name of the district is derived from the still-existing Franciscan abbey of \"Saint Benedict of Palermo\".Palermo is subdivided into several contrasting areas: Palermo Chico, Palermo Norte, Palermo Nuevo, Las Canitas, Palermo Viejo, Palermo Soho and Palermo Hollywood.That part of Buenos Aires is in complete renovation. There are many areas with trendy bars and shops. There are also nice parks such as the botanic garden and the Japanese garden.You can walk around this area for half a day."
        }, 
        {
            "index": 213, 
            "rating": "4", 
            "review": "Friendly neighborhood. Basically a residential area, this provided a different vibe altogether. A sense of safety and friendliness. One of the best thing is that Palermo has a lot of offer whether it be the numerous restaurants and cafes or museums or zoo or even local art displays it had something for every taste and more over the place has a good distant to many of the popular places in Buenos so it is a good neighbourhood to stroll around and explore."
        }, 
        {
            "index": 214, 
            "rating": "4", 
            "review": "Nice neighbourhood to explore, eat, and shop in. Nice places to eat, interesting stores, and one of the safer neighbourhoods regarding pick pockets etc."
        }, 
        {
            "index": 215, 
            "rating": "4", 
            "review": "A beautiful part of town that is very green and lush. Unlike many of the historic neighborhoods in Buenos Aires, Palermo is full of open, green spaces. It's the site of the Japanese gardens, botanical gardens and zoo. When you get tired of touring the concrete of downtown, grab a \"to go\" lunch and head to Palermo. It will allow you time to picnic amongst the locals."
        }, 
        {
            "index": 216, 
            "rating": "4", 
            "review": "A nice neighbourhood for a Saturday stroll. This is the most upmarket area of Buenos Aires and a striking contrast with areas like la boca. The extensive park hosts the artisan's fair on certain days. Timings change. A very close walk from many metro stations."
        }, 
        {
            "index": 217, 
            "rating": "5", 
            "review": "A trendy neighborhood. Palermo is an up and coming neighborhood in Buenos Aires featuring many small shops, artist studios, book stores, and restaurants. It is quiet and although not exclusive, gives the vibe that one is in the right place."
        }, 
        {
            "index": 218, 
            "rating": "5", 
            "review": "Great neighborhood with something to please for everyone. This is a lovely, romantic and atmospheric neighborhood. There are so many excellent restaurants, and a wide range of shopping options. I loved strolling around it."
        }, 
        {
            "index": 219, 
            "rating": "5", 
            "review": "Lovely area!. Palermo is green, fresh and lovely! I enjoyed seeing the beautiful residential areas and was impressed with the combination of parks and living space. Definitely enjoyed this part of Buenos Aries!"
        }, 
        {
            "index": 220, 
            "rating": "5", 
            "review": "Palermo... Beautiful Palermo. Walking around Palermo is a treat! Cute boutiques, great street vendors, amazing restaurants, super cool cafés and bars to sit have a drink and just watch people go by.You'll never be bored in Palermo"
        }, 
        {
            "index": 221, 
            "rating": "3", 
            "review": "I don't get it . Palermo's allure is lost on me. Not pretty and dingy. There is no architecture. The Plaza Serrano market is one of the worst I've ever seen and the shopping in general is not at all interesting for a foreigner. It's been compared to Soho in New York which is a total misnomer. I've stayed in Palermo twice now and think next time I'll go old school in the Recoleta. Generally speaking, Buenos Aires was a big let down. It's not the \"Paris of South America\" at all and I couldn't recommend that people spend much time here - just a stopover to get to somewhere else in Argentina."
        }, 
        {
            "index": 222, 
            "rating": "5", 
            "review": "nice bars. I stayed in a hostel there. There are a bunch of real nice bars and the neighborhood seemed to be quite safe, even a late hours."
        }, 
        {
            "index": 223, 
            "rating": "4", 
            "review": "Palermo has it all. Second time staying in Palermo, we love it! It has shops, restaurants, zoo, gardens. A great place to walk, or take the local buses anywhere in the city for about 50cents with a sube card."
        }, 
        {
            "index": 224, 
            "rating": "4", 
            "review": "Nice Neighborhood. Tending to the more upscale Recoleta. Has nice streets to stroll and lots of shops. Very safe. When in BA one should spend some time here."
        }, 
        {
            "index": 225, 
            "rating": "5", 
            "review": "Amazing suburb. I wouldn't stay anywhere else. I agonized about where to stay in Buenos Aires. I was travelling with my hubby, 2 yr old, 9 yr old, brother and his son aged 10. So lots of kids. I worried about our safety in the streets, close proximity to attractions and places to eat. This place is amazing. If you know Sydney, the best comparison, is that is feels like you are staying in Newtown. Palermo has a very alter vibe. It's mostly residential, so feels very safe to walk the streets both day and nice. We were within close distance to restaurants, bars, the zoo, the tour buses, the train station, everything we needed. Absolutely loved Palermo."
        }, 
        {
            "index": 226, 
            "rating": "5", 
            "review": "lovely neighbourhood. a little upscale. We had about 2 hours to walk the streets of this area of town. We did some shopping and had coffee. lots of places to stop and brows. especially on a sunny day."
        }, 
        {
            "index": 227, 
            "rating": "5", 
            "review": "an upscale district. Palermo and Recoleta are districts like Paris! the architecture, the parks, the elegant hotels and restaurants. everything is very beautiful!!!!"
        }, 
        {
            "index": 228, 
            "rating": "5", 
            "review": "Great restaurants, trendy shops and nightlife. If you love all of the above this is the place to stay. Had some great food at a restaurant called Campobravo (known for it's steaks)."
        }, 
        {
            "index": 229, 
            "rating": "5", 
            "review": "The best neighbourhood in BsAs. By far the most active and safe neighbourhood in BsAs. The nightlife, restaurants and activity make this a very energetic area to live in. Will definitely stay in Palermo if I go back again."
        }, 
        {
            "index": 230, 
            "rating": "5", 
            "review": "best district in buenos Aires. We have decided to reserve an hotel boutique in Palermo Hollywood with restaurants and bars but in Palermo Soho you can shop"
        }, 
        {
            "index": 231, 
            "rating": "4", 
            "review": "Nice area. We walked around this area and it's a beautiful place to visit and walk about. We felt safe all the time.\nTake a stroll about."
        }, 
        {
            "index": 232, 
            "rating": "5", 
            "review": "I couldn't get enough of the parks. We spent so much time in the parks enjoying the sun and the vibe. Luckily we were only a few minute walk."
        }, 
        {
            "index": 233, 
            "rating": "5", 
            "review": "Favorite part of the city. This was my favorite part of town, felt safe and pretty shops and parks and good mall.I spent 1-2 day here, just to enjoy food and shops. I appreciated to go to the Mall to get some air con and got cooled down, while I walked around and did this cool area.Next time I visit BA, I would stay in Palermo."
        }, 
        {
            "index": 234, 
            "rating": "3", 
            "review": "expensive and italian. Dutch bar may be interesting. Jet set goes out here for food and this is reflected in the prices. Within easy reach of city centre by train and metro/subte"
        }, 
        {
            "index": 235, 
            "rating": "3", 
            "review": "general. Best to know exactly what you want to do here. We thought we could wander and we would see and do lots but even when we knew the 'best' steet, rarely found what we wanted. Nightlife seemed good when we drove through there at night."
        }, 
        {
            "index": 236, 
            "rating": "5", 
            "review": "Fantastic. A lot of green, nice scenery and fantastic restaurants! There is a really nice vibe in thuis part of the city."
        }, 
        {
            "index": 237, 
            "rating": "4", 
            "review": "Chic district. We walked from downtown to Palermo. It is quite a trendy district with markets and many restaurants and bars. Many embassies are situated here in beautiful architectural buildings. There are parks, lakes, the botanical gardens and a large rose garden full of various blooms. Probably my favourite part of the city."
        }, 
        {
            "index": 238, 
            "rating": "4", 
            "review": "Nice 'barrio'. its a nice barrio/area with shops and restaurants and just to walk around a while, there are wonderful houses and 'tienditas' to take fotos of and all kinds of restaurants, from fancy to simple, typical small grocery stores, we enjoyed it a lot and you can get there easily by metro."
        }, 
        {
            "index": 239, 
            "rating": "5", 
            "review": "This is why we fly to Argentina. If you want to be local and feeling smell best local food, walking from street to street with argentinian people this is the place you have to be , and doen not matter when - day or nigth it always will be people, musician, dancers around you."
        }, 
        {
            "index": 240, 
            "rating": "5", 
            "review": "Great Neighborhood With Dining and Shopping Within Walking Distance. We rented a duplex for the week. It was so close to leather outlets, supermarkets, outdoor markets, and restaurants. We walked almost everywhere. If we were worn out after so much walking, we could always find a place to stop to eat or have a glass of wine. Taxi rides were inexpensive to attractions too far away to walk. Loved this neighborhood. And we always felt safe walking at night, even as late as midnight."
        }, 
        {
            "index": 241, 
            "rating": "4", 
            "review": "Trendy Palermo! De moda Palermo!. A very eclectic area of Buenos Aires, very popular for tourists. But watch out for pick-pockets! Lots of bars, restaurants and shops. Generally expensive but there are bars/restaurants which offer good value."
        }, 
        {
            "index": 242, 
            "rating": "4", 
            "review": "Great neighborhood. Lots of stores, trendy restaurants and bars. We loved visiting Jumbo supermarket, inside a mall. That's the place to buy a lot of delicious spices (ají molido, chimichurri, etc)."
        }, 
        {
            "index": 243, 
            "rating": "3", 
            "review": "Leave it till afternoon.. Having read a review about going well before 1 in order to get a table at a bar/café. We walked from Centiro area, about 4 miles and arrived at 12, midday. far to early as they were still erecting the stalls. Left early."
        }, 
        {
            "index": 244, 
            "rating": "4", 
            "review": "stayed in the neighbourhood. stayed in this neighbourhood and thought it was a great pick. lots of bars/restaurants and little market on weekends. make sure you take AMERICAN cash in small bills. WAY better exchange on the \"blue\" market once you are there… they all accept US cash at better rate..."
        }, 
        {
            "index": 245, 
            "rating": "5", 
            "review": "Cute & trendy. Cute region in Buenos Aires which is like the Camden town of London but this is argentina. Colorful streets with lots of trendy bars and boutiques. Perfect to unwind with friends and enjoy good food and explore another side of the magical city"
        }, 
        {
            "index": 246, 
            "rating": "4", 
            "review": "Serene Park and large Avenues. This area is surrounded by large homes and beautiful parks.We Japanese Garden, Zoo and the Rose Garden are located here. The gardens are well maintained. We visited the rose garden brimming with hundreds of variety of Roses. A beautiful lake full of birds. Its a lovely place to visit in the evening when the sun is not beating down on you."
        }, 
        {
            "index": 247, 
            "rating": "4", 
            "review": "Beautiful older homes and neighborhood. Very quiet neighborhood with older homes. Area felt very safe with a number of restaurants and kioscos available for quick snacks or meals."
        }, 
        {
            "index": 248, 
            "rating": "4", 
            "review": "Cool, trendy and absolutely delightful!. If you're looking for a place for a good meal out, a good cup of coffee, an evening of live musik and good wine, the best ice cream parlours or an inspiration for a gift or something for your own home then Palermo is definitely the place. Many local artists also have their galleries here.If you love gardening, then there's the Jardin Botanico and Jardin Japones to visit. Both are lovely places to go for a walk or to sit down and drink your \"mate\"."
        }, 
        {
            "index": 249, 
            "rating": "5", 
            "review": "Park. Beautiful park with a boating lake and rose gardens. We spent a hot afternoon here recently. Walk over the Love Bridge or just sit and watch the locals enjoy themselves."
        }, 
        {
            "index": 250, 
            "rating": "5", 
            "review": "Great place for drinks at night. Boheme chick. There are lots of opportunities to have a nice dinner and great drinks in this suburb. Wine, microbrewer beer, or anything you like."
        }, 
        {
            "index": 251, 
            "rating": "4", 
            "review": "Lakes, Parks, Statues, Gardens, .... this elegant part of Buenos Aires is home to large parks and gardens, lakes with geese, the planetarium amongst many other attractions and the Paseo de Rosedal.What a great, safe place to picnic, stroll, have youg kids play or just cool off in the shade of the mature parks by the lake.It has museums and restaurants galore, some of them towards the high end.You must spend some time there while in Buenos Aires."
        }, 
        {
            "index": 252, 
            "rating": "4", 
            "review": "Young and trendy area. We stayed in this area and were delighted. Lots of good restaurants and lively in the evenings. Safe for Buenos Aires."
        }, 
        {
            "index": 253, 
            "rating": "3", 
            "review": "reminds me of south beach, in miami. usually i stay away from trendy - but this area is as quaint as it can be, so i see why it got popular. Lots of old buildings being renovated, restaurants, shops, and when i visited there - during the day -there was a street fair with fantastic handmade crafts. If you ask the helpers at the subway, they tell you that you need to take a bus to get there. Dont believe it - you can take the subway to the stop for the zoo and walk up the 8 - 12 blocks - gorgeous stuff to look at and take pictures of."
        }, 
        {
            "index": 254, 
            "rating": "4", 
            "review": "Wonderfull place to hang out.. Palermo is full of restaurants, cafes, boutiques and small and artistic shops, but furthermore it is full with lots and lots and lots of people! Hundreds of them filling the streets till early morning!Should be included at your scheduled!"
        }, 
        {
            "index": 255, 
            "rating": "4", 
            "review": "Great Area. Great for cafes, bars, restuarants and walking around. Very good vibe around the streets and plenty of options, definately where the action is of a night time."
        }, 
        {
            "index": 256, 
            "rating": "4", 
            "review": "Trendy Area. Everyone told me this was the more trendy area to visit. I was there during the day and didn't find it that great but still enjoyed the restaurants and looking around. The shops are not for bargain hunters."
        }, 
        {
            "index": 257, 
            "rating": "4", 
            "review": "Upscale comfortable area. Palermo is a middle-class area we stayed in for several days, many people have dogs, several nice big parks (Japanese gardens is nice). Felt safe walking around at night. Many decent restaurants, plus supermarkets for we tourists!! Easy to get subway into town (costs 5 pesos) which is a bargain."
        }, 
        {
            "index": 258, 
            "rating": "5", 
            "review": "Stay In This area. So easy. Safe. Leave your apartment and you have a hundred nightlife choices. Many clubs. Many restaurants. Far from the center but the best area to stay in."
        }, 
        {
            "index": 259, 
            "rating": "5", 
            "review": "Great place!. After a nice walk lunch at Salgado Alimentos, Palermo is a good option for shopping. In the first time we've come prices were cheaper, but it's still a good place to find intersting things."
        }, 
        {
            "index": 260, 
            "rating": "5", 
            "review": "night is fun!. You find all kind of parties here, my advice is to avoid the famous ones and try to find the alternatives, like Jolie party, which is free! Armercia with Costa Rica street"
        }, 
        {
            "index": 261, 
            "rating": "4", 
            "review": "Palermo Soho. Palermo is a very wide area including the botanical Gardens and the Zoo which are also interesting . The area for shopping, restaurants and cafes is Palermo Soho. Cute area worth spending one afternoon"
        }, 
        {
            "index": 262, 
            "rating": "5", 
            "review": "Great for shopping and eating in Buenos Aires..cool and trendy!. I traveled here for a my birthday in February 2015 and found this area (Palermo Soho, Palermo Viejo, and Palermo Hollywood) to be the best shopping and eating area of Buenos Aires. Cute little shops, many just small business owned, along cute little streets watching the beautiful \"Portenos\" shop and dine...Skip the shopping malls, grab a map of the area from one of the local business and wander around the 20 square blocks or so of this wonderful Buenos Aires district..."
        }, 
        {
            "index": 263, 
            "rating": "5", 
            "review": "Pick a Palermo, Any Palermo and there is plenty to do and see.. Shopping, Art, Nightclubs, Food - the 5 neighborhoods that comprise Palermo has something for everyone. Palermo Soho and Palermo Hollywood are for the trendy hipsters and there you will find interesting Fashion, Food and Art. This area would most resemble Greenwich Village in the 80's with interesting window displays and beautifully made clothing and jewelry at great prices."
        }, 
        {
            "index": 264, 
            "rating": "4", 
            "review": "Buenos Aires most stylish and fancy area.. Palermo has the most nice Restaurants and a lot of nice places to spend your evening, have a drink or a good meal! The ib-scene meets at Plaza Serrano, but that's by far not the only place to be!"
        }, 
        {
            "index": 265, 
            "rating": "3", 
            "review": "Seems overrated. We liked the area of San Telmo better with the cobblestone streets and neighborhood feel. We walked the streets recommended and loved it. Ended up walking north to Ave de Mayo, Pink Palace and the touristy place of Cafe Tortoni"
        }, 
        {
            "index": 266, 
            "rating": "4", 
            "review": "The most interesting part of town.... Palermo is one of the oldest neighbourhoods in Buenos Aires, but in the last 20 years of so it starting a transformation and segregation... It was taken over by young middle-upper class people, both local and foreign and it became \"the\" are to be part of... These people moved there and lots of bars, restaurants, art shops, clothing stores, boutique hotels, and some \"cool\" offices move there... Today there are areas within the whole neighbourhood that are recognised as Palermo Soho (mostly artistic and very fashionable), Palermo Hollywood (media and show business), Palermo Brooklyn (art crafts and other fashionable stores), and so on... You can spend most of a day there and enjoy the diversity of options available..."
        }, 
        {
            "index": 267, 
            "rating": "5", 
            "review": "Quaint with great restaurants and shops. I stayed in the city center the first time I visited Buenos Aires so decided to try somewhere different and i am so glad that I did. It was peaceful to walk around at night and great restaurants. Would definitely stay here again."
        }, 
        {
            "index": 268, 
            "rating": "4", 
            "review": "BsAs' largest neighborhood, full of opportunities. Palermo is the largest and most crowded neighborhood in Buenos Aires.It can be ideally subdivided into 5 further \"de facto\" neighborhoods, each one with its own features: Palermo Chico, Palermo Viejo, Palermo Nuevo, Palermo Soho and Palermo Hollywood (these last two are the trendiest part of the city). Choose the one which best fit your needs."
        }, 
        {
            "index": 269, 
            "rating": "5", 
            "review": "In Love with Palermo. Palermo is absolutely delightful. There is so much to do in Palermo and it is a great location to those who prefer to travel and site see by foot. I stayed in Palermo during a 3 week trip to Buenos Aires and was able to walk to all major landmarks in under 2 hours. The bus system in Buenos Aires can be complicated and misleading and with free days to fill I preferred to follow walk everywhere which proved to be a great way to see even more of the city. Palermo is so charming and culturally robust. I cannot wait to visit Buenos Aires again."
        }, 
        {
            "index": 270, 
            "rating": "5", 
            "review": "Great area!. Palermo is a great area for shopping and eating. Lots of quirky shops offering many locally made clothes and artifacts. Lots of local designers here as well. Fabulous array of restaurants to choose from too"
        }, 
        {
            "index": 271, 
            "rating": "5", 
            "review": "I love this place. Palermo is cultural, exciting and filled with nice restaurants. There is always something to do and new people to meet. It is a great place for ex-pats from the states who are used to cultural experiences with people from all over the world."
        }, 
        {
            "index": 272, 
            "rating": "4", 
            "review": "Great area to walk around. Rejuvenated area of BA reminds us of the village in NY or Notting hill....loved walking around it. Vist piazza serano"
        }, 
        {
            "index": 273, 
            "rating": "4", 
            "review": "cool. Palermo remind me Atenas, very cosmopolitan part in Buenos Aires.\nVery nice place for walks and for coffees."
        }, 
        {
            "index": 274, 
            "rating": "4", 
            "review": "Fun active street life. We stayed in a boutique hotel on the border of Palermo and Palermo Soho. We felt completely safe in this residential area. There were numerous markets and restaurants nearby, including the famous and always busy Don Julio's. It cost only a few dollars to take a taxi anywhere.We walked to the parks and enjoyed watching families and the ver present dogs. We are not shoppers and I cannot comment on the shops."
        }, 
        {
            "index": 275, 
            "rating": "4", 
            "review": "Nice neighborhood. Great location, access to airports. Good restaurants and hotels. Also well organized for transport in and out of the city."
        }, 
        {
            "index": 276, 
            "rating": "4", 
            "review": "A nice stay in this evolving neighborhood. We stayed in Palmero Soho. The area has lots of restaurants and shops to poke through and has two subway stops to central BA.While offering many good eating stops, it was not especially noisy."
        }, 
        {
            "index": 277, 
            "rating": "5", 
            "review": "Wonderful place to stay. Such a fun area. There are bars, coffee houses and excellent restaurants everywhere. Some of the best were: Las Horas restaurant, the main square, many ca bios, and a Street Art waking tour. We stayed at a lovely studio apartment we rented on Trip Advisor."
        }, 
        {
            "index": 278, 
            "rating": "5", 
            "review": "Fantastic neighbourhood!. I love Palermo! The nightlife is awesome; visit the Jardin Botanico and Japanese Garden if you have the time. There are also some really good restaurants here. Try Don Julio, which serves amazing steak!"
        }, 
        {
            "index": 279, 
            "rating": "4", 
            "review": "I liked it. Palermo is a quirky and charming neighborhood in BA. There are many independent shops to choose from, a little expensive but nice to browse. We Sat in a square with restaurants people watching and drinking wine seemed nice. Locals seemed to congregate at 6, lots of funky European style bars. I liked it for browsing funky jewellery / clothes as well as people watching."
        }, 
        {
            "index": 280, 
            "rating": "3", 
            "review": "Neighborhood. It was different in so far as it was a neighborhood very similar to the neighborhoods in the older cities in the US."
        }, 
        {
            "index": 281, 
            "rating": "4", 
            "review": "Nice shopping. Palermo is a nice shopping place. Florida street is very famous. Also in Palermo there are nice joints to eat."
        }, 
        {
            "index": 282, 
            "rating": "3", 
            "review": "average shops might as well go to kmart. if u like k mart . this is your thing thousands of junky womans shoes and clothes shops . i did score a few animal rugs i dont get the thrill of this place but if u want some beads and costume jewelry thats less than ten dollars u are in the right place. there are cute cafes and lots and lots ofshoe stores - well suited to young girls"
        }, 
        {
            "index": 283, 
            "rating": "4", 
            "review": "love it - wanted to buy a flat. it reeks of quality of life.... money but normal. wuld be a great alternative to New York or Paris - my vote - YES!!! I love it - wanted to buy a flat the first time I visited."
        }, 
        {
            "index": 284, 
            "rating": "4", 
            "review": "Great to vagabond there!. Buenos Aires has so many faces - one of them is Palermo, where the young designers as well as the upper middle class have residence. You will find colourful bars and interesting shops and unusual designed boutiques and houses. The atmosphere ist very relaxed and you will enjoy to be there for a couple of hours. Find even wholeweat bread!"
        }, 
        {
            "index": 285, 
            "rating": "4", 
            "review": "Great place to walk around. We spent an afternoon walking around Palermo and they have a new shopping area near the train station that is a great stop for an ice cream on a hot day and some shopping also. Continue thru Palermo Soho where you can find cool stores and restaurants."
        }, 
        {
            "index": 286, 
            "rating": "5", 
            "review": "place to be. you can be in palermo and have everything without living this place... its different palermos so everybody can find sth they like. a lot of small shops, restaurants, music, bars.. very buenos aires..."
        }, 
        {
            "index": 287, 
            "rating": "4", 
            "review": "Soho of BA. Palermo is a charming neighborhood in BA, with many shops, parks, restaurants, boutique hotels and trees. It makes for great walking and shopping, as well as people watching."
        }, 
        {
            "index": 288, 
            "rating": "5", 
            "review": "Picturesque and lively neighbourhood. Beautiful neighbourhood, with nice, low-rise buildings and cobbled tree-lined streets, huge nightlife with numerous nice bars and restaurants with courtyard, terraces or tables on the pavements, young crowd, design and fashion shops. Staying there as a visitor may not be the optimal solution though, as you need to get the metro to the main attractions of the city and with taxis being quite cheap it is very easy to visit Palermo at night."
        }, 
        {
            "index": 289, 
            "rating": "5", 
            "review": "Quality area. Palermo is a great area where I felt safe and welcomed. It offered a lot of restaurant options and taxi cabs were always accessible."
        }, 
        {
            "index": 290, 
            "rating": "5", 
            "review": "very nice atmosphere. it was fabulous the Bife de Chorizo we had was outstanding and the wine was perfect and the Quilnes beer very good alsol"
        }, 
        {
            "index": 291, 
            "rating": "5", 
            "review": "New year in Palermo is a great option!. We had dinner at Meridiano 58, which served a great menu. There was a show in the street, just in front of the restaurant, and people danced to a band playing Brazilian music."
        }, 
        {
            "index": 292, 
            "rating": "5", 
            "review": "Quiet neighborhood. It is long walk from Puerto Madero but like always we walk,there are means of other transportation, subway, taxis, buses, but we walk. It is worth ed. Meet people, see so many places, but most of all the moment you turn left from Avenida Santa Fe to Armenia things change. All of a sudden from busy streets od Buenos Aires you find yourself in quiet neighborhood filled with older but very preserved buildings, cafes, friendly people. There we had nice time in small Palermo Viejo park, but rewarding, fed some doves."
        }, 
        {
            "index": 293, 
            "rating": "5", 
            "review": "Great to for everything. We (my girlfriend and I) spent a month in the area. It got a lot of nice street cafes and everything from haute-cuisine to cheap but good food. Palermo also is the epicenter to go out, which is a bit pricey though. You can do lots of shopping there but this is expensive in that area."
        }, 
        {
            "index": 294, 
            "rating": "5", 
            "review": "Cafes & restaurants & boutiques abound. We stayed in an apartment in Palermo and were very happy with this barrio. The streets are alive with cafes, restaurants, boutiques and dancing, and many ice cream parlors. The only side note is that there is street noise into the wee hours of the morning every night - but that's part of the life."
        }, 
        {
            "index": 295, 
            "rating": "4", 
            "review": "Chic Palermo. Palermo is hip, colourful and trendy indeed. The barrio is all that one reads in the travel books and online. Initially thought to stay in Palermo but we are glad that we did not as it is busy. A fun place to shop, eat and people watch but to be frank, Palermo may be slightly over rated, especially if one is to compare it to the soho areas of New York and London. That may not be fair, but the comparisons have been made. Still worth a walk through. We visited twice and on one of the nights, a summer deluge began and the streets became flooded with both water and garbage. Watching people jump, walk barefeet (to save their shoes) through the water was the evenings entertainment as we ate."
        }, 
        {
            "index": 296, 
            "rating": "5", 
            "review": "Nice neighborhood. You got all you need (restaurants, bar, recreation areas, shops) within walking distance.Enjoy Argentinas finest dining/drinking"
        }, 
        {
            "index": 297, 
            "rating": "5", 
            "review": "Wonderful Neighbourhood to Shop/Dine. This was a great area to just walk around for hours exploring different shops and restaurants. We felt totally safe. We visited this area 3 times and still did not see all it had to offer"
        }, 
        {
            "index": 298, 
            "rating": "5", 
            "review": "Really nice neighborhood. The Palermo neighborhood is where we stayed and just by looking around the city from a tour bus, I'm really happy we did. There are a lot of horror stories about South America, but most of the ones we'd heard were because people chose to stay in pretty scary sections of the city."
        }, 
        {
            "index": 299, 
            "rating": "4", 
            "review": "The Best Neighborhood. We love this neighborhood with its wealth of cafes and restaurants. Can find fresh croissants or empanadas, salads or quiches, sushi or parrillas. The little grocery stores make it easy to pick up snacks and wine. Can get to other areas of the city by bus, metro, or taxi."
        }, 
        {
            "index": 300, 
            "rating": "3", 
            "review": "Watch were you put your feet!. Palermo is billed as a bohemian community and it lives up to its reputation with a mish mash of buildings, shops, restaurants and small hotels.There are a lot of pet shops in the area and a lot of residents out walking dogs, which they appear to be very fond of, but that doesn't extend to picking up after them. This, together with the atrocious condition of the sidewalks (predominantly paved with small tiles, which over time have become a shattered mess), makes walking around the neighbourhood a challenge to safety and hygiene."
        }, 
        {
            "index": 301, 
            "rating": "5", 
            "review": "Walked and Ate and Drank some Malbec. I loved Palermo--a great place for architecture lovers and people watchers. Nothing beats sitting outside on the sidewalk drinking aqua con gas and Malbec, eating fritas, and watching the day go by. Except maybe sitting outside on an upstairs balcony."
        }, 
        {
            "index": 302, 
            "rating": "4", 
            "review": "Nice trendy area... Lots of cafes, restaurants and little boutique shops. Check for my other reviews for recommendation of places.."
        }, 
        {
            "index": 303, 
            "rating": "3", 
            "review": "OK to stay overnight. This area abundance in restaurants, especially Italian. There are not many grocery stores or cloths shops around. During daytime it may be a bit boring and at night dangerous. Especially the part after the railways."
        }, 
        {
            "index": 304, 
            "rating": "5", 
            "review": "My Favorite Barrio. Pa;ermo is definitely my favorite barrio (neighborhood) in buenos aires. full of cute little boutique shops, coffee places and restaurants"
        }, 
        {
            "index": 305, 
            "rating": "4", 
            "review": "Bohemian and Cool. Lots of restaurantes, bars cool stores and great art galleries. It's heart is the Plaza Serrano, a small square very much alive with many nice clothes stores."
        }, 
        {
            "index": 306, 
            "rating": "5", 
            "review": "Where it's at!. This is Buenos Aires. Lots of shopping, restaurants, bars, ice cream, museums, etc. so much to do with gorgeous tree lined streets and fashionable ladies walking all around you."
        }, 
        {
            "index": 307, 
            "rating": "5", 
            "review": "Great area with fantastic restaurants and nightlife. We stayed in a boutique hotel in Palermo Hollywood. Great location and an easy walk to Palermo Soho. Fantastic shops, bars and restaurants. This is our favourite part of the city and would highly recommend. Great base for exploring. Lovely to wonder the neighbourhood and feels very safe."
        }, 
        {
            "index": 308, 
            "rating": "5", 
            "review": "Great spot in the city - bars, restaurants, shopping. It's a nice area and i'd definitely stay in this part of the city if i were to visit BA again. Lots of amenities nearby but it's a bit of a walk to subways. Buses seem harder to use in Argentina than Brazil, you'll need your walking boots on."
        }, 
        {
            "index": 309, 
            "rating": "4", 
            "review": "Trendy and Hip. This is a great spot to rent an apartment for a few days and have as a home base to explore the city. There are lots of nice shops and restaurants ."
        }, 
        {
            "index": 310, 
            "rating": "4", 
            "review": "Pintoresque. Lovely area to walk around, shop as well if you wish, i would prefer the local stores than the world name stores, but that is just me, they have the loveliest things made by local \"artists\" from leather to clothing, you have to look for them (a few in J Luis Borges street very close to plaza Serrano) and some around there, a very big area but if you have the time go and stroll around."
        }, 
        {
            "index": 311, 
            "rating": "4", 
            "review": "Great area to hang out. I liked the restaurants and bars in the area. This is a nice trendy area that has a lot going on at night."
        }, 
        {
            "index": 312, 
            "rating": "4", 
            "review": "Too much to do!. Really convenient and enormous range of restarants and cafes, close to the Subte (d) and easy to get around."
        }, 
        {
            "index": 313, 
            "rating": "4", 
            "review": "Nice neighbourhood. Palermo is one of the most attractive neighbourhoods in Buenos Aires. A lovely area with restaurants, residential, business & commercial areas. Most highly recommended for a visit!"
        }, 
        {
            "index": 314, 
            "rating": "4", 
            "review": "My homestay in the Palermo neighborhood of Buenos Aires, Argentina. Palermo is a great area to stay at. I had an amazing host mom in a nice apartment during my one-month study abroad over the summer. There is so much to do in the federal district and especially in the Palermo/Hollywood areas. Plenty of good restaurants, bars, and clubs. And tons of shops for miles on end. If you are looking for a place to stay in the capital city of Buenos Aires, I would definitely recommend Palermo. My apartment was super close to the subte, making it easier to get around, and only one stop away plus a short walk to the Universidad de Belagrano (University of Belgrano) where I had my Spanish class."
        }, 
        {
            "index": 315, 
            "rating": "4", 
            "review": "Lovely fashionable area. Really nice area to walk round in the daytime with street after street of stylish shops, fine restaurants and trendy bars. One section comes alive at night with bars and clubs. There's also an interesting street market in the square."
        }, 
        {
            "index": 316, 
            "rating": "4", 
            "review": "Off the beaten track in Palermo in Buenos Aires. What you need is one full day out of your busy schedule in Buenos Aires to fully comprehend and absorb the neighbourhood of Palermo. You need the full day actually to have three meals in three different classy restaurants, some good amount of time to walk around the blocks and a dedicated time exclusively to observe the people who can range from being stylish, to fashionable to outright outlandish. Think of approaching the exploration of this neighbourhood of Buenos Aires from the perspective of arts and not from science. What I mean to say is that do not follow rules, there are no theories or tips to tell you to start from point A and then take a right to eat at restaurant B and so on. You get the point right? You should have the right mindset to explore Palermo from the perspective of art so that it is abstract, it is very personal to you and subject to your own interpretation. From our experience of this fantastic part of the Argentine capital we will share a few discoveries we made which are worth sharing and chances are very strong you won’t find them in Lonely Planets travelogues.First was the serendipity of surrendering into the numerous aroma of Tealosophy. Secretly located between the Avenue Armenia and Gurruchaga, this place is the treasure island of all things tea! You will fall in love again with your sense of smell when you will enter into this place. Never before we discovered something like this. The shop itself is very cosy where the varieties of tea in pots are stacked neatly in the shelves. Spicy, Clementine, Darjeeling, Jasmine Flowers and many more permutation and combination of tantalising tea all under one roof. Don’t forget to buy a few cans of your favourite flavours as souvenirs. Just next to this place was an antics showroom called Paul & Co. Step in to get lost in time with carefully decorated vintage furniture, cutleries, beds and sofas. There was a strange mystery in this place. Both these places being next to each other and slightly inside hidden from the main roads in Palermo added to the extra intrigue of discovering them by chance and not by plan.Being amazed by these hidden gems in the neighbourhood, we stepped out to look for more such unique discoveries. We didn’t have to go that far as the Schlifka Molina gallery was just on the same road. This was a contemporary art gallery that represents and exhibits works of national and international artists, with the aim of making galleristic curatorial practice and experimentation as a practical platform to other fields. The way this gallery was designed and the artefacts displayed resonated very strongly the creative vibe of Argentina. You will have surely thought to visit national museums and galleries to know about Argentina’s past history but if you really want to know the story of the creative lot of Argentina and where the country is heading in terms of arts, you have to visit this gallery. Most notable here was the exhibition titled “El pájaro del brujo” — The bird of the witch — where the Argentine Vilar’s exhibition was striking, unusual, and unnerving in equal measure, drawing influence from Kenya Hara’s Japanese book of poetry “White”. The artefacts were strewn across the floor in a way making full use of the available space on the floor. It created as if a 3D experience of total immersion into the art. That was not the end there. Palermo is a true hotbed of creative genius. While walking randomly we then stood in front of the workshop and gallery of the Veron Mora- Morada. The way he has created his exhibits using day to day objects that will leave you in awe. You will have never thought of making a piece of art out of pencils, would you? Or what about nails? Other than getting struck by hammer to hang your photo on the wall, you will be surprised to see the same nails being used to create a piece of heart or something of artistic value, innovative we had to say. Palermo was one place in Buenos Aires where you will get to see clothing brands and retails outlets you will have not seen anywhere in the world. That meant that the brands were either local or regional and that increased their appeal. Boutique shops, designer showrooms all with pure Argentine roots and creativity were there for your discovery. Again, don’t rush in Palermo. Just wander around, take a pause and move on."
        }, 
        {
            "index": 317, 
            "rating": "5", 
            "review": "Wonderful place. I spent the vast majority of my time in Buenos Aires in Palermo. Lots of great restaurants, bars, places to shop, and landmarks.And I've never seen more beautiful women."
        }, 
        {
            "index": 318, 
            "rating": "5", 
            "review": "Trendy place. We stayed in Palermo Hollywood and strolled around Palermo Hollywood and Soho. Very safe till very late. Nice cafes with good food on every street. Open till very late. Don't get upset by the graffiti. It is an acceptable art form. Nice small shops selling everything from regular stuff, clothes, artifacts etc. Loved this part of town. Highly recommend."
        }, 
        {
            "index": 319, 
            "rating": "3", 
            "review": "Not so fun during the day. Considering where I'm from, it didn't look like a unique place to visit. Besides looking for restaurants, there is no much to do."
        }, 
        {
            "index": 320, 
            "rating": "5", 
            "review": "Good place to eat out. Good place for eating out. Great variety of restaurants on fits Roy street. But if you want to be sure to have a table it's better to book in advance. This place is place for a nightlife as well"
        }, 
        {
            "index": 321, 
            "rating": "5", 
            "review": "Lovely ariea to stay and just walkaround. By Far Palermo is the most sympathetic neighborhood in Buenos Aires.It is full with restaurants and coffee house which always full with local people.It is not the most touristic area and not many attractions inside it (although you have the Botanic gardens and the zoo).Full with green gardens.excellent place to stay if you are coming for few days to tour the city."
        }, 
        {
            "index": 322, 
            "rating": "5", 
            "review": "Best area. Lovely safe area, lots of bars and restaurants to choose from. Felt very easy going and plenty of decent venues to sip away the evenings."
        }, 
        {
            "index": 323, 
            "rating": "5", 
            "review": "Its Like Greenwich Village. Thought I was in the East Village of NYC. Great walking Palermo ,i.e. Soho, Hollywood and Viejo. Great sophisticated shopping and dining."
        }, 
        {
            "index": 324, 
            "rating": "4", 
            "review": "Nice area. A quieter area away from the hustle and bustle of central BA. Nice tree lined streets with many upmarket shops and restaurants. However it wasn't quite as attractive as we thought it would be and prices were higher reflecting the touristy nature of the area. Nice to visit but I think there are better areas of BA to stay in."
        }, 
        {
            "index": 325, 
            "rating": "5", 
            "review": "Nice place to relax. Though we were only here for one night, at the end of 24 days in Argentina, it was a lovely place. Beautiful parks, lots of cafes and restaurants, and interesting neighborhoods to walk through. It's busy, with traffic, but a fun place to chill for a night or two."
        }, 
        {
            "index": 326, 
            "rating": "5", 
            "review": "PERFECT AREA. This area is the best! It is right near Recoleta and also a more trendy part called Palermo Soho. I felt so safe here and would never stay anywhere else in Buenos Aires!"
        }, 
        {
            "index": 327, 
            "rating": "3", 
            "review": "A decent upscaleish part of Buenos Aires!. A decent upscaleish part of Buenos Aires! We were told that it was as nice as San Telmo ... but I did not enjoy the walk around the neighborhood on our trip to Buenos Aires in 2009 that much. It is just very posh and can be a bit pricey in regards to eats/shops ..."
        }, 
        {
            "index": 328, 
            "rating": "4", 
            "review": "Restaurants and Night life abounds here.. From the Grand Hotel on Las Heras we took a taxi three times, twice to dine and on the last night in BA a Tango Show. Worth the drive, it reminded us of the East Village in New York."
        }, 
        {
            "index": 329, 
            "rating": "2", 
            "review": "Tourist trap. Our guided tour dropped us off at our tour guides favorite place. He sat at the bar drinking coffee while the ladies shopped in the shops. Looked like low quality items straight from China. Tango dancers on the corner waiting for pictures for a fee. JUNK."
        }, 
        {
            "index": 330, 
            "rating": "4", 
            "review": "Palermo. Very soughtafter place to stay, but in my opinion it is better to stay in the center of BsAs. A bit less safe, but a much more living place.Palermo is very residential and became very touristic"
        }, 
        {
            "index": 331, 
            "rating": "4", 
            "review": "Nice unique boutiques. Palermo has nice unique boutiques and cafe's. It's a cute area. It is worth seeing. Dinner at Calden was great too. There are 2 new areas in Palermo (Soho & Hollywood). Soho was great, I have never been to Hollywood."
        }, 
        {
            "index": 332, 
            "rating": "5", 
            "review": "Coolest area of the city. Nice green space with people walking their dogs, outdoor markets, restaurants, boutique hotels - all in all a trendy area."
        }, 
        {
            "index": 333, 
            "rating": "5", 
            "review": "wander around. Another great little area to walk around. The architecture is amazing and beauty is everywhere. This is the rich part of town and it shows."
        }, 
        {
            "index": 334, 
            "rating": "5", 
            "review": "Lovely neighborhood. Best choice to stay in. Close enought to downtown. Plus, at night time you dont have to leave the neighborhood to find good restaurants and bars. It was the best think, coming back to the hotel from a long day walking to have a shower and have good options for the night just around the corner."
        }, 
        {
            "index": 335, 
            "rating": "5", 
            "review": "Great area. Lots of restaurants and shops. Felt very safe while walking around. Always people out and about, and very easy to find new places to try and hang out."
        }, 
        {
            "index": 336, 
            "rating": "5", 
            "review": "Stay here if you can.. Full of life and colour. A young spirit can be felt throughout the area. Lovely shops and restaurants. Great for walking and just soaking up the atmosphere."
        }, 
        {
            "index": 337, 
            "rating": "5", 
            "review": "Great Area to Spend your Buenos Aires Trip. Palermo is the place to stay if you want to stay in a trendy, restaurant filled location with lots to do at night. You cannot go wrong and if you like to explore you could find yourself walking around Palermo several days and not get bored."
        }, 
        {
            "index": 338, 
            "rating": "4", 
            "review": "A very nice area. with a lot of character! We spent most of our time in Argentina in Palermo (Hollywood and Soho) as well as near Plaza d' Italia. Enjoyed walking around everywhere. One major complaint I have is that the sidewalks need better maintenance. I fell down once due to the many holes and uneven ground spots everywhere."
        }, 
        {
            "index": 339, 
            "rating": "5", 
            "review": "The Place To Be. Palermo is a great place to be in Buenos Aires. It's full of parks, easily accessible by bus and within walking distance of many \"must see\" sites like the Recoleta Cemetery, Evita Museum, Japanese Gardens, and MALBA (Museo de Arte Latinamericano de Buenos Aires."
        }, 
        {
            "index": 340, 
            "rating": "5", 
            "review": "lovely boutiques and restaurants. Upscale area with lovely boutique style stores and cute restaurants. Wander around, do get lost and enjoy the outoor terraces."
        }, 
        {
            "index": 341, 
            "rating": "4", 
            "review": "Upscale elegance. Palermo is one of several languid, leafy and elegant upscale neighborhood outside of the center that are good for shopping, dining, galleries. I found them all pretty similar, but that is not a criticism. All easily reached by metro."
        }, 
        {
            "index": 342, 
            "rating": "5", 
            "review": "Great place for the urban explorer or foodie. Everything is very close to you, and the area comes alive, especially Friday to Sunday (but most nights) around 10-11pm. Practically no high rise buildings, only authentic charm."
        }, 
        {
            "index": 343, 
            "rating": "5", 
            "review": "Elegant shopping. Stayed in Palermo Viejo and had the best time. Could walk to everything, felt totally safe and could change and use American dollars. Dinners were cheap by Chicago standards and the beef was 100% much tastier than USA beef."
        }, 
        {
            "index": 344, 
            "rating": "4", 
            "review": "Night life. Palermo is where the best places to go out are.\nYou can find bars, restaurants, discos or just a nice coffee shop.\nNice place also if you want just go around and visit the street fairs or sit on a square."
        }, 
        {
            "index": 345, 
            "rating": "5", 
            "review": "Excelent neighbourhood. Walking around is a must here for you to know what this romantic neighbourhood can offer. Restaurants and museums are everywhere."
        }, 
        {
            "index": 346, 
            "rating": "4", 
            "review": "A great place to go if you enjoy having a good walk in a park, going to a good restaurant or enjoy a Tango Show.. I love Palermo's night's life with so many restaurants and Tango Shows to choose from, and if you like to dace \"milonga\", well, this is the place to go"
        }, 
        {
            "index": 347, 
            "rating": "4", 
            "review": "Palermo Viejo. Enjoyed a lunch and bought a few vinyl tango records here. On a spring afternoon, it was very pleasant with a very relaxed atmosphere: shopping, architecture, outdoors market, coffee shops, people watching. The opposite of downtown Buenos Aires."
        }, 
        {
            "index": 348, 
            "rating": "5", 
            "review": "Very at home. 5 days staying in the neighborhood were very relaxing and entertaining. Though warned about the level of minor crime (in Buenos Aries overall), I never felt anything but warmth for the people of this neighborhood."
        }, 
        {
            "index": 349, 
            "rating": "4", 
            "review": "Live, drink, eat and enjoy. One of the wealthier neighbourhoods of Buenos Aires, Palermo is rich in nice restaurants (try the amazing steaks at Don Julio!), bars, clubs in a relaxed atmosphere, close to some of the beautiful parks of the city. A good place to stay while you're visiting the city!"
        }, 
        {
            "index": 350, 
            "rating": "5", 
            "review": "Visit the Armenian cultural centre for some Tango classes.. For my entire stay in BA I lived in Palermo with my friends, besides being a very safe area it has a lot of lovely small shops to stroll by. We spent an evening at the Armenian cultural Centre which offers a big variety of dancing classes throughout the week - we chose Tango and even though we had never done it before it was great. By the end of the day there is also open floor for everyone to practice their steps, and sometimes even a professional show. All for around 60 pesos."
        }, 
        {
            "index": 351, 
            "rating": "4", 
            "review": "Great night life. Over Palermo you will find a lot of bar, pubs and restaurants. This is a great place to be at night you have a great night life and it seems that the party never ends here.\nIt is full of places to go to eat and enjoy a nice meal. Also you have the zoo and the Rosedal over there."
        }, 
        {
            "index": 352, 
            "rating": "3", 
            "review": "just a fashion place. a funky place , fashionable , design , mode, restaurants ,bars , night clubs\nboutiques for fashion\nold neiborhood been rebamped"
        }, 
        {
            "index": 353, 
            "rating": "4", 
            "review": "Laid-back, Bohemian neighborhood. This neighborhood was a break away from the rest of the tourist attractions in Buenos Aires. I sat down in a café near Plaza Serrano to enjoy a nice local lunch, relax, and enjoy the atmosphere. For awhile, I actually forgot I was in South America because it reminds me of the more trendy neighborhoods found in New England cities."
        }, 
        {
            "index": 354, 
            "rating": "5", 
            "review": "Hipster and fun. Art, design, cool and beautiful people. Here is where art lives in Buenos Aires. If you are a cultural person, the Palermo is your hood to adore. Best restaurants, bars. And during the day you can enjoy the huge amount of boutiques and top brands to shop and become a fan of argentinian design. 100% recommended!"
        }, 
        {
            "index": 355, 
            "rating": "4", 
            "review": "Trending Neighbourhood. In palermo you can find the most trending places from Buenos AiresIt has several different spots. Palermo Soho, which is similar to NYC SoHoPalermo Hollywood, which is similar to Chelsea Market and NYC Soho, but more suitable for having dinner, lunch, drinks or night life.You can find also \"los Bosques de palermo\" Which is a great park similar to central park in NYC."
        }, 
        {
            "index": 356, 
            "rating": "5", 
            "review": "Lovely neighborhood. It's my favorite neighborhood in Buenos Aires. I love the atmosphere and the streets. It's nice to just walk around and admire the houses and architecture."
        }, 
        {
            "index": 357, 
            "rating": "5", 
            "review": "Great to hang out. This is the place where all people go to meet up before a night out ! just having a drink outside in the place was awsome !"
        }, 
        {
            "index": 358, 
            "rating": "4", 
            "review": "Fun and trendy part of town. Buenos Aires has many quality neighbourhoods and this is one of the better ones - great parks and gardens , Zoo and some of the better restaurants - easy to get to no matter where you staying and taxis are so cheap."
        }, 
        {
            "index": 359, 
            "rating": "4", 
            "review": "Cool neighborhood. - Trendy neighbourhood- A bit hit by year of populist government in Argentina...could be much better in a healthy economic environment"
        }, 
        {
            "index": 360, 
            "rating": "5", 
            "review": "Great town!. Great town to stay at if you're visiting Buenos Aires! It's close to everything practically! You have a lot of restaurants, bars, nightclubs, and more. Very practical"
        }, 
        {
            "index": 361, 
            "rating": "5", 
            "review": "PALERMO A PLACE TO VISIT. Palermo is not only the lakes, or the Casino, is also the neighborhood, is fancy, the parks are incredible nice , the lakes, the Japones Garden, fantastic, the ZOO, the Botanic Garden...a place to visit"
        }, 
        {
            "index": 362, 
            "rating": "5", 
            "review": "Great location to stay in BA. Location and food nearby were all excellent. Go to Don Julio for dinner, it's brilliant ................"
        }, 
        {
            "index": 363, 
            "rating": "5", 
            "review": "Best restaurants in BA. Great spot for a bite to eat.. you have so much choice here.. Just a fantastic vibe, great little places, as well as the bigger BBQ joints as well. Great to stroll around, nice apartments and shops, but definitely go here to get authentic Argentinian and a BA feel.."
        }, 
        {
            "index": 364, 
            "rating": "5", 
            "review": "Excellent neighborhood. Loved the area surrounded by parks, very European and clean. Palermo Soho has great shops, and Palermo Hollywood has great restaurants."
        }, 
        {
            "index": 365, 
            "rating": "3", 
            "review": "Not impressed. I been staying here at Palermo for two months now and I am NOT so impressed. Sure there are many restaurants, overpriced shops and TOO MANY PEOPLE. Side walks ARE HORRIBLE!!!! They are so bad that I fell the first day I went out and ended up in ER. I been told by locals that \"locals\" go to hospital very often for the same reason - falling down on a bed streets/sidewalks. So many people are just rushing by each other clenching their purses/begs and looking at the ground just so they too don't end up in the ER."
        }, 
        {
            "index": 366, 
            "rating": "4", 
            "review": "Palermo. Lived in Palermo Soho for 4 months. The area is a mixture of cultures like most of BA. Good for transport, shopping, eating out. Near enough to central BA but far enough out to be secure. Good for the Aeroparque, Racetrack, casino, zoo, japanese garden, metro etc. Enjoyed it. A good base to explore Argentina, Chile and S.Brazil."
        }, 
        {
            "index": 367, 
            "rating": "5", 
            "review": "European-style getaway. Lovely area which does have a nice soho feel to it. Not cheap, but some interesting shops and cute cafes. I also hired a scooter here from the GreenScooter.net which was super fun!"
        }, 
        {
            "index": 368, 
            "rating": "5", 
            "review": "Amazing neighborhood. The most beautiful and chicky neighborhood in Buenos Aires.This is the place to go shopping and eating in the best restaurants and coffee shops."
        }, 
        {
            "index": 369, 
            "rating": "5", 
            "review": "Just awesome!. Great restaurants. Great clubs. Great atmosphere. Great place. If you're in Buenos Aires, you should definately be aiming to stay here."
        }, 
        {
            "index": 370, 
            "rating": "5", 
            "review": "Beautiful neighborhood. Palermo is a low density neighborhood close to Buenos Aires' downtown. You'll find many coffee shops, restaurants, stores, art galleries and plazas. Many of Buenos Aires' best restaurants are in Palermo. If you just want a calm place to walk, relax and see interesting stuff without all the city's fuzz, this is the place."
        }, 
        {
            "index": 371, 
            "rating": "5", 
            "review": "Great upscale neighborhood!. Get away from the hustle and bustle of downtown BA. Escape to this huge part of town with upscale shops for window shopping, museums, and huge avenues. It must be the newest part of Buenos Aires bc it appears to be the most cared for."
        }, 
        {
            "index": 372, 
            "rating": "3", 
            "review": "Not sure what the fuss is about. Completely unimpressed with what is basically a touristy flee market...we had to check we were really at the right place...waste of time."
        }, 
        {
            "index": 373, 
            "rating": "5", 
            "review": "Would enjoy staying here on next visit. On a full day tour of Buenos Aires, we traveled through and around the Palermo area. It is full of wonderful restaurants and lots of activity. Would probably stay in that area on our next visit."
        }, 
        {
            "index": 374, 
            "rating": "5", 
            "review": "Great part of city. Lots of good shopping, restaurants, bars, people watching, and beautiful parks. Good place to see how locals live. Close to everything by subway or taxi. Nice people."
        }, 
        {
            "index": 375, 
            "rating": "5", 
            "review": "The best in town. Palermo has everything people attracts to trendy, unusual shops, cozy corners, great - i said: great - restaurants, lively people..... It has a west-coast kind of feel like san francisco. Dont miss resto Dada on place serrano."
        }, 
        {
            "index": 376, 
            "rating": "4", 
            "review": "My favorite part of BA. Nicer to walk around than Centro or even Recoleta - lots of nice cafés, fun bars, and neat stores to explore. Great vibe on the street, even in winter."
        }, 
        {
            "index": 377, 
            "rating": "5", 
            "review": "Great shopping!. I loved walking around this bustling area. The shopping was Excellant especially for beautiful leather purses at Humawaca!"
        }, 
        {
            "index": 378, 
            "rating": "5", 
            "review": "A cool place to spend day and night. With old houses and new shops, from good restaurants to street markets, you will find everything in this lovely restored part of Buenos Ayres."
        }, 
        {
            "index": 379, 
            "rating": "4", 
            "review": "Nice restaurants. You will find great restaurants over there, better option than in Porto Madero. Make sure you reserve a table at Osaka or Tegui and you won't regret!"
        }, 
        {
            "index": 380, 
            "rating": "5", 
            "review": "Unique and convenient. We rented an apartment for a week here and were very happy with the location. Our apartment was very quiet because it faced the back and there were no noisy businesses nearby. Be careful of your location because if you are near a supermarket or large business or a club, it can be very noisy. The neighborhood was very unique and artsy, with small boutiques lining the streets. We were close to the Botanical Gardens and zoo, as well as the subway. There are two lovely plazas filled with wonderful restaurants and a weekend market. We felt safe walking around at any time, but watch where you step. There are lots of dogs in the neighborhood!"
        }, 
        {
            "index": 381, 
            "rating": "4", 
            "review": "Nice neighborhood for the young!. The up side is that it is easy to rent an apartment , walk to a grocery store and restaurants. The downside is that you should be younger than 35. The noise on the street went until 3:30 am. Very cute boutiques aimed at a youthful market."
        }, 
        {
            "index": 382, 
            "rating": "5", 
            "review": "Great area to stay. We stayed at Hotel Fierro in Soler St in Palermo Hollywood\nFelt comfortable and easy walking distance to Subway D\nThe subway is easy to manage and takes you to areas of historic significance such as Casa Rosada and Congresso\nI would recommend staying in this area"
        }, 
        {
            "index": 383, 
            "rating": "4", 
            "review": "Beautiful Neighborhood. Palermo is one of the best spots in BA for shopping and dining. We didn't stay here (we AirBnB'd an apartment in San Telmo) but we did spend at least two days of our trip wandering around its pretty streets."
        }, 
        {
            "index": 384, 
            "rating": "5", 
            "review": "A great way to spend our last day. As 2 couples traveling together we decided to spend our last day (Saturday afternoon before a red-eye flight) walking around Palermo. The vendors were great and the products were fun to look at. We ended up with a painted bar sign and our friends picked up a gorgeous painting! Beware of pigeons! We sat down for lunch and had a flurry of pigeons all around us."
        }, 
        {
            "index": 385, 
            "rating": "4", 
            "review": "Full of stylish bars and restaurants. and therefore unfortunately by far more expensive than the other districts of Buenos Aires. As lots of people enjoy strolling around during nighttime and going from one café to the next, this is quite a safe place. However, everything looks quite uniform."
        }, 
        {
            "index": 386, 
            "rating": "4", 
            "review": "A mixed review. Palermo used to be a nice place with small bars and coffeehouses with plenty of boheme people, university students and professors discussing, reading and smoking in fornt of a cup of good coffee. Since the late 1990s it has been invaded by well-known brands and outlets. The bars and beatiful restaurants are still there and it has an excellent night life."
        }, 
        {
            "index": 387, 
            "rating": "4", 
            "review": "Something for everyone. Picking a district to sleep in such a huge city has a its challenges. I’m glad I called this home base. You walk the streets and feel like you are part of the neighborhood. You don’t see tourist traps, you’ll find something for everyone taste."
        }, 
        {
            "index": 388, 
            "rating": "4", 
            "review": "Great Neighborhood for 4 nights. Palermo is like everything you hear. Understated neighborhood with lots and lots of small boutiques and cafes. No matter what your food choice is, you will find something to your liking in Palermo. I wouldn't want to spend a week in Palermo, but 4 nights was perfect. As nice as Palermo is, make sure you get out to other neighborhoods like San Telmo, Villa Crespo, and Recoleta. Palermo is more taxi friendly than Metro friendly, so budget a little money for taxis to other places in BA. A Subte (metro) stop is available on the edge of Palermo, but after walking all day in other areas we always took a cab back home rather than walk another 12 blocks from the metro."
        }, 
        {
            "index": 389, 
            "rating": "5", 
            "review": "Awesome Buenos Aires!!. I think Palermo is one of the most beautiful city! Its clean , super friendly, very unique , wonderful to walk and see the beautiful buildings and little cafe's , people go out of the way to help you!!Will love to live in a place like this!!!"
        }, 
        {
            "index": 390, 
            "rating": "4", 
            "review": "Ahhhh! to Be Young!. Palermo is fun. It's much more fun if you're young. There are young people everywhere, doing everything. This translate into energy. Palermo is a lively, energetic place with really fun, vibes that just engulfs you. People are friendly, interesting, interested and willing to help you find the \"happenings\". It's difficult to be bored in Palermo. Whether you're grocery shopping, at a laundromat, at the bar, at the salon - just being out in Palermo is a feel good activity!"
        }, 
        {
            "index": 391, 
            "rating": "5", 
            "review": "Palermo Soho or Hollywood - it´s all good!. this is a hip area with great shops, restaurants, bars and just loads of interesting things to catch your eye. From upscale leather for divine riding boots to cool little boutique hotels (like the Faera) there is something for everything."
        }, 
        {
            "index": 392, 
            "rating": "5", 
            "review": "Best neighborhood for younger travelers. This is a very hip neighborhood, favorite in BA. There are lots of the top restaurants in this area. Nightlife is great, many many bars and tango clubs. The shopping is very good here too, lots of little shops that are fun to peak in."
        }, 
        {
            "index": 393, 
            "rating": "3", 
            "review": "Gentrified towards boring. We stayed in Palermo a week and in it's favour it has plenty of shops (boutique), bars and some of the only green space to be found in BA (still has 12 lanes of traffic running through but a good place to jog once you get off the main road & do a few figure 8s). It's very safe at night, well lit, well policed & has good transport links. It's also a bit soulless. Palermo Soho is a poor mans Soho - smacks of trying too hard, Palermo parks is full of city slicker crash pads & dead at the weekends. When you go to San Telmo and see people drinking, dancing, drumming and trading in the streets you realise how lacking in pulse Palermo is."
        }, 
        {
            "index": 394, 
            "rating": "4", 
            "review": "Our favorite. We stayed in Recoleta based on many recommendations but going back we'd stay in Palermo. Much more action and more alive. Recoleta is like the Upper East Side, Palermo is Village/Soho."
        }, 
        {
            "index": 395, 
            "rating": "2", 
            "review": "a bit run down, expensive shops. It's either - or; we were there on a rainy day and believe me, BA and Palermo are not very nice then. The restaurants were pretty empty and the nice shops scattered. We walked up and down various side streets and simply couldn't grow warm. We also observed that whenever something was to our liking, they didn't seem to have our size..."
        }, 
        {
            "index": 396, 
            "rating": "5", 
            "review": "Excellent neighbourhood. We stayed in the area for few days ,great restaurants , safe to walk , easy trasportation , nice houses ."
        }, 
        {
            "index": 397, 
            "rating": "5", 
            "review": "Bohemian area of BA. My Dad and I spent a day walking around Palermo. We walked from the subway station, I believe it was the Plaza Italia and then weaved up the roads into the central parts of Palermo. They center has a beautiful square with restuarants, bars, and artisan market. There´s lot of chic shopping. Cheaper than big shopping in NYC, London, or Paris, but it was all expensive for BA standards. We didn´t buy anythign. but window shopping was fun."
        }, 
        {
            "index": 398, 
            "rating": "5", 
            "review": "one of the best places in BA. Nice shops, bars, pubs and restaurants. Easy to walk around and discover Buenos Aires. very similar like Soho in NY"
        }, 
        {
            "index": 399, 
            "rating": "4", 
            "review": "A \"Mateo\" carriage to ride like royalty..... These parks are beautiful on their own, just to walk around. But if you want to spice it up, rent a Mateo carriage and ride around like royalty..."
        }, 
        {
            "index": 400, 
            "rating": "5", 
            "review": "Trendy, safe city. I felt safe anytime I walked on the street in the subte (subway). Lots of shops and tons of places to see within walking distance."
        }, 
        {
            "index": 401, 
            "rating": "5", 
            "review": "Honeymoon and 1st Anniversary. It was an awesome area to stay at with many restaurants, coffee bars, nightclubs, shopping stores and just a very pleasant and safe area to hang out and relax in."
        }, 
        {
            "index": 402, 
            "rating": "5", 
            "review": "Walking, eating, drinking , shopping. Great place for just walk around. Full of surprises like great Cafes, restaurants , pubs and clubs . Also very good for shopping. On saturday there is a market on Plaza Serrano , which I liked much better then San Telmo market . You can´t miss it"
        }, 
        {
            "index": 403, 
            "rating": "4", 
            "review": "Charming neighborhood. This is one of my fave areas in Buenos Aires. The area is very trendy and is lined by gorgeous cafe, bars, shops and restaurants, creating a bohemian feel of the area."
        }, 
        {
            "index": 404, 
            "rating": "5", 
            "review": "My favorite party of the city!. This area was very cute and calm. I loved the shopping and cafes. Ended up staying the whole day wondering Palermo."
        }, 
        {
            "index": 405, 
            "rating": "4", 
            "review": "Lovely neighborhood. I loved this neighborhood with lots of cafes, restaurants, beautiful people. Friendly environment. Feels like Europe and United States mix with the spanish flair."
        }, 
        {
            "index": 406, 
            "rating": "5", 
            "review": "Palermo is the place to stay when you visit Buenos Aires. We stayed at the great Abode B&B in Palermo. Could not have been a better location.\nJust a great mix of restaurants and shops and low rise housing for residents of Buenos Aires.\nStay in Palermo to get the vibe of Buenos Aires where the up and coming young people live with their families."
        }, 
        {
            "index": 407, 
            "rating": "5", 
            "review": "More tempting then the downtown. We loved walking in the streets and the boutiques were nice. The park Rosedal was wonderful. Since is was Easter, there were people all over, skating, sykling, walking, running and relaxing."
        }, 
        {
            "index": 408, 
            "rating": "4", 
            "review": "Palermo Day/Night. I arrived at my hotel on Gorriti st in Palermo soho.This particular block had no resemblance to soho NY. On one side of the block was a woodworking shop and an open parking lot for cars on the other side was an old supermarket an auto repair shop and an empty lot all within a half a block from a railroad crossing some stray dogs and 1 or 2 homeless.I was assured it was safe and it was ! however it was not a picturesque block. I then went out and about and discovered the area does have a certain charm about it even with all the broken sidewalks.Daytme is quiet and a lot of businesses are closed except for the clothing boutiques and art galleries,most restaurants open later.Nighttime is when soho comes alive with a good choice of bars/restaurants and outdoor cafes.There is a visible police presence,however I did not have any safety concerns but as a tourist I remain alert.Palermo is great at night but I prefer Recoleta In the day."
        }, 
        {
            "index": 409, 
            "rating": "4", 
            "review": "Trendy. Fashion, innovation and creativity characterize this renewed neighbourhood that has turned into an avant-garde design mecca.Visit its different sections to get a full picture. Your shopping time will be guaranteed."
        }, 
        {
            "index": 410, 
            "rating": "5", 
            "review": "The place to visit!. Palermo is adorned with boutique designer stores, hair salons and the best coffee shops / restaurants. Perfect for wandering around and enjoying Buenos Aires life. Much more upmarket than other areas."
        }, 
        {
            "index": 411, 
            "rating": "4", 
            "review": "The largest green spot in BA. Although threatened by many people eager to built buildings, this large park designed by Carlos Thays in 1920, is one of the most beautiful places in BA. It holds a lake, a golf course, a large Tennis Stadium and many places just to sit down and relax."
        }, 
        {
            "index": 412, 
            "rating": "4", 
            "review": "nice area. We stayed at Palermo and we were really pleased.The place offers nice hotels,restaurants,shops and places to visit."
        }, 
        {
            "index": 413, 
            "rating": "5", 
            "review": "Eating and Drinking. Amazing area to go for a night out, so many restaurants and bars to choose from. Keep in mind that a lot of the locals will not go out for dinner until 9-10pm (restaurants don't usually open until 8pm) and if you go to a club they don't start getting good until 12pm onwards."
        }, 
        {
            "index": 414, 
            "rating": "4", 
            "review": "The Place to Go. Palermo is the hippest neighborhjood in the city and we quickly saw why that is the case. the architecture is nice but it is much more the cafes and bars and restaurants spread throughout the city that make it so special. Had a great meal out and then went for drinks at a cheap but cool spot. Lots of life during the day and night"
        }, 
        {
            "index": 415, 
            "rating": "5", 
            "review": "Lively Atmosphere, Lots of Fun. A meandering maze of restaurants, bars, and shops. Full of gorgeous scenery and gorgeous people. One of my favorite places."
        }, 
        {
            "index": 416, 
            "rating": "4", 
            "review": "Trip to Buenos Aires. We just spent 12 days in Buenos Aires and rented an apartment in Palermo for an excellent price. Palermo was a nice place to be; good neighboorhood restaurants, a large supermarket, the metro all very close, close to nice parks and a little quieter than the center of Buenos Aires."
        }, 
        {
            "index": 417, 
            "rating": "4", 
            "review": "Trendy. Our hotel was in this part of town, so we did a lot of focusing on this area during our evenings. There are so many great restaurants and shops. We found this location quite nice for starting each one of our ventures to see other areas of Buenos Aires. It would be a hard decision to decide where to spend your nights, but we always found so much activity and so many amazing stops in this area. A young and hip place to be at night."
        }, 
        {
            "index": 418, 
            "rating": "4", 
            "review": "Fun and interesting area to stay. We had a loft apartment in Palermo for 4 days and enjoyed being part of this trendy, fashionable area. Lots of great clothes shops and smart restaurants as well as umpteen pizza/snack bars in Plaza Serrano. Sadly the graffiti diminishes the overall experience."
        }, 
        {
            "index": 419, 
            "rating": "5", 
            "review": "Great Neighborhood. Located in easy reach of major attractions. Happening residential neighborhood but with great shopping areas within walking distance. Many great restaurants in the neighborhood. We felt perfectly safe."
        }, 
        {
            "index": 420, 
            "rating": "5", 
            "review": "Beautiful. Very nice Bars and Restaurants. lots of nice shops, wich are open till late. Definetly a place for young and hip people. When you are in Buenos Aires you have to go there. It´s a must do in BA. But be always aware of pickpockets."
        }, 
        {
            "index": 421, 
            "rating": "5", 
            "review": "hip area. liked all the cute shops(young adult clthes…nothing worth buying, but fun to look at) and tons of cute restaurants…good bar scene esp at plaza ... loved outdoor flea market on sunday,,,don't bother with Recoleta's"
        }, 
        {
            "index": 422, 
            "rating": "4", 
            "review": "Busy, humming place. This is a semi-historic, semi-modern with style neighborhood. Many shops, restaurants, bars with street seating. You can hardly go wrong. Also look for chef restaurants like Tegui and \"closed door\" restaurants. These places are for foodies. Menu changes daily and each dish is to die for. All for under $100 with wine. A similar dinner would run 5 - 10 times that in NYC, LA or SF"
        }, 
        {
            "index": 423, 
            "rating": "4", 
            "review": "nice area to shop. We walked there from La Recoleta. It was a busy area with a European feel (which we prefer). Lots of shops restaurants and cafes. Great deals and a safe vibe. Walked down the main Avenida Santa Fe to arrive downtown at Calle Florida which is a traffic free boulevard stretching about 10 blocks until ending at the government buildings. Great combo walking tour."
        }, 
        {
            "index": 424, 
            "rating": "5", 
            "review": "The Best Neighbourhood in Buenos Aires. If you tend to like visiting a new city but can be overwhelmed with the hustle and bustle (like me) you will enjoy staying in Palermo. With the highest number of restaurants, cafes and bars per capita, Palermo neighbourhood offers plenty of dining and drinking options without the crazy crowds and with added peace and quiet from a lack of major traffic. Palermo Hollywood is a little quieter and the bars and restaurants are a little more trendy and upscale, but Palermo Soho has a stronger variety of quaint cafes and many bohemian dining options as well. Both districts have many outdoor dining options, and with the somewhat lazy traffic and wide streets it is comfortable to enjoy a meal or drinks on the patio. If you are able to endure the sweaty metro (subte) or willing to spring for a taxi, staying in Palermo offers a more relaxing experience with easy access to the microcenter if you're looking for a larger tourist crowd (although, majority of great discos and bars are still in Palermo so technically, you never need to leave)."
        }, 
        {
            "index": 425, 
            "rating": "1", 
            "review": "Palermo is looking seedy. I have spent much time in Buenos Aires over the years- nearly a year in total, and this is the first time I've seen Palermo look like crap. It's covered in graffitti, and many stores are closed. I was shocked to see it in such a dirty state of disrepair. The whole place looks worn out."
        }, 
        {
            "index": 426, 
            "rating": "5", 
            "review": "staying in palermo. Vibrant café society where people are still up at 5 in the morning. Bars and café open all night, even an ice cream parlour open at midnight."
        }, 
        {
            "index": 427, 
            "rating": "4", 
            "review": "Greenwich Village meets Barcelona. Trendy, safe but with a little bit of edge, all sorts of shops and huge variety of bars and restaurants. A perfect combination. This is a relatively new up and coming area which can happily fill your days and nights"
        }, 
        {
            "index": 428, 
            "rating": "4", 
            "review": "Great place to walk around. Good restaurants and cafes, tree lined streets, lots of graffiti and be careful when crossing the street, drivers are aggressive and do not wait for pedestrians"
        }, 
        {
            "index": 429, 
            "rating": "5", 
            "review": "Loved this Hippie Market. picked up many unique artisan gifts for back home. Its a taxi ride from most places, but well worth it. tons of places to eat and drink, you can easily spend a day, or just an hour."
        }, 
        {
            "index": 430, 
            "rating": "4", 
            "review": "Soho Palermo - Good Neighborhood. This is a very nice middle class neighborhood. We went there to go to dinner at La Carabara. We went early to walk the shops and see the neighborhood. Lots of cute places and bars to have a drink before dinner."
        }, 
        {
            "index": 431, 
            "rating": "3", 
            "review": "Nice bars restaurants night life. Had an afternoon here and was pleasantly surprised.It has several areas ( squares ) so decide which you prefer beforehand,some are bars some are shops and some are more nightlife,but all are nice"
        }, 
        {
            "index": 432, 
            "rating": "5", 
            "review": "Good fun in this fashion center. We enjoyed strolling on two different days in Palermo. One part, Viejo, is older (of course by its name) and has a bit of the grotty up-and-coming stylish mode about it. The newer part, with Ave Santa Fe running through it is much more brash and commercial. Good place to find something to eat, particularly on the streets around Honduras Street."
        }, 
        {
            "index": 433, 
            "rating": "5", 
            "review": "Palermo Soho/Viejo is THE place. This is a great area to base your stay. There are tons of cute shops and cafes. The atmosphere is hip and relaxed. You can spend a few days exploring and not get bored. For my money, this is the best place in Buenos Aires. Although, avoid Palermo Hollywood, it's too bland and boring there."
        }, 
        {
            "index": 434, 
            "rating": "4", 
            "review": "Great walking day. We enjoyed walking the district, the architecture and peaceful parks. During the day we experienced some of the cafes and the local Argentinean beer and hospitality. Graffiti too much of, and \"poop and scoop\" or the lack of, is a major problem in all parts of BA."
        }, 
        {
            "index": 435, 
            "rating": "4", 
            "review": "Upper class neighbourhood. It has many sections to visit. Many shopping areas, Hard Rock cafe, china town, museums, including Evita museum. Must at least drive around and see the neighbourhood if you don't have time to explore on foot."
        }, 
        {
            "index": 436, 
            "rating": "5", 
            "review": "beautiful. A must see. Beautiful parks including the lovely japanese park. The large open flower sculpture is gorgeous. So many tennis clubs if you partake. Very green area"
        }, 
        {
            "index": 437, 
            "rating": "5", 
            "review": "Green and walkable. Palermo is a very livable part of Buenos Aires. Near to the \"subte\", full of restaurants and boutique hotels, the area reminds me of Paris."
        }, 
        {
            "index": 438, 
            "rating": "4", 
            "review": "Nightlife. If you want to go out at night, this is the place to walk around. There are dozens of restaurants and bars, at all price levels and for any kind of food."
        }, 
        {
            "index": 439, 
            "rating": "5", 
            "review": "Living in Palermo was the right thing for us. We arrived in November 2013 and left in January 2014. Except for 11 days in Patagonia, Palermo became our home away from home. highly commendable neighborhood."
        }, 
        {
            "index": 440, 
            "rating": "5", 
            "review": "Palermo - gentrified. Palermo Soho is the place to be if you are young and want an upmarket but grungy area. This was a poor area which has become gentrified. It is full of little shops, bars, cafes and restaurants. It is well serviced by public transport."
        }, 
        {
            "index": 441, 
            "rating": "4", 
            "review": "A complete neighboorhood. This neighborhood is full of restaurants, bars, discos, fashion clothing stores, flea market, handcraft fair, parks, Japanese Garden and many more.\nIt is good to enjoy the area walking around or using a bike."
        }, 
        {
            "index": 442, 
            "rating": "5", 
            "review": "Cute area!. This is a wonderful area of Buenos Aires. It's more residential, and a little more quiet. It's further away from some attractions, but I suggest staying in that area over staying in El Central."
        }, 
        {
            "index": 443, 
            "rating": "3", 
            "review": "Safe but not too exciting. We stayed in Palermo Soho at an outstanding hotel. However when it came to visiting Palermo we did not come accross anything earth shattering."
        }, 
        {
            "index": 444, 
            "rating": "5", 
            "review": "Nice area. Very charming area. Good shopping and restaurants.Felt much less touristiqe than the San Telmo area promoted by the guidebooks."
        }, 
        {
            "index": 445, 
            "rating": "3", 
            "review": "Why do entire districts qualify as 'attractions'. I've lived in Palermo temporarily for 2 months now - near (Scalabrini and Santa Fe) - So I may be missing something here, but... why do entire districts qualify as 'attractions'? Ok, so you are less likely to get mugged or shot in Palermo than some other places, and it has some good restaurants, bars, and parks, but surely each of those attractions/places should be reviewed individually and deserve individual recognition...What's next? Will we be reviewing entire countries as 'attractions'??In my opinion, Palermo is a nice area of Buenos Aires to live/visit, but it isn't what I would class as an attraction, or landmark, like Machu Picchu, or the Obelisk... its just a nice area of BA where regular and everyday people live and work."
        }, 
        {
            "index": 446, 
            "rating": "2", 
            "review": "Just a grotty concrete jungle!. Smog, cars, stupid people walking in the way ALL THE TIME, nothing but shops and bars and restaurants. Dog poo all over the pavements, air-con dripping everywhere, and graffiti. I don't know why people rave about it so much."
        }, 
        {
            "index": 447, 
            "rating": "5", 
            "review": "Best area for evening drinks with Bohème Flair. The area is called Palermo Soho in reference to NY.Lost of chic clothes shops and bars and restaurants.Best place for a night out!"
        }, 
        {
            "index": 448, 
            "rating": "5", 
            "review": "The cool place to hang out in Buenos Aires. Lots going on in this neighborhood (Palermo Soho and Palermo Hollywood). You can walk for hours to see high end chain shops and artsy local shops, sidewalk cafes, bistros, and chic dining stops. Plus some of the best boutique hotels in the city are here. Close to Aeroparque Airport too. And while you can walk anywhere in the area, it's easy to get a taxi. Have fun, enjoy, but also be aware of your surroundings as petty robbery is not uncommon."
        }, 
        {
            "index": 449, 
            "rating": "5", 
            "review": "Great area. The really great restaurants are here. I have learnt to avoid Puerto Madera after eating a few of the sub-standard restaurants there."
        }, 
        {
            "index": 450, 
            "rating": "5", 
            "review": "Great place to make your home base. Stayed at a rental home on Arevalo Street and walked everywhere - so many great shops and even better restaurants! We were no more than a 20 minute cab ride from every where else we wanted to go. . ."
        }, 
        {
            "index": 451, 
            "rating": "3", 
            "review": "Average. Big city standard area. We weren't particularly impressed that this was a place we needed to see and experience. The area is nice for Buenos Aires but as said previously we wouldn't make a special trip for it."
        }, 
        {
            "index": 452, 
            "rating": "5", 
            "review": "Beautiful Quarter of B.A.. Rented a great apartment and wandered around the up-and-coming residential areas and streets and courtyards filled with lovely cafes, bakeries and stores. Paseo de Rosedal park is gorgeous with its myriad of roses and ponds and birds."
        }, 
        {
            "index": 453, 
            "rating": "4", 
            "review": "Huge neighbourhood. Palermo is one of the biggest neighbourhoods in Buenos Aires, so you should pick a specific area before you get down there. It has shopping areas, parks and much night life. It´s very nice and chances are you´ll spend more than just one day there."
        }, 
        {
            "index": 454, 
            "rating": "5", 
            "review": "Amazing area and people. Palermo is a great area to stay, you could spend your time just there, but why? You are in BA!Use the Subte to explore this amazing city, pocket change will take you to all corners. Rent bikes, use the bike lanes. And did I mention wines for the same you'd spend on your latte at home?Finally you HAVE to hook up with Mariano for free walking tours BA from Teatre Colon daily, highly recommended. (Just remember to tip Oz)"
        }, 
        {
            "index": 455, 
            "rating": "5", 
            "review": "THE neighbourhood in Buenos Aires. If you go to Buenos Aires and don't have much time to go everywhere, make sure you take time to visit the Palermo Barrio. Great streets, great shops, clean, safe and pleasant to walk around in..."
        }, 
        {
            "index": 456, 
            "rating": "4", 
            "review": "Late but comparable review. We stayed in Palermo Hollywood for one months in a lovely apartment(loft) in October/November 2012, we enjoyed the area with fine restaurants, fast food and the famous Santa Fe street with many shops and the supermarket Koto. Many buses are nearby to take you anywhere also the subte is available. The zoo is in the area also many parks and gardens are close. This year 2013 we hired an apartment at micro center very close to the obelisk, at September/October for one month. Although we enjoyed our stay at Palermo last year but from our new experience this year we recommend staying in Micro center for one more important reason which is to save many bus trips ( although bus fare is not expensive at all but bus trips are time and effort consuming) . We loved Palermo and we loved more Micro Center."
        }, 
        {
            "index": 457, 
            "rating": "4", 
            "review": "Nice part of the city. That´s where we the nicest neighborhoods of Buenos Aires are. In between Palermo and Recoleta you will find lots of green areas and nice residences and interesting stores.It´s very different from the central part and we found excellent restaurants and coffee shops.A little overpriced if you choose to stay there."
        }, 
        {
            "index": 458, 
            "rating": "5", 
            "review": "Fun and Vibrant Neighbourhood. A fun and vibrant, young vibe. We spent an afternoon and evening here. There were a few hidden gems where we got a bargain but for the most part, many shops were out of our price range. Still a great day of shopping or window shopping. Many great restaurants and cafes. Check out plaza Serano. The area really comes alive at night. A fun place for dinner and drinks."
        }, 
        {
            "index": 459, 
            "rating": "4", 
            "review": "Fun way to spend an afternoon. We're staying downtown and took the green line to Plaza Italia. Stay in bed till midday and take your time... we arrived in the market area around 3 pm and saw people messing about with market tables - we thought they were packing up - as it turns out, just setting up! The restaurants at Plaza Serrano are quite possibly very good - god knows they're popular. If you eat two or three blocks away, staff will coddle you and the prices are waaay better (see review of Magdalena's) - Anyway - lots of chic shops, many gorgeous art nouveau buildings, diabolical footpaths but that just proves you're in BA. Really nice way to spend a crisp, sunny, winter's afternoon. And remember - the metro is only $2.50 peso per trip - less than US$0.50. Get out there and resist the urge of the concierge to taxi everywhere...."
        }, 
        {
            "index": 460, 
            "rating": "3", 
            "review": "Convenient Access to Transportation. I stayed in Palermo for 5 days. It has easy access to the Subte (metro), buses, and taxis. Plenty of places to eat and even groceries stores in the event want to cook at your place. I found the convenience of buying at Cotto Supermarket, especially junk food and breakfast items. There is also a Claro cell company for your cellular needs in the event you carry your unlock phone with you. There is a bank and plenty of stores to shop. What really threw me off was the condition of the sidewalks and the general appearance of the place. Most of the sidewalks are cracked, there is trash and graffiti everywhere. Do not understand why the government makes the owners of the business clean their store front and have someone clean up the cracked sidewalks. It is suicidal for females to walk on high heels. In regards to the graffiti I was told by the taxi driver that the graffiti was due the free expression that most Argentinians enjoy today as oppose to the times when Argentinians were suppressed to congregated and stand in the corners to smoke a cigarette. I do not really know what are the causes to this problem, nevertheless the graffiti , the trash and the cracked sidewalks are there to stay."
        }, 
        {
            "index": 461, 
            "rating": "4", 
            "review": "One of the better neighborhoods in Buenos Aires for tourists. Palermo has several different sections (Soho, Viejo, Hollywood, etc.). Collectively these neighborhoods are know as Palermo. Most foreign tourists would do better to stay in Palermo than downtown or in another part of Buenos Aires. The streets are generally safer, and there is generally more that can be done without taking a taxi (e.g., shopping, eating, etc.). Be forewarned, however, that the sidewalks in Palermo, as in the rest of Buenos Aires, are a crumbling mess, and that trash and graffiti are everywhere. In other words, a stay in Palermo is not like a visit to Miami or London."
        }, 
        {
            "index": 462, 
            "rating": "4", 
            "review": "Some of the Best Shops in the City. When one refers to BA as a city of designers, he is probably referring to Palermo. Boasting some of the best labels and designers in BA, the chic and fashionable Palermo never fails to delight with one-of-a-kind shops, swanky boutiques and great cafes. Some of the city's best-loved designers and most sought-after foreign brands can be found here. So bring you purse and start shopping!"
        }, 
        {
            "index": 463, 
            "rating": "4", 
            "review": "Drink all night party all day... Met some amazing people in this great little spot in BA a little away from the madness of downtown. A great spot to get everywhere you need to. Nothing like having supper at 10 pm and drinking ice cold (cheap) beer all night to shock your senses and really make you feel abroad. All in all met friends for life in Palermo and would recommend it highly as a place to stay."
        }, 
        {
            "index": 464, 
            "rating": "5", 
            "review": "Can't experience BA without visiting Palermo. No trip to BA I complete without visiting Palermo. It would be like going to San Francisco and skipping Fishermans Wharf and New York and missing Times Square. It is colorful and original and works hard to provide a positive experience. Be wary as police are located around the perimeter of the area. Our tour guides made it very clear that we should not return after dark. The shops are interesting and it is simply fun to walk around Palermo."
        }, 
        {
            "index": 465, 
            "rating": "5", 
            "review": "Love Palermo. All the areas of Palermo are quite lovely. Great place just to stroll and enjoy the pretty streets, little houses, great restaurants, shops, cafes, parks, etc."
        }, 
        {
            "index": 466, 
            "rating": "5", 
            "review": "Colourful, interesting, some nice restaurants. Good for people watching, has many trendy shops as well as some cheaper ones. There is a small market square with lots of interesting souvenirs and artisan items. Good for browsing and just enjoying a nice day. Lots of bars, cafes a very live.y and colourful place. Some of the more popular Buenos Aires restaurants are to be found there too. It would be a real shame to miss this lovely Neighbourhood. Seems like a b.? Yuppie place"
        }, 
        {
            "index": 467, 
            "rating": "5", 
            "review": "Best night time neighbourhood in BA. Palermo is the best neighbourhood for both night time partying / dinner with friends and also during the day to do some shopping. Excellent neighbourhood. Very well done and classy finish. Definitely get yourself there during your stay in BA."
        }, 
        {
            "index": 468, 
            "rating": "3", 
            "review": "nice shopping aerea. not to crowded and good lifestyle shops around trendy shops aswell, nice shopping atmosphere. dont forget to deal...."
        }, 
        {
            "index": 469, 
            "rating": "5", 
            "review": "Great neighborhood. Palermo is a lovely area with lots of cafes, restaurants and little shops. Nice parks and enough security to make it a safe and clean place to wander and enjoy."
        }, 
        {
            "index": 470, 
            "rating": "5", 
            "review": "Great place to go shopping.... And a great place to stay and eat and walk around...If you ask, there is a section of Palermo that has outlet shopping. Everything is a lot more expensive than you would imagine but there are deals. Look for the Argentinian brands as imports are heavily taxed. Great night life and also great to walk around during the daytime. Cafes and lots to do and see. People watch. Walkable from Downtown but best take the subway. Easy and efficient and cheap."
        }, 
        {
            "index": 471, 
            "rating": "5", 
            "review": "The friendliest, greenest and best area of the city.. Wonderful area. Perfect for wondering about in and getting a sense of 'true' Buenos Aires. The are some lovely restaurants, bars and shops centred around the two plazas in Palermo Soho and some excellent restaurants can be found on the first 3 streets of Palermo Hollywood from Humboldt up."
        }, 
        {
            "index": 472, 
            "rating": "4", 
            "review": "The leafy barrio!. Love Palermo and all of it's areas! There are lots of good restaurants, weekend markets, and shops in the various parts of Palermo. The green space really sets Palermo apart, though, and that's what's best and most enjoyed about this part of the city."
        }, 
        {
            "index": 473, 
            "rating": "5", 
            "review": "Great hood. I loved wandering the streets of Palermo with funky stores and nice places to eat and drink and just watch the people stroll by. Nice area to stay in compared to other parts of city."
        }, 
        {
            "index": 474, 
            "rating": "5", 
            "review": "wonderful walking neighborhood. cafes good restaurants, friendly people and we saw a free concert in the park. had a cafe after dinner in very romantic setting."
        }, 
        {
            "index": 475, 
            "rating": "4", 
            "review": "Nice huge neighbourhood. Palmero is a huge neighbourhood broken up into several sub districts. It has a very nice vibe to it with plenty of shopping and dining options. One of the great features are the splendid large parks including the botanical gardens (free entry). The zoo is also in palmero and the entry fee is about US/AUS $10."
        }, 
        {
            "index": 476, 
            "rating": "5", 
            "review": "Creativity Abounds.. Palermo is a fabulous feast of creativity... including funky fashion, delicious food and sultry tango. Great for shopping, eating and dancing."
        }, 
        {
            "index": 477, 
            "rating": "3", 
            "review": "Very nice and special area for a walk and coffee break. When you visit this area be sure it is a time shops will be open and had people around. Very nice area and the houses architecture reminds you the villages of Spain"
        }, 
        {
            "index": 478, 
            "rating": "4", 
            "review": "Cool area of Buenos Aires, lots of activities and restaurants. It is a very good location to stay as a tourist on your visit to Buenos Aires.\nPalermo has a lot of the traditional aspects of BsAs that you want to see, mixed with a lot of restaurants, walking areas, parks, shopping.\nDon´t miss Plaza Serrano for a special cultural experience"
        }, 
        {
            "index": 479, 
            "rating": "5", 
            "review": "Las Heras Park on a Sunday. the park was filled with people juggling, sunbathing, palyin guitars, picnicing -- mostly in their twenties. A great palce to meet locals."
        }, 
        {
            "index": 480, 
            "rating": "4", 
            "review": "Trendy district bars and restaurants, shops and design. Formerly a quiet 1900s residential district, home of author Jorge Luis Borges, it is now a vibrant district open 24/7, with bars, restaurants and trendy design shops. Close to Santa Fe Avenue worth visiting in the evenings and weekends."
        }, 
        {
            "index": 481, 
            "rating": "4", 
            "review": "Great area. This area of the city has so much to do, so many shops, and food. I found this area of the city to be very new york like and the people are so friendly."
        }, 
        {
            "index": 482, 
            "rating": "5", 
            "review": "Palermo soho keeps the only real soho personality in the world. If you go to London or New York soho's the ambience is already very upscale and nor hip or young any more. Palermo Soho still has that. this neighborhood entails local designers, an inmnse variety of world food, discount shopping, great cafes adn one of the most amazing Graffiti displays in the world. Plaza Julio Cortazar bars and restaurants turn ito a market for the weekend. Restaurants there are excellent recommend Osaka and La cabrera."
        }, 
        {
            "index": 483, 
            "rating": "4", 
            "review": "Best place too shop in BA. Palermo was just the best place to shop in BA. Nice cafees, calm threes and a big variation in shops."
        }, 
        {
            "index": 484, 
            "rating": "4", 
            "review": "Three Weeks in Palermo, Soho.. Safe, fun, great food, trendy,etc... While Recoleta still receives all the referrals Palermo was for us a better representation of what Argentina was really like. Neighborhood bars, trendy resturants, convienent to parks, zoo, and transportation. In three weeks we did not see or hear of any criminal activity. If you get as far as BA don't make the mistake and not go the Iguazu Falls. One word \"breathtaking\". Empanada's where a great snack/meal treat when you tired of the Lomo in the high end eateries. If you haven't been warned Split the portions of meat. Your still likely not to finish it all. We used vrbo to rent our apartment. We were very happy."
        }, 
        {
            "index": 485, 
            "rating": "5", 
            "review": "Where to Live in Buenos Aires for longer than a week. Palermo SohoThe most important decision to make if you are staying for more than a week is where to live. We have been to Buenos Aires four times and each time stayed in different places Congresso, Recoleta, and San Telmo. Each area has a certain charm but the best place we have stayed is Palermo Soho. We rented two different apartments in the areaIt is a suburb away from the heart of Buenos Aires but easily accessible on the D line from the Plaza Italia stop. It is hip, interesting, safe but above all the food is wonderful. I had never had a really good meal in Buenos Aires until I found Palermo. We would go out each lunch and dinner to a different restaurant and were rarely disappointed. Neighbouring Palermo Hollywood has abundant and good restaurants. Our favourite restaurants were Freud and Fahler. The lunch menu (3 courses from 18 pesos) is great. We walked by Don Julio's every day and thought it was another 'meat' place even though the food looked good. By the time we ate there it was the day before we were to leave and we ended up eating the rest of our meals there. Another favourite is Cluny. But there are lots of supermercado if you want to cook your own meal. Eventually we missed foods with spice.What I liked about Palermo was it was quiet compared to Congresso or San Telmo. The streets were tree lined and the houses were interesting to look at. There are lots in nice apartments to rent and most are as trendy as the area. The shopping is good and stocks a lot of local brands. There are lots of artists who set up shop weekends in the Plaza Cortázar. (Well it closed while we were there and protestors (vendors) wanted it reopened).If you like to walk there are lots of areas to explore. At least twice we walked downtown along Avenida Santa Fe."
        }
    ]
}