{
    "category": "Buenos-Aires", 
    "entity": "Museo-Nacional-De-Arte-Decorativo", 
    "avg_rating_stars": 4.383141762452107, 
    "review_count": 261, 
    "rating_stats": {
        "poor": 4, 
        "average": 24, 
        "terrible": 3, 
        "very_good": 89, 
        "excellent": 141
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "It's all about the house(mansion). Great way to see how the wealthy of this great city lived in the past. The opulence and Decor only Dwarfed by the attention payed to the details."
        }, 
        {
            "index": 2, 
            "rating": "3", 
            "review": "Learn how the wealthy lived.... This is a home/mini palace which has been converted into a museum. It would be nice to see more of it staged as it was when the residents were there. Some of the art work seems out of place and not in keeping with the style of the home. Do go to the cafe for lunch or a drink. Inside is just as charming as outside."
        }, 
        {
            "index": 3, 
            "rating": "3", 
            "review": "Interesting for the building, not much else. Interesting for the architecture and some art, but mostly for the building. They have a cafe that is supposed to be quite good but we didn't have a chance to try it."
        }, 
        {
            "index": 4, 
            "rating": "4", 
            "review": "Masters on display. Wonderful to see beautiful art my famous masters. Very little English friendly communication available about the art"
        }, 
        {
            "index": 5, 
            "rating": "3", 
            "review": "Highly Over rated Musuem. A highly overrated museum . It is a mansion built in the early 1900 turned over to the State as the owner could not afford to run it. The English tour was just ok. The guide was sweet and tried but there is nothing to explain except the style of each room. The first floor is the main museum and is made of different rooms decorated in the styles of different eras. Interesting but not anything fantastic. Plus they had some strange exhibit in the middle of these rooms of very modern furniture???? The second floor is only very partially open for viewing and the top floor closed. The basement had a photography exhibit but nothing to do with the mansion! Ok for a 1/2 to hour if you are in the neighborhood and want to spend money on nothing! The cafe outside is nice and the setting is a bit noisy but on a pretty day a nice place for a cup of tea or coffee. Visit the grounds in back they Re pretty and I imagine nice when it was built but very noisy in the middle of the city now!"
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "Fascinating example of art and architecture. I visited the Museo Nacional de Arte Decorativo on the suggestion of one of my hotel concierges and it was a great idea. This museum is housed in the former residence of a prominent Argentinian/Chilean family (the Errazuriz Alvear family). The building was constructed using multiple materials and artisans from Europe and contains the art collection of the family and some really fascinating design choices. The main floor (floor 0 in the Argentinian numeration) contains several large rooms that, when traversed in a clockwise pattern, each is decorated in a style that is the temporal successor of the preceding room. This attention to era and detail is so great that even doors have different patterns on each side, with each side appropriate to the room it faces. The art is very interesting and includes several huge tapestries, many fine pieces from Asia, and even some Rodin and an El Greco painting. It's always fun in a place like this to think about the family and their personal tastes and try to trace threads of that through the different pieces. Outside there's a small cafe, and also a garden around back."
        }, 
        {
            "index": 7, 
            "rating": "4", 
            "review": "go visit now! . There's a great exhibition on a multi functional furniture design contest and there are many interesting proposals! Apart from the fact that the building is beautiful!"
        }, 
        {
            "index": 8, 
            "rating": "5", 
            "review": "Nice. We saved this for the last day. I wanted to see inside of one of the many palaces, decorated as it was when people lived in them. It did not disappoint. $20 pesos admission, $1.34 USD. It was very interesting with original furniture, paintings and sculptures. There are explanations written in English and Spanish. It is free on Tuesdays and you can pay $40 pesos for an English language tour but we did not feel that was necessary. We enjoyed it."
        }, 
        {
            "index": 9, 
            "rating": "4", 
            "review": "It is free on Tuesday afternoons!. And is a former residence of immense style and charm .. stuffed full of treasures. The biggest fireplace ever. And a great cafe, Croque Madame, in its grounds with tables inside and out."
        }, 
        {
            "index": 10, 
            "rating": "4", 
            "review": "a good museum. a good museum it wade with materials imported from france in the 19 thats incredible a reala good museum"
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "Historical mansion.. There are two floors of furnishings and art. Beautiful tapastries a displayed. There is a very nice cafe on the premises."
        }, 
        {
            "index": 12, 
            "rating": "5", 
            "review": "Absolutely stunning. Really enjoyed this magnificent space, what a wonderful collection of arts and antiques. We stayed for lunch at Croque Madame which is in the courtyard and that was absolutely splendid, as well."
        }, 
        {
            "index": 13, 
            "rating": "5", 
            "review": "Beautiful museum. A former mansion now opened to the public view to display its astonishing decoration, art collection and way of life of one of the most wealthy families in Argentina in the 19th century. I just wish all of the rooms were opened to visitation, the female quarters were not available."
        }, 
        {
            "index": 14, 
            "rating": "4", 
            "review": "Nice and small. Very nice and small museum. Good collection: mix of Argentinian and European art. One remark: all personnel speaks wonderfully Spanish."
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "Amazing collection. Right off of Libertador, this museum housed inside an old, stately mansion hosts an incredibly impressive collection of art and furniture. Get lost in the well furnished rooms packed with amazing European and Asian art, marveling at the architecture. Enjoy a cafe and snack outside at the cafe as well!"
        }, 
        {
            "index": 16, 
            "rating": "4", 
            "review": "a design museum. free on Tuesdays, just sneak in an old classic house. Buenos Aires and French style together. Impecable exhibitions."
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "Amazing architecture. Visit the coffee shop first, then check out the museum itself. It's really amazing to think that this was once owned and lived in by a single family. I've been a couple times and loved it each time. Have fun!"
        }, 
        {
            "index": 18, 
            "rating": "4", 
            "review": "Go for the architecture and history. My husband and I attempted to go to this museum and the third time was the charm - check the hours they are open. The history of the mansion is very interesting and the interior is just spectacular. Go for the architecture and the family stories. Great gallery of miniature paintings and the ballroom is just stunning."
        }, 
        {
            "index": 19, 
            "rating": "3", 
            "review": "Fabulous outdoor coffee/brunch spot; bizarre museum. How the very wealthy once lived in Buenos Aires, this family home is now restored to display a paraphernalia of antiques. The real reason to go is the old doorman's house, now a lovely restaurant with garden seating. Sip a glass of wine, drink coffee, and imagine what is what like to be this wealthy. Dogs on leashes are allowed in the garden cafe."
        }, 
        {
            "index": 20, 
            "rating": "5", 
            "review": "A MUST for Buenos Aires. This former mansion is full of treasures and art. The building itself is impressive and the museum is complemented by an excellent outdoor restaurant, \"Croque Madame\"."
        }, 
        {
            "index": 21, 
            "rating": "5", 
            "review": "amazing belle e'poque. realy enjoyed its historal important is about cultures of the city and it is very beautiful do stop in and grab a coffee and there yummy cakes are great for a recharge for your next walk"
        }, 
        {
            "index": 22, 
            "rating": "5", 
            "review": "Gorgeous museum and house . Wow what a mansion. Previously belonging to the Alvear family of Hoyel Alvear Palace distinction , the museum resonating all the beautiful works of art, rooms, and bedrooms of the family is free and spectacular. Be sure to stop outside at the Madame Croque cafe to admire the building and the gardens while enjoying a fabulous cup of cafe and a sumptuous desert."
        }, 
        {
            "index": 23, 
            "rating": "5", 
            "review": "Amazing Art. This mansion is fantastic and should not be missed if you have time. Great architecture and art makes this a great highlight"
        }, 
        {
            "index": 24, 
            "rating": "4", 
            "review": "Worth a Short visit to lovely home....more of an lovely home than a \"museum\".. After many trips to BA, I finally stopped by this mansion/museum. We were only there less than 45 minutes, but the architecture is lovely, and fits in the fabulous Beaux Arts Architecture of the City. Walkable from other local attractions. FREE"
        }, 
        {
            "index": 25, 
            "rating": "4", 
            "review": "Good for 45 mins. Closed on Monday. . I had to come here 3 times. Sunday closed, May Day. Monday Holiday. Tuesdays it opens post 1400 hours. Do keep in mind. It is free. Well kept. Average artifacts. No English. Good for 45 minutes. Bhagwan"
        }, 
        {
            "index": 26, 
            "rating": "4", 
            "review": "Striking Visit. This home of a wealthy BA family was impressive. The architecture reminded me of lovely European homes of the time and it was interesting to think about a moment in the lives of the inhabitants."
        }, 
        {
            "index": 27, 
            "rating": "5", 
            "review": "Amazing Mansion , and well, a museum as well. Hi you there. In a beautiful neighbourhood, along the museums mile, and pretty well connected to, well, everywhere, you have this magnificent mansion to visit. A great museum, not really (maybe it's just me) but the park, the foyer and all rooms in general are great, with the plus of some oriental antiques. A must visit: the restaurant at the entrance. You can sit at the side of a little pool under the shade of the trees when less than two block from noisy Las Heras Avenue and by Libertador. Don't hesitate, just go and visit."
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "Beautiful!. Breathe taking. Lots of very old pieces to view. Staff was helpful even for us English speaking folk. Make sure to check out the hidden tomb in the basement."
        }, 
        {
            "index": 29, 
            "rating": "4", 
            "review": "Beautiful building and garden. The building is so beautiful. The exhibitions are rather small. I love the garden and the cafe in the garden. Definitely should be seen."
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Amazing!. Great place to visit, very interesting. The entrance ticket is very cheap, you have no reason not to go there."
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "Most incredible house/mansion I have ever been in.. Astounding architecture and art! We toured it with my kids, age 10-19 and they enjoyed it. My wife and I enjoyed it even more because we appreciate and understand how incredible the structure is and which artists work was on display."
        }, 
        {
            "index": 32, 
            "rating": "4", 
            "review": "Beautiful \"European\" house / museum. Spent a good 1 - 1.5 hr discovering all the beautiful rooms in this former house of art collecting family Josefina de Alvear and Matías Errázuriz Ortúzar. Reminded me of European museums / old English mansions."
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "fabulous Building and Displays. This is a stunning palace/house from the grand days of Buenos Aires with lovely furniture, paintings and decorative objects. It has great atmosphere. There is a very good shop in the basement."
        }, 
        {
            "index": 34, 
            "rating": "5", 
            "review": "Fascinating Mansion. The family home of the Erazuriz/Avelar family. Sumptuos town house filled with European art but only a home for 12 years. A telling example of how wealthy Buenos Aries was in the early 20th Century. Much more interesting to me than the National Art Museum."
        }, 
        {
            "index": 35, 
            "rating": "5", 
            "review": "Well worth a visit. If you want to see a classic example of how the wealthy lived in B.A. around the early 20th century then I can't think of a better example. I think there is a charge but as we arrived fairly late we were allowed entry for free- nice! I particularly liked the main reception hall, designed in a late Renaissance Spanish style. All the rooms are good but in some more inventive lighting would be appreciated though I guess the idea is to make them look more as they would have years ago (i.e.a bit depressing) Some very good and important works of art on the walls. There is a very pleasant outdoor cafe by the main entrance, great to visit after you leave the house. Highly recommended."
        }, 
        {
            "index": 36, 
            "rating": "4", 
            "review": "Impressive building and good place to spend 1/2 day. This building puts many cathedrals to shame. It has a magnificent organ in the Oval hall, which unfortunately is redundant, although it all seems to be there. There are many galleries - the place is a bit of a maze, but plenty to see. There is a small cafe, and a restaurant, if you have the time & money. It's not particularly well signposted from the castle but worth the walk (20 minutes)."
        }, 
        {
            "index": 37, 
            "rating": "4", 
            "review": "A treasure in a unique town.. Hard to put into words the sights in this lovely museum. Lots to see so plan a two hour trip as a minimum. Wonderful."
        }, 
        {
            "index": 38, 
            "rating": "4", 
            "review": "View into the early 20th C (wealthy) family life. This is a beautiful old mansion with a large collection of household furniture and art pieces owned both by the original family and other local donors. I found it very interesting to see how the wealthy lived - just wish that we could have seen the 2nd floor where the kitchen was and the staff lived."
        }, 
        {
            "index": 39, 
            "rating": "4", 
            "review": "Wonderful example of Argentine Architure. Saw from bus and went back.. Beautiful building, but ere was a demonstration going on, a regular occurrence and couldn't see much more."
        }, 
        {
            "index": 40, 
            "rating": "4", 
            "review": "A former mansion that is a museum now.. Interesting small museum that is placed within an previous mansion. Nice architectural work and an eclectic assortment of art work, furniture etc."
        }, 
        {
            "index": 41, 
            "rating": "4", 
            "review": "Impressive art in splendid mansion. The name is a little misleading. It is a splendid period mansion in which are displayed an eclectic collection of fine art. Interesting, and a good rainy day activity."
        }, 
        {
            "index": 42, 
            "rating": "5", 
            "review": "Amazing. Must see every time I go to buenos Aires\nI recommend this museum\nThey have so many beautiful pieces\nI loved it"
        }, 
        {
            "index": 43, 
            "rating": "5", 
            "review": "Beautiful stately home, and only 20 peso entrance fee. Inexpensive to visit! And lovely inside. Almost all of the family rooms are available for viewing and most have an English description. The items on display are all labelled in Spanish.The great Hall is amazing. The fireplace was supposed to be designed by Rodin (there's a model of what it would have looked like) bur WWI got in the way.There is an unusual feature in the basement, and the description was only in Spanish but it looks like an old tomb with a wooden surrounding. I have no idea what it is. Too bad the description was not in English.Some of the art in the building is amazing, Rodin, Caneletto are two names easily recognized. But the other works by lesser known artists are well worth looking at.The miniatures exhibition is phenomenal. Most of the pictures are of unknown persons, but you will find Catherine II of Russia, Charles I and II of England, Admiral Nelson and Napolean. In one of the bedrooms you will also find Napolean II's death mask.After the visit, take 5 in the cafe on the grounds."
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "Magnificent Marvelous Mouthwatering Museo de Arte Decorativo. Both inside and outside, this is a fantastic building. The interior is wonderful. Every room has a different style and character. Add in lots of stunning fine art, paintings & sculpture and it makes it an all-round amazing experience. It was definitely the most interesting museum that we visited in Buenos Aires. We had a great tour in English - made better as we were the only people on the tour! Our guide (Cecilia) was full of really interesting stories and pointed out lots of hidden little details. The background to the Alvear family who built and lived in the house was intriguing. We got to see how the family lived, entertained and rested in their own mini-palacio. Incredibly. Tours in English are limited so check before you go. You can finish up with a coffee & something nice while sitting outside in the garden."
        }, 
        {
            "index": 45, 
            "rating": "1", 
            "review": "Don't waste your time. Absolutely nothing worth while seeing here. Shame, it is in a popular and attractive spot but has nothing of interest.Looks run down and only semi active."
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "A beautiful Mansion, shows how the Argentinian Upper Class lived at the tuen of the last century.. An Argentinian Downton Abbey. They could make an Argentinian beautiful TV series here and it is just accross from The TV studios."
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "Very nice museum. This mansion was the home of a very wealthy family. You can feel their opulent lifestyle, as well as enjoy the works of art end the architecture."
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "Brilliant. A must see for art lovers. Free entry amazing antique collection over severa l floors, very good with light crowds as it does not seem to be in main tourist list"
        }, 
        {
            "index": 49, 
            "rating": "5", 
            "review": "Very Interesting, Eclectic, Collection of Furnishings and Artwork. Unusually diverse collection of artwork and furnishings. Probably not what you would have initially expected. Colonial family with very expensive taste sold the house and all of its furnishings to the Argentinian government before moving out of the country. The history is very interesting and the tours are more than worth it. Brunch at Croque Madame out front first is an absolute must."
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "Lovely Museum. It's just a few minutes walk from the Museo de Bellas Artes. The Museo Nacional de Arte Decorativo is definitely one of the most beautiful places in BA. The museum is small but the architecture is stunning and it has a Coffee Shop that is a delight."
        }, 
        {
            "index": 51, 
            "rating": "4", 
            "review": "Worth Visiting. Not a big museum fan, however this is a nice museum with a collection that includes many significant impressionist painters. Hard to complain as admission is free, however, very little is described in English."
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "Loved this museum!. There are so many things to do in Palermo, but this one is like stepping back in time and experiencing the grandeur of another era. We got a great English language tour and loved just wandering around the rooms upstairs on our own. See exquisite architecture, furniture, and artwork (including Rodin sculptures, and paintings by Manet, Van Dyk, El Greco and other masters). Plus, a nice lunch at their cafe, Croque Madame(?)."
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "A glimpse back to a magical era and life. Once a private home, the Museo has captured the spirit and style that the Alvear and Errazuriz families lived in a golden era. The best of European and South American experience captured well."
        }, 
        {
            "index": 54, 
            "rating": "5", 
            "review": "Excellent piece of arts. Every time you visit, you will find different paintings on 2nd and 3 floor of the museum, if you are art lover, you can easily spend 1/2 day exploring different paintings. The only challenge is, most of the descriptions are on Spanish and for non-Spanish readers, it's bit difficult to understand the meaning of the paintings."
        }, 
        {
            "index": 55, 
            "rating": "5", 
            "review": "Worth visiting!!!. Worth visiting, and if the day is sunny, I suggest to stay for lunch at the garden of thte museum restaurant."
        }, 
        {
            "index": 56, 
            "rating": "5", 
            "review": "Love it!!. Incredible experience , right 7 minutes from the Recoleta , we love it,!! They have Croq Madame, so we had a wonderful time!!"
        }, 
        {
            "index": 57, 
            "rating": "5", 
            "review": "Nice Museum and Good Exhibitions and Eva!!. Housed in a beautiful old mansion the collection and exhibitions are well worth a visit. A collection of paintings, sculpture and installations that are interesting and provide an enjoyable selection of South American artists that can easily compare with anything from North America or Europe. Well worth it for the Eva state aloneTake time to enjoy a coffee and snack in the cafe, this is the best on offer from the three sites.Have a relaxing break in the beautiful cafe or on the terrace.Buy the three site ticket for A$20 and visit the other local museums. ."
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "Beautiful home turned museum. The decorative arts museum rests largely with the beauty of the home itself and its collection of decorative objects. The house, which was bought by the government in the 1930s, is gobsmacking in its opulence. It was built in the French style in the early 20th century for a wealthy couple and their children. It is stunning. And it has a very cute licensed cafe in the front courtyard - perfect!"
        }, 
        {
            "index": 59, 
            "rating": "5", 
            "review": "This a amazing Mansion!!!. If your have time to do something different you could go and take a coffee at the CROQUE MADAME restaurant on the terasse ."
        }, 
        {
            "index": 60, 
            "rating": "5", 
            "review": "Splendid architecture. This museum certainly deserves a short visit. Paradoxically not really for what is offered on display (although some tapestries are impressive) but certainly for the architecture of the house of for the good explanations it gives about the life of the wealthiest in the beginning of the last century."
        }, 
        {
            "index": 61, 
            "rating": "4", 
            "review": "Beautiful old mansion. This old mansion has many beautiful antiques and pieces of art. We went there on a Wednesday when the admission was free!"
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "an old mansion transformed in a museum. All rooms are different as they were built depending of art pieces installed in.\nthe best way to describe this museum and more for French travellers is : if you enjoy Nissim de Camondo or Jaquemard Andre in Paris, you will enjoy this one"
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "If you know the Frick collection in New York you want to see this Museo. Two years ago we has only time to have lunch at the elegant Croque Madame in the corner of the park where the Museo is. Now we had the possibility to see the house. It is a very nice small museum. A collection of good paintings, tapestries and miniatures. Worth put in your schedule while visiting Buenos Aires."
        }, 
        {
            "index": 64, 
            "rating": "4", 
            "review": "Another vew of how the wealthy lived. Realizing that this is basically the home and collection of one family, and not a national collection, I was able to settle in and enjoy it for what it was. Worth the visit."
        }, 
        {
            "index": 65, 
            "rating": "4", 
            "review": "delightful moment in the busy city. this is a small museum with a delightful collection of decorative arts. The coffee shop is a quite and very pleasant spot to enjoy a coffee or light meal"
        }, 
        {
            "index": 66, 
            "rating": "4", 
            "review": "Lovely Museum. One of the nicest museums with extensive collections. It is not so large that it is overwhelming to do on a morning visit. Easy access from public transportation. Nice collections."
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "One of my most favorite museums. The Museum is just chock full of treasures, a former home that belonged to a very wealthy porteño family in the early days of Buenos Aires . There are also concerts there sometimes and a lovely cafe for lunch or tea."
        }, 
        {
            "index": 68, 
            "rating": "5", 
            "review": "Fantastic Palace. This place give you great idea about life of Buenos Aires rich families from golden years of Argentina. You find everything from original furniture,decoration,beautiful portraits and great architecture. Very impressed"
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "Wonderful museum. Such a beautiful building and exhibits to entrance and delight everyone ... nice and quiet when were were there which is a plus due to craziness of traffic in BA"
        }, 
        {
            "index": 70, 
            "rating": "5", 
            "review": "Rich in history, meticulous in design. What an incredibly preserved tribute to the aristocratic history of Buenos Aires. The museum is a converted mansion of a 20th century elite family and houses some of the greatest European and South American treasurers that we've seen in BA. The tapestries, some 30ft long, are absolutely incredible depictions of biblical stories. Not sure whether there's typical an entrance fee, but we came on a Tuesday and it was free. It's worth a visit!"
        }, 
        {
            "index": 71, 
            "rating": "5", 
            "review": "What a treat!. I really enjoyed this little gem. I am partial to historic homes and period furniture, so I am clearly biased. If this is your thing then don't miss it. Cheap, relatively quick and convenient. When we went a nice little concert was taking place inside as well."
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "Beautiful museum. This museum is situated in a lovely 19th century mansion. In addition to exploring the family's art collection you see how they lived. The art and interior decoration is well worth a visit. They also have special exhibits from time to time."
        }, 
        {
            "index": 73, 
            "rating": "5", 
            "review": "One of the nicest buildings in Buenos AIres. This is an extremely nice Museum. But I adore the little place aside the entrance, called Croque Madame, Incredible desserts, patisserie and meals, Highly reccomended!!!"
        }, 
        {
            "index": 74, 
            "rating": "5", 
            "review": "Magnificent house. Perfect for lovers of interior art and decor.. this house is crammed with collections of every kind. Beautiful pieces, so much to see.... not your usual museum. Take your time to enjoy. Have lunch in the charming courtyard cafe too. We visited on a Tuesday when entry into the house is free."
        }, 
        {
            "index": 75, 
            "rating": "4", 
            "review": "Beautiful building with good cafe in private yard.. Beautiful building. Worth to visit once . There are some nice sculptures and elements of decor inside .But owner did not have too much taste and did mixed a lot of styles together . So,there are many nice furniture and pieces of art inside. But it show mess in head of ex-owner who just put all what she likes in same place. i recommend you to take guide at 14.30 in english language. She was great and very informative !"
        }, 
        {
            "index": 76, 
            "rating": "5", 
            "review": "A wonderful museum? A must see!. A wonderful museum with a fabulous collection of artists. It's also free to the public, which I found to be inspiring. This has to be on your list of things to do when you visit Buenos Aires. Many of the artists are not shown in the US, so you have to visit."
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "Fantastic!. With no previous research I stopped in because it was between Museo Nacional de Bellas Artes and MALBA, and I am so glad I did! This historic french style family mansion contains the original owners exotic art collection kept primarily how they displayed it, including a mid-evil style great room with a model of a great heart by Rodin, feminine parlor and masters study accented by imported oriental pieces, and bedrooms kept as they were when inhabited. In addition donations by a Russian count added more variety to this international display, including a room full of locket portraits. I arrived 15 minutes before the English tour so paid the extra 30ars to the 20ars entry fee. Well worth it, I was the only person on the tour and the guide was amazing, very passionate, knowledgeable and happy to explain references and details."
        }, 
        {
            "index": 78, 
            "rating": "5", 
            "review": "Lovely museum to explore in Buenos Aires. This museum was an unexpectedly intriguing stop during an afternoon spent touring various museums in the city. I wasn’t quite sure what to expect, but decided to stop in after passing by – the museum is housed in a beautiful old mansion. Most of the museum displays the furniture and other decorative arts accumulated by the Errazuriz/Alvear family, which used to own the mansion housing the museum. There isn’t a great deal of information provided to explain the contents of each room, but the collection of unique works generally speaks for itself. I spent a pleasant afternoon wandering through the different rooms and taking everything in. In the basement, there was also an interesting retrospective of the work of a modern Argentine artist. There was also some sort of fashion competition taking place, with dresses on display by several local designers. Visitors to the museum could vote for their favorite work – Project Runway style."
        }, 
        {
            "index": 79, 
            "rating": "4", 
            "review": "It could be Argentina's Downton Abbey .... And it really could be! The ecletic French \"hôtel particulier\" was projected by René Sergent in 1911, as the residence of Josefina de Alvear and Matías Errázuriz Ortúzar, one of the most revered families of the Argentinean-Chilean society of that time. It was the so called \"Belle Époque\" and Buenos Aires was considered the Paris of South América! In 1932, this lovely residence was converted into a museum and has its doors opened to visitors since then. The mansion itself is a real gem! Gracious and full of history. The collection is nice, but since many paintings, sculptures, furnitures and objects were donated to the Museum by different philanthropists, the task of harmonizing so many different items is not an easy one. These items could be much better assembled and exposed, with the help of competent museologists and set designers. As a matter of fact, the collection as actually exposed, although a fantastic one - item by item, looks pretty much like a \"bric-a-brac\" or a flea market exhibition. But, I really enjoyed visiting MNAD, its premises and collection. Special entry fees for retired citizens! One last remark: MNAD is not far from MALBA Museum (at a walking distance) and you can easily combine both visits on the the same day. Enjoy!"
        }, 
        {
            "index": 80, 
            "rating": "4", 
            "review": "A gem not to miss!. This is a terrific place to visit in Buenos Aires. It is a beautifully preserved example of the how the wealthy lived. There are varying exhibits and free concerts on Saturdays as well as a cozy cafe to have lunch or a coffee."
        }, 
        {
            "index": 81, 
            "rating": "4", 
            "review": "Grand house. Is a grand house made into museum. They usually had entrance fees but is free on Tuesdays. Noted that when I was there, they open at 2pm."
        }, 
        {
            "index": 82, 
            "rating": "3", 
            "review": "A good way to spend an hour or so. The most interesting thing about this museum is that it was once a home. There are some cool things to see, like a painting by El Greco and a fireplace sculpted by Rodin, but as decorative arts museums go, this one is just okay."
        }, 
        {
            "index": 83, 
            "rating": "5", 
            "review": "A great discovery. We stumbled on this place purely by accident as we were staying just around the corner. The entry fee was pretty cheap and the place is really worth seeing almost as much for the architecture as the collections it houses. I particularly liked the collection of miniature portraits and the oriental pieces, but it was all pretty impressive. A real gem, would happily go back."
        }, 
        {
            "index": 84, 
            "rating": "4", 
            "review": "BA's Better Homes and Mansions ... The Museo Nacional De Arte Decorativo affords a fascinating glimpse into the lifestyle of the Errázuriz Alvear family at the height of Argentna's reign as the richest society on the planet. The palatial public rooms of the first level were intended to shock and awe visitors, still resplendent in all their petit Versailles elegance. Walking thru the ballroom one can almost hear the orchestra and the swish of gowns as you gaze into the mirrors that allowed porteño high society to bask in the magnificence of their reflection amid the glow of the chandeliers. The welcoming and much simpler Grand Hall offers a welcome respite from all the glitter, reminiscent of the courtyards of a traditional Spanish colonial casa. The upper level rooms are accessed via the Tapestry Gallery that overlooks the Grand Hall and are much more intimate and warm, still quite grand but definitely more home like. The most beautiful of all is the exquisite Sala Art Deco that served as their son's room. This unique room just seems to shimmer and glow, the walls highlighted by stunning J.M. Sert panels and is the only room that reflects the era of the palace's construction. Also noteworthy is the master bedroom and bath with Sr. Errázuriz's diplomatic uniform still hanging in the closet. The only element that is missing are the working areas of the house such as the kitchen, wine cellar and staff quarters, as they would offer a more complete image of life in that era. Free concerts are offered on Sundays in the Grand Hall and the café in the caretakers cottage looked very charming and has outdoor seating as well. The museum also features exhibits of artwork with a very interesting collection of canine bronzes in the ballroom."
        }, 
        {
            "index": 85, 
            "rating": "4", 
            "review": "Don't miss the cafe. If you stop by this museum while in Buenos Aires, make sure to check out the cafe beside the museum. It's a detached cottage that sits on the front corner of the lot and is a great place to stop if you're looking for a cute place to have lunch or a cup of coffee. It also has outdoor seating, which is a great way to enjoy the beautiful architecture of this palace-turned-museum."
        }, 
        {
            "index": 86, 
            "rating": "5", 
            "review": "Charming. Beautifully housed in a former mansion of a powerful family, the museum has a lovely collection which includes a Rodin project for fireplace! The Cafeteria outside the palace is very good."
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "A pleasant day out when combined with lunch + Museo de Arte Latinoamericano. The entrance fee to this museum/historic house is very reasonable and it was fascinating to walk around and see how the very wealthy lived in the early 20thC. World War I resulted in the mansion not being entirely completed to plan; however, the collections from France, East Asia and other parts of the world are beautifully maintained and there are many excellent examples of superb craftsmanship. The tapestries and portraits are also wonderful - I found the portrait of the young child (their daughter?) in blue exquisite. Mrs. Errazúriz died in 1935 and the mansion was bequeathed to the Argentine government. So the National Museum of Decorative Arts was established here in 1937. We combined our visit to the Museo National de Arte Decorativo with the Museo National de Arte Latinoamericano - approximately 15 min walk between the two museums - check opening times as Arte Decorativo opened later on the day we visited. Walking through this very affluent area is interesting in itself eg. lots of dog walkers exercising a range of very pampered pooches! We had planned on having a light lunch at one of the museums but both looked very expensive for what we felt like (a simple sandwich). We walked along the street and found a pleasant little cafe. It would be wise to book at the museum restaurant as it was very busy. A great day out!"
        }, 
        {
            "index": 88, 
            "rating": "5", 
            "review": "Enjoy the visit. Some may say it's too old fashioned, but I did enjoy the sculptures, the rococo rooms and the statues that decorate the pompous mansion which houses the museum."
        }, 
        {
            "index": 89, 
            "rating": "3", 
            "review": "There are more interesting museums to visit in BA.. The building, formally a private home, is absolutely stunning and the collection is over the top, ornate, and beautiful. However, there are plenty of places in Buenos Aires that you can see the splendor of the Porteño upper classes. For me, there are other more interesting and exciting museums to check out if you are only in town for a week or so."
        }, 
        {
            "index": 90, 
            "rating": "4", 
            "review": "French Palace in BA. Unique palace in BA! Super chic and beautiful. Outstanding pieces inside. It used to be a family house and it´s amazing to go inside and imagine how they used to live there. Try to go after lunch so when you end your visit you can have some tea besides the lovely and gorgeous Croque Madame (make sure to make a reservation cause it´s always crowded for tea)."
        }, 
        {
            "index": 91, 
            "rating": "4", 
            "review": "loved the restaurant at the pond. We had a lovely lunch at the restaurant next to the turtle pond. When taking a taxi they drop you right at the gate. The wait staff were prompt and helpful. I could have spent the afternoon there but had too much more to see."
        }, 
        {
            "index": 92, 
            "rating": "5", 
            "review": "Awesome Palace to visit. This fantastic Palace -once a family property of Errázuriz - Alvear shows its permament Oriental collection and other exhibits all year long.\nYou can also have a coffee or even dinner at a beautiful restaurant in the Museum"
        }, 
        {
            "index": 93, 
            "rating": "4", 
            "review": "Best antique tapestries you will ever see!. Beautiful furnishings, a great collection of miniature paintings and a nice cafe to sit and enjoy a tea after a long day of walking around Recoletta. This Muz takes little time to visit and is very close to Belle Artes Muz"
        }, 
        {
            "index": 94, 
            "rating": "3", 
            "review": "Mostly french. We were hoping to see furnishings with and Argentine history. The items are from Agentine but all French in design."
        }, 
        {
            "index": 95, 
            "rating": "4", 
            "review": "Always An Enjoyable Visit. We stopped at the museo yesterday, Tuesday March 17th...... Tuesday admission just happens to be free. I can't count the times over the years that we've enjoyed this \"palace\" and everything in it. The permanent exhibits have NOT changed. And I will not add to the raves and repeat what everyone has said.There are always changing exhibits on the lower level and right now it is calligraphy. Perhaps it will \"push your button\". The gift shop is on this level as well as the banos.There ARE tours.....and we just may take the one in English before we leave on May 4th.The last item I got excited about are concerts on Saturdays....March 21st and March 28....at 7: 30 PM. These are free.....and are classical music....taking place in the Grand Hall.ENJOY. This IS a gem in Buenos Aires."
        }, 
        {
            "index": 96, 
            "rating": "5", 
            "review": "A gem. This is wonderful house turned into a museum of decorative arts. The family collection forms the base, and donors have continued to build. Rather eclectic yet charming. Have a coffee on the grounds."
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "A beautiful building and interesting collection. The grand hall is one of those rooms you dream about with a minstrels gallery on three sides and an enormous fireplace on the fourth. There was a pair of Chi'en Lung vases that I particularly liked."
        }, 
        {
            "index": 98, 
            "rating": "4", 
            "review": "Well worth a visit.. Pleased we took the time to visit this museum. Gives a good idea how life was in a \"palacio\" in this era. Some interesting styles, art and sculptures."
        }, 
        {
            "index": 99, 
            "rating": "4", 
            "review": "See how the wealthy lived. If you enjoy visiting homes of the wealthy, this is a nice one. Built I think in the early 19th century it's in the grand style of a baronial home. Some interesting art and a drop dead gorgeous sculpture at the entrance. Croque Madame, the cafe on the grounds is a fine place for lunch."
        }, 
        {
            "index": 100, 
            "rating": "5", 
            "review": "Free and full of well known artists. This is a terrific free museum for the people of BA. Please note that very little English is written throughout the museum. They do have tours in English, so plan accordingly. Unfortunately, we were not able to connect with the tour but we still enjoyed the art."
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "one of the better Buenos Aires \"palacios\". There aren't too many tourists here because it's not so hyped up by the guidebooks. That's too bad- it's actually one of the most beautiful of Buenos Aires's \"palacios.\" And the onsite outdoor café was a pleasant place to kill an hour... or three."
        }, 
        {
            "index": 102, 
            "rating": "5", 
            "review": "Great guided tour and beautiful architecture. I had a great guided tour during my visit to BA of the pre and post renaissance art, it was a 1 hour guided tour and the guide was fabulous. She was so knowledgeable and it made the tour so interesting...lots of information if you really like art. The museum is also very beautiful...old Parisian bldg...with lots of interestings pieces of art. Do not miss this museum."
        }, 
        {
            "index": 103, 
            "rating": "4", 
            "review": "worth the visit...both for the building and the art. we got there only an hour before it closed, but were still able to see most of everything that interested us. This building was once a private home and one can only marvel at what it must have been like to live there. We truly enjoyed our quick look"
        }, 
        {
            "index": 104, 
            "rating": "5", 
            "review": "An absolute must see!. Take the tour! Our guide was superb! And the insight into the cultural history of BsAs is invaluable! Wonderful!"
        }, 
        {
            "index": 105, 
            "rating": "5", 
            "review": "Great!. This is one of the best museums in Buenos Aires. The rooms are just breathtaking. We forget that Argentina was once a famously rich country (a bit like UK) and this museum shows what it was like to be one of those sumptuously rich families. I would visit this museum on every trip to Buenos Aires. It's inspiring."
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "Fascinating. This is a beautiful mansion,filled with interesting art. It is well worth the visit. We also loved the lunch we had at the cafe on the grounds."
        }, 
        {
            "index": 107, 
            "rating": "5", 
            "review": "Eccentric and Artisitic. This museum has a good location to walk to, for access, and a nice little restaurant in the grounds. Appreciate the hours open and English descriptions. This captures the outrageous wealth of some of it citizens. The architecture is very unusual with some fine paintings too. The place is not huge so you are exhausted after. Highly recommend it."
        }, 
        {
            "index": 108, 
            "rating": "3", 
            "review": "We enjoyed. Interesting architecture, a bit congested, somewhat difficult if you have no Spanish, nice restaurant outside, pleasant quick stop..."
        }, 
        {
            "index": 109, 
            "rating": "5", 
            "review": "lovely small museum. A wonderful museum to visit with beautiful and original furniture and art. Also had a delightful lunch at the restaurant, Croque Madame. The museum is relatively small and there were English explanations in each of the rooms. Lovely way to spend an afternoon."
        }, 
        {
            "index": 110, 
            "rating": "3", 
            "review": "Nice but not great. The museum had a beautiful interior but it was rather small and with little information. It being in the top 10 attractions in BA seems like a joke considering what else this city has to offer. Unless you are an Art Déco fanatic you might as well skip this museum.The best thing in the museum was actually the temporary photography exhibition about child marriage, which was very impressive."
        }, 
        {
            "index": 111, 
            "rating": "3", 
            "review": "Nice museum. We had intended to see the Museo de Bellas Artes that day but it was closed for renovations. Went to De Arte Decorativo as a second plan. Disappointed. There were many beautiful, individual items but the whole was jammed together without theme. I do not read Spanish and most everything was in Spanish only so it was difficult for me."
        }, 
        {
            "index": 112, 
            "rating": "5", 
            "review": "A View on the Past. While strolling in BA. We happened to see this museum and decided to visit. We found it very beautiful and enjoyed it very much. It gives you a clear idea of how the rich and famous lived in BA long ago.The entrance is free and there is a lovely restaurant just outside the museum where you can have lunch or a refreshment.If you have time add it to your do list while in BA."
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "Among the best of its kind. For me, this is the most perfect museum in BA in terms of what it achieves within its terms of reference. I would put it very near the top of the many Museums of Decorative Arts that I have visited elsewhere on my travels. To begin with, it is a beautiful building in a lovely location. It was first established in 1937 in the actual residence of the wealthy family whose gift it was to the nation. The residence had been constructed by French architects 26 years prior making extensive use of European materials: wood, marble, mirrors etc. It has 4 stories beginning with the cellars, then the ground floor, interiorly endowed with many arches and alcoves, that gives access to a charming courtyard, and above is the first floor where the family lived. The latter two stories are crowned externally, facing the street, by a row of large Corinthian pillars crowned by beautifully decorated stucco images of leaves and flowers, surmounted centrally by a handsomely curved pediment and by large cherubs on each side.The uppermost floor was where the servants were accommodated (quite a change from the British social arrangement of “Upstairs and Downstairs”), and this story contains a continuous balustrade to conceal the windows. The Entrance Hall and Antechamber are richly illustrated on their walls by plaster allegories in the Louis XV style, and enclose the stairs to the next floor. The large Great Hall has an intricately decorated ceiling, large chandeliers, parquet floor, large fireplace, and walls draped by tapestries. It is reminiscent of a 16th Cent. baronial hall. Other notable rooms are the Dining room with Carrara marble, modeled on an equivalent room at the Palace of Versailles; the Ball room decorated in Rococo style; and the Winter room that joins the last two. The ground floor is completed by a room for the lady of the house that again shows a Versailles influence, and another for the master that is decorated by red velvet and contains several major paintings as well as a collection of Japanese lacquers.The collection of paintings and sculpture include major works by El Greco, Manet, Fragonard, Corot and Rodin. It is amplified by a large collection of French and Flemish tapestries, many of which are displayed in a first-floor gallery that surrounds the Great Hall, as well as oriental paintings, vases and jades, and porcelain from various countries of East and West. The Museum is the home of the Argentine Academy of Letters, and concerts are sometimes held in the premises. The café in the open courtyard is a refreshing delight in the better weather."
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "Nice, free museum. A very nice treat on a hot day (93 degrees). This museum was a surprise because there were pictures by many famous artists. Be sure to visit the top floor. There is a gallery of amazing photographs. Air conditioning is not consistent."
        }, 
        {
            "index": 115, 
            "rating": "5", 
            "review": "Beautiful!. Elegant mansion beautifully appointed and maintained. Wonderful exhibit show children marrying too young in what was the wine cellar. Not to be missed"
        }, 
        {
            "index": 116, 
            "rating": "3", 
            "review": "Nice.. It's a wonderful old building with a lot of curious, impressing or just old stuff in there ;-)No, for real, it's nice to stroll through this beautiful building, have a glance at paintings, tapestry, china goods and old furniture from different decades."
        }, 
        {
            "index": 117, 
            "rating": "5", 
            "review": "Very nice museum for an afternoon. I found the decorative arts museum to be a departure from most \"city museums\". The building it is housed in is rather incredible and the showcase is very nice as well. The cafe in the old guardhouse is also a wonderful place for a light lunch."
        }, 
        {
            "index": 118, 
            "rating": "4", 
            "review": "A French Mansion in BA. This is actually a mansion that was designed and largely constructed in France, and then shipped to BA in pieces. It is a lovely home with interesting details and some nice European and oriental furnishings. Just don't expect to see anything Argentinian-style (whatever that may be) or with Spanish influence. The minimal signage is in English and Spanish, but I recommend paying the extra 15 pesos for the one hour guided tour. I found the guide to be well informed and able to answer questions. Note: I think some reviewers are confusing this mansion with the Museo de Bellas Artes."
        }, 
        {
            "index": 119, 
            "rating": "5", 
            "review": "Not to be missed. I was first attracted by the exterior in a neighbourhood where many homes are run down, the interior with the original furnishing and paintings is a must . It puts in context the Belle Époque with the wealthy families turned towards old Europe art . There is an ongoing exposition of Goya drawing and of silverware in the XvII c in uruguay"
        }, 
        {
            "index": 120, 
            "rating": "4", 
            "review": "Much better than MALBA. I like this much better than MALBA. I guess its because it contained a lot of impressionist work which I enjoy."
        }, 
        {
            "index": 121, 
            "rating": "4", 
            "review": "Worth a quick visit. Combine this museum with a visit to MALBA as both are only a short walk away. The contrast of the old and new in both architecture and exhibits can be appreciated. Plan to spend a hour at the Museo Nacional and two hours at MALBA for a nice morning or afternoon."
        }, 
        {
            "index": 122, 
            "rating": "4", 
            "review": "worth a visit. great Palazzo of the 19th century in Palermo. The permanent exhibition shows the lifestyle of the original owners. you can´t miss the great hall, with medieval style.\nnice cafeteria in the garden, too."
        }, 
        {
            "index": 123, 
            "rating": "4", 
            "review": "very French style. this museum is in the museums circuit of BA and in one of the finest areas of the city. The Arte Decorativo has a French style, its collection is antique; I didn' particularly like it but I did ejnoy the premises. Highly recommend its restaurant, Madame Croquè. Have a coffee or eat out under the trees. Lovely to have dinner there. Very romantic. Make reservations 'cause you rarely could find any free table..."
        }, 
        {
            "index": 124, 
            "rating": "1", 
            "review": "Not worth your time or money. We waited over 2 hours to go here because it does not open until 12:30. Anyway we went through both floors in 15-20 minuets. Downstairs it looked like a high school art gallery, and upstairs there were some professional paintings. We thought it was going to be more of an old house to tour."
        }, 
        {
            "index": 125, 
            "rating": "4", 
            "review": "Beautiful squared. Beautifully restored old mansionwith a very nice art collection, but worth seeing for the building alone!"
        }, 
        {
            "index": 126, 
            "rating": "4", 
            "review": "Yes .... Some wonderful high notes. A good amount of French art and a large number of superb Rodin collection."
        }, 
        {
            "index": 127, 
            "rating": "4", 
            "review": "Wonderful Palace. The most rewarding part of this visit is the house itself rather than the objects within the house. There are many wonderful pieces of furniture, antiques, and collectibles but the house is most impressive. Better labeling in English would be a help on many items but that didn't detract."
        }, 
        {
            "index": 128, 
            "rating": "5", 
            "review": "Amazing. Itsa nice old hause of a rich famili wich all the Furniture and art collection remain as it was in the Golden years"
        }, 
        {
            "index": 129, 
            "rating": "5", 
            "review": "Great find,. The visit includes the home and all their art collection and furniture, so great package! Well worth a visit."
        }, 
        {
            "index": 130, 
            "rating": "5", 
            "review": "Very interesting peak into the grand life. Very nice, small museum -- the former home of, I believe, a very wealthy Chilean businessman. Gives you a good sense of the grand life. Not crowded when we went. Lovely cafe out front (Croque Madama, I think) -- but very popular for lunch. Must make reservations well in advance. However, was easy to grab a mid-morning coffee during the week, Lots of locals who live in the surrounding upscale neighborhood."
        }, 
        {
            "index": 131, 
            "rating": "3", 
            "review": "A beautiful palace!. The art was very baroque but enjoyable to see. When we were there, there was an exhibit of Renaissance paintings which was nice to see but of course, had already seen in larger quantities in Italy, so nothing new. The name of the museum can be considered rather misleading though. It contains the art (and more) of a very rich household rather than decorative art in general. Moreover, it was only open after 2 p.m. so when we went there in the morning, we were turned back. Good thing our hotel was only 5-10 min. away on foot. The garden restaurant outside looked very quaint and the patrons very chic!"
        }, 
        {
            "index": 132, 
            "rating": "2", 
            "review": "Disappointed!. Rather disappointed! It was like a collection of a family treasure, rather the collection of decorative arts of a nation."
        }, 
        {
            "index": 133, 
            "rating": "4", 
            "review": "Beautiful squared. Beautifully restored old mansionwith a very nice art collection, but worth seeing for the building alone!"
        }, 
        {
            "index": 134, 
            "rating": "4", 
            "review": "Beautifully Restored Mansion Museum. Went to a film costume exhibit which was very good. But the best part was simply wandering through the house itself. Restored to former glory, this old mansion is lovely and worth a visit. The tea house in the entrance courtyard is also nice."
        }, 
        {
            "index": 135, 
            "rating": "5", 
            "review": "a must see. amazing art pieces, guided tours by realy experienced peoplegood conditions of the buildingconsider 2 hours visit"
        }, 
        {
            "index": 136, 
            "rating": "4", 
            "review": "Interesting grand home turned into a Museum. I found this place interesting for a few reasons. 1. The building itself. 2. The collection inside. 3. The fact that it was built by and the home of the same family which built the American Embassy. You can not get into the American Embassy so this is a way of seeing what the inside of the American Embassy is like."
        }, 
        {
            "index": 137, 
            "rating": "4", 
            "review": "Wow, pretty amazing pieces in a beautiful mansion. I love decorative art. The ornateness of this family home and the objects inside were really impressive! When we were there, there was a temporary exhibit of outfits from Argentine movies. Even though not familiar at all with Argentine cinema, I still thought a lot of the costumes were pretty cool. This is not a big museum. We were here maybe an hour, but really enjoyable and a great deal if you go on Tuesdays when admission is free. The restaurant outside, Croque Madame, has good food and reasonably priced lunch specials. It is a good stop for lunch or a snack and coffee and if the weather is nice, it's great to sit outside."
        }, 
        {
            "index": 138, 
            "rating": "5", 
            "review": "Excellent look at an elegant past, and a great courtyard lunch. Small but filled with beautiful pieces from the past. Your imagination can fill in the details of family life many years ago in this setting."
        }, 
        {
            "index": 139, 
            "rating": "4", 
            "review": "Go for the building if nothing else. This place is amazing from an architectural and historical perspective. This house is totally intact, but missing original furnishings. When we went there was a fashion retrospective taking up most of the rooms. It was interesting, but not as interesting as the house itself. Also, the cafe out front is amazing! Best dessert in Buenos Aires."
        }, 
        {
            "index": 140, 
            "rating": "4", 
            "review": "Split decision. I loved it, my husband didn't. If you like decorative art it's spectacular - amazing rooms with beautiful furniture, art and objects (if you don't like decorative art, which my husband learned that day he doesn't, it's kind of a drag.) I loved it. And their cafe should not be missed. You may have to wait for a table. Do it. Wait. Lovely food, perfect setting. We had our first submarino, among other lovely treats."
        }, 
        {
            "index": 141, 
            "rating": "4", 
            "review": "A bit of old Buenos Aires glory. Just like the many mansions one runs across in the great cities of Europe, this is a reminder of what Buenos Aires was at the turn of the 19th century. The museum takes only an hour or so to view, but it is just about the only house of that era (early 1900s) open to the public in Buenos Aires, so it is worth a visit."
        }, 
        {
            "index": 142, 
            "rating": "5", 
            "review": "How aristrocracy used lo live in Buenos Aires!. This \"palace\" used to belong to The Alvear Family, one of the most traditional families in Buenos Aires! Entering this museum is \"living\" their life back those times! I strongly recommend it!"
        }, 
        {
            "index": 143, 
            "rating": "5", 
            "review": "Great Museum. This is a wonderful museum and is well worth the effort to put on your Buenos Aires itinerary. The price for admission (20 pesos) makes it one of the best tourist bargains in the city.Its location in the trendy Palermo neighborhood makes it reasonably easy to find and it is a pleasant walk getting there. It is also not too far from a couple of subway stations including the Bulnes and Agüero stops.The building itself was almost as nice as the museum. We went in about 45 minutes before closing at dusk and were amazed solely by the appearance of the softly-lit entryway. The façade was quite impressive. The café, located in a separate building in front of the museum, looked quite elegant and gave off a warm glow as we approached the museum entrance.We only had a short time to see this museum but we unknowingly played into a wonderful aspect of this place as it is 90% visual. One can wander through and simply appreciate the beauty of the displays and not miss that much by not reading the placards if you are short on time. That is not to say that the write-ups were not informative as the couple that we read were certainly useful and, for example, gave a perspective on the history of the house. But the highlight is what one sees, not what one reads.Housed in a mansion built for an upper class family in the early 1900s, the first level of the museum was quite a grand display with a huge great room in the central area with balconies overlooking the room. The rear area behind the great room had several mannequins on display with elegant clothing from different eras (mostly from the early 20th century it seemed). The second level displayed several rooms in period décor with various beautiful pieces of furniture. There were some notable art works on display as well with the most memorable being an El Greco painting of Christ.Overall, this museum was one of the nicer ones we saw in Buenos Aires. If not for El Zajón, I would have dubbed it the best. It is without question worth taking the time to appreciate the architecture and decorative arts that make this museum special. You can also take the opportunity to enjoy Palermo when visiting this museum in order to make your day even more worthwhile."
        }, 
        {
            "index": 144, 
            "rating": "5", 
            "review": "Fabulous!. During July and August there is a special exhibit featuring dresses and designs of a famous Argentinian designer Horace Lannes. It is a must see! The museum is a former rich person's mansion which is stunning, large, full of priceless art, and has a nice cafe located outside. It's inexpensive to get in and a great way to see how the other half lived. Would highly recommend seeing (despite the fashion exhibit)."
        }, 
        {
            "index": 145, 
            "rating": "5", 
            "review": "We enjoyed this museo. We enjoyed wandering around this museo, lots of interesting art and were genuinely surprised that there was no entrance fee the day we were there.....bonus!"
        }, 
        {
            "index": 146, 
            "rating": "5", 
            "review": "Rodin!. Wonderfully curated museum and Buenos Aires loves Rodin...The Kiss is here in all it's glory. Plus a museum store with interesting finds to take home"
        }, 
        {
            "index": 147, 
            "rating": "4", 
            "review": "Beautiful historic building. This museum is housed in a beautiful and historic building. I actually was far more impressed with the building than with what it contained. The museum is actually a mansion that was designed for Matias Errazuriz and Josepfina de Alvear and was designed by a French architect. I had read that it contained over 4,000 objects, but it didn't seem like that many. However, there were some gorgeous tapestries, very nice paintings and sculpture and some historic pieces of furniture. Additionally, there was some Asian art. This is not a must see - particularly if it is your first visit to BA - but it is worth the visit if you have some time and would like to see a truly lovely building."
        }, 
        {
            "index": 148, 
            "rating": "5", 
            "review": "Beautiful Museum. The National Museum of Decorative Arts is located in a French style private mansion once owned by wealthy families from Spain and Chile. They traveled extensively in Europe in the 20th century and brought back an extensive collection of European and Oriental art. This early 20th century building is filled with sculpture, paintings, furniture, porcelain, and other objects' d'artes. The collection appears in a setting as if the owners of the house departed leaving everything in place. The room decorations are extensive and beautiful adding to the ambience of the museum. Signage throughout the museum is in Spanish and English. An excellent guidebook with descriptions and pictures is available for sale, also bilingual (English and Spanish). For lovers of the decorative arts and familiar with American museums such as the Frick in New York, or Hillwood in Washington, DC, this museum is a lovely way to enjoy a couple of hours surrounded by beauty. A café is located at the entrance to museum to enjoy a coffee with sweets or lunch."
        }, 
        {
            "index": 149, 
            "rating": "5", 
            "review": "See how the wealthy lived. Both the palace and its contents are fabulous. Early 20th century upper crust of BA on full display. Furnishings and artwork brought back from the grand European tour, mostly from France. A much more tasteful \"reproduction\" than say Hearst Castle in CA."
        }, 
        {
            "index": 150, 
            "rating": "5", 
            "review": "Must visit museum.. The former residence of Errazuris Alvear family is an example of great architecture in Buenos Aires. Besides the wonderful collection the Palace's gardens are great and the Resto Croque Madam is a place not to be missed."
        }, 
        {
            "index": 151, 
            "rating": "5", 
            "review": "A must see. In a luxury family residence from Argentina's \"Belle epoque\", an important collection of classic art and furniture...It has also a very nice small restaurant in it's entrance..."
        }, 
        {
            "index": 152, 
            "rating": "5", 
            "review": "So worth it!. 'New world' cities don't always have this kind of building to boast. Built with materials brought from Europe, this mansion turned into a museum is well worth visiting. You will catch a glimpse into aristocratic lifestyle, South American way."
        }, 
        {
            "index": 153, 
            "rating": "4", 
            "review": "Gorgeous. This building, in exquisite french style, was built in the early years of the twentieth century by the Errazuriz family. Now, it had become a museum. You can feel the scent of old times when you enter, imagining wonderful dinner parties and dances....."
        }, 
        {
            "index": 154, 
            "rating": "4", 
            "review": "Worth seeing if you have extra time. We went to lunch in this neighborhood and decided to check out this museum. It is very worthwhile if you are nearby, but not sure if I would make a special trip. It is an old mansion with much of the original art work and furniture. If you are interested in how the 1% lived during the hey day of Argentina you will like it."
        }, 
        {
            "index": 155, 
            "rating": "4", 
            "review": "Take your time and also go to the coffee shop. Museum opens Tue to Sun, 14:00 -19:00, 15$, free on Tue.The mansion is an impressive building and the spanish/english explanations in every room were interesting. I enjoyed the afternoon there and had a nice break at the coffe shop , where you can sit outside under shady trees"
        }, 
        {
            "index": 156, 
            "rating": "5", 
            "review": "Worth the admission. Do not let the decorative art museum moniker detract you from visiting. This is one of the few former palaces occupied by Buenos Aires elite society that is regularly open to the public. We happened to go on the day admission was free but the house is beautiful and grandiose and would be worth the admission price."
        }, 
        {
            "index": 157, 
            "rating": "5", 
            "review": "Absolutely worth the visit. If you are even remotely interested in seeing how the Argentine aristocracy lived, then this is worth a visit. What's special is just how complete and intact all the furniture, artwork, etc. is, so it gives you a good insight as to how they lived many decades ago. Beautiful, museum quality art in a natural setting. Loved it! Wished I could have taken some photos"
        }, 
        {
            "index": 158, 
            "rating": "5", 
            "review": "Beautiful Palace. The visit was tremendously enhanced with the guidance in english (Tuesday to Friday 14:30PM, 15 pesos+admission which is free on teuesday, 2 pesos otherwise). A knowledgeable guide took us through the first floor and it was a real beautiful and interesting experience."
        }, 
        {
            "index": 159, 
            "rating": "5", 
            "review": "Gorgeous museum housed in an incredible aristocratic mansion.. The museum gives a first-class glimpse upon the life style of Buenos Aires richest families a century ago, when this Country was one of the world's richest."
        }, 
        {
            "index": 160, 
            "rating": "5", 
            "review": "European elegance of days gone by. The building itself is worth seeing. It is filled with treasures amassed by a wealthy Spanish family from all parts of the world."
        }, 
        {
            "index": 161, 
            "rating": "2", 
            "review": "Don't Give a Flying Eff. This Museum has a contempt for the visiting public. It can not be bothered to post its closed days on its website or even on its door. It advertised itself as being open, and only after the official opening time posted a paper notice which said it was closed for the day.This is a symptom of an organisation which has no real concern for the visiting public and holds them in contempt."
        }, 
        {
            "index": 162, 
            "rating": "5", 
            "review": "Beautiful Palace. The collection is beautiful, but what is most interesting is the building, owned, in its day by the Alvear-Errázuriz family. There is a copy of Rodin's La porte de l'enfer in the main hall."
        }, 
        {
            "index": 163, 
            "rating": "5", 
            "review": "Amazing palace. The art itself wasn't really our taste. Lots of vases, miniatures, tapestries. But the palace is an incredible building with nice descriptions of the rooms in both Spanish and Engish."
        }, 
        {
            "index": 164, 
            "rating": "5", 
            "review": "Cozy Museum and beautiful inside. I was really impressed with this small museum - very contemporary and beautiful rooms (color and staging of art items) to visit - soothing colors and quite calming as you view the artists' work. Loved the small book store - bought a beautiful journal, hand painted for $10 - a great buy."
        }, 
        {
            "index": 165, 
            "rating": "4", 
            "review": "Worth a visit. I try to visit most museums of interest in my travels so naturally this one was on my visit.Not large in comparison to the museum in Nice but worth the time. There is currently and installation on display by Lililan Porter which I found fascinating .Titled \"Man with Axe and Other Brief Encounters\" this installation is interesting and quite time absorbing.would recommend"
        }, 
        {
            "index": 166, 
            "rating": "5", 
            "review": "Museum visit. Worth a visit not only to view the decorate arts on display, but to admire the beautiful building. An 18th C inspired design for a home for a wealthy city family, the rooms were magnificent, particularly the large reception/ball room."
        }, 
        {
            "index": 167, 
            "rating": "5", 
            "review": "Very impressive museum !!!. An amazing old mansion, with a collection of fine art, relics, paintings, sculptures and several furnishings from the period. There is a nice tea house at the entrance.Visit this museum and you will not regret !!!"
        }, 
        {
            "index": 168, 
            "rating": "5", 
            "review": "Loved it!. A great old mansion, with a fair bit of furniture from the period. Interesting to visit, bring your spanish dictionary with you if you are not fluent."
        }, 
        {
            "index": 169, 
            "rating": "3", 
            "review": "So Sad!. Having my Masters in Decorative Arts I was so excited to visit this Museum. It was disappointing to see a remarkable building with an interesting history lacking the pristine and shining aura that we expect in NY. It is a reflection of the financial situation in Argentine. So Sad!"
        }, 
        {
            "index": 170, 
            "rating": "5", 
            "review": "The house and its art. By combining a great house with art and furnishings, this museum gives you a picture of the affluent set. Just stroll through it. No tour or narration is needed to appreciate the warmth of the surroundings. There is even a tea house next door to fortify yourself before or after."
        }, 
        {
            "index": 171, 
            "rating": "5", 
            "review": "Incredible Wealth!. I'm not a big museum guy, but this was a pretty cool place; at least for an hour or so. I didn't plan to take the tour, but the english tour was starting just as I walked in the museum so why not. It was 15 pesos so @ $2.5 usd. The woman giving the tour was really into this old mansion and the history and boring at times. However, once you stood there for a while and started to imagine what the parties must have been like back then really made it fun! Plus, the architecture was absolutely beautiful. This guy had hidden tours, dumb waiters and cool spiral staircase…..Plus, they have a nice little place to have a bit to eat and a drink or two.If in the area and have an hour or so I would check it out."
        }, 
        {
            "index": 172, 
            "rating": "5", 
            "review": "Relaxing Spot. Lovely building and courtyards where there is a very nice restaurant.Perfect place for a cup of tea and piece of cake or pie in the afternoon, or better still a glass of wine in the sun.It is a little oasis of calm."
        }, 
        {
            "index": 173, 
            "rating": "5", 
            "review": "Gorgeous palace. It was a beautiful museum in a very charming palace. I wish they had headsets to listen to as you walk through the rooms. It would have been nice. definitely worth a visit."
        }, 
        {
            "index": 174, 
            "rating": "4", 
            "review": "former residence of Alvear family. This was a residence of the Alvear family and was designed by a French architect. It has a great hall that is quite medieval. Many beautiful sculptures and east Asian pieces. Be sure to check out the model of the mantelpiece that Rodin designed; but it was never built. Be aware that they have strange hours. We arrived at 1pm but they didn't open until 2pm, but stayed open until 7pm. Closed on Mondays."
        }, 
        {
            "index": 175, 
            "rating": "5", 
            "review": "Picky but Worth IT. Amazing building and art work. I feel like it saved me from ever having to travel to Versailles :). There's some serious luxury in this former palace turned museum. The rooms are really varied, with a huge medieval castle looking ballroom complete with balcony over head, to a masculine arte deco looking bedroom, to a couple of versaillesque living areas. TIP - we went in the morning and it was closed until 2pm so we returned later, that was ok because it was close to our apartment, but would have been annoying otherwise.BOO - they don't let you take pics, AND they don't have postcards (which is usually why no pics are allowed, they are pimping their cards, oh well, my memory will have to suffice)."
        }, 
        {
            "index": 176, 
            "rating": "5", 
            "review": "A big mansion, now a beautiful museum.. The Museum is located at Libertador Avenue and it used to be the residence of a wealthy family that lost their money in the mid thirties and sold the \"house\" to the government who made a museum over there. There are travelling exhibits of all kinds of contemporary art from all over the world. Don't miss it."
        }, 
        {
            "index": 177, 
            "rating": "5", 
            "review": "Really Impressive Building and Collection. The house is worth a visit even before you enjoy the collection inside. Be aware that it doesn't open until 2pm (at least on the Thursday I visited). I suggest you visit the Museo Nacional de Bellas Artes when it opens at 12.30. It's a ten minute walk on the same Avenue Libertador closer to the city. When you have finished there you could lunch Spanish Style at 2pm then walk to this museo.There is a good cafe at the gates if you do get there a little early. The house is most impressive and has interesting sculptures (including Rodin), paintings and furniture. This is the first museum in Buenos AIres that I have found descriptions in English.Make sure that this place is on your list."
        }, 
        {
            "index": 178, 
            "rating": "4", 
            "review": "Beautiful Architecture, Great Restaurant on Site. Check out the home and all its classic art and have lunch with great wine on grounds right after. Check this out on the same day you see the classic art museum and the Recoleta cementery as all 3 are nearby."
        }, 
        {
            "index": 179, 
            "rating": "4", 
            "review": "Incredible to find such a building outside of Europe. Very nice building. From the exterior looks already nice, but without doubt is the interior what amazes most. Really never expected to see such level of \"royal luxury\" in South America. Worth a visit if you are in Buenos Aires!"
        }, 
        {
            "index": 180, 
            "rating": "5", 
            "review": "Great place for a visit!. A great museum where you can also have lunch in their excellent restaurant (Croque Madame) The luxurious house belonged to a rich aristocratic family in Argentina so you can learn how they lived and everything they used to do fo entertainment. There are very valuable tapestries, paintings and sculptures worth seeing. The area is very safe and great to go for a walk!"
        }, 
        {
            "index": 181, 
            "rating": "4", 
            "review": "Interesting. It has an interesting collection. The house is also a work of art. The staff was not so friendly, but it didn't spoil the visit. Some rooms are a bit dark, but all in all, it's well worth the visit."
        }, 
        {
            "index": 182, 
            "rating": "3", 
            "review": "Gorgeous space.... If you love architecture and old homes, this is worth a visit to get a sense of mansions from the era. The actual collection is a mixed bag with few pieces that really stood out. It's cheap though so worth a quick visit if you're in the area."
        }, 
        {
            "index": 183, 
            "rating": "5", 
            "review": "Beautiful. Great beautiful mansion filled with period pieces from the Golden Age. Worth an hour of your time. Small fee and the downside is it does not open until 2:30"
        }, 
        {
            "index": 184, 
            "rating": "5", 
            "review": "Amazing!. You can learn so much about Argentinian culture and heritage in this museum. It is like a trip to the past."
        }, 
        {
            "index": 185, 
            "rating": "4", 
            "review": "THE PALACE AND THE COLLECTION. This was the family palace of a branch of the Errazuriz scion, which in it's time controlled part of the economy in both the sides of the Andes (and probably inspired the D'Anconia character in Ayn Rand`s \"Atlas shrugged\"). It is one of the few remaining family palaces from the \"riche-comme-un-Argentin\" era, and one of the very few that you can really visit, imagining how life was in this enormous aristocratic houses in those crazy days. The museum collection is one of the best in South America, and it houses very interesting temporary expositions."
        }, 
        {
            "index": 186, 
            "rating": "4", 
            "review": "Argentinian opulence at its highest!. I think that this collection is definitely worth visiting. There three paintings oby Sorolla of members of the family that owned this little palace. Do not miss the study by Rodin of the mantelpiece that was never executed due to WWI (it resembles the gates of hell). I truly enjoyed the Greco painting as well. On the negative side: the museum has little light and some of the paintings do now have proper lighting. Pictures are not allowed and there are MANY MANY guards who make sure the rule is followed. To be honest... I really disliked their presence. I wonder why the museum does not put a nice and polite sign at the entrance stating that pictures are not allowed. The fee is entirely reasonable. I loved the coffee shop at the entrance: the food was just Ok but desserts were very good. Thinking about this place... without those guards I would have rated it 5 stars."
        }, 
        {
            "index": 187, 
            "rating": "5", 
            "review": "The Frick of Buenos Aires. I realize this museum will not appeal to everyone, but I loved it. It's a great way to get a glimpse into what life was like in the city long ago. If you like the Frick Museum in New York, you'll like MNAD too. There is not as much art or furniture here, but it's the same idea. I particularly loved the room that was the study for the family's son. Beautiful art deco and oriental style decoration, before either style really hit its stride in terms of popularity. Check out the mural reverse painted on glass over the mirrored fireplace. There is a great temporary exhibition downstairs near the gift shop that opened on July 5, 2013. Lovely contemporary work by Teresa Pereda, who has been getting a lot of attention internationally for her work. Don't miss it."
        }, 
        {
            "index": 188, 
            "rating": "4", 
            "review": "Interesting little museum...Very interesting building that housed it.... Ok, I'll tell you up front that I wasn't impressed with the exhibits here but the building where the museum is located is very interesting. We just walked around and imagined what kind of life the people who lived here had. We spent about an hour walking around the museum and it was a cheap entrance fee so I thought it was worth going to. Also, we ate at the restaurant just across the courtyard from the entrance and it had an extensive menu and both of us thought our entrees were really great. Part of the reason I gave this 4 stars was because they had such a great restaurant attached. A note about the restaurant - there was an hour wait for an outside table at 1 pm on a Sunday. We sat inside but when we left to walk across to the museum there was a huge crowd waiting for a table."
        }, 
        {
            "index": 189, 
            "rating": "5", 
            "review": "My favorite museum in Buenos Aires. Even if you aren't a fan of Decorative Arts museums this is still a must see stop in BA. Former palace of the Alvear family, it houses some of the most amazing furniture and decorative arts items in city. It's less of a museum and more a glimpse into the life of a very wealthy Porteño family. There are some of the most amazing ivory sculptures you've ever seen here as well as bronzes, paintings and pottery. What I love about this place is that it isn't stacked full of display cases, it's more of a house tour and the objects that would have surrounded the owners set-up as if they were just walked away for a moment. The cafe, while a bit pricey, is also quite nice and a lovely place to enjoy a light meal or coffee before visiting the mansion. I really enjoyed this visit and would highly recommend this museum."
        }, 
        {
            "index": 190, 
            "rating": "4", 
            "review": "Depends on your tastes. This is an interesting museum if it's the right period for you. I would actually rate it 3 stars based on my tastes, but not everyone shares them. If you enjoy 18-19th century art, decor (there is a room of ethnic dress as well) then this is your thing! I was surprised by how dark it was, in general. It was free when we went, for which I am glad."
        }, 
        {
            "index": 191, 
            "rating": "5", 
            "review": "Former magnate residence !. It is representative of the wealth of Argentinians of the begining of the XX Century. Mostly European pieces. The restaurant at the garden is OK for a light lunch. You can walk to the LATAM and the Art Museum from this location, a pleasant woody sidewalk, specially if there is not too much traffic."
        }, 
        {
            "index": 192, 
            "rating": "3", 
            "review": "OK. Nice old home. I guess I'm not so into decor. But loved the museum restaurant. Be sure to go to Croc Madame, I think. It's a short walk from MALBA"
        }, 
        {
            "index": 193, 
            "rating": "5", 
            "review": "Beautiful house with private collection. Like the Wallace in London or the Jacquemart Andre in Paris, this is a stunning house with pieces from the private collection of its former owners. A lovely place to visit and a great way to picture what this area of BA must once have been like. The cafe is good too."
        }, 
        {
            "index": 194, 
            "rating": "5", 
            "review": "Loved it. Although not many tourists seem to go there, it is worth the visit. The whole area the museum is located in, is beautiful! The museum itself is amazing and shows the decadence of the early 20th century Buenos Aires. The restaurant on the premisses is nice if you can sit outside! It seemed a favorite spot of Buenos Aires' jetset. The entrance fee is 10 pesos and they open in the afternoon only."
        }, 
        {
            "index": 195, 
            "rating": "4", 
            "review": "Wow!. We didn't plan on visiting this place, so we didn't really know what to expect. Used to be a private residence, but now a museum displaying various collections. Worth a stroll inside to peek at how the rich and famous of Buenos Aires used to live."
        }, 
        {
            "index": 196, 
            "rating": "5", 
            "review": "Wow!. You just wouldn't expect this magnitude of opulence in the heart of Buenos Aires. Beautiful great hall decorated with belgian and french tapestries. Worth a visit."
        }, 
        {
            "index": 197, 
            "rating": "4", 
            "review": "Go after 2pm to see a super collection of miniatures and decorative pieces. The first time we walked here, we arrived at 10am only to find it opens at 2pm. It is within easy walking distance of the Recoleta Cemetery or it could be combined with a visit to the art museum a few blocks away. There is a small entry fee. There is an informative sign in English in each room but naturally most of the information is in Spanish. There is an incredible collection of miniatures and china that I enjoyed. I also liked seeing the furniture. We lucked out on the day of our visit as the artist who does the South American Harry Potter illustrations had a showing in the lower level. Definitely worth a visit and if you arrive too early, have a coffee in the courtyard in front of the museum."
        }, 
        {
            "index": 198, 
            "rating": "4", 
            "review": "Beautiful mansion, with a great coffee shop!. If you are doing a stroll down Avda del Libertador's \"museum mile\", do not skip this museum which is located in a gorgeous French mansion. Adjacent to their entrance is Croque Madame, their coffee shop. Great for a break while doing the mile."
        }, 
        {
            "index": 199, 
            "rating": "5", 
            "review": "A wonderful small museum. And don't miss lunch at the lovely cafe in the courtyard. The opportunity to see the home was a peak into the way the very affluent of BA lived. The artifacts and architecture make this a very special place to enjoy."
        }, 
        {
            "index": 200, 
            "rating": "4", 
            "review": "Worth a visit. Check it's open before travelling but the house is the star and gives a sense of how the elite must have lived. Has an eclectic collection of arts - paintings and sculpture - check out the museum website to get a sense of whether the collection will be of interest."
        }, 
        {
            "index": 201, 
            "rating": "4", 
            "review": "Well-faked stately home. This is a 1928 building, on a medieval-influenced floor plan and with the bedrooms mostly furnished in Louis XVI style. It would be one of many if it were a National Trust property in Britain, but here it's something special.\nSome nice objects on display including a truly glorious deep-relief ivory carving of literal clouds of angels."
        }, 
        {
            "index": 202, 
            "rating": "5", 
            "review": "Beautiful museum at an easy to get to location. The best thing about finding this museum was the walk that I took to find it. The museum is on a long, wide street and quite pleasant. I took many pictures on my way here. The museum itself is in an interesting building."
        }, 
        {
            "index": 203, 
            "rating": "4", 
            "review": "Excellent collection. Make sure that you know when this little museum is open. We showed up at noon and it did not open until 2 pm. Also if you are looking for a meal, there is a nice little place directly across from the museum. Make a reservation, eat, and then go to the museum."
        }, 
        {
            "index": 204, 
            "rating": "3", 
            "review": "Depends on if you like modern art. There are definitely some good pieces of art here, and it does give you a good selection of Latin American art, but there are better more complete collections in the U.S. and Europe"
        }, 
        {
            "index": 205, 
            "rating": "5", 
            "review": "Wonderful old home with interesting collection. It's one of the old mansions of the Alvear family. Easy to appreciate with English and Spanish descriptions."
        }, 
        {
            "index": 206, 
            "rating": "4", 
            "review": "Excellent Art collection. Free visit. Excellent display of art and old history by guide. About one and a half hour tour was a good part of our visit to BA"
        }, 
        {
            "index": 207, 
            "rating": "5", 
            "review": "GREAT stop in Palermo. Loved this place. Pity you can't take pictures but the memories of the beauty will stay locked in my mind. Reminded me of a Paris estate. Just gorgeous."
        }, 
        {
            "index": 208, 
            "rating": "5", 
            "review": "Must see. The name of the place is misleading - it's really a wealthy merchant's home -- but gives a great sense of how the upper class lived in B. A. at the turn of the last century, and some wonderful surprises in the collection."
        }, 
        {
            "index": 209, 
            "rating": "3", 
            "review": "An over the top 1900 house and furnishings. Large house with period furnishings. The best part about the place might be a separate private restaurant in the courtyard."
        }, 
        {
            "index": 210, 
            "rating": "5", 
            "review": "Lovely mansion of the 1920s. It was a lovely tour of a family mansion and history of the era of the 'wealthy days' of BA. Also, there is a gatehouse, the Croque Madame which is a lovely spot for lunch or tea. Very different and tasty dishes and a nice treat after your tour. We went back for a second lunch the next week as enjoyed it so much.The Owens, Toronto, Canada"
        }, 
        {
            "index": 211, 
            "rating": "5", 
            "review": "Wonderful Collection. Beautiful old home full of family treasures. So interesting - beautiful furniture, china, crystal, etc. Well worth a visit."
        }, 
        {
            "index": 212, 
            "rating": "3", 
            "review": "Enjoyable.. This is a smaller museum that is well laid out. Don't miss the outdoor cafe. It has a pleasant setting."
        }, 
        {
            "index": 213, 
            "rating": "4", 
            "review": "interesting place to visit. I didnt like so much the caretakers which were behind me like in a german concentration camp because i didnt see that i am not allowed to take a picture even i used no flash..just because they want to sell there photos .."
        }, 
        {
            "index": 214, 
            "rating": "4", 
            "review": "Another great museum in Bs.As.. Gorgeous private home turned into a museum. Free entry on Tuesdays and afterwards, make sure to enjoy an al fresco lunch at the adorable adjacent cafe on the museum grounds. Another lovely way to spend a cultural afternoon in Bs.As."
        }, 
        {
            "index": 215, 
            "rating": "4", 
            "review": "Not to be missed!. Beautiful house built by a french architect in the early 20th century. Hard to believe it was a house for one family. Fascinating details of the house are still intact such as the lovely preserved inlaid wood floors, original art and tapestries on the walls as well as an interesting collection of chinese art. The original owner collected vases and drawings from the Orient. One room, which appears to be a sitting room, was fully constructed in marble - floors, walls and ceiling. Opulent and luxurious indeed as everything was imported from France and Italy! One disappointing factor was there was no guide at 2:30 when the website said there would be one. Apparently the guide did not show up that day! We had lunch at the french bistro in the courtyard and it was quite nice - croque monsieur!"
        }, 
        {
            "index": 216, 
            "rating": "3", 
            "review": "Okay if you like antiques. The house is great but of course the interior design was old. The restaurant outside, Croque M. was fun"
        }, 
        {
            "index": 217, 
            "rating": "5", 
            "review": "Beautiful old mansion with eclectic collection. I enjoy this museum as much for the architecture of the building as for the collection itself. Nice history to the rooms and the family who lived there. The French guy who designed this building, Rene Sergent, also did the U.S. embassy residence (when both were summer homes of the wealthy in the early 1900s). Wonderful eclectic collection and one room dedicated to miniature portraits which are fascinating to look at-takes you back in time. I've heard it's one of the largest collections of miniatures in South America."
        }, 
        {
            "index": 218, 
            "rating": "5", 
            "review": "Very Unique. I love this museum. I've been a couple of times because the fact that the mansion itself is so well preserved, and itself part of the exhibition, is priceless. An hour well spent inside a beautiful piece of history."
        }, 
        {
            "index": 219, 
            "rating": "1", 
            "review": "stay away. far, far away. Hideously ugly, almost grotesque interior. Would have liked to have met the nut jobs that built this thing. Save yourself the trip and go visit a catholic cathedral, which is basically what this is. We went specifically to see the art deco bedroom on the 2nd fl. The entire 2nd flr was closed that day for some questionable reason, which no one bothered to explain to us when we paid the ridiculous admission fee for what amounts to a 5 minute walk through. We asked for a refund but were refused by a snarky elderly lady, who should be gate keeper in the aforementioned catholic cathedral. So-so cafe. Save your time and money and go have lunch at the Eva Peron Museum."
        }, 
        {
            "index": 220, 
            "rating": "2", 
            "review": "Don't bother. While the price is great...10 pesos. The self-guided tour was not worth our time. Keep walking on Santa Fe and head to the Belles Artes museum instead."
        }, 
        {
            "index": 221, 
            "rating": "5", 
            "review": "Wonderful Museum. Don't miss this one. Have lunch right there and then go it. It's a former private home and it is wonderful. The art, the sculpture, the tapestries are all amazing."
        }, 
        {
            "index": 222, 
            "rating": "3", 
            "review": "Can you spell \"Rococo?!?\". Other than providing another glimpse into the wealth of some early Buenos Aires citizens, there isn't much to this over-blown and fairly tasteless museum."
        }, 
        {
            "index": 223, 
            "rating": "3", 
            "review": "overrated. We went because it was reccomended. It really wasn't worth it. However there was a cafe outside that looked interesting"
        }, 
        {
            "index": 224, 
            "rating": "5", 
            "review": "Great building. Great building, saw very intersting display of Silke ? batik silk hangings. Exceptionnal and in a perfect setting."
        }, 
        {
            "index": 225, 
            "rating": "4", 
            "review": "amazing mansion. great experience to discover the palaces from Buenos Aires inside. also the restaurant bar at the entrance is excellent!!!"
        }, 
        {
            "index": 226, 
            "rating": "5", 
            "review": "Loved it!. The thing that makes this museum stand out is the fact that it is situated in what was once the family home of the Errazuriz family. This gave the visit a personal feel. While you are walking round a Paris inspired mansion, built with all the finest materials from Europe, you are also looking at some of the finest works of art from Europe & the Orient too. The family had money and were big collectors! The great hall is awesome. Instructions were given that it had to be built large enough to hang 3 wonderful tapestries which had been bought before the house was started. The tasteful piped music helps you imagine the great occasions that must have been held in this room. As to the art - there are several statues by Rodin and upstairs in what was one of the bedrooms there is reportedly one of the most important collections of miniatures. In every room there is an English description of what the room was used for and/or go on an excellent guided tour for their very informative insight into the house & the art. We were tempted to list some of the amazing individual items - but say instead ..... go look for yourself - definitely worth a visit"
        }, 
        {
            "index": 227, 
            "rating": "5", 
            "review": "Worth every moment spent here.. This museum is worth a visit. It is situated in a beautiful private home and has some great artwork. Every room in the house is spectacular from the large sized windows to the lovely stair cases. It is not too large and not overwhelming like most museums are. Once you come out of the museum you can check out the really beautiful garden and also have a cup of coffee at the cafe located in the garden."
        }, 
        {
            "index": 228, 
            "rating": "4", 
            "review": "Historical place in the heart of BA. This amazing manor which belonged to the Errázuriz Alvear family is now a stunning museum which exhibits incredible pieces from Argentine artists and artists around the world. It is well located and with easy access from any point in the city. The guides are very experienced in art and have a vast background on it and they are very friendly and willing to answer questions. In the central hall, you can have some coffee and rest while listening to classical music which sets the tone and creates a soothing atmosphere."
        }, 
        {
            "index": 229, 
            "rating": "5", 
            "review": "Beautiful inside and out. Gorgeous Italianate building with a cute courtyard coffee shop attached. Interesting exhibits. Worth checking out!"
        }, 
        {
            "index": 230, 
            "rating": "3", 
            "review": "Ok but not worth more than 30 minute walk through. They are renovating and many display cases are empty or not in place, also no English subtitles to their labels"
        }, 
        {
            "index": 231, 
            "rating": "4", 
            "review": "Beautiful building from the past. Too view religious paintings from centuries past (lighting could be enhanced) with a motor cycle collection in an European classic building is indicative of the eclectic nature of the city.\nThe outdoor cafe is in a beautiful setting and to observe how the local ladies 'do lunch' !"
        }, 
        {
            "index": 232, 
            "rating": "4", 
            "review": "Magic place. The expositions change but the location is magnific.\nThe museum is located in a romantic little french castle in Libertador Avenue.\nCroque Madame is a nice resto inside where you can eat french cuisine!"
        }, 
        {
            "index": 233, 
            "rating": "4", 
            "review": "Not the time to go, most of this museum is closed until Oct 2012. Still had a good time and saw and Italian painting exhibit that was good, but I was sad to not see this house and its collections. The exhibits scale the walls covering up the great architectural details."
        }, 
        {
            "index": 234, 
            "rating": "3", 
            "review": "Great building. This former palace for a rich Chilean-Argentinian family is impressive. Go on a Tuesday as entry is free. Good thing for us as the exhibition from Italy was small and not very interesting. Other times may have better displays so check first"
        }, 
        {
            "index": 235, 
            "rating": "4", 
            "review": "Interesting and small.. Went early (arrived at 11 am) on a Sunday to see the Italian artworks exhibition, which turn out to be a pretty complete and well-organised display. However, it takes you less than 90 minutes to see it all, so it's perfect for those who tend to get overwhelmed on large museums.The rest of this very small museum was nice; but it would not hurt if some areas of the building were freshen up. It is to be noted that by midday, there was a pretty long queue outside, as they limit the number of people allowed in the building, so arrive in the morning."
        }, 
        {
            "index": 236, 
            "rating": "5", 
            "review": "Superb Mini Museum. This was once the private home of a wealthy from the turn of last century. Marble stairs, enormous porte cochere entrance, and great examples of art nouveau, all will delight you on your visit. Definitely a Must-See..."
        }, 
        {
            "index": 237, 
            "rating": "5", 
            "review": "Winning museum with a special Italian exhibition. The MNDA reopened after some renovations which were necessary to enable the opening of this special exhibit ... 600 years of Italian artworks. LOVELYOdd hours ... generally does not open until 2PM ... during school breaks, the museum opens at noon30 pesos entry fee is expected"
        }, 
        {
            "index": 238, 
            "rating": "5", 
            "review": "Beautifully restored mansion. We saw a travelling exhibit of Italian art here. Do the guided tour of the palace if you can. It is well worth it. Absolutely beautiful inside."
        }, 
        {
            "index": 239, 
            "rating": "5", 
            "review": "Wonderful resturant. Inside as well as outside seating. Good service and great food. the decor is very pleasing."
        }, 
        {
            "index": 240, 
            "rating": "5", 
            "review": "Lovely expo. Really worth a visit. When we went they had a 600 years of italian paintings collection that was simply amazing. The museum's architecture is also great."
        }, 
        {
            "index": 241, 
            "rating": "5", 
            "review": "A little gem. Small but very interesting museum in what was a family house with an excellent collection of oriental works of art"
        }, 
        {
            "index": 242, 
            "rating": "4", 
            "review": "Parisian Buenos Aires. Formerly the residence for a great patrician family nowadays host their impressive European art. Frick collection alla argentinean. The palace is a piece of art itself"
        }, 
        {
            "index": 243, 
            "rating": "5", 
            "review": "great great great. I think the crown in all the othe museums in buenos aires a must see it will drive you to the past golden era of buenos aires\ntry the restaurent very nice and the food almost perfect."
        }, 
        {
            "index": 244, 
            "rating": "4", 
            "review": "A nice way to see how the other half used to live. The museum is housed in one of the grand mansions that you will hear alot about on many of the tours. This is one that you can actually get into to see how the other half of Argentine society lived. The house and a great part of the collection belonged to one family and was given to the state. It has largely been kept intact. The woodwork and the floors are outstanding. The collection of decorative arts is modest, but the the numerous tapestries are noteworthy. When you walk into the Great Hall, it just takes your breath away. As a museum director I have seen more than my fair share of decorative arts collection and this one measures up to others-albeit modestly. You have to hunt for the oriental art exhibit and the staff was not particularly helpful in pointing out what there is to see in the museum. There are no wayfinding guides. Since the cost is so low, it is certainly worth a visit.  The museum shop was interesting in that EVERYTHING was in locked cabinets and the shop staff were completely ignoring patrons who walked into the space. One was reading a newspaper and the other had her back to the shop doing some sort of paperwork and did not even look up. It is bad merchandising theory to not have items out for people to pick up and touch. It helps people make the decision to buy. We had pesos and were willing to part with some of them, but the lack of staff attention and the locked cases made our pesos stay in our pockets."
        }, 
        {
            "index": 245, 
            "rating": "2", 
            "review": "Yawn. A collection of objects donated by rich Argentinians with more money than taste or imagination decorate a large rich person's house."
        }, 
        {
            "index": 246, 
            "rating": "4", 
            "review": "Nice peek at a grand porteno mansion. The MNAD is worth a visit if you’re in the Recoleta area. This grand mansion sits just 4 blocks from the MNBA. I liked looking at the Great Hall from the second floor. The floor pattern is just so beautiful. There’s also an oriental art exhibit which you would find beyond the locker corridor (after the gift shop on the ground floor). Worth a look-see as well. No photos allowed inside."
        }, 
        {
            "index": 247, 
            "rating": "5", 
            "review": "A great setting for a nice museum. This house (yes, it was a house once upon a time) belonged to the Errazuriz Alvear family, and as you can imagine, they had a lot of money and good taste to import the materials for the house from France (even the architect was french). The collection is a bit modest if you compare it with another museums, but I believe it is quite worth it to pay a visit and enjoy the atmosphere. The outdoor cafe (Croque Madame) is really fabulous, especially if you visit in a nice sunny day as most of the seating is outside."
        }, 
        {
            "index": 248, 
            "rating": "4", 
            "review": "worth a visit. a great opportunity to peek inside one of the amazing grand old homes of BA. Not all of the house is open for visitors but what is will give an understanding of what life was like for the upper, upper, upper class of the time."
        }, 
        {
            "index": 249, 
            "rating": "5", 
            "review": "Very good museum. Beautiful mansion with lots of elements to see and admire. Great collection, including Rodin sculpture, El Greco, Manet, and Lagos, among others. English tours available on certain days.A nice little cafe also on the property."
        }, 
        {
            "index": 250, 
            "rating": "3", 
            "review": "Great Palace. Once it belonged to a rich family . NOwadays you can see not only the rooms where they lived but also there are important art pieces lice a Goya Painting. There is a nice cafe in the garden"
        }, 
        {
            "index": 251, 
            "rating": "5", 
            "review": "What a House!. The art and artifacts were secondary to the mansion/architecture of the building. Go to see the house and how the rich lived 80+ years ago in a different era of B.A."
        }, 
        {
            "index": 252, 
            "rating": "5", 
            "review": "outstanding building. The building is very representative of <buenos aires at the beginning of the 20 century, and they offer excellent changing vernisages."
        }, 
        {
            "index": 253, 
            "rating": "5", 
            "review": "Mansion housing a museum. Not only a muesum, but an impressive XIXth century mansion, there are many French style mansions in town, this is one of them."
        }, 
        {
            "index": 254, 
            "rating": "4", 
            "review": "A must see on Latin amercian arts. Beautiful, affordable, and not too long. All the rooms are just like in 1800, and tour guides are very good."
        }, 
        {
            "index": 255, 
            "rating": "4", 
            "review": "Very nice. Old private home, you can see how Argentineans lived at the beginning of the XX century"
        }, 
        {
            "index": 256, 
            "rating": "4", 
            "review": "Fantastic and beautiful!. I have seen two classical music concerts held at this venue. It is absolutely stunning inside- old architecture and performances of the highest standard! it is fantastic!\nThere is also a very good restaurant and cafe at this venue!"
        }, 
        {
            "index": 257, 
            "rating": "4", 
            "review": "Lovely Mansion.. This lovely mansion was built in the early 1900's by the French architect Rene Sergent as the home of the Errazuriz Alvear family. Quoting from the brochure: \"The museum's heritage consists of more than 5,000 pieces of art, including tapestries from the 15th to the 18th Centuries, as well as paintings made by El Greco, J.H. Fragonard, E. Boudin, J.B. Corot, E. Manet and sculptures made by P. Chinard, A. Rodin, A. Bourdelle, O. Zadkine and A. Lagos. Furthermore, the museum exhibits a prominent collection of European furniture from the 15th to the 19th Centuries and the most important collection of European miniature portraits conserved in Latin America.\" We also enjoyed champagne and a light snack at the museum's outside cafe which added to this very pleasant experience."
        }, 
        {
            "index": 258, 
            "rating": "5", 
            "review": "Beautiful. I am so glad I went to this museum. It was absolutely amazing inside and out. Since I was alone I did not go to the restaurant in front, but it looked very popular. I would definitively go to this museum while visiting BA!"
        }, 
        {
            "index": 259, 
            "rating": "5", 
            "review": "Truly stunning!. As you walk through the gates and see this huge palace in front of you, you know you will enjoy your time here. The minimal fee for entry is well worth it. Walking through this house really gives you a taste of what Buenos Aires luxury was like, and looking at all the well-preserved artifacts was great also! Right outside the front door, on the grounds, there is a small, very charming cafe! Definitely recommend this place!"
        }, 
        {
            "index": 260, 
            "rating": "5", 
            "review": "The building is the attraction. The attraction of this museum is the building it is housed in; an enormous and well-preserved mansion of the kind middle-class mortals don't usually get to see inside. It's amazing to get to see into the kind of palace you will be passing all the time along the streets of Recoleta. The exhibits themselves are nothing special and are mainly there as furnishings for the house."
        }, 
        {
            "index": 261, 
            "rating": "4", 
            "review": "Worth the admission price just to see the house!. Overview:This is a very elegant home that has been turned into a museum. It has a large collection of antiques on all 3 levels. The upper levels have antique furnature and the like. Many antiques are from all over the world. The bottom level has an odd assortment of antiques - miniature sowing machines, toy ships, pinball machines, etc.The House:It is truely amazing. Large doors, amazing woodwork, etc. It is worth the admission price just to see the home. Just outside in front is a small cafe.My opinion:If you have the time, then be sure to see this museum. It is a little off of the beaten path, but located in La Recoleta."
        }
    ]
}