{
    "category": "Buenos-Aires", 
    "entity": "Parque-3-de-Febrero", 
    "avg_rating_stars": 4.524064171122995, 
    "review_count": 374, 
    "rating_stats": {
        "poor": 1, 
        "average": 26, 
        "terrible": 2, 
        "very_good": 115, 
        "excellent": 230
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "Very pretty park.. The parks of BA are plentiful and well kept for the most part. On weekends lots of families and kids are having fun there."
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "Buzzing with life and excitement. We came here on a sunny Saturday afternoon in September. It seems like the whole of the Argentinian youth was out - really vibrant, fun atmosphere and so much going on."
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "Flowers and green. I go with my dog and walk for a while.\nIt´s very nice, good smell, clean and you can walk or seat and read something.\nIt´s free and you wouldn´t regret going there."
        }, 
        {
            "index": 4, 
            "rating": "5", 
            "review": "Smell the roses, literally!. Had no idea I'd end up spending hours and hours here absorbed by the vibrant red and blooming white roses! Hundreds and thousands of roses! You feel like Alice in Wonderland and can't help but sing in your head: \"We're painting the roses red, we're painting the roses red...\" from the Disney movie."
        }, 
        {
            "index": 5, 
            "rating": "5", 
            "review": "Impressive. Small park but very well mantained. During spring and summer you can see many type of roses from all over the world. The Plaza Andaluza algo its magical."
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "Fun. We went here on San Martin day which is a national holiday so that many museums were closed. We had a lot of fun in the park. We toured the botanical garden, which is free. We toured the Japanese Garden, which cost $70 pesos or roughly $4 USD. It was a lovely garden but the best part was the crepe stand inside the garden. The crepes are rolled up like an ice cream cone. We had salmon, veggies, chicken and for dessert we shared a banana and chocolate crepe. That was amazing!We took a short carriage ride to get an overview of the park and then we rented bicycles. We had some trouble finding them so maybe I can save you some time. If you start at Plaza Italia and walk straight up Avenida Sarmienta, go straight to Avenida Figueroa Alcorta and turn left. There is a truck with lots of bikes, roller blades and multiperson bikes. There is a guy selling food across the road from the bikes. You pay him, you need to leave some kind of ID, and then you get the bikes. $100 pesos for one hour. The road was closed to traffic, not sure if that is everyday or just because it was a holiday. It was mobbed with bikes, rollerblades, dogs, walkers, skateboards. It was crazy and I was sure that someone would crash and we had some close calls but it was an experience. People were everywhere! We had a great day at the park!"
        }, 
        {
            "index": 7, 
            "rating": "4", 
            "review": "Nice walking or bike tour around a lake in a middle of the town. For Walkers,runners , bikking, or just for drinking a mate or have a picnic with a lake view ,bring you a nice time in a middle of a crowded town"
        }, 
        {
            "index": 8, 
            "rating": "5", 
            "review": "Immaculate garden, but this is not the time of year for roses!. The maintenance of the grounds is immaculate however would be better enjoyed with flowers when they are in season - bit sparse otherwise!"
        }, 
        {
            "index": 9, 
            "rating": "5", 
            "review": "A nice park. But closes on a Monday - well at least the rose garden is - the rest is open to the public. Worth visiting"
        }, 
        {
            "index": 10, 
            "rating": "5", 
            "review": "The most wonderful park in Buenos Aires. It´s a beutiful day to spend time with family or friends. The lake is very nice and it´s surrounded by numerous trees of different species. Lots of people jogging, cycling, skating, etc. You can rent some skates or a bicycle up to 6 people and have some fun. The \"Rosedal\" is very nice with some incredible array of roses (best time during Sept/Oct). There are also several places to eat that reopened a few months ago. Highly recommended."
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "Large park. Ver large park. Just when I thought I has seen it all, I stumble upon the loveliest rose park with a quaint little bridge and ducks in the pond."
        }, 
        {
            "index": 12, 
            "rating": "4", 
            "review": "A Beautiful Walk. The best time to visit the Rosedal is the spring, but it's a beautiful place for a walk any time of the year. Wonderful rose beds, and next to a little lake with paddle boat rentals."
        }, 
        {
            "index": 13, 
            "rating": "4", 
            "review": "Beautiful park, very beautiful. It is a beautiful place to relax, walk, alone, with friends or family, missed the Rose Garden, the Andalusian Patio, fountains or paddle in the lake."
        }, 
        {
            "index": 14, 
            "rating": "3", 
            "review": "Pretty gardens in BA. Lovely area with lake and ducks around. Take a walk around the lake, rent a bike or a rent a lake paddling boat. Crowded in weekends but worth it!"
        }, 
        {
            "index": 15, 
            "rating": "1", 
            "review": "Make sure of opening hours. We went to Paseo del Rosedal on a day that it was open according to their website and on Google it also said that it was open.When we got there it was closed and we could not get any information as to why it was closed. Maybe a good idea to get info on any special days of closing.From the outside we could see some of the roses, since would really like to go again and do the tour. Sure it would be great to see!"
        }, 
        {
            "index": 16, 
            "rating": "5", 
            "review": "“A Nice Walk in Family”. It’s the most beautiful park I was ever, I recommend to go with friends or in family. On weekend you can rent roller skates and you can take a look around for all the park. It was I nice experience."
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "Very beautiful!. One of the most beautiful views of Buenos Aires! It has the greenest grass I have ever seen, with several fountains, flowers and big trees. This place is always receiving a special care, as there are people working on it at all times. Make you sure you come here during your stay!"
        }, 
        {
            "index": 18, 
            "rating": "5", 
            "review": "If you like gardens can't miss it.. \"El Paseo del Rosedal\" ( Roses promenade) is inside the \"Bosques de Palermo\" (Palermo Gardens) one of the most beautiful places to visit, walk, rest, and enjoy the nature. The design of the gardens was maken by French experts in the early years of the XX Century. It is a gorgeous place and besides the Roses Promenade is \"El Patio Andaluz\" which is a genuine Spanish spot to seat and relax in the middle of the amazing Gardens."
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "Ideal for couple's evening. The place is very protected, ordered and clean (except 21th september when the students celebrate the begin of the spring). This place is perfect for riding bike, travel in boat, walking or just lay down on the grass watching the lake."
        }, 
        {
            "index": 20, 
            "rating": "4", 
            "review": "Smell the roses. A beautiful park, one of many in Buenos Aires, make sure to check out the bridge that inspired some of Monet's paintings. Worth the visit."
        }, 
        {
            "index": 21, 
            "rating": "5", 
            "review": "Rose's fanatic. For those who love roses , there a lot of species, all named, in a beautiful open garden. And if you ever smelt roses in an open space, this is it!"
        }, 
        {
            "index": 22, 
            "rating": "4", 
            "review": "Late summer morning walk . Roses were still blooming in late March. Our apartment was 15 minute walk from the park. The park is also a great bicycle destination. Rentals nearby. No reason to take a bike tour."
        }, 
        {
            "index": 23, 
            "rating": "4", 
            "review": "Beautiful Gardens. If you are in Palermo I highly recommend stopping by. It is an impressive expanse of flowers and very well maintained with landscaping and statues and fountains."
        }, 
        {
            "index": 24, 
            "rating": "5", 
            "review": "Nice break from city. Just a short walk from our hotel was this nice rose garden and running track filled with colorful local people exercising. Loved the local feel of the place."
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "Beautiful gardens. Beautiful well cared for gardens and a must visit if you are in BA. Cross the bridge and you will find a row of excellent restaurants under the arches"
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "Lovely place for a walk. I found the Rosedal gardens to be beautiful and tranquil; plus anything that has free entry is a winner in my book! As well as hundreds of species of roses, there are other plants to see alongside sculptures, bridges and art installations. Really enjoyed just wandering around; if you're into artsy photos then this is the place for you! Can't imagine it would be much fun in the rain but it was overcast when I went and I still enjoyed it"
        }, 
        {
            "index": 27, 
            "rating": "4", 
            "review": "Very pretty rose garden. The rose garden is a very pretty area to take a walk, have a picnic, and literally stop and smell the roses. Good photos too."
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "Beautiful any time of the year.. I love this park and rose garden. Consider renting a paddle boat and taking your time getting around the lake. There's also a row of great cafes to choose from now if you want to grab a bite to eat. And surprisingly the nightclub Crobar is lurking around the corner, just meters from one of the most beautiful old carousels from the 19th century."
        }, 
        {
            "index": 29, 
            "rating": "4", 
            "review": "Relaxing stroll, roses still in bloom. This was a beautiful park, of course the rose season was wrapping up but we still had a great walk and view... can only imagine what it would like like in full bloom in October."
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Beautiful just beautiful. Even In the middle of fall with not that many rises left in bloom , it was beautiful. I sat first to feed the swans and ducks by the water hen enjoyed some to stop and smell the roses ;)"
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "Very nice promenade . Was not at all expecting it to be so well kept and so beautiful. My 5 year old was asking where are the slides? For ten minutes and then started enjoying he roses and lakes. Perfect for a romantic walk."
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "Sweet!. It's a beautiful place to take good pictures. The roses are very manicured, and you can see a huge sort of colors. If you are a couple, it's very romantic, too (sad I was single when I visited) :-("
        }, 
        {
            "index": 33, 
            "rating": "3", 
            "review": "Nothing special. Tourism B.A organise a walking tour here Wednesday's at 3pm.Its not worth the trip out here unfortunately.There is no wow factor here"
        }, 
        {
            "index": 34, 
            "rating": "5", 
            "review": "DON'T MISS this classic, beauty. It really is one of the great classic downtown parks of the world. If you want to see porteño (buenos aires resident) outdoor culture, show up on a Sunday afternoon.PROs: beauty everywhere, sculptures galore, late Oct/Nov the park is exploding with roses, on WEEKENDS it's overflowing with strolling families and people showing off their athletic prowess on the paved ring outside the lakes and rose garden areaCONs: closed on Mondays and national holidays (there are 18 of them), \"Don't step on the grass!\" being yelled or whistles blowing by the grounds keepers"
        }, 
        {
            "index": 35, 
            "rating": "3", 
            "review": "Ok in Fall too!. I enjoyed a walk through the rose gardens and park as the weather is now turning to fall . Still plenty of blooms. And it's pretty and manicured . Worth a stop anytime"
        }, 
        {
            "index": 36, 
            "rating": "4", 
            "review": "One of the most beautiful parks in the city. What a beautiful park, with a nice rose garden with plenty of beautiful colors. , 2 smaller lagunas with big ducks. Park closes at 5pm"
        }, 
        {
            "index": 37, 
            "rating": "3", 
            "review": "Rosedal nothing more. The Rosedal is a nice plaza with gardens and roses. It is a nice small park, dont expect for too much. There is a small laguna in it with some duck and swans. You can spend 2-3 hr max. After that your kids will get bored. For older people it will be nice."
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "Must go. If you're in Buenos Aires in the spring you should go there. And in other times of the year ... also. Just wait for a sunny day and go there and enjoy a very very nice garden in the centre of the city."
        }, 
        {
            "index": 39, 
            "rating": "4", 
            "review": "Nice walking. If you look for a nice Sunday morning walk , no doubt this is a good one.!You will see a variety of roses , bushes, trees and one of the two Palermo lakes.Afterwards on the way to the second lake, then to \"Hipódromo Argentino de Palermo\" , take a look of the \"World Polo Cathedral\" over Del Libertador Ave."
        }, 
        {
            "index": 40, 
            "rating": "5", 
            "review": "Very special park!. Rosedal is a very beautiful place. You can walk in the middle of the different flowers garden and appreciate them. But the most charming for me was ride in a bici boat in the small lake. View is simply wonderful and while you are there, ducks get close to you to ask for food :)."
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "Don't go on week ends. Is a part of the Palermo park.- There are exotic examples of roses, plus lakes, bridges and an andalusian yard that is wonderful.- If you go with children you can rent a pedal boat.-"
        }, 
        {
            "index": 42, 
            "rating": "5", 
            "review": "Great Afternoon. This place is great, you can take a boat for an hour, watch the roses, and admire all the place, looks like untouched from 1930."
        }, 
        {
            "index": 43, 
            "rating": "4", 
            "review": "excellent walk. Really nice walk during the day time found it relaxing and very pretty well worth a stop off to have a walk through"
        }, 
        {
            "index": 44, 
            "rating": "2", 
            "review": "inexplicably closed on a Saturday afternoon. made special effort to get here only to be told by toilet attendant thar the garden was closed. it was raining but since when should that stop a visit to a garden?"
        }, 
        {
            "index": 45, 
            "rating": "5", 
            "review": "Nice place. I went there in 2013 with my mom.It was so nice to walk there and see those beautiful flowers.This place is really beautiful."
        }, 
        {
            "index": 46, 
            "rating": "3", 
            "review": "A good walk on a sunny Day . I very nice and pretty garden. The Roses are very beautiful and varied. You are not allowed to sit or walk on the grass. But it is a lovely place to walk and stroll through the garden with someone special or friends. The weather was lovely and this made the day."
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "Beautifull afternoon walk. My favourite afternoon plan. It is walking distance for me, so it is always a pleasure going there for afternoon playdate. The roses are all open and smelly, so tall it looks like a laberynth. I love just sitting in there while my son plays in a nice clean garden."
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "Pretty garden.. We walked the garden on a tranquil Sunday. It was beautiful with lots of things in bloom even though it was fall."
        }, 
        {
            "index": 49, 
            "rating": "5", 
            "review": "Very nice. Really nice variety of roses leading to the Bosques de Palermo Park.\nA peaceful place in Buenos Aires just a few minutes from the Aeroparque airport.\nDefinitely worth a visit."
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "Beautiful, Colorful, Smells Great :). It is a beautiful garden with lots of different type of roses. There is not much shadow to hide, be prepared :)"
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "great park and very well maintained. Lovely way to spend an afternoon in the city, If you're alone take a book, there are plenty of benches around the park."
        }, 
        {
            "index": 52, 
            "rating": "4", 
            "review": "A visit to the rose garden. We had a beautiful day and inside of riding around sightseeing it was nice to get out of car and walk the park and see the beautiful roses."
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "Beautiful Area. We were lucky to visit when the city had all the Palo Borracho trees in bloom. The pink flowers were breathtaking. I was impressed by all the beautiful parks in Buenos Aires."
        }, 
        {
            "index": 54, 
            "rating": "5", 
            "review": "Great walk. It's a very good walking experience, nice, friendly and calm. Great for couples looking for a break in Buenos Aires"
        }, 
        {
            "index": 55, 
            "rating": "3", 
            "review": "Good if you are in the area. We love roses and put this on our want to see list-. we were going to be close by one day so made a visit. There is a really good variety of roses on display but there is no wow! factor and we have seen several better gardens."
        }, 
        {
            "index": 56, 
            "rating": "4", 
            "review": "Colourful rose garden in Palermo. Despite the overcast day when I visited this park, the rose garden was a splash of colour which brightened my visit and is well worth seeking out during your time in Palermo."
        }, 
        {
            "index": 57, 
            "rating": "4", 
            "review": "Beatiful park. The park is a nice place in the city to relax, just sit in the sun and make a picnic or just walk around. On the weekends is super crowded, lot's of people running, rollerblading, etc... in winter you can´t really see it since all the flowers are gone, but it's beatiful in the wam monts."
        }, 
        {
            "index": 58, 
            "rating": "4", 
            "review": "Sunny Saturday Spectacular. We went on a sunny Saturday morning and what a treat! It seemed all the fit young people were in the park jogging, roller blading, walking. Many others, like us tourists, were just walking about the park taking in the beauty of the variety species of trees and the enormous rose garden. It was fall, so the roses were just past their peak, but still plentiful and beautiful. There are bathrooms and benches and lots of space for relaxing outdoors."
        }, 
        {
            "index": 59, 
            "rating": "5", 
            "review": "Pleasant walk on a nice day. Located in the Palermo area, it is a park not immediately obvious but follow the people and you will find it. It is free. We were there early March and the roses were in the midst of their bloom. Not as many variety as one might expect but enough to make sure your walk through the garden is interesting. The little lake in the middle of the park lends a cooling feeling on a hot day! Lots of statues around the park - just understanding who they are will take a few hours!"
        }, 
        {
            "index": 60, 
            "rating": "4", 
            "review": "Roses, roses, roses,. Amazing amount of roses, in a really quiet and peaceful park. Be aware that the park closes in the evening thougt."
        }, 
        {
            "index": 61, 
            "rating": "5", 
            "review": "The Rose Garden of Palermo Park is a must visit.. Like walking the parks in Paris. Huge, beautiful park perfect for romantic couples. The pedal boats are a lot of fun."
        }, 
        {
            "index": 62, 
            "rating": "4", 
            "review": "Garden Oasis in the City. Wander the beautiful gardens. Be impressed with the Parisian-like ponds, foot bridges and colonnaded walkways. Located alongside Avenida Independencia close to the neighborhoods of both Palermo and Recoltea, this is a convenient sight within the city. Many locals come here to enjoy the beauty and peacefulness. Be sure not to walk on the grass as the garden police keep a watchful eye of the perfectly manicured lawns."
        }, 
        {
            "index": 63, 
            "rating": "4", 
            "review": "Lovely Garden. I had a brief walk through these lovely gardens with a group of friends. Bring a camera if you go, and wear walking shoes. It's just a short visit, good at any time of day."
        }, 
        {
            "index": 64, 
            "rating": "5", 
            "review": "Great park. Passeo Rosedal is that kind of place that you want to visit over and over again. It´s a very calm and beautiful place, with lots of roses with different colours and sizes. The only problem is that in a summer day, it may be difficult to find any shadow and the sun can be merciles.The nice thing is that at the end of Rosedal there is this cute museum with a gorgeous small cafe. I loved it."
        }, 
        {
            "index": 65, 
            "rating": "5", 
            "review": "What a great surprise. I just loved the Rosedal. Beautiful park with lots of coloured roses. Great atmosphere to walk around it or just sit and enjoy the moment. At the end of it, there is a wonderful small museum. Be careful! Very hot during summer with no shadows or places to hide."
        }, 
        {
            "index": 66, 
            "rating": "3", 
            "review": "Very Large Park with lost of statutes. Passing on the hop on hop off bus was nice. Very large park in city center. There are countless statutes of Argentine Hero."
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "Paseo de Rosedal is a Lovely Spot for a Walk. Our apartment wasn't far from Paseo de Rosedal, in El Bosques de Palermo Parque. The roses went on forever and the paths were wide and well kept. There was hardly a soul around and we had it all to ourselves. There are two great gazebos in the Rose Garden, and should definitely be seen. We walked here a few times a week to just enjoy the solitude and the beauty."
        }, 
        {
            "index": 68, 
            "rating": "4", 
            "review": "Surprise garden of Roses. Free garden worth the time in the tourist park area of BA. well maintained with a European garden design. Hugh variation of type and color. If you love roses in bloom it will make you want to go home and create something in you own back yard"
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "lovely place to be. could spend the entire sunday here people watching and getting fresh air, very big and well kept, must see!"
        }, 
        {
            "index": 70, 
            "rating": "5", 
            "review": "Best park of Buenos Aires. Taking a stroll through el paseo del Rosedal is a must when you stay in Buenos Aires! There are many different types of roses on display. Adjacent to the rose garden is a nice little lake."
        }, 
        {
            "index": 71, 
            "rating": "5", 
            "review": "Blooming good!. This is a beautiful park, filled with fragrant roses and other glorious flora. The landscaping is gorgeous and this is a great place to see and be seen, or just to wind down."
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "an absolutely lovely day tre. There is no comparison between this Rose park and the Japanese garden. Firstly it's filled with gorgeous trees. Bountiful rose gardens, many varieties. Very European. Beautiful walkways surrounding the water where you can rent a paddleboat. If you're a birder remember your binoculars ! If you stand can stand still and wait, the parrots, parakeets, hummingbirds, and lovely colorful birds. The grounds are extremely well kept and very clean. Quiet too! A day here is well worth it. The best of what BA has to offer. And FREE."
        }, 
        {
            "index": 73, 
            "rating": "5", 
            "review": "Beautiful European Style (look out for their opening schedule). I've been there a couple of months now, and it is a wonderful experience. It's a big park, full of trees, roses, a nice lake and some ducks in it. Lovely to walk the whole area. Look out for their opening schedule, because at 20 hours it was already closed.It's lovely on summer sunny days, and it's free of charge."
        }, 
        {
            "index": 74, 
            "rating": "5", 
            "review": "A Rose is a Rose ... Breathtaking in summer when the roses are blooming. You can smell the rose scent just walking through the area .. Watch out for the bees."
        }, 
        {
            "index": 75, 
            "rating": "3", 
            "review": "Walk between the roses. A nice pleasant garden with several varieties of roses. If you are passing by then this garden is worth a visit."
        }, 
        {
            "index": 76, 
            "rating": "5", 
            "review": "Beautiful!. Several visits to this wonderful garden, but this the first time I got to see it in full and glorious bloom. Made my day. Would have been even better had the fountains been working. Oh, well!"
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "Amazing display of roses!. This park is absolutely a place to visit in Buenos Aires! What a display of roses for the eyes and nose to experience! The area is beautifully maintained and georgious! A must! The many other surrounding parks are all close by and easely accessible by walk!"
        }, 
        {
            "index": 78, 
            "rating": "3", 
            "review": "A pleasant walk. Nice pleasant garden, but nothing outstanding. Good to visit if you are already walking through the area. Don't go out of your way on this garden."
        }, 
        {
            "index": 79, 
            "rating": "5", 
            "review": "A Peaceful Oasis. Be it for for walking, biking, roller blading, reading, or looking at gorgeous roses , this is the perfect park. There is a lake for pedal boats, majestic statuary, and ancient trees. It is also filled with locals, and like so much in this city, free to enter."
        }, 
        {
            "index": 80, 
            "rating": "5", 
            "review": "Gorgeous Park. We were able to tour this beautiful park while on our city tour in Buenos Aires. Since it was Summer, the roses were all in bloom which offered an abundance of color and scent. The park is very well cared for and magnificent to walk around in. You will also see statues and busts of famous poets."
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "Best kept garden in Buenos Aires and a delight to see. This gardens, a former ranch for an important historical figure, now houses a Rose Garden that could easily be found in Paris.\nBecause of Buenos Aires unique climate, roses bloom all year round, and the great maintenance of the space makes it for a beautiful place to see."
        }, 
        {
            "index": 82, 
            "rating": "4", 
            "review": "Nice hideout in BA. A very well maintained park in the middle of BA. It was nice to walk through the park and enjoy the well cultivated roses and spotless grass."
        }, 
        {
            "index": 83, 
            "rating": "4", 
            "review": "Lovely for Photos. The rose garden is located in a larger park and the whole area is worth visiting. The rose garden features a pond with paddleboats, vine draped trellises, and a gravel path that's easy on your legs and feet. The gardens are well manicured with lots of rose varieties."
        }, 
        {
            "index": 84, 
            "rating": "3", 
            "review": "Nice Place. A very pleasant flower garden. Good to spend a restful and enjoyable break in visiting the city. Some shaded places make it useable during summer heat"
        }, 
        {
            "index": 85, 
            "rating": "5", 
            "review": "Rose lovers unite!. This is the most amazing rose garden I have ever seen. It is the largest and the most fragrant! I went as everything was beginning to explode in color and scent. I will NEVER EVER forget this experience... plus seeing the swans on the area lakes added to its beauty. Don't miss it!"
        }, 
        {
            "index": 86, 
            "rating": "5", 
            "review": "Nice garden. In my past trips to Buenos Aires I had neglected this park, but finally this time I manage to go and I it was a great surprise for me. It is very beautiful and different form the other parks in the city. The roses were all in bloom, making it a very spectacular view, the lake has a lot of ducks and geese, and since we went on a Sunday it was buzzing with locals.It’s a good place to visit and relax walking around it, or just sitting in a shade."
        }, 
        {
            "index": 87, 
            "rating": "4", 
            "review": "Peaceful garden. It is a park with plenty of Roses plants of all colours and types you can imagine. It has also a lake in the middle. Common place for locals to drink \"mate\""
        }, 
        {
            "index": 88, 
            "rating": "5", 
            "review": "Breathtaking. Gorgeous well kept grounds and roses for miles. Swoon worthy day date place. Great for portrait backgrounds, strolls, and general awing of nature."
        }, 
        {
            "index": 89, 
            "rating": "4", 
            "review": "Nice hour walking around.. Nice garden with lots of roses, water, and statues. Big improvement over the pretty poor biting all gardens which were disappointing. If you want to do a garden in BA then the Rose Garden is the one to do."
        }, 
        {
            "index": 90, 
            "rating": "5", 
            "review": "Amazing, one-of-a-kind natural beauty. These gardens, particularly the Rose Gardens are some of the most beautiful guards life ever been to. It is very accessible, and open for most of the day. While there are several people in the gardens, the area is huge, peaceful and serene. Great area for photos, and again, the natural beauty is beyond reproach. This in my opinion is an absolute must for those visiting the city. We had a wonderful time"
        }, 
        {
            "index": 91, 
            "rating": "4", 
            "review": "Gorgeous Place to Walk. Terrific rose garden, very beautiful place to walk and get lost for a bit. Fair warning, it CLOSES ON MONDAYS. Since this is a park, I found this...unexpected...so be forewarned.\nIt is also a stop on the Buenos Aires bus tour, which makes it convenient."
        }, 
        {
            "index": 92, 
            "rating": "4", 
            "review": "nice place to stop by. Nice place and tranquil place to visit. It is not a BA 'must see this' but if in the city is pleasant and reasonably tranquil."
        }, 
        {
            "index": 93, 
            "rating": "5", 
            "review": "Feels like Alice in Wonderland. Really really nice place to stroll around and enjoy a nice day it is in a few blocks away from one of the tour bus stops. Lots of nice and pretty roses and monuments"
        }, 
        {
            "index": 94, 
            "rating": "5", 
            "review": "Great for morning walks. Easy access by walking from Palermo SoHo or take a taxi there. There is a starbucks under the railroad and a couple of other places. Also street vendors for drinks and very close by a stand where a guy grill sausages for the famous \"choripan\" basically a sausage sandwich."
        }, 
        {
            "index": 95, 
            "rating": "4", 
            "review": "Very interesting rose garden time to relax or do some sport. Nice for having a walk or watch people doing sport . Going on a pedal boat ride with your children rent a skate or a bike and go around the parc. many nice restaurants around .\nBathrooms even for handicapped. And don't miss to make on weekends a free medicine check up and get a free fruit.."
        }, 
        {
            "index": 96, 
            "rating": "5", 
            "review": "Free and beautiful!. One of the nicest places in the city! It's free and you can go there for a walk round the lake, see the rose bushes exhibition, have a ride in boat or jogg or roller skate around. At weekends you can hire bikes there. How to get there? You should take a bus to Av Santa Fe and Oro street, or the subway line D up to Palermo station. From there, walk to Ave. Libertador and you are there!"
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "Beautiful and calm!. Great for flower lovers and those not so keen anyway - it's very pretty and well looked after. Little green oasis in town!"
        }, 
        {
            "index": 98, 
            "rating": "5", 
            "review": "In love with this area!. I came here on a gorgeous summers' day and fell in love. Beautiful area to stroll around in, relax with a book, rollerskate, exercise, picnic or visit as a tourist. The rose gardens are free unlike the japanese gardens so i just stayed here and lay in the sun. A must do while in Buenos Aires! I recommend going in the weekend while the locals are around"
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "Huge rose garden - pretty and romantic. Lovely to wander through this huge Rose garden. Walk down the promenade with its columns and white pergola covered in roses - very romantic. The roses are a mass of different colours and fragrances, size and shape. A delightful way to spend an hour or two."
        }, 
        {
            "index": 100, 
            "rating": "5", 
            "review": "Beautiful!. This is such a lovely and romantic park! If you have been to Central Park, Hyde Park or any other famous park around the world, this is one to visit too. It is beautiful!Stay on the walkways though."
        }, 
        {
            "index": 101, 
            "rating": "3", 
            "review": "Tarde diferente. El Paseo es único en época de rosas, en julio si tienen suerte pueden llevarse algunas rosas luego de la poda. Ideal el paseo para culminar tomando un té/café en el Museo Sivori a unos metros. (entrada cuesta aprox. $10.-) más lo que se consuma.Unique place in Recoleta, visit when roses are in bloom (spring,summer). If lucky in july when pruned you can take a few roses. Finish this stroll with a nice cup of tea/coffe at Museum Sivori, just a few minutes inside the park (entry fee aprox. $1 USD)"
        }, 
        {
            "index": 102, 
            "rating": "3", 
            "review": "Big beautiful open park, nothing exciting to see.. Ideal for jogging, outdoor sports and pic nicks, but there is nothing there really other than a big park with scattered statues. Back in Buenos Aires glory days these walks used to be lined with roses in bloom during the summer (that's why it's named like this), but these are long gone. Still beautiful to stroll and enjoy the park area when the weather is nice. Make sure to bring hydration and a hat, don't be fooled by the cloudy weather. There are no public toilets or food-drink facilities around so be prepared."
        }, 
        {
            "index": 103, 
            "rating": "4", 
            "review": "Enormous park. Went there after visiting the Evita museum, less than 10 min walk from it. It begins at the Spanish monument and cannot tell where it ends. It's an enormous, great place for walking, sport, picnic... There's a lake or two with pedal boats to rent.If you're not tight on time, great place to spend a sunny day."
        }, 
        {
            "index": 104, 
            "rating": "5", 
            "review": "Serene walk through manicured rose gardens. Lovely part of park (Bosques de Palermo) where the rose gardens and pathways have been restored and upgraded. Visiting in early December was beautiful with all the late Spring blooms. Very well maintained and while you can hear the din of traffic in the distance, the fountains are a very nice place to sit and contemplate the world. One of the highlights of Palermo."
        }, 
        {
            "index": 105, 
            "rating": "4", 
            "review": "Needs a Retouch.... A nice place to visit if you are a nature lover its a favorite spot for locals and residents of the city. Crowded during the weekends, its a nice place to relax and enjoy the nature since its so close to one of the most popular neighborhoods. You can take the bus or walk from the zoo area, but remember to take some sunscreen and water since the heat of the summer gets a little unmanageable."
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "Beautiful garden. Very romantic if you go with your best half.Enjoy the variety of roses and plants at all.Go to the Patio Andaluz, a must."
        }, 
        {
            "index": 107, 
            "rating": "5", 
            "review": "Magnificent!. This is one the last interconnecting natural parks in Buenos Aires. It's definitely worth visiting, you can take the subway and walk from there. If you go in Summer make sure you have water with you, you are gonna need it :)"
        }, 
        {
            "index": 108, 
            "rating": "3", 
            "review": "Good for a walk. I live near the Rosedal and I do my daily walk there.It is good but it can be better and nothing compared to other parks of the same categories I been too."
        }, 
        {
            "index": 109, 
            "rating": "3", 
            "review": "nice day. good place to walk around and relax. sit for a while and read your book or just watch the ducks. some shade for the hot days."
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "Early December - perfect time to visit. This garden is a lovely oasis in BA. In early December, all of the lilies and roses are blooming - gorgeous!"
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "Stop and Smell the Roses. A wonderful, peaceful place to stop and smell the roses. The flowers were beautiful and the aroma delicious. A great place to sit, read and people watch."
        }, 
        {
            "index": 112, 
            "rating": "5", 
            "review": "During the day. It's a good place to go because the place is full of people biking,running,relaxing.The are a very little lake with paddle boats an full of different kind of roses,super romantic.\nYou can go to be seat in the grass with wonderful trees"
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "Beautiful park and garden. We went as part of a walking tour. It's a very well maintained park. The flowers were beautiful. There are very pretty paths to walk down and lots of places to sit and enjoy the flowers."
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "Simply the best park I've ver been. Paseo del Rosedal is the Rose Park in the centre of Buenos Aires. The huge territory designed and cared on the highest level with thousands and thousands of roses. This is a fascinating place to relax.\nIf you are in Buenos Aires don't miss it, it's a gorgeous place.\nSo I strongly recommend to go there.\nSincerely Yours,\nArtur"
        }, 
        {
            "index": 115, 
            "rating": "5", 
            "review": "Incredible . This flower garden is incredibly beautiful. I don't think you'll find many like it anywhere on earth. The blend of green grass and shrubs with colorful flowers makes this enormous flower garden feel wide open and Ultra relaxing."
        }, 
        {
            "index": 116, 
            "rating": "5", 
            "review": "One of many beautiful parks in BsAs. Great place to visit with beautiful rose gardens, lakes and views of the city. A very relaxing experience."
        }, 
        {
            "index": 117, 
            "rating": "4", 
            "review": "Beautiful place. Beautiful place, with stunning view, different kind of roses, several places for sitting and a couple of statues"
        }, 
        {
            "index": 118, 
            "rating": "4", 
            "review": "Definitely take time to roses. Beautiful rose garden! We took some time to stroll through the beautifully appointed garden and admired the wide variety of roses. We don't have any knowledge about the roses or its different kinds,meet very much enjoyed our visit."
        }, 
        {
            "index": 119, 
            "rating": "4", 
            "review": "Beautiful rose garden in Palermo. We had the chance to enjoy all the roses in full bloom, and walk around Jacaranda trees in bloom.The place is absolutely beautiful, and very well maintained. A large pond with a variety of geese and a place to enjoy a paddle boating.\nGreat place to visit."
        }, 
        {
            "index": 120, 
            "rating": "5", 
            "review": "Stop and smell the roses. If in BA, one cannot miss the collections of beautiful roses. In the middle of the city stopped and enjoyed the nature."
        }, 
        {
            "index": 121, 
            "rating": "5", 
            "review": "Great place for a stroll. Large parque, with water fountains, a rose garden, pavilions and statues, a lake (no swans, but there were geese with goslings) with the requisite bridges and rental boats. Locals on roller skates using the lane outside the parque, airplanes landing and taking off from Newbury airport in the background."
        }, 
        {
            "index": 122, 
            "rating": "5", 
            "review": "A great retreat from the hastle of the city. This wonderful rose garden is situated in Bosques de Palermo. The place is very well-maintained, it has benches and pergolas and all in all it provides a great retreat from the hastle of the city life. There are loads of roses of different colours and some other beautiful flowers. The best time to visit, in my opinion, is the second part of November and December when all the roses are in blossom and you can also see the lilac flowers of jacaranda trees. In the lakes circling the gardens there are numerous geese with their goslings (November). The garden is great for pictures. It's free, closed on Mondays, open Tuesday to Sunday 9am-6pm (in summer"
        }, 
        {
            "index": 123, 
            "rating": "5", 
            "review": "Roses,and beautiful roses!. We walked to this park complex from our hotel which was quite a hike. Walking made us notice things we would have otherwise missed.The park complex is very large and well maintained and in it to one side is the rose garden.Plantings are in colours and they are well groomed and healthy. Massed roses in bloom are a spectacular display,many are perfumed and visitors are treated to this garden in springflowering. The grass in the park surrounding the rose gardens is off limits and signs ask visitors to keep off the grass. Very strange to have this limitation in a public park. This is the only downside in a beautiful tourist attraction."
        }, 
        {
            "index": 124, 
            "rating": "5", 
            "review": "Beautiful! Excellent \"last day\" activity. This was a long, 40 minute walk from our hotel in Palermo Soho, but it was worth it! On a beautiful spring day, there is nothing like this park. The roses were in full bloom, the park was expansive and well-kept, and for those who like variety, the zoo and the botanical gardens are right nearby. If we had more time, I would have loved to take a paddleboat out on the small lake. Easily could have spend an hour or two strolling around here."
        }, 
        {
            "index": 125, 
            "rating": "4", 
            "review": "Huge park in midst of the biggest neighborhood. This was great park in the midst of the Palermo neighborhood, which is covered by beautiful flowers and is a nice place to go for a walk."
        }, 
        {
            "index": 126, 
            "rating": "5", 
            "review": "Argentina Should teach us how to design and maintain city parks. My first impressions of these expansive gardens and park were of walking into an early 20th century painting. The place is absolutely beautiful, extremely well maintained and a luxurious way to spend a day. There is a large pond on which you can go paddle boating, rose gardens, a variety of geese, abundant shade under enormous ficus trees - and with spring coming in November a bit difficult, but fun, to sing, I was strolling through the park one day, in the merry merry month of May."
        }, 
        {
            "index": 127, 
            "rating": "4", 
            "review": "Nice park lots of roses. Not like gyde park in london but worth visiting especially that its located next to the zoo and Japanese park"
        }, 
        {
            "index": 128, 
            "rating": "5", 
            "review": "Impressive Roses. It is spring time so roses just starting to bloom. I was surprised how big this place is. Also a lot of statues.beautiful gees and ducks with babies. Very relaxing place. Will go again"
        }, 
        {
            "index": 129, 
            "rating": "4", 
            "review": "Beautiful garden. Besides the impressive rose garden and manicured greens, this is a very relaxing city park. We were there during a weekend during which some roads are closed to traffic allowing for a multitude of activities. Along the stroll you can read some interesting information on the city expansion at the time when these gardens were created. A welcome and pleasant break from the city center madness for everybody."
        }, 
        {
            "index": 130, 
            "rating": "5", 
            "review": "Admire the roses. Reached the park while biking through the city, on a Sunday. The rose garden is absolutely stunning. Read a book, watch the passers-by, or simply have a rest and take some time for you and your thoughts. All you need is a bench (and there are plenty around) and a sunny day."
        }, 
        {
            "index": 131, 
            "rating": "5", 
            "review": "Beautiful Experience. Its difficult to describe in words how beautiful the experience was. Right now roses are in full bloom and the colors are amazing. Plaza is well kept and good place for comforting family outing"
        }, 
        {
            "index": 132, 
            "rating": "5", 
            "review": "Great attraction. Thanks to actual administration the Rosedal looks pristine. Clean\nThe park is safe and packed with tourist\nAt night is not convenient"
        }, 
        {
            "index": 133, 
            "rating": "5", 
            "review": "Roses Rainbow. El Paseo Rosedal - If roses could make a rainbow, this would be it, for sure! It is a lovely place in the Palermo neighborhood in Buenos Aires. Not only for young people in love, but for all ages - the roses will make you feel in fairyland. A rainbow of colors and perfumes. Not to be missed, especially that the entrance is free, you can see geese and ducks swimming in the nearby lakes, enjoy a ride with the paddling boat or water bikes. It is close to the Zoo as well."
        }, 
        {
            "index": 134, 
            "rating": "3", 
            "review": "Another garden in Buenos Aires.. It's a beautiful place and that's all. You will see several other beautiful gardens in Buenos Aires."
        }, 
        {
            "index": 135, 
            "rating": "5", 
            "review": "Best green space in the city!. The rose garden is a very quite and well taken care of space that is perfect all year round. Anytime of the year you go is perfect, but expect a large crowd on the weekends. Great place to relax and enjoy the sun."
        }, 
        {
            "index": 136, 
            "rating": "5", 
            "review": "Great place to spend the aftenoon. Wonderful place to spend the day with the family/dog/bike/friends/self. It is very well maintained and very pretty, it kind of reminds me of central park due to the fact that its right in the city. Neat place."
        }, 
        {
            "index": 137, 
            "rating": "5", 
            "review": "Beautiful park in the middle of bustling city. One of the main attractions and highly recommended. The park is beautiful year round and will never disappoint, Of course, spring is the best time to visit as everything comes alive but if you have an opportunity make sure to visit this area while in Buenos Aires."
        }, 
        {
            "index": 138, 
            "rating": "5", 
            "review": "great park - WOW!!!!. What an amazing park. I was there beginning of October - therefore unfortunately only a few roses were open. But it is a super nice area - lakes, ducks, interesting trees and flowers... Lots of People are there doing different sports..."
        }, 
        {
            "index": 139, 
            "rating": "5", 
            "review": "A classical gem in the best Parisian tradition. Built 100 years ago it is modeled on classic French gardens and it is well maintained. Free to the public, Closed Mondays. a delightful place. Outside you can skate or stroll or visit the Planataruim or the Sivori modern art museum which has a cafeteria. El Rosedal rose garden has clean bathrooms. No bikes, skaes or dogs allowed. Please stay on foot paths."
        }, 
        {
            "index": 140, 
            "rating": "4", 
            "review": "Rosedal or Jardin de las Rosas in Palermo. A wonderful place, very well kept with charming gardens a nice lake. Plenty of open air activities to do there."
        }, 
        {
            "index": 141, 
            "rating": "4", 
            "review": "Very nice.. We had a beautiful walk through the park, even on a chilly day it was packed. People tanning, walking, pick-nicking, rollerblading etc. Too bad it is their winter....no flowers in bloom..."
        }, 
        {
            "index": 142, 
            "rating": "5", 
            "review": "Very nice and clean relax area, close to city rush. Rosedal means \"rose garden\", so it is especially beautiful in spring, with thousands of roses of lots of different species. All the area surrounding the rose garden is very nice and very well maintained and clean. It is also very safe. All this is very close to downtown and within the touristic neighbourhood of Palermo."
        }, 
        {
            "index": 143, 
            "rating": "5", 
            "review": "beautiful. beautiful garden. we had a great morning in our run through the gardens of Palermo, and particularly in the Rosedal. beautiful."
        }, 
        {
            "index": 144, 
            "rating": "4", 
            "review": "Beautiful place . It's a place absolutely beautiful. If you go when the spring has started, the roses will be blossomed. The walk ride is very similar to those ones in Europe. Great place to go. This place is in the beginning of Palermo's woods."
        }, 
        {
            "index": 145, 
            "rating": "4", 
            "review": "No flowers in september!!. I was very disappointed when i arrived at the Rosedal and saw an enormous amount of rose bushes, and no roses!!\nStill, the park is absolutely breathtaking! Despite the lack of roses, I'd go again!"
        }, 
        {
            "index": 146, 
            "rating": "5", 
            "review": "Wonderfull flowers. Nice parc with wonderfull flowers... A really quiet place in crowdy city. Good to walk aroundor just sit on a bench reading a book and enjoy sunshine."
        }, 
        {
            "index": 147, 
            "rating": "5", 
            "review": "Beautiful part of Bs As. Go here to escape the city, my favourite park in the city. I visited in early Dec and it is better in the summer- all the flowers in bloom. Lovely to bring mate and relax in the afternoon."
        }, 
        {
            "index": 148, 
            "rating": "5", 
            "review": "Enchanted. Beautiful. Unfortunately the roses were not blossomed. The Paseo is very similar to those in Europe. Great place to go."
        }, 
        {
            "index": 149, 
            "rating": "4", 
            "review": "Great quiet place to enjoy nature. Highly recommended for spring or summer. Great for an afternoon picnic. It is at the center of a populated area so is easy to get there and is close to a variety of restaurants or different kind of shops that could also be part of the walk."
        }, 
        {
            "index": 150, 
            "rating": "4", 
            "review": "Winter time :(. Judging by the pictures, it's lovely and you have to go there. So I went, really excited about it, buuut... As it was winter, there were no roses at all! Still it was a nice place, but I mean... Try spring or so, it will propably be a much better experience."
        }, 
        {
            "index": 151, 
            "rating": "5", 
            "review": "I Love that City!. Definitely a beautiful place to walk by, once in Buenos Arires . That is a great city to walk around. It's full of parks and squares everywhere. Monuments and art on the streets. Depending on the season, the flowers are gorgeous. All in Buenos Aires is about art and history."
        }, 
        {
            "index": 152, 
            "rating": "4", 
            "review": "Fun place to exercise spend a relaxing afternoon. This is a nice, relaxing park to go for a run or walk. There are also food vendors and places where you can rent a pair of rollerblades by the hour."
        }, 
        {
            "index": 153, 
            "rating": "5", 
            "review": "Like a french garden!. Buenos Aires surprised us with the incredible parks well conserved. It was designed by the french arquitect Charles Thays, now we understood why Buenos Aires is called little Paris!!"
        }, 
        {
            "index": 154, 
            "rating": "5", 
            "review": "FRESH AIR. This is an open-air garden full of beautiful flowers. If you feel a little stressed by the trafic, the pollution and the noise in the city, this is a great place to have some peace. In this big garden visitors will find roses (mainly) and other kinds of flowers, some fontains and benches to relax or read a nice book in silence."
        }, 
        {
            "index": 155, 
            "rating": "5", 
            "review": "A must go. excellent public park, well maintained, nice atmosphere. Always great on a Sunday. Should not be missed."
        }, 
        {
            "index": 156, 
            "rating": "5", 
            "review": "My Front Yard. I have been living in the Neighborhood for 14 years now and this beautiful Garden feels like my front yard. I just love to go there during all times of the year , but especially in October/November when all the Roses come into bloom. The trees are so varied and beautiful there, that it is just so nice to just sit there and read a book. I never go there any more on Saturday or Sundays as it is way to crowded, but during the week it is my little Buenos Aires Sanctuary."
        }, 
        {
            "index": 157, 
            "rating": "5", 
            "review": "Pleasant stroll. If you feel like to get away of the hustle and bustle of the city the rose garden is located North Palermo and it is part of a huge city park with lakes & expansive grass areas. The rose beds aesthetically arranged & were well maintained. It is easy to get there using buses such as line 37."
        }, 
        {
            "index": 158, 
            "rating": "3", 
            "review": "A nice garden. Rosedal is a green area that is worth the visit only if you are nearby. Of course is a nice place but it's better to plan it so that you do some other things in the area not just this spot"
        }, 
        {
            "index": 159, 
            "rating": "5", 
            "review": "Fav garden. My fav place in buenos aires. The place is amazing, beautiful garden and flowers. Go on a sunny day and you'll have the most amazing pics."
        }, 
        {
            "index": 160, 
            "rating": "5", 
            "review": "Relaxing great place!. Awesome! Although didn't went during the seasons, there's still roses everywhere. Is a huge park. We bought some food and drinks there and spent an entire day relaxing. Best park!"
        }, 
        {
            "index": 161, 
            "rating": "4", 
            "review": "A relaxing walk,. An inviting place for everyone to walk, rest and relax. I immediately loved this peaceful place because it is silent to enjoy the sights and to listen to the birds."
        }, 
        {
            "index": 162, 
            "rating": "4", 
            "review": "Nice rose garden. I like gardens, roses are beautiful, and they smell, you walk and seat, and relax, you need this also in a big city like Bs.Aires."
        }, 
        {
            "index": 163, 
            "rating": "4", 
            "review": "go early morning during the week. is a lovely walk about through the city gardens, nice to get away from the busy noise of the city. Try to go during a week day as weekends gets too many people."
        }, 
        {
            "index": 164, 
            "rating": "4", 
            "review": "Very nice walk. It's nice to walk the park during the afternoon before the temperature goes down on a sunny winter day."
        }, 
        {
            "index": 165, 
            "rating": "5", 
            "review": "Beautiful Park in the City Center. I frequently go running in the Park during me visits to Buenos Aires. The rosedal is a beautiful rose garden in the middle of the park. It has a lake with paddle boats and is a nice relaxing place to walk or sit on a park bench and enjoy a nice escape from the hustle and bustle of the city."
        }, 
        {
            "index": 166, 
            "rating": "5", 
            "review": "Lovely. We spent a couple of hours in the rose garden on a beautiful sunny day. The garden is well looked after and hosts a great variety of roses. It is a lovely place to walk through."
        }, 
        {
            "index": 167, 
            "rating": "5", 
            "review": "Beautiful!. Actually this is a beautifull place to visit if you are around Buenos Aires, even though it was not roses seasson, the place is still gorgeous."
        }, 
        {
            "index": 168, 
            "rating": "5", 
            "review": "Beautiful walk and photos. Nice place for a walk... Very beautiful and well maintained. We decided to walk from Palermo to MALBA and found this pleasant place on the way."
        }, 
        {
            "index": 169, 
            "rating": "5", 
            "review": "Beautiful places. Great place to walk around and enjoy the many different colours of roses. You can feel within the nature in a very quiet place. Very romantic place to propose."
        }, 
        {
            "index": 170, 
            "rating": "5", 
            "review": "Beautiful place for working out, drinking mate, reading a book!. This garden is different from the others in the Bosques of Palermo...it has a very serene beauty that leaves you staring for hours. Definitely a great place to go for a run, chat with friends, even take their little boat ride. You'll see dozens of people exercising here, and unlike running on a track or down the street, your eyes will never be bored with architectural details spread throughout. Bring your yoga mat to one of the garden's picturesque gazebos and enjoy a day at the park."
        }, 
        {
            "index": 171, 
            "rating": "5", 
            "review": "Expansive, well manicured park. All sorts of stuff here. Beyond the beautiful rose gardens there are also ponds, statues, and open spaces. It's a big place for people on runs or rollerblades. Nice way to spend an afternoon"
        }, 
        {
            "index": 172, 
            "rating": "5", 
            "review": "Must-see, even out of season. This was a beautiful garden full of roses. Our trip was nearly into winter and still there were many roses in bloom. It was a great place to sit or to take photos. Beautiful."
        }, 
        {
            "index": 173, 
            "rating": "5", 
            "review": "Better than the Botanic Gardens. This place is outta this world. So green and open spaces. Beautiful and romantic place, a place to take your shoes off and relax, or have a picnic. Very nice during April if the sun is out."
        }, 
        {
            "index": 174, 
            "rating": "5", 
            "review": "The best public Park in Buenos Aires. This is one of those places that you stay all day long and don't get tired of it. Green area with plenty things to do."
        }, 
        {
            "index": 175, 
            "rating": "5", 
            "review": "Great park in the city!. It's a very nice park!... Bring some mate with cookies and just sit in the grass to enjoy the afternoon! ... Theres also a running track around the lake, half a km!"
        }, 
        {
            "index": 176, 
            "rating": "5", 
            "review": "Marvelous Park. It is really the main Buenos Aires lung!!! Lots of trees, green everywhere, a swan lake (or duck lake, nealy the same) rowing boats. You can ride bikes, or do some jogging. Is has a sorounding 1 mile circuit where an astonishing amount of people attend every day to improve their lives by running. Im one of them!!"
        }, 
        {
            "index": 177, 
            "rating": "5", 
            "review": "It worth your visit, stop with the city tour bus. Really fantastic park, you can rent a bike there, or a boat in the lake, or just walk....People used to run at every time Near the zoo and Exposition center La Rural, elegant neighborhood"
        }, 
        {
            "index": 178, 
            "rating": "5", 
            "review": "Gorgeous Park!. I have been going on a regular basis to Paseo del Rosedal, since 1991, and it stills take my breath away. I highly recommend to vist this Park (Palermo), at least once, if you are ever in Buenos Aires. My favorite place in the Park is the white Helenic Bridge."
        }, 
        {
            "index": 179, 
            "rating": "5", 
            "review": "Enjoy the gardens and relax. Beautiful roses, pretty man-made lake, trees, and gardens lead to a relaxing afternoon. I really enjoyed seeing the locals enjoying themselves, and I felt a part of the local community for the afternoon."
        }, 
        {
            "index": 180, 
            "rating": "5", 
            "review": "Wonderful botanical views. Great for a calm walk or a run.\nIn every time of the year you can have different nature experience!\nIt´s magical and beautiful during roses season."
        }, 
        {
            "index": 181, 
            "rating": "4", 
            "review": "Nice walking. Just keep on walking in the beautiful parks and gardens of Palermo, to escape the busy avenues of the capital. Argentines of all ages hang out in the parks in summer, and you'll consequently find all sorts of activities, from reading, drinking \"maté\", frisbeeing, gymnastics to playing ball. You can walk for hours through the parks alongside the avenues Libertador and cross the avenue if you want a coffee. Mind the dog walkers who are not really clean and leave the pooches presents everywhere."
        }, 
        {
            "index": 182, 
            "rating": "5", 
            "review": "Beautiful botanical gardens. Must see.. We were travelling with children. On our first day, we walked from Palermo where we were staying to this park. It was so relaxing and beautiful. There are ducks in the lake - lovely to sit and watch and feed them and beautiful gardens to walk through. We have some amazing memories and photos from here. Loved it. The Planetarium is a close distance from here also."
        }, 
        {
            "index": 183, 
            "rating": "5", 
            "review": "Great place for walks, meditation and contemplation of nature. Beautiful decorated parks and gardens are the paradise for visitors to rest and spend leisure time outside, especially during the sunny weekends (do not forget to use sunblocks!!!). It's a great place for family walks, meditation and contemplation of nature.If you love roses, or simply want a quiet break during your trip to Buenos Aires, the rose garden El Rosedal provides a beautiful respite. Located in the green Bosques de Palermo park, the garden boasts some 1,200 varieties of roses and more than 15,000 bushes in total. While at El Rosedal, stroll the Rose Garden Walk, take in the Garden of Poets or simply relax on one of the many park benches available for your comfort throughout the garden. El Rosedal is a short distance from the Galileo Planetarium and within two miles of the Home Hotel and other guest quarters in the Palermo district."
        }, 
        {
            "index": 184, 
            "rating": "5", 
            "review": "A beautiful place to relax. I quite enjoyed relaxing here because it offers a welcome respite from the traffic and noise of Buenos Aires. It is beautifully maintained,and the flowers are in a wide variety of colors. It is essential to come here to relax a bit."
        }, 
        {
            "index": 185, 
            "rating": "5", 
            "review": "Pleasant place for a stroll. This picturesque garden is off the tourist track, filled mostly with locals spending some time away from the fast pace of Buenos Aires. Was a welcome retreat."
        }, 
        {
            "index": 186, 
            "rating": "5", 
            "review": "Beautiful & Peaceful Oasis. If you want to get away from the urban sprawl, just relax in the rose garden for a few hours. You get your zen back."
        }, 
        {
            "index": 187, 
            "rating": "5", 
            "review": "Good picnic or relaxing spot. This is a very romantic area, and good for dates or relaxing walk in this hetic city. Remember it is closed on Monday.The roses are extremely pretty.It is free and very nice, I would come again."
        }, 
        {
            "index": 188, 
            "rating": "5", 
            "review": "A great place to be. The park itself, inside the fences, is beautiful and well conservated. A nice lake, grass and tress. But, what makes it great is everything else outside the fences. People walking, using the park, picnicing in the grass, skateboarding, rollerblading, running, small children having fun.Anyway, its a nice place to turn your cellphone off and have fun, anyway you want (or can).There's even a Starbucks at a corner of the park (under a railway that passes elevated).I was staying at palermo, 8 blocks away from the park, and every afternoon I ran a few laps around the lake... very nice!"
        }, 
        {
            "index": 189, 
            "rating": "4", 
            "review": "A Great Reprieve from the Hustle and Bustle of BA. We stopped here on our city tour. We were here during the end of summer so the roses were still in bloom. What a beautiful park with fountains and a small lake. You can rent a paddle boat, if you wish. You can wind your way using many foot paths among the rose gardens. Beautiful statues and bridges. It's just a nice respite..."
        }, 
        {
            "index": 190, 
            "rating": "5", 
            "review": "the best place of BA. It is the nicest park of BA. The roses are amazing, the view of the lake is gorgeous. You can watch or feed the ducks that live in there. Paseo del Rosedal is clean and really safe."
        }, 
        {
            "index": 191, 
            "rating": "5", 
            "review": "Always in bloom. Great rose garden in the Bosques de Palermo. Always something in bloom, always a great place to stroll and clear your mind. Good signage in spanish and english will tell you the history, the varieties, and a little bit about their own cultivar program where they are trying out new varieties. Popular with engaged couples to get photos, parents getting the latest photo of their kids, and of course everyone trying to get the best photo of the best bloom. Free attraction open daily, very safe."
        }, 
        {
            "index": 192, 
            "rating": "4", 
            "review": "Nice to have a walk around. Beautiful rose garden to have a walk around if you have a bit of time and are enjoying the park. Don't wear white canvas trainers in the park, the red mud will turn them pink."
        }, 
        {
            "index": 193, 
            "rating": "5", 
            "review": "Serene escape from the city. We went here on a weekday while strolling around Palermo area. The gardens are very well maintained, the roses are beautiful, and the overall atmosphere is serene. We enjoyed this escape for a couple hours."
        }, 
        {
            "index": 194, 
            "rating": "5", 
            "review": "Perfect on a sunny day. It's really beautiful. The the bed of roses are laid as dell as the gazebos and lake. It's a nice stroll."
        }, 
        {
            "index": 195, 
            "rating": "5", 
            "review": "Oh, romance...... Even if you go visit by yourself this garden is so romantic!!!It's a lovely place to simple go relax or to take photos (I took dozens lol), to admire nature, to think about life, do a picnic or just smell the flowers....The lakes are also very beautiful and you can play with the cute ducks too hehehheall this and it is free to get in.a short walk and you're at Jardin Japones (Japanese Garden), small, 50Pesos to get in, but also beautiful."
        }, 
        {
            "index": 196, 
            "rating": "4", 
            "review": "Peace and quiet in the middle of bustling Buenos Aires. It was a nice respite from the busy city. We arrived 15 min prior to closing time but still had a nice time. It's beautiful. I wish we had more time to explore."
        }, 
        {
            "index": 197, 
            "rating": "5", 
            "review": "A paradise for garden lovers. It is huge and is located just in the heart of the city for everyone to enjoy. I like the mass-planting of different kinds of roses. The trellis and pergolas planted with climbing roses are just so beautiful and romantic. The fountains and the little bridge in the middle of the \"rosarium\" are a bonus. You can enter the Rosedal from one gate and exit in the other side of the \"garden\". It's great that they put the names of the roses so if there's one you like,you can easily check in the garden centers back home."
        }, 
        {
            "index": 198, 
            "rating": "3", 
            "review": "Relaxing. Not a particulary big garden, but pleasant and a nice way to spend some time away from the hustle and bustle of the city. There is a nice little art gallery and cafe just over the Greek bridge."
        }, 
        {
            "index": 199, 
            "rating": "5", 
            "review": "Lindo | Beautiful | Beau | Schön. Amazing park, with beautiful view... The color of the park changes in each seasion because of the kind of landscape. The park has a very insteresting history. And it is perfect for exercises."
        }, 
        {
            "index": 200, 
            "rating": "1", 
            "review": "Can't Tell, Closed On Mondays. The Paseo is closed on Mondays at least in March.Just thought a word of warning from someone who missed it because of poor timing might br helpful.Open 8 to 5 all year round, until 8pm in what they call ''summer''."
        }, 
        {
            "index": 201, 
            "rating": "5", 
            "review": "A Fabulous Ramble. If you are traveling independently or on a tour......a stop at the Rose Garden is uplifting and relaxing.We are at the beginning of our 5th extended stay and enjoyed the roses immensely today. We adore Sundays.......families are out and about, the locals are jogging and biking....or having a picnic or skating,etc.We love to relax at the walkway with the columns and by the small lake, with paddleboats passing by. Another treat is when they have SONIDOS en Rosedal and Sunday concerts. We adore them and it's truly mingling with the locals. Need to check the gov't website....I honestly can't remember the month and there certainly was NOT a concert today.As I do this, my mind's eye can recall the aroma of those terrific roses. The city REALLY keeps this area in top notch shape. And lucky for us......we'll be back MANY times before we head back to the US."
        }, 
        {
            "index": 202, 
            "rating": "3", 
            "review": "Pretty walk. This is an unexpected garden, greet way to spend a couple of hours. Probably a must if you're into roses, which I only have a casual interest in. Make sure you have a cold drink or a hat, there isn't a lot of shade and it can get warm in the summer. All in all I enjoyed it and it's free!"
        }, 
        {
            "index": 203, 
            "rating": "4", 
            "review": "BA garden. It was interesting to check out locals during the week end. The park get very crowded of people eating, drinking and strolling around. The park is huge and has many jogging paths."
        }, 
        {
            "index": 204, 
            "rating": "5", 
            "review": "Rose Garden. Beautiful place, very popular on weekends. If you can visit on a week day its a pleasure specially in spring, September onwards when the rose bushes aré at their best. Quite a large garden lovely to walkabout at leisure, very well kept. With all the greenery carefully trimmed by specialists. Super to walk, relax and enjoy. A plus of a small lake, bridge and paddle boats. To stay as long as you are able ."
        }, 
        {
            "index": 205, 
            "rating": "4", 
            "review": "Beautiful stroll!. Rosedal Gardens are a very nice place to have a walkIt has a very nice big pond ehere you can row if you rent a boat, lots of beautiful roses in spring and summer and it is a great place to have a pic nic and see real argentinian peopleThey love el Rosedal to jogg, walk, skate or ride bicycles It is a lovely place ehere you can rent bikes if you wantYou have a very nice Mc Donalds to have a quick lunch just a block away You won't regret your visit"
        }, 
        {
            "index": 206, 
            "rating": "4", 
            "review": "Oasis in this Large City. Nothing here not to like! Old, large, sprawling trees. Rose gardens. Paths for walking. Benches to sit. Flowering trees. Small lakes. Paddle boats.Great to relax, stroll with friends, or take photos. Worth a visit for an hour or two, or longer.If this review is helpful then please indicate so below."
        }, 
        {
            "index": 207, 
            "rating": "4", 
            "review": "lovely place. lovely place to strollYou can get addicted to the wonderful smell of roses.takes half an hour to get through everything,or more to sit on the bench and enjoy"
        }, 
        {
            "index": 208, 
            "rating": "5", 
            "review": "Refreshing. This is a ovely garden and little lake, with very pretty flowers. The whole area is active and interesting."
        }, 
        {
            "index": 209, 
            "rating": "4", 
            "review": "Beautiful and quite place. A nice place to walk slowly and enjoy the nature in the midle of the city. It is not really big, but you will have a quite and nice walk for one hour or two."
        }, 
        {
            "index": 210, 
            "rating": "4", 
            "review": "Great in winter. Roses and more roses, are always beautiful but specially in winter, the park is just beautiful. Walking the big park full of roses, with the incredible perfume around and the silent deserves a visit specially between May and June. A great place for a picnic, also."
        }, 
        {
            "index": 211, 
            "rating": "5", 
            "review": "Beautiful park with a lot of roses. Très beaucoup parc lorsque les roses fleuristes, très belle place a visiter et de prendre beaucoup de photos.\nMust be seen when roses are blooming. central place on weekend and you can do a lot of activities"
        }, 
        {
            "index": 212, 
            "rating": "4", 
            "review": "Walking in thye garden of Palermo. It was great to mix museums, monuments and parks. The paseo de Rosedal is a peaceful place and there the nature is beautiful."
        }, 
        {
            "index": 213, 
            "rating": "5", 
            "review": "Lovely green space!!. we stayed near here, and it was wonderful for morning runs/walks!! Mostly flat - but nice green space to have so close by!!"
        }, 
        {
            "index": 214, 
            "rating": "4", 
            "review": "Beautiful place!. Huge amount of pretty roses, it's unbelievable how many colors and sizes of them, all in the same place well separated, this park is so large you get tired trying to walk all around, choose a part of it and appreciate!"
        }, 
        {
            "index": 215, 
            "rating": "5", 
            "review": "Just don´t miss these roses....... Except for very hot summers (January and early Feb.) and cold (45-50 F ) winters in BA, these rose gardens are spectacular!"
        }, 
        {
            "index": 216, 
            "rating": "4", 
            "review": "Lovely Rose Gardens!. This was such a beautiful place, I regret that I didn't get to go back a second time like I planned. Great as a break in between days of doing multiple activities. Park is very well kept."
        }, 
        {
            "index": 217, 
            "rating": "4", 
            "review": "A correction to my recent review on \"Rosedal de Palermo\". This is to appologise to readers of the above report for an unintentional mistake. The report was submitted a couple of days ago and In it I mentioned I sat in the Andalusian patio humming the \"Concierto de Aranjuez\" and then added \"by Manuel De Falla\". Of course this Concierto is by Juaquín Rodrigo. So please accept my apology."
        }, 
        {
            "index": 218, 
            "rating": "4", 
            "review": "Romantic and Scenic Rose Gardens. If you have the extra time, take a stroll through these rose gardens. They are very pleasant and beautiful. BA does a good job with green spaces."
        }, 
        {
            "index": 219, 
            "rating": "5", 
            "review": "rose garden. beautiful flowers, all different color roses, greenery, ponds, geese and ducks\nrelaxing and peaceful, great place for photos"
        }, 
        {
            "index": 220, 
            "rating": "5", 
            "review": "Amazing. We took a trip to Bs As Mid October this year. It was spring and all flowers were fully bloomed. A magnificent view. Recommended for a picnic or a nice walk. However, pack conformtable shoes, since it takes a good 15 mins walk to get to the park from main street."
        }, 
        {
            "index": 221, 
            "rating": "5", 
            "review": "So beautiful!! Specially when its filled with roses :). Lovely, really nice for a walk and some pictures, really well taken care of even for Argentina - I recommend going. The bridge is also beautiful."
        }, 
        {
            "index": 222, 
            "rating": "5", 
            "review": "Beautiful place to stroll through. The roses were fabulous. The gardens are well laid out and a pleasure to stroll through.\nSuch a tranquil place to visit, so don't forget to visit this garden during your visit to Buenos Aires."
        }, 
        {
            "index": 223, 
            "rating": "5", 
            "review": "Great place to stroll and relax. This is not just a rose garden but a place to relax and enjoy life. There are numerous variety of roses but also other flowers, creating a nice blend of aromatic and visual complexity. The Rose Garden is rather small but it is part of a much larger park system that is a definite for anyone looking to walk and enjoy getting away from the bustle of the city."
        }, 
        {
            "index": 224, 
            "rating": "4", 
            "review": "A lovely Rose garden. This is such an amazing place. So good smelling and flowery. Simply loved it.You must go to the Love Bridge that's in the garden as well."
        }, 
        {
            "index": 225, 
            "rating": "3", 
            "review": "Beautiful Flowers. It is beautiful, but it is a small park with flowers that you do not see everywhere. Great location. Do a combo, paseo and a great art gallery, along with the japanese park nearby."
        }, 
        {
            "index": 226, 
            "rating": "4", 
            "review": "rose garden. The rose garden in the 3 de Febrero is stupendous. My friend who knows the best English gardens thought it beat them for the sheer scale (and arrangement). It didn't hurt that we were regaled with Beethoven's 9th and went there on a gorgeous sunny but not meltingly hot day."
        }, 
        {
            "index": 227, 
            "rating": "4", 
            "review": "Lovely retreat. Part of the bigger Palermo gardens area it's been recently renovated and in a sunny day, it's really pretty. One of the many gardens Thays did design, as opposed to the lot attributed to him that he did not design. Definitely worth a visit."
        }, 
        {
            "index": 228, 
            "rating": "4", 
            "review": "A nice place to take colourful pics. I loved flowers and colors mixed in the place. Nice long walks and benches conveniently arranged under trees to rest a while."
        }, 
        {
            "index": 229, 
            "rating": "5", 
            "review": "A moment to relax. Rosedal is a big park with an artificial lake where people usually run and exercise. Its name is due to the presence of different kinds of roses. Skip the weekends."
        }, 
        {
            "index": 230, 
            "rating": "4", 
            "review": "Beautiful!. The Rosedal is a beautiful attraction with many many many types of roses. If you go at spring, it is a must have tour. Perfect for couples or families with kids."
        }, 
        {
            "index": 231, 
            "rating": "5", 
            "review": "A 100 year old garden full of beautiful roses. Carlso Thays was the one to convert a deserted area into a beautiful landscape. Walking out the bridge and diving into a sea of roses is one of the most recommend travellers to enjoy in Buenos aires."
        }, 
        {
            "index": 232, 
            "rating": "4", 
            "review": "Beautiful. It was Spring and I guess it's the best time to visit this place. Many different types of roses. The site is big and very well cared."
        }, 
        {
            "index": 233, 
            "rating": "5", 
            "review": "Amazing Rose Garden in the middle of Buenos Aires. EL Paseo del Rosedal is a must do attraction that you can find in the middle of the city. The Rosedal is in Palermo Woods, its a big space where you can see hundreds of types of Roses, the place is quiet and perfect for an afternoon walk. It is pretty well preserved and the views of the city from the Rosedal are also great. Do not take a taxi directly to El Roseda, because the drivers will do some tricky rides to get more money. Just take a taxi to Palermo Woods, once there you can walk to el rosedal while also enjoying the Woods which are pretty cool as well."
        }, 
        {
            "index": 234, 
            "rating": "5", 
            "review": "really nice place to visit in a quiet day. Really nice park. You can follow some little ducks walking through it (not really frightened) following their mothe. Nice flowers, plants and structures all around. Well keep lake and ground."
        }, 
        {
            "index": 235, 
            "rating": "5", 
            "review": "Rosedal. A nice place to walk avoiding the noisy BsAs.a bit far from the center, you need to use a taxi.Be very carefull with the taxi guys!"
        }, 
        {
            "index": 236, 
            "rating": "4", 
            "review": "Agradável. Great place for a walking. Beautiful and very peaceful. It is located at 3 de febrero park, at Palermo district."
        }, 
        {
            "index": 237, 
            "rating": "5", 
            "review": "Beautiful and active. the gardens are spectacular...well kept, lots of statuary...but the bigger park is just full of activity. Great place to walk, people watch and see beautiful roses."
        }, 
        {
            "index": 238, 
            "rating": "5", 
            "review": "Color! Fragrance!. This beautifully laid out and maintained garden (don't quite understand why it's called a Paseo) is an oasis of fragrance and color in Parque Febrero 3, if memory serves. Good for the soul!"
        }, 
        {
            "index": 239, 
            "rating": "5", 
            "review": "Always Beautiful and Free!. Paseo Rosedal park in Buenos Aires is my favorite park in the city. It is beautifully laid out, and the rose garden itself is always clean and well maintained. The roses are the main attraction - it has 18,000 rose bushes and numerous artworks, including 26 busts of poets and writers, which are placed among the most striking buildings, a Greek bridge and an Andalusian patio. On the outer part, by the lake, is a popular running track, where people also roller blade, cycle and excersise, the Sivori art Museum (often free), and some vendors selling choripan and other snacks and drinks.When I lived across the street from there, I went almost every day.Highly recommended - easy bus access."
        }, 
        {
            "index": 240, 
            "rating": "4", 
            "review": "Stunning. A lovely place to come on a sunny day for a walk and sit on the benches admiring the views and the rose garden.Pity you're not allowed on the grass. It really is worth a visit however if the weather is in your favour.Really clean bathroom facilities. Situated near the zoo if you fancy a day outdoors."
        }, 
        {
            "index": 241, 
            "rating": "4", 
            "review": "Beautiful places and nice views. This is a really nice park in the middle of Palermo neighborhood, you have a lot of plants and flowers. This is a nice place to go with your girlfriend/boyfriend."
        }, 
        {
            "index": 242, 
            "rating": "5", 
            "review": "Lovely gardens. It has a great variety of roses. Lovely trees and lots of wáter , small lakes, fountains, sculptures. Birds from many kinds free."
        }, 
        {
            "index": 243, 
            "rating": "5", 
            "review": "Gorgeous, very well maintained, and free. If visiting Buenos Aires, a one-hour stroll through the Rosedal is a must. It is very well kept, very quiet, and most of all, gorgeous. Next to it is an artificial lake where paddle boats can be rented at very convenient prices."
        }, 
        {
            "index": 244, 
            "rating": "5", 
            "review": "Great Park!!!. I Used to run there 2 or 3 times a week a cup of years ago.\nit's a perfect place for summer running sessions, longboarding or rollers! You can find a nice small lake with an island connected with a pedestrian bridge..."
        }, 
        {
            "index": 245, 
            "rating": "4", 
            "review": "Wonderful rose garden in the middle of an active park. Rosedal is in the middle of Parque 3 de Febrero. It is a well maintained rose garden with lake, bridges and a lot of fountains and sculptures Come relax and enjoy this respite in the middle of the hectic Buenos Aires."
        }, 
        {
            "index": 246, 
            "rating": "5", 
            "review": "great place. Nice place to visit in nice weather Full of vegetation, a lake and many rose plants.Beautiful in Spring time.Not to be visited at night"
        }, 
        {
            "index": 247, 
            "rating": "5", 
            "review": "The lovers place. This is a very romantic gateway during the day. During the night change to the red zone in buenos aires and during weekends to the sport site. Nice to walk around on a sunny day."
        }, 
        {
            "index": 248, 
            "rating": "5", 
            "review": "Beautiful park. A lovely park always full of families, friends and couples walking. My husband and I enjoy running in this park in the early evenings."
        }, 
        {
            "index": 249, 
            "rating": "5", 
            "review": "One of the nicest place in Buenos Aires. - So well maintained!!!\n- Peaceful\n- Excellent for a little stroll in a sunny day\n- Arguably my preferred place in Buenos Aires"
        }, 
        {
            "index": 250, 
            "rating": "5", 
            "review": "Great park, go for walk, run, bike ride or go for a pedal boat ride on the lake!. I have been to this park multiple times and I have a wonderful experience every time I go! We walked around, relaxed on some benches and enjoyed the fountains, bridges and our walk along the lake. If you are more active, you can rent bikes, rollerblades and pedal boats. There are decent public restrooms and vendors to get drinks and snacks from. We were also here on a Monday that was a national holiday and as you would expect at any major city park on a holiday when the weather forecast is sunny with a high of 80 degrees, it was crowded but not to the point that it seemed overcrowded. I am not a huge fan of crowds but it's a big park and at the time we were there, there plenty of space for us and others to enjoy and relax. However, if you are worried about crowds, avoiding weekends and holidays, especially ones with excellent weather forecasts is probably a good idea. Regardless of when you go, it's a great place to spend a few hours or the day."
        }, 
        {
            "index": 251, 
            "rating": "3", 
            "review": "Too Many People. We visited the Paseo del Rosedal a couple of days ago. It was a Monday (festive) national holiday. It was impossible to enjoy any of natures serenity because of the congestion. Everywhere we turned a frisbee was flying over our head, an old lady about to run us over with rollerblades, kids jamming their bluetooth operated stereos. Literally we were bumping elbows with people, it felt like a rock concert without the presentation. I am guessing it would be lovely on a weekday. It was very large, natural, and in the middle of the city."
        }, 
        {
            "index": 252, 
            "rating": "5", 
            "review": "Roses and lakes. The Rosedal is perfect for a stop after a week of traveling in Buenos Aires. It is an incredibly calm, wide and well decorated rose garden, where the gooses, ducks and little birds will walk with you or sit next to you all the time. It has a greek arquitecture theme and statues of various poets around the place too, which makes it way more charming."
        }, 
        {
            "index": 253, 
            "rating": "5", 
            "review": "Beautiful Park!!!. Amazing landscape! Really clean and neat.Great place to spend a sunny Morning. Dont miss the ride on the lake. Good workout !"
        }, 
        {
            "index": 254, 
            "rating": "5", 
            "review": "Most Beautiful Park in Buenos Aires. The Rosedal is a wonderful, grand park in the heart of Palermo with lakes, trees, ornamental statues and of course roses everywhere. It is a beautiful place to spend a few hours strolling amongst the flower beds, alongside the water, or along the ornate pergodas. Spend a few hours here on a sunny day and you will have memories of your trip that will last forever!"
        }, 
        {
            "index": 255, 
            "rating": "5", 
            "review": "A place for family. We visited Recoleta on 24-25 December 2013. Most of the attractions were closed. But we insisted to explore. So we walked from Urban Suites Recoleta hotel, passing Recoleta Mall, using Av Las Heras road as a guide, passing Jardin Botanico Garden and Jardin Zoologico. Finally we came to a monument 'Monum. de Los Espanoles' and not far we reached the Paseo del Rosedal. But it was closed. So we walked one round along the pond where many family activities were going on. Although the rose garden was closed, we still managed to snap a few photographs of the inside of the roses from along the pond. It was beautiful."
        }, 
        {
            "index": 256, 
            "rating": "5", 
            "review": "This is beatuful.. The lakes, the flowers, the bridges, it's a wonderful experience. And don't forget your camera. There are many street vendors, so a refreshment is always a few feet away. One of the most lovely areas to visit when in Buenos Aires"
        }, 
        {
            "index": 257, 
            "rating": "5", 
            "review": "An unique garden. If you are walking by the Palermo Gardens, don´t miss \"Paseo del Rosedal\" (Roses promenade).The garden was lately refreshing and updated, there is an amazing \"Patio Andaluz\" and is a place to walk, relax, take a lot of nice photos, and is good to go with children.It is the core of Palermo área."
        }, 
        {
            "index": 258, 
            "rating": "5", 
            "review": "IMMENCE ROSES PLACE!. IF you need fresh aire, this place leave you feel good!The collection is fantastic and you could smell it! Very quiet place during days of week. But a lote of people in week-end. Nice to visit"
        }, 
        {
            "index": 259, 
            "rating": "5", 
            "review": "incredible nice. very nice, roses roses roses....lake, botes, peacefull place to walk and feel the energy of the most wonderful park in Buenos Aires."
        }, 
        {
            "index": 260, 
            "rating": "3", 
            "review": "Nice place for a walk. The Rosedal's a big garden making it a nice place for a walk. There are many beautiful colorful roses of different kinds and sizes but that's about it. Make sure you visit it at the right time of the year, otherwise it may be frustrating."
        }, 
        {
            "index": 261, 
            "rating": "5", 
            "review": "A very nice walk. Located in the Palermo Park, it takes you to a very nice rose garden... Specially nice in October & November."
        }, 
        {
            "index": 262, 
            "rating": "4", 
            "review": "A real treat, worth your time. Walking through Palermo and finding (okay, it wasn't really hidden) this park was a real treat. The roses, manicured hedges, and paths all worked together to make this a truly beautiful area. We walked through, sat on the bench and just relaxed.\nWorth your time. Check it out."
        }, 
        {
            "index": 263, 
            "rating": "5", 
            "review": "Beautiful place to take your wife!. Great way to start a day in Buenos Aires! Enjoyed a morning walk through the rose garden with my wife. Many people were out jogging or riding bikes around the area, Lots of roses, geese, benches to relax on, and ponds."
        }, 
        {
            "index": 264, 
            "rating": "5", 
            "review": "A delight amongst the parks of Palermo. This stunning array of flower beds is close to the Japanese Gardens and amongst the parks of Palermo, a 15 minute bus or tube ride from the centre of Buenos Aires. They provide you with a wonderful escape from the noise of this large city and an opportunity to takes some execllent photos of rose beds and fountains. Worth a visit."
        }, 
        {
            "index": 265, 
            "rating": "4", 
            "review": "Beautiful. If you like gardens and you like roses they do not miss this. Was in full bloom in February. Check earlier reviews for what it is like other times of the year. Note only 2 entrances and lots of water so difficult to walk \"through\"."
        }, 
        {
            "index": 266, 
            "rating": "5", 
            "review": "Beautiful park to relax. While sitting on one of the benches and overlooking the stunning beauty of the roses around you could almost forget the fact of being in a big city. There is also a sidewalk around the park which is popular for running/walking and inline-skating"
        }, 
        {
            "index": 267, 
            "rating": "5", 
            "review": "Beautiful Oasis. My wife enjoyed this park more than I did, but I have to admit it was really nice. Beautiful flowers, well maintained paths, and interesting statues. A rose lover's paradise."
        }, 
        {
            "index": 268, 
            "rating": "5", 
            "review": "Beautifully well kept park. One of the most well kept locations in BA; great for a walk or jog/run. Flowers are lovely when in bloom and trees are always well groomed. In the warm weather you can paddle boat or even have your lunch or snack by the lake. Never forget your bug spray!"
        }, 
        {
            "index": 269, 
            "rating": "4", 
            "review": "Nice walk! . Very nice and pleasant place for running or walking. The park is very well maintained (specially for South American standards)."
        }, 
        {
            "index": 270, 
            "rating": "4", 
            "review": "Lovely. Lovely parc - unfortunately a band was playing/rehersing some strange and very loud kind of heavy metal and it sort of chased us out of there...But the lakes and gardens are well kept, very clean and with plenty of benches to sit down and enjoy the cool shadows."
        }, 
        {
            "index": 271, 
            "rating": "5", 
            "review": "Lovely walk!. A nice walk to take during the week with your girl holding your hand while you enjoy the tranquility of the place, the lake aside and the sound of leaves in the breeze."
        }, 
        {
            "index": 272, 
            "rating": "4", 
            "review": "Lovely Park. We went for running through Palermo but some spots are not very clean.Maybe they should invest in more trash baskets."
        }, 
        {
            "index": 273, 
            "rating": "4", 
            "review": "nice garden. We had been told that this is a \"must see\". It was lovely, but not quite as spectacular as we had expected, even though we were there in early December. But it's a nice place to walk and hang out on a nice day."
        }, 
        {
            "index": 274, 
            "rating": "5", 
            "review": "Rose Garden. A must visit (especially in the Spring and Summer - October to March) for a long stroll through the rose gardens and along beautifully manicured ponds teeming with ducks, geese, love birds, flamingos and other exotic birds."
        }, 
        {
            "index": 275, 
            "rating": "5", 
            "review": "Rose lover's paradise. It was probably my favorite spot in all BA. Nicely kept roses, cute fountains and tranquil birds added up to make a small paradise in the middle of the park. Make sure you don't miss it, if you like flowers."
        }, 
        {
            "index": 276, 
            "rating": "5", 
            "review": "Nice gardens, beautiful outdoor stroll. A very nice spot to visit. Very romantic and interesting for a nice morning walk.It gets really crowded with walkers, runners, roller skaters, and bikers on summer (Dec - Mar). Many people often have picnics there. If you are intown,and you want to have a nice walk on a big park, it is really recommended! It is within walking distance (10 minute walk) to: Palermo neighbourhood, the Zoo, the Japanese Gardens and the Paseo Alcorta Shopping.If you have the time and/or you like parcs and strolling, you have to visit it!"
        }, 
        {
            "index": 277, 
            "rating": "4", 
            "review": "A beautiful mix of Italian, English and French garden.. The paseo Rosedal is a beautiful promenade among roses, agapanthes, lilies surrounded by palm trees, pounds, jacarandas. It is exotic and european at the same time. The design of the pergolas and the garden itself is gorgeous. But I had to walk a lot as the entrance bridge was closed. It was 32° and walking 20 minutes more under the sun was painful."
        }, 
        {
            "index": 278, 
            "rating": "4", 
            "review": "Nice walk for a spring afternoon. This park is located in the center of the Palermo gardens, one of the jewels of Buenos Aires city. The rose gardens are worth a visit. You can rent a boat and paddle slowly through a small lake (this is a very popular attraction, so be prepares to queue)."
        }, 
        {
            "index": 279, 
            "rating": "5", 
            "review": "A rose garden for the city. Roses are in full bloom here in November and the garden was a delight. Exceptionally well maintained. Since we visited on a Saturday, the garden was full of locals enjoying the beautiful day. Many benches!"
        }, 
        {
            "index": 280, 
            "rating": "5", 
            "review": "Resembles the Grand Central Park. The day was beautiful and it was a very nice place to visit. There is water going through it and it was full of ducks and baby chicks. People running, walking and enjoying themselves."
        }, 
        {
            "index": 281, 
            "rating": "5", 
            "review": "perfect day out at the park. If you love nature and going out for a nice day out, dont miss this place and the whole park. Palermo park is very well located and you can get by many public transportation means or a short taxi ride. After visiting this part you also rent a boat in the closed lake (pedal boats, and also oar botes)You will also have plenty of place to have a picnic as well.Enjoy and dont miss this park."
        }, 
        {
            "index": 282, 
            "rating": "4", 
            "review": "Nice rental. You can rent bikes, family bikes and roller skates to go around this fun loop!!!!!!!!!!!!!!!!!!!!!!!!!!!"
        }, 
        {
            "index": 283, 
            "rating": "5", 
            "review": "Great rose gardens in Bs.As.. My wife and I enjoyed our first visit to these rose gardens when some Argentine friends took us and we spent an hour or two. Thousands of blooms and very well cared for. It is nice with the lake/rivers circulating through the park and nice bridges to cross. We enjoyed our visit so much that we hopped in a Taxi from our Palermo/Recoleta apartment and returned again about a week later to enjoy again and spend more time at a leisurely pace. Our visit was in October when everything was nicely covered with flowers. We go to Bs.As nearly every year in October as it is Spring down there at this time of year. Sometimes we have enjoyed visits in March-April as it is Fall then and also nice weather. We always rent an apartment in the Palerma/Recoleta area is it is so much more comfortable than a hotel. We like walking down Libertador in the Recoleta area and also down towards Palermo near back side of Zoo as the Japanese Gardens and other parks and gardens are all along this area of city."
        }, 
        {
            "index": 284, 
            "rating": "4", 
            "review": "Central Park lookalike in BA. An absolute pleasure to see locals and visitors alike enjoy themselves in this park in the middle of town. I just wish that I had been there during the flower season, which with the thousands of roses must be spectacular."
        }, 
        {
            "index": 285, 
            "rating": "5", 
            "review": "Gorgeous Garden, Family Fun. My teenage cousin loved the paddle boats and we all enjoyed the roses, ornate bridges and patio, and lakes/islands landscape"
        }, 
        {
            "index": 286, 
            "rating": "4", 
            "review": "AS GARDENS USED TO BE. Most of this gardens was once part of the huge residence of Juan Manuel de Rosas, a \"caudillo\" who governed Buenos Aires Province (whose capital was then the homonymous city) with iron hand in the first half of the XIX century, and was afterwards exiled in England. It's said that because his family name means \"roses\" in Spanish, those flowers were afterwards cultivated here, when the place became public. Others maintain that the caudillo himself had imposed the mode, not devoid of his well known anglophilia. Today, this great gardens, with a lake (boats available) and monuments, make a nice and peaceful strolling moment for an afternoon, once the more intensive touring activities are concluded."
        }, 
        {
            "index": 287, 
            "rating": "5", 
            "review": "Gorgeous!. It was beautiful. Went on a sunny day and it was filled with people, but quiet still. There are stands selling food, and is beside the lake where you can rent boats! Bikes and rollerblades are available as well."
        }, 
        {
            "index": 288, 
            "rating": "5", 
            "review": "One of my favorite places in Buenos Aires. El Paseo del Rosedal is a lovely escape from the face paced city life in Buenos Aires. Located in the center of the Bosque de Palermo, Rosedal is absolutely gorgeous. I was so surprised at the amount of roses still in bloom in the garden even as Buenos Aires' fall turns to winter. This is an excellent place to have a picnic, go on a jog, or just take a stroll. There are ducks and geese everywhere so if you have little ones, bring some bread or something to feed them. It was such a tranquil place to go to and you are bound to enjoy it. Also make sure to bring a camera because there are plenty of places to take pictures!"
        }, 
        {
            "index": 289, 
            "rating": "5", 
            "review": "One of the most beautiful places in BsAs. The Rosedal is one of my favourite corners of BsAs. It offers some tranquility in a city that can become overwhelming at times, definitely try and pay it a visit if you have time."
        }, 
        {
            "index": 290, 
            "rating": "4", 
            "review": "very nice area. Nice for walking. Clean and very well maintained.All the area has very nice parks and monuments.The rose garden is unique, specially in spring."
        }, 
        {
            "index": 291, 
            "rating": "5", 
            "review": "Peaceful and beautiful open place to enjoy. With more than 18000 rosebushes along 8,4 acres, this rose garden created in 1914 has sheltered thousands or romantic stories for \"porteños\" and visitors as well as great moments shared with friends in their youth and elder days. Beautifully maintained throughout the years, it is a place to enjoy not only nature and pure air but also art, as it has several artworks: statues and busts of famous international artists are spread allover the place. Leaving aside technical aspects, it is a peaceful, more than agreable place, with fantastic views, a nice lake to rent a boat and row (with your hands as traditionally or your legs on pedals), an Hellenic bridge, an Andalusian patio donated by the city of Seville (Spain) and the wonderful smell of roses. Do not miss it, take a sunny afternoon for reward your soul and spirit."
        }, 
        {
            "index": 292, 
            "rating": "5", 
            "review": "peaceful. A nice place to escape the busy city and see the roses and sit for a few minutes to enjoy nature. Note that the garden is on an island in the middle of the lake, not in the area outside of it."
        }, 
        {
            "index": 293, 
            "rating": "4", 
            "review": "A haven of peace and tranquility in a huge city. The rose garden in Buenos Aires is a very tranquil and peaceful place to sit and enjoy and sometimes smell the roses. The well manicured and well tended roses and the paths around are a fantastic sight. The variety of roses is astonishing to say the least."
        }, 
        {
            "index": 294, 
            "rating": "4", 
            "review": "A nice break from the bustling of the city. It was a pleasant surprise when we walked through this rose garden. It was big and well-maintained. We don't know much about roses, but they were just beautiful."
        }, 
        {
            "index": 295, 
            "rating": "4", 
            "review": "Better visit during summer. I visited Rosedal when it seemed to be past its best time. Even so the place very pretty and the park and lake close to it make it a nice place to pass time anyway. The surroundings of Rosedal are popular for people to do exercise but once you step inside the gates the atmosphere is peaceful and serene."
        }, 
        {
            "index": 296, 
            "rating": "5", 
            "review": "beautiful. The rose garden was recommended to us by our hotel concierge and it did not dissapoint. Well maintained and excellent people watching."
        }, 
        {
            "index": 297, 
            "rating": "5", 
            "review": "Gorgeous!. Beautifully landscaped and meticulously manicured, this rose garden is one of the largest and most breathtaking I've ever seen. Absolutely worth a visit. Be sure to walk through all the circular paths to enjoy all the different roses."
        }, 
        {
            "index": 298, 
            "rating": "5", 
            "review": "Why was it not open?. We wanted to see the Paseo del Rosedal and walked a distance to get there...only to find it closed on a Wednesday afternoon. Disappointing...."
        }, 
        {
            "index": 299, 
            "rating": "4", 
            "review": "Best place to jog in Buenos Aires. Around a lake surrounding a beautiful rose garden you find people of all ages walking, jogging, skating or just sunbathing."
        }, 
        {
            "index": 300, 
            "rating": "4", 
            "review": "Pretty beautiful. Along with the Bosques de Palermo and the Japanese Gardens this is a place not to be missed. The grounds are beautifully maintained"
        }, 
        {
            "index": 301, 
            "rating": "5", 
            "review": "Really lovely open space. I was recommended to go to this place by a local. It wasn't marked on my tourist map, so I would never have otherwise found it. It's a really beautiful park, very relaxing and quiet. Locals hang out nearby-many on roller blades or dog walking. In some ways it reminded me of Hyde Park in London. It was nice to get a feel for what it's like to live in BA."
        }, 
        {
            "index": 302, 
            "rating": "4", 
            "review": "Clean and nice park. The park is very nice and clean. Good for a few hours time out in the loud and dirty city of buenos aires. Unfortunately, you can still hear the noises of the city - still, worth a trip..."
        }, 
        {
            "index": 303, 
            "rating": "4", 
            "review": "Beautiful!. My friends and I were staying in Palermo so we rented some bikes to ride throgh the \"Bosques de Palermo\" and we loved the \"Rosedal\". It was one of our favorite places in BsAs. It was clean and well-groomed. Definitely a place that I want to go back when in BsAs again."
        }, 
        {
            "index": 304, 
            "rating": "5", 
            "review": "Beautiful rose gardens and lake in Buenos Aires. This is an incredibly well maintained garden with a small lake. We thoroughly enjoyed our visit there and recommend its beauty and quiet to those looking for an alternative morning or afternoon to the noise and traffic of the city."
        }, 
        {
            "index": 305, 
            "rating": "5", 
            "review": "Big Park with Golf Lakes and more!. Take your time. Under suggestions of my tour guide I rent a bike and enjoy a day around the park. It was the perfect option as it is so big and you can stop to enjoy a Rose Garden and stop for a drink around to come back and continue exploring like for ex the Japanese Garden. A nice day !"
        }, 
        {
            "index": 306, 
            "rating": "5", 
            "review": "Favorite place in all of Bs.As.. I was here when the roses were in perfect bloom. The smell was overwhelming! I visited here on multiple occasions to stroll, meditate, relax, and read. It's alongside the lake in parque 3 de febrero where there are many things to do. Great place for running and walking around the lake."
        }, 
        {
            "index": 307, 
            "rating": "5", 
            "review": "peace among the chaos. Not many outdoor parks in BsAs are as well-manicured and none are as romantic as this one. Stroll through the rose garden with your sweetie, exit the garden to the shade trees, bring a little picnic lunch and spend the afternoon lying down on the grass, porteño-style.There's a bunch of vendors selling sodas and ice creams and Starbucks on the other side of the little lake."
        }, 
        {
            "index": 308, 
            "rating": "5", 
            "review": "Great atmosphere. this place is amazing. We went there in a bike tour and we stayed there for a while drinking a \"yerba mate\""
        }, 
        {
            "index": 309, 
            "rating": "4", 
            "review": "Beautiful and calm. It's a great place for taking a walk or just sit on a bench and look at the roses, or the peddle boats around the paseo."
        }, 
        {
            "index": 310, 
            "rating": "4", 
            "review": "PORTEÑOS SHOWING OFF. This is a place where residents go to sunbathe, skate, and generally hang around. You can hire a Mateo ( a horse driven cart) or a pair of skates and show off your skills. A few a really talented but the majority are there to soak the atmosphere. There's also a lake where you can hire a pedallo or row around the central island."
        }, 
        {
            "index": 311, 
            "rating": "5", 
            "review": "Take a walk in the park. I like everything about the Rosedal. You can walk the oval with the other walkers. You can walk through the rose garden which, when in bloom is spectacular. You can sit in the shade or take a ride in a paddle boat. There's an interesting little art museum in the park. Recommended!"
        }, 
        {
            "index": 312, 
            "rating": "4", 
            "review": "Nice park in the Palermo area. Pleasant walk besides the lakes. There are peddle boats that can be a good workout. It was late winter so the roses were not in bloom"
        }, 
        {
            "index": 313, 
            "rating": "4", 
            "review": "Nice Place. Very nice, well maintained place with several of different roses. A romantic place in a Palermo park. It worth to walk by."
        }, 
        {
            "index": 314, 
            "rating": "4", 
            "review": "Beautiful place. We were there on the 31st of December and unfortunately it was closed. But from the park it was possible to see many beautiful roses, in different colors, in a nice projected yard. It is located in a very beautiful area, nearby MALBA and Japanese Garden, so you can do these three places in the same day."
        }, 
        {
            "index": 315, 
            "rating": "5", 
            "review": "Visit in September when the most roses are in bloom!. There are always roses blooming here but in early spring the place is magical! such gorgeous blossoms. It's a nice oasis in the 3 de Febrero park because no dogs allowed and people aren't allowed to sit in the grass, either. The grass is totally plush and gorgeous because it's watered regularly. Also great because there are public restrooms in side the rose garden (near the busts) that are relatively clean. Worth a look for sure. You can cut through the front side and walk all the way back, over the bridge in the back, and exit to the other side of the part right at the entrance to the Eduardo Sivori museum-perfect!"
        }, 
        {
            "index": 316, 
            "rating": "4", 
            "review": "Beautiful. A really beautiful oasis in the middle of the city...although its advised to go on a less hotter day and with plenty of sunscreen :)...beautiful roses and ambience !"
        }, 
        {
            "index": 317, 
            "rating": "4", 
            "review": "A beautiful spot on Spring and Autumn. The oppositions of the Sun's position really affects the rose's performance on this lovely place. By late march it's possible to see lot's of tones of brown and old yellow, and in mid october beautiful and vivid tones of rose and orange. I'd avoid it in weekends due the huge amount of people cruising by."
        }, 
        {
            "index": 318, 
            "rating": "4", 
            "review": "Beautiful.. I really enjoyed seeing the peaceful and artistic side of Buenos Aires. It's a great place to take a date or just a casual walk with some friends. Very relaxing and enjoyable."
        }, 
        {
            "index": 319, 
            "rating": "4", 
            "review": "Great place for a glass of wine and walk to enjoy nature right in the Middle of Palermo. We stayed in Palermo Soho and needed something relaxing to do on one of the few days I didn't have anything planned. My wife and I enjoyed walking through the park, watching the ducks and the people."
        }, 
        {
            "index": 320, 
            "rating": "4", 
            "review": "Beautiful park in the heart of Palermo. Recommended for the flowers amateurs, this place is excellent for a walk and for reading a book smelling the beautiful blooms on the trees."
        }, 
        {
            "index": 321, 
            "rating": "5", 
            "review": "beautiful. Its a nice place to walk in a sunny day, beatiful flowers and nice place to see, great pictures and calm to take a time"
        }, 
        {
            "index": 322, 
            "rating": "4", 
            "review": "Beautiful Oasis. We happend through here today and were amazed by the beauty of this \"park\". The roses were well cared for, lawns well maintained and several of the geese had baby goslings hanging around their mothers.Only complaint is that there needs to be more benches under trees. It was almost 90 degrees when we were there and it was challenging to find some place to sit out of the sun."
        }, 
        {
            "index": 323, 
            "rating": "5", 
            "review": "Beautiful. Best rose garden we have seen on all out trips. Beats Butchart rose garden and covers a much larger area because it's just roses."
        }, 
        {
            "index": 324, 
            "rating": "5", 
            "review": "Really beautiful rose garden. This is a really beautiful part of BA. A little out of the way compared to most other tourist attractions but well worth getting to. The roses are kept in beautiful condition and it has some other nice parts around including a Greek style bridge."
        }, 
        {
            "index": 325, 
            "rating": "5", 
            "review": "Excelent. Very pretty, peaceful, romantic place. Its free to go there, its awesome to take pictures, to eat some ice cream, to watch the ducks... There is a little lake with pedal boats for renting..."
        }, 
        {
            "index": 326, 
            "rating": "5", 
            "review": "Beautiful in November. November is the ideal time to view it while the Jacaradas trees are in full blossom. The birds were nesting, the roses and lawns were manicured to perfection."
        }, 
        {
            "index": 327, 
            "rating": "4", 
            "review": "Old Buenos Aires revived. This very traditional \"Paseo\" is a must for everyone to take off some steam. Exploring it takes you back to the 19th century when it was designed and built."
        }, 
        {
            "index": 328, 
            "rating": "5", 
            "review": "Beautiful way to spend an afternoon. The rose garden is FREE! And not only that, it's beautiful, with lots of beautiful flowers (yes, of course lots of roses), and the smell is incredible. It's tranquil, with lots of benches and walkways and fountains. Wish I had've gotten a paddleboat. Lovely!"
        }, 
        {
            "index": 329, 
            "rating": "4", 
            "review": "Lovely public garden away from the hustle. Although we went in spring before many roses were blooming (oct 10) we still enjoyed a half hour stroll through this lovely rose garden. Plenty of taxis are available at the exit and it's free."
        }, 
        {
            "index": 330, 
            "rating": "4", 
            "review": "Lovely ride on the pedalos. We went with my daughter (5) and nephew (10) on the pedalos and had great fun. You have enough time to go round the lake once and not rushing at all. The Rosedal is very pretty to look at from the lake and also to walk around if the children let you.Great for a sunny day!"
        }, 
        {
            "index": 331, 
            "rating": "4", 
            "review": "Green haven. OK - we know - best to go see a rose garden in the right season. Not always possible so we missed everything in full bloom. That said, we were impressed with the fantastic layout, the perfectly kept gardens and the feeling of tranquility despite being in the middle of the city. The walk around is easy and nearly all the plants.trees are identified. Also take a stroll across the white bridge which is built over the lake."
        }, 
        {
            "index": 332, 
            "rating": "5", 
            "review": "Best workout circuit in the city. It is beautiful, conveniently located and practical. The rose garden is stunning and even more so, the Patio Andaluz. This is where i go for a good power walk around the lake, stretching under the trees and then just chilling out in the Patio if I have the time."
        }, 
        {
            "index": 333, 
            "rating": "5", 
            "review": "Paradise in the middle of the city. This places is a Nature Paradise whit a lot of trees and flowers that you can know. All this specimens all correctly labeled and identified . Is a very nice and quiet place to go with your family."
        }, 
        {
            "index": 334, 
            "rating": "5", 
            "review": "Beautiful oasis in Argentina. We went in July, so most of the flowers were not in bloom, but the garden was beautiful and is a must see!"
        }, 
        {
            "index": 335, 
            "rating": "3", 
            "review": "sunny day. beutifull for walking and relaxing, in the downtown, perfect area for the (porteños) forget the sounds of the city"
        }, 
        {
            "index": 336, 
            "rating": "5", 
            "review": "Great park to relax. If you are looking for a very nice place to relax this is a wonderfull spot. Next to this place you can find lots of green an colorful corners it's a huge park . You can rent skateboards, etc"
        }, 
        {
            "index": 337, 
            "rating": "5", 
            "review": "A breath of fresh air from all the concrete. After almost two weeks in just Buenos Aires, we and the kids yearned for some greenery. The lovely people at our hotel recommended that we visit \"Palermo Woods\" and check out the rose garden. We bought a blanket, some meats and cheeses and bread to make sandwiches, and had a relaxing day on a warmish Saturday afternoon people watching, and letting the kids run around and then nap in the grass. There are a lot of joggers, rollerbladers, and people on rental bikes if that is your sort of thing. Highly recommended!"
        }, 
        {
            "index": 338, 
            "rating": "4", 
            "review": "Beautiful parks lots to see, jog, walk, rollerblade. If the weather is nice, put on your exercise clothes and head down to this area. The round jogging track is full of sites and sounds on Saturday mornings!"
        }, 
        {
            "index": 339, 
            "rating": "5", 
            "review": "Bosques de Palermo. Beautiful, it is located inside Palermo parks, near the Jardin Japones that also worth the visit."
        }, 
        {
            "index": 340, 
            "rating": "3", 
            "review": "Beautiful place. Beautiful place, but nos as big as I expected. I went in the Fall - maybe it looks better in Spring."
        }, 
        {
            "index": 341, 
            "rating": "4", 
            "review": "Great, gorgeus garden. It´s a nice place to walk around in Buenos Aires, like a big lung in the middle of the city.\nGreat to spend a relaxing time, watching the beautiful colorful roses and doing exercise or simply walking around the lake.\nYou can´t miss this place is you go to Buenos Aires!"
        }, 
        {
            "index": 342, 
            "rating": "4", 
            "review": "Nice nature place. Enjoyed the Platenatarium (Spanish only) and the Rosedal park. Sad to see that it has a fence and it closes around 5pm."
        }, 
        {
            "index": 343, 
            "rating": "4", 
            "review": "Beautiful Rose Garden. Nice to spend a sunny afternoon enjoying a glamorous rose garden in the heart of Buenos Aires City."
        }, 
        {
            "index": 344, 
            "rating": "5", 
            "review": "Amazing site in-town. Beautiful gardens, and a very nice place where people go to excersice or just for a walk in \"Buenos Aires Woods\". Very clean and interesting promenade. Totally reccomend to take a walk around it !"
        }, 
        {
            "index": 345, 
            "rating": "4", 
            "review": "Beautiful and serene . . . rose garden, lake and island. Rosedal is a lovely, peaceful place to meander or sit and ponder as there are many benches available. It is comprised of over 3 hectares and YPF can be credited for its restoration and upkeep. Of its 18,000 rose plants, 5,000 were planted in 2008 by YPF. Enclosed within the rose garden is a special area for the New Roses. Several roses also have their awards displayed next to them. Monuments are dispersed among the area including over 20 busts of poets and writers. Around the fountain are several signs in both Spanish and English describing the sculptures, listing the names of the busts, etc. A bridge leads to a small island with bamboo that is only accessible via that bridge. The beautiful lake adds to the picturesque vision of this special space."
        }, 
        {
            "index": 346, 
            "rating": "5", 
            "review": "A favorite spot of mine. I visited this garden twice during my two weeks in Buenos Aires, the first time being brought by a friend from BA. I went back a couple of days later to take pictures and hang out. Had I been staying closer, I would have gone more. It was beautiful! Many people about but still felt peaceful. The whole park system within which the Rose Garden sits is great for a day of chilling out in a green space without leaving Buenos Aires."
        }, 
        {
            "index": 347, 
            "rating": "5", 
            "review": "Beautiful roses. great place to spend a summer afternoon, rent one of those pedal boats if you can, it was fun for me to do that.Walk around and enjoy the nature."
        }, 
        {
            "index": 348, 
            "rating": "5", 
            "review": "a green spot in the middle of the city. every time I go to BsAs I try to go for a run or a walk to el Rosedal. don't miss the walk inside the place where there are hundreds of beutiful different thpes of roses.You can then have a cofee at the Sivori coffee place and you could enter the Sivori Museum and enjoy this"
        }, 
        {
            "index": 349, 
            "rating": "5", 
            "review": "Excellet!. It was simply beautiful with surprisingly clean bathrooms too!"
        }, 
        {
            "index": 350, 
            "rating": "5", 
            "review": "Beautiful place. It is a beautiful place to visit. It is a big park with thousands of different kind of roses. A great spot for picturesque pictures!"
        }, 
        {
            "index": 351, 
            "rating": "5", 
            "review": "Beautiful gardens. This area is beautiful, relaxing and charming worth several photos and pleasant to walk through or roller skate around."
        }, 
        {
            "index": 352, 
            "rating": "5", 
            "review": "A paradise in Buenos Aires. This is one of the finest places to go in the Palermo Woods. Roses of different kinds all over. And the busts of many spanish poets (plus Shakespeare) all over. You can easily spend a morning or an afternoon there. I've seen nothing like it all over the world. Every sunday there are free music concerts in the afternoon. A must."
        }, 
        {
            "index": 353, 
            "rating": "5", 
            "review": "A charming and romantic place in BsAs. A marvellous place for couples. You can spend a nice afternoon with a special person among the roses and at the awesome Andaluz patio. Why not propose the love of your life here???"
        }, 
        {
            "index": 354, 
            "rating": "4", 
            "review": "Roses, Roses, Roses!. specially on spring and summer days, plenty of roses bloom around you. a nice spot to walk around, enjoy a book or just sit and smell the roses!"
        }, 
        {
            "index": 355, 
            "rating": "4", 
            "review": "Smells good! hehehe. The place is really nice. Full of flowers everywhere, the smell of roses is fantastic... you can just walk between the flowers, the gardens, see the sunset and the enormous quantity of birds of this place. The \"Paseo\" is also great, with seats and some view points. Very romantic place, good for couples or travelers who wanna be in a charmy place to see the sunset. I Recommend it.!"
        }, 
        {
            "index": 356, 
            "rating": "3", 
            "review": "Rose garden, beautiful but with low maintenance. It is breath-taking in parts and you will be amazed with the different roses.However, they could do a bit more maintenance on the place.If you are already here, also visit the Japanese Garden, the Botanic Garden and the Bosques de Palermo, all across the street"
        }, 
        {
            "index": 357, 
            "rating": "5", 
            "review": "Amazing Landscaping!!. Beautyfull garden great people , romantic place and good girls around it"
        }, 
        {
            "index": 358, 
            "rating": "5", 
            "review": "Pays the travel!. The Rosedal is a rose garden. It has roses from al over the world. That garden is very pleasant to see and to walk around just to find winner roses from past festivals. It worth the visit even if it is not spurt time."
        }, 
        {
            "index": 359, 
            "rating": "5", 
            "review": "For all rose lovers. This place have may prized roses and is a must if you like plants and gardening, but also if you like new frangrances. The garden is well kept and a good tour for both couples and families."
        }, 
        {
            "index": 360, 
            "rating": "5", 
            "review": "Roses galore. This is a beautiful park full of sculptures and roses. It's an oasis of tranquility and well worth a taxi ride to get there. I recommend taking a walk around the lake and watching people rollerblade, cycle, walk, and jog. Buy a chorripan and sit on one of the many benches and just soak up the atmosphere."
        }, 
        {
            "index": 361, 
            "rating": "3", 
            "review": "Don't go on a hot day!. Enjoyed the rose garden but most of the blooms were gone when we were there and it was very hot."
        }, 
        {
            "index": 362, 
            "rating": "3", 
            "review": "Nice place for rose lovers, but.... We went there on purpose, with the idea of starting our week with a refreshing and relaxing walk through thousands of different rose species. The place is lovely, but we saw it from outside only: it was monday morning, and on mondays (for some non understandable reasons, since it is a public place with free entrance) the garden is closed! As far as we could see, the place is anyway worth an hour or two of your time."
        }, 
        {
            "index": 363, 
            "rating": "4", 
            "review": "Pleasure for your eyes. Great choice for walking and touring the labyrinthine world full of roses. A beautiful way to see the autochthonous flora. Completely remodeled."
        }, 
        {
            "index": 364, 
            "rating": "5", 
            "review": "Romantic Roses!. Beautifully refurbished and laid out, the Rosedal is always a center of Palermo exercise buffs and romantic couples! Be sure to stop and smell the roses!!"
        }, 
        {
            "index": 365, 
            "rating": "4", 
            "review": "Roses and more roses. If you like them this is the place to go specially in spring."
        }, 
        {
            "index": 366, 
            "rating": "5", 
            "review": "The perfect park for a picknic and being active...a must for tourists.. As I live in Buenos Aires for almost a year now, and have visited the city severel times before - I have been to Palermo, and \"Paseo del Rosedal\" many times, as it is one of our favorite places in Bs.As. Even though we have to travel 1,5 hours to get there we do it often.It is a wonderful area, all year, but of course if you specificly go for the roses, then summer is the best time. I have been there 2 times in January 2012, and the atmosphere and the roses at spectacular. Everything is kept in a very nice way, and it is spot where you can soak in peace and quiet while your eyes are spoiled with colours and scents.Bring your own food and drinks for a picknic or buy some at the many places where they offer. You can rent rollers, bikes, etc. if you want to be active or just watch all the people who come there to excersice. The Paseo del Rosedal is a park which is a part of the big park complex in Palermo.It is a MUST VISIT for all tourists in this great city, no matter in which way you want to \"use\" it...:-))There are a lot of bus lines which reaches the area, so it is easy to go.Enjoy.........you will love it."
        }, 
        {
            "index": 367, 
            "rating": "5", 
            "review": "A MUST GO in Buenos Aires. and better yet if you can also bring your kids or nephews! what you can do there: rent bikes and go for a ride around the park, rent boats and go around the lake, bring your roller-blades and stroll around a perfect path around the lake. Go for a walk or run. Bring everything you need and organize a pic-nic, or buy a few things at the local kiosk and eat and drink anywhere on the grass. and last but not least, visit the museum overlooking the lake, it is a tiny museum with a lovely coffee place in the inner patio."
        }, 
        {
            "index": 368, 
            "rating": "4", 
            "review": "go when the roses are flowering. the big attraction obviously are all the different kinds of roses, including the new and special ones. So the ideal time to visit is when the roses are in bloom, in summer. The smell and all the lush colours are overwhelming. Without the blooming roses it is just a \"normal\" well kept park as there are quite a few in BsAs"
        }, 
        {
            "index": 369, 
            "rating": "5", 
            "review": "Rent Rollerblades at the Rosedale.. I lived in BA for a couple of months and really loved going to El Rosedal to rent rollerblades and blade around the loop. Weekends are more crowded, better to get there early because it gets really packed on the loop and you can run into bladers, families, etc. There are 4 or 5 different people renting rollerblades. Take a walk around and check them out to see who has the best skates. None of them are great, but they are functional and cheap, like 4 or five dollars per hour. There are people playing roller hockey, lovers strolling through the bridges and pergolas, and tons of futbol (soccer) games."
        }, 
        {
            "index": 370, 
            "rating": "5", 
            "review": "Best park in BA. Loved this place nice and quiet space in the busy city and well worth a visit, go on the weekend and Rollerblade or bike ride round the lake where you can mingle with the local people great fun."
        }, 
        {
            "index": 371, 
            "rating": "5", 
            "review": "The most beautiful park I have ever visited.. To be surrounded by rose gardens of all colors and sizes is priceless"
        }, 
        {
            "index": 372, 
            "rating": "5", 
            "review": "A feast for your eyes. After visiting the Japanese Garden of Buenos Aires (beautiful, by the way), we heard about the Rosedal, and decided to walk over. It was a 20 minute walk, along some busy avenues, until we arrived in a gorgeous wooden bridge that goes over a portion of the lake, and then takes you to the Rosedal. We were stunned by the quantity and variety of roses, the beautiful colors, the beautiful design of the garden, and the tranquility of the place. It's excellent for a romantic stroll, for photo enthusiasts, or just to spend a lazy afternoon reading a book. I highly recommend it."
        }, 
        {
            "index": 373, 
            "rating": "5", 
            "review": "Beautiful Rose Garden and Park. The Rosedal has been recently refurbished and it looks great with working fountains, solid green lawns and really gorgeous roses. It's a lovely thing to do during the day when you want a little quiet time."
        }, 
        {
            "index": 374, 
            "rating": "4", 
            "review": "lovely garden. My partner and I spent part of a late afternoon at the end of Febuary in this well-cared for garden. Even though it is the end of the summer here the plants were generally in great shape with most in full flower. The design is classic and formal with massed plantings of single varieties. So far it is the best garden we have seen."
        }
    ]
}