{
    "category": "Buenos-Aires", 
    "entity": "Palacio-Barolo", 
    "avg_rating_stars": 4.3478260869565215, 
    "review_count": 230, 
    "rating_stats": {
        "poor": 5, 
        "average": 24, 
        "terrible": 6, 
        "very_good": 63, 
        "excellent": 132
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "A building with a history and old, but well-maintained. I took the guided tour which went all the way to the top of the building (including the lighthouse room) and took in fantastic 360 degree views of the city of Buenos Aires. The guide was very informative in both English and Spanish, and explained the practical aspects of the still-functioning private offices as well as the decorative connections to Dante's Inferno. There is a small museum space (two rooms converted from former offices) that contains a few more artifacts of the building's long history.Tours are only offered at certain times, are limited due to the small size of the spaces at the top of the building, and sometimes book out days in advance, so you may wish to book your tour well in advance, especially if you are planning to go on a weekday or holiday.The Congreso of Argentina is just down the street across the park from the Palacio Barolo and offers free tours at certain times of day (I think the afternoon), so you may wish to do both in one day, if you plan it well."
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "Fascinating!. This is a fascinating building and tribute to the Divine Comedy. The tour is a must-do in Buenos Aires."
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "A not-so-well-known secret!. Most people living in Buenos Aires know about this place, but never been to it. This is one of the most amazing buildings I've ever seen. Designed by a masonic architect and ordered by a very rich guy, the place is dedicated to Dante Alighieri, intended to be his burial site (at least that was the owner's dream). The building is themed, it's all about the Divine Comedy and it's floors are divided into Hell, Purgatory and Heaven, so each section is decorated acordingly: Hell is very baroque, lots of details and symbolism. As you go up, level of detail is less and less and in Heaven, it's all very clean, with almost no detail.There's a guided tour (there's in english too) and they take you to the top of the building where there's a lighthouse in a very tall building with great sights of Downtown and the Congress building. Don't miss this place!"
        }, 
        {
            "index": 4, 
            "rating": "5", 
            "review": "Amazing night tour with tango. Their night tour extravaganza with tango is amazing. We were a group of 6 people and had the most amazing evening exploring the building with a knowledgable guide who spoke Spanish and English. We spend 2 hours looking through different areas of the building from bottom all the way to the top of the lighthouse. Being in the lighthouse was amazing especially at night with light being on and moving around. The hight also offered best views of the city at night which were amazing. Fantastic night tour which I would highly recommend if you have time. The tour is only selected nights per week so please check with their box office and book in advance as it gets very booked up and busy. There is a number of narrow steps to climb so not suitable for people who have fear of closed spaces, difficulties to climb or walk or scared of heights."
        }, 
        {
            "index": 5, 
            "rating": "4", 
            "review": "Intriguing Architecture (Money + Art = ?). Palacio Barolo built by two Italian immigrant friends (one with the money from his textile business, the other the architect) in 1923 was for a long time the tallest building in BA at 22 floors plus a light house. Build in Eclectic style, is the twin of Palacio Salvo built in Montevideo, Uruguay. The two partners, built this building using as a theme Dante's Divina Comedia. The basement and ground floors having been designated as Inferno (Hell), contain decorations representing Inferno. There are dragons, monsters and Masonic symbols everywhere. The next second through the 14 floors are designated as Purgatory, while floors 15 through 22 represent Heaven. THere is a light house, hosting a very powerful Klieg light designed to illuminate across the estuary of Rio de la Plata all the way to where it was to meet a beam from a similar light from Palacio Salvo in Montevideo. Alas, this plan did not quite work, though the lighthouse and its light are still functional today. It is worth a visit and the fee is nominal for a tour that is well conducted in Spanish, Portuguese and Englis by very competent young guides, while the spectre of Dante Aligeri (another guide, actor) pops up from time to time to recite a passage from his opus magnum, the Divine Comedy. There are daily tours (about 90 minutes) during the day and evening. The evening tours (8:00 pm) end up in an office set up as at the beginning of the 20th century, on the 20th floor where a violin is playing while the guests are offered a glass of wine. The 10 PM tour does not offer the wine or the violin but has a surprise in the light house. Worth visiting."
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "Fantastic views & Interesting Tour. We did the night tour, which included a tango performance and wine tasting at the end. The tour provided the history of the building, traveling throughout to review the hidden symbolism in the work. Our tour guide switched between Spanish & English, asking to know who the English speakers were beforehand so that he spoke directly to us, which I thought was a nice touch. Keep in mind it is a tight winding staircase to get to the top, but the views once you get there are incredible!"
        }, 
        {
            "index": 7, 
            "rating": "4", 
            "review": "Nice views, enjoyable tour. We reserved the tour via e-mail, very easy and without pre-paying. Specially worthy if you are interested in architecture, the tour was carried out in an hour and a half, you visit the first floors (the most decorated of the building) and the upper floors just up to the lantern (don't climb if you are claustrophobic, but you have very good views from the stage below as well). Last 6 floors are by stairs, because there is no lift, but the guide gives you plenty of time to climb if you need it. You have very nice views of Buenos Aires, and more than enough time to take pictures. At last you visit an apartment with furniture and photographs of the time when the building was finished. The guide was a very nice girl who told us all about the history of the building and made the visit very amusing (Unluckily I can't remember her name). The price, 160 ARS, may be a little expensive, but for me it worths the money."
        }, 
        {
            "index": 8, 
            "rating": "4", 
            "review": "Fascinating Tour - Brilliant views. Be ready to climb very narrow winding staircase to the top, but worth the view when finally get to the top. Curious history of this art-deco building on Av Mayo"
        }, 
        {
            "index": 9, 
            "rating": "5", 
            "review": "A hallmark for Buenos Aires. The palace has an interesting story and history, well integrated in the history of Buenos Aires. The architecture is very special and from the top of the building you can have a stunning view of the city. We had an excellent guide (young guy, I regret that do not remember the name), who gave all explanations in both Spanish and English and was very careful with many details. I strongly recommend a visit of Palacio Barolo!"
        }, 
        {
            "index": 10, 
            "rating": "4", 
            "review": "Well worth a visit, great views. My husband and I did this tour today and thought it was really worth while. We had great views from the 20th Floor and I enjoyed learning about how the building's design was inspired by the Devine Comedy.Would recommend booking in advance, easy to do by email as the company replied straight away."
        }, 
        {
            "index": 11, 
            "rating": "3", 
            "review": "Worth a visit. The building has a lot of potential, which is not taken advantage of.First, the lobby (ground floor) is the really only part of the building that has true architecture that one can link to the Divina Comedia. It seems that all the money was spent here; the rest of the interior is very simple. In any case because of its history the visit is worth it. I also recommend that the visitor go up the stairs to the very last floor. 6 floors up the stairs. It would have been more appropriate if it cost 120 pesos, and not 200. But, it is a nice visit considering its history."
        }, 
        {
            "index": 12, 
            "rating": "5", 
            "review": "One of the most interesting buildings in Buenos Aires.. Lot of marble and incredible architecture ,two elevators with cylinder shape and a powerful light on top of the building like a light house in the city."
        }, 
        {
            "index": 13, 
            "rating": "5", 
            "review": "ARCHITECTURE with great views and literary reminicences. A Great Great building inspired by La Divina Comedia of Dante. Go up from hell to Paradise. At the top, an extraordinary view of the city."
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "Great views and tour. Friendly ticket staff and a great guide showed us round speaking alternately in English first: just for me, and Spanish second for the others in the group. The tour really explains the history and design of the building very well and the original lifts you go up in are an experience in themselves. The balconies below the lighthouse have great views over the city but the narrow spiralling stair up to the actual glass lantern of the original lighthouse at the very top, 100m above the ground was a fabulous surprise and it's a really unique experience all round. Highly recommended to any visitor to Buenos Aires."
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "Very, very cool tour!. It was well worth the taxi ride and entrance fee of $200AR to do the 5pm day tour. The history and architecture are absolutely fascinating, and the exploration of the building and the lighthouse was amazing!! The tour was about 90 minutes, so plan ahead. We had heard it was only 45 minutes. Also, the last stair climb up from the 14th floor to the lighthouse level and the lighthouse itself is a doozy! The 8? flights of stairs are crazy narrow and tricky to navigate. But the view from both of the top levels is amazing as one would expect from the 2nd tallest building in South America!!"
        }, 
        {
            "index": 16, 
            "rating": "5", 
            "review": "Amazing views from the top!. I love getting a good view of a city, and I found Palacio Barolo online and decided to do the tour. I was not disappointed! I did the last tour of the evening at 6pm without booking in advance. I just walked up and purchased tickets before the time, and I am glad I did the evening tour because I got a gorgeous view of the sunset over the city. The guide was knowledgeable and the history of the building is fascinating. He even took great photos of everyone at the top with the city in the background and posted them on Facebook for us to download. Highly recommend for interesting history and the best view of Buenos Aires!"
        }, 
        {
            "index": 17, 
            "rating": "3", 
            "review": "Great building but the staff let it down. What a beautiful and unique building but what an unprofessional procedure to buy tickets, tried online several times but they respond a week later or not at all. Still waiting for a response. Eventually got our hotel to call and book. Upon arrival a very rude girl sitting in the booth did not say hello just barks out an amount. Tour guide was brilliant and spoke in English and Spanish and was very informative. Well worth the visit but do something about the e mail booking system and rude staff."
        }, 
        {
            "index": 18, 
            "rating": "5", 
            "review": "Great historic building!. We took the tour not really knowing what to expect. We found a great historic building. The tour guide was great speaking English (well) and Spanish. He had lots of information on the building's history. The lighthouse at the top was very cool. Be sure you are able to climb stairs though, you need to climb up six flights to the top. It does get a bit cramped as you get to the top as well. Overall great tour."
        }, 
        {
            "index": 19, 
            "rating": "4", 
            "review": "Interesting architecture. Quite unique and once the highest building in South America. Amazing architecture and if you do not have time for a tour, just to see externally and go into the main entrance will give you some idea of this palace."
        }, 
        {
            "index": 20, 
            "rating": "5", 
            "review": "a true jewel a must visit for Architecture lovers. Amazing, impressive, splendorous, you will not be disappointed!get your camera ready cause is a real beauty."
        }, 
        {
            "index": 21, 
            "rating": "5", 
            "review": "Amazing Experience!. Travelled to the Palacio Barolo with Mente Argentina study abroad group, had such a great experience, especially seeing the city at night. Sky scrapers for days! Such an interesting place to visit. Highly recommend!"
        }, 
        {
            "index": 22, 
            "rating": "4", 
            "review": "something different in Bs As. It´s just in downtown. It´s a different building. You can do the guided tour and you arrive at the highest part of it where you can see the whole city. The whole tour takes 50 minutes. It´s better to book a place in the tour. You will enjoy it. You can also do the night tour where you will taste some wine and watch a tango show."
        }, 
        {
            "index": 23, 
            "rating": "5", 
            "review": "Is a trip back to 1920, full of surprises and great views. This tour is a must do in Buenos Aires, unfortunately it only can be done Saturdays or Sundays. But really worth it 100 %. The history involved on the construction of this great tower building is very interesting, the panoramic views from the top balconys are amazing in the early afternoon the colours of the city that you can see are wonderful. As it is 110 meters above sea level the views are incredible. The light house on the top is worth the effort to get there."
        }, 
        {
            "index": 24, 
            "rating": "5", 
            "review": "Past glory !. Argentina used to be the 7th economy of the planet...in 1920. This building was built when the country had a great future. Worth to take a look"
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "Incredible views. My husband and I joined a group of 7 for the midday tour. We were the only non-Spanish speakers in the group. Our tour guide was not only knowledgeable but very friendly to us all and answered all the questions posed to him in both languages. He took lovely pictures of us all when we got to the very top and posted them on his group Facebook page for us to download freely. Completely recommend. I might add though, that a reasonable level of fitness is required for the final 6 levels of narrow circular stairs to the very top. So worth the effort."
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "Wonderful surprise. We took the guided tour and are so pleased we did. It was entertaining, fascinating and great value. There are so many gorgeous details that the designer thought out. I loved the dragon and condor gargoyles in the main floor lobby. The view from the top was amazing and a great way to see the city and how dense it is. We also loved the old-fashioned elevators (the cages) and the open balconies that allowed us to take great photos from up on high. Perfect view of the Plaza del Congreso from up there."
        }, 
        {
            "index": 27, 
            "rating": "3", 
            "review": "Building, view, tour guides. Yes! Worth 90 minutes. Not sure.... Palacio Barolo is a beautiful building with an interesting history. Our tour guide was energetic and gracious in accommodating my partner who was the only non-Spanish speaker in the group. The view from the top is stunning (at least part of it) but I am not sure it is worth a 90 minute tour... Part of the reason the tour takes so long is the fact that building has had no major renovations since it was opened in early 1900s. The elevators move at the same speed and only take 8 passengers at a time. Given that the building is still a fully operational office space, this could mean a fair amount of waiting (as you move throughout the building) if you are in a large tour group. If your time is limited in Buenos Aires you may want to consider using that 90 minutes elsewhere."
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "Great Views & Interesting Information. For about $16 US per person, this tour was a great value. The English speaking tour guide took us through the design and construction of the Palacio, which employs symbolism from Dante's Divine Comedy. From hell (the lobby, which is beautiful) through Purgatory (middle floors) and into Paradise (last few floors), we were provided with insights about the design throughout. It was a great supplement to the main event: the views.We were taken to a room near the top of Palacio Barolo and told we could open any balcony doors we pleased and step outside. Being from the overly safety conscious US, this was a wonderful surprise! There are plenty of balconies, just large enough to fit 3(ish) people. The balconies provide panoramic views of the city or the river, depending on your position.The guide then took us up a very, very narrow staircase to the apex of the building; the lighthouse. Though no longer in use as a beacon for ships, we sat for a short time for additional historical info, and snapped photos of the 360 degree views.The entire tour was about 90 minutes, and a great use of time. Finish that off with a walk to Cafe Tortoni for coffee and medialunas, and you will not go wrong."
        }, 
        {
            "index": 29, 
            "rating": "3", 
            "review": "Great expectations leads to great dissappointment. Reading reviews of the place I expected a lot more about the Divine comedy than what I got. The tour as such is pretty good, in the sense that the guide was funny and engaging and spoke good english. But the actual parallels to the Divine comedy was a bit of a stretch. Granted they wanted to do this up as a tribute to the great Dante, but other than a lot of math, there is hardly much art. Moreover, as the place is a commercial building there is not much lighting during the evening tour that we took. We did the tour plus tango show and the latter was an incredible let down. I am sure the dancers were very talented, but given that they had only a tiny space in which to twirl around ( I dont think I am exaggerating much if I say it was not more that a 10X12 space!) and we were all jam-packed into that tiny space, standing up, with them it was not at all an enjoyable experience! The views from the top, are spectacular. Like other reviewers have said, the last bit up to the \"lighthouse\" is up a set of increasingly narrow, concrete steps and not recommended for those who suffer from vertigo. All in all, I would say do the evening tour just for the view, dont pay the extra for any show and do it only if you have an evening to kill."
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Great view from the top. Very interesting Building. This around 100 year old building offers a great view over Buenos Aires. Definitely worth visiting!"
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "Dante would have loved it here!!. Exceptional tour done by a beautiful lad called Nacho. His hair was to die for and his passion for his job was very evident.The 6pm tour lasted an hour and a half. We had planned on taking in the cello concert @8pm Thursday nights but.....a misunderstanding due to the fact that I speak very little Spanish resulted in not repeating the tour @8 pm and waiting until 9:30 to hear the concert. Had I understood I would have just booked the 8pm tour. Next time? The tour is wonderful and Nacho made it even better! Cheers Nacho!"
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "For Lovers of Dante, a must see. . I booked a night tour, in which they turn on the light at the top of the building. It is a lovely view of the city, even on a rainy night. The guide was very good and spoke excellent English and was fun. The Building is beautiful and very interesting part of the BA city history and demonstrates the huge influence of Italian and Europe had on the city. And the wealth that was here."
        }, 
        {
            "index": 33, 
            "rating": "3", 
            "review": "Beautiful views of the city was the highlight. I was under the impression that we'd be going to a building that was very obviously relating to Dante's inferno with beautiful art depictions. Could have been my fault for not doing the research but it didn't seem too related to the Divine Comedy. It was more about the Free Mason symbols and the symbols that related to Dante. That being said, the building is beautiful, our tour guide was very friendly and did the tour in Spanish and English (I think you got more out of it if you speak Spanish), and the views at the top are beautiful. I think for 100 pesos more I'd do the tango show with wine and it would have been better."
        }, 
        {
            "index": 34, 
            "rating": "5", 
            "review": "Fascinating tour . You have to visit with a tour, but our guide was interesting & funny so that was fine. We went in the day & didn't pre-book. The views are great; just make sure you don't go during heavy rain as you can't go to the very top of the lighthouse. The building itself is also fascinating, and the explanation of the architecture is great."
        }, 
        {
            "index": 35, 
            "rating": "5", 
            "review": "What A View!! You MUST book in advance!!. We booked the 7pm tour the following day via email which was very quickly responded to. Sun was just setting but by the time we reached the tower it was dark and the city was sparkling with lights, so beautiful. It is a great place to get a high 360 view of the city. Tour guide was very friendly and knowledgable. Really recommend it!!"
        }, 
        {
            "index": 36, 
            "rating": "5", 
            "review": "Night Tour of The Barolo Building. This tour wasn't originally high on my list of things to do in B.A, but I just happened to be passing by the building 10 minutes before it started and they allowed me to join.Everyone else had pre booked, and as this tour gets busy I would suggest that you book in advance. The cost (March 2016) is 200 peso's for foreigners.The tour is conducted in Spanish (and English if required). The guide was knowledgeable, humorous and entertaining. She also took the time to explain everything clearly in English even though I was the only English speaker out of 20 people In the group. The architecture is symbolic and you get hear about the design concepts and how the Italian architects based many of the features on Dante's Divine Comedy. There are also some Masonic connections which are also interesting to hear about.The tour ascends through various levels in the building until you reach the viewing balconies and lighthouse at the top. I would recommend the night tour as its great to see the city lit up from a high perspectives and you also get to see the lighthouse working.If you have even a vague interest in history or architecture, or you just want to get a good view over the city to take some photographs then this tour is for you.This was one of the highlights of my visit to B.A. and I thoroughly recommend a tour of the Barolo Palace."
        }, 
        {
            "index": 37, 
            "rating": "3", 
            "review": "Difficult to see from the street. I'm not sure how people got the photos I have seen on various sites, as it was difficult to see this building from street level. Perhaps they walked further away, although from what I could see the Gothic architecture looked impressive."
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "Lighthouse in the middle of the city!. This building has great architecture and a fascinating story. Take the tour to enjoy the views from the lighthouse at the top of the building. Yes, there's a lighthouse in the middle of Buenos Aires. The tour guide took photos of us and posted them to Facebook later that evening."
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "Must see!. Is a beautiful building with a lot of history behind, the best time to visit is at night because you can go to the light house ans see all the city."
        }, 
        {
            "index": 40, 
            "rating": "4", 
            "review": "Good. Didn't spent a lot of time here. Was part of the walking tour. Guide said that there are 9 archs, 9 elevators inside, somekind of 9 numerical in everything inside. beautiful architecture.ity."
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "An arquitects dream!. Such a beautiful building, build according to Dante´s Divine Comedy. Get the guided tour, you´ll end up high up in the light house - if you´re afraid of hights this is NOT your place to be. A bit touristy but well worth it because of the insight on this impressive building."
        }, 
        {
            "index": 42, 
            "rating": "5", 
            "review": "Great tour; great guide. We first arrived too late for the last daily trip, so booked for 10am next day. We had no idea what to expect and went along purely for the view and photographs.We were immediately impressed with the guide. Anna-Maria asked if there were any English speakers, and then led the tour in two languages. And it was the full content in English, not just the truncated, stunted English version. The story and history were fascinating and the views all we expected. If you only have time for one thing in Buenos Aires ( as we did), then spend 90 minutes on the tour here."
        }, 
        {
            "index": 43, 
            "rating": "5", 
            "review": "Amazing view, great tour, do it!. We arrived at 10am ready for the first tour so only 5 of us. Really interesting, lovely guide who spoke perfect English. Cost about £7 each. Unbelievable view from the very top (but don't do it if you suffer from vertigo or are unfit as you won't enjoy the last bit!)"
        }, 
        {
            "index": 44, 
            "rating": "4", 
            "review": "Beautiful example of Argentine buildings. Saw from bus and went back for a closer look. Area hustle and bustle, but the grounds and building g are nice to see."
        }, 
        {
            "index": 45, 
            "rating": "4", 
            "review": "Most beautiful and fascinating building in Buenos Aires. We didn't spent a lot of time here, but if you enjoy unusual and beautiful architecture, this building is a must. Great style and grace and really a focal point of the city."
        }, 
        {
            "index": 46, 
            "rating": "4", 
            "review": "Beautiful building worth a visit. Interesting and beautiful building that you can't appreciate fully unless you take a tour. We took the regular building tour and learned and saw how the building was inspired by Dante's Inferno. The tour guide was knowledgeable and answered questions for us. The best part was the view of the city from the top."
        }, 
        {
            "index": 47, 
            "rating": "3", 
            "review": "Poor cousin of the MVD palacio. Both Palacios by Palanti should be visited. After the Montevideo one, the BA cousin was disappointing, run done and lack of show rooms! It was only thanks to cheerful Mara and other visitors in the group that we enjoyed the visit until the end!"
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "Impressive and intriguing . A must see if you love architecture and history. The entire design and interior is inspired by Dante's Divine Comedy, every detail represents an insight from this great and iconic piece of literature. A 360 degrees view from the top of the building is worth every penny!Not suitable for people who have vertigo and/ or can't cope in closed in and small areas."
        }, 
        {
            "index": 49, 
            "rating": "4", 
            "review": "An intriguing building.. This building is not a Palace in the strict sense of the word but a very intriguing building, which was a result of the imagination of architect Mario Palanti and paid for by Businessman Barolo."
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "Visit the top!. This is one of the two sister buildings. The other one is in Montevideo, Uruguay. The views from the tops are absolutely great!"
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "Wonderful Building. The daytime guided tour was awesome, full of interesting information. The building is beautiful and the view from the lighthouse is breathtaking."
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "Don't miss the night tour of this fantastic building!. This may be one of the most interesting and fascinating buildings in the world. Learn its history, the story behind its design as a homage to Dante's \"Divine Comedy\", and get an unbelieveable nightime panorama of Buenos Aires from the lighthouse 100 meters up."
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "Interesting and informative tour, plus great views!. This fascinating old building, created as a mausoleum and an homage to Dante's Divine Comedy, is not accessible unless you have an appointment at one of its businesses or purchase a guided tour. Tickets are a bit pricey, but the 1-hour tour is definitely worth it! You get to hear fascinating descriptions of the history and architecture, given by a guide who speaks excellent English (the tour is given simultaneously in English and Spanish). It requires some climbing -- about 6 stories -- but after that plus a ride in a gorgeous and historic elevator, you have the most amazing view of the city from a glass lighthouse. Warning: this is not a good tour for people who are claustrophobic (tiny, narrow staircases) or acrophobia (the balconies and lighthouse are extremely vertigo-inducing)."
        }, 
        {
            "index": 54, 
            "rating": "5", 
            "review": "Beautiful view of the city! Lighthouse is so fun!. The backstory is what really drew me to this place...coupled with its amazing architecture, of course! But what left a lasting impression was the view of the city from the top. And the lighthouse is tiny but so fun to climb, a truly great experience. My tour guide was awesome too, so informative and fun!"
        }, 
        {
            "index": 55, 
            "rating": "5", 
            "review": "Wonderful palace with nice view from the top. Each time when I am in BA, I go to visit Palacio Barolo. Simply for me this is a must to make elevator tour and take a view from the top on Congreso and Casa de Rosada ... There are also nice stories to hear if you take guided tour."
        }, 
        {
            "index": 56, 
            "rating": "5", 
            "review": "Astonishing building!!!. I was born in Buenos Aires and consider myself a curious person who knows the city very well but I must admit that the visit I paid to this palace some weeks ago was completely jaw dropping! My advice is to take the last Sunday tour to get an awsome view of the city at sunset and the lighthouse is lit. Yes, a lighthouse in the heart of the Buenos Aires! The building is said to be devoted to Dante Alighieri´s Divine Comedy. You do start from Hell, go up to the Purgatory and finaly reach Heaven in defined stages when all your feelings rise galloping through the beauty of the construction while observing the excellent condition the building is kept. Take your camera and a couple of hours to enjoy art, architecture, history, fantasy, and last but not least, a touching approach to Masonry. Believe it or not, definitely a tour to remember!!!!"
        }, 
        {
            "index": 57, 
            "rating": "5", 
            "review": "Beautiful building, has a story to tell.... Entrance hall can be visited, no fee to pay. In order to visit the whole building a ticket must be payed, but this includes a guide (available in different languages). It worth taking it!!!"
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "My favourite building in Buenos Aires. A tip. Look for the guide Eduardo Lazzari on the internet. Ask for a private tour on Sunday at 11am, 1pm, 3pm or 5pm. Fantastic tour. If you wand to do the night tour, from Monday to Saturday."
        }, 
        {
            "index": 59, 
            "rating": "5", 
            "review": "Nice view over the city!. I've taken a tour through Palacio Barolo which was done by an enthousiastic tour guide which spoke very good English. From the top of the building you have a very nice view over the city and is one of the only buildings in town which gives you a 360 degree view."
        }, 
        {
            "index": 60, 
            "rating": "3", 
            "review": "interesting architecture. The building has interesting architecture with an interesting connection to Dante's Divine Comedy but as a tour its a bit contrived and expensive for what it is. You get a good view of the city from the top"
        }, 
        {
            "index": 61, 
            "rating": "5", 
            "review": "Tour at Palacio Barolo. This is a very interesting building. We took this tour on the New Year eve day, so there were not too many people and we were able to walk in and book an organized trip 30 minutes prior. The tour guide was knowledgeable and spoke in both Spanish and English. This tour is not recommended to people who are afraid of height and able to walk up the very narrow stairs. The building itself is one of a kind, built back in 1919-1923. The architecture is very unique. You're able to go up to a 23 floor, from hell to heaven and take the most amazing pictures of the city."
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "Beautiful vistas. Beautiful vistas and well paced tour. Excellent overview and information on this historic landmark. Well worth a visit."
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "Brilliant tour . Really enjoyed the tour with the English speaking tour guide. The history of the building was really interesting and the architecture was gorgeous. The view from the top was extraordinary, so glad I went."
        }, 
        {
            "index": 64, 
            "rating": "4", 
            "review": "Unique views of Buenos Aires. The Palazio Barolo offers a fascintaing guided tour of this tremendous building which is full of symbolism from Dante's Divine Comedy and was formerly the tallesz skyscraper in Buenos Aires.The 360 degree panaromic views from the 'lighthouse' are a real highlight.Warning: the stairs to get to the lighthouse and extremely narrow and the headroom is low.The entrance price is 170 pesos and the tours leave regularly and take about an hour."
        }, 
        {
            "index": 65, 
            "rating": "4", 
            "review": "Regret not going up. I found and spotted this beautiful building just after returning from Montevideo, where it's sister building Palacio Salvo is on the main sq and you cannot miss it.BA has much more to offer than Montevideo and just the fact that such great bldg is in a middle of the street difficult to spot proves it."
        }, 
        {
            "index": 66, 
            "rating": "5", 
            "review": "Awesome Place. This is the sister Palacio to Palacio Salvo in Montevideo, very impressive architecture, our hotel (Tango de Mayo Hotel) we stayed in, is right next door to this Impressive Palacio well worth the fee for the tour"
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "Wonderful view and fantastic building. We booked the guided tour organised by Professor Eduardo Lazzari, a local eminence in architecture and history. The visit was very interesting, including the historical context of the rising of this building. Wonderful. The view from the lighthouse is the cherry on the cake! Don't leave Buenos Aires without this visit, it takes just two hours and is totally worth it."
        }, 
        {
            "index": 68, 
            "rating": "4", 
            "review": "Not for the faint of heart. The building is close to the Plaza del Congreso and you can just look at its rooftop from the street. But if you want to see the inside you have to take one of the different tours available - during the day or at nighttime. All tours require advance reservation - give them a call the day before your intended tour (call after 12) -, you cannot just show up and hope there's an empty spot (this may be good or bad). The price of the tours vary - I took the photographic one, which is only offered once a month, lasts 2 hours and costs 250 pesos.The tour allows for some time (normal strolling plus stops for photos) in the main lobby, then the antique elevators. After checking two of the floors (we were also able to see an office decorated a l'epoque), the visitors climb 6 floors (narrow staircase) to the viewpoint. Here are 6 doors and small balconies to see the view (from rooftops to Evita's face on the television building, from the River Plata to the airplanes taking off from Newberry and Ezeiza). The safety measures seem very lax so:* Please secure all items (including the visitor tag) and tie your hair before getting out on the balconies, the wind and air draft makes everything fly and you don't want to have to grab them. * Pay attention to the balcony doors - when more are open, the air draft makes then close unexpectedly and with a very loud noise - if you are on the balcony, that's enough to make you jump :-) or give you a heart attack. So you may want to hold the door while staying on each balcony.From the viewpoint, an even narrower (and low ceiling-ed) staircase takes you to the light room, where there's a small space to sit, almost directly on the glass walls and floor of the lighthouse. Move carefully, the mirror is rotating and there's no holding rail or support."
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "Amazing views. Done an evening tour with these guys - informative and with snacks at the end. To be honest, I really only went for the views and they were 100% worth it, given the clear evening we had. The views across all over BA are simply spectacular."
        }, 
        {
            "index": 70, 
            "rating": "5", 
            "review": "Spectacular views and a great trip to the past. El Palacio Barolo, built on the epic poem by Dante Alighieri, The Divine Comedy, attempts to represent the three stages of travel of the soul through Hell, Purgatory, and Paradise or Heaven. This is expressed in the wonderful sculptures, paintings and decorations throughout the building. Although it is still for private use, there are tours that charge a nominal fee. Best time is at night."
        }, 
        {
            "index": 71, 
            "rating": "1", 
            "review": "amazing sight. I lived in Buenos Aires and I never went inside this building but it is amazing looking on the outside."
        }, 
        {
            "index": 72, 
            "rating": "4", 
            "review": "Not if you don't like heights!,. Great tour to hear all the history but if you hate heights give the lighthouse at the very top a big miss!,"
        }, 
        {
            "index": 73, 
            "rating": "4", 
            "review": "Beautiful building, amazing view. This is truly an impressive building and well worth the visit, if only for the climb to the very top of it in the lighthouse. The view on BA from there is fantastic and you can make wonderful panoramic pictures. The guided tour is interesting but a bit limited as, besides the Dante/Mason story about the building, there is not much to see inside (nice elevators, old fashioned office). The real interest is the general view of the building and the view from the top. Rather expensive but worth it, if sunny. (We did the short day tour, there is also along night tour including a glass of wine and a night view of the city that might be worth trying)"
        }, 
        {
            "index": 74, 
            "rating": "5", 
            "review": "Beautiful. The building has a beautiful design, you can enter for free to chek the lobby - visitng the rest of the building is charged. Amazing structure very well preserved, elevators are very nice!"
        }, 
        {
            "index": 75, 
            "rating": "5", 
            "review": "If you love Il Dante you must visit it. When in Buenos Aires go to the Barolo Palace, a placefull of history and mystery. Luis Barolo an Italian who came to Argentina at the end of the 19th century and became a millionaire together with his architect Mario Palanti ,another Italian represented in this building Dante's Divine Comedy. As you enter t he place you get into the Inferno and as you ascend the stairs, which become narrower and narrower you get into Heaven. The building is 100 meters tall and at its top there is a lighthouse. You have marvellous views of the city of Buenos Aires from the top."
        }, 
        {
            "index": 76, 
            "rating": "5", 
            "review": "Divine Comedy, seriously. This building is so beautiful that I can spend hours just looking at it.It was designed with Dante's Divine Comedy in mind.The 22-story building is divided into 3 sections. Basement and ground floor are hell. Floors 1-14 are purgatory and 15-22 are heaven and the lighthouse on top can be seen from Montevideo, Uruguay, And guess what??Palacio Barolo has a twin brother in that city, called Palacio Salvo.I didn't do the tour, although I wanted to, but I did walk into the lobby and it is absolutely breathtaking."
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "The American Paris. This is one of those buildings in Buenos Aries which makes you feel you are in Paris. A must see in you are around."
        }, 
        {
            "index": 78, 
            "rating": "5", 
            "review": "Breathtaking view from BsAs. If you want to get a whole picture of BsAs, just go to Palacio Barolo. In addition a building is interesting with its history and architecture."
        }, 
        {
            "index": 79, 
            "rating": "4", 
            "review": "Palacio Barolo by night. Loved the guided tour with a knowledgable and charming guide. ... this building has a lot of significance. Fantastic view from the lighthouse at the top... took some fabulous photos. On the evening of our visit the guide was offering a glass of Argentine wine and olives as he chatted at the conclusion of the tour."
        }, 
        {
            "index": 80, 
            "rating": "3", 
            "review": "Cool historical spot.. Great views of independence plaza and the governmental area. The tour is about an hour long and only a few during the day so ensure you check the calendar before going. A cool historical building to visit"
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "Mario Palanti´s Masterpiece. I have visited this wonderful building inspired in the \"Devine Comedy\" by Dante Alighieri this year.Mario Palanti and Luis Barolo are the mentors of this masterpiece finished in 1923. It was declared an Historical Building in 1997. Many foreign visitors can have an exciting experience while watching various floors. Furthermore, you can climb 6 narrow stairs to the dome where there is a lighthouse and you can observe all the lovely and emblematic city. A wonderful sightseeing!! There are Tango lessons for the visitors and a poet reciting Dante Alighieri´s poems in an office decorated in the 20s. You can also taste a delicious wine while listening to live classical music. You should not miss this one or two hours traditional Show!"
        }, 
        {
            "index": 82, 
            "rating": "4", 
            "review": "Nice tour and great view over the city. We did the exeptional night tour. This tour includes a tour through the building with explication about the different details of the building. For me the greatest part of the tour was going up in the tower, with a amazing view over the city. The tour also includes some wine and snacks.A nice opportunity to see the city from a different perspective"
        }, 
        {
            "index": 83, 
            "rating": "4", 
            "review": "Interesting and unusual. In a city which surprisingly lacks viewing platforms or observation towers to get a panoramic vision of a city this is a good option. The views from the tower are certainly very good. The building itself is also very interesting as a piece of fantasy architecture as well as being simply a wonderful example of an early skyscraper (it was finished in the early 1920s). The disadvantage is that you can only visit with a guided tour, and the tours are quite expensive (for Buenos Aires) 175 pesos when I went. NB there are narrow flights of stairs to climb and descend during the visit ..."
        }, 
        {
            "index": 84, 
            "rating": "5", 
            "review": "Lovely building. Before our visit to Buenos Aires I read a book about the history of this building and its twin brother in Mar De Plata. As you get in the lobby you realise how amazing this building is"
        }, 
        {
            "index": 85, 
            "rating": "5", 
            "review": "Great attraction with incredible view of Buenos Aires. Palacio Barolo is a great attraction if you're interested in history and/or looking for a place to get a good aerial view of the city. The building was built around 100 years ago and has a very intricate design related to Dante's Inferno. The guided tour is great and the tour guide is very informative. Having done this tour in both the day and night, I can say either is a great choice. At the end of the tour you will have an incredible view of the city, which I found to be enjoyable in the day, as well as the night, for different reasons.WillSay Hueque Argentina Adventures"
        }, 
        {
            "index": 86, 
            "rating": "5", 
            "review": "Great surprise! A must see. The tour was a great surprise. We didnt really know what to expect and all i can say is that we spend a really nice hour. The story about the palacio is amazing and thomas, our guide, is a great storyteller. A plus is the beautiful view of the city after 6 floors in that not so nice stairs. Literally a \"stairway to heaven\" :D"
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "The most amazing view of BA. Take this tour and when you get to the top you will be rewarded with the most beautiful view of BA!! History of the building is interesting. They will give the tour in English. A must do!"
        }, 
        {
            "index": 88, 
            "rating": "3", 
            "review": "If you are so keen. For me personally the trip is well worth exploring from outside since the exteriors seemed much more creative and interesting than the interiors. What it provides is a view of BA from above and that is what is chargeable around here as the entrance is free. If you are up for a climbing experience then sure you could pay the price and catch a view and perhaps a good shot of the city. I personally did not find the view to be that exceptional."
        }, 
        {
            "index": 89, 
            "rating": "4", 
            "review": "Interesting tour of a really odd building. This fantasy like building was the obsession of an Italian immigrant who made it big in B.A. in the early 20th Century. He wanted to design an office tower that reflected Dante's Divine comedy and this is it. Tour was very amusing and the search light at the top (heaven) is a highlight!"
        }, 
        {
            "index": 90, 
            "rating": "4", 
            "review": "L´Inferno del Dante. Read L´Inferno,then take the tour. Enjoy its architecture, go up to the dome, climbing the narrow stairs, watch Buenos Aires from there then when you finish walk aling Avenida de Mayo towars the COngreso and keep walking aling the strees in that area. The y are not tourist strees anymore but the ones we Porteños work and live in. Then you can get a truer flavour of my city.If yolike to walk, go up to Rodriguez Peña street, turn to the right and in Rodriguez Peña 600´s you will find a small Parrilla where us Argentinias like to go for a simple , true asado meal and excellent French fries.Enjoy my city!"
        }, 
        {
            "index": 91, 
            "rating": "4", 
            "review": "Architecturally fascinating. An architecturally fascinating building is worth viewing from the street and wandering through its lobby. The tour though -- unless you have a burning need to see the chaotic layout of Buenos Aires from the top -- is unnecessary."
        }, 
        {
            "index": 92, 
            "rating": "3", 
            "review": "A lot of money for a nice view. Nice building, but probably not worth the $15 US (at black market rates) they charge for seeing the nice view from the top. That's what it really amounts to. Because all the architectural details can be admired from the outside and from the lobby. The tour adds nothing but the view."
        }, 
        {
            "index": 93, 
            "rating": "5", 
            "review": "Definitely worth a visit !. We visited El Palacio Barolo as part of our free guided walking tour with Buenos Aires local Tours and our guide Ceri told us about the history of the Italian immigrant who was at the origin of this building , its references to Dante's Divine Comedy and some interesting architectural details ! We were also told that it was possible to go at the top of the building (minimal fee) but unfortunately , we missed that visit ! Very interesting ; you can walk inside for free up to the elevators !"
        }, 
        {
            "index": 94, 
            "rating": "5", 
            "review": "To Hell and back!. This is a fascinating trip to the very top of this building with numerous references in the external and internal fixtures and fittings to Dante's Inferno. Our guide (apologies, can't remember his name) gave an entertaining and informative commentary in both English and Spanish. Tours up and down were once an hour when we visited (January), so he must be fit!Cost was about the equivalent of £8.Recommended, as long as you're happy with heights, don't suffer from claustrophobia and are reasonably fit, as the lighthouse is very high and the final flight of stairs up to it are steep and narrow."
        }, 
        {
            "index": 95, 
            "rating": "5", 
            "review": "Amazing building, AMAZING view. A must see if you visit Buenos Aires. A guide wearing 1920'ies clothes will tell the fantastic story of an Italian immigrant creating this building to 'save’ the Italian culture. The BIG FINAL is of course the 360 degree view from the top. Today BA has skyscrapers both taller and newer than Palacio Barolo - but not as centrally located as this one, which is why you'll find the best view here."
        }, 
        {
            "index": 96, 
            "rating": "3", 
            "review": "A trip to the past. Fantastic building, a short walk from Argentinian Congress and Casa Rosada, in the historic part of Buenos Aires. If you are lucky to spend a sunny morning in downtown Buenos Aires, you can go to Congress, and then walk down Avenida de Mayo on the way to Casa Rosada, stopping by Palacio Barolo."
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "It was the tallest building of South America. El Palacio Barolo, is in avenida de Mayo 1370, today is an office building , in Monserrat neighborhood, close to Plaza del Congreso and Pólice HQ, Was built in 1900's and was the tallest building of South America, this famous building appears in the movie Higlander 2.."
        }, 
        {
            "index": 98, 
            "rating": "1", 
            "review": "I should have trusted the comments here. My girlfriend and I were planning to visit this building because of the Divine Comedy references in the building. However,we saw the negative comments about the tour guides and we gave up the idea of visiting it. At least,we were not going to do the guided tour. We went to the building,the dragons,columns and some architectural details seemed very nice. So we decided to do it. So.the next day at 16.00 o'clock,we were ready to enjoy it. However, the tour guides had very strong accent in english as well as not being an enough one. As most of the comments says in here,i also understood the spanish part of the tour as much as I did in english part. But, I didn't really regret not having understood their english,because,they hadn't pretty much given any information that I didn't know,by the way, I knew very little about the building,just couple sentences. Their attitudes were not the best either, I haven't seen any tour guides who are less enthusiastic about their jobs in my life than them. It was very obvious that they were not taking it serious,not respecting the time and the money of the tourists. So, why would you make people who don't respect you earn money? I don't recommend this place at all. As for the view, if you can find another high building in BA, don't waste your money and time in this place."
        }, 
        {
            "index": 99, 
            "rating": "4", 
            "review": "TOURS ON THURSDAYS ONLY?. We saw this building during our walk on the Avenida de Mayo while on our 4-day visit of Buenos Aires. We entered the building and were impressed by the beautiful columns and ceiling. Asking the Security Guard, we learned that it is only open to the public one day a week, on Thursdays. Because we were leaving before Thursday, we could not visit it.We plan to go back to Buenos Aires and visit some of the attractions we were not able to visit. We're definitely including Palacio Barolo in our itinerary!"
        }, 
        {
            "index": 100, 
            "rating": "5", 
            "review": "Very interesting and wonderful view of the city from the top. I highly recommend a visit to Palacio Barolo. The tour is both in English and Spanish. There is a lighthouse at the top of the building which offers wonderful panoramic views of Buenos Aires! Keep in mind you have to climb a very narrow staircase to reach the lighthouse."
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "Memorable Sights. Do the night tour. So worth the cost to see the beautiful structure and then up to the lighthouse for a panoramic view of Buenos Aires. The wine is good too"
        }, 
        {
            "index": 102, 
            "rating": "5", 
            "review": "great sights, interesting tour. we did the daytime tour, which the guide offered in English and Spanish. Very interesting to learn about the history/architecture of the building. You also have an opportunity to go to a landing at the top to see some amazing views of the city, and then even higher to the light of the lighthouse."
        }, 
        {
            "index": 103, 
            "rating": "5", 
            "review": "Perfect option. This is a perfect option for those who want to do something else than a sightseen. The tour at night is superb. The guide was very nice. The wine was good as well."
        }, 
        {
            "index": 104, 
            "rating": "5", 
            "review": "Highlight of Trip. The guided tour is both informational and intriguing. The tour takes you to the top of the lighthouse, so if you are afraid of heights or small/tight staircases, you may opt to just visit the lobby. The story of the building is mystical and related to the Divine Comedy."
        }, 
        {
            "index": 105, 
            "rating": "4", 
            "review": "Something different. The pub idling is an Argentine landmark. We did the evening tour . Our guide Tomas was very knowledgeable. The views of the city at night were fantastic and it ended with a little wine tasting. Try to go on a clear night. They have also several day tours. You need to be able to climb 6 floors of narrow stairs to reach the highest point."
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "surprising and enjoyable tour. maybe one for architecture buffs, but the night tour was a surprisingly enjoyable part of my buenos aires visit, you work your way up to the top of the tower and get some surprising views of buenos aires which I wasn't expecting. and you get up close and personal with the lighthouse - and i mean really close! if you like getting up high and seeing a city from above when visiting somewhere new, I would recommend checking this out if you have the chance"
        }, 
        {
            "index": 107, 
            "rating": "5", 
            "review": "Interesting. The building itself is fantastic! They offer the tour inside which is both in English and Spanish. It's very interesting! you go all the way up and have a great view from the last floor!"
        }, 
        {
            "index": 108, 
            "rating": "4", 
            "review": "Great little experience . We went to this based on the recommendation of our hotel concierge. The tour is done in Spanish as well as English and was a really cute opportunity to do something off the beaten path.The host was energetic and pleasant and worked hard to insure that we English speaking people understood the dialogue.The piece de resistance was an opportunity to see the Southern Cross on the terrace.Also, we did this on our first evening in BA. As the tour began at 8PM and lasted about 2 hrs, it kept us going until dinner at 10PM!"
        }, 
        {
            "index": 109, 
            "rating": "1", 
            "review": "Very disapointing and a rippoff. if you have a posibility to have a view on BA from another tall bilding It is not worth at all to go to this tour. the way the guides tells about the builing and its history let you feel has told the story already hundreds of time, like a responder, without any passion, then the englis is not understanable at all - I understood with my little spanish about the same as in his english!what the guide them is telling about building, about Dante,the architect and its owner Mr. Barolo is just so minimal and poor, not more than just in a standart cityguidebook! The guide seems to have no interest in the building and its history (more in money) and he doesn't even ask the members of the tour if they have any questions,you dont see anything more inside the building than you can see for free in the lobby: first stop of the tour the galerie in the 4th floor with view down into the lobby -which we had seen already by beiing our ticket. then the tower with good view but thats all then!!! after the tower he guided us to his office which is a bit decorated in the style of 20th, there he makes promotion and want to sell you other nighttours (same tor at night?!) wine, traverarangments to Uruguay!!we were really very disappointed, we felt ripped of, in a tourist trap. 15$ is not cheap at all, the guy runnes his own business as he owns some space in the building an has an axclusiv acces to the tower."
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "Unmissable. Book yourself on an evening/night tour, and you won't regret it. The views of BA by night from the top are brilliant. There are quite a few steps to climb, but the view is worth it. Super interior design as well"
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "Excellent nighttime tour. The building is beautiful and definitely worth a visit. The guided tour with Tomas was in English and Spanish, and it was very informative. I was very impressed by just how much the Divine Comedy was integrated into the not only the design the building, but other details (i.e. the location of the building). We did the evening tour which included a great nighttime view of the city, a visit to the lighthouse where Tomas turned the light on, and a glass of wine downstairs in their office. I would definitely do the tour again. Disclaimer (so that you go well-informed): You will have to hike a few flights of stairs, and they do get narrow toward the top. Also, if you are afraid of heights (like me), you will find yourself a little nervous, but it's nothing unbearable."
        }, 
        {
            "index": 112, 
            "rating": "5", 
            "review": "Strange and lovely. The Palacio Barolo building has a wonderful, strange, and unique feel about it.. Paired with a fascinating history and the opportunity to visit hell, purgatory and heaven levels in one night, for me it's a must see in BsAs. Gaze out over the whole majestic night cityscape via 11 balconies facing out in all directions. For me, the tour would be a bit better if it was more spontaneous, as it feels (and is) completely canned, but the guide is friendly, warm and helpful if you ask him questions directly. Go and enjoy the wonderful weirdness of el palacio."
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "An amazing building inspired by Dante Alighieri´s The divine comedy. there is a wonderful guided tour and you will discover also a fantastic view of the city from the roof top where there is also a light house."
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "Best view of the city from the paradise. Built according to Dantes Divina Comedia the palace in itself is a top atraction in Buenos Aires, but the best of it is the terrific view from the tower! Although to get into paradise be prepared to walk lots of small and steep steps!"
        }, 
        {
            "index": 115, 
            "rating": "5", 
            "review": "Incredible building. If you are an architecture fan, this is a visit you must do. This building, was inspired on Dante´s Divine Comedy, and is really one of a kind. It is located in Avenue de Mayo, surrounded by many beautiful buildings built betwen 1895 and 1930."
        }, 
        {
            "index": 116, 
            "rating": "3", 
            "review": "Architecture based on Dante's Divine Comedy. Interesting building at Avenida Mayo. It's particular architecture can give you good photos. When I went there it was forbidden to get inside the main hall where you can find gargoyles."
        }, 
        {
            "index": 117, 
            "rating": "3", 
            "review": "Building is great, tour is not!. However you have to pay the AR$ 110 to get in. Don't listen to the guide - just look! Tour guide could care less about the building - is just a cash grab for them. Lots of stairs (just so you know), the the, very brief, view is worth it. I knew more about the building going in, than I learned from the \"guide\". Unfortunate."
        }, 
        {
            "index": 118, 
            "rating": "5", 
            "review": "Amazing architectural masterpiece. Built by Italian architect Mario Palanti in 1923 and located in central avenida de Mayo, it is unique and well worth a visit. Visits are also in English and have to be booked in advance, see http://www.pbarolo.com.ar/sitio/en/visitas-guiadas"
        }, 
        {
            "index": 119, 
            "rating": "5", 
            "review": "A Great Tour and a Great Tour Guide as well!. I really enjoyed the tour given to me by Tomas Tharigen.It was excellent and I really enjoyed the view at the top as well....It was all very interesting, unique and exciting....Thank you so much....Howard Paul Shore"
        }, 
        {
            "index": 120, 
            "rating": "4", 
            "review": "Dante in South America. I liked it very much beacause i am a fan of DAnte Alighieri's DIvine Comedy, which symbols the structure of this Palacio referes to. From above you can see all Buenos Aires."
        }, 
        {
            "index": 121, 
            "rating": "5", 
            "review": "A must see for visitors. A guided tour the likes of which we would want to have more often. If you do go to Buenos Aires, this is one of the things you want to do."
        }, 
        {
            "index": 122, 
            "rating": "2", 
            "review": "Overpriced tour. Granted, it's an amazing view, and if that's what you're there for, then ignore the tour and just enjoy the sight from the top. But I felt like our tour was really phoned in — it really felt like it was being narrated from a memorized script, and I found the guide's English hard to understand. (I got almost as much from his Spanish and I'm far from a fluent speaker. I also fully appreciate how hard it is to speak a language you didn't grow up with, but every other English-language tour we took in BA was easier to understand.) Compared to the cost of other tourist activities in town, your money and time may be better spent elsewhere."
        }, 
        {
            "index": 123, 
            "rating": "2", 
            "review": "Story behind the building is awesome.... but the tour of the building itself, not so much. The only good thing was the amazing view you get toward the end of the tour. I love history and the little intriguing historical facts behind buildings so expected AMAZING architecture and internal design. It's not unfortunately. So, if you want to pay go check out the views (elevators go up to a certain point, then you have to walk 7 floors up for the first viewing spots, then one more floor for the top) but don't expect much from the tour nor from any beauty internally."
        }, 
        {
            "index": 124, 
            "rating": "4", 
            "review": "Weird, but an amazing view. Pretty strange idea to have a building designed to reflect Dante's Divine Comedy. Didn't think too much of hell, but heaven was terrific -- fantastic view from the top of the building at night. Watch your head climbing up, but it's well worth the climb."
        }, 
        {
            "index": 125, 
            "rating": "5", 
            "review": "Gracias Thomas!. I loved it. We went with my husband as a date. The building is amazing and very well take care of. Thomas was very knowledgable and you can see how much he enjoys doing his job.The view of Buenos Aires is unique from this place. Totally recommended for adults."
        }, 
        {
            "index": 126, 
            "rating": "5", 
            "review": "Outstanding view point for Congresso. Well organized guided tour. The prebooking is preferred but it is not must. Friendly, dedicated and professional tour guide with good command of English. Well Don Tomas! Keep up the good work.Best wishes from Hungary"
        }, 
        {
            "index": 127, 
            "rating": "5", 
            "review": "Misterious and beautiful skyscraper!. This place is an old classic architectural wonder! The construction was based on a famous book story... From the top you have an amazing view of the city at night. After visiting it you can go to one of the several bars & restaurants that you have around.Look for some information about it. You will not regret it."
        }, 
        {
            "index": 128, 
            "rating": "5", 
            "review": "Good for Dante Fans. What is interesting about the place is that the whole building is based upon Dante’s famous poem Divine Comedy and they have maintained its concept in its construction. The place is very unique and interesting and takes a good amount of time to enjoy it. The place can be a bit scary for the stairs of the place are really notorious and can prove a little tedious for climbing and covering each level of the place. The brothers who run the place have made sure that everyone who visits the place has something to enjoy and take back. The top level provides you with a beautiful view of the whole city and this is the best place to capture it. They also have wine sessions but confined to a particular day of the week. They also give a guided tour to the whole concept and the artifacts displaced around the place."
        }, 
        {
            "index": 129, 
            "rating": "4", 
            "review": "If you're wanting a good view.... I paid 80 pesos for a tour at 4pm. The tour takes about 45 minutes and you spend about 25 of those at the top taking pictures and admiring the view. I personally didn't care much for the tour side of it, I didn't really pay attention to the guide, I just wanted to get to the top with my camera to take some pictures. It depends on what you expect, for about £8 I think it was worth it for pictures that you keep forever, plus they don't exploit tourists because a local would pay the same price.I suggest yo go on a clear day/night and take plenty of pictures videos to get the most out of your money."
        }, 
        {
            "index": 130, 
            "rating": "2", 
            "review": "It's hard work to make a building this good so bad!. We did the night tour and had very high expectations given that we already knew a bit about the history of the place, which is so interesting, however our experience was so disapointing. We had about 30 people in our tour which made it almost impossible to hear the guide who had somewhat limited English. The tour is billed as English language. The history lesson was rushed and really thin on detail. We started in the tour in the lobby, moved to the fourth floor, then the fourteenth, then the top, all in about 25 minutes. At the top we spent significant time waiting around for something to happen. After the top we went down for a glass of wine and then left.Overall the building is very worth seeing but the night tour is pretty terrible for its disorganized feel and lack of interesting/informative dialogue. For such an intriguing structure to get such a poor tour is really a shame. A pamphlet would have been far better than the \"guide\".Maybe try the cheaper day tour?"
        }, 
        {
            "index": 131, 
            "rating": "5", 
            "review": "a weird gem. a whole building constructed in analogy with the Divine comedy from Dante Alighieri!in 50 minutes, you'll see a unique piece of architecture. The view from the top is unbelievable and great to take unique pictures.There are narrow passages that might test big people, and quite a fe stairs. Each month, on the 25th, the light house is lit. Just imagine!ANyway, you can sit in a lighthouse, all made of iron and glass, a birds nest."
        }, 
        {
            "index": 132, 
            "rating": "4", 
            "review": "Very Cool Experience- Go at Night. We went on the night tour and had an awesome time. The Guide speaks perfect English and describes all of the cool Dante symbolism that exists in the building. The building itself is also very pretty. It's cool that it's also a functioning office building. Then you go to the top of the building where the view is incredible (if you're claustrophobic though you may want to skip it- you have to walk up about 6 flights of verrrry narrow stairs). Then there is also a little tower that you go into where the guide turns on a big spotlight which is very old and interesting to see. Afterwards you go into a small room for some wine and olives, which is fine but nothing impressive. I gave it a 4 rather than a 5 because it wasn't the most amazing attraction I've ever seen, but it was definitely a very fun experience and something to try while in BA."
        }, 
        {
            "index": 133, 
            "rating": "4", 
            "review": "The view is worth it. If I should name only one of the architectural attractions of Buenos Aires it would be Palacio Barolo. Interesting architecture, good guide with interesting story in decent English and fantastic view from the lighthouse on the top of the building.I recommend to go to the very top if you are physically capable of doing so."
        }, 
        {
            "index": 134, 
            "rating": "5", 
            "review": "Worth the climb!. I was skeptical about doing this but my girlfriend insisted we do it. I am so glad we did! The views are amazing and the whole premise of the building being based on Dante's inferno is really interesting. The best part is finishing in the lighthouse at the very top. Very much worth the climb to the top. The light house gets turned on at the 25th of each month."
        }, 
        {
            "index": 135, 
            "rating": "5", 
            "review": "Amazing building with a lovely cu pule.. Nice to know that this building has a tween in Montevideo made by the same architect. Try to get a view from another building to see the top."
        }, 
        {
            "index": 136, 
            "rating": "5", 
            "review": "Dante's Divine Comedy’s cosmology in a building!. Palacio Barolo is a landmark office building (including travel agencies, a Spanish school for foreigners, a Tango clothing store and offices for accountants, lawyers, etc.), located on 1370 Mayo Avenue, in the neighborhood of Monserrat, near the National Congress. When it was built it was the tallest building in South America. Built in Eclectic style, it was declared a National Historic Monument in 1997.Structure of the building: designed in accordance with the cosmology of Dante's Divine Comedy. The 22 floors (as the cantos in Dante’s poem) are divided into three \"sections\": the basement and the ground floor represent Hell. After that (floors 1-14), the Purgatory. Finally, floors 15 to 22 and the lighthouse on the top, Paradise. It is amazing how light plays a more important role the upper you climb. A clear symbol of Heaven/Paradise. The Lighthouse: used to be used for optical communication with a twin building in Montevideo, Uruguay (Palacio Salvo).Some Gothic and Islamic reminiscences are found. Both the architect and owner’s plans were to bring Dante’s remains to be buried in the Palace, something which – unfortunately – could not be achieved. What the ticket includes: a guided tour and a plus: all the way up to a glass light house. However, be warned: the small narrow passage of circular and twisting stairways, iron-gated elevators and tight passages leading to the top are not for everyone. What’s more, it can get claustrophobic. But once you get on top, if you do, the views – from tiny balconies - are spectacular! Afternoon and evening guided tours. The latter includes wine tasting, so it is a bit more expensive. Tip: pay attention to details, including those of the façade. Guides: VERY friendly and flexible (with had a problem with our reservation. However, they were so nice. They even provided me with their mobile phone numbers. They are two brothers, related somehow to the building).HIGHLY recommend. Should be on your “must-see” list. Wonderful panoramic shots! Eye-popping definitely!"
        }, 
        {
            "index": 137, 
            "rating": "4", 
            "review": "Take the tour. We walked in to look around and were debating whether or not to take the tour (I believe they are only offered on Tuesday and Friday afternoons), but decided we would do the tour. The building itself is very interesting architecturally and the guide was very knowledgable about the design and rationale for the different features. But the kicker is really the lighthouse at the top- incredible views of the city that really were the highlight. If you decide to take the tour for no other reason, do it for the view up top!"
        }, 
        {
            "index": 138, 
            "rating": "3", 
            "review": "Night tour experience. We went on the 8pm night tour. The guide was knowledgeable and provided the tour in Spanish and English - although his explanations in English were always much shorter, so we're left wondering what he left out in our version. We would recommend a quick wikipedia search on Dante's Divine Comedy before the tour just for some context. You certainly don't need to have read it, but to have a basic understanding will be helpful.There are some wicked stairs so if you are really out of shape or afraid of heights, this might not be the best use of your pesos. Otherwise, a very interesting tour and worth the effort and cost."
        }, 
        {
            "index": 139, 
            "rating": "4", 
            "review": "Surprising building. One of Buenos Aires greatest buildings. Full of interesting stories . Its architecture and design was based on Dante’s Divine Comedy. There are many stories about its top of the roof lighthouse, amongst them one thattells that its beam was used to announce the result of the Jack Dempsey vs Firpo heavyweight fight back inthe 20’s when there were few radios and mostly low roofs over BA."
        }, 
        {
            "index": 140, 
            "rating": "4", 
            "review": "great views. The guide explained everything very well in English, but not having read Dante's divine comedy I didn't fully appreciate it. Well worth going just for the views."
        }, 
        {
            "index": 141, 
            "rating": "5", 
            "review": "Dante, lighthouse and more. such a place.. deserves to be seen, to make the guided tour and know more about the weird, wonderful story behind the architecture . awesome view of Buenos aires , as well"
        }, 
        {
            "index": 142, 
            "rating": "4", 
            "review": "Worth the 8 flights of stairs. We enjoyed this AR$65 tour. The guide is a bit difficult to hear, and a knowledge of Dante's Inferno would help. The building is not that interesting beyond the lobby (which is free), but the view up top is priceless. You could skip the last two floors if you are claustrophobic. Overall, we enjoyed it. We are going back for the night tour later."
        }, 
        {
            "index": 143, 
            "rating": "5", 
            "review": "Symbolic architecture - lobby arcade worth a visit. We didn't have time for a tour, but visited the lobby of this fantastic working office building one morning to photograph the dome, Dante quotations, and grotesque lamp ornaments. The guards didn't seem to mind us snapping away. We used Eyewitness Travel's Top 10 Buenos Aires guide to find our way here. That book's map under Avenida de Mayo makes it look like it's directly across from Hotel Chile; it's not, but is distinctive enough that you should have no trouble finding it."
        }, 
        {
            "index": 144, 
            "rating": "5", 
            "review": "Fantastic expereince. This was a memorable tour. The building is fascinating and the guide brings it alive. He is very friendly and entertaining and explained everything in both English and Spanish. The views of the city are amazing and the overall it's a great trip."
        }, 
        {
            "index": 145, 
            "rating": "4", 
            "review": "Impressive architecture. Inspired in Dante's \"divina comedia\" the seven circlesGreat light house at the top. It's turned on once a month. there's a tour"
        }, 
        {
            "index": 146, 
            "rating": "5", 
            "review": "Unique! Especially at night.. We did the evening tour at 8 PM on Wednesday. There were just 7 of us, which included our group of 4. The guide Tomas was excellent in both English and Spanish and the entire tour very fascinating, interesting and very entertaining. The absolute highlight was the short trek up the stairs to the light tower, in which we got an amazing 360 degree view over Buenos Aires and got to witness the lighting of the actual light house. Amazing experience. The wine tasting in the 1920 style office was a perfect end of a very nice and MUST DO experience in Buenos Aires."
        }, 
        {
            "index": 147, 
            "rating": "4", 
            "review": "Great tour guide, building a bit disappointing, fantastic views. I went for a tour on a Monday at 4pm. I recall the cost was 60 pesos. Our tour guide, Tomas, was excellent in both Spanish and English. The tour took about 35-40 minutes. We were about 12 people.The Palacio Barolo is a functioning office building inspired by Dante's Divine Comedy. Most of the representation is symbolic. For example, the number of floors would equal the number of chapters, etc.The building is divided into 3 regions to represent Heaven, Purgatory, and Hell. The ground floor is supposed to represent Hell with designs in the floor symbolizing the fires of hell, and certain wall ornaments depicting dragons and demons. The architect had intended for the building to house the ashes of Dante, but his petition to the Italian authorities was denied; so the building lost part of its raison d'être.The middle floors represent Purgatory, with a central atrium enabling both views upward and downward. These are mostly boring offices. There are a few flights of stairs to climb.Heaven is represented by the observatory deck at the top of a very narrow, railless staircase. I do not recommend this climb for anyone with a fear of enclosed spaces or any morbidly obese person. At the top, there are small balconies from which you can take the best panoramic photos of the city. That alone is worth the cost of admission, although there may be shops on higher floors that have similar views for free.Tomas recommended other sights in the city, especially the excellent El Zanjon.I would not call this a must-see, but certainly worth it if you're in the Congreso area already. The tours combined with a wine tasting sound interesting as well."
        }, 
        {
            "index": 148, 
            "rating": "4", 
            "review": "One of the strangest and most fascinating buildings at least externally. This is a very strange building dating to Art Deco/Art Nouveau period. Built by an Italian architect, the central tower is a most impressive structure on Avenida de Mayo. The building has elements of Art Nouveau, neo-Gothic, and neo-Romantic designs. The building was influenced by Dante's Divine Comedy. The floor of entrance of the building has patterned medallions to give the impression of fire in hell. There are statues of grotesque gargoyles and other strange animals as well as a statue of Dante. There are references to Purgatory and Heaven on various fllors of the building. The exterior and lobby are however more impressive than the interior. The organised tour includes a ride in a really old fashion lift that takes you to the rooftop from where you get an uninterrupted 360° view of Buenos Aires and the views up and down Avenida de Mayo including that of the nearby Congreso, are very impressive.Read more: http://www.frommers.com/destinations/buenosaires/A34261.html#ixzz2RfTDebJF"
        }, 
        {
            "index": 149, 
            "rating": "4", 
            "review": "Unique building. From Avenida Congresso, you can already appreciate this unique building. We stepped into the building and wanted to know more about it, though it was too quiet and looked like we were trespassing. We didn't know that guided tour is offered, and we ended up with no time to go back. Next time!"
        }, 
        {
            "index": 150, 
            "rating": "5", 
            "review": "Best view of Buenos Aires. The Palazzo is located in the heart of the city in one of the most famous avenues. Visiting the Palazzo is an amazing experience that should not be missed. Revise your copy of Dante's Divine comedy before you go."
        }, 
        {
            "index": 151, 
            "rating": "4", 
            "review": "Enjoy Buenos Aires from above. I always wanted to visit Palacio Barolo, and did it after all. The tour is conducted both in english and spanish, and tells a little about the history and creator of the building, and also its link to Dante's La Divina Comedia. You get to see Buenos Aires from the lighthouse they have on top of the building, which was meant to connect with the one in a similar building, built in Montevideo, Uriguay. Great to the the night tour, and at the end you get to taste a tasty awarded malbec"
        }, 
        {
            "index": 152, 
            "rating": "5", 
            "review": "had to see this. Impressive and kept in a lot better condition than the Montevideo sister. Great history and architecture."
        }, 
        {
            "index": 153, 
            "rating": "4", 
            "review": "Another amazing building. Don't miss a tour of this neo-gothic masterpiece. A night tour if you are there Thurs or Fri. Day tours more often."
        }, 
        {
            "index": 154, 
            "rating": "4", 
            "review": "Great views of the entire city from the top. The last time we visited BA we missed this tour because it is only given on certain days/times. This time we planned specifically to make an afternoon tour and really enjoyed being able to go up inside this amazing building. The tour is given in Spanish and English at the same time and consequently the tour group was a bit large so stay near the front to hear what is being said. There is a climb of six flights of stairs to see the views and then another climb if you want to go up in to the lighthouse. The climb to the very top will not be a good idea for anyone who has a fear of heights or small spaces. For those that don't, the chance to sit inside the lighthouse was amazing! Apparently the night tours (more expensive) include the chance to drink some wine on the way down. The tour guide, Tomas, was very friendly and personable and I would recommend this tour as a good thing to do during your visit to BA."
        }, 
        {
            "index": 155, 
            "rating": "1", 
            "review": "Disappointment. Despite being a very unique building and giving you a fantastic view of Buenos Aires, I still feel disappointed. The way the inspiration from Dante's Diving Comedy is reflected is a lot less than I expected and the aerial view of Buenos Aires is slightly underwhelming."
        }, 
        {
            "index": 156, 
            "rating": "5", 
            "review": "Fantastic experience. This is a very beautiful building, both from the outside and with the 'story' behind the inside. Lots and lots of stairs, and NOT for the claustrophobic on some of the spirals, but worth the effort of getting up to - and in - the lighthouse at the top. Wouldn't recommend it on a bright hot sunny day, though, unless you've got your water with you."
        }, 
        {
            "index": 157, 
            "rating": "1", 
            "review": "Palacio Barolo Tour - Waste of Time and Money. The building is beautiful and every guide book will give you the history of this famous building BUT the guided tour at a cost of approximately $15 is not worth your time. The guide added nothing that wasn't in our guide book and the 6 flights of stairs that you need to climb isn't worth the energy it takes. Have a look in the lobby and take photographs of the outside and don't bother with the tour."
        }, 
        {
            "index": 158, 
            "rating": "4", 
            "review": "Outstanding building. An old building built on themes from Dante Divina Commedia! Every floor a surprise, up to the very top where you sit in a little light house and have all of BA at your feet."
        }, 
        {
            "index": 159, 
            "rating": "3", 
            "review": "Don't make the tour a priority. The building is fascinating to look at and most guide books give you sufficient background to appreciate its quirkyness. The guided tour however we found very mediocre and were sorry we took the time and money to bother. It cost around $US12 and while the views were amazing the guide was almost incomprehensible and seemed totally bored with his own script. We were rushed through the building and felt like we were on an assembly line - too bad. Also there is a lot of climbing so if you are not okay with many floors of narrow stairs then beware."
        }, 
        {
            "index": 160, 
            "rating": "3", 
            "review": "Nice View, historic Building. We had the day tour on saturday afternoon.View: Fantastic view over buenos aires. Get a camera that can make some kind of panoramic picture - incredible.Architecture: Very interesting architecture inspired by Dante's \"Göttliche Komödie\" - make sure you have some basic knowledge of it upfront, otherwise its not that interesting...Tour Guide: Honestly, it was very hard to understand our tour guide because he had a very strong accent. Although its obviously not on purpose, it makes it quite hard to understand him, even if you are very familiar with english ;-)Value for money: If you are very interested in Dante- inspired architecure or you are seeking for an excellent view over buenos aires - then its worth the almost 10€ per person. if not, don't do it ;-)"
        }, 
        {
            "index": 161, 
            "rating": "5", 
            "review": "Beautiful and magnificent building. I love the architecture and took the English speaking afternoon tour. There are stairs, so be prepared. The building is a Buenos Aires treasure. Even though the tour guide speaks English with a strong Spanish accent, it is a great experience to see the inside of one of the most beautiful buildings in Buenos Aires."
        }, 
        {
            "index": 162, 
            "rating": "5", 
            "review": "A really non usual building. I think this building perfectly could adapt for a Batman movie , is really a Gotic City Building . In fact ,its inspiration , The Divine Commedia from Dante Allighieri, and the propose of the designer and first owner ( to be a secure destination for Dante`s remains in wars times ) made the all Building a fascinating think. The view at top is another interest place, but I think everyone will enjoy the visit to this building"
        }, 
        {
            "index": 163, 
            "rating": "4", 
            "review": "Insteresting Architecture in BA.. Inspired in the \"Divina Commedia\" ,this building in the middle of BA is worth to be visited. Important: Palacio Barolo has tours every hour, Mondays and Thursdays."
        }, 
        {
            "index": 164, 
            "rating": "5", 
            "review": "Very cool. A few things you should know before going there.. Here's a few things you need to know. There is a day and and an evening tour, an evening one is twice as expensive( about $25)but it also includes going all the way up to a glass light house and \"wine tasting\" For starters, the views are actually better during sun light because BA isnt exactly New York or Paris when it comes to how well its lit during the night. Second, the \" wine tasting\" consists of just one kind of wine and i personally didnt care too much for it, it was way too strong and bitter. Also, if you are over 6 feet tall and/or weight over 250 pounds you may simply not fit in a small narrow passage of circular stairs. Im 5\"10 and weigh 170 lb and at times I had to duck and turn sideways to sqeeze through. With people directly in front and behind you it can get pretty claustrophobic. Once you get on top the view is beautiful and the experience is exilarating because you are standing on a tiny balcony with a rail that is barely half your height at about 300 feet up in the air."
        }, 
        {
            "index": 165, 
            "rating": "5", 
            "review": "Amazing Views. Worth the time. Guided tour in English gave great history of the architecture of the building. Guide was so friendly. Would highly recommend."
        }, 
        {
            "index": 166, 
            "rating": "4", 
            "review": "Great building and worth the tour. Enjoyed this building and the insights into the architecture provided by our knowledgeable tour guide (when I could hear what he was saying). Such cool details and I loved the elevators, staircase, and views from the top. The one negative about the tour is that our group was too large-especially for those cramped spaces toward the top. They should consider capping the group at 8 people...or have more runnings."
        }, 
        {
            "index": 167, 
            "rating": "5", 
            "review": "Amazing gem!. I stumbled upon this building on accident about a year ago and saw that they did a tour and wine tasting at night, so we went before a tango show. It was a really fun tour - learned a lot and the guides were fantastic. We had to skip the wine tasting because we were on the way to the show, but even just the tour and the views from the top were spectacular! Well worth it!"
        }, 
        {
            "index": 168, 
            "rating": "5", 
            "review": "Unbelievable Building. Though we were unable to go into the building our exterior tour and our guides narrative revealed the architect's link with Dante's Inferno."
        }, 
        {
            "index": 169, 
            "rating": "5", 
            "review": "Worth a visit. Definitely worth visiting, you can only look around inside (other than the entrance hall) with a guided tour which are on the hour from 4 to 7 (more or less) and it cost 50 pesos argentinos. The tour was great and in spanish and english. The last bit of the tour was a bit worrying though, in the lighthouse right at the top not good if you don't like heights!"
        }, 
        {
            "index": 170, 
            "rating": "5", 
            "review": "Quirky Palace with a view. Great italianate palazzo. The tour takes you right to the top of the Palacio, with some good historical context. Its a great building and story, the guide and his family members have been doing this tour from its inception. I liked the view from the top, all the way to Uruguay in the North. However the \"lighthouse\" is hot and not well maintained. This isn't suitable for people who are disabled, with high blood pressure, large sized, or with acrophobia."
        }, 
        {
            "index": 171, 
            "rating": "5", 
            "review": "Palacio Barolo. This is one of the most fascinating building in the city. Try to go on one of the building tours, which gives an amazing history of this building. Great photo opportunities,"
        }, 
        {
            "index": 172, 
            "rating": "5", 
            "review": "great building, great story. different place to visit, amazing story. Nice night and different view of buenos Aires.\nSmall groups and guide speaks in english"
        }, 
        {
            "index": 173, 
            "rating": "4", 
            "review": "Great View from the top. The building is impressive and it has a great view from the top. you go up to the 14th floor and then up a narrow spiral stairway up to the top. If you are claustrophobic, you may not like it getting closer to the top. However the view of the city from the top is great. The guide was informative but serious. I enjoyed the visit."
        }, 
        {
            "index": 174, 
            "rating": "2", 
            "review": "Great Views, Horrible Rip-off. Ok, so here's the deal: We loved being able to go up on top of a building to see the 365 view of Buenos Aires and I must say, it is amazing! However, it was totally crazy that our tour was so short and we barely got to take pictures. The history is interesting in terms of how the Palacio Barolo was crafted and the meaning behind it, but we could barely understand the guide even though our tour was in English. Here's where it gets even more disappointing. My husband and I met a couple who also wanted to photograph from the top of the building. When our tour was ending we asked our guide if we could have a few more moments to take pictures and he informed us that if we wanted to take photos of the sunset then we would have to pay full-price to do the tour again even though we had just paid. Now call me crazy or feel what I am saying, but I think that it is totally ridiculous that he charged us again (although he finally discounted the price by $20.00 pesos) just to take a few more photos on the 19th or 21st floor. If you can find a tall building to visit for free in Buenos Aires, then definitely go that route because this tour is totally not worth it for the 5 minutes they offer you. That is of course if your reasoning for going to visit this place is to take pictures. Otherwise, enjoy your tour."
        }, 
        {
            "index": 175, 
            "rating": "4", 
            "review": "Impressive 360 views from top!. Superbly detailed ornate architecture on the outside and in lobby. The view of the city and the congress building are incredible from the top! Two minutes walk from congress building."
        }, 
        {
            "index": 176, 
            "rating": "4", 
            "review": "Pretty Building with Great Views. We were able to get tickets for this tour within 15 minutes of the tour. The tour lasts about an hour, and is in Spanish and English. The outside of the building, the lobby, and the views are gorgeous. The tour of the other floors of the building is pretty lackluster (unless you're big into architecture, but even then- not anything special on the inside to the average tourist), but it's worth sitting through it for the 360 views at the top. There are tiny balconies at the top that you can step outside to take pictures, and they take you to the very top and turn on the light house. Definitely worth an hour of your time for the views. There are quite a few very narrow stairs to get to the top, so note that if you can't walk up a lot of stairs it may be difficult. They do have an elevator at the top, but it only takes one person at a time."
        }, 
        {
            "index": 177, 
            "rating": "3", 
            "review": "The story around it is better than the reality. If you are afraid of heights - DO NOT GO! The ARG50 was pretty steep considering that the tour started late, was less than an hour and the English explanation was only just understandable. You don't have to know Dante's Divine Comedy but a basic understanding does make you in awe of the maths relating to the structure of the building in relation to the breakdown of the poem. Also amazing that the entire building was financed and erected on the premise that Italy was doomed and that Dantes ashes would be brought to Argentina for safe keeping. Once inside, the interior is sadly disappointing - even the eagle, under which Dantes ashes were supposed to rest, is a replica & unimposing. The first part was by lift but then it was really difficult when our party of 16 started to make the climb up the torre - tower. Narrow, tiny, winding staircase up from \"Purgatory\" into Heaven where we could step out onto small balconies for a view of the city. Then up again into the actual lighthouse. For those with a fear of heights this is where it really broke down as our guide maneuvered us to sit on the metal struts (Not The Glass!) surrounding of the light mechanism. Risk a peek down for that sheer 100m drop!! Back down to the 5th floor for a look at a replica of an office as per the 1920's. Absolutely loved the story of the building - the inside reality was disappointing. Today not so prestigious to have an office there - no one likes having to share the toilets!"
        }, 
        {
            "index": 178, 
            "rating": "4", 
            "review": "Lovely guided visit. one of the nice palaces built at the time of the \"vacas gordas\" fat cows in the 1910 to 1930 epoch, BEWARE English tours only 3 times a week, check schedules and if there is an event they cancel at a moment's notice."
        }, 
        {
            "index": 179, 
            "rating": "3", 
            "review": "Better ways to spend my $95 on a friday night.. Went on this tour last night and i do regret it. Not worth the money at all. Firstly, the tour started late. The tour was presented in spanish and english (or spanglish). We couldnt understand a word the guide was saying due to his thick accent. As the tour went on they seemed less interested in explaining things in english and by the end of the night there was no english. The view was good but not worth the money. Just a long and boring tour, a waste of 2h."
        }, 
        {
            "index": 180, 
            "rating": "5", 
            "review": "Nice Design. It is in 9 de Mayo Ave., betwen 9 de Julio and Plaza del Congreso. You can go in, but if you want to go up, you need to pay for the tour."
        }, 
        {
            "index": 181, 
            "rating": "5", 
            "review": "Eye-popping !. While approaching this really huge Building you will be stunned by the Details of the Facade. The main Hall is also very impressing. Be sure to take the guided Tour, that will you also lead to the little Lighthouse at the very top, whre you have a fantastic view over the City. The Lighthouse was also used for optical communication with a similar building in Montevideo, Uruguay its called Palacio Salvo ), the Guide will tell you the exact Story."
        }, 
        {
            "index": 182, 
            "rating": "5", 
            "review": "Worth visit !!!. Took The Palacio Barolo Tour on a Saturday. Liked it a lot. The tour was fun and somehow adventurous. Don't miss it."
        }, 
        {
            "index": 183, 
            "rating": "3", 
            "review": "Okay. I was super excited to see this, but I have to say the best part was just getting to take pictures of the city from the top of the balconies. It would not be on my \"to do\" list again unless I ran out of things to do. "
        }, 
        {
            "index": 184, 
            "rating": "4", 
            "review": "Don't miss it for the view!. We had to come back the next day to make the tour at 4pm (check the website) you have to be a part of the guided tour. The view from the top of the tower was amazing! You can have a panoramic view of the city! Don't miss it!!!!"
        }, 
        {
            "index": 185, 
            "rating": "5", 
            "review": "Best View of the City & Gorgeous Building. This is one of my all-time favorite tours in Buenos Aires. I love the architecture of the building. Inspired by Dante's Divine Comedy, it's weird and beautiful and surprising. The first floors are hell. Then there's purgatory. And finally, at the top, which is a lighthouse, you get to paradise and the views really do make you feel you've arrived. Take a late afternoon tour or find out when they offer the tour with wine tasting (not that the wine tasting is the best, but it's still fun!)."
        }, 
        {
            "index": 186, 
            "rating": "5", 
            "review": "Amazing view and history- for the ones who like architecture. At first a lot of people don't enjoy this sort of visit because it's mostly about the building itself and a very peculiar part of the city's architecture. But it was a pleasure to pay the 50 pesos and walk around, visiting the building on a weekend when there is no one around and it's possible to admire the details and the history of it. The views were great also! The blue sky helped me to take great shots from the roof!"
        }, 
        {
            "index": 187, 
            "rating": "5", 
            "review": "Nice building and great night tour. There are daytime and evening tours available - the evening tours are more expensive, but a glass of wine is included and you get to see the entire city when you step out on the on-person balconies near the top floor. Incredible! A beautiful city lit up at night!!You have to do it!http://www.palaciobarolotours.com.ar"
        }, 
        {
            "index": 188, 
            "rating": "5", 
            "review": "Amazing to visit!. An historical astonishing building located in the heart of Buenos Aires, close to the Congress."
        }, 
        {
            "index": 189, 
            "rating": "3", 
            "review": "nice building, a bit rushed tour. the building is very nice, the tours are a bit rushed. doesn't require pre-booking, friendly staff. You're expected to tip at the end of the tour, but not everyone does."
        }, 
        {
            "index": 190, 
            "rating": "5", 
            "review": "My favourite tourist experience in Buenos Aires. I spent a month in Buenos Aires, and was desperate to find a tall building to have a view of the city - I found Palacio Barolo! There are daytime and evening tours available - the evening tours are more expensive, but a glass of wine is included and you get to see the beautiful city lit up at night. There is a short tour of the building, followed by a chance to take in a panoramic view from balconies, and then a trip up to the lighthouse on the roof. The tour ends with a visit to an old-style office room (the building is a working office building) for a drink and snacks.I absolutely recommend this tour!"
        }, 
        {
            "index": 191, 
            "rating": "4", 
            "review": "Best View of the City. What a beautiful building but the only way to see it or the view from the top is by going on a tour, which is well worth the price. We went on a daytime tour but would love to return to see the nighttime view from the top. It is interesting hearing how the architecture is modeled after Dante's Divine Comedy. It is worth taking the time to view this beautiful building."
        }, 
        {
            "index": 192, 
            "rating": "4", 
            "review": "el Barolo. i liked visiting this exceptional building and know about its history. I liked to go on top of Barolo to enjoy the view and the fiesta with Tangomoda."
        }, 
        {
            "index": 193, 
            "rating": "4", 
            "review": "Do the evening tour. We went to the evening tour and it included descriptions of the building that is based on Dante's Hell, Purgatory and Heaven. As you go to about the 22 floor, you get fantastic views of the city and the congress building. They also turn on the spotlight while the group are in the tower and you get some unique photos to show your friends. The evening ends with a glass of wine. The English tours are at the end of the week.The only thing stopping it being 5 stars was the price of 95 pesos each."
        }, 
        {
            "index": 194, 
            "rating": "4", 
            "review": "A must for the evening. Found this an excellent tour and the view of a night time is amazing. Even went right up to the top where the light was shone out across the city. A lot of steps to climb so not for the faint hearted but well worth the effort."
        }, 
        {
            "index": 195, 
            "rating": "5", 
            "review": "A must for the sake of the view of the center seen from above. Go to the top floor and dont forget your camera, video would be perfect in sunshine"
        }, 
        {
            "index": 196, 
            "rating": "3", 
            "review": "Nice!. A beautiful place, the archtecture is very different and compose a very good view along with the other buildings in surroundings... and it is located too close to the congress, so it's easy to visit."
        }, 
        {
            "index": 197, 
            "rating": "4", 
            "review": "Great Buenos Aires. If you are going to visit read the story related with the Divina Comedia before. Near you will enjoy several of the best domos and buildings in the city"
        }, 
        {
            "index": 198, 
            "rating": "4", 
            "review": "A Grand Building. The Palacio Barolo is mostly offices. The 1st high rise in BA. The tour has a wonderful flair of fantasy to it. Wonderful views of the city - a great view of the Plaza de Congreso with a peek at the Casa Rosada on the opposite side of the tower. This is one of the stops I recommend every tourist should see."
        }, 
        {
            "index": 199, 
            "rating": "4", 
            "review": "Great view from the top.. This is a beautiful building. It can be difficult to photograph in full from the street because of the trees and its height. I chose an afternoon tour as it was mainly in English. The last part of the tour involved climbing several floors in a very tight circular area at the top of the lighthouse, but the view from the top was great. Worth the visit. At first I couldn't find it because I expected to find a lighthouse near the water, not in the centre of town."
        }, 
        {
            "index": 200, 
            "rating": "4", 
            "review": "Unique architecture. Beautiful, unique architecture, on Ave. de Mayo! I love going to dance tango, on the rooftop salon!!"
        }, 
        {
            "index": 201, 
            "rating": "3", 
            "review": "only if you have the time. Palacio Barolo is on Avenida de Mayo near the Plaza de Congreso. There are tours on Mondays and Thursdays from 2 - 6pm or at 8:30 pm. It's about 45 minutes for the afternoon tour and an hour for the evening one. The afternoon tour costs $50 pesos and the nighttime tour is $95, which includes wine at the end. I went to the afternoon tour and I was not very impressed. You cannot really see east on Av.de Mayo, only west facing the Congress building. This is unfortunate as I really wanted a picture of Avenida 9 de Julio so I can show how many lanes there are. Also, maybe because there was only me and two other people, the English portion of the tour was very brief and left out a lot of information that was given in Spanish. He would speak in Spanish for a long time and then only say a few sentences in English. Not something to do if pressed for time."
        }, 
        {
            "index": 202, 
            "rating": "4", 
            "review": "Architecture. I was very well impressed with the architectural planning describing Dante's comedy."
        }, 
        {
            "index": 203, 
            "rating": "5", 
            "review": "Impressive. See with your own eyes and you'll agree with me. It's just difficult to photograph due to the trees in front of it, but it surely impress. Some people say that this building is a twin brother of another in the same style in Montevideo, Both are superb."
        }, 
        {
            "index": 204, 
            "rating": "5", 
            "review": "Construction based on La Divina Comedia of Dante. The palace is divided in 3 parts.Hell,Purgatory and Paradise.You must visit it with a tour guide.The tour is available Wednesday and Fridays at 2 and 4 pm it costs 40 pesos per person.The building is magnificent"
        }, 
        {
            "index": 205, 
            "rating": "5", 
            "review": "OVERCAME MY FEAR OF HEIGHTS. Great tour, interesting history and a terrific view of the city of Buenos Aires."
        }, 
        {
            "index": 206, 
            "rating": "4", 
            "review": "Gorgeous architecture, lovely views, affable guide. You don't have to be an aficionado of Dante's \"Divine Comedy\" nor of neo-Gothic architecture to appreciate the beautiful Palacio Barolo. I took the tour with a group of graduate students from the University of Massachusetts, one of our professors, and his 3 kids (age range 7 to 12), and there was something captivating for all of us. The top levels offer fantastic views of Avenida de Mayo looking toward the National Congress building, and on a clear day, you can see the Rio de la Plata. Both the Spanish and the English speakers were given an equally interesting tour, and I'd consider returning for the night tour the next time I'm in Buenos Aires."
        }, 
        {
            "index": 207, 
            "rating": "1", 
            "review": "Nothing here. Just a building. Do not waist your time here. Tours only at nights and weekends"
        }, 
        {
            "index": 208, 
            "rating": "2", 
            "review": "The only good thing about this tour was the aerial views of BA at night. My husband and I were the only two English speaking ppl on this tour that was suppose to be given in both Spanish and English. The info was given in Spanish first then the guide rushed through an abbreviated version in a very heavy accent that neither of us could understand. The guide choose to pretty much ignore us and when questions were asked by Spanish speaking patrons he didn't even bother to translate the questions or answers. I would skip this. The only good thing were the views of the city at night which were not worth it"
        }, 
        {
            "index": 209, 
            "rating": "5", 
            "review": "Prepare for a view (and tour) like no other in Buenos Aires. This is a tour like no other tour in Buenos Aires. The architecture is alluring - beautiful and inspired by Dante. The adventure getting to the top of the building is thrilling, with its twisting stairways, iron-gated elevators and tight passages. And the view on the observation floor is dazzling. You can step outside on small balconies for wonderful panoramic shots. (Or be like me clinging to the wall inside and just peeking out...) And then you keep going up! You end up in the lighthouse practically sitting on air. We did the tour at sunset and it was beautiful.Our tour guide was fabulous - he gave it in both english and spanish."
        }, 
        {
            "index": 210, 
            "rating": "3", 
            "review": "A bit too touristy for my taste. If you're interested in seeing the more cultural aspects of Buenos Aires and avoiding cliched museums and the link....then this probably isn't for you. The guide was good, excellent English and quite entertaining, but probably not worth the price you pay (something like 15 Euros). There are better ways to spend your money in Buenos Aires."
        }, 
        {
            "index": 211, 
            "rating": "4", 
            "review": "Go for the views. This is an interesting architectural site. The tour is offered in multiple languages, and costs about US$10 (@ 4.15 AR$/US$). The highlight of the tour is going up into the tower, where you get some wonderful views. In particular, the views of the Congress building are fantastic. The tour describes many of the architectural details, which are full of symbolism from Dante. The building is also still a working office building, and it's interesting to peak at some of the doors to see the variety of work being done. If you are in the neighborhood when tours are being offered, I highly recommend it.FYI: the full tour is not for those who have difficulty with stairs, tight spaces, or heights. There are numerous spiral staircases that are very narrow, and the view from the top can be dizzying. So put that in the category of FWIW."
        }, 
        {
            "index": 212, 
            "rating": "4", 
            "review": "Great views, interesting history. I'm really surprised this place doesn't have many visitors cause you literally get to see a panoramic view of the city from the top of this palace. We went on the 4 PM tour with Tomas with about 12 other people (40 pesos). He's a really good guide - speaks in both spanish and english (although I couldn't understand his English at times) - I liked his style. He explains the interesting details of the Dante-influenced building and the views at the top are amazing. There are very narrow stairs at the top though so keep that in mind. Tour lasted about an hour."
        }, 
        {
            "index": 213, 
            "rating": "5", 
            "review": "Dont miss. that was a different thing to do in Buenos Aires. It really was interesting."
        }, 
        {
            "index": 214, 
            "rating": "5", 
            "review": "A must do. We took the night guided tour, with Thomas... Very instructive, beautiful view from the city, good wine. Worth 20usd."
        }, 
        {
            "index": 215, 
            "rating": "5", 
            "review": "Fascinating site. We took the nighttime tour. A little pricey (A$80, about US $20 at the time) but well worth it. Incredible views of the city, and a lot of interesting architectural details. The designer was as nutty about numerology as Dante, his idol. The guide was fabulously knowledgeable and fluent in English."
        }, 
        {
            "index": 216, 
            "rating": "5", 
            "review": "Divine Building. Divine Tour.. In an era where glass shapes are bult as high as possible with no subtely or imagination, the Palacio Barolo seems more amazng than ever. It caught my eye strolling down Avenue de Mayo even before I learnt of it's wonderful history. This tour would be worth it just for the views from the top but you also get to watch the lighthouse in action, learn about all the intricate planning that went into the building aswell as become part of the fascinating story of the guides themselves and their link with this amazing place. I went to the Taj Mahal last year, yet the Palacio Barolo, to me at least, is more interesting and this fabulous tour may convince you too."
        }, 
        {
            "index": 217, 
            "rating": "4", 
            "review": "Beautiful Building and Awesome View!. During my visit to Buenos Aires, I passed by this enormous building many times. It is one of the most beautiful buildings in Avenida de Mayo. However, it is not until you hear the explanations of how the architect planned the building that you notice its true beauty. Notice the architecture details and discover the reasons behind each one of them. Besides, I don’t think there is a better view of Buenos Aires! I do think the ticket fee is a bit pricey. However, I am glad I didn’t miss this. I highly recommend it."
        }, 
        {
            "index": 218, 
            "rating": "5", 
            "review": "Totally worth the $10!!. This would be on my top ten things to do in Buenos Aires! What a view!"
        }, 
        {
            "index": 219, 
            "rating": "5", 
            "review": "360 degree view of BA's sprawling city. Agree, this is a 'must do'. The building itself is interesting; inspired by Dante and a symbol of Argentina's 1920's prosperity. Read up on Dante first if you're not familar with him. (Well, just on wiki.) But even if you're bored by buildings and poetry, wait until you ascend the skinny staircase into 'heaven'. If you have walked around BA for a day or so, you will have observed that the sprawl doesnt pause for breathe. The streets are lined with sharp, tall buildings, shoe shops, people, cars, horns. Well, from heaven you will see the extent of this bustle. The city extends as far as the eye can see in every direction. Or tour started at 5pm, which was excellent timing for taking photos during the golden hour."
        }, 
        {
            "index": 220, 
            "rating": "5", 
            "review": "Excellent Tour and Great View of Buenos Aires. This is my third time in BA and thanks to TripAdvisor I found out about this attraction - many people in Buenos Aires never heard of it. The Building is a beautiful architectonic treasure all based on Dante's Divine Comedy - the tour was conducted by Thomas, who did a great job. The views from the lantern house were amazing! I highly recommend it!"
        }, 
        {
            "index": 221, 
            "rating": "5", 
            "review": "A must do in BA. My husband and I went on this tour last week on our last night in BA (we were flying out at 2.30am). I had thought it would be a great thing to do on our last night and was right. The two brothers that run the tour, Miqueas and Thomas, are amazing guides, really passionate about the tour and have a wonderful connection with the building. The tour is in spanish and in english - e.g. the spanish explanation first and then in english - and i thought this added to it, as whilst either translation is occuring you get to take in more of the building. The history of the building and the building itself is amazing - won't tell you too much as that is for the tour and the wine and cheese at the end is a nice touch. I booked with the brothers direct over the internet and paid on the night - 80 pesos which is really cheap for what you get. The brothers even take your picture during the tour and email to you. There are quite a few steps but you can go at your own pace - there were people of all ages on our tour. I could not recommend this tour highly enough."
        }, 
        {
            "index": 222, 
            "rating": "5", 
            "review": "Great Tour! Great People! Great History!. Great tour given in both English and Spanish. We did the night tour and was treated to the history of this beautiful building and was surprisingly a good break from the other stuffy architectural tours. The views of the city from the top as the sun is setting and the cheese/wine at the end make this a great tour to do before dinner. HIghly Recommend!"
        }, 
        {
            "index": 223, 
            "rating": "5", 
            "review": "You must do this tour. Not only is this building amazing with a very bizarre history and architecture, but it also provides an incredible view over Buenos Aires. We just couldn't believe the view of this city. Thomas, our guide, has a passion for the building and its history and speaks great English and of course Spanish. You'll get an amazing view of BA that you just won't expect and you even get to go to heaven. This tour is great fun and well worth your time and pesos."
        }, 
        {
            "index": 224, 
            "rating": "5", 
            "review": "muy great!. very nice architecture, short but impressive tour with magnificent view of the city by night. well worth your time! the guide knows his history!"
        }, 
        {
            "index": 225, 
            "rating": "5", 
            "review": "My favourite building in BA. This was recommended by someone else where I was staying. I took along someone else who hadn't heard about it. We both loved it and found the tour fascinating. Amazing building and the statistics and rational behind the construction following Dante's Divine Comedy. It is stupidly missed out in Lonely Planet guide for South America. Go see it for a wonderful view and the beautiful architecture. The friend I took declared it his favourite place in BA and would recommend to anyone too."
        }, 
        {
            "index": 226, 
            "rating": "5", 
            "review": "Amazing. I loved the visit, the guide was very well informed and let us know tons of very interesting facts. The building is gorgeous and the view from the highest floor is breathtaking."
        }, 
        {
            "index": 227, 
            "rating": "5", 
            "review": "An interesting building. If you like architecture take this tour. It's a beautiful building from the outside and the tour of the interior is well worth it. The views from the lighthouse at the top were a highlight."
        }, 
        {
            "index": 228, 
            "rating": "4", 
            "review": "Great place to take pics of the city. This building intrigued us from the outside so we decided to take a gander on the inside. It was our dumb luck that there was a tour starting in 2 min at 2:00. The Italian architect Mario Palanti was commissioned to design the building by the empresario Luis Barolo, an Italian immigrant who had arrived in Argentina in 1890 and had made a fortune in knitted fabrics. It was designed in accordance with the cosmology of Dante's Divine Comedy, motivated by the architect's admiration for Alighieri. There are 22 floors, divided into three \"sections\". The basement and ground floor represent hell, floors 1-14 are the purgatory, and 15-22 represent heaven. The building is 100 meters (328 feet) tall, one meter for each canto of the Divine Comedy. The lighthouse at the top of the building can be seen all the way in Montevideo, Uruguay. The owner planned to use only 3 floors (with secret elevators), and to rent the rest. When completed in 1923 it was the tallest building, not only in the city, but also in the whole of South America. It remained the city's tallest building until 1935 when, on completion, the Kavanagh Building took over this title. The tour came out to $40 AR well with the $10 us for the pictures of Congress and the unobstructed views of the city. They do wine tasting tours on Friday evening where they drink good wine and then take a hike up to the top of the lighthouse."
        }, 
        {
            "index": 229, 
            "rating": "5", 
            "review": "Beautiful architecture and spectacular views of Buenos Aires. We were lucky enough to arrive on a Thursday and were able to get an English tour of this beautiful building inspired by Dante Alighieri's \"Divine Comedy.\" The tour takes you to the rooftop lighthouse where there are 360 degree spectacular views of Buenos Aires. There are especially beautiful views of the Congreso building. The tour guide, Miqueas, is very well informed about the building and was a wonderful tour guide. We are happy that we took this tour because we were able to get a great view of the city. We went in the the afternoon but there are also evening tours plus wine tastings."
        }, 
        {
            "index": 230, 
            "rating": "5", 
            "review": "Astonishing!. I had read about this building in one of the many tourist guides and handouts I had been given at the first place I stayed, and then happened upon it one day with a new Argentinian friend and his architect partner. It's an amazing building, and curious in that it was built based on Dante's \"Inferno\"- from hell to purgatory and eventually Heaven. I told them I thought you could go inside it and take a tour, so we asked and were told how to arrange it. A few days later, we met back there for the small tour (which happened to be in Spanish), but fortunately my friend Matías was a good translator. There were probably only about 8 of us on the tour and they had an English handout for us. I felt like I had discovered the Empire State Building of Buenos Aires, and an unknown secret. We went up and up and up, and suddenly were outside on these little round outcroppings of the cupola. The view was 360 degrees, and up and down Avenida de Mayo- from the Casa Rosada (the Pink House) to the Congresso. Absolutely astonishing. And then, we went up a couple at a time to the very tippy top, to the light house. Truly incredible. We felt as if we had shared in a special Buenos Aires secret where few tourists venture."
        }
    ]
}