{
    "category": "Buenos-Aires", 
    "entity": "Catedral-Metropolitana", 
    "avg_rating_stars": 4.376373626373627, 
    "review_count": 364, 
    "rating_stats": {
        "poor": 2, 
        "average": 30, 
        "terrible": 1, 
        "very_good": 157, 
        "excellent": 174
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "Impressive and humbling. The design is a latin-cross building with main hall and three-aisles with side alcoves. Ceilings of the church were decorated with frescos of fine art painting. The floor is covered with venetian or bazantine-style mosaics. Like many Cathedrals the world over it is a pictorial museum. It features the Tomb of General San Martin. When the tomb is open it always is flanked by a uniformed honor guard.Please leave a donation - these free visits are a privilege, and although I encouraged it the group of tourists I joined donated nothing (all American), I was saddened."
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "Beautiful Building to include in your walking tour. Read up a bit on the story and have a walk around. Don't miss the scene above the front columns and its contraversial alternative explanations"
        }, 
        {
            "index": 3, 
            "rating": "4", 
            "review": "Main cathederal. Visited by the Pope in 2014. Huge church. No parking in the area so it it necessary to walk. Open daily for visitors."
        }, 
        {
            "index": 4, 
            "rating": "4", 
            "review": "the most importat catedral. It is the most important Catedral of Buenos Aires. It was the the place where Pope Francisco used to be"
        }, 
        {
            "index": 5, 
            "rating": "4", 
            "review": "Nice Cathedral. This is a very nice Cathedral in the centre of Buenos Aires. Definitely worth stopping by and taking some pictures and rest after long walks in Buenos Aires. There is no entrance fee to get in."
        }, 
        {
            "index": 6, 
            "rating": "2", 
            "review": "There are better cathedrals in Europe.. It's not beautiful. Outside, it is kind of seedy, there are barriers and homeless people. The surrounding area is dirty. It's not even possible to have a clean shot of the exterior of the building because of the ugly barriers. Don't go out of your way to visit. I dropped by because I visited Pink Palace first, this building is just next to Pink Palace,"
        }, 
        {
            "index": 7, 
            "rating": "5", 
            "review": "A great place to visit and be part of the mass. I spent a weekend in Buenos Aires, and I went to the Sunday mass, despite the tourists taking pictures, it was good.The music was excellent."
        }, 
        {
            "index": 8, 
            "rating": "4", 
            "review": "Nice cathedral, lots of photo ops.. The lighting in this church makes for great photo ops. Many statues easily accessible. Ornate, gold gilt altar.. larger than it looks from outside. A quiet respite from traffic and noise..."
        }, 
        {
            "index": 9, 
            "rating": "5", 
            "review": "Emblematic for Buenos Aires. If you are a Christian (and even for other religions) and you admire Pope Francis you should visit the cathedral that served as the home for his religious service as cardinal for so many years. The cathedral is also a historic place, the tomb of general San Martin can be found inside. I have been impressed by the many groups of young students (10 - 14 years of age) who came to visit the cathedral, keeping the religious sentiments alive among the young generation and make them familiar with the the glory of their country."
        }, 
        {
            "index": 10, 
            "rating": "4", 
            "review": "worth the time. In a side chapel of the cathedral one can visit the tomb of general San Martin (and his assistant generals, and an urn of an unknown soldier), with official guards. This itself makes this building an important site for those interested in Argentina. The cathedral is unusual in its appearance from outside (a similar neo-classical shape can be seen in the cathedral in Vilnius). Behind the main altar (you can walk there) is a framed mosaic that Pope Francis sent to this church after being elected as Pope. There are also other important sites in this cathedral, such as the figure of Mary the patron saint of Buenos Aires (she is holding a ship)."
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "Nice church with Argentine historic significance. A nice church that contains the remains of General San Martin, liberator of Argentina and other parts of South America. It's nice for a short visit, but for me, it was a must stop. San Martin's wife is enterred in Recoleta Cemetery."
        }, 
        {
            "index": 12, 
            "rating": "5", 
            "review": "Adjacent to Casa Rosada. Pope Francis was the cardinal here. Inside is opulent.\nIt's on tour bus stops, as it's located adjacent to Casa Rosada, and across the street from souvenir shops."
        }, 
        {
            "index": 13, 
            "rating": "5", 
            "review": "excellent choir. we attended mass and was blessed to be in the cathedral where pope francis served for many years. The choir was excellent and the cathedral was immaculate."
        }, 
        {
            "index": 14, 
            "rating": "4", 
            "review": "Very good. A lovely sanctuary to visit - whether for religious or other reasons - if you are lucky you will witness the changing of the guard from the nearby palace which involves troops marching into the cathedral."
        }, 
        {
            "index": 15, 
            "rating": "4", 
            "review": "Worth your time to Visit. Stop by and look inside this beautiful old church. There is a very special piece of art here. A dedication to the Jewish holacaust victims in a beautiful frame with a beautiful memorial. The only one of its kind in the world!"
        }, 
        {
            "index": 16, 
            "rating": "4", 
            "review": "Interesting Cathedral, historical site. Of the churches I've visited in the area, this is the most interesting. It has that mix of opulence and decay that can be found in many of Buenos Aires's old buildings. The scope of the cathedral is impressive, and its art and architecture interesting. National hero Jose de San Martin is entombed here. There are many historical sites nearby."
        }, 
        {
            "index": 17, 
            "rating": "4", 
            "review": "Good. Here is san martin s tumb. The cathedral is good and with restaurations\nNear you have many places to have ftee time with good coffe"
        }, 
        {
            "index": 18, 
            "rating": "5", 
            "review": "Beautiful Cathedral. The Cathedral of Buenos Aires was rebuilt several times and the present building is a mix of architectural styles. The current church has an 18th-century nave and dome, a 19th-century Neoclassical façade, precious 18th-century statues and altarpieces, and Neo-Renaissance and Neo-Baroque decoration.In 1880, the remains of General José de San Martín, who liberated much of South America from Spanish rule, were brought from France and placed in a mausoleum at the right aisle of the church. His black sarcophagus is guarded by three female figures that represent Argentina, Chile and Peru, three of the regions freed by the General."
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "Peaceful cathedral with beautiful alter. We visited briefly on a Friday with very few people around. A great piece of architecture and a peaceful place to sit and observe the decor/monuments etc inside the cathedral. The nearby parks are also very beautiful and a great area for a lunch stop. Entrance to the Cathedral is free"
        }, 
        {
            "index": 20, 
            "rating": "5", 
            "review": "Historical place, a must to understand a little bit more of Argentina and history. Historical place where General San Martín remains are. In the front there is a lamp and your can read \"Aquí descansan los restos del Capitán General Don José de San Martín y del Soldado Desconocido de la independencia, Salúdalos\" (In here rest the remains of the Cpt. General Don José de San Martín and an anonymous soldier of our independece, salute them!)"
        }, 
        {
            "index": 21, 
            "rating": "4", 
            "review": "Classic church. Beautiful church, right beside Casa Rosada and has free entrance. Another must see from downtown Baires."
        }, 
        {
            "index": 22, 
            "rating": "4", 
            "review": "Busy with the faithful. Sunday visits are busy with mass, faithful and buses of tourists touring the church and the tomb of Argentine Jose FranciscoSan Martin, the liberator of Argentina, Chile and Peru from Spanish rule. The crowds were heavy due to the San Martin holiday, but definitely worth visiting due to its significance with respect to Pope Francis, as the former Archbishop Jorge Mario Bergoglio of Buenos Aires before becoming pope. The facade of the church looks more like a public government building than a church, which is something to take note of when visiting the cathedral."
        }, 
        {
            "index": 23, 
            "rating": "4", 
            "review": "Beautiful and hostoric. One of the attractions on the famous \"Plaza de Mayo\", historic and beautiful, cannot be missed when visiting the very center of BA."
        }, 
        {
            "index": 24, 
            "rating": "5", 
            "review": "Jaw dropping luxury. This building caught me by surprise. The outside with is Greek and classic columns facade is not what you expect from a Catholic Church. Also currently it's protected by temporary iron gates on the outside perimeter, just like the Pink Palace so one would think is a law or public building. When we visited we had the luck of witnessing guards marching inside to open the tomb of one of Argentinas most prominent figures which rests inside. So, we just followed the guards inside and boy were we surprised. The inside is massive and reminiscent of The Vatican's St. Peter's in decorations, colors, scale and general luxury. It was very busy inside because of the ceremony but it was truly an amazing church. Each altar is a work of art on its own and the main altar is fabulous. Every detail and every corner is been decorated in opulence. It doesn't feel like a very religious or meditation inspiring place, but we witness several people praying with great fervor at the altars. "
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "Sunday Mass, with changing of the Guard and Choir Practice!. Wonderful experience. Beautiful. Humbling interior. A must see for all who visit BA. We were very impressed with the architecture and the frescos and the mausoleum."
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "Beautiful experience, especially attending mass. Breathtaking sanctuary, art and beauty. Saw the changing of the guard on the tomb of San Marten. Lovely organ music."
        }, 
        {
            "index": 27, 
            "rating": "2", 
            "review": "Not old not impressive . A very ordinary cathedral which was a surprise. Would skip but next to P. De Mayo. Yes, was the church of current Pope. Can see why he wanted out."
        }, 
        {
            "index": 28, 
            "rating": "4", 
            "review": "The \"Pope's\" Cathedral. The outside looks more like a museum or city hall than a church. The inside looks a typical church.Though it was crowded, it was quiet and the reverie was maintained. It is the Pope's cathedral and is worth visiting."
        }, 
        {
            "index": 29, 
            "rating": "5", 
            "review": "Wow. We were amazed when we entered what appeared to be a historic building of some sort to find a magnificent church inside. Even my husband who has no religious beliefs was in awe and impressed by the architecture and glory inside. Amazing what was built so many years ago considering technology now. Wow!"
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "A must if you come to Buenos Aires. Is one of our historic places, a must uf you come to Buenos Aires, a few steps from The National Bank and the Pink House, the architecture is neoclasic and one place to admire the beauty that this catholic cathedral can offer to you. One big advice, don't lose sight of your things, yes there are pickpockets inside, as there are in all big city."
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "A must see during a city trip. A beautiful cathedral in the city centre of Buenos Aires. Holds an important place in hearts of Argentinian people."
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "Majestic. Very large and extraordinary church. If you like religious art and relics then I recommend this place for you."
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "SIMPLY MAGNIFICENT! A good place for reflection and peace.... This is truly a magnificent \"Catedral\" because of the way the history of Argentina is woven into the fabric of its architecture. It is one of the \"must sees\" in Buenos Aires."
        }, 
        {
            "index": 34, 
            "rating": "4", 
            "review": "Interesting and historical Catholic church. Easy to visit as it is across the street from the Casa Rosada. Home to many buried statesmen. Interesting but not overwhelming"
        }, 
        {
            "index": 35, 
            "rating": "4", 
            "review": "Beautiful, historical and yet touristic . Very central, in the main touristic area of the city, lies the beautiful architecture of the cathedral. Worth a stop and take the chance to appreciate your trip."
        }, 
        {
            "index": 36, 
            "rating": "5", 
            "review": "Fantastic architecture..... A delightful Cathedral. Keep in mind that Pope Francisco delivery masses in this same spot before he was anointed Pope. Great frescos..., very tasteful general setting."
        }, 
        {
            "index": 37, 
            "rating": "5", 
            "review": "Very unique place!. Very unique place. Outside this cathedral looks like a theater, inside is catholic retrieve. Culture and religion come together in one place."
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "Beautiful interior. Just remember when you go that it is a functioning church. No flash photography because people are at prayer etc. It was a shame to see other tourists using flash or walking in front of people at prayer to get photos. We are not religious people but know what basic respect looks like. Gorgeous interior and all the side chapels are beautifully presented. While we were there, people were coming in on their lunch break for a quick contemplation begore hurrying away. The Mausoleum of General San Martin and the Unknown Soldier are here as well under 24 hour guard. Free admission."
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "Beautiful. It doesn't look like much from the outside, but it is really beautiful inside. The floor is incredible."
        }, 
        {
            "index": 40, 
            "rating": "4", 
            "review": "a central point to visit. Where San Martin is still an every day hero. Just for that reason you should give an hour to visit it."
        }, 
        {
            "index": 41, 
            "rating": "4", 
            "review": "Interesting and historic religious center. Walking into la Catedral Metropolitana, you can almost imagine that you are walking into a cathedral in a European city with beautiful architecture. Check out San Martín's tomb in one of the side chambers flanked by two guards in full costume, and see if you can catch the changing of the guards."
        }, 
        {
            "index": 42, 
            "rating": "5", 
            "review": "A National Treasure. This has got to be one of the most magnificent churches I've ever seen. The architecture is wonderful and the inside will blow you away. This is the former seat of Papa Francisco, it's history dates back to the early 17th century. It is a must see if you are in Buenos Aires. A tour of the inside will reveal many interesting thing, I encourage everyone to put this on your list."
        }, 
        {
            "index": 43, 
            "rating": "5", 
            "review": "Enormous. An enormous cathedral - a very simple yet pleasing visit in one of the places the current pope went to. The entrance is completely free, but you can buy souvenirs in its shop."
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "Beautiful as I remember it, Attention with traffic and robbery around the building. I came back to BA after 8 years and I visit the Catedral, is very well preserve and is one of our Architectonic jewels as many you will find in Buenos Aires. prepare your camera cause you will like to take pictures.Please pay attention to the intense and confusing traffic of that particular corner.Attention with Photo cameras and valuables around the building as people as simple as in bikes can pass and grab it. attention with Motochorros,2 guys on one motorbike, one drive the other steal. particulary in that area and Microcentro."
        }, 
        {
            "index": 45, 
            "rating": "4", 
            "review": "Beautiful Cathedral and inspirational since Pope Francis celebrated mass here.. I agree with another reviewer that the facade is not beckoning, but once you open the doors, WOW. There are beautiful alcoves and each one a treat. The mosaic floor is particularly well done. Seriously, every bit of this church is beautifully constructed. It would only take a few minutes to tour and so worth it. Across the street is an olive tree that Pope Francis planted."
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "Through the door amazing . From the outside its not a stand out but once inside its just amazing. We visited around 5pm on a wednesday mass had just started. The tourists keep comming and going and the preist just carrys on. Lovely place to enjoy a little rest on a phew."
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "Must-see. Not knowing anything about the cathedral I walked in and thought I was in Europe for a second. Mosaic floors to the ceilings, a golden altar, and a mini Pietà. The coolest part was seeing San Martin's tomb, guarded by two stoic soldiers/guards."
        }, 
        {
            "index": 48, 
            "rating": "3", 
            "review": "A bit of history. The ceremonial guards standing on sentinel outside the tomb of Argentina's national hero was something new. I have not seen something as such inside a functioning church. There was another general buried inside the same enclosure, too. Other than the historical significance of those generals buried there, it's just another church."
        }, 
        {
            "index": 49, 
            "rating": "4", 
            "review": "Its worth a visit... If you have seen the grand cathedrals of Europe, this may feel like a letdown. Its still grand nonetheless."
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "Awe-inspiring beauty!. Absolutely stunning both from the outside, and inside in terms of its total magnificence! Well worth popping in just to take in the size, scale and awe-inspiring beauty."
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "Beautiful place!. Love the Cathedral and former home of Pope Francis...\nIt is a beautiful place to admire for all faiths. There is the tombstone inside from national Hero , General San Martin."
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "Awesome church. Doesn't look like a church from outside but inside was very nice. Historical and religious things to see."
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "Beautiful cathedral. . This cathedral the former diocese of our current pope Francis is lovely. The tomb of the founder and champion of Argentina San Martin is there. Not as elaborate as Spain but it has its own unique and gorgeous charm. Great free visit."
        }, 
        {
            "index": 54, 
            "rating": "3", 
            "review": "Pretty aberage. Compared to many cathedrals in Europe or Peru, this is pretty average but with visiting if you have some time to kill when you're around this area."
        }, 
        {
            "index": 55, 
            "rating": "4", 
            "review": "While it looks more like a government building.... This is a must see. On the outside, it looks like a government building, but on the inside, it is very nice. By itself, it would be worth seeing (pretty, free, in an area you'll already be to see the other buildings near by), but this is where the Pope is from. Also, don't miss out on the downstairs section accessed from the sides of the altar. This is where the crypts are. Very neat. And... the tomb of the unknown soldier. Again, very neat."
        }, 
        {
            "index": 56, 
            "rating": "5", 
            "review": "Intense ambiance . The architecture is imposing and well-worth exploring all the nooks and crannies off the central nave. The chapel devoted to the Nation (with live honor guards) says a lot about the ties between church and state in this country. The memorial to the Holocaust is moving."
        }, 
        {
            "index": 57, 
            "rating": "4", 
            "review": "Doesn't look like a church from the outside but then it was designed by a Frenchman. Very impressive Neo-classical style building designed by the same Frenchman who also designed Recoleta cemetery. Quite impressive inside but as with all churches in Buenos Aires,in need of a considerable amount of restoration"
        }, 
        {
            "index": 58, 
            "rating": "4", 
            "review": "Fine looking elaborate cathedral. The structure looks magnificent on the outside and inside as well. It is well within the vicinity of other tourist spots so dont miss it. Worth a visit for sure. It is spacious and honours quite a few saints. Everything is appreciable - the intricate carvings, the ceilings with frescos, the mosaic flooring, coloured glass windows. If you are an art and architecture lover this place wont disappoint you."
        }, 
        {
            "index": 59, 
            "rating": "5", 
            "review": "Very beautiful church. It is a very beautiful church, close to Casa Rosada. I recommend a visit, if you are a architecture lover."
        }, 
        {
            "index": 60, 
            "rating": "5", 
            "review": "A beautiful, ornate cathedral. We visited the Cathedral quite by accident on an overcast, drizzly day. The cathedral is a very beautiful church, ornate and well cared for. The day we visited there was a celebration of some sort going on with all the pomp and circumstance. The stained glass windows are magnificent as are the altars in the various niches that celebrate different saints. The cathedral is well worth a visit when in Buenos Aires."
        }, 
        {
            "index": 61, 
            "rating": "4", 
            "review": "Nice. It is not the typical Cathedral but still a very imponent place. If you're catholic you should go there. It feels peacefull."
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "Lovely inside and unusual outside. It does not look like a church from outside (more like a court maybe) but very solid architecture! When you get inside it is very church-like. A very pretty church. Big but not too grand! Very interesting with many statues and paintings adorning it. We enjoyed it and found it extremely interesting. Well worth a visit."
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "Impressive Interior. Cathedral Metropolitana is located in central Buenos Aires overlooking Plaza de Mayo. One could walk right by this cathedral without realizing that it’s a place of worship for Catholics because of its neoclassical facade with 12 huge pillars; and the exterior dome is difficult to see. Once inside, the building looks very church-like. The interior is quite grand and of eclectic architectural styles. The cathedral houses tombs of important generals, a tomb of the unknown soldier, as well as the tomb of Argentina's liberator General José de San Martín. One will also find artwork of frescoes, carved murals, paintings of the stations of the cross by Italian artist Francesco Domenighini, several ornate chapels, and beautiful mosaic floors.The Cathedral Metropolitana provides a quiet venue for reflection and a break from the crowds of central Buenos Aires."
        }, 
        {
            "index": 64, 
            "rating": "4", 
            "review": "Main Cathedral. Catedral Metropolitana is the central church of the archdiocese of Buenos Aires where Francesco presided at mass sometimes before he was made pope. It's located on the historic Plaza de Mayo which you must visit if you see little else of Buenos Aires. Plaza de Mayo is the site of casa rosada from whose balcony Evita delivered her famous speeches, and bits of the cabildo where the May Revolution (25 May) that inaugurated the liberation of Argentina from Spain, began.The facade of the cathedral is 19th century and to my eyes is nothing special. The interior is mostly 18th century and is well worth a look around. I've attended mass here several times. During mass it is usually very crowded and you can't really see much. At other times you can wander around the main nave or the side chapels which are quite numerous and diverse -- full of paintings and statuary. The main attraction for provincial tourists is the tomb of general san Martin,one of the most famous of all the liberators of South America. During the day it has an honor guard provided by Los Patricios, the oldest and most prestigious regiment in the Argentine army, in 19th century uniforms. Provincial Argentinos flock here to pay respects to their hero.The interior is in a fairly constant state of renovation because it is so ornate by local standards. Generally speaking, though, it is archetypical of 19th century church construction."
        }, 
        {
            "index": 65, 
            "rating": "5", 
            "review": "Beautiful cathedral. On our way to Casa Rosada we stumbled upon this beautiful cathedral. I wish they would have had printed material for a quick explanation of what was inside but at the end it wasn't necessary. It is truly a beautiful church and one visited often by the local Argentinians. I even saw a line for the confessionary. A must visit if you are in Buenos Aires."
        }, 
        {
            "index": 66, 
            "rating": "5", 
            "review": "Interesting facade for a church. This church is located next to the main square - where demonstrations are often held and can be quite noisy if you are attending mass there. It is a beautiful church nevertheless, with a great location to the key sights of downtown. It has an unusual facade for a church though - but inside looks like any old Catholic Churches of its days."
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "A different kind of cathedral. While at Plaza de Mayo, go to the Cathedral. was expecting a typical heavy stone, quasi baroque or colonial style building and it is nothing like that. This building was influenced by Argentina's liberation and constructed in the 1800's, and is heavily influenced by classical Roman of Greek forms of architecture. The frieze above the main doorway is full of iconography related to the return of Joseph to his father Jakob and to his brothers - uniting the tribes, in this case, the different factions in Argentina after the liberation and during their 30 year Civil War. The inside is lovely and very different from other cathedrals in Mexico, Central and South America. There is an interesting story about San Martin, who's buried in an adjacent room, and the Holocaust Memorial, which was placed in the room where the Cardinal prior to the current Pope Francis is buried."
        }, 
        {
            "index": 68, 
            "rating": "3", 
            "review": "Nice. Pretty much what you would expect. The place is still being used. It's ok to pop in but I wouldn't make an extra trip here. The floors are the best part: mosaic!"
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "Previous place of worship by the current Pope.. Certainly not what I expected in terms of architecture but very interesting nonetheless. It even had 2 guards inside the Metropolitan Cathedral."
        }, 
        {
            "index": 70, 
            "rating": "4", 
            "review": "SAN MARTIN'S TOMB--HOME OF THE LIBERATOR. We saw this on a drive by basis during our city tour. We did not get to go inside and my pics did not work out. The cathedral was built in the 1800's and entombed is Argentine's \"liberator, San Martin. San Martin's name is all over Buenos Aires!"
        }, 
        {
            "index": 71, 
            "rating": "4", 
            "review": "Well Worth a Fifteen Minute Visit. The claim to fame for this church is of course the current Pope Francis who started his priestly career here. It is also the site of the mausoleum of the War of Independence hero General San Martin. The room is guarded by elite guard who stand unmoving at its entrance. Other than that, the cathedral's interior is similar to countless other Latin American and Southern European Catholic churches. Check out the beautiful and intact mosaic tile floor. The exterior of the church looks more like a temple with its neoclassical columns and facade."
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "WHAT A CATHEDRAL!!!!!!!. This place was something I could not believe!!!!! It is such a beautiful piece of work inside.... the outside belies the inside!!! This place and all of it's intricacies is like nothing I have ever seen before in my life!!!! I took at least 10 minutes of videos trying to capture all of the nuances of this church!!!! It's actually beyond description!!!! That is what I told my guide!!!!!!! A MUST SEE"
        }, 
        {
            "index": 73, 
            "rating": "4", 
            "review": "Perfect stop for half an hour. We stopped here for half an hour. San Martin is burried here and this is the church of pope San Franciscus.Important for the city and nice place to go."
        }, 
        {
            "index": 74, 
            "rating": "4", 
            "review": "Unremarkable Cathedral. From outside the Catedral Metropolitana does not look so impressive. The more impressive thing is the background and history related with Pope Francis.At the inside the Cathedral is, I would say, a standard church as you might know it from Europe.Read about it and feel the spriti of Pope Francis."
        }, 
        {
            "index": 75, 
            "rating": "4", 
            "review": "hard to take it all in. This city is so vast that each of the central parts and neighborhoods are rich and worth experiencing. We walked in Buenos Aires most of the time and found it very walkable (if long)."
        }, 
        {
            "index": 76, 
            "rating": "3", 
            "review": "Is it a church?. That's the question I was asking standing outside. It just doesn't look like any I've seen. Inside it's nice but nothing special."
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "The Pope Francis connection. As cathedrals go the exterior is quite modest in style. We visited on Palm Sunday during the main service and the building had quite an atmosphere. It is a lovely cathedral, although not over ornate and is well worth a visit. The pink house is nearby to see also."
        }, 
        {
            "index": 78, 
            "rating": "4", 
            "review": "Beautiful. I wasn't impressed by the outside appearance but once inside I found the place beautiful and awe inspiring. There was a service taking place and tourists were still wandering around, thankfully they were still being respectful. We later looked around and were surprised there were no candles to light. The Cathedral also houses the tomb of the founder of Argentina which is guarded by two soldiers.Just to the left of the entrance there is a little piety stall selling rosary beads and medals. It doesn't carry much stock (unlike many of the major cathedrals we have visited in Europe) nor does it take cards. Interestingly the cathedral doesn't make much of it's connections to the current Pope but just as an aside, visiting the official Papal website gives information of free tours in English around the main sites in Buenos Aries to which the the Pope has connections."
        }, 
        {
            "index": 79, 
            "rating": "4", 
            "review": "Pope Francis' Home Away From Home. Originally built in the sixteenth century, it has since undergone several changes and the current building was constructed in 1745. Pope Francis ministered there for 20 years as a young man. The long and varied history of the Catedral Metropolitana can be seen through its diverse architecture, ranging from its neoclassical façade designed by French architects Prosper Catelin and Pierre Benoit to its 18th century nave, dome and altars.As the main church of the Archdiocese of Buenos Aires, Catedral Metropolitana forms the centre of catholic life in the city. Catedral Metropolitana contains the mausoleum of General San Martin, a central figure in Argentina’s struggle for independence from Spain. It also houses the tomb of the unknown soldier of Argentine independence and an eternal flame of remembrance."
        }, 
        {
            "index": 80, 
            "rating": "5", 
            "review": "Very interesting!. Located near the Pink House (Capital). Incredible chapels surround the sanctuary. We attended Easter Mass and the choir was incredible."
        }, 
        {
            "index": 81, 
            "rating": "4", 
            "review": "Not Your Average Cathedal. The outside looks more like a government building, but it was Pope Francis' former church and well worth the visit while in Plaza de Mayo. Be sure to see the resting place of revolutionary, José de San Martín."
        }, 
        {
            "index": 82, 
            "rating": "5", 
            "review": "beautiful cathedral. We walked inside to take a look everything was in Spanish so we were not able to read any of the descriptions. It was worth looking inside. Very ornate"
        }, 
        {
            "index": 83, 
            "rating": "4", 
            "review": "Beautiful Cathedral. This is located on Plaza de Mayo so you will definitely pass it on your travels. Well worth a look inside. There is a gift shop just inside the door with souvenirs, rosary beads statues etc."
        }, 
        {
            "index": 84, 
            "rating": "3", 
            "review": "Unassuming exterior. The cathedral is at the edge of Plaza de Mayo and can easily be missed. It is an impressive building and has become quite popular since Pope Francis is from Argentina and this where he was archbishop prior to becoming pope."
        }, 
        {
            "index": 85, 
            "rating": "3", 
            "review": "a little underwhelmed. This is a fine building and after all the territory of Pope Francis. I expected a lot having seen numerous examples around the world, but this one left we a little flat. Vast pillars blocked the view and the light and it was rather gloomy. It's a must see but . . ."
        }, 
        {
            "index": 86, 
            "rating": "4", 
            "review": "Very scenic church. The place is crowded with tourists -- probably because it's the former church of the Pope. The outside is a replica of the Parthenon, which seems strange -- they were multi-god worshipers."
        }, 
        {
            "index": 87, 
            "rating": "4", 
            "review": "Unassuming Exterior but Magnificent Interior. Overshadowed by Casa Rosada and Plaza de Mayo this Cathedral is often overlooked. Make sure and go inside. The main cathedral is magnificent however the side alters are stunning."
        }, 
        {
            "index": 88, 
            "rating": "5", 
            "review": "Lovely. Stumbled across by accident on our first day in BA. We were walking past on our way to find the tourist bus stop and were pleasanly surprised as the outside doesnt make you think of a church. Absolutely beautiful, well worth seeking out to look around."
        }, 
        {
            "index": 89, 
            "rating": "4", 
            "review": "Doesn't look like a Cathedral, but it is!. Whilst right in the Plaza del Mayo in the centre of BA, you could be forgiven for thinking this is an art gallery- until you go in.Inside, it's a typical South American Catholic Cathedral, full of icons, statues, etc. and that side of it leaves us (as Protestants) a bit cold. However, it is a lovely building and is well worth a visit if you like that sort of thing."
        }, 
        {
            "index": 90, 
            "rating": "4", 
            "review": "Interesting architectural highlight. Worth a visit during a trip to Plaza de Mayo. To me this didn't look like a cathedral and I was surprised when someone told me that was what it actually was."
        }, 
        {
            "index": 91, 
            "rating": "5", 
            "review": "Beautiful!. Directly across from the main plaza in Buenos Aires, the cathedral has fascinating stained glass and many alcoves filled with religious paintings and sculptures. You can't go in if there is a service going on, but try to see it. Beautiful."
        }, 
        {
            "index": 92, 
            "rating": "5", 
            "review": "Beautiful Church. The Cathedral is very beautiful on the inside with many side altars in addition to the main altar. Parking is very short and the traffic is quite heavy around the church. Church is a coupl of blocks from the Casa Rosada"
        }, 
        {
            "index": 93, 
            "rating": "4", 
            "review": "Simple - not overdone. This provided a good pause in our day's walk through the historical area of Buenos Aries - quiet and interesting k"
        }, 
        {
            "index": 94, 
            "rating": "5", 
            "review": "Amazing cathedral!. Very unusual outside (masons inspired), but a beautiful cathedral inside. Pity the Catholic Church couldn't keep it better maintained."
        }, 
        {
            "index": 95, 
            "rating": "5", 
            "review": "Breathtaking. You do NOT have to be religious person to appreciate the beauty and inspiration that was put into the construction of this gem. It's an amazing and breathtaking site. If you enjoy traditional victorian architecture you MUST SEE this Cathedral! I also spent some time looking up the location online and the history behind it is amazing as well so if you are a history buff, this location is full of interesting facts as well."
        }, 
        {
            "index": 96, 
            "rating": "4", 
            "review": "Conference visit. This imposing Cathedral sits on the Plaza de Mayo and is a central feature of the city. Newly elected presidents come here to pray on election and it is the centre for gatherings and prayer for all manner of occasions"
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "The Cathedral to see in Buenos Aires. This cathedral is full of history. It is also the former place of worship of Pope Francis and you can see his office adjoining the cathedral."
        }, 
        {
            "index": 98, 
            "rating": "4", 
            "review": "San Martin's Tomb. The Cathedral's facade is unexpectedly Neoclassical and the interior very pretty. My favorite part of the Cathedral was the mausoleum with the remains of Juan de San Martin and other War of Independence heroes under a beautifully constructed dome. Add it to your must-see list when visiting Plaza de Mayo!"
        }, 
        {
            "index": 99, 
            "rating": "4", 
            "review": "Good. Its located in the main square. Free entry. being saturday, crowd less on the roads and you had lot of time to explore."
        }, 
        {
            "index": 100, 
            "rating": "5", 
            "review": "Grandeur and lavish. Located right by the main square, it is easy to find and well worth the experience. The main square is where the government office (Rosada) is located and it is prone to be occupied by demonstrators. We had to go back a second time since it was blocked by demonstrators (Hollande of France was visiting). The inside is magnificent. Despite the seal of the Pope prominently displayed outside of the building, the current Pope Francisco did his work outside of Buenos Aires and not at this cathedral."
        }, 
        {
            "index": 101, 
            "rating": "4", 
            "review": "Papa Francesco Must have been influenced by the life in the Park. this beautiful Cathedral is a quiet beacon in central BA. Pope Frances must have been influenced by the world at the doorstep of the Cathedral, the history that has taken place at its steps. Beautiful Chapels, paintings and a place for Adoration make it especially nice. Daily mass is offered."
        }, 
        {
            "index": 102, 
            "rating": "4", 
            "review": "The main Cathedral in the center of town.. Right in the center of town. Very different form most of the churches in the city. Worth your time to check it out."
        }, 
        {
            "index": 103, 
            "rating": "5", 
            "review": "A landmark. This is not only the Metropolitan Cathedral, full of religious fervor and history. Now it also has a different angle: in the footsteps of Pope Francis."
        }, 
        {
            "index": 104, 
            "rating": "5", 
            "review": "Impressive. I was very impressed with the size of the building. Free entry and all. It definitely worth a visit. You won't have a problem spotting it."
        }, 
        {
            "index": 105, 
            "rating": "4", 
            "review": "Part of the historical circuit. Here is where the most important Argentinian heroes is buried : San Martin. The cathedral is big and interesting and is part of the historical circuit that you must do that includes the Cabildo, Casa Rosada and Plaza de Mayo"
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "FANTASTIC!!!. Most beautiful & grandiose church visited on my south american 3 month journey.Truly amazing &serene atmosphere.Words cannot describe all the faboulous riches&beauty.defenitely a must on your BA agenda.Right on San Martin plaza near La casa rosada."
        }, 
        {
            "index": 107, 
            "rating": "5", 
            "review": "Beautiful!. This is an interesting and beautiful historic Catedral! doesn't really look like a cathedral on the outside but inside is beautiful! A must see!"
        }, 
        {
            "index": 108, 
            "rating": "5", 
            "review": "Beautiful!. On par with the beautiful cathedrals of Rome. It is worth checking out regardless of religion, a very lovely building, and place of worship."
        }, 
        {
            "index": 109, 
            "rating": "5", 
            "review": "Understated exterior reveals ornate interior and real church. The metropolitan Catholic cathedral can easily be overlooked with its roman columns and quiet exterior down the street from the gaudy Pink House. But entering one is reminded this is a house of God. The ornate main altar and side altars honoring Argentinian patrons reminds you that this is the church Pope Francis administered just 5 years ago. With respect visitors can have a full experience while not interfering with the services going on."
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "What's not to like?!. Pope Frances' old church, history, beauty, easy access, free, close to other attractions and has an historical non-Catholic mausoleum filled with Masonic symbolism right off the American dollar bill!"
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "Unlike any other cathedral from the outside. Unusual external appearance to this cathedral, unlike any other I have seen. Classical greek-style portico plus a dome and that's it - inside is more conventional. The high point is the tomb of national hero General Jose de San Martin - this is a very impressive side chapel and should not be missed."
        }, 
        {
            "index": 112, 
            "rating": "5", 
            "review": "This is more spectacular outside than inside.. The inside of the cathedral is OK but don't forget to look outside for the great dome which can be viewed from the other side of the Plaza."
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "Proud to be the Pope's Cathedral. This magnificent Cathedral is perfectly located in Plaza del Mayo just steps away from the Casa Rosada. It has open doors with no one regulating behavior. Being a huge tourist attraction on any given day there will be more people taking photos than praying in pews. Fortunately people remain fairly respectful and don't get too loud. A hidden treasure is the alcove containing the mausoleum of General San Martin which is guarded by 2 austere soldiers. It is a \"must'' visit while in Buenos Aires."
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "Beautiful. Far more impressive inside than it looks from the outside, interesting as this was the Cathedral where Pope Francis was Cardinal."
        }, 
        {
            "index": 115, 
            "rating": "4", 
            "review": "Fun to see the current Pope's former catedral. Interesting cathedral if you enjoy cathedrals. Really notice the South American influences in regards to European cathedrals. Glad we spent a few minutes seeing this landmark."
        }, 
        {
            "index": 116, 
            "rating": "4", 
            "review": "Impressive!. The classical facade of this stunning building gives few clues to the style of what lies within. The detail of the interior is superb."
        }, 
        {
            "index": 117, 
            "rating": "5", 
            "review": "Fun!. Really high class people manage the gift shop where you can buy souvenirs at a cheap price to take to your family and friends. The place closes in the early evening and so the best time is in the early afternoon around two."
        }, 
        {
            "index": 118, 
            "rating": "5", 
            "review": "Very impressive. It was very impressive to see this catedral. And also to hear the story of the pope and San Martin. Furthermore a very nice catedral to visit."
        }, 
        {
            "index": 119, 
            "rating": "5", 
            "review": "Great cathedral and very beautiful inside. From outside, first momento I didn't thought it is a church, but than, inside was really beautiful and big. There are many nice paintings and Statues. In my opinion, one of the must seen!"
        }, 
        {
            "index": 120, 
            "rating": "5", 
            "review": "Great Place to visit.. Situated in the heart of the touristic district of Buenos Aires, this is a fascinating place. From outside you feel as if you are visiting a Roman structure but inside it's totally different. The calmness overwhelms you and the decor is fascinating."
        }, 
        {
            "index": 121, 
            "rating": "5", 
            "review": "Most beautiful church I've seen since being in Europe. . This is the church where Pope Francis said mass before becoming pope. The church is gorgeous and there were many of the faithful in the church praying. The gift shop was excellent. The art was intricate and well worth looking closely at. Huge ceilings. Very ornate. It was the highlight of my stay in Buenos Aires."
        }, 
        {
            "index": 122, 
            "rating": "5", 
            "review": "Don't let the outside fool you, very \"churchy\" inside. I had a private guide take me to several places in the city, this being one of them. The outside of this building looks like it would be an office of some type but inside it is a beautiful church. You only need about 30 minutes to see it all."
        }, 
        {
            "index": 123, 
            "rating": "4", 
            "review": "Cool and simple. Bang in the middle, a no nonsense Cathederal, and the kids will be fascinated by the two \"toy town dressed\" soldiers who guard the tomb of one of the inhabitants. Some lovely pictures paintings and statues, and can be done in half an hour"
        }, 
        {
            "index": 124, 
            "rating": "3", 
            "review": "Dissapointing. A very disappointing cathedral with no traditional spires, a result of much architectural confusion in Buenos Aires. There were barricades to stop protestors defacing it at the time. In much need of repair except the mausoleum which is worth the visit. To see the guards and a beautiful display."
        }, 
        {
            "index": 125, 
            "rating": "4", 
            "review": "Gigantic. This cathedral located directly across from the Casa Rosada in BA is one of the largest I've ever seen. And it's beautiful inside. Worth a visit."
        }, 
        {
            "index": 126, 
            "rating": "5", 
            "review": "Beautiful. A beautiful cathedral, I could have spend a long time in there, in fact I went back twice. There is a great deal to see and read, the tiled floors are very beautiful. It is worthwhile just to sit and look around at its beauty."
        }, 
        {
            "index": 127, 
            "rating": "5", 
            "review": "Former home of Pope Francis. Beautiful architecture. A ton of history inside. You cannot miss this historic church. Read up before you visit."
        }, 
        {
            "index": 128, 
            "rating": "5", 
            "review": "Metropolitan Cathedral. The Cathedral has a Greek/Roman facade and a beautiful interior, with General San Martin Mausoleum inside. It is near the Casa Rosada and the Cabido, and in front of Plaza de Mayo. This was Pope Francis Church."
        }, 
        {
            "index": 129, 
            "rating": "4", 
            "review": "Kind of boring exterior - beautiful Interior. While the exterior of the structure isn't particularly attractive, especially in a city as filled with stunning architecture as is Buenos Aires. Still, this church is well worth a visit for it's stunning interior chapels and for it's more recent history as the place where the Pope previously served as the Archbishop of Buenos Aires. Beyond the pure ecclesiastical and aesthetic beauty of the church, there is a great history here too. There is a perpetually-guarded tomb of the Argentine hero, General San Martin. The tomb itself is quite beautiful as is the color added by the guards who stand in dress uniforms. There is a changing of this guard but I wasn't able to find out the time for that."
        }, 
        {
            "index": 130, 
            "rating": "4", 
            "review": "Very nice building for lovers of art and architecture. The cathedral is one of the monuments you can visit for free in Buenos Aires. It has very classic architecture and is very famous amongst porteños (Buenos Aires locals) for having the grave of San Martin, the argentinian hero. A visit is really worth."
        }, 
        {
            "index": 131, 
            "rating": "4", 
            "review": "Cathedral. This is the former church of Pope Francis and draws huge crowds and tour groups.\nLovely and typical in design to most churches of the period, it also houses the crypt of General San Martin and if you are there about 9:30 am, you will see the very formal opening of the crypt gates and the changing of the guard."
        }, 
        {
            "index": 132, 
            "rating": "4", 
            "review": "Beautiful cathedral. Another extremely centrally located monument on Plaza de Mayo and the main catholic church in the city that also contains a mausoleum to San Martin, who freed the southern part of Argentina from the Spanish empire. worth a visit."
        }, 
        {
            "index": 133, 
            "rating": "3", 
            "review": "An interesting building that lacks maintenance. The Cathedral of Buenos Aires, former seat of now-Pope Francis, is a place full of history and greatness that suffers from an overall lack of maintenance, specially in the upper wallsNevertheless, San Martín's mausoleum is a must if you are interested in the history of the city and it is also a must for Catholics, that can discover the history of the Pope when he was simply called \"Jorge\""
        }, 
        {
            "index": 134, 
            "rating": "5", 
            "review": "See the Holocaust memorial inside. It's not often that a Holocaust memorial is inside a church but there is a nice small one inside this church. The man who commissioned it was the archbishop under the current pope. The memorial is in a frame on a wall half way down on the left side"
        }, 
        {
            "index": 135, 
            "rating": "5", 
            "review": "OMG, THIS IS HOLY !!!!!. This is where the Pope worked before becoming the new Pope.It is the most awesome and Holy place I have ever been. There are so many things there to see. We happened to be there at mass which was just amazing. There are statues and some of the most beautiful art and building I have ever seen. You must go ......."
        }, 
        {
            "index": 136, 
            "rating": "5", 
            "review": "Yes worth a stop. Amazing cathedral very large and interesting. Superb for some very nice pictures. Also the changing of the guards from the palace come to this Cathedral and then return to the palace. So much to see."
        }, 
        {
            "index": 137, 
            "rating": "5", 
            "review": "A fascinating \"old world\" cathedral. Buenos Aires is the home diocese for Pope Francis which makes is special for Roman Catholics to begin with. The Cathedral is also the burial site for San Martin, the liberator of Argentina. There is a formal military guard on his sarcophagus within the cathedral"
        }, 
        {
            "index": 138, 
            "rating": "5", 
            "review": "Go inside to understand its function. This Greek revival building looks like an old bank. However, once you poke inside, the beauty of the cathedral unfolds. It is an usual blend of pure local architecture with the formality of a classic Roman Catholic cathedral. There were\" live\" Vatican style guards around St Lorenzo. This church was the one ministered by Pope Francis, with a designation to that honor."
        }, 
        {
            "index": 139, 
            "rating": "4", 
            "review": "Lovely old cathedral. Located across from the Plaza de Mayo, this Greco-Roman building was constructed between the 16th and 19th centuries. The floors are Venetian mosaic, and the Rococo altar is silver plated. Notably, the mausoleum in the right nave contains the remains of the Argentine Independence hero, General Jose de San Martin. Cool in the summer, this church is a nice sanctuary from the heat and bustling traffic"
        }, 
        {
            "index": 140, 
            "rating": "3", 
            "review": "A large city cathedral. The very formal facade of this cathedral was constructed in the nineteenth-century cathedral and is in the classical style of Italy or Greece. The original cathedral dates back to the sixteenth-century, but has been reconstructed several times since. Inside seems rather dark and gloomy, perhaps the most notable feature being the large mausoleum of General San Martin, the main leader of the struggle for independence against Spain. The cathedral is located right in the centre of Buenos Aires, by the Plaza de Mayo."
        }, 
        {
            "index": 141, 
            "rating": "4", 
            "review": "Better outside than in. A great building in Plaza de Mayo. The inside is pretty unremarkable though compared to the external front facade. Worth a walk around nevertheless."
        }, 
        {
            "index": 142, 
            "rating": "5", 
            "review": "Exterior reminds me of.... The Pantheon in Rome (a bit of a stretch I admit).\nAlso beautiful inside and even has permanent guards for one section.\nThis is the Cathedral where the current Pope resided in the past.\nA must visit during your time in Buenos Aires."
        }, 
        {
            "index": 143, 
            "rating": "4", 
            "review": "Classic Cathedral. Worth stopping in to look around, regardless of your faith. Though much newer than many cathedrals found in Spain or Italy, this one has the same old world look and charm. The tomb of San Martin and main alter are beautifully done."
        }, 
        {
            "index": 144, 
            "rating": "5", 
            "review": "Beautiful Place to Visit. Very beautiful cathedral! Definitely has the feel of an European church like you might see in Germany or Italy. Just like the cathedrals over there, you see lots of little alcoves with beautiful details. The front is somewhat odd, feels more like a bank or a Greek temple than a Catholic cathedral, but that's a part of its charm."
        }, 
        {
            "index": 145, 
            "rating": "4", 
            "review": "Beautiful,Peaceful,Spiritual Space. In the center of the hustle and bustle of Buenos Aires is this magnificent classical environment. Here is a space for contemplation and deep reflection"
        }, 
        {
            "index": 146, 
            "rating": "4", 
            "review": "Free worth a visit. Pope Francis the current pope worked here, but a very impressive church still the same. A real eye opener!"
        }, 
        {
            "index": 147, 
            "rating": "5", 
            "review": "Amazing. This was the home of the current Pope when he was Archbishop of Buenos Aires. A beautiful Cathedral that also ahs a Holocaust Memorial inside,"
        }, 
        {
            "index": 148, 
            "rating": "5", 
            "review": "It's a beatiful cathedral also known as forme Pope Francis's workplace. There are a lot of beautiful cathedrals in Latin American countries, but this one has a few things to make it special (and worth a visit). Yes, this is where Pope Francis used to work. He is a spiritual leader for millions of Catholics and a world celebrity, so why not?Also, the history of Argentina is everywhere, including armed guards - something you don't find in a typical church.And, yes, behind those too classical pillars there is some surprisingly beautiful interior. And it's obviously free to visit.Highly recommended."
        }, 
        {
            "index": 149, 
            "rating": "4", 
            "review": "Historical reference. On the corner of Plaza de Mayo, crossing the street from the Pink House, it is our national cathedral, with two of our most venerable menorabilias, San Martin's tomb and the Jack's Pavillion of the highlanders (captured during the brittish invasions of Buenos Aires, back on 1806-1807, my father used to tell it was unique and I want to believe him!)."
        }, 
        {
            "index": 150, 
            "rating": "5", 
            "review": "Atmospheric and beautiful. On my visit to this beautiful cathedral, I was lucky enough to get a sit for an excellent free music concert.Check out dates and times for this frequent events!"
        }, 
        {
            "index": 151, 
            "rating": "5", 
            "review": "Get there on the Hour. A beautiful church with lots of gold. The tomb of General San Martin is there, guarded by soldiers. I think they change the guard every hour - we were there when it happened. It's a brief but enjoyable ceremony.This also may be your only chance to take a picture of the shrine and guards) without other tourists in the way, since access is not restricted at other times and people just stand there taking selfies."
        }, 
        {
            "index": 152, 
            "rating": "5", 
            "review": "What an incredible cathedral . My husband and I visited this cathedral to photograph it. You could not help but be moved by in incredible interior. I can only imagine what a service would be like here. Each station was absolutely breathtaking. I am not a religious person but thoroughly enjoyed this visit"
        }, 
        {
            "index": 153, 
            "rating": "4", 
            "review": "Impressive inside. The Cathedral is in the main Plaza de Mayo sq, close to the Cabildo town house and the Casa Rosada. From outside it's not that big and impressive as one could imagine for the main Cathedral of such a big city as BA. Also, the big frontal Greek style facade looks strange for Spanish inheritance.But when you enter, you'll see how big and vast it is. The most beautiful things are the Jose San Martin liberator mausoleum with its guards and the big altar."
        }, 
        {
            "index": 154, 
            "rating": "5", 
            "review": "For reasons of history. The Catedral contains the grave of El Libertador Martín which is guarded by the army. There is a changing of the guards every two hours on the hour."
        }, 
        {
            "index": 155, 
            "rating": "5", 
            "review": "Great cathedral to visit. Honestly, inside it it looks like one of that gorgeous italian churches. Large and so beautiful, it is a place to relax, enjoy and pray."
        }, 
        {
            "index": 156, 
            "rating": "4", 
            "review": "A Cathedral designed to look like a bank. The Popes old hangout is worth a visit. Everyone goes to San Martin's grave but across the hall are interesting letters about Judaism. Worth a stop."
        }, 
        {
            "index": 157, 
            "rating": "4", 
            "review": "Catedral Metroploitana as an historical site. The outside has been given the look of a Greek building yet deceptive since the interiors are huge and fairly grand. Though not religious but attended its long mass and not bored! A place worth visiting, so beautiful inside."
        }, 
        {
            "index": 158, 
            "rating": "4", 
            "review": "Very nice!. Very nice cathedral. Nice to see it .not very old but very well kept. Near casa roast a - the president office."
        }, 
        {
            "index": 159, 
            "rating": "5", 
            "review": "Surreal!. The tomb of San Martin is inside the Cathedral but more importantly is where our current Pope Francis gave mass every Sunday as Msgr. Mario Bergoglio. You feel an amazing energy when you walk in!"
        }, 
        {
            "index": 160, 
            "rating": "4", 
            "review": "A good attraction. The outside has been given the look of a Greek building. The interiors are huge and fairly grand. Quite deceptive from the outside. A place worth visiting while you are in the locality."
        }, 
        {
            "index": 161, 
            "rating": "4", 
            "review": "The pope's cathedral in Buenos Aires. We were not able to fully explore the cathedral due to an ongoing church service. In a guide book, it stated that there is a small display of the pope's personal objects in the sanctuary. There is quite an impressive marble mausoleum for the local hero General Jose de San Martin, known as the liberator of Argentina for his role in the War of Independence. There are two guards at the tomb. On the hour, there is a formal changing of the guards. The cathedral is located in the Plaza Mayo."
        }, 
        {
            "index": 162, 
            "rating": "3", 
            "review": "Grand. Love the Greek Pillars and the architecture and it was indeed very grand but you can finish a tour of this place within 30-1hr."
        }, 
        {
            "index": 163, 
            "rating": "4", 
            "review": "Great Architecture. I loved the architecture of Buenos Aires, a mix of European styles. This Cathedral is majestic and it is located in a french-roman square where you will think you are in Europe."
        }, 
        {
            "index": 164, 
            "rating": "5", 
            "review": "Beautiful Church in Plaza Mayo. This classical church was very surprising in it's interior beauty. Very impressive. The Greek façade fit well with the plaza."
        }, 
        {
            "index": 165, 
            "rating": "5", 
            "review": "Do not miss. Situated on the Plaza del Mayo, first impression is that it's a museum!Once inside it looks more like a conventional church with the addition of the mausoleum of General San Martin which is guarded by 2 very ornately dressed soldiers."
        }, 
        {
            "index": 166, 
            "rating": "5", 
            "review": "Beautiful Cathedral. This is amazing Cathedral where José de San Martins Tomb is, Public is more then welcome, and pictures are allowed, this is a must see, when in Buenos Aires"
        }, 
        {
            "index": 167, 
            "rating": "5", 
            "review": "Beautiful cathedral. This is a gorgeous cathedral where the pope did sermons prior to going to the Vatican. Beautiful gold sanctuary and many Catholic figurines. This is one of the major attractions of the city."
        }, 
        {
            "index": 168, 
            "rating": "5", 
            "review": "Beautiful -- take the time to visit!. Great location and can be combined with a visit to Casa Rosada, Plaza de Mayo, the Obelisk and even a walk to San Telmo. Churches, cathedrals, temples etc. always tell the story of its people and location and do does the Metropolitan Cathedral. Well worth a visit!"
        }, 
        {
            "index": 169, 
            "rating": "5", 
            "review": "A Cathedral from colonial times!. The Cathedral still has some elements dating from colonial times.The most important is the main gilt wood altarpiece dated 1785. The Christ of Buenos Aires statue was carved in 1671, and is the oldest in this gorgeous building.A Walcker german organ with more than 3500 pipes was set at the chorus section.Well worth visiting while you tour Buenos Aires!"
        }, 
        {
            "index": 170, 
            "rating": "3", 
            "review": "Grand Cathedral - Beautiful Interior. This is a historic building, and it's definitely worth a look around while you are in the Retiro area. It sits on the same square as the Casa Rosada. The Interior is beautiful and worthwhile to take a quick look."
        }, 
        {
            "index": 171, 
            "rating": "5", 
            "review": "Wow. i went to there with free walking tour and it's was great place and l love this art you must see this place if you are in bunes aires"
        }, 
        {
            "index": 172, 
            "rating": "5", 
            "review": "Beautiful Basilica on Plaza de Mayo. Don't miss it! This is a gorgeous neo classical monument. The tomb of liberator San Martin is located here with two honor guards in their full dress uniform like a pair of toy soldiers. It was also Pope Francis' cathedral before he became pope."
        }, 
        {
            "index": 173, 
            "rating": "5", 
            "review": "Looks amazing. Really looks amazing and very well situated so you can a lot around. It is worth getting inside and watching."
        }, 
        {
            "index": 174, 
            "rating": "4", 
            "review": "A monument to an politically powerful church. Is it a church or a government building? Designed to be an impressive building among the powerful government buildings this is monumental architecture designed to make people feel insignificant. It is a gorgeous building, well worth seeing in the heart of city and federal government buildings."
        }, 
        {
            "index": 175, 
            "rating": "5", 
            "review": "awesome to visit. I was taken by the beauty of the Cathedral. We spent 30 minutes of worship and admiring its Grego - Roman art around the walls and ceiling. I recommend taking a tour guide to visit the cathedral, there is so much history within its walls!\nWe visited the Tomb of the General San Martin, worthwhile visiting."
        }, 
        {
            "index": 176, 
            "rating": "4", 
            "review": "must visit. beautiful catherdral. It has the only memorial to the Holocaust locatd in a Catholic church. spend about 20-30 minutes. Located on the main plaza so lots to see in area."
        }, 
        {
            "index": 177, 
            "rating": "4", 
            "review": "Visit when less busy . We went middle of the day and very busy with groups of children. Still a good place to go to- very central. Look out to for the impressive tomb to a former president."
        }, 
        {
            "index": 178, 
            "rating": "5", 
            "review": "True Catholic Beauty. From the outside details to the art work inside. The floors, walls, ceilings and every thing in between is beautiful. Spent an afternoon and bring your camera. Cell phones will not do justice to the beauty."
        }, 
        {
            "index": 179, 
            "rating": "4", 
            "review": "Do not miss. Very nice building on the inside. There are some nice photo opportunities. There are also guided tours."
        }, 
        {
            "index": 180, 
            "rating": "5", 
            "review": "More impressive inside. When I first saw buenos aires cathedral I did not go inside, was not impressed. However because it is a place where Pope Francis use to go daily I went inside. Was nicely surprised.first general San Martin is buried there and has guard at his tomb. Altar is also very nice and floors are amazing"
        }, 
        {
            "index": 181, 
            "rating": "5", 
            "review": "Pop Francis home. The place is well organized for tourists, perfect for a short visit while you walk around. It's nice to visit Pop Francis former cathedral"
        }, 
        {
            "index": 182, 
            "rating": "5", 
            "review": "Pope Francis' former cathedral. Very grand, worth the visit. Open most of the day. San Martin is buried there, the liberator of Argentina!"
        }, 
        {
            "index": 183, 
            "rating": "4", 
            "review": "Just beautiful. We loved this great old cathedral, right in the main square. It is much larger inside that it appears from the street.\nThis was Pope Francis' church before he was Pope."
        }, 
        {
            "index": 184, 
            "rating": "3", 
            "review": "Quick visit. Very beautiful place bit always crowded! Tourists take photo everywhere and are too noisy! Church is big. Dont recommend to go driving, take a bus or walk!"
        }, 
        {
            "index": 185, 
            "rating": "5", 
            "review": "Papa and Me. Visited the Catedral Metropolitana during Holy Week 2011 and attended Easter Sunday Mass in this Church. Drop box has no provision for visits prior to 2011 so drop box date is not correct. My visit was in 2011. I just joined TripAdvisor this month. The architecture of this particular church is somewhat different from that of most churches. This church has a Greco-Roman design on the outside. The inside however has the traditional design found in most Catholic Churches. After Easter Sunday mass the Arch Bishop of Buenos Aires greeted well wishers at the rear of the church. I had the opportunity to reach out and shake his hand while he looked up at me with a look of astonishment. Maybe because I am taller than him or maybe because I am an American. Nevertheless the luck of the Irish must have rubbed off on him because the next thing I know he got elected Pope. ( I am American of Irish descent )."
        }, 
        {
            "index": 186, 
            "rating": "5", 
            "review": "Interesting Architecture. I can see where no one would have come here before Francis became Pope, however, they would have missed out on a beautiful building with beautiful stained glass and military history. There are now even more reasons to visit--even for a non-Catholic. Take a photo of the outside of the Casa de Rosado, but then make sure you step in here and take your time for an extended visit!"
        }, 
        {
            "index": 187, 
            "rating": "4", 
            "review": "Not an old building, but interesting architecture and stained glass windows. Nice place to take photos of the inside architecture and stained glass windows. The tomb of General San Martin is housed there."
        }, 
        {
            "index": 188, 
            "rating": "4", 
            "review": "One of a kind . This is the first cathedral that I ever saw with a Greek temple exterior. Normally one seems the excess and opulence of Roman Catholic majesty with towers and gothic spires reaching heavenwards. Not so here. This takes you back to Athens 1000 BC with its huge stone carved frieze above the portico above simple but massive majestic columns. Come here for the experience"
        }, 
        {
            "index": 189, 
            "rating": "3", 
            "review": "Quite and solitary before Francis was pope. Three years ago this was just another huge church; and despite its very central location you had a good chance to be the only visitor. Now, after the local Bishop became pope, there sre crowds of tourists or even school kids storming the entrance and taking pictures of any possible corner of the church. Apart from the holy images, an interesting area of the cathedral is along its right alley, as one of Argentina's (and Southern America's) most famous heroes (San Martin) rests in peace here with two guards protecting his eternal sleep."
        }, 
        {
            "index": 190, 
            "rating": "4", 
            "review": "A Place of God and Interesting to Military Historians. A beautiful building on the outside, beautiful on the inside. Even Military Historians will want to visit the tomb of San Martin located inside. I was lucky to be there for the changing of the guard. The military maintains a vigil over the tomb."
        }, 
        {
            "index": 191, 
            "rating": "3", 
            "review": "The outside is more impressive than the inside. Beautiful architecture should be admired as it is more beautiful and stunning than what is inside. However inside is beautiful too and has some nice pieces and statues. Nevertheless this is a house of God and should be treated this. A peaceful space to reminisce or quietly pray or reflect."
        }, 
        {
            "index": 192, 
            "rating": "5", 
            "review": "Interesting cathedral that sticks out amongst the main square. If you visit Argentina and find yourself in the main square (Plaza de Mayo) in front of 'La Casa Rosada', you owe it to yourself to turn around and visit the most interesting looking building lining the square. This cathedral is very nice on the inside, not the best by any means, but it does have a feeling about it that is different from many others. Between the location, the architecture, and the more current history of having been the Pope's previous establishment prior to the Vatican."
        }, 
        {
            "index": 193, 
            "rating": "4", 
            "review": "Pope Francis' Home. With the excitement surrounding Argentina's Pope, this is an interesting place to visit. You'll likely find crowds of neatly dressed school children in awe of the place where the Pope once officiated before being elected."
        }, 
        {
            "index": 194, 
            "rating": "4", 
            "review": "The Strained Intersection between Secular and Ecclisiastical. The very concept of an \"official\" cathedral should prompt interest among history buffs. Built in the European style with the probable intent of translating wealth into culture, the Cathedral can't help but embody the secular strains in Argentinian history. For that reason it is curious and worth a visit. If you visit ask your guide how often (and when) the Kirchners visited."
        }, 
        {
            "index": 195, 
            "rating": "4", 
            "review": "nice and you'll pass by it anyway. very different than European cathedrals, especially from outside, not really very impressive inside, but since every tourist passes by anyway, it's worth dropping in for some minutes"
        }, 
        {
            "index": 196, 
            "rating": "5", 
            "review": "Definitely worth a visit!. Beautiful church inside...not so much from the outside building design. We didn't attend Mass, but spent some time viewing beautiful statues and holy pictures."
        }, 
        {
            "index": 197, 
            "rating": "5", 
            "review": "A magnificent cathedral. Well worth a visit. This magnificent cathedral in the very heart of Buenos Aires features an Ancient Greek exterior. It's splendour on the inside is breath taking as are its side altars, not to be missed. The present catholic pope was the bishop of Buenos Aires and this was his church, as the news agent near the church, where we bought our picture postcards, proudly told me. Go and see it, whatever your religious faith may be."
        }, 
        {
            "index": 198, 
            "rating": "4", 
            "review": "Beautiful.. Didn't get to see the interior...beautiful at night. The details of the wall art is beautiful like the rest of the city..."
        }, 
        {
            "index": 199, 
            "rating": "4", 
            "review": "The city´s main cathedral were Pope Francis used to hold mass. The city´s main cathedral were Pope Francis used to hold mass. It is also the burial site of San Martin. It is a must see attraction while visiting hte city s center!"
        }, 
        {
            "index": 200, 
            "rating": "5", 
            "review": "Worth a look . If you are at the Plaza de Mayo already, definitely worth taking a look in the grand cathedral. A service was on when we there so we didn't go in, but got a good look from the front anyway."
        }, 
        {
            "index": 201, 
            "rating": "5", 
            "review": "The great San Martín is in here!. The liberator rests of our country and many others lays in here, in a beautiful catherdral you should visit being around here... and you should because in less than 2 blocks away you will find the Government house, this cathedral, the May square (revolution square) and the Government building used in colonial times (Cabildo)"
        }, 
        {
            "index": 202, 
            "rating": "3", 
            "review": "Its ok.. It was pretty but nothing outstading. It should be a stop on the day but nothing much. Just stay for the change of the guards, is nice to see."
        }, 
        {
            "index": 203, 
            "rating": "5", 
            "review": "Beautiful cathedral. This is where Pope Francis had his parish. Very beautiful cathedral. A must see! Doesn't look too much like a church from outside, but you'll be impressed when you go in!"
        }, 
        {
            "index": 204, 
            "rating": "4", 
            "review": "Not expected building. This church has interesting architecture, but it's not monumental. The cupola is similar as these in Granada, Spain."
        }, 
        {
            "index": 205, 
            "rating": "5", 
            "review": "Beautiful Place. What a spectacular place to visit. I definitely recommend this. People are very respectful and helpful in telling you about the history of the cathedral."
        }, 
        {
            "index": 206, 
            "rating": "5", 
            "review": "Lovely Cathedral. The Cathedral doesn't look much like one from the outside, but it certainly does, on the inside. Quite beautiful and serene, and where Pope Francis used to work."
        }, 
        {
            "index": 207, 
            "rating": "5", 
            "review": "The church home of Pope Francis. A beautiful Cathedral on the Plaza de Mayo and the church home of Pope Francis. Don't miss the side altars which are inspiring."
        }, 
        {
            "index": 208, 
            "rating": "4", 
            "review": "A cathedral that looks like a superior court on the exterior and the burial place of José de San Martí. I could not believe I came to the cathedral in Buenos Aires the moment I arrived. It doesn't look like any traditional cathedral in Gothic style. It reminds me of the superior court in a state level with all those columns in Greek architecture. The interior is a cathedral alright One interesting section is the burial place of José de San Martín, the founding father of Argentina, Peru and Chile, the Roman Catholic church did not agree to have him buried at the cathedral, his supporters managed to create a wing on the right of the cathedral and had him buried there. His mausoleum is guarded by 3 life-size female figures that represent Argentina, Chile and Peru, three of the regions freed by San Martin. And the only access to this mausoleum is through the cathedral. Quite interesting"
        }, 
        {
            "index": 209, 
            "rating": "4", 
            "review": "For an extraordinary experience, try to go on on a Sunday and hear mass so you see the church as a real and living.. The parish of the present Pope, one must not skip the Catedral Metropolitana when in Buenos Aires, regardless of one's religion (or lack of it). Its architecture is uncommon, and the interiors splendid. I was there on a Sunday and heard mass so I was able to mingle with locals dressed up for church with their tots bundled up in their Sunday's best."
        }, 
        {
            "index": 210, 
            "rating": "5", 
            "review": "If you visit the Casa Rosado and Plaza Martires, don't miss the Cathedral.. It is easy to visit when you visit the Casa Rosada and the Plaza Martires. The square is lined with some of the remaining beautiful building of BA from the early 1900's. The cathedral is imposing and well maintained."
        }, 
        {
            "index": 211, 
            "rating": "4", 
            "review": "The religious begining of a city. The Buenos Aires Metropolitan Cathedral is the main Catholic church in Buenos Aires, Argentina. It is located in the city center, overlooking Plaza de Mayo...\nThe sites beginning is from 1600s so this place has a very historical story to tell...you can come in a pray and step into another era..."
        }, 
        {
            "index": 212, 
            "rating": "5", 
            "review": "Spectacular Church!. Former home of Pope Francis, this is a remarkable cathedral. Just wonderful to look at and explore . We enjoyed mass there as well. Across from the Pink Palace, this is a church steeped in tradition. Go here!"
        }, 
        {
            "index": 213, 
            "rating": "3", 
            "review": "Cool respite from the street. Accidentally stumbled onto this, and am honestly a bit jaded after my Nth cathedral, but this was a cool spot to check out for a few minutes and fade the bustle of the street. However, compared to most other European cathedrals, etc, it was average (still impressive, just average by extravagant cathedral standards)"
        }, 
        {
            "index": 214, 
            "rating": "5", 
            "review": "A Breathtaking Cathedral. A stunning building, this Cathedral contained beautiful artefacts everywhere and we were there when the changing of the guard (dressed in period uniforms) took place at the tomb of one of the countries early founders."
        }, 
        {
            "index": 215, 
            "rating": "4", 
            "review": "Lovely historic church. Beautiful church. Excellent location across from the Casa Rosada. Stop in for a quick visit while you're in town"
        }, 
        {
            "index": 216, 
            "rating": "5", 
            "review": "A GREAT SAMPLE OF COLONIAL TIME. This is one of the most beautiful Cathedrals of Colonial Time in America. It has monumental areas and very nice windows and statues thus as the tumb of General San Martin ."
        }, 
        {
            "index": 217, 
            "rating": "4", 
            "review": "Buenos Aires Cathedral. Include in your walk around Plaza de Mayo. Spanish colonial history, and Cardinal Bergoglio's old gig before he leveled up."
        }, 
        {
            "index": 218, 
            "rating": "5", 
            "review": "The Pope's former Cathedral Parish. Enormous, and of course loaded with art, including a replica of the Pieta (which you find in Rome). You should pay a visit to this cathedral, as it is where Cardinal Bregoglio presided before becoming Pope Francis. Of course, there is also a museum there in his honour."
        }, 
        {
            "index": 219, 
            "rating": "4", 
            "review": "Nice. Beautiful Cathedral. Not too unique. We were with a group, or otherwise we wouldn't have gone. I think if I were a devout Catholic it might be very special since it is the current Popes diocese."
        }, 
        {
            "index": 220, 
            "rating": "5", 
            "review": "Worthy of being the pope's church. It is immense with many side altars and many tributes to saints like St. Poi and St. Martin Porres...and the magnificent mausoleum of San Martin..."
        }, 
        {
            "index": 221, 
            "rating": "4", 
            "review": "Nice Cathedral. Beautiful Cathedral. Visit the tomb of San Martin, the liberator of South America. Also be sure to look up at the enormous pipe organ."
        }, 
        {
            "index": 222, 
            "rating": "5", 
            "review": "Amazing!. This catedral doesn't looks like a normal catedral because the facad have \"Greek Columns\" - I dont know if it's Greek :-P\nVery beautiful inside too, with a huge saloon and beautiful images.\nYou can go there to feel relaxed and blessed!"
        }, 
        {
            "index": 223, 
            "rating": "5", 
            "review": "Beautiful Church centrally located-Must see. A beautiful church with gorgeous woodwork and statues. It is centralized, easy to get to and a must see. Thought it was a government building but surprised to see it was a church which was beautiful"
        }, 
        {
            "index": 224, 
            "rating": "4", 
            "review": "Nice and unusual from the outside. This cathedral is different from many others when seen from the outside. The facad have columns like a greek temple. On the inside it's more like an ordinary church but quite pretty. The side chapels all have skylights which gives them much more light than in an ordinary cathedral. This is a nice touch. The cathedral also houses the tomb of San Martin which is worth a visit."
        }, 
        {
            "index": 225, 
            "rating": "4", 
            "review": "Woth a visit. Interesting exterior architecture and beautiful inside. We happened to be there when the guards closed the mausoleum of General San Martin at 5pm. Seeing the soliders do this was quite impressive for my children"
        }, 
        {
            "index": 226, 
            "rating": "5", 
            "review": "Beautiful Architecture. A beautiful church with gorgeous woodwork and statues. It is centralized, easy to get to and a must see."
        }, 
        {
            "index": 227, 
            "rating": "3", 
            "review": "Main cathedral. After visiting other countries with beautiful churches I really cant say that our cathhedral is remarkable.Having said that if you are around Plaza de Mayo, it worth a visit."
        }, 
        {
            "index": 228, 
            "rating": "5", 
            "review": "impressive!. Nice Cathedral and may appear more like a government building from the outside. The tomb of Jose de San Martin rest inside with military guards protecting the tomb. A must spot and see when you are in Plaza de Mayo."
        }, 
        {
            "index": 229, 
            "rating": "5", 
            "review": "Beautiful. This cathedral is a beautiful tourist friendly experience. Inside the cathedral has many special areas to observe and establish lasting memories."
        }, 
        {
            "index": 230, 
            "rating": "5", 
            "review": "Wonderful. Artistic work all over the cathedral is just marvelous! Every single detail is very special. It is a must to visit the cathedral!"
        }, 
        {
            "index": 231, 
            "rating": "4", 
            "review": "One of Buenos Aires' big Catholic Cathedrals.. On the façade of the building, there is a flame to keep the spirit of Argentina's most revered hero (General Jośe de San Martín) alive. Inside General San Martin's Mausoleum: Liberator, General Jośe de San Martín, freed Argentina, Chile, Peru, Bolivia and Uruguay from Spain. His tomb is contained in the Cathedral.The floors have beautiful mosaics and the Cathedral is beautiful."
        }, 
        {
            "index": 232, 
            "rating": "5", 
            "review": "Former Cathedral of Pope Francis. This is a beautiful building in it's own right, as are most great cathedrals. However, it was also where Pope Francis was based as Archbishop of Buenos Aries. It was also the site of Eva Peron's funeral. Within a marble mausoleum in the cathedral, cast in the glow of an eternal flame, are the remains of Argentina's liberator General José de San Martín."
        }, 
        {
            "index": 233, 
            "rating": "4", 
            "review": "Must see, even if you're not into churches. This is one of the largest and most important churches in Argentina. The relatively sober look of the main facade disguises the amazing arcitecture of the interior of the church. This church does however lack some of the majesty and imaculate upkeep when compared to some of the major churches in Europe. But appreciate the building for what it is and definitely make the effort to see it."
        }, 
        {
            "index": 234, 
            "rating": "4", 
            "review": "An amazing place. You really need to see this cathedral to have the best idea of what if offers. It is an overwhelming experience and very unique in a lot of ways."
        }, 
        {
            "index": 235, 
            "rating": "5", 
            "review": "Great, important Church. This Cathedral is located diagonally across from the Casa Rosada across Plaza de Mayo. It is an unusual, classical architectural style which seems somewhat out of place with the Casa Rosada and other buildings. It is a beautiful building and houses a memorial (and the remains, I think) of the Argentine national hero, San Martin. The momorial is guarded by ceremonial Argentine soldiers. The church itself is beautiful. It is (apparently) the sight of Evita Duarte Peron's funeral Mass. If you look at some of the grainy, black and white video (on youtube or elsewhere), you can clearly see the casket being carried through the crowd near the columns. A beautiful church."
        }, 
        {
            "index": 236, 
            "rating": "5", 
            "review": "Pope Francis' Church. This cathedral took 3 hundred years to build. It has a neo classical exterior & a Baroque style interior. The beauty of the place takes your breath away. Right near the \"Pink Palace\" so you can cross 2 landmarks off your list at the same time."
        }, 
        {
            "index": 237, 
            "rating": "5", 
            "review": "Catedral or museum?. Outside it seems more a museum than a cathedral. It is really good go inside and appreciate the beauty. Good place to go, near to the Casa Rosada."
        }, 
        {
            "index": 238, 
            "rating": "5", 
            "review": "A beautiful church. The inside of this church is beautiful. We liked being able to see the guards at San Martin's mausoleum and to connect with an important part of Argentine history."
        }, 
        {
            "index": 239, 
            "rating": "4", 
            "review": "Greek temple outside with a very Spanish Catholic interior. The church offers a rather simple, if large, Greek temple facade; however one step through the doors and it's clear this is a traditional Catholic cathedral. I happened in on a large celebration with many priests, bishops and a cardinal presiding. The music was beautiful and the congregation included people from a variety of economic levels. I was especially impressed by the tomb of General San Martin, a figure much like George Washington for much of South America."
        }, 
        {
            "index": 240, 
            "rating": "4", 
            "review": "Simply breath taking. The Catedral Metropolitana is located in the midst of Plaza de Mayo, and is absolutely beautiful. Recommend seeing it."
        }, 
        {
            "index": 241, 
            "rating": "5", 
            "review": "Loved it!. I'm not the religious type but this place is just gorgeous. Worth a visit, go inside and experience the peace within it."
        }, 
        {
            "index": 242, 
            "rating": "5", 
            "review": "Beautiful. The cathedral is beautifully decorated and still in use today. If you're going to take pictures beware of the restrictions since it is still used as a place of worship. The greek columned exterior belies the ornate interior and is missing the bell towers. The cathedral can be seen from the famous Plaza Mayo. Our tour guide told us this was the cathedral where Pope Francis gave mass when he was the Archbishop but I don't know this to be a fact."
        }, 
        {
            "index": 243, 
            "rating": "5", 
            "review": "Go Inside!. This is a lovely, old cathedral where Pope Francis honed his skills. It has many small chapels all of which are worth seeing. The high ceilings cause visitors to look up and the feeling inside the building is one of architectural and quiet beauty."
        }, 
        {
            "index": 244, 
            "rating": "5", 
            "review": "Don't judge by the outside. This building fro the outside is unimpressive but once you enter it is beautiful and well worth a look"
        }, 
        {
            "index": 245, 
            "rating": "5", 
            "review": "Beautiful and Huge. This is a very beautiful place. It is certainly worth a visit. Be sure to look up at the painting on the ceiling."
        }, 
        {
            "index": 246, 
            "rating": "5", 
            "review": "Grande yet humble. Be sure to visit the Cathedral by The Pink House. This is where Pope Francis is from. Arriving Sunday morning around 9:30 with Mass starting at 10:00 AM, there was ample time to take photos of what catches your eye. Almost. Once Mass begins you will want to be seated where you can view the stage and the alter. Listen to the Priest give Mass in the beautiful Argentine Spanish language even if you barely understand a word. It is worth it! Leaving halfway through Mass to get to Teatro Colon in time for the free 11:00 AM concert was worth it too. Review on that is in another place in my reviews."
        }, 
        {
            "index": 247, 
            "rating": "5", 
            "review": "Improved to pope standard.. I have been there 7 years ago. On the outside and inside a lot of cleaning and refurbishing has been carried out. Now it is a wonderfull cathedral."
        }, 
        {
            "index": 248, 
            "rating": "4", 
            "review": "Go inside. We nearly walk past this place as to me it looked rather fake from the outside, but inside it is stunning, it's huge and defiantly worth the walk around."
        }, 
        {
            "index": 249, 
            "rating": "5", 
            "review": "Beautiful! Do not miss!. The exterior of this church does not give a clue as to the beauty one finds when entering this gorgeous space. It is of interest of course that our current pope (Pope Francis) was the bishop here and that adds a bit of special feeling. Among the interesting things is a \"mural\" located in one of the naves on the left side of the cathedral devoted to the holocaust. Be sure and take a look at that."
        }, 
        {
            "index": 250, 
            "rating": "5", 
            "review": "beautiful and interesting. Great atmosphere, choir singing, on Plaza de Mayo, not to be missed. General San Martin (libertador) buried here. Beautiful paintings."
        }, 
        {
            "index": 251, 
            "rating": "5", 
            "review": "Beautiful, historical, and memorable ..... This Cathedral has the beauty you might expect to find in Rome. Pope Francis was Archbishop of Buenos Aries and has said mass here. In addition, General Jose de San Martin is entombed within, for all to visit. Photos are permitted. Spend time inside, to learn its history."
        }, 
        {
            "index": 252, 
            "rating": "5", 
            "review": "Italian design in Argentina!. Beautiful cathedral and I mean beautiful. Italian designed, it's one of the best in South America.\nInside is the tomb of national hero Jose de San Martin.\nItalian marble statues and innate carvings and design make this a must stop in Buenos Aires."
        }, 
        {
            "index": 253, 
            "rating": "3", 
            "review": "An Italian Rococco Cathedral. Interesting, but it doesn't have the smoky darkness and atmosphere of the Italian originals. the painting in the niches around the walls, look like cheap Far Eastern copies. I was there for Easter and hped the services would be uplifting. Very dull and boring was the reality, just intoned prayers and responses. A quick in and out."
        }, 
        {
            "index": 254, 
            "rating": "4", 
            "review": "Historic, Beautiful. Visited as part of our walk about of the government square. This was Pope Francis’ previous cathedral when he was archbishop of Buenos Aires. It is beautiful with much to learn about the history of the church in Argentina and Argentina in general."
        }, 
        {
            "index": 255, 
            "rating": "5", 
            "review": "is this the POPE's??. As per other reviews, don't confuse this with the Basilica in San Martin. This building is off Plaza de Mayo, with an apex and columned narrow terrace to the front, it looks more like a National Library than a cathedral. There's a little Pope Francis museo inside. Its not clear to me, and i asked some locals who couldn't clearly answer, whether Pope Francis was ministering here or not. I believe as Archbishop of BA he was. Anyhow, its a beautiful cathedral inside, with quite high ceilings, some pretty chapels to the right. Its kept in excellent condition, some postings made me think it was in disrepair...not so. And don't forget, its a \"working\" church, so so as a tourist respect those praying and be discreet. I didn't have luck finding the San Martin tomb, i think it was on San Martiin St., but were some protestors"
        }, 
        {
            "index": 256, 
            "rating": "5", 
            "review": "Wounderful surprise. You walk towards the Pink House ( Casa Rosada) and go by what resembles a stately bank building. Going in is this remarkable church that is just wonderful to view."
        }, 
        {
            "index": 257, 
            "rating": "4", 
            "review": "Lovely cathedral. I didn't realise it was a cathedral from the outside, but once you are in the door you see the full beauty. I was there at the beginning of a service, so got to hear the pipe organ play as well. Very enjoyable visit."
        }, 
        {
            "index": 258, 
            "rating": "4", 
            "review": "Quality Cathedral. Well worth wandering around, not the most stunning cathedral that we have ever visited as it needs money spending on it. We spent only a short time here as there are many other places to see but glad we did."
        }, 
        {
            "index": 259, 
            "rating": "5", 
            "review": "Impressive!!!. This Cathedral is situated in Plaza de Mayo which every toursit would visit. If you are there early morning you will also get to see the changing of the guard which begins fro Casa Rosada and continues down the road to the Cathedral where the guard the Tomb of Gen, San. Martin. A beautiful Cathedral with a grand Ornate Altar, lovely Stained Glass windows and Gen Martin's Tomb. The Mosaic flooring is also lovely. AS we were there on a Sunday, there was mass going on with some lovely choir music. The flame of the unknown soldier on the outer wall should be seen too."
        }, 
        {
            "index": 260, 
            "rating": "5", 
            "review": "A good place to stay a while and watch locals. this cathedral needs some TLC but that aside it is still beautiful and worth sitting for a while and watching the locals pass by.the tomb of Gen. San Martin is very impressive."
        }, 
        {
            "index": 261, 
            "rating": "4", 
            "review": "Mosaics. We like previous reviewers would have missed it from the outside, but worth a look inside I marveled at the mosaics on the floor the work it must have taken to complete this huge area, of intricate design , and patience !"
        }, 
        {
            "index": 262, 
            "rating": "4", 
            "review": "Interesting. This didn't look like a cathedral from the outside so we missed it the first time we walked past. It is a nice cathedral but not fantastic. The nave is quite impressive."
        }, 
        {
            "index": 263, 
            "rating": "4", 
            "review": "Catedral Metropolitana. beautiful church,but not as ornate as some in France. It is on a very busy street corner and watch the traffic to get there"
        }, 
        {
            "index": 264, 
            "rating": "4", 
            "review": "Cathedral of Pope Francis. Very ornate inside as most old Catholic Cathedrals and Basilicas are. It was interesting being inside the church where the current Pope once preached as Archbishop of Buenos Aires. It is also where the tomb of General Jose de San Martin who liberated Argentina is located with soldiers guarding it. The tomb is seen from inside the church, but it is actually located outside the church since he was not catholic. Near the Pink house."
        }, 
        {
            "index": 265, 
            "rating": "4", 
            "review": "Nice urban cathedral. Impressive, worth a visit if you are in the area. Be careful of the 'mustard scam.\" One of our party was sprayed and someone was immediately there with a kleenex to \"help.\" We all started shouting at once and he disappeared into the crowd."
        }, 
        {
            "index": 266, 
            "rating": "5", 
            "review": "Beautiful cathedral. we visited the cathedral where pope Francis preached. It is lovely inside. We were there during mass and although I am not a catholic it was interesting being in the church of the Pope. The tomb of General Jose de San Martin is ver impressive. He freed Argentina and designed the countries flag. Soldiers still our outside the tomb in uniforms that were worn during the time of the General. The crypt is very interesting . Worth a visit."
        }, 
        {
            "index": 267, 
            "rating": "4", 
            "review": "Impressive interior. Looking at the exterior, one would never guess that this is a cathedral , specially the one that the existing pope was in charge of ! Once inside though , you very rapidly feel how solemn this site is and why it is so close to the hearts of the Argentinians !  Make a stop at the burial site of General San Martin , the national hero and if you have the time , wait for the change of the guards which happens on the hour . It is awkward to see this in a cathedral . It is also interesting to follow the guards when they leave the site to go back to the Casa Rosada or the other way around !"
        }, 
        {
            "index": 268, 
            "rating": "4", 
            "review": "Good .................but ................. The current Pope was in charge here before his recent elevation. The exterior is Greek-like and classical in design and not very inpsiring, but inside is not what is expected. The tomb of national hero San Martin is guarded by two men in colourful uniform and around the outside there are many other small chapels and places for worship. However like so many Argentine memorial and treasures it is need of a little tender loving care. Plaster and paint have fallen from interior columns, many of the paintings could do with a clean and the interior is rather dark. It could be considerabaly better with a bit of attention. That aside, worth a visit. The peace and tranquility of the world is rudely shattered on leaving the cathedral however as it is sited alongside Plaza de Mayo, another busy area of traffic. Perhaps pedestrianising the road outside the cathedral would be the best option?"
        }, 
        {
            "index": 269, 
            "rating": "5", 
            "review": "Misleading exterior.. What looks like a Greek temple from the outside, is in fact the Catholic Metropolitan Cathedral where the current Pope Francis was Cardinal Archbishop. Beautiful Gold alter area is well worth viewing."
        }, 
        {
            "index": 270, 
            "rating": "3", 
            "review": "A STRANGE BUILDING. From the outside it looks like it could be a bank or government offices- within it is totally Spanish Catholic with over the top gold / life size Jesus on a donkey & numerous clothed statues of the Virgin Mary. Two soldiers in Hollywood uniforms guard the burial place of General Sam Martin the liberator of Argentina from the Spanish rule. I did not feel the awe I feel when I enter the great European cathedrals. But it is certainly worth a visit within your trip to the Pink House/ Plaza de May etc."
        }, 
        {
            "index": 271, 
            "rating": "3", 
            "review": "Unusual Exterior, Large and Interesting Interior. The exterior is Greek Revival. The interior is a varied mix of styles influenced by various places in Europe.There is a lot of confusion among Trip Advisor reviews between this cathedral, Basilica del Santisimo, and San Pedro Gonzalez Telmo Church. The Catedral Metropolitana is in the Plaza de Mayo which you will likely visit anyway, and the Greek Revival exterior is different from the other churches close by.This is interesting to see although I would not rate it as one of my favorite churches by a long shot. It is free. Worth an hour, and if you can do it with a local guide all the better.If this review is helpful then please indicate so below."
        }, 
        {
            "index": 272, 
            "rating": "3", 
            "review": "Shockingly Different Inside from Outside. The outside is a Greek Revival style with an interesting frieze showing what looks like a confrontation between Moses and Pharaoh. Inside, it's a mix of different European-influenced styles. Not the most stunning cathedral I've ever seen, nor something to plan your trip around, but it's free and in Plaza de Mayo which you should visit anyways. Plus it's free."
        }, 
        {
            "index": 273, 
            "rating": "4", 
            "review": "Greek Cathedral. On the inside it is a classic Catholic cathedral, on the outside it is an ancient Greek temple. Strange but true."
        }, 
        {
            "index": 274, 
            "rating": "5", 
            "review": "Meeting with the spiritual heart of the city. Although the outside is not that appealing as the churches in, let's say Europe, the inside is quite different. Very well preserved and interesting enough to know this was the place where the current Pope used to work. I went twice. The second and last time was a Sunday to attend a mass. The choir left me speechless... Try to attend a mass even if you are not Catholic."
        }, 
        {
            "index": 275, 
            "rating": "3", 
            "review": "Another cathedral...how many can you visit in BA?. It's a whacking great cathedral and the centrepiece has to be the backdrop and surrounds of the altar that appears to be made from solid gold. Lighting is not good inside and photography isn't easy but it's quite a stunning sight.Various side altars/chapels and packed with tourists. Worth a quick visit"
        }, 
        {
            "index": 276, 
            "rating": "4", 
            "review": "Imposing. Like all great Cathedrals it has an atmosphere. The Art,,chapel alters, statues and architecture add to this. The Pope is pictured and revered at the entrance. Many pilgrims were in attendance the day we visited and it seemed irreverent to dwell in this special place too long"
        }, 
        {
            "index": 277, 
            "rating": "4", 
            "review": "Visit to Catedral Metropolitana. Four tourists from a cruise ship visited Plaza de Mayo. This was a very beautiful plaza that had the Catedral Metroplitana right across the street from the plaza. This was a very beautiful cathedral that was the home cathedral for Pope Francis. We were very glad that we got to tour this cathedral. This is a beautiful cathedral is definitely a must see."
        }, 
        {
            "index": 278, 
            "rating": "5", 
            "review": "A must. We were there on a sunday, there was a celebration, at the end of the mass the priest walked down the aisle and waited for the people and shook the hand of the people respectfully.This is a beautiful church definitely a must see."
        }, 
        {
            "index": 279, 
            "rating": "4", 
            "review": "Interesting folk art. Arriving at plaza de Mayo, I came upon a building that looks on the outside like an attempt to replicate the Parthenon. Inside, one sees beautiful stained glass windows, an ornate alter, fairly good oil paintings depicting the life of Christ (with emphasis on the crucifiction), an armed guard whose swords dissuade one from defacing the rather large tomb of the first governor of modern Argentina, now beatified (although I saw nobody praying to him), perhaps for being one of those 'good' politicians. In one alcove there is a life-sized model of Jesus riding a donkey, something I have not seen in a cathedral apart from Christmastime. Several alcoves have small dolls representing Mary and dressed in elaborate dolls clothes. Again something unusual from my limited experience. A nice side chapel was separated by large curtains, allowing the three occupants to pray in relative privacy this Sunday, while tourists like myself paraded through the main part."
        }, 
        {
            "index": 280, 
            "rating": "5", 
            "review": "Unusual Cathedral. When viewed from the outside this looks more like an old city government building with huge baroque columns. Inside is a lovely church that houses the tomb of General Jose' de San Martin, Argentina's most revered hero. There are tours in Spanish but not in English. It is still an active church with many masses."
        }, 
        {
            "index": 281, 
            "rating": "4", 
            "review": "Gorgeous Church. Situated Its a very gorgeous church having this very golden look all around. Was very impressive of the architecture and the several statues around it."
        }, 
        {
            "index": 282, 
            "rating": "4", 
            "review": "Impressive. The Metropolitan Cathedral is situated around the main city-square. Inside the Cathedral, the architecture and several statues are quite impressive. We happened to be visiting on a Sunday and therefore, were able to witness the solemn religious service."
        }, 
        {
            "index": 283, 
            "rating": "4", 
            "review": "Gorgeous. Neither you're catholic or not, you should visit Buenos Aires Cathedral. It is an awesome construction and a inspiring place to keep your thoughts in peace."
        }, 
        {
            "index": 284, 
            "rating": "5", 
            "review": "A beautiful place. You walk up the steps and once inside you are struck by the beauty and splendour of the cathedral. Calm and quiet just as you would hope it would be.An emphasis on Pope Francis, as you would expect; such pride in the city, it is difficult not to be swept along with the atmosphere.A lovely calm moment in a busy city."
        }, 
        {
            "index": 285, 
            "rating": "4", 
            "review": "Christmas Eve Service. We came for the much-mentioned Christmas Eve service, and it was lovely. I did wish I knew more Spanish so I could have followed along better, but it was still quite atmospheric. It's not the most splashy cathedral in the world, but it's pretty and gets the job done."
        }, 
        {
            "index": 286, 
            "rating": "4", 
            "review": "San Martin's tomb. Very large and spacious with lovely architecture - particularly the vaulted ceilings. Loved the stories attached to most of the side altars, especially the jewish connection. Disliked the huge number of big groups being shown around by overly loud guides."
        }, 
        {
            "index": 287, 
            "rating": "4", 
            "review": "Learn some history from this Cathedral. From the outside the architecture doesn’t look anything like a cathedral. It has no bell tower, just like any historical building. It has been rebuilt and renovated a few times. Now the cathedral is mixed with 18th century dome and 19th century facade. The interior has 18th century precious statues and altar pieces, and Renaissance decorations. The big attraction inside is Mausoleum of General San Martin. He was a Spanish captain that helped Argentina, Chile, and Peru gain independence from the Spanish in the early part of the 19th century.At the Mausoleum they have 2 soldiers standing guard. I learned some history from this visit. Happy Travelling!"
        }, 
        {
            "index": 288, 
            "rating": "5", 
            "review": "MY #2 FAVORITE ATTRACTION IN BUENOS AIRES!. Next to Teatro Colon, my #2 favorite attraction in Buenos Aires, Argentina is the Cathedral Metropolitana. It's more beautiful and bigger than the one in Santiago, Chile which has the same name. There are several alcoves or altars inside this Cathedral, each one depicting different saints. I like the intricacies of the art works of these alcoves, walls and ceilings. Tomb of General Martin - two guards stand alert next to this tomb. This General helped liberate Argentina from Spain. I think he did the same thing in other countries such as Peru (saw his statutes in Lima, Peru).Other attractions near by: Cabildo, Parque de Mayo, and Casa Rosada.I said my prayers before leaving this beautiful Cathedral. Hope you enjoy your visit of this place and related attractions."
        }, 
        {
            "index": 289, 
            "rating": "4", 
            "review": "Pope's church. Viewed from the outside it looks like an official building ,maybe a library. Inside it is pure Catholic Cathedral. This as you probably know is Pope Francis's parish. It also includes the burial site of San Martin. Interesting to walk through with a guide as the history is not apparent"
        }, 
        {
            "index": 290, 
            "rating": "5", 
            "review": "Unassuming outside, impressive inside. Could be mistaken for a bank on the outside, but very impressive on the inside. Jose de Martin, Argentina's liberator, is entombed inside, complete with classically dressed uniformed guards at the entrance."
        }, 
        {
            "index": 291, 
            "rating": "4", 
            "review": "The Pope's Parish. I'm not a Catholic, so I'll get the terminology wrong. This was the \"home base\" for the current Pope when he was Archbishop of Buenos Aires. Beyond that, it is a very interesting mix of styles and construction reflecting several periods of construction, renovation and modification. A surprise was the tomb of Argentine liberator Jose de San Martin with an honor guard of Argentine soldiers in full ceremonial dress uniform. Their changing of the guard ceremony is low key, but very impressive, and the guard detail then marches out of the the cathedral and down the street to the \"Pink House\" about 500 meters away."
        }, 
        {
            "index": 292, 
            "rating": "4", 
            "review": "The best they have. This low-rise neo-classical structure, with its massive pillars and triangular facade busy with stone carvings, and topped with a very modest cupola, began in the 16th Cent., but not all that well, because it had to go through several reincarnations most of which were a result of poor design or bad craftsmanship in its earlier phases. It occupies a prime site at one corner of Plaza de Mayo, and as the major ecclesiastical building of the city it seems like a massive understatement. The interior is more in line with its status, with lots of religious flourishes such as a Stations of the Cross executed by local artists, and two unusual statues of the Saviour: Christ of Buenos Aires, and Christ of Great Wealth. A little more wealth is needed, as several areas are not in good repair, with peeling surfaces and eroded plaster and brickwork. Most of the available money seems to go to the maintenance of the Cathedral's showpiece, the Mausoleum of General San Martin and two of his senior military associates who, together with Bolivar, brought about the independence of the continent. Apart from the florid architecture, sculpture, the high-raised pedestal with the great soldier lying flat on his back and draped with a shroud, and the Roman style multi-concentric decorated dome, there are plaques of appreciation from several other countries to whose liberation San Martin contributed. A nice democratic touch is that the Unknown Soldier of Independence is also buried with his superiors. Two live soldiers are permanently on guard. The cathedral boasts an enormous organ of 3,500 individual pipes that is worth a look, although I did not hear it play. The final sight that struck a chord with me is a small chapel ----- the first on the left as you enter, that holds a celebrated icon ----- a small framed portable representation of the Virgin called Our Lady of Lujan --------- that San Martin carried with him into battle, with gratifying results. On the left wall of the same chapel, almost as a non-sequitur as I cannot see the relationship, you will find a memorial to the Holocaust, and plaques describing the 200,000 survivors who made their homes in Argentina."
        }, 
        {
            "index": 293, 
            "rating": "4", 
            "review": "Nice Cathedral. If for no other reason, go visit this church for the tomb of Argentina liberator Jose de San Martin."
        }, 
        {
            "index": 294, 
            "rating": "5", 
            "review": "Beautiful place to visit and contemplative. Seing it from outside, I did not realize it is a church , rather I thought it's a museum, by far I didn't expect it is the Cathedral. But after stepping in I was overwhelmed by the architecture and style. It's a \"Must See\" in B.A."
        }, 
        {
            "index": 295, 
            "rating": "4", 
            "review": "Christmas Eve. I was surprised at the low-key architecture, especially as this cathedral is right by La Casa Rosada and Cabildo de Buenos Aires. Inside, the traditional catholic chapels were well used and beautiful. I enjoyed the visit"
        }, 
        {
            "index": 296, 
            "rating": "5", 
            "review": "Very pretty. We stumbled upon the Catedral in downtown BA, and it was magnificent. The high ceilings blew us away, and you could tell there was so much history in the place."
        }, 
        {
            "index": 297, 
            "rating": "5", 
            "review": "Beautiful Church. We arrived at the Catedral Metropolitana mid morning and got a treat with a children's choir doing their Christmas concert. The church has beautiful architecture. We were told that Pope Francis spent a number of years at this cathedral--that made it even more special."
        }, 
        {
            "index": 298, 
            "rating": "3", 
            "review": "Hmmm. Kind of strange to find a Roman-style building housing a cathedral in South America. Perhaps it reflects that many Argentinians' origins are Italian? Didn't do much for me but if you're in the area....."
        }, 
        {
            "index": 299, 
            "rating": "3", 
            "review": "if you happen to be there.... ...you may pay the Cathedral a visit. we didn't find it that intersting but, since it's one of the historic icons of the city, it added value to our visit to that area. i personally preferred the Convento de Santo Domingo, Belgrano Ave 'n Defensa, which is 5/6 blocks away from the cathedral and its history is much more interesting. If you happen to go on a weekend, you may then walk along the Defensa St and enjoy street art sales, local crafts, have a pizza at the Continental or have luch at Esteban de Luca, go to El Mercado de las Pulgas and get some bargain"
        }, 
        {
            "index": 300, 
            "rating": "4", 
            "review": "Lovely Church. The exterior of this church is not a good indicator of what you will find inside. Very lovely and ornate inside. Located right on the Plaza de Mayo."
        }, 
        {
            "index": 301, 
            "rating": "4", 
            "review": "beautiful!. The cathedral has a Roman-Greek style facade. But inside it's dark and very ornate.In addition, it holds the rests of General San Martin, Argentina's \"Libertador\" (liberator). The location is great since Casa Rosada and Cabildo are near, as well as Plaza de Mayo."
        }, 
        {
            "index": 302, 
            "rating": "4", 
            "review": "Don't be deceived by the exterior. The exterior gives you no idea of what to expect when you step inside, although to be fair the external frieze is a sight in itself.\nThe tomb of General Jose de San Martin is very impressive with a couple of soldiers in full dress uniform on guard. The altar is standard RC fare as are the side chapels."
        }, 
        {
            "index": 303, 
            "rating": "5", 
            "review": "great catedral. Not a gothic nor roman one but a very modern from XIX century.\nInside is the monument to some of the great heroe of argentina history.\ncatedral is near the cabildo and casa rosada"
        }, 
        {
            "index": 304, 
            "rating": "4", 
            "review": "The exterior fools you. Having visited a large variety of cathedrals in Europe and parts of Latin America, I was quite fooled by the exterior, expecting to find a more modern decor. Step inside and you will find much like what you can find in cathedrals around the world: dark, very ornate, lots of iron bars. Highlights include the connection with Pope Francis and the mausoleum of San Martín. You don't need to spend much time here, and fortunately it is located on the north side of the Plaza de Mayo."
        }, 
        {
            "index": 305, 
            "rating": "4", 
            "review": "Not your standard cathedral. Usually a Latin American cathedral has broad steps, two towers, and could just as easily be set in Spain. This one is in classic style, Roman or Greek, and it speaks, I believe, to the more diverse backgrounds of the populace, and to the pretensions of the proud Portenos. That being said, I found it gloomy."
        }, 
        {
            "index": 306, 
            "rating": "4", 
            "review": "Very nice to visit, close to Casa Rosada . It's an old and nice church, with a nice religious atmosphere and the mausoleum of General San Martin, a very notorious character in Argentinian history. If we'd have to drive for hours to reach it I'd be a little disappointed. But it's close to the Casa Rosada and Plaza de Mayo, so it really felt good to visit. If you're lucky enough there were some church organ concerts scheduled."
        }, 
        {
            "index": 307, 
            "rating": "3", 
            "review": "Normal church. The cathedral is like most churches. There is nothing special about it. The facade is different and it does not look like a church."
        }, 
        {
            "index": 308, 
            "rating": "4", 
            "review": "Nice Cathedral, with a strong historical identity. This Cathedral is an Iconic place in the traditional centre of Buenos Aires, is next to Plaza de Mayo Square. It's a Building related to Greek-roman Architecture. In the Cathedral you will find the \"General San Martin Mausoleo\". That's the place where the remains of General San Martin are."
        }, 
        {
            "index": 309, 
            "rating": "4", 
            "review": "General San Martin at the Catedral. General San Martin Mausoleo....if you want to know about the héroe of Argentina...please visit the Cathedral...and feel the power of the most important General of Argentina, who give freedom to Argentina, Peru , Chile, ....a real Heroe"
        }, 
        {
            "index": 310, 
            "rating": "4", 
            "review": "Mixed architectural styles. Others call it bland, as we went past several times, thought we were looking at a Grecian style building - hard to say what it is but eventually realise it is a cathedral that is so different on the inside."
        }, 
        {
            "index": 311, 
            "rating": "5", 
            "review": "Beautiful and sublime. . Went there for Sunday mass during our 8 dat stay. The building itself is beautiful and the icons and paintings culturally and aesthetically sublime. One learns a lot about a culture when experiencjng the way religion is expressed."
        }, 
        {
            "index": 312, 
            "rating": "5", 
            "review": "Plain Outside: Gorgeous Inside. This simple, though large buidling wouldn't draw attention unless you were paying attention. From the outside it doesn't look at all like a Catholic cathedral. But go inside, and you'll be swept away by the beautiful church, altar, inlaid floors, and statuary. It also houses the guarded tomb of Juan San Martin, liberator of Argentia. Be sure to see the touching Holocaust \"exbit\" on the left side of the church. I particularly loved the small statue of Michael the Archangel on the right side in back."
        }, 
        {
            "index": 313, 
            "rating": "4", 
            "review": "A beautiful hidden cathedral!. The Cathedral doesn't look anything like you'd imagine from the outside, I sort of rambled in there by mistake but I was happy I did! The architecture inside the church is beautiful and it's very relaxing taking a short walk inside. There are many different types of catholic idols that are worth going to see.Visited August 2013"
        }, 
        {
            "index": 314, 
            "rating": "4", 
            "review": "Home of Pope Francis. Located steps from the Presidential Palace, but difficult to identify initially because it doesn't look like a church from the outside, but more like a bank or courthouse. Highlight for me was the mausoleum of General San Martin, complete with two honour guards. There is no admission fee and photos are allowed. Hours: M-F 7:30am-6:45pm, weekends 9am-7pm."
        }, 
        {
            "index": 315, 
            "rating": "5", 
            "review": "Very beautiful. Historic place. The architecture is very amazing and its a good place to relax and Thanks God for all.."
        }, 
        {
            "index": 316, 
            "rating": "3", 
            "review": "Looks like a bank on the outside. We didn't find it the first time we visited the Plaza de Mayo because it doesn't look like a church on the outside. Certainly does on the inside. We were lucky to be there during organ practice - beautiful music filling a large and attractive worship space."
        }, 
        {
            "index": 317, 
            "rating": "5", 
            "review": "Highlight of Buenos Aires. Absolutely gorgeous cathedral near Casa Rosada. The construction, paintings and altars are out of this world and it amazes by the demonstrations of faith by the locals. The place where San Martin is buried is also very busy. To me it was one of the best visits in Buenos Aires"
        }, 
        {
            "index": 318, 
            "rating": "4", 
            "review": "Beautiful old cathedral. The building looks bland from the outside, but the inside was just the opposite.While you're there, ensure you visit General Jose de San Martin’s tomb which is flanked by a couple of guards. We just missed the Change of Guards unfortunately.Cameras are allowed.Worth a visit!"
        }, 
        {
            "index": 319, 
            "rating": "5", 
            "review": "Cathedral Metropolitana, Buenos Aires. The simple architectural lines of the exterior don't prepare you for the opulence on the interior. Very restful and a beautiful providing a break from the hectic city surrounding it. We admired the decorative arches, altars and stunning stained glass windows; and were fortunate to do so while a mass was being held in a small chapel off to one side which added to the sedate atmosphere."
        }, 
        {
            "index": 320, 
            "rating": "5", 
            "review": "In the Footsteps of Pope Francis. Buenos Aries is a fantastic city. It was a privilege to be able to visit this Cathedral, the home of the first Latin American Pope. The building looks nothing like a standard cathedral from the outside which was deliberate as it was designed to blend into the civil society of Argentina. Inside there are many interesting things to see from the passionflowers in the floor mosaics to the tomb of the founder of independent Argentina complete with national guards. If you get a chance the simple crypt is worth a visit to sit in quiet contemplation"
        }, 
        {
            "index": 321, 
            "rating": "4", 
            "review": "Understated facade, impressive interior. This is the former church of Pope Francis, and one is tempted to say that like him it is outwardly modest (well, it does have a few columns and a tympanum giving it the appearance of a Greek temple more than of a Christian church, but now towering steeples or such like) but pretty impressive when you get to know it. Plenty of elaborate altars and statuary inside, including a monument to San Martín, Argentina's national hero."
        }, 
        {
            "index": 322, 
            "rating": "5", 
            "review": "ASuprise Inside!!. Although it has a generic neoclassic facade that almost makes it look like a government building, visitors to the Metropolitan Cathedral will be very pleased once they enter. The interior is cool, beautiful and harmonious. Many reviewers write about the impressive tomb for San Martin as well as the tomb of the unknown soldier. I was moved by the chapel that contained remembrances for victims of 20th century genocides. There is a plaque commemorating Armenians and there are framed prayer book pages from the WWII concentration camps, the Berlin Synagogue and material that survived the early 90's terrorist bombings of the Israeli Embassy and Jewish Center in Argentina. That such a memorial was in the Buenos Aires Cathedral filled us with emotion and admiration for the city."
        }, 
        {
            "index": 323, 
            "rating": "1", 
            "review": "Watch out for the \"pigeon poop\" pick pockets near the Cathedral!. My experience near the Cathedral spoiled my entire week in BsAs, and I would never stay in the city again in consequence. The Cathedal, Plaza de Mayo, and area near the Cathedral has a concentration of those pickpockets who throw \"pigeon poop\" on tourists. They work in pairs.Here's what happened to us, although similar stories are told by others. To get to the area my husband and I took the Blue Subte line, and got out at Peru station (because they had closed access to the Catedral station, for what reason we didn't know at the time). This meant that we had to walk on the streets near the Cathedral, near entrances to the Subte, and Plaza de Mayo. Two middle aged ladies, well dressed so you would never suspect them, were standing nearby as I looked dow into the Subte entrance and saw it was barricaded. Suddenly I felt wet runny liquid \"goop\" all over my hair, clothes and bag I was carrying, which came from behind me. It was dripping down my forehead, and I could hardly see because my glasses were covered with it. There was a lot of it - perhaps as much as half a litre! I turned and could sort of see one of the women pointing at the sky, as if to indicate a bird, and the other one had pulled out a kleenex tissue and was approaching me, looking concerned and waving the tissue back and forth, as if she would wipe it off. Of course there was far more quasi \"pigeon poop\" than could be caused by one bird. And I had read about this pickpocket method, so I immediately moved away from both of them, didn't let them touch me or my bag, and waved my cane threateningly as if to strike them. My husband came toward us, and they ran away. So I didn't lose anything.The worst was that there was a policewoman right nearby who did nothing! When I returned to the hotel I was told my the staff that it likely was because the police see this all the time so they don't bother. The grey stinky stuff was so vile I had to go back to the hotel and take an entire shower, and start washing everything. This wasted an entire morning and was very unpleasant. The stains would not come out of my clothes when I tried to wash them. I had to throw that bag away. The stench still lingered in my bag contents for the entire rest of the trip, although I washed them and tried to get rid of it .  I posted about my experience on one of the Buenos Aires forums before, but think that I should mention this again here. Tourists, most of whom at some point visit the main Buenos Aries downtown Cathedral, should know what is going on in that area. If this happens to you, don't let them near you because in the process of \"cleaning you up\" they will steal your belongings. My husband now refers to these as Poop-edores, because they are worse than pushy obnoxious vendedores."
        }, 
        {
            "index": 324, 
            "rating": "4", 
            "review": "A place of peace. . This is not the most beautiful of cathedrals but it does have a sense of peace amid the hurly burly of life. For me the Bishops Chair said it all. - humble and simple - unlike so many cathedral furnishings. Say a prayer for the people of this wonderful country that lives on the edge of the world."
        }, 
        {
            "index": 325, 
            "rating": "5", 
            "review": "One of the most beautiful Cathedrals in the city. Over the years I have visited this Cathedral on many occassions. It is close to Plaza de Mayo and Casa Rosada in the micro centro. The architecture and design is beautiful and if you have some time, admire the inside of the church. Here you will find the mausoleum of General Jose de San Martin. There is a memorial inside the church for Jewish victims of WWII behind the altar. Definitely recommended when in Buenos Aires."
        }, 
        {
            "index": 326, 
            "rating": "4", 
            "review": "The light for Argentina never goes out. A lamp shines outside for the eternal life of the country. And inside is an incredible statesmanly tribute to General Jose Martin draped dramatically in the blue and white flag and guarded by two smartly turned out guards with guns. Freedom under protection."
        }, 
        {
            "index": 327, 
            "rating": "4", 
            "review": "Surprises Lie Inside. Surprise number 1 is the mausoleum of General Jose de San Martin, the hero of Argentine independence from Spain. It's to the right of the nave. Surprise number 2 is a memorial dedicated to Argentina's large Jewish community. It contains documents found in the death camps of Auschwitz, the ruins of Berlin’s synagogue and the remains of this city’s Jewish community center, which was bombed in 1994 by Iran's Hezbollah. Rather remarkable that this memorial is inside Argentina's national cathedral."
        }, 
        {
            "index": 328, 
            "rating": "4", 
            "review": "The bland exterior hides the treasure inside. On the same square, Plaza de Mayo, as Casa Rosda the Catedral Meropolitana offers a great opportunity for a quick, accessible visit to an important chruch in Argentina. And it is free.The Cathedral has an impressive altar and also houses the tomb of General San Martin - He led Argentina in a battle for independence against the Spanish Empire.It's a busy church and there are many serivices going on here."
        }, 
        {
            "index": 329, 
            "rating": "4", 
            "review": "The tomb. Stunning interior and it also contains the tomb of Gen San Martin that is guarded by two permanent soldiers. A very historic building. Not such a good looking building from the outside though. Well worth a visit."
        }, 
        {
            "index": 330, 
            "rating": "4", 
            "review": "Plain exterior hides a glorious interior. With the choice of Pope Francis, this cathedral takes on even greater importance. Though the exterior has a rather unassuming appearance, once inside, the cathedral exudes an uncommon warmth, fronted by a very lovely altar. We were most fortunate that the timing of our visit coincided with an organ recital. The whole experience had a wonderful, otherworldly feel. On such a hot November day, this was a cool and refreshing respite."
        }, 
        {
            "index": 331, 
            "rating": "5", 
            "review": "Worth a visit. Visited this cathedral whilst mass was taking place and must admit that all visitors were respectful of this and were quite and unobtrusive. Visited it again and witnessed changing of the guard at the general's tomb. all in all an impressive cathedral and it is well maintained inside. stunning statues and architecture. The mausoleum is worth a visit and you are free to take photographs of the guards as well. Great historical importance. Enjoyed visits and it is welcome to get into the cool after the Argentinian sun!! Great for tourists and locals who are very proud of their heritage,"
        }, 
        {
            "index": 332, 
            "rating": "5", 
            "review": "Plaza de Mayo Jewel. With history dating back to the 1500s, I was definitely pumped to visit this cathedral. A bonus is that it included an important gravesite as well as the country's tomb of the Unknown Soldier. I stumbled out of the hot Buenos Aires sun after visiting the Casa Rosado into the cool interior of this cathedral under the Classical portico.I felt as if I had been transported to Europe. I almost forgot I was in Argentina - and it is landmarks like this cathedral that have given BA the sobriquet of Paris of South America. The nave is pretty symmetrical with clean lines and rich moulding. Even though most of the architecture is from different periods - Rococo to Classical to Neoclassical - the image as a whole is unified and pleasant. I happened to visit in-between services; however I would take a guess that the acoustics would be excellent. The altar was impressive and massive. I especially liked the dome and the high windows - enough light made the interior feel heavenly. Of course, the tomb of General San Martin was breath-taking. A black marble sarcophagus, flanked by statues of Argentina, Peru, and Chile, guarded by the members of the Argentinian military is one I will not forget. Nearby are the remains of Generals Juan Gregorio de las Heras and Tomas Guido, as well as an unknown soldier of the Independence War.The cathedral is free to visit and photograph. I respectfully encourage a small donation for upkeep of the building, though. Touring this site is the perfect way to have a reprieve from the Argentinian sun and see a historical treasure."
        }, 
        {
            "index": 333, 
            "rating": "4", 
            "review": "Cathedral in Plaza de Mayo. The exterior was under renovation. Inside was crowded with tourists and noisy school children. Graceful arches in the nave."
        }, 
        {
            "index": 334, 
            "rating": "5", 
            "review": "A Cathedral with two pluses!. The current cathedral was built on the place reserved for the major church of the town when Juan de Garay founded Buenos Aires in 1580 and on a series of previous churches that had occupied the site, something which is common in Latin America. Some think that the Cathedral’s exterior appearance (of official looking) seems to be a bank, government offices or something of the sort at first sight. There are some “architectural” reasons: its Neoclassical façade, the tall portico, (inspired by Classical architecture) and its 12 columns make the church look more like an ancient temple. However, the decoration of the façade representing Joseph’s meeting with his brothers and father Jacob in Egypt, and intending to provide an allegory of the unity of the Argentine nation, clearly speaks of a religious place. On the other hand, the 12 Corinthian capitals of the columns of the portico symbolize the 12 apostles.  In the interior, you can feel a European flavour (as in many parts in Buenos Aires, indeed). Abundant Neo-Renaissance and Neo-Baroque decoration; the floor is stunning. Pay attention to it. All the usual beautiful work you would expect in a cathedral. But there is a plus: San Martin, our national hero, the Father of the country, is buried here. Don’t miss his resting place. This gorgeous mausoleum has Guard of Honour (worthwhile seeing it changing). These colonial era-dressed soldiers are always willing to have a photo taken and even posing with visitors. So, don’t be shy and ask for a pic!A brief note: San Martin died in France, but in 1880 his remains were brought and placed in the black sarcophagus one can see nowadays. He is surrounded by 3 life-size female figures representing the 3 countries he freed: Argentina, Chile and Peru. Two other Great Men’s remains are there as well: those of Generals Juan Gregorio de las Heras and Tomás Guido. Finally, the Unknown Soldier of the Independence’s tomb is there too.It is right that it has nothing out of the ordinary; that it only offers pretty much what one would expect from a cathedral. But a detail makes it different from others: Pope Francisco used to hold mass here!  Free entrance. Photos: allowed (both flash and non-flash). However, it is a good idea to be respectful of faith followers and to avoid being camera happy during the service."
        }, 
        {
            "index": 335, 
            "rating": "4", 
            "review": "Exterior is more like an ancient temple..... Most capitol cities around the world invariably has a Cathedral belonging to one or more religious denominations - BA has the Metropolitan and it belongs to the Catholic Diocese.It has a striking exterior in a plain colour with a magnificent façade - an intricate frieze of sculptures above twelve columns. It’s interesting to note that it has been rebuilt without any towers and it reminds me of some ancient Mediterranean temple.Once inside we immediately noticed the soaring height of the roof and the intricate tile walkways and floors.It’s not as ornate as some South American churches but still has a baroque style and a gorgeous rococo alter. Look for the unique statue of Christ carved from the wood of an algarrobo or carob tree.The layout is in the shape of a Latin cross with transept, three-aisles and side chapels connected by high arches.One of BA’s earlier liberators is interred in a mausoleum here - General José de San Martín and an eternal flame burns for him outside the church. If you are here at the right time you may witness a guard ceremony however even without this showy spectacle the church is well worth a visit - not too much of the favoured gold leaf detail on every square inch! It’s very close to Plaza de Mayo and within easy reach in the city centre.Enjoy your experience!"
        }, 
        {
            "index": 336, 
            "rating": "4", 
            "review": "A slice of history. Here again a guide was ideal in showing me the church highlights and burial site of liberator Jose de San Martin .Most unusual- there is a holocaust memorial in the church - wonder if its the only church in the world where is a holocaust memorial"
        }, 
        {
            "index": 337, 
            "rating": "4", 
            "review": "If at Plaza de Mayo, go . . .. Is this the most magnificent cathedral in the world? No. Still, it's worth seeing for a few reasons:1. It was built over and over before this final version persevered, so it's interesting from the standpoint of the Argentinian version of a national cathedral; 2. Pope Francis has a history here; 3. it is free and right there at the edge of Plaza de Mayo, which makes it easy to locate and visit. Again, while it has some nice features and art, the fact that it is not over-the-top in decoration and style is a comment on the country and its relationship to God.My favorite thing related to this cathedral was that we were walking to Plaza de Mayo one Sunday afternoon and came upon a mass of people outside who were listing to a sermon in the closed-off area in front of the cathedral. The passion of some of the crowd was amazing. There was a screened facade erected on the front to hide construction being done when we were there."
        }, 
        {
            "index": 338, 
            "rating": "4", 
            "review": "Feel ease and warm at Sunday mass!. We walked in and joined the Sunday mass as it was in progress. Afterward the Bishop greeted and chatted with folks after the mass. Just like any Sunday mass. However, it carries a lot of historical national significance, but also reflects Pope Francisco style and value."
        }, 
        {
            "index": 339, 
            "rating": "4", 
            "review": "Not your typical cathedral. I have been to many cathedrals around the world and this one looks like a town hall from the outside. There are no spires or other structures piercing the sky. There are 12 pillars outside which make it look very business like. On top of that, when I went early May 2013, there is quite a bit of scaffolding outside; obvious repair work going on. Inside is totally different with large Christian icons and paintings. I have seen better Catholic Cathedrals than this one though. What made me feel good is that the new Pope Francisco, used to hold mass here! I have included one picture of the inside of the cathedral and another one from Avenue 9 de Julio where there is a massive banner across a large office block showing off that the new Pope is from Buenos Aires."
        }, 
        {
            "index": 340, 
            "rating": "5", 
            "review": "Very nice. A place any tourist must visit. Specially with the nomination on Pope Francisco. Historical place of many events."
        }, 
        {
            "index": 341, 
            "rating": "4", 
            "review": "Worth a look.. The outside looks more like a bank to me. The inside is another story. While relatively austere compared to other Catholic churches in other big cities, the decor impresses nevertheless."
        }, 
        {
            "index": 342, 
            "rating": "4", 
            "review": "Worth a visit. It is definitely worth visiting this Cathedral if you happen to be in the area. The building looks plain from the outside but the art work inside is something worth seeing."
        }, 
        {
            "index": 343, 
            "rating": "5", 
            "review": "Beautiful Cathedral and San Martin's final Resting Place. Accidentally showed up during Sunday services and was able to get in and take pictures (both flash and non-flash, but not of the service or parishioners). Viewed all the glorious religious artwork and paintings. My highlight was the Mausoleum of General San Martin."
        }, 
        {
            "index": 344, 
            "rating": "5", 
            "review": "Simple outside, beautiful inside. There's a long wait for the shop but the rest of this building is spectacular. There's not much holy water around though so I gather the tourists have been scooping it up since pope Francis."
        }, 
        {
            "index": 345, 
            "rating": "4", 
            "review": "Worth a visit to see San Martin's tomb. I'm not an expert in religious sites, but having visited many cathedrals in Europe there really wasn't anything awe-inspiring to see. The entrance is free, so that's a plus, and for anyone interested in South American history the tomb of General San Martin makes it worthwhile to come in for a short visit."
        }, 
        {
            "index": 346, 
            "rating": "5", 
            "review": "Hidden gem. It looked like a bank but inside was a tranquil space in busy Buenos Aires. There are many small chapels, San Martin's mausoleum, an honour guard ( changes around 3:30) for San Martin, a meditative space and a peaceful feeling that we enjoyed as we sat and reflected. The floors are beautiful and seem to made by the same craftsmen as the opera house. All the usual beautiful work you would expect in a cathedral, but it was the calming atmosphere that I appreciated the most as the outside noise, protesters, traffic, etc fell away. I think you might be able to hear some music in here but not during our visit. I enjoyed that they are honouring San Martin but it is on the outside edge because he had become a Freemason. And it's free!"
        }, 
        {
            "index": 347, 
            "rating": "4", 
            "review": "18th Century Cathedral of distinction. General Jose de San Martin is buried here.He liberated Argentina from Spain. The stained glass windows are excellent and the serenity of this cathedral is something special. Its vast expanse is to be enjoyed"
        }, 
        {
            "index": 348, 
            "rating": "3", 
            "review": "Nothing out of the ordinary- but worth a visit if you're in the area- plus it's free. As far as cathedrals go you can throw this one on the pile if you've been to cathedrals anywhere else in South America or Europe . That being said it is a nice quiet respite for the bustling city outside. Fairly well restores its a short walk to make your way around and it is nice to see locals pop in and out throughout the day. Nothing exceptional, but its convenient and free so it wouldn't hurt to stop by if you're in the area."
        }, 
        {
            "index": 349, 
            "rating": "3", 
            "review": "Pretty much what one would expect from a cathedral. It's a nice cathedral in an urban area. Nothing special in my opinion, but worth going if you're already there to Plaza Mayo, Casa Rosada, etc."
        }, 
        {
            "index": 350, 
            "rating": "4", 
            "review": "Buenos Aires's remarkably restrained cathedral. The cathedral is the Greek temple styled building on the same square as the Casa Rosada. It's remarkably smaller and more restrained than one would think of a city where thy liked to build BIG. However, inside it is comforting and built on a human scale - with 2 key features of interest (1) the tomb of General San Martin - who liberated both Chile and Argentina from the Spanish - which is girded by two smart colonial era-dressed soldiers who are happy to pose for photographs, and (2) the altar and pulpit etc - made from repousse silver - tons of silver. Serious bling!"
        }, 
        {
            "index": 351, 
            "rating": "5", 
            "review": "Pleasantly surprising cathedral in Buenos Aires downtown!. From a distance, Cathedral Metropolitana's front facade, architecture may resemble a gov building or small museum... or like a Parthenon look-alike. But it is different inside. Not a towering height but it retains classic cross pattern, deceptively grand upper windows, mosaics & beautiful paintings inside. Another surprise is the live guards on hand to protect the St. Martins honored tomb inside the cathedral. Very worthwhile visit even though some of us may think of tall stretching gothic spyres, this is just as authentic, inside. I enjoyed the Sunday morning mass yesterday, very spiritually touched. My only negative point is that I wish the visiting bus crowds would be more respectful, more quiet & less camera happy during the mass."
        }, 
        {
            "index": 352, 
            "rating": "4", 
            "review": "Beautifully detailed church. One would think its a bank or governments offices, but inside is grand church, with lots of shrines and the tomb of a General inside, was quite impressed by the scale and grandeur of it all."
        }, 
        {
            "index": 353, 
            "rating": "4", 
            "review": "Catholic cathedral. Despite the exterior appearance, this official looking building is in fact the main Catholic cathedral. It is enormous inside and very much a tourist hotspot both for foreigners and Argentinian school children. They are there not only to view the cathedral but also the Mausoleum of General San Martín. He has his own guard of honour - the changing of which is worth seeing. Behind curtains, on the right hand side of the main alter is a small side chapel which is worth a look for the alter - and also the place for quiet prayer & contemplation. Check out the organ - apparently made in Germany with 3500 tubes. We went to a free recital as advertised on a list by the cathedral entrance doors."
        }, 
        {
            "index": 354, 
            "rating": "5", 
            "review": "Historical Buenos Aires. The exterior of this cathedral is unwelcoming. The interior has a rich European flavor. The tomb of San Martin is located outside the walls of the cathedral because he became a Freemason before he died.The floor is stunning. The colors are beautiful. The individual chapels are interesting but not as much as those in European cathedrals.We did encounter a pickpocket so be careful."
        }, 
        {
            "index": 355, 
            "rating": "4", 
            "review": "Don't judge a book by its cover!. We stopped in front of the cathedral on a walking tour. Our guide asked us to guess what this building could be---a court house, the treasury, a mausoleum? No one guessed a Catholic church! We later went back to see the cathedral's interior. Quite beautiful. I was especially taken with the Via Crucis (Stations of the Cross) paintings by Italian painter Francesco Domenighini. Also take note of the mosaic floor. The changing of the guard at San Martin's tomb was impressive. There's also a very small gift shop where we purchased a few small items."
        }, 
        {
            "index": 356, 
            "rating": "4", 
            "review": "Cathedral. I had no idea this was a cathedral. The outside looks more like a courthouse or government building, but when I went inside, I was surprised to see that this was a church! The inside was beautiful and had many displays and paintings of religious figures as well as important political people. General San Martin's Mausoleum is here and is really neat to see. I'm not religious at all, but I could appreciate the beauty inside and the craftmanship of the architecture."
        }, 
        {
            "index": 357, 
            "rating": "4", 
            "review": "It hardly looks like a Cathedral on the outside, but.... ...it is! A good one too, with fine services. A quick look around is certainly in order, not least to behold South America's liberating hero, San Martin. The honorary guard and the sarcophagus are worth the visit by themselves."
        }, 
        {
            "index": 358, 
            "rating": "4", 
            "review": "Cathedral. It has the standards of every other Capital City Cathedral, mixture of greek and local colonial style, plus some historical focal-points like national hero San Martin's tomb. I suggest attending a Mass on some high date so to experience one of its Organs in action."
        }, 
        {
            "index": 359, 
            "rating": "3", 
            "review": "A HELTER SKELTER BUILDING. The main Catholic church of Buenos Aires is a mix of architectural styles and lacks the majesty of other temples of its category. Its final construction started by the mid 1700's and was finished in the 19th Century. Of interest are the collection of flags and the tomb of General San Martín."
        }, 
        {
            "index": 360, 
            "rating": "5", 
            "review": "Nice Greek Churc. It's our most importante Catholic Church. Built in a greek style. Inside you are going to find San Martin's tomb, our national heroe"
        }, 
        {
            "index": 361, 
            "rating": "4", 
            "review": "Colonial Cathedral. Buenos Aires Cathedral is not too impressive compared to other Argentine Colonial churches, but it holds the remains of San Martín, our national hero who liberated Argentina, Chile and Peru between 1812 and 1821. A cathedral has stood on this site since 1580. On Plaza de Mayo central square"
        }, 
        {
            "index": 362, 
            "rating": "3", 
            "review": "Okay Cathedral. Nothing wrong, just nothing spectacular, though I was impressed by San Martin's tomb plus honor guard. This is,essentially, a minor site."
        }, 
        {
            "index": 363, 
            "rating": "4", 
            "review": "Visiting the national cathedral of Argentina. I visited the Cathedral Metropolitana on two occasions during my first weekend in Buenos Aires, the first by myself and the second with a private tour guide. The latter visit added immensely to my knowledge of the building.The cathedral is situated on the edge of the Plaza de Mayo and impossible to miss. Entrance is free. There appears to be masses held on a daily basis but you are freely allowed entrance into the building during these times. The crypt of San Martin (roughly the equivalent of George Washington for Argentines) is to the right of the entrance and the reason why most probably stop by. Suspiciously reminiscent of Napoleon's tomb in Paris, it is definitely worth a visit. To the left of the nave, there is a memorial to the Jewish community from the Catholic church containing sheets of prayers rescued from the ruins of Auschwitz and Treblinka.Initially the church was a bit of a challenge because I am not fluent in Spanish and there are no English subtitles on the placards, nor is a map of the facility or audio guide available. Traveling with a native guide made up for these issues immensely. Recommended."
        }, 
        {
            "index": 364, 
            "rating": "5", 
            "review": "floor plan information. need the floor plans of the cathedral metropolitana for a college architech course any information of obtaining this information or where i can look would be greatly appreciated thank you"
        }
    ]
}