{
    "category": "Buenos-Aires", 
    "entity": "Japanese-Garden", 
    "avg_rating_stars": 3.9127134724857684, 
    "review_count": 527, 
    "rating_stats": {
        "poor": 44, 
        "average": 119, 
        "terrible": 9, 
        "very_good": 167, 
        "excellent": 188
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "4", 
            "review": "Beautiful garden, worth seeing (if you are already in the neighborhood). I enjoyed the garden on a beautiful spring day (early November), and it was worth the visit: It's particularly fun to see this little oasis looking toward the high-risers. It's not a \"must-see\" attraction, but worth going there if you are closeby."
        }, 
        {
            "index": 2, 
            "rating": "3", 
            "review": "Disappointed. The garden is very small and quite noisy being in a very busy junction. The bus stand is very close by and as the buses don't switch off their engines while waiting for their turn to leave it is quite polluted. It is well kept. Restaurant very overpriced.Not a pity as there are so many options to eat well in Buenos Aires."
        }, 
        {
            "index": 3, 
            "rating": "4", 
            "review": "Beautiful Gardens. If you are looking for a place to walk around in Buenos Aires and relax it is worth it to come to the Japanese Gardens"
        }, 
        {
            "index": 4, 
            "rating": "4", 
            "review": "Beautiful garden. The place offers a beautiful Japanese garden that is open during the day.The restaurant operates for lunch and dinner. they offer very good Sushi and other Japanese dishes in a very relaxed atmosphere"
        }, 
        {
            "index": 5, 
            "rating": "5", 
            "review": "Good example of a Japanese garden. It's very well manicured, superbly laid out, and has a couple of eating places. Be aware that weekends it is very crowded which means it has no tranquility that you'd usually expect from this type of garden.I imagine it's a lot quieter during the week."
        }, 
        {
            "index": 6, 
            "rating": "4", 
            "review": "Work and play. A gift to the city from Japan. An oasis within the concrete jungle, Worth a visit if you can, no more than two hours is needed. Have lunch in the pagoda"
        }, 
        {
            "index": 7, 
            "rating": "3", 
            "review": "Japanese Garden Review BA. Nice garden for a quick getaway from the traffic and bustle. good walk for couples. Forgot the price, but was well presented for the acreage they had."
        }, 
        {
            "index": 8, 
            "rating": "4", 
            "review": "Watch the people. Very nice garden. Large, but mostly flat. Some nice examples of Japanese landscape techniques. Not enough places to enjoy the calm of a garden. A bit hectic."
        }, 
        {
            "index": 9, 
            "rating": "4", 
            "review": "Lovely. Really nice place to walk around on a sunny day. Giant coy fish included in the ponds! You can also write your wishes on the wishing tree."
        }, 
        {
            "index": 10, 
            "rating": "5", 
            "review": "Very nice garden . Placed in a very nice neighborhood, this garden is one of the must in Buenos Aires.Very clean, beautiful and perfect to hang out a couple of hours.If you get hungry, there's a Japanese restaurant inside and a couple of shops."
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "Beautiful Oasis. We visited the gardens during a mid-week afternoon. We found the garden very well maintained - similar to ones we visited a number of years ago in Tokyo and Kyoto. While boarded by busy streets, the gardens seem well isolated from the busy city. A wonderful display of plants and Koi fish. Depending on your interests, a visit will take approx. 1.5 to 3 hours. We enjoyed our visit very much and have recommended it to friends."
        }, 
        {
            "index": 12, 
            "rating": "4", 
            "review": "A very nice Japanese Garden in Buenos Aires -. I have been several times in Buenos Aires, but have never been at the Japanese Garden. This time - in springtime - I decided to go there as part of my Buenos Aires Bus tour - Stop 11 (Green) or 21 (Red). It's a great place to visit and stroll around for a couple hours."
        }, 
        {
            "index": 13, 
            "rating": "2", 
            "review": "Just another japanese garden. If you have ever seen a Japanese Garden, than this one will be just one more. The garden is very beautiful and well cared, but it is still no big deal. Yet, it's a little pricy."
        }, 
        {
            "index": 14, 
            "rating": "4", 
            "review": "A special garden. It is a Japan space in the middle of Buenos Aires.Everything is japan style with a very nice restaurant"
        }, 
        {
            "index": 15, 
            "rating": "3", 
            "review": "Pleasant, but that's all. This a pleasant place to wander for an hour, but in the world of gardens, it's not a must-see or a show stopper. The best thing is ringing the big peace bell with a horizontal wooden pole."
        }, 
        {
            "index": 16, 
            "rating": "4", 
            "review": "AN OASIS IN THE MIDDLE OF THE CITY. You will find the peaceful Japanese Gardens, an oasis of calm and serenity in the middle of the crazy, busy, noisy city of Buenos Aires. The park itself is wonderfully kept and very pretty all year round, as the different plants, trees and bushes show their lovely colors at varying points in the calendar. Apparently the horticulture on show includes black pine trees, gingko, sakura, and of course, the ubiquitous bonsai trees, that will impress all budding gardeners and karate kids alike.In case you are wondering ‘why exactly are there Japanese gardens in Buenos Aires?‘, well, they were given as a ‘thank you’ to Argentina, by Japanese immigrants living in Buenos Aires, when they constructed this lovely five acre park in 1967.It is open from 10am to 6pm daily, year round, and costs a small fee to get in. To get there you can take a number of buses, including the 10, 37, 67, 102 or 130."
        }, 
        {
            "index": 17, 
            "rating": "4", 
            "review": "An accent of Japan in Buenos Aires. A large Japanese Garden within walking distance if you are a walker from the Eva Peron Museum, which should be on anyone's itinerary in Buenos Aires."
        }, 
        {
            "index": 18, 
            "rating": "5", 
            "review": "Peace in the center of the city!. This garden is beautiful, well kept and thoroughly enjoyable. we spent the afternoon just enjoying the loveliness of the garden, the fish and birds, and watching all of the other visitors doing the same."
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "Lovely spot!. These gardens exceeded my expectations - more \"Japanese' than many of the Japanese gardens I've visited in Japan! Very well kept and some beautiful vistas - not surprised that we had to pay to get in as it must take some funds to keep it looking so good. Well worth a visit."
        }, 
        {
            "index": 20, 
            "rating": "4", 
            "review": "Nice place for lunch. When we have visiting guests, we always stop for lunch and walk the beautiful Japanese Garden, take a picture on the red bridge and enjoy the beautifully cared-for garden."
        }, 
        {
            "index": 21, 
            "rating": "4", 
            "review": "Nice and well maintained . Visited with my two kids and wife, we spend the whole morning there and enjoyed it for taking nice pictures. We've also tried the Japanese restaurant inside, which I recommend"
        }, 
        {
            "index": 22, 
            "rating": "3", 
            "review": "The park is ok, the restaurant is good. This is a very small Japanese park compared with other around the world. Is cute and fun if you wanna buy a Bonsai or to have nice lunch. The park is not opened at night only the Restaurant that by the way has a very good Sushi. I recommend to make reservations and ask for the Tatami table that is fun to eat without shoes and like in Japan.  I'll be back for dinner!S"
        }, 
        {
            "index": 23, 
            "rating": "4", 
            "review": "Nice place for a walk . I've been to this place 4 years ago and it keeps the nice garden as before. They use to have several japonese fish in the lake but it seems that they are gone...The ticket costs aprox 10 dolares."
        }, 
        {
            "index": 24, 
            "rating": "1", 
            "review": "Refund please!. Horrible!!Far too busy, water isn't clean and single file around the paths whilst waiting for people to take selfies.Really not worth the money"
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "Beautiful & peaceful place. Really well preserved, beautiful! We had lunch at the restaurant which is inside the garden (really good sushis) and then had a walk in the garden. It's not that big but really beautiful!"
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "Unexpected and wonderful. Absolutely lovely place. I was very unfortunate to go right before lunch, so I was starving and had to rush through it. But I hope to go back someday so I can just spend the afternoon and enjoy the extreme calmness all around the park."
        }, 
        {
            "index": 27, 
            "rating": "3", 
            "review": "Not the best. The entrance fee is about $5 (70 pesos), and there's honestly not a ton to do. We went to the restaurant, which was a little overpriced and not the best food. They do have koi in the pond, but the pond was super murky. We walked around for a while and then left. There is a cool plant shop, which we would have loved to shop at if we weren't traveling back home overseas."
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "Very well kept gardens. A bit of Japan in Argentina. The gardens are really well kept and appear to be very popular as it was packed when we went. It's a bit of peace and quiet in the middle of bustling avenues in Palermo. The entrance is 70 pesos (could be cheaper in my opinion). If you don't fancy going in, you can kind of see quite a bit of it over the fence on the north side."
        }, 
        {
            "index": 29, 
            "rating": "3", 
            "review": "Pretty but didn't feel very authentic. After visiting amazing gardens in Japan, this garden felt as if it had some aspects of zen style but not fully Japanese. It was still a pretty garden where you can take some lovely pictures. But if you have been to Japan then this may not be the real deal for you."
        }, 
        {
            "index": 30, 
            "rating": "3", 
            "review": "Great place to walk theough. Nice gardens with lots of flowers. We walked through it in less than 45 minutes. It's a good stop on your sightseeing walk."
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "Beautiful and enjoyable gardens. This is a beautiful place to go to, is an escape in the middle of the city, we were transported to Japan for a little. I highly recommend the place for a nature and landscape lover, some days the entrance is free for Argentinian residents.\nThe flowers, trees, landscape and Japanese environment is impecable, they sell food and plants inside."
        }, 
        {
            "index": 32, 
            "rating": "4", 
            "review": "Enjoyable experience. Beautifully laid out colourful gardens, good value for money, but does get exceedingly busy. May be worth while visiting shortly after opening time."
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "very pleasant place. The Japanese garden in Buenos Aires is the largest outside of Japan and it offers the genuine view and atmosphere of a Japanese garden. It has a splendid location in Palermo district and the high residential buildings surrounding it create a nice skyline.\nI definitely advice to visit it."
        }, 
        {
            "index": 34, 
            "rating": "5", 
            "review": "Beautiful grounds with cultural exhibits too. The japanese gardens in palermo is a great place to visit on a nice day. It is a large garden compared to other japanese gardens i have visited on my travels. Great place for kids as an outdoor activity with ponds filled with hungry koi that kids can feed."
        }, 
        {
            "index": 35, 
            "rating": "4", 
            "review": "Very pleasant, worth a visit and the cover charge. 70 pesos gets you in for a pleasant stroll and some nice photo ops. You're a long way from Japan, but you can fake it in pictures ;).\nI enjoyed this place all three times I visitied."
        }, 
        {
            "index": 36, 
            "rating": "4", 
            "review": "Great place to take timeout. Great Japanese gardens provide a level of calmness, this is one such garden. Beautifully presented and maintained with only slight awareness to the city noises. Not expensive and if in the area great place to relax before you scramble of to your next tourist destination"
        }, 
        {
            "index": 37, 
            "rating": "5", 
            "review": "A nice place relax. People kept telling me to come here, it did not disappoint me. It was a great place to spend relaxing for a few hours."
        }, 
        {
            "index": 38, 
            "rating": "4", 
            "review": "Very nice even just to walk around. This attraction in a very central location in Buenos Aires is a calm place all over the year. Only busy when something special is going on as fairs or spring and summer weekends.It is a good spot for families with children as there are gold fishes that they can feed and beautiful bridges and gardens to go around.For sushi lovers there is also a Japanese restaurant inside the park."
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "Great for pics. Super cute, great activity for a sunny day, where you can take several great pictures and just hang there, with the zen energy."
        }, 
        {
            "index": 40, 
            "rating": "3", 
            "review": "Lovely but.... I spent a couple of hours here on a wet and cloudy day. Despite this, it was a pretty scene, although slightly marred by some high rise buildings in some views. I paid 70pesos to get in. If you've been to other Japanese gardens, I'd say skip this. There are lots of lovely parks in the area that are just as relaxing."
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "Dinner- Sushi. Best sushi in town. Expensive but very good. Great service.\nLocation is nice and the gardens are beautiful. It is totally worth it."
        }, 
        {
            "index": 42, 
            "rating": "3", 
            "review": "Don't compare to the real thing, but its lovely on it own. Slightly biased as I have seen/ experienced real Japanese Gardens in Japan. It is a very nice place to take a stroll around, has a cute little shop selling Japanese goods. There are koi in the pond but it is very much over run by green algae."
        }, 
        {
            "index": 43, 
            "rating": "4", 
            "review": "Exquisite Japanese Gardens in Heart of Buenos Aires. Lovely afternoon spent in these Japanese Gardens. The waterfalls and fish ponds are so spectacular and calming. Lovely landscaping and well maintained grounds. U almost forget u are in the center of a noisy busy city. U can find a quiet Corner here as well. There is a lovely cafe for afternoon tea, lunch or dinner. But check the times as they close at around 5 or 6 and then re open for dinner. Cute little gift shop with Japanese knick knacks and souvenirs . 70 pesos to enter so not a free attraction. The azaleas were in full bloom and absolutely gorgeous. They also have cherry blossom trees. But I missed those blooms. Highly recommend spending some time here."
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "Vi Sa. Very beautiful and refreshing place. If you are romantically set is for you. Fantastic landscaped. This is the place."
        }, 
        {
            "index": 45, 
            "rating": "3", 
            "review": "Usual Japanese garden . This is a standard Japanese garden, hasn't stood out from other Japanese gardens I've seen, but it's a nice wander regardless. Japanese gardens are always beautiful and this one is too. Don't travel to see it, but if you're in the area and have 30 minutes it's worth a look."
        }, 
        {
            "index": 46, 
            "rating": "3", 
            "review": "Lovely Concept and Outdoor Space. We liked the Garden and all the information about Japanese culture it offered. We were there on \"Dia de los NInos\" (Kids day) Aug 21st and they had a beautiful fire ceremony to burn small wood plaques w your personal writing of things that no longer serve you or are negative. I loved the concept and was only disappointed that when we asked for a plaque for our daughter, they said, Kids could not have one to participate. I am not sure if there was a reason culturally or if it was something else. I felt it would have been a beautiful chance to explain to kids to let go of negative things (even little ones can learn about being more mindful and positie - not just adults). It was also very crowded and some areas w bonsai trees we wanted to see closed or blocked off. Otherwise, a lovely place to visit and relax, walk, meditate."
        }, 
        {
            "index": 47, 
            "rating": "4", 
            "review": "Beuatiful and Queit. The Japanese Gardens are remarkebly queit given its location. It is a nice place to sit walk around and take a break from the often busy Buenos Aires streets. If this is close by, it is certainly worth a visit."
        }, 
        {
            "index": 48, 
            "rating": "3", 
            "review": "Decent Japanese Garden. We visited in late winter/early spring. The garden was well attended to and is probably really lovely in the summer. It was a bit noisy as it is bordered by a busy road. It was also inexpensive so it's nice to drop in if you're nearby. It only cost us about $5 per person (70 Argentinian pesos)."
        }, 
        {
            "index": 49, 
            "rating": "4", 
            "review": "Pretty place for a break. Very pretty and reasonably priced, although small. Very nice and scenic place for a rest during a busy day sight seeing in BA."
        }, 
        {
            "index": 50, 
            "rating": "4", 
            "review": "Nice break.. This garden is ideal to take a few minutes out if the day. Suggest late afternoon not in the full sun. The garden is superbly manicured."
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "Very lovely and relaxing. Considering this garden close to main roads, it is a calming place. Also features an indoor exhibition area - we saw beautiful bonsai trees."
        }, 
        {
            "index": 52, 
            "rating": "4", 
            "review": "Cool but not essential.. It's a Japanese garden. Go if you've never seen one or you want some green or silent time (and the spaces nearby aren't enough), but it's nothing essential for your visit to the city."
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "Beautiful place to get out of the hustle and bustle of the city!. What a hidden gem! This place is very beautiful. The garden is designed well and has been maintained well. You only need an hour or so to cover the grounds and get some photos. We went in the afternoon which seemed like a great time to go as there weren't too many people. It cost 70 pesos to get in which is reasonable. A really nice place for a walk."
        }, 
        {
            "index": 54, 
            "rating": "5", 
            "review": "Amazing restaurant!. Go early and avoid the crowds. I visited on a local holiday and this place gets packed. The garden is small, but really beautiful. Stay for lunch at the restaurant. Truly, it was some of the best sushi I've had!"
        }, 
        {
            "index": 55, 
            "rating": "4", 
            "review": "Nice 2-3 hour attraction. Great picturesque park if you are on that side of time. We stopped in for an hour or two. its inexpensive, and nice if you want to space out with other tourist attractions that require more rigour and walking. not much around there though, so you cant club it with other stuff. dont be too upset if you miss it."
        }, 
        {
            "index": 56, 
            "rating": "5", 
            "review": "Very nice. This is a lovely little park. We enjoyed it. They have a crepe stand that makes the most delicious crepes with multiple fillings such as salmon, chicken, veggies, pizza. The best one was the banana and chocolate crepe! The garden is pretty and well maintained and has the typical Japanese elements."
        }, 
        {
            "index": 57, 
            "rating": "4", 
            "review": "Very relaxing. It was like a trip to Japan, in Argentina lol. Everything is traditionally Japanese. It was really relaxing with the trees, birds and koi fish. It was fun to fed the fishes. There was also a Japanese shop that has allot of things of the culture of Japan and outside the shop was a wishing stand. That was very unique."
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "I loved everything about the Japanese Garden. I loved the Japanese Garden. I took lots of pictures to take back home in Florida and spent a great time with Fabri an Ezequiel here"
        }, 
        {
            "index": 59, 
            "rating": "2", 
            "review": "Just for a short visit, don´t expect too much. It´s just a lake with orange fishes, a type of japanese garden around, but nothing else and some activities like origami or gardening. Don´t expect too much of this visit. Just as a complement of your visit to Palermo lakes and park."
        }, 
        {
            "index": 60, 
            "rating": "5", 
            "review": "you will love it!. It is a very beautiful place to visit. it is a pacific place in the middle of buenos aires. It is a good place to meet and spend a good time, for childrens there are not to much, it is better to go alone. A place to relax, relax."
        }, 
        {
            "index": 61, 
            "rating": "3", 
            "review": "the garden itself,with some negatives. As Japanese Gardens in the world go, I would rate this nicely. Surprisingly, most trees don't bloom until the middle of October which is the middle of April up in the Northern Hemisphere. Considering that this is an almost semitropical city, you'd think earlier, but maybe it works the other way around in warmer climates, things being relative.I like the small Japanese Garden with convenient small bridges and well-cropped shrubs and plants. There is a very good restaurant inside the main building where, on the second floor, classes are taught for a variety of Japanese oriented martial arts, etc. It is very very clean. What I dislike, as do any who have commented to me, is the overcrowding of the water area, loaded with goldfish, I believe, but severely overcrowded, as if no one knows what they are doing when it comes to space for fish. The rest is a nice experience in a beautiful area of the city and again, the restaurant, authentic, a bit expensive, is a treat."
        }, 
        {
            "index": 62, 
            "rating": "4", 
            "review": "Very peaceful and pretty. Very good for a short walk around, an oasis in the city, take a packed lunch and enjoy the day. Very nice for kids too."
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "Really pretty! . We visited the Japanese Gardens for a few hours, it's 70 pesos to enter, we found it much larger than we were expecting, it's much bigger than the gardens in Holland Park in London. We had a really lovely walk around, there are lots of nice features, bridges you can walk over, fountains and koi fish. The water was a little green so the visibility wasn't that great but it's a nice place to relax! There are a few places to buy food & snacks apart from the big restaurant!"
        }, 
        {
            "index": 64, 
            "rating": "4", 
            "review": "Calm place. Not huge, and next to a busy road and some form of dog kennels with barking dogs, but some very well manicured grounds around lakes with some very large well looked after bonsai. Lovely bridges and plenty of picturesque vistas. A real oasis of calm in a bustling city. Also an interesting visitor centre with Japanese cultural exhibits and cafe. If you are in town for a few days and fancy a relaxing hour or so it is worth a visit to get away from it all."
        }, 
        {
            "index": 65, 
            "rating": "3", 
            "review": "Nice garden,. This was a nice garden with a large koi pond that you can see kois that were over a foot long. Theres a restaurant there but the japanese food was terrible. I would not go again"
        }, 
        {
            "index": 66, 
            "rating": "4", 
            "review": "Defiinitely worth seeing. 70 pesos to get in, this is a wonderful Japanese garden, bigger than you might expect. Lots of water features, ornamental shrubs, bridges, bonsai exhibits, a Shinto peace bell which you can strike, benches to sit on. Very relaxing, and surprisingly popular with local young adults."
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "A small but beautiful Japanese garden and cultural exhibit.. We really enjoyed our trip to the Jardín Japonés in Palermo. The grounds were beautifully landscaped in that iconic Japanese style. There were amazing ponds, trees, koi and other interesting features. In addition, there is a main building with small library, restaurant and museum with items from Japan on display. This is a great place to spend an hour or two. My only regret is that we went there in winter - the grounds must be stunning in the summer."
        }, 
        {
            "index": 68, 
            "rating": "5", 
            "review": "Japanese Garden and Restaurant. Extremely beautiful place to visit (mostly in Spring).The restaurant is awsome, the quality of food excellent and the service is second to none."
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "Must see!. Awesome Japanese garden in the middle of Recoleta! Nice place to visit and relax watching the cherry trees."
        }, 
        {
            "index": 70, 
            "rating": "5", 
            "review": "Amazing. A very nice garden Jap style with a lake plentyfull of water plants and color fishes, alltogether in a perfent landscape. Also a japanesse restaurant 5 stars."
        }, 
        {
            "index": 71, 
            "rating": "5", 
            "review": "Beautiful!. To be honest, I am not sure how I ended up at a Japanese Garden in Argentina, but it was WELL WORTH IT.We first had lunch at the Japanese restaurant on site and it was amazing. We ordered sushi and it came out on the wooden boat. There were also tables I saw in the restaurant that were low to the ground and you could sit on pillows to eat...So COOL!The gardens were very peaceful and seemed to be popular because there were a bunch of people there. It never seemed overcrowded though!!It was fun to watch the fish and walk over the bridges and admire the scenery.There were restrooms and an interesting gift shop as well.Fun Fact: There was some sort of \"Comic-Con\" event going on at the gardens during our visit, and it was interesting to walk around and try to guess who the people were dressed as!"
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "Gorgeous gardens. Absolutely loved this place. We went after arriving the same morning and dropping bags off etc. The idea was for just a relaxing afternoon but still do something. Very relaxing to just wander about. It was quite busy but still nice. I just wish I'd brought my proper camera. Entry is 70 pesos for non Argentinians which I can't fault (£3.60 roughly)."
        }, 
        {
            "index": 73, 
            "rating": "5", 
            "review": "Lovely place. Must be visited.. Do not judge the place by thinking \"why do the entrance costs 70 pesos?\". Would go every week if I had the opportunity. Beautiful and peaceful place. Makes you feel like standing in oriental grounds. Tons of great pictures are guaranteed. Loved it!"
        }, 
        {
            "index": 74, 
            "rating": "5", 
            "review": "Aussie in buenos aires. I am a landscape gardener i went to this tranquil garden with a friend ... very relaxing great atmospher ... not as many japanese plants as i thought more native to argentina which is to be expected .... still had a great day and rexommend it to travellers who nees a break from the rat race"
        }, 
        {
            "index": 75, 
            "rating": "5", 
            "review": "Beautiful garden. The Japanese Garden is large, and a lovely visit. There are often special cultural events, and a restaurant as well as a food/snack area with really good crepes. You can buy fish food in the gift shop to feed the koi."
        }, 
        {
            "index": 76, 
            "rating": "4", 
            "review": "Beautiful place of peace and relaxation.. In the heart of Buenos Aires a beautiful place of beauty and peace in this garden you will find that relaxing time necessary to recharge your energy, surrounded by water, plants, fish, delightful bridges; also you find a tea house that serve delicious Japanese food noon."
        }, 
        {
            "index": 77, 
            "rating": "2", 
            "review": "70 pesos por entra?. Yes there is nice place to visit but entry fee is too high for value of them. but nice place take a foto. Under 12 years free to entry haha"
        }, 
        {
            "index": 78, 
            "rating": "4", 
            "review": "Nice diversion and well laid out. Good activity for an hour if you are in Palmero for the the Museo Evita. Good to walk around and not very expensive to get in. Restaurant lookd good but we were not there at a meal time."
        }, 
        {
            "index": 79, 
            "rating": "5", 
            "review": "An oasis of beauty and serenity. . We walked the garden one morning. It was an oasis of beauty and just a lovely spot to visit. The sign going in tells you photos are not allowed without permission but when I asked the lady said they were allowed with a ticket. Nite that you cannot exit and renter with your ticket."
        }, 
        {
            "index": 80, 
            "rating": "5", 
            "review": "What a wonderful place!. An excellent atraction! This is my true opinion about this garden. It´s very well located, organized and clean. This place also provides a very nice experience, if you like to make contact with nature (flowers, trees and fishes), if you appreciate japanese culture, or both! You will need time to walk around the trees, cross the small red bridges and take pictures, as it is, in fact, a relaxing experience! The many pictures I took speak for me."
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "Great sushi in BA. The Japanese Garden is beautiful to have a walk during the day. It also has a japanese restaurant that you can visit even when the Garden is close."
        }, 
        {
            "index": 82, 
            "rating": "4", 
            "review": "Best enjoyed in the morning. Peaceful and relaxing way to start your morning before you deal with the noises of the city. Great for the entire family. This garden is worth visiting when in BA."
        }, 
        {
            "index": 83, 
            "rating": "5", 
            "review": "Go visit this oasis when you need some Zen. If you are into plants/ gardens / Asian or Japanese culture this authentic mini city garden can't be beat If you like none of the above but just want to break from touring the city or need a coffee and to get some calmness the Japanese Garden is still a very god spot to find your Zen. It is not well know nor an easy walk from most BA sights- but it is a under-appreciated jewel and a great oasis. You can get there I'm a taxi from most spots in just a few minutes and just a couple of pesos. Go there support and enjoy it!"
        }, 
        {
            "index": 84, 
            "rating": "5", 
            "review": "A zen island in buzzing BA. Serene landscape, beautiful trees and flowers.... the fish ponds and more than anything else, the quiet atmosphere. Don't miss the exhibitions on the 1t floor of the building at the back of the garden."
        }, 
        {
            "index": 85, 
            "rating": "4", 
            "review": "A more authentic version of Epcot Japan. The gardens are a lovely way to spend a morning in BA before some of the other attractions open. Apparently, lots of other people felt the same- it was pretty busy, though not packed. The park is pretty small, and you won't feel like you're very secluded, but there is plenty to see. The music piped through speakers makes it feel a little like Disneyworld! I enjoyed a delicious pot of tea at the restaurant as well, and the bathrooms are convenient."
        }, 
        {
            "index": 86, 
            "rating": "5", 
            "review": "A little piece of Japan in Buenos Aires.. When in BA if you like delicate japanese gardens or have no other priorities you may pay a visit to this japanes garden. Apart from the garden itself there is a reasonable restaurant with japanese dishes, temporary exhibits and shops. Avoid it in week ends because of the crowds. Near to the Rosedal (rose garden worth visiting), the Planetarium and Alcorta Shoping center for a snack, best brands shopping or just a coffee in a rainy day all under one roof. Parking available."
        }, 
        {
            "index": 87, 
            "rating": "4", 
            "review": "Urban Oasis. The silience and order of the Japanese Garden was a welcome respite from the loud traffic on the major avenues nearby. A good place to stop for a brief rest and not far from the Museo Evita."
        }, 
        {
            "index": 88, 
            "rating": "4", 
            "review": "Very nice layout and clean. It was really nice but smaller than I expected. Very clean and organized. Nice layout. They charge a small amount of money for the entrance ticket."
        }, 
        {
            "index": 89, 
            "rating": "5", 
            "review": "One of the best paid visits of Buenos Aires!. A spectacular view of the Japanese architecture and nature. It is a very peaceful and enlightening place - the visit costs 70 pesos, which is a very fair price."
        }, 
        {
            "index": 90, 
            "rating": "4", 
            "review": "A little Oasis. Not very big but a nice Garden,Great to see how the Japanese intricatly tend to there gardens.Great places for a few photos"
        }, 
        {
            "index": 91, 
            "rating": "4", 
            "review": "Beautiful. I really enjoyed this garden. It was very relaxing. With many water features to enjoy the grounds are spread out. So it doesn't feel too crowded. Beautiful pictures opportunities here."
        }, 
        {
            "index": 92, 
            "rating": "5", 
            "review": "Small Tokyo Garden. It is a tiny japanese garden excellent location, with fish in lagoon (carpas) which one can feed. Very nice walk, specially in a sunny day. There is a tea-house/restaurant which serves very good sushi."
        }, 
        {
            "index": 93, 
            "rating": "3", 
            "review": "Just ok.. Understanding that it's June, chilly outside and not the growing season in BA, I still felt it was worth taking a look at the famous garden.THE POSITIVES:- artfully mapped out with quaint bridges over streams.- large koi in the streams.- the trees and shrubs are well manicured.- several small snack kiosks selling chips, ice cream, drinks, etc.- one snack stop offered a small selection of gluten free treats! Delicious empanada! The attendant did not speak English at all, but was very kind and patient to try and communicate with me.- the banos where acceptably clean and stocked with toilet paper.THE NEGATIVES:- the park is bordered on 2 sides by major roadways. The traffic noise inside the park is VERY disappointing. - the koi are hard to see, as the water is very dark and murky.- I took my time, and tried to meander slowly - still I walked the entire park in less than 15 minutes. It is quite small, which is fine except they charge $70.00 pesos for entrance. Not a terribly large fee, but unsure of the value.- unfortunately there was a large group of boisterous students there at the time that I was. Adding their energy and volume to the road noise made for a rather unpleasant visit. No ones fault here, but the small space couldn't absorb the numbers.Overall it wasn't a waste of time, but if you are on the fence about visiting - then I would save the 70 pesos for something else."
        }, 
        {
            "index": 94, 
            "rating": "5", 
            "review": "The largest Japanese garden outside Japan. If you're looking for some calm in the city, this is a smart direction. It's certainly more packed in warmer seasons than colder, but it's a lovely site regardless of how many people are there. Every time I visit I see it as a Japanese theme park. It just seems to have a little bit of everything, including a restaurant (open during and after park hours), food stands, a gift shop, a gardening shop and more. And it's right off of Av Libertador."
        }, 
        {
            "index": 95, 
            "rating": "3", 
            "review": "Pretty, tranquil. Go ahead and see.. It was a nice experience. Very pretty and a nice thing to do out of the normal B.A. things going on in the city."
        }, 
        {
            "index": 96, 
            "rating": "4", 
            "review": "Fun in the sun but crowded and small. Pleasant enough but really pretty limited If it is a ice say go along and have tea in the park it has crammed a lot of different items in one space but still worth a look ,."
        }, 
        {
            "index": 97, 
            "rating": "3", 
            "review": "Only to spend time. Nice place to spend some time if you have not so much to do in BA. Also a little expensive and a little far from downton. Nothing special!"
        }, 
        {
            "index": 98, 
            "rating": "3", 
            "review": "Pleasant walk in the afternoon. A pleasant walk after a busy day visiting the galleries. Quite a walk back to Recoleta, so take a cab"
        }, 
        {
            "index": 99, 
            "rating": "3", 
            "review": "Very expensive ,. Nice landscape, but extremely expensive , on top of it you pay an entrance fee to go for lunch even if you dont visit the garden. They should reimburse people going for lunch."
        }, 
        {
            "index": 100, 
            "rating": "4", 
            "review": "A quiet place to visit and very well maintained.. Definitely a place to visit on a warm day, but great photo opportunities and a place to relax and enjoy the ambience of the gardens. Feed the koi and enjoy the flowers."
        }, 
        {
            "index": 101, 
            "rating": "3", 
            "review": "Better before. When the garden was run by the Japanese community, all was well. Clean, the water in the leake clean, the carp healthy and curious. The food in the restaurant, good japanese. When the local authorities took over, it fell to pieces. It has improved since, but locals enter froo but foreigners have to pay. I thoinkthis unfair. Go once, to get an idea of the place!"
        }, 
        {
            "index": 102, 
            "rating": "5", 
            "review": "Well done and very beautiful . Saw this on my first day in the city as I was staying in Palermo soho. They have done an excellent job with crating authentic looking Japanese gardens. The entrance fee is steep for a city with free museums 70 pesos ($5) but worth it"
        }, 
        {
            "index": 103, 
            "rating": "4", 
            "review": "Relaxing. Beautiful gardens in the middle of the city. Has a 100 Koi fish in a pond. Benches to sit and relax."
        }, 
        {
            "index": 104, 
            "rating": "3", 
            "review": "only ok. This garden was fine, not one of the better Japanese style gardens I have visited and quite expensive to get in."
        }, 
        {
            "index": 105, 
            "rating": "3", 
            "review": "Not worth the time and price. The park is not less beautiful then the garden and for free. If the weather is clowdy not worth going there."
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "Paradise in the middle of the city. It's a beautiful place to visit, but not during the weekends that it's full of people. It's a very good place to escape the craziness of the city. They have the best sushi restaurant in the city, but super expensive!!"
        }, 
        {
            "index": 107, 
            "rating": "3", 
            "review": "Cute Garden. Nice and cute Japanese garden but nothing extraordinary.We went on a Sunday and every bench in the garden was taken over by local artists.which was nice but other visitors had no place to sit.Should make that artists bring their own chairs"
        }, 
        {
            "index": 108, 
            "rating": "5", 
            "review": "a natural place to breathe and delight your eyes!. Excellent place to visit, japanes culture expressed in art, space, plants and flowers, fishes, stones, signs, music. All in a special habitat in middle of the huge Palermo parks. The Jardin includes a tipical restaurant. a nursery garden, a gift shop, teahouse, reading room and guided visits."
        }, 
        {
            "index": 109, 
            "rating": "3", 
            "review": "Relaxing walk. We wanted a relaxing walk but found the gardens packed with large loud childrens group. Running and throwing things un the large pond. Sad little fishies. There was a fish breeding program that was interesting. We have gone later, after the group if the ticket person told us."
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "A must see. Japanese Garden is a must see in Buenos Aires. The restaurant offers great food and the desserts are very much like in TOKYO. Super tasty!"
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "Beautiful Garden!. We were really surprised to find such a large and gorgeous garden. There is a small entrance fee well worth it the visit. Very well cared with a couple of restaurants. It has a center lake with bridges and beautiful trees and flowers everywhere."
        }, 
        {
            "index": 112, 
            "rating": "4", 
            "review": "Charming Japanese garden in a neighborhood full of parks. Very nice place to visit with the kinds on an afternoon walk. You can also have lunch or enjoy a typical Japanese te at the restaurant. The kids love walking around the park with it charming Japanese bridges and feeding the fish. You can visit the cultural center and learn a little about Japanese culture while you at it. The place is clean and safe. Bear in mind it has seasonal hours and usually closes at dusk, while the park entry closes an hour earlier. I think in summer it closes around 6 pm, plan your visit accordingly."
        }, 
        {
            "index": 113, 
            "rating": "4", 
            "review": "Japan in Argentina. Has a quick visit today, around US $5. Very well kept and some great photo opportunities. The Koi carp are huge and you can buy pellets to feed them from the shop at the back of the gardens. Only takes 10 mins to walk around but if you take your time and enjoy a bit of peace of quiet, then you will enjoy."
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "Peaceful and beautiful gardens in the middle of a busy city. Lovely and exquisitely maintained garden with lots of birds, koi fish, and beautiful photo ops. There's a restaurant inside the garden grounds as well. The visitors center houses a small library of books on and about Japanese culture in several languages, including Japanese of course. It hosts an exhibition room and for the month of April it housed examples of Japanese art including dolls, kimonos, origami, flower arrangement, and more. 70 peso entry fee. Main entrance is on Avenida Casares. If you're prone to mosquito bites like I am, you might want to use your anti-bug spray/balm/repellant of choice."
        }, 
        {
            "index": 115, 
            "rating": "3", 
            "review": "Small and expensive. I hesitated between a 2 and 3 rating. The garden is nicely done but is is very small and the entry fees are very high (around 170 pesos for two) for what you get to see. We were hoping for a greenhouse with some old bonsais, but aside from a few to sell, there was nothing. We may be biased since in Montreal we have a very large and very nice japanese garden with a rich collection of century old bonsais. Unless you are a fan or have a lot if time on your hand, this is not worth it in my opinion."
        }, 
        {
            "index": 116, 
            "rating": "2", 
            "review": "Nothing speciel... I was a little bit disappointed. A nice garden, but not very Japanese. Really not anything special after my opinion. I was glad that the entrance was cheap."
        }, 
        {
            "index": 117, 
            "rating": "5", 
            "review": "Japan in argentina. Safe. Peacefull. Well done. Japanese excellence. Great details. Nice in the afternoon for walking and meditating"
        }, 
        {
            "index": 118, 
            "rating": "5", 
            "review": "Feeling of Japan. very nice and relaxing, garden is beautiful, very nicely arranged, with plenty of flowers and plants tea, wonderful."
        }, 
        {
            "index": 119, 
            "rating": "5", 
            "review": "Very well kept. Wonderful gardens in the middle of the city. So well looked after. Many attractions and demonstrations. It is worth a visit."
        }, 
        {
            "index": 120, 
            "rating": "5", 
            "review": "Unless you came from Japan, please take some time and visit this park. This is one of the most well kept gardens in town, and it's really gorgeous. Beautifully designed with a good variety of trees and plants, nice paths and several tematic monuments. You can go to the bonsai garden (well, you are in Buenos Aires, not in Co Chi Ming) and have a nice breakfast, tea, lunch or dinner at the restaurant within the park.And you can feed the colourful fish in the lake if that suits you."
        }, 
        {
            "index": 121, 
            "rating": "5", 
            "review": "Oasis in a noisy city!. Not the gardens of Kyoto but a beautiful serene place to spend couple of hours. Nice and inexpensive flower shop.\nDo not eat there! The restaurant is awful."
        }, 
        {
            "index": 122, 
            "rating": "4", 
            "review": "A place full of peace and beauty. A peacefull place to enjoy a calm afternoon. Many plans to admire and fishes to feed will make your visit funny, specially for kids. The restaurant is a bit expensive but there is a kiosk inside to buy something to drink and a snack."
        }, 
        {
            "index": 123, 
            "rating": "3", 
            "review": "Nice.. The entrance ticket is cheap, but the restaurant inside is very expensive. If you are looking for a different sight seeing in Buenos Aires, it's certanly a nice place to go."
        }, 
        {
            "index": 124, 
            "rating": "5", 
            "review": "Great afternoon stop. This is a great stop for a couple of hours or lunch when touring Recoleta area. Very relaxing place to chill for awhile."
        }, 
        {
            "index": 125, 
            "rating": "4", 
            "review": "Nice touch. The Japanese heritage in South America is hard for many norte-americanos to imagine. This garden -- maintained and staffed in large part by volunteers is rich with design and layouts of traditional Japanese design. Very restful."
        }, 
        {
            "index": 126, 
            "rating": "2", 
            "review": "Expensive, noisy.. When I picture a Japanese garden the first word that pops into my head I'd tranquillity. This place is anything but, it's beside a really busy/noisy road. It's small and expensive."
        }, 
        {
            "index": 127, 
            "rating": "3", 
            "review": "Not worth the money. Entrance to the gardens is pretty expensive and the gardens themselves are not very impressive. I would skip this unless you have nothing else to do."
        }, 
        {
            "index": 128, 
            "rating": "5", 
            "review": "Just Lovely. I was lovely to stroll around the perfect and interesting Japanese Garden. The fish ponds and bridges, art and trees, we're all just lovely. It was a beautiful sunny day and a great place to go with friends."
        }, 
        {
            "index": 129, 
            "rating": "5", 
            "review": "Beautifully done, kids enjoyed it. . Spent part of the afternoon here. $70 pesos for adults to get in. Children under six are free. Our kids really enjoyed walking around and taking it all in. $10 pesos will buy you a bag of fish food and you can feed the carp. They are huge and so many! Clean and decent bathrooms. Also, situated in a very walkable area. There is a playground across the street for young kids that we went to afterwards."
        }, 
        {
            "index": 130, 
            "rating": "3", 
            "review": "Overpriced!. It was nice, but Parque Holanda is just up the street, free, and nicer! I would skip this and go see the hundreds of roses at Parque Holanda."
        }, 
        {
            "index": 131, 
            "rating": "3", 
            "review": "Disappointed. Whenever I am travelling I always looks for chinese and japanese gardens. I love the beauty and tranquility. When I visited the garden in Buenos Aires there was a musical presentation and it was awesome so I`m keeping that in mind when I say that even without the music these gardens seemed to be missing the tranquility. The gardens were quite open and close to lots of roads - I didn`t spot any nooks or crannies where I could sit and people watch or read my book."
        }, 
        {
            "index": 132, 
            "rating": "5", 
            "review": "Peaceful, well arranged garden. They play some soothing music around the park, beautiful. There is a small museum inside the building at the end of the park. 70 peso for entrance to the park."
        }, 
        {
            "index": 133, 
            "rating": "5", 
            "review": "Fantastic place. I visited in 2013 with my mom.It was a sunny day.This garden is fabulous! There are many flowers to see.. It's very good to stay in contact with the nature."
        }, 
        {
            "index": 134, 
            "rating": "2", 
            "review": "Nothing special. The museum is nice as the park, but nothing special. I went there in march, maybe the season was not good."
        }, 
        {
            "index": 135, 
            "rating": "4", 
            "review": "Well looked after gardens great for a wander. This cost 70$, approx £5 when this was written and was well maintained. Very colourful and laid out well. We called here en route to florales from bosgues de palermo on a walk, which definitely added to a nice day"
        }, 
        {
            "index": 136, 
            "rating": "2", 
            "review": "There are better Japanese Gardens. It is in a noisy environment and rather small. Through loudspeakers comes music. It is not so beautifull and tranquil as is possible. Above the overpriced bad value restaurant there is a nice exposition of japanese art. Entrance fee 70 pesos a person."
        }, 
        {
            "index": 137, 
            "rating": "4", 
            "review": "A great way to spend a spare hour. A beautiful Japanese garden but of a size that even in 35ºC is small enough a pleasant way to spend a an hour gently strolling or relaxing in the shade."
        }, 
        {
            "index": 138, 
            "rating": "4", 
            "review": "Beautiful gardens. Lovely gardens on the periphery of one of BAs main parks. Quite small and self contained with a cheap entry fee. A pleasant way to spend a couple of hours."
        }, 
        {
            "index": 139, 
            "rating": "5", 
            "review": "Tranquility even on a busy Sunday afternoon.. What a lovely space packed into a comparatively small area of parkland. As soon as you entered the garden, you can see vis of the flowers, trees and landscaping of the beautiful garden. Go inside the \"welcome\" building and go up the stairs to the \"mirador\" overlooking the garden for stunning views over the waterlily ponds. Loved walking over the boardwalks seeing the enormous koi carp. A very calm place in the middle of the city. Well worth a visit."
        }, 
        {
            "index": 140, 
            "rating": "5", 
            "review": "Beautiful. Visited in the Spring, classic Japanese Garden with pathways and ponds. The Coffee shop/restaurant is a little pricey but worth it. Great place to spend a couple of hours on a nice day."
        }, 
        {
            "index": 141, 
            "rating": "4", 
            "review": "A oasis of quietness in the centre of Buenos Aires traffic. The gardens made a lovely break in an otherwise busy, noisy tour of BA. They may be fairly small, but this means they don't take too much out of day to see. They are pretty and very well maintained.\nFit them in if you have time"
        }, 
        {
            "index": 142, 
            "rating": "5", 
            "review": "Lovely Gardens. Our hotel was nearby so we popped in to look around.There is a small entrance fee with very good amenities inside.It's not a massive garden but beautiful al the same, it only takes an hour or at the very most two hours to amble around. I wouldn't make a special trip but if you have a spare hour or are nearby it's well worth a visit."
        }, 
        {
            "index": 143, 
            "rating": "4", 
            "review": "A pleasant interlude .... Mr Loafer and I spent a short afternoon here. It was well attended by visitors, although not too busy, during our walk. For a bit of relief from the City and providing a relaxation spot it was appreciated."
        }, 
        {
            "index": 144, 
            "rating": "3", 
            "review": "From pictures I was expecting more. This is a slightly underwhelming Japanese Garden in Palermo. I have visited many Japanese Gardens around the world and I have to say this was one of the more disappointing ones. It was still a pleasant place to walk around but if you're short on time in Buenos Aires I would definitely skip it."
        }, 
        {
            "index": 145, 
            "rating": "4", 
            "review": "Delightful escape from a not-very-exciting city. By day three of our visit to BA, having done the steaks, the tango show and La Boca, we were starting to wonder what else to do. We spent a delightful hour or so in the pristine Japanese Gardens and it remains one of the nicest memories of our stay - nothing sensational, just quiet, calm and very pretty."
        }, 
        {
            "index": 146, 
            "rating": "3", 
            "review": "Nice garden. I had heard and read about the garden. We were walking to Palermo, when I saw the sign and of course I wanted to see it. The garden claims they are the biggest. Japanese Garden outside Japan. Well, I don't know about that! I might be wrong but I think our Japanese Garden in Houston is about the same size if not bigger. They do have an entrance fee. You will find a Japanese restaurant inside which I later heard is a decent one (we did not go there). We only spent about 30 minutes inside the Garden. Overall it's nice if you want to sit down on a bench and relax a little bit."
        }, 
        {
            "index": 147, 
            "rating": "2", 
            "review": "Pleasant but Nothing Special. There are many beautiful Japanese gardens to tour outside of Japan. I recommend the one in Seattle or San Francisco. This one is modest and tranquil but certainly not worth making a destination item on your itinerary. You can feel comfortable not visiting it--secure in the knowledge that you missives nothing special."
        }, 
        {
            "index": 148, 
            "rating": "5", 
            "review": "A delight. This work of horticultural art is a definite must in This city. . It is beautifully landscaped and cared for . A memorable visit"
        }, 
        {
            "index": 149, 
            "rating": "4", 
            "review": "Very pleasant but busy. These gardens were a good find after the disappointment of the Botanical gardens. Thoughtful layout, plenty of colour and well maintained, these small gardens are great for a gentle stroll or a welcome sit down. They were pretty busy when we visited and so not quite as restful as they surely are at quieter times. There's not a great deal to see but they are worth a visit all the same."
        }, 
        {
            "index": 150, 
            "rating": "4", 
            "review": "Tranquility. If you want some peace and quit fron the buzzling town, this is the plce to go. Maybe not the best japanese garden in the world, but has a nice park, you can buy fishfood for the huge koifish (kids love it!) and it has a really good sushirestaurant inside, and traditional teahouse."
        }, 
        {
            "index": 151, 
            "rating": "2", 
            "review": "Ok gardens, but seen better. Average, not bad, but not great either. We had recently arrived when we went, so possibly just expecting a bit more."
        }, 
        {
            "index": 152, 
            "rating": "2", 
            "review": "Poor example of a Japanese garden. I was visiting with my Chinese friend and since it was such a nice day and we were in the area we decided to walk through the garden. None of the plants or trees were labeled, the garden does not look well kept. We have both visited many Japanese gardens and this is not worth the time. There are a couple of red Japanese looking bridges and coi fish in the dirty water but a poor example of what a real Japanese garden would look like. Save your money and time, there are to many other things to do and see."
        }, 
        {
            "index": 153, 
            "rating": "5", 
            "review": "Surprisingly large gardens beautifully landscaped. These were a gift to the city by the Japanese government so very authentic in layout with gorgeous lakes, bridges, trees and of course plants. Plenty of shade if you go on a hot day and even a Japanese cafe selling japanese snacks!"
        }, 
        {
            "index": 154, 
            "rating": "5", 
            "review": "Beautiful way to spend an afternoon!. My daughters and their two friends and I spent a beautiful afternoon in the garden. Very peaceful and relaxing. The music was lovely. We enjoyed tea and sandwiches in the restaurant."
        }, 
        {
            "index": 155, 
            "rating": "4", 
            "review": "GOOD FOR FAMILIES WITH SMALL KIDS.. I write this review as a mother of a 2 year old not as a normal human being. If you have small kids and you are about to loose it, take those rascals there, buy them some bags to feed the fish and enjoy peace for as long as those bags can last. Do not attempt this if your child is the sort that will try to jump in the water, the place is basically an artificial lake. It is pretty enough for a nice stroll for the parent to enjoy, or even normal childless human beings. It even has clean toilets and an outdoor food area."
        }, 
        {
            "index": 156, 
            "rating": "3", 
            "review": "Nice relaxing place, after a day of walking. My wife and I were walking the Recoleta area, found these gardens, and spent an hour relaxing, and viewing nicely presented gardens. Not the best Japanese gardens we have been to, but some of the largest carp we have seen."
        }, 
        {
            "index": 157, 
            "rating": "4", 
            "review": "A little Japan in Buenos Aires!. This is a magical and relaxing place! I love the nature and the beauty of this garden. There is a japanese restaurant and a nursery inside. It's perfect to share a special moment with your love or with friends! You can take beautiful pictures there as well! Enjoy it!"
        }, 
        {
            "index": 158, 
            "rating": "4", 
            "review": "Too small!. Really nice but not big enough considering the entry fee of70pesos..Not much to see,very commercial but nice to see if you want to make the time to get there.You cover the whole area in minutes litarelly! Even if you take your time.Up to you to decide."
        }, 
        {
            "index": 159, 
            "rating": "5", 
            "review": "Recommended. Susana your suggestion was great. I felt almost like in Tokyo here. La comida en el restaurante es kmuy buena pero no es barata."
        }, 
        {
            "index": 160, 
            "rating": "5", 
            "review": "Nice for a walk in a beautiful setting. End of summer Sunday. Lots of families and great for photos. We had a late afternoon sandwich in the tea house which serves desserts but not sushi at that hour. It was a perfect thing to do on a gorgeous day"
        }, 
        {
            "index": 161, 
            "rating": "5", 
            "review": "Beautiful and peaceful. Larger than it looks from the outside the Japanese Garden is an incredibly relaxing experienceIt closes rather early so go earlier in the day, there is a fee to go in but it's not prohibitive. The gardens are beautifully manicured and a perfect place to go for a date. Our favourite part was walking down the long wooden raised walkway (over the water) great place for photographs."
        }, 
        {
            "index": 162, 
            "rating": "3", 
            "review": "It just a big garden with flowers. Saw from the tour bus and went back wishing to see lots of flowers it had some, but not in abundance."
        }, 
        {
            "index": 163, 
            "rating": "4", 
            "review": "A lovely Japanese garden in the heart of Buenos Aires. It is worth visiting, and spending a moment of calm in the heart of vibrant Buenos Aires. That being said, by all means PASS on the restaurant of the same name. The food is very mediocre, service poor and prices very high. There is no lack of good food in Buenos Aires, and you don't go there for Japanese food, and the Japanese Garden restaurant will certainly not satisfy your desire for good sushi, sashimi or other Japanes food. Avoid."
        }, 
        {
            "index": 164, 
            "rating": "5", 
            "review": "Beautiful Gardens. This was the perfect relaxing way to spend my birthday afternoon. There is a great little restaurant where you can get sushi and you have a beautiful view of the garden."
        }, 
        {
            "index": 165, 
            "rating": "3", 
            "review": "Pretty little Japanese Garden. Pretty garden but nothing really special. Better things to see in Buenos Aires. I think there are more activities going on later in the day but we were there early in the morning so not much happening. Huge fish in the ponds but not enough signage for visitors in English."
        }, 
        {
            "index": 166, 
            "rating": "5", 
            "review": "A Beautiful Oasis. A beautiful, well-thought-out genuine Japanese garden. Very Zen. Has clean rest rooms, a little museum, a restaurant, and a snack bar."
        }, 
        {
            "index": 167, 
            "rating": "5", 
            "review": "Nice and relaxing garden. Really worth a visit, especially if you would like to relax a little. Even in hot summer the garden is very well maintained."
        }, 
        {
            "index": 168, 
            "rating": "5", 
            "review": "Beautiful!. The perfect place for a peaceful and calming stroll, quiet with no traffic noise. A lovely place to get away from the hub but of the city."
        }, 
        {
            "index": 169, 
            "rating": "4", 
            "review": "A nice change. I visited this garden 6 or 7 years ago and at the time it was a little shabby.Seeing it last week was a unexpected delight. Well maintained, clean with lot of visitors"
        }, 
        {
            "index": 170, 
            "rating": "5", 
            "review": "Stunning peaceful garden. My hubby and I thoroughly enjoyed the day we spent at the Japanese Gardens. It is a beautiful and serene place which we need after the business of Argentina. You will enjoy it and would recommend you visit"
        }, 
        {
            "index": 171, 
            "rating": "5", 
            "review": "A Romantic Stroll. We were in BA for our honeymoon and could not resist a chance to take a walk in a beautiful garden. The grounds are well maintained and despite being located in a buzzing metropolis, it was surprisingly tranquil. One of our favourite features was the display of Bonsai trees available at the nursery. We enjoyed reading about how they are grown and looking at the different varieties. A stroll in the garden hand in hand is a lovely way to spend an afternoon. If time permits, it’s also worthwhile to visit the onsite museum and appreciate Japanese works of art, instruments and traditional garments on display."
        }, 
        {
            "index": 172, 
            "rating": "4", 
            "review": "beautiful & tranquil. This is a lovely place to wander, sit and relax, a total oasis in the middle of BA. Close to Museo Malba and worth the visit."
        }, 
        {
            "index": 173, 
            "rating": "4", 
            "review": "Beautiful oasis . A wonderful place to spend the afternoon. My husband and I had lunch at the Japanese restaurant. That was a bit of a challenge since the waitress spoke little English, but we managed to enjoy everything we order. The food was a little pricey, but we expected that since it is in a tourist attraction. The gardens were well maintained and very serene. It's a wonderful escape from the busy traffic that surrounds it! Well worth the trip."
        }, 
        {
            "index": 174, 
            "rating": "5", 
            "review": "Recommended. Great place to eat delicious Japanese food. Everything was great here. Had an amazing time. Thank you for everything."
        }, 
        {
            "index": 175, 
            "rating": "4", 
            "review": "an oasis. great place of calm in a busy city. just walk around and relax . a fantastic place for families to relax. get there b4 the crowds. the restaurant is ok but pricey and the cashier is way too pushy in looking for extra tios. Wouldn't go back to the restaurant."
        }, 
        {
            "index": 176, 
            "rating": "4", 
            "review": "Relaxing in the garden on a hot day.. We went on a walk through the many parks and ended up in the Japanese Gardens. They are small but very relaxing and have a good Japanese Resturant and also a snack cafe in the grounds."
        }, 
        {
            "index": 177, 
            "rating": "4", 
            "review": "A little bit of cool and calm in a hot city. Although there were lots of people about and it was very hot, this garden felt cool and calm and we enjoyed the gentle noises from the Japanese water features."
        }, 
        {
            "index": 178, 
            "rating": "3", 
            "review": "Not special. Expected more Japanese plants it was a park with Japanese atmosphere. Not so many bonsai and perfect gardens with pebbles and stones"
        }, 
        {
            "index": 179, 
            "rating": "5", 
            "review": "A beautiful and peaceful retreat. The Japanese Garden, though not large, is a beautiful oasis in Buenos Aires. The garden is well planned out and very well maintained. A relaxing way to spend time away from the more familiar tourist sites."
        }, 
        {
            "index": 180, 
            "rating": "3", 
            "review": "Small Garden in the City. From some previous reviews I had read the Japanese Garden was high on my list of places to see in Buenos Aires. I was a bit suprised at how small the garden was when I entered. Overall the gardens were well maintained although there were a few sections closed off for construction/upgrades. The Koi in the ponds were fun to watch and there were some interesting plants and statues. The gardens were nice but for someone who loves gardens and green space they left me a bit underwhelmed."
        }, 
        {
            "index": 181, 
            "rating": "3", 
            "review": "Pleasant but not amazing. We had a nice walk around the gardens but it is fairly small and I didn't think it was particularly special. Lots of kids running and shouting kind of ruined the ambience."
        }, 
        {
            "index": 182, 
            "rating": "5", 
            "review": "Hidden. Jewel!!. This hidden jewel is a wonderful place to visit\nIt has the most beautiful and huge koi fish\nIt has a restaurant a lots of fun\nOutside is horse cartridges\nAnd is breath taking\nI recommend this place 100%\nI visited few years ago"
        }, 
        {
            "index": 183, 
            "rating": "4", 
            "review": "Worth going just to see the Koi Carp. Its a garden, its quite pretty and it does have a Japanese feel to it. If I had a few days in BA I don't think I would make a special visit....if you have a week then maybe on a sunny day it could be a good place to just relax and take a stroll. The most impressive thing about this garden in my opinion was the sheer numbers of koi carp in the lake and some of them are huge. I did go and have sushi at the restaurant (separate review) and I would advise against it as it is very expensive. There is a separate little place that sells ice creams and that would have been adequate refreshment. Overall it is nice but nothing special, some good photo opportunities so if you are in the area and want to chill out from the hustle and bustle of BA for an hour then give it a go."
        }, 
        {
            "index": 184, 
            "rating": "4", 
            "review": "Peace in the middle of the city. The garden was beautiful. Lovely walkways between waterways, small waterfalls and manicured grass and trees. Interestingly there is a memorial to the atomic bomb dropped on Hiroshima within the garden.There is a small pagoda with a large bell hanging within. No idea when it might be struck or how often.The water is full of fish, and is great fun for children to feed. When we were there there were two sizes of fish in the water, very large and just hatched."
        }, 
        {
            "index": 185, 
            "rating": "3", 
            "review": "A nice afternoon destination. I always find these types of gardens small and nothing surprising. But I still enjoy a walk around them ( maybe hoping to find a surprise!) If you are out walking among the many parks in the area, it is an enjoyable stop"
        }, 
        {
            "index": 186, 
            "rating": "5", 
            "review": "Great for a walk thru. Pleasantly interesting and could stay for lunch but the crowd made it less charming. Lots of families because it was Sunday."
        }, 
        {
            "index": 187, 
            "rating": "5", 
            "review": "Experiencing Buenos Aires. These are one of the most intricate Japanese gardens that one can experience when travelling in South America."
        }, 
        {
            "index": 188, 
            "rating": "4", 
            "review": "Lovely Place to Walk. It is a beautiful, serene place to walk around. There were other visitors, but it wasn't crowded (although we visited in January, which I don't think is the height of the tourist season) and provided something different from the hustle-and-bustle of the city. Worth the visit!"
        }, 
        {
            "index": 189, 
            "rating": "4", 
            "review": "Very nice garden in the \"lakes area\" of Buenos Aires. This garden is a nice (but a bit costy, ticket = 70 AR$) option for those searching for a bit of relax in the city of Buenos Aires. Located 10' walk from the Museum of Latinamerican Art, it is really an oasis of peace, even though the proximity to the airport Aeroparque Newberry does not really allow a full relax (at least from noise)."
        }, 
        {
            "index": 190, 
            "rating": "5", 
            "review": "A piece of Japan. This Japanes Garden is very well kept, you can enjoy nature Japanese style. The Japanese Restaurant in the Garden is also worth a visit."
        }, 
        {
            "index": 191, 
            "rating": "4", 
            "review": "A bit small. I expected it bigger but it's still a nice oasis in the middle of Buenos Aires' hustle and bustle. Good place to visit especially on a hot afternoon!"
        }, 
        {
            "index": 192, 
            "rating": "4", 
            "review": "A Nice Respite. Relaxing and beautiful setting. 70 pesos for admission seems reasonable. An oasis in a very busy city especially on a hot day."
        }, 
        {
            "index": 193, 
            "rating": "4", 
            "review": "Go out and take some photos. Everyone enjoys the atmosphere of this Japanese garden.\nNear museums and fancy neighbourhoods you stop and relax.\nTeenagers taking pictures. Ladies having tea. Families buying bonsai trees.\nColours everywhere you go.\nIt can be a little crowded on holidays."
        }, 
        {
            "index": 194, 
            "rating": "4", 
            "review": "Nice area, not much space to sit . If you like gardens, then do not miss these ones. However, be aware that if you visit in the summer time, it gets very very hot and there is not much shadow and spaces to sit."
        }, 
        {
            "index": 195, 
            "rating": "2", 
            "review": "no big deal. if you have traveled at all, or your hometown has a botanical garden, and your pressed for time, don't do this. it's a once around the small park with some nice trees, poorly mainatined, with hundreds of koi. go have a long lunch instead."
        }, 
        {
            "index": 196, 
            "rating": "3", 
            "review": "Overpriced. Inexpensive - but there are lots of nice parks in Buenos Airies with no entrance charge. The park was absolutely packed with people. It was pretty with gardens and ponds filled with large koi. However, if you're expecting something really special, like intricate bonsai gardens, you'll be disappointed."
        }, 
        {
            "index": 197, 
            "rating": "5", 
            "review": "Pretty authentic!. I lived in Japan for several years and really grew to appreciate what a Japanese garden is all about. When I saw this garden in BA, I was blown away with the sheer scale of it! Big and open, but somehow still \"tight\" and authentic."
        }, 
        {
            "index": 198, 
            "rating": "5", 
            "review": "A moment of peace. Nobody expect a perfect silence in the middle of the city rounded by 2 of the main avenues. The koi fishes, the green, the sakura in spring is incredibly beautiful, quiet and perfect! The maintenance is always perdect and clean. The food, the shops and everything inside is a little Japan!"
        }, 
        {
            "index": 199, 
            "rating": "2", 
            "review": "Not that unique. The Japanese garden is special, as it's in the middle of a very european and south-american city, but that's about the only thing. Not really a place I would recommand to anyone again."
        }, 
        {
            "index": 200, 
            "rating": "3", 
            "review": "Nice place to walk around, touristy. The Japanese Garden is nice to walk around but there are a lot of tourists and you have to pay to get in. Maybe better for families with kids who want the experience. For my husband and I coming from the states, we didn't think it was really worth it. But we took some nice pictures and it was an ok way to spend an hour."
        }, 
        {
            "index": 201, 
            "rating": "3", 
            "review": "Very pretty but not spectacular . Nice to visit if in the area but not worth the money to go see (although cheap). Highlights were the koi fish and bonsai trees! The grass wasn't lush however it was well kept."
        }, 
        {
            "index": 202, 
            "rating": "5", 
            "review": "Gorgeous gardens. If you can't get to Kyoto, this is the next best thing! Magnificent gardens, ponds, stones, and a nice cultural center as well. Wonderful way to spend an afternoon."
        }, 
        {
            "index": 203, 
            "rating": "4", 
            "review": "Elegant, relaxing, well maintained and free for senior visitors.. When in Palermo, do not miss the opportunity to visit this elegant garden. It has been built by the Japanese community of Buenos Aires to provide - on top of a pleasant place where to spend some hours of relax - a number of cultural activities and exchange trips with their motherland. Lakes, bridges, perfectly maintained lawns, plenty of different trees and birds characterise the Japanese Garden. The restaurant is currently closed, but a bar provides refreshments and snaks. A Bonsai garden sells various types of plants and provides a sort of \"hospital\" for suffering bonsais. Very pleasant is the fact that the senior citizens (all national and foreigners over 65) enter for free, saving 70 Pesos of ticket."
        }, 
        {
            "index": 204, 
            "rating": "3", 
            "review": "Interesting but nothing special. Good for a short walk. Very touristy at small space. Expected bigger territory. To small for a long walk."
        }, 
        {
            "index": 205, 
            "rating": "3", 
            "review": "Pit Stop. Ok to visit if you happen to be in the area but don't plan your day around it. Not that exciting to make too much of an effort."
        }, 
        {
            "index": 206, 
            "rating": "4", 
            "review": "Rosie Miilar. It was our last day in BA and a hot holiday weekend. The gardens were very busy. I expected moss and stone gardens which werent but the site was pleasant."
        }, 
        {
            "index": 207, 
            "rating": "3", 
            "review": "Pleasant stroll. We had passed this in a taxi and I was keen to go. It was quite compact but pleasant to wander through. There was a restaurant and little shop."
        }, 
        {
            "index": 208, 
            "rating": "3", 
            "review": "A bit disappointing. This Japanese garden was not up the brilliance of some that we have seen around the world and we would definitely recommend seeing Recoleta Cemetery as the number one choice if you are pushed for time in your visit to Buenos Aires"
        }, 
        {
            "index": 209, 
            "rating": "4", 
            "review": "Would have been nice if free. While the admission price is not exorbitant, I did not feel we got our money's worth in this fairly small enclosed garden (roughly 1 city block in size). This garden sits on the edge of a park in the Palermo section of BsAs and has a nice pond, large koi, a little bridge over the pond, some beautiful plantings and some small sculptures. It is peaceful and it is pretty and can be a nice place to come and sit, but while I don't remember the exact price of admission, I remember thinking at the time it seemed excessive for what one got. However, if you have a little extra time and a little extra money while in BsAs, its not a bad place to go"
        }, 
        {
            "index": 210, 
            "rating": "2", 
            "review": "Poorly maintained gardens with entry fee?!. Love Japanese gardens, this one was very overgrown and tired with sections closed off and broken bridges and fountains. Disappointing and uninspiring.."
        }, 
        {
            "index": 211, 
            "rating": "4", 
            "review": "A surprise oasis: free for seniors but $150 pesos otherwise. Pretty and small garden tucked in the hustle-bustle of Buenos Aires. Very large koi. Maybe could spend about 1.5 hours here at the most."
        }, 
        {
            "index": 212, 
            "rating": "5", 
            "review": "Calm and peaceful . A calm and peaceful place to visit. A charming garden with some interesting information about the Japanese relationship with Argentina."
        }, 
        {
            "index": 213, 
            "rating": "3", 
            "review": "Very pretty but a bit disappointing . Amongst the hustle and bustle of BA this is a nice spot to get away from it all - although it is a popular spot and there are lots of tourists with selfie sticks being swung around so in actual fact one of the parks is probably a better spot to retreat from the city!The garden itself is very pretty and well looked after but having paid the slightly expensive entrance fee I was quite disappointed by the size of the garden. It's very small and will take you about 10 minutes to walk around - and that's at a slow pace! There isn't much to read and the only exhibition panel is all in Spanish which was also a little disappointing. We also tried the restaurant. Maybe the standard of Sushi in London is better but it was pretty bad in this restaurant. I'd try elsewhere for sushi. I suppose it's worth a look if either you have nothing to do or are passing by but I'm not sure I would go out of my way to go to it."
        }, 
        {
            "index": 214, 
            "rating": "5", 
            "review": "Lovely garden. Beautifully landscape garden which was a gift from Japan. Lovely place to walk with ponds and Koi and beautiful plants."
        }, 
        {
            "index": 215, 
            "rating": "2", 
            "review": "Not worth the entrance fee or a walk to visit.. $70 peso entrance fee. We were really disappointed. The parks we walked through to reach the Japanese gardens were far more impressive. It took us 15 mins to walk around including a loo stop. It felt very 'Dsneyesque' but without the magic of Disney."
        }, 
        {
            "index": 216, 
            "rating": "5", 
            "review": "Very pretty and serene. It's like being in one of the parks in Tokyo, where you can find yourself in a little oasis amidst all the urban stuff. We felt the tearoom here was very overpriced (though pretty), so we didn't eat here, and the other spot marked on the map as having food really only had chips and ice cream. While this was not on our list of must-sees, it was a nice stop on a sunny day."
        }, 
        {
            "index": 217, 
            "rating": "5", 
            "review": "Small but perfectly formed. A real oasis of peace and calm as you might expect from a Japanese garden. It's not huge but it is well put together and a very peaceful location to while away an hour or so. they had an exhibition of kimonos on when we were there. Not many but a nice diversion and in out of the hot sun. You can feed the koi carp if you want. The big fish are huge (it would take a lot of chips to go with them!). I've been in Japan and seen some amazing gardens there and whilst this isn't on the same scale or have the same grandeur it is still worth the visit and the AR$50 to get in."
        }, 
        {
            "index": 218, 
            "rating": "3", 
            "review": "Gardens & lunch . A pleasant place for a walk & light sushi lunch- feeding the large koi carp was the highlight for us There are some lovely roses & Japanese trees & lots of lovely lily pads growing in the ponds which are brimming with massive koi carp fish"
        }, 
        {
            "index": 219, 
            "rating": "2", 
            "review": "disappointing as a garden. not really much of a Japanese garden. lacking in much of the traditional Japanese landscape architecture and no bonsai to speak of. On the positive side we didn't pay to get in as they accepted a photocopy of our passports as proof that we are seniors."
        }, 
        {
            "index": 220, 
            "rating": "2", 
            "review": "Pretty but not imprasove. There were some pretty flowers and areas to sit to people watch but not sure it was worth the entrance fee. Only took us ten minutes to walk through and that's even with stopping to take photos."
        }, 
        {
            "index": 221, 
            "rating": "5", 
            "review": "A Peaceful Stop in Parque 3 de Febrero. This is a place to appreciate the Japanese ambiance. It is peaceful and well taken care of. Ponds are full of huge fish, eager to be fed. Water in the ponds when we were there was very murky. There is a tea house where apparently a limited number of visitors can sign up to experience the ceremony held there. The garden includes three trees transplanted from Hiroshima or Nagasaki that survived the blast. There is a small cultural center that we did not spend too much time exploring. A restaurant is part of the center."
        }, 
        {
            "index": 222, 
            "rating": "3", 
            "review": "Nice garden but to small. Very pretty garden with lots of flowers, trees and birds. It is a nice walk but the garden is very small and the food inside is rather expensive. A bit to much of an 'amusementpark' to my taste."
        }, 
        {
            "index": 223, 
            "rating": "5", 
            "review": "Unexpected and wonderful. I came upon this by accident on my first trip to Argentina two years ago and visited again this past week. It was built in the 1960s and has been beautifully maintained. I doubt you'd see anything like this anywhere else outside of Japan. The sushi restaurant inside the park is also a really nice respite from the ubiquitous steak meal. It's also relatively close to Recoleta Cemetary, which makes it easy to do both in a couple of hours."
        }, 
        {
            "index": 224, 
            "rating": "4", 
            "review": "Sight see. This is part of the great park areas that are so prevalent in Buenos Aires very well done and lovely tranquil good for an easy hour or two"
        }, 
        {
            "index": 225, 
            "rating": "5", 
            "review": "A quiet place in a humorous city. There's this eery feeling you get while going around the garden. Is a quiet place in such a frantic city."
        }, 
        {
            "index": 226, 
            "rating": "3", 
            "review": "Not Turning Japanese. It didn't help that it was a scorching hot day and I had just walked for miles through bustling streets and avenues to get here, but it wasn't the oasis of oriental calm I had expected. It was much larger than I'd imagined, but the size didn't add to making it impressive. It was just more of the same thing: little fish-filled ponds, cute little bridges, pagodas, bushes on and on. Outside, roaring traffic hurtles past unceasingly. It's a park but its parkiness is undercut by being intersected by highways full of traffic. This garden is an approximation of what someone brought up on Disney films, but hadn't actually seen an actual garden, might think a Japanese garden should look like."
        }, 
        {
            "index": 227, 
            "rating": "5", 
            "review": "Great way to chill after a long flight. My partner and I went to he gardens the day after we arrived in the city. The garden is beautiful and just the right size to enjoy. The coy are as big as cats and they follow you like dogs as you walk the bridges."
        }, 
        {
            "index": 228, 
            "rating": "5", 
            "review": "Loved it!. Japanese gardens are, of course, usually beautiful and well maintained. So no surprise here. But here it still feels like such a special place, like this little oasis in this huge city. A true haven of tranquility. Absolutely loved it.Costs 50 pesos to get in. Totally worth it!!"
        }, 
        {
            "index": 229, 
            "rating": "4", 
            "review": "Tranquil Spot. On my last day in BA, I took a cab to the Japanese Garden and spent a little over an hour just taking in the beauty of the gardens, and watching the fishes. I also stopped by the restaurant for a drink on my way out. I thought it was a lovely way to spend my last morning in BA away from the crowds."
        }, 
        {
            "index": 230, 
            "rating": "4", 
            "review": "Very nice but not quite a true Japanese garden. It is pretty and well worth a stroll but having been to Japan it doesn't quite ring true. However don't be put off by this. It is a pleasant picturesque place to spend some gentle time in this vibrant city.There really is no need to book a tour as it is easy to find and not very large. It is a bit of a walk from public transport though A visit of 2 hours would probably suit most people. If you come in summer a hat or umbrella would be handy as the garden isn't completely in shade. Also bring water to drink and if you want a little food for the fish(carp) some of which are huge."
        }, 
        {
            "index": 231, 
            "rating": "4", 
            "review": "Small, but Lovely. After a long day of sight seeing we were on our way back to the hotel when we saw this garden and decided to walk through to go to the other side of the area. It was very pretty, but the noise from the street could still be heard. We are seniors, and if you can prove you are one, you can get in for no charge."
        }, 
        {
            "index": 232, 
            "rating": "5", 
            "review": "The perfect combination of flowers and fishes. At the Japanese Garden you can enjoy a nice atmosphere, not only because of the great variety of flowers and colourful fishes it has, but also the relaxing music you can listen to while walking through the nice paths that leads the visitor to different stands where history, bonsais and souvenirs make visiting this place worthwhile . Enjoy it with all your senses!"
        }, 
        {
            "index": 233, 
            "rating": "2", 
            "review": "I don't understand the other reviews. A very quick summary .. The best thing about this is the koi carp in the ponds. If you've seen some of the Japanese gardens in Kew Gardens this doesn't even come close. On top of this the staff in the shop inside were grumpy!"
        }, 
        {
            "index": 234, 
            "rating": "5", 
            "review": "Beautiful Quiet Place for a Stroll. Access to the garden is easy and the grounds are well maintained. There are many shaded areas to sit and meditate. The Coy Pond is massive and well stocked. The gift shop has a good variety of authentic items made in Japan. Note: Seniors over 65 receive free access."
        }, 
        {
            "index": 235, 
            "rating": "3", 
            "review": "Pleasant place to spend a little time. This had most of the elements of a traditional Japanese garden, but I was a little disappointed by its small size, having walked for over an hour to get there, and had to pay to go in - entry is theoretically free for retired people, but you have to show your passport, which we had left in the hotel safe as instructed by our tour rep."
        }, 
        {
            "index": 236, 
            "rating": "4", 
            "review": "Lovely....but super busy. We visited on a bank holiday, as it was one of the few places open - we hadn't thought to check whether there were any Saints days falling on our trip but found there were two. This basically meant that everyone who fancied a day out....seemed to be in the Japanese Gardens!!! It is beautiful, and worth a visit, but as part of the point is the tranquility and peace, I really would advise trying to visit at a time when you think it might be quiet - morning on a normal week day for example."
        }, 
        {
            "index": 237, 
            "rating": "5", 
            "review": "Calm in the busy city. The Japanese Gardens are beautiful, peaceful and quirky. Have a good time strolling along the paths and over the bridges watching the Koi. Good place to chill out."
        }, 
        {
            "index": 238, 
            "rating": "4", 
            "review": "Lovely place even when busy. Lovely place even when busy but restaurant was pricey and slow though the food was very good. Nice art exhibition when we were there"
        }, 
        {
            "index": 239, 
            "rating": "3", 
            "review": "OK but not great example. It has many elements of a Japanese garden but doesn't quite seem to capture the essence of a peaceful, serene environment.There are bonsai, koi, couple of bridges, a pagoda and a little waterfall. The free parks in the area far surpass this one."
        }, 
        {
            "index": 240, 
            "rating": "4", 
            "review": "Japanese trip in Buenos Aires. Sunny day in Buenos Aires, leaving the subway in the Plaza Italia station. You have to walk through the Zoo. This area nearby the Japanese garden is great in the sunny day. A lot of people, beautiful people. The Japanese Garden is great, it's a rewarding time to be here. Don´t miss that, it's unbelievable organized and clean."
        }, 
        {
            "index": 241, 
            "rating": "5", 
            "review": "Best garden. I went to this November it's great a grade so you will enjoyed it there if you are in bunes aires you must visit in there"
        }, 
        {
            "index": 242, 
            "rating": "3", 
            "review": "Ok gardens. These gardens are small and just fair. Have been to lots nicer and quaint Japanese Gardens, which I personally love, but this one was ok."
        }, 
        {
            "index": 243, 
            "rating": "3", 
            "review": "nice place. we went to garden from an advice of a friend. its a nice place, pretty gardens and very well kept. but its a smal place in the end and you can see the whole of it in 30 minutes, so i dont know if the money worth it..."
        }, 
        {
            "index": 244, 
            "rating": "4", 
            "review": "Peacefull Garden. Well worth a visit, it is kept impeccably and the garden with its bonzi trees justifies a visit. Furthermore it is about 500 yards from the Rose Garden situated in 3rd February Park."
        }, 
        {
            "index": 245, 
            "rating": "3", 
            "review": "Nice. The garden was certainly very nice, although a bit small and left something to be desired. The main draw seems to be the large center pond with plenty of koi, but there seem to be a lack of flowers that one would expect in a Japanese garden. There was a nice rose bud section, but it was very small. Overall, not necessary for a visit."
        }, 
        {
            "index": 246, 
            "rating": "5", 
            "review": "Just gorgeous!. A very chic and beautiful space. Spent a couple of hours there - I love gardens and this one is really special. The Koi ponds are really something"
        }, 
        {
            "index": 247, 
            "rating": "3", 
            "review": "Beautiful small place, a little overpriced. Is beautiful, just perfect for take some pictures, nothing else. A little expensive comparing what this place offers (50 pesos or 5 USD aprox,)"
        }, 
        {
            "index": 248, 
            "rating": "4", 
            "review": "Nice but Crowded..... A nice place to visit in the surroundings of Recoleta and the Palermo Parks, its a japanese cultural centre that represents honorably their society. Well design and set up, it display several of the typical features of a japanese garden with a couple of tori's in the back, a fish pond with a walkable path and even has a dojo for events.It also features a very popular restaurant next to the garden store, that offers a very traditional menu (you have to pay the entrance fee of the garden if you want to go to the restaurant). The garden itself its a very nice place to relax during the mornings but its quite crowded during the afternoons and the weekends so plan ahead and be smart."
        }, 
        {
            "index": 249, 
            "rating": "5", 
            "review": "Reminded me of Tokyo. Having planned to visit the Japanese Garden on my eighth day in Buenos Aires, this had to be postponed as the weather was abysmal all morning with heavy rain covering the city. So after having a long lunch a couple of miles away and waiting for the rain to disappear, it did and I took advantage of the time left to pay a visit to the Japanese Garden which is usually open from 10.00-18.00 arriving for the last hour. It was probably quieter than it would have been on a better weather day. The sky was now blue and the sun was back out and seeing the garden was an absolute treat. It really is beautiful and reminded me of my visit to the Japanese capital earlier in the year. The entrance fee is currently AR$50 which is pretty good value. There are also places to eat and shop there too. Well worth a couple of hours while in Buenos Aires"
        }, 
        {
            "index": 250, 
            "rating": "2", 
            "review": "not sure. this place is located in a really nice district (Recoleta) but you have to pay for the entry and it gets crowdy really quick. So I am not sure if it is worth to see it. Technically, there is a tea ceremony but I did not see it because we decided it is not worth it because of the huge crowd."
        }, 
        {
            "index": 251, 
            "rating": "3", 
            "review": "Nice to have in the city. I am terribly spoiled by having experienced the gardens of Tokyo and Kyoto, and several wonderful examples like the tea gardens in San Francisco, so the comparison in my mind was unfavorable. However, having this nice park to visit with examples of Japanese horticulture is a very good thing for Buenos Aires, and I applaude the initiative. The park seemed a little neglected, but again, I'm coming from a very high expectation of what Japanese gardens should reflect......perfection!"
        }, 
        {
            "index": 252, 
            "rating": "4", 
            "review": "Japan in Buenos Aires. The Japanese Gardens are wonderful. The small bridges, the iris growing in water along the walks , where there are benches so you can sit and just soak in the peace and quiet and beauty of the Gardens. There is a Tea House, a Gift Shop where you can buy plants, tea cups and a wonderful variety of things. There is a greenhouse where you can buy plants .. it is definitely worth stopping and visiting .. even more than once."
        }, 
        {
            "index": 253, 
            "rating": "4", 
            "review": "Lovely garden; Japanese restaurant even better. Our rented studio in Palermo Hollywood was within walking distance of the park where we discovered the Japanese Garden. Being from Portland, OR where it boasts one of the best in the country, I was pleasantly surprised to find this lovely garden, ideal for a leisurely stroll with a stop at the Japanese restaurant in the park. The food was excellent and I enjoyed the sashimi and deep-fried ice cream that was highly recommended by the Argentine couple sitting at the next table. It was fun to practice our Spanish and for the couple to practice their English. A lovely day in the park and meeting this lovely couple added to our memorable experience in Buenos Aires."
        }, 
        {
            "index": 254, 
            "rating": "3", 
            "review": "Nice place to go on a sunny day, the restaurant is good but expensive for the quality of the food they serve. Gardens are well maintained and very nice organized. On weekends gets very crowded therefore is advisable to go during the week"
        }, 
        {
            "index": 255, 
            "rating": "3", 
            "review": "Distinctly average. If you've been to the amazing Japanese garden in San Francisco, this is a very very poor relation. That said, it's quite a pleasant place to spend an hour or so if you just want to have a quiet time. I certainly wouldn't make a special trip to see it."
        }, 
        {
            "index": 256, 
            "rating": "5", 
            "review": "Probably one of the most beautiful and peaceful places in BA. Hidden in between two of the busiest avenues in Buenos Aires is the Japanese Garden. Forget the location, it's peaceful and quiet and full of soul. Perfect spot to sit down and enjoy the sun on a spring or summer day while reading your book. You can always have a small break and enjoy a Japanese tea at the tea rooms, or go a little bit later and enjoy an amazing Japanese meal at the restaurant. The kids will love feeding the fish."
        }, 
        {
            "index": 257, 
            "rating": "4", 
            "review": "Peaceful Place!. Great stop for a quick visit. Got some yummy japanese ice cream as a snack. Good for pictures and just relaxing. The sushi restaurant is supposed to be the best in Buenos Aires."
        }, 
        {
            "index": 258, 
            "rating": "5", 
            "review": "transported to Japan. The gardens are lovely, with lots of fish to feed and the greenhouse has beautiful plants including bonsai. Don'd miss having a meal at the very authentic Japanese restaurant on the premises."
        }, 
        {
            "index": 259, 
            "rating": "4", 
            "review": "A corner of peace and asian taste in the heart of Buenos Aires. The Japanese Garden is a good representation of a Japanese garden that could be found in Tokio. Although small in size, gives the visitor a good idea of the style and views of Japanese Gardens. There are nice exhibitions from time to time."
        }, 
        {
            "index": 260, 
            "rating": "2", 
            "review": "Was hoping for more . We walked out to see the gardens. Nice enough but small and very open to the streets and flats around it. Ok if you are near or very keen but not sure I would bother again."
        }, 
        {
            "index": 261, 
            "rating": "4", 
            "review": "Small. The restaurant is the nicest feature. The Japenese garden is nice but very small. There is however a very good Japanese restaurant that makes it worthwhile to visit. Do take into account that there is a 50 pesos per person entrance fee that you will have to pay even if you only want to visit the restaurant."
        }, 
        {
            "index": 262, 
            "rating": "5", 
            "review": "Beautiful garden best sushi. I can spend here whole day. Nice relaxing. Very beautiful. Amazing restaurant. Don't forget your camera. A piece of Japan in the middle of Argentina"
        }, 
        {
            "index": 263, 
            "rating": "3", 
            "review": "Nice please but not very big. I like all the Japanese culture and this place is a tiny representation of it.Two things that I didn't like were that there is a lot of people walking around, a lot of kids also yelling and running around, so if you wanna be there sitting and relaxing for a little bit this is not the place to do it.The place is also tiny and the park benches are all the time occupied due to the amount of people that go there, so it was difficult to find a place to sit down.The only thing I like is that is a tiny piece of japan's culture."
        }, 
        {
            "index": 264, 
            "rating": "2", 
            "review": "Not really worth the detour. This is an admittedly nicely maintained Japanese-like garden, but very full on week-ends and with really not much to see unless you're fond of ugly large koi fishes or families with multiple kids. Entry expensive (for what it is). You'll be better of walking in the surrounding nice and free public parks."
        }, 
        {
            "index": 265, 
            "rating": "3", 
            "review": "beautiful gardens. get lost in he japanese garden, watch the fish, buy yourself a bonsai trees or just enjoy in spring the beautiful diversity of flowers."
        }, 
        {
            "index": 266, 
            "rating": "5", 
            "review": "A tranquil sanctuary in a busy city. We visited the garden on the final day of a recent visit to Buenos Aires. After the fairly hectic pace of city life during the preceding three days, the garden provided the perfect opportunity to sit and relax in beautiful and calm surroundings and reflect on our fantastic stay in BA.The garden is so well laid out with typical Japanese attention to detail and it is horticulture at its very best. We spent almost 3 hours both exploring the garden and sitting in quiet contemplation. A perfect ending to a wonderful holiday."
        }, 
        {
            "index": 267, 
            "rating": "5", 
            "review": "Tranquil respite from busy BA. This wonderfully groomed garden has been one of the highlights of our trip to Buenos Aires. It's so serene and peaceful. In traditional Japanese style, the gardens are expertly staged for beautiful vistas at every turn. The ponds are full of colorful coi that happily meander right up to the banks in search of food. For the nostalgic and history buffs, there are a few tree species that that been preserved from Japan after the Hiroshima bombings. You can walk the gardens in an hour without trouble. It costs 50 pesos per person at the time of this writing. We got a bit hungry from the walk and randomly stepped into the Japanese Garden sushi restaurant. While pricey, the fish was outstanding: fresh, tender, and full of clean flavors (not at all fishy). I'm a sushi snob and can confidently state that the fish rivaled the quality we regularly get in NYC."
        }, 
        {
            "index": 268, 
            "rating": "5", 
            "review": "Jardin Japones. If near Palermo district in Buenos Aires you will have to go and see Jardin Japones - the Japanese Garden! The entrance fee is 50 pesos and even in a cloudy day like when I visited, the place was quite crowded. The perfect harmony between nature, fish, birds and humans will impress you for sure, and make your day and unforgettable one. Enjoy!"
        }, 
        {
            "index": 269, 
            "rating": "2", 
            "review": "Noisy and scale/ proportions wrong. Cars roaring past on two of the busiest roads in BA and a pack of dogs barking outside the gardens for the whole of our visit meant the garden was not at all peaceful.I lived in Japan and this garden was not recognisable to me as a Japanese garden. The scale and proportions were wrong and only a cursory nod to the elements to include but no thought on how to bring them together."
        }, 
        {
            "index": 270, 
            "rating": "5", 
            "review": "Stunning. Stunning garden, very well designed and impecable maintainance. Entrance costs 50 pesos. In the surroundings there are plazas and public gardens, just wonderful."
        }, 
        {
            "index": 271, 
            "rating": "5", 
            "review": "A piece of Japan in Buenos Aires. I love this place. Walking the garden is very relaxing, the cafeteria serves some japanese sweets, and they have an auditorium which I had the chance to visit when attending a business event. The gift shop offers a variety of souvenirs for every budget, and they also have workshops for Japanese crafts"
        }, 
        {
            "index": 272, 
            "rating": "4", 
            "review": "beaituful peaceful retreat in the heart of all the noise. peaceful, quiet, and very well maintained and organized location. there is a small entry fee but this is justified because clearly there is a lot of maintanance done on this garden. well worth a visit to rest your feet after exploring palermo"
        }, 
        {
            "index": 273, 
            "rating": "5", 
            "review": "Lovely!. I took soooo many photos of this place! It´s really wonderful how was designed and they take care about this place. I went a sunny day and wow! I could have stayed for sooo long,chilling peacefully!"
        }, 
        {
            "index": 274, 
            "rating": "5", 
            "review": "Very nice break. Before coming to Buenos Aires, we tried to chose between Tokio and BA, and we decided to go BA. After seeing this place in the middle of the city, we did not want to miss it and, to some extent, it we saw Tokio, too :D The entrance fee is 50 peso, which is quite fair, and you can spend 1.5-2 hours in this garden. For photographers, you can catch lots of beautiful scenes. Come prepared."
        }, 
        {
            "index": 275, 
            "rating": "5", 
            "review": "Lovely place. This is a lovely place well in reach of Jorge Newbery airport, and if you like walking as much as I do, you can even leave your bags in the airport and wander to that place, enjoying Buenos Aires, as I did.Its beautiful, and you can feed the fishes buying fish food right there - its funny to serve the pigeons too. Theres a nice restaurant serving sushi inside the park complex."
        }, 
        {
            "index": 276, 
            "rating": "5", 
            "review": "Loved this place. Loved this place really liked the restaurant special plates and helado frito is my favorite dessert I recommend it to all my friends thank you very much"
        }, 
        {
            "index": 277, 
            "rating": "4", 
            "review": "Beatiful. 50 pesos charge. Was worth the money tho. Well kept garden, beautiful flowers, obese carps. They are fun to watch, as are birds fishing! Overall a fun stroll."
        }, 
        {
            "index": 278, 
            "rating": "4", 
            "review": "Japanese Beauty in the heart of BA!. Incredible garden in the heart of Buenos Aires. It costs about Ar$50 per person to get in, so plan for that as it is not free like the oher botanical gardens close by. The garden is well worth the visit is you are in BA."
        }, 
        {
            "index": 279, 
            "rating": "5", 
            "review": "Wonderful. Very well taken taken care of and beautiful at every sense. I spent a half day and there could not get enough. Alao try the restaurant it is amazing"
        }, 
        {
            "index": 280, 
            "rating": "5", 
            "review": "Amazing juxtaposition against the urban mammoth. Beautiful and relaxing. Cheap entrance fee to experience a very unique experience. Unique in the sense of this being the largest true Japanese garden outside of Japan and visited by Japanese royalty every now and then."
        }, 
        {
            "index": 281, 
            "rating": "3", 
            "review": "Not for the people who saw Japan. It is quite simple. If you have not been to Japanese Gardens in Japan, you will like this place. Cozy, clean, refreshing and they have a nice restaurant, however if you have been in Japan and visited the gardens over there, you will see an average imitation of the real ones. So it really depends on the past experience. The cookies that are sold in the garden shop are delicious though."
        }, 
        {
            "index": 282, 
            "rating": "4", 
            "review": "Stunning Japanese Garden. There is an entrance fee but it is well worth it. The gardens are very tranquil and pleasant. We especially loved the date planted with grass. This garden is wonderful for photography and makes a change from the huge city blocks.There is also a nursery section for locals to buy plants.Highly recommended!"
        }, 
        {
            "index": 283, 
            "rating": "5", 
            "review": "A piece of Japan in Buenos Aires. Adorable place to walk, relax, feel peace and meditate, or to enjoy some of the numerous activities promoted by the Association."
        }, 
        {
            "index": 284, 
            "rating": "5", 
            "review": "Peaceful Place. Went there with friends and family. Japanese Garden was very relaxing and peaceful. Attractions were very nice."
        }, 
        {
            "index": 285, 
            "rating": "4", 
            "review": "Looks pretty.. The Japanese garden in Palermo, Buenos Aires are a feast for the eyes. It is wonderfully aesthetic, creatively laid out, and I highly recommend going. It is open to 18.00 in the afternoon and cost 50 peso. Inside there is a Japanese restaurant, that looks good. Kind of expensive, and I have not tried it, so I can't vouch for the quality. The only thing I missed was areas to sit for longer periods. The benches were not really comfortable."
        }, 
        {
            "index": 286, 
            "rating": "3", 
            "review": "Nice but overpriced.. Nice place to relax after an afternoon walking around the city, but I don't think there is enough to see to justify the 50 pesos entry fee."
        }, 
        {
            "index": 287, 
            "rating": "3", 
            "review": "OK. The water is very green, but there are a lot of giant fish and birds. If you have a lot of time in the city, pay a visit. If not, there are a ton of other better things to see."
        }, 
        {
            "index": 288, 
            "rating": "5", 
            "review": "Beautiful Japanese Culture in the heart of Buenos Aires. I used to go here when I was a little kid to feed the Koi... I went back here just this past year after 25 years and it was just like I remembered it as a little kid. Great place to spend a few hours and walk around with family, by yourself or a significant other. Go to the back building and spend $1 to buy a bag of Fish Food, it's a great time and it holds a place in my heart forever."
        }, 
        {
            "index": 289, 
            "rating": "5", 
            "review": "Take a break. If you enjoy culture and nature you can’t miss this Japanese Garden. Experience a sunny morning in this rich and harmonious Japanese design. Sit on a bench by the lake, read a book, or simply breath in the fresh air."
        }, 
        {
            "index": 290, 
            "rating": "4", 
            "review": "Very nice japanese garden, well built and maintained!. Besides the Japanese Garden being a very well built and maintained garden, the surrounding areas also offer parks and activities (planetarium galileu galiei, zoo, etc) to spend a cool and calm day in Buenos Aires. Recommended for groups, couples or alone (make sure you set a nice playlist for the day)."
        }, 
        {
            "index": 291, 
            "rating": "4", 
            "review": "Calm garden in the busy city. Spend some time enjoying the Koi, monuments, vegetation, art and the Japanese bell. Too bad we cannot all ring it. And don't forget to feed the fish."
        }, 
        {
            "index": 292, 
            "rating": "5", 
            "review": "A perfect little spot. It is not a big place, but it got so many nice things that you wanna take your time admiring them. Totally worth it. They usually also got different activities (such as expos, Gardening Workshop.. )"
        }, 
        {
            "index": 293, 
            "rating": "4", 
            "review": "Nice and quiet. While its only walking distance from a major road, the zoo and the planetarium it is quiet and calm! My daughter loved walking around looking at all the giant Koi fish, traveling across the bridges and looking at the waterfall. My husband and I enjoyed looking at all the Bonzi trees and strolling through on a sunny day! It is stroller friendly for those with small children, the paths are wide and accessible. You can purchase food to feed the Koi which is a hit with most small children!A nice retreat from a busy day in the city!Warning: only restaurant near by is in the park so either pack a lunch, eat at the park or go for a walk around the city!"
        }, 
        {
            "index": 294, 
            "rating": "4", 
            "review": "Take a book and chill. Overwhelmed with the hustle and bustle of BA. These gardens provide a great sanctuary. Peace and tranquility."
        }, 
        {
            "index": 295, 
            "rating": "5", 
            "review": "One lovely place. If you want to walk in a peaceful place. This is your place. you can spend hours without noticing. After you stay there for a while, you have some inner peace that you never notice before."
        }, 
        {
            "index": 296, 
            "rating": "5", 
            "review": "PEACE WITHIN THE CITY. This is an amazing place inside Buenos Aires. When you visit it, it feels like you are not in the city anymore. There is a variety of plants, trees, birds and fish. The Bonsai trees and the sculptures contribute to create an amazing environment. There is alsoo good food and people can find different courses including Japanese language and origami. There is a little store where you can buy souvenirs and snacks."
        }, 
        {
            "index": 297, 
            "rating": "5", 
            "review": "Peaceful and relaxing!. It's beautiful to go any time, but if you can go in the morning, DO IT!Very calm and peaceful to walk along the river and take pictures.The last time I go there I've payed $50 - per person."
        }, 
        {
            "index": 298, 
            "rating": "4", 
            "review": "Nice, even in the winter. This is a lovely place to stroll through. We enjoyed a Japanese tea after. Although we were there before dinner, the suishi preparations looked promising!"
        }, 
        {
            "index": 299, 
            "rating": "1", 
            "review": "japanse gardens not well kept. this used to be a nice promenade, however it is now pretty abandoned, there is a pathetic cafeteria inside, very unispiring place"
        }, 
        {
            "index": 300, 
            "rating": "5", 
            "review": "Peaceful place. My family really enjoyed visiting the Japanese garden, with its quaint bridges and islands. It is a place to escape from the noise and traffic."
        }, 
        {
            "index": 301, 
            "rating": "2", 
            "review": "don't bother. I am a garden fan and have been lucky enough to visit Japan several times and see many beautiful gardens there. I have also visited quite a few Japanese gardens in other countries including a couple close to Brisbane Australia where I live - this one would be near the bottom of my list! To me it had a \"Disney' feel and no soul. What more can I say? I know others have liked it, perhaps they have not seen many Japanese gardens?"
        }, 
        {
            "index": 302, 
            "rating": "5", 
            "review": "the island of tranquility in the middle of modern city. for the lovers of Japanese culture is the island of Japan spirit in the huge city of Buenos Aires, that is actually far from the Land of the rising sun."
        }, 
        {
            "index": 303, 
            "rating": "1", 
            "review": "not woth it. the garden is not maintain and let to nature. not much to see there and should be removed from the place to visit."
        }, 
        {
            "index": 304, 
            "rating": "3", 
            "review": "Far away. Far from town. Had to pay to get into the garden. It small and hard to spend more than an hour there. As it is a long away from town I would not go again."
        }, 
        {
            "index": 305, 
            "rating": "5", 
            "review": "Mini Japan. I've been in Japan and although its obviously not the same, you really feel like you are somewhere else than this country. A really silent, quiet and peacefull place."
        }, 
        {
            "index": 306, 
            "rating": "4", 
            "review": "Visit also the delta with the river islands. In spring time Escobar is the flower city of Argentina, you can visit the exposition, is 40 km from Buenos Aires, also the zoo in a natural place,"
        }, 
        {
            "index": 307, 
            "rating": "5", 
            "review": "Beautiful and peaceful getaway. Totally worth relaxing one or two of hours in this oasis in the middle of a city that literally never sleeps, specially if you can avoid weekend crowds."
        }, 
        {
            "index": 308, 
            "rating": "4", 
            "review": "Beautiful gardens. We enjoyed the gardens along with the coit fish in the ponds. The gardens have different oriental plants and trees. It also has a nice oriental bridge that you can cross. It is a nice garden to visit and spend time to enjoy."
        }, 
        {
            "index": 309, 
            "rating": "5", 
            "review": "Beautiful!!!!. I love to go there! Just look at the pictures and you can see that it's gorgeous. It's not free but it's not expensive (around 5 dollars)."
        }, 
        {
            "index": 310, 
            "rating": "5", 
            "review": "Different! A must!. This place is both beautiful and peaceful. I enjoyed it tremendously, the admission is $50 pesos which isn't bad at all."
        }, 
        {
            "index": 311, 
            "rating": "5", 
            "review": "Peace and armony in the middle of the city. The gardens are so beautiful. We got our names drawn by a Japanese girl. We watch a judo exhibitions. Some girls passed by with their kimonos for a tea ceremony. A learning experience for mi kids of a glorious ancient culture. We loved it!!!"
        }, 
        {
            "index": 312, 
            "rating": "5", 
            "review": "Beautiful and Serene!. Just a delightful and beautiful piece of quite in the midst of a exciting city! A perfect place to come and relax and regroup before heading off to your next adventure! Very well kept and maintained with places to sit and enjoy the view."
        }, 
        {
            "index": 313, 
            "rating": "3", 
            "review": "Fine for two hours,but nothing extraordinary. The Japanese garden is certainly a pleasant enough place to visit,but I can't say that it's anything extraordinary.There are many other gardens in the world which are more beautiful."
        }, 
        {
            "index": 314, 
            "rating": "3", 
            "review": "Was it worth it?. I'm not sure. We spent some time sitting in the garden which was lovely but it's really small when we walked about. I don't see it as a great example of a Japanese garden and we might well of had just the same experience."
        }, 
        {
            "index": 315, 
            "rating": "4", 
            "review": "Nice garden, but rather crowded on the weekend. Nice garden and quite expansive, considering the location. Walking paths around ponds, over bridges to little islands. Admission fee seemed rather expensive, and the ambience was perhaps spoilt by the number of people present (we visited on a weekend). Welcome break from the hot, dry city."
        }, 
        {
            "index": 316, 
            "rating": "5", 
            "review": "Exquisite!. Do not miss this garden! Totally gorgeous! Lots of photo opportunities and beautiful water spaces! To add to the fun, there is a very fun gift shop!"
        }, 
        {
            "index": 317, 
            "rating": "4", 
            "review": "Delightful. The last time we walked through the Gardens was at the end of 2008. Motivating us today was the beginning of an exhibit of Japanese kimonos that is only going to be on view until May 3rd.We thoroughly appreciated the japanese prints on the stairway leading to the Gallery of kimonos....and enjoyed them also. Making the visit more appreciated was the conversation we had we with Carola, a great employee and fun person.On our way out, Leonardo struck up a conversation with us. He is studying japanese 7 hours /day and his English was not bad either. We exchanged email addresses.As in 2008, we responded to the \"feel\" of Japan. We spent time in Japan in the early 1970's. The trees, the island, the carp in the water and the bridges all add to the ambience. AND the temps were perfect on this sunny day."
        }, 
        {
            "index": 318, 
            "rating": "5", 
            "review": "Spectacular views. The Japanese garden has spectacular views, the landscape is incredible. It is a nice tribute to the japanese - argentinian community."
        }, 
        {
            "index": 319, 
            "rating": "4", 
            "review": "a wonderful garden inside the Bosques de Palermo. One of the world's nicest Japanese gardens outside Japan, it offers a beautiful scenery with trees, ponds, fishes.You can eat inside as well."
        }, 
        {
            "index": 320, 
            "rating": "4", 
            "review": "Amazing. Really awesome garden, you are suddenly in Japan. The staff is Japanese, the shops sell Japanese stuff and you can also go to the restaurant inside the garden. The food is expensive and is not authentic."
        }, 
        {
            "index": 321, 
            "rating": "4", 
            "review": "Japan comes to South America. I love visiting Japanese Gardens and would say this was a nice one. Only thing spoiling it was the modern high rises nearby. Which I liked in themselves, but takes you away form the sereneness of this garden. There are several water areas and bridges. One bridge even leads to a little island which is especially popular with kids to climb up. Nice landscaping and beautiful year around. I like that when I'm here, people are actually generally quiet and respectful of the calm intent of these gardens."
        }, 
        {
            "index": 322, 
            "rating": "4", 
            "review": "Better when the Japanese embassy ran it1. A calm and beautiful Japanese garden, with a large pond full of multicoloured carp. There is a restaurant, not very Japanese, much more fusion, not cheat, and no¡t worth a visit. There are many people walking around, specially the days entrance is free. Since it is no longer run by the Japanese Embassy. It is more commercial, more places for coffee, tea and snacks. More and less delightful bonzai (dwarf trees) for sale. I still like to walk around at the less crowded times - early or late."
        }, 
        {
            "index": 323, 
            "rating": "5", 
            "review": "An Oasis of Tranquility in the City. Very nice and well maintained Japanese garden where you can spend a couple of hours relaxing and appreciating nature."
        }, 
        {
            "index": 324, 
            "rating": "4", 
            "review": "A Little Bit of Japan in Buenos Aires. A beautifully kept and well designed garden with koi ponds, japanese bridge and a restaurant where you can get sushi. We went during a special 3 day festival which included taiko drummers, music, martial arts displays, and an art show of delicate watercolors. Seniors can enter the gardens for free. They also have a nursery where you can buy plants and herbs at reasonable prices. A worthwhile visit on the way to the MALBA art museum."
        }, 
        {
            "index": 325, 
            "rating": "4", 
            "review": "Charming Japanese Gardens meets South America. This is a charming garden filled with Japanese Bonsai trees and Koi ponds. They have photo ready scenery and a lovely Japanese Restaurant on the property. I live on the west coast, so I am partial to our lovely gardens that flourishes in our climate, but if you don't have access to Japanese inspired gardens, the this is as close as you can get. They have snacks carts that are available too if you get hungry and thirsty."
        }, 
        {
            "index": 326, 
            "rating": "4", 
            "review": "A must in Buenos Aires. This small well-preserved garden is a good choice if you are looking for a quiet and nice place before lunch. You can hire a bicycle at the design shopping in Plaza Francia and ride across all the parks to there ( there is a cycle path all the way down). The restaurant inside is a good choice too, all sushi is so good and pretty affordable."
        }, 
        {
            "index": 327, 
            "rating": "3", 
            "review": "Well maintained Garden. This is the one of the good places to visit in BA. Unfortunately, the charges are very high as compare to the area of the garden and the kind of attractions they have inside. If you like to visit gardens, then you will love it for sure."
        }, 
        {
            "index": 328, 
            "rating": "5", 
            "review": "Peaceful Oasis. We went on a Tuesday, knowing that the entrance would be free.The lady at the ticket office charged us anyway. I mentioned that I thought it was free on Tuesdays so she asked for our ages, we are seniors so she let us in free.The Garden itself is very beautiful. It is not big but just beautiful and peaceful with lots of Japanese trees and flowers and bonsai. Some are also for sale. Very clean. There is a Japanese restaurant on the grounds where you can have lunch.If you have time don't miss it."
        }, 
        {
            "index": 329, 
            "rating": "2", 
            "review": "Not great. We haven been to Japan last year and I will not compare it to the wabi-sabi quality over there, but I have also visited Portland's Japanese Gardens which were way nicer. There were plastic bags in the pond, the grass was not cut well and not really a high diversity. It definetly lacks the Japanese refinements and for 50 pesos i expected a nicer kept garden.."
        }, 
        {
            "index": 330, 
            "rating": "1", 
            "review": "Not a big fan. There are so many special, uniquely Argentine places to go in BA that I consider a visit here a wasit of time and money. It isn;t very big, and not very interesting. Go to Rosedahl down the road, for free, and see not only a gorgeous roase garden, but also portenos doing their thing."
        }, 
        {
            "index": 331, 
            "rating": "3", 
            "review": "Quiet & peaceful oasis; lovely gardens. Lovely Japanese gardens, though not particularly large. We visited for an opportunity to take a break from walking in the Recoleta neighborhood. Many benches provided the perfect place to rest. The restaurant serves only Japanese food, but there are a few carts serving ice cream and cold drinks. It seemed a bit pricey for the size of the gardens."
        }, 
        {
            "index": 332, 
            "rating": "4", 
            "review": "Very serene and calming. This was a part of a visit to the Botanical gardens. The care and maintenance of these Japanese gardens stand out and give the visitor a feeling for that country's skill in using Nature to create an atmosphere. The various walkways led to hidden delights. Well worth the effort."
        }, 
        {
            "index": 333, 
            "rating": "4", 
            "review": "Quiete and nice place. This is a nice and organized place. Quite interesting and beautiful to see! I just thought it could be a little bigger. Still is a nice place to see."
        }, 
        {
            "index": 334, 
            "rating": "5", 
            "review": "Great day and night.. Great park and is amazingly well kept. I think it is cleaner than most parks in Paris. The park has a 2-mile track around the outside and is full of locals running, roller-skating, walking, or riding bikes all day long. It is a prime spot to take a run anything during the day. Take a few hours to walk around and relax. Great island in the middle the city."
        }, 
        {
            "index": 335, 
            "rating": "4", 
            "review": "A little oasis. These historical gardens are well worth a look round if you're in this area of Buenos Aries. They are a delightful interlude, and close to the zoo, planetarium and other attractions. The entrance fee is only about £1.50.Recommended."
        }, 
        {
            "index": 336, 
            "rating": "5", 
            "review": "Small is beautiful. What a delight! The garden was introduced to us on a walking tour of the city and we just had to return. Whilst not large in area there is plenty to while away a peaceful hour in the midst of the bustling traffic. The lake is full of koi carp who obviously know that food is available to tourists to feed them with and there are several interesting monuments around the garden. The restaurant looked good but we did not have time to check it out for ourselves. An amazing collection of bonsai trees was available in the little nursery shop - what a shame we couldn't bring one home!"
        }, 
        {
            "index": 337, 
            "rating": "5", 
            "review": "Great with young kids. Beautiful Japanese Gardens in downtown Buenos Aires.It is closeby the city center along the Libertador, next to Rosedal Park.It is worth the visit..My kids loved to feed the Huge fish in the ponds had a great time.Parking is a hassle as you have to park in the street so if you can go by taxi or better remis."
        }, 
        {
            "index": 338, 
            "rating": "5", 
            "review": "excellent. very nice , a place to visit when you are in Palermo, the restaurant with very sushi , the view from the restaurant is fantastic , you feel you are in Japan"
        }, 
        {
            "index": 339, 
            "rating": "5", 
            "review": "A Beautiful Green space in the hustle bustle of a great city. Despite the fact that it wasn't free, the visit to this garden was a very pleasant one. Tranquility reigns supreme. And the simplicity of the space is not lost on us city dwellers. The grounds are well kept, clean of litter, and well manicured. And all the classic elements of a Japanese garden are there to bring serenity and joy."
        }, 
        {
            "index": 340, 
            "rating": "4", 
            "review": "Much better than Jardin Botanico. I thought these gardens were much prettier, better kept up than the Jardin Botanico a few blocks away. Of course, here you had to pay 50AR while the other was free. There is a little section of Bonsai plants for sale. I was a little disappointed there was no discussion of Japanese gardens symbolism/formatting in any language. Restaurant was closed for vacation but should be reopening shortly. BTW, we walked from our hotel. There were absolutely no signs showing he way to these gardens but we were easily able to ski/ get directions. Worth a 1 hour or so trip if you have time."
        }, 
        {
            "index": 341, 
            "rating": "2", 
            "review": "Nothing impressive. It is somehow nice, but nothing impressive. We have been there only because we were waiting the opening of Malba. Gardeners were working at the same time of the visit (this seems a bad management evidence for me) and the noise was quite disturbing."
        }, 
        {
            "index": 342, 
            "rating": "3", 
            "review": "Noisy Japanese selfie garden. S34°34.450' W°24.568' the tranquillity of this Japanese garden is totally overshadowed by the electronic shutter sounds of tourists and traffic and airplane noise. People visit to have their photos taken or with only virtual friends use a camera extension pole. The beauty of the garden is unimportant to them. Although beautiful sculptured with almost all iconic Japanese garden inventory, we could not find the Zen pebble garden, the public and the surrounding blocked any appreciation of the beauty of this garden in January 2015. The visiting Japanese Imperial family probably agreed. To admire the real thing fully and quietly, take an airplane to Kyoto. Entrance to the garden for foreign visitors is not free anymore: 32 pesos."
        }, 
        {
            "index": 343, 
            "rating": "5", 
            "review": "The most relaxing place. It was my third time in the Japanese Garden and it's still one of my favourite places in Buenos Aires. It's perfect for anyone who likes Japanese culture. It is beautifull and really relaxing. You can just enjoy the view drinking tea or having an ice cream. They always have some sort of exposition in the Garden too. My brother is a photographer and he took his best pictures there, so it's just the best place to admire the landscape, specially if you have a sunny day."
        }, 
        {
            "index": 344, 
            "rating": "5", 
            "review": "An oasis of calm in this bustling metropolis. Despite the presence of busy roads on two sides of the garden, there are plenty places where you can sit and take in the formal beauty of this wonderful garden. Centred around a small, rather murky lake, the meandering paths through the formal gardens open up new views at every turn. If you are visiting MALBA, take the time to visit this garden which is only a short walk away. There is a rather elegant restaurant in the garden and a tea house but there was not time on this visit to sample either."
        }, 
        {
            "index": 345, 
            "rating": "4", 
            "review": "Would be a 5 if better maintained. Beautiful garden for a walk, but it's not well maintained. There were two buildings that were boarded up and had someone's laundry hanging out to dry (?). There are so many plazas in buenos aires that this may not be worth it comparatively"
        }, 
        {
            "index": 346, 
            "rating": "3", 
            "review": "Beautiful garden in the middle of a noisy avenue . The garden was nice, well organized but i could not feel a very quiet place as I expected from that kind of garden.If you are in the area and have some time is a nice place to visit to. The price was 32 pesos argentinos at the time that i was there."
        }, 
        {
            "index": 347, 
            "rating": "2", 
            "review": "Harmless, but free parks are better ....they're free!. Paid about £3 each to enter this small and disappointing park. What did we see - a dozen carp in a grubby pond, a japanese bridge in desperate need of a re-paint and a few dozen people wandering around trying to find what they had paid their money for. A safe haven from the crooks that spoil this city, but apart from that it was pointless."
        }, 
        {
            "index": 348, 
            "rating": "4", 
            "review": "A quiet refuge. Having spent a couple of days in the bustle of BA, it was nice to visit the gardens. Surrounded with traffic and activity, the area seems to drain the stress right out of you. It was nice to sit quietly on a bench and enjoy the Japanese vegetation and waters. It is a nice refuge, if you're wanting to take a break from the tourist pace."
        }, 
        {
            "index": 349, 
            "rating": "2", 
            "review": "Meh. I think my subject line summed it up but I need 100 words. It costs about 3-4 USD per person and it's very blah. I've been to a number of Japanese Gardens around the world and this one is sub par. The rose garden nearby is free and much nicer. Or just the public park next to it is nicer with large leafy trees and grass. So I would skip this place."
        }, 
        {
            "index": 350, 
            "rating": "3", 
            "review": "Small Japanese garden in the middle of BA. This garden is pretty small but well maintained. It's a good respite from the din of the city around it, though I wouldn't characterize it as a \"must see\" in BA. It's fairly small, a little uninteresting, and surrounded by much more interesting museums and sights. Although cheap (32 pesos pp) you can walk through it in about 15 minutes. If you're looking for a spot to sit and think or read a book then this is a good spot, otherwise I'd skip it. Also, the restaurant in the park is very tasty but horribly overpriced."
        }, 
        {
            "index": 351, 
            "rating": "5", 
            "review": "Great reflections on a sunny day. Japanese Garden was built by the Japanese embassy in the late 1960s.Nice stroll around ponds,gardens and the tea house.Options for food ,drink and souveniers.Cost is 40 pesos for adults and senior citizens are free.Taxi fare from city center(martin square) is 40 pesos each way.Time spent in the park will be between 40 minutes to an hour. Best pictures are from the north section of the park(skyline and garden reflection in the pond)The red reflections of the bridge are best photographed walking from the north point on the wooden bridge in the central pond.This park can be combined with the other nearby parks in the area.Nearby metro stop."
        }, 
        {
            "index": 352, 
            "rating": "4", 
            "review": "A calm oasis in a busy city. Lovely gardens to walk around on a sunny day. A truly peaceful and attractive environment close to the Museum of Latin American Arts."
        }, 
        {
            "index": 353, 
            "rating": "4", 
            "review": "One place to visit in Buenos Aires. The garden is very quiet, relax and peaceful, you see animals (ducks and very big fishes), trees, a peace bell and architectural beautiful. If you love the japanese food you can find a restaurant too."
        }, 
        {
            "index": 354, 
            "rating": "3", 
            "review": "Nice for a walk and a break from the noise. An unremarkable Japanese garden in the middle of a busy city. Its nicely groomed, yet not too interesting. A good place for taking a break from the noise and craziness of BAs streets."
        }, 
        {
            "index": 355, 
            "rating": "4", 
            "review": "Nice 1 Hour Stroll on a Sunny Day. Typical, albeit it small, beautiful Japanese garden within the city. It is a wonderful way to pass an hour walking around on a sunny day (again, very small, so I don't think you'd spend much more time than an hour here). Small admission fee along with small parking fee if you park on the street out front. Seniors are discounted, so show your ID. Grounds are in good condition and well kept. Overpriced, fancy restaurant on the grounds, small gift shop with low quality trinkets and small ice cream stands for a cool snack on a hot day. Not a must see for tourists, but an enjoyable stop nonetheless."
        }, 
        {
            "index": 356, 
            "rating": "5", 
            "review": "Oasis of Tranquillity. Beautiful gardens in the north-west of Buenos Aires. An oasis of tranquillity and a photographers delight. There is an admission charge but if you are a 'senior citizen' with documentary proof then it is free!"
        }, 
        {
            "index": 357, 
            "rating": "2", 
            "review": "Can be skipped. Not that new or different from others that I have seen. Does not hold a candle to one in SF, ca. Not well kept up lots of dead and dieing plants."
        }, 
        {
            "index": 358, 
            "rating": "5", 
            "review": "Great place to relax. This is a beautiful place, a little quiet oasis in the middle of big city. We enjoyed walk around a little lake, flowers, bonsais, trees, statues, everything. The atmosphere was so calming that I even had a little nap on bench. Totally recommended!"
        }, 
        {
            "index": 359, 
            "rating": "5", 
            "review": "a must!. absolutely adorable and a special place to spend a couple of hours, or more, relaxing and soaking in the beauty."
        }, 
        {
            "index": 360, 
            "rating": "4", 
            "review": "Nice place. Big and spacious, best time to go is by lunch time. The garden is full of Japanese trees and there is a big pond with enormous koi carps. Admission is 40 Argentinian pesos, which it's well worth it."
        }, 
        {
            "index": 361, 
            "rating": "5", 
            "review": "Peaceful. This was a beautiful and peaceful escape from frenetic Buenos Aires on more than one occasion. In addition to the classic Japanese gardens themselves, there's a very nice Japanese restaurant."
        }, 
        {
            "index": 362, 
            "rating": "5", 
            "review": "Bliss. The Japanese Garden offers a blissful retreat from the noise and traffic of .BA, where one can re-charge batteries. It also has a lovely restaurant."
        }, 
        {
            "index": 363, 
            "rating": "5", 
            "review": "Peaceful place. It´s my second time in beautiful Buenos Aires, and I had to come back to this beautiful japanese Garden, it´s a very beautiful place for you to recharge your batteries, take pictures, or just take a walk around. I love this place!"
        }, 
        {
            "index": 364, 
            "rating": "3", 
            "review": "Do Not Eat Sushi Here. Gardens are nice to walk around and enjoy a beautiful day. The sushi restaurant is awful however. It was the worst sushi of my life, hands down."
        }, 
        {
            "index": 365, 
            "rating": "5", 
            "review": "Quite lovely. Not the biggest garden but very pretty with lots of features; very popular with locals and tourists allke. Looked beautiful in the sunshine. A lovely oasis in the big city!"
        }, 
        {
            "index": 366, 
            "rating": "3", 
            "review": "Small Well designed Garden but nothing special.. I went to The Japanese Gardens with a group of friends on our way to MALBA museum which is nearby. We found an small Garden Well designed where you can relax and eat some sushi ( there is a restaurant inside).\nOverall The Garden is nice but there are nothing special about it, nothing that could actually blow your mind."
        }, 
        {
            "index": 367, 
            "rating": "4", 
            "review": "Small, peaceful garden, a very relaxing spot!. We went here in August and there was not a lot blooming but the garden was still beautiful and tranquil. The garden is small- we were here less than a hour. The only thing to watch out for is the possibility of long lines to get in. We tried to go on a beautiful Monday afternoon that was a national holiday and the line to get in stretched around the block. We came back the next day and there were no lines. I don't if this was normal but something to keep in mind if you are thinking on going on a weekend or holiday."
        }, 
        {
            "index": 368, 
            "rating": "4", 
            "review": "A relaxing place to. Best to go in the summer/autumn in Buenos Aires.. We enjoyed a chilled walk around the Japanese garden. It was end of winter in August and so there were not many flowers blooming. The garden is kept well and there are some lovely features (the red bridge, a water-walkway and some nice routes). It takes less than 30 minutes to see. You can extend the visit by going to the adjoining restaurant with some very tasty Japanese specialities."
        }, 
        {
            "index": 369, 
            "rating": "5", 
            "review": "Beautiful gardens in central Buenos Aires. If possible choose a sunny day to visit. i was there with family from the United States on Sunday, it was a cloudy and windy day but everyone, specially the kids enjoyed the visit, watched the colored fishes and walked along the pathways and bridges. The place is very peaceful and quiet and on certain days there are special ceremonies, dances, drummers, sumo wrestlers. Entrance fee at the current exchange is less than 3 dollars."
        }, 
        {
            "index": 370, 
            "rating": "5", 
            "review": "Japan in Argentina. The Japanese Garden had all that could make it perfect: Cherry blossoms, a beautiful lake, a souvenir store... If you want to know your name in Japanese, check your luck or make a wish then, go there too. It was a bit crowded in the winter vacations, but there were no lines and we could walk freely and calmly. It is cheap to enter also."
        }, 
        {
            "index": 371, 
            "rating": "2", 
            "review": "Underwhelming. At one point this was supposedly the most impressive japanese garden outside of Japan- well not anymore! I do realize that BA has been in an economic crisis for quite some time, but what I saw here reminded me of my trip to China in '99. It tried hard to give the authentic vibe but it came off like a cheesy amusement park attraction and the ponds were filthy. There wasn't enough vegetation to give it an organic natural feel like a real Japanese garden and the use of asphalt walkways was an eyesore. I went to the Portland, OR Japanese Gardens the year before and that was amazing so you're definitely underwhelmed here. Since it was right by a bunch of major roads and is a relatively small place, you can't ever get out of your head you're in the middle of urban Buenos Aires in some run down faux Japanese Garden. The gift shop was also in poor taste- there was way too much anime and hello kitty and not enough traditional, classy gifts. They sold all these japanese junk food for kids such as melon ice pops and pocky but nothing truly authentic or worthwhile PS: no toilet paper in the bathrooms."
        }, 
        {
            "index": 372, 
            "rating": "2", 
            "review": "Nothing great about it. After visiting the malaba museum we went to the Japanese garden it was quite pricey , the entrance fee was 32 pesos per person and the garden though well maintained was not worth the entrance fee"
        }, 
        {
            "index": 373, 
            "rating": "4", 
            "review": "A short lovely walk. We had some time to spare before leaving and we decided to pay a visit, since we love gardens. It is small but well kept. We were there in the morning so there were just a few people, and we had a nice stroll."
        }, 
        {
            "index": 374, 
            "rating": "5", 
            "review": "Beautiful!. The japanese gardens are within walking distance from Bosque de Palermo. The gardens are quite beautiful and well-kept. It has many ponds full of carps. There´s a japanese restaurant inside. The gardens are well mantained by japanese immigrants and their descendants who live in buenos aires."
        }, 
        {
            "index": 375, 
            "rating": "4", 
            "review": "Beautiful!. It is a nice place to escape the crazy hustle and bustle of the busy streets in BsAs. Beautiful and tranquil."
        }, 
        {
            "index": 376, 
            "rating": "4", 
            "review": "Peaceful. Nice manicured Japanese garden in Buenos Aires city. The fact that the park charges an entrance fee, makes it more exclusive and secure. There is not much to do apart from enjoying the scenery. Children and adults alike will enjoy the garden bridges and the friendly carp fish. The restaurant is usually crowded, so organize your visit to 'taste\" this attraction in its full extension."
        }, 
        {
            "index": 377, 
            "rating": "5", 
            "review": "Beautiful Place to enjoy family time together. Beautiful setting. Ideal location for family outing away from city. Well laid out, bonsai trees, man made lake, greenhouse, rose garden, coyfishes and japanese resturant serving delicious meals.Nature at its very best."
        }, 
        {
            "index": 378, 
            "rating": "5", 
            "review": "Nice place to take pics!. This is a nice place to take pictures and to relax. Me and my wife really enjoyed the lake, where you can see really big carp fish! For those who like oriental/japoanese culture, this park is very amazing!!"
        }, 
        {
            "index": 379, 
            "rating": "3", 
            "review": "Disconnect with the big city. The garden is really nice. It's small yet interesting. Beautiful place to take pictures and enjoy and pleasant time. Nice break from the outside world."
        }, 
        {
            "index": 380, 
            "rating": "5", 
            "review": "Wonderful Gardens. We love Japanese gardens. This garden first opened in 1967 and was donated by the Japanese community to the city twelve years later. It is one of the largest gardens of its type in the World, outside of Japan. It was a typical Japanese garden in that it featured manicured lawns, ponds full of large koi, streams flowing slowly over rocks, wonderfully pruned shrubs and small trees. It was not, however, peaceful, as it was bordered on three sides by busy, multi-lane roads and on the fourth side another park that sounded as though it was filled with dogs, their barking varied and continuous. We spent about ninety minutes strolling around the park and admiring its composition. Japanese gardens are very photogenic and I took many photographs."
        }, 
        {
            "index": 381, 
            "rating": "4", 
            "review": "Nice break in natural serenity. Went on a cloudy day and enjoyed our visit. Not very big, but great for an hour or two to disconnect with the outside world. Also included is a restaurant, cultural activities center, art, gift shop, coy breeding ponds. We enjoyed our visit very much, even on a rainy afternoon."
        }, 
        {
            "index": 382, 
            "rating": "3", 
            "review": "Only go if you have nothing else to do. Don't get me wrong, the garden is nice, but it's small and not really a must do or see. There are much better places for you to visit with you time in BA. If you've been to a japanese or chinese garden before, then don't bother going. Just more of the same."
        }, 
        {
            "index": 383, 
            "rating": "5", 
            "review": "Lovely afternoon walk. Excellent place to ease your mind in the last day of your trip. Good for couples and to take tons of pictures of beautiful flowers and gardens. Very well kept and secure. We tried to eat on the japanese restaurant as well but there was a waiting line (good feedback we heard from locals)."
        }, 
        {
            "index": 384, 
            "rating": "4", 
            "review": "Relaxing place in the busy BA. Just to stroll around, feed the bird, take your shoes of and feel the grass between your toes, This park is just what you need if you want to escape the busy city for a few hours"
        }, 
        {
            "index": 385, 
            "rating": "3", 
            "review": "Just Ok. Worth a brief look, but it isnt very big nor is it incredibly impressive. If you are in Palermo it is easy to get to.. so you might as well stop by."
        }, 
        {
            "index": 386, 
            "rating": "3", 
            "review": "Don't expect a Tokyo experience . but you're in BA, so what did you expect? If you haven't seen a true Japanese garden and you're already in the process of seeing the other nearby parks on a day trip (of which there are tons in walking diatance) then this is worth a stop, if nothing but for the chance to support the local Japanese community. Admission price is around 40 pesos per head but the restrooms are clean and you can relax without concern"
        }, 
        {
            "index": 387, 
            "rating": "3", 
            "review": "Not worth a visit unless you are in the neighborhood. We visited the garden because other museums nearby were closed due to a holiday in Buenos Aires on our last day in town. We walked the path around the lake. I was disappointed overall, probably because I was comparing the garden to a recent visit to the Huntington Gardens in Pasadena, CA, which are outstanding."
        }, 
        {
            "index": 388, 
            "rating": "5", 
            "review": "Beautiful gardens. I really enjoyed the Japanese Gardens. We went to the Malba museum on the same day but you could also go to the botanical garden or zoo and all are very close by. Very small fee. I would advise going first thing in the morning (I think it opened at 10) as it was pretty busy then and only got busier."
        }, 
        {
            "index": 389, 
            "rating": "3", 
            "review": "Nice if you come in with low expectations. If you're looking for a nice, relaxing place to get away from the bustle of the city, I definitely recommend this. Just don't expect it to be an authentic Japanese garden. Also, there is saki in the gift shop. As of March 18, 2014, entrance fee was 32 pesos."
        }, 
        {
            "index": 390, 
            "rating": "4", 
            "review": "Pretty small but charming. The Japanese gardens are worth to visit.Very nicely arranged and everything is simple, natural but somehow also magical.A good place to spend an hour or two."
        }, 
        {
            "index": 391, 
            "rating": "5", 
            "review": "A joyouse escape to peace and quiet ..... wwwjardinjapones.org.ar. The Japanese garden can be reached in 15 minutes from town by taking a tube to Plaza Italia and walking about 1km .... or a bus from the city. It costs 32 Pesos (about two pounds Sterling) to gain entry and once inside peace and a lot of quiet reigns. The gardens are about 2-3 times the size of a soccer pitch and are laid out beautifully. There are bridges, lakes containing hundreds of huge Koi Carp, cafes, toilets, a shop by the entrance selling hundreds of plants for cheap prices and a rather pricey restaurant within the grounds. I went today and there were a few hundred visitors of all ages enjoying the atmosphere. Close by are the zoo, Botanical Gardens and the parks of Palermo ..... so spend the whole day in the area as it is a wonderful escape from the madness of Buenos Aires. The gardens are self-funding and receive no help and a most worthy of a visit."
        }, 
        {
            "index": 392, 
            "rating": "3", 
            "review": "Nice but noisy. Lots of parks to visit in Buenos Aires. This one you have to pay for (32 pesos). Not much but it all adds up! Was very well laid out but quite small and not the tranquility you would expect. A lot of road noise plus barking from the dogs being walked in the next door park."
        }, 
        {
            "index": 393, 
            "rating": "4", 
            "review": "Enjoyable walk, expensive lunch. The Japanese garden is a break from the hectic environment of Buenos Aires (BA) and is a very popular place visited by the BA and tourist individuals. For anyone over 65, the cost is zero and one is supposed to have ID to prove ones age. I suggest you do not carry your Passport with you, a driving license or some form of age proof will be needed. We had none, but still got in! We had lunch in the \"Japanese restaurant\" and as it was a Saturday, was crowded with lots of noisy children. I suggest you visit during the week once the children are back in school. The food was OK but it is not cheap. We spent approx. ARS$550.00 (USD approx. $55.00) for lunch for 2, Very expensive for BA."
        }, 
        {
            "index": 394, 
            "rating": "3", 
            "review": "Nice for a stroll... I you are in the area, but I would'nt go to Palermo just see the garden. It is very small and could use an upgrade!We combined the visit with the Zoo, MALBA, Botanic Garden and the Horse racing track. We had lunch (sushi) in the restaurant that is located in the Japanese Garden and it was very good - but quite expensive since I did'nt want the menues. "
        }, 
        {
            "index": 395, 
            "rating": "3", 
            "review": "Average. Out of everything we saw in Buenos Aires, the Japanese Gardens were just okay. The teashop was a nice break from walking around Palermo and the food was decent, though a bit pricey. The gardens I found a bit small and not all that spectacular. If you have nothing else to do, I would go here but other than that, I would skip it and see some of the other attractions in the city."
        }, 
        {
            "index": 396, 
            "rating": "3", 
            "review": "Mintenance needs to be improved. I have been to many Japanese Gardens and this one definitely offers up some differences. Opened by the current Emperor and his wife many years ago, it is fairly large and reasonably well laid out, the only downside is the maintenance, it does not have the clean cut feel that I have come to expect of a Japanese Garden. The pebbles in the water have moss or mud all over them and the grass could have done with a good cut. Apart from this, nice location in the centre of the city but not sure it is a place I would go out of my way to walk to and sit down and contemplate the worlds issues."
        }, 
        {
            "index": 397, 
            "rating": "5", 
            "review": "Really beautiful. This is a great way to spend a few hours on a nice day. One of the nicest green spaces in a big city that I have ever seen. I really loved it and will definitely go back, if and when I go back to Buenos Aires."
        }, 
        {
            "index": 398, 
            "rating": "3", 
            "review": "Ok gardens considering the price. however it's nothing amazing, and pretty small. If you have 40 mins to kill, check it out otherwise feel free to skip."
        }, 
        {
            "index": 399, 
            "rating": "5", 
            "review": "A quiet haven in the center of a bustling city. We have visited many Japanese Gardens in cities across the globe. This one definitely meets the high standard that they have set everywhere else. The beauty and stateliness of the trees, bridges and sculptures create a backdrop of tranquility. Definitely visit if you need a respite from the crowds, shopping and noise of the city."
        }, 
        {
            "index": 400, 
            "rating": "5", 
            "review": "Very nice place for afternoons. Its a very calm and beautifull place to spend ur afternoons after a good meal elsewhere.Relaxing and full of greens to walk around and chill"
        }, 
        {
            "index": 401, 
            "rating": "4", 
            "review": "An oasis in the city, but not that large. A retreat from the hustle and bustle of Buenos Aires. Well worth a visit if you are nearby, but not that big. More of a novelty than a pristine Japanese Garden. It is cheap and cheerful and deserves some support. A garden centre there too if you would like to buy some plants and shrubs."
        }, 
        {
            "index": 402, 
            "rating": "4", 
            "review": "Nice!. Lovely gardens and lakes in a nice setting amidst the 'green' area of the city. Some reviewers talk down these gardens but how much do you want out of a garden? Maybe they are not as immaculate as some Japanese gardens but in my view they are still of a high calibre complete with rose garden, pergolas, poets corner, quaint bridges & beautiful trees. A very relaxing tranquil all round setting!"
        }, 
        {
            "index": 403, 
            "rating": "2", 
            "review": "OK garden; crummy restaurant. We ended up here on a Tuesday when the MALBA was closed, to our surprise. Ok for a visit, but not worth a trip. We tried the restaurant and had the worst Japanese meal ever. Seafood with grit in it, and chewy, unauthentic tempura. Avoid. "
        }, 
        {
            "index": 404, 
            "rating": "2", 
            "review": "Unremarkable. As stated below this place is not much more than a small, Japanese-themed novelty garden. 24 pesos is not much to go in and see it (and get away from the streets for a bit), but the free parks nearby are a much better option in my opinion. I'm confident you could find better things to do with your time than visit this place."
        }, 
        {
            "index": 405, 
            "rating": "1", 
            "review": "Waste of Money- Stick to the Botanical Gardens. We ended up going to the Japanese gardens only because we were in BA for so long and almost ran out of things to do, but I wish we hadn't, it was a waste of money. There is nothing particularly remarkable or fun about the gardens. In fact, they're quite overrun with tourists and little kids, leaving no space to breathe or relax. There also isn't really a lot to see, they're rather small w/o much to see along the way. Particularly in light of the fact that these gardens are right next to the bigger, more beautiful and free botanical gardens, I would skip this."
        }, 
        {
            "index": 406, 
            "rating": "3", 
            "review": "Unremarkable. The Japanese Gardens are not too bad for enjoying a chill afternoon in a park, but then again, in that area there are many other parks which have equally enjoyable surroundings without the entrance fee of 24 pesos. I agree with Avi K on this one. I just visited Japan before coming to Bs As and don't really think this is representative of the lovely gardens there. Also the trees constantly dripped a slightly yellowish liquid... I would not go back.."
        }, 
        {
            "index": 407, 
            "rating": "4", 
            "review": "Elegant small park to relax and beautiful photos. That was the first Japanese garden I have seen and I loved it. Beautiful setting around a pond. Different trees, a mini waterfall, beatiful trees, flowers and big big fish in the pond. If you would like to stroll in an elegant Japanese garden and take some memorable pictures, it is worth the entrance fee."
        }, 
        {
            "index": 408, 
            "rating": "2", 
            "review": "Admission?. The landsacping in Japonese gardens is usual precise immaculate and worthy of admiration and praise. This garden has a big pond with many large good fish, a bridge and a few trees around. The surroundings are pretty green as is everything in that area of Palermo. To charge 24 Peso admission, for what? The gift shop and restaurant are the most prominent features and add only to the commercial feeling of the place.Can easily be skipped."
        }, 
        {
            "index": 409, 
            "rating": "4", 
            "review": "Tranquil immersing setting that brings Kyoto to Buenos Aires. This calm tranquil garden in the midst of the hustle and bustle of Palermo is a good distraction and place to go just to get away from all the traditional flavours of Buenos Aires.The garden is rich in Japanese culture, down to the trees and fish.The restaurants also give provide rich a Japanese that is uncharacteristic of Buenos Aires."
        }, 
        {
            "index": 410, 
            "rating": "4", 
            "review": "Enjoyable and quiet place. I've been to this place several times. I like going here every time I go to Buenos Aires. It is a very peaceful place out of the hustle and bustle of the city.People usually go here to take nice pictures with all the typical japanese decorations. Last time I went was on last Saturday, and there was a Cosplay convention. It was fun to see lots of people wearing different costumes from manga, anime, video games and films. Most of them, of course, were Japanse characters.Something interesting to do in the Japanase Garden is to have your name written in Japanase. It's not expensive (USD 2) and it just takes a few minutes.Japanse Garden is very well-located in the Palermo neighborhood. Within a few blocks is the zoo, the planetarium, and the beatufil \"Bosques de Palermo\" (Palermo Woods) with plenty of activities to do there."
        }, 
        {
            "index": 411, 
            "rating": "1", 
            "review": "Tourist trap.. I'm amazed of how many people speak of the 'relaxing walks' in the garden or how this is a 'must-see'. But these people would probably also describe Disneyland as being 'authentic'.Seriously, this 'garden' has an entrance fee and once inside you'll be able to pose with hoards of tourists on japanese themed bridges etc. Every minute or so an airplane will pass over, adding more noise to the loud yattering already present in the park. Relaxing? No. Must-see? No.Avoid if you can."
        }, 
        {
            "index": 412, 
            "rating": "4", 
            "review": "A Japanese Corner in Palermo. This garden is one of the largest of its type in the world outside Japan. Opened in 1967 by the then Crown- Prince Akihito (present Japanese Emperor) and Princess Michiko and inaugurated on occasion of a State Visit.The entrance is on Figueroa Alcorta Avenue on the northeast corner of the city's extensive Parque Tres de Febrero. Many bus lines serve the place as Palermo (the area in which the Japanese Garden is located is a busy one).It has a cultural centre, restaurant, a greenhouse (well known for its collection of bonsai trees) and a gift shop (with an extensive selection of Asian garden seeds and craftwork).A brigde – known as Divine Bridge - crosses the Central Lake, representing entry into Heaven: The Truncated Bridge, in turn, leads to an island where Japanese medicinal herbs are grown.A Japanese Peace Bell, a large ishidoro (kind of stone lanterns of importance to Buddhist traditions), sculptures, a Buddhist Temple, flora from Japan, South America native species and carps can also be enjoyed. Everything contributes to the colourful atmosphere of the place. Japan’s traditional festivals are held here annually. The garden also includes a library with specialized volumes on Japanese issues, Cookery courses, Origami technique, Reading of Japanese Stories and Tales, and a free guided tour to the Zen Garden (on weekends). Last but not least: Acuatic landscape, kimonos and orchids expositions, and a bomsai clinic! Worthwhile. An oasis in the middle of the chaos! Relaxing! Would definitely go back!"
        }, 
        {
            "index": 413, 
            "rating": "5", 
            "review": "A good place to relax. A small garden in the heart of Palermo. Feed the fish, relax, make a wish and enjoy this precious gift from the japanese people to the porteños."
        }, 
        {
            "index": 414, 
            "rating": "4", 
            "review": "Liked it.. Nice garden, but a little on the small side for me. The admission fee was on entering the garden. Plenty to see , felt nice here, I did like it. Great for the atmosphere and for the plants."
        }, 
        {
            "index": 415, 
            "rating": "4", 
            "review": "Cute little garden . . .. This garden is a cute place. We strolled through on a Saturday afternoon. There's an admission fee (I think around 30 pesos), and the whole garden relatively small. We took our time, and I think it was about a 45 minute walk. There were Japanese-type plantings, and the walk was situated around a pond with many carp. There were many families and couples strolling (with a great deal of picture taking). The garden is not spectacular, and, although it seemed relatively well kept compared to some of the other gardens, it wasn't immaculate and some of the walkways and bridges were in a bit of disrepair. We enjoyed this, and it was on our way between destinations, but I would not go out of my way to visit this if I wasn't in the area."
        }, 
        {
            "index": 416, 
            "rating": "5", 
            "review": "Very Like!!. Without words, this place is necessary go!!! For all the person go to Buenos Aires do not let go!!! The perfect place to take picturesa and relax!!"
        }, 
        {
            "index": 417, 
            "rating": "4", 
            "review": "A VERY NICE CORNER. Argentina received an important Japanese colony, as other South American countries did, mostly during the XX century. Those immigrants and their descendants created this lovely environmental embassy of their remote homeland in the Palermo area, and take good care of it. Japanese shows are displayed here permanently."
        }, 
        {
            "index": 418, 
            "rating": "4", 
            "review": "Place to relax. This is a very peaceful place where you can sit down and relax for as long as you want. My advice is get there at the opening time which is ten in the morning if you want absolute peace. Later on more people start arriving. You can take really nice shots there."
        }, 
        {
            "index": 419, 
            "rating": "3", 
            "review": "japanese garden. quite boring as I went during winter, nothing much to see as none of the flowers are in bloom. there is a bridge over the pond which is a popular photo taking spot"
        }, 
        {
            "index": 420, 
            "rating": "3", 
            "review": "Scenic, but small. The website claims that this is one of the largest Japanese Gardens outside of Japan....however, it appeared to be very small. I was able to walk the entire garden in less than 20 minutes. It won't be a disappointment if you miss it!"
        }, 
        {
            "index": 421, 
            "rating": "5", 
            "review": "A jewel in the middle of the city. This is a remarkable garden in the heart of the city. The displays are beautiful and the kois are huge. There were activities or children as well. Certainly family friendly. We were there on a colder cloudy day and still enjoyed ourselves."
        }, 
        {
            "index": 422, 
            "rating": "2", 
            "review": "Not worth it - tourist trap. We visited the garden because of a recommendation in our guide book. It really wasn't worth the 24 pesos they charge for entrance. Any tranquility the place might have possessed was destroyed by traffic noise, obnoxious, brightly painted trash cans, too many \"Don't tread on the grass\" signs and exposed infrastructure. There were hoses spraying into the ponds and random tanks sort of sitting around. The enormous koi fish swimming around the pond were fun to look at for a minute, but overall it wasn't worth our money."
        }, 
        {
            "index": 423, 
            "rating": "4", 
            "review": "Great walk to relax. A nice peaceful place to walk and talk with a friend or a significant other. The only down side of this place is that they do not allow you to bring food to snack. They have a restaurant in the premises but we didn’t try it. It is about US$5.00 for entry fee."
        }, 
        {
            "index": 424, 
            "rating": "5", 
            "review": "Beautiful gardens, good restaurant. We really enjoyed our visit to the Japanese Garden. We had a leisurely sushi lunch - very good - followed by a relaxing walk through the gardens. Close to the zoo which is also worth a visit."
        }, 
        {
            "index": 425, 
            "rating": "1", 
            "review": "Come for the gardens, stay away from the restaurant. My wife and I had some higher expectations of a japanese restaurant, located in a japanese garden. It looked like a Japanese restaurant, sounded like a Japanese restaurant, then we saw the menu... And it was all down hill from there. First off, the selection of maki available makes a California roll look legit. Every single option either has cream cheese or f'ing cheddar cheese. That's just sad. The noodle dishes had what looked like spaghetti. In the end we ordered a few things that seemed palatable. First were the salmon dumplings... These are more like deep fried salmon wantons... They arrived a little burned on the outside, and still frozen on the inside. Not cold, frozen. So we sent it back (and we never send back food) to warm it up. 5 minutes later, comes back... Still frozen on the inside. Embarrassing. Third time was a charm, and it ended up being an ok appetizer. In no way authentic, but passable.I ordered the tuna tataki. One of my favorite dishes, and listed as a speciality. Which they came back to tell me they didn't have any. Sad. Ordered some nigri in it's place. My sunomono salad was a pile of cold noodles and cucumber. Almost no seaweed, and barely any kani at all, I guess less than one piece of kani all told. It was tasty for what it was, but it wasn't a sunomono salad. My wife ordered the swordfish. This was delivered to the wrong table, where that patron mistook as his meal, and put his fork into the accompanying salad. The fork he had already used. The server noticed the mistake... But just moved it to our table. More fantastic service. The swordfish itself was decent, but could have used a little flavour enhancement. The highlight of the meal was my nigri. The fish was very fresh and delicious. This is what to order, even if the selection of nigri is very limited.When we were done our meal, it took 2 requests to get the bill,and about 15 minutes in total. Thank you for wasting our time. This was only the second time in my life I didn't leave a tip. Service this bad is an embarrassment, and would not be tolerated in any real japanese restaurant."
        }, 
        {
            "index": 426, 
            "rating": "2", 
            "review": "Not worth it. First, you have to pay 24 pesos just to get in the garden. There they'll show you a map that's totally out of scale (they try to make the garden look bigger than it actually is). The visit will be over in minutes, unless you're willing to buy some overpriced souvenir in their shop. This is the only Place in Buenos Aires I totally regret having lost my time visiting."
        }, 
        {
            "index": 427, 
            "rating": "3", 
            "review": "Visit if you have time. Not a must see.. Recently I visited the Japanese Garden in Buenos Aires. While it is rather inexpensive there is not a whole lot to do there. The garden itself is very nice. It gives you a feeling that you are not in a giant city. It only takes maybe 30-45 minutes to walk through the entire garden. If you are looking for something to do and you are in the area I would stop by. I wouldn't make it a must see if you are in Buenos Aires"
        }, 
        {
            "index": 428, 
            "rating": "2", 
            "review": "No Must-See at all!. We were very keen on seeing the japanese garden. However, we were quite disappointed.First, its not very big. So you cross the garden in very few time. As streets are surrounding the garden, you can hear the noise of the city constantly in every part of the garden.Second, if you have been in Japan: this is far away from an amazing \"true\" japanese gardenThird: you have to pay entrance fee, whereas in the other Palermo Gardens you dont have to pay for entrance, like for example in the Parque Rosedal (Which is far more attractive).Fourth: Its very \"touristy\": \"Pay Entrance, buy a bonsai, go to the restaurant\"..Therefore: we suggest to walk through the other parks without paying entrance. you still have nature and less noise than here..."
        }, 
        {
            "index": 429, 
            "rating": "3", 
            "review": "Don't worry if you miss this. Rather bland Japanese garden if you have seen gardens in Japan (or elsewhere in the world). Lousy design. Surrounded on all sides with roaring traffic, so there is no chance for peace and/or contemplation. It completely misses the soul that a true Japanese garden has."
        }, 
        {
            "index": 430, 
            "rating": "3", 
            "review": "Don't worry if you miss this. Rather bland Japanese garden if you have seen gardens in Japan. Lousy design. Surrounded on all sides with roaring traffic, so there is no chance for peace and/or contemplation."
        }, 
        {
            "index": 431, 
            "rating": "5", 
            "review": "an oasis in one of the top 20 cities. Buenos Aires has roughly 13 million people, and it's a busy, hustling place almost everywhere you go. But an hour in these gardens is a great restorative. Bonzai for sale, a nice little food shop and even a sushi restaurant are located on the edges of the garden and don't get in the way of the peace and serenity of the ponds and small waterfalls and red lacquer bridges. I found no nicer place to relax in Buenos Aires. Clean, safe, beautiful and intricate and thoughtful."
        }, 
        {
            "index": 432, 
            "rating": "3", 
            "review": "Beautiful but not so great for a paid garden. This japanese garden is well taken care of, and its have a lot of things to take pictures of/with but that is about it."
        }, 
        {
            "index": 433, 
            "rating": "3", 
            "review": "Nice but small. Worth it if you're in the area.. Don't bother making a special trip here, but if you're in the area, it's not bad. It wasn't too crowded when we went, but it as rather hot and still early in the morning. I'd imagine that the crowds got bigger as the day went on."
        }, 
        {
            "index": 434, 
            "rating": "4", 
            "review": "Nice japanese garden. Calm beautiful place for a walk.Families with children seen to like the place. Not my case. It was just me and my wife.If you are going on foot from the south, you should go by the President Figueroa Alcorta Avenue, really nice views and nice gardens all along the way."
        }, 
        {
            "index": 435, 
            "rating": "2", 
            "review": "better on a weekday. only worth it to eat lunch in the resto!. If you've never been to a Japanese garden, then it will be magical. If you go on a weekday, it will be peaceful. If you go on a sunny weekend, then you will instead critically note that you have paid for the experience of looking at trash-littered walkways, dying patches of grass, obese fish with festering sores on their scales, dirty pond water, and hearing the clamor of children begging for more pesos to buy more fish food, thus disturbing whatever Zen moment you were hoping to have strolling in the gardens park.Towards the back is an authentic Japanese restaurant that only serves lunch. Make reservations and hide out there, away from the crowds."
        }, 
        {
            "index": 436, 
            "rating": "4", 
            "review": "Worth a Walk. It is a very charming garden, a good diversion for about an hour or so. I never have seen so many dragonflies in one place."
        }, 
        {
            "index": 437, 
            "rating": "2", 
            "review": "If you've never seen a Japanese garden, maybe it's worth it. Otherwise not.. We expected to pay an admission of US $4-5 and were pleasantly surprised to find that this attraction is free for people over 65 (with document of proof of age). This is good, because as something free we didn't mind it. If we'd needed to pay, I'd be complaining. If you've been to the Japanese gardens in Rockford Illinois or the Pacific Northwest of the US you'll find this a real disappointment. Very little is special, and the water is so clouly any fish aren't visible. But it's a nice, tranquil place in the middle of the city, with plentiful benches, so it's worth it for that. And for the intercultural exchange and interest that it represents."
        }, 
        {
            "index": 438, 
            "rating": "5", 
            "review": "Relaxing atmosphere. Although I went in the winter and it was rather cold, the manicured gardens, the streams ,little lakes and small bridges, the tranquility it inspires, really paid the visit."
        }, 
        {
            "index": 439, 
            "rating": "4", 
            "review": "Beutiful garden to relax. It is a nice typical japanese garden. It is small but you can sit and read. A space to relax in the middle of the city. There were some kids having fun."
        }, 
        {
            "index": 440, 
            "rating": "3", 
            "review": "Worth it esp for kids. Since this is one of the larger ones in the world, really wanted to go to it. Its lovely, has a lot of water features and bridges, different elevations, and a great nursery in the back. It can be hot in early January so have hat or umbrella. You can eat at a cafe/cafateria there. LOTS of kids, they love feeding the KOI. It was amazing seeing them -a lot like a photo I have seen = frenzy of color.As others have mentioned, there are others that have more features- one outside of San Jose in California comes to mind, where you can actually visit a japanese tea house. This has a tea house, but seems was not open, being repaired, not entirely sure."
        }, 
        {
            "index": 441, 
            "rating": "3", 
            "review": "Serene respite. These gardens aren't going to blow your sox off but if you're sick of humanity and want a quiet reprieve, the 8 peso entry fee is enough to keep crowds down (unless you have the misfortune of arriving when a school trip is visiting). As other reviewers have said, these grounds don't compare to a real japanese garden but there are carp in the water and a few bridges and bonsai trees strategically placed. I've had green tea at the community center/restaurant and I can attest to the authenticity of the azuki bean paste tea biscuits! yummy!"
        }, 
        {
            "index": 442, 
            "rating": "1", 
            "review": "I couldn't get in!. I'm not exactly sure what went on at the ticket booth at the Japanese Gardens, but I didn't get in! The lady in the ticket booth said something to me in Spanish that I didn't understand and beckoned me to stand to one side. I thought maybe she didn't have change for my 100 peso note and so waited a bit, but with the number of people buying tickets before and after me, it couldn't have been the case and so I wandered off very confused. Later on, I told a few locals about the scenario and none of them could explain what it was about. Anyway, I'm sure the gardens are very nice - if you are allowed in!"
        }, 
        {
            "index": 443, 
            "rating": "2", 
            "review": "Go to Japan instead. Well, everything looks neat and nice. But it's far from a genuine Japanese garden. Don't go here if you don't have lots of time over, or never have been to any Japanese gardens in your life and you know for sure that you'll never go to Japan. Otherwise, spend your time somewhere else, or go to Kyoto :)"
        }, 
        {
            "index": 444, 
            "rating": "4", 
            "review": "Fresh air. Enjoyed a walk around this well maintained garden ...and the chance to get some fresh air after the diesel bus fumes in the city centre"
        }, 
        {
            "index": 445, 
            "rating": "3", 
            "review": "A quiet retreat. you can almost forget there's a busy city with wide boulevards congested with traffic outside. avoid the overly expensive restaurant and then make your way to the rose garden nearby."
        }, 
        {
            "index": 446, 
            "rating": "3", 
            "review": "Not impressed. The garden is OK but I don't think it was worth the visit. There are much better gardens all over the world. The place is kept clean but it is fairly small and doesn't have any memorable attractions. It is also a bit out of the city center."
        }, 
        {
            "index": 447, 
            "rating": "2", 
            "review": "below average garden. We have been to a lot of japanese gardens so perheps we are a bit biased. If you have never been to one, then you should check it out. If you have had that experience before this will be underwhelming."
        }, 
        {
            "index": 448, 
            "rating": "4", 
            "review": "perfect small relaxation spot. we love this garden, it is on a smaller side but oh so peaceful, tranquil. Our kids like to go there to feed fish, I like to relax and admire beauty. There also is a a restaurant but food is so so. The entrance is really inexpensive and all kids under 12 are free."
        }, 
        {
            "index": 449, 
            "rating": "3", 
            "review": "Just okay.. This Japanese garden was just okay, it was probably a 20 minute stroll all the way around. When we went it was absolutely packed so it was hard to see all the attractions. We actually traveled to Japan and were very impressed by authentic Japanese gardens but this lacked certain character and wasn't too well maintained. The water was dirty and we couldn't see any koi fish, other than the occasional one that would come up really close to the surface. I was actually surprised to learn that this is the biggest Japanese garden in the world outside of Japan., didn't seem like it. I think there are a lot better things to do in Buenos Aires!"
        }, 
        {
            "index": 450, 
            "rating": "3", 
            "review": "Not impeccably maintained nor perfectly traditional. This was ok for a 15 minute stroll but the gardens need more maintenance (dirty water, grass full of weeds) and it's not free (unlike the nearby rose gardens). We enjoyed a special bonsai exhibition and the restaurant was packed but the garden itself was just ok."
        }, 
        {
            "index": 451, 
            "rating": "5", 
            "review": "Serene & peaceful. Not sure why other reviews are saying its not worth visiting. It's really green, serene and beautiful. There were lots of people but it was still enjoyable, and parts of the garden were very peaceful, with running streams etc. Was a nice change from the hustle and bustle of the city. The red bridge especially looks like postcard like in my pictures. 16 pesos is nothing for the entrance fee once converted in GB pound (£2.30)."
        }, 
        {
            "index": 452, 
            "rating": "3", 
            "review": "Not very authentic. Having been lucky enough to visit actual Japanese Gardens in Japan this felt very commercialized and not at all authentic. It was 16 pesos each to get in and although the gardens were pristine it all felt manufactured rather than natural. The big lake was very dirty so it was difficult to properly see the enormous Koi Carp - many of whom looked the worse for wear from sores or fungi. We took a picnic which saved on the quite expensive fast food available from the kiosk. What was interesting was a display of aquariums designed with bonsai tree type underwater plants and the garden shop which was selling normal bonsais in their own right. It is very popular with tourists & locals. The amount of people there when we went was overwhelming and not at all conducive to a feeling of peace"
        }, 
        {
            "index": 453, 
            "rating": "2", 
            "review": "Not worth a visit. This is a very unusual \"thing to do\" in BA. I am not sure why people would want to visit here when there are much nicer parks in BA, and it doesnt even feel Japanese. Not worthy of the entrance fee, especially when you can do the entire loop in 5 minutes."
        }, 
        {
            "index": 454, 
            "rating": "2", 
            "review": "Ummmm....why?. Not sure why this is ranked so highly as a sight worth seeing in BA, it is a nice garden with Japanese influence, not sure it's a must do for anyone visiting Argentina. You're better off saving the entrance fee for paying someone to clean off all the dog doo from your shoes from walking the streets of BA (which is far more interesting than checking out well kept Japanese gardens)."
        }, 
        {
            "index": 455, 
            "rating": "5", 
            "review": "Great place to rest in the middle of the city caos. Worth the visit! Buy the origami bird, write down your wishes and hang on the big wall to bring you good luck! Take a minute to seat and rest watching the gardens and the big lake . 16 pesos the entrance. Highly recomend!"
        }, 
        {
            "index": 456, 
            "rating": "4", 
            "review": "Nice place in the center of the city. A good place to walk a little bit, eat some japanese food and enjoy the beautiful flower species of the greenhouse (specially the orchids, the place also gives monthly talks and seminars on how to cultivate these kind of exotic flowers)"
        }, 
        {
            "index": 457, 
            "rating": "5", 
            "review": "Stunning. I think this garden was lovely. The coy were large and plentiful. Three touches that I really like we're the lanterns, statues, and red bridge. For your own pleasure, I liked this more than the Amazon, sure it's nice to be able to say you've been to the amazon, but it isn't really super beautiful or peaceful. But the thing I thought was the best was the placement, everything seemed to be in the perfect place. If you ever go to Buenos Aires, or even city neighboring Buenos Aires, I highly suggest you go there."
        }, 
        {
            "index": 458, 
            "rating": "5", 
            "review": "Interesting switch from \"normal\" Buenos Aires scenery. Beautifully well laid out and kept location. We went on a cold sunny day and the clear blue sky really combined well with the Red Japanese Bridge, lake, orange fish and all."
        }, 
        {
            "index": 459, 
            "rating": "4", 
            "review": "Nice respite from the city!. Most definitely a lovely garden and a nice respite from the hecticness that is Buenos Aires (but we all love this city, no?). Had a lovely bridge, and a koi pond with the largest koi I have ever seen in my life! We walked all the trails because it is a fairly small space, but don't let that deter your visit, it was still lovely. There is a botanical garden/nursery (of sorts I suppose, you can also buy plants there as well) that is worth a stroll through as well!! If youi want some tea, or maybe sushi, there is a restaurant on the property, although we didn't go in so we can't comment on price or quality."
        }, 
        {
            "index": 460, 
            "rating": "5", 
            "review": "Relaxing. Odd that i should like this in Argentina, but so relaxing and sometimes there are events in the gardens or halls."
        }, 
        {
            "index": 461, 
            "rating": "5", 
            "review": "Too crowded. Nice place, when I went you had to pay only $2. It was pretty, you could see all kinds of flowers and they had asian theme shows. I went on a Sunday and it was too crowded.. that was the only downside."
        }, 
        {
            "index": 462, 
            "rating": "3", 
            "review": "Nice garden but could use maintenance. It has a nice feel for Japan and the koi pond was great. But it was smaller than expected and getting a bit run down.\nI liked it though I didn't think it was exceptional."
        }, 
        {
            "index": 463, 
            "rating": "4", 
            "review": "Small but a representaion of Japan. A pleasant park to walk about giving a hint of what a Japanese gardens are all about. Worth a visit"
        }, 
        {
            "index": 464, 
            "rating": "5", 
            "review": "A true japanese space in middle of capital federal. I come here allways I can, to spend some hours viewing not only trees and fishes, but also their culture, their typical garden distribution, their cook, and their manners. It's beautiful."
        }, 
        {
            "index": 465, 
            "rating": "5", 
            "review": "Very pleasant place to spend the afternoon. We paid a visit to the place on June 07 and we simply loved the place. It's got wonderful well-cut and maintained gardens, looking like an oasis in the middle of the bursting and vibrant Buenos Aires atmosphere. We also ended up getting a late afternoon tea and some desserts at the very good Tea House located inside at the back of the garden. Just be aware that one has to pay for the entrance (equivalent of USD 10 per person), but it's really worth it. In case you need to get a cab back to your place/hotel, just upon exiting and turning right you'll find an avenue where you can get one easily.There's also a place to have free origami courses, if you like it. Recommended!"
        }, 
        {
            "index": 466, 
            "rating": "3", 
            "review": "If you have time. The Japenese Garden is interesting. It is not very big but it is beautiful. They have koi fish in their ponds and my friends and I had fun taking pictures."
        }, 
        {
            "index": 467, 
            "rating": "5", 
            "review": "Beautiful gardens in the middle of the city. Wonderful gardens to stroll through. Lovely display of local flowers."
        }, 
        {
            "index": 468, 
            "rating": "4", 
            "review": "Wonderful little park. As others have mentioned this is a wonderful little park in the middle of the hustle and bustle of Buenos Aires. I did notice the air traffic some, but the car traffic noise was somthing that I did not seem to notice, probably because I was fascinated with the beauty of the garden. The garden has all of the traditions of a typical Japanese garden. We visited in their fall and while many things were not in bloom, it was still beautiful and relaxing. It is not a huge park but a good enough size to get away for awhile. It was a beautiful sunny day when we were there and there were quite a few people visiting the park. We had a very late lunch in the restaurant at the park. It was superb. Great service, wonderful food topped off with an exquisite Argentine white wine. If you like Japanese food/sushi, you should give the place a try. I don't think you will be disappointed. We weren't."
        }, 
        {
            "index": 469, 
            "rating": "3", 
            "review": "Not quite tranquil. Shame about the airport being so close by, and being surrounded by busy roads. Potentially could be a very relaxing haven if it weren't for the noise. Nice to walk through (but costs $16 pesos) and it does represent Japanese gardens well, but I'd only go here if you had time to fill in."
        }, 
        {
            "index": 470, 
            "rating": "4", 
            "review": "Beautiful oasis in the middle of Buenos Aires. Who knew Buenos Aires held such a lovely garden in the middle of the city? We really enjoyed visiting this though it would have been much prettier in the spring when all the azaleas would have been blossoming. Don't miss their restaurant!"
        }, 
        {
            "index": 471, 
            "rating": "3", 
            "review": "It's beautiful. It's a garden. It's japonese.. What to expect to a place like this? It's beautiful. It's a garden. It's japonese. And it's clean, quiet and peaceful, great for couples and children. But that's it. It's not expensive - around 16 pesos per person - but I really think Rosendal and all the green area around Recoleta is more worth. If you don't have a Japanese Garden in your city, you should go. In 30 minutes, you're done. If you have already visited one Japanese Garden, think twice."
        }, 
        {
            "index": 472, 
            "rating": "5", 
            "review": "BEAUTIFUL PLACE TO SPEND A FEW HOURS. Stroll through this beautiful garden, feed the Koi, or just sit and read a book. This is a serene venue to spend a few hours."
        }, 
        {
            "index": 473, 
            "rating": "3", 
            "review": "Only if you have time to kill. I was pretty underwhelmed and would not recommend unless you have nothing else to do. We ate at the restaurant and while the food was excellent with great presentation, I found it expensive and the portions were tiny. My partner and I always share an appetizer, main meal and dessert. We were starving so we ordered two appetizers along with the main meal. It was my understanding that the meal came with rice but it did not. It took forever to get our food, we were still hungry when we were done and chose not to order dessert because we had already lost so much time."
        }, 
        {
            "index": 474, 
            "rating": "3", 
            "review": "Not worth a visit. Its nice and everything but you are visiting Buenos Aires, not Japan, so I wouldn't waste my time going to the Japanese Garden when you can visit places with a real latin and \"porteño\" feeling."
        }, 
        {
            "index": 475, 
            "rating": "3", 
            "review": "Very small and not much to see - a bit underwhelming but at least clean. The redeeming factor of this park (and therefore my 3 stars and not less) is the very low entry price of 16 pesos per person. You don't expect much for this kind of money in Buenos Aires, and that's exactly what you get - not much. The park is very small, has a lake with lots of carp, a couple of Japanese walking bridges, and ... well, that's pretty much it. You would have to be a very strong admirer of Japanese garden design to see anything else. If you're in the area, you might want to give it a shot, but really only if you have nothing else to do."
        }, 
        {
            "index": 476, 
            "rating": "4", 
            "review": "Service was friendly food was good although portions were tiny. Great settingFood was good although the portions were tinyThe waitress in the beginning was incredibly attentive but then she forgot about us.The tea was delicious"
        }, 
        {
            "index": 477, 
            "rating": "5", 
            "review": "A oasis of calm!. A nice change from the busy streets - beautifully maintained and worth spending time there. Don't miss the restaurant!"
        }, 
        {
            "index": 478, 
            "rating": "4", 
            "review": "A fun afternoon.. The restaurant is yummy, the park is lovely, but a lot of traffic noise."
        }, 
        {
            "index": 479, 
            "rating": "2", 
            "review": "Nothing.. Ok, the tourism publicity says it is the bigger japanese garden of the world, an incredible place ....First of all, it's Ar$16, one of the most expensive atractions of this kind in Buenos Aires. Inside, there is a big lake, with two bridges and some shrubs pruned in oriental style. The water is dirty, with some garbage floating. There is a japanese house, with 4 kimonos, maybe the unique really interesting thing of the place. It's nothing excepcional, compared to the other gardens and lakes of Palermo. And after all, you can see similar places in any part of the world. It's better to use your time with other atractions, go there just if you really have time and already visited the mainly atractions of the city."
        }, 
        {
            "index": 480, 
            "rating": "3", 
            "review": "I picture it bigger. Its pretty, but too small. Is just like you see it in pictures. Got to pay 16 pesos, around 4 $ for a 15 minutes walk in a park. Yet is ok if you go with your girlfriend or boyfriend"
        }, 
        {
            "index": 481, 
            "rating": "4", 
            "review": "A little of Japan in Buenos Aires. It´s a cute place in Buenos Aires that looks just like Japan, though during weekends can be a little overcrowed. If you´re around and willing to rest for a while, go inside, chill out and enjoy some tea!"
        }, 
        {
            "index": 482, 
            "rating": "4", 
            "review": "An oasis in the middle of the city. Amazing place just in the middle of the city. Very chip ticket. Bring a book and find your spot to relax.\nThey also have a very good tea house, although it has become very expensive.\nThey also have a bonsai and plants selling area, with has also increased its prices considerably."
        }, 
        {
            "index": 483, 
            "rating": "4", 
            "review": "Beautiful. Beautiful location, very well kept and organized. Worth the visit."
        }, 
        {
            "index": 484, 
            "rating": "4", 
            "review": "A clean area to walk around. This is a very clean area to take in some quiet in the middle of Buenos Aires. There is admission but that's what keeps it maintained I suppose."
        }, 
        {
            "index": 485, 
            "rating": "5", 
            "review": "A Place of Tranquility. A place to take a pleasant quiet stroll in beautiful surroundings amidst the hustle and bustle of Buenos Aires."
        }, 
        {
            "index": 486, 
            "rating": "5", 
            "review": "Beautiful and crownded. The jardin is wonderful and quite good conserved. I went on Sunday, when it was hosting a Anime/Manga event. I enjoyed it a lot seen so many youngs dressed in costumers. The event was attraction by it self, if you don't mind this kind of event."
        }, 
        {
            "index": 487, 
            "rating": "4", 
            "review": "Worth the visit. A very pleasant and quiet garden, as you would expect , in typical Japanese style, with bridges and koi ponds. This is a good contrast with busy Buenos Aires, and certainly well worth the visit.\nBe aware there is an entrance fee, and it can get pretty crowded at peak times on weekends."
        }, 
        {
            "index": 488, 
            "rating": "4", 
            "review": "Nice for a little break. It takes a while to go there if you walk but, even on a sunny afternoon, it's worth a visit. Nothing impressive really... But Nice !"
        }, 
        {
            "index": 489, 
            "rating": "4", 
            "review": "Wonderful Gardens in heart of city. Our son and his wife joined us on a visit to these gardens in a beautiful setting in Recoleta this past week (January 31st, 2012). The entrance fee was around $3.50 per person and was worth it. The gardens and ponds were excellent in many ways. The koi were huge and entertaining; the bonzai trees were lovely; and the overall experience was four-star. It helped that the day was bright and not so hot. It looked like most people were pleased and glad that they had made the time to spend some time here."
        }, 
        {
            "index": 490, 
            "rating": "5", 
            "review": "Beautiful place.. A beautiful well maintained garden in the middle of a large city. It may be small, but it is well worth the visit. Plenty of good photo ops."
        }, 
        {
            "index": 491, 
            "rating": "3", 
            "review": "Small but cute. Well maintained compared to public parks; small but attractive layout; restaurant not open until February 1, 2012. Try the melon ice cream bars, refreshing!"
        }, 
        {
            "index": 492, 
            "rating": "3", 
            "review": "Didn't like to pay. It's a public space, but you have to pay to get in. Very charming, indeed. But we couldn't spend more than half an hour there."
        }, 
        {
            "index": 493, 
            "rating": "5", 
            "review": "An bit of peace in the middle of the city. Bring a good book, sit under a tree and enjoy the peace.Or you could explore with friends and take some of the interesting activities offered almost everyday. I took a massage called Shiatsu, completely for free, but you also have martial arts exhibitions, origami lessons and a lot more. They change everyday, so I recommend checking the schedule first.Children love to feed the koi fish under the bridges (I've seen it's addictive on most of them), so they'll be having fun too.It's a small place, so if you walk straight through it shouldn't take more than one hour. But between pictures, activities and some sushi at the restaurant, you'll end up being three hours."
        }, 
        {
            "index": 494, 
            "rating": "3", 
            "review": "A little disappointing. 16 peso and not really worth the money.Very small place, not that pretty and nor very interesting."
        }, 
        {
            "index": 495, 
            "rating": "4", 
            "review": "Lovely. You can combine it with the Rosedal and visit 2 lovely landscaped parks."
        }, 
        {
            "index": 496, 
            "rating": "5", 
            "review": "Tranquility in the Busy City. This is a wonderful, 2-hour activity that will help the visitor to find peace and tranquility in the city. The entrance price is very inexpensive."
        }, 
        {
            "index": 497, 
            "rating": "4", 
            "review": "Nice place to hang out. It's a beautiful place to spend time with your family feeding the fish and enjoying the view, totally recommend it to turists who enjoy taking photos (you can take great pictures there)."
        }, 
        {
            "index": 498, 
            "rating": "4", 
            "review": "Beautiful and peaceful park. Perfect way to escape the noises of the big city. I went there houndreds of times and of course it is better to go on week days, since the weekend its pretty crowed. If you like exotic plants or taking colorful photographs, this is your place!"
        }, 
        {
            "index": 499, 
            "rating": "4", 
            "review": "Beautiful place to chill out. Seems strange to recommend a Japanese Garden in the middle of BA - but it's absolutely genuine, a gift from the people of Japan, and very beautiful. It is a complete haven of tranquility away from the bustle of the city. All the other visitors seemed relaxed, too, it wasn't just us! And the food in the very authentic restaurant is good, and reasonably priced, certainly by London standards. If you want to take a break from the city, I'd recommend getting here about 11, an hour or so walking the garden, then lunch."
        }, 
        {
            "index": 500, 
            "rating": "3", 
            "review": "Nice break in the city. it's a nice park to take pictures and walk around. set in the middle of the palermo parks it's good for children and adults"
        }, 
        {
            "index": 501, 
            "rating": "5", 
            "review": "great. beautiful, good place to take family, girlfriend. etc"
        }, 
        {
            "index": 502, 
            "rating": "3", 
            "review": "Touristy but pretty. The Japanese Gardens in Palermo are a nice place to take pretty pictures. There is an entrance fee of $8 pesos. It's not very big, but it's tranquil and there are nice spots to take pictures of the pond and bridges. There is a concession stand where they sell snacks and drinks near the entrance. Also, there is a restaurant inside the garden that sells Japanese food. I'm not sure how the food is but the prices seem to be average. Mostly there are a lot of tourists here taking a LOT of pictures.."
        }, 
        {
            "index": 503, 
            "rating": "4", 
            "review": "A nice touristic place. The japanese garden is a nice a well built place in the hectic city of Buenos aires.We enjoyed visiting there for 2 hours, and take a break from the concrete surround us."
        }, 
        {
            "index": 504, 
            "rating": "4", 
            "review": "Beautiful Place. Its a very beautiful garden near of the Bosques de Palermo. The area is covered with tipical japanese vegetation, rocks and a bridge were you can take several photos. Inside the garden there is a good japanese restaurant. It's a good place to spend the afternoon."
        }, 
        {
            "index": 505, 
            "rating": "5", 
            "review": "Peaceful and beautiful. Very nice place to spend the morning. It's very peaceful and beautiful. Enjoy their restaurant too, with very good food."
        }, 
        {
            "index": 506, 
            "rating": "4", 
            "review": "Peaceful garden. This garden had lots of nice plants, huge koi, and great sculptures. I really enjoyed the bridges and looking at the birds."
        }, 
        {
            "index": 507, 
            "rating": "5", 
            "review": "A beautiful Garden. A beautiful garden with lots of colour. Rhododendrons were stunning. Well thought out.Had a nice coffee and Japanese biscuit in the restaurant."
        }, 
        {
            "index": 508, 
            "rating": "4", 
            "review": "Relaxing little place. Nice little relaxing Japanese style garden in the middle of the city, it has plenty of ponds, bridges, boardwalks, and sculptures, great place to visit to take pictures of the scenery and feed the fishes at the ponds or to have a nice meal at the restaurant with your couple. It has a few souvenirs shops where you can buy traditional gifts, or even get your name translated in Japanese.You could see the whole park in less than an hour, I definitively would recommend visiting this attraction along with the Buenos Aires Zoo which is really close by, you could see both things easily in half a day."
        }, 
        {
            "index": 509, 
            "rating": "3", 
            "review": "Cute and small. Only go if you have time to spare. Gardens are maintained but need a few more places to sit and contemplate."
        }, 
        {
            "index": 510, 
            "rating": "3", 
            "review": "Nice!. Small, peaceful park. Use to be part of President Rosa land. Fun to feed the fish."
        }, 
        {
            "index": 511, 
            "rating": "4", 
            "review": "beautiful place. I really liked this garden . It is small , cute , and the restaurant was nice , too. Good place for some photo shots."
        }, 
        {
            "index": 512, 
            "rating": "2", 
            "review": "Not very interesting. These Japanese gardens are ok but not very special. That also goes for the Japanese food in the restaurant."
        }, 
        {
            "index": 513, 
            "rating": "3", 
            "review": "Not so great. Parque 3 de Febrero is time better spent. I had hoped for more, having seen the beautiful Japanese garden in Portland, Oregon. However, the one in Buenos Argentina has little to offer. But for 8 pesos, what does one expect? The flower show that happened to occur when we visited displayed some stunning varieties. The signs everywhere telling visitors not do climb rocks, touch the fish, or walk on the grass became a source of amusement, and they detract from what peaceful beauty one might try to conjure. If you are short on time, go next door to Parque 3 de Febrero. The rose garden and lake are pretty. The people watching (as they jog, walk, roller blade and bicycle around the lake) is great. The museum had some good art when we were there, and, it's free."
        }, 
        {
            "index": 514, 
            "rating": "5", 
            "review": "Beautiful and relaxing. I liked the Japanese Garden quite a lot. It's a great way to get some sun, take a peaceful stroll, and relax in the big city. The pond contains tons of koi.As in any other park in Buenos Aires, you will see young people kissing everywhere. This kind of happiness is wonderful to see. Act like a local and kiss your loved ones in public on a bench in the gardens!Be sure to stop at the \"Oraculo de la Suerte\" - oracle of luck - and leave behind a note for whatever you're seeking. The sign says that you can purchase the papers at the Casa de Artesan.My friend and I were lucky, there was a special event for the Manga & Anime festival, so many locals were at the park in all sorts of interesting costumes. This event happens twice per year.When we visited, it was 8 pesos per person."
        }, 
        {
            "index": 515, 
            "rating": "3", 
            "review": "If you don't have a lot of time - skip it. The park is nearby the MALBA art museum. On the way there you get to walk through some large parks but watch out, this is favorite stomping grounds for the dog walkers. Oddly, they prohibit photography but if you ask, they will give you a \"press pass\" to wear and you can take photos. Once inside, I saw nobody with a photo pass so I don't think this is enforced. It was a nice stop - but if you are short on time, skip this attraction."
        }, 
        {
            "index": 516, 
            "rating": "5", 
            "review": "Relaxation and quiet from the city, a must walk. Spend an hour to chill from the noise of the city. Walk to malba museum and enjoy the art."
        }, 
        {
            "index": 517, 
            "rating": "5", 
            "review": "Amazing. I appreciated this visit a lot for many reasons: I could enjoy the landscape, meet tne ancient culture, discover the Koi fishes. I loved the Bonsais. Wonderful place!!! Beautiful souveniers."
        }, 
        {
            "index": 518, 
            "rating": "4", 
            "review": "Nice and interesting.. We enjoyed our visit. There was a lot of maintenance by the garden crew in the morning. We went on a weekday for 8 pesos a person. Took some photos and had a few drinks at the outside snack shop. Not exactly an Argentine experience but a nice little venture if you are nearby."
        }, 
        {
            "index": 519, 
            "rating": "1", 
            "review": "Restaurant gets a ZERO, garden gets a 10++. Restaurant is total garbage. AVOID. Tried to order a beverage and bite, waitresses were busy gossiping. Food, well never saw any, after 30 minutes, had to leave. Garden, beautiful. Second trip to BA and the garden was the most delightful in the city. A must see attraction. Admission was 8 pesos and well worth it."
        }, 
        {
            "index": 520, 
            "rating": "2", 
            "review": "Only if you're in the area and have got time to kill. I thought these gardens were quite ordinary (and small). If you're in the area and have got time to kill you might want to go in and have a look but otherwise I wouldn't make an effort to get to them."
        }, 
        {
            "index": 521, 
            "rating": "3", 
            "review": "Worth a visit if in the area. We enjoyed our brief visit here. Although the entrance fee is currently 8 pesos per person at weekends. It doesn't quite match some of the gardens you may find in Tokyo and the traffic roaring around the edges doesn't help the atmosphere tremendously. But the pretty pathways and ponds make for a pleasant stroll."
        }, 
        {
            "index": 522, 
            "rating": "5", 
            "review": "Peace and Beauty garden in a metropolis. Going to Buenos Aires, make you think about Tango, bookstores, soccer, but you can have a time for the simple beauty of a Japanese Garden.Filled with beautiful paths within ponds with carps, pine trees and Japanese-style ornamentation, it's a jewel of tranquility inside the stress of a big city. The Japanese garden is worthy to go, principally after walking around inside the Zoo - the other side of the street. The most beautiful photos of BA were taken there.There's a fine Japanese restaurant inside, with a fair service and magnificent view of the garden."
        }, 
        {
            "index": 523, 
            "rating": "3", 
            "review": "Nice but definitely not the best I've seen.. Nice diversion if you have a week or so in BA. I thought the garden was small and off the beaten path. It was well maintained but the Restaurant was closed the day we went. No real exotic plants. If you just want to relax this may be for you but I found it quite boring. It only takes about 45 minutes to see everything."
        }, 
        {
            "index": 524, 
            "rating": "5", 
            "review": "relaxing and peaceful, good Japanese restaurant on premises. If you are in the area, definitely stop by. Unlike other attractions in BA, this is not free, but the admission was very modest (less than $2 I believe). There are koi and you can buy food for them. The gardens are not big, but very pleasant, with birds drinking from water fountains, koi begging for food, pleasant flora, bridges, and a waterfall. We had a great sushi lunch and the cafe in the garden. The food was fresh and tasty, and the prices were reasonable. Don't miss the tuna dumplings appetizer -- super delicious!"
        }, 
        {
            "index": 525, 
            "rating": "5", 
            "review": "Quiet & Peaceful urban insert. The Japanese Gardens offer a great city escape right in the hub of Buenos Aires. There is a small admission fee, which includes an un-timed visit in the gardens and access to the restaurant. The plants, sculptures and scenery is beautiful and truly a great for a city getaway, right there in the city."
        }, 
        {
            "index": 526, 
            "rating": "5", 
            "review": "Second Largest Outside Japan...Lovely!. The entrance fee is $5 pesos (approx. $2.50 dollars)...It's so calm and beautiful in this place...Lovely little lakes filled with Koi fish...And the landscaping is just gorgeous...Well worth the inexpensive entrance fee....I loved it..."
        }, 
        {
            "index": 527, 
            "rating": "4", 
            "review": "A cute little oasis in the middle of the city. The Jardín Japonés was very sweet - lovely to look at and a nice little wander, or a bit of a bask in the sunshine. However - don't come in the week - there are lots of groups of school children who just spoil the tranquility with all their shouting. Its best on a weekend."
        }
    ]
}