{
    "category": "Cape-Town-Central", 
    "entity": "Twelve-Apostles", 
    "avg_rating_stars": 4.551378446115288, 
    "review_count": 399, 
    "rating_stats": {
        "poor": 2, 
        "average": 26, 
        "terrible": 2, 
        "very_good": 113, 
        "excellent": 256
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "A must see. Depends on how you count Might count 12, 9 or more. Lovely view of this site can be seen from several different vantage points. Definitely a sunny day experience"
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "Beautiful setting. On our recent visit to Cape Town we visited this hotel for a meal with our friends. The views from the terrace over the ocean were breathtaking and the sunset a spectacle not to be missed. We dined in the main restaurant at a table with ocean views, a constant reminder of the setting, the staff were all so professional and friendly without being intrusive a real pleasure to have them waiting on. The meal was absolutely excellent and was served with little added extras that were surprising and different, the wines were very good.I would thoroughly recommend a visit to this hotel to savour the sunset and sample the wonderful fare on offer."
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "Very special setting and food. This was the first place we ate in Cape Town on our holiday. It set a very high bar!! We went for dinner so didnt really benefit from the spectacular views that we saw on our second visit during the day. The restaurant was decorated beautifully and combined elegance with style. I was very impressed with the overall ambiance. The service was very good and our waiters helpful when we were choosing nwhat to eat and drink. I can definitely recommend the Chenin Blanc it was one of the best I have had. My food choice was catch of the day and a huge sea bass was placed in front of me with fresh veggies. Perfwct is all I can say."
        }, 
        {
            "index": 4, 
            "rating": "4", 
            "review": "Lovely drive.. You can't miss these as you drive down to Cape Point. It's a lovely area and it's novel point of interest along the way."
        }, 
        {
            "index": 5, 
            "rating": "5", 
            "review": "4 day visit in September. Very nice hotel, very helpful staff, good food and great location.The staff assisted us with late pick up on a tour, and were very professional. The breakfasts are wonderful!"
        }, 
        {
            "index": 6, 
            "rating": "4", 
            "review": "Wonderful rock formation. The Twelve Apostles are visible from Table Mountain and on the drive along the coast. They are most dramatic when the sun plays of the face of the ridge."
        }, 
        {
            "index": 7, 
            "rating": "4", 
            "review": "Lovely hotel with fantastic views. The Twelve Apostles hotel is a little way out of town, but once you are there, you really don't need to leave, but just chill out, eat great food and sleep a dreamless sleep....add into the mix a spa treatment or two and you have the answer to most of your problems. The staff are excellent and one feels cosseted. I would recommend this hotel for R&R and the sea air just adds a little something to the mix."
        }, 
        {
            "index": 8, 
            "rating": "5", 
            "review": "Tour Bus.. We passed the 12 apostles the day we travelled around Cape Town on the hop on hop off tour bus.They looked excellent but there are a few more than 12...."
        }, 
        {
            "index": 9, 
            "rating": "4", 
            "review": "More than twelve!. This ridge of rocky bastions flanks the western seaboard of greater Cape Town, leaving but the narrowest of strips of land between the mountains and the sea. Residential land is therefore, at a premium and parking is normally a nightmare - over the holiday season, almost impossible. Best way to get there if you are a visitor to Cape Town, is to use the red hop on hop off bus, as there are several places along Victoria Drive where good photo ops can be found."
        }, 
        {
            "index": 10, 
            "rating": "4", 
            "review": "Quite a Beauty. Quite beautiful to watch these natural formations in the mountain from the highway while traveling to Cape of Good Hope from Cape Town or from the table mountain or an helicopter ride."
        }, 
        {
            "index": 11, 
            "rating": "4", 
            "review": "Impressive. These are actually 12 geological formations in the mountains in Cape Town. You can see those from the Table Mountain and also from the highway. Not worth a hike."
        }, 
        {
            "index": 12, 
            "rating": "5", 
            "review": "12 Apostles, Cape Peninsula, South Africa. A striking mountain formation with 12 distinct outcroppings named by early European settlers. The highway passes along the Atlantic Ocean on the west and the 12 Apostles on the east."
        }, 
        {
            "index": 13, 
            "rating": "5", 
            "review": "The welcoming reception from the beginning-very friendly staff.. The best the magnificent view.\nHigh tea is a must at the 12 apostle-Service excellent.The eats to die for.Take your time-without no hurry."
        }, 
        {
            "index": 14, 
            "rating": "4", 
            "review": "Beautiful geological formations. You can see the Twelve Apostles in variety of ways. The best is probably hiking but we did not do that due to complicated logistics. The easiest is to see the Twelve Apostles from the beach or the highway. The City Sightseeing buses allow for a good view of the Twelve Apostles. The guide emphasized that there are more than 12 formations. Cross-cutting faults separate multiple peaks of the Twelve Apostles. Overall quite impressive powerful creation of nature."
        }, 
        {
            "index": 15, 
            "rating": "4", 
            "review": "Good view of the Apostles from Camps Bay area. We've seen the Twelve Apostles both from Camps Bay and on our way to Cape Point, as well as from Table Mountain. You can have a really good view from the Camps Bay area, and take the pictures like the ones here on TripAdvisor. We didn't do the hiking, but I also don't think it's really worth it that much."
        }, 
        {
            "index": 16, 
            "rating": "3", 
            "review": "Meh. I came here because of all the rave reviews. The location is easily one of the best in the world. But also, it's extremely isolated. You must book a car (uber) or have one to get here. Also, welcome to the 90s. The hotel knows how famous it is because it seriously needs an updating. it feels like it was done in 1992. and it's much smaller than you think. Go for a very expensive drink, get your pics then go back to the Mount Nelson:)"
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "Beautiful . The apostles definitely define the terrain and gives Capetown all its beauty. It doesn't hurt that Table Mountain and Lion Head lie directly next to them either. This was definitely the most beautiful sight out if our villa's windows."
        }, 
        {
            "index": 18, 
            "rating": "5", 
            "review": "Stunning area, better views of the mountain than the main area. Stunning beaches and fantastic views of the mountain. Better side than the waterfront area and gets great afternoon sun and the best sunsets. Lots of activity in the area."
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "Great ambience and world class. Excellent for all types of occasions.. Soothing mountain and sea views.lots of excellent facilities, great hotel and many more to see, experience and do."
        }, 
        {
            "index": 20, 
            "rating": "5", 
            "review": "beautiful Ste. we had the opportunity to see the 12 Apostles, we took many beautiful pictures it is worth the visit."
        }, 
        {
            "index": 21, 
            "rating": "4", 
            "review": "Went for drinks. Did a walk terhrough of hotel, lovely. Went for drinks in Leopard lounge, fabulous view. Only downside I could see to hotel is the somewhat isolated location"
        }, 
        {
            "index": 22, 
            "rating": "3", 
            "review": "Nice. I didn't realise where I was until my friend, who lives in Cape Town, pointed it out. The beach the apostles are looking out on to is beautiful apart from people selling crap and calling you sweetheart."
        }, 
        {
            "index": 23, 
            "rating": "5", 
            "review": "Great boutique hotel. My family and I spent 4 days at the 12 Apostles in Cape Town. The staff is very gracious and most helpful. The amenities are great and so is the ambiance. The view from the leopard bar is spectacular, great sunset pictures. Pools are lovely but a little cool when we were there so we didn't take advantage of them. We were busy doing all the tourist things. The hotel does have a shuttle that will bring you into Cape Town proper and that is great. We also used the shuttle for a trip to Table Mountain. I certainly wouldn't hesitate to recommend this hotel but remember, it is not in walking distance of any attraction. They also have a great health program that my daughter took advantage of. She is a runner and they have people who will run with you. This is also available for hiking and bike riding. There is no charge unless equipment is required, like a bike. Overall, what a wonderful experience!!"
        }, 
        {
            "index": 24, 
            "rating": "5", 
            "review": "\"GREAT FROM A HELICOPTER\". Me my wife and son flew over the twelve Apostles in a Helicopter,great views of the Apostles and all of Cape town.Would highly recommend as was a once in a lifetime experience"
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "breathtaking. One of the world's most beautiful drives, from Camp's Bay to Hout Bay, the mountains towering on one side, the cold Atlantic on the other, touching either snowy white beaches or ricky shores. "
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "Beatiful. You can get a great view from Camp's bay. The mountain is beautiful and one of God's great creations ."
        }, 
        {
            "index": 27, 
            "rating": "5", 
            "review": "a lovely meal. We have been travelling as a family but on this evening we had a dinner for 2 booked. A fantastic menu with lots of choice very attentive staff and wonderful wine. Experts on hand to help with selection. You would think expensive but for three courses and a lovely bottle of wine it was only 2000 rand which we thought was good value. A lovely romantic evening ! thank you"
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "Mountain side retreat. A wonderful afternoon spent at the 12 Aapostles hotel and spa.Glass of sparkling wine and enjoyed the sunshine, and beautiful sea views post spa. Always a treat for body mind and soul."
        }, 
        {
            "index": 29, 
            "rating": "5", 
            "review": "Fantastic. From the moment we arrived until we packed our car to leave, we were very well looked after. Rooms were beautiful and well maintained and the staff went out of their way to make the entire family feel welcome. A short but wonderful stay, definitely my hotel of choice when I am next in town"
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Great bars and scenery.. Very nice area to have a drink and look out at the ocean. Took the hop on and hop off bus which was an awesome experience."
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "Always a pleasure!. We went for a pre-birthday lunch cocktail and bubbly on the 9th of August. As always the drinks and eats were fantastic! The Leopard lounge veranda has a view to dream of and one I will never get tired of! Service is always friendly and professional."
        }, 
        {
            "index": 32, 
            "rating": "4", 
            "review": "Nice Hike. So I want to make sure you are reading the right review. This is about The Twelve Apostles Mountain Range which extends from Table Mountain, above Camps Bay, in the direction of Hout Bay, to Llandudno. The range is called this because the mountain range has twelve peaks which are easily distinguishable. If you are looking for The Twelve Apostles Hotel and Spa, I think they have their separate reviews page. So in terms of the Twelve Apostles Mountain Range, you can drive it (it is very scenic) or you can hike it (there are a few areas to hike). The hikes are relatively flat and offer spectacular views over Camps Bay. Depending on what you do, the hike can take around 4 hours if you do the whole trail."
        }, 
        {
            "index": 33, 
            "rating": "4", 
            "review": "twelve apostles. 12 mountains called 12 apostles... nature at its best with breathtaking sea views. the sea, the sun, the wind and the hiking trails"
        }, 
        {
            "index": 34, 
            "rating": "5", 
            "review": "A bit of heaven. Stayed four nights at the A12. Had an ocean view room which I would recommend. Gorgeous views all day and, of course, sunset. The staff were professionals and very friendly. That has become important to me. The Azure restaurant was everything advertised, and I loved the Leopard Bar as well. The rooms were spacious, and comfortable. For gosh sakes, they have seven available pillow variations. They have shuttle to the V&A Waterfront. The concierge was extremely helpful. Highly recommended."
        }, 
        {
            "index": 35, 
            "rating": "4", 
            "review": "Breathtaking views. Fine dining at it's best.The wine-paired menu a culinary delight.A bit expensive on the pocket as it's probably priced for the foreign tourist,but definitely worth the treat."
        }, 
        {
            "index": 36, 
            "rating": "5", 
            "review": "Just a photo opportunity. Beautiful background for photos. Apparently it can be trekked but we just passed it on bus. Trip to a rial vantage point possible with car"
        }, 
        {
            "index": 37, 
            "rating": "5", 
            "review": "A must for High Tea. A yummy spread of tea and cakes for High Tea. Breathtaking view of the sea. A wonderful experience overall."
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "Photo opportunity. Just drive along the beach road, and around the bend and there they are staring down at you. Parking opposite gives you time to get a great view and time to take a great photo"
        }, 
        {
            "index": 39, 
            "rating": "4", 
            "review": "Luxurious and stunningly beautiful.. Luxurious and stunningly beautiful. The location itself provides wonderful scenery and the hotel has a wonderful spa in with a cave like feel."
        }, 
        {
            "index": 40, 
            "rating": "3", 
            "review": "12 apostles. A drive by area that is most interesting for tourists who love nature and want to experience the drive down to the Cape.Family friendly adventure"
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "Luxury Hotel. Away from bustling Cape Town and nestled at the foot of Table Mountain, is this gem. We stayed in an ocean view suite which was wonderful. The hotel staff were so hospitable and nice; the food was excellent; the ocean view was so beautiful."
        }, 
        {
            "index": 42, 
            "rating": "5", 
            "review": "Great Excercise, stunning views. The Twelve Apostles are majestic and stunning. When taking the hop on, hop off bus (which I highly recommend) towards Hout Bay, you will get some spectacular views of the Twelve Apostles. The mountains are so majestic and in a perfect location and part of the Table Mountain Nature Reserve. Have your camera ready, because you will have a short window of opportunity to snap a good picture. Simply stunning!"
        }, 
        {
            "index": 43, 
            "rating": "5", 
            "review": "Destination South Africa. Set against the stunning backdrop of the 12 apostle mountains, this boutique hotel commands a dramatic view of the sea.It specialises in being small but perfectly formed and the staff are there to indulge guests' every whim. Food is excelent and there is a great mountain walk from the hotel."
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "This row of mountains are an amazing sight. Capetown boasts of a wide array of sights so lovely to behold: old & quaint villages; beaches galore, sea-lions and penguins plus a lot more...Twelve Apostles is a must see."
        }, 
        {
            "index": 45, 
            "rating": "5", 
            "review": "Views to Die For. If you happen to be in Camps Bay or Clifton and are looking down the coast towards Hout Bay, you will be looking down the row of mountains called the Twelve Apostles. This is a spectacular view, especially when the 'Tablecloth' of cloud spills over the edges of these rocky outcrops, making it look like a cauldron boiling over and spilling down to the sea. There are a couple of restaurants where you can sit facing the mountains (not on the main Camps Bay drag) and just soak in the view."
        }, 
        {
            "index": 46, 
            "rating": "4", 
            "review": "One of the great reasons for driving down to the Point. Views along route to and from the the Point take you thru high-end towns, quaint fishing villages, lovely beaches, penguins etc., but it's the majesty of the mountains that will remain your lasting image of all the is beautiful about the Cape."
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "Breathtaking, Luxurious, and Perfect. This hotel was part of a South Africa tour package, so we didn't know much about it other than the reviews on trip advisor and the praise that our travel agent gave. The location is a little out of the way, but not that far from Cape Town if you have a car (about a 5 minute drive to Camps Bay or 15 minutes to V&A waterfront). There is a free shuttle service from the hotel to these areas which is great if you don't have a car. From the moment you arrive, you are treated like you're in first class. Your check in agent goes over your itinerary and offers you a variety of drinks, then they takes you on a tour of the facility going over details of hours and what services they offer. We were then escorted to our rooms (303 and 304 for a family of 5) which were not connecting but the entry doors were perpendicular to each other. These two particular rooms were at the end of the facility which meant room 304 had an incredible view to the 12 apostles rock formation while room 303 had an open balcony with a spectacular sunset view to the ocean. FYI, the balconies on this level are all connected and are not partitioned off so anyone could walk from one side to the other. However, I never felt this was an invasion of privacy or a security risk. I have to reiterate the sunset view from this room was absolutely breathtaking. Also, the attention to details in each room were so well thought of. For example, all the remote controls for HVAC and TV's were sanitized and individually wrapped. My favorite part was the high pressure rain shower, really refreshing after a long day of touring or shark diving. The kids loved the heated pool and small movie theater with popcorn and milkshakes. The property itself was really amazing with walking trails, helicopter pad, picnic tables with incredible views to the ocean and the mountain backdrop. The restaurant for dinner was very good, but the breakfast buffet was fantastic. There were so many variety of fruits, breads, and hot food that it was good that we stayed multiple days to try everything. Every member of the staff were full of smiles and they were extremely helpful with any questions or request we had. All in all a wonderful choice for anyone who wants a top notch hotel with an amazing view of the ocean near Cape Town."
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "Amazing. We spent the afternoon at Camp Bay and watched the sunset, on one side you have the sun hiding behind the sea, and on the other you have this incredible mountains all dyed in red making an incredible scenario. Afterward we had dinner at one of the many great restaurantes there."
        }, 
        {
            "index": 49, 
            "rating": "5", 
            "review": "TOP LOCATION. We enjoyed a food and wine pairing evening and weekend stay at the hotel with excellent choices of pairing, food was very delectable apart from desert accompanied by liquid nitrogen foam finish which it not to my personal liking. Otherwise great dining experience with fine dining options and incredible view. Great hotel to spend a weekend indulging in delicate food and shopping or simply relaxing in the spa. Part of the Red Carnation Group, this is a hotel which is distinct in style. Breakfast buffet is quite a spread with great touches including fresh oysters, champagne and mussels."
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "Beautiful Hotel. It is small but cozy. Excellent for Honey Moon. The services there was great. The out door sitting area was great too. Also with a good view from the out door sitting area too."
        }, 
        {
            "index": 51, 
            "rating": "4", 
            "review": "Just the palce to get away from it all but not be far away from anything. We have stayed here before and the accommodation is beyond 5 star. On our last visit we just went for drinks and as usual it was a great atmosphere, the staff are always friendly and accommodating, the items on the menu, wine and drinks list are great. Al in all a fantastic place to get away from the hustle and bustle of the city of suburbs and yet not be far away at all. Try a sunset or sunrise drive along the coast to or from here, it is unforgetable"
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "Twelve Apostels -competition to Mount Nelson's High Tea?. To enjoy 'High Tea' at the Twelve Apostles you can either sit in the cozy lounge-area of the bar or on it's balcony overlooking the sea. The view on all sides include Camps Bay, Lion's Head, Victoria Road to Hout Bay and obviously the Twelve Apostle range. Choose from the delicious cake selection or go to the savory display- it's all worth your money. Friendly and efficient staff complete the perfect surroundings."
        }, 
        {
            "index": 53, 
            "rating": "4", 
            "review": "Famous View. The view is breath taking. You will not want to miss this view from the Camps Beach or Clifton! You will enjoy!"
        }, 
        {
            "index": 54, 
            "rating": "5", 
            "review": "Cape Town's finest. The 12Apostles is nestled along the coast a few kilometers south of CapeTown. The views of the sunrise and sunset are breathtaking! They can be viewed from the Leopard Lounge balcony while imbibing your favorite cocktail. The 5-star hotel has a wonderful spa facility and one of the best breakfast buffets I have ever witnessed. The staff is extremely helpful and friendly. Possibly the finest hotel I have ever stayed with."
        }, 
        {
            "index": 55, 
            "rating": "4", 
            "review": "Beautiful - but harder to get near than you think. As ever the best way to enable an attraction to be created is to link it to some sexy biblical term and this is just what has been done here but let me add quickly they are very pretty."
        }, 
        {
            "index": 56, 
            "rating": "5", 
            "review": "Beautiful Nature. My best view of the Twelve Apostles was from Camps Beach, which I reached via the red sightseeing bus, it is a lovely natural landmark and I have some beautiful photos."
        }, 
        {
            "index": 57, 
            "rating": "4", 
            "review": "Beautiful!. Yet another breathtaking place to visit in Cape Town. Recently went to the Twelve Apostles during my trip to the Mother City. Simply beautiful - lovely views, amazing vistas. Fantastic"
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "Beautiful stop. Loved the views from the spot where we visited. This is such an amazing natural mountainous formation...not to be missed."
        }, 
        {
            "index": 59, 
            "rating": "5", 
            "review": "Photo Opportunity. Here with guide and we just stopped for pictures. A bit chilly early in the day and not suitable for beach activities in May when there. Beautiful scenery and great for those group shots!"
        }, 
        {
            "index": 60, 
            "rating": "5", 
            "review": "Natural Wonder. Best views are from the beach. I have a great panorama shot from Camps Bay. Hard to rate a natural wonder but it is beautiful."
        }, 
        {
            "index": 61, 
            "rating": "5", 
            "review": "Stunning natural feature. The Twelve Apostles are majestic and stunning. When taking the hop on, hop off bus (which I highly recommend) toward Camp's Bay Beach (which I also highly recommend) you will get some spectacular views of the Twelve Apostles. Have your camera ready, because you will have a short window of opportunity to snap a good picture. Trip was in November 2013, bot 2015 - but I'm sure the Twelve Apostles, which have been there for millions of years, haven't changed in the last couple of years."
        }, 
        {
            "index": 62, 
            "rating": "4", 
            "review": "A Great View while having sundowners. A very good place to have sundowners at the Leopard Lounge and to see the sun set over the sea . The Azure restaurant has delicious food , albeit a little expensive if you earn and pay in rands but spending dollars , euros or pounds this is a lovely place to go to . The Spa is in a cave with lovely facilities and you can also have a massage with panoramic views . Well worth to spend some time at the Spa and then sundowners ."
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "Amazing views from the beach.. Amazing views from the beach (Camps Bay and Hout Bay). No doubts this is an amazing mountain to hike and also to watch from a comfortable spot near the beach."
        }, 
        {
            "index": 64, 
            "rating": "4", 
            "review": "Can be best seen from the beach. Interesting rock formation adjacent to the Table Mountain. Can be best seen from the beach. I had to count more than once to find all twelve."
        }, 
        {
            "index": 65, 
            "rating": "5", 
            "review": "Amazing sight. This mountain range is brilliant to see.i have not stayed here, but have driven by one a tour bus and flown over on a helicopter trip and they are quite outstanding to see"
        }, 
        {
            "index": 66, 
            "rating": "4", 
            "review": "Nice venue for special occasions . Located South of Camps Bay beach on the road to Chapman's Peak. Most beautiful scenery in Cape Peninsula. Famous for sunset watching. Old style very luxury hotel with popular formal dining restaurant and Leopard Bar named more casual restaurant."
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "Beautiful views and better service!. I thoroughly enjoyed this restaurant from the outdoor deck to the inside leopard lounge! Perfect for cocktails and sundowners and then after dinner herbal teas on the sofa! So cosy and able to watch sports inside the bar area."
        }, 
        {
            "index": 68, 
            "rating": "5", 
            "review": "Beautiful!. The Twelve Apostles is a chain of rocky mountains named after the Jesus' Disciples. They form a superb view. Not to be missed."
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "Oh this is five star casual!. Relax at the Leopard bar. Listen to Jeannie playing and singing her sweet songs ! Have s sundowner as the sun sets and the light plays on the sea."
        }, 
        {
            "index": 70, 
            "rating": "4", 
            "review": "Stunni Mountains. Great scenery. It's a nice drive down to Judas peak with lots of photo stops along the way.There are actually 17 or 18 peaks but who cares about minor details!"
        }, 
        {
            "index": 71, 
            "rating": "5", 
            "review": "Amazing. Capetown is an amazing city with a lot of natural beauty.We found that the bus tour was the best way to see and it was a wealth on information with the recorded audio sessions. We were fortunate to have a lovely sunny day on our day trip"
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "Interseting Mountain Peaks.. We viewed the Twelve Apostles mountain peaks from the beach.An amazing natual range of mountains that include Table Mountain."
        }, 
        {
            "index": 73, 
            "rating": "5", 
            "review": "A stunning coastline. This is such a beautiful part of the Cape Peninsula. As you drive along the coast from Camps Bay to Hout Bay, the views are so different."
        }, 
        {
            "index": 74, 
            "rating": "5", 
            "review": "Part of the Pennisular Tour. As one does the Pennisular Tour you see the 12 Apostles which is a great photographic opportunity. Certainly recommend this tour and the sights."
        }, 
        {
            "index": 75, 
            "rating": "4", 
            "review": "Breathtaking views. There is so much to do in this stretch along the Twelve Apostles. There is something for the beach lovers (Camps Bay), thrill seekers, nature lovers, shopaholics, discerning traveller (stunning places to stay). I usually go to Camps Bay for a sundowner and take beautiful photos of the sun setting in the west. Definitely the place to be for locals and foreigners."
        }, 
        {
            "index": 76, 
            "rating": "3", 
            "review": "A lot more to view here than the 17 apostles!. Being that there are more than \"12\", the view or enjoyment is limited. They are scenic and you can't help but admire the rugged look / view. But the mountain just before is overwhelming. ( Table Mountain \" !"
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "Gorgeous, friendly luxury hotel overlooking the ocean. We are now on our third visit to the Twelve Apostles and we love ever moment of being here. From the moment we arrive we feel welcome and well looked after. It is African hospitality at its finest! We have two children who are incredibly well catered for and made to feel it's all about them, yet it is not overtly a family hotel do if you are travelling without children don't worry - you will hardly notice them!"
        }, 
        {
            "index": 78, 
            "rating": "4", 
            "review": "Spa Day. I was treated to a spa day here at The Twelve Apostles. It was actually rather lovely and I throughly enjoyed it. I have given 4 stars instead of 5 due to a few little things rather than the quality of the treatments, which were superb. The spa is very relaxed and you are given a nice gown and slippers for the course of your day. The room that I was allocated for my treatments was absolutely tiny and could barely accommodate a bed and a therapist - they are certainly optimising their space! That being said it doesn't affect the quality of the treatment but doesn't quite equate to a feeling of full Five star luxury. My day kicked off with a full body scrub, very nice. The room is too tiny to have a shower so the therapist left the room to start a shower for me in the changing rooms and left a new gown and slippers, clean towels etc. You were looked after well but again having to leave the room to shower in the changing room and then return for the other treatments just doesn't quite cut it in my book. I then and a full body massage and a facial both of which were superb. Just one thing Twelve Apostles if you are going to have a display under the facial cut out in the massage bed you really should make sure that it is clean, although I do like to close my eyes if you did look down it really wasn't such a lovely view. Overall though I really enjoyed my treatments and felt super relaxed when I left."
        }, 
        {
            "index": 79, 
            "rating": "5", 
            "review": "Friendliest luxury hotel beneath magnificent mountain peaks. This hotel is in a unique setting - the only building along a stretch of azure ocean beneath the spectacular 12 Apostles Mountain peaks. The view out over the ocean is beautiful and there's a good chance of see whales and dolphins. At the back of the hotel there are swimming pools set in the Cape's unique fynbos garden with stunning views of the mountain. The hotel itself is tastefully appointed. The staff are always welcoming, even if you arrive in your cycling gear. The food is excellent."
        }, 
        {
            "index": 80, 
            "rating": "5", 
            "review": "Great experience. From the very moment of arrival, until the very last second of our stay it was an absolutely wonderful stay.I cannot imagine that any hotel could be any better when it comes to customer service."
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "Beautiful Location. Wonderful Staff. Class all the way.. I love it here. Well made cocktails on the balcony overlooking the sea. It's luxury. The staff are efficient and friendly and the atmosphere is pleasant. I, personally, am not a big fan of the decor in the cocktail lounge as for a place so classy it's just a 'bit much' and boarders on tacky. Less is more!! but that's hardly a deal breaker."
        }, 
        {
            "index": 82, 
            "rating": "5", 
            "review": "Twelve Apostles Hotel in Capetown is Special. Last month, I has the pleasure of visiting the Twelve Apostles Hotel just outside of Capetown, SA. It overlooks the ocean and has great bar, The Leopard Bar. The hotel is small, but the food is outstanding and their spa is also excellent. It's pricey, but well worth the stay."
        }, 
        {
            "index": 83, 
            "rating": "5", 
            "review": "Special Event. Was a special event and a large gathering. Table settings were wonderful. Food was great, service was very good. Views from veranda are superb of the ocean"
        }, 
        {
            "index": 84, 
            "rating": "5", 
            "review": "Breathtaking scenery - can you count them?. We viewed the Twelve Apostles - the mountains that overlook the shore over beaches like Camps Bay which is a short drive from Cape Town. The scenery is outstanding and well worth taking the trip on the tour bus."
        }, 
        {
            "index": 85, 
            "rating": "5", 
            "review": "Superb and scenic. The Camps Bay beach experience was excellent - the good weather gave you a magnificent view of the Apostles - highly recommended."
        }, 
        {
            "index": 86, 
            "rating": "5", 
            "review": "Outstanding service . My wife and I spent a week at the hotel recently. It was our first trip to CapeTown. The service provided by the hotel far exceeded expectations. From arranging a personal safari (last minute) to assisting with medical challenges, the entire staff went above and beyond from my side. The hotel was beautiful, including the location, but the service provided is the reason we would return. Shaun"
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "Good drive.. When driving back from Cape Point we had a great drive by the Twelve Apostles- very impressive. The day before on the hop on hop off bus they had been shrouded in mist which shows the vagaries of the Cape Town weather."
        }, 
        {
            "index": 88, 
            "rating": "5", 
            "review": "Stunning scenery along the coast.. There are more than twelve.... Take a Cape Convoy tour and hear more about the apostles and other landmarks around the Cape."
        }, 
        {
            "index": 89, 
            "rating": "4", 
            "review": "Hard to see. You can see some of the Twelve Apostles from the top of Table Mountain and there was a walking tour advertised from there as well, not sure where that goes. However, the best view I got was from Camps Bay. Go down to the beach...then you get a great view of those Apostles!"
        }, 
        {
            "index": 90, 
            "rating": "3", 
            "review": "Overpriced. Super nice location but you pay for that. The food is ok but not for the price you pay. Good wine list and menu."
        }, 
        {
            "index": 91, 
            "rating": "5", 
            "review": "Definately worth seeing.. We were in Camps Bay for lunch. The apostles are not the most photographed view of Table Mountain but are spectacular particularly if the clouds are low."
        }, 
        {
            "index": 92, 
            "rating": "5", 
            "review": "Amazing. We were on the city sightseeing bus when we saw the 12 apostles for the first time. We were amazed at how beautiful the view was."
        }, 
        {
            "index": 93, 
            "rating": "5", 
            "review": "Fine Dining. Had a thoroughly enjoyable dinner and movie experience. Our waiter was top class. The food absolutely delicious. The presentation of each dish was just beautiful. Unfortunately the wind blew gale force but we nonetheless enjoyed the ambience inside. After dinner we were ushered to the cinema for milkshakes, popcorn and a movie."
        }, 
        {
            "index": 94, 
            "rating": "5", 
            "review": "Most amazing culinary experience I have ever had. The restaurant is one that you have to visit. Absolutely amazing food. The view and ambience alone are worth it"
        }, 
        {
            "index": 95, 
            "rating": "4", 
            "review": "Backdrop to Camps Bay Beach. The 12 apostles is part of the Table Mountain range that extends south of Cape Town down toward Cape Point. The perfect place to experience it is at Camps Bay beach."
        }, 
        {
            "index": 96, 
            "rating": "5", 
            "review": "Excellent hotel. I think I already reviewed this hotel earlier, but to reiterate, it is a wonderful hotel with great staff and food. One caveat was that, while we had an excellent room, others in our party did not have a stand-alone shower in their room. It was in a very slippery bathtub, so they were concerned about falling. We did not know about this until after we all had left. Our shower was fabulous and since we all had paid the same price, we remain curious about this type of room."
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "Simply stunning. Take a car, park it at one of the Clifton beaches, grab a cold drink and walk along the beaches staring at awe at the 12 apostles and then if it's warm enough going down to one of the beaches or hidden coves for a dip. But be warned - the Atlantic can be chilly!"
        }, 
        {
            "index": 98, 
            "rating": "5", 
            "review": "Fantastic Craft beer and food pairing. We did the craft beer and food pairing in the laid back Leopard Lounge. The sommelier really knows his stuff! He explained all the notes and which dish he recommends for that particular beer. The range of beers (5) is also great and the food was obviously excellent (and more than enough). I would recommend this fun activity to anyone who is a lover of craft beer and magnificent views!"
        }, 
        {
            "index": 99, 
            "rating": "4", 
            "review": "Phenomenal. Did a hiking from Table Mountain to Twelve Apostles ... Walked the 3 first peaks ... Great views !!Had to stop every 15 minutes to contemplate all that beauty !Will never forget !!"
        }, 
        {
            "index": 100, 
            "rating": "5", 
            "review": "Enchanting!. A firm favourite, excellent service, quality food, great cocktails and wine selection. Staff are friendly and attentive, one is always welcomed with a warm smile and treated with respect. Beautiful views of the atlantic ocean and a stunning bar with terrace - the Leopard bar. 12A is always a treat!"
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "close to heaven. while you have plenty of options to stay in a stylish B&B in capetown, this hotel is out of any categorie.very luxury and still homelike.the rooms are so nicely decorated with plenty of pillows that smell in a powdery better-world-way...the sea to the one side, the mountains to the other this besutiful gem is nestled cozy just at the right position.the reception offers subdried mangos as a give-away instead of candys and the delicious meal which started with an irrisistable sundowner on the terrace was topped with a movie in the private cinema with the rest of our table wine aswell as milkshake and popcorn...what a spoiled way to live...!!!"
        }, 
        {
            "index": 102, 
            "rating": "4", 
            "review": "Fabulous sunset and cocktails. We visited the Leopard bar for drinks and snacks and to watch the sunset. The service was a little slow but we were in no rush. Oysters and champagne for sure!"
        }, 
        {
            "index": 103, 
            "rating": "5", 
            "review": "Spectacular views, excellent cuisine. Loved the leopards leap bar and the atmosphere. This hotel has spectacular mountain views as well as sea views. I have stayed there and enjoyed the beautiful spa and access to the private cinema. The food was orgasmic."
        }, 
        {
            "index": 104, 
            "rating": "5", 
            "review": "amazing hotel. Fantastic staff, nothing was too much trouble. Room was outstanding with lovely garden view with private splash pool, would recommend to everyone."
        }, 
        {
            "index": 105, 
            "rating": "5", 
            "review": "Amazing views. When passing through Camps Bay on the sightseeing us, you get a very good glimpse of the Twelve Apostles. What a sight. This is just one of many places that are well worth a visit when I in Cape Town."
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "Amazing Spa Experience. The spa is built into a cave-like structure - very ZEN! Book yourself in for a treatment or three and take full advantage of their amenities.... whether for one or a group of friends. There is no time limit which is great if you want a full day of pampering. I will be back!"
        }, 
        {
            "index": 107, 
            "rating": "1", 
            "review": "Disappointing breakfast . We went to breakfast and were hugely disappointed. The setting and food was fabulous. The problem was the service. Waiters were not interested in us at all and the place was half full. It was a buffet so you use numerous plates which were not cleared just built up on the table. Ordered our cappuccinos 3 times. Help your self fresh orange juice was finished so asked the waitress to bring us someone when it is squeezed. Was told no I must wait and then fetch it. Real waste of an anniversary occasion especially when you pay a lot more than other places."
        }, 
        {
            "index": 108, 
            "rating": "4", 
            "review": "Overshadowing. The Twelve Apostles provide a magnificent backdrop along large parts of the Atlantic Seafront. In places such as Camps Bay beach they provide a beautiful backdrop to any photograph, and when you're there around sunset turning around will give you another good photo opportunity."
        }, 
        {
            "index": 109, 
            "rating": "5", 
            "review": "Great place for cocktails and sundowners. The upmarket 12 Apostle Hotel is a great place to appreciate the Atlantic Ocean and enjoy cocktails and sundowners. The Leopard Bar is a great venue. Hopefully there is place on the small terrace outside the bar, otherwise inside is just as pleasant."
        }, 
        {
            "index": 110, 
            "rating": "4", 
            "review": "Drinks at sundown. Wonderful place to see the sunset over a drink, mine was a delicious Martini. If you want to eat it's best to book as it gets very full in the evenings and at lunchtime due to spectacular views over the ocean."
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "Great location. We had a lovely meal in the terrace restuarant , good service nice atmosphere would definitely go again"
        }, 
        {
            "index": 112, 
            "rating": "5", 
            "review": "Twelve Apostles: Prominent site in Cape Town. The 12 Apostles or probably 17-18 form beautiful backdrop in CapeTown. The cloud cover adds to its beauty."
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "Awesome. Awesome landscape. Majestically stand as icon of the land.\nMust visit for the travelers. Weather was pretty cool in mid-Dec."
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "Beautiful. We pass there with hop-on-and-off city tour bus. Perfect. Breathtaking views and must visit place for photography lovers."
        }, 
        {
            "index": 115, 
            "rating": "3", 
            "review": "Good tales and geology studies. Ask a proper guide and you will hear so many stories and do ask about the coastal road construction too. The apostles refer to the 12 mountains behind the Table mountain."
        }, 
        {
            "index": 116, 
            "rating": "4", 
            "review": "Misnomer of a name . There are actually more than 12 peaks - maybe around 18 - so the name is a bit surprising. There is a crane peering out so it kind of spoilt the view for me. Having said that the wonderful mountain view across the ocean is really priceless. "
        }, 
        {
            "index": 117, 
            "rating": "4", 
            "review": "Beautiful trip. Nice trip and beautiful site. Especially at the end of the Afternoon when the Light is fading away and the sun goes down."
        }, 
        {
            "index": 118, 
            "rating": "5", 
            "review": "Twelve Apostles Hotel. Amazing accommodations and staff. Beautiful location overlooking the Atlantic Ocean and Twelve Apostles Mountain behind."
        }, 
        {
            "index": 119, 
            "rating": "5", 
            "review": "Fantastic location - Brilliant hotel. Went hereafter staying at One & Only in Cape Town. Very stylish with Paul Smith patterned carpet throughout and an incredible back drop with its own helicopter pad. Did have a few service issues, complimentary taxi forgot to fetch us from Camps Bay, and couldn't get table in the restaurant one evening but both were relatively minor and settled amicably."
        }, 
        {
            "index": 120, 
            "rating": "5", 
            "review": "Amazing sightings. It was just amazingly beautiful. I can't keep my eyes off from it. Our accommodation just located beside it."
        }, 
        {
            "index": 121, 
            "rating": "4", 
            "review": "Its a great view. But there are 18 Apostles. Nice view if you go around the Cape and take a drive down Chapman's drive. They say you can trek some of these. But views are best enjoyed from a bit of a distance - like from Clifton Beach, Hout Bay etc.,"
        }, 
        {
            "index": 122, 
            "rating": "5", 
            "review": "Wonderfull. We passed by twice for a delicious cocktail on their terrace. Beautiful views on the ocean, friendly staff, and the decoration is very well done."
        }, 
        {
            "index": 123, 
            "rating": "4", 
            "review": "Jesus not in sight but the 12 Apostles are!. Stunning views from yet another view point in Cape Town.\nThe hiking along here is great and plenty of people around so no need to feel lonely or worry about getting lost.\nPut on your hat, sunscreen and take plenty of water, no places to buy along the route."
        }, 
        {
            "index": 124, 
            "rating": "5", 
            "review": "Stunning! . Worth the trip south along the coast. Amazing scenery and right above Clifton beaches. Beautiful! MyCiti bus stops all along here for great vantage points for photos and beach access"
        }, 
        {
            "index": 125, 
            "rating": "5", 
            "review": "Sunset at Tuscany Beach. Everyone loves Camps Bay vibes - its safe - posh and has a pretty epic setting. I'm not the biggest fan because i don't think its a true reflection of Cape Town, BUT - it has the most beautiful sunset views - so my advice, take a date in the evening (summertime) around 8/9pm - head over to Tuscany Bar on the main road - make sure you get a window table (not on the street) and watch the sun set - its beautiful."
        }, 
        {
            "index": 126, 
            "rating": "5", 
            "review": "The best of both the berg and the sea. This is the highest quality of service, finishes, food, venue, facilities and staff, that you can wish for. Like a dream come true. You don't need to leave the hotel at all and if you wish they have a shuttle service to drop and collect at near by places. GREAT TO BE..."
        }, 
        {
            "index": 127, 
            "rating": "5", 
            "review": "Amazing views. Twelve Apostles can be viewed from anywhere near the Camps Bay beach. Make sure to check out the town of Camps Bay while you are admiring the view of the peaks. The town is charming with lots of places to eat and shop, then enjoy the beach and views!"
        }, 
        {
            "index": 128, 
            "rating": "4", 
            "review": "Very good high tea. The quality was very good. The staff is friendly and attentive. The atmosphere was lacking since the tables on the terrace are very small and of insufficient quality. On the other hand guests may enjoy wonderful views over the ocean provided it is not too windy."
        }, 
        {
            "index": 129, 
            "rating": "5", 
            "review": "You can see them from Camps Bay. I wouldn't necessarily call this an attraction, although they are beautiful. Any time you are on this side of Cape Town, the 12 Apostles will be staring down at you. Sometimes the clouds linger beautifully around them. Go to Camps Bay, check out the sights and sounds. You won't regret it."
        }, 
        {
            "index": 130, 
            "rating": "5", 
            "review": "naturally beautiful. No need for carving! This is perfect as it is. Perfect for a stroll by the beach after a meal at one of the restaurants."
        }, 
        {
            "index": 131, 
            "rating": "5", 
            "review": "dinner. Great view, food and professional staff! Went there for dinner, just such a clean and tidy hotel, beautiful and very clean"
        }, 
        {
            "index": 132, 
            "rating": "5", 
            "review": "First class, Five star experience. Superb niche hotel along the coast just outside Cape Town. We were on our Honeymoon and the hotel went over and above anything we expected. The staff throughout the hotel were extremely helpful, the room was spacious, clean with all the modern amenities but still offering a quaint appeal. To our pleasant surprise, we were given an upgrade along with monogrammed his and her robes. The hotel was very private and exclusive set in the hills along the coast and very safe. The restaurants were very good, especially the morning spread which had lots of variety. We've travelled quite a bit iand stayed in hotels in many countries and this was one of the best hotel experiences we've ever had. If we ever go back toSouth Africa, this is where we'd want to stay."
        }, 
        {
            "index": 133, 
            "rating": "5", 
            "review": "Not really a attraction. You see the twelve apostles from many places.Yes they make for a magnificent back drop to Camps Bay, but to me they are not a attraction.Not really something that you are going to go see as you will simply see them wherever you are."
        }, 
        {
            "index": 134, 
            "rating": "5", 
            "review": "Amazing South African Coast Line. There is nothing quiet like the coast line in South Africa. I have seen many beaches around the world, however, the backdrop of ancient rock mountains connecting directly with the ocean leaves one breathless. The Atlantic Ocean is amazing and we did spot some dolphins along the way. I am told that whales come into play in this Bay Area as well although we did not se any on the day. I can understand why they would come here to play it is simply magnificent."
        }, 
        {
            "index": 135, 
            "rating": "4", 
            "review": "Great Spot. This is a very nice spot to go, it's a little bit of a journey to get there from Cape Town but very good food and service. They have a nice wine list as well. Good value for the food, if you have the time it is worth while to go and check out the sunset."
        }, 
        {
            "index": 136, 
            "rating": "5", 
            "review": "Stunning. We were so lucky to see 12 Apostles from above from a great helecopter flip. Saw more than what we thought we will see."
        }, 
        {
            "index": 137, 
            "rating": "4", 
            "review": "natural and relaxing. There are actually 17 Apostles ( peaks ) but 12 sounded better. the sites are beautiful; one can hike and/or climb a bit there too. Its more of a local beach ..I think they called it the windy area though each place I visited was a bit windy in October/November. The heat starts soon."
        }, 
        {
            "index": 138, 
            "rating": "4", 
            "review": "Perfect location for a wedding. A little way along the beautiful coast road out of Cape Town lies the perfect hotel for a wedding. Excellent service and facilities."
        }, 
        {
            "index": 139, 
            "rating": "5", 
            "review": "Sunset cocktails. Without doubt the most spectacular sunset views in the cape coupled with great cocktails and service"
        }, 
        {
            "index": 140, 
            "rating": "5", 
            "review": "Five star hotel with a five star restuarant. You often find restaurants at 5 star hotels don't really live up to the five star rating. Somehow even 5 star hotel restaurants feel soulless and unfriendly - like railway stations - filled with travellers waiting to go somewhere else. Well Twelve apostles is definitely an exception. From the incredible views across the Western Atlantic Ocean, to great staff and great food, in very comfortable, eclectic furnished surroundings - it is a gem! Took a business partner and my mom in law (her 75th birthday) and we were so well looked after! Left feeling pampered. The food and wine menus are extensive and mouth/eye watering. Highly recommended."
        }, 
        {
            "index": 141, 
            "rating": "5", 
            "review": "Yes, there are twelve.. Another iconic Cape Town natural rock formation. Great views. Good hiking. Can't miss seeing these unless the weather stinks."
        }, 
        {
            "index": 142, 
            "rating": "4", 
            "review": "A great reason to go to to camps bay. if this was the USA they would have carved people's faces into these 12 rocks. Thankfully they are not and their natural beauty has been left for all to view from Camps Bay which is itself well worth s visit."
        }, 
        {
            "index": 143, 
            "rating": "5", 
            "review": "Better than in the pictures. You have probably seen the view in pictures - but to view this amazing extension of Table Mountain is incredible. Don't miss the chance. Take the hop-on-hop-off bus and check it out."
        }, 
        {
            "index": 144, 
            "rating": "5", 
            "review": "Afternoon Tea. Lovely afternoon tea, saw dolphins, whales and seals from the balcony. Quite old school, perhaps a bit tired, but full of Cape charm!"
        }, 
        {
            "index": 145, 
            "rating": "5", 
            "review": "Beautiful when viewed from Camps Bay Beach. Twelve Apostles are a series of twelve mountain peaks as part of the Table Mountain park. They present amazing views from different parts of Cape Town. For the best views, go to the Camps Bay Beach or near the Clifton beaches. It presents for great photo opportunities."
        }, 
        {
            "index": 146, 
            "rating": "5", 
            "review": "Nice sundowner. Great spot to stop for patio lunch and sundowner. Very nice resturant/bar. Would love to stay at the lodgings."
        }, 
        {
            "index": 147, 
            "rating": "5", 
            "review": "My favourite hotel in the Cape. I have stayed at the Twelve Apostles a few times over the years. It is my favourite hotel - anywhere. The setting is sublime and the staff are outstanding. Everything is great. It is pricey but if you keep a lookout you can get some reasonable deals. Especially out of season. The Azure restaurant is lovely and to watch the sunset from the balcony is very special. Its my wife and my favourite place to stay. But due to price it needs to be for special occasions."
        }, 
        {
            "index": 148, 
            "rating": "5", 
            "review": "Gorgeous. Such a pretty backdrop to camps bay and a great place to visit. Beach is beautiful and restaurants awesome"
        }, 
        {
            "index": 149, 
            "rating": "5", 
            "review": "High tea at the leopard bar. Stunning view of the ocean while you enjoy your tea. Lovely garden to walk about in. Incredibly friendly and helpful staff. If we could afford it, we would stay here next time we visit the Cape."
        }, 
        {
            "index": 150, 
            "rating": "5", 
            "review": "Excellent. Superb site to see overlooking Capetown . I took many photos of this landscape on different days and had a good variety of different view points ."
        }, 
        {
            "index": 151, 
            "rating": "5", 
            "review": "Favourite spot at the sea. Stunning location with spectacular views. Excellent service and food is sublime. We love coming to the Twelve Apostles to the Leopard room and the restaurant. The best place for sundowners."
        }, 
        {
            "index": 152, 
            "rating": "3", 
            "review": "C+ Brunch. Had brunch here and it was just okay. The staff was not very friendly but the view of the ocean made things a bit better."
        }, 
        {
            "index": 153, 
            "rating": "5", 
            "review": "Beautiful hotel. We visited in early spring. The hotel is beautiful and the dining room is very luxurious. Coming from the UK with the current rate of exchange, this was excellent value for money. I would not normally eat in a restaurant of this quality because it would be outside my price bracket. We all enjoyed our visit, and the staff were very attentive without being intrusive. I personally don't like being asked every few minutes if everything is OK, so this level of service is ideal for me. I would go again, and would happily recommend it to friends and family."
        }, 
        {
            "index": 154, 
            "rating": "5", 
            "review": "Simply spectacular. We got there by the blue line hop on/ off bus (stop \"Camps Bay\"). Camps Bay is just gorgeous and offers spectacular views of the Twelve Apostles, particularly on a sunny cloudless day."
        }, 
        {
            "index": 155, 
            "rating": "3", 
            "review": "Don't waste your time. Firstly there are more than 12. All tour guides will tell you this. Not worth your time in my opinion, there are many other places to visit"
        }, 
        {
            "index": 156, 
            "rating": "5", 
            "review": "Wonderful....... ........ and allow plenty of time. Views are excellent and beaches are really part of the Clifton Beaches area. Places to get something to eat and drink with toilet facilities. Very good prices as well. Plenty of lovely sand for children as well."
        }, 
        {
            "index": 157, 
            "rating": "5", 
            "review": "Great views. The 12 apostles hills/mountains have great views. You can drive along the cost and see them. Even stop at the hotel and have a nice drink and views over the ocean."
        }, 
        {
            "index": 158, 
            "rating": "4", 
            "review": "See this on your drive along the coast from Cape Town to Hout Bay. The Twelve Apostles mountain range is a must-see in Cape Town, you will see this if you drive from Cape Town to Hout Bay. It is also well worth a climb, even just a short walk to explore the flora of Cape Town."
        }, 
        {
            "index": 159, 
            "rating": "5", 
            "review": "BREATHTAKING MOUNTAINS.. The Twelve Apostles again are a short distance from Cape Town, and an amazing backdrop to the beach, and quite spectacular rising up so close to the coastal strip. Absolutely loved this coastal drive."
        }, 
        {
            "index": 160, 
            "rating": "5", 
            "review": "Great mountain hikes. Loads of great mountain hikes up this mountain, but you need to know routes and go with experienced hikers. KasteelPoort is the most popular and probably safest route up"
        }, 
        {
            "index": 161, 
            "rating": "5", 
            "review": "Absolutely stunning views. Absolutely stunning views from the restaurant.\nI have only had the pleasure of having lunch at the hotel, will definitly try out the accomodation next time."
        }, 
        {
            "index": 162, 
            "rating": "5", 
            "review": "12 Apostles on a Sunny Day--great view from Red Bus. Beautiful view of the 12 apostles from the beaches below. Ride the Red Bus and you'll get a great view. Wonderful on a sunny day."
        }, 
        {
            "index": 163, 
            "rating": "5", 
            "review": "AMAZING EXPERIENCE!. My husband and I love this hotel for the on-site restaurant and bar. We love there boutique movie theatre and have only very good things to say about their dinner/movie nights, the experience has always been out of this world. Definitely worth the price! We even got engaged at this hotel in 2013 :-)"
        }, 
        {
            "index": 164, 
            "rating": "3", 
            "review": "Living off past glories. We stopped for bar snacks and cocktails one evening to watch the sunset. The balacony decor is very dated and not that well shaded if you don't get an umbrella. Unfortunately there were a couple of children using the bar area as a playground and neither the parents nor the staff did anything to stop that (I know its difficult if parents are that rude, but...) and so our visit was less than relaxing."
        }, 
        {
            "index": 165, 
            "rating": "5", 
            "review": "A beautiful sight. A beautiful view of the twelve apostles from Camps Bay beach. They stand out dramatically by the sky line and creates an impressive view next to table top mountain."
        }, 
        {
            "index": 166, 
            "rating": "5", 
            "review": "visiting 12 apostles on the way. if u have ticket for the red bus you will be able to see that 12 apostles from the deck. however i didn't like that bus as they don't have back route. it really kills time. if u r good planner or can drive that's more worthy to visit the specific place. On the way to cape of good hope also u will be able to see that 12 apostles. it is really a must see marine drive."
        }, 
        {
            "index": 167, 
            "rating": "4", 
            "review": "More than Twelve Apostles !. We passed this area during our Cape Town sightseeing visit. It has more than 12 mountains and you can see the Table Bay mountain from the rear. It is a remote area with a very luxurious hotel. There are buildings overlooking the ocean. You can drive through or tour the seaside but it is difficult to stay if you donot have a car."
        }, 
        {
            "index": 168, 
            "rating": "5", 
            "review": "Twelve Apostles, Cape Town. We passed any and did a \"photo\" stop with Tim, our guide from the Friends of Dorothy tour guide company. It is definitely worth a stop."
        }, 
        {
            "index": 169, 
            "rating": "5", 
            "review": "12 Apostles. Breathtaking mountain range. Great views from the beachfront. Indications of the dramatic volcanic activity that helped form this area."
        }, 
        {
            "index": 170, 
            "rating": "4", 
            "review": "Tea by the Sea. The tea by the sea is fantastic. There is more than enough for 2 people to share and it is served on a tiered cake stand rather than a buffet. Well worth the cost and a really special treat if you manage to get a table on the balcony."
        }, 
        {
            "index": 171, 
            "rating": "5", 
            "review": "Great landscape. The only way to view the 12 apostles is by helicopter from the V&A waterfront area or try Table Mountain cable car for a cheaper but effective view"
        }, 
        {
            "index": 172, 
            "rating": "5", 
            "review": "Restaurants by the beach are awesome. This place is a must visit. Amazing views, clean beaches. Camps Bay is the place you must visit if you just wanna chill with your friends with a couple of drinks & good food."
        }, 
        {
            "index": 173, 
            "rating": "4", 
            "review": "Not quite as luxurious as it perhaps once was... This is a lovely resort, however not what I was expecting from the website and the pricey nightly rate..I had a mountain and ocean view room which was in a far wing of the old yet fairly reasonably maintained resort. It is a much smaller property than I was expecting and a little dated in wear.. Not that the traditional decor was a problem. It needs refining though..The staff were helpful but not overly service focused. Perhaps it was the relaxed South African vibe but I self parked, struggled with my luggage up the far corridors to my room and had to find my way to the dining rooms without a tour or map.The walks and gardens on the surrounding property were fantastic though and such an ideal setting to appreciate the joining of the Indian Ocean and the South Atlantic sea!! The mountain range behind the resort the 'Apostles' are a must see from your room to ground you in South Africa.The breakfast and dining room was spectacular and the service top notch! This portion was definitely five star. Beautiful linens and auspicious food!They have a great patio outside the top floor cocktail bar which overlooks the oceans and on a warm summer's night made my reunion with an old friend a most memorable moment in my life!Thank you for the experience Twelve Apostles, I will be back to stay again.."
        }, 
        {
            "index": 174, 
            "rating": "5", 
            "review": "Nice views. Nice views. The beaches around are great as well. Basically for views mostly. Beautiful area overall"
        }, 
        {
            "index": 175, 
            "rating": "5", 
            "review": "Azure Divine..... Everything from service to food is amazing. The Azure restaurant have a lovely selection of beef, fish and chicken dishes."
        }, 
        {
            "index": 176, 
            "rating": "5", 
            "review": "Majestic!. These imposing heads at the back of Table Mountain and visible on the drive from Cape Town to Camps Bay are a stunning sight. Plenty of hiking trails explore the various ravines and valleys and cracks - but not to be attempted on your own."
        }, 
        {
            "index": 177, 
            "rating": "4", 
            "review": "Jun 2014. Different from the one in Australia and still time to be like it but the view is awesome . Very difficult to spot even if you pass until someone tells you"
        }, 
        {
            "index": 178, 
            "rating": "5", 
            "review": "Great High Tea. My daughter took my hubby and myself for High Tea. Beautiful sandwiches and pastries. All this while enjoying the stunning views too. I can highly recommend this if you are in the area!!"
        }, 
        {
            "index": 179, 
            "rating": "5", 
            "review": "Scenic Drive. The Twelve Apostles is named after the mountain range and with just the right angle of the sun particularly during sunset the 12 Apostles become very visible to the naked eye, the drive itself is amazing with one of the best serviced roads I have ever been on."
        }, 
        {
            "index": 180, 
            "rating": "5", 
            "review": "Cosy spa hotel by the sea. A quiet and beautiful pearl of a hotel, just 15 minutes outside of Cape Town. Lovely terrace reataurant, and also a terrace bar. A beautiful mountain pool, and spa. Recommended for hoonymoons."
        }, 
        {
            "index": 181, 
            "rating": "4", 
            "review": "One for Nostalgia. A perfect opportunity for another profile pic and one to cherish for a lifetime. Twelve Apostles is simply stunning."
        }, 
        {
            "index": 182, 
            "rating": "5", 
            "review": "Beautiful!. We were lucky to see the beautiful Twelve Apostles. It took a few days but finally the fog lifted and we were able to see the beauty. Capetown was fabulous and seeing the Twelve Apostles was one of the many highlights."
        }, 
        {
            "index": 183, 
            "rating": "5", 
            "review": "Great view, great bar and great food!. We enjoyed a great pre dinner drink in the balcny enjoying the magnificent view they have and after it we had a fantastic dinner in their restaurant ! Is was a great evening!"
        }, 
        {
            "index": 184, 
            "rating": "5", 
            "review": "Gorgeous view with a cool ocean breeze. The buffet is amazing. Even though they don't have a large variety of food but what ever they have is cooked perfectly. The view from the patio where you eat, is amazing. it is a beautiful property and i will definitely be staying there next time I am in Cape Town. The drive might give you a little headache but it's ok. It is all worth it at the end."
        }, 
        {
            "index": 185, 
            "rating": "5", 
            "review": "Relaxation!. Nothing like Twelve Apostles to just let you chill out and soak up nature. Becoming my favorite place to visit"
        }, 
        {
            "index": 186, 
            "rating": "5", 
            "review": "The Majestic Apostles. The landscape of the South African coast is overseen by the glorious Twelve Apostles. It is an enormous formation that grabs your attention and reins over everything for miles around. Truly, a wonder of Nature."
        }, 
        {
            "index": 187, 
            "rating": "5", 
            "review": "There are actually 18!. We had a clear day and were able to see this range of mountains very clearly. The viewing is from the road, our vehicle and Table Mountain."
        }, 
        {
            "index": 188, 
            "rating": "5", 
            "review": "The view is amazing. My room was in the shadow of these mountains and they are just majestic and so beautiful and nothing like anything one has ever seen.Hiking on these is an event and can spend entire day here."
        }, 
        {
            "index": 189, 
            "rating": "5", 
            "review": "There are actually 18!. We had a clear day and were able to see this range of mountains very clearly. The viewing is from the road, our vehicle and Table Mountain."
        }, 
        {
            "index": 190, 
            "rating": "4", 
            "review": "one of the best sundown venues. I rate this hotel as probably the nicest bar / restaurant to go for evening drinks and watch the sun go down in Cape Townplush carpets, jazz pianist, lovely maritime feel and good wines at reasonable prices..but its all about the view.The food is excellent too."
        }, 
        {
            "index": 191, 
            "rating": "4", 
            "review": "romance. My husband and I just need some time out from children and a getaway for a week-end. We did not know where to go as there is so many places to see in Cape Town. Whilst passing we saw the name and went in. Lucky for us there was a cancellation and we grabbed the room for the week-end. It was fantastic. Service was excellent. food and drink devine. We had massages which was to die for. REally highly recommend this one. Bit pricey but worth every cent."
        }, 
        {
            "index": 192, 
            "rating": "4", 
            "review": "Beauty worth beholding!. One of the beauties you don't want to miss out on. Be cautious as there are currently many road works in the vicinity so find the best route prior to going out there or much time is wasted on the narrow roads during construction."
        }, 
        {
            "index": 193, 
            "rating": "5", 
            "review": "Beautiful drive!. We drove from constantia through to the beach via the apostles. A beautiful drive, especially at sunset! Takes you by a township, which was very eye opening."
        }, 
        {
            "index": 194, 
            "rating": "4", 
            "review": "Ultra. Luxury and comfort and the View-Wow. Tucked away on the mountainside with nothing and no-one else nearby. No pollution or noise.Go ahead, spoil yourself. You are worth it."
        }, 
        {
            "index": 195, 
            "rating": "4", 
            "review": "Interesting ride, if you have the time. The views of the ocean and the views of the land side are very interesting, assuming you don't have to drive this road. We loved the views and praised our bus driver. We never expected a seaside drive to be so exciting!"
        }, 
        {
            "index": 196, 
            "rating": "2", 
            "review": "more than 12. just a bunch of rocky outcroppings. There are more than 12 and not a high return. Would not recommend a trip just to see."
        }, 
        {
            "index": 197, 
            "rating": "5", 
            "review": "The bit you never see in the photos. These stretch back form Table Mtn and most people have never seen or heard of them til they get there. Take a drive out as the sun is setting and have drinks in a lovely old hotel on the waterfront - beautiful!"
        }, 
        {
            "index": 198, 
            "rating": "4", 
            "review": "Cosy lounge. With a great musician in the background, we sipped on French Champagne, while nibbling on a lovely platter of assorted canapés. Lovely sunset view, with the moon shimmering on the dark ocean."
        }, 
        {
            "index": 199, 
            "rating": "5", 
            "review": "Best sunset ever. we have seen sunsets all around the world, and we were very lucky to be here on an excellent day. It is the best we have ever seen. The colours are brilliant and last so long, changing all the time. There are many places you can stop and watch and photo, for free, but we went to the hotel to watch from verandah. Very spectacular.!!! Finish it off with a brilliant meal at Azure Restaurant. Make sure you have reservations."
        }, 
        {
            "index": 200, 
            "rating": "5", 
            "review": "Stunning. The views of the rock formation and mountain range from various points down the coast are incredible."
        }, 
        {
            "index": 201, 
            "rating": "4", 
            "review": "fabulous sunset views of the sea. a short drive from Camps Bay toward Hout Bay, one of the most beautiful drives in the world. Lovely hotel. not cheap."
        }, 
        {
            "index": 202, 
            "rating": "4", 
            "review": "Nice spot for pictures. Very pretty to look at although it is certainly not like the twelve apostles in Australia. Good picture spot with the twelve apostles behind you is from camps bay."
        }, 
        {
            "index": 203, 
            "rating": "4", 
            "review": "..actually 17 apostles!... ..these outcrops of rock are not quite as obvious as other mountain landmarks..they are, however, significant in the overall mountain picture surrounding Cape Town..count them for yourself.."
        }, 
        {
            "index": 204, 
            "rating": "4", 
            "review": "Food? yes! Views? yes! Service? em...no.. My family and I stopped at Twelve Apostles hotel restaurant for lunch. The views and setting were outstanding. The manager on duty was very accommodating. The food was impressive. My only complaint? I'm fairly certain that our waiter forgot about us. The manager had to deliver our food herself, and the plates were piping hot meaning they had been sitting under heat lamps for a good 10-15 minutes. Next time, I'll just go for drinks! Can't beat the amazing views."
        }, 
        {
            "index": 205, 
            "rating": "4", 
            "review": "There are more than Twelve. The views of them from the coast are often spectacular especially if the cloud sits on the top and is coloured pink through orange to red by the setting sun.The view from them involves a long walk from the Cable car or Constantia nek and should not be attempted if the said cloud is on the top!"
        }, 
        {
            "index": 206, 
            "rating": "4", 
            "review": "Excellent Photo Opportunity. We stopped adjacent to Clifton Beach and had a great view of the 12 Apostles Mountain Range, which run parallel to the Atlantic Coastline.Got some excellent photos."
        }, 
        {
            "index": 207, 
            "rating": "5", 
            "review": "Twelve Apostles. Staff was gracious and customer oriented. Food delicious. Hotel facilities and location was beautiful."
        }, 
        {
            "index": 208, 
            "rating": "4", 
            "review": "Very neat.. Clean, unpretentious staff with great waiting skills. Food simple with a touch of class and fenise. Special dinners are recommended."
        }, 
        {
            "index": 209, 
            "rating": "5", 
            "review": "Stunning backdrop to Camp's Bay. The Twelve Apostles provides and wonderful and dramatic backdrop to Camp's bay. We have visited many times, but my favourite time is as the sun is setting and hopefully with the cloud tumbling down the mountain. Provides some great photo opportunities."
        }, 
        {
            "index": 210, 
            "rating": "4", 
            "review": "Great views. Saw this unspoiled natural beauty whilst travelling along the western cape. The majestic Twelve Apostles mountain range along the Atlantic Ocean,"
        }, 
        {
            "index": 211, 
            "rating": "4", 
            "review": "Reasonable in CT. We stayed at the TA for a few days in March. Hotel has warm and friendly staff who are always eager to attend to your needs. Having said this staff seemed to struggle with simple things like getting a tea served. Nevertheless the hotel is well located with easy access to CT and beachfront areas. Rooms were nice but could do with a bit of tlc. Wires behind the tv's as an example were messy and not the standard of a 5 star establishment. Bathrooms were jazzed up but seem to have been added to so styles are different and not complimentary. Overall a nice stay though."
        }, 
        {
            "index": 212, 
            "rating": "4", 
            "review": "Impressive. Yes, great road to drive along and view these one side and then the beach the other side. Be prepared to stop along the way and take time out to enjoy the magnificant ambience of these views"
        }, 
        {
            "index": 213, 
            "rating": "4", 
            "review": "very upmarket. we had a great seafood selection on our stay in there , view was very nice and people were so friendly , it is a bit pricey but its worth it , so i would suggest you to have those nice and big prawns"
        }, 
        {
            "index": 214, 
            "rating": "5", 
            "review": "Cape Town holiday.. The Twelve Apostles are mountains that we passed on our way to the Hussar restaurant. Our taxi driver gave us some interesting information about them during the drive over."
        }, 
        {
            "index": 215, 
            "rating": "5", 
            "review": "The warmest & best service in Cape Town!!. Pretty much brilliant!!The hotel, on all levels, is nothing short of amazing! It has some of the best staff of any hotel I have stayed in (from the GM down to the Bellhop)...thoughtful and truly concerned with your experience at their facility and always inquisitive as to how they can make your experience better.The food is wonderful, varied and while expensive (compared to restaurants in the city) worth every cent! The tastes your experience will be unrivaled for quite some time...possibly until your next visit!I highly recommend staying at this venue or even just popping in for drinks and an amazing sunset at (The Leopard Lounge) where you can expect to be spoiled by excellent staff, brilliantly fun bartenders coupled with some of the most amazing jazz and pop artists in Cape Town!"
        }, 
        {
            "index": 216, 
            "rating": "5", 
            "review": "Stunning backdrop to Cape Town. It'd be hard to take a bad picture in Cape Town with the stunning backdrop of Table Mountain and the Twelve Apostles. Staying in Camps Bay, they completely flank the area and tower majestically over everything below."
        }, 
        {
            "index": 217, 
            "rating": "2", 
            "review": "still poor service. The restaurant lives on the views I believe, but not because of the service it offers. The food was ok, appropriate value for money, while the drinks were rather pricey. View onto the atlantic is stunning, but the service needs to improve significantly as it is rather slow. And this is not only a single experience, but a repetitive one. Sadly so!"
        }, 
        {
            "index": 218, 
            "rating": "4", 
            "review": "Very nice history behind this. You would be amazed that the actual number of apostles is more than 12 but as history goes, the person who counted these saw them as 12. But you must see the wind gushes hitting cape town through these apostles."
        }, 
        {
            "index": 219, 
            "rating": "5", 
            "review": "Lived up to its reputation.. We enjoyed our four night stay at this well located hotel. The Twelve Apostles deserves it's long standing reputation.. The facilities are excellent, the quality of the dining was very good. Above all though we found the professionalism and service provided by the friendly staff to be exceptional, all of which made for a memorable stay."
        }, 
        {
            "index": 220, 
            "rating": "5", 
            "review": "Superb mountains, a beautiful driving road and the hotel has a lovely third floor bar terrace. The mountainous coast itself is brilliant, with the mountains rising up on one side and the road curving along the coast. Further south is the Chapman's Peak road, famous to English, and many international viewers, of \"Top Gear\" as one of the team's favourite driving roads.The Twelve Apostles Hotel might be considered the place for a Last Supper (such a grim English joke it's worth using twice!) but we had a nice Aperol Spritzer and a 500ml light beer, on the third floor terrace overlooking the road and the coastline."
        }, 
        {
            "index": 221, 
            "rating": "3", 
            "review": "Modern watering hole!!!!!. After a journey from the Mount Nelson via Camps Bay was rather taken aback as to the ordinary surroundings and a pretty average meal.Nothing really wrong but don't go out of your way to eat there"
        }, 
        {
            "index": 222, 
            "rating": "5", 
            "review": "WONDERFUL! A MUST-SEE EXPERIENCE!. What a beautiful sight! Driving past was awesome. Stopping at a sightseeing point for photos was spectacular! Many lovely beaches on the way. A fantastic day's trip down to Cape Point. Lucky to have missed the bush fires. Look forward to our next visit!"
        }, 
        {
            "index": 223, 
            "rating": "4", 
            "review": "Far enough from the madding crowd. Located on Victoria Drive midway between the mayhem of overcrowded Camps Bay and the rustic, but touristy Hout Bay valley and fishing harbour lies this ocean of tranquility (if the South Easter isn't blowing!) Poised between the towering 12 Apostles and the Atlantic ocean the aptly named 12 Apostles hotel is the perfect spot for a leisurely lunch or a sundowner away from the masses."
        }, 
        {
            "index": 224, 
            "rating": "5", 
            "review": "Naturally Beautiful. The entire city of Cape Town is filled with so much natural beauty. But the Twelve Apostles is truly iconic and a sight not to be missed. The mountains are so majestic and in a perfect location connected to Table Mountain, and next to the Atlantic Ocean and Lion’s Head Mountain. And don’t forget the picturesque white sand Camp’s Beach! Simply stunning!"
        }, 
        {
            "index": 225, 
            "rating": "4", 
            "review": "Beautiful. 12 apostles on the background, while having a sundowner after a beautiful trip on cape of good hope. perfect closure of a perfect day :-)"
        }, 
        {
            "index": 226, 
            "rating": "5", 
            "review": "Driving by the 12 Apostles. Absolutely stunning view of the 12 apostles.... cant wait to go back. Took some time off to relax on one of the many beaches along the coastline.... such a relaxing experience"
        }, 
        {
            "index": 227, 
            "rating": "5", 
            "review": "Twelve Apostles Hotel. What a beautifull hotel, staff very friendly went there for a birthday party and was in the restuarant. We were afforded the oppurtunity to see what some of the rooms looked like all I can say is absolutely stunning!! Would love to stay for a nigth or 2 but a bit pricy for us Cape Tonians to afford. Maybe one day?"
        }, 
        {
            "index": 228, 
            "rating": "5", 
            "review": "Again, stunning natural beauty. It is hard for me to compare this part of the world with any other as it is as stunningly beautiful as anywhere else I have been. Imagine the best bits of everywhere you have been and this is South Africa- a little grand canyon, Stelvio Pass in Italy, vineyards of France... 12 Apostles will not disappoint."
        }, 
        {
            "index": 229, 
            "rating": "4", 
            "review": "Amazing views. Don't just drive past, stop and gasp. Lovely rocks, crashing waves and mountains. Totally unappreciated by peopl rushing off to Hout Bay, but you can beat the crowds by stopping almost anywhere."
        }, 
        {
            "index": 230, 
            "rating": "5", 
            "review": "Dramatic scenery. As you head south from clifton you will see the 12A's looming above the beach road. You can also get a decent view of the back of them if you go up table mountain and look across the southern land view rather than the cape town view."
        }, 
        {
            "index": 231, 
            "rating": "4", 
            "review": "Take the right pick when selecting your food!. The Leopard Bar offers excellent snacks and \"High Tea\" teared platters, for something more elegant you book the Azure Restaurant. Some dishes have alternative recipes: the Heas Chef's and the Owner's (Bea Tollman), stick to the Head Chef's!"
        }, 
        {
            "index": 232, 
            "rating": "4", 
            "review": "Lovely spot for a meal!!. Went here for a special meal, sat on the terrace having cocktails watching the sun go down was amazing. The hotel looks nice and the restaurant definitely was, Lady Gaga was staying the next night on her tour of South Africa,so that's the kind of place it is. The restaurant is sort of quaint,with local furnishings but the food was really good. Well worth going to as it's not far from Cape Town, and sitting on the terrace is worth going for itself."
        }, 
        {
            "index": 233, 
            "rating": "4", 
            "review": "Impressive landmark. An Impressive range of 12 Peaks well worth seeing. Look great from up high in Bantry Bay! Well worth a visit!"
        }, 
        {
            "index": 234, 
            "rating": "3", 
            "review": "Twelve Mountain Peaks. You get an excellent view of the Twelve Apostles from atop Table Mountain. The view of the peaks are beautiful."
        }, 
        {
            "index": 235, 
            "rating": "5", 
            "review": "Enjoy the View. Would suggest ALSO visiting Twelve Apostles Hotel and Spa as well for a tea/coffee on balcony overlooking the crashing waves - superb setting"
        }, 
        {
            "index": 236, 
            "rating": "5", 
            "review": "Afternoon Tea at the 12 Apostles - serious competition for the Mount Nelson Hotel. We went for afternoon tea on our last day in SA ( to save having to eat the airline food) and what a very pleasent surprise. We had tea on the veranda with wonderful views of the ocean, a light breeze and a selection of savoury and sweet items presented on a wonderful display. We had also been to the Mount Nelson for afternoon tea a few days before. And personally the 12 Apostles Hotel gets my vote. Perfect service, delightful selection of sandwiches, hot scones and dainty cakes and desserts. Just loved it............ and its cheaper ! You might need to book at the height of the season - but the day we went there was plenty of room. Just lovely to sit eating a delicious tea looking at the view."
        }, 
        {
            "index": 237, 
            "rating": "5", 
            "review": "Cocktails... Went for pre-dinner cocktails, fantastic well worth the drive from Cape Town over the mountain, fantastic views!"
        }, 
        {
            "index": 238, 
            "rating": "4", 
            "review": "Twelve Apostles. Superb area & with fantastic views. But why the Twelve Apostles, when there are seventeen in the range? It seems that no one really knows, but hey the number is not important the majesty of it all is what counts."
        }, 
        {
            "index": 239, 
            "rating": "4", 
            "review": "Nice to see.. They are called theTwelve Apostles but there are 17 as our guide said and it is true. When youré down from Table Mountain you can see more than 12 for sure"
        }, 
        {
            "index": 240, 
            "rating": "5", 
            "review": "Birthday Meal and Movie. Fine dinning at its best .Had my birthday for 18 people delicious food.We hired the movie theater was a fantastic way to spend an evening.Hotel Room was fabulous with magnificent view of the sea .Spar disappointing but not terrible just wouldn't go again.Love the bar and everything about the Hotel."
        }, 
        {
            "index": 241, 
            "rating": "5", 
            "review": "what happened to my review of this beautiful Hotel. I reviewed this lovely Hotel on the 18th February...Where did it go?? The place is fantastic.we have dined on numerous occasions. Both the Leopard room and The Azure The most fabulous place and the staff and food are the best.."
        }, 
        {
            "index": 242, 
            "rating": "5", 
            "review": "12A always rises to the occasion!. I've been numerous times to this hot spot. It is hidden away from the craziness of Camps Bay, standing in spectacular position near Oudekraal. The views are breathtaking and the atmosphere rich but warm.I've been fortunate to attend 2 weddings there, go for High Tea as well as a private family reunion and each and every time the service is impeccable and the food and wine fantastic."
        }, 
        {
            "index": 243, 
            "rating": "4", 
            "review": "Fantastic with great sunset and drinks. The service was fantastic and very luxury. Fine drinks, food and service throughout. The sunset topped the occasion!"
        }, 
        {
            "index": 244, 
            "rating": "5", 
            "review": "a fab place. wonderful beach with sand like powder and magnificient view with the Twelve Apostles in the back, Visited on a week day and the beach was not crowded at all"
        }, 
        {
            "index": 245, 
            "rating": "4", 
            "review": "famous peaks. These are peaks numbering 12 and therefore named as such.Shapes are quite good and the view from Camps bay was simply b'ful"
        }, 
        {
            "index": 246, 
            "rating": "5", 
            "review": "Beautiful high end place. This place is just minutes away from Camps Bay on a secluded ridge on the mountain side after which the Hotel is named.Highly stylish classic place with beautiful sea views and lions head in the background.Popular for weddings and posh events. Has it's own helipad for the stressed out short on time and of course a spa."
        }, 
        {
            "index": 247, 
            "rating": "5", 
            "review": "Amazing view but don't stop suddenly on that part of the coast line. Give plenty of warning by signalling your intention, before you stop in the designated area to enjoy this world class view. Grab a bite afterwards either going forward to Hout Bay, or back towards Camps Bay. Worth a day out."
        }, 
        {
            "index": 248, 
            "rating": "5", 
            "review": "Nice place to relax and do nothing .... A beautiful place to do nothing but chill out. Be sure to make appointments in advance. We were shut out even though were not therein peak season. If there is a negative, it is a decent distance from Camp's Bay, and further that I wanted to drive to Cape Town. All the staff we dealt with were excellent."
        }, 
        {
            "index": 249, 
            "rating": "5", 
            "review": "Always beautiful. Loved it here. Great view - great food. A bit pricey but nice for a treat or special occassion. Definitely be back again soon"
        }, 
        {
            "index": 250, 
            "rating": "5", 
            "review": "Best appreciated by a walk along Camps Bay beach. The 12 Apostles can be appreciated in a variety of ways - by hiking, driving past in three minutes the red tour buses, from the outdoor table at a café. But the best way is to take a walk from end to end of Camps Bay beach - perhaps followed by one of the above. The view from the sand is pretty special and you can get a panoramic photo of the Apostles. Back up on the main road make sure to look out for the cricket ground at the junction with The Meadway - what a view!When self-driving be aware of the cyclists and runners at the southern end of the Apostles where the road rises between 12 Apostles Hotel and Hout Bay. This is a mecca for the fit people of the Cape and they come out in large numbers at the weekend, mornings particularly. And make sure that you drop in to the gorgeous beach at Llandudno, below; the view from the road is worth stopping for, and the beach makes for a pleasant walk but parking is VERY limited."
        }, 
        {
            "index": 251, 
            "rating": "5", 
            "review": "Got Religion!. HIKE AGAIN: Yes, I hiked up with Margaret Curran (HIKE TABLE MOUNTAIN) between two of the apostles, as well as earlier driving past these mountain outcroppings. Actually, I already have religion, but it was great hiking here."
        }, 
        {
            "index": 252, 
            "rating": "5", 
            "review": "hidden gem. Minutes from Campy Bay, but \"out of the way\". Excellent sunset, excellent service at the Leopard Bar. Try their end 80s R60.000 Bordeaux in the restaurant?"
        }, 
        {
            "index": 253, 
            "rating": "5", 
            "review": "Breathtaking. stunning views so near the city and the view from the top of cable mountain is unforgettable on a clear day."
        }, 
        {
            "index": 254, 
            "rating": "5", 
            "review": "Great views and service. We had a three-course meal at Azure Restaurant. I enjoyed the Malay chicken curry - the presentation was excellent and the selection of sambals made the meal even more enjoyable. The staff member was knowledgable and made sure any queries we had were seen to. The view is gorgeous."
        }, 
        {
            "index": 255, 
            "rating": "5", 
            "review": "Ocean meets Mountains. What a lovely treat - the spa, the restaurant, the coctail bar/lounge overlooking the Ocean - is simply magnificent. You have both worlds woven between you - the ocean and the twelve apostles. Pet-friendly and luxurious rooms to choose from."
        }, 
        {
            "index": 256, 
            "rating": "3", 
            "review": "A nice view when the weather is fine. This is a spot for a few good photos only as your time shoudl be better spent elsewhere. The scenery with enough sunshine was magnificent and a quick stop at the large carpark overlooking the Twelve Apostes will be more than sufficient."
        }, 
        {
            "index": 257, 
            "rating": "5", 
            "review": "A beautiful destination. Like all Red Carnation hotels five star service. Very well run by avery good management team and their sole purpose is to please the guests which long term is good for the balance sheet!"
        }, 
        {
            "index": 258, 
            "rating": "3", 
            "review": "Late Breakfast. We have visited on a number of occasions for dinner, lunch, breakfast and just coffee. Our lunch was good but breakfast not so. Our food was overcooked and barely warm. Our coffee was weak and cold. We returned all the coffee s and even then it wasn't hot. The waitress got our order wrong but we didnt bother to change it. We did visit again just for coffee and once again were disappointed. All in all i wouldn't go again for breakfast or coffee."
        }, 
        {
            "index": 259, 
            "rating": "4", 
            "review": "Tea by the Sea. Although they initially lost my booking, they made it up by hosting my friends and I in the lovely library. It meant we were not rushed and was able to stay longer than the standard 2 hours. Was a lovely afternoon."
        }, 
        {
            "index": 260, 
            "rating": "5", 
            "review": "Hair in my face. seated on the \"red bus\" and driving past the twelve Apostles was a real \"hair in my face\" experience !"
        }, 
        {
            "index": 261, 
            "rating": "3", 
            "review": "Beautiful Mountains Viewed from Clifton. The 12 Apostles are lovely, almost anyone visiting Cape Town will see them and will be blown away by their beauty. Basically if you are looking at Table Mountain from Clifton/Camps Bay, you can see them to the right hand side of Table Mountain. There is a lovely drive you can do from Clifton down the beach front at Camps bay and past Bakoven where you get to see the stark contrast as the mountains drop into the sea."
        }, 
        {
            "index": 262, 
            "rating": "5", 
            "review": "Great Veiw. the drive from Cape town to the Twelve Apostles is superthe hotel is very modern, a 5 star hotel , the restaurant is well thought of"
        }, 
        {
            "index": 263, 
            "rating": "4", 
            "review": "Heavenly?. I am a little confused as to how many mountain peaks make up the 12 Apostles. Some say 16 others 17. Anyway, no matter the correct number, The mountain peaks are beautiful, especially when viewed from Camps Bay. It's well worth the visit to Camps Bay to view the Apostles. And you'll get to enjoy Camps Bay which is a neat place on its own merit."
        }, 
        {
            "index": 264, 
            "rating": "5", 
            "review": "Great view and food. For my 60th birthday, after a 30 day cruise to Cape Town from Dubai, my husband booked us here Christmas Eve. Fantasic views on a big balcony, then a great meal of exceptional Beef Wellington. For the holiday, complimentary wines before dinner. Nice touch. Great service and ambiance."
        }, 
        {
            "index": 265, 
            "rating": "5", 
            "review": "Awesome even if there are 15 or 16 of them. We saw the Twelve Apostles occasionally while in Cape Town as the weather is highly variable and one minute it is sunny and the next minute, clouds obliterate the view. That said, the sight of clouds slowly descending is pretty fantastic. The view of the Twelve Apostles from Camps Bay is incredible."
        }, 
        {
            "index": 266, 
            "rating": "5", 
            "review": "Rugged scenic location for hotel situated 20 minutes outside of Capetown. Like an eccentric aunts home with a lot of character which is often missing from hotel chains, a great hotel with excellent service."
        }, 
        {
            "index": 267, 
            "rating": "4", 
            "review": "Great spot for a run. One of the most beautiful runs one can do. Traffic can be heavy, but if you leave early in the morning it's great. In the heat of summer, the road is under shade till around 08h00, with the sea breeze making it pleasant. Otherwise, it stays a great drive out. Always good on a motor bike too."
        }, 
        {
            "index": 268, 
            "rating": "4", 
            "review": "Wedding day. Fantastic day spent at the hotel as part of a wedding partly. Beautiful setting and views. Great service!"
        }, 
        {
            "index": 269, 
            "rating": "5", 
            "review": "Magical sunset. You cannot bear the sunset here. The view is absolutely breathtaking. It is a lovely place to have dinner, and cocktails and watch the sunset."
        }, 
        {
            "index": 270, 
            "rating": "5", 
            "review": "nice one. We go to TA a lot and have lunch in the area called leopard bar with outside seating, always great service and very nice menu, if you don't like that menu then ask for the main restaurant menu! View is out of this world!"
        }, 
        {
            "index": 271, 
            "rating": "4", 
            "review": "Apostles in a row. The twelve apostles is the name given to a row of twelve mountains spread along a line, on the way from cape town to cape point. The apostles are just 20 minutes ride from the heart of the city."
        }, 
        {
            "index": 272, 
            "rating": "5", 
            "review": "Beautiful. Great views from camps bay on a clear day, actually there are 17 of these cliffs.worth taking a look"
        }, 
        {
            "index": 273, 
            "rating": "4", 
            "review": "Awesome scenery. What a drive... Photographers heaven. So much to see and experience along the drive. Parking can be a problem at times"
        }, 
        {
            "index": 274, 
            "rating": "5", 
            "review": "Camps Bay...you see that here is the posh place. Wonderfull Beach with a stunning view oer the Twelve Apostles. When the clouds come over the mountains it is just breathtaking"
        }, 
        {
            "index": 275, 
            "rating": "5", 
            "review": "Best spot in CT (if you can afford it). My husband took me there for cocktails. Amazing view, food and drinks, and perfect if you want to get out of the city but still want the Cape Town -feel. Super friendly and wonderful staff and incredible views and tranquility. It has more than one restaurant/bar, so you're sure to be spoiled for choice. They have superb specials regularly (often only available to locals), so do check in every now and then to see what's happening. PERFECT weekend getaway if you want to spoil your significant other."
        }, 
        {
            "index": 276, 
            "rating": "3", 
            "review": "An old favourite, now needs some effort. The Twelve Apostles is one of the nicest settings in Cape Town. And there are options for eating here too. The Leopard Lounge the fine dining restaurant and the Cafe. The settings for each are all lovely and the service is good but the prices are outlandishly high for average tasting food. Would be nice to have more interesting menus in the cafe and Leopard Lounge and better pricing of those. The menu is rather run of the mill I thought and not terrible but not very tasty. A glass of wine here is expensive for average to not so great local wines so better value and perhaps more interesting choices elsewhere. I think location always adds to the enjoyment of eating experiences but I don't believe loading the prices of your location when the food and wine don't match them is a sustainable model. Hope that things improve here."
        }, 
        {
            "index": 277, 
            "rating": "5", 
            "review": "Best sunset terrace!. Only had a drink, but we were there for the most memorable sunset! I will never forget it. The hotel looks really nice and lively."
        }, 
        {
            "index": 278, 
            "rating": "5", 
            "review": "Don't bother counting. There are more than 12. That's what my guide told us. Gorgeous drive. Amazing shorelines and sweeping vistas. Simply beautiful."
        }, 
        {
            "index": 279, 
            "rating": "5", 
            "review": "stunning. go to Camps Bay to get a great view of the peaks and take your camera - got some great shots of the clouds rolling over the mountains."
        }, 
        {
            "index": 280, 
            "rating": "5", 
            "review": "Spectacular views across the Apostle range. We viewed the 12, well 17 apostle peaks from the top of Table Mountain and from the coastline where they equally impressive."
        }, 
        {
            "index": 281, 
            "rating": "5", 
            "review": "Exquisite and spectacular. Leisurely drive around and soaking the fascinating views is hands down one of THE best in the world. Definitely no short-cuts advised. Take a trek or better still loll on the heavenly shoreline."
        }, 
        {
            "index": 282, 
            "rating": "5", 
            "review": "Amazing. The Twelve Apostles are 12 rock formations along the coast in Cape Town. A delightful drive along the coastline takes you to the Twelve Apostles hotel where you can enjoy a great meal and good drinks. These rock formations looking out over the water are immense and imposing. Great photo opportunities. Recommended"
        }, 
        {
            "index": 283, 
            "rating": "5", 
            "review": "25th Wedding Anniversary celebration. We booked our trip through Go2Africa, they really made our 25th Anniversary a memorable one! We stayed at the Twelve Apostles Hotel, what a treat. The Hotel faces the sea and the views were spectacular. The Management and Staff made us feel very welcome and special. Our celebration dinner in the Azure Restaurant was a real highlight for us. Our room was very comfortable and clean. Go2Africa arranged a full day private winelands tour and our guide was very knowledgeable and interesting. All in all we loved our few days in Cape Town and found the city very clean and the people friendly. We will be back!"
        }, 
        {
            "index": 284, 
            "rating": "5", 
            "review": "The weather helps. On a clear day the view is awesome, when the clouds are low and it is mist you see nothing, however, in-between the view is different every minute. Well worth the visit even if there is a blanket of cloud."
        }, 
        {
            "index": 285, 
            "rating": "5", 
            "review": "Friendly, professional, helpful. Excellent. My son and I enjoyed very much our stay at the hotel.From the concierge to the manager.. everyone was friendly and did his best to make us feel great. The atmosphere of the hotel is very cosy. Beautiful Paintings hang everywhere. There is also a library: Choose a book, enjoy the see view, drink a tea and try those cupcakes!The see view is fantastic. There is a free shuttle bus to drive you and pick you up from the hotel to Waterfront.They offer private tours too. We went to Franschhoek, discovered the area and visited many ceramic ateliers. The driver knew that my son is fond of engines so he took us to an impressive car museum. What a service! Highly recommended."
        }, 
        {
            "index": 286, 
            "rating": "4", 
            "review": "Romantic Honeymoon. My new husband and I stayed here from 10/30 through 11/2/14 as part of our trip planned by Lion World Travel. First, the Pros:- EXCELLENT STAFF! The head concierge (Mahood I think? I've slept a lot since then) was so incredibly nice to us as well as the front desk, drivers, and wait staff. We didn't encounter anyone that didn't go out of their way to help us. - Beautiful grounds with a walking path, spa, and pool- A little outside of busy Camps Bay and the Waterfront- Great views of the Atlantic- Great breakfast and food in both restaurantsNow the Con:- We upgraded to a sea-facing room since it was our honeymoon and we love to sleep to the sound of crashing waves. Well, you can hear the waves a little at night but between 10 pm and 6 am all you hear is the sound of cars on the 2 lane highway right below the balcony. On Saturday it sounded like Tokyo drift. I gave it 4 stars just because of the road noise, but other than that it was a wonderful stay. We had a great time on our honeymoon and would definitely return to the Twelve Apostles."
        }, 
        {
            "index": 287, 
            "rating": "4", 
            "review": "Variety is the spice of life. Brilliant Saturday market. Many quirky shops open daily.Casamento is my favourite furniture shop where the amazing furniture is the creation of Starry Eve and her partner. Expensive but worth every penny."
        }, 
        {
            "index": 288, 
            "rating": "5", 
            "review": "Watching the rain. We took cover at the hotel from a storm. They were so friendly giving us a royal tour of the hotel. Had a light lunch that was right on the number. Hot comfort food - we felt very welcome indeed. Thank you."
        }, 
        {
            "index": 289, 
            "rating": "5", 
            "review": "Better and Better. The Twelve Apostles continues to wow its guests with reliable and thoughtful service. Our room was upgraded. Staff constantly inquired if they could assist us in any way. Then, when we experienced a family crisis requiring us to return home to the USA immediately, the Twelve Apostles staff stepped-in to coordinate transportation and communication. Their generosity and thoughtfulness was incredible. The Twelve Apostles is definitely unique in the hospitality industry. Thank you."
        }, 
        {
            "index": 290, 
            "rating": "5", 
            "review": "Beautiful Hotel. Real quality up market hotel in a most beautiful natural surrounding and scenery with ocean views. Excellent Food, great service and value for money. Don't miss it on your drive down the Cape Pennisular."
        }, 
        {
            "index": 291, 
            "rating": "5", 
            "review": "Best Anniversary Celebration. The dinner, accommodation and breakfast was nothing short of amazing.\nThe service and food was excellent.\nWill definitely be back"
        }, 
        {
            "index": 292, 
            "rating": "5", 
            "review": "Hikers paradise. Hiking up the Twelve Apostels offer magnificent views of Hout Bay, Llandudno, Camps Bay and the ocean. There are about 2,200 species of plants on the mountain range."
        }, 
        {
            "index": 293, 
            "rating": "5", 
            "review": "Very nice hotel on the ocean. We treated ourselves and stayed here for 2 nights. Very nice and attentive staff and the restaurant onsite is great. Bit remote in that you are a mile out of the nearest urban area, but for us it was no problem especially with the hotel van service ready to get you into town as needed."
        }, 
        {
            "index": 294, 
            "rating": "5", 
            "review": "Broad band of Heaven. One can watch them from the The Table Top or take a drive down to Hout's Bay and you see this band of grand old mountains.Lovely restaurants built in the mountainous sides overlooking gorgeous bays and the Apostles ."
        }, 
        {
            "index": 295, 
            "rating": "4", 
            "review": "12 apostles argument has 17 or 18. we were able to view these mountains three times. On the hop on hop off bus, our a guided tour to the capes both road trips and finally by air on the helicopter. Very different view and worth it"
        }, 
        {
            "index": 296, 
            "rating": "5", 
            "review": "5 Stars+. Though some tourists may complain that the hotel is not \"centrally located,\" when you consider that Cape Town's fame rests in large part on the physical beauty of its setting, there actually is no better located hotel that the 12 Apostles with its stunning views of both Table Mountain looming above it and the magnificent coastline below. Luxury without being ostentation, superb service - one of the most memorable hotel stays imaginable."
        }, 
        {
            "index": 297, 
            "rating": "5", 
            "review": "More like 17 apostles. The other side of the table mountain, the wonder indeed. one side if the table and the other is something else. when looking at the twelve apostles, looking closely you see that they are infact 17 of them, may be is just me, but the views are magnificent"
        }, 
        {
            "index": 298, 
            "rating": "4", 
            "review": "magnificent views. there is nothing much that we didn't like. we like the décor, the quietness, the staff, the food and the absolute best was the view. we actually enquired about staying there another few night. However, even in low season, it's not easy to find 3 rooms there. Next time, we'll book long in advance."
        }, 
        {
            "index": 299, 
            "rating": "4", 
            "review": "Nice View - not great. That section of the shore is great for photos, and it is part of a nice scenic drive through the area."
        }, 
        {
            "index": 300, 
            "rating": "5", 
            "review": "Twelve-out-of-Ten. Great food,great views and great service. More expensive than your average steak house but it is absolute value for money."
        }, 
        {
            "index": 301, 
            "rating": "5", 
            "review": "awesome hike up to the mountain. we stayed in a villa that is only mins away from 12 apostles, we took a little hike up the mountain and it was just beautiful, great view, not too difficult a hike.... perfect for any day."
        }, 
        {
            "index": 302, 
            "rating": "3", 
            "review": "Its not shabby... but.... Don't get me wrong, Twelve Apostles isn't a bad place to stay... its just that its self image outstrips its reality. The staff tries to be attentive, but.. functions in a disorganized manner. The exception was the service staff that operated the shuttle service to Capetown. The rooms are nice, but not super special. One night a candle appears, the next night it doesn't. Same with water.Since the hotel is built into the side of the mountain, rooms are found after covering many hallways on different 3-6 step levels. Breakfasts are great, many choices. Maybe if your focus is the beach area, this is a good choice. If your focus is Capetown, as was ours, then you might want to seek other options."
        }, 
        {
            "index": 303, 
            "rating": "4", 
            "review": "Great romantic place !. On our wa back from chapmans peak, we stopped there for a drink. We liked the place so much that we decided to go there for dinner the next day. It s not very far. Only 4 km from Camps Bay. Great views."
        }, 
        {
            "index": 304, 
            "rating": "5", 
            "review": "Sunday lunch. This is a hidden gem with a veiw of Table Mountain & the sea. Beautifull walks & setting. The food when we fist discovered it in 2010 was an unbelievable 6 stars. Lately, i would only give the food 4 stars, but still worth it for a romantic Sunday lunch."
        }, 
        {
            "index": 305, 
            "rating": "5", 
            "review": "Sunday Brunch on the deck - beautiful!. We were fortunate to have wonderful weather for a Sunday Brunch at Twelve Apostles. The choices for main courses were numerous as well as the choices for starters & desserts. They also had entertainment which we enjoyed. Debi was playing American songs that we recognized so that was fun. We had to stop ourselves from eating too much, everything was so tastey. The view of the bay was gorgeous as we dined. We were hopeful we would see whales as our guide, Peter, said there had been sightings of them but we weren't lucky during our time there. I would recommend this restaurant's Sunday Brunch definitely!"
        }, 
        {
            "index": 306, 
            "rating": "5", 
            "review": "Lovely drive past it.. The drives from Cape Town to the south are always just amazing. You have to do these drives - past the 12 apostles and then to cape point through the pass (tolls apply) - stop frequently to take in the amazing vistas"
        }, 
        {
            "index": 307, 
            "rating": "4", 
            "review": "Beautiful backdrop. Went on the blue and red bus tours from Capetown and the mountains provided a great backdrop to pictures taken from the top of an open deck bus."
        }, 
        {
            "index": 308, 
            "rating": "5", 
            "review": "Day tour to Cape Point,. Having left Icy and windy table mountain, lions head,and Clifton beach rather bare of surfers today ;We drove past these huge and spectactular mountains, before a cliff top drive along chapman's Peak, a drive to rival Australia's Great ocean road."
        }, 
        {
            "index": 309, 
            "rating": "3", 
            "review": "Fantastic seafood dinner. Very nice ambience for special occasion. Great dinner service and delicious food. Service on patio for pre-dinner drinks was lacking. Patio was empty and not really set for guests. Was not a comfortable place to be. We felt out of place, no candles on tables, just completely empty tables and chairs. Big shame as that should have been a highlight of the evening. Hence only 3 stars."
        }, 
        {
            "index": 310, 
            "rating": "5", 
            "review": "Favourite Hotel in Cape Town. This Hotel is truly Cape Towns best! Everything from the rooms to restaurant is amazing. We had a beautiful evening at the hotel with a superb dinner in the Azure Restaurant. Would definitely recommend to stay here"
        }, 
        {
            "index": 311, 
            "rating": "5", 
            "review": "As good as it gets. A truly superb hotel with really good food and wines plus a stunning position south of Cape Town. Great sea views - we saw over a hundred wales sailing past!\nRecommend to anyone as a first class place to see the Cape area. They run a free service to take guests into the city and pitch you up again."
        }, 
        {
            "index": 312, 
            "rating": "5", 
            "review": "Stunning. Beautiful range of Mountain tops. I drove past them at least 4 times a week and also climbed up on them. You can have a stunning view over Camps Bay and Lions Head."
        }, 
        {
            "index": 313, 
            "rating": "5", 
            "review": "Stunning. The views here are breathtaking, and stunning. Even though it was Winter and the wind was quite brisk, we were able to get some beautiful shots and just to enjoy the natural settings that we don't get to see in urban surroundings. It is well worth the drive to see them from all angles."
        }, 
        {
            "index": 314, 
            "rating": "5", 
            "review": "12 Reasons.... Ok so there are more than 12 reasons to visit the 12 Apostles. Best viewed from Camps Bay or Lions Head. There are also hiking trails up there. Or drive along them from Camps Bay to Hout Bay.\nIf you do decide to hike up there just remember: do it in a group ;)"
        }, 
        {
            "index": 315, 
            "rating": "4", 
            "review": "Nice. Lovely to see but only if you are passing through anyway to get a nice photo. I think it is covered in lots of tours and is a nice place to stop for a photo."
        }, 
        {
            "index": 316, 
            "rating": "5", 
            "review": "Spectacular Apostles. With Table Mountain as a backdrop the sheer unspoilt rugged beauty takes your breath away. Looming mountains on one side and the sparkling ocean on the other- it does not get any better than this"
        }, 
        {
            "index": 317, 
            "rating": "5", 
            "review": "They actually are a big deal. I don't think many people know that the famous hotel is named after a range of mountain peaks. Some say that the Twelve Apostles are even more significant than Table Mountain itself. The beach and neighboring coastline sure is impressive!When you drive along the coast again, take some time to stop and look at the Twelve Apostles, as in the mountain peaks. There are actually 18 of them, but try and count the 12 that are near the famous hotel and spa that has the same name :)"
        }, 
        {
            "index": 318, 
            "rating": "4", 
            "review": "5 Star hotel on the a Rocks above the Atlantic Ocean.. The only hotel and buildings along this section of the coast. Great food and drinks for a quick stop over and fantastic rooms. The spa is definitely worth a visit"
        }, 
        {
            "index": 319, 
            "rating": "4", 
            "review": "Fab treatments. Just visited the spa and had a fantastic time. The staff is very polite, attentive to clients needs. I received a shell massage and my husband a deep tissue. Great treatments done by professionals.The spa area is large with different pools available"
        }, 
        {
            "index": 320, 
            "rating": "5", 
            "review": "Great sundowners in the Leopard Bar. We love this hotel! We stayed here two years ago and had the most wonderful time. The room (suite), food, service, atmosphere, location were all first-class. On this trip we were staying at the Waterfront, but had to make a special visit for sundowners in the Leopard Bar. We'll be back."
        }, 
        {
            "index": 321, 
            "rating": "5", 
            "review": "Unbelievable Birthday celebration. We had Sunday lunch at 12A to celebrate my birthday on 17 August. The weather was gorgeous, ambiance & music so great. The food was excellent. We were treated very well, waiters are well trained & professional. I was given a bottle of bubbly to celebrate my birthday. My day was so unbelievable. Thank you. Lauren Price is the best customer relationship officer. What a professional, diligent lady."
        }, 
        {
            "index": 322, 
            "rating": "5", 
            "review": "Sunset drive. Absolutely stuning and a must. A sunset here is the best. Bring your camera and maybe a picnic basket"
        }, 
        {
            "index": 323, 
            "rating": "4", 
            "review": "The place for sundowners. Spectacular views over the ocean,combined with well prepared cocktails makes this one of our a favorite.Service can be a hit and miss, but then you still have the amazing sunset..."
        }, 
        {
            "index": 324, 
            "rating": "5", 
            "review": "Best service. Lovely hotel, many choices where to eat. Spa is lovely and had amazing products. Azure restaurant is top notch."
        }, 
        {
            "index": 325, 
            "rating": "5", 
            "review": "Cocktails by sunset. Came here for cocktails, very classy place, the view is amazing and the cocktails were divine! You can either dress up or dress down, anything goes."
        }, 
        {
            "index": 326, 
            "rating": "5", 
            "review": "The Cloud Distillery. As clouds rolled over the top of table mountain they filtered down the gullies between each Apostle like a distillation tower. Really breathtaking from the beach and from lions head. A stunning location."
        }, 
        {
            "index": 327, 
            "rating": "4", 
            "review": "World best Rocks. Along the way from Cape Town to Camps Bay, you can see this Beautiful 12 Apostles. This looks like Rocks. Don't just passing by this point."
        }, 
        {
            "index": 328, 
            "rating": "5", 
            "review": "just stopped by.. On our way to Cape Point, we stopped at the beach for a photo op with the Twelve Apostles in the background. Views are amazing!"
        }, 
        {
            "index": 329, 
            "rating": "5", 
            "review": "a picture postcard view. loved it,if you are in capetown u have to go here and take a picture.its a beautiful view !it is something i associate with capetown..."
        }, 
        {
            "index": 330, 
            "rating": "5", 
            "review": "The gem of Cape Town. They have thought of every detail and you really want for nothing. Their mixologists are of the best I've ever had the pleasure of making cocktails. .highly recommend the Golden Giraffe! Best Bar snacks even outdoing the Oyster Box. The spa is fantastic and staff not too stuffy....everyone is friendly and they bend over backwards. The Azure Restaurant I have already rated as *****.Breakfast is a treat and the oysters and salmon are fresh. The only downer was my wife slipping on the wet deckbut fortunately is only a sprain. We will be back again asap!"
        }, 
        {
            "index": 331, 
            "rating": "5", 
            "review": "Best hotel. We spend a weekend at this hotel during our honeymoon . The hotel staff went out of their way to make our stay memorable. The views from our room were amazing. I will certainly be going back to this hotel."
        }, 
        {
            "index": 332, 
            "rating": "4", 
            "review": "Very scenic. The table mountain range stretches all the way from Capetown to Cape Point and makes for a very scenic 90 minute drive. The range starts with the Lions Head, and continues as Table Montain and then a series of small mountain peaks that run along the coast all the way to Cape Point. The drive is very scenic with several points from which yo get amazing views of the bay from different perspectives."
        }, 
        {
            "index": 333, 
            "rating": "4", 
            "review": "Good views . Firstly it is not just twelve apostles. There are definitely more!! They make for a good sight on a clear day when passing by or spending time at the camps bay and Clifton beaches."
        }, 
        {
            "index": 334, 
            "rating": "5", 
            "review": "wonderfull. what a sight I shall never forget these huge mountains and how the colours change by the hour especially magical at sunset with the red hues and greys to browns"
        }, 
        {
            "index": 335, 
            "rating": "3", 
            "review": "Great view - aveage service. I only had lunch here so cannot say anything about the hotel but the waiters were below average at best. Whenever I come here I am always very eloquently greeted by the maître d but this eloquence does not extend to the waiters. Waiters here almost have a eagerness to the flip the table for the next set of diners but when you are paying 12 apostle prices that is not what you come here for. Another point is that waiters also lack colonial crispness - ties are loose, buttons undone, shoes not polished - the reason this stands out is because the look of these waiting staff does not reflect the quality and opulence which the hotel strives for. The food is good but definitely not the best on the Atlantic side and could be described as good tapas for a sea-side café except that it is not. The view however, wow, that does make up for it - more than make up for it. In conclusion, come dine here for a great view but don't expect what comes out of the kitchen to wow Gordon Ramsay in terms of taste and service."
        }, 
        {
            "index": 336, 
            "rating": "5", 
            "review": "monument of nature. it is nice to see it exactly next to the top of the table mountain againt the lion head, if you see it as a complex of mountains is a nice view, but one more time i say that the best view is by helicopter"
        }, 
        {
            "index": 337, 
            "rating": "5", 
            "review": "Beautiful backdrop. The 12 Apostles mountain range is simply stunning!! It is such a great backdrop to Camps Bay, and just makes Camps Bay beach look even better!!"
        }, 
        {
            "index": 338, 
            "rating": "3", 
            "review": "Ahem....!! Hmmmmm....!! Still thinking what to write.... The South Africans are good at one thing. Give them any natural rock formation,they will brand it. And voila...it adorns all the tourist sites, maps, offices as a natural MustSee wonder. Well, twelve. apostles is one such site. Nothing spectacular. All you do is tick one more thing off the Must do list in Cape Town."
        }, 
        {
            "index": 339, 
            "rating": "5", 
            "review": "Twelve Apostles. We lived in Camps Bay just on the foot of the Twelve Apostles. Table Mountain from this side is even more beautiful than on its ordinary view. Clouds just flew down as water from above to the balcony of our apartment. It's a unique feeling - dinner with wine in the middle of cloudy mist. This is also the luxury region of the city were you can meet different celebrities and have all kinds of leasure time. And Camps Bay beech is one of the most beautiful in Cape Town, but the ocean is very cold, only few braves can swim."
        }, 
        {
            "index": 340, 
            "rating": "4", 
            "review": "Great place for a special occasion. Service was fantastic. They have a great wine selection. The food was good too.There is a fantastic view out over the atlantic. If the weather is good try to time your visit for sun set and have a drink on the balcony at the same time, it's well worth it!"
        }, 
        {
            "index": 341, 
            "rating": "5", 
            "review": "Great Back Drop. As most know, it is hard to beat this back drop as the sun is setting. There are several spots in and around Camps Bay for great pictures."
        }, 
        {
            "index": 342, 
            "rating": "5", 
            "review": "Wonderfull stay. Its been a real wonderfull hotel to have stayed in. The moment you walk in until your check out its been so wonderfull staff. check in was wonderfull. the spa was ouer most wonderfull treat and would recomend it to all my friends and family in the U.K. its been a short stay but def a wondefull sea side to return to and to alll the great staff welldone"
        }, 
        {
            "index": 343, 
            "rating": "5", 
            "review": "What a stunning backdrop to any photo. Whilst we did not have time to get to the top we were able to enjoy the views from the beach at Camps Bay.It was possible to take in these peaks and get some really great pictures with the Twelve Apostles in the background.There are plenty of places to eat along the promenade."
        }, 
        {
            "index": 344, 
            "rating": "5", 
            "review": "Best View. There are more than Twelve Apostles but who cares. The view off the Apostles looking back from Clifton over Camps Bay is one of the iconic views in Cape Town and South Africa and should not be missed by any world traveller to South Africa."
        }, 
        {
            "index": 345, 
            "rating": "5", 
            "review": "LEOPARD LOUNGE. There is not better spot for a winter sundowner in the Leopard Lounge. With the fire place crackling away and the live band/singer the barman will make sure you have an authentic Twelve Apostles cocktail or some of the best wines of Cape Town. My favourite sundowner venue."
        }, 
        {
            "index": 346, 
            "rating": "3", 
            "review": "Stunning View from the Coastline. The Twelve Apostles offer a stunning view from the Coastline, and I believe you can climb to the top as well."
        }, 
        {
            "index": 347, 
            "rating": "5", 
            "review": "Loved my stay at the 12 Apostles!. Loved my stay at the 12 Apostles! Very elegant hotel with scenic views and attentive staff. Because of the hotel’s size and staff’s attention to detail, I felt as if it were “my” hotel!"
        }, 
        {
            "index": 348, 
            "rating": "5", 
            "review": "Adventure Climb. Several Trails to Explore Hiking and Out Door Adventure for All. Great Views and Scenery.From Land or See also make for an Excellent Photo Opp."
        }, 
        {
            "index": 349, 
            "rating": "5", 
            "review": "The perfect backdrop for the magnificent Camps Bay!. We walked along a small section of this spectacular mountain range when we ascended Table Mountain. The views along the range & town to the gorgeous sands of Camps Bay is truly breath taking."
        }, 
        {
            "index": 350, 
            "rating": "3", 
            "review": "Average. You get a view of the 18 apostles(yes ,there are 18 and not 12) from table top. Can be skipped if you are in a hurry, else can be clubbed along with table top mountain"
        }, 
        {
            "index": 351, 
            "rating": "5", 
            "review": "beautiful place!. very upmarket, beautiful interior, great high tea, exellent service.....pricy but beautiful! at least have tea there!"
        }, 
        {
            "index": 352, 
            "rating": "4", 
            "review": "Nice mountains. It's close to table mountain really so you can see a part of it from there. The whole mountain range is interesting anyway, not just this part."
        }, 
        {
            "index": 353, 
            "rating": "4", 
            "review": "Beautiful scenery. The twelve apostles were beautiful as was the story of their naming due to giving thanks for safe arrival on land, thus the name. Great for photography."
        }, 
        {
            "index": 354, 
            "rating": "5", 
            "review": "12 Apostles. a super high standard hotel experience - throughout the hotel all staff were absolutely brilliant achieving excellent service levels consistently, Masood the Concerierge was outstanding and a true credit to the conceriege role."
        }, 
        {
            "index": 355, 
            "rating": "3", 
            "review": "misty view. I am sure these would have looked much better on a dry day. Unfortunately the day we saw them they were shrouded in mist"
        }, 
        {
            "index": 356, 
            "rating": "5", 
            "review": "ODCA Conference at 12 Apostles Hotel. I just wanted to drop you a personal note of thanks for the all of your support and arrangements to enable our successful conference last week! I was unable to speak to you in person, but can confirm the following:1. The Alliance members were very happy with the hotel and facilities and support / arrangements.2. Everyone was particularly impressed with the friendliness and helpfulness of the staff.3. There were many remarks on the pride which your team showed in both the hotel and the city and country – obviously a hand-picked group.4. Many people expressed a desire to come back again in the future with their families, which is what we all want! Thank you again for helping us to have a successful conference, and making the visit so pleasant for all of our guests."
        }, 
        {
            "index": 357, 
            "rating": "5", 
            "review": "azure restaurant. We had dinner at this restaurant last night....Onela Soygye rolled out the red carpet for us. He paired our wines perfectly with each course of food. The food was some of the most amazing cuisine my palet has ever encountered. I highly recommend the springbok. Staff went above and beyond. Thank you Onela you were amazing!"
        }, 
        {
            "index": 358, 
            "rating": "5", 
            "review": "Twelve Apostles across the ocean. Had a wonderful birthday breakfast at the Terrace Restaurant.Peach of a morning .. could see forever over the ocean. Food first rate and a birthday cake with champagne such a nice surprise as hosted by friend. Glorious way to initiate a fab celebratory day."
        }, 
        {
            "index": 359, 
            "rating": "4", 
            "review": "trip into heaven. Wonderfull driving route ! Something comming from Belgium you can only dream of ! fantastic scenery, stunning !"
        }, 
        {
            "index": 360, 
            "rating": "5", 
            "review": "Twelve Apostles. This is the name of the mountains range. They look really magnificent. You can get a good look at them from the table mountain and Clifton Beach too. It looks lovely when you see the clouds covering it partially."
        }, 
        {
            "index": 361, 
            "rating": "4", 
            "review": "Stunning Mountain Range. Twelve Apostles are a stunning mountain range in the area of Camps and Hout Bay, one of the best views of the range is from Clifton Beach. You can visit the Twelve Apostles on the hop on / hop off bus or by car, if you go by car you can travel the length of Victoria Drive, a beautiful drive alongside the ocean. It is a beautiful area with glorious sunsets."
        }, 
        {
            "index": 362, 
            "rating": "4", 
            "review": "Amazing views,tranquility and peaceful. The 12 Apostle hotel and spa is the ideal getaway for nature lovers as it is located at the foot of the mountains with amazing restaurants and sea views.Very pricey, but value for money"
        }, 
        {
            "index": 363, 
            "rating": "5", 
            "review": "One of the highlights on your trip around the Cape Peninsula. This hill range spanning from the Table Mountain along the coast over Camps Bay to Hout Bay is accompanying you on the road around the Cape Peninsula. It doesn't matter from which direction you are approaching this phantastic area, you cannot miss this master piece of land. Have a stop for a while and watch the busy ado at the beaches, the wonderful land and buildings or even walk on one of the hiking trails."
        }, 
        {
            "index": 364, 
            "rating": "5", 
            "review": "12 apostle spa. If you looking for good therapists, friendly staff and professional service, I will definately recommend the 12 apostle spa. The new modern look is amazing - loved it!The management and staff treated us like royalty which made our visit extra special. Well done to the 12A spa managenent!"
        }, 
        {
            "index": 365, 
            "rating": "5", 
            "review": "One of South Africa's best. The new look of the spa gives it a modern feel. The friendly and well-trained staff turns a great experience into a memorable one. The view probably one of the best."
        }, 
        {
            "index": 366, 
            "rating": "5", 
            "review": "Five star all the way. We just love the Red Carnation Group of hotels. In South Africa and abroad. U know u r going to get the very best of best always with a perfect setting great food and excellent service."
        }, 
        {
            "index": 367, 
            "rating": "5", 
            "review": "Clifton beach views. The best views of the Twelve Apostles is from the Clifton Beach and the Chapman's Peak. This is a lovely mountain range."
        }, 
        {
            "index": 368, 
            "rating": "4", 
            "review": "Great Scenic Drive. We drove along the road below the Twelve Apostles. It was a beautiful view and had plenty stops to get out and admire the view."
        }, 
        {
            "index": 369, 
            "rating": "4", 
            "review": "Hidden Cannons. We visited while on the Hop on Hop off Bus Tour. It is interesting to note that these mountains contain caves that were used to hide cannons during the past wars. They were used to protect the Cape from enemy ships. The cannons can shoot out from their hiding places and were difficult to spot from the sea. Some of these cannons still function as we discovered at the Simonstown Naval Fair when they were fired as part of the show."
        }, 
        {
            "index": 370, 
            "rating": "5", 
            "review": "Great place to visit!. We had a superb meal at the lavishly decorated Twelve Apostles Hotel and enjoyed the view and the scenic drive along the coastline. This is an absolute must when you visit Cape Town!"
        }, 
        {
            "index": 371, 
            "rating": "5", 
            "review": "Breathtaking sunsets. The Twelve Apostles have a great setting for sun downers with beautiful sunsets to be seen from their bar patio. They have an amazing Spa (for treatments) which is situated in a cave like setting. Wonderful floatation tank inside Spa."
        }, 
        {
            "index": 372, 
            "rating": "5", 
            "review": "Afternoon Tea. Try the afternoon tea here and you will not be disappointed. We tried to make a reservation at the Mount Nelson in Cape Town but it was full, so we begrudgingly decided on the 12 Apostles, and we absolutely loved it. The service, ambiance and stunning views were excellent and the food glorious!!"
        }, 
        {
            "index": 373, 
            "rating": "5", 
            "review": "Fabulous Function Space. I held my wedding rehearsal dinner in the Atlantic Terrace Marquee. Everything from the service to the food, decor and overall experience was fantastic. The staff were incredibly attentive and made sure that all guests needs were met.Monique was fantastic throughout the planning process and made everything seamless for us especially since we were planning from USA.All guests had fantastic things to say about the venue and the staff."
        }, 
        {
            "index": 374, 
            "rating": "5", 
            "review": "Unforgettable. The Twelve Apostles, part of Table Mountain mountain range will be worth the drive - there is not much else to do there other than visit the Twelve Apostles Hotel, which we did not have time to do, but it will definitely be on our next visit."
        }, 
        {
            "index": 375, 
            "rating": "4", 
            "review": "More for your money. I think there are about 18 apostles in this wonderful view of the mountains overlooking Camp's Bay. A superb sight to behold."
        }, 
        {
            "index": 376, 
            "rating": "5", 
            "review": "decadance. beautiful hotel, rooms are lovely, beds are great, fantastic views a very upmarket hotel. just did not like the spa. went back a few years later and the spa had got even worse. pity as the hotel itself is great but would go back in a flash..."
        }, 
        {
            "index": 377, 
            "rating": "4", 
            "review": "Location, Location, Location. A great hotel, tremendous service (they go out of their way to please you) excellent restaurant and one of the greatest locations on the planet. Have drinks outside and soak in the the 360 degree view of the ocean and the 12 apostle mountain backdrop.The only negative to a full 5 star rating was that some of the rooms are looking a bit tired and in need of maintenance"
        }, 
        {
            "index": 378, 
            "rating": "4", 
            "review": "12 Apostles Cape Town. The 12 Apostles are a spectacular mountain feature between Camps bay and Hout bay. You can travel along the base of the apostles while hugging the ocean as you travel along Victoria drive.Many times you will spot dolphins in the sea on one side and the unspoiled mountains on the other. Not quite Chapman's peak drive in it's beauty but still one of the Cape's best drives."
        }, 
        {
            "index": 379, 
            "rating": "5", 
            "review": "THE MOUNTAINS AND THE HOTEL. The Twelve Apostles Hotel is one of my ffvourite luxury places and it is situated against the backdrop of beautiful mountain peaks, called the Twelve Apostels."
        }, 
        {
            "index": 380, 
            "rating": "4", 
            "review": "Elegant. Classy, elegant, superb service and food. Fantastic views. Great venue for conferences. Love the spa!"
        }, 
        {
            "index": 381, 
            "rating": "4", 
            "review": "We need the6 more. This is a most beautiful coastline along the Atlantic and the perfect place to end a day. The sunsets are beautiful and what better place to hear and feel the sea?!"
        }, 
        {
            "index": 382, 
            "rating": "3", 
            "review": "Pretty?. It's pretty here, but if you live near a beach or have seen beaches before, this is not anything special. Yes, there are some rock formations. We did a drive by, everybody looked, then we were ready to go. It is a nice area but if you are limited on time I would not put this on your \"must do\" list."
        }, 
        {
            "index": 383, 
            "rating": "5", 
            "review": "Worth of view. Great view of Cape Town, if you are in Cape Town, then a must see, highly recommend, it creates the whole atmosfere of the Cape."
        }, 
        {
            "index": 384, 
            "rating": "4", 
            "review": "An amazingly beautiful drive. After fighting through the traffic in the urban areas, this drive is a welcome relief and a marriage of nature and urbanisation. Set at the foot of Table Mountain it gives the best view of sunsets in the Cape Peninsula."
        }, 
        {
            "index": 385, 
            "rating": "1", 
            "review": "Still dont see it.. There is nothing unique or interesting about these mountain ridges. There really aren't a distinguishable 12 apostles like there are in Australia which is amazing."
        }, 
        {
            "index": 386, 
            "rating": "4", 
            "review": "Great place for drinks at sunset. Excellent place to have a drink. The bar balcony looks over the ocean and it's a stunning view. Patrons are served a snack platter of nuts, olives, etc and they just keep 'em coming! Great service. Staff are always presentable, friendly and professional."
        }, 
        {
            "index": 387, 
            "rating": "5", 
            "review": "Excellent. Luxury, style, service and above all the beautiful setting at the foot of the mountains and the endless ocean with breathtaking sunsets"
        }, 
        {
            "index": 388, 
            "rating": "5", 
            "review": "stunning. beautiful and lovely to be next to such a nice back drop to the beautiful beaches all along the coast line"
        }, 
        {
            "index": 389, 
            "rating": "5", 
            "review": "BEAUTIFUL VIEWS. along the side of Table MOuntain. Best done by car, although some do cycle. good views of the Twelve Apostles (mountains) from Camps Bay beach at it's foot.."
        }, 
        {
            "index": 390, 
            "rating": "4", 
            "review": "Scenic drive. Beautiful scenic drive along this stretch of coastline. Views are unbelievable! And a good spot to stop and have tea at the hotel!"
        }, 
        {
            "index": 391, 
            "rating": "4", 
            "review": "Great View. See if you can count the 12 Apostles, I might do it a few times, great views of Cape Town and the surrounding area."
        }, 
        {
            "index": 392, 
            "rating": "4", 
            "review": "Costly but nice. If you have the money, this is a wonderful break away. But be aware! Could leave a hole in your budget."
        }, 
        {
            "index": 393, 
            "rating": "3", 
            "review": "Sundowner spot. Good for sundowners but the road beneath can be busy and disturbing."
        }, 
        {
            "index": 394, 
            "rating": "4", 
            "review": "Beutiful. Great Hotel, beutiful food and spa - pricy but nice"
        }, 
        {
            "index": 395, 
            "rating": "3", 
            "review": "Very nice set of peaks, another nice add-on for Cape Town. The twelve apostle mountains that line the Cape Town coastline are very nice, helping create a nice setting for this amazing city. It is nice looking at them driving up from Camps bay area to the V&A waterfront and towards the city centre, you can get lots of good pictures of them this way. They are also quite visible from the City Sightseeing tour but you've to look at them from the mountainside seats, while most are trying to peer out to the sea. On their own, the twelve apostles are quite overshadowed by the presence of Table mountain and to a lesser extent Lion's Head. However, they do make yet another nice addition to this city, worth at least a dozen photo shots."
        }, 
        {
            "index": 396, 
            "rating": "5", 
            "review": "Magic. Magic views and hiking paths, excellent views over the bay"
        }, 
        {
            "index": 397, 
            "rating": "4", 
            "review": "Stunning Scenery. The Twelve Apostles Mountains were stunning in scenery. I hired a driver and went on a scenic tour around the southern coastline. The views were beautiful from every turn and corner."
        }, 
        {
            "index": 398, 
            "rating": "5", 
            "review": "Great attraction to see while on a cruise or Hiking.. The Twelve Apostles are a group of small mountain peaks that run along the coast of the Indian ocean in South Africa. They are visible as you drive along the coastal highways in Cape Town. Don and I, had the opportunity of enjoying the sight of these beautiful peaks while we were in Cape Town.We had a second viewing when we tool a cruise to Robeen Island from the Victoria and Alfred waterfront. Now I wish we had hiked, but the say we drove along the weather was not that great. I would recommend hiking along the path for a better view and enjoying being at higher grounds.Many people confuse the Twelve Apostles in South Africa with those in Australia. The Australian ones seem to be more popular than the South African ones, nonetheless, they are such a picturesque sight to see and photograph."
        }, 
        {
            "index": 399, 
            "rating": "3", 
            "review": "The beautiful mountains, not the hotel. This is the 'Things to do' section...so not for reviews of the hotel by the same name!! (Please do not review the hotel here).The Twelve Apostles is a range of small mountain peaks that run along the coast with the beautiful suburb of Camps Bay against its slopes.The 12 Apostles are great to look at, take pictures of from a sunset cruise (available from the Waterfront) or to walk along its hiking paths (please check this is still done and hike in groups of 4 or more close to Cape Town centre)."
        }
    ]
}