{
    "category": "Cape-Town-Central", 
    "entity": "South-African-Jewish-Museum", 
    "avg_rating_stars": 4.575197889182058, 
    "review_count": 379, 
    "rating_stats": {
        "poor": 3, 
        "average": 11, 
        "terrible": 5, 
        "very_good": 110, 
        "excellent": 250
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "4", 
            "review": "Interesting if you have seen the main sights. We had to show passports or driving licences to gain admittance. The museum is spread over several rooms and shows the history of the Jewish immigrants. It was well laid out and very interesting."
        }, 
        {
            "index": 2, 
            "rating": "4", 
            "review": "Good traditional Jewish food. Spotlessly clean with a wide range of kosher food, this is a place to relax, unwind and enjoy well cooked and wholesome Jewish food in a quiet spiritual environment. Have eaten lunch on a number of occasions, from a wonderful muffin to a full meal and have always felt I had value for money food."
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "Visit to South African Jewish Museum. Being Jewish, I thought it would be interesting to see how Jewish men and women have integrated into the South African culture. It was enlightening and very interesting, and it was a good choice to visit."
        }, 
        {
            "index": 4, 
            "rating": "4", 
            "review": "Worth A Visit. The museum complex includes the museum, one of the older synagogues of Cape Town, a lovely gift shop and a cafe. In both the museum and synagogue we had a very nice docent show us around and provide us insight about the Cape Town Jewish community. The museum was worthwhile. Our only disappointment was the cafe. The pizza and salads were only fair."
        }, 
        {
            "index": 5, 
            "rating": "5", 
            "review": "Formerly the Holocaust Museum now re-christened. A truly interesting, and at times, harrowing walk through Jewish Holocaust history. It gives one an idea as to the suffering of the Jewish people, which, through the ages, has been rife, but culminated by their persecution by the Nazis. Rarely in history has such suffering been promoted in a futile cause."
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "Historical. SA Jewish Museum is a must see place for everyone visiting and staying in SA. This historical place has deep knowledge and emotions attached to it."
        }, 
        {
            "index": 7, 
            "rating": "5", 
            "review": "Cape Town open bus tour. My friend and I decided as Cape Town residents to do the 'touristy' thing and tour the city and table mountain on the open bus. One of the highlights was the Jewis Museum. It was such an emotional experience, I was amazed at the amount of information available. We actually used up most of our time at the Museum and would need to do the trip again to see the other sights."
        }, 
        {
            "index": 8, 
            "rating": "4", 
            "review": "Lovely museum in the heart of Cape Town. Peaceful museum depicting Jewish history in South Africa. Lovely courtyard with a nice shop and restaurant. Adjoins the Holocaust museum."
        }, 
        {
            "index": 9, 
            "rating": "5", 
            "review": "Don't miss this stop on the Red LIne. Coupled with the Old Synagogue and the Holocaust Museum, the Jewish Museum provides great insights into South Africa's strong Jewish History. The docent was very insightful. The exhibits were very well laid out and very informative. We were only in Capetown for 4 days and this was a very important stop for us. when we are traveling, we enjoy learning about our surroundings as well as experiencing them. The Jewish Museum and the Old Synagogue and Holocaust Museum exceeded our desire for both. Just a reminder, Shabbat, the day of rest, is Saturday and hence tours are not available on that day."
        }, 
        {
            "index": 10, 
            "rating": "5", 
            "review": "Insprational. This a quiet have of Cape Town's history that should not be missed. The exhibites are well displayed and provide an excellent insight into Jewish life and their culture, which is often misunderstood. It is worth the effort to find the place but make sure you have some form of ID?"
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "Great tour. We were met at the door by a docent, and taken for a personal tour through the museum and synagogues. They have done a wonderful job of getting important information about the history of the Jewish people in South Africa and Cape Town. There are photographs, movies, and displays that help with the understanding of this history. This is on a very modern visually attractive space."
        }, 
        {
            "index": 12, 
            "rating": "5", 
            "review": "Worth the security check!. Really interesting museum, looking at the Jewish population of South Africa and their journeys from the Baltic states. Street scene of a Shetl and tables laid out for Shabbat... Interesting exhibition about Jo Burg Taxi hand signals too, anda great coffee shop with nice food and salads"
        }, 
        {
            "index": 13, 
            "rating": "5", 
            "review": "Wonderful Museum. I have visited this museum in Cape Town several times. There are wonderful exhibits and the Cape Town Holocaust Museum [situated in the same grounds] is truly amazing. Most of the staff are volunteers and are highly knowledgeable. Well worth visiting!"
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "Waited too long. The intention to visit the Jewish Museum in Cape Town became reality the past week. Will definitely not be the last visit. There is so much to be seen and my ability to absorb is slightly limited."
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "On our own. It was a last minute decision to visit this museum on one of our off days of touring. The museum staff were first rate and answered questions about things that didn't even have to do with the museum, just conversations that we struck up with them. It was a wonderful education on the origins of South Africa's Jewish roots"
        }, 
        {
            "index": 16, 
            "rating": "5", 
            "review": "Well worth the trip. The South African Jewish Museum was on the Red Bus Tour route and I couldn't do the stop last time I was in Cape Town because it was Saturday. The venue hosts: The Holocaust Museum, The Auditorium which plays videos of interest playing on a loop, The Synagogue, The Main Museum and a gift shop / bistro. The entire venue is of a world class standard and very professional. The Synagogue is a magnificent building in immaculate condition.  The main museum hosts exhibitions not exclusively relating to items of Jewish interest but also a wide range of other exhibitions. The main museum enters through was was the original synagogue, now decommissioned. The staff I encountered at the venue were warm, friendly, helpful and eager to answer questions. A trip well worth making. "
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "History revisited!. In addition to the excellent exhibits, a visit to the synagogue and holocaust museum is a must. Architecture of building inside is beautiful."
        }, 
        {
            "index": 18, 
            "rating": "5", 
            "review": "Engaging, interesting and emotional experience. Thoroughly interesting museum, through its well presented and knowledge-filled exhibitions on the history of the Jewish people in South Africa, and its very emotional and moving tribute to the Holocaust. It also has a very nice cafe inside for lunch which I would throughly recommend going too, although possibly book in advance as be busy. A hidden gem in cape town that I would thoroughly recommend for anyone visiting cape town and was a furthered understanding of Jewish life in Southern Africa"
        }, 
        {
            "index": 19, 
            "rating": "4", 
            "review": "Good short stop. We visited the museum on a rainy day, as part of the hop on hop off bus tour. The museum is about an hour's visit and fairly well done for a local description of the Jewish community's development. We were glad we went!"
        }, 
        {
            "index": 20, 
            "rating": "4", 
            "review": "AN EMOTIONAL EXPERIENCE. The Jewish history was interesting and well presented, conveying lesser known elements of Jewish everyday life. The holocaust memorial wall was an emotional experience and left me with a profound sadness as to the extent of suffering one human can inflict on another."
        }, 
        {
            "index": 21, 
            "rating": "5", 
            "review": "This is a not to be missed gem. We went here on our first day in Cape town. Totally an education and a beautiful small place to wonder. Don't miss it."
        }, 
        {
            "index": 22, 
            "rating": "5", 
            "review": "Wonderful visit and very enlightening. Definitely allow yourself around 2 hours to cover the entire area and allow yourself to absorb a better understanding of the history of the Jews in Cape Town."
        }, 
        {
            "index": 23, 
            "rating": "5", 
            "review": "Must See.. If you are Jewish or interested in matters Jewish, you'll want to put the SAJM near the top of your list. The chances are you don't know much about how the Jewish community started in SA, how it grew, and where it is now.But you will know all that and a lot more when you leave. In fact you may well want to go back. It's all beautifully presented and understandable.Note that on the same campus is a wonderful cafe/restaurant (site outside in the sun on most days), the Holocaust Museum, and the exquisite and historical Gardens Shul, the oldest in Cape Town.Don't rush. Give yourself plenty of time here. You'll want it and you'll be glad you did."
        }, 
        {
            "index": 24, 
            "rating": "5", 
            "review": "Extremely well done and informative. Lovely Garden Shul.. Extremely well done and comprehensive insights into the history of the Jews on the Cape--from small time peddlars to diamonds and ostrich feathers. Lovely exhibits, The modern orthodox still functioning synagogue is architecturally lovely and combines Eastern European traditions with a few Sephardic touches. Ask about the story behind and the symbolism of the fairly new stained glass windows."
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "Impressive historical site. This was a surprising and impressive historical site. The old jewish synagogue and the history of the CP jewish community was well worth the visit"
        }, 
        {
            "index": 26, 
            "rating": "4", 
            "review": "Interesting history of Jewish people in South Africa. Fascinating video and beautiful displays. The Holocaust Memorial in the same location is free and very informative if upsetting. The cafe is great for a light lunch."
        }, 
        {
            "index": 27, 
            "rating": "3", 
            "review": "Intense. Visited during the Museum night in Cape. Bustling and busy with traffic. Good vibe outside with the event.Intense museum. Eye opening and interesting."
        }, 
        {
            "index": 28, 
            "rating": "4", 
            "review": "Not much to see but The Holocaust Museum makes it worth the trip.. The South African Jewish Museum is sparse in it's offerings, though nicely appointed. Not sure what the miniature Asian carvings have to do with anything. However the The Holocaust Museum makes it so worth the trip. Well played out, well documented, beauty and sadness that will bring a tear to your eye. "
        }, 
        {
            "index": 29, 
            "rating": "3", 
            "review": "Hoped for a better experience. Would have liked less of \"these are practices of Jewish people\" and more specific to South Africa, especially present day. Nice seeing the original synagague. Good gift shop."
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Soulful and Proud. This is a stunning museum that details the history of the South African Jewish community. It is well designed and interactive. The displays are thoughtful and well curated. There is a great sense of pride on display with the achievements of many high profile and successful people tastefully highlighted. I congratulate the staff and volunteers of the museum on a wonderful exhibit."
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "A Great Opportunity To Learn About The Connection Between The Jewish Community and The Black Community During Apartheid. We spent approximately one hour at the museum, and highly recommend adding it to your list of sites to visit. Eye-opening information about the relationship of the Jewish community in Cape Town to the black community during apartheid. Learn about how the Jewish community supported Nelson Mandela and opposed apartheid."
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "History comes to life. The story of Jews in South Africa was not one I had considered. This museum told the story through drawings, photos, maps and movies."
        }, 
        {
            "index": 33, 
            "rating": "4", 
            "review": "Must see if you're into Jewish tradition, history etc., but also for anyone interested in history and communities. It is a lovely little museum, which is interesting for a short visit on a rainy day - and especially for those interested in matters Jewish. There is even a nice restaurant serving Kosher food in the complex and a beautiful synagogue (Gardens) worth visiting."
        }, 
        {
            "index": 34, 
            "rating": "4", 
            "review": "Well worth the visit. Very interesting to see the history of how the Jewish people came to live in Cape Town.\nA shame that both synagogues were not open for visiting."
        }, 
        {
            "index": 35, 
            "rating": "5", 
            "review": "South African Jewish Museum. Irrespective of one's religious beliefs, visiting this establishment is a must for any tourist interested in historical events of great impact. The literature and historical pieces gathered from this period - although very sad - were extremely fascinating and provided some insight into the experiences of those involved in this war.On a lighter note, the on site coffee shop offers a vast array of tasty traditional Jewish cuisine in a friendly and relaxed environment."
        }, 
        {
            "index": 36, 
            "rating": "4", 
            "review": "Very interesting visit.. Firstly take some ID, we had some problems getting in. Luckily we had photo ID on our phones. Once you are in there is plenty to digest in this well thought out museum. In my opinion, the section dedicated to the move to SA from the Baltic States is the best area."
        }, 
        {
            "index": 37, 
            "rating": "4", 
            "review": "A lot of new knowledge. I knew very little about the jewish migration to South Africa, and it was very interesting to learn about it,"
        }, 
        {
            "index": 38, 
            "rating": "4", 
            "review": "Very worth while to visit. you really get a sense of the history of this community in South Africa, which mirrors not only the history of the persecuted Jewish community in Eastern Europe and their migration, but also the history of merchants and miners in South Africa.. For me it was the history of the community in SA that was valuable, the other stuff was good but not special"
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "Beautiful Museum. Jews and non-Jews alike will find this museum very interesting and the history of the Jews in South Africa."
        }, 
        {
            "index": 40, 
            "rating": "4", 
            "review": "Short but interesting visit. We just returned from a trip to South Africa with Smartours. In addition to the tours offered during our stay, we managed to fit in a short visit to the Jewish Museum and adjoining synagogue. Very interesting exhibits and knowledgeable staff, providing some history of South Africa's Jewish population."
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "Interesting an informative. One of the best museums in Cape Town, if you're interested in the Jewish History. I come across the museum by chance, while looking for the Sixth District museum and it was definitely worth the visit. The exhibits are interesting , informative, give clear and full picture if the Jewish settlement in various parts of South Africa, they also refer to Holocaust and racial issues in general. Be prepared to go through airport style security checks while entering the museum. I spent there about an hour and it was definitely not enough. "
        }, 
        {
            "index": 42, 
            "rating": "4", 
            "review": "A very quiet place in Cape Town. I visited the museum on impulse, and I do not regret.Exhibitions were interesting and the connected holocaust center is well worth the extra time spent."
        }, 
        {
            "index": 43, 
            "rating": "4", 
            "review": "'Sunday get together'. We had the need to provide refreshments for some friends and this turned out to be the ideal place on a beautiful sunny morning in Cape Town. The food was snack type with tasty cheese cake and chocolate mousse. It was an appropriate place to spend time and then to take in the museum"
        }, 
        {
            "index": 44, 
            "rating": "4", 
            "review": "This isn't just about what happened in Germany. There were successive groups of school children going round the exhibition on the day I visited. The exhibition is excellent. The message of what happened in the holocaust is broadened to include the South African context. It covers anti semitism in South Africa, apartheid and racism also. In the cinema there was a short film about Nelson Mandela. Well worth a visit. The shop sells some interesting things and there is a nice cafe and a courtyard you can sit in. Why didn't I give 5 stars? I found it quite noisy with the tours going on and the guides voices overlapping each other was distracting."
        }, 
        {
            "index": 45, 
            "rating": "5", 
            "review": "FANTASTIC. If you are interested in South African Jewish history then it's definitely worth visiting the museum. There is secure off-road parking. The deli is also fantastic. Afterwards it's nice to take a scroll through the Company Gardens to feed the squirrels and walk past the parliament."
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "Deeply moving and highly recommended.. A place of remembrance and hope for the future. The Synagogue and exhibition are full of reminders of the contribution Jewish people have made over many years to the Cape. Also recommended is the cafe and shop. Fresh food and cool drinks are available and the shop is full of quality souvenirs and memoirs."
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "First-class museum experience!. This is probably the best designed museum in Cape Town. An excellent introduction to the Jewish community of South Africa and it's great contribution to the country. And don't forget to visit the beautiful Great Synagogue of Cape Town next door - one of the city's most beautiful buildings. Also,remember to bring your passport or other identity document with photo to gain admission."
        }, 
        {
            "index": 48, 
            "rating": "4", 
            "review": "wonderfully interesting. we visited the SA Jewish museum, holocaust exhibit and great synagogue and found this extremely interesting as well as historic.all visitors to SA should take the opportunity to learn of the contribution that Jewish immigrants have made to SA, also the support that the community gave to the anti apartheid movement"
        }, 
        {
            "index": 49, 
            "rating": "5", 
            "review": "Beautifully done.. We latched on to an organised tour and were fortunate to get a full account of the start of the Jewish movement in Cape Town. The synagogue is based on European design and is really nice.The museum itself is really well presented with plenty of film of a bygone era. Well worth a visit."
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "This is one of the best Jewish Museums we have ever been to. This museum is on a few floors and is attached to the old Synagogue in Cape town. It talks about the history of the Jewish population of South Africa but more important it talks about the interaction between the Jewish population and the other populations that lived in South Africa iincluding the Black population and where the Jewish population stood on Apartheid"
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "Small elegant space - brings out deep personal feelings when you visit.. Combining both the history of Apartheid and the Jewish migration into Cape Town and Africa, this space is a gem of a 'attraction'. Well done down to the walk through re-creating of a local Jewish house. it celebrates not only the history of Jews but one local woman who did so much during Apartheid years. Helen Suzman, a politician and beautiful human. The exhibit is well laid out. and there is a plce to sit and contemplate and pray if you want. The Holocaust Centre next door is worth a stop but doesn't compare to the Museum itself."
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "Excellent. A worthwhile experience but remember to have photo ID with you for entrance. Well set out, a mixture of DVDs playing, storyboards and rooms recreated as from that time."
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "Great experience for everybody. dont miss this gem. Bring an identification which is needed to get in. Very good exhibition of Helen Suzman. Planned to stay 30 minutes but ended up staying 1.5 hour! Its that good!"
        }, 
        {
            "index": 54, 
            "rating": "5", 
            "review": "Jewish roots in South-Africa. Experience one of the first synagogues in the Southern-hemisphere. Learn and see interesting artefacts on a campus of Jewry. Whether you are Jewish or not you should find value here."
        }, 
        {
            "index": 55, 
            "rating": "5", 
            "review": "Fascinating Museum. Interesting and informative museum on the history of Jewish settlement in South Africa. We had a wonderful volunteer guide who shared additional information. There is a lovely courtyard, restaurant and gift shop. Don't miss the film on Nelson Mandela which is in an adjoining building across the courtyard. "
        }, 
        {
            "index": 56, 
            "rating": "4", 
            "review": "Interesting. A very helpful guide told us all about the Jewish faith, showed us the synagogue etc. Very well done. It is on the hop-on bus route, which also helps .Worth a visit."
        }, 
        {
            "index": 57, 
            "rating": "4", 
            "review": "Good historical presentation. Too many Jewish museums present Jewish relics behind glass, and talk about companies that local Jews founded. The SAJM has that, too, but the history and the companies are well-presented, and the temporary exhibit on Helen Suszman was very good. The old and new shul buildings are a study in upward economic mobility, but at least they are still in use."
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "Well worthwhile fascinating visit. There is a lot to see and understand in this museum. The guides there are very friendly and give you a more personal view of the Jewish community. We particularly enjoyed the time in the enormous synagogue where a lady told our group various interesting background details. Don't miss the Mandela video, very informative. The museum is near to Parliament, so sometimes the road is closed to cars but accessible on foot through the Company Gardens. There is also a very nice restaurant with unusual food items. Note that the Holocaust museum is completely separate."
        }, 
        {
            "index": 59, 
            "rating": "4", 
            "review": "Worth the Visit. Well developed and fascinating! The Mandela section is better than the Robben island exhibit as far as understanding is concerned. The role of Jews in the fight against Apartheid is well presented. The synagogue is a trip back in history and beautifully kept up as an active facility. Certain times of the year it draws well over a thousand congregants."
        }, 
        {
            "index": 60, 
            "rating": "5", 
            "review": "Very informative. The staff were very friendly and the exhibits quite informative. The Mandela documentary is well done. A visit to the lovely synagogue is also a treat. The guide there was also well-informed. The cafe is nice and there are very interesting items in the gift shop. It is well worth a visit."
        }, 
        {
            "index": 61, 
            "rating": "5", 
            "review": "Worth the visit. I think every person should add a visit to this venue to their \"bucket-list\".\nEspecially the Holocaust exibition is very informative.\nThe restaurant is also good value for money."
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "Astonishing visit. We spent practically the whole day. The staff were very helpful and we also had a lovely meal at its restaurant. The original synagogue is part of the museum however a new one was built and is on the same campus. You leave with a full knowledge of the history of the Jewish community in South Africa."
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "Very Interesting. We had no idea there was such a large Jewish presence in Cape Town, and were well informed by visiting the museum. The exhibits are well designed, and quite interesting. We enjoyed the Helen Suzman exhibit, and were pleasantly surprised with the collections of Netsuke (Japanese miniature art)."
        }, 
        {
            "index": 64, 
            "rating": "4", 
            "review": "surprisingly rich. Enlightening to find out about the large Lithuanian Jewish migration to South Africa to avoid persecution in Europe. The Jews prospered and did a lot for South Africa! I loved the model of an old Eastern European village with Yiddish songs playing. Very moving."
        }, 
        {
            "index": 65, 
            "rating": "5", 
            "review": "Great museums . Surprised to see such a vibrant Jewish community in Cape Town. The entrance to the two museums, the Jewish Museum, and the Holocaust Museum begins with a tour of their synagogue which was founded in 1905, still very active today. Both museums are extremely well done and interesting. Bought many souvenirs in their gift shop. There was also a cafe. Highly recommend!!!"
        }, 
        {
            "index": 66, 
            "rating": "5", 
            "review": "One of the best museums I've ever seen. A fantastic display about the lives & history of Jews in South Africa.An entire room is dedicated to Helen Suzman, a key politician who campaigned tirelessly about the injustice of Apartheid, prepared to stand up & speak out against the establishment and fight for those without a voice.Very moving & inspiring. Beautiful artifacts, art, glasswork, synagogue"
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "Well put together museum. This museum offer a good overall view of the history of South African Jewry tracing the routes to get there. It is put together in a clever way, combining technology with reconstructions"
        }, 
        {
            "index": 68, 
            "rating": "5", 
            "review": "a step into the past. a Visit to the Jewish Museum is a must. You enter the museum through the old synagogue, which was replaced by the new one in 1905 . From the synagogue you pass a long passage that represents the dock and what new immigrants would see when they got of the boats and set foot in their new country. One of the most outstanding displays for me was the recreation of the shtetl - a monument to townlife in Lithuania, from where most Jews living in South Africa came. very informative and enjoyable"
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "HISTORY. if you are interested in this era or event..... then this is a must. definitely worthwhile the visit. this is one of the stops for the \"hop on hop off\" bus. hop off explore the museum and hop back on again."
        }, 
        {
            "index": 70, 
            "rating": "4", 
            "review": "Fascinating. A fascinating insight into the Jewish Community in South Africa as well as their eastern european origins."
        }, 
        {
            "index": 71, 
            "rating": "5", 
            "review": "Emotional and pleasant. It is very emotional, but it is also very personal. I will recommend it to anyone who loves Israel and her history."
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "fascinating. This was a most interesting visit, very informative. . If visiting you need to have photo I.D ideally a passport."
        }, 
        {
            "index": 73, 
            "rating": "4", 
            "review": "Impactful and informative. This small but well done museum gives visitors a look at the impact of the Jewish community in Cape Town. I was particularly impressed with the information on Helen Suzman, her fight against apartheid and friendship with Nelson Mandela. The films, photographs and artifacts were well worth seeing and the stories and explanations by the very knowledgeable docent added to their impact. There is also a gift shop and café with tables set outside in a lovely garden area. You will have to have in ID and enter through a security area."
        }, 
        {
            "index": 74, 
            "rating": "4", 
            "review": "Interesting historical artifacts and writings. A humbling experience if you get the guides to explain the hardships and difficulties. It gave two accompanying young adults a sobering story about real life and the courage of Jewish leaders in SA and abroad.."
        }, 
        {
            "index": 75, 
            "rating": "5", 
            "review": "Extremely informative . I visited the museum during my weekend in Capetown.Yes, ID was required to enter (so don't forget your ID), but I was not surprised by this.The museum is new, and has a fresh look to it.When you first enter, the is a room full of articles found in a synagogue, from years back. I was very interested to see how theses religious articles have for the most part stayed true to form, over all these years. A magnificent replica of the Torah Arc was built there as well, which is quite beautiful.We made our way to the next building, which housed many interesting pictures and exhibits.I was especially moved by the Helen Suzman exhibit. This is a women who fought singlehandedly against apartheid for most of her life.Her story is absolutely remarkable and I watched the video of her life for more than half an hour, mesmerizing as it was.This was followed by a interesting collection of Japanese artifacts from a collection of one of the SA Community's prominent members.Once we finished this, we had a delicious lunch on the grounds and visited the gift store.All in all, it was a wonderful two hour visit and a worthwhile stop for anyone visiting Capetown."
        }, 
        {
            "index": 76, 
            "rating": "4", 
            "review": "Very Informative. Quaint well presented museum with an amazing amount of informative information. The exhibits are all wonderfully displayed and the guides very helpful, friendly and extremely knowledgable. There is also a beautiful suspended staircase within the building."
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "Excellent insight on the Jewish community in the Cape. The Jewish Museum offers a very interesting insight on the life of the Jewish community in the cape and of its role during the apartheid era. It's easily reachable via the yellow line of the hop on/hop off tourist bus and is definitely worth a visit."
        }, 
        {
            "index": 78, 
            "rating": "5", 
            "review": "Quite suprising. It was a quite suprising, interesting and instructive visit on the arrivals and settlements of the Jews in South Africa."
        }, 
        {
            "index": 79, 
            "rating": "5", 
            "review": "Fascinating part of SA history. Only got there 40 minutes before closing but it was a fascinating glimpse of the story of immigration and the role of Jews in the development of South Africa."
        }, 
        {
            "index": 80, 
            "rating": "4", 
            "review": "Interesting site in the Cape Town City Bowl. Small museum but it authentically captures the Jewish traditions and way of life. Go visit the nearby synagouge and holocaust museum."
        }, 
        {
            "index": 81, 
            "rating": "4", 
            "review": "Very interesting insight into the South African Jewish Community. The Jewish Museum and Holocaust Centre are worth spending time at. As well one of the oldest synagogues is adjacent to the Museum. There are a number of artifacts telling the story of the community's history in South Africa."
        }, 
        {
            "index": 82, 
            "rating": "5", 
            "review": "The wounds of the past. This museum truly depicts the memorial of the suffering of the jews under Hitlers command. Definitely worth the visit."
        }, 
        {
            "index": 83, 
            "rating": "5", 
            "review": "Beautiful synagogue and highly informative museum. The windows of this synagogue are fairly new and absolutely gorgeous, each depicting a different Jewish holiday. The replica of shtetl was interesting and the museum was very informative and the filmed testaments of survivors was very moving. You need to take your passport with you or other identity document or you won't get in. If you're going, there is a kosher restaurant and some lovely items in the gift shop."
        }, 
        {
            "index": 84, 
            "rating": "5", 
            "review": "Capetown's Jewish Museums. Excellent history of The Jewish people in South Africa. The Jewish Museum and the Holocaust Museum are extremely well done. The Synogogue was absolutely amazing.Definitely worth a visit by everyone."
        }, 
        {
            "index": 85, 
            "rating": "5", 
            "review": "Wonderful Small Jewish Museum. Able to see the synagogue which was build in the early 1800's and see the architectural style and history. Also attached was the Jewish museum which was concisely organized and provided a wonderful history on the immigration and life of South African Jews. Historically very interesting. This followed by the Holocaust museum.Great afternoon of history. Allow 2-3 hours for the entire three sites. Definitely a go to if you have any interest in Jewish life and history in South Africa."
        }, 
        {
            "index": 86, 
            "rating": "5", 
            "review": "Memorable. A wonderful exhibition of the history of the Jewish community in South Africa not to be missed when visiting Cape Town. We were shown around by a great guide Fay who was very knowledgeable. The holocaust exhibition was very moving. The synagogue was a cathedral style building and was most beautiful"
        }, 
        {
            "index": 87, 
            "rating": "4", 
            "review": "Poignant. We visited the holocaust section and were moved, as always, by the story it tells. The personal testimonies are harrowing."
        }, 
        {
            "index": 88, 
            "rating": "5", 
            "review": "Must See. This was such a wonderful museum. The synagogue, the museum and the Holocaust museum all next to each other. A docent tour was helpful."
        }, 
        {
            "index": 89, 
            "rating": "5", 
            "review": "Wonderful history of Jewish life in South Africa. After paying the entry fee, I asked for a map. I was offered a volunteer to tell me about the museum. Roz was a wonderful guide who stayed with us through the entire museum. Not only did we learn about the history of Jews in South Africa, but we also learned a lot about Cape Town history in general. Unfortunately, we did not get into the synagogue next door as none was there to let us in. The shtetl within the museum was a really nice touch. I also liked the method of standing under a 'hood?\" to hear what different famous people, like Nelson Mandela, had to say about the Jews of South Africa."
        }, 
        {
            "index": 90, 
            "rating": "5", 
            "review": "Excellent museum. Probably one of the best Jewish Museum we've been to around the world. The synagogue is beautiful and explained to us in detail. The museum is very professionally presented. The lower level has a recreation of a shtetl that you can go in the home and shul. I haven't seen this anywhere. The Holocaust Museum presents the Era around the world. Very important as it didn't affect South Africa so their population needs education. 5 of us visited here and we all were glad we gave up another tour to do so."
        }, 
        {
            "index": 91, 
            "rating": "5", 
            "review": "A real eye opener. Learn through interactive media displays and art exhibitions about the journey of Lithuanians (mainly of Jewish descent) who immigrated to Cape Town in the early 1900's. Visit the Holocaust Museum and the Great Synagogue while you there."
        }, 
        {
            "index": 92, 
            "rating": "5", 
            "review": "Celebrate, educate, explore history. You do not need to be Jewish to enjoy this museum. Located near Parliment, the Old Synagogue, and the African History Museum, this is a must see to understand the culture and history of South Africa. We suggest including the other items mentioned above a part of this excursion. Maybe start your day at Table Mountain, then take the hop on/off to downtown."
        }, 
        {
            "index": 93, 
            "rating": "5", 
            "review": "A must see. Even if you are not Jewish, this is a must see museum to understand the South African culture.Great experience"
        }, 
        {
            "index": 94, 
            "rating": "4", 
            "review": "Very informative. Also gorgeous Japanese netsuke (carved miniatures). 50 rand/pp to enter. Be sure to bring ID. Tight security. Museum has essentially 4 parts. 1) Religious artifacts used for different holidays/observances, 2) history/influence/immigration of Jews who settled in South Africa, 3) short biographies of prominent Jewish South Africans and 4) a small room of gorgeous Japanese netsukes collected by a prominent SA Jew. The Lithuanian schtetl recreation downstairs wasn't much. You can also go in the Synagogue for a short tour. Synagogue is main orthodox one in Cape Town and is attended by over 800 members. Quite informative."
        }, 
        {
            "index": 95, 
            "rating": "4", 
            "review": "Small but very well done.. This museum is telling the story of the Jews who settled in Cape Town and their part in the South African community. There's also a small holocaust museum... Don't forget your photo ID."
        }, 
        {
            "index": 96, 
            "rating": "3", 
            "review": "May be a good museum but appeared to be closed on a weekday when my guidebook (Lonely Planet) said it should be open.. I tried to visit this museum on a weekday when it was scheduled to be open. However it was difficult to tell where the entry way was. I tried what appeared to be the entry next to what was obviously their Jewish item gift shop. I rang the buzzer and got no answer. This was the entry on the main street and it appears that the rear entry adjoining the mall and other museums could not be entered."
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "SA Jewish Museum. This beautiful museum shares about the history of the Jewish people in South Africa. It also has a bookshop selling Jewish things."
        }, 
        {
            "index": 98, 
            "rating": "5", 
            "review": "Worth Seeing. This small museum is a gem worth visiting. The Cafe Riteve was delicious for lunch and is attached to the gift shop."
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "A vast and incredible unknown history. What a pleasant surprise. I had no idea the VAST history and influence the Jewish community has had throughout all of South Africa. Especially loved the area speaking of influential members of the Jewish community in politics, sports, and business"
        }, 
        {
            "index": 100, 
            "rating": "5", 
            "review": "Informative and interesting. A very informative, interesting museum--my wife and I never knew Lithuania provided so many SA inhabitants. A beautifully designed environment."
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "Do not miss this!. This is one of the best museums of any kind that I have visited. If you are in Cape Town do not miss this opportunity"
        }, 
        {
            "index": 102, 
            "rating": "5", 
            "review": "Superb cultural museum. This lovely museum is small but packed full of interesting exhibits about the history of Cape Town and South African jewish life. There was a particularly good section about the role that many South African jews played in the fight against apartheid. There was also an excellent exhibit that traces the migration of jews from Europe to South Africa and their role in building Cape Town and Johannesburg. Do not miss the cafe which had a limited offering but some of the best soup, salads, and sandwiches I have had in town. In addition, the museum shop, while small has a great selection of African and jewish themed offerings. Be certain to either bring your license or passport for entrance and there is a small entrance fee. Unfortunately, the Garden synagogue was not open today (Friday afternoons and all day Saturdays but if possible, make certain to go in to see the stained glass windows in the oldest Cape Town synagogue."
        }, 
        {
            "index": 103, 
            "rating": "4", 
            "review": "A learning experience. The South African Jewish Museum is part of a group of buildings that also include the Holocaust Centre and a functioning synagogue. It was most interesting to walk through and grab a snack at the kosher restaurant attached and people watch. It was easy to get to from the Hop On And Off bus. Right at the stop."
        }, 
        {
            "index": 104, 
            "rating": "4", 
            "review": "Intelligent and interesting displays. Friends and I hopped off the hop-on, hop-off bus to visit the museum and see the film there about Nelson Mandela. One of the highlights of the visit for me was seeing the shetl that's been recreated, to give the visitor a sense of the village life Jews left behind in Europe when they moved to South Africa. There were several people there to welcome and guide us and I felt it was worth the time to visit."
        }, 
        {
            "index": 105, 
            "rating": "5", 
            "review": "Worth a morning visit. We had a very meaningful and informative visit to the museum and synagogue. The guide was very knowledgeable and really gave us an understanding of the Jewish community who settled in South Africa and made an important impact on the country."
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "Worth a visit. The first synagogue in Cape Town. Interesting anecdotes about local Jewish population history. Informative exhibitions"
        }, 
        {
            "index": 107, 
            "rating": "4", 
            "review": "Interesting Exhibits. There are some very interesting exhibits here about the history of Judaism in South Africa, and we were taken on a tour of the museum by a very nice docent. The Holocaust Center is adjacent to the museum and is also interesting to visit. There is a fee for the museum, but the Holocaust Center is free. If you take a cab there, have the security person call to get you a return cab as there were not any on the street."
        }, 
        {
            "index": 108, 
            "rating": "5", 
            "review": "Fascinating exhibits right in the heart of the city. A really interesting visit to the museum which beautifully intertwines the history of Judaism in South Africa with South African history more broadly. Whether you are from Cape Town or an international visitor, it seems to me there are aspects of interest for everyone. The whole complex is well designed and there is a great coffee shop for enjoying the sunshine while thinking about what you have seen. We found our visit moving and very worthwhile."
        }, 
        {
            "index": 109, 
            "rating": "5", 
            "review": "A welcoming place for Jews. If you are Jewish and want to know something about the history of Jews in South Africa, this is the place to go. You'll meet warm, welcoming people who are more than happy to share the region's history."
        }, 
        {
            "index": 110, 
            "rating": "1", 
            "review": "A waste of Time. I was so anxious to visit the Jewish Museum in CapeTown. Don't bother. There was little to see or learn. Instead, go to the Holocaust Museum in Washington, DC, or the Jewish Museum in Philadelphia. Don't waste your time here."
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "Outstanding Museum. The Jewish Museum in Cape Town is outstanding. This museum is truly touching and so beautiful. Including the region where the Jewish Museum is located worth a visit. This is another place that must be visited during the stay in Cape."
        }, 
        {
            "index": 112, 
            "rating": "5", 
            "review": "Well worth a visit. Went there via Hop on/ Hop off buses - well worth it. Very interesting and informative and well laid out."
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "Going back in time. Situated within a secure compass. A visit to the museum will take you back in time when life was hard yet simple. While the Jewish roots are well exhibited it demonstrates the on going culture which still exist today among the Jewish community. The museum houses many traditional Jewish artifacts used over a long period of time. You can also visit the Holocaust museum dedicated to the millions of Jews killed in WW2 and the Great Gardens Sunagogue. All within the same campus. Then enjoy a meal at Cafe Retina kosher restaurant. The venue is on the hop-off red bus route and you can also stroll down to the City Centre pass the Houses of Parliament and High Court. A visit to the adjoining gardens takes you to the SA museum and planaterium. Arriving at the top end of Adderley Street onto the CBD."
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "Remarkable insight. Personal tour (thank you Fay) taught me so much about Jewish life and the influence of jews in opposing Apartheid."
        }, 
        {
            "index": 115, 
            "rating": "5", 
            "review": "Well worth a visit. Easily reached if you have a car or are on the Red Bus tour, the Museum tells the story of the Jewish contributions to Cape Town and South Africa. The adjoining Holocaust Centre (part of the complex) is also a jewel: the personal video testimonies at the end were heart-rending. We also loved seeing the synagogue and hearing the information/personal story of the member of the congregation who was there. The cafe serves excellent food and was quite busy when we were there. Remember: the entire complex is closed Saturdays (for Shabbat). Parking is easy and convenient just a block from the Museum."
        }, 
        {
            "index": 116, 
            "rating": "4", 
            "review": "Fascinating history of Jewish life in SA. Well organized display of the history and present day life of the Jews in Cape Town and South Africa. At the time we went they had a terrific photograph exhibit by David Rubinger. Well worth the time."
        }, 
        {
            "index": 117, 
            "rating": "5", 
            "review": "Incredibly Powerful Experience. In order to learn from history it needs to be recorded and this museum is a very sobering exhibit of one of the biggest atrocities of our time. One needs to visit this exhibit to comprehend the scale of what occurred and as opposed to being depressing one leaves with a wonderful sense of the tenacity of the human spirit and how some individuals managed to survive despite such great odds. The museum is run almost entirely by volunteers that are both passionate and knowledgeable about this message and exhibit."
        }, 
        {
            "index": 118, 
            "rating": "5", 
            "review": "Well worth a visit. This museum is located within the city - allow minimum 1 hour. It has a café and clean ablutions. It offers a realistic account of the Holocaust. Well worth a visit!"
        }, 
        {
            "index": 119, 
            "rating": "3", 
            "review": "jewish museum. It was a nice visit. The museum is well maintained. The security to get in was a bit of a hassle. I would recommend this only for museum lovers."
        }, 
        {
            "index": 120, 
            "rating": "4", 
            "review": "Good source of documentation. The documentation of the Jewish history is rather good here. Staff are helpful. Visit the first synagogue on-site when you are there. Very educational for children."
        }, 
        {
            "index": 121, 
            "rating": "5", 
            "review": "Harrowing and Sobering but definitely worth a visit. It was well laid out and informative. And what I liked was that at the end they had a display and information about the struggles and oppression in SA's apartheid system which was another example of what humans inflict on each other."
        }, 
        {
            "index": 122, 
            "rating": "5", 
            "review": "Museum and Restaurant setting. It has a very warm welcoming atmosphere, a shop for jewish memorabilia, and a wonderful museum. The food is tasty, milk and vegetarian, no meat products. Can sit inside or outside in a lovely tree covered setting"
        }, 
        {
            "index": 123, 
            "rating": "5", 
            "review": "My second visit-- and an outstanding museum is better than ever. This museum is an interactive, exciting experience, well worth a two or three hour visit. It tells the story of the Jewish community in this beautiful country, and of their triumphs and tragedies. It is very vivid and lively in its story-telling, and totally informed my visit to this city and country. There is a special exhibit about the Jewish contributions to the development of the ostrich feather industry along the Garden Route, and the uplifting and detailed hisstory I learned here, informed my visit there. If you go to the locations where the ostrich farms are, there is nobody to tell you, and no place where you can learn about the Jewish pioneers and their contributions to this industry. Similarly, there is an amazing exhibit about the Jewish community's fight and sacrifice alongside the black community to end the despised imposed apartheid laws. This museum wouldn't have been complete without an exhibit detailing the Holocaust, and it is a very moving and informative lesson about what evil humanity is capable of,the attempts at resistance, the political games played with immigration quotas that cost millions of lives, and so many other aspects of this attempt to obliterate the Jews of the world. These are lessons that must be preserved and applied in our own day, around the world. There is a lovely courtyard, gift shop and restaurant here, and it is right in the heart of a beautiful section of downtown Cape Town."
        }, 
        {
            "index": 124, 
            "rating": "5", 
            "review": "Many of the displays are interactive and very informative. I wandered through here with my hubby. Neither of us were really aware about the contribution to South African development has been made over the last century by the influx of Jewish immigrants into this country. I was asked by a volunteer, why I had come into the museum if I wasn't Jewish, it's because I wanted to learn."
        }, 
        {
            "index": 125, 
            "rating": "5", 
            "review": "Food for Thought. Part of this museum is the Holocaust area. They don't limit the discussion to Jewish people, but to all people caught in the wheels of a hate machine, such as the Rwandans. The museum offered a small but powerful exhibit about Rwanda, featuring photographs of pairs of people: perpetrator and victim. The pairs talked about what the reconciliation meant to them. I have continued to think about what one man said to the woman he hurt (destroyed her home, killed men in her family). It was, \"By forgiving me, you have given me a chance to regain my humanity.\""
        }, 
        {
            "index": 126, 
            "rating": "3", 
            "review": "Just a Museum. IF you a lot in Jewish culture, I think it might be interesting. We were just passing through nice garden and found this museaum. Worth visit if you have nothing to do or you a jewish."
        }, 
        {
            "index": 127, 
            "rating": "4", 
            "review": "Great Synagogue/Museum. Nice combination of the present functioning synagogue with the 'old' synagogue and a museum. Give one a complete picture of the community."
        }, 
        {
            "index": 128, 
            "rating": "5", 
            "review": "Grounding. This is a museum that is not just for Jewish individuals both from South Africa and abroad. The museum has lessons for everyone learn."
        }, 
        {
            "index": 129, 
            "rating": "4", 
            "review": "Excellent Historical Perspective. In a couple of hours, one learns the history of the Jewish population in most of South Africa. The exhibits are displayed in historical context. We had the privilege of a docent-led tour, but the explanations at each point are easily understood. Of special note- the complete depiction of a portion of a European shtetel. At he same location- The largest synagogue in the area, a wonderful restaurant and the Holocaust Memorial."
        }, 
        {
            "index": 130, 
            "rating": "5", 
            "review": "Great place to visit. We had a wonderful visit here with our friends. A lovely man told us about the Synagogue which was quite decorative and perhaps the most attractive of any Synagogue I have seen.At the time we visited, the Museum had a very interesting exhibition of Japanese miniature carved items - Netsuke - which were superb. The shop attached to the Museum complex had some lovely items too that were a good price and unique items to South Africa ... well worth a visit regardless of your faith."
        }, 
        {
            "index": 131, 
            "rating": "5", 
            "review": "A well-done, interesting and informative museum. Our visit to Cape Town's Great Synagogue and Jewish Museum was a wonderful treat. First we visited the beautiful Great Synagogue and were given a tour and an interesting background of the Jewish community of Cape Town by a very friendly and informative docent named \"Ben\" (sorry Ben, I forgot your last name). Next we visited the Jewish Museum which offers a well- presented, comprehensive and sometimes surprising history of South Africa's Jewish Community and their contributions to South Africa. On the same grounds is South Africa's Holocaust Museum which, unfortunately, we got to just as load-sharing was kicking in and power was about to be turned off - so our visit was all-too-brief. But from we could see of it, it is an extremely well-done, state-of-the-art museum which covers its subject comprehensively and eloquently. Between the Great synagogue, the old synagogue, the jewish Museum and the Holocaust Museum, one could easily spend several hours here and that time would be well-spent: definitely worth a visit! (And thank you, Ben!)"
        }, 
        {
            "index": 132, 
            "rating": "5", 
            "review": "No words to say. A really nice museum and a nice way to learn about jewish culture and the movement to South Africa. I really liked to visit the place and find the past and the present together, interactive ways to learn about them."
        }, 
        {
            "index": 133, 
            "rating": "5", 
            "review": "So interesting. So much to see there and so interesting. There is a little cafe and shop on site along with a Synagogue built on the site of a very old Synagogue."
        }, 
        {
            "index": 134, 
            "rating": "5", 
            "review": "Well worth a visit!. We visited this Museum for the first time recently and really enjoyed our time there. The synagogue is really beautiful and the lady who showed us around was very informative. The museum is also great and very interesting, as was the Holocaust Museum. The little restaurant is a good place to have coffee,lunch or afternoon tea. Well worth spending a few hours there!"
        }, 
        {
            "index": 135, 
            "rating": "5", 
            "review": "Interesting. Definitely recommend locals and international guests to visit this insightful museum. Fascinating history of the Jews in South Africa and Cape Town."
        }, 
        {
            "index": 136, 
            "rating": "5", 
            "review": "Take the time for an amazing experience. While the rest of the group that we were with were touring wine country, we took a day off to tour on our own, specifically this museum. It explores Jewish history in South Africa, as well as the context of Jewish participation working with Nelson Mandela. It is not just a museum, but remains a vibrant center of Jewish activities in Capetown. It has a small cafe with very reasonable prices (and includes Kosher food). The cafe allowed us to spend even more time exploring the museum. While my wife & I explore museums very differently (she does it in half the time that it takes me), we were both totally engrossed by the exhibits here. Walking around is not difficult for the mobility impaired. Expect to spend at least two hours.You need a photo ID to enter, but your passport is adequate.Our guide, the hotel we stayed at, and the museum do NOT recommend either walking to the museum or away from it; staff will call a taxi for you. While Capetown is considerably safer than J'burg, recommend you follow their suggestion."
        }, 
        {
            "index": 137, 
            "rating": "5", 
            "review": "ALWAYS a good option. Seriously, the museum has amazing exhibitions and you can while away hours and hours of your life just absorbing Jewish culture, religion, the holocaust and the history as never before. There's a gift shop, Jacob Gitlan Library for those interested in books who are local and of course this was the original Temple in Cape Town. Loads of history all round. Well worth a visit if you're alone or with a crowd.Have something to eat at the restaurant and just absorb it all. Really wonderful. Oh and be prepared to be patted down and have your handbag searched if need be. Not in an offensive way, just in a safe way for everyone who's there - yourself included."
        }, 
        {
            "index": 138, 
            "rating": "5", 
            "review": "Absolutely wonderful in EVERY way.. The history, displays, graciousness of the docents - it was all incredible. If you are Jewish and visiting Cape Town, you MUST go."
        }, 
        {
            "index": 139, 
            "rating": "5", 
            "review": "You don't have to be Jewish. One of the best Jewish museums we have ever been too. Complex of 3 buildings includes an old Sephardic synagogue, the museum which outlines the history of Jewish Cape Town, and a somber Holocaust museum. This is a must if you are in Cape Town."
        }, 
        {
            "index": 140, 
            "rating": "4", 
            "review": "Awed.. I loved the quiet heart of the architecture of the buildings, the incredible story and the fact that it somehow takes you on a journey that leaves you inspired to become a better person."
        }, 
        {
            "index": 141, 
            "rating": "4", 
            "review": "Little known, absolute jewel of a musuem. This is a highly recommended small museum with a big goal: tolerance among people. It is a well thought out, highly informative history of the Jewish people and their contributions in SA. One of the funniest lessons was about the use of African bird feathers in European and US women's fashion. It turns out that my wife has a distant SA relative who loved these peacock feathers as fashion ornaments. Needless to say, Jewish people have made huge contributions to SA. Madiba, a hero to all, is well represented in this museum as well. It is located right in the heart of the city center so it is easy to get to."
        }, 
        {
            "index": 142, 
            "rating": "5", 
            "review": "A Gem.... For a special flavour of Jewry, with all the paraphernalia, a restaurant, library, talks, the synagogue and museum in one place and a shop to buy gifts and mementos from... this is it.The oldest synagogue in Cape Town and it's a treat. The exhibitions are absorbingly fascinating and I get lost there for hours. I've been about 4 times already :)SHALOMBorchuni la shalom (Bless me for peace)"
        }, 
        {
            "index": 143, 
            "rating": "1", 
            "review": "How paranoid are these people about who visits their museum ?. I am not going to let this spoil our brilliant holiday so far but i still think i want to mention it, today we decided to visit http://www.sajewishmuseum.co.za/ where they were having an exhibition about the Holocaust.just to be stopped at the door by the security man who asked us for photo identification. This is the first Museum anywhere in the World that i have visited that this was asked for and he went on to say that \"with all the crazy people in the world we cant let just anybody visit\", i am in no way racist and am open minded about everybodys views so for him to come out with this statement to me is totally wrong. I since studied the website in detail and not until you check the admission price is photo i d mentioned, if its so important to then they should put it on the front page of the webisite in LARGE LETTERS for all to see."
        }, 
        {
            "index": 144, 
            "rating": "5", 
            "review": "Roots. When my family left the Ukraine half came to the United States of America and half went to the Union of South Africa. They must have gotten the two USA's confused. It was a great experience to see how the Jewish community flourished in South Africa, Really glad we went."
        }, 
        {
            "index": 145, 
            "rating": "5", 
            "review": "What an AWESOME experience !. We visited various attractions walking through cetral Cape Town. I wanted to see the Jewish Museum as I had read it was a very good attraction. The security was very high to enter - but once in we found a beautiful calm courtyard. The Museum entrance is into the sinagogue. The various Holy Days are explained and items are shown relating to these days. You walk through the \"sea\" to get to the next level. Here a fully laid out village from the 1800 is laid out. the history of the Jewish people in SA are also visually depicted. Then you go down into the basement and holocaust section......words can not describe. Go visit this"
        }, 
        {
            "index": 146, 
            "rating": "5", 
            "review": "Mind blowing. Everybody who visits Cape Town has to go to this museum. It is absolutely mind blowing to realise what we human beings can lower ourselves to do to other human beings. This was/is not happening only in South Africa!"
        }, 
        {
            "index": 147, 
            "rating": "4", 
            "review": "Small but interesting. Our driver while in Cape Town was a very well educated Muslim man who had taken us to the vineyards that morning and we had an extra hour before returning to hotel. He suggested we visit the Jewish Museum , having no idea what religion we were. \"Why\" I asked, He said the Jewish Community had done a great deal for SA , and we should visit. It was worth the hour visit. an intimate museum with lots of Cape Town history ,historical photos, and other interesting exhibits. "
        }, 
        {
            "index": 148, 
            "rating": "5", 
            "review": "The History will draw you in.. Extremely interesting history ,whether you be Jewish or not .Excellent library .Excellent place to eat local kosher food .Friendly ,helpful staff always willing to go the extra mile with questions and information."
        }, 
        {
            "index": 149, 
            "rating": "2", 
            "review": "Not worth it. The museum is really small. Many religious objects are displayed with many pictures and a lot of reading. If you go downstairs, you will find an exhibition of three small houses and that's it. You should rather go to the Holocaust center right next to it."
        }, 
        {
            "index": 150, 
            "rating": "5", 
            "review": "This museum offers several experiences with varying degrees of intensity. I loved the cafe here. Excellent food and beverages...comfortable. ..priced for comfort too.I visited on a Sunday afternoon. Children played. Families interacted. The Holocaust exhibit was intense!"
        }, 
        {
            "index": 151, 
            "rating": "4", 
            "review": "Enjoyable visit and not too offputing Holocaust Museum. The entrance security was quite tight, for obvious reasons, but not too intrusive.We were given a tour of the Synagogue and the history of the site. This was both informative and interesting. The Holocaust Centre was host to several groups of school children, and they seemed interested in what it was set up for. The exhibits were not overcrowded and told their story without bombarding the senses but it also did not have a huge emotional inpact, such as the Yad Vashem centre in Jerusalem had.Jewish food is a vibrant reflection of the Diaspora from the falaffel of Morocco to the Knish of Eastern Europe. The restaurant missed a golden opportunity to provide nonJewish visitors with a sample of this diversity. Sandwiches and bags of chips just does not cut it!!"
        }, 
        {
            "index": 152, 
            "rating": "5", 
            "review": "Great Museum. Even though I am not Jewish, I was pleased with this museum for its information and wonderful displays. I have seen other Jewish museums and this certainly rated up with the better ones."
        }, 
        {
            "index": 153, 
            "rating": "4", 
            "review": "New Views. I've always been interested in the history of Judaism and the effects of WWII, and at the museum and Holocaust Centre, I learnt a lot more about the effects of this tragedy on South African members of the Jewish community. A must for the history and cultural buffs."
        }, 
        {
            "index": 154, 
            "rating": "5", 
            "review": "Absolutely wonderful !. I went to the Jewish Museum on a recent Sunday. I was a bit hungry, but didn't see any restaurants in the area. When i approached the complex and saw the word \"cafe\", I thought that that was wonderful.The cafe had indoor seating, but on this beautiful day, sitting outside was really pleasant There were quite a few diners. I had baked potatoes with cottage chese; fantastic.The museum displays were very interesting. I learned that 80% of South African Jews trace their roots to Lituania. Why did my father's mother go to the U.S. ? I'll always wonder, but will never know.All of the people who worked at the museum were really pleasant, especially the woman at the entry desk and the woman in the gift shop.It was so nice to talk with them.I started to talk to a visitor in the gift shop. She spoke very little English. She said that she spoke Spanish. I asked her where she was from - Argentina. Where is Argentina? - Buenos Aires. I live in Buenos Aires; small world. I think that her husband spoke some English; he had wondered off. They weren't Jewish.Fantastic day !! ."
        }, 
        {
            "index": 155, 
            "rating": "5", 
            "review": "Pleasant surprise -- very well done!. I wasn't sure what to expect from the museum and surrounding exhibits, but was pleasantly surprised. A visit to the shul (currently being used) was quite interesting given its design and history, the museum itself was illuminating about the arrival and development of South Africa's Jewish community (including issues around apartheid) and includes an unexpected exhibit of Japanese Netsuke (artistic miniatures), and the holocaust museum was tastefully presented and a nice reminder of the absurdity of those who deny the holocaust occurred. Well worth a couple of hours."
        }, 
        {
            "index": 156, 
            "rating": "5", 
            "review": "Very personalized tour. We liked the individual attention we got as we had a personalized tour of the synagogue before exploring the museum. The size of the museum is small and we liked the spacious layout. The cafeteria at the museum is a good place to have a quick bite to eat with inexpensive meals."
        }, 
        {
            "index": 157, 
            "rating": "5", 
            "review": "Always interesting. Every visit to this fine museum reveals new exhibits of interest. A MUST for visitors to Cape Town who are interested in the origins of the Jewish Community of South Africa, because originally they all arrived via Cape Town."
        }, 
        {
            "index": 158, 
            "rating": "5", 
            "review": "Must see.. A great deal of thought has gone into this compact Jewish museum in the heart of Cape Town adjoining the main synagogue. Find yourself an hour and you will not be disappointed . The museum manages to capture simply the arrival of the Jews to the town and the impact they have had while connecting the visitor to their roots in Eastern Europe. The recreation of the shtels on the lower floor was very well done . Their is a nicely stocked shop and very good cafe as well as a lovely outdoor play area if you are bringing small kids with you."
        }, 
        {
            "index": 159, 
            "rating": "5", 
            "review": "South African Jewish Museum. An excellent museum depicting the holocaust and Jewish people from South Africa and their stories. One will need more that 2 hours to go through this museum. A restaurant is available as well as safe parking and clean ablutions.This museum also gives Jewish visitors to Cape Town to actually meet South African Jews as the restaurant area is like a community visiting place and is a nice experience."
        }, 
        {
            "index": 160, 
            "rating": "2", 
            "review": "We didn't get to go inside because they closed early.. We came to visit the museum with a friend from Cape Town and arrived at 3pm, when they said they closed at 5pm. We checked when we arrived on the property and they confirmed that they would close at 5pm. We decided to eat quickly at the delicious cafe on the property and a little while later the ticket saleswoman walked by us, leaving the property. We asked where she was going and she decided to close for the day, at 4! We were incredibly disappointed as this was our only day in Cape Town to see the museum.We hope in the future this museum adheres to its hours."
        }, 
        {
            "index": 161, 
            "rating": "4", 
            "review": "Perspective on the Jewish Diaspora SA-style. Downstairs exhibit of Ellis Island-like set-up to track family who resided in South Africa, models of SA synagogues and life-size replicas of the shtels from which many SA Lithuanian Jews came. Definitely worth an hour or so."
        }, 
        {
            "index": 162, 
            "rating": "5", 
            "review": "A small but very touching museum.. The synagogue is amazing and our guide Bernie was very nice it was worth seeing how jewish life started in cape town south africa. The walk towards the museum was quite pretty and the museum itself is very well mounted and informative. Take your passport with you if you want to visit they have a tough security control to go in."
        }, 
        {
            "index": 163, 
            "rating": "5", 
            "review": "Nice Museum. Comprehensive, informative museum on the history of Jews in South Africa. South African Jewish history is unique. 90% of the Jews came together from Lithuania, not from many countries like in the USA. Great Museum."
        }, 
        {
            "index": 164, 
            "rating": "5", 
            "review": "Fascinating insights. We enjoyed seeing the history of the Jewish people who have settled in Cape Town and S.A. at large. There are beautiful exhibits demonstrating their entrepreneurial spirit. The Holocaust section is a stark reminder of man's cruelness. It's a spot that everyone should visit and take away some perspective."
        }, 
        {
            "index": 165, 
            "rating": "5", 
            "review": "Netsuke exhibition in the basement. We were advised to go here by friends. It was a very educational visit with regards to the history of Cape town. The exhibition of Japanese. Netsuke carving in the basement of the museum is exquisite."
        }, 
        {
            "index": 166, 
            "rating": "5", 
            "review": "Very Interesting. We had a lovely tour. It is very well done. We also had lunch at the restaurant which was very enjoyable."
        }, 
        {
            "index": 167, 
            "rating": "5", 
            "review": "Learned a lot. Wonderful guide named Roz. We didn't give her much time and she covered everything. The synagogue next door is very nice if it's open the day you are there."
        }, 
        {
            "index": 168, 
            "rating": "4", 
            "review": "Quite impressed for a little musuem. We are unexpectedly impressed by the quality and thoroughness of the Jewish museum and especially the Holocuast center that is modeled after the Vad Yashem memorial in Israel. Definitely worth the time, entre fee was around 4€."
        }, 
        {
            "index": 169, 
            "rating": "5", 
            "review": "Incredible. This place is well worth a visit, but make sure you go to the different areas as it's not clear that there is more than one building! The holocaust museum is very informative and very moving - definitely make time for this"
        }, 
        {
            "index": 170, 
            "rating": "5", 
            "review": "A moving and interesting experience. I visited the museum, as well as the Holocaust Centre, on the 70th anniversary of the liberation of Auschwitz. This probably heightened the emotions I felt during my visit, especially to the Holocaust Centre. As a South African Jew who has recently returned after many years abroad, I found the museum very interesting, reminding me of the part played by Jews in the history of the country, and also in the anti-Apartheid movement. Beautifully designed and full of interest, I'm not sure how involving it would be for non-Jews. The Holocaust Centre should be compulsory for all young South Africans, as I'm sure many are not really aware of the horrors perpetrated by Germany against Europe's Jews."
        }, 
        {
            "index": 171, 
            "rating": "3", 
            "review": "Lots of History. This museum is located inside Cape Town with a parking nearby. It was very intereting to see and understand the history of Jews that emigrated from Europe to South Africa. You can follow their stories starting from scratch to becoming very successful in South Africa.It is emotional and worth seeing."
        }, 
        {
            "index": 172, 
            "rating": "5", 
            "review": "Great overview Of Jewish Life. Gives a comprehensive and well documented overview of Sth African Jewish life, and how it arrived. Plenty to see listen and learn, very accessible in centre of CPT"
        }, 
        {
            "index": 173, 
            "rating": "1", 
            "review": "Waste of time. Nothing much to see there. Entrance is cheap but its a waste of time and boring. Only a bunch of photos and thats it"
        }, 
        {
            "index": 174, 
            "rating": "5", 
            "review": "Engaging and powerful. A well-preserved and rich history of the South African Jewish community, and not just in urban areas but in the outlying communities and districts, too. DO take the schul tour of the Gardens Synagogue on your way to the museum. The stained glass windows depicting the holidays and festivals are beautiful. Would recommend one tour the Holocaust Centre last as this can be an emotional albeit powerful visit.You'll need to present identification to enter, either ID, passport or driver's license. There's nothing unusual about this (in the US entry to certain museums requires ID), given the threat of antisemitic attacks and abuse."
        }, 
        {
            "index": 175, 
            "rating": "4", 
            "review": "Very professionally run. A visit worth the while. Although the size of the Museum is not very big, it illustrates the suffering of the Jewish Community clearly and raises awareness."
        }, 
        {
            "index": 176, 
            "rating": "5", 
            "review": "Holocaust Museum traumatic and informative.. We had an excellent realistically priced lunch. Toured the Jewish museum which has an entry charge. Then we went to see the Holocaust museum, voluntary donation on exit. This was really informative and at the same time upsetting. Two gift shops."
        }, 
        {
            "index": 177, 
            "rating": "1", 
            "review": "We weren't allowed in!. Got a recommendation to attend from the guesthouse we were staying in - and a book recommendation also. We went to the art gallery alongside the Jewish museum first (which I would highly recommend and has an amazing exhibit at the moment). However we weren't allowed into the Jewish museum as we didn't have passport or driving licence as proof of ID! Disappointing and bizarre - we don't normally carry ID when travelling in a group. But perhaps if you are thinking about visiting here bring your passports."
        }, 
        {
            "index": 178, 
            "rating": "4", 
            "review": "Learnt a lot!. Very well presented and provided us with the background to the development of the S. African Community - well worth a visit . . ."
        }, 
        {
            "index": 179, 
            "rating": "5", 
            "review": "Amazing!. Definitely worth it to go see if you are interested in the origin of the Jews in Cape Town and South Africa as a whole. Beautiful synagogue, one of the nicest I have seen. Definitely worth going to!"
        }, 
        {
            "index": 180, 
            "rating": "5", 
            "review": "very educational and interesting. Our visit was cut short because we had left it too late in the afternoon to visit, but even so, we found it a most enlightening and enjoyable museum. You start off in the old synagogue and then move across onto the first floor of the next building for a major exhibition featuring among other things, the migration of Jews to South Africa, and on Jewish contribution to the growth of diamond mining, gold mining and the fight against apartheid. Educational yet still enjoyable. Then downstairs for a feature on the European Jews and, in particular, the exodus from Lithuania. We could have spent a lot longer there."
        }, 
        {
            "index": 181, 
            "rating": "5", 
            "review": "Excellent historical progression showing the huge contribution made by South African Jewry.. Well laid out, and good for all ages. Over the years, within all industries, the Jewish contribution has been positive and huge. We did not realise just how many of the senior supporters and activists of the ANC were Jewish. Go - and enjoy!"
        }, 
        {
            "index": 182, 
            "rating": "5", 
            "review": "Great. Very well presented with helpful and friendly staff. The café was good enough for us to visit 3 times."
        }, 
        {
            "index": 183, 
            "rating": "4", 
            "review": "A necessary reminder.... Not as graphic as some Jewish museums but nonetheless, this place offers the information and 'time' to sit and reflect on the evils of human nature, the hope...and how lucky the vast majority of us are. It is particularly poignant here in SA given the close links of the Jewish community to those in the struggle against the oppressive Apartheid regime..."
        }, 
        {
            "index": 184, 
            "rating": "5", 
            "review": "Fascinating. Easy to find and park near. Many interesting exhibits especially liked the shtetl and to see how the South African community had developed. We had a very good guide who gave interesting insight into the community in both Cape Town and SA"
        }, 
        {
            "index": 185, 
            "rating": "4", 
            "review": "You owe it a visit!. There is a changing exhibition, this time it was ' Menshes' of successful people who have gievn back / developed/ made significant progress for the community at large. Also the permanent exhibition of Prominent Jews through the years and a terrific netsuke display which is mindblowing, the detail is awesome and there is also a shtetl display, very interesting 2 hours soent there and then walk into the Company Gardens for a well deserved drink thereafter, an afternoon well spent, then you can meander down the Avenue to the Slave Museum at the top of adderley street, very informative and well put together, an interesting old building alongside St Georges cathedral, alot of history in a small space as well as the houses of Parliament backing the Avenue!"
        }, 
        {
            "index": 186, 
            "rating": "5", 
            "review": "Remberance. I found the place very well done, gave the knowledge in a very easy way to understand and was very well put together in a historical way everyone can see the life as it was at that time"
        }, 
        {
            "index": 187, 
            "rating": "2", 
            "review": "Couldn't get in. I was very disappointed not to be able to visit here on the last day of my holiday as I had left my passport in the safe at my hotel and I wasn't allowed in to the museum unless I showed it. I can understand the need for security nowadays but I had proof of who I was in the form of credit cards and a bus pass with my name and picture on but a passport was the only proof of identity acceptable. It was a great shame as I was really looking forward to my visit and it had been a long walk to get to it from my hotel."
        }, 
        {
            "index": 188, 
            "rating": "5", 
            "review": "Very interesting. We thought the synagogue was lovely and the museum very interesting, particularly the details of immigration into South Africa, not only by the Jews but going much further back.A charming lady showed us around and answered all our questions as well as recommending lots of other things to do while we were in Cape Town"
        }, 
        {
            "index": 189, 
            "rating": "5", 
            "review": "Very interesting!. I'm not one who loves museums, but I must say this was interesting! Besides for the basics of Jewish items and holidays, there is a nice amount of information on the immigration of Jews to South Africa. I especially enjoyed the Lithuanian exhibit, which portrayed what it was like to live in the small villages in Lithuania, where the Jews had immigrated from. They also had the incredible Ruth Weiss exhibit, My very first questiond to you, which was extended due to popular demand. Definitely recommend visiting this great site!"
        }, 
        {
            "index": 190, 
            "rating": "4", 
            "review": "history as it is. In our diverse country, we do not know all about the different cultures. I was prompted to visit after reading the book 'The Jews in South Africa'"
        }, 
        {
            "index": 191, 
            "rating": "5", 
            "review": "good visit. The museum is well presented and very informative. The food at the onsite restaurant was very good, but I dont have words to describe the Holocaust Museum. It should be law that everybody visits it."
        }, 
        {
            "index": 192, 
            "rating": "5", 
            "review": "Explore the South African Jewish History. Quite an experience even without a guide. We had to go on a Friday morning when there were no tours. Did not matter with all the info and tapes given by the exhibits. First we entered the Great Synagogue and then went to the museum that explored the history when the Jewish settlers first arrived in the Cape in 1806. We saw all the synagogue founding dates and learned how the Jews migrated north in 1860 with the discovery of diamonds. We also learned how the Jews had to fight immigration restrictions in the early 1900s and then the anti-Semitism in the 30s.It was interesting to learn of how Mandela identified with the Jewish people as a fellow victimLots to learn. Be sure to bring your passport when you go"
        }, 
        {
            "index": 193, 
            "rating": "5", 
            "review": "Also known as the Holocaust Museum. A totally comprehensive account of what the Jews suffered during the Second World War under the Nazis.Harrowing pictures, but well worth the visit."
        }, 
        {
            "index": 194, 
            "rating": "5", 
            "review": "Well worth the time if you are interested in Jewish history in South Africa. You must have your passport with you in order to get in the gate. The fee is nominal and security is tight. The synagogue is magnificent and the original is now the museum. Very quiet. The guides are extremely helpful and knowledgable. Wish we had more time to see the film. Interesting to find out about the support against apartheid by the jews in Cape-town and all over s Africa."
        }, 
        {
            "index": 195, 
            "rating": "5", 
            "review": "Excellent History Lesson. The South African Jewish Museum is well thought out in its organization and presentation. You'll learn here not only the history of SA's Jewish population, but also the Jewish response to SA's apartheid era. Interesting and educational, indeed, even for non-Jews like myself. This visit exceeded my expectations."
        }, 
        {
            "index": 196, 
            "rating": "5", 
            "review": "short but pleasant and interesting. I got there just before closing and still enjoyed the visit, informative and intersting, well done and both meaningful and tasteful. I would recommend to others."
        }, 
        {
            "index": 197, 
            "rating": "5", 
            "review": "Great tour, good information and helpful staff. the visit to the museum is very nice, the staff were very helpful, nice and patient. the information presented is very informative and thought provoking, Will recommend."
        }, 
        {
            "index": 198, 
            "rating": "5", 
            "review": "Very interesting learning experience. We had a wonderful docent and I came away knowing a great deal about the Jewish settlers in South Africa. I had no idea that the boas and wonderful ostrich feathered hats I had seen in the movies were most likely made in South Africa from ostrich feathers gathered on a farm owned by a Jewish family."
        }, 
        {
            "index": 199, 
            "rating": "4", 
            "review": "Holocaust museum is brilliant, the main museum average. Loved the holocaust museum, informative, moving and exceptionally well laid out. Delightful lady welcomed us and the cafe staff were very good...try the fruit shake. The main museum was a disappointment. Grumpy staff and lots of information overwhelmed by constant music and voice over.If you are visiting take your passport details, you'll need these to get in the main security gate."
        }, 
        {
            "index": 200, 
            "rating": "5", 
            "review": "Put this on your list. An excellent museum about the Jews of South Africa. Well documented with good guides, if you need one."
        }, 
        {
            "index": 201, 
            "rating": "5", 
            "review": "Informative and interesting. A well curated and interesting museum, in a complex together with the Holocaust Centre and Gardens Synagogue. All three well worth a visit."
        }, 
        {
            "index": 202, 
            "rating": "4", 
            "review": "Good review of local Jewish History. We had no idea this was available. Went in to see what was there and found a large collection of historical artifacts, videos, and audio recordings that really allowed one to get a feel for what it was like for the immigrant Jews of Cape Town and South Africa. A big surprise was the number who came from other countries is Southern and Central Africa. These folks had to emigrate twice, once from Eastern Europe, and once from the first country they had gone to."
        }, 
        {
            "index": 203, 
            "rating": "5", 
            "review": "A must See. A very professional depiction of the atrocities the Jewish people experienced during world war 2. I have also visited the genocide museum in Kigali and can definitely say that the Jewish museum is en par with the depiction of a very savage period in our history. We must never forget our history and a visit to such a museum is a necessary reminder. Very professionally run. Keep up the excellent work."
        }, 
        {
            "index": 204, 
            "rating": "4", 
            "review": "interesting and well presented. very well presented holocaust museum....interactive videos etc. Jewish museum interesting for those who don't know about Judaism. Kosher dairy cafe on premises!"
        }, 
        {
            "index": 205, 
            "rating": "5", 
            "review": "First Rate--and Don't Miss the Holocaust Museum. Telling a fascinating story of Jews from Lithuania who came to South Africa, this modern museum is both educational and inspiring. Did you know that ostriches play a pivotal role in the settlement of Jews in South Africa? Definitely worth the trip.Adjacent is the Holocaust Museum which presents the Shoah in a vivid, focused and emotional presentation (far better than many other such places). You will be moved by the experience!"
        }, 
        {
            "index": 206, 
            "rating": "5", 
            "review": "Excellent insight into history. This is a really interesting museum, and we don't normally do museums. It gives a real insight into why South Africa has such a large Jewish population, and how many of the jews grew from being farmers and pedlars into successful businessmen. It also gives a perspective on why so many of the jews in South Africa campaigned against apartheid. Well worth a visit, but make sure to take your passport to gain entry!"
        }, 
        {
            "index": 207, 
            "rating": "5", 
            "review": "Gave a great overview of South African Jewry. I loved the full size model of a European village from which most of the jews from south africa came from and how the Museum shows their relationship with Nelson Mandela"
        }, 
        {
            "index": 208, 
            "rating": "5", 
            "review": "Review. Excellent information well done and timely .One of the best Holocaust narratives and presentation in the Western World."
        }, 
        {
            "index": 209, 
            "rating": "4", 
            "review": "Historical Perspective. This museum was historical and interesting. The tone was not overpowering. The movie at the end was especially interesting, as it was based on interviews of South African Jews who survived to tell their personal stories."
        }, 
        {
            "index": 210, 
            "rating": "5", 
            "review": "a tribute to Cape Town's jewish heritage. set in the Jewish campus near the great Synagogue alongside one of the best holocaust museums I've visited. A recreated Lithuanian village as most of the Jewish immigrants hailed from that country."
        }, 
        {
            "index": 211, 
            "rating": "4", 
            "review": "Informative but..... Quite a lot of static information and a few films. However nothing really about the community today, why so many have left etc. Well presented though. Needs 30-60 minutes to view. Kosher cafe was very good."
        }, 
        {
            "index": 212, 
            "rating": "4", 
            "review": "Worth seeing. This is museum gives information about the history of the local Jewish community and includes a mock Lithuanian shtetl, representing where most South African Jews came from. The museum is small, but worth seeing. BTW, remember to bring ID to get in."
        }, 
        {
            "index": 213, 
            "rating": "5", 
            "review": "Interesting and well designed museum. The museum adjoins the large old synagogue called the Gardens Shul. There is an opportunity to visit the synagogue, and the first few exhibits are the standard 'This is Judaism' sort of thing, but after that there are some intriguing exhibits. I particularly enjoyed the history of South Africa's Jews, and how and why they moved there from Eastern Europe. There is a replica Lithuanian shtetl which was amazing to see. We also enjoyed the exhibit opened by Nelson Mandela featuring artwork about his connection to the community."
        }, 
        {
            "index": 214, 
            "rating": "3", 
            "review": "Not that interesting. Based on the reviews I expected a large section on the part that the Jewish Capetonians played in the rise against the Apartheids regime. Unfortunately, this is only a minor part of the museum. For those specifically interested in the history of Lithuanian Jews that immigrated to South Africa it might be well worth while."
        }, 
        {
            "index": 215, 
            "rating": "4", 
            "review": "Interesting wee spot. Nice to get some history of this area of Cape Town. Very friendly staff and interesting exhibits in this small museum."
        }, 
        {
            "index": 216, 
            "rating": "4", 
            "review": "Well worth a visit from the Red Bus Tour. Very well set out and tells the history of Jews arriving in SA ...Only R20 with the discount from the tour ticket....free entry to the Holocast museum next door...."
        }, 
        {
            "index": 217, 
            "rating": "5", 
            "review": "Great museum and wonderful gift shop!. We visited this small museum from the Hop on Hop Off bus. It presents a fascinating story about the history of Jews in South Africa, including the relationship of the Jewish people to Mandela, which I found very interesting. The gift shop is really outstanding and we found beautiful craft and art items that we didn't see anywhere else in Cape Town at reasonable prices. Well worth a visit!"
        }, 
        {
            "index": 218, 
            "rating": "5", 
            "review": "Well worth a visit. My wife and I were scheduled to visit Robben Island, but our morning trip was canceled due to weather. As an alternative, we wandered around Company Garden in the center of town, where we came across the Jewish Museum. What a lucky find! It's a superb, modern museum -- interesting, informative and inspiring, even if you're not Jewish. We learned a lot, not only about the local Jewish community but about Cape Town and South Africa more generally."
        }, 
        {
            "index": 219, 
            "rating": "5", 
            "review": "Interesting. Good activity when the weather is bad. Interesting art and good stories. In the basement a original village of a old European jewish village. Also Mandela art."
        }, 
        {
            "index": 220, 
            "rating": "5", 
            "review": "Very interesting. Well worth the visit..even if you just have time to see the film about Mandela. But the synagogue and museum have such fascinating history of how the Jews came to South Africa. And the gift shop and cafe are very good as well"
        }, 
        {
            "index": 221, 
            "rating": "5", 
            "review": "A must visit.. 'Those who do not remember history are condemned to repeat it'\nA tribute to those 20 000 000 Jews, Christians, Russians etc killed during the Second World War by those lunitics Hitler/ Stalin and others."
        }, 
        {
            "index": 222, 
            "rating": "4", 
            "review": "Wonderful Jewish Museum - Heart of City. Visited the South African Jewish Museum and Holocaust display and were delighted to find a wonderful exhibition of the history of Jews in South Africa. Remember to bring with you a photo ID as they will not let you in without it. As a docent myself, the museum is well laid out and easy to read and follow all the displays. There is an elevator to move from floor to floor. Had a light lunch in the cafeteria and it was delicious. Take a couple of hours to visit this museum."
        }, 
        {
            "index": 223, 
            "rating": "5", 
            "review": "A peaceful place in a busy city. I've been here a few times - the first time to entertain family who appreciate the Jewish cuisine - we loved it!I've been back a few times to just enjoy the food, the peaceful atmosphere and the feeling of not being hurried. There is a good selection of dishes and snacks that are good value for money."
        }, 
        {
            "index": 224, 
            "rating": "4", 
            "review": "well worth a visit. The security man sked if I had any thing sharp I said 'only my wits' and he told me he had heard the reply about a million times so disproving my assertion, just a heads up if you are feeling clever. The museum is in three parts the first is General Jewish religious memorabilia and is mildly interesting. The Second is the history of the Jewish community in South Africa and is fascinating and on the whole very well put together so that some like me who knew little of the subject could learn stuff and I imagine even people steeped in the subject would still find the visit worth while I did feel that a very subtle attempt was made to distance the Jewish community from any possible Apartheid type sins the list of prominent Jewish politicians were all Anti-Apartheid the quote from Mandala about his work for a Jewish law firm highlighted his positive remarks and somewhat skipped over his previous not so praising earlier remark in the same book.  The Third part is a Holocaust display which naturally is only very indirectly concerned with South Africa but although it is a well know story it is told in in very dispassionate manner that even explains the circumstances and motivations for what happened this tone I found a very effecting and maybe for the First time bought the view that is often put that this event could quiet easily happen again in a modern industrialised country if people aren't vigilant ."
        }, 
        {
            "index": 225, 
            "rating": "5", 
            "review": "One of Cape Town's best museums. The story of the Jews in South Africa is brilliantly portrayed in this elegant museum in the heart of the city. The quality of the exhibits and the multi-media presentations put this right up there as a tribute to a vital segment of South African history. Parking in the street nearby."
        }, 
        {
            "index": 226, 
            "rating": "4", 
            "review": "Wish we had more time. So handy for the Hop-On Hop-Off bus. Glad we brought some proper ID for security entry to site.The staff were friendly and helpful. Had no idea there was such a connection with Mandela. The Holocaust display was deeply moving.There is a small cafe restaurant onsite."
        }, 
        {
            "index": 227, 
            "rating": "4", 
            "review": "Interesting.. The museum is located in a beautiful, quiet neighborhood. We enjoyed our personal tour from the woman at the welcome desk. She was very patient and talked about the temple and allowed photos to be taken. Very informal but informative. Across the walkway was an additional museum that was self guided and interesting."
        }, 
        {
            "index": 228, 
            "rating": "5", 
            "review": "Jewish Museum worth a visit. Interesting and informative and not only about the Jewish community. Gives history of South Africa in general and through the eyes of the immigrant Jewish population."
        }, 
        {
            "index": 229, 
            "rating": "5", 
            "review": "Very moving and great contribution of great community.. What an amazing community the two parts show the great contribution of this wonderful community.The Holocaust part is very moving and a must see by all people."
        }, 
        {
            "index": 230, 
            "rating": "5", 
            "review": "Holacaust museum. Visited both Jewish and holacaust museum. The holacasut museum was very moving and informative. It is hard to believe that mankind could treat another human being in such an appalling way. The cafe was a lovely place to visit"
        }, 
        {
            "index": 231, 
            "rating": "5", 
            "review": "A worthwhile visit. The Jewish Museum is part of a complex which includes the hold and new synagogues as well as the Holocaust Museum. All are worth seeing. The history of the Jewish community in Cape Town is quite interesting, and the synagogue is lovely. The Holocaust Museum was the most engaging. There are models of a shtetl in Lithuania (from whence a large part of the SA Jewish community emigrated) which tugged at our heartstrings. At the end of the visit the videos of Holocaust survivors who ended up in South Africa was highly emotional and heartwarming."
        }, 
        {
            "index": 232, 
            "rating": "4", 
            "review": "A slice of South African history. This was a repeat visit after an absence of several years, so the changes were interesting. The building has been modernised and the exhibitions are more high-tech. Except the little Lithuanian model village, which still creates the same impression of being the abode of a poor but proud people.And clean and neat! There is not a scroll out of place and the examples on exhibit were (for non-Jews) very good examples of what sustained the Jews throughout the Diaspora. And the nice link with the Jewish settlers in South Africa is still there from Cape Town to the Gold Fields.The old 'smouskar' of bygone years is still on view, but unfortunately now it is roped off and one can but gaze at it from behind a barrier instead of inspecting it and the goods that were carried in it close-up.Even the coffee shop outside is a nice touch. Clean and neat, it gives an opportunity to reflect in quiet contemplation. And the guard at the gate (sadly, a modern-day necessity) was friendly yet firm in carrying out his duties. There is still construction work going on and one can but hope that space will be made to exhibit Jewish life in SA in more modern times, not so much in political terms as in the contributions that ordinary people continue to make to add to their forebears' contributions to building a prosperous South Africa.Well worth a visit even if you're not Jewish."
        }, 
        {
            "index": 233, 
            "rating": "5", 
            "review": "One of the best and most interesting in the world. We have been to a fair share of Jewish museums around the world and this one really sticks out. It was openend by Nelson Mandela. It starts in the first synagogue in South-Africa with the history of the Jewish Community in Cape Town and South-Africa and even has some models of synagogues around South-Africa. Then it moves on to describe the contribution the Jewish people played during the days of Apartheid. Finishing off with famous Jews.Next door is the current synagogue which holds about 1400 people and is really worth the visit. Not just beautiful from the outside, but also stunning from the inside. It reminds me of the portugese synagogue in Amsterdam in some aspects.In the final building there is a coffee shop and a little gift shop, but there is also a holocaust exhibition and a documentary about Nelson Mandela. You can truly spend hours here and the way everything is displayed and made interactive should be an example to other similar museums around the world."
        }, 
        {
            "index": 234, 
            "rating": "5", 
            "review": "very interesting. we found it very interesting to learn about the Jewish community in Cape Town and South Africa , how they came to be and when . Part of the Museum is about the Apartheid and how the Jewish community reacted to it as well as about the Holocaust. Very very interesting."
        }, 
        {
            "index": 235, 
            "rating": "5", 
            "review": "A well thought out museum. Informative and extremely well prepared layout which all visitors should plan on their itinerary of Cape Town"
        }, 
        {
            "index": 236, 
            "rating": "5", 
            "review": "Jewish Museum. We enjoyed talking to the guide and sharing stories about holiday celebrations in the US. We also were touched by the Holocaust Museum."
        }, 
        {
            "index": 237, 
            "rating": "4", 
            "review": "history. this museum gives a strong sense of history unknown to a lot of people and is a visit to understand the great sense of what a nation feels"
        }, 
        {
            "index": 238, 
            "rating": "4", 
            "review": "Beautiful museum and grounds. Centrally located museum about the Jewish community in South Africa, in addition to a Holocaust Museum. Needless to say, the Holocaust Museum is a moving one that reminds us of the tragedy that unfolded not too many years ago. It is a smaller one than the Washington's Holocaust museum, but certainly brings home the message equally as well. The grounds are a pleasure to spend time in, along with a small cafe for lunch. Staff very helpful and welcoming."
        }, 
        {
            "index": 239, 
            "rating": "5", 
            "review": "fascinating , must-see in combination with the holocaust museum. A definite must-see! The Jewish Museum is gorgeous and the holocaust adjacent to it is a compilation of stark photographs that should be seen and considered."
        }, 
        {
            "index": 240, 
            "rating": "4", 
            "review": "How Jewish people and their faith influenced South African history. We visited for the second time. As a Christian, the Jewish heritage interests me greatly as it is where my faith originated. I love how the first synagogue in South Africa has been kept intact and each symbol of the faith has been restored and explained. The \"boat\" showing the immigrants into Cape Town is well done as are the shtetls, which my children enjoyed. The extra touches of traditional music in each display is lovely. I disagree with the above review as I found that Jewish rituals and practices are shown well as are the Jewish influences into South Africa's history, especially during the awful time of apartheid. (A tolerant nation that seems to get very little tolerance in return.)"
        }, 
        {
            "index": 241, 
            "rating": "5", 
            "review": "An interesting museum. I liked the South African Jewish Museum. They explained the reason, why the Baltic Jews came to South Africa. The exhibition downstairs about the Baltic shtetls was nicely displayed."
        }, 
        {
            "index": 242, 
            "rating": "5", 
            "review": "A must, also Holocaust Museum. Beautifully set out and details the history of the Jews in the Cape. My regret was that there was not more on the rest of the area."
        }, 
        {
            "index": 243, 
            "rating": "5", 
            "review": "A must to see. So well set out and a Guide answered all the questions we asked about Jewish customs.\nA lovely experience."
        }, 
        {
            "index": 244, 
            "rating": "5", 
            "review": "Moving and interesting. Don't miss this museum which tells the history of Jewish settlement and influence in South Africa and also much about the holocaust. There is also a chance to see the inside of a synagogue, if services are not being held there. Some wonderful works of art on display when we were there."
        }, 
        {
            "index": 245, 
            "rating": "4", 
            "review": "Interesting, educational, moving. Definitely worth a visit, long or short, and easily done via hop-on hop-off bus or if in the viscinity."
        }, 
        {
            "index": 246, 
            "rating": "5", 
            "review": "Fascinating. A very modern and beautifully designed museum. A fascinating insight into the contribution of the Jewish people to the development of South Africa and resistance to apartheid. There is also a harrowing section on the holocaust."
        }, 
        {
            "index": 247, 
            "rating": "5", 
            "review": "Africa's Jewish History. Opened by Nelson Mandela himself, the S.A. Jewish Museum chronicles the country's long and storied Jewish history. From the early mercantile pioneers to the refugees from the pogroms of Eastern Europe to those who locked arms with Mandela to oppose apartheid, the museum takes a rich and detailed look at those Jews who are an integral part of the country. During our visit, a group of students from a Muslim school were listening raptly to a docent lecture about anti-Semitism. Both inspiring and humbling, a rewarding experience for travelers of any (or no) religion."
        }, 
        {
            "index": 248, 
            "rating": "4", 
            "review": "Fascinating glimpse at Jewry in SA. If you are interested in history and have an afternoon in Cape Town then this is a fantastic museum to visit. They often have special exhibitions and the Holocaust Centre is a critical education resource in the Western Cape. If you are visiting Cape Town during the rainy winter months and need an attraction out of the weather with good coffee this makes a great addition to any itinerary."
        }, 
        {
            "index": 249, 
            "rating": "5", 
            "review": "Very impressive museum. Heart wrenching. Extremely well done and large collection of Holocaust memorabilia with pictures and stories that are all heart wrenching. The horrors and the stories of such strength. Well worth seeing and experiencing. Beautiful location in a former synagogue."
        }, 
        {
            "index": 250, 
            "rating": "5", 
            "review": "Unexpected surprise. Usually a museum devoted to one corner of society would be for me a turn off.But this excellent museum with its insights into the Jewish South African population is a must.A tiny Synagogue sits in the heart of the exhibition as well as a reproduction of an of an ol Jewish village.There is also a collection of Japanese Netsuke."
        }, 
        {
            "index": 251, 
            "rating": "5", 
            "review": "Small, beautiful and touching. Compact setting in old synagogue with modern extension. Varied exhibits, well laid out, nice mix of original artefacts and records with modern audiovisuals a recreated shetl. Should be of interest to all with an interest in history and culture. Own secure parking. Cafe on location, and easy access to other museums, company gardens, etc."
        }, 
        {
            "index": 252, 
            "rating": "4", 
            "review": "Unique. This is a very good overview of the Jewish experience in South Africa, and well worth visiting. The displays are clearly laid out, and chronologically make sense. There was a special art display when I was there that was excellent."
        }, 
        {
            "index": 253, 
            "rating": "5", 
            "review": "Wonderful experience. Having experienced your Friday evening service, which was spectacular with the visiting choir from Linksfield (J'Burg), we visited the S.A. Jewish Museum and had a professional and excellent guide, Brian K. The information and empathy was outstanding, Brian gave a lot of information without overdoing it as everyone in the group had a good background to Judaism and some advance info from our tour in Johannesburg. Keep up your excellent PR, thanks for a memorable visit.Evelyn Plotke and the La Bimba Group, Switzerland"
        }, 
        {
            "index": 254, 
            "rating": "5", 
            "review": "Well laid out. One of the best Jewish museums that we've been to, detailing the history of the Jewish settlers mainly from Lithuania. There is a kosher coffee shop and bookshop, that had some nice things that weren't over expensive."
        }, 
        {
            "index": 255, 
            "rating": "5", 
            "review": "worth the detour. great guide who explained the history of the Jews in CT. The synagogue is beautiful, good museum shop."
        }, 
        {
            "index": 256, 
            "rating": "5", 
            "review": "An emotional tour de force. We were using the hop on off bus tour and this was one of the stops.We were a wee bit surprised to find we needed to show passports or photo id to enter but the security guys were very polite and we guess in this day and age they have to be careful as we were generally in our travels in South Africa.It was very interesting to find that school 6th forms have the Holocaust on their curriculum and we met one of the school groups en tour.We took advantage of having a guide take us round and explain everything.This was a very moving and an eye opener for seeing just what horrors had transpired.After spending time on the tour and then visiting the museum we stopped for a bite in the on site restaurant. The food was great and everybody we met was so friendly.We are really glad we made time for this visit."
        }, 
        {
            "index": 257, 
            "rating": "4", 
            "review": "Good overview of Jewish migration from Europe. Apart from the obligatory ephemera of Jewish life and worship, this museum has constructed a replica of an Eastern European village (reminiscent of Fiddler on the Roof). It's quite well done, and the exhibits and notice boards put the story into context. The Synagogue is attractive and is also worth a visit."
        }, 
        {
            "index": 258, 
            "rating": "4", 
            "review": "Be sure to have photo ID with you - or you wont get in. If you have time, have the guide take you around. We didn't and found ourselves skimming around the museum not really taking much in. The art gallery was good and the Japanese collection was lovely. The Holocaust displays were as moving as you would expect and we came away with a very good impression of the whole experience."
        }, 
        {
            "index": 259, 
            "rating": "5", 
            "review": "A must for visitors to Cape Town interested in its history. We visited the museum because we are Jewish but feel that this would be interesting for none Jews as their is a link to Apartheid and the Holocaust. It's also interesting to see how much of the development of South Africa was influenced by the Jewish settlers. For anyone that has read The Hare with Amber Eyes and is interested in Japanese Netsuke carvings there is a most wonderful display that has it's own section of the museum. Adjacent to the museum is the oldest synagogue in South Africa."
        }, 
        {
            "index": 260, 
            "rating": "5", 
            "review": "SA Jewish Museum. I was pleasantly surprised by this museum. The building itself was very modern with clean lines. The museum staff was friendly and very helpful. The exhibits were well done, provided information in an easy to read format and very informative. I would recommend taking the time to go to this museum and visit all 3 floors."
        }, 
        {
            "index": 261, 
            "rating": "5", 
            "review": "Very Moving. Visited on Wednesday 15/01/2014.This is one of the best museums in Cape Town and the Holacost exhibition so moving all should make it compulsory as part of any trip to Cape Town.\nThe tribute to the Jewish community by Nelson Mandela in his fight for freedom is superb.\nI strongly recommend this two you all"
        }, 
        {
            "index": 262, 
            "rating": "5", 
            "review": "Honouring incredible contributions to South Africa.... The visit to the SA Jewish Museum proved to be insightful and thought provoking. Informative, knowledge sharing displays, including a number of high-tech interactive exhibits. All highlight the history, contributions and suffering of the Jewish in South Africa and across the world. The special Holocaust exhibition was thought-provoking, solemn and spiritual. It certainly reminded me of the atrocities performed against humanity and reinforced the message that it must never happen again!In addition to the actual museum, staff and volunteers at the Centre were most welcoming. All in all, a highly recommended attraction."
        }, 
        {
            "index": 263, 
            "rating": "4", 
            "review": "So interesting!. The first thing you meet when you enter this museum is the loveliest receptionist who was so welcoming and informative! After that you enter a world of facts, details of peoples lives and information so interesting that you need to walk round slowly to digest it all! It is beautifully laid out and with fascinating artifacts and video clips and interviews. Thoroughly worth a visit. We ate lunch in the cafe which was very nice and had a browse round the shop, which had some lovely African/Jewish pieces."
        }, 
        {
            "index": 264, 
            "rating": "4", 
            "review": "Maybe we can learn from the museum. A very sad period reflecting the cruelty humans can inflict on each other for misguided philosophies. We, a group from 88 to 16 found something in this well documented history and enjoyed the story as given by those few that relayed it on their journeys to South Africa. Well Done!!By the way admission is free and a visit should be included in your visit to Cape Town"
        }, 
        {
            "index": 265, 
            "rating": "3", 
            "review": "difficult to hear and don't go to the cafe. Located close to the Mount Nelson hotel, this is not just a museum but a community resource.There was a lot of variety in the exhibits - starting from a synagogue and going on to a museum of Jewish settlement in South Africa and life in Cape Town. There is even a mocked up East European stetl, or hamlet.But the insulation of sounds from one exhibit to another wasn't great - so one of the most interesting elements (the role of the Jewish community in the ANC/political struggles and the Rivonia trial) was impossible to hear.Service in the cafe is slow, and the description of food on the menu misleading (for salad read pickled veg) although it may be more meaningful to an Israeli clientele."
        }, 
        {
            "index": 266, 
            "rating": "5", 
            "review": "Interesting museum. This is a really good stop for anyone interested in the Jewish community in Cape Town. We started with a look at the Shul where we got an idea of the history of the Jews in Cape Town and the building of the Shul. It was a shame we were leaving before Friday night when there was an event on in what seems like a really vibrant community.The museum was interesting and well planned out, including a reconstruction of some buildings in an Eastern European shtetl. The staff were lovely and took time to chat to us. The Holocaust museum was comprehensive and moving. We do always try to get a feel for Jewish communities wherever we are and a museum like this never fails to shock, however many times we learn the history. We were there long after closing time, having been assured by the staff that we could take our time, which showed how sensitive they were to the content and not simply rushing us through. We couldn't fail to notice the frightening similarities between apartheid and the Holocaust, which became a common theme through our trip."
        }, 
        {
            "index": 267, 
            "rating": "5", 
            "review": "Relaxed and informative. Not necessarily at the top of your initial list when thinking about places to visit in Cape Town, but worth the visit. From an interesting looking a Jewish immigration, a good art gallery, and well put together look at Mandela and his relationship with the Jewish community"
        }, 
        {
            "index": 268, 
            "rating": "5", 
            "review": "A Museum for Everyone. The Museum was built about 3 years ago and is in a complex with a small dairy restaurant that had excellent food, very reasonable prices, there is a place to buy African items, the Holocaust Museum is there, which is visited by the children of Cape Town because there is a direct correlation between the Apartheid era and the Holocaust. Mandela helped raise money for the Jewish Museum because he felt the Jewish community had been instrumental in helping eliminate Apartheid. The Museum itself is beautiful and holds the history of the Jewish people and their contribution to Cape Town. There is a replica of a small village in Eastern Europe which was very interesting to see and an exhibit by a famous artist with the last name of Bak, there as well. Next to the South African Museum is the synagogue that dates back to 1904. It is very beautiful and can hold over 1000 people at one time. The stained glass windows are of the 12 tribes of Israel. If you go to Cape Town, it is a must see. Ricki Bergman, Travel Consultant & World Traveler"
        }, 
        {
            "index": 269, 
            "rating": "5", 
            "review": "Terrific museum and shul next to it. We had a personal tour of the Shul itself which is beautiful with great architecture and recent stain glass windows on the lower portions. we got to meet the Dr. who designed all these recent stain glass windows. Neat. The museum has a lot to show of the Jewish history in Cape Town. The show photos of the dozen or so Shuls which had been in Cape Town over the years. There was an art exhibit by an artist who now lives in the Boston area an dis represented by a Newbury St art Galley. Small world."
        }, 
        {
            "index": 270, 
            "rating": "5", 
            "review": "Absolutely beautiful museum and well organised set up. This museum is so well thought out, it's modern and entertaining with some ornaments that go way back in history. The fact that you can enter the synagogue next door is wonderful since its 1 of the most beautiful in the world"
        }, 
        {
            "index": 271, 
            "rating": "4", 
            "review": "a new life for europeans. It is an excellent presentation of how Jewish life began in South Africa as Lithuanian Jews followed the Dutch and the Huegenots in search of living space and business opportunities. Unfortunately, there's little to no acknowledgement of how this process of European colonization and immigration displaced the Africans who already lived there."
        }, 
        {
            "index": 272, 
            "rating": "5", 
            "review": "A Must for ALL to see.... The History of South Africa's Jewish community comes to life, at this museum.I especially enjoyed the multimedia displays,it shares newsreel footage,documentary films & a reconstruction of a 19th century Lithuanian village,quite interesting.The beautiful highlights of this place was its teak pulpit,domed ceiling & stain-glassed windows."
        }, 
        {
            "index": 273, 
            "rating": "5", 
            "review": "Wow. What an amazing, sensitive and informative place. It is very imformative historically and the model 'Shtetl' very authentic and realistic. One can imagine the type of people and wonderful family life that existed in those times. Conbined with a visit to the adjoining Holocaust Museum it is a must for your Cape Town visit. Sombre, emotional and very informative visiting this place just around the corner from the Mount Nelson Hotel is not a fun experience but it shouldn't be missed.You'll have a better knowledge but a heightened lack of understanding once you've been here."
        }, 
        {
            "index": 274, 
            "rating": "5", 
            "review": "Moving but beautiful. Beautiful buildings for such a tragic and moving museum. Well worth a visit and a few hours to explore the Jewish story in South Africa. You'll need a couple of hours of you go to both the museum and holocaust memorial .. plus take a break over a coffee. The holocaust museum brought us both to tears ... and we have seen others and not experienced this level of emotion. "
        }, 
        {
            "index": 275, 
            "rating": "5", 
            "review": "Jews of South Africa. This excellent small museum presents the history of The Jewish Community in South Africa. A film on the support the Jewish Community (or at least some in the Jewish Community) gave Nelson Mandela (and his support as president for diversity in SA) plays continuously in a small theatre. Exhibits are informative and give a really intimate sense of this side street of Jewish history. Located on the same \"campus\" as Africa's only Holocaust Center and the oldest (orthodox ) synagogue in SA as well as a Jewish library with a sales cart for discards, this site is definitely worth a couple of hours in Central Cape Town."
        }, 
        {
            "index": 276, 
            "rating": "5", 
            "review": "Excellent museum. This is something not to be missed, the museum is very well laid out with a history of the Jewish community in Cape Town, also there is a collection of Japanese carving and Samurai sword components that belonged to one of the founders. There is also a second building housing the Holocuast exhibits. Fascism even reached Cape Town in the 1930's, I don't know why I was surprised but there you are. "
        }, 
        {
            "index": 277, 
            "rating": "5", 
            "review": "Excellent museum, learnt a lot!!. This is a small museum, very well laid out and informative. We had a lovely guide - Joy - who was most knowledgeable & happy to answer our questions, it was a real pleasure to listen to her & hear about the Jewish roots in SA and found it most interesting."
        }, 
        {
            "index": 278, 
            "rating": "5", 
            "review": "Appealing And Increasing My Knowledge Towards The History. I found the information about this museum when my brother told me about it. He originally got the information from TripAdvisor. We went there together. A little additional information, this building is located near to the Holocaust Museum, and there was also this Jewish / Judaism Shop and the small Cafe near to the museum itself. First we purchased the ticket to the lady at the reception, and then we were told some of the procedures, and also we were told not to take photograph inside. Then we went to the museum. I can see many extraordinary legacy there. First we saw the building with many chairs in the middle (which I guess for praying / gathering), and there were those Jewish / Judaism equipment located around the area. They were really sacred. The museum itself has each of the objects explained really well. It was great to know the history of the Jewish Community from the old times, where they show it on the video display there on the screen and we got to know how the Jewish Community came to South Africa. We then went inside to the inner area, we saw other great things about the Jewish Community, including the other objects inside the museum, and also other great videos that shown us about how The Jewish Wedding were held, how the old leaders had the meeting together, and also other impressive things such as the old buildings and equipment. Finally we went to the upstairs area where we saw all the old photographs and the old texts / letters, and we then went to the restaurant outside the museum while we all had the great knowledge about the History of Jewish Community and also for the old times and what had happened in the past."
        }, 
        {
            "index": 279, 
            "rating": "4", 
            "review": "Very Good Small Jewish Museum. The Jewish Museum is located in the Garden District next to rhe Great Shul.It is a lovely setting with views of Table Mountain. It contains a small gift shop and cafeteria.The museum deals with the history of Jews in South Africa and the Holocost.It also highligts the major contribution the South African Jews gave in fighting Apartheid .Do not miss the short film on Nelson Mandella pkayed in an adjacent building."
        }, 
        {
            "index": 280, 
            "rating": "4", 
            "review": "A great overview. This was a really nice, easy to see museum. I found out that Jews came here for the same reasons they came to America, and started out the same way as American Jews did...by being peddlers. Prior to the turn on the 20th c Jews did well in a land without prejudice...and when it came, it hit them and others who didn't write in a \"European alphabet.\" They fought that, just as they fought against apartheid years later. Great overview, and you walk away feeling good."
        }, 
        {
            "index": 281, 
            "rating": "5", 
            "review": "well worth a visit. Well presented history of south African Jewish life. Some of the exhibits were visual and audio very modern spacious with a good cafeteria and gift shop."
        }, 
        {
            "index": 282, 
            "rating": "5", 
            "review": "an unknown little treasure. it is a beautiful little temple with incredible and little known history. even if you are not jewish, it is a little jewel of a place and definitely worth visiting"
        }, 
        {
            "index": 283, 
            "rating": "4", 
            "review": "Looking back. I visited the museum out of pure curiosity. I have been to the Smithsonian and wanted to see the differences. The layout of the museum was great and the information from the holocaust to the history of the Jewish community in SA was very informative."
        }, 
        {
            "index": 284, 
            "rating": "4", 
            "review": "Very educational. Very friendly staff at this museum. Lots of informative information on how the Jewish settlers came to be in South Africa in the early 19th century."
        }, 
        {
            "index": 285, 
            "rating": "5", 
            "review": "Wonderful Museum. WE had not read about this wonderul museum and only happened upon it as we walked through town. What a great museum not only for those of Jewish heritage but anyone interested in learning about European migration to South Africa. Perhaps we were very fortunate as we got there when no one else was visiting. So we had a private guide - Sam - who explained the museum's contents and the history of the Jewish people in South Africa."
        }, 
        {
            "index": 286, 
            "rating": "4", 
            "review": "Jewish history. A knowledgeable guide and a good way to understand another aspect of this cultural melting pot.A good shop and cafe as well."
        }, 
        {
            "index": 287, 
            "rating": "5", 
            "review": "Jewish culture.. A wonderful way to bring you in touch with Jewish culture. The guides are very friendly and informative."
        }, 
        {
            "index": 288, 
            "rating": "5", 
            "review": "Wow.. It'll leave you with a thought. It'll leave you quiet. Very few places have had such an impact on me. This was one of them."
        }, 
        {
            "index": 289, 
            "rating": "5", 
            "review": "Fascinating view of history of Capetown. Amazing to see how much the present city owes to the Jews and the biggest surprise was that it was an enlightened Jew who enabled Nelson Mandela to practice law. How different history might have been had it not been for this Jew. Do see the film about Mandela which is available if you ask and then have a wonderful sandwich in the cafe."
        }, 
        {
            "index": 290, 
            "rating": "4", 
            "review": "Interesting but lacking. Really enjoyed the sections on South Africa and how Jewish people were discriminated against in our past immigration policies and by the Apartheid government. However I would have like more about this. I also think there was a lot of information about the holocaust and WW2 but a lack of reflection about what the world has learnt from this experience."
        }, 
        {
            "index": 291, 
            "rating": "4", 
            "review": "Sad place. There are a few stirring moments -- a film in which Mandela talks respectfully about the Jewish community is particularly poignant, as are sound bites by Jews discussing their views on apartheid. Downstairs, reached via a fantastic spiral staircase, is a digital repository of Jewish identity and family trees"
        }, 
        {
            "index": 292, 
            "rating": "5", 
            "review": "great place, worth the trip. Really enjoyed this place, a definate if it rains whilst your there, the cafe is ok as well and its close to all the other museums"
        }, 
        {
            "index": 293, 
            "rating": "5", 
            "review": "Moving to say the least. A trip that will stick in your mind forever. Makes one remember how we should live in harmony. A lot of moving stories to tell. Good audio visuals"
        }, 
        {
            "index": 294, 
            "rating": "5", 
            "review": "Beautifully presented. This museum is light and airy yet well laid out with lots of details. Very interesting background to the history of the Jews in South Africa. The Halocaust section is, of course, traumatic but well thought through and presented. Provoking links made with the rise of the Nazis in Germany in the 1930s, (with the consequences), and the parallel Apartheid regime in South Africa up to the 1980s. A must visit if you have a few hours to spend on a rainy day."
        }, 
        {
            "index": 295, 
            "rating": "5", 
            "review": "Very Nice Museum Worth a Visiting. Jewish immigrants were central to the development and modern history of South Africa. This outstanding museum is a small gem and can be appreciated by all interested in the history of South Africa between the late 19th century and the end of Apartheid. Special treat is the visit to the beautiful 1905 built synagogue also in the grounds."
        }, 
        {
            "index": 296, 
            "rating": "5", 
            "review": "Excellent venue include the holocaust museum. A beautiful synagogue with a long history in Cape town well worth a visit. Include the Holocaust museum situated right next door. I enjoyed the tour and historical elements of the Jewish population of South Africa"
        }, 
        {
            "index": 297, 
            "rating": "5", 
            "review": "Wonderful portrayl of history. I was pointed to this museum from the hop on hop off bus tour. I'm so glad I went as it's one of the best museum experiences I've ever had. The displays and exhibits were thoughtful, artistic, tasteful and informative; the space is light, airy and welcoming. The docents are very helpful. I learned a lot about the history of Cape Town here as well as from a Jewish perspective. There's also a great tribute to Nelson Mandela. I highly recommend a visit to this small museum. A bonus was I got in for free, maybe because it was Friday or the next day was national museum day in South Africa, not sure.... but that was a nice thing to happen. Go, spend an hour or more, you won't regret it. It's just off the Company Gardens."
        }, 
        {
            "index": 298, 
            "rating": "4", 
            "review": "A sense of history. I visited the synagogue and the shop to buy a present for a bar mitzvah, but first had a one-on-one guided tour around the synagogue, the architecture is lovely. My guide was extremely interesting and welcomed all the questions I asked about the history and faith of the Jewish people. I intend going back to look around the museum with its unusual construction in the near future."
        }, 
        {
            "index": 299, 
            "rating": "4", 
            "review": "Jewish History in Cape Town. Modern and well rounded museum giving history and context of Jews in Cape Town. Added highlight was talking to a docent for a half hour. The museum in located next to the National Gallery, also worth seeing, and the Company Gardens, a welcome green strip in the city center."
        }, 
        {
            "index": 300, 
            "rating": "4", 
            "review": "Interesting and informative. I found this museum fascinating. It is well laid out and gives a really good insight into the contribution the Jews made to South Africa over the years. The staff are enthusiastic and helpful and I was particularly impressed by the adjoining synagogue."
        }, 
        {
            "index": 301, 
            "rating": "4", 
            "review": "History of Jewish community in South Africa. For those interested in this topic, well worth a visit. The entrance is set in the oldest synagogue in South Africa. Multimedia display of local Jewish History. Be sure also to visit the Holocaust museum, which is adjacent. AFterwards, go for a walk in the Company Gardens."
        }, 
        {
            "index": 302, 
            "rating": "5", 
            "review": "A good place to visit. Well worth spending half a day here. I found all of the exhibits interesting and well-displayed and came away with a strong sense of the Jewish contribution to South African history (except perhaps the last section on \"Dreams\"... kind of an anti-climax to the message from the history and survival of the Jewish community in Cape Town). Downstairs a helpful docent explained the marvels of the staircase. Also went to the adjoining Holocaust museum and having been to a few, I still learned something new-- about the Jews of Rhodes especially. Make sure you bring your passport to get in. We ate lunch in the cafe, which was great... I had a really good olive spread/avocado/feta sandwich that I wish I could re-create! Maybe it is a Jewish food."
        }, 
        {
            "index": 303, 
            "rating": "4", 
            "review": "Good but not great. This museum covers the history of Jews in South Africa as well as a history of Judaism and an overview of the Jewish religion. The museum has a lot of highlights - the reconstruction of an old shtetl from Eastern Europe downstairs is very well done, and the sections on the older history of Jewish immigration to South Africa was very interesting as well. The Holocaust Museum on the same grounds (admission free) was very tasteful and correctly drew parallels and links between apartheid South Africa and Nazism. The short video about Mandela and his relationship with South African Jewry was also very good. The gift shop is also good, as is the cafe.My only complaint is that the museum was not extensive enough. The discussion of the Oppenheimers was incredibly brief and the section on Jews who fought against Apartheid was far too small. There was a little bit about Helen Suzman but nothing at all about Joe Slovo or Lionel 'Rusty' Bernstein except for a brief mention of Slovo on a computer terminal listing prominent South African Jews. I hope this is something that the museum considers altering at some point in the future."
        }, 
        {
            "index": 304, 
            "rating": "4", 
            "review": "Well worth the visit. This tasteful museum gave us insight into the history of the Cape Town Jewish community. There were interesting exhibits, and there were docents with interesting stories."
        }, 
        {
            "index": 305, 
            "rating": "5", 
            "review": "Always a pleasure to visit. The museum is housed in a former synagogue and although not much has been added to it since my last visit here two years ago, it’s pleasing to see it being so diligently maintained and carefully looked after. The entrance fee is a modest R40 as at June 2013 (equiv $US4). The museum has its own parking facility, a few metres up the road before you hit the museum coming down Hatfield Road. For more details about it, it’s best to call beforehand because it’s easy to miss it. I did, and ended up parking in the Art Gallery car park a few metres past the museum although that wasn’t too much of a drama as it’s nearby and you just throw the parking attendant a few coins when you leave.This being a Jewish facility and in crime-ridden South Africa to boot it’s understandable that security is tight. So it’s wise to have some ID with you (such as passport or driver’s licence) and be prepared for a bag search and a few questions. But it won’t hold you up more than a couple of minutes and I always find the guards to be polite and businesslike. They even helped with directions to my next destination on my way out.Once inside, take your time to meander around and enjoy all the exhibits that trace the history of this vibrant, loyal and productive community from its earliest days in the Cape Colony at the start of the 19th century, through to mass immigration that swelled the Jewish population to over 40,000 between about 1890 and 1936, when restrictions were placed on further immigration by a pro-German white govt. At its peak, the Jewish community of SA numbered about 120,000 and at one time comprised almost 5% of the white population. There is also a strong focus on the involvement of the community in the anti-apartheid movement. Nelson Mandela’s first employers in Johannesburg were Jewish and he never forgot that, maintaining a strong affinity and respect for the Jewish community throughout his career. And it was he who officially opened the museum in 2000.There is an interesting exhibition downstairs of ancient Japanese miniature artwork, collected by a prominent Jewish South African and donated to the museum. Plus a photo exhibition by Paul Weinberg, recording his travels through the countryside where his forebears once lived and had businesses.I was excited to find a book listing all the Jewish émigrés who arrived at the Cape Colony between 1890 and 1905. There is a second volume of arrivals between 1905 and 1936.Don’t forget to visit the little shop afterwards which has a small but interesting collection of books and other knick knacks and of course Café Riteve for a sandwich and coffee. The staff are friendly, helpful and welcoming to all visitors. Being a Jewish ex-Capetonian, I always find this museum a joy to visit. It’s a moving experience that can bring a tear to your eye. It isn’t large and you should be able to cover it in about two hours."
        }, 
        {
            "index": 306, 
            "rating": "5", 
            "review": "The story of Jews in SA beautifully presented. This is a moderate-sized and very approachable museum which tells the story of Jews in SA in a graphical way. A bonus is a comprehensive listing of steamship arrivals of Jewish immigrants in the early 20th century. The museum also tells the story of SA's development in the 19th and 20th century with emphasis on the role of the Jewish community. The museum is conveniently located in \"Museum Row\" and is in a tranquil courtyard which includes the old synagogue and Holocaust Museum"
        }, 
        {
            "index": 307, 
            "rating": "5", 
            "review": "Never Again. I loved everything about this museum, it is has a very simple layout, but it is full of so much information and history. You have to brace yourself when you go into the Holocaust Centre though, it's a very intense experience."
        }, 
        {
            "index": 308, 
            "rating": "5", 
            "review": "Educational. Had a great guide, Sheila. Gave lots of information. Museum very informative of immigration of Jews in South Africa and their role in the development of South African society"
        }, 
        {
            "index": 309, 
            "rating": "4", 
            "review": "Interesting, see for yourself. I enjoyed the Jewish Museum, the library boast a big collection of interesting artefacts. If you have an interesting in Jewish history I highly recommend you visit, however, there are defiantly other interesting museums that I think is worth a view too. So it is important you decide early which ones you would prefer to spend your money on."
        }, 
        {
            "index": 310, 
            "rating": "5", 
            "review": "A Friday Visit To South African Jewish Museum. It was Friday and the museum closes at 2pm in advance of Shabbat. My tour ended at 12:30 and the guide (a native of Cape Town) was kind enough to drop me there. He had visited it and knew where it was.I had 50 minutes and a wonderful docent gave me a private tour of the synagogue and museum. He was extremely knowledgeable about the exhibits, the design and architecture of the museum and the history of the Jewish community in South Africa. He proudly showed me the special exhibit of netsuke figures and explained the history to me. There is also a lovely restaurant/cafe to grab lunch."
        }, 
        {
            "index": 311, 
            "rating": "5", 
            "review": "A Gem!. Only had a very short amount of time to see the Jewish Museum, but since my great-grandfather and some distant parts of my family emigrated here in the late 1800's, I was intrigued. They also had an exhibit on Jewish influence in District 6 in Cape Town."
        }, 
        {
            "index": 312, 
            "rating": "4", 
            "review": "Even if you are not Jewish, go.... It was well worth the time. A few minutes after I entered, a volunteer started to give me a private tour."
        }, 
        {
            "index": 313, 
            "rating": "3", 
            "review": "Interesting but not a must. Made the mistake on going initially on a Jewish holiday so was closed but managed to pop in the next day. Infiormative but a little repetative by the time you get to the end."
        }, 
        {
            "index": 314, 
            "rating": "4", 
            "review": "JEWISH MUSEUM, CAPE TOWN. Don't miss the Holocaust exhibition. The whole museum is really interesting. There is a good coffee shop which also serves light meals and it has its own parking area adjacent. Situated alongside th national Iziko museum and Planetarium."
        }, 
        {
            "index": 315, 
            "rating": "4", 
            "review": "Worth a visit. This is well worth a visit, not just because of the Jewish history, or the holocaust story but because they have possibly the best short film about Nelson Mandela. The restaurant looks really nice, but I didn't have time to stay."
        }, 
        {
            "index": 316, 
            "rating": "5", 
            "review": "A hidden treasure. Although not that well publicised, this museum and exhibition was well worth while. The displays are very well done and very informative. We all need to be more aware of the dark past."
        }, 
        {
            "index": 317, 
            "rating": "4", 
            "review": "South African Jewish history very interesting. The City Sightseeing Tour bus dropped us off quite near here. Very interesting history of the Jews in South Africa. We had a wonderful guide (he said he was a nice Jewish boy from Johannesburg) who went out of his way to give us a personalized tour. Time well spent."
        }, 
        {
            "index": 318, 
            "rating": "5", 
            "review": "very moving. Very interesting, very moving, compares well to a big city museum. Is worth the trip and not just for a rainy day"
        }, 
        {
            "index": 319, 
            "rating": "5", 
            "review": "worth a visit. Always a haunting experience visiting a Holocaust Museum. But something we must always be reminded of. Very well displayed. Of course I cried a lot, which always happens when I visit a Holocaust museum. It was also interesting seeing the Jewish Museum and a very beautiful synagogue. We went from there straight to the Company Gardens and the Iziko National Art Museum."
        }, 
        {
            "index": 320, 
            "rating": "5", 
            "review": "Very Interesting and Informative. I had a stroll through the Company's Gardens and then decided to visit the South African Jewish Museum. On arrival I was greeted by friendly staff and taken on tour by Rod. Very informative and interesting tour where I learned a lot about the Jewish religion and culture. The museum is worth a visit and I will be back again to explore all the exhibits!"
        }, 
        {
            "index": 321, 
            "rating": "5", 
            "review": "Very interesting museum with friendly staff. We visited the jewish Museum on a Friday because we spent the day in town because it rained. The Museum is quite new and has interesting exhibitions, we saw 6th district Exhibition and one about Little miniature japanese figures (forgot the Name of them) A very friendly man showed us around and gave us a lot of Details about the history. we also went to the Holocaust centre which was sad but alerting and although they were about to Close we could go in."
        }, 
        {
            "index": 322, 
            "rating": "5", 
            "review": "A revelation!. I had the privilege of having a tasty lunch with friends at the restaurant adjoining the Jewish Museum and then visited the museum. The history of the Jewish population of Europe is extremely well illustrated, down to the actual Shekel built inside the museum. The horror of the holocaust is also so well depicted that one cannot help but feel the desperation and terror which so many thousands had to endure. It is a must to visit as it broadens one's understanding of persecution and hardship!"
        }, 
        {
            "index": 323, 
            "rating": "5", 
            "review": "A storied community. Going back over 150 years, Jews were an integral part of the history of Cape Town, and South Africa.This museum and the holocaust museum next door, sit on the perimeter of the \"Gardens\" the Central Park of Cape Town. All the most important buildings ie. Senate, Parliament and Presidents House.. as well as the National Museum and the Art Museum amongst others... The beautifully maintained park, gardens are a pleasant and peaceful place to walk through and relax in the center of the City."
        }, 
        {
            "index": 324, 
            "rating": "5", 
            "review": "A must see. The S.A Jewish Museum is a must see. It depicts the history of the Jewish people of South Africa and how they came to be here and what they contributed to S. africa.THey often have exhibits. At the moment the exhibit is on the \"Jews of District 6\" which is very interesting. It is really worthwhile and alongside it is the Holocause Museum which is also an absolute must see"
        }, 
        {
            "index": 325, 
            "rating": "5", 
            "review": "Very interesting and just the right size. I knew nothing about South African Jews and found this museum to be a real eye opener. There was an exhibition about the Jews of District 6 which was very enlightening. And I loved how it's not a gigantic place where you get lost for hours."
        }, 
        {
            "index": 326, 
            "rating": "5", 
            "review": "A Jewish Place of Worship and History. The old synagogue is used as a museum describing present Jewish life and history. There is a small exhibit of old religious articles that survived the times. Downstairs there are replicas of houses in the ghetto and life size pictures of ghetto life. The atmosphere is informational, factual and non-emotional.There also is a non-related collection of Japanese miniatures, netsukes.The new synagogue consists of a large prayer hall and has an architecturally pleasing interior. Prayer services are conducted at a very regular times.There also is a nice kosher restaurant on the premises, where you can meet people from all over the world, sometimes even people you know."
        }, 
        {
            "index": 327, 
            "rating": "5", 
            "review": "I LEARNT AN AWFULL LOT. Centrally located to the side of the \"Companies Gardens\" in down town Cape Town the Jewish museum is easy to find and has plenty of car parking for a city centre venue. My advice is just go and make your own mind up. But GO!"
        }, 
        {
            "index": 328, 
            "rating": "5", 
            "review": "Fascinating. This stylish, friendly museum details the history of Jews in S Africa, and their contributions to the development of the country in business, the Arts, politics. Plus a welcome cafe!"
        }, 
        {
            "index": 329, 
            "rating": "5", 
            "review": "modern, well layed out museum. Good use of modern technology and description of Judaism and also of the treatment of Jews during World War 2"
        }, 
        {
            "index": 330, 
            "rating": "5", 
            "review": "Outstanding Exhibits. Although the District 6 museum encouraged me to visit this museum, I found not only a new perspective, from a Jewish point of view but also a fantastic exhibit on Japanese netsukes. Recreating the small houses, the set table and artifacts used by this community illuminated and extended the information from the District 6 Museum. Photographs also helped explain the repressive times.We also visited the synagogue. We were so glad we had visited this museum although it had not been on our original itinerary. We highly recommend it and wished we had had more time to examine the other collections here."
        }, 
        {
            "index": 331, 
            "rating": "4", 
            "review": "Special Place. Good, hearty Jewish food and excellent atmosphere. The perfect place to go for refreshment after visiting the Jewish Museum or Holocaust Center"
        }, 
        {
            "index": 332, 
            "rating": "4", 
            "review": "Well laid out. The whole experience was fantastic! the other museums in Cape Town can take a leaf out of this book! it is well laid out and flows! the staff are friendly and attentive and you never feel like you are just another visitor!"
        }, 
        {
            "index": 333, 
            "rating": "5", 
            "review": "Fantastic Museum. I very much enjoyed visiting this museum, which was incredibly informative about the Jewish population's migration to South Africa starting early in the 19th century. The museum also highlights the contributions of ordinary and prominent Jews even today. We had a wonderful guide, Sam, volunteer to show us around the museum. Beginning with one of the oldest synagogue in SAfrica and finishing with a very well done Shtetel replica, I thought the museum was incredibly informative and very interesting. The Holocaust Museum (entrance free) is across the street and also worth a visit. Highly recommend."
        }, 
        {
            "index": 334, 
            "rating": "5", 
            "review": "Excellent memorial. This is a stop on the Hop On-Hop Off bus tour. We were impressed with the information presented both about the Holocaust and the Jewish connection/support for the abolishment of apartheid.There is a cafe which also serves great coffee and cake too."
        }, 
        {
            "index": 335, 
            "rating": "3", 
            "review": "Worth a visit if you have time to spare. Lots of information but much is what most people already know except for the information on Jewish immigration to South Africa.We spent almost 3 hours there as there was lots to see but if it had not been a cool Sunday when most other sites were closed I think an hour for a quick overview would have been enough"
        }, 
        {
            "index": 336, 
            "rating": "5", 
            "review": "One of the Best Jewish Museums Anywhere. Don't Miss It!. This was a great museum that I would highly recommend whether you're Jewish or not. Very modern with awesome displays and exhibits. Interesting history of the Jewish community in South Africa. I had no idea that Nelson Mandela had so much involvement with the Jewish Community there. Also, there was a wonderful exhibit on \"District Six\" which was a melting pot in the heart of Cape Town for many, many years until it was bulldozed bythe local government and its inhabitants forced to move. The exhibit at the Jewish Museum was so much more informative and well documented than the District Six museum itself! It really explained what that areas was like. There is also a lovely gift shop and cafe. The docents at this museum are so helpful and informative as well all adding to the knowledge and insight you can get out of your time. This is a \"don't miss\" while in Cape Town!"
        }, 
        {
            "index": 337, 
            "rating": "5", 
            "review": "History of South African Jews. We visited this museum and spent a few hours learning about the history of the Jews of Cape Town. The museum is high tech and interactive. There is a film about Nelson Mandela. The Gardens Synagogue is attached to the museum and our group attended the Friday night services. It was a beautiful service and there is a wonderul men's choir. Please note that if you want to attend services, you must arrange this in advance and be prepared to to show your passport."
        }, 
        {
            "index": 338, 
            "rating": "5", 
            "review": "Easy to get to with great historical value. So much has been handed into the museum from Cape Townians who had the items in their family. Brings it home to one. Its a museum that everyone should see. Its also beautifully laid out"
        }, 
        {
            "index": 339, 
            "rating": "5", 
            "review": "Litvak life in SA. Very interesting for anyone who has an interest in the history of the Jews in South Africa. The main section of the museum documents the life of the Litvaks before the left Lithuania, and after they arrived in South Africa.A special exhibition is on at the moment on life in in District Six, which was flattened during the apartheid experiment. An excellent kosher cafe is attached, and good book shop selling Judaica and other items relating to the exhibitions."
        }, 
        {
            "index": 340, 
            "rating": "5", 
            "review": "Lovely, informative, interesting complex--much to offer. The South Africa Jewish Museum is part of a complex including the lovely 1863 synagogue which is the entrance to the musem (the first synagogue built in South Africa), as well a the Gardens Shul, the magnificent 1905 synagogue right next door which is still in use. The free Cape Town Holocaust Center is part of the complex and should not be missed. There is also a cafe and gift shop. Entrance fee is a reasonable 40 Rand (about $4.50). The museum is in the Company's Garden area.of Cape Town. This modern, informative museum was opened in 2000 by Nelson Mandela and tells the story of Jews in South Africa. There was terrific exhibits, videos, interactive media and pictures. The is a full scale model of an old Eastern European shtetl which you can tour and presently, an exhibit on District 6, an area that housed Jews, as well as blacks, Asians, etc. in the early part of the century and was torn down during the apartheid era--very moving. Do not miss this wonderful complex (note--we needed picture identification before entering the complex). Be aware that the museum is only open until 2 PM on Friday and is closed on Saturday. It is open the other days of the week."
        }, 
        {
            "index": 341, 
            "rating": "4", 
            "review": "Heart wrenching. I visited the holocaust museum and found it to be not only informative but also very emotional. As I left I could not hold back the tears. I'm not Jewish so knew very little about what happened. To watch interviews with survivors was heart wrenching. I would suggest locals pay this centre a visit."
        }, 
        {
            "index": 342, 
            "rating": "4", 
            "review": "Since I visited Yad Vashem in Israel, I´m not in awe, but.... Since I visited Yad Vashem in Israel, I´m not in awe, but it is a small and nice museum, with very good taste. I recommend."
        }, 
        {
            "index": 343, 
            "rating": "5", 
            "review": "Very Informative. A surprisingly good holocaust and Jewish history muesem. Exhibits highlighting the experiences of survivors who moved to South Africa were very good. The museum cafe is excellent."
        }, 
        {
            "index": 344, 
            "rating": "5", 
            "review": "Amazing museum, Fantastic Mandela film. This museum was very well done and easy to walk around and learn from--with the exception of some videos that were hard to see (the way the light hit the screens) and hear (a lot of ambient noise got in the the way). Still the fantastic number of photos and memorabilia and easy to read quotes and captions made this a top place to visit. We found the District 6 information to be easier to read and access than in the actual District 6 Museum, where it seemed to be wall to wall newspaper selections and hard to decide what to read. Next to this museum is the Holocaust museum, also a VERY well done history--concise and thorough. I learned more here than at the US Holocaust museum, maybe because it was so concise. We were told 30 minutes in the Holocaust museum (perfect for my friends--I took about 40 minutes) and about an hour in the Jewish Museum. BUt BE SURE to leave time for the 27 minute film interview with Mandela which covered Jewish history intertwined with ANC and anti-apartheid activities. An excellent movie, not available elsewhere. Easy to hear and see as it's in a small auditorium. Again, we learned more here than at the District 6 museum and Bo Kapp museum together (though both are definitely worth visiting)."
        }, 
        {
            "index": 345, 
            "rating": "3", 
            "review": "Very informative museum almost spoilt by security. Excellent museum with great displays, making great use of technology and lighting to create immersive experience. Also does a great job of showing the relevance of the subject matter to South Africa - which might not be very clear at first. Full marks for the great museum, you'll enjoy it if you get in.Which isn't as easy as it sounds. Security standards are typically Israeli, you need to have your passports on, be patted down and go through metal detectors... Which would all be bearable if the security was not so rude!"
        }, 
        {
            "index": 346, 
            "rating": "5", 
            "review": "Helpfull. We never realised that also in South Africa, the jewisch were not welcome. The film regarding Nelson Mandela we have seen. We understood in his younger years Nelson was a kind of terrorist in SA."
        }, 
        {
            "index": 347, 
            "rating": "5", 
            "review": "Excellent Cultural experience. This tour carried out by Sheila, a very experienced guide, was most informative and enjoyable. Certainly a must on any educational tour."
        }, 
        {
            "index": 348, 
            "rating": "1", 
            "review": "Proof of identity. We didn't have our passports on us so were refused entrance by a very rude security guard. I'd give it a miss."
        }, 
        {
            "index": 349, 
            "rating": "5", 
            "review": "Wonderful museum. Small, but excellent museum. Well worth a visit to learn about the history of Jews in Cape Town. There is also a small holocaust museum next door, which is included with your admission ticket. I wish I had more time to visit the holocaust museum, as it seemed excellent too from my brief walk through. Note that the hop-on hop-off bus stops right by the museum for convenient access."
        }, 
        {
            "index": 350, 
            "rating": "5", 
            "review": "Very Moving. A most thought provoking experience. Mans inhumanity to man is quite beyond comprehension. Every child should visit with their parents. We must never forget."
        }, 
        {
            "index": 351, 
            "rating": "4", 
            "review": "Well worth a visit.... Went to the Jewish museum sometime last year and wasn't really sure what to expect but after the visit I was very glad that I had gone. First of all there is a disabled parking bay but it took some navigating to get past the drums which are there I suppose to deter others. Getting past the drums took some elbow grease from the security guard and my friend as the drum had to be moved so I could get out but from there it’s easy access all the way.You start in the old Synagogue, which for me is just beautiful; I love the \"old\" feel which one gets at certain places. And from there you go through the exhibition section, on the lower level which is accessed either via a stunning staircase or a lift you enter the old village (I think it’s called a shtetl), the detail is brilliant... Back up in the lift and there is another lift close to the coffee shop which will take you to the Cape Town Holocaust Centre. It was quite an emotional visit.We ended off our visit with a cup of tea at Café Riteve (if I remember correctly)."
        }, 
        {
            "index": 352, 
            "rating": "5", 
            "review": "Very educational and worthwhile visit. A few blocks from the Green Market Square area of Cape Town, the museum is not more than a 10 minute drive from the Waterfront area (about R40.00 or $5.00). Security is tight so expect your bags to be searched as you sign in at the front gate. As you do the self-guided tour of the museum, there are many artifacts to look at as well as many storyboards and videos showing a history of the Jewish people in Cape Town. There was so much to read and see, our 1 1/2 hours there flew by. Unfortunately, time did not allow for us to tour the holocaust museum but we did have a few minutes to check out the small gift shop where I bought a beautiful metal art piece at a reasonable price hand made in Cape town. A cafe in the same building had snacks and drinks which my mom enjoyed. My only regret is that we ran out of time as the museum closes promptly at 5:00pm. To do this museum right, please allow at least 2-3 hours. We decided to walk back to the V & A Waterfront which turned out to be a nice walk, all downhill, and took us about 45 minutes. Don't do this walk after dark as once the business district closes down, it is unwise to stroll the streets in this area."
        }, 
        {
            "index": 353, 
            "rating": "5", 
            "review": "Best Museum I visited in the 4 weeks in the Cape. The museum was closed for refurbishment when I arrived in Cape Town at the end of July but open when I was back in late August. Very well laid out with good graphics, visuals and audio telling the story of the Jews in the Cape and the experience of European Jews in the 1939-1945 holocaust. Many survivors made their way to South Africa so there is plenty of personal testimony.I spent 4 hours in the museum which is some testimony to its interest. After 4 weeks along the western Cape and Garden Route, this was the best museum I visited"
        }, 
        {
            "index": 354, 
            "rating": "4", 
            "review": "Well Curated. A well curated look at the history of Jewish immigrants in South Africa along with some basic information about Judaism. It also includes a collect of Japaneses Miniatures and a wonderfully designed staircase. Honestly the staircase is notably pleasant."
        }, 
        {
            "index": 355, 
            "rating": "4", 
            "review": "Moving. Beautiful old shul, great little kosher restaurant, with a great little gift shop, a holocaust museum which connects to apartheid, and a Jewish library"
        }, 
        {
            "index": 356, 
            "rating": "4", 
            "review": "A big complex. To call this place “just” a museum is doing it an injustice. The South African Jewish Museum sits opposite the Holocaust Museum, and the Great Synagogue sits behind them. There is a clear progression through the museums and the displays are informative.  While it will certainly be interesting and relevant to Jewish people, including a very extensive history of Jews in South Africa, there is enough there for everyone to enjoy. Worth a look."
        }, 
        {
            "index": 357, 
            "rating": "5", 
            "review": "A must-see if you're Jewish and interesting even if you're not. Due to time, we didn't get to see everything in this museum but it's very new and the exhibits are state-of-the-art. The South African Jewish community has a long and fascinating history and the museum is well worth exploring. The shop is a must also! I was above to find all kinds of one-of-a-kind items like wire and bead menorahs shaped like various African animals--a unique souvenir of my trip that I couldn't have found anywhere else."
        }, 
        {
            "index": 358, 
            "rating": "5", 
            "review": "A interesting experience. We walked up through Company Gardens,and find the SA Jewish Museum next next to the Gallery on the left . The entrance however is in Hatfield Street, with no obvious access from the Gardens. However, there is a dirt road pedestrians can cut across, just past the museum, which takes you out onto Hatfield Street. The Museum, Synagogue and shop/cafe is set in a compound, and you will need personal ID to get through the security, sign a logbook, and enter the compound. The first impression is that the compound is extremely clean, tidy and well kept. There was a very helpful friendly lady who took us into the synagogue, and, not being of the Jewish faith, spent some time explaining the set up and working of the synagogue. She was a gem, and we learnt a lot.The museum is part of the first synagogue built Cape Town. It is well laid out, and worth a visit, telling the story of where the community came from and how they integrated into the South African culture.We had lunch at the cafe before visiting the holocaust museum. It is interesting but at the same time also shocking and left you with a sad feeling and ashamed at what humans(nations) can do when they believe they are right. Also so amazing to realize that with the help of God a nation was saved again although so many had to suffer and die as a result."
        }, 
        {
            "index": 359, 
            "rating": "4", 
            "review": "Very memorable experience. I visited the museum with a group some 3 years ago and it was a very moving experience. Can definately recommend. Take tissues! I was very emotional."
        }, 
        {
            "index": 360, 
            "rating": "5", 
            "review": "Amazing Museum. Any country I travel to I visit the Jewish areas and museums if they have one. I thought the South African Jewish Museum and Holocaust Centre was outstanding. We spent 6 hours touring both areas plus had lunch in the lovely cafe on campus. Don't miss these wonderful museums whether you are Jewish or not. Both are filled with lots of history, art, and interesting exhibits. The connection of the Jewish people with Apartheid was something I didn't know before along with the struggle the Black, Color and Jewish people of South Africa shared. A museum not to be missed!"
        }, 
        {
            "index": 361, 
            "rating": "5", 
            "review": "A must for all the history lovers. Use the hop on hop off bus to visit this very interesting museum with the Holocaust Centre also on the premises. Remember to bring your ID book to enter this museum. The history of the Jews in South Africa was also very interesting"
        }, 
        {
            "index": 362, 
            "rating": "4", 
            "review": "slice of jewish life in SA. interesting history & museum is next to Holocaust Museum. We should never forget"
        }, 
        {
            "index": 363, 
            "rating": "5", 
            "review": "Amazing presentation, difficult topic. We went to see both the Jewish Museum and the Holocaust Centre, which is located in the same complex.To enter, you must clear a security gate, requiring some form of ID.Entrance into the Jewish Museum was 40R and the holocaust was free (but we left a donation).The information in the Jewish museum was outstanding, with information from many years ago, leading up to Jewish settlement in Capetown and other businesses involved in the area.We really enjoyed it.After about 2 hours in the museum, we exalted over to the holocaust centre and spent another 2 hours. easy to do as there is plenty of information both written and audio. It was very detailed and presented in a fabulous way. As a teacher, I was very pleased to be able to buy some educational resources too.We highly recommend this museum combination, but we were quite emotionally exhausted afterwards."
        }, 
        {
            "index": 364, 
            "rating": "4", 
            "review": "Eye Opening. I went away from here having learnt something: Jews were instrumental in the struggle against apartheid. I got a bit teary-eyed here and now have an even deeper respect for Jews."
        }, 
        {
            "index": 365, 
            "rating": "5", 
            "review": "A most entralling experience. The Saff were really helpfull the exhibits wel;l laid out and linked. All together a most entralling experience for me as a non Jew."
        }, 
        {
            "index": 366, 
            "rating": "4", 
            "review": "Holocaust Centre. Accessible walk-through self-explanatory layout with audio-visual components. The serious subject matter is respectfully presented and placed in a South African context where applicable.The personal testimony video near the exit affected us deeply."
        }, 
        {
            "index": 367, 
            "rating": "4", 
            "review": "Lots to see. get the perspective of the Jewish Community from Cape Town. Probably on a par with out Jewish Museums around the world."
        }, 
        {
            "index": 368, 
            "rating": "4", 
            "review": "Sad but Informative and worth a visit!. The holocaust museum, in particular, is worth the investment of an hour or so as it's informative and enlightening."
        }, 
        {
            "index": 369, 
            "rating": "4", 
            "review": "Interesting - remember your ID/passport, though. The Jewish museum and Holocaust museum are set in a secure compound just off the Company's Gardens, but access is round the other side, on Hatfield Street. It's a bit of a strange experience entering the museum, as unlike the others, you have to present your ID or passport first, which will be checked and noted, before you pass through a turnstile into the compound. It is slightly off-putting, but I imagine there are sound reasons for the tight security. Don't let it put you off going though - non-Jewish people are very welcome to visit and once inside, I was made to feel extremely welcome. Initially I looked at the working synagogue, interesting if you not familiar with the layout and quite old, end of the 19th century I believe. Then I went into the museum proper, which starts off in the very first synagogue which opened in SA and has displays explaining some of the tenets and practices of the Jewish faith. Further along there are displays explaning the history of Jewish immigration to SA, political issues, prominent South African Jews, and other material.Downstairs there is a reconstruction of a Lithuanian shtetl - a small wooden village, as apparently most SA Jews came originally from Lithuania. It's quite atmospheric and you can wander around. Finally there is a temporary exhibition space.I didn't visit the Holocaust museum, but that is on the same site along with a gift shop and a kosher cafe. Generally I found it all interesting although I wouldn't say it was the best museum I've ever been to. Anyone who has particular interests in Judaism should obviously take a look and it's a good eye-opening experience for non-Jews."
        }, 
        {
            "index": 370, 
            "rating": "5", 
            "review": "Chilling. An emotional and wothwhile expereince - can use the hop on hop off bus that stops infromt of the Museum"
        }, 
        {
            "index": 371, 
            "rating": "5", 
            "review": "Have your hankies ready.. Brutality is never nice to see, this place will remind you of that.\nAlso enjoy a good lunch at the milchic restaurant."
        }, 
        {
            "index": 372, 
            "rating": "4", 
            "review": "Dont forget to take some ID with you. We had spent the morning walking up through Company Gardens, and having just finished at the Art Gallery, decided to follow the Rough Guide Book and go to the SA Jewish Museum next, which is next to the Gallery on the left as you walk up Company Gardens. The entrance however is in Hatfield Street, with no obvious access from the Gardens. However, there is a carpark pedestrians can cut across, between the two buildings, which takes you out onto Hatfield Street. The Museum, Synagogue and shop/cafe is set in a compound, and you will need personal ID to get through the security, sign a logbook, and enter the compound. The first impression is that the compound is extremely clean, tidy and well kept. There was a very helpful lady who took us into the synagogue, and, not being of the Jewish faith, spent some time explaining the set up and working of the synagogue. She was a gem, and we learnt a lot.The museum is well laid out, and worth a visit, telling the story of where the community came from and how they integrated into the South African culture."
        }, 
        {
            "index": 373, 
            "rating": "5", 
            "review": "Great portrait of Jewish South African heritage. Really nice little museum that does a great job showcasing the history of the Jewish population in South Africa. There's also a very well done Holocaust museum attached."
        }, 
        {
            "index": 374, 
            "rating": "5", 
            "review": "Good historical place to go.. This museum was well organized and very interesting. Jewish history in South Africa is short (first synagogue built in 1860's), but this museum put all the information suscinctly. The location (the original synagogue) is beautiful, the displays well done. And there was a temporary exhibit of Zapiro's political cartoons about Mandela that was fabulous: go before that leaves at the end of January '12."
        }, 
        {
            "index": 375, 
            "rating": "5", 
            "review": "A hidden heritage gem in Cape Town. I never realised the impact this community has had on SA untill I visited this museum. It give a very interesting overview of the background of the South African Jewish community with their roots in Eastern Europe. There is also a section on the Second World War and the horror suffered by this community in Europe. I found the museum well kept and interesting in the manner the displays were arranged. while also informative."
        }, 
        {
            "index": 376, 
            "rating": "5", 
            "review": "impressive. This museum is well funded, you can see it. Great, informative, interesting displays showcasing the history of jewish families and their involvement in the development of the country as well as in many cases, their huge contribution. They often have temporary art and photography exhibitions as well, all of which has always been impressive. This museum is one of my favourite and well worth a visit. I return regularly and am never disappointed."
        }, 
        {
            "index": 377, 
            "rating": "4", 
            "review": "Zapiro exhibition is not to be missed!. We enjoyed very much Zaprio's \"Jiving with Mandiba\" exhibition. A large and well organised presentation of cartoons by Jonathan Schapiro, who ought to be listed as a living national treasure of South Africa (though the current political powers-that-be might not agree...). For anyone with even a passing interest in wanting to understand South African politics post 1994, this is a must. Do not pass through Cape Town without visiting this exhibition!"
        }, 
        {
            "index": 378, 
            "rating": "4", 
            "review": "A Wonderful compact Museum. This museum is one of the stops on the Cape Town Hop On/Off tour bus although we walked there from the city centre and caught the bus afterwards.A discount for entry is given to holders of the hop on/off ticket.It is quite a hard museum to find owing to the fact that it has a security entry and in a fully fenced compound.We think there is only one entry point and they screen everyone coming into the grounds here.Security personnel are thorough but friendly and you must sign in and out and go through a small portal.This didn't worry us in the least as they are only doing their job.The grounds are lovely and the old synagogue is a white building with an entry near the park to see the rest of the museum. We did not see another entry point (if they have one.)Here you pay the 50 Rand entry (full price) and photos are allowed of all the beautiful ceremonial items on display with explanations of their use in Judaism ritual.Cameras and movie cameras must be turned off after that part of the museum.The old Synagogue architecture is lovely and an interesting presentation of Nelson Mandela and the story of the Jewish struggle and life in South Africa is on an upper level.Walking down the unusual winding ramp you have another very good exhibition of 'the Shtetl ', a look in the life of an eastern European Jewish village.... wonderful!Also along the downstairs walls are many photographs and art, most of which relates to the struggle during Apartheid. Restrooms are here at this level.The holocaust memorial and information is in another building however we did not have time to visit.A modern cafe and gift shop are located in the grounds and although food is limited to a small choice, it is still very good.The gift shop sells a variety of items, including Judaica, South African items and books.We found this museum outstanding. It is a comprehensive and factual insight into Judaism in South Africa as well as a look into the struggle for independence.Enjoy your visit!"
        }, 
        {
            "index": 379, 
            "rating": "5", 
            "review": "Fabulous museum for all history lovers. My husband and I spent a morning at the museum and were very impressed. We loved it! The museum is very new, modern, high-tech and well laid out. I got caught up learning about all the different, interesting people who lived there including a man who made a fortune in ostrich feathers - until they were no longer the fashionable thing for women to wear on hats! I had also wanted to find out how the Jews had reacted to apartheid and was not disappointed. The recreated village made me start humming songs from \"Fiddler On the Roof!\" We enjoyed the gift shop as well."
        }
    ]
}