{
    "category": "Cape-Town-Central", 
    "entity": "The-Heart-of-Cape-Town-Museum", 
    "avg_rating_stars": 4.736559139784946, 
    "review_count": 186, 
    "rating_stats": {
        "poor": 1, 
        "average": 5, 
        "terrible": 1, 
        "very_good": 32, 
        "excellent": 147
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "Great Even for Non-Medical People. I came to visit this museum when my parents came to visit as my Mum works in hospitals and was interested. It was a very informative experience and was most fascinating. I highly recommend it."
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "Incredibly interesting for this pediatric cardiologist!. I was enthralled with this museum. I remember this event when I was in high school. Amazing how similar the process remains today. The account of the surgery by the tour guide is very accurate. They have every right to be so proud of this!"
        }, 
        {
            "index": 3, 
            "rating": "4", 
            "review": "Interesting learning experience. A history lesson of the hospital and doctor who performed the first heart transplant. It was very interesting to learn what the doctor had to go through to perform the operation, and how he got the donor. There are a few wax recreations on display but it would be nice if they had just a little bit more. The guide was very knowledgable and answered all our questions confidently. I think this is one of the must-do things in Cape Town."
        }, 
        {
            "index": 4, 
            "rating": "5", 
            "review": "Family museum visit. Wow. Best layout I have every seen in a museum.Loved the idea of booking a private tour. Excellent portrayal of the first heart transplant. Let informed staff walk you down the road of this historical event. Brilliant."
        }, 
        {
            "index": 5, 
            "rating": "5", 
            "review": "Fun and informative visit.. By visiting this museum we not only learnt a lot about the first successful heart transplant but about the history of medicine in general. We were travelling with a doctor who was the reason we decided to visit but it ended up being a great experience for us all. Great displays and we had the guide (a very kind woman) all to ourselves."
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "The unusal, educational and interesting.... As a physician it was a must-see museum for me. I was not disappointed!For the City Sightseeing ticket-holders there was an offer of a free shuttle to the museum which is located in the historic and iconic Groote Schuur Hospital.This is a private museum with tours by appointment only for one of 3 guided tours a day. Our guide was a fantastic, very eloquent and knowledgeable lady who witnessed the Dr Bernard era first hand. She was an amazing story teller!It was especially exciting to see Dr Barnard's office with his silicon figure disturbingly accurate and lifelike and fully restored operating theaters where the first human to human heart transplant surgery took place. We also enjoyed the movie. There was plenty of time to browse through the exhibit's many artifacts, photos and memorabilia."
        }, 
        {
            "index": 7, 
            "rating": "5", 
            "review": "wonderful tour experience!. My boyfriend and I are medical students and found the museum fascinating! My parents were with us, and they have no medical background, and usually do not love museums, and they found it very interesting as well.Of note, the museum runs by guided tours (9, 11, 1 every day). We at first were hesitant to take a 2 hour tour on our already busy day, but it was well worth it! Our tour guide was the former personal photographer of Dr. Barnard (the surgeon of the first heart transplant), and had amazing personal stories to tell about the surgeries and Dr. Barnard's life. If you are a student, bring your student ID and they will give you a discount."
        }, 
        {
            "index": 8, 
            "rating": "5", 
            "review": "Fantastic experience for all ages!. I took a group of undergraduate pre-med students here and they were fascinated the entire tour. Our guide was very knowledgeable and engaged, having even worked with Dr. Barnard himself! Don't miss out on this while in Cape Town."
        }, 
        {
            "index": 9, 
            "rating": "5", 
            "review": "Intresting. This place is am museum that you have to go and see, the museum has the original OR of where the first heart transplant was formed and wax figures of the people that were involved and of the original pump."
        }, 
        {
            "index": 10, 
            "rating": "5", 
            "review": "Medical history at its best - for everyone to enjoy!. It is now almost 50 years (1967) since the world's first heart transplant which took place here in Cape Town in the actual museum!It is a two hours tour which is over before it has begun. I can go back every time I visit Cape Town.Interesting also for children!"
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "An excellent, and for me, nostalgic tour. Not to be missed by locals and foreign visitors alike.. As a nurse who trained in this iconic and historic hospital in the '70's, it was very moving to return with my family and visit the incredibly well reconstructured Heart Museum. Everything was done with great attention to detail and as our guide had been Chris Barnard's photographer we gained a deeper insight into this brilliant man's life and achievements. Well worth the time and expense. And as a postscript, we learned that Chris was revered in Italy, from correspondences and press articles in the museum, but it was still a delightful surprise when on a recent visit to small village in the south of Italy, an old lady, learning that I was from Cape Town, beamed, \"Chris Barnard\" at me."
        }, 
        {
            "index": 12, 
            "rating": "5", 
            "review": "Must visit unique museum. Way back in December 1967 Cape Town made headlines when Dr.Christiaan Barnard performed the world's first heart transplant operation. This marvelous museum commemorates that historic event. You will be shown the actual operating theatres where the medical drama took place - even the diseased heart of the recipient Louis Washkansky is on display !The donor Denise Darvall - who died tragically in a car accident - is of course also not forgotten.There are amazingly realistic latex models of all the people involved to add further interest to the exhibits. Also shown are letters from Dr.Barnard's admirers from all over the world .You can also watch a short but moving film about Dr.Barnard. This is one of Cape Town's most underrated visitor attractions and should not be missed by anyone interested in history or medicine. The professional guide-lecturers are also outstanding. Perhaps not suitable for young children."
        }, 
        {
            "index": 13, 
            "rating": "5", 
            "review": "Surprisingly Interesting and very well done. We didn't book, but joined a tour that had just started and thoroughly enjoyed it. We had a very informative guide and much nicer to hear about it than to attempt to wander around on your own, so book if going."
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "Mindblowing. I'm so appreciative of how they have kept this amazing museum and history so well presented its like going back in time. U have to do yourself the favour and go see it if yourself."
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "Little known gem. My husband has wanted to visit this museum for a while now. I was not keen, but took him last Sunday for Father's Day. What a wonderful experience from beginning to end. The staff were all so enthusiastic and gave wonderful insight into the first heart transplant and events around it. The guided tour takes about an hour and a half and one is free to explore afterwards. Realistic theatre reconstructions, a lot of memorabilia and all of this in the actual place these historical events took place. I found myself quite moved by the lives of all the characters involved. One does not have to be in the medical field to appreciate this very human story."
        }, 
        {
            "index": 16, 
            "rating": "4", 
            "review": "An awesome experience. What an amazing place to visit, from the detail of the silicone models to the amount of photos on display is jaw dropping and astounding. The theatre displays are so realistic in your mind you can hear the sound of the Birds machine and the clicking of the instruments dropping into the basins! The three of us that visited the museum did our nursing training there during those years and for us it was also an emotional re-union of those days."
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "Must visit. We visited the museum with some friends from overseas who were on the medical profession. What an excellent and interesting 2 hour tour.Every thing is explained step by step about the first transplant and dr. Barnard. Lots of details and information. Visit well worth!!"
        }, 
        {
            "index": 18, 
            "rating": "5", 
            "review": "A must for everybody. It was just great, what an experience to have been at a place where history was made. Not just for heart transplants, for all other transplants as well. The tour was wonderfully presented and the extra information we got out of it was unbelievable. We gained a lot of extra information."
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "NOT to be Missed. What an experience! This museum is fascinating - and the docents give you the full story of what lead up to the first heart transplant and recreates the operating rooms and doctors with life-like figures. They also cover the donor and her family's hard decision to consent to this. Fascinating - a must do."
        }, 
        {
            "index": 20, 
            "rating": "5", 
            "review": "Best Museum I've ever visited. This is a wonderful museum and I would highly recommend it to anyone visiting Cape Town. The guide was fantastic and kept the whole groups attention for 2 hours. Fascinating and emotional story. We took our 8 year old and she loved ever second and learnt a great deal.A big thank you to our lady guide, you were brilliant."
        }, 
        {
            "index": 21, 
            "rating": "5", 
            "review": "Memorable experience. Visiting this museum is well worth the time whether or not you are old enough to remember Christiaan Barnard's history making surgery. The tours are small groups. The museum is simple but tastefully done and uses the very same original facilities that were used by Barbard and his medical team. Full of information especially the newspaper archives. The video they show as part of the tour was very interesting. The whole tour takes less than 2 hours, but you are free afterwards to spend as much time as you wish seeing the displays. You won't regret your visit."
        }, 
        {
            "index": 22, 
            "rating": "5", 
            "review": "Excellent . I was very impressed as to how much went into this museum. It's interesting for medical and lay people alike. Fascinating."
        }, 
        {
            "index": 23, 
            "rating": "4", 
            "review": "Very informative. It's quite wonderful to visit such a well presented museum, with informative guides. This is especially so, when you can remember the event itself - it's history, but in your lifetime.Rather more expensive than the other museums we visited."
        }, 
        {
            "index": 24, 
            "rating": "5", 
            "review": "A definite must!. What an amazing experience! To be able to stand in the same theatres that the first heart transplant took place was truly incredible! The tour guide was incredibly knowledgeable and conveyed the exact feeling at that time. The people who are involved in the museum are passionate about what they do which makes it that much more special.They have 6 hearts on display including the heart of the first and second donors as well as the diseased hearts of two of the recipients. We only finished the tour 25 minutes after they had already closed and the tour guide was more than happy for us to wait. They even went the extra mile of organizing a taxi for international tourists. Don't miss out!!"
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "History in the making. At least two hours of fascinating detail. Very knowledge tour guide. It was extraordinary exactly what Christiaan Barnard's team achieved."
        }, 
        {
            "index": 26, 
            "rating": "4", 
            "review": "Amazing history well presented. This is a must if you are interested in medical history. The museum is located in the old main building of the Grote Schuur Hospital. The tour takes you though the original operation theatre where Christiaan Barnard performed the first heart transplant."
        }, 
        {
            "index": 27, 
            "rating": "5", 
            "review": "The museum is well designed for learning. The museum and tour guide conveyed the suspense and the problems involved in the first successful human heart transplant surgery very well. They treat the donor with special dignity and do a good job of explaining the ethical dilemmas that were involved."
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "Medical history lesson must. Very informative and fascinating. The tour is detailed and covers the background of Dr Barnaads journey to study in the states and his research in South Africa on his return and how this led to medical history being made...Definitely worth the trip. Made the trip with my Father in law who is a doctor and he thoroughly enjoyed it.Impressed with the tribute that was paid to the first heart donor, Denise Darvall.Plenty of letters on display from colleagues and people around the world following the first transplant.Worth the visit...."
        }, 
        {
            "index": 29, 
            "rating": "5", 
            "review": "Trace was the best. After a film about the first heart transplant we were shown round by Trace. She was very enthusiastic and proud to be from South Africa. She recited details quickly and in an interesting way. I was not sure about the silicon models used. Our group from N Ireland informed her that the defibrillator used in the operation was invented in N Ireland."
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Excellent tour. A must visit experience when in Cape Town - wonderful architecture as well as the historically significent Museum - great tour guides all added to a worthwhile visit - highly recommended."
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "Great Tour. The Heart of Cape Town Museum is located within the Groote Schuur Hospital in the original rooms where the world's first heart transplant occurred. Our excellent two-hour tour was conducted by the late Christiaan Barnard’s personal photographer and provided insight into Barnard’s rise to international acclaim, the donor of the heart, the recipient, and the ethical and moral implications that came up at the time. This was a particularly interesting experience for my wife, who has a medical background. While I do not consider it a “must do” in Cape Town, I found it to be an extremely worthwhile experience."
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "Best Museum in Cape Town. On the strength of other trip advisor reports we choose the Heart of Cape Town Museum for a visit and we were not disappointed, set in the original hospital building the conducted tour was first class it highlighted the achievement of Christaan Barnard. The guide, Trace told the storey in a very effective way combining the medical achievements and the personal life of the surgeon, the fact that you were in the original theatres where the transplants took place brought it home to you the pioneering aspect of the mans work. If you have an interest in medical matters it is a must"
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "My favourite museum in Cape Town. YAS A THOUSAND TIMES YAS. Go for the tour with the tour guide. I had a lady called Trace and she was superb at telling not only the story of Christiaan Barnard but those of the donors for the world's first heart transplant. Immensely proud of Cape Town's achievement, she recounts the story with great drama too. Also featured are the exact same operating theatres preserved, complete with old equipment, and silicone figures of the surgeons performing the surgery. The museum also honours the family of the first donor and in general has an extensive collection of newspaper clippings of anything concerning Groote Schuur Hospital. Might sound a bit dry, but no medical knowledge necessary. This is a story about the triumph and tribulations of humanity, the heights and depths of human nature."
        }, 
        {
            "index": 34, 
            "rating": "5", 
            "review": "One of the best Museums. This museum excells in telling the story of the historic First Heart Transplant in the World . Perfect on a rainy day in Cape Town or when the South Easterly Wind shuts down the cableway to the summit of Table Mountain."
        }, 
        {
            "index": 35, 
            "rating": "5", 
            "review": "The best museum and tour we've been to.. Wow! Seeing my history in this tour is both humbling and enjoyable. The tour is \"warts and all\", and encompasses the ethical issues, the great mans faults, and pays stunning tribute to the pioneer donors and recipients. You get to see the research laboratories, the wards, and all the operating theatres. First class, and worth every penny and more"
        }, 
        {
            "index": 36, 
            "rating": "4", 
            "review": "Very interesting. This hospital has a long and interesting history.Besides that Dr.Christiaan Barnard did the first open heart transplant here."
        }, 
        {
            "index": 37, 
            "rating": "4", 
            "review": "Informative, fascinating, worth doing. I took two overseas visitors there yesterday and all 3 of us thoroughly enjoyed the 2 hour guided tour. We were lucky enough to have Dr C Barnards own photographer as our guide and he had many funny and enlightening stories to tell us about what went on behind the scenes. Well worth the money for a 2 hour tour. Incredible to see how basic the equipment used was in those days and learnt a lot more about the donor and her family which we found particularly interesting as she is often forgotten about."
        }, 
        {
            "index": 38, 
            "rating": "4", 
            "review": "Fascinating history . We had heard a little bit about Cape Town being the first place in the world to undertake a successful heart replacement oppression, but didn't know much more than that. We stumbled across a leaflet for this museum and decided to go and we were very glad we did, and not disappointed. The guided tour of the actual building, operating theatres and presentation about the lives of the first patient, donor and their families and of course the work and family background of Christian Barnard the surgeon were told well. Our guide was someone who had been a close friend of Christian Barnard, and although in his 80's communicated an extraordinary level of detailed knowledge. We ended up we a feeling we had not just acquired dry facts and information it layers of personal detail and left us with much to think about.This is a living museum like no other we have visited. The visit and guided tour was a full two hours and needed to be to pack so much in."
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "Inspiring trip through medical history. This was a really unexpected delight and one of the most interesting tours I have been on for some time. I knew little of the first heart transplant and the balance of footage, replications of the operations and human stories involved really brought this alive. Fantastic way to spend 2 hours and learn about the people who helped make this incredible event happen."
        }, 
        {
            "index": 40, 
            "rating": "5", 
            "review": "History Captured. Great museum capturing this historic occasion in the now world famous hospital - very informative and well maintaned"
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "Excellent. One of the best things to do in Cape Town. Quite expensive for non South Africans, 300 rand, but up to half that for locals, which I agree with. You need to join one of the tours that run throughout the day and the get to wander afterwards. Our guide was most articulate, knowledgeable and engaging. You learn about Christian Barnard, the donors and patients and see the actual theatres. Fascinating. Historical. Go."
        }, 
        {
            "index": 42, 
            "rating": "5", 
            "review": "One of the most interesting museums I have ever visited. You don't have to be a doctor to thoroughly enjoy this visit. The visit consists of a 2 hour guided tour of the museum. The time flies by and there is so much to see and hear.The museum is located in the old original Groote Schuur hospital where the first heart tranplants took place. The original ORs have been staged exactly as they were during the first transplant in 1967. Madame Tasauds built models of the doctors and nurses to complete the life like appearance of the ORs at the time of surgery.The tour focuses on the intricate details of the events leading up to the first heart transplant and also includes detailed accounts of the lives of the surgeons , the patients and the donors.Truly one of the most interesting museums I and my family have ever visited."
        }, 
        {
            "index": 43, 
            "rating": "4", 
            "review": "Never knew Barnard was so controversial. Well worth 2 hour tour of recreated operating theaters along with life like models. Story of how 1st transplant came to be and how revolutionary as well as controversial not just because it was a 'heart' but also the professional jealousies. Reading letters from around the world describing his success and genius was fascinating. Want to learn more. Married women younger than his children 40+ yr differences. Tricky to find, be sure to enter museum name and go to Groot not namesake hospital downtown."
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "Worth a visit. Excellent museum - lots of information and wonderful, helpful and informative guides. The museum explains step by step the events of the first heart transplant, not only focusing on Dr Christian but also everyone else that was involved."
        }, 
        {
            "index": 45, 
            "rating": "5", 
            "review": "Excellent Information and Presentation of History. The Heart of Cape Town Museum is located at the Groote Schuur Hospital and requires a taxi or car, since it is not in the central business section of Cape Town. It is well worth the visit, as the tour guides are very knowledgeable in both the scientific, medical and personal lives of those involved with this piece of history. There are many facts and situations that led to the first successful human heart transplant. Coming from Minnesota, I was not aware that Dr. Christian Bernard received his surgical certification from the University of Minnesota, as well as ongoing research funding when he returned to South Africa. We learned how factors of apartheid, governing laws and local cultures heavily influenced each step of the way. We were also blessed to meet Dr. Cecil Moss (born 1925) who was visiting the museum while we were there. He was part of the medical team (anesthesiologist) who removed the heart from the first heart transplant donor, Denise Duvall. This experience was one of the highlights of our one month tour of South Africa and should not be missed."
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "Fascinating reliving an incredible medical breakthrough. The exhibition is in Groote Schoor Hospital in the exact area where the transplant took place.. It starts in the emergency room and moves through to the operating theater and onto the wards. Very well done and very informative"
        }, 
        {
            "index": 47, 
            "rating": "4", 
            "review": "\"The Heart\". An historical site one should definitely visit, the Heart of Cape Town Museum is one attraction that should not be missed, it gives a glimpse into the work of Dr Christiaan Barnard and his Human Heart Transplantation. Worth a visit ."
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "At the heart of it all. A historical site one should definitely visit, the Heart of Cape Town Museum is one attraction that gives a glimpse at the pioneering work of Dr Christiaan Barnard and his travails as he revolutionized Human Heart Transplantation. Back in the day when this field of medicine was relatively experimental, the Museum documents the lives and fates of the first few heart transplant patients and the circumstances that led to this revolutionary and now life saving technique. This is one attraction one must visit when in Cape Town not just for its historical importance but for its medical pioneering breakthrough as well."
        }, 
        {
            "index": 49, 
            "rating": "4", 
            "review": "Fascinating tour even for those without a medical background!. Our guide, Christine was extremely knowledgeable... you could spend an entire day just looking at the various displays! Go for the morning tours if you plan to spend more time in the museum. Caveat: It looks like they increased the prices AGAIN and it's now R300 per person for international visitors and R150 for South Africans and students. A bit hefty in comparison to other museums within the city that go for a tenth of that price."
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "Brilliant. So worth a visit. You get to see where it all happened. Nowhere can you see where the first heart transplant took place. Guides very good."
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "A fascinating story bought to life!. We both really enjoyed this tour. Allan, the guide, was very knowledgable and made the story come to life. The tour is held in the rooms where the events actually took place. My husband is not medical and to his surprise enjoyed the tour as much as I did. They really focused on the human side of the story and the personalities of those involved. Christian Barnard was one of those exceptional characters, flawed, but brilliant! If you are inclined to go you will not be disappointed."
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "Informative and moving. We were lead around by Allan who was a great guide! He set the scene at the start giving technological, political and medical context to the heart transplant discovery. We learned about the human side of Christiaan Barnard as well as his extras primary determination and skill. The museum has very life-like wax works of the key people involved including Christiaan and the heart first donor heart recipient, Louis W. Christiaan's was modelled on his son who has a very strong facial resemblance and so it's almost as if Christiaan is in the room with us! Allan (our guide) was fascinating be in the way he portrayed the events and how Christiaan Barnard's life changed. We did this on our last day before leaving Cape Town. Highly recommended to anyone interested in science, medicine or the human spirit."
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "Medical milestone. Great museum with the details of the surgery and the operating theatre so life like and the equipment so accurate. Good movie of the events w interviews, good guide, lots of interesting photos, letters etc. Prob more interesting as we are medical people, but most people would be in awe."
        }, 
        {
            "index": 54, 
            "rating": "5", 
            "review": "Wonderfully educational tour. A tour that passed all expectations it told the story of Chris Barnard and his team in the heart transplant programme wonderful tour guide in Alan. This was such an amazing milestone in medicine it is only right that it continues to be remembered"
        }, 
        {
            "index": 55, 
            "rating": "5", 
            "review": "This was probably the Highlight of our stay !. We had a Special tour for a Group of Doktors ! But i think it were the normal presenters who really brought US back to the First Heart transplant Operation in the World.great done with a Film with Mr. Barnard !"
        }, 
        {
            "index": 56, 
            "rating": "5", 
            "review": "All in a heart beat... Making \"flat line\" history!. All I can say is \"WOW\"... This is an awesome piece of South African medical history. The museum is well laid out and the exhibitions are fantastic. The resident site guides are brilliant and very knowledgeable. Even if you are not that \"medically\" inclined, it tells the story of human triumph over tragedy. Quite a moving experience, as there are many unsung heroes behind the scenes. Highly recommended!"
        }, 
        {
            "index": 57, 
            "rating": "5", 
            "review": "Heart Beats. I have been at this venue quite a few times already and am always excited to be there. Very educational."
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "First heart transplant. So interesting to visit the hospital and indeed operating theatres where the first heart transplant took place. Amazing life size models of Christian Barnard and others involved the historic medical event."
        }, 
        {
            "index": 59, 
            "rating": "5", 
            "review": "Interesting History. Neat little tour that covers the history and events of the first heart transplant. Was worth the 200R (equivalent of $14). My daughter loved display of actual hearts from transplant patients. Tour guide was excellent and extremely knowledgeable....even to a doctor like me"
        }, 
        {
            "index": 60, 
            "rating": "5", 
            "review": "Well worth a visit. Interesting tour with guide around 2 hours. See the original operating theatres, instruments etc. silicon dummies to represent surgeons and patients etc. well worth a visit."
        }, 
        {
            "index": 61, 
            "rating": "5", 
            "review": "A must for all surgeons who visit Cape Town,,,,,,. When I was visiting Cape Town , I had the good fortune to visit this not-very-well-known attraction, The Heart of Cape Town Museum. This is a museum complex in the Groote Schuur Hospital on Main Road in the Cape Town South Africa. The hospital was founded in 1938 and is famous for being the institution where the first human heart transplant took place, conducted by University of Cape Town-educated surgeon Christiaan Barnard on the patient Louis Washkansky in late 1960 s. The entrance fee inclusive of the guided tour, which takes two hours, is 200 Rand per person , and the guided tour was done by a well-informed nice lady who was ready answer all my questions.You can see the original rooms where the first heart transplant surgery occurred. It utilizes the same operating theaters originally used in December 1967 when Denise Darvall and her mother were rushed into the hospital after being struck by a vehicle. The theaters contain ancient equipment, complete with life size wax figurines of the surgical teams in two theaters, and Dr Baarnads office. Then there is a shop for memorabilia and souvenirs.Being a Surgeon, I really felt the challenges faced by Dr Barnaad, nearly 50 years ago, with the primitive equipment at his disposal, with very little knowledge of what surprises and nightmares to expect.The guided tour includes a film show, and you can see so many items related to the first transplant, including the anesthetist’s notes.I recommend this place to all surgeon , and I am sure they will go through the same emotions I went through.."
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "Very good and interesting experience.. I found this hospital a very unique experience and good value in my opinion . I would not hesitate to recommend a visit here."
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "Excellent museum and tour. This unique museum, situated in a working hospital, tells the story of Chrstiaan Barnard and his team, which carried out the world's first heart transplant operation. There is an extensive range of photos, documents and videos, but most impressive are the life-size silicon figures of the operations in the theatres actually used in 1967. The hearts are also there! The visit consists of a 2-hour guided tour - we had a very informative and engaging guide (Trace) - and you are free to look around afterwards to take in the detailed information. There is an interesting movie and plenty of anecdotes. This is an excellent tour, which I would strongly recommend. It is under-rated on the list of things to do in Cape Town."
        }, 
        {
            "index": 64, 
            "rating": "5", 
            "review": "Unique subject & a fascinating tour. The subject of this museum is unique – there can only ever be one first heart transplant.Access to the museum is by guided tour and my guide was a terrific storyteller. The exhibits include lifelike silicon figures reconstructing the scenes in the actual operating theatres used for the transplant. The background to the transplant and Christian Barnard’s life are also covered in the tour. The whole 2 hours was fascinating.Different entry prices are charged for South Africans and other nationalities but that is fair enough. It’s still not expensive if you are a foreigner (R200 when I went) and considering that covers a guide for 2 hours in a small group it’s good value.I got to and from the museum by public transport using the MyCITI bus, with a 20 minute walk from the bus stop (catch route 102 heading towards Salt River Rail and get off at Upper Salt River stop)."
        }, 
        {
            "index": 65, 
            "rating": "4", 
            "review": "The first human heart transplant happened in Capetown. Taxi driver had to ask another driver where the museum was but worth the trip. Good tour and life like figures help tell the story of the first human heart transplant."
        }, 
        {
            "index": 66, 
            "rating": "5", 
            "review": "Wonderfully Informative & Fun. This relatively little known attraction is housed in the main hospital precisely where the first heart transplant ever took place. You walk through the entrance used by the unfortunate donor and browse the actual surgery (complete with original equipment) - the dummies make it seem very realistic. The tour is guided by a knowledgable and friendly person who explains many interesting facts. Some of the subsidiary stories are amazing too. I am critical of \"narrow\" subjects being over done but this is not one of those occasions - it is truly a remarkable historical attraction not to be missed."
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "Best of Cape Town. If you are a physician you cannot leave Cape Town without visiting this masterpiece. For anybody with an interest in history or medicine it is equally fascinating.The museum is located at the Groote Schuur hospital and starts off with the triage room in the ER where the donor was brought in after her accident. From there on it is an incredible story of the man and his science. It is hard to believe that it was almost 50 yrs ago. Overall not much has changed in the technique since then.The tour guide was extremely knowledgeable, having worked in the hospital as a nurse before. The photographs, letters, accolades that poured in are all a slice of history that the world may have forgotten. Some parts of the tour may not be for the squeamish. The recreation of the OR is minutely detailed, up to the blood spatter on the surgeon's cap and the blackboard that is so ubiquitous in every OR in the world. The skill of Dr. Barnard is evident in the autopsy specimen of the donor heart that is on display. It is truly an astounding tale and well told, deserves to be heard and seen. A wonderful tour that is unparalleled anywhere else in the world."
        }, 
        {
            "index": 68, 
            "rating": "4", 
            "review": "A Beat of History. The morning we wanted to tour the museum, a school group had all the spaces booked. However, our tour guide arranged for a slightly earlier private tour, which worked out well. One of the first displays had a dog on an operating table. My younger brother freaked out when he saw this; he doesn’t do well with blood and medical things. So, it ruined the tour for him, and my dad who had to stay with him to console him. My mom and I continued on the tour. There were many interesting letters and documents, and you really got a sense of the drama that unfolded for this surgery to happen. I really loved the letters kids wrote to Dr. Barnard. There are also displays portraying the actual operation, situated exactly where it happened. Very informative and interesting tour, but maybe not good for squeamish children."
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "Best activity on a rainy day . The museum tour turned out to be super interesting! Although I am personally not much into medicine, the tour guide caught my full attention for the whole tour!"
        }, 
        {
            "index": 70, 
            "rating": "5", 
            "review": "Heart transplants. I am a recipient. Having had a heart transplant almost four years ago. I was privileged to see where it all began. The museum is well laid out in the original theater where the first transplant was performed. It is a two hour guided tour. Our guide was well informed and was happy to share her knowledge. The models were extremely lifelike. We worth a visit"
        }, 
        {
            "index": 71, 
            "rating": "4", 
            "review": "School outing available to all; highly recommended. I accompanied my son's grade 6 group on a school outing and I am pleased I did. This tour/museum has an overwhelming amount of information, not only about the heart transplant but also about the current affairs at the time. The movable silicone \"people\" made by Madame Tussaud's is extraordinary and the displays are fascinating. The original operating theatres and equipment is a well done exhibit. The candid interview with Mr Christiaan Barnard will surprise you. Everyone learnt a lot and the facility was better than expected."
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "3rd December 1967 - Chris Barnard successfully transplants the first human heart. After my teenage daughter went on a school outing to the museum, she told us about the experience and how much she enjoyed it. She also wanted to take her school friend there and Gran and I went with and decided to take the tour as well.I always knew Chris Barnard did the first human heart transplant but today I was transported back to December 1967 when it happened. To the heartbreak of the family who lost a mother and daughter and subsequently to the very ill recipient who had a chance to live a better life.Our guide and the manager of the museum are very passionate people and we thoroughly enjoyed the experience. Thank you . ***Students and pensioners pay half price."
        }, 
        {
            "index": 73, 
            "rating": "5", 
            "review": "Very Informative Tour. A great wet day activity in Cape Town.Really interesting tour of the actual theatres where the first heart transplant was performed.The tour gave great insights into the personalities involved - especially the team involved that never made the headlines.Perhaps not for young children but a great place to visit.Thanks to the tour guide for a great tour."
        }, 
        {
            "index": 74, 
            "rating": "5", 
            "review": "World's first heart transplant. The tour guide was fantastic. Seeing we were there with younger children (7 and 9 years) she gave us a private tour that was shorter than usual and catered to our family. Very informative and interesting for all of us."
        }, 
        {
            "index": 75, 
            "rating": "5", 
            "review": "Touching History. WOW! A rainy day in CApeTown!! Unusual but gave us the opportunity to discover this gem. A beautifully presented account of Christian Barnard and his team's first and subsequent heart transplant successes. Superb guide and to walk in the operating theatre as was used for both donor and recipient - incredibly emotional experience and thoroughly worth a visit. Capetonians should be immensely proud - I love this city!!!!!!!'"
        }, 
        {
            "index": 76, 
            "rating": "5", 
            "review": "Goosebumps. What an amazing experience. Just shows you what can be done with hard work and determination. It is also very special to see the tribute that they did to the donor, Denise Darvel. Highly, highly recommended!!!"
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "Fascinating two hour tour. I went on the two hour tour of the Heart of Cape Town Museum which is a museum totally dedicated to Christiaan Barnard and his work on heart transplants. The docent guide, Trace, was fantastic and fully knowledgeable. The exhibits and re-creations of the actual operation facilities were excellent. Given that I have no medical background, I felt I came out much more informed and saw something that is probably not available anywhere else."
        }, 
        {
            "index": 78, 
            "rating": "5", 
            "review": "Best museum in Cape Town. Never have I walked out of a South African museum feeling so proud to be a South African as when I did after the tour my family and I did this past weekend. The tour guide was absolutely great, well informed and passionate! She kept our 6 and 8 year old kids fascinated throughout the two hour tour.The history of the world's first transplant is beautifully and thoughtfully displayed and one could easily spend a whole day there.Thanks for preserving this part of our history!"
        }, 
        {
            "index": 79, 
            "rating": "5", 
            "review": "An absolute MUST while in Cape Town. December 3, 1967 has been etched in my life as the day that Christian Barnard performed the world's first heart transplant. I have read most of Barnard's books and books written about him. To say the least he was an extraordinary person. Maligned by some and loved by others.This was my second visit, the first being in 2010 and the second in January of this year. It did not disappoint. Could have spent hours here. The volunteer that day was an amazing fellow who had not only met Barnard but his brother Marius as well. It was a trip back in time. Extremely informative. Even the hearts of the donors and recipients have been preserved and and operating theaters have been lovingly reconstructed.An absolute must for anyone interested in a great piece of medical history."
        }, 
        {
            "index": 80, 
            "rating": "4", 
            "review": "16 day tour of South Africa. Well worth a visit to see about the history of South Africa and it culture together with a great exhibition about Nelson Mandela."
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "Could not believe 2 hours could pass so quickly. We arrived a little early but we were welcomed very warmly. We were astounded that the 2 hour tour was over so quickly. We did not even rush away then as we were so absorbed in the story. Brilliant narrator and learnt so much."
        }, 
        {
            "index": 82, 
            "rating": "1", 
            "review": "Great tour, but double standard are not appreciated.. Lets start by saying that this tour was really good. The guide was well informed, friendly and extremely good at what she does. The exibits are first class and really well presented. This was possibly one of the best history musuems I've visited.There is something that bothered me though. Right at the start of the tour when paying they make no excuses that people from different countries has to pay double than what is expected from South Africans. They feel absolutely no shame in doing this and do not even try and hide the fact. This is down-right wrong.Troughout the tour they kept on saying that apparteid was bad and that Barnard believed all to be equal. That there was no difference between a black heart and a white heart.However these people believe that there is a difference between a US / European wallet and a South African wallet.When confronted about this they claimed people do it everywhere and if Hong Kong can do so can they. I am sorry to say but I was ashamed of being a South African during my visit to the heart musuem."
        }, 
        {
            "index": 83, 
            "rating": "5", 
            "review": "Superb. I've reviewed this under Groot Shurr Hoopital (sic). So in brief this place should not be missed. The staff were very friendly and knowledgeable. The place itself was at the cutting edge (no pun intended) of medical care not so long ago."
        }, 
        {
            "index": 84, 
            "rating": "5", 
            "review": "Don't miss this gem. Booked the tour by phone when in Cape Town. The man there was so very helpful. The tour took a couple of hours and the guide really knew her stuff. This museum gets no government support and deserves every help we can give. Don't miss this gem."
        }, 
        {
            "index": 85, 
            "rating": "5", 
            "review": "Excellent guide. As a doctor, I really was interested in visiting the place of the first heart transplant. Cost is R100pp. the building is absolutely gorgeous. The museum is extremely well maintained and informative. The best however, was the guide. World class. Definitely worth 2 hours of your time in cape town."
        }, 
        {
            "index": 86, 
            "rating": "5", 
            "review": "Excellent tour!. As a doctor, I really was interested in visiting the place of the first heart transplant. Cost is R100pp. the building is absolutely gorgeous. The museum is extremely well maintained and informative. The best however, was the guide. World class. Definitely worth 2 hours of your time in cape town."
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "Cape Town holiday.. We drove by Groote Schuur hospital on the way to our hotel.Best known for the world's first heart transplant carried out by Dr Christian Barnard."
        }, 
        {
            "index": 88, 
            "rating": "5", 
            "review": "Very interesting!. We are regular visitors to Cape Town and had never visited this museum before. We were so glad that we did this time. It is situated in the old Groote Schuur Hospital building and is well signposted. On arrival we were met with a friendly greeting and there is plenty to look at whilst waiting for the tour to start. The tour consists of viewing a couple of videos to set the scene and then being taken into the original operating theatre and recovery room. There are silicone figures of Christiaan Barnard and the operating team, including one of the patient who was the recipient of the first heart. They are so lifelike it was amazing! Our tour guides were both informative and passionate about the museum. It is fascinating to see all the notes and the original hearts used in the transplants. I would like to return as there is a lot of information to read and look at. Worth the visit!"
        }, 
        {
            "index": 89, 
            "rating": "5", 
            "review": "Well worth seeing. A very well run two hour tour of the sight of the world first heart transplant with all the history well explained.Well worth the entry fee and the trip to the slightly out of the way location"
        }, 
        {
            "index": 90, 
            "rating": "4", 
            "review": "Must visit Museum. You should definitely go to this museum if you want to know about the history of Cape town and what the Capetonians have been through over the years. Racism is such a cruel thing - you really understand here!"
        }, 
        {
            "index": 91, 
            "rating": "5", 
            "review": "Museum Not To Be Missed. I was fascinated that I could learn more about the first human heart transplant but not expecting a much as was there. I was the only one there for the 9 am tour and Trace gave me the best personalized tour. The exhibits are fantastic from the room where the heart was removed from the donor to the room where the heart was transplanted into a human body. So many documentary items, photos, stories about Dr. Christian Barnard - definitely worth a visit to the museum. And they do provide free shuttle service. Peter is the coordinator of the place - what a delightful man. The book \"Every Second Counts\" documents the race among 4 doctors (3 in the US and Dr. Barnard). That event changed so many lives in the future for heart transplants - now becoming a somewhat normal occurrence."
        }, 
        {
            "index": 92, 
            "rating": "4", 
            "review": "Where it all began!. Really well organised transplant museum, centred around the actual operating theatre where Dr Barnard performed the world's 1st heart transplant"
        }, 
        {
            "index": 93, 
            "rating": "5", 
            "review": "Surgery as it was in the sixties. We had an excellent guide who really enthused us about Christian Barnard and his route to becoming the first successful heart transplant surgeon, much to the chagrin of the American medical fraternity. We enjoyed a short video of Barnard and then proceeded to visit the actual operating theatres,being two adjacent theatres, one for removal of the deceased's heart and the other where it was inserted into the patient. The theatres are set up with realistic replicas of the people involved (made by the UK Madame Tussauds modellers), providing an eerie reality to the experience. There are also many photos and letters of the time attesting to his deserved fame and celebrity.This was an excellent exhibition well worth the time and fee."
        }, 
        {
            "index": 94, 
            "rating": "5", 
            "review": "Best medical museum. This is a museum like no other. Fantastic. Christiaan Barnard undertook the world's first heart transplant (dec 3rd 1967) in the operating theatres at Groote Schuur hospital in Capetown and here you will be present in the actual operating theatres with all the original equipment and every member of the team actually undertaking their task, all recreated by Madam Tausauds in rubber rather than wax because of the heat in South Africa. Barnard is about to defibrillate the heart he has just inserted.This museum honours the skill and wisdom of the transplant team, the courage of the recipient, the generosity of the donor's father and the memory of the young donor herself.The guided tour takes 2 hours with one of the most knowledgeable guides I have ever metYou do not have to be a medic to really appreciate this visit. Leaflets in most hotels."
        }, 
        {
            "index": 95, 
            "rating": "5", 
            "review": "A Cape Town \"Must See\". You MUST make time to visit this museum! Our tour guide, Trace brought the whole story to life and gave the tour a very personal feel. The museum is full of items and pictures (including a pair of Dr. Christian Barnard's theatre boots) which really tells the story of the medical world's fist successful heart transplant in 1967. Do not miss this Cape Town attraction!"
        }, 
        {
            "index": 96, 
            "rating": "5", 
            "review": "Best public hospital in Cape Town. For a public hospital it is marvellous. Of course the waiting time is long, but it is always long in ANY hospital, even at times in private hospitals.The treatment is excellent and very efficient. No corners are cut.All in all, Groote Schuur, which was the hospital where Christiaan Barnard pioneered the first heart transplant, is a superb hospital."
        }, 
        {
            "index": 97, 
            "rating": "3", 
            "review": "Heart transplant museeum. Pretty expensive (200 Rand) but very interesting. Can be visited only with a tour which is a bit to long (2 hours - one would be enough). takes you to the original operating theatre"
        }, 
        {
            "index": 98, 
            "rating": "5", 
            "review": "Excellent doctors, hope you don't need to go there. World class (Galaxy class?!) doctors. B not a fancy hospital. You will get great medicine, good nursing, horrid wards and food. Get well soon!"
        }, 
        {
            "index": 99, 
            "rating": "4", 
            "review": "Inspiring. A very worthwhile and informative tour documenting the worlds first heart transplant. Friendly and enthusiastic staff."
        }, 
        {
            "index": 100, 
            "rating": "4", 
            "review": "A fascinating few hours. Despite the slightly higher than average attraction price I thoroughly enjoyed this tour. The female guide was informative and the displays well thought out. It was both educational and enjoyable. A quality experience that you don't need to be in the medical profession to enjoy. Felt very real not over staged."
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "Best breakfast. Really lovely, fresh breakfast. I have be for breakfast more than once. Staff super friendly, superb breakfast all round"
        }, 
        {
            "index": 102, 
            "rating": "5", 
            "review": "Very well Balanced and informative but not for everyone. As both a Nurse who worked in an operating theater in 1965 as well as having a family member who is a transplant recipient... we wanted to visit this Museum. It is well worth the two hours we spent there. The guide was very well informed and the Museum not only reflects the transplant from the medical perspective but from the community and family perspectives as well. They do not try to gloss over the egocentrics of Christian Bernard but I think presented him in a very balanced light. The world reactions are well represented and quite frankly I had forgotten the extremes of peoples feelings about the event. Very happy that we went. The man at the desk who greeted us is just a gem (as are many people here). We felt welcomed and warmth from the very start. Just walking through the walls and floor tiles carried me right back in time.....I am not sure that a person outside of medicine would gain as much from the authentic recreation of the operating suites but still and all would learn a lot."
        }, 
        {
            "index": 103, 
            "rating": "5", 
            "review": "I went to meet someone. I had a meeting in the IT section to see their solution for patient records.And wanted to see where in 1967 Dr Barnard did the first Heart transplant"
        }, 
        {
            "index": 104, 
            "rating": "5", 
            "review": "Informative. Good place to look back in history, with well laid out sets and artifacts. Good atmosphere where you do not feel the need to rush around."
        }, 
        {
            "index": 105, 
            "rating": "5", 
            "review": "Excelletn. Josh just love it educational and full of fun. Lot of questions were ask by my son and lots of laughter."
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "Awesome medical history. Make time for this amazing, informative and totally absorbing tour. You will be surprised how much information the brilliant tour guide tells you from the tragedy of a young woman's accident to the skill of making use of her heart for transplanting into the very first heart recipient, becoming a celebrity just by the fact of his operation. How Dr Christiaan Barnard would have marvelled at the many skills that today's heart surgeons are able to perform and the many, many years that all those patients are now surviving due to him, being the maverick that he was and the loophole in the South African law making the whole beginning possible. The many operating theatre models and Barnard in his office are stunning and very lifelike, as are all the various other exhibits and photos. You may be surprised at how interesting this exhibition is considering the tragic nature of how it had to begin with the death of someone to give life to someone else but that is what makes the whole subject absorbing. Take the time to be fascinated with a very different kind of tourist attraction."
        }, 
        {
            "index": 107, 
            "rating": "5", 
            "review": "Very Interesting History of the First Heart Transplant. There is so much information that you will not be able to take it all in. It is very cool seeing the actual first diseased heart and the donor heart on display. It is really awesome to be able to see some of the original equipment and the actual locations where this all took place."
        }, 
        {
            "index": 108, 
            "rating": "5", 
            "review": "This museum is incredible!. This museum is a hidden gem in Cape Town. As two medical students we loved it. The tour was very informative. We saw the actual hearts that were transplanted and the actual theatres in which the transplant took place. We learnt with great respect about the girl and her family who made this possible and the history behind the race to be the first surgeon to perform a transplant. We were allowed to spend time afterwards going back through the museum and reading all the information (as we did the tour with a large school group!). The letters (good and bad) written to Dr Barnard are a good read. I can't encourage you enough to make time for this!"
        }, 
        {
            "index": 109, 
            "rating": "5", 
            "review": "Interesting. It was so interesting learning about and seeing the place where the first heart transplant took place! A great museum to add on your trip to Cape Town!"
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "A most enlightening two hours. As a nurse and transplant recipient I have an interest in this subject but wondered how they would fill the two hours. We had seen the tour advertised on our hop on hop off bus tour. And as holders of the bus tickets we were given a free transfer to and from our hotel to the hospital. The exhibition and tour is excellent. With life size exhibits and short films to watch you need longer than the actual tour to read everything on show. The exhibit has managed to maintain the human element behind this major breakthrough in medical history. They tell the story of the young girl who became the first donor, the background of the man who was the first recipient and the incredible life story of Dr Christiaan Barnard. Well worth a visit."
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "A part of really important history is brought to life.. We had done all the other famous tourist attractions in and around Cape Town, when I came across this on Trip Advisor.  This turned out to be one of the highlights of our holiday. My wife's a nurse, my aunt had had a heart by pass a couple of years ago, so it seemed like a plan. Uncle Billy and I have no interest in things medical in the the slightest, but this was something different. The lady taking the tour was interesting, informative, well organised and very knowledgable on all things concerning Dr. Christiaan Barnard's life and his historic first ever human heart transplant.The tours starts with a video of Dr. Barnards life and that historic moment. Then there are a number of very realistic models in the actual operating theatres where the first transplant took place. All is explained by a very competent tour guide, who is always happy to answer any questions. Well worth it, you will be so surprised and glad you went to Groote Schuur Hospital."
        }, 
        {
            "index": 112, 
            "rating": "5", 
            "review": "Favorite museum in cape town. Museum is well done with very knowledgeable docents. Take the two hour tour. There is not a dull moment, all very interesting and well put together."
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "TheSouthAfrican review. My fatger had a heartattack and only the best service was given for this world famous heart specialist hospital. This great service from a public hospital is unprecedented and should be ranked as a world number one for friendliness and professiinalism"
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "World's first heart transplant museum. My family and I visited the Heart of Cape Town Museum this holiday while in Cape Town.We mainly went for my niece who handled the subject about Prof. Chris Barnard and his pioneering heart transplant surgery in an assignment during the academic school year.I was really impressed by this guided tour.Being a somewhat of a historian myself,I really enjoyed the way Prof. Barnard's life was described and \"exhibited\". He was a remarkably intellegent man ahead of his time.After visiting the museum and pondering on his life and passion for his work,one is left with a strong sense that he was \"chosen\" or \"called\" to this profession.The re-enactment in the operating theatres and other exhibits are life like and the whole tour is well presented and professional.Thank you Christine for your passion and wealth of information.A tour I would highly recommend to all whom are interested in medicine and history in some way or another."
        }, 
        {
            "index": 115, 
            "rating": "5", 
            "review": "Fascinating!. Suspenseful story of the race to the first heart transplant, including the events that led up to the momentous procedure and followed it. Also, fascinating look at the the complex man behind it, Dr. Barnard. So many interesting facts and details. I learned a great deal and enjoyed every part of it. I recommend the tour for anyone with an interest in medicine or biographies.Trace delivered excellent presentations and I also especially liked the photos and articles in the lobby (Dr. Barnard and Golda Meir drinking and smoking) and the exhibit of letters that he received post-procedure.The manager of the museum was kind enough to give me a ride after the tour."
        }, 
        {
            "index": 116, 
            "rating": "5", 
            "review": "FANTASTIC !!!. This is a must do when you are in the Cape region.The atmosphere of the late sixties comes alive and the importance of the medical progress can be felt on the spot.We loved the way the museum was promoted by the people working there and were very touched by the individual approach."
        }, 
        {
            "index": 117, 
            "rating": "5", 
            "review": "A real education. Our final morning prior to returning home was spent at this Museum and we were given a comprehensive 2 hr tour by an experienced guide.Personally speaking, it was a very informative visit and significantly enhanced our knowledge of the first human heart transplant undertaken in 1967. The mock ups of the operating theaters, equipment used at the time, videos, and newspaper clippings of the landmark event all contributed to a highly enjoyable visit.A \"must see\" for all visitors to Cape Town"
        }, 
        {
            "index": 118, 
            "rating": "5", 
            "review": "A unique experience not to be missed. Buying a \"hop-on hop-off\" bus ticket allowed free transport to this museum. We were collected from the V&A waterfront bus stop by the manager of the museum who took us via the spot where the donor of the first heart transplant was tragically killed. From there it was to the museum where we had a fascinating 2 hour tour of the small museum led by a very well informed guide who certainly knows how to tell a story.The fact that life sized mock ups of the donor and recipient operations are presented in the actual theatres where the operations took place, together with much of the original equipment, gives a real sense of history. And the wax models of the operating teams are so life like that you almost expect Barnard to say \"scalpel please, nurse\" (although by all accounts he may well have omitted the \"please\"!)What is really fasciniating is the background of the development of the techniques and particularly the political and ethical background. Mixed in with this are the very human issues about the way the early transplants affected the patients and the families involved. It also tells the story of Barnard basking in the fame and what happened to him in later years.This is a truly unique insight into one of the most momentous developments in medical history. Cape Town has much to offer but if you only have time to do one thing, visit this museum."
        }, 
        {
            "index": 119, 
            "rating": "5", 
            "review": "Heartfelt Homage. as a young man growing up in the 60's there were world shattering events that took place, one of which was the 1st heart transplant. I wanted to see for myself the official story of this 1967 event and was not at all disappointed with this visit. You are taken through the story of the event - with a particular recognition of the donor's family after she had been killed in a street accident.If you are studying cardiac sciences or have an interest in this event - dont hesitate to make the visit - it's truly amazing"
        }, 
        {
            "index": 120, 
            "rating": "5", 
            "review": "Found by accident but what a find. Tells the story of the first Heart Transplant Surgery carried out by Professor Christiaan Barnard in 1967. Well told and well displayed at the Groote Schur Hospital. Our Guide was excellent"
        }, 
        {
            "index": 121, 
            "rating": "5", 
            "review": "one of the best museums I have visited. Great tour! The museum is located on the original grounds and still has the original equipment The tour is very informative - highly recommended"
        }, 
        {
            "index": 122, 
            "rating": "5", 
            "review": "Do not miss this if you visit Cape Town, excellent!. What a brilliant place to visit one of the most memorable parts of our visit to Cape Town. If you have been on the red bus tour the museum will pick you up for free from your hotel. Otherwise a pick up is 50 rand per person. A lovely man call Pieter picked us up and like him, the rest of the tour was wonderful. The lady who does the tour said she was a lowly lab assistant but her knowledge was incredible, even a young cardiologist on the tour from Brazil, was impressed by this lady. It is not a stuffy tour but starts with the fatal accident involving the young girl who donated the first transplanted heart. Pieter actually stops at the exact spot where this happened. What really impressed me was how she is remembered together with everyone else. A truly moving experience"
        }, 
        {
            "index": 123, 
            "rating": "5", 
            "review": "Well-done!. Having gone to other \"museums,\" in the area which we thought were sub-par, we were, at first, skeptical about this one. What a pleasant surprise!This was a high-quality experience. The displays are rich with materials and very informative. Our docent, Christine (?), was excellent - knowledgeable, thorough, entertaining. Those interested in the topic will really enjoy it, and they may want to spend more than the allotted time more closely examining the content. The short movies are also excellent.Groote-Schuur Hospital's museum restored our faith in Cape Town museums and was the highlight of our afternoon. Thank you!"
        }, 
        {
            "index": 124, 
            "rating": "5", 
            "review": "amazing museum and guided tour. A completely unexpected and fun tour. So great to focus on great achievements from South Africa - even crossed racial lines. Fun to learn about something cool that has history as a back drop."
        }, 
        {
            "index": 125, 
            "rating": "5", 
            "review": "Not on everyone's list of Cape Town attractions but it should be.. We were ambivalent about a visit to the Heart of Cape Town Museum but are really glad we did visit. The two hour tour was packed with information about the operation, the donors and patients and Dr. Barnard. Also very interesting was the material about the \"race\" among doctors around the world to perform the first heart transplant and the legal and ethical hurdles faced by many of those doctors, including criminal prosecution. The operating rooms and the medical equipment feel a little quaint now but we still got a good sense of how significant this first operation was. This museum should be at the top of every itinerary."
        }, 
        {
            "index": 126, 
            "rating": "5", 
            "review": "Heart touching. We visited on 21 October, with our 17 year old. The information is overwhelming, including medical records and photos. The guided tour is 2 hours, and an absolute must do. The personal information provided gives you an insight into the people involved lives, including the first and second donor's lives. There are some scarily real \"dummys\" which add to the realism of everything. Tracey, our tour guide was incredibly professional and knowledgeable. A wonderful experience."
        }, 
        {
            "index": 127, 
            "rating": "5", 
            "review": "A Must Do. We visted the Heart of Cape Town Museum and were absolutely delighted that we did. We were picked up at our hotel and taken back at no cost (service provided if you have been on the hop on hop off bus). We stopped en route and shown the location where the young lady whose heart was used in the first transplant was killed. The museum guide was very knowledgable.The tour lasted for 2 hours but we could have stayed longer looking at the excellent exhibits. The displays were very life like. This museum would be enjoyed by all not just by people with a medical background. I cannot recommend this museum and staff highly enough. A\"must do\" whilst in Cape Town!"
        }, 
        {
            "index": 128, 
            "rating": "4", 
            "review": "christiaan barnard museum at the groote schuur hospital. ?.....I would not go there as a patient.... But, what one should see is the CHRISTIAAN BERARD Museum. Very very interesting and worth every penny."
        }, 
        {
            "index": 129, 
            "rating": "5", 
            "review": "Highly recommended. I would highly recommend visiting this museum. The guide Trace was excellent: she gave a lot of background information and at the end of the tour we had a far greater understanding of the surgery, families and challenges. The exhibits are excellent. This museum would be enjoyed by all.- Good explanations make it simple to understand. For those wanting in-depth medical details there are many charts for viewing. Its also a great tribute to the standard of medicine in SA."
        }, 
        {
            "index": 130, 
            "rating": "4", 
            "review": "Very Enlightening and Great Appreciation for the Medicine Profession. Accompanied my daughter on a school trip to this museum. Blown away by the wax models flown in from Madam Tussards. There were very good displays of the first people who were involved in the first heart transplant, incl. the equipment which made the entire scenario look very real. The displays of the hearts were very good as well. The guide was informative but could have been more hospitable.This museum was a good ambassador for the medicine profession. This museum should be visited by young and old, local and tourists, the youngsters especially as this could a motivational factor from a career perspective."
        }, 
        {
            "index": 131, 
            "rating": "4", 
            "review": "What a charmer!. I wish everyone would take the time to visit this gem of a museum! I had no idea I would find it so enjoyable - in fact this is my third visit and I am no less enchanted. The film footage is particularly instructive!"
        }, 
        {
            "index": 132, 
            "rating": "4", 
            "review": "A moving and memorable experience. . One of the best tours I have been on. Very well explained and some really moving moments. I would say it is a must for any health professionals visiting Cape Town. I will not ruin the surprise but I predict some of the exhibits you see at the end of the two hour stay will remain in your memory for a very long time."
        }, 
        {
            "index": 133, 
            "rating": "5", 
            "review": "Safe walk. Love walking in the city centre, there is so much to do and see, take Long street for a good walk and the diverse shops that are there are awesome, Bree street is also an awesome walk with again so much to see"
        }, 
        {
            "index": 134, 
            "rating": "4", 
            "review": "A great tribute to an iconic SA legend. Having been to the Chris Barnard museum in Beaufort West to see where it began to seeing where the first successful heart transplant took place and to hear all the fascinating stories that lead up to the first transplant and what transpired afterwards was awe inspiring"
        }, 
        {
            "index": 135, 
            "rating": "4", 
            "review": "First for everything...and this place has the operating theatre it happened in.. When you find out that the tour is two hours long, you wonder what they could possibly show in two hours and if you will lose interest at all...let me tell you, you don't.The tour starts with an explanation of how the accident happened and ends with a tour of the original operating theatres and an immaculate reconstruction of the theatres along with wax figures to give you a better understanding of how the events of the operation played out.The tour guides are passionate and while they give you lots of information about the doctor, both patients and their respective families, you walk away with a complete understanding of the whole operation."
        }, 
        {
            "index": 136, 
            "rating": "5", 
            "review": "Great experience. Have personally been here twice and it stays amazing! Good product offering and I think a good visit for anybody and also if you're in the medical field this is quite amazing! Will recommend this!"
        }, 
        {
            "index": 137, 
            "rating": "5", 
            "review": "First heart transplant. I was very impressed by the level of detail in this tour. They really did a good job recreating the build-up to the first heart transplant and the actual operation. I walked in not knowing a thing about the place other than that the first heart transplant happened there. By the end I felt like I knew Christian Barnard personally and like I had actually watched this historic event take place. An excellent tour."
        }, 
        {
            "index": 138, 
            "rating": "5", 
            "review": "World's first heart transplant by Dr. Chris Barnard. South Africa beat the world to it, when Dr. Christiaan Barnard transplanted the first human heart in 1967. This museum is located in Cape Town, at Groote Schuur Hospital. The original theatres were restored, and the set-up is like a real-life presentation of what it was like in those days. The whole story of that first heart transplant is told by artefacts and a wonderfully trained guide. The personal experiences of the family of the donor and of the first transplant patients are told, together with the experiences of Dr. Christiaan Barnard. A moving place with personal biography mixed with advances in medicine."
        }, 
        {
            "index": 139, 
            "rating": "5", 
            "review": "First Human Heart Transplant - Cape Town Made History. Don't miss this museum when you are in Cape Town. It's a 2-hour tour and costs R200.It's a story about how the first human heart transplant took place. Showing through video clip, walking through rooms which tell about the donor, the team of doctors, the recipient and silicon reprica of the operation.The curator had done such a great job that you hardly noticed time had gone past. She is concise, knowledgeable and humorous. I am not a museum goer, neither am I a medical professional, I find the tour very interesting, educational and inspiring. Honestly this should be rated amongst the top attractions of Cape Town!"
        }, 
        {
            "index": 140, 
            "rating": "4", 
            "review": "Medical history. Cape Town is the place where the first successful heart transplantation happened. Very cool place to visit if you're into health sciences or just curious..."
        }, 
        {
            "index": 141, 
            "rating": "5", 
            "review": "Awe-inspiring and unique. This display takes us back to a very different world of medicine. It allows laymen to share the excitement and the sorrow of every aspect of the unknown technology into which these pioneers delved. The knowledge of the guides, the realism of the exhibits and the fact that you are literally walking in the footsteps of these characters is gripping. If the weather is chill- do not miss this."
        }, 
        {
            "index": 142, 
            "rating": "5", 
            "review": "Interesting story, original scenes. We learned a lot on this tour about the story of the first heart transplantation. The guide worked once at the hospital and had profound knowlodge about the history and doctor barnard. What its fascinating, that the tour is on the original location where the first heart transplantation took place. The rooms were set up in the original decor."
        }, 
        {
            "index": 143, 
            "rating": "5", 
            "review": "A heart-warming story. This museum located in the Grotte Schuur Hospital chronicles the world's first heart transplant, performed by Dr. Christiaan Barnard. The tour is led by one of the museum guides and consists of a 40-minute video followed by the guided tour through rooms designed to recreate the story of the first heart transplant, including the stories of the donor, recipient, transplant team, and the operation itself. The museum is filled with silicone replicas of the operation, old ventilators and operating room equipment, newspaper clippings, actual anesthesia records, congratulatory letters from all over the world, and more. The actual rooms that the operation took place in are part of the museum, making it extra special. Admission is 200 rand. This is an interesting little museum that should be on your list if you have a background or interest in medicine or the history of medicine. Since I meet those criteria, not surprisingly I loved the museum and gave it 5 stars. It could absolutely be educational and interesting to those outside of medicine too, but I can understand why some of the other reviewers thought the museum was boring and/or not worth the admission fee. However, if the above description piqued your interest go visit this museum."
        }, 
        {
            "index": 144, 
            "rating": "3", 
            "review": "Great medicine, but.... We all know that the story of the first heart transplant is a great story to know, but the tour has a few problems. First, the tour is WAY too pricey. R200 ($20) is too much for what they have in the museum. $10 would have been a better price. Second, the tour is TWO hours when it should have only taken an hour. Therefore, the tour is VERY redundant to get that two hour mark and the museum has pointless things in it like a replica of what Denise's room MAY have looked like. Nice, but it doesn't add anything to the tour or story. I'm not even sure this whole story needs an entire museum and a two hour tour. Maybe just the recreations of the operations and an couple interactive videos. Sure this is something for South Africans to be proud of (and I won't even go into my opinions on whether the surgery should have been performed under all the conditions you'll learn about in the tour) but the museum and 2 hour tour are overkill. Shorten the tour and keep it more focused so non-medical/scientific people will find it interesting. My husband claimed he almost died of bordem!"
        }, 
        {
            "index": 145, 
            "rating": "3", 
            "review": "Not quite sure what it was all about. I go to a lot of museums and this museum didn't seem to flow very well. I just felt that they had a whole bunch of things and they sort of threw it all together and hoped it worked....But the building was beautiful."
        }, 
        {
            "index": 146, 
            "rating": "5", 
            "review": "Historically Awesome. This is a definite field trip for the entire family. The kids loved it, especially the Planetarium. And for us adults it was nice to recap on our history!"
        }, 
        {
            "index": 147, 
            "rating": "3", 
            "review": "pricey entrance fee. The heart of Cape Town museum is an interesting little place that provides background into the life of christian Bernard, the donor and recipient of the first human transplant. I found the entrance fee a bit pricey at around $20. I am in the medical profession and would have liked a few more medical details but otherwise and interesting 2 hour guided tour"
        }, 
        {
            "index": 148, 
            "rating": "5", 
            "review": "Medical history that will improve your life today. As a child in the 1960's, the history of the first heart transplant was in my distant memory. This museum brought not only this event to life, but also the life and times of Christian Barnard. One of the most meticulous and dedicated physicians to have lived. The participants in this museum tour will not only stand in his operating theater but come away feeling like you were there. The video interview of Dr. Barnard will teach you not only about this man, but give you a new definition of life that you can use to improve your own life. Don't miss this museum if you are in Cape Town."
        }, 
        {
            "index": 149, 
            "rating": "5", 
            "review": "Mesmerizing. Extremely well presented both physically and emotionally. The guides are both knowledgeable and passionate. It is a sensational learning experience. All ages would benefit from this experience. Don't miss it while in Cape Town"
        }, 
        {
            "index": 150, 
            "rating": "5", 
            "review": "Most Edifying. A great experience particularly for my wife who was a health professional. It really was a very full two hours and much praise to our guide Christine who made it so interesting. Chris Barnard was obviously a great and dedicated man and it was difficult not to centre on him and his achievements but they did try. Well worth a visit if you have a few hours to spare"
        }, 
        {
            "index": 151, 
            "rating": "5", 
            "review": "Exciting, especially if you are in the health field. The Heart of Cape Town Museum is definitely the place to go for health/medical nerds and others alike. You get to learn about the life of Dr. Barnard and how he performed the first ever cardiac transplant, as well as the lives of those others involved. Entrance fee is R200 and R100 for students. There is a knowledgable tour guide(I had her all to myself as no one else was on my tour, a 40 minute video, and wax figurines in the original operating rooms in Groote Schuur Hospital. There are numerous letters, newspaper clippings, and original documents. The best parts were getting to see the actual operating rooms and getting to see the actual hearts! A must see for those in the health or medical field."
        }, 
        {
            "index": 152, 
            "rating": "5", 
            "review": "Sensational history shared on site. It was an amazing tour, You are taken by the excellent guides into the actual theatre where the first heart transplant took place. The history and the politics of the time set the scene with lots of extra information to absorb. We totally loved it. Just didn't like the different entry fees for SA residents and Non SA residents."
        }, 
        {
            "index": 153, 
            "rating": "5", 
            "review": "A man after my own heart. The Heart of Cape Town Museum is for the nerd in you. See the life of Dr. Christian Barnard and how he performed the first ever cardiac transplant. Tours are at 9AM, 11AM, 1PM and 3PM and last for 2 hours. Entrance fee is steep at 200 Rand. Includes a 40 minute video. Has wax figurines in the original operating rooms in Groote Schuur Hospital. Also has newspaper clippings, letters, and the original hearts from the operation. A great visit for a rainy day or if you have an interest in the medical field."
        }, 
        {
            "index": 154, 
            "rating": "2", 
            "review": "Too long and too expensive. An ode to Christiaan Barnard and not a very interesting one, at that. The two hour tour was an hour too long and for R200, a R100 too much."
        }, 
        {
            "index": 155, 
            "rating": "5", 
            "review": "you will be speachless..... if you are in the situation that someone around you had a transplant - or if yourself had a transplant - or if you just interested in medical history - this is the place to go. The private Person who set up this place to what it is now did such an amazing Job with all the research and getting the original parts for his demonstration rooms I was speachless. I just think everbody should about this entire Story and see how small we are in our days - going back all this year when the frist transplant happened and seeing all the items used for the op's wow wow wow - well done to the Museum - the Guides where all part of the Team in these days and speak out of experiance."
        }, 
        {
            "index": 156, 
            "rating": "5", 
            "review": "Amazing Tour - Must See. As a teenager growing up in the 1960's I remember quite well all of the events that led up to this first heart transplant surgery performed by Professor Barnard. As an aspiring doctor i recall following all of the historical events leading to this first successful heart transplant in history. Taking this tour brought back for me numerous memories of the events that led up to this heart transplantation procedure. The history is recreated very accurately. The Madame Touseaud style manikins representing the various important characters bring back to life those very important people. .The tour guide we had was super knowledgeable I took over 1000 digital photos in this place. It is a must see. A trip to Cape Town should include a visit to this fascinating place. I look forward to going back and seeing the place once again during my next visit to Cape Town. Thank you heart of CT Museum for accurately recreating history. All the best always. Dr. S."
        }, 
        {
            "index": 157, 
            "rating": "5", 
            "review": "Fascinating tour. I am a pediatrics resident doctor from Canada. I found the museum tour to be scintillating for people of all backgrounds, both medical and non-medical. I loved the medical aspects (obviously), but was particularly fascinated by how they related to the era. I also loved hearing about the stories behind the different players who contributed to the world's first human heart transplantation."
        }, 
        {
            "index": 158, 
            "rating": "5", 
            "review": "Visiting History. I remember as a child when Chris Bernaard completed the first heart transplant. To see this museum was revisiting a part of my child that influenced me greatly. We had a guide take us through who was very informative. Definitely a must see. Total time was about 1 1/2 hours."
        }, 
        {
            "index": 159, 
            "rating": "5", 
            "review": "A trip to Cape Town must include this museum. At first I didn't wont to visit this museum the thought of operating theater put me offbit how wrong I was it brought back memories of the day that operation was performed.now a day in historyThe museum is set up in the actual operating theater you get the feel of what is must have been like.The film about Christian Barnard was also very interesting and very informative about his life and also his brother who helped him in the operation.I was so moved by this visit that on my return home I bought his book Second Life that's how much i enjoyed the visit Even if you don't like hospitals this is still a pleasant museum"
        }, 
        {
            "index": 160, 
            "rating": "4", 
            "review": "Wish I have more time. Well put together. Much to see and study. Would like to go again and allow more time to see everything."
        }, 
        {
            "index": 161, 
            "rating": "5", 
            "review": "Thoroughly enjoyable. My visit to the heart of Cape Town museum was by chance and only because it was raining, however it was a thoroughly enjoyable and something I recommend to anyone visiting Cape Town whatever the weather! We did the 2 hour tour with Allan Korsman. It was fascinating. The museum itself is brilliantly set up in the actual rooms that were used by Christian Barnard. They have lifelike models of the doctors performing the various operations which really adds to the display.  If you are in Cape Town this is a museum well worth the visit."
        }, 
        {
            "index": 162, 
            "rating": "5", 
            "review": "Nicely set up!!!. The old theatre has been changed into a museum. And the whole tour (of 2 hours) will give you a great overview of what lead up to the first successful heart transplant. Well worth a visit!!!"
        }, 
        {
            "index": 163, 
            "rating": "5", 
            "review": "First heart transplant by Christiaan Barnard. Our hotel booked us on the 11am tour. There are tours at 9, 11 & 1. We took a taxi from our hotel in the centre of Cape Town and the journey took about 15-20 minutes.The tour lasts for 2 hours and it passes by really quicky.The tour starts with the accident in which Denise Darwal died and then the subsquent removal of her heart for transplantation into Louis Washansky.It is a fascinating tour talking about Dr Barnard's life and the incidents that led up to him performing the first heart transplant.The tour is depicted with models made of silicone and there is a short 20 minute film too. It was fascinating seeing the actual operating theatres, one where the heart was removed and the other in which it was transplanted. The clock in the operating theatre it stopped at 6am, the time which the transplanted heart first started beating on it's own.You are shown the actual heart from Louis and the original stitches made by Christiaan Barnard are still clearly visible.This is a fascinating tour and insight into the medicine of 1967 and what had led to heart transplants being performed routinely today.The hospital itself is a beautiful building. It was simply amazing being on this tour and seeing first hand the groundbreaking work by Christiaan Barnard.Don't miss this!!"
        }, 
        {
            "index": 164, 
            "rating": "5", 
            "review": "Excellent Tour with a personal touch. We were pleasantly surprised on this tour! Its the most personal and detailed tour we have had in a long time. Even though we were just 2 people, the guide, Mr Korsman, tool his time and wnet to great lengths to show us around and interprete the sequence of events in context to what was happening in the world at the time. The tour is highly recommended! Will definately be back for some more!"
        }, 
        {
            "index": 165, 
            "rating": "5", 
            "review": "An interesting and moving visit. The thing to realise up-front is that this is a personal guided tour IN ENGLISH lasting about two hours - we were in a group of six. So do check on the starting times for the tours. If this is OK for you then you will have an interesting and moving experience and insight into this important event in medical history."
        }, 
        {
            "index": 166, 
            "rating": "5", 
            "review": "Really interesting place to visit.. We were not sure if it would be interesting, but boy were we wrong !! It is really a great place to visit with incredible life-like scenes of how everything really happened. Not for the faint heartded, lots of very visual scenes. A must visit !!"
        }, 
        {
            "index": 167, 
            "rating": "4", 
            "review": "cape town museum a must. the gardens with the animals around you...the dam with the fishes in it, the museum with the most extraordinary fossils.. wow! what a treat!!"
        }, 
        {
            "index": 168, 
            "rating": "5", 
            "review": "An absolutely amazing small museum. Our family visits many museums but this is the most memorable of all. The tour was gripping and gave an excellent in-depth history of the events, facts and characters involved. Two years later we are still talking about it!"
        }, 
        {
            "index": 169, 
            "rating": "5", 
            "review": "A visit to where groundbreaking medicine took place. This tour was recommended to us and it really did fulfill all our expectations. The building is stunning and the the tour has been designed to captivate the visitor and tell the story of the amazing groundbreaking work of Christiaan Barnard. The sad story of the sudden death of the first donor Denise Darvall in 1967, is told along with the dilema faced by her father, to give consent for the removal of her heart. The theatres have been reconstructed with the use of some amazing silicon figures.I visited with my husband and daughter and we all left feeling inspired by the risks and uncertainties faced by such pioneering work. Well worth a visit by anyone interested in historical medicine."
        }, 
        {
            "index": 170, 
            "rating": "4", 
            "review": "The Heart of Cape Town Museum. Very interesting part of Cape Town's history. It gives some interesting insights in to how medicine was practiced and how it has changed. The welcome video was well done."
        }, 
        {
            "index": 171, 
            "rating": "3", 
            "review": "Nice museum, poor guiding. The museum itself was very nice and educational. I would have preferred however, to walk around myself, rather than take part in the two hour guided tour. The guide focused on too many details about the surgeon´s family, the donor´s hobbies etc, that I was not really interested in."
        }, 
        {
            "index": 172, 
            "rating": "5", 
            "review": "Extraordinary!. It is more than two months since we visited this museum and I still find myself thinking of it often. To enter through what was the emergency entrance and stand in the actual operating theatres where it all happened (and set up as they were on the day) is an unforgettable experience, as is seeing the preserved recipient and in some cases donor hearts. The staff are knowledgable and passionate about the stories and bring it all to life while being immensely respectful of the sensitivities involved. I learnt so much.They couldn't have been more helpful, arranging transfers from my hotel and collecting my husband from the university (and staying open a bit later for us so we could see it all - and there is a lot).One of the best museums I've seen and the highlight of our visit to Cape Town. Don't miss it.."
        }, 
        {
            "index": 173, 
            "rating": "4", 
            "review": "Heart Transplant in History. For those who remember the shock and excitement of the world's first heart transplant - and even for those who do not - this is good history. You do not need a medical background to understand and appreciate the guided tour at Groote Schuur Hospital. It's extremely informative. Pickup and return to your hotel is free for those who purchased a Hop-Off Hop-On ticket (else 50 rand). If you schedule this 2-hr tour right before you need to leave for the airport, they will even store your luggage during the tour and drive you to the airport free - more than saving the cost (200 rand) of the tour itself."
        }, 
        {
            "index": 174, 
            "rating": "5", 
            "review": "Impressive museum on world's first heart transplant. Glad to visit this Heart museum on the historic heart transplant performed by the eminent pioneer Dr. Christian Barnard in 1967. He used the accident victim, Denise's heart to transplant into the recipient, Louis Wallansky. The exhibits were very detailed, informative and well laid out. It is certainly worth a visit."
        }, 
        {
            "index": 175, 
            "rating": "5", 
            "review": "One of the BEST. I am the publisher of many Travel Guides and I therefore have to visit, research and photograph many attractions in and around SA.I was totally impressed by The CHRIS BARNARD HEART MUSEUM in Cape Town South Africa. Every little detail has been thought of and it feels as though you are actually part of the whole operation. The experience was totally unbelievable and will remain with me forever. Whatever you do, make sure you visit this museum when next in Cape Town, you won't be sorry. Well done to the curator and founder of this remarkable property!"
        }, 
        {
            "index": 176, 
            "rating": "5", 
            "review": "Very interesting, informative and extremely realistic, definitely worth a visit. We have visited Cape Town on several occasions, and finally got round to visiting here inSeptember 2011.It was a guided tour and we were only a small group of visitors about 6 of us, mainly medical professionals , we were not but able to follow and understand completely what was being explained. The actual operating theatres and the models in the beds were very lifelike and so realistic, you could almost see them breathing! The original photographs and the histories of the first patients to have this heart surgery was very interesting, as today we do not think of this as even unusual, but back then was truly amazing."
        }, 
        {
            "index": 177, 
            "rating": "5", 
            "review": "\"the cutting edge of medical science\" ! A tour every visitor to Cape Town should take!. I had always known the first heart transplant done by Dr Chris Barnard and his team was special, but to actualy walk with an excetionally knowlegeable guide through the very corridors, and opperating theatres with life like props and the actual instruments , was an experience I will never forget!! What makes it even more incredible is seeing how far we have advanced since using those old machines and equipment. What I also learned was that our high care and ICU proceedures were developed as a direct result of the lessons learnt during the heart transplant opperations. HIGHLY RECOMMENDED, one of the most interesting museums I have ever been to!"
        }, 
        {
            "index": 178, 
            "rating": "5", 
            "review": "One of the best. We always try to find something interesting and different to see on our trips and the Heart of Cape Town Museum was the hit this trip. Museum recounts the work of Dr Christian Barnard and includes visit to the OR rooms. We learned from Petr who picked us and and returned us to our hotel, that most people hear about the museum by word of mouth. So we are spreading the word."
        }, 
        {
            "index": 179, 
            "rating": "5", 
            "review": "A life changing experience. In 1967, Chris Barnard and his team made history.Set in the original operating theatre, the Heart of Cape Town Museum showcases the worlds first successful human to human heart transplant operation. The tour covers the history of the operation, the characters and all the events which came together to the astonishment of the world. An inspirational story with excellent props including original equipment and life like dolls recreating the operation.After the two hour tour, one can amble down to Cape Towns student and artist area Lower Main Road for all day breakfasts, good coffee shops and just enjoy Cape Towns bohemian suburb."
        }, 
        {
            "index": 180, 
            "rating": "5", 
            "review": "Will totally exceed your expectations !! One of the greatest human achievements.. Having guided tours at this museum in 2008, NO not a normal museum, rather a living memory of one of the greatest human achievements, one is constantly stimulated by the true story of a young man driven by his mother and personal amibition. This is a 5 Star guided experience by stimulating ladies (and sometimes men) who have a passion to share the life experiences of Christiaan Barnard and show you the 2 theatres that appear alive with well crafted manquins plus the Barnard office, animal reserch lab, and recovery room with Louis W plus other images that bring this story in history alive. You will leave thrilled and excited and full of wisdom."
        }, 
        {
            "index": 181, 
            "rating": "5", 
            "review": "One of the great moments in human history. This is absolutely fascinating, a truly amazing insight into a great man, Dr Christiaan Barnard, and his accomplishments for the world to benefit.."
        }, 
        {
            "index": 182, 
            "rating": "5", 
            "review": "Madam Tussaud's of the Cape.. Interesting, educational, life like!\nSomething we as Capetonians can be proud of.\nA great achievement w.r.t the first ever heart transplant and the effort to keep the history alive.\nThe presentation was worthy of the event.\nWell worth the visit.\nIf I remember correctly, entrance fees were a bit steep, especially for locals."
        }, 
        {
            "index": 183, 
            "rating": "4", 
            "review": "Nice Place to Visit If .... We visited the museum because my daughter begged us. We had no idea what to expect and were pleasantly surprised with the outcome. The recreation of the surgical rooms is a little creepy and seeing Louis Washkansky in bed was very odd. If you are into medical history this place must be great. If not, you may want to spend your time elsewhere. The rest of the family found it interesting and enjoyed the visit, but it is not a place we would push our friends to visit, unless we knew they were into this kind of exhibit. It is definitely a piece of history and the artifacts are remarkable."
        }, 
        {
            "index": 184, 
            "rating": "4", 
            "review": "So real - a unique peice of history still remembered today. The museum itself was famtastic - very interesting and a unique piece of history.I particularly liked visiting the original operating theatres - the wax works were so real - especially Lou in bed !However cost is high for 'foreigners' (I resent this title). It should be less expensive and then perhaps more people would visit from overseas.Less price = more visitors = more publicity = more revenue."
        }, 
        {
            "index": 185, 
            "rating": "5", 
            "review": "A must see - even if you're not in the medical field .... Not only for those who do recall the drama of Prof. Chris Barnard's first human to human heart transplant, but even for those with an interest in medicine, this place is fascinating, well done .... maybe even a little creepy .... but I mean that in the nicest way!We (a group of six) first visited the museum shortly after it had just opened in 2008, not knowing what to expect, but we were hooked from the moment we entered the hospital museum's doors. It left an incredible impression on all of us and we felt privileged to be standing where medical history was made. On a recent visit to Cape Town with more friends in May, one of whom is a GP, we were so happy to take them back to Groote Schuur Hospital and to see this museum again for a second time. For us, it was as good as the first time, and our 2nd lot of visitors loved it. The recreations of the operating theatres and situation rooms are amazing, these are the very corridors and theatres where all the action happened, with apparently much of the original equipment and/or furnishings. (Even the original donor heart is in a jar!!). The tragic events that lead up to the transplant are cleverly presented as though it happened yesterday, and with compassionate sensitivity and tribute to the donor and her family, also. It is quite moving and we all found it compelling. Perhaps that is because on both occasions we also had enthusiastic, knowledgable guides.Do yourself a favour and see this place. You won't see anything like it anywhere else, esp. as it all happened right there!"
        }, 
        {
            "index": 186, 
            "rating": "4", 
            "review": "Very Moving Experince. This museum is well worth a visit, especially if you are of an age when you can remember the first heart transplant. Th two hour guided tour takes you through the history of Chris Barnard and the first successful heart transplant with a whole plethora of videos, recreations of the operating-theatre, offices etc."
        }
    ]
}