{
    "category": "Cape-Town-Central", 
    "entity": "Green-Point-Park-and-Biodiversity-Garden", 
    "avg_rating_stars": 4.661835748792271, 
    "review_count": 414, 
    "rating_stats": {
        "poor": 0, 
        "average": 10, 
        "terrible": 4, 
        "very_good": 104, 
        "excellent": 296
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "Great place for kids to play too!. What an awesome place to visit if you're looking for things to do while in Cape Town. Beautiful gardens to walk around in and a park area for kids. Loved the bio-diversity garden filled with quirky little objects to interest both kids and adults alike. Very peaceful and relaxing to walk around. Views of Table Mountain also amazing."
        }, 
        {
            "index": 2, 
            "rating": "4", 
            "review": "Better than a London Park!. Think of a London Park, add beautiful weather & a stunning view of mountains, sky & paragliders,many different plants & waterways and remember you are in a City. Green Point Park is also a great shortcut from a buzzy Cape Quarter to a lazy beach stroll at Mouille Point.. Just go & enjoy.. Fitness folk go get jogging or cycling.. fun for the whole family."
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "Play, learn and relax in the middle of the city. Take break by yourself, with your friends or the kids in this very successful legacy project from the FIFA 2010 World Cup. Stroll the biodiversity gardens, learn about the Khoi-Khoi--the first inhabitants of the Cape, take in the colour and diversity of our amazing fynbos plant kingdom. It's free, relaxing and easy to get to. Do yourself a favour and walk from town on the fan walk or from the Waterfront via the promenade to Green Point Lighthouse."
        }, 
        {
            "index": 4, 
            "rating": "5", 
            "review": "A pleasant surprise. I went there early on a Friday morning, and just about had the park to myself, except for the odd maintenance person or gardener (who were all very friendly and greeted me) and a few lone joggers coming from the lighthouse side. It makes for a lovely tranquil stroll in the heart of the city, with a number of special interest areas on local medicinal plants, a bead sculpture garden, play area for kids, and my favourite, the labyrinth. I didn't even know there was one here, so it was a lovely addition to an already pleasant experience. Take the time to stroll and enjoy the lovely setting and then go to one of the coffee shops along the beachfront for a coffee. Bliss."
        }, 
        {
            "index": 5, 
            "rating": "5", 
            "review": "Perfect family picnic spot. Amazing views, beautiful walkways, exciting play parks, loads of space and parking. This park offers it all for the entire family."
        }, 
        {
            "index": 6, 
            "rating": "4", 
            "review": "Short walk in absolute tranquility. The bio diversity park is adjacent to Green Point Stadium / Cape Town Stadium so you really can't miss it. The walk along the golf course over the wooden bridge towards the lighthouse is stunning. Then veer off into the actual bio diversity area which is well marked for those interested in reading up a bit. Lots of sculptures and interesting nooks and crannies. Beautiful way to while away some time on a sunny day"
        }, 
        {
            "index": 7, 
            "rating": "4", 
            "review": "This is a GREAT new park in Cape Town. BUT Cape Town, unlike many other cities, does not have many parks. If you want a park something like you may have visited in other cities, rather go to the Company Gardens. Back to Green Point Park. A few years ago this was a windblown (look at some of the older trees - even though old, they are small and grow at funny angles in the wind) patch of land that was upgraded to a park as part, i think, of the 2010 World Cup soccer stadium. Anyway, unlike the stadium, this park was one of the good byproducts of the 2010 world cup. Bear in mind that this park is still young, so few big trees but in time it will be pretty good. Wander around the park and see all that there is to see; there are pond areas, areas where particlar plants are being developed, play areas. last time i was there the restaurant/snack food building was empty but I hear it is now occupied. I am not sure what it is like but there are wonderful alternatives on the sea (north) side of the park. Go through the gate and the sea will be about 200 to 300 metres away. There are several really great spots for breakfast/lunch/brunch/coffee. I can only recommend these spots for breakfast/lunch as I have never been to any of them for dinner."
        }, 
        {
            "index": 8, 
            "rating": "5", 
            "review": "Very relaxing. Take the kids. Their bikes. Or just let them play at the parks. Run around on the grass. Have parties. Walk through the biodiversity display area. Or as an adult, you can run or ride your bike around the park. When I was there, they were busy with a coffee shop. That would be lovely to just go sit there, in the fresh air and have a drink and relax."
        }, 
        {
            "index": 9, 
            "rating": "5", 
            "review": "Amazing. Wow, what an amazing place. Highly recommended!!. A must see. Take a picnic with, and lots of friends. Kids had a ball. Very quiet and tranquil."
        }, 
        {
            "index": 10, 
            "rating": "5", 
            "review": "Beautiful serene park in the middle of the city. I loved walking in this beautiful urban space! It was close to my Airbnb rental and I ended up walking there every morning. Lovely and serene with joggers and walkers. You can see the mountain from there."
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "Soaking up the sun!!. We hopped off at the Green Point Park and Biodiversity Garden on our Red Bus Trip. What excellent weather and the kids enjoyed the play park, played with their ball and just ran around the lovely gardens and grass areas. The bathrooms were very well appointed and clean! We had a fantastic time on our fourth visit and will definitely be back in the summer days!!"
        }, 
        {
            "index": 12, 
            "rating": "4", 
            "review": "A beautiful park in a lovely city. This a a special place to walk, look, enjoy and find peace and tranquility. For anyone that has time to spare it is a beautiful place in which to stroll and admire natural beauty. While my wife was in theatre undergoing cancer surgery I lost myself here and it brought peace to my soul and tranquility to my mind. A beautiful place, indeed. Enjoy."
        }, 
        {
            "index": 13, 
            "rating": "5", 
            "review": "Amazing place!. We have visited this park often since it was opened. It is a great place to with your family. It's green, clean, educational and very relaxing. There is great clean facilities with good security. The landscaping is fantastic and reflects the biodiversity of the Cape Peninsula. The water features is very well designed and incorporated with the rest of the park. The park borders the Greenpoint Golf course and the Virgin Active Gym. You can see the mountains, the Cape Town Stadium in the distance. There is great facilities (play area) with uniquely designed play equipment. They open early 07h00 and close at 19h00. The walkways has educational information to read as you go along. There is facilities to eat Lunch (bring your own) and the best it is all FREE!!!"
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "Green and lively place. A great place for rest and picnics. They have several areas with tables and drinking water, which are quite busy in the warm time of the year. You can also find free bathrooms and bins for different types of waste. Loved the educational paths for kids."
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "Greenspace. This is a new beautiful park and green space that goes between the nice restaurant district in Greenpoint, and the Victorian lighthouse at Mouille point. It has nice water features with wading birds and some nice lawn area and benches to eat lunch."
        }, 
        {
            "index": 16, 
            "rating": "5", 
            "review": "Great piece of Green!. A lovely place to relax and wander around at leisure. Take your time and explore things, something may crop up completely unexpected! Outstanding scenery and a must to rest those weary bones after wandering around lovely CT"
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "Beautiful and well maintained. Very nicely arranged, clean and safe park which I enjoyed running. I discovered the Biodiversity Garden which is very interesting, offering lots of information."
        }, 
        {
            "index": 18, 
            "rating": "4", 
            "review": "Nice for families.. As we travel with our child ,we need to find places like this , for a brake.This is a place for families with young children, clean and safe."
        }, 
        {
            "index": 19, 
            "rating": "4", 
            "review": "Awesome park. I recommend you to go that park if you want a place just for a nice walk, with great views to the stadium, mountain."
        }, 
        {
            "index": 20, 
            "rating": "4", 
            "review": "A chillout area. A well kept area and a peaceful biodiversity park. It is lovely to sit on the bench alongside the lake, read a book and have a take away coffee at the mac donalds around the corner. Or walk around the read the interesting information about the biodiversity. Organise friends or family to meet for a picnic and enjoy the sunshine. We were there in \"winter\" but it was a warm sunny day!. People enjoy jogging through the park and there are also some gym equipment to try out if you are feeling sporty."
        }, 
        {
            "index": 21, 
            "rating": "5", 
            "review": "Quiet in City Central. What an amazing way to spend a day.Take a picnic basket and/or do the Wetland Walk and Biodiversity Trail. The kids play on the numerous and safe structures."
        }, 
        {
            "index": 22, 
            "rating": "4", 
            "review": "Wonderful Open Park in Urban Cape Town. A positive result of the absurd anount spent on building the Cape Town stadium (background) for the 2010 FIFA World cup. Great facilities, form jungle gyms for young and a little older, an outdoor gym park...and the Mouille point lighthouse and ocean promenade across the road."
        }, 
        {
            "index": 23, 
            "rating": "4", 
            "review": "Taking our grand children for an exciting walk and playing on the grass and park facilities.. this venue is fantastic for picnics and fun filled walks, spotlessly clean and widespread facilities. there are some little lakes with wild birds for you and the children to see.\ntake a camera and wear comfortable walking shoes, and choose a day when the wind is not blowing."
        }, 
        {
            "index": 24, 
            "rating": "5", 
            "review": "Green point park. What a lovely place to take the kids out to. There is something for kids/adults of every age. Nice spacious, well kept lawns. Very clean bathrooms. Even doggy water stations. Really nice!"
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "Kids haven. So much space, so many apparatus to climb and plenty of circuits and pathways to ride bikes, skateboards and scooters. Kids always have a ball when we go, and this visit was no different :-)"
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "Take a walk and unwind.. I was surprised about the beautiful scenery. The ducks in the pond is so peaceful. The walkways are clean and lots of plants and flowers to see."
        }, 
        {
            "index": 27, 
            "rating": "5", 
            "review": "Make some time. A tranquil, beautiful space when you need some \"space\"!\nLots to learn about biodiversity and very child and pet friendly"
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "A true gem in Cape Town. Open to everyone, great for families, runners, meditation and and and. I love this place. I hope the City of Cape Town will take good care of it for years to come. Free."
        }, 
        {
            "index": 29, 
            "rating": "5", 
            "review": "Safe and relaxing. Most enjoyable for all ages. Lovely play area. Healthy outdoor activities. Educational. Beautiful natural surroundings."
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Fabulous park. We've been there a few times now with the kids. It gets quite busy on weekends at the play area with everyone bringing their kids. Great that the park gets used. Fantastic for picnics and well maintained."
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "Lovely to go for walks with kids. This space is just so lovely to take your family for a nice afternoon stroll. Rolling lawns for little ones to run to their hearts' content. There is also the coolest little play park I have ever came across in South Africa. My toddler enjoyed herself thoroughly. We will def return, hopefully very soon."
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "Awesome park for sunny days. This park is very nice for taking a stroll with your family, riding bikes, taking the dog for a walk or just taking the kiddies to play. There are several play areas inside, gym and walkways and lots of nature to see. Unfortunately the nearest place to get something to eat or drink would be Newport Deli near the Light House at the promenade, so take your own snacks or picnic basket."
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "Stunning, educational park. This modern urban park close the Cape Town's epicenter boasts sprawling lawns, notable fauna and flora as well as a practical spot for a braai and other family activities. Many great educational areas to enlighten on eco matters and very well maintained to boot. Great for a stroll any day of the week"
        }, 
        {
            "index": 34, 
            "rating": "4", 
            "review": "Lovely free outing. Great if you're looking for a space to run (the Green Point Park Run is held there on Saturday mornings as an option) or for a relaxing walk in the evenings. Option: take a picnic over the weekends. The park closes at sunset."
        }, 
        {
            "index": 35, 
            "rating": "5", 
            "review": "Vist. My wife and I have spent quite a few hours in this park. Very relaxing, safe and peaceful. Quite busy on weekends, but one would never say it is full because of the vast amount of space in the park."
        }, 
        {
            "index": 36, 
            "rating": "4", 
            "review": "Wholesome day out. The Park was clean and I was impressed to find a guard at the entrance we used, who checked that our picnic did not contain any alcohol.The area is vast. Lots of grass to play ball games on or just picnic. Table and bench areas to sit and eat. There was an enclosed play Area for children under 6 and then the greater park with a wide variety of jungle gyms and apparatus to play on. Kids can ride their bikes or scooters. It was lovely to see our kids so entertained."
        }, 
        {
            "index": 37, 
            "rating": "5", 
            "review": "It's for Everyone. I have been a to a few birthday parties at the Eco Village as we call it. My Children have a blast every time. It's good clean fun in the sun in this wonderful open space."
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "Well maintained, great location,kid friendly, beautiful & zen.. Superb for the little ones, this park has an amazing wooden playground for all ages. I've taken mine since they were small but now I enjoy going and reading a book & enjoying the peace. Lots of seagulls so watch out for your food!Easy parking, safe, clean. Great park."
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "Best Place for a Picnic. Wonderful place for an easy Sunday picnic, the kids love the open spaces to play ball & just be free"
        }, 
        {
            "index": 40, 
            "rating": "5", 
            "review": "Short walk in absolute tranquility. The bio diversity park is adjacent to Green Point Stadium / Cape Town Stadium so you really can't miss it. The walk along the golf course over the wooden bridge towards the lighthouse is stunning. Then veer off into the actual bio diversity area which is well marked for those interested in reading up a bit. Lots of sculptures and interesting nooks and crannies. Beautiful way to while away some time on a sunny day"
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "A definate walk in the park. Very educational- information everywhere at the plants. Loads of spaces to relax and have a picnic. Various play areas for all ages kids."
        }, 
        {
            "index": 42, 
            "rating": "5", 
            "review": "A little piece of heaven. This is one of the most beautiful urban park spaces in the city. Enjoyed by young, old and everyone in between. Walkers, joggers, kids on bikes,families enjoying a picnic. Easy access to the promenade. On my list every time I am in Cape Town. Safe to enjoy alone."
        }, 
        {
            "index": 43, 
            "rating": "4", 
            "review": "A unique relacxin waliking experience right in the heart of one of the most beautiful cities in the world, Caep Town.. This initiative is praiseworthy. It allows one to renew energy and peace of mind right in the heart of a city. It is a well worth place to visit and just relax and cool down withn the nearby smell of the Atlantic Ocean and its tranquility."
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "BEAUTIFUL DAY IN CAPE TOWN. Lovely park for walking dogs, picnicking, riding bikes and rollerblading. Has a wetland and biodiversity garden to explore. Cape Town at its best."
        }, 
        {
            "index": 45, 
            "rating": "5", 
            "review": "cape town. been to CT 3 times. One of the best city in the world. love it thre. so many beautiful places to visit.was advised not to travel by train after 5pm. It's dangerous."
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "Education in the Park. I love the park for its educational value. There are posters and billboards on different aspects. For example, \"people and plants\" looks at how the tribal communities relate to plants. Every educational opportunity is seized. At the entrance / exit nearer the light-house, there are also panels to educate people on recycling.There are some humorous signs along the way e.g \"Unsupervised Children will be sold to the circus\", \"Kids found among the plants will be fertilized and watered\".Ducks & Birds are aplenty here. Just keep the eyes open and listen to the sounds in the park. On most days, one can also see boxing lessons at a pavilion there.On the whole, an enjoyable activity if one isn't looking for something vigorous."
        }, 
        {
            "index": 47, 
            "rating": "4", 
            "review": "Nice!. The Green Point Park and Biodiversity Garden is a lovely green area in the city. Set away from the main road, it is a large green area with trees, recreation areas and lots of spaces to relax and enjoy nature. Lovely"
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "Family trip. This park is definitely worth a visit, lovely walks and very interesting info on biodiversity. If you have children there are play areas that are age specific and paved walks where they can ride their bike's etc."
        }, 
        {
            "index": 49, 
            "rating": "4", 
            "review": "what a pleasure. Browsing to the indigenous plants is beautiful and interesting. Close to each herbal plant there's an explanation for how it was used by the locals as medicines . It's a fun place for picnics with the family too."
        }, 
        {
            "index": 50, 
            "rating": "4", 
            "review": "Running with a urban atmosphere. This is a lovely park to run through with nice water features , water fountains and trees . You can also take a relaxed stroll through the park and then take a break and sit under the trees . This park is also where the 5 km park run on a Saturday morning takes place . Pack a picnic basket and come for a nice relaxing day"
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "Enjoyable. Love walking through this park - everyone just enjoying the outdoors, walking, playing, being with family - clean and safe"
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "Urban Tranquility. What a surprise to find such a stunning space to enjoy the peaceful surrounds. The park is excellently maintained, safe and spotlessly clean. There are plenty of well thought out areas to explore and learn about bio diversity. Well done to everyone who keeps the space so beautiful."
        }, 
        {
            "index": 53, 
            "rating": "4", 
            "review": "I wouldn't put it on a list for 3 days in Cape Town, but if you're here for longer - yes.. Lovely urban space which turned into a gorgeous park, showcasing indigenous plants in an accessible location, with great mountain views."
        }, 
        {
            "index": 54, 
            "rating": "5", 
            "review": "Family time outdoors. Wonderful place to walk,take the kids and have a picnic-so safe and parking just outside.The lake has been restored and is full of birdlife."
        }, 
        {
            "index": 55, 
            "rating": "5", 
            "review": "Peaceful spot in a busy centre. It was a lovely afternoon walk in the Green Point Park. Very impressed with how everything in this place was thought through: clean and beautiful spot, well looked after plants and ponds with birds, plenty of space both in the shade and in the sun for a picnic, drinking water for humans and their dogs (I saw a few cats on a leash too), paths to walk and roads to ride a bicycle. You will feel there comfortable by yourself, with your friends or family, with children and dogs or without. There is a lot of parking around and the entrance is free."
        }, 
        {
            "index": 56, 
            "rating": "5", 
            "review": "Subtle blend of nature and nurture. Wonderful day out for mild activities whether you want to walk or picnic. Ample space for bikes and children to play. Great bird watching too."
        }, 
        {
            "index": 57, 
            "rating": "5", 
            "review": "Haven from the hustle and bustle. Beautiful grounds, well maintained and ample space to roam. Playparks for toddlers and another for bigger kids! Cycling permitted, so bring the bikes, scooters, strollers... Also the venue for the Park Run on Saturday mornings."
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "A lovely tranquil stroll in the heart of Greenpoint. When the city planners planned this park, they took the area, history and nature into consideration. Not just did they create a space where individuals, couples and families can all enjoy the amenities, but they made sure that your stroll through the grounds will be informative and relaxing. There are ponds with birds, gardens with fynbos and medicinal plants, wire and steel animals and insects, paw prints of wild animals, the stages of building a hut, jungle gyms for different age groups, picnic areas, amphi theatre, serenity circle, beautiful pristine lawns, a water wheel. The lake that separates the park from the golf course next door tells the story of yacht races in years gone by. There is a function venue as well. The park has opening and closing times. The park is kept in pristine condition by a dedicated team of cleaners and guards are on duty at the gates. Do not leave the area without a stroll through this beautiful piece of nature."
        }, 
        {
            "index": 59, 
            "rating": "5", 
            "review": "Beautiful open space in the city. Nice open space for a pleasant walk/run. Worth walking from Sea Point to the city through the park with beautiful views of the mountain"
        }, 
        {
            "index": 60, 
            "rating": "5", 
            "review": "Breakfast in the park. We had a family breakfast in the park one Sunday morning. Wonderful seating areas to have a picnic. Lovely pond and walkways. Very well maintain park.. Kids loved the rides. Breath taking views of sea point and the mountains. Free parking facilities. Highly recommend."
        }, 
        {
            "index": 61, 
            "rating": "4", 
            "review": "A lovely walk. We left our bus tour to walk back to our hotel through the park. A park of such diversity, lush grassy areas, many different types of plants, ponds and recreational areas ending up near the arena. A very pleasant walk."
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "Oasis in the CT. The park is right next to Green Point Stadium. It's the perfect place for picnics, walks and playing soccer or touch rugby. Also a great place to read a book."
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "Beautiful well maintained park. This park is near the large stadium in Green Point. It is really a lovely place for a walk/ cycle/ picnic. Lots of things to do with interesting play equipment for children, gym style equipment for older kids and adults. The small lake is beautifully clean and the grounds are immaculate. We enjoyed the interesting biodiversity area. There also seemed to be a mini amphitheatre. Lovely views and near the sea."
        }, 
        {
            "index": 64, 
            "rating": "5", 
            "review": "Great for restless children. A lovely open space in the heart of the city. Green lawns, jungle gyms, ponds with plenty of birds. People out walking, cycling, skating etc. Pack a picnic & enjoy the space & tranquility."
        }, 
        {
            "index": 65, 
            "rating": "4", 
            "review": "Parks have become rare in South Africa and this one is awesome. Great clean destination for picnics, walks, kids parks and family fun. Looked very clean and safe. So nice to see places like this in South Africa."
        }, 
        {
            "index": 66, 
            "rating": "5", 
            "review": "was awestruck. a park for young and old to play, relax, laze and there are interesting things to do, we walked the maze, what an experience."
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "Great place for kids, nicer during the week when quieter.. Visit during weekdays & you will be pleasantly surprised by this park. Great age-appropriate kids play areas too."
        }, 
        {
            "index": 68, 
            "rating": "4", 
            "review": "God for a walk and exercise. This is a beautifully landscaped area with lots of good paths on which to walk or jog. Wooden tables for picnics. Very,very clean and well looked after"
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "A Tranquil Park with lots of Extra's. The Green Point Park and Biodiversity Garden was developed on 12.5 hectares between Signal Hill and the Atlantic Ocean and it owned by the City of Cape Town. It allows Capetonians to explore, be active and learn about biodiversity. There are entrances to the park from nearly all sides and provides a great outing for both children and alike and it is common to find family picnics or birthday's parties and other parties being celebrated their.The Park is well utilised but weekends naturally it is much more busier. Entry is free and that helps make it a great attraction. Even with huge numbers, noise is minimal and there is a great sense of tranquillity, perhaps aided by the gentle flowing waterway or the birds and small animal life in the area. The biodiversity garden features over 20 000+ indigenous plants and there is a wide variety of flora, water features and wetlands.Ample benches and seating can be found, but come early. The park has wide paved paths for walkers, skateboarding, those pushing prams or wheelchairs and children on bikes to navigate safely around each other. The toilet facilities are always kept clean and there are friendly guards advising visitors on what to not do. The park area has a section for kids 1-6 (Tot a Lot) and for children aged 7 -18, there is an Adventure Play Park and for those wanting to have a work-out, the Green Gym circuit.A definite place to enjoy whenever one can."
        }, 
        {
            "index": 70, 
            "rating": "5", 
            "review": "Beautiful. You get lost looking at the detail with which the park has been planned and established. So much to experience."
        }, 
        {
            "index": 71, 
            "rating": "5", 
            "review": "Fun in the sun. Popular with locals Cape Town residents and tourist just wanting to take an afternoon, evening or morning stroll. Best to have a picnic in the park. Famous for kiddies parties. Very safe and secure for kids as they can to roam freely. With adult supervision off course. They are many jungle gym activities for kids to use and adults can use exercise equipment as well. Open all day and all year round. No cost. Rest rooms are also free and clean. Cleaning staff and security on site always. The experience can be very educational for kids and adults alike as they roam the Biodiversity garden with its many indigenous plants, trees, shrubs, bulbs, groundcovers and many more. There is also an outdoor Labyrinth to be explored and can be exciting for kids."
        }, 
        {
            "index": 72, 
            "rating": "4", 
            "review": "A nice run. A nice place to run/walk amongst the plants and birds. I liked the circuit points where people can exercise. easily accessed from the beach front or stadium park"
        }, 
        {
            "index": 73, 
            "rating": "5", 
            "review": "I adore having picnics here. I'm lucky enough to live across the road so spend many summer weekends here. Its a great place to have a picnic and even bring your furbabies. Make sure to pick up their poo and keep them on a leash though"
        }, 
        {
            "index": 74, 
            "rating": "4", 
            "review": "Afternoon out. Park is very clean and well maintained. Excellent for picnics, playground for kids or just playing.Also educational, which was a added bonus!"
        }, 
        {
            "index": 75, 
            "rating": "5", 
            "review": "Walk, exercise or spend quality family time in a safe and secure environment. I would gladly pay an entrance fee to this park if they ever started charging one. Appropriate amenities for all ages and water features and views that keep you spell bound. Bring the family or a group of friends and relax, exercise or just have good clean family fun."
        }, 
        {
            "index": 76, 
            "rating": "5", 
            "review": "Great family venue. Green Point Gardens is a lovely park for families who play games on the grass, have picnics, ride their bikes on the pathways and generally have a nice time outdoors. The indigenous herb garden is informative with plaques explaining all their uses. A lovely addition to the city."
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "fabulous way to spend a day. I love this park with it's fynbos gardens, kids zone, natural water features and great pathways designed for biking and walking. my teenage daughter takes often takes her skateboard, we picnic next to the water and enjoy the smell of the natural flora, The views of Table Mountain are spectacular from here and it's safe..a great place for any age group to visit, and it's situated a stones throw away from the beach...best of both worlds!"
        }, 
        {
            "index": 78, 
            "rating": "5", 
            "review": "A nice calm get away.. This was a nice experience of walking around and enjoying the area. I had a great time listening and taking it all in."
        }, 
        {
            "index": 79, 
            "rating": "5", 
            "review": "Absolutely beautiful!!. Beautiful garden. Clean and well kept. Covers a Big area so you get some privacy. There's plenty to do with the kids as well."
        }, 
        {
            "index": 80, 
            "rating": "5", 
            "review": "Clean and safe. This park, near the Moullie Point lighthouse, is beautifully maintained and absolutely safe. There are interesting walks, places to picnic and the view of the mountain is lovely. There is an outdoor gym and there are always a few joggers doing the circuit."
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "World class. Not to be missed by anybody\nSA can be proud of this incredible Park/Garden\ngreat for walks /kids even an open-air GYM\nClean -just incredible"
        }, 
        {
            "index": 82, 
            "rating": "4", 
            "review": "Beautiful secure park for old and young. Walking through this beautiful park in the centre of the built up area of Green Point, Cape Town one has to notice the clean, well kept surroundings. With table mountain as a backdrop and the ocean in the foreground this park is perfectly located and is a little piece of paradise. Safe for old and young, offering spaces for picnics and childrens birthday parties, it also boasts an outdoor labyrinth. Various walkways provide interesting sections of natural herbs, from long past to recent, used for medicinal purposes and a large variety of Cape fynbos and indigenous plants and the only Biodiversity garden in South Africa"
        }, 
        {
            "index": 83, 
            "rating": "5", 
            "review": "Nice neighborhood . Green Point Park and Beach is Absolutely beautiful and it joins up with two other beaches which joins to form one beautiful beach such as putt-putt. There are so many things going on. People are going jogging and it could be more beautiful than San Francisco Etc because the air is so crisp. One looks at them and immediately one already feels healthy. The view is beautiful because when one looks out there are low-lying clouds that are sort of purplish. The waves are Loud and crashing and the water is so cold - it is not possible to play inside the sea. However there are so many different playgrounds through the entire beach - it is actually a long seafront promenade - One can just take your pick. It is so much fun for the children. A little while further down, there is a swimming pool filled with sea water but the queue was just too long even at 8.30am! "
        }, 
        {
            "index": 84, 
            "rating": "5", 
            "review": "Fantastic day out . A great walk in the park Challenge on the gym circuit and got beat kids had a lovely time in the play park. We had a good education on the labyrinth and the time clock. Plenty space to walk and picnic."
        }, 
        {
            "index": 85, 
            "rating": "5", 
            "review": "Nice spot. A really pleasant place to walk around and enjoy some peace and quiet. And very safe. Excellent security visible. Also a spot to have a drink or coffee and a nibble."
        }, 
        {
            "index": 86, 
            "rating": "3", 
            "review": "Nice for a Quiet Wander in Peaceful Surroundings. Advised by a shop assistant that this park was outstanding so disappointed to find nothing particularly special about it. If time is short Kirstenbosch is a far superior choice."
        }, 
        {
            "index": 87, 
            "rating": "4", 
            "review": "Sunshine and good views. Lovely park for young and old and everyone in between!Soaking up some sun on the pristine lawns... Watching work groups and families playing ball games and old school silly-olympics was a good laugh!Rollerblading around the paved track, my daughter stopped at EVERY water fountain to hydrate, lol.Fish, frogs and water Lillie's in the ponds...beautiful flowers and trees and of course, stunning mountain views and the beautiful Cape Town Stadium.And finally, my daughter's favorite, the park equipment and outdoor gym equipment. We never tire of visiting this beautifully cosmopolitan space. Great picnic and party venue!"
        }, 
        {
            "index": 88, 
            "rating": "5", 
            "review": "Wonderful Walk. If visiting Cape Town with a few more days to spare and wanting an afternoon to go for a run, why not try the Green Point Park and the Mouille Point. Frequented by joggers/runners, cyclists and families, the park offers fresh sea air, great ambiance and most of all a wholesome running experience."
        }, 
        {
            "index": 89, 
            "rating": "5", 
            "review": "Clean, fresh air, awesome garden and views.... This is a \"must-see\" when you're visiting the Sea Point, Greenpoint area. This garden is kept in excellent condition by the City of Cape Town, and you won't see any litter inside. It boasts views towards the sea, the mountain (Table Mountain and Signal Hill), as well as towards the new 2010 Soccer World Cup stadium. It presents awesome photo taking opportunities, so bring your gear and tripod along. Entrance is free, and the park covers a very large area. You may bring a picnic basket, and just spend a few hours on its benches and awesome lawn areas..."
        }, 
        {
            "index": 90, 
            "rating": "5", 
            "review": "A great Introduction Biodiversity. When you mention biodiversity or being environmentally aware, people have a mix of reactions. This park is one of the best way to introduce the public to sustainability. This beautiful open space is always lush and green. The walk ways a like a mini Kirstenbosch with information about all the plants. There are many historical displays as well as beautifully artistic models of some of the animals one would find in these natural areas."
        }, 
        {
            "index": 91, 
            "rating": "5", 
            "review": "See the Lighthouse. The purpose of my visit to this park in Capetown was to photograph the very interesting red and white stripped square lighthouse, and it was a great find. Capetown is a beautiful city with more wonders than any place I have visited in the world, and Green Point Park downtown is just one of these nuggets not to be missed."
        }, 
        {
            "index": 92, 
            "rating": "5", 
            "review": "Peaceful Oasis. We found the park by accident but what a find. This park is a wonderful oasis between the City Bowl and the coast. There is a large play area at one end with paths and walkways everywhere. There are gardens laid out that you walk through and see the diverse plant life as well as various waterways that attract a variety of bird life. It is well worth spending a couple of hours here."
        }, 
        {
            "index": 93, 
            "rating": "5", 
            "review": "Fantastic . Fantastic Park. Fitness zone is quiet and nice.  Biodiversity gardens are great. Perfect place for a walk. The kids zone is fantastic. Adults usually are seen there, playing like kids eheheh. Wonderful place ... Clean and secure."
        }, 
        {
            "index": 94, 
            "rating": "5", 
            "review": "This is a Hidden Gem. We got lost and ended up in this Park. It was a blessing in disguise. The place is very nice and well looked after."
        }, 
        {
            "index": 95, 
            "rating": "5", 
            "review": "Oase. Nice park To walk in, we liked the way this park is built. You can also learn a lot about Africa. It is also made with much different things, water, flowers , stones and next To the golfcourt"
        }, 
        {
            "index": 96, 
            "rating": "4", 
            "review": "Beautifully Kept Green Space. Wonderful family-outing venue ... play, exercise and chill areas for all ages. Great for picnics and parties. Biodiversity garden a special touch.Only downfall is that there isn't a café/restaurant in the centre of the park."
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "Beautiful!. I seldom go to the Green Point Urban Park. The last time was about two years ago. The name puts me off: an \"urban\" park sounds so pretentiously inner city. And I associate it with screaming kids -- not relaxing at all.But this evening I happened to walk through it with my dog en route from Mouille Point to the Green Point Cricket Club and I was blown away by the spectacular views of Signal Hill and the mountain, and by the lush indigenous vegetation. And it is spotlessly clean.It was pretty empty save for a couple of women runners. In fact, everyone I passed was a woman! I assume this means it is a safe place to walk alone particularly as it was 6pm.I was walking in the optimal direction to see the view: from the beachfront towards the city, so I had the mountain in my sights all the time. And when I got to the East Gate (I presume that is what the gate is called -- I entered via the West Gate), the fields were full of boot campers and athletes. And a security guard was sitting in the entrance hut. The sign states it closes at sunset.I often wondered why this park was on the tourist list. But now I can clearly see why."
        }, 
        {
            "index": 98, 
            "rating": "5", 
            "review": "Money cannot buy. the joy serenity peace which Green Point Park and Biodiversity Gardenoffers. After about 20 visits I love it even more A boon for Adults and ChildrenIt is all about discovering for yourself Wetland Walk - Listen for birds,frogs and other wetland dwellers and very much more Hat camera walking shoes picnic basket maybe"
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "Awesome place for familes. Excellent place for picnics and family fun. Kiddies parties are common at this venue, access is free of charge. Lots of kiddies entertainment. great for walks or just to relax and unwind."
        }, 
        {
            "index": 100, 
            "rating": "5", 
            "review": "World class . Have a look at the park from Signal Hill and you can truly appreciate precision and natural beauty. Walk through to get lost in nature right in the middle of a bustling city. Playgrounds for the young to get jealous about, water fountains to quench a thirst, recycling facilities on par with any major international city. Truly something unique, safe, free and perfect for a picnic on a sunny day "
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "A hidden gem. We found this lovely park on our walk from the hotel to the V&A waterfront.\nA lovely place to spend an hour, wandering through the delightful gardens. Excellent view of the Mille Lighthouse."
        }, 
        {
            "index": 102, 
            "rating": "5", 
            "review": "While away a few hours on the old Green Point common. My grandmother spent a few years here during the second world war when military operations were run out of the then Green Point Common. Today the park and biodiversity garden are a much more peaceful place and a fantastic place to take friends and family for a short walk, a picnic, or just to run around in the sunshine. The gardens are beautiful and educational and there are playgrounds for kids."
        }, 
        {
            "index": 103, 
            "rating": "5", 
            "review": "Space and more space. A wonderful place to picnic and enjoy the fresh air. Interesting walks and lots going on. A perfect place for family activities"
        }, 
        {
            "index": 104, 
            "rating": "5", 
            "review": "One of the Cape's best kept secrets!. One of the Cape's best kept secrets! Brilliant walkways which is also wheelchair friendly. The toilets are well kept and ample space for the children to run about. A wonderful place to have a picnic with Signal hill in the background."
        }, 
        {
            "index": 105, 
            "rating": "5", 
            "review": "Sanctuary. What a find! Walking this park has now become one of our favorite things to do I Cape Town. There are ours of things to see, places to sit, views, interesting people, installation art and sculptures, coffee shops etc..even bicycles to hire ! The SAOS horse stables are also based here and it's such a treat to stand and watch the vey well looked after horses in the middle of the city. This urban park is a compliment to the city of Cape Town."
        }, 
        {
            "index": 106, 
            "rating": "4", 
            "review": "Lovely urban space. What a wonderful, tranquil space in the city! It is beautifully laid out and definitely worth visit."
        }, 
        {
            "index": 107, 
            "rating": "4", 
            "review": "Quiet and serene place to relax. Nice scenic place to enjoy the quiet side of Cape Town. Not highly touristic like City Bowl or V&A Waterfront area."
        }, 
        {
            "index": 108, 
            "rating": "4", 
            "review": "Nice experience. Accessible, very clean, a place to relax with family, friends or just on your own. A lovely atmosphere in the park, peaceful, serene, interesting little eco parks and fitness centres."
        }, 
        {
            "index": 109, 
            "rating": "5", 
            "review": "Pleasant park. Go only if you've already been around the more iconic places and have time to spare. Free attraction and would be appreciated by active kids. Go on a nice day. Walks to shelter are far if you're caught on a rainy day. Bring a picnic. The playground for kids are very nice and separated by age groups. There's also an outdoor \"gym\" for adults. Very nice."
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "A Beautiful Green Lung in the Heart of Cape Town. This easily accessible Park and Garden is a lovely addition to the Greenpoint-Seapoint walking route. It is beautifully tended, dogs on leads are very welcome, there is a really nice safe children's play area and we include it in our round trip promenade/park dog walk. Well done City of Cape Town."
        }, 
        {
            "index": 111, 
            "rating": "4", 
            "review": "Nice place. Park is very clean and a nice place to relax and have a picnic. Lots of people there taking advantage of the park and looks like the kids really like this place"
        }, 
        {
            "index": 112, 
            "rating": "5", 
            "review": "Clean & well worth the visit.. Lovely park with a contemporary feel to it. Ideal for late afternoon walks & ideal for families looking for a safe area for kids to run free."
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "Green Point Urban Park. Picnics in the park, long walks and children playing on the grass and at the urban jungle gym. A fantastic, semi hidden gem at Green Point. Lovely fresh water points along the way. Runners jogging past us with a wave and a smile. Put your troubles away and take a meander through the park. Not to be missed."
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "Fun for Kids. Wow a must for families the park offers picnic area , park all in one I would advise going earlier if you dont like crowds because the park can get very busy over weekends . I normally like early mornings more space and less people . Enjoy"
        }, 
        {
            "index": 115, 
            "rating": "5", 
            "review": "Beauty of nature. This is in a quiet secluded area where the rarest animals can be found. They have interesting plants and you can move at your own pace as there is no one to distract you from the peace and quiet."
        }, 
        {
            "index": 116, 
            "rating": "5", 
            "review": "Relaxing Park near city. A much needed, gorgeous park close to the stadium and city centre. Lovely for walks, wheelchair friendly (although they do not supply loan wheelchairs (! ) - pity. Once the trees are larger and offer more shade, it will become even more popular. Well kept."
        }, 
        {
            "index": 117, 
            "rating": "4", 
            "review": "My beautiful Cape Town. This park is opposite our national football stadium. It is a child friendly part. No really what I would call a sight to visit. There are more exciting things to see!"
        }, 
        {
            "index": 118, 
            "rating": "4", 
            "review": "A haven near the city. A really special and relaxing place to visit and just few minutes from the city center. Great for kids and for a bit of exercise. Do a walk through the garden and also along the coast towards Sea Point."
        }, 
        {
            "index": 119, 
            "rating": "4", 
            "review": "Amazingly beautiful scenery. The scenery is absolutely amazing! I love to take my family there for picnics and it is situated conveniently in the middle of town. It is a little on the full side with locals also enjoying the place. The toilets weren't as bad as i expected a public toilet to be and the smelling garden was absolutely amazing. Can't wait to go back!"
        }, 
        {
            "index": 120, 
            "rating": "5", 
            "review": "Sun, Walk and absorb the experience. Saturday morning was as beautiful as ever in Cape Town, a crisp bright day with warm sun, but the winter kept the temperature on check. Wonderful walk in the Green Point biodiversity park from the East Gate to West Gate to the light house at Mouille Point."
        }, 
        {
            "index": 121, 
            "rating": "4", 
            "review": "Soak up the sun, snap some shots and smile :). Great place for dogs or bikes, a picnic or just a relaxing walk!\nUnless meditation is your thing then try the zen zone!"
        }, 
        {
            "index": 122, 
            "rating": "4", 
            "review": "A great place to spend an afternoon. When you're at a loose end over the weekend and the kids are dying for a place to run around or ride their bikes, this is the place we choose to go. There is so much to enjoy here that there is bound to be something you like. Whether it is watching the seagulls play in the water or having a go on the free exercise machines, you will wile away many happy hours here."
        }, 
        {
            "index": 123, 
            "rating": "5", 
            "review": "Totally zen experience. So happy to see taxpayers money being utilized effectively. This park compares with the best in Europe that I have seen. For City dwellers this must be a bit of heaven. Delighted by the friendly staff and groundskeepers, amazed by the effort that has gone into its creation and kudos to the City of CT for keeping it in tip top shape. Best of all.... It is free!!"
        }, 
        {
            "index": 124, 
            "rating": "3", 
            "review": "it's OK. Well, it's OK, there's lots of families with dogs and kids, it's a public space where people like to come and get some fresh air...don't go out of your way to see it; I rather walk along the promenade along the ocean."
        }, 
        {
            "index": 125, 
            "rating": "5", 
            "review": "Capetonions are very fortunate to have this. Green point Park is so popular because they gave done something right this time. There is something for all ages to do and see there and if one doesn't feel like too much hard work.. Pack a picnic basket and have a lazy day in the park."
        }, 
        {
            "index": 126, 
            "rating": "4", 
            "review": "Outdoor fun. Get the kids to run, swing and exercise with the various pieces of specialised playground equipment designed for exercising whilst playing in the par."
        }, 
        {
            "index": 127, 
            "rating": "4", 
            "review": "Large well kept park close to our hotel and the waterfront.. Large well tended park close to our hotel (Cape Royale). We visited it for the Greenpoint Park Run (Saturday mornings) and found it was lovely to chill for an hour or two afterwards."
        }, 
        {
            "index": 128, 
            "rating": "5", 
            "review": "Lazy day. The real benefit of the World Cup was this wonderful garden walk. Take an hour take three or spend the day. Lovely walk near the city and the sea. A great area for picnicking too."
        }, 
        {
            "index": 129, 
            "rating": "3", 
            "review": "park is getting there. lovely place to walk around - ner to promenade and restaurants etc. under utilised so far - def worth a look"
        }, 
        {
            "index": 130, 
            "rating": "5", 
            "review": "great for a run, a walk or a family picnic. what a great park! only if all parks were this beautiful! great for a run in the summers or a walk. I have seen many families on picnics there so i am guessing it is a great picnic spot especially because it has lot of kid friendly activities. But you dont need to be a kid to enjoy this park, just take a stroll through it and you will instantly feel de-stressed!"
        }, 
        {
            "index": 131, 
            "rating": "5", 
            "review": "Ultimate place to de-stress in Cape Town. This is an awesome garden, so immensely peaceful. Even if full of people on a weekend they are all so chilled and relaxed you find yourself smiling and greeting complete strangers. Kids are crazy for the place and is the perfect venue to get them more knowledgeable about nature."
        }, 
        {
            "index": 132, 
            "rating": "1", 
            "review": "Who's in charge???. Firstly, thanks for reading this. My issues are coming on since 2012 and I've finally gotten around to saying something about it.I contacted the city of cape town (they are still the contact entity for the park) just before I got married in 2012 to ask permission to use the park for photos, as security at the park indicated that permission was required. I was told that I did not need permission as it was a public park and it was free to use for the photos. I still have the email chain where security and park maintenance was informed. On the day, 21 April 2012, after the wedding ceremony, we went to the park to start the photo session. Soon after we started, we were approached by security informing us that we are not allowed to take photos there. I said to the security that we were given the all clear as it was a public park. The security officer maintained that written permission, in the form of a permit, was required. She then said she would call her supervisor to corroborate her information. When the supervisor arrived, she too indicated that we need permits, as we were in the bio garden and that was the requirement. I said to her that the City had indicated that the park was open to use. She also then said that the City had no jurisdiction there and should not be making such decisions or offering such information. I was then told that I could take photos on the grass, but not in the garden. Needless to say I was not at all happy. They even threatened to remove my wife and I from the park! I just left the park in disgust.Then earlier this year (2015), I was planning a picnic in the park to celebrate my daughter's first birthday. In preparation, my wife contacted the city of cape town (Patricia Giliomee) telephonically to ask about regulations regarding groups of people meeting in the park and rules regarding picnics etc. Because it was in January, we knew we would need to cater for shelter from the sun, so she also asked whether a gazebo could be setup for shade. The feedback was that we could use the park, no special permission was required, and regarding the gazebo, the only rule is that we could not pierce the ground as we may damage the irrigation system. That suited us fine as we could tie it to cooler bags or poles in the immediate area. On the day, we got there, setup in the play area far from the bio garden, then were approached by security who told us that gazebos were not allowed. We said to the security officer that we were told that gazebos were allowed. She then said she would get her supervisor. When the supervisor arrived (same lady as in the previous incident), she reiterated that gazebos were not allowed and that signage at the various gates indicated as such. When we said that we'd spoken to Patricia Giliomee who indicated that all was in order, the security supervisor didn't know who that lady was! She (again) indicated that the city has no jurisdiction there and should not be making such decisions or offering such information, and should we not take down the gazebo, we would be removed. Again, I was not a happy camper. I decided to just forget about it, took down the gazebo, and tried to have a good time.The only reason I am writing this is because it seems that everyone else has had fantastic experiences. People need to know that no-one seems to know who's in charge. As beautiful, well-kept and kid-friendly the park is, I will think twice before planning anything there."
        }, 
        {
            "index": 133, 
            "rating": "5", 
            "review": "theSouthAfricanreview. Great family picnic spot. We loved this park. It is great for the kids with many many kid activities, water games and exploratory features. This is a great place to inspire the lone scientist."
        }, 
        {
            "index": 134, 
            "rating": "4", 
            "review": "A place of new culture and old. I first went here on my initial visit to Cape Town to see the Crews with their street music. I was the only English man in a crowd of 100,000. This is now all rebuilt and a pleasant place to visit, but I thought I heard the ghosts of the poorly played buskers on the wind"
        }, 
        {
            "index": 135, 
            "rating": "5", 
            "review": "A go back place. Nothing to dislike. A place where you can enjoy a variety of activities whether it is a DIY party or you want to exercise. Safe and clean for all ages."
        }, 
        {
            "index": 136, 
            "rating": "5", 
            "review": "One of Cape Town's finest parks. The kiddies play area is amazing! The park is well maintained and the ablution facilities are very neat. Park is also great for little kiddies on bicycles and scooters!"
        }, 
        {
            "index": 137, 
            "rating": "5", 
            "review": "Shhh! This is one of Cape Town's best-kept secrets.. This is such a great Cape Town experience. I mentioned it once to a pair of American tourists who were a bit \"meh\" about the idea and I thought, \"Great, we locals are more than happy to keep it to ourselves.\" We really know how to use a good park. There are always several parties underway, there are safe play areas for all ages of kids, the picnic areas have seating and shading, it's always clean... oh and did I mention it's beautiful? Great view of Table Mountain, several different gardens all with thoughtful signage, lovely walks, ponds, birds and art. My personal favourites are the sun dial and the labyrinth. Have fun seeking them out!"
        }, 
        {
            "index": 138, 
            "rating": "5", 
            "review": "Always fun..... Brilliant way to spend the day lazing in one of the biggest parks in Cape Town. Amazing place for kids and adults to let go and be free....a great picnic spot with tables and beautiful green grass. The parks are great for all ages and the gardens are amazing for the eco visitors..."
        }, 
        {
            "index": 139, 
            "rating": "5", 
            "review": "A Garden experience. Do you want fun, excercise, family time, great views, a relaxing experience, then you cannot miss this park? I work for the COCT and I was so proud! A lot of research and care has gone into the development of this garden and this gives an opportunity to even the dwellers of tonships and flats alike to experience a taste of freedom and togetherness. The art of the garden is another huge plus factor. Truely an experience not to be missed."
        }, 
        {
            "index": 140, 
            "rating": "5", 
            "review": "A haven of peace and tranquility or perfect for family fun!. This park has added such richness to Green Point! It has so many pluses:It is perfect for picturesque runs in the early morning. It is fun for bird watching and learning about local plants.It is peaceful with many quiet benches were one can sit and relax.Weekends are perfect for family picnics and there is a good sized park for children.A perfect family place!"
        }, 
        {
            "index": 141, 
            "rating": "4", 
            "review": "Well done Cape Town. Wht a lovely park withuch a variety of plantssbeautifully presented. Easy walking and plenty of benches to rest on if needed."
        }, 
        {
            "index": 142, 
            "rating": "5", 
            "review": "Nice garden and playground. This park has an interesting display about khoikhoi people and the life around the cape before the Europeans. Nice garden with indigenous plants and stories of their household and medicinal use. Also, two big playgrounds for kids!"
        }, 
        {
            "index": 143, 
            "rating": "5", 
            "review": "Awesome open space. One of the best things that has been done for the CBD, the park is great. A great place to unwind, with kids playground, open and shaded areas, and the walk through the biodiversity garden is very educational for those interested in the plants of the region.."
        }, 
        {
            "index": 144, 
            "rating": "5", 
            "review": "Awesome and must be one of the best parks in Cape Town. The park is very well maintained and clean. It is a must for families with young children. The foot paths leads to water ways and wonders of years ago."
        }, 
        {
            "index": 145, 
            "rating": "4", 
            "review": "Nice place to chill... When the weather is nice and you need a place to do nothing, this is the place to go. There's room for playing, relaxing, having a picnic, take pictures of the lovely surroundings or just do whatever you like. I've spent a lot of hours there when I was living in CT a few years ago and to get back in 2015 seeing how it has changed to an even better place was awesome. At the same time it's close to Waterfront, the stadium and the Light house."
        }, 
        {
            "index": 146, 
            "rating": "5", 
            "review": "Take a little time. I am fortunate that I have a relative who works opposite the park and have seen this built from nothing. Always go in and photograph the lake and birds. A little piece of heaven in the city."
        }, 
        {
            "index": 147, 
            "rating": "5", 
            "review": "Feels like home. Summer is paradise in this Park. Go there with your kids, your dogs (doggby bag and leash requested, obviously), go for a run, to read, to watch ducks, golfers, to a playground for children, to ride your bike, to play in a small maze.Amazing views of Signal Hill and very close to Mouille Point where thereis a promenade to walk besides the sea and if you are lucky to see some whales."
        }, 
        {
            "index": 148, 
            "rating": "5", 
            "review": "Safe, green and clean. We discovered this park while out for a walk. Even though the biodiversity garden is aimed at children, we had a lovely time spotting the hidden animals and reading about the fauna and flora of the area. There are many shady nooks where you can rest. We were there on a Sunday afternoon so there were many children happily playing, but thanks to the play areas, they were not underfoot."
        }, 
        {
            "index": 149, 
            "rating": "4", 
            "review": "A Stroll through the Park. Interesting parts and information in the Biodiversity Garden.The restrooms are set out nicely. Big open clean spaces-hope it stays like that."
        }, 
        {
            "index": 150, 
            "rating": "5", 
            "review": "Stunning park with a breath-taking backdrop. What could be more beautiful than Table Mountain in the background and sea-breezes wafting over the play area? This is a lovely area of open ground with plenty to keep the children busy and active. There are two environmentally-friendly play areas, an outside gymnasium, a biodiversity garden full of intesting facts, large shady areas for picnics, a maze, pond and wheelchair friendly walkways. A great morning out for the family."
        }, 
        {
            "index": 151, 
            "rating": "5", 
            "review": "Lovely Family Picnic Venue . We took our kiddies here for a morning and it was lovely. Plenty of playground equipment for them to play on as well as lots of open grass area. Tables and chairs to sit on surround by lakes and waterfalls and mini walks.Was very relaxing and could spend the whole morning or afternoon there. WouId definitely recommend going there if you have small children."
        }, 
        {
            "index": 152, 
            "rating": "4", 
            "review": "Great for families. The park is FREE entertainment for everyone. There are 2 kiddies play areas for different ages with age appropriate equipment. There is plenty of shade and lots of picnic space. The park also offers 'Park Run' events. Lots of convenient parking too."
        }, 
        {
            "index": 153, 
            "rating": "5", 
            "review": "Green jewel in City. What a joy to behold! The Greenpoint park and Biodiversity Garden is an example of what an urban park should be - a reminder of how great nature is and an opportunity to feel that you can be part of it, although you are only a heartbeat away from the CBD! It is beautifully laid out with consideration being given to all the City's inhabitants: old, young, eco-conscious and animal lovers (thank you, thank you for allowing us to bring our beloved dogs along, as well as supplying us with poop bags and the opportunity to recycle waste.)Unobtrusive park attendants are present, providing information if required and making the park safe to enjoy. The park is so clean and well-maintained, one couldn't possibly entertain the idea of sullying it in any possible way.Walking through the park today, I felt proud to be a Capetonian!"
        }, 
        {
            "index": 154, 
            "rating": "5", 
            "review": "Wonderful Open Space. Walking through the park was the obvious route to the seafront from our guest house and we always enjoyed seeing the locals having their picnics, walking their dogs, exercising or whatever and everyone was very friendly. It is a beautiful public space and I imagine it will only become more so as some of the trees etc mature over the years. It is clean and well-maintained also."
        }, 
        {
            "index": 155, 
            "rating": "5", 
            "review": "Fantastic park for all. Beautiful to have such a large expanse of greenery in the centre of the city. What a fantastic development that is clearly enjoyed by everyone. Great parks for different ages and beautiful water features."
        }, 
        {
            "index": 156, 
            "rating": "5", 
            "review": "An oasis in the city. I last visited just after the park was created and its great to see how the plants have established. Its a safe environment to walk around in and a great educational tool for kids. My walk through to find the local Geocache actually relaxed me before heading off to the CTICC for the day."
        }, 
        {
            "index": 157, 
            "rating": "5", 
            "review": "Great picnic spot and park!. Well-maintained with beautiful views. Plenty to do for the kids! Sundays get full, so arrive early to get a spot.Open gym and 5km jogging track along allows one to exercise while breathing in fresh sea breeze :)"
        }, 
        {
            "index": 158, 
            "rating": "5", 
            "review": "What a place to chill out. One of Cape Town very few fee attractions, it has playgrounds for younger and older kids and yes as well as for adults (exercise equipment) The garden is quite beautiful as well. Lots of space and benches. Just be careful of the wind"
        }, 
        {
            "index": 159, 
            "rating": "4", 
            "review": "A great place to amble. It is a place to stop and look as you walk along the esplanade at Greenpoint. If you have children they must have a go on the Greenpoint Rotary miniature railway -which has now been running for 55 years!"
        }, 
        {
            "index": 160, 
            "rating": "5", 
            "review": "Paradise on earth. This strip of land is like paradise on earth. I wish to visit it again, this time on foot. It's good for jogging. The place is so clean."
        }, 
        {
            "index": 161, 
            "rating": "5", 
            "review": "A truly beautiful place!. Every time we visit this park we see something new. It has something for everyone. Play parks (split into 2 by age groups ), shaded seating, tables for picnics, several gardens with different themes, water features and plenty of space for running around. We love it and always go there when we visit our family there."
        }, 
        {
            "index": 162, 
            "rating": "5", 
            "review": "step away from it all. just a pleasant place to step way to. to think this is all done on the sea-bed. take the kids or take a book, get your training gear on, either way enjoy the beauty between city and sea."
        }, 
        {
            "index": 163, 
            "rating": "5", 
            "review": "Tick it in your itinerary as a must. One of my favourite places to visit - take an early morning walk and experience the lifestyle of Cape Town residents in the beautiful park. Particularly like the indigenous gardens. Definitely worth a visit"
        }, 
        {
            "index": 164, 
            "rating": "5", 
            "review": "If you feel you need to move a little.... Very well laid out park that seems to be frequented mainly by locals; dog walking allowed on leashes, music in the park at times, quite peaceful early mornings, great indigenous and endemic planting!"
        }, 
        {
            "index": 165, 
            "rating": "4", 
            "review": "Large green park. Great walk from red bus last stop at lighthouse to waterfront through well maintained park, past stadium, then on ope street with wide sidewalks to the waterfront. Felt safe. Good park to relax in or play. Lots of room. Likely very good family outing"
        }, 
        {
            "index": 166, 
            "rating": "5", 
            "review": "Fun for all!. great toddler play area, older kids play ground. space for bicycles, picnics, lazy walks, and even adult excersize equipment. Easy parking."
        }, 
        {
            "index": 167, 
            "rating": "5", 
            "review": "A Gorgeous place. It's one of the best of it's kind in the world. We loved the trees, the flowers and the little animals scurrying around the area. Also a delightful little restaurant for when you need to take a break."
        }, 
        {
            "index": 168, 
            "rating": "5", 
            "review": "A HAVEN IN THE CITY. Information, atmosphere and a sense of community combine here in a great place for exercise, meeting friends, picnics and chilling out."
        }, 
        {
            "index": 169, 
            "rating": "5", 
            "review": "Accesible Outdoor beauty. Well worth the visit the park is centrally located and has access to many great tourist destinations like the mountain and cable car, the waterfront and the Cape Quarter. The views are stunning and the gardens themselves are very lovely."
        }, 
        {
            "index": 170, 
            "rating": "4", 
            "review": "Family outdoor fun with invaluable nature experience. A cbd experience that surprises and delights, a precious reflection of an urban expression to be proud of, don't forget the picnic basket, camera and share it with loved ones."
        }, 
        {
            "index": 171, 
            "rating": "5", 
            "review": "Great for a picnic with kids. Although we do not have small children any more and no grandchildren yet, we cannot fail to notice how much kids enjoy this space every time we go for a walk here. This is a great interactive space for kids of all ages and wonderful for a picnic. But you do not have to be a child or have kids to appreciate this wonderful green space. Ideal for a quiet afternoon or morning."
        }, 
        {
            "index": 172, 
            "rating": "5", 
            "review": "Greenpoint Park. What can I say its a family outdoor adventure where kids get to play i see many people having ourdoor kiddies parties in the park which is fun and the amenities and park activities for the kids is very well balanced. Generally a very clean park and lots of attractions for little ones"
        }, 
        {
            "index": 173, 
            "rating": "4", 
            "review": "As it says a garden full of surprises. Biodiverse it is....lovely garden it is....beautiful situation it has....all kinds of plants and shrubs and trees it has....A garden for Cape Town to treasure and be proud of."
        }, 
        {
            "index": 174, 
            "rating": "3", 
            "review": "Nice stroll. Fortunately there is a park in Greenpoint. Well done!It is nice to walk in, easily walked and there are several play areas for children as well."
        }, 
        {
            "index": 175, 
            "rating": "5", 
            "review": "Must Visit. The atmosphere and peace in here is unbelievable.it has such a relaxing and soothing feel, Can just sit and enjoy the view for hours. It has Tranquil atmosphere"
        }, 
        {
            "index": 176, 
            "rating": "5", 
            "review": "Lovely park well worth a visit. A brilliant park with various bio-diversity areas of plants, flowers and wildlife. We went for a walk there on a Sunday around lunch time and the picnic areas were packed with families laying out tables with cloths and picnic baskets and children running around the play areas, with friends playing football and other games. It had a great atmosphere ,then walking around the ponds and gardens it was very tranquil. We nearly fell over a goose resting on a bridge. It was jut a lovely place to go on a sunny Sunday. Cape Town is a fantastic place to have a holiday. So do not be put off because we never at any time felt unsafe. We planned our own holiday and we everywhere."
        }, 
        {
            "index": 177, 
            "rating": "4", 
            "review": "A place suitable for energy bunnies. A nice place for family and if you have very energetic children like mine, then this is the right place for you."
        }, 
        {
            "index": 178, 
            "rating": "5", 
            "review": "A new addition to the City. The care and attention to detail that went into the planning and development of the very special place impresses me. It's great to see people of all ages and persuasions enjoying this outdoor experience. You can learn, have fun or just chill."
        }, 
        {
            "index": 179, 
            "rating": "5", 
            "review": "An inheritance from the World Cup Soccer Tournament in 2010. This is such a lovely park to take the grandchildren. Entry is free. There are 2 different play-areas for younger and older children, which are close enough to each other for mom and dad to keep an eye on the offspring. There's plenty of parking, places for picnics, children's parties. A walk in the educational biodiversity garden is a must, because the children just love exploring, and spotting the \"hidden\" bead insects and birds among the fynbos and rural huts."
        }, 
        {
            "index": 180, 
            "rating": "4", 
            "review": "Piece and quiete. Had such a Lovely walk in this beautiful park! not busy even on the most sunny days! there is a huge playpark for kids and lots of stuff to see or just take a nice walk. It is free and you can just take a blanket and have a picknick! loved it"
        }, 
        {
            "index": 181, 
            "rating": "3", 
            "review": "average. Not worth a special trip but fine to visit if in the area. Not really much else to say to fill 50 words character."
        }, 
        {
            "index": 182, 
            "rating": "5", 
            "review": "Green Point Park. This is a very well designed area with plenty of facilities for everyone. It provides a peaceful place for fresh air and exercise."
        }, 
        {
            "index": 183, 
            "rating": "4", 
            "review": "wonderful park. This amazing park is just wonderful for families and people of all ages. The most superb play park for the kiddies, kept beautifully clean and tiny, outdoor fitness equipment for the adults, paths and trails to ride or jog and lovely peaceful areas to enjoy the wildlife.But one big disappointment - there is no little cafe to get a cold drink, ice cream or coffee. There was one 3 years ago but evidently when they applied for planning permission it was turned down on the grounds that the zone is recreational. Very short sighted Cape Town City planners, the building is already there so you might as well put it to good use. Everyone needs a drink or an ice cream when at the park!"
        }, 
        {
            "index": 184, 
            "rating": "5", 
            "review": "Enjoy Greenpoint Park near The Cape Town Stadium. Greenpoint Park and Biodiversity Garden is only a skip and a hop away from the beautiful Cape Town Sports Stadium, and a 5 minute drive from the city. There is an interesting garden area, featuring different types of vegetation, and the plants are well-labelled, and their uses are explained. There are plenty of ponds for water birds, for example, ducks, seagulls, Coots, and Moorhens. The water is refreshing and cool to look at, and the paths are wheelchair friendly, and suitable for prams. There are plenty of beautiful green lawns, where one can take a picnic, and enjoy the time away from the stress of the city, and relax with family and friends."
        }, 
        {
            "index": 185, 
            "rating": "1", 
            "review": "famliy party. At times, you find that one or two big families essentially take over the park. Short of the kitchen sink they bring everything along. Same rules as at Kirstenbosch schould apply. No chairs, no tables, no umbrellas."
        }, 
        {
            "index": 186, 
            "rating": "5", 
            "review": "Beautiful . Green point best kept secret. What a nice place to walk though. It is very quiet and lots to see. So many different ways to walk . And plant life to see and the ponds and lake are very nice. It is very well looked after."
        }, 
        {
            "index": 187, 
            "rating": "5", 
            "review": "Garden setting with mountain & sea views. The kids love the open spaces and the adults enjoy the freedom of relaxing knowing the kids are having hours of fun. Family. Friends. Outdoors. The Park is the new venue for all the kiddies birthday party."
        }, 
        {
            "index": 188, 
            "rating": "5", 
            "review": "Green Garden. it is a dream to spend time at this destination. kids playing around, adults sitting and enjoying the sun all safe and sound."
        }, 
        {
            "index": 189, 
            "rating": "5", 
            "review": "Green space in the City. The park is beautiful, lush lawns, water features, seating and has jungles gyms to entertain the kids.Close to food outlets, Cape Town stadium and Sea Point Pavilion. Great place to relax and unwind while the kids enjoy the wide open space"
        }, 
        {
            "index": 190, 
            "rating": "5", 
            "review": "Best kept secret in the CBD. This park is absolutely amazing and has the best display of the bio diversity of our plant life besides Kirstenbosch. Don't miss a visit if you are near the stadium"
        }, 
        {
            "index": 191, 
            "rating": "5", 
            "review": "Great for the kids. We took a walk through the gardens on a lovely sunny day. The kids had a great time on the jungle gyms and the park is beautiful, safe and well kept."
        }, 
        {
            "index": 192, 
            "rating": "5", 
            "review": "Fun park. Greenpoint Park is a really well equipped, fun park for kids and adults. There is a separate area for younger kids. Lots of fun play equipment in one area of the park. In another area, there is an outdoor gym. There are also tables to use for picnicking, and lots of lawn space to run around or sit on. There's also a small but interesting biodiversity garden to walk through. This is a big hit with all ages and definitely worth a visit. Best of all, it's free :)"
        }, 
        {
            "index": 193, 
            "rating": "5", 
            "review": "Greenpoint Park. Inexpensive, fantastic outing for any age - whether baby is in a stroller or granny is in a wheelchair - this park is really worth a visit."
        }, 
        {
            "index": 194, 
            "rating": "4", 
            "review": "Fun park. Fun park for a picnic especially good for kids. Great for a walk as well. Close to restaurants. Need more shaded areas."
        }, 
        {
            "index": 195, 
            "rating": "5", 
            "review": "Park a Gem as always!!. We had the pleasure of an outing with friends to the park during the school holidays...last week (29Dec.2014)It was a scorching hot day but in the park there was a lovely cool sea breeze. The park is well maintained & am sure there is a constant flow of locals as well as visitors so its lovely too see everyone appreciating this park since its opening.The walkways, benches/ seating areas & Biodiversity Garden is lovely, though the kiddies did complain the play equipment was hot to touch...so maybe shades (over the play equipment) would be/ could be a welcome addition for our scorching African sun ;)Lovely overall, kids always have a blast!! Blessings for 2015 GP Urban Park (^_^)"
        }, 
        {
            "index": 196, 
            "rating": "4", 
            "review": "Lovely place for children. Excellent park for fun and education.Not only does this park have lovely lawns and playgrounds for children but also has collections of interesting plants in various areas. Good place to learn about plant diversity, endangered plants, etc."
        }, 
        {
            "index": 197, 
            "rating": "1", 
            "review": "Terrible. I just don't understand previous reviews here. Ok perhaps the history of where this park comes from suggests great improvement, or as a fitness buff appreciates the equipment, or parents having wide space to let kids loose, but from my eyes this park is way below impressive.Pretty much all plants/trees are in such poor condition and in serious need of attention. They offer no shade and the area is about as dull as it gets. Ok a new park will with time, offer amenity but seriously I would give it another 20 years."
        }, 
        {
            "index": 198, 
            "rating": "5", 
            "review": "Wonderful once again. We visited the park with our kids, friends, bikes, roller-skates and picnic. Absolutely fabulous day with all groups of park visitors being so friendly. Park kept clean - no litter. Kids made friends and played until they dropped. Park is quite sheltered from the wind. Kids play area has a soft ground covering making it extra suitable for kids. Pack kids shoes if you will be there past mid-day because the play equipment gets hot in the sun (it was 31 degrees C today). I didn't think there is a place in the park that sells food, so bring your own picnic. There are drinking water fountains in the park."
        }, 
        {
            "index": 199, 
            "rating": "5", 
            "review": "What Cape Town wants to be. What I loved about the park was the demographic, the space and the social aspect. There are dogs and children and everyone accommodating everyone else which doesn't happen all over Cape Town. No one is particularly snotty, it is just a chilled environment for everyone to experience what Cape Town could be."
        }, 
        {
            "index": 200, 
            "rating": "5", 
            "review": "Lovely outdoors area. Such a well maintained park - space for picnics, play with young kids, running, walking or just enjoying."
        }, 
        {
            "index": 201, 
            "rating": "5", 
            "review": "Nature lover. Taking a walk through this Park and Biodiversity Garden is a must. It caters for all. There are lovely tables and benches for you to relax at and place to have a picnic, fly a kite or the children to play and ride their tricycles. The Garden is a must to visit and knowing the history of this Park is too. There is also an outdoor gym in the park and instructions on how to use the equipment for those who don't have time to sign up at a gym."
        }, 
        {
            "index": 202, 
            "rating": "4", 
            "review": "Lovely Park. Greenpoint Park and Biodiversity Garden is a green park right in heart of the city. It is a wonderful place to play and spend quality outdoor time with friends & family. Highly recommended to take a walk through as there are various different activities to enjoy!"
        }, 
        {
            "index": 203, 
            "rating": "5", 
            "review": "An Educational Walk. A wonderful space not far from the Waterfront, and the CBD, and a mere hop and skip to the promenade for a seascape worth the walk. The integration of old and new, of Heritage and Culture interwoven with Nature's eco-system and its vast biodiversity is an educational journey on its own - with free access for all to enjoy. Well Done Cape Town :-)"
        }, 
        {
            "index": 204, 
            "rating": "4", 
            "review": "Green lung of the city!. I knew this park when it was playing fields & I am so impressed at how well & imaginatively they have laid out this park with all it's various features catering to all age groups & tastes. A must visit for all tourists!"
        }, 
        {
            "index": 205, 
            "rating": "5", 
            "review": "great for the kids and sunday walk. this is a well kept park perfect for a walk , take the kids to lay or just lye around on the grass taking in the atmosphere.a must stop when goin on your promenade walk."
        }, 
        {
            "index": 206, 
            "rating": "5", 
            "review": "Couldn't be better. Well done Cape Town for creating a beautiful public garden of a very high standard. This green space really has something for everyone. A park for the kids, a quiet spot in the shade of the trees and the informative biodiversity garden. It is also a great space for a bit of exercise. I am considering a Christmas morning picnic there with my family this year.PS There is parkrun there every Saturday morning at 8am - a free timed 5km run. http://www.parkrun.co.za/greenpoint"
        }, 
        {
            "index": 207, 
            "rating": "5", 
            "review": "A lovely creative parkland. For a couple of hours relaxation, we always enjoy a visit to the Green Point Park, be it an early morning walk through or an afternoon experiencing the wide variety of fynbos and indigenous plants. An ideal spot for young children to enjoy the creative play equipment and just to run around and have fun. A must visit!"
        }, 
        {
            "index": 208, 
            "rating": "5", 
            "review": "Green Point Park. Ideal venue for family gatherings and parties for kids. Play area for little kids and big kids. Park is beautiful and clean with ablution facilities and safe."
        }, 
        {
            "index": 209, 
            "rating": "4", 
            "review": "Starting to fade.... While still an awesome place to spend a few hours in the fresh air it is starting to lose some of the \"shine\" and well cared for look it had a year or more back which is such a pity!Still a beautiful place except for the people on bicycles who think they own the place late Saturday afternoon!"
        }, 
        {
            "index": 210, 
            "rating": "5", 
            "review": "A gem in Cape Town. Wonderful park for Capetonians and visitors alike. Thoughtful, educational, well-designed, well-maintained. Great for old and young alike. The high standard set here in terms of what's on offer has the effect of ensuring everyone 'behaves' well. We've been here a number of times, as a group, as couples, as families - it's always pleasant and great to walk around in, or through. There are opening hours - closes at around sunset."
        }, 
        {
            "index": 211, 
            "rating": "5", 
            "review": "Perfect park. An oasis of calm in the city, Greenpoint Park and Biodiversity Garden is a fantastic place to go for a walk, run, picnic or simply read a book. The Biodiversity Garden is very informative; I wish this kind of project could be replicated in other cities."
        }, 
        {
            "index": 212, 
            "rating": "5", 
            "review": "Just the best!. This Park is totally awesome. I love that there is a play area specifically for under-6s, one for older kids and then all sorts of beautiful spaces and places within the Park!"
        }, 
        {
            "index": 213, 
            "rating": "4", 
            "review": "An excellent use of ground which was unuseable for years... The walkways were so easily taken while the new beds and gardens were beautifully finished for visitors to enjoy both flora and fauna. The waterareas were well contained and not a danger for young children. A very refreshing venue for a family outing, with no possibility of crime. It can be easily found beside the new rugby stadium at Greenpoint."
        }, 
        {
            "index": 214, 
            "rating": "4", 
            "review": "Lots to see and do. We were there for a prize=giving of the SA Scouts. Very impressive. After the presentation we walked all over the park. In some areas there has been a lot of work done to make it special. We quite astounded at how big the area was and how many people were using it for pleasure. Brilliant idea."
        }, 
        {
            "index": 215, 
            "rating": "5", 
            "review": "bit of green within the city. What a lovely place to relax and spend some time and it adds to the bit of nature within the city.\nWith the soccer stadium next to it the green is a nice contrast next to the concrete jungle."
        }, 
        {
            "index": 216, 
            "rating": "4", 
            "review": "A lovely walk linking Green Point's Main Rd to the ocean. During my visit to Cape Town, I stayed in Green Point off of Main Rd and walked almost daily over to the lighthouse and the promenade, stopping along the way to bird watch and stroll the garden, which really is informative and has fun statues. The park really is great for joggers and those seeking a quiet spot to read along the little lake facing the golf course, plus there are areas for the kids to play or to have picnics with Lion's Head and ocean views. Special events are also held on the grounds, such as the opening of the annual Diwali festival, which started the second day I was in town.Bonus for Geocachers: There's a cache hidden in Biodiversity Garden. Check it out!"
        }, 
        {
            "index": 217, 
            "rating": "5", 
            "review": "A wonderful surprise in my mother city. We watched the stadium being build amounts all the hype of 2010 word cup soccer. We all vaguely know about an Eco park being developed, but wow I'm blown away. The park links Moullie point and the beach through the park to the stadium and green point restaurants and gym. It's and awesome concept. Educational as well as relexing. It's obviusly appreciated and well used as evidenced by all the families sharing picnics. Facilities are excellent with benches and nooks for families to gather around. We loved the labyrinth, a most unexpected find."
        }, 
        {
            "index": 218, 
            "rating": "5", 
            "review": "A stroll in the most unexpected place.... Right in the heart of Green Point, totally unexpected this beautiful vast green expanse, for walkers, joggers, family's taking their children out, or walking the dogs...simply beautiful"
        }, 
        {
            "index": 219, 
            "rating": "5", 
            "review": "The City Working For All of Us. Been wanting to go to this attraction for a while, last time ran out of time trying to find the place. The Virgin Active is a landmark. This attraction is free and amazing. This is a great family place especially if you have small children. You need to either go early or later for the \"second sitting\". The operating hours is sun rise to sun set, summer here we come. Did not have time to visit the Diversity Park, saved for next time. After the visit, agree with the high rating of this attraction and recommend to both locals and visitors."
        }, 
        {
            "index": 220, 
            "rating": "4", 
            "review": "Best Park. It is a well kept, clean park. It caters for children who want to play on jungle gyms, and play games, also a kids gym for exercise and to build core strength."
        }, 
        {
            "index": 221, 
            "rating": "5", 
            "review": "What a lovely discovery!. We've been wanting to visit this since it has been established, and were so glad that we got to it eventually last week. What a beautifully designed green area offering visitors an indigenous haven, abundant birdlife and several peaceful water features- as well as information on all of this provided in a creative, interactive and often fun and engaging way. It was good to see that so many people are utilizing this Park, either walking through just enjoying nature, or using the paths for their daily jog. A thoroughly wonderful space. Cape Town, you made a good job of this!"
        }, 
        {
            "index": 222, 
            "rating": "5", 
            "review": "Kids Loved It. It wasn't just the kids who loved this spot. It's a real gem in the urban bustle with great play areas and cute walking paths with well signed plants."
        }, 
        {
            "index": 223, 
            "rating": "4", 
            "review": "Lovely for picnicking. Relatively well maintained, lots of space, great setting. The council should make more areas like this around Cape Town."
        }, 
        {
            "index": 224, 
            "rating": "4", 
            "review": "City escape. Fantastic place to escape from the hussel and bussel of the city. wonderful for good family fun and picnics. Nice play and fun area's for kids. Or just stroll around taking in the scenery. A stone throw away from restaurants and the ocean."
        }, 
        {
            "index": 225, 
            "rating": "4", 
            "review": "Very nice garden. Nice park for very young to very old. Lots to see and do, could spend an entire day in the park, weather permitted!"
        }, 
        {
            "index": 226, 
            "rating": "5", 
            "review": "very nice place to be. I like the park for the children and the idea that your child cant get uot of the park and just love the security"
        }, 
        {
            "index": 227, 
            "rating": "5", 
            "review": "Paradise. This beautifully landscaped park with water, mountains and indigenous flora is a well known secret amongst the locals. It is very well maintained and well used by walkers, runners, families, picnickers, etc...truly a little piece of paradise and some unusual photo opportunities with the ocean just across the road."
        }, 
        {
            "index": 228, 
            "rating": "5", 
            "review": "fun in the sun. wonderful venue for children with age appropriate parks with interesting activities.Take a picnic and watch the fun. beautifully laid out indigenous gardens between the lawns"
        }, 
        {
            "index": 229, 
            "rating": "5", 
            "review": "Amazing FREE park for all ages!. My favourite park in Cape Town! Think outdoor gyms, stone mazes, soccer fields, large garden showcasing indigenous plants & medicinal herbs, wetland bird watching and more...! A true gem and a short walk away from Mouille Point lighthouse, with seaside bars & cafes for sundowner drinks. This park is perfect for all ages, I will be packing many picnics this summer!"
        }, 
        {
            "index": 230, 
            "rating": "5", 
            "review": "A must absolutely Hotels please cecommend to visitors. Very peaceful and relaxing Many Egyptian Geese ( a well tolerated nuisance to Golfers in the adjoining Golf course) Children may enjoy having their attention drawn to how obedient the geese are to the ( Boss )the leader Geese seagulls and Biodiversity Garden all add the pleasure of being here Safety factor You are safe No conmen or LLL ( Lazy Lovely Life ) vagrants allowed access. Parking harassment free if you park at the Entrance close to Beach Road and the ocean. Old and young are blessed with a haven here."
        }, 
        {
            "index": 231, 
            "rating": "5", 
            "review": "Terrific Urban Park, something for everyone.. A beautiful setting, in the shadow of Table Mountain, Lion's Head and the Stadium built for the 2010 World Cup Soccer. Very \"green\", full of nature/natural exhibits, areas on which to run and play, separate and VERY unique and beautifully thought out playgrounds, one for the 1-6 year olds, and a separate one for those 6-12. Eating and just \"sitting\" areas abound and it is but a couple of blocks from the beach. What more could one want!?"
        }, 
        {
            "index": 232, 
            "rating": "4", 
            "review": "Great outdoors escape. We'll conceptualised and designed with great educational as well as recreational value for the family. Lovely children's play parks for different ages and large rolling grass areas. The horticultural aspects are well documented and despite the large volume of people it was relatively clean. Picnic facilities in various places. A great asset to Cape Town."
        }, 
        {
            "index": 233, 
            "rating": "5", 
            "review": "Fun for Everyone. Beautifully kept, this vast green park and educational centre is a real gem. A great place to picnic with two play areas- one for toddlers and one for older children. Popular for children's parties on the weekends so if you're looking for peace and quiet, go for a stroll during the week."
        }, 
        {
            "index": 234, 
            "rating": "4", 
            "review": "Green space in the City. Lovely parkland layout including ponds, ducks, water flowers, beautiful grass verges.plus climbing areas for children who can be observed by concerned parents from their picnic blankets.Beautifully kept, cleanliness, some wonderful flowers and trees, it is a joy and a stone;s through from Green Point / 3 Anchor Bay / Waterfront.And a great area to celebrate a picnic with friends which we did and had a fabulous time."
        }, 
        {
            "index": 235, 
            "rating": "5", 
            "review": "My best place to cycle. I love the urban park. It's on my cycling route most mornings. Amazing to be able to wheel about there and smell the fynbos and see the ducks on the lake at the golf course. A tranquil place that's great for families, runners, cyclists, walkers etc."
        }, 
        {
            "index": 236, 
            "rating": "4", 
            "review": "Worthwhile for young and old. I thought it very worthwhile, especially the biodiversity display and explanation. We need more parks like this al over the country. It is both educational and fun/relaxing."
        }, 
        {
            "index": 237, 
            "rating": "5", 
            "review": "Wonderful Picnic spot with kids. We got some great sandwhiches from Giovanni's in Green Point and headed for the park. What a well designed and executed park, walkways with interesting vegetation, water features and big spaces of grass for kids to run around on. The park has convenient benches and tables for your impromtu pic nic too."
        }, 
        {
            "index": 238, 
            "rating": "5", 
            "review": "A beautiful, peaceful park right near the hotel I stayed at.. A very well looked after park which extemely interesting as well - loved all the different areas. Well worth a visit"
        }, 
        {
            "index": 239, 
            "rating": "5", 
            "review": "Biodiversity Garden. Thank you! Enjoyed the walk. The park is safe, clean and educational,it is close to the stadium and across the road is the ocean. Lots of activities for children, and just a nice place to chill on a warm day. There's a labyrinth for those who enjoy a bit of meditation, contemplation or personal growth. Bring your camera along, good walking shoes, hat for the sun and come and enjoy the beautiful park."
        }, 
        {
            "index": 240, 
            "rating": "5", 
            "review": "what a way to relax. Awesome. Just a leisurely stroll here makes all the difference in the world. went here for a walk with the kids before dinner, and caught a glimpse of the sunset too. kids played in the park while my husband and I enjoyed the views.and they even have gym equipment."
        }, 
        {
            "index": 241, 
            "rating": "4", 
            "review": "Nice little park near the ocean. Greenpoint Urban Park is a nice small little urban park very close to Cape Town stadium and the ocean. It is actually somewhat difficult to find - we had to drive around for a few minutes to find the parking space - but once located it is easy and safe to move around. (Security guards greet you when you enter.) The park has various types of plants and placards about traditional KhoiKhoi diets and lifestyles, as well as discussion about biodiversity. It is a short walk to reach Greenpoint lighthouse and the ocean as well."
        }, 
        {
            "index": 242, 
            "rating": "4", 
            "review": "Fun. Enjoyed wandering around this park. Activities for the kids, dogs can be walked, people just chilling."
        }, 
        {
            "index": 243, 
            "rating": "3", 
            "review": "what a great place. the park was establish in an effort to uplift the neglected part of green point when cape town hosted the world soccer cup in 2010 and the new stadium was built on the huge empty grounds.i remember how sceptical people in the area was and i'm happy the park turned out to be such a great success. it's a wonderful short cut from greenpoint village down to mouille point and the light house. it's open between 7am-7pm. there is great playgrounds for children of different ages and on weekends a lot of the suburbians comes in for pic-nic"
        }, 
        {
            "index": 244, 
            "rating": "5", 
            "review": "The best place in Cape Town to take your kids and family!. The best place in Cape Town to take your kids and family when the weather plays with. The kids park is awesome and has plenty of activities for the little ones to hangout on. There's a path to ride bikes or skate and plenty of lawn for cricket / soccer. You can't NOT go to this place!"
        }, 
        {
            "index": 245, 
            "rating": "4", 
            "review": "Peace and quiet in the city. A stroll through can take anything from 10mins to a few hours. The noise of the main road gets blocked out. Large lawns, restrooms (kept very clean), play areas for children, an outside excersise area, security, biodiversity garden... there are always children playing, whether with families or a school group, and various birds interrupting your thoughts. The feel of it is surreal for inner city, like a piece of heaven where all is good (clean, safe...) and happy :-) no fees, but it has certain opening and closing times"
        }, 
        {
            "index": 246, 
            "rating": "4", 
            "review": "Gorgeous fun for the whole family. Such a stunning park with beautiful views and manicured park gardens. Perfect for a run, stroll or picnic. Close to the sea point promenade so you can skip over and walk along the sea too."
        }, 
        {
            "index": 247, 
            "rating": "5", 
            "review": "An asset to Cape Town. Beautifully designed, family friendly, peaceful park - this is such a welcome addition to Cape Town. Perfect for a picnic or early morning exercise or just a stroll. Everytime I visit this park I feel happy."
        }, 
        {
            "index": 248, 
            "rating": "5", 
            "review": "Family Fun. What a gem, a pleasure to see so many families of all walks of life enjoying a day out in the sun. The facilities are fantastic, find yourself a tree to laze under, enjoy a picnic and watch the world go by."
        }, 
        {
            "index": 249, 
            "rating": "5", 
            "review": "Nice clean park. Great park to chill out and great play areas for kids. Walking distance from the famous Waterfront and city center."
        }, 
        {
            "index": 250, 
            "rating": "5", 
            "review": "Take a walk in the park. This lovely Park and biodiversity garden that has been created near the New Green Point Stadium.There are different themed areas, for example: medicinal herb garden. wetlands area, Fynbos area, cactus garden, and seaside garden. It is both informative and enjoyable. I highly recommend a vist to this park area, as it is relaxing and interesting, to be enjoyed by both children and adults alike."
        }, 
        {
            "index": 251, 
            "rating": "5", 
            "review": "well worth the visit. an old fashioned picnic site. Clean, well managed, despite their being no entrance charge. They do check that you dont carry any alcohol in, which I thought good. And you cant erect any \"structure\" such a gazebo or similar. Just looking to chill with the children, very good venue to do it."
        }, 
        {
            "index": 252, 
            "rating": "3", 
            "review": "Lovely free park. This is a lovely free park with loads of activities for the youngsters. Limited shade and can be quite over run with people of the weekends."
        }, 
        {
            "index": 253, 
            "rating": "4", 
            "review": "Interesting. The walk through the park is interesting especially the educational section about the flora. The outdoor gym area is worth a visit if you feel like some exercise."
        }, 
        {
            "index": 254, 
            "rating": "5", 
            "review": "Kids LOVE it!. Brilliant place for a family outing. Love the atmosphere and fun. Creative jungle gyms are super. Bring own picnic / food / drinks. There is typically an ice cream vendor outside the park, but that's all."
        }, 
        {
            "index": 255, 
            "rating": "5", 
            "review": "Peaceful. An absolutely gorgeous park,very peaceful\nGreat place for a picnic with family and friends\nLovely to just walk and enjoy\nVisited many times during my stay"
        }, 
        {
            "index": 256, 
            "rating": "4", 
            "review": "It feels like London. A biodiversity garden on our own doorstep? Fantastic. Safe and easy area to jog in, easy access from all sides and enough space to sneak away for a quiet picnic or host a big kiddies party with enough legroom to run and fall softly on green grass."
        }, 
        {
            "index": 257, 
            "rating": "5", 
            "review": "An excellent eaxample of planning for the people. Wonderful and superbly used by all sorts of people and well maintained, like an old fashioned UK municipal park where there is pride and no evidence of misuse, safe and fascinating. A credit to cape Town Municipality. UK government should take note at what we are losing!!"
        }, 
        {
            "index": 258, 
            "rating": "5", 
            "review": "Great experience. Great easy walk with amazing information. Highly recommended and very valuable information. Great for kids and good option is a associated picnic."
        }, 
        {
            "index": 259, 
            "rating": "4", 
            "review": "FAMILY PICKNICK PARK. A great park for young and old esp kids, there is a park for the kids enough space for young and not so young to cycle safetly while you have a picknick only problem there is very little shade so come protected for the hot days and there is also security around"
        }, 
        {
            "index": 260, 
            "rating": "5", 
            "review": "A park to educate and inform. Stunning green belt in the middle of the city. Well maintained and informative at the same time. Worth a visit for sure."
        }, 
        {
            "index": 261, 
            "rating": "5", 
            "review": "Urban Awesomeness!. Kid friendly, dog friendly, bike friendly, well maintained, well equipped (clean public loo's, 2 playgrounds, outdoor gym, picnic facilities etc). It really is a wondeful place. The only downfall is that it would be nice for the park to have a refreshment stand, as we sometimes cut our visits short to go and find something to quench our thirst!"
        }, 
        {
            "index": 262, 
            "rating": "4", 
            "review": "A great way to spend time in Cape Town. Greenpoint Park is beside the stadium and has ample parking nearby. It is free to enter via a couple of gates and has a large area of gardens with very interesting explanations about biodiversity, plants which are indigenous to the area and invaders which are threatening the environment. It really is extremely well planned and attractive. There are large areas of grass with numerous people having picnics and attractive water areas. You can leave and walk to the ocean within minutes and at all times the view of the mountains are stunning, A great way to spend a few very enjoyable hours."
        }, 
        {
            "index": 263, 
            "rating": "5", 
            "review": "Relaxing and a favourite. Likely one of my favourite places in Cape Town. I never miss an opportunity to go to Greenpoint park.Such an open area away from traffic and the hustle bustle of town with the beautiful mountain views and the smell of the sea!We usually grab a cappuccino from Giovanni's or an ice cream and stroll through. Been known to picnic on the big grassy areas too!"
        }, 
        {
            "index": 264, 
            "rating": "3", 
            "review": "Best option in CT, but had issues. This is probably the best option for a park to play in for kids in Cape Town - there aren't too many alternatives (maybe we are spoilt by having half a dozen within walking distance).I took my under 6 kids to play in the dedicated play area. There was a reasonable selection of equipment, but it was very crowded (I guess lack of supply), and I didn't think the ground was overly forgiving for falls off some equipment that is quite high for toddlers.Also, there was no-one stopping older kids from using the facilities either.If you're in Cape Town and your kids need to have a run out, this is one of the better options. Compared to others across the world, it's average.Admittedly, we didn't use any of the other facilities. Also, it's worth noting that parking was accessible."
        }, 
        {
            "index": 265, 
            "rating": "4", 
            "review": "Good Break. great place to chill out-just a couple blocks from the waterfront-however no dogs-you could do a picnic or just walk around-close to public transportation."
        }, 
        {
            "index": 266, 
            "rating": "5", 
            "review": "nice park for a walk. wonderful park near the world cup stadium! Nice lay out, and a great park for kids to play in. A great place to go for a run or walk."
        }, 
        {
            "index": 267, 
            "rating": "5", 
            "review": "freshness. When you walk in this park, you refresh yourself not only your body but also your soul. It is definitely a place to visit in Cape Town. You can do jogging, ride your bicycle."
        }, 
        {
            "index": 268, 
            "rating": "4", 
            "review": "Opportunity to see endemic plants. Pleasant, well cared for gardens. Some very old trees and plants. Lots of pidgins to feed if that is your thing. Ends on one end at the Museum which has some interesting exhibits."
        }, 
        {
            "index": 269, 
            "rating": "5", 
            "review": "a fabulous walk, lovely environment. we walked twice and enjoyed every minute of it. a great achievement and a real leisurely promenade . these are the things which make Capetown a special place in south Africa"
        }, 
        {
            "index": 270, 
            "rating": "5", 
            "review": "A park for everyone. So deserving of its many design awards, this beautifully landscaped park is truly a park for everyone, young and old, to enjoy. There are several children's playgrounds, all age related, which is so good for little ones who might otherwise be overwhelmed by older children. It is wonderful to watch children enjoying parties and educational programmes at the outdoor amphitheatre. There is also an outdoor gym, labyrinth and many areas to explore, including a biodiversity garden with lovely walks and interesting facts, indigenous plants and many trees. The park is spotlessly clean and well maintained and there are lovely areas to sit beside the lake or beneath the trees and enjoy the incredibly peaceful setting. Signal Hill and Cape Town Stadium form imposing backdrops. It would be nice to have a place to sit and enjoy a coffee but there are so many great coffee shops and restaurants around Green Point, Mouille Point and The Waterfront, nearby. So wonderful, I wish this park had been done years ago."
        }, 
        {
            "index": 271, 
            "rating": "5", 
            "review": "Perfect stop. Loved the park..we had kids and after a day of touring was a good spot to stop and have them play, run around, climb. They have a mini golf park which is quite nicely done. On the overall a great spot for families"
        }, 
        {
            "index": 272, 
            "rating": "5", 
            "review": "A great park to take the kids or just hang out in.. this is a cool park. lots of fun obstacles for kids. areas to ride and skateboard. a outdoor gym. needs a coffee place but other than that it is perfect and immaculately kept. wish we had one in joburg"
        }, 
        {
            "index": 273, 
            "rating": "5", 
            "review": "Great park and lovely play areas. Safe, clean, green and popular with locals and tourists. Play areas for children of different ages. Lovely walks through biodiversity garden. Really worth a visit!"
        }, 
        {
            "index": 274, 
            "rating": "1", 
            "review": "Invaded by .... it's not the first time this was mentioned: A few parties essentially take over the garden on weekends. Bringing all their equipment, essentially moving in with the full tut, just short of the kitchen sink. I suggest to impose rules as in Kirstenbosch. No chairs, no gazebos, no tables. Visitors, stay away on weekends."
        }, 
        {
            "index": 275, 
            "rating": "4", 
            "review": "Nice area to relax in Cape Town. At greenpoint park you find a nice area to relax from the city noise. Just close to the waterfront and the stadium. Jogging, relaxing, everything is possible."
        }, 
        {
            "index": 276, 
            "rating": "5", 
            "review": "Lovely place. Well thought out, with plenty of activities for all ages along with beautiful ocean views, eateries along the way, toilets nearby. The garden was amazing - we loved the wide walkways and the different garden 'rooms'. Beautiful"
        }, 
        {
            "index": 277, 
            "rating": "4", 
            "review": "Place to picnic & relax. I am so impressed with this new addition to the Atlantic seaboard. A lovely green area, with paths, fountains, lakes & pergola with benches. A kiddies playground, plenty of refuse bins, not to mention the amazing view of the mountains and the sea. Really enjoyed our picnic lunch purchased from a deli on Main Road, Green Point."
        }, 
        {
            "index": 278, 
            "rating": "5", 
            "review": "Urban park in Cape Town. The Green Point urban park was born in the wake of the world cup and transformed a somewhat run-down commons into a lovely urban park which attracts one and all. The biodiversity garden is a lovely quick view of the immense diversity of the Cape vegetation."
        }, 
        {
            "index": 279, 
            "rating": "5", 
            "review": "Wonderful. What a treasure this oasis in the middle of the hustle and bustle is. Lovely for families and such a restful atmostphere. Well run and maintained - an absolute treasure worth a visit - just make sure you have time to while away some well spent hours!"
        }, 
        {
            "index": 280, 
            "rating": "4", 
            "review": "Innovative and impressive educational facility. As out of towners, our visit to Greenpoint Park was not about kids playing or seeking a picnic spot, but about discovering what we were told was one of Cape Town's more interesting new parklands. Well it is terrific with open greenspace but so much more for here is an interesting park design supplemented with innovative interpretative programmes, some whimsical and fun, some with serious intent but expressed in a clear and easily understood way. This is urban park design at its best with native plants used extensively. Everybody will find something to please them at Greenpoint but those wishing to understand the issues of managing and conserving Cape Town's flora will be most satisfied."
        }, 
        {
            "index": 281, 
            "rating": "4", 
            "review": "Peaceful and tranquil. In the middle of the hustle and bustle,yet it feels like you are in the countryside.Drinking water facilities,stunning garden to walk your dog.Security in place,safe."
        }, 
        {
            "index": 282, 
            "rating": "4", 
            "review": "Cool to see. I had some free time so I drove over to this stadium. Very easy to get to and easy to see from many parts of the city. Worth seeing if you have some extra time in Cape Town"
        }, 
        {
            "index": 283, 
            "rating": "5", 
            "review": "A great place to picnic with the kids, walk the dogs or ride bikes. The playground at the park reminds me of European playgrounds - great equipment, rubberised surrounds, lots to do. But I love the surrounding of indigenous gardens and being a stones throw from the Mouille Point boulevard. Easy to pop over for a nice take-away latte or a lunch.We've had picnics here and taken the kids bikes along as it's a nice big safe space for them to ride or run around. They also loved the indigenous gardens with explanations about the traditional uses of plants and kept asking questions. Only downside - it can get a bit crowded on weekends, but there is enough equipment for everyone."
        }, 
        {
            "index": 284, 
            "rating": "5", 
            "review": "Great place for a free kids outing. Popped in here with my kids, clean, very well equipped, and fun, security was right there too. Loved the playgrounds, only a pity it is only for kids under 12."
        }, 
        {
            "index": 285, 
            "rating": "5", 
            "review": "Well worth a visit. Flora and fauna outstanding! Cape shown at its best and lots of facilities too. Spacious clean and safe, lots of security."
        }, 
        {
            "index": 286, 
            "rating": "5", 
            "review": "Excellent place to use up some energy. After Signal Hill, this was our first stop in Cape Town, recommended by our hosts, and it was absolutely brilliant as a place to allow our children to wear off energy after their long plane journey south. We spent ages here as they tried every aspect of the jungle gym and the fitness centre, and also, inevitably, used the toilets. The atmosphere was great, and it says easy to get to and from."
        }, 
        {
            "index": 287, 
            "rating": "5", 
            "review": "great view of the city. You must go there the view of the city is great from this point. Don't missthis point you can take great pictures from there."
        }, 
        {
            "index": 288, 
            "rating": "5", 
            "review": "A must-visit place in Cape Town. I love this park! I can remember when the area was basically wasteland and it's now been developed into a wonderfully magical place that's educational, entertaining and relaxing to visit. Learn all about biodiversity and more, let the kids play in the amazing playgrounds which have been designed to fit in with their natural surroundings and simply enjoy the setting You'll have fabulous views of Signal Hill, the ocean, the emerald green fairways of the Metropolitan golf course and, of course, the amazing modern stadium build for the Fifa World Cup 2010. Take a picnic and spend some time, you won't believe you're in the middle of a city."
        }, 
        {
            "index": 289, 
            "rating": "5", 
            "review": "Amazing park for family and friends. Lots of parking, easy to access on the My-Citi bus service.Place to picnic, jungle gyms for the children to play on, pet friendly (on a leash) and lots of amenities with tapped spring water (free to drink out of the water fountains).... Really could one ask for more??And then the diversity gardens introduce visitors to some of the biomes of the Western Cape. And if you are fortunate you will catch site of some of the wildlife too!!"
        }, 
        {
            "index": 290, 
            "rating": "5", 
            "review": "A great day out. Perfect for a picnic and it has a large variety of play equipment for kids of all ages to enjoy. Also lots of space for kids to bring bikes."
        }, 
        {
            "index": 291, 
            "rating": "3", 
            "review": "Surprise Treat. This Park was across the street (and 2 roads) from our hotel, but it took me days to discover it. There are nice little touches to it - it's mostly a large green space - such as a human sun dial (it was so so strange to see the sun in the Northern Sky!), exercise stations, and a discovery garden. It is located between the new stadium and the esplanade, a delightful walking / running path along the ocean sea walls, and is a 5-10 minute walk to the V&A Waterfront."
        }, 
        {
            "index": 292, 
            "rating": "4", 
            "review": "beautiful, peaceful, lovely for kids. there are picnic spots.There are equipment for kids(aged 7 and up) to play on.There are ponds.It is perfect for a family picnic.There are always people around"
        }, 
        {
            "index": 293, 
            "rating": "5", 
            "review": "best park i have seen. just do it, if only we had park like this in the UK. I have never come across a park so well used, This park as something for everyone"
        }, 
        {
            "index": 294, 
            "rating": "3", 
            "review": "Interesting.. The biodiversity garden is a tranquil haven in the city. It is a popular place for adults and children alike to relax and see indigenous flora at its best. The fynbos is unique to the western cape and the proteas, Ericas and restios fascinating."
        }, 
        {
            "index": 295, 
            "rating": "5", 
            "review": "Urban park. Tis newly built urban park is the only one of its kind in Cape Town. A beautiful place to either exercise or take the kids for a picnic. Free entry with a peaceful atmosphere."
        }, 
        {
            "index": 296, 
            "rating": "4", 
            "review": "Great for small kids. Lots of jungle gyms & a well laid out play area for children of all ages. Bring a picnic & a ball to kick around."
        }, 
        {
            "index": 297, 
            "rating": "5", 
            "review": "Simply amazing. A stunning park which is also very educational we'll worth a visit - again you can jump of the red bus as it passes on the way to the waterfront."
        }, 
        {
            "index": 298, 
            "rating": "5", 
            "review": "Great place. Relaxing, fun & easy place to take kids as bikes are welcome and lots of security. Great for picnics or family get togethers.Walks or cycling."
        }, 
        {
            "index": 299, 
            "rating": "5", 
            "review": "BEAUTIFUL VARIETY OF FAUNA. The Gardens offer a wide variety of plants, flowers, and trees that can be found in the Cape Town area. Pack a lunch and spend a relaxing afternoon."
        }, 
        {
            "index": 300, 
            "rating": "5", 
            "review": "Love Love Love. This is the greatest park. It is completely free and magnificently kept. There is something for all ages from play areas to picnic areas to biodiversity and history information. Watch out for the hidden wire and metal animals dotted around in the bushes! A lovely touch."
        }, 
        {
            "index": 301, 
            "rating": "5", 
            "review": "Great City park. If you and/or your kids are looking for a park to stretch your legs for a while then this municipal park is an excellent place to visit. There are paths to walk on, a biodiversity garden, lots of lawns as well as play equipment for different age groups. There are also well-maintained toilets.Infomation from the City of Cape Town website:The Green Point Park is open every day from 07:00 until 19:00.* Picnics are permitted* Swimming, skateboarding, fires, braais, camping, loud music, flower picking and alcohol are not permitted* Dogs are welcome in the park, provided that they are on a lead and owners pick up and dispose of their excrement. Dogs are not allowed in the biodiversity garden* Parking is available near the entrances on the corner of Beach/Vlei Roads; on Bill Peters Drive (near the entrance to the Virgin Active gym); and on Bay Road (near the Mouille Point lighthouse).*The park has an outdoor gym and play park"
        }, 
        {
            "index": 302, 
            "rating": "5", 
            "review": "a wonderful place to wander. A really good mix of leisure and educational areas so close to the city centre. I particularly enjoyed the edible plants sections. Good way to stroll from the Waterfront along the Promenade to lovely Seapoint and some great local restaurants."
        }, 
        {
            "index": 303, 
            "rating": "5", 
            "review": "A Beautiful Park in a Wonderful Setting. A great facility for young and old in the shadow of Cape Town's stadium. I have no love for the stadium but as a result of building this white elephant, Capetonians have been bequeathed this beautiful park."
        }, 
        {
            "index": 304, 
            "rating": "5", 
            "review": "Fantastic place to relax with family. What a lovely place that is cost effective and fun and most of all SAFE. Perfect for kids of all ages to run and play or just relax and look at the bird life. Planning to go back soon. Also not just to have fun but learn as well with all the information boards in the area."
        }, 
        {
            "index": 305, 
            "rating": "5", 
            "review": "Beautiful Mother Nature. FRom a distance you will not know of this hidden treasure. It is very educational and brings you closer to how an eco-system should function. This is a journey every person who gets to this part of the world should take. I love the watering holes, the water is so pure and refreshing. This is the place to spend one's weekends reflecting on what each person can do to restore what nature gave us, and how we can leave this world to be appreciated and enjoyed by future generations."
        }, 
        {
            "index": 306, 
            "rating": "4", 
            "review": "Green template. This is a wonderful opportunity to see green gardening, an exceptional visual presentation which is beautiful in itself, but also extremely educational in terms of bio diversity, ecology and how easy & important such green gardening is."
        }, 
        {
            "index": 307, 
            "rating": "5", 
            "review": "Fabulous garden in central Cape Town. The Greenpoint park is a must see on a Cape Town visit. It is beautifully planned with fascinating and beautifully signed information on South Africa's biodiversity. It's clean, wonderfully laid out and has fabulous views of the mountain."
        }, 
        {
            "index": 308, 
            "rating": "5", 
            "review": "Great with Children and for Gym. Unique setting, views and scenery.Safe and lots to do with children: great fun park for different age groups, outdoor gym, biodiversity promenade, shaded picnic areas, water fountains.Easy access, from Virgin Active Green Point or via Mouilles point counter alleys, lots of parking."
        }, 
        {
            "index": 309, 
            "rating": "4", 
            "review": "Day out with the kids. Ample space for the kids, beautiful surroundings and safe play area with place to sit and watch them in contentment. No litter and hawkers or beggers."
        }, 
        {
            "index": 310, 
            "rating": "5", 
            "review": "Great Public Park!. Amazingly laid out park in the heart of Cape Town. Great for walks, or a jog, or for a picnic with the family! There is also a wonderful and very original play park for kids."
        }, 
        {
            "index": 311, 
            "rating": "5", 
            "review": "beautiful. and to think this was built of rock bed covered with green waste from the City! yes all soil and compost used in the park is composted by Reliance Compost from the Waste the City generates"
        }, 
        {
            "index": 312, 
            "rating": "5", 
            "review": "How green is my Cape Town. The Greenpoint Park is a blue print for biodiversity displays and makes it practical and fun for all ages to understand conservation. It is a family destination and fitness fanatics can be seen walking for running through the park at any time. Despite the action the park remains a tranquil space."
        }, 
        {
            "index": 313, 
            "rating": "4", 
            "review": "Cool Set up. We went as a Group with my German visitors and every body enjoyed the walk through, and they find it wonderful that the facility is near the Center of Town and available to all people"
        }, 
        {
            "index": 314, 
            "rating": "4", 
            "review": "Lovely place to take the kids. An awesome place to take the kids to play on the educational/outdoor equipment, enjoy outdoor life, experience an affinity with nature, learn about flora and take in the beautiful views of Table Mountain and vicinity at no charge. Amazing view of The Cape Town Stadium too. Take a picnic and enjoy a fun family day out on the beautiful lawns."
        }, 
        {
            "index": 315, 
            "rating": "5", 
            "review": "Biodiversity. Cape Town in a nutshell! Diverse, fun and chilled garden in the heart of a bustling city. I highly recommend a visit here!"
        }, 
        {
            "index": 316, 
            "rating": "5", 
            "review": "Beautiful!. Walked from the Waterfront, through the park, to Seapoint. Super nice walk. Loved the layout of the park. It was really quiet on a sunny afternoon. Highly recommended!"
        }, 
        {
            "index": 317, 
            "rating": "4", 
            "review": "A Community park in the city. Situated close to the City and adjacent to the Cape Town Stadium, etropolitan Golf Club and the Mouillie Point Lighthouse this is an excellent and safe venue for families. Not only is it beautifully laid out with indienous plantings, lawns and ponds but it contains two child play areas with swings etc - one for young children and the other for older kids. Picnic tables are provided under shade for those who just wnat to sit outside and enjoy the ambiance."
        }, 
        {
            "index": 318, 
            "rating": "4", 
            "review": "Excellent park close to Cape Town stadium. Stunning spot to walk with the kids. Close to stadium and Greenpoint golf course. Magic climbing apparatus and jungle gyms plus fitness equipment."
        }, 
        {
            "index": 319, 
            "rating": "5", 
            "review": "Best park in CT. Space, scenery, plenty for children to keep active and busy, good for picnics, and wonderful to walk around - beautifully tended and in a great location (apart from when it's windy)"
        }, 
        {
            "index": 320, 
            "rating": "4", 
            "review": "A great addition to Mouille Points platinum mile. This new park is situated opposite the lighthouse and is so peaceful to walk around. It is ideal for little children and adults too. It is so peaceful and the view from the apartments in front of them are stupendous. They occassionally have concerts in the park too."
        }, 
        {
            "index": 321, 
            "rating": "4", 
            "review": "A walk in the park. This park is well worth a visit. My wife and I strolled through on a lazy, sunny sunday. Lovely views over the Milnerton Golf Course, as well as of Table Mountain await. The gardens are very interesting and well laid out, with an area for children to play as well as places to sit and take in the ambience. We were pleasantly surprised."
        }, 
        {
            "index": 322, 
            "rating": "4", 
            "review": "This is what a park is meant to be like!. This park has brought to Cape Town something which it needed years ago! A place where kids can be! Yes it is a safe enviroment for kids of all ages, from 1 to 101. Chidren love it for all the free running space and park structures which have been set up according to age, so the toddlers wont have to get underfoot of the older more boisterous kids. It has a lovely picnic area where countless birthday parties are held on a daily basis. Of course the area is limited so most people come early in order to \"book\" their space. The more senior citizens also enjoy the large ares where you can walk in a safe environment as the whole area is closely monitored by helpful staff both security and other.The only drawback of the whole area is the lack of an eatery of some sort- an inexpensive coffee shop type of establishment is just what this place needs! Perhaps the City Fathers should look at the viability of this.All in all, just the place to unwind, practice your yoga or tai-chi or just relax!"
        }, 
        {
            "index": 323, 
            "rating": "5", 
            "review": "Little paradise!. A perfect place for a family day out, or just read a book on a park bench! Spent a family afternoon on the weekend. Next time plan to go for a picnic."
        }, 
        {
            "index": 324, 
            "rating": "5", 
            "review": "Tranquillity but so close to the excitement.. In Sea Point after the Cycletour race last Sunday, decided to take a run in the direction of Moulle Point. A running race was in progress so decided to see the finish, which, it so happened, was through this park to the outside of the magnificent stadium.I walked and ran through the park and was amazed at the fish pools, water wheel, explanations of the area at all points of interest. This coupled with the views, and places to picnic, with facilities for children, so near the built up area, is a find that must be seen to be appreciated."
        }, 
        {
            "index": 325, 
            "rating": "5", 
            "review": "Perfection. We have just spent a month in Cape Town and came across the park and walked there every day.There is some great exercise equipment which has been supplied by Rotary even my husband who does not go to the gym used it!Also perfect childrens play equipment.Very friendly and informative with all the bio diversity areas..great for all ages and well worth visitingLots of parking areas and good security"
        }, 
        {
            "index": 326, 
            "rating": "5", 
            "review": "Just peaceful. I love the tranquil park and open space, great to sit in park with friends and the beautiful views from park"
        }, 
        {
            "index": 327, 
            "rating": "5", 
            "review": "Tranquil space in the city. Lovely kept gardens, nice place for a picnic or stroll. It seemed to be a family friendly park and a peaceful haven in the city centre.Well worth a look"
        }, 
        {
            "index": 328, 
            "rating": "5", 
            "review": "Wonderful facilities. My children and I spent a wonderful day yesterday at the Green point urban park...wow, a first class facility, with amazing apparatus for kids of all ages, especially the older ones who get a bit bored with the average jungle gym. We strolled, and learnt about biodiversity and played and even did some exercice, and all left wanting to come back next time properly armed with a picnic so we could spend a few hours there!!"
        }, 
        {
            "index": 329, 
            "rating": "5", 
            "review": "So enjoyed it. Had no idea it was such an interesting place to walk around . Every corner has a surprise and a great view. There were paths leading through bio diversity gardens, alongside waterways and wonderful children's play areas. The day we went there were schoolchildren having fun on the large wooden seesaw and all the different swings etc.There were friendly security guards around and the whole place had a good feel about it. A great asset to Cape Town and we were told it is very busy at weekends so if you like a quiet walk around maybe choose a weekday."
        }, 
        {
            "index": 330, 
            "rating": "5", 
            "review": "A piece of heaven..... This is one of the best things to have come out of the 2010 World Cup Football in Cape Town. We finally have a park, that is not only beautiful, but designed with integrity from start to finish.I love that this is a park for children, and the security get strict if grown ups play with or on the funky slides, swings and other interesting creations.One of my favourite aspects is the labyrinth - and it is open to all people to walk throughout the day"
        }, 
        {
            "index": 331, 
            "rating": "5", 
            "review": "Pleasantly surprised.. I thought that the park might be boring, but it is really lovely with many interesting little areas and lots of information. It has a great atmosphere and is in a lovely area close to the sea, stadium and Green Point Lighthouse, which is well worth a visit. The lighthouse is small, but has great views and a small exhibit. I loved being at both places. There is a small fee for the lighthouse."
        }, 
        {
            "index": 332, 
            "rating": "5", 
            "review": "Great open space for families to play and picnic. Soft green lawns, areas with tables for picnics and parties, jungle jims for kids to clamber on, large areas for ball games, interesting walkways and planted gardens. Entrance is FREE!"
        }, 
        {
            "index": 333, 
            "rating": "5", 
            "review": "A must for family picnics and to take the kids. This Park has two play areas for different ages of children. Very popular over the weekends as the kids of all ages play on their bikes as well as the parks with all types of activities.You'll see many families holding birthday parties there as well as all ages having picnics. Secure and safe and a walk to the beach area."
        }, 
        {
            "index": 334, 
            "rating": "5", 
            "review": "Loved the park..... Fantastic day in the park... My son was able to ride his bike safely .... Kept me running for hours... Awesome or or a picnic and loved the outside gym area.. Watched them for hours..heh heh"
        }, 
        {
            "index": 335, 
            "rating": "4", 
            "review": "Built for relaxation and studies. Off the Greenpoint-Stadium there is this unexpected park with an offering of diversity, that i have to list them below, and all are worth visiting- public park, open with sunrise and sundown- perfect for jogging- dogs allowed on leach- different playgrounds for children age-depending- sailing-lake- garden of herbs with learning-boards- garden of indigenous plants with learning-boards- maze - greens for weekend gathering - security (of course)- waterplays + fishponds- seating-area and benches all around for restsTry it, its a wonderful little oasis between the busy regent + beach road"
        }, 
        {
            "index": 336, 
            "rating": "5", 
            "review": "Wonderful! well done Cape Town. We live 5 minutes away from the park and our son goes there every morning to play in the toddlers play area - it's just wonderful - great for kids to have a play with other's the same age - the city have really made an effort with this park. We love it - thank you."
        }, 
        {
            "index": 337, 
            "rating": "5", 
            "review": "Fab for kids. With two amazing parks for kids of different ages, great running trails (kids can use on their bikes) and carefully considered planting and maintenance, this is an excellent spot for a morning of fresh air with your kids. Small cafe has just opened at the bigger kids' park (very close to the toddler park), which is great for moms desperate for a coffee and snacks. Super safe and clean."
        }, 
        {
            "index": 338, 
            "rating": "5", 
            "review": "What a surprise. One of the best things to come out of the 2010 World Cup. So much thought has been put into it's design and it is a joy to walk around the biodiversity garden and so informative. It is safe and lots of friendly security attendants. This will be a truly outstanding park as it matures and Capetonians should feel proud of it."
        }, 
        {
            "index": 339, 
            "rating": "5", 
            "review": "Fun for the whole family. This is the ideal picnic spot in the middle of cape town. whether you just want to relax and read a book, or play with the kids, you are sure to find a perfect spot...well maintained...pity there is limited parking...so go early"
        }, 
        {
            "index": 340, 
            "rating": "5", 
            "review": "Undoubtedly the best urban park in South Africa!. This is the most eco-friendly and amazing urban park. Very informative - especially if you have children.They have a great deal of information presented in a fun and interesting way!Lots of activities, from an out-door gym, sun dial, a coffee shop, walking trails... its just plain awesome.A MUST!"
        }, 
        {
            "index": 341, 
            "rating": "5", 
            "review": "GREEN POINT. Definitely a last on your itinary. Nothing exciting depends on what you like. Do your homework before you visit Green Point .\nOverrated"
        }, 
        {
            "index": 342, 
            "rating": "5", 
            "review": "Magical!. Stumbled upon this park by accident, and are so glad we did. What a beautiful and informative educational resource for the community! Well-written interpretive information."
        }, 
        {
            "index": 343, 
            "rating": "5", 
            "review": "quiet picnic site. The park is a great addition to Green point. It is quite big, has couple of ponds and a biodiversity walk explaining and showing different plants and such. It also has multiple playgrounds for kids and picnic tables and some gym equipment. Generally quiet, good place to spend some time."
        }, 
        {
            "index": 344, 
            "rating": "5", 
            "review": "Great outing with and without kids. The kids had a ball, and we loved the family-friendly vibe. It was a bit windy, but very worth it. Also liked the separate play area for younger toddlers. Will definitely be back."
        }, 
        {
            "index": 345, 
            "rating": "5", 
            "review": "A new gem by the sea. Part of the legacy of the 2010 FIFA World Cup, this park has been a great success. Built around a wetland area, the park showcases rare coastal vegetation in the Biodiversity garden and provides lawns and picnic areas which are popular with families on weekends."
        }, 
        {
            "index": 346, 
            "rating": "4", 
            "review": "Great family venue. This was really interesting! There was a blustering south easter but we enjoyed it anyway. Found the info on plants in the Cape. Hundreds of school children on the weekday we were there, people having picnics. Great place to wind down."
        }, 
        {
            "index": 347, 
            "rating": "4", 
            "review": "Great for summer strolls with the kids.. This is a very laid-back place near the Cape Town Stadium. It is for all ages. Kids can ride their bikes (and stroller skates??) while mom and dad recline on the grass. Easy walking. It can get windy, as the trees are still relatively young and don't provide much protection. Great views of the mountain, giving the effect of vast expanses of \"freedom\" and openess."
        }, 
        {
            "index": 348, 
            "rating": "5", 
            "review": "Wonderful venue for family to spend time in nature. I love the safety and all the activities for children. For those who have not got children can stroll around the park and enjoy the beauty of nature, without being disturbed by the children's playing"
        }, 
        {
            "index": 349, 
            "rating": "5", 
            "review": "Green Oasis. This is a great spot to relax between appointments in the city. Normally very quiet on a weekday, busier with families over the weekend. A good way to learn about plants and the environment as well."
        }, 
        {
            "index": 350, 
            "rating": "5", 
            "review": "An hidden treasure. If you want to chill out and relax in the City there is no better place to go than this park. Safe ,central ,interesting and a great place to exercise,walk relax. Do go and you will pleased that you made the time and effort to find it."
        }, 
        {
            "index": 351, 
            "rating": "5", 
            "review": "A place of relaxation and great for family time. I really love this park ,it's great for picnics with family and friends. Great activities for the kids as well . In summer there is very little shade so come prepared.also bring your picnics and relax and enjoy the beautiful surroundings"
        }, 
        {
            "index": 352, 
            "rating": "4", 
            "review": "Worth a short visit. Worth a short visit to get a good idea of the ecology of the area around Cape Town. Particlularly good for children, but also for adults"
        }, 
        {
            "index": 353, 
            "rating": "5", 
            "review": "Gorgeous outdoor park!. Magnificent views of Signal Hill and Table Mountain, as well as the 2010 World Cup Stadium - perfect for walks, a run through and especially for the kids! Restaurants and coffee bars as well as the Mouille Point beach front close by!"
        }, 
        {
            "index": 354, 
            "rating": "4", 
            "review": "cute little guesthouse top of the hill overlooking the stadium,bay the biodiversity park of greenpark in the distance. Green Point has many g8 Guesthouses. Bluegumhill Guesthouse is small, charming with Cape Town character right on the top of Signal Hill, situated in a quiet cul de sac, overlooking the whole bay,stadium, the V&A Waterfront,the Green Point Common and the Metropolitan Colf Course. It us a family owned guesthouse with a personal intimate customer relation attitude. You sit on the balcony or at the pool with a panoramic view in front of you."
        }, 
        {
            "index": 355, 
            "rating": "5", 
            "review": "Breathtaking Oasis. We were taken aback at the beauty of this park, didn't expect it to be as great as it was. The diversity of plantings, the humour of the descriptions, and written history of the area were amazing. Against the backdrop of the mountains, with families playing nearby on fields, it was an oasis in the midst of the city. Birds, ducks, all sorts of small insects, water features, make it a peaceful haven. We spent hours there, found the medicine garden very interesting, and the Khoi Khoi huts."
        }, 
        {
            "index": 356, 
            "rating": "5", 
            "review": "Beautiful and unexpected park. This park is tucked away and quite unexpected. Most locals dont even know its there. Great for families and children.. Definitely worth a visit"
        }, 
        {
            "index": 357, 
            "rating": "5", 
            "review": "Inner City Sanctuary. Having lived in Cape Town for a few years now, it was lovely to discover this park with so many ammenities. The kids play areas in particular are world class"
        }, 
        {
            "index": 358, 
            "rating": "5", 
            "review": "Great attention to detail. An excellent park, well situated and well designed and executed, with great attention to important issues of conservation & re-cycling. Fabulous for children of all ages and very comfortable and attractive for parents too."
        }, 
        {
            "index": 359, 
            "rating": "4", 
            "review": "Great holiday or Sunday outing. Fabulous for a walk around. Lovely flowers and plant information. Good for feeding the soul with the wonderful views of the mountain."
        }, 
        {
            "index": 360, 
            "rating": "5", 
            "review": "Unbelievable.. What has been achieved to create this super park, is amazing.What was once a golf course together with an area of desolate wastland, has been transformed into a wonderfull leasure area.The Biodiversity Garden is beautifully laid out, and there is so much information at hand.Well worth a visit. Take a lunch box and enjoy a day out. If you have youngsters, the play areqas are a kids paradise."
        }, 
        {
            "index": 361, 
            "rating": "5", 
            "review": "Fabulous Facility for young and old. An extremely well kept and managed park with walkways, lakes , ducks, seagulls and amazing selection of indigenous flora and fauna.\nEnough space for families to picnic, children to place and seating all around the park. Absolutely stunning."
        }, 
        {
            "index": 362, 
            "rating": "5", 
            "review": "I am from Sydney and I reckon Cape Town beats Sydney hands down. This is arguably the most scenic and beautiful city in the world! Table Mountain wherever you go. We may have the Harbour Bridge but it cannot be seen from everywhere. Robben Island - living history and so inspiring. Stellenbosch wines and wineries amazing.Malaysian district great houses and food.Scenic waterfront. Outstanding accommodation and location and so convenient.I loved Cape Town."
        }, 
        {
            "index": 363, 
            "rating": "5", 
            "review": "Love the layout. We had our church end of year picnic there and used the MyCiti bus to get there from Table View and Milnerton. Quite a walk bur worth it."
        }, 
        {
            "index": 364, 
            "rating": "5", 
            "review": "Friday. Every Friday we have a social run with work friends. We always choose to run through Greenpoint park. It is beautiful and frequented by families and strollers. Such a benefit to our city."
        }, 
        {
            "index": 365, 
            "rating": "5", 
            "review": "see the real africa. we spent a day here walking and driving around. the info centre is very helpful to visit before you start your day. we saw dolphins in the sea, babboons running around, a bit scary but if you do as the guide tells you and keep your car doors closed they are lovely to see. we also saw some ostrich in their own environment. a wonderful memory"
        }, 
        {
            "index": 366, 
            "rating": "5", 
            "review": "Amazing Oasis. Wonderful oasis so close to the city. Well kept, ideal for families, dog owners and cyclists. A great day out!"
        }, 
        {
            "index": 367, 
            "rating": "4", 
            "review": "Way cool place.... I've been to this park on a number of occassions and must let you know that it is extremely wheelchair accessible. There are disabled parking bays on the Virgin active side of the park, easy access into the park. Getting around is via paved walk ways and ensures a good work out! :) Some nice area's with benches where you can just relax and have a picnic. This is well worth a visit if your in the area."
        }, 
        {
            "index": 368, 
            "rating": "5", 
            "review": "Greenpoint Park. This park is kept in pristine condition. It is well worth having a picnic, a small function, or just a walk. It is adjacent to a golf course and the 2010 soccer world cup stadium. Well worth a visit!"
        }, 
        {
            "index": 369, 
            "rating": "5", 
            "review": "Relaxing + plant info. I actually brought kids here for a fieldtrip. There are notes on medicinal plants, plants used for food, etc. The park has an awesome playground and benches to relax with your book. There is a huge sundial and the kids really enjoyed themselves."
        }, 
        {
            "index": 370, 
            "rating": "5", 
            "review": "Perfect for families. This is an incredible place to take children 12 and under. Very diverse ethnically. A wide variety of play equipment that it well kept. Perfect for picnics or family gatherings or just an impromptu play in the park. Incredible views."
        }, 
        {
            "index": 371, 
            "rating": "4", 
            "review": "Wow. A MUST visit! Go for a picnic or just take the kids to play. Well kept - a little oasis in the City"
        }, 
        {
            "index": 372, 
            "rating": "5", 
            "review": "Wonderful place for children. Definitely the best freebie in Cape Town! It is a beautifully set out park. Two play areas for children, one especially for younger children, which is enclosed. Most of the play equipment is made from alien vegetation, with some different things to play on. The 'garden' parts of the park are all indigenous plants and education as they highlight plants suitable for different areas. Children love it! Only down side is no food or drink available on site."
        }, 
        {
            "index": 373, 
            "rating": "5", 
            "review": "Love this place! Perfect for a picnic. Beautiful park for kids with many play areas. Had hours of fun with my son there. There are also many benches where you can sit and even picnic on the grass. There was security in the park and it was a great experience to visit."
        }, 
        {
            "index": 374, 
            "rating": "5", 
            "review": "Perfect park for children. This park is absolutely wonderful for children! It is safe, convenient located in Greenpoint and has the most amazing playground. Large open spaces and great information about our Fynbos!"
        }, 
        {
            "index": 375, 
            "rating": "5", 
            "review": "do not visit cape town without visiting this park. we have rented an apartment overlooking this park. It is amazing. It is a feat. It has a biodiversity section, a gym section, a lake a view to the stadium and is so so safe. I go there every day and was so nervous about going back to sa. I love it and feel so safe. It has won awards. Dont miss it. There is a HUGe park for kids - it is packed on weekends - so must work for kids."
        }, 
        {
            "index": 376, 
            "rating": "5", 
            "review": "Great addition to life in Cape Town!. This park was a spin-off from the 2010 World Cup Soccer and it's a lovely spot for families, walks, sitting in the sun, being educated from the bio-diversity gardens and just admiring the wonderful views.It's a truly relaxing spot and already well-loved by many Capetonians.Visitors to the city can enjoy a peaceful stroll with stunning views as a break from their hectic schedule."
        }, 
        {
            "index": 377, 
            "rating": "5", 
            "review": "Garden of Peace. Various Cape plant species to be seen - gardens beautifully laid out - not too busy and easy access - certainly the place to be to experience some quiet peaceful moments!"
        }, 
        {
            "index": 378, 
            "rating": "5", 
            "review": "A must for every age.. I visited the gardens on Sunday, the weather was stunning, since my last visit about eight months ago the plants have grown and birds have made their homes in the trees, and we saw butterflies and bees. I took my elderly parents, they couldnt stop raving, there were plenty of seats for them to sit on and watch the children in the play area. Families were having their lunch at the wooden tables next to the water, others were relaxing on the beautiful lawns. The toilets were clean, there was plenty of security and we found parking in the parking area next to the Virgin Active Gym. The backdrop of Table Mountain, and signal hill just add to the beauty. We would have liked a cup of tea and cake, but there wasnt anything in the garden so take your own flask or walk to the main roads to get something to eat."
        }, 
        {
            "index": 379, 
            "rating": "5", 
            "review": "Fantastic Family Day Out. A great place to picnic. Clean toilets. Security are on the ball. The parks and entire area is fab for the children and even a romantic picnic. Really a great experience. Only downside is that the parking area is a bit manic!"
        }, 
        {
            "index": 380, 
            "rating": "5", 
            "review": "Colourful, serene & absolutley breathtaking *-*. The layout of this park & garden are just one of its kind..Fynbos & fauna so diverse and the well defined and discriptiveboards where one can read all about the herbs their origins etc...I love the meandering streams of water trickling along the paths.The beautiful iconic Table Mountain...on the one side and the historic 2010 soccer world stadium on the otherA beautiful peaceful place to enjoy if you need a stress reliever ot just want to enjoy a quite day!!"
        }, 
        {
            "index": 381, 
            "rating": "5", 
            "review": "perfect break from the busy city. all the children I au pair love the greenpoint park.They spend hours on the swings, slides and anthing else they can climb on or jump off!The jungle gyms are made from cool recycled materials and very cleverly use the space. The park is safe- with seperate play areas for children under 4.This is especially great- because the equipment isnt so high and is easier for the younger children to interact with on their own.There is also a section of the park with adult exercise equipment- so you can easily get a quick work out whilst your children play.Lots of young families are in the park in the early evening and there is a lovely community atmosphere."
        }, 
        {
            "index": 382, 
            "rating": "4", 
            "review": "A scenic open space with multiple uses. A scenic place to relax with lots of place for children to run around as well as a fun and unusual play area with jungle gym, swings etc. Ideal for picnicking either on the grass or at picnic tables provided. For the more fitness-focused the park is ideal for joggers and even has outdoor gym equipment. It's proximity to the city makes it ideal to piggyback it with other attractions nearby. Free access is another major plus."
        }, 
        {
            "index": 383, 
            "rating": "5", 
            "review": "Great for visit for the entire family. Great for walks, the kids can play on some awesome and very cleverly constructed jungle gyms. If you like exercise, run there and find an array of gym apparatus to exercise on. The run along the Atlantic Ocean Promenade is one of the most beautiful in the world."
        }, 
        {
            "index": 384, 
            "rating": "4", 
            "review": "A breath of fresh air so close to the city!. Lovely outdoor venue for a picnic, a walk, or a trip out with the little ones to let off some energy.Beautiful jungle gyms for the little ones and even outdoor exercise equipment for mom and dad or solo/group adult visitors.The garden is also lovely to explore, though the park can get busy and very noisy on good weather days. Late evenings from about an hour prior to closing time seems to suit me best, as it's pretty quiet then.All in all, definitely worth visiting if you're in or around Cape Town CBD, especially with little ones."
        }, 
        {
            "index": 385, 
            "rating": "4", 
            "review": "piece in the middle of the hustle and bustle. if you are looking for a place to clear your mind, and forget about your worries for a little while then go to the park. Lovely walk ways, great for people with kids, clean and safe."
        }, 
        {
            "index": 386, 
            "rating": "5", 
            "review": "I love this park. Open spaces, world class jungle gyms, fantastic fitness gym. My kids LOVE it there!!"
        }, 
        {
            "index": 387, 
            "rating": "5", 
            "review": "Love this park!. This park is really something special, we love walking there and the kids love running and playing. It is very child-friendly and a good idea is to pack a picnic and sit on the lawns."
        }, 
        {
            "index": 388, 
            "rating": "5", 
            "review": "It's amazing. The park is super nice, especially at sunset. I run through here often and each time is like a moment frozen in time. Highly recommend spending some time in the park, then pass over to Neo for some eats."
        }, 
        {
            "index": 389, 
            "rating": "5", 
            "review": "beautiful. What a lovely place. Walked through here on our way to seapoint and found it a very relaxing place . Lots of familys on sundays with there picnics and bbq's and views in every direction. Some days saw school children here with there teachers having lessons about the plants."
        }, 
        {
            "index": 390, 
            "rating": "5", 
            "review": "A beautiful garden close to the Cape Town Stadium. The Greenpoint Park was the fruits of the 2010 FIFA Soccer World Cup. Local families regularly enjoy their day picnics in the park. I recommend it to all as part of your visit to Cape Town. There is so much to do in the park, especially for children. If you are alone you could spend several hours walking through the biodiversity garden and park."
        }, 
        {
            "index": 391, 
            "rating": "5", 
            "review": "nice place to bike, run, or wander.. Our hotel was right out one of the gates of the park, so it was a wonderful place to run, bike or wander around. What a nice resource right in the center of the city -- kind of like a miniature Central Park in Manhattan."
        }, 
        {
            "index": 392, 
            "rating": "5", 
            "review": "Stunning City Park. What a wonderful place for everyone to go and enjoy both the floral and social diversity of Cape Town. Don't miss it if you want to hang out with locals enjoying their Sunday picnics. A very chilled experience which you can beef up with a bash at the outdoor exercise equipment or an educational stroll through the specially designed walk-through garden. This place makes me so proud to be a Capetonian! Another locals haunt, Newport Cafe, is a stones throw away on Beach Road and great for either making up your own picnic from their deli or slipping into a near-coma over cake and coffee."
        }, 
        {
            "index": 393, 
            "rating": "5", 
            "review": "Peaceful park in cape town. This is a lovely place to bring little children, teenagers, old people...anybody! Its peasceful, wellmarked, beautiful. Whether you need to just take a stroll outside or want to learn something about our flora, this is a lovely place to come to. It is much smaller than Kirstenbosch and more accessable."
        }, 
        {
            "index": 394, 
            "rating": "5", 
            "review": "Great for lazy weekenders like myself.. There are so many things for children to do at this particular park!! Adults have the chance to read the newspaper , chill and just relax whilst the kids have fun. Several good restaurants nearby mean that you can either have breakfast before going into the park, lunch afterwards or a great cappuccino in between. My personal favourite Cafe Neo opposite the Lighthouse in Greenpoint !!"
        }, 
        {
            "index": 395, 
            "rating": "5", 
            "review": "a little gem. layout - diversity of indigenous plants - well labellededucational aspects - very informativeCharming little beaded insects, etc. well positionedFree ConcertsHas appeal to all ages"
        }, 
        {
            "index": 396, 
            "rating": "4", 
            "review": "Beautiful. A fabulous 'new space' made from what was a wasteland. Beautiful walks for all ages. Lots to see and do - lovely parks for the kids."
        }, 
        {
            "index": 397, 
            "rating": "5", 
            "review": "Could be a daily walk.. Major display of extraordinary folliage and flowers. Each season will differ but a wonderful way to spend a morning relaxing."
        }, 
        {
            "index": 398, 
            "rating": "5", 
            "review": "Peace and quiet. In the middle of the bustling city this gem of peace and quiet lies - well worth a visit"
        }, 
        {
            "index": 399, 
            "rating": "4", 
            "review": "A very beautiful park... full of life during weekend! Good for families and children. The park is very beautiful and walking around will be a quite interesting experience.You can learn something (from the biodiversity walk area), spot the beautiful stadium, see people playing cricket, baseball, etc... children and you can also assist from a distance to a birthday party... Maybe not a \"must see\" of Cape Town but iIt's a place worth a visit with a camera."
        }, 
        {
            "index": 400, 
            "rating": "4", 
            "review": "Wonderful legacy.. The park was one of the upgrades we got from the 2010 soccer event and not being a soccer fan,at least I can enjoy this beautiful,lush green space and hope to do so,and see the plants grow and mature over the years to come.Well worth a visit when in Cape town."
        }, 
        {
            "index": 401, 
            "rating": "5", 
            "review": "lush. nice scenic and very pretty, must visit if family and kids are there with you"
        }, 
        {
            "index": 402, 
            "rating": "5", 
            "review": "Amazing abundance of green in city. An amazing abundance of green well worth a stroll through, right in the heart of the city, all with the backdrop of the stunning Greenpoint stadium."
        }, 
        {
            "index": 403, 
            "rating": "4", 
            "review": "New park. launched after the Soccer World Cup in 2010. Nice, tranquil environment, good for a Sunday vibe! even on a Monday!"
        }, 
        {
            "index": 404, 
            "rating": "5", 
            "review": "Beautiful Public Space. Beautiful Public Space to go for a walk or picnic.. clean and safe"
        }, 
        {
            "index": 405, 
            "rating": "5", 
            "review": "Just Amazing!. SO worth a visit - truly an amazing spot and next to our stadium."
        }, 
        {
            "index": 406, 
            "rating": "5", 
            "review": "It's so green. What a difference since the World Cup, the Green Point common has gone green, it's a great place for the whole family to walk around."
        }, 
        {
            "index": 407, 
            "rating": "5", 
            "review": "Wonderful outdoors in the heart of Cape Town. Lovely venue to stroll safely, and enjoy nature. Quite a good idea as the stadium is merely a white elephant after the famous World Cup"
        }, 
        {
            "index": 408, 
            "rating": "5", 
            "review": "Birdwatchers delight. Great for birdwatching, not crowded. Wonderful walks through the gardens and a good little cafe"
        }, 
        {
            "index": 409, 
            "rating": "5", 
            "review": "Away from the City in the City. By Cape Town standards this is one of the best parks for nature lovers, plain lovers and families with kids. The park accommodates walkers, cyclists (kiddies), ball games, joggers and those that just want to relax with a picnic basket and breathe in the fresh air."
        }, 
        {
            "index": 410, 
            "rating": "5", 
            "review": "Fun, picnic, educational. Great for a sunny or overcast day, with a superb park for children and toddlers. Beautiful, well kept gardens and little creatures hidding amongst the wild flowers. Lovely for a picnic, bike riding and fun for the family."
        }, 
        {
            "index": 411, 
            "rating": "5", 
            "review": "just gorgeous. This newly established park is really spectacular. Around every corner is another surprise, something interesting to see or read or comment on. The childrens play area is safe and great fun - there really is no other place like this in Cape Town. Kids just go wild here and can do so in a safe environment. Security is tight and the gardens are clean and well maintained. This is a favourite with the locals."
        }, 
        {
            "index": 412, 
            "rating": "5", 
            "review": "New Gem in Cape Town. This area is full of surprises. Lovely area for kids to enjoy, beautiful pathways to walk in and great picnics to be had in the park. Alcohol free zone. One street away from the beachfront and close to the V&A Waterfront."
        }, 
        {
            "index": 413, 
            "rating": "4", 
            "review": "Lovely greenspace. If you are parents who want see your children enjoying themselves along footpaths that curve around flower beds, If you are offspring wanting to take your wheelchair bound parets for a \"walk\",if you are lovers who enjoy a relaxed atmosphereif you are alone and want to sit on a bech watching the passing parade, this one is for you. security here is of a high standard."
        }, 
        {
            "index": 414, 
            "rating": "5", 
            "review": "Great new park for the city as part of the World Cup legacy. Cape Town's newest park is a delightful spot to visit for a walk. They have created a wonderful indigenous garden to stroll through, large grassy areas for picnics and a wonderful exercise area with interactive equipment. The views from the gardens include Table Mountain and you are at the footstep of the World Cup Stadium - it is a great spot for taking pictures. Parking is fairly easy - head along the beach road in Moulle Point and park and walk through. It is great to combine a walk with a visit to one of the little restaurants in the area - so plan on a coffee and Cafe Neo afterwards next to the lighthouse or head to Newport Deli to stock up with great breads, cheeses and meats and then head into the gardens for a picnic! It is a wonderful area for relaxation and a great addition to the city"
        }
    ]
}