{
    "category": "Cape-Town-Central", 
    "entity": "Bloubergstrand-Beach", 
    "avg_rating_stars": 4.49, 
    "review_count": 700, 
    "rating_stats": {
        "poor": 6, 
        "average": 44, 
        "terrible": 3, 
        "very_good": 239, 
        "excellent": 408
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "The most beautiful views. Postcard perfect views of Table Mountain from Bloubergstrand beach. Lovely place to relax for the day and always a good atmosphere."
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "Wonderful first view of Cape Town. Great stop on the way to Cape Town for a fabulous first glimpse of the city. Highly recommended detour!"
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "Blouberg Beach - Looking to Table Mountain. Blouberg Beach is situated between Big Bay and Table View Beach. The corner of the beach has some great rock pools to explore. Many photographs are taken of Table Mountain from here, with the waves splashing over the rocks and the mountain in the background. From the beach you can look out into Table Bay as well as look back down the beach at Table View and Milnerton."
        }, 
        {
            "index": 4, 
            "rating": "5", 
            "review": "Blouberg beach. Early morning strole or jog is the best way to start your day. Evening sundowner as the sun dips into the sea and disappears for another evening is indescribable."
        }, 
        {
            "index": 5, 
            "rating": "4", 
            "review": "Dip your toes in the cold atlantic. Enjoy a view of table mountain from the beautiful beaches where you can take a long stroll. Every now and then you can dip your feet in the refreshing sea and really enjoy the beauty."
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "chilly but great. The clean beach and chilly water made for a wonderful short walk after visiting one of the many eateries in the area. Park only where allowed to prevent nasty surprises, and it was recommended to us not to walk at night alone on the beach, however we are not sure if there is a problem or if our friend was over cautious."
        }, 
        {
            "index": 7, 
            "rating": "5", 
            "review": "awesome.. best place to see table mountain from Bloubergstrand beach has lots of eating places. people are very friendly. "
        }, 
        {
            "index": 8, 
            "rating": "5", 
            "review": "Awesome spot for kiting, wind surfing. Perhaps not the best spot for beach goers but the best spot for sure for kiting enthusiasts, wind surfers. Plenty of restaurants, equipment rentals."
        }, 
        {
            "index": 9, 
            "rating": "5", 
            "review": "the best sunset point in the cape area. great beach to do Kite surfing, walking, its safe there, sometimes very windy and its not said that you always see the table mountain."
        }, 
        {
            "index": 10, 
            "rating": "5", 
            "review": "The best view of Table Mountain in Cape Town. The water might be cold, but it is one of the most beautiful settings in Cape Town. On a windy day you will see many kite surfers enjoying the South Easter. The beach is long and ideal for a walk up or down the coast. There are bars and eateries on the other side of the road parallel to the beach. Great for a day on the beach."
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "Views. Long walks, surfing ,tanning or just relaxing this beach offers amazing views with plenty to do on and around the beach, whether you are in for a long or short visit you will definitely enjoy the views"
        }, 
        {
            "index": 12, 
            "rating": "5", 
            "review": "Sea breeze. Amazing views and great activities abound at Bloubergstrand Beach. there is always something here to do for families, friends, couples and tourists. There are fun filled activities to do and excellent places to eat. What makes this place wonderful is the magnificnet sunset as the day ends."
        }, 
        {
            "index": 13, 
            "rating": "5", 
            "review": "E. Burger. Good place to do body boarding, kite surfing or just relax on the beach. Eating spots close by. Kids will love the beach and you have a lovely view of Cape Town, Robin Island and Table Mountain."
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "Very clean. Love the beach, it is very clean. It's family and dog friendly. Eden on the bay is close and u can buy a drink or eats. Very relaxing!"
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "Spend a lazy day in the Sun. Sea and sun lovers. Just for you. This beach is perfect to just sit and watch the waves coming in. Walk along the sandy waters edge and just enjoy what nature has to offer. Absolutely breathtaking. do not miss it. There is ample parking and eating places."
        }, 
        {
            "index": 16, 
            "rating": "5", 
            "review": "Great Beach. Great beach, so many good chicks and the sea was awesome. I've spent many good times here, actually."
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "sandy beaches as far as the eye can see. Really lovely area to relax in, close to loads of restaurants and bars, and with an incredible view of table mountain. What more could you want?!\n."
        }, 
        {
            "index": 18, 
            "rating": "4", 
            "review": "Fabulous views. Most stunning views of the Mountain and Signal Hill. You also see Robin Island while you walk on the white soft sands down the beach."
        }, 
        {
            "index": 19, 
            "rating": "4", 
            "review": "EASY TO GET TO AND WHAT A VIEW. This has to be landmark beach in Cape Town, specifically for the view of Table Mountain. It’s a bit of a distance from the city centre and the beautiful beaches on the Camps bay /Clifton side, which are generally wind protected. You just can’t beat the view of Table Mountain from here. Be warned, that if the South Easter wind is blowing (the famous summer wind), you are going to be blown away on this beach. It’s a personal choice, I would go for the view, the kite surfers love it. Public transport (Myciti bus) from the city centre is easy, you just leave the main bus hub in the city, to the main bus hub in Table view and connect onto Blouberg for another perspective of city. Things are different as is any “hood” of Cape Town."
        }, 
        {
            "index": 20, 
            "rating": "4", 
            "review": "Best back in CT area. While we love the Camps Bay beaches, the rip tides put us off as it meant the kids could do no more than paddle. Bloubergstrand was recommended to us & we are glad we went - really good for body boarding and lots of nice places to eat or have a sun downer along the shore line. The beach was a little dirty, which is why I have not given a 5 star rating."
        }, 
        {
            "index": 21, 
            "rating": "4", 
            "review": "A lovely beach. A must see beach for visitors from near and far. Great for a mornig wander along the ocean. Super views of Table Mountain and Robben Island."
        }, 
        {
            "index": 22, 
            "rating": "5", 
            "review": "Different view of Cape town. We were taken to this beach to watch sun down which was spectacular. It is a long sandy beach suitable for families and surfers."
        }, 
        {
            "index": 23, 
            "rating": "5", 
            "review": "Fab. There are so many restaurants and cafes near Bloubergstrand Beach. The beach itself is beautiful and amazingly clean!!"
        }, 
        {
            "index": 24, 
            "rating": "4", 
            "review": "Best view of Table Mountain. Bloubergstrand, north of Cape Town, offers the best view of Table Mountain. From there the mountain really looks like a table. When Jan van Riebeeck approached to-day's Cape Town by ship from Europe in 1652 he saw a table, hence the name.\nBloubergstrand itself is very much a tourist area with a beach and shops, hotels and restaurants."
        }, 
        {
            "index": 25, 
            "rating": "4", 
            "review": "for sundowners on the Beach with a view of Cape Town. Although the area is more for families or people trying to avoid the higher prices of Cape Town centre/Waterkant there is a special thing her: The View! Enjoy it sitting on the beach while the sun sets."
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "Best view of table mountain. This is the area where those great shots of Table Mountain are taken. Lots of kite boarding, surfing, jogging, dog walking. A great place to sit and watch the world go by."
        }, 
        {
            "index": 27, 
            "rating": "5", 
            "review": "Iconic View or the Mother City. Boubergbeach is not really on the main tourist map and it should be. Here you get a wonderful panorama view of Table Mountain and Robben Island. Walk for hours along this beautiful white sand beach and if you are into a refreshing swim there are lots of safe places. On a windy day it is a treat to watch the kite surfers who come from all over the world for spectacular conditions during the windy season in summer."
        }, 
        {
            "index": 28, 
            "rating": "4", 
            "review": "Unique view of Table Mountain. From here you can see Table Mountain, Lions Head, Signal Hill and the CBD. The beach is nice and clean but there isn't a lot else around. Come here for the perfect picture of Table Mountain during the day or at sunset. It is a bit of a drive out from central Cape Town but well wort it!"
        }, 
        {
            "index": 29, 
            "rating": "4", 
            "review": "My favourite!. Perfect view of Table mountain, Robben Island. Pristine beach on a winters day. If you want to take the perfect photo of Table Mountain, then come over to Blouberg Strand. I believe the people who live on this side of Cape Town will want to keep it a secret."
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Breathtaking. Well it is great to go here when it is clear so you have that famous view of table mountain. It is also great to go when the wind is blowing if you are a keen photographer The kite surfers, wind surfers and surfers are amazing to watch and time seems to pass as you distress watching the action. Sunrise and sunsets from here are also great picture moments"
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "Splendid!. Sunset view is fabulous. The beach is clean and relatively vacant apart from occasional walkers but might have been the time of year ie May. Can be windy but hey this is Cape Town! would stay in Bloubergstrand just so I can enjoy what I consider the best view of Table Mountain."
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "Picture perfect Cape. One of Cape Towns iconic beaches and views. Well served by transport. However, pl avoid peak hours as traffic can be congested. Great restaurants and pubs along the beach and beyond. Beautiful view of Table mountain. Please enjoy"
        }, 
        {
            "index": 33, 
            "rating": "4", 
            "review": "Beach Time. Blouberg strand( Beach) has a lovely view of Table Mountain. The weather is usually tricky. Water is on the cold side. Well known beach...white sands. Can swim and surf there"
        }, 
        {
            "index": 34, 
            "rating": "4", 
            "review": "Great Surfing. A great beach for surfers and to hang out. It can be tough to find a parking spot but there are always spaces available just a bit farther out,. Police checking for valid license decals and issuing fines if out of date. A great, relaxing surf hang out."
        }, 
        {
            "index": 35, 
            "rating": "4", 
            "review": "Awesome for wind surfing. Extremely windy. Has some of the best views of the table top and really shows off the view often advertised. It gets very busy and parking is a problem. There are police officers all around and tickets for illegal parking are given fast and furiously. There were a lot of wind surfers despite the frigid temperatures. Not really a beach for tanning or swimming."
        }, 
        {
            "index": 36, 
            "rating": "5", 
            "review": "Lovely clean beach & View. Love this beach and to see all the people walking, jogging, walking dogs. All the dogs look really happy too! It's a lovely big, wide beach with ample parking and fantastic views. Perfect for a walk, day at the beach, romantic sunset picnic, walking dogs (lots of bins provided for humans to clean up). I just love it here, even if it is windy in season"
        }, 
        {
            "index": 37, 
            "rating": "4", 
            "review": "blouberg. the sun the sea and the wind a wonderful combination. the restaurants and hotels give the opportunity to enjoy"
        }, 
        {
            "index": 38, 
            "rating": "3", 
            "review": "lovely views and beaches. lovely for a walk and picnic, but water is very cold....great views of table mountain and robben island."
        }, 
        {
            "index": 39, 
            "rating": "4", 
            "review": "Iconic table mountain. Best place for a picture of the mountain.Can get pretty wild and windy,and the surf is quite rough,but one gets totally lost in one's thoughts taking long walks surrounded by such magnificent splendour.great sunsets over the western seaboard."
        }, 
        {
            "index": 40, 
            "rating": "5", 
            "review": "A lovely beach for walking and walking dogs. From Bloubergstrand beach you have a spectacular view of Table mountain and the city as well as Robben island. Many ships have foundered in this area as Cape Town is also called the Cape of storms.It was a lovely clear winter's day when I was there and could see far out and ships waiting in the bay to enter the harbour. The water is very cold as it is the Atlantic ocean . Walk on the promenade if you do not feel like walking on the sand. Many people take their daily exercise along the beach. Along Blouberg beach are many good restaurants and cafes."
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "Clean, safe. Bloubergstrand Beach is extremely clean and safe with the most wonderful views of the Ocean as well as Table Mountain. We have been there twice this year already and am planning to return soon for a long vacation"
        }, 
        {
            "index": 42, 
            "rating": "4", 
            "review": "Spectacular view of the mountain. Love the beach so clean. Views are beautiful. Good place to walk or jog or just sit on the bench and look at the mountain."
        }, 
        {
            "index": 43, 
            "rating": "4", 
            "review": "Picture Postcard Blouberg. Amazing sea, sand and surf. Laze around on the beach during the day and dine at one of the many nearby restaurants at your leisure. Amazing views of Table Mountain and world reknown, Robben Island. (Nelson Mandela's prison) Cape Town's best family beach!"
        }, 
        {
            "index": 44, 
            "rating": "4", 
            "review": "Best view of Table Mountain. The view of Table Mountain when the weather is great is absolutely jaw dropping. Only problem is the beach isn't the greatest."
        }, 
        {
            "index": 45, 
            "rating": "5", 
            "review": "Sunday stroll with ice cream. Beautiful beach with amazing views of table mountain. Be sure to try the ice cream place on the corner next to the traffic sircle. Best ice cream"
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "Best views of Table Mountain. If you wish to have the best views of Table Mountain and Table Bay, Bloubergstrand remains the number 1 choice. Enjoy a lovely beach walk or a swim (water cold), or excellent surfing conditions. Also a wide choice of numerous waterfront restaurants."
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "Blouberg Strand, the ultimate view of Table Mountain. If you want to capture epic photographs of this famous landmark, this is the place to be. Every hour and every day the view change from serene to ultra dramatic."
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "Home away from home. My boyfriend lives in Bloubergstrand and whenever I visit him I go for a walk on the beach. The beachfront is well maintained, safe, and always full of people exercising and walking dogs. Such a lovely atmosphere, I would love to live here all the time!"
        }, 
        {
            "index": 49, 
            "rating": "5", 
            "review": "Table Mountain at its Best. It is what it is - spectacular views of Table Mountain, gorgeous beaches, high-rise apartment blocks sprouting by the day, WIND WIND and WIND, and then again, the VIEW, crashing waves on perfectly white beaches.... and then, as always, I am struck with the thought of what the place would have been without its prefect view of the Cape Tonians' biggest claim to fame, Table Mountain? I will always love going there, but that incessant wind will prevent me from ever wanting to live there! But thank you for all the beautiful pics I have taken there over many decades now!!"
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "Nice n quiet. Very Nice beach oppositie of table berg mountain. A lot of good restaurants in the neighborhood. No problems parking our car."
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "All senses needed!. To see beautiful Table Mountain from this angle, hear the waves break, smell the sea, feel the sun and wind (I was not brave enough to swim in the cold water and taste the salt water!) is fantastic. Today there were clouds over Table Mountain- we say the mountain has his tablecloth on!"
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "Picture Postcard perfect. Soft white sand, close to shops and restaurants and with the most breathtaking views of Table Mountain.\nCapetonians love going here! It's really the most pretty view of the mountain and completely free."
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "Not called Blouberg for nothing. Bloubergstrand is Afrikaans for Windy Beach, and BOY does it blow there. I don't think I have ever visited this beach when it wasn't blowing hard. Windsurfers abound and there is an annual windsurfing world title competition held there every year. Huge long beach a few miles from Cape Town central. The main attraction for this beach are the sensational views it offers of Table Mountain."
        }, 
        {
            "index": 54, 
            "rating": "5", 
            "review": "Most spectacular view of Table Mountain. Surf, sea, sand and a view to die for! Iconic to say the least. Watch the surfers, paddle skiers, kite fliers enjoy themselves at this superb spot. If you do nothing else, walk along the promenade and imprint the view into your memory banks."
        }, 
        {
            "index": 55, 
            "rating": "5", 
            "review": "My favorite beach so far. This is the most beautiful beach I have visited so far. Amazing views, quite and restaurants and pubs are also friendly. One of my favorite places if i ever have to move."
        }, 
        {
            "index": 56, 
            "rating": "5", 
            "review": "Amazing views. Anytime of the day - but dawn and sunset are just amazing - on a clear day it is breathtaking! One can take long walks or watch the paragliders have fun!"
        }, 
        {
            "index": 57, 
            "rating": "4", 
            "review": "Waves, big waves!. Good beach to walk on, what an endless view. Beautiful view of the table mountain, although it was a bit cloudy today. This place would be fantastic in the summer, now its just a bit cold for me. And a lot of nice shells."
        }, 
        {
            "index": 58, 
            "rating": "4", 
            "review": "One of our favourite places.. Sit by the sea for an hour or so, walk on the beach or swim in the sea with a beautiful view of Table Mountain across the ocean and there are a few good places to eat. We often drive out to Blouberg for an hour or so quite often & sit and have a coffee at a nice little tea room on the front."
        }, 
        {
            "index": 59, 
            "rating": "5", 
            "review": "A view to die for!. Bloubergstrand Beach gives one the only really great view of Table Mountain. It is wide, long and clean with many fascinating rock pools at low tide, and most impressive wave action at high tide. You haven't \"done\" Cape Town until you have visited this beach"
        }, 
        {
            "index": 60, 
            "rating": "4", 
            "review": "the other side. a nice break from camps bay clifton side.....not an option if the South Easter is blowing though....unless you are willing to watch the kite surfers carve up the sea for a few hours...much more affordable than Camps Bay and even cheaper than Muizenburg..an option for those on a budget!"
        }, 
        {
            "index": 61, 
            "rating": "5", 
            "review": "Great beach for a weekend walk. I like this beach for it's beautiful view over the Table Mountain and the fact that it's never overcrowded. The beach is flat and great for a walk or a run. Sometimes it's a bit too windy and I would suggest to ware something warm just in case. Dogs are allowed and mine always has fun there, chasing the waves. It looks like the place is good for at the wind surfing too. You can find a few restaurants around for breakfast or brunch."
        }, 
        {
            "index": 62, 
            "rating": "4", 
            "review": "So blows the wind. Bloubergstrand is known for its gusty wind but have to say went there the other week and hardly any wind at all - nice place to visit and take photo's"
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "Must to visit if visiting Cape Town. The view is better that from any place in town. I would feel pity if we would leave Cape Town not visiting this place. I would even say. If I would advice to a friends, I would say that it is more important to come here, that to climb this mountain."
        }, 
        {
            "index": 64, 
            "rating": "4", 
            "review": "Best views of Table Mountain. Bloubergstrand beach is one of the nicest beaches and is child and pet friendly, the views of the ocean and Table Mountain are amazing. This beach is perfect for a long stroll."
        }, 
        {
            "index": 65, 
            "rating": "5", 
            "review": "Beautiful setting. Awesome sunsets, best view of Table Mountain, great walks, sundowners, surf watching, sandcastles and cold swims"
        }, 
        {
            "index": 66, 
            "rating": "4", 
            "review": "Best view of one of the new natural wonders of the world, Table Mountain.. The view of Table Mountain as seen from Blouberstrand Beach is postcard beautiful and wonderful just to view and inhale the fresh sea air. Medicine on its own!"
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "Best view in the world. Iconic photo seen real time is soo sureal that it is breath taking. Even after living in Cape Tqwon a while back, It is atill amazing"
        }, 
        {
            "index": 68, 
            "rating": "5", 
            "review": "The Best Cape View. We took a stroll on Bloubergstrand Beach at twilight and enjoyed the sunset, the rolling of the sea and the excellent night view towards Cape Town and Table Mountain"
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "Beautiful beach. Miles of sandy beach with the best view of Table Mouintain.Some surf and there is a place to get instruction and lessons just over the road from the beach.Notices about shark awareness as on every beach.Lovely just to walk on the beach. Lots of restaurants and bars along the promenade, including a branch of Ocean Basket where the food is great and affordable."
        }, 
        {
            "index": 70, 
            "rating": "5", 
            "review": "Walks on the Beach. Beautiful and scenic walks along a white sandy beach. Waves crashing right at your feet. Meet locals with their dogs along the way or pick shells and pebbles as momentous."
        }, 
        {
            "index": 71, 
            "rating": "5", 
            "review": "Blue Skies, wide open beach and Table Mountain View. My favourite part of Blouberg Beach is the stunning view across the ocean of Table Mountain and the city of Cape Town. But back to the beach that this review is about. Beautiful open sandy beach with kilometres to walk on. Bloubergstrand is also a favourite of kite surfers and any other water sport enthusiasts. Swimming is also allowed and the beach is clean and safe to visit. Stretches of the beach is also pet friendly. If you are visiting in summer, you could plan a whole day on the beach - you will love it. In winter, either doing sport or going for a long walk will feed your soul."
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "What a place to live!. I recently revisited this gorgeous place that I had the pleasure of livin at in 2013. It really has it all, although the sea could be warmer!"
        }, 
        {
            "index": 73, 
            "rating": "5", 
            "review": "When the weather is right.... ...this is the place to get fantastic pics of Table Mountain and it's side kicks in their various moods from sunrise to sunset. It's also a great place to watch world class kite surfing and get pics of the colorful canopies."
        }, 
        {
            "index": 74, 
            "rating": "4", 
            "review": "What a Blue Mountain View. It's just like those famous pictures you see of Table Mountain....it's uncanny! And the beach.....it stretches for what seems like miles...dogs love it; people love it and wind surfers have their day....great."
        }, 
        {
            "index": 75, 
            "rating": "5", 
            "review": "Beautiful place with the mountain and sea coming together.. Bloubergstrand is for certain one of the places that I've always visit we I'm in Cape Town. This place where the sea and Table Mountain are so beautiful seen together, make it worthwhile every time. Ideal place for a picnic."
        }, 
        {
            "index": 76, 
            "rating": "4", 
            "review": "Great for an early morning or sunset walk. The water is freezing, so only the bravest will venture in. The beach is clean and safe with broad sidewalks next to it."
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "Kitesurfers paradise. aside from the beach and Table Mountain views it may not be the prettiest suburbs, but if you're a die hard kiter then there's nowhere else to be :)"
        }, 
        {
            "index": 78, 
            "rating": "5", 
            "review": "Best view ever!. Brilliant dazzling beaches! Stretches for kilometres with heaps of parking. Love this area and surrounds."
        }, 
        {
            "index": 79, 
            "rating": "5", 
            "review": "Grt food awesome view.. Tucked away in a little alcove of the bay is Eden on the bay. Resturants and a view to take your breadth away. You feel you could walk to Robben island at low tide.Real value for money resturants with good food friendly staff and great service. Go and visit when in Capetown."
        }, 
        {
            "index": 80, 
            "rating": "5", 
            "review": "Amazing Beach town . Fantastic sea views, great food stops, wind and kite enthusiasts. Name it. Beautiful well maintained beaches with plenty of facilities nearby. Washroom and change accommodation on the beach. Great spot"
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "Apart of Cape Town that must be visited.... One of the best views of Table Mountain. Visit various restaurants along beach road. Eden on the Bay is another excellent spot with great restaurants. You won't be disappointed."
        }, 
        {
            "index": 82, 
            "rating": "4", 
            "review": "wonderful. for the first time on the beach , my kids had a wonderful time. They just went crazy. They just didn't want to leave"
        }, 
        {
            "index": 83, 
            "rating": "5", 
            "review": "The best view of Table Mountain I guess. Probably the best view of the table mountain and CBD Cape Town, this place is cool quiet and awesome"
        }, 
        {
            "index": 84, 
            "rating": "4", 
            "review": "What more can you say,most Beautiful views in the World. In one day you can get the cheapest and best views of Table Mountain just sitting on the beach,Absolutely Amazing Awesome,stunning"
        }, 
        {
            "index": 85, 
            "rating": "5", 
            "review": "My afternoon at Bloubergstrand Beach. I spent a very pleasant, restful afternoon strolling down the beach. The beach was clean and quiet and the view over Table Bay to Table Mountain, Devil's Peak and Lion'as Head just stunning."
        }, 
        {
            "index": 86, 
            "rating": "4", 
            "review": "Beautiful. Beautiful view on Tablemountain across the bay and nice sandy beach well liked by surfers. Just behind it the road towards The Karoo and Namibia wellcomes."
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "Windy but Unforgettable. The iconic view of Table Mountain. We were lucky enough to be staying directly behind Bloubergstrand Beach and it was such a beautiful place to be! I so wish we had spent more time there as the short walk we had was brilliant, but there's so much to do in Cape Town! A good quality beach, especially for waves and wind, but you have the absolutely unique experience of lunching with Table Mountain on the horizon! Best place to stay and definitely one you should visit, made for a great holiday."
        }, 
        {
            "index": 88, 
            "rating": "5", 
            "review": "Excellent views. This is a very relaxing place to go too. The views of Table mountain is the best. You can walk very far along the beach. There are a lot of lovely restaurants along beach road.The water is very cold,but it is a surfer's, runners, kite and kite surfer's  paradise."
        }, 
        {
            "index": 89, 
            "rating": "5", 
            "review": "Awesome view of Table Mountain. Another favourite of mine to treat guests to the Cape to. Pack a picnic basket wine and a blanket and enjoy sundowners on the beach looking over Table Bay onto Table Mountain.There are free car parks."
        }, 
        {
            "index": 90, 
            "rating": "5", 
            "review": "Amazing afternoon at Blue Bay. Blue Bay is very relaxed. Many restaurants and cafes line the boardwalk along the beach. Young people atmosphere Eat at Moyo with your feet in the water. Have a coffee at Illiy"
        }, 
        {
            "index": 91, 
            "rating": "5", 
            "review": "Make time for it. By now an iconic and we'll published view/scene! So worth making the drive out and just enjoying.\nIt can get windy, but that will not ruin your trip. Maybe shorten it.\nAnd why not continue up the coast further for some great spots for food & drink."
        }, 
        {
            "index": 92, 
            "rating": "5", 
            "review": "Amazing. Probably the best beach .. I have ever been on my travels. Visited 2009 ... Going back 2016. Also great restaurants .... Ie Doodles"
        }, 
        {
            "index": 93, 
            "rating": "4", 
            "review": "Great beach with a view !. We had a few hours to kill so popped down to this beach .. Glad we did , felt like we had the whole place to ourselves .. Lots of space , we felt safe and enjoyed the wonderful view whilst relaxing in the sun ..."
        }, 
        {
            "index": 94, 
            "rating": "5", 
            "review": "Spectacular. View. What an amazing beach got some fantastic photos of table mountain\nThere are some rally nice reasonably priv\nCe"
        }, 
        {
            "index": 95, 
            "rating": "5", 
            "review": "Best View of Table Mountain!. If you want to get a full view of table mountain this is the beach you need to visit. Excellent sunsets as well."
        }, 
        {
            "index": 96, 
            "rating": "5", 
            "review": "Views to die for!. A lovely part of town. Super for a walk along the beach front and a nice range of eateries around, should your tummy start rumbling!"
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "Best view of table mountain. No better place to just sit down for lunch and enjoy the views of Table Mountain. Also great for surfing with or without a kite depending on the situation."
        }, 
        {
            "index": 98, 
            "rating": "4", 
            "review": "Greatest view of Cape Town. A place we enjoy walks on the beach, having a soft-serve on a hot day or simply eating inside the car watching the kite surfers on windy days. Will struggle to beat this place for great views & places to eat."
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "What a view!. It was a miserable day in the city and so we took a drive out to Bloubergstrand. You simply cannot match this view. The wide open beach and walkway are brilliant. We spent hours in the area walking, sitting on the beach, watching the kite surfers and surfers. A wonderful time of just relaxing taking it all in."
        }, 
        {
            "index": 100, 
            "rating": "4", 
            "review": "Amazing View. Can be Windy sometimes, but safe and lots to do around.\nI live there by the way!\nPlenty of affordable and budget holiday accommodation"
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "Good location very good food. Good location very good food , nice staff great fish, we had to wait to be served but no issue and very busy"
        }, 
        {
            "index": 102, 
            "rating": "4", 
            "review": "Good for surfing with beautiful view. beautiful beach and best view of the table mountain, however, the current is strong, not suitable for children to play nearby. Good for jogging and strolling."
        }, 
        {
            "index": 103, 
            "rating": "5", 
            "review": "Great Location. I had not visited this area for over 30 years! What change! The promenade was excellent with magnificent views of Table Mountain. Great shopping centre at Eden on the Bay. Many great restaurants to choose from. Great ambiance!"
        }, 
        {
            "index": 104, 
            "rating": "4", 
            "review": "Penguin watching. the beach is not that big and there aren't that many penguins to see but still it is worth visiting for taking a few pictures with the cute animals."
        }, 
        {
            "index": 105, 
            "rating": "5", 
            "review": "Cold but absolutely beautiful. This beach is absolutely beautiful and has a great view of Table Mountain. It is way to cold to swim but is of course understandable because it is the atlantic ocean. Great beach for a sunset stroll but wear a jacket, the wind does get cold."
        }, 
        {
            "index": 106, 
            "rating": "4", 
            "review": "Greatest views of table mountain. This area provides the greatest views and photo opportunities of table mountain, from across the other side of the bay. It's got a good choice of cafes, bars, and restaurants as well."
        }, 
        {
            "index": 107, 
            "rating": "5", 
            "review": "Super place to saty. This is our 3rd year in a row that we have stayed here. The beaches are lovely, although the water a little cold even in high summer. Great place for restaurants and bars. We really enjoyed the beach walks."
        }, 
        {
            "index": 108, 
            "rating": "5", 
            "review": "postcard view table mountain. from this beach you see the table mountain like a famous postcard. its nice for viewing but not for swimming, veryvery cold!"
        }, 
        {
            "index": 109, 
            "rating": "4", 
            "review": "Great view. Nice view of the city and Table mountain. It was windy and there were a lot of wind surfers. Sand is good, but water was cold."
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "What a view!!. Blouberg strand definitely does look like the post cards!! What a fantastic beach to capture that perfect photo of Cape Town with Table Mountain overlooking the city.\nEven if you just have 5 minutes be sure to stop and take that perfect photo!!"
        }, 
        {
            "index": 111, 
            "rating": "4", 
            "review": "Soft white sand.. A group of us took a walk along the beach to the lighthouse in Milnerton and back. A total of about 14km. The beach was clean and there was not any wind. The water is cold, but refreshing for those that ventured in. The views of Table mountain over the sea are spectacular."
        }, 
        {
            "index": 112, 
            "rating": "5", 
            "review": "Come out to play on the most windiest day!. So on THE most windiest day in CPT I would advise you to go to Bloubergstrand! Locals pours to the beach to come play on the water with their kites / surfboards (wind surfing). We spent nearly two hours just sitting on the beach looking at their moves! Just take sunscreen and a warm jacket! Enjoy!"
        }, 
        {
            "index": 113, 
            "rating": "4", 
            "review": "Best view of the mountain. This is the place to be for a good picture of table mountain, specially during the sunset. Beaches are nice but most of the summer windy"
        }, 
        {
            "index": 114, 
            "rating": "4", 
            "review": "great view of the mountain and stunning sunsets. The wind was below normal which made the walking on the beach more pleasant but it meant the kite surfers stayed at home. The sunsets are awesome from the beach, and the photo's of the mountain are classic. The local fast food places are all reasonable and friendly. Worth the half an hours drive from the city centre."
        }, 
        {
            "index": 115, 
            "rating": "5", 
            "review": "Best beach in the area.. Great beach day when wind below 15 knots.\nSwimming areas must be used as there are strong rip tides that will pull weak swimmer off the shore line."
        }, 
        {
            "index": 116, 
            "rating": "5", 
            "review": "Post card view of Table Mountain . Popular, clean, vast. But don't let it be windy, then it's mostly good for surfing, windsurfing and kitesurfing. Sunscreen, sun hat and sunglasses... And jacket for after sunset!"
        }, 
        {
            "index": 117, 
            "rating": "4", 
            "review": "Nice place to relax. Nice place to visit and spend few hours on a sandy beach. Best view of Table Mountain. However, it does get very windy there, and it becomes bothersome even to take photos as you hair keeps on flying all over the place; ladies don't forget to bring your hair clips. Have seen many people swimming, but have found the water to be too cold."
        }, 
        {
            "index": 118, 
            "rating": "5", 
            "review": "Spectacular sunsets. Great restaurants with a spectacular view of Table Island. Spectacular sunsets and a great beach to enjoy."
        }, 
        {
            "index": 119, 
            "rating": "5", 
            "review": "Lovely beach. Try to go when it is super windy to watch all those kite surfers do their stuff. It is awesome to watch (but not great to walk on the beach then as the sand hurts!). On a clear sunny day, it is also a great place to go for a walk on the beach, with Table Mountain in the back!"
        }, 
        {
            "index": 120, 
            "rating": "5", 
            "review": "Just the best!. My favorite beach in Cape Town by far! the most perfect view, never too busy, bars and restaurants right on the beach, loads of activities to do / hire like SUP boards, cycling along the promenade, kite surfing, surfing etc etc. It can get a bit windy but generally its perfect!"
        }, 
        {
            "index": 121, 
            "rating": "5", 
            "review": "Most memorable view in Cape Town. If you're visiting Cape Town, you simply MUST take a trip out to Blouberg. The view is the BEST in the Cape - there's nothing like seeing the magnificence of Table Mountain from a distance. Nice restaurants in the Big Bay/Little Bay area. Not to be missed."
        }, 
        {
            "index": 122, 
            "rating": "5", 
            "review": "Your front seat ticket to Table Mountain. Don't miss this beautiful spot. Lots of kite surfing, swimming and a huge selection of restaurants right on the beachfront."
        }, 
        {
            "index": 123, 
            "rating": "4", 
            "review": "The classic photo shoot. Great place to hang out, easy to park, lots of bars restaurants, surfing, kite surfing., Great view of Table mountain."
        }, 
        {
            "index": 124, 
            "rating": "5", 
            "review": "the best place in the world. Love the views, Love the white sand, Love the wind, Dog friendly and great places to eat all along the stretch. This could very well be the best place on Earth. Love. Love. Love"
        }, 
        {
            "index": 125, 
            "rating": "5", 
            "review": "Cold water, but very calm and relaxing beach. The water was freezing cold, but the view and beach is great. There are not many tourists/people here so its perfect for families or a lazy Sunday."
        }, 
        {
            "index": 126, 
            "rating": "4", 
            "review": "wind from the left, just like my windsurfing routine back in the Northsea. Awesome beach.\nLaunch your windsurfer safely from the \"Maestros on the Beach\".\nNo crowds.\nSpectacular view on the Table Cloth!"
        }, 
        {
            "index": 127, 
            "rating": "4", 
            "review": "Kite surfer heaven. Beautiful beach; a kite surfer heaven; loads of nice coffee places and restaurants for everyone's taste. The view across to TM is great even if it is cloudy and the mountain has a \"cloth\" on."
        }, 
        {
            "index": 128, 
            "rating": "4", 
            "review": "Picture postcard view of Table Mountain. Here's the iconic view of Cape Town ... Prepare to freeze in the Atlantic if you venture into the waters. Best to sit and drink wine and take in the view, unless you're the active type ... Kitesurfing, surfing, the whole nine yards!"
        }, 
        {
            "index": 129, 
            "rating": "5", 
            "review": "Santa Monica with an even better view. You cant' make this stuff up. The view is one of the world's great ones. And if it's a kite surfing day, it just got better. Cross the street and there is ice cream or Chinese food or cold beer or good coffee .And did I mention the view? Just remember, you may well not be swimming unless you bring your wet suit. But for tanning - this is it. And did I tell you about the view?"
        }, 
        {
            "index": 130, 
            "rating": "5", 
            "review": "Great beach. Wonderful shore line with beautiful blue sea and excellent beach.Lots of restaurants for food and drinks.Superb beach for water sports."
        }, 
        {
            "index": 131, 
            "rating": "5", 
            "review": "Table Mountain with a difference. If you want a spectacular view of a stunning beach with really blue sea and white sands, plus Table Mountain in the backround this is the place to be. This beach is far from the madening crowds, but well worth a visit and take your camera. Please bear in mind the sea is absolutely freezing as it is the Atlantic ocean. The warmer Pacific starts just passed Cape Agulus, the other side of CT."
        }, 
        {
            "index": 132, 
            "rating": "5", 
            "review": "Clean and Fresh. Blouberg beach is a clean and fresh beach. Was there yesterday taking a walk on the long stretch of beach. Great after a Sunday lunch."
        }, 
        {
            "index": 133, 
            "rating": "4", 
            "review": "Visit only once. It is simply a tourist attraction with lots of well know shops and hotels. Very western but with the rand so cheap (16=$1) the process are great. A good place to wander and then go for a boat excursion. Great variety of restaurants too. Could be anywhere though."
        }, 
        {
            "index": 134, 
            "rating": "3", 
            "review": "Classic views of Table Mountain. This is primarily a place to go for the photo opportunty that it presents. There are some nice restaurants in the are for lunch at the same time."
        }, 
        {
            "index": 135, 
            "rating": "4", 
            "review": "Synonymous with Kitesurfing. What you see immediately approaching the beach is amount of kite surfing going on !!! Its kind of like a number of planes on final into a busy airport, it gives you an immediate rush !The beach however is white, and the sand quite cushy , you just want to bury your toes in the sand, you may even think you on a tropical beach ..... until you go into the water !! COLDDDDer than a fridge.Great view of Table mountain !!!"
        }, 
        {
            "index": 136, 
            "rating": "5", 
            "review": "Peaceful scene. This is a quiet and chill area where people jog throughout the day with stunning views of Table Mountain.For photographers, this is the spot where the best images can be captured on clear days."
        }, 
        {
            "index": 137, 
            "rating": "5", 
            "review": "Beautiful view of Table Mountain!. Perfect for families, surfers and dog lovers. Great choices of coffee shops and other shops. The view of Table Mountain is breath taking."
        }, 
        {
            "index": 138, 
            "rating": "4", 
            "review": "Amazing Beach. Perfect white sand, blue water, very intense wind, excellent location for kite surfer. A little bit too windy on many days to enjoy a relaxing day on the beach."
        }, 
        {
            "index": 139, 
            "rating": "4", 
            "review": "Away from the city hustle and bustle. Blouberg Strand provides for peace and quiet away from the city bowl hustle and bustle. If you want to enjoy the beach and beautiful views of Table Mountain this is the place to be. Beware of heavy traffic to and from town in rush hour. MyCityBus provides for excellent and efficient alternative to connect to town and beyond. Excellent restaurants in the area. Accommodation is typically cheaper than in town. Also many self-catering apartments available, many offering excellent views of the \"Table\" and Robben Island."
        }, 
        {
            "index": 140, 
            "rating": "4", 
            "review": "2016 visit. called in here one day, just as they were holding a kite-surfing competition. Fantastic views, but expect there to be high winds. So do not expect this to be a beach day with kids, try Hout Bay for that."
        }, 
        {
            "index": 141, 
            "rating": "4", 
            "review": "Kevin & Rita Taylor. Visited in January this year and stayed in the area. What a beautiful beach and of course the view of Table Mountain. It can however be very windy around this time of year and can be a little troublesome at times. It certainly did not stop us from taking walks on the beach during the day."
        }, 
        {
            "index": 142, 
            "rating": "5", 
            "review": "Incredible sunset!. Spent the afternoon with a couple of friends at the beach and watched the sun set behind Robben Island with Table Mountain just to the left of it. Absolutely b-e-a-utiful! Just be sure to carry a jacket should it get windy."
        }, 
        {
            "index": 143, 
            "rating": "5", 
            "review": "Fun in the sun. Great place for family fun, relaxing in the sun and water sports! Great at low tide for a walk to the island and rock pools, good surf, amazing views of Table Mountain and long stretches of beach for a walk."
        }, 
        {
            "index": 144, 
            "rating": "5", 
            "review": "Most amazing views back to Cape Town. Nothing more to add , the view to Table Mountain is beautiful, the beach is clean and just great for walking. Visit and judge for yourself!"
        }, 
        {
            "index": 145, 
            "rating": "5", 
            "review": "This is a must for a CPT Visitor. Bloubergstrand is a must for a Visitor of Capetown. There is a beautiful view at the Table Mountain and the Lions Head.It is also a famous Spot for Kitesurfers and for Beachwalking.There is a small Nature reserve, with enough Parking which is my favorite spot for walks and photography."
        }, 
        {
            "index": 146, 
            "rating": "5", 
            "review": "WINDY but AMAZING. this beach is best known for its kite surfing, sailing and sea shells. It offers a variety of restaurants and coffee shops ...ideal to grab a few sundowners or meals with a wide range of menus i.e. Mexican, Cuban, local or seafood specialities. It has child friendly places, ideal for families with pets, locals and tourists alike. Be careful though: many a times the waitresses add a few items to your bill....Dont just pay. CHECK the itemised bill!"
        }, 
        {
            "index": 147, 
            "rating": "5", 
            "review": "First place to take your visitors. The view from Bloubergstrand Beach is the best - Table Mountain and on the side, Robyn Island. The best time to go is sunset. Watch the windsurfers and kitesurfers do there thing."
        }, 
        {
            "index": 148, 
            "rating": "4", 
            "review": "Lovely warm beaches. Went to a few of the beaches in this area. The water is much warmer than in Camps Bay. The beaches are fairly clean but do get crowded on the weekends. Views are great."
        }, 
        {
            "index": 149, 
            "rating": "4", 
            "review": "Stunning views of Table Mountain.. This is definitely an amazing spot to go check out the sunset. Many nice restaurants in the area where you can chill out and relax. If you go during lowtide you can walk to the little rock outcropping and get a very nice panaramic view of the mountain and Blouberg. Also good for a swim, after which you can grab some delicious mini-doughnuts and Ice-cream"
        }, 
        {
            "index": 150, 
            "rating": "5", 
            "review": "Gorgeous ocean. This is such a stunning beach. You can be entertained by kite surfers or just enjoy the scenery. Taking a run on this beach is so good. It is just so peaceful & serene."
        }, 
        {
            "index": 151, 
            "rating": "5", 
            "review": "Stunning location . We always take the time for a trip to Bloubergstrand Beach it has such a stunning view of table mountain the sea and the kite suffers make it a great place to chill and watch the world go by its one of our favourite places."
        }, 
        {
            "index": 152, 
            "rating": "5", 
            "review": "Lovely, Private beach. This beach is well situated. Love the privacy from the diners across the road. Very long and open. Will visit this place again"
        }, 
        {
            "index": 153, 
            "rating": "5", 
            "review": "One of the prettiest beaches in the World. At Bloubergstrand beach you can walk for kilometers and really enjoy the view of Table Mountain and big ships waiting to enter the harbor. On a windy day, it is fun to watch the Kite Surfers and there are a few really nice coffee shops along the beach. Visit Carluccis' or Petit Fours and you are welcome to do so in your Kite Surfing outfit. It is a doggie friendly beach and many runners and cyclists also use the broad pavement next to the long straight road that runs past the beach to exercise. You may even find shells and see some dolphins or seals floating by on a good day."
        }, 
        {
            "index": 154, 
            "rating": "5", 
            "review": "Nice location. Very nice place for surfing and enjoying the sea view. A lot of nice places for lunch and drinks. Not always easy to get a cab if you need one"
        }, 
        {
            "index": 155, 
            "rating": "5", 
            "review": "The most beautiful view of Table Mountain. The view of Table Mountain from Blouberg Beach is nothing short of stunning. The sunset on a beautiful evening has to be seen to be believed. The beach is clean and the sand is white and soft but the sea is generally absolutely pain-in-the-ankles freezing cold. There are restaurants in the vicinity."
        }, 
        {
            "index": 156, 
            "rating": "5", 
            "review": "The mecca for kite and windsurfers. This is paradise to the surfers! From early to late. Days are long and there is plenty of time to get rid of ones energy. All kinds of surfers try their luck here."
        }, 
        {
            "index": 157, 
            "rating": "2", 
            "review": "Who beach is it?. One the best beaches to walk has turned into a place where irritable kite surfers glare at people walking their dogs and children playing. The Kites' ropes are all over the show. Unless the kites are directed to a non-swimming beach, I will avoid Blouberg Beach."
        }, 
        {
            "index": 158, 
            "rating": "5", 
            "review": "Gorgeous views, environment for all.. Great views across the bay towards Cape Town city and the mountain, as well as along the coast towards Melkbos. Beach sand is soft and light, but the water is cold."
        }, 
        {
            "index": 159, 
            "rating": "5", 
            "review": "This is the view you were looking for. Looking over the ocean with Table Mountain and the city of Cape Town in the background is just fantastic! We went with our rental car which is very easy, no problem to park the car either. You should take the time to walk on the beautiful endless beach, the water is really freezing cold but the white sand is very nice."
        }, 
        {
            "index": 160, 
            "rating": "4", 
            "review": "A nice day out. A great place to sit and soak up the rays, not for too long mind African sun is a little burny, and watch the kite surfers do their thing. There are a multitude of restaurants and cafes along the front to choose from each one a delight in themselves, it is a pleasant way to spend a lazy morning or afternoon watching somebody else being energetic."
        }, 
        {
            "index": 161, 
            "rating": "5", 
            "review": "AWESOME. A beautiful stretch with stunning, mesmerizing views of Table Mountain, Lion's Head and Signal Hill. Lots of parking on the beach front. Lots of cafes and restaurants to choose from with a vibrant atmosphere. Braai facilities available."
        }, 
        {
            "index": 162, 
            "rating": "5", 
            "review": "Bloubergstand - the windy beach with best views.. My family have visited here a few times, lovely beach area to take your kids and see the best views of Cape Town and table mountain. Lovely little bar/pub food restaurant called Blue Peter nearby which is worth grabbing a beer and pizza and sitting on the lawns overlooking the sea. Great!"
        }, 
        {
            "index": 163, 
            "rating": "5", 
            "review": "THE best view of Table Mountain. If you want to see why Table Mountain is one of the New Seven Wonders of the world, you NEED to see it from Bloubergstrand Beach. If you want to see Kite Surfers do their magic on the Atlantic Ocean, this is the place to go and watch them. With stunning restaurants and coffee shops as well as an Ice Cream Parlour, you are SURE to enjoy this side and sight of Cape Town!!!!"
        }, 
        {
            "index": 164, 
            "rating": "3", 
            "review": "An average beach. Bloubergstrand beach is an average beach about 18kms/10.5 miles from Cape Town City centre. If you are in the Blouberg area it is an ok beach but definitely not worth the drive."
        }, 
        {
            "index": 165, 
            "rating": "4", 
            "review": "Beautiful but cold. Beautiful long stretch of beaches. Clean with a great view of Table Mountain. Restaurants and rental shops nearby. Went on a relatively busy day but manage to find a parking. Went with the intention of surfing but the water was way too cold and winds were too strong. Lots of people were kite-surfing which was nice to watch. It was a very hot day yet the water was icy cold. However, there were still lots of people in the water who didn't seem to mind the cold water."
        }, 
        {
            "index": 166, 
            "rating": "5", 
            "review": "A must see!! Great view!!. Great view of Table Mountain and Robin Island with soft sand accompanied by loads of restaurants, pubs, fast food shops and much much more. For a great night out hit up one of the many night clubs or taverns. Very popular area over weekends."
        }, 
        {
            "index": 167, 
            "rating": "5", 
            "review": "Great Views of Table Mountain. Fantastic beach and nice restaurants with wonderful views of table mountain. Well worth a visit if only to get a different aspect of photos of table mountain."
        }, 
        {
            "index": 168, 
            "rating": "5", 
            "review": "Amazing beach. This is an amazing, long beach; close to Cape Town with lots of parking on the beachfront. Fabulous views of Table Mountain. Very crowded at holiday times in the summer."
        }, 
        {
            "index": 169, 
            "rating": "5", 
            "review": "Best View of the Table. A good stretch of sand that goes on for miles with an amazing view of table mountain. The waves are also half decent for a surf or bodyboard. However the wind does blow frequently and fierce here. It is a real kite surfers paradise."
        }, 
        {
            "index": 170, 
            "rating": "5", 
            "review": "Great beach for a picnic breakfast!. We had a lesiurely breakfast picnic here on our last day in cape town - the beach is gorgeous as are the views across to table mountain. I dont know how accessible this is without a car but if you have your own transport, definitely do it!"
        }, 
        {
            "index": 171, 
            "rating": "5", 
            "review": "Lots of kite surfing fun!. This is a beautiful beach to visit. It has the best view of Table Mountain, beach, eateries, ice cream. What more can you ask for? The water was just ice cold, but not much you can do about that. Love watching the kite surfers!"
        }, 
        {
            "index": 172, 
            "rating": "5", 
            "review": "If not windy - then absolutely magnificent. Bloubergstrand Beach has the most beautiful view of Table Mountain, Lion's Head and Signal Hill. The sand is white and soft and there are braai facilities available too."
        }, 
        {
            "index": 173, 
            "rating": "5", 
            "review": "Enjoying nature for FREE!. By far my highlight of our trip!! Enjoying sunset on the beach while the kids splash around in the waves. It is so beautiful with Table Mountain in the background and peaceful."
        }, 
        {
            "index": 174, 
            "rating": "4", 
            "review": "Unbeatable view of Table Mountain. As a local Capetonian, I hardly ever visit this beach as it almost guaranteed to be windy. If you're a kite surfer, this is your paradise. And if you're looking for the ultimate shot of Table Mountain, this is it. The area has great restaurants and a phenomenal sunset; as a beach - don't arrive hoping to lie in the sun and tan. You will be sandblasted."
        }, 
        {
            "index": 175, 
            "rating": "5", 
            "review": "spent Christmas morning walking along the promenade at Bougberg and it was beautiful and so peaceful.. staying at Sunset Beach made it even more wonderful as Blouberg Beach was only a 5 min drive. The kites in the sky were spectacular."
        }, 
        {
            "index": 176, 
            "rating": "4", 
            "review": "Beach chilling, look to different Kite surfers. lovely chilling on the beach well i look to my favorite sport, Kite surfers straight in front of me.If you want some lessons you can book at High Five kite school"
        }, 
        {
            "index": 177, 
            "rating": "4", 
            "review": "Great view places to avoid. Please avoid doodles restaurant n bar... We had to wait 1 hour 50 mins for our mealOther than that visit other places and view is great"
        }, 
        {
            "index": 178, 
            "rating": "4", 
            "review": "The view you see in movies. That classic view of Table Mountain. A must see. Legendary cold water but with a mesmerizing view. Simply stunning!"
        }, 
        {
            "index": 179, 
            "rating": "4", 
            "review": "nice atmosphere. due to the reason, that you will see lot of surfers there it is a vibrant place to visit, also lots of places to eat there"
        }, 
        {
            "index": 180, 
            "rating": "3", 
            "review": "Table View. Long beach what makes it easier to find a quiet spot. We were here on boxing day. Easy to park and great view on table mountain. Not the most beautiful beach, but what do you need more than water and sand."
        }, 
        {
            "index": 181, 
            "rating": "5", 
            "review": "The Authentic Table Mountain View. Very nice beach which is a Mecca for kite surfers. If you want the 'classic' photo go to the northern end of the beach where the rocks start and take your photo from there. Some great cafes and restartaunts and a nice break from the chaos of the waterfront."
        }, 
        {
            "index": 182, 
            "rating": "4", 
            "review": "Best view of Table Mountain. Bloubergstrand beach offers you the most square, and best photo opportunity of Table Mountain. Also a very nice beach for kids to play at. A must when you're in Cape Town."
        }, 
        {
            "index": 183, 
            "rating": "4", 
            "review": "Miss Green. I go here all the time. The beach is great and it has it has a lot of fun places close by so you won't get bored easily. There is a milky way at the Total garage, also a mini Mugg n Bean inside, KFC is right next door, a bunch of restaurants all around outside and a few bars. Bayside mall is also just up the road!"
        }, 
        {
            "index": 184, 
            "rating": "4", 
            "review": "Bloubergstrand. A great family and social beach area with an attitude! Great views of Cape Town, top restaurants with a unique character to this part of the Western Cape."
        }, 
        {
            "index": 185, 
            "rating": "4", 
            "review": "Get some great pictures of Table Mountain!. Bloubergstrand is always a great place to visit, especially during sunset. You will get the most amazing pictures from this beach, with Table Mountain in the background. This beach has a nice walkway along the beach, as well as a lot of benches to sit on and watch the sunset. This beach is also quite popular for kitesurfing, surfing and stand up paddle boarding. There are also a few nice restaurants, like the Blue Peter Hotel (buy a cocktail and chill on the hotel's lawn while you watch the sunset) as well as Moyo's."
        }, 
        {
            "index": 186, 
            "rating": "4", 
            "review": "Long, lazy beach. We visited when there was a strong South-Easter blowing. Not the best time to spend on the beach, but heaven for kite-surfers. There were hundreds of them flying around on the waves - quite a sight to behold! Bloubergstrand is really a long stretch of sand, curving around Table Bay. You get a wonderful view of Table Mountain, Leeukop (Lion's Head) and Seinheuwel (Signal Hill). Enough restaurants to choose from, for every taste. Do try the pizzas at Blue Peter! Although you can get to Blouberg by public transport, I would recommend using your own car, so that you can explore the area."
        }, 
        {
            "index": 187, 
            "rating": "5", 
            "review": "Bloubergstrand. Always a treat! You can visit Bloubergstrand any time of year for the perfect view. We never get tired of our Table mountain, the perfect stage set for any activity. Beaches are lovely for walking, windsurfing and secluded, romantic picnics between the rocks."
        }, 
        {
            "index": 188, 
            "rating": "5", 
            "review": "The best place to see the Mountain. Bloubergstrand is the best place to look at Table Mountain. Definitely a must for all travelers that visit the Cape!"
        }, 
        {
            "index": 189, 
            "rating": "5", 
            "review": "Place to see Table Mt in full view. this is a fantastic place to see the table mountain in full view, and especially in the late afternoon and early evening, you will see table mountain and cape town city with lights on. it is beautiful and it is amazing"
        }, 
        {
            "index": 190, 
            "rating": "4", 
            "review": "\"Quaint place\". For a quite day with good restaurants close to the beach it is a well deserved visit !!! The perfect place for kite surfing at its best !!! Surfing as well !!!"
        }, 
        {
            "index": 191, 
            "rating": "5", 
            "review": "The best view of TableMountain. If you want to catch the Table Mountain Cape town vibe, you have to visit Blouberg strand/beach front before sunset! Just have a picnic on the lawns or visit one of the many restaurants and wait for that magic moments as the sun moves to the horizon and dips into the sea. You can even on the promenade...and don't forget your camera!"
        }, 
        {
            "index": 192, 
            "rating": "5", 
            "review": "Unsurpassed views of Table Mountain. Bloubergstrand Beach is very popular with the locals for many activities especially Kite Boarding when there is a South Easter. Tourists abound taking THE photo of the mountain. This beach is normally very clean but the south easter can be problematic. There is a lot of parking facilities and the traffic can be rather heavy especially over week ends and holiday periods. Water very cold ( Atlantic)"
        }, 
        {
            "index": 193, 
            "rating": "4", 
            "review": "Exhilarating. The views of table mountain are amazing and you can walk for miles. It is often windy and the water is cold but it is still one of the best beaches in the world. We love watching the kite surfers. Plenty of parking."
        }, 
        {
            "index": 194, 
            "rating": "5", 
            "review": "My beach. Take a picnic basket and go for the day, water is icy cold, but it doesn't matter. Beaches easy to reach from the ample parking spots, view the best in the world."
        }, 
        {
            "index": 195, 
            "rating": "5", 
            "review": "Fab Views. Looking across the bay to Table Mountain is beautiful. To take this step back shows how large the mountain is and the scenery is great. Wonderful white sands and rolling waves are beautiful."
        }, 
        {
            "index": 196, 
            "rating": "4", 
            "review": "Immaculate backdrop. The beach is beautiful, long sandy stretches very good for walking, the sea is pretty cold so swimming is left to the brave or those with wetsuits but the backdrop of Devil's Peak, Table Mountain and Lions Head is unbeatable. For the more adventurous, kite surfing and paddleboarding are also options."
        }, 
        {
            "index": 197, 
            "rating": "4", 
            "review": "Windy!. Excellent view of the mountain! Very windy though, sunsets at this spot are picturesque.Spot at the Blue Peter for a drink or two, or the Primi Piatti, for sundowners."
        }, 
        {
            "index": 198, 
            "rating": "5", 
            "review": "Staying at hotel in Blouberg. Blouberg is a great place to stay. It's far enough from the hustle and bustle of the CBD and offers tranquil beaches. There are plenty shopping centers in the area."
        }, 
        {
            "index": 199, 
            "rating": "5", 
            "review": "An Excellent Stretch of Sandy Beach!. This is the place where many of the best photos of Table Mountain are taken from and it offers several miles of beautiful white sandy beaches and opportunities for swimming, surfing and kite surfing. The parking and amenities are top notch and will reward anyone who travels west of Capetown for another view of this enchanted city."
        }, 
        {
            "index": 200, 
            "rating": "5", 
            "review": "Excellent View of Table Mountain & Lovely Beach. My friend drove me here as he used to stay there with the view of the Table Mountain. One thing that strikes me the most about Cape Town is that it is filled with amazing beaches - you feet sink into the cold, soft sand & the crashing waves are simply therapeutic. In this case, you get the added bonus of having the Table Mountain right in front of you too. Gets a bit cold of course - perfect place for a date/picnic, but of course, suit up & not be like me who went there in shirt and shorts!"
        }, 
        {
            "index": 201, 
            "rating": "5", 
            "review": "Just a day at the beach.... Park your car or bike, and just sit and look at the magnificant waves! Feel the power and smell the ocean. This is what God has in mind when he created the oceans..."
        }, 
        {
            "index": 202, 
            "rating": "5", 
            "review": "Beautiful views of Tablemountain. The views are fantastic, the beach wonderful, nice restaurants to sit and enjoying beautiful food and wine."
        }, 
        {
            "index": 203, 
            "rating": "5", 
            "review": "Stunning. What beautiful beach. Wonderful views across the bay, sand like talc, and entertainment watching the skilled kite surfers in action.\nMust watch the sunset from here, it is mind blowing."
        }, 
        {
            "index": 204, 
            "rating": "4", 
            "review": "Magic Beach. As the photo shows a super beach overlooking the grand Table Mountain. Being the Atlantic Ocean very cold for swimming although attended by many kite surfers."
        }, 
        {
            "index": 205, 
            "rating": "5", 
            "review": "This is south Africa. What's not to like about Bloubergstrand? I fell in love with it on one of my first visits to the Cape and still I love it for its fantastic view and the freedom of being by the sea on the beach - watching kite surfers perform seemingly endless miracles. It is a great place to visit, walk, smile chat and chill as long as the wind is not so fierce that it causes the sand to bite your ankles!"
        }, 
        {
            "index": 206, 
            "rating": "5", 
            "review": "Best view of Table Mountain. We went to get a view of Table Mountain. It was the best view of it we had. The beach goes on and on, great to walk along. No crowds of people, just a few dog walkers. We didn't do the Robbin Island trip, but I believe you get a similar view from there. Other than the view and beach there didn't seem much to do in this area."
        }, 
        {
            "index": 207, 
            "rating": "5", 
            "review": "Best free view of Table Mountain and Cape Town!. Short drive from Cape Town which should not be missed. Lovely long beach to walk along and amazing view of Table Mountain. You could spend around an hour here just walking and taking in the sight."
        }, 
        {
            "index": 208, 
            "rating": "5", 
            "review": "Stunning. This is a stunning beach and you will see many amazing sunsets that will take your breath away. It was a pleasure watching the whales"
        }, 
        {
            "index": 209, 
            "rating": "5", 
            "review": "Another Gorgeous Beach. More Diverse people, kid friendly and more waves than the other beaches....though the water is COLD. A great place for a weekend afternoon. There will be some trying to sell stuff but that's the case at many beaches."
        }, 
        {
            "index": 210, 
            "rating": "5", 
            "review": "Breathtaking ..ALL THE TIME. Can be windy but always beautiful Cocktails by the beachfront! Absolutely awesome. The clean stretch of the beach also makes for good exercise."
        }, 
        {
            "index": 211, 
            "rating": "4", 
            "review": "Table Mt View from a distance. sandy white beach with a beautiful view of Table Mountain. Awesome to run your dogs, sit and see the sunset."
        }, 
        {
            "index": 212, 
            "rating": "5", 
            "review": "THE hotspot to view the Table mountain. Not many people know about this attraction. It is the best view point to donwtown and the Table mountain. It is just 20 minutes by car from downtown. A few cafes are on the side also and parking is easy!"
        }, 
        {
            "index": 213, 
            "rating": "4", 
            "review": "The best view of Table Mountain. The best view of Table Mountain and a wonderful strolling beach to enjoy, swim or just relax. Good food & drinks within walking distance."
        }, 
        {
            "index": 214, 
            "rating": "5", 
            "review": "Amazing view across the Bay and the mountain, and ovley white sand beaches and dunes. On a windy day this beach lights up in colour with wind surfers, or when the tide is right the surfers or kayaks or something always going on. Lots of restaurant's, pubs and clubs in the area, Suitable for the sporty, the lazy the kids and the young and the old.Amazing sunsets and lots of cocktail spots, Tremendous views of Robben Island .OOOh my side of town what must I say"
        }, 
        {
            "index": 215, 
            "rating": "5", 
            "review": "A must see for visitors to Cape Town. Although it takes some time to get there, mostly due to road construction, it is worth the visit. Exceptional view of Table Mountain and Cape Town. When I visited it was slightly hazy, but still got some nice pics. This area is in my top five things to do in Cape Town."
        }, 
        {
            "index": 216, 
            "rating": "4", 
            "review": "Million dollar view. Bloubergstrand beaches are so beautiful , wide, open and the most beautiful view of Table mountain. Very trendy with lots of activities and a beautiful spot to enjoy and relax."
        }, 
        {
            "index": 217, 
            "rating": "4", 
            "review": "The best panorama view of table mountain. If you really want to stand back to see the complete mountain in panorama this is the place to go. Nice beach if you want, plenty to eat, it's a lazy day/part day out"
        }, 
        {
            "index": 218, 
            "rating": "4", 
            "review": "Best views of Table Mountain. I regularly take groups of foreign language students on the MyCiti bus(public) to Eden on the Bay and then walk back towards Table Mountain. We stop off at Ons Huisie for dinner, there are other places but it's my best and we watch the stunning sunsets before returning home on the bus which is very safe. The temperatures are generally lower than central Cape Town and is often windy which is why it is popular with kite surfers"
        }, 
        {
            "index": 219, 
            "rating": "4", 
            "review": "fabulous beach with stunning views. Bloubergstrand is a great place to stay - close to Cape Town central, good bus service into the centre of CT and stunning views over Table Mountain."
        }, 
        {
            "index": 220, 
            "rating": "5", 
            "review": "Namakwaland tour. Leaving from Cape Town with Namakwa Tours was really a trip to remember. Well organised accommodation,delicious home cooked meals.Friendly staff.Tour guide Mike,oh my so competent,well informed and a real live wire!From the first turn to Blouberg strand we stopped to look at the flowers. This is a mist do trip!"
        }, 
        {
            "index": 221, 
            "rating": "5", 
            "review": "Beautiful beach with best view of table mountain. Stayed in B&B just behind the beach but couldn't resist after a long days work to have a walk at sunset. Best way to relax... :)"
        }, 
        {
            "index": 222, 
            "rating": "5", 
            "review": "The Best View!. Bloubergstrand has the best view of Table Mountain and Cape Town as a whole. You can even get a clear view of Robben Island. The water is very cold though."
        }, 
        {
            "index": 223, 
            "rating": "5", 
            "review": "What a Setting!!!. There are few places in South Africa with as beautiful a setting as Bloubergstrand Beach. You see see a beach front practically from horizon to horizon! And then to top it all, you have a full frontal shot of Table Mountain in all its glory, especially on a clear day."
        }, 
        {
            "index": 224, 
            "rating": "5", 
            "review": "Awesome Beach. Lovely beach . No overcrowding . Perfect for people who don't love crowds of people . Kids love the icy cold water :-). Love the sunsets and the view of Table Mountain and Robben Island."
        }, 
        {
            "index": 225, 
            "rating": "5", 
            "review": "BEACH AND COFFEE AT IT'S BEST. An amazing beach where you can stroll for miles and miles. One of the best I have visited and just across the road from plenty coffee shops an restaurants along the road."
        }, 
        {
            "index": 226, 
            "rating": "4", 
            "review": "Scenic. This is my favourite beach as the view of Table Mountain is fantastic!\nEarly morning from 7am is great. Summer much better."
        }, 
        {
            "index": 227, 
            "rating": "5", 
            "review": "Best view. Such an beautiful view of Table Mountain, even on a misty day. We went early morning and spent quite a while just starting at the view and the very clear blue water. Not a beach for picking up shells but theres plenty of small rounded rocks all over."
        }, 
        {
            "index": 228, 
            "rating": "5", 
            "review": "Brilliant!. Very nice when you see the background, especially when kite-surfers are there, it's the best place in the world for kite-surving!"
        }, 
        {
            "index": 229, 
            "rating": "3", 
            "review": "Very nice views. Very nice views and photo opportunities, but far out of Cape Town and you need at least 30 minutes from Cape Town CBD to get there."
        }, 
        {
            "index": 230, 
            "rating": "5", 
            "review": "Early morning beach walk!. Taking an early morning walk on the most beautiful stretch of beach in the Cape with Table Mountain views!!!"
        }, 
        {
            "index": 231, 
            "rating": "5", 
            "review": "Such an amazing view. Probably the beach with the best view of Table Mountain. Definitely why I decided to propose on this amazing beach"
        }, 
        {
            "index": 232, 
            "rating": "5", 
            "review": "The most amazing view of Cape Town. I had the chance to stumble upon this beach on a very sunny (and not so windy day!), This is the picture postal perfect place. The view is just amazing and at sunset it is even better."
        }, 
        {
            "index": 233, 
            "rating": "5", 
            "review": "Best beach in town. Visited on our way towards Cape Town. The Ocean is blue, the beach almost white. Great view of Cape Town in the distance. A must visit if you like white sandy beaches with a great view."
        }, 
        {
            "index": 234, 
            "rating": "5", 
            "review": "Stunningly beautiful . Went here Tuesday 22 September, beach was deserted....... apart from the odd dog walker. Lovely beach but the view of table mountain is just \"jaw dropping\"....... If you do go to Cape Town you must go here."
        }, 
        {
            "index": 235, 
            "rating": "5", 
            "review": "Perfect beach. On a clear day the views across to table mountain will give you the quintessential photo of table mountain (short of going to Robben island)Stunning views, clean beach - do yourself a favour and drive further down the coastal road to the Blue Peter for a few sundowners - absolulutly stunning, no where else in the world with these sunsets over the bay/ocean"
        }, 
        {
            "index": 236, 
            "rating": "5", 
            "review": "Stunning!. With the tourist brouchure view you can't go wrong! When we were there the kite boarders were having a field day due to the windy conditions! Awesome!"
        }, 
        {
            "index": 237, 
            "rating": "5", 
            "review": "Most beautiful views. The view of Table Mountain from the beach is amazing. A stunning beach to take the kids and enjoy a family outing building sand castles."
        }, 
        {
            "index": 238, 
            "rating": "5", 
            "review": "Post card beautiful!. A beautiful, long beach with the most famous view of Table Mountain from across the bay. Lovely for a walk with some lovely places to eat/drink."
        }, 
        {
            "index": 239, 
            "rating": "4", 
            "review": "An everyday visit. A beautiful beach with wonderful views of Table Mountain.Water very cold but access to the Island during low tide.Able to walk along the seashore for miles ."
        }, 
        {
            "index": 240, 
            "rating": "5", 
            "review": "Picture perfect. On our very last day in CPT we made a massive mission (in Friday evening traffic out here for the famous 'In the Frame' picture. The hour long taxi journey at 5pm was worth it because the view looking back at CPT and Table Mountain is as good as a post card. The promenade where the frame is has loads of bars and had a fantastic pre-weekend vibe about it. All of us agreed that we would have been disappointed if we hadn't made the effort to go hang out here."
        }, 
        {
            "index": 241, 
            "rating": "5", 
            "review": "Postcard views!. Best beach to view Cape Town from the post card pictures! This beach should be renamed Selfie Beach as most everyone coming to this beach takes a selfie or 2 from this beach! Great soft sand, streches for miles. Avoid it on the south easter days (you know it is blowing when the mountain has a thin cloud over the top!) Very pet friendly as long as your dog is on a lead and you clean up after your doggies mess. Stunning sunsets over the beach and awesome little bars along the beach to enjoy watching the twinkle of the lights as dusk sets over the city."
        }, 
        {
            "index": 242, 
            "rating": "5", 
            "review": "Amazing view of Table Mountain. A must visit when in Cape Town. To me, if you are in Cape Town, and you have not visited Bloubergstrand Beach, the trip is incomplete. It is not an ideal beach to spend a day on. The reason is that it is windy. But it offers a great view of Table Mountain.... The photos taken from this beach of Table Mountain are iconic. Spend an hour or so there, and you can always eat from the restaurants nearby. Here is a link to photos of Table Mountain from BLoubergstrand: http://www.mujahidurrehman.com/galleries/landscapes/table-mountain-cape-town/"
        }, 
        {
            "index": 243, 
            "rating": "5", 
            "review": "Landscapes and sunsets.. If you want to get a nice sunset with table mountain in the background this might just be the place you want to be. If you are looking for an endless walk on the beach you might want to drive out to this beach and start walking. The white sands and the chilly waters definitely smooths the soul. It's also a great beach for a family day. There is also a lot of restaurants just across the road along the beach."
        }, 
        {
            "index": 244, 
            "rating": "5", 
            "review": "Picture Perfect. Epic views of the beautiful mountain. If it even looks slightly windy, avoid it...but for photographic moments, this is the palce to be"
        }, 
        {
            "index": 245, 
            "rating": "5", 
            "review": "A place to see!. Really nice beach, extremely windy but worth the view!Perfect spot for a picnic and kit surfer watching!"
        }, 
        {
            "index": 246, 
            "rating": "5", 
            "review": "Beautiful!. The view of Table Mountain and Robben Eiland is amazing! Definitely one of the places to visit when coming to Cape Town!"
        }, 
        {
            "index": 247, 
            "rating": "5", 
            "review": "This is one of the most beautiful beaches in Cape Town. White sands and blue seas wit Table Mountain in the background, what more can one ask for. We took a long walk along the seafront. Even though it was winter, we had some sunshine with the wind. In summer this beach is very popular. There are many, many eating places in the area. Family picnics or just an ice cream cone on the beach is an enjoyable experience for all ages.The water is a bit cold but this doesnt seem to deter the swimmers in good weather. Eden on Bay is on this sea line. Loads of places to stay in the area."
        }, 
        {
            "index": 248, 
            "rating": "4", 
            "review": "chilling experience. the sea, with the views of Table Mountain and Robben Island are priceless. this place gives you all 3 tourist attractions in one place"
        }, 
        {
            "index": 249, 
            "rating": "5", 
            "review": "Blouberg Beach. Perfect for families, couples and friends. Often you can watch kite-surfers from this beach. You can get a beautiful view of Table Mountain from this beach and it is lovely to walk along."
        }, 
        {
            "index": 250, 
            "rating": "5", 
            "review": "Best Kite Surf spot in Cape Town. If you are in to Kite Surfing; this is the spot to be. Good waves and strong winds and a view like none other..."
        }, 
        {
            "index": 251, 
            "rating": "5", 
            "review": "Best ever view of Table mountain. When looking for a perfect place to take a postcard picture of Table mountain, head out to Blouberg on the West coast and you will never be disappointed. White sands, blue sea all compliment the most awesome picture you will ever capture of Table mountain."
        }, 
        {
            "index": 252, 
            "rating": "5", 
            "review": "View of Table Mountain - priceless. The view of Table Mountain from across the water at Bloubergstrand is priceless. Just remember the water is quite cold so keep it in mind."
        }, 
        {
            "index": 253, 
            "rating": "3", 
            "review": "Table mountain views over the sea. Check out the best view of Table Mountain from here. This is a great beach for long dog walks. Very popular with locals"
        }, 
        {
            "index": 254, 
            "rating": "5", 
            "review": "Breath taking. Having been at the top of the mountain for most of the day we decided to go for sun downers here and were totally taking in by the beauty of Cape Town great bars and Restaurants here and the view is superb. dig your feet in the soft beach sand sip a cocktail and enjoy the view this is what i call super!"
        }, 
        {
            "index": 255, 
            "rating": "5", 
            "review": "Best views of Table Mountain. This wide open beach is definitely a must visit when in Cape Town. It has the BEST views of Table Mountain! Plenty eateries and pubs along the beach front. It gets busy on weekends with cyclists and runners getting their heart rates up with some exercise to families enjoying the beach. For the more adventurous types enjoy a dip in the very cold ocean. Enjoy the people watching and also the kite surfing crowd riding the waves. You won't find better views of Table Mountain anywhere!"
        }, 
        {
            "index": 256, 
            "rating": "5", 
            "review": "Exhilirating and Exciting.. This beach is one of the most beautiful beaches i have seen in Cape Town.Clean and lovely sand to be found.It is so conveniently located as well.So easy for visitors to get there.A must See."
        }, 
        {
            "index": 257, 
            "rating": "4", 
            "review": "Perfect photo spot. The amazing view of complete table mountain, cape towns wonderful oceans and pubs, restaurants and shops. This Beach is one of the cleanest and a great escape from the worlds troubles. Whether its taking time out of your busy schedule to unwind and watch and listen to the waves break or taking your perfect wedding album photos creating a full cape town feel and picturesque back drop. Bloubergstrand beach is an amazing stop."
        }, 
        {
            "index": 258, 
            "rating": "4", 
            "review": "Worthwhile if you are in the area.. Best white sand beach around. Lovely area to take a walk and enjoy the different cafes and restaurants. Quite bussing on a weekend."
        }, 
        {
            "index": 259, 
            "rating": "5", 
            "review": "Another view of Heaven on Earth !. To view Table Mountain from Bouberstrand or a cruise ship entering Table bay, is one of those breathtaking experiences to lift your soul, that you will never forget! When that advice was givenj by Bernard Shaw on visiting Dobrovnic in 1929, \"If you want to see heaven on earth before you die visit Dobrovnic\" he had not yet visited Cape Town to experience this view that you could never forget.!"
        }, 
        {
            "index": 260, 
            "rating": "4", 
            "review": "Ice cream and the sea. The water is warmer than Clifton and Camps Bay, but the sand is harder. There are lovely ice cream and food stores on the beach front."
        }, 
        {
            "index": 261, 
            "rating": "5", 
            "review": "The best view in the world. There is no view like it anywhere in the world. Cast your eyes on the stunning mountain and surround yourselves with friendly faces. Sit back and watch the kite surfers, paddleskiers and surfers out on the water. There are people kicking a ball or playing volleyball on the beach; or just sitting and enjoying the view of a spectacular Cape Town. Whether it is wet or windy, or clear and hot, you get to enjoy something slightly different every time you visit Bloubergstrand Beach. There are a number of restaurants, bars and take away places to enjoy a wide selection of foods to suit every palate from those with discerning taste buds to those fussy little eaters some of us parents have in tow. Each day you visit will be different."
        }, 
        {
            "index": 262, 
            "rating": "4", 
            "review": "Relax on the beach at Boubergstrand Beach... A lovely beach with white sand and you see Table Mountain and Robben iland. Ideal to sun tan or walk along the beach or a picnick for the family.Their is take away places or restaurants."
        }, 
        {
            "index": 263, 
            "rating": "4", 
            "review": "Amazing view of the mountain. I and two coworkers stayed in a small hotel here in November. We loved walking/running on the beach before going into work for the day. The area seemed safe enough for our runs (2 girls running together; guys on thier own) with one one even giving us a second look. We enjoyed the sound of the ocean, the breeze, and being out of town during the spring evenings."
        }, 
        {
            "index": 264, 
            "rating": "4", 
            "review": "Beautiful view. Be in Capt Town, and not be here it is a sin. Great place, beautiful view, walk for a few hours and lunch, which is a long time to remember. With family or friends, certainly much better than yourself. I would recommend!"
        }, 
        {
            "index": 265, 
            "rating": "5", 
            "review": "A must do visit to Bloubergstrand Beach Cape Town South Africa. Bloubergstrand Beach, for me a real traditional beach, long and wide, although steep in terms of the angle towards the sea which suggests you would be out of your depth pretty quickly. There is a wonderful view from the beach overlooking the bay towards spectacular Cape Town City & Table Mountain. The area attracts the wind at times and is great for the wind surfers with the colouful and their photogenic foils. The beach backs on to a sand dune bank and walkways through to the easy free parking along the coast road and if your lucky you may se a sea lion on a good day."
        }, 
        {
            "index": 266, 
            "rating": "4", 
            "review": "Beautiful Blouberg. A beautiful beach with the most famous view of Table Mountain. The dunes and area around have been rather neglected though."
        }, 
        {
            "index": 267, 
            "rating": "5", 
            "review": "Great Beach. Clean and Tidy. Kite surfing and more ! This beach stretches for miles and miles and looks across to the famous Table Mountain and across to Robbin Island. A day out not to miss when not too windy. Or visit to view the Kite Surfers on a windy day!"
        }, 
        {
            "index": 268, 
            "rating": "3", 
            "review": "My beautiful Cape Town. The view from this beach is awesome on a clear day. It is however very windy out that way. The water is cold and not pleasant for swimming! Good for surfing though! You are also able to view Robin Island from this point."
        }, 
        {
            "index": 269, 
            "rating": "4", 
            "review": "Best views of Table Mountain. We literary live on this beach which has the one of the best views of the mountain. It's great for long, long walks and is very popular for kite surfing, and yes, the waters cold but the view makes up for it! In summer it can get windy, but, hey, it's on the coast! You can escape the wind at Catch22 for some great sushi and a glass on wine or a Jack Black craft beer."
        }, 
        {
            "index": 270, 
            "rating": "5", 
            "review": "Seven wonders view.. The postcard perfect picture from Bloubergstrand. Now one of the seven natural wonders of the world is an amazing sight from the beautiful beaches. Kite surfing, surfing, sUP and so much more is an every day activity. Lovely restaurants to visit."
        }, 
        {
            "index": 271, 
            "rating": "5", 
            "review": "Fantastic Views. If you visit the place just for the views of Table Mountain, its worth it,\nBut its more than just that, it also has beautiful beaches, restaurants, and far more relaxed than Camps Bay,"
        }, 
        {
            "index": 272, 
            "rating": "5", 
            "review": "One of the best views in Cape Town. Absolute bliss, peaceful and quiet with shop sand bars nearby if you feel like a eat or drink!\nDip your toes in the icy waters if you dare and feel the sand between your toesies"
        }, 
        {
            "index": 273, 
            "rating": "5", 
            "review": "cool view. If you can get here, do so, the view of CT and table mountain is superb. Signs everywhere re car safety, so don't leave things on show"
        }, 
        {
            "index": 274, 
            "rating": "5", 
            "review": "Bloueberg Iconic Cape Town. Miles of pure white beach, surf, windsurf, walk your dog, romantic photo, coffee, bird watching and much much more. You can every attempt a swim!!"
        }, 
        {
            "index": 275, 
            "rating": "5", 
            "review": "Great beach. Brilliant beach. Too cold to swim but great to watch people do wind surfing, and beach walks. we loved the side ways available for runners and cyclists. a bunch of great restaurants, we loved moyo"
        }, 
        {
            "index": 276, 
            "rating": "4", 
            "review": "Pretty beach, cold water.. Well this is the beach close to my house so obviously I'm going to think it's the best. There is a probably with wind and litter and I have to admit that the water is freezing cold but it has the best view of Table Mountain. There is a reason why it's called Blouberg (Blue Mountain in Afrikaans) and the locals fondly refer to it as Blowberg (making reference to the wind)."
        }, 
        {
            "index": 277, 
            "rating": "4", 
            "review": "Pretty as a picture.... Just the view of table mountain makes this beach special! It is always forever buzzing with people walking, running, cycling or walking their dogs. It is also one of the most popular kite surfing beaches."
        }, 
        {
            "index": 278, 
            "rating": "3", 
            "review": "iconic view of Table Mountain and Cape Town. This can be a very windy part of Table Bay, but the view is spectacular. In recent decades Bloubergstrand has become much more built up than it used to be."
        }, 
        {
            "index": 279, 
            "rating": "4", 
            "review": "Table Mountain Splendour from afar. Bloubergstrand offers an amazingly different view to Table Mountain than anywhere else on the peninsula. It is stunningly beautiful and the beachfront coffee shops and restaurants are spectacular."
        }, 
        {
            "index": 280, 
            "rating": "5", 
            "review": "It is a very windy beach but the area is a very hip and trendy and the pics from there are magnificent. I will always book my accommodation there even when the area is very windy. The beach is very clean with a lot of local visitors but very safe."
        }, 
        {
            "index": 281, 
            "rating": "4", 
            "review": "Beautiful. Beautiful beach with a stunning view on Table Mountain. Nice to sit here and watch the kite surfers."
        }, 
        {
            "index": 282, 
            "rating": "5", 
            "review": "Table Mountain at it's best. A great beach although the water is freezing. The view of Table Mountain is out of this world. Probably the most viewed area for Table Mountain with the sea below."
        }, 
        {
            "index": 283, 
            "rating": "3", 
            "review": "Emblamatic Cape Town view. Pick your day. Ask a Capetonian when tat day is and enjoy the view and the clear air. Great fun places to eat not far away and if you do hit the wind take your windsurfer or hire one . Picnic on a wind free day take your sunscreen. Not far from the City center."
        }, 
        {
            "index": 284, 
            "rating": "5", 
            "review": "Best view of Table Mountain. One could cycle here from town in the cycle lane, and return with the MyCiti bus.\nThe perfect place for walking on the beach, searching for shells whilst enjoying a soulful conversation. Enjoy pizza and beer afterwards on the lawns at the Blue Peter hotel."
        }, 
        {
            "index": 285, 
            "rating": "4", 
            "review": "Essentially good for kyte surfers in Summer. Constant winds!. Long stretch of beaches going up to Table View. Nice place for long safe walks if you are not a kite surfer.\nIn winter the Atlantic wind can be very cold."
        }, 
        {
            "index": 286, 
            "rating": "5", 
            "review": "Cool sunset drinks spot. Without a doubt one of the most beautiful beaches in the country. The view towards Table Mountain is legendary and if you catch it on a windless day you are bound to have a great time. The pubs and restaurants along the main beachfront are all pretty cool and offer variety. Well worth making time for."
        }, 
        {
            "index": 287, 
            "rating": "4", 
            "review": "Chilled, Great spot to watch the kite surfers. A Kewl little pocket of restaurants/Bars/ ice cream shops to suit every pocket, lots of locals go so you know it's gotta be true. There is an amazing cheap as chips Indian restaurant, a Vipor bare for you bikers, Catch 22. 24 hour pizza so a lively little area for the not so old."
        }, 
        {
            "index": 288, 
            "rating": "5", 
            "review": "Stunning view of Table Mountain. No wonder there are so many postcard pictures of Table Mountain taken from Bloubergstrand - it is a stunning view, especially on a clear day.\nIt is nice to talk a walk on the beach, sometimes a bit busy with the surfers. The wind is also sometimes not too friendly and makes it challenging to walk on the beach."
        }, 
        {
            "index": 289, 
            "rating": "5", 
            "review": "Always lovely and young people around. This is the place for young, active surfers, windsurfing, kitesurfing, dog sledding and the like.\nThe water is COLD but the vibe is lekker!\nIce cream shops, Spur, restaurants and malls... medical centre and on the MyCiti bus line. Go spend the day there and enjoy!!!"
        }, 
        {
            "index": 290, 
            "rating": "4", 
            "review": "Cold water for the soil. Nice to walk next to the beach water very cold but very nice be on the lookout for dog droppings they are allowed on the beach buy an ice cream next to the beach and enjoy the view of Table Mountain it's like food for the soil."
        }, 
        {
            "index": 291, 
            "rating": "5", 
            "review": "Buzzing beach. Clean beach with Table Mountain as the backdrop is a beautiful place to visit and relax. I am not a fan of the cold water but the scenery makes up for not swimming."
        }, 
        {
            "index": 292, 
            "rating": "4", 
            "review": "Windy View. It all depends on what type of Vista's you are in the mood for, this particular day of my visit the wind was howling at my legs with sand burn being inevitable. I did however get a glimpse at the adventurous Capetonians on their Glide/surfing taking full advantage of the wind."
        }, 
        {
            "index": 293, 
            "rating": "5", 
            "review": "Iconic View. This is the beach to visit should you want that iconic view of Table mountain.Beautiful clean beach but be warned the water can get cold.Well worth a visit though."
        }, 
        {
            "index": 294, 
            "rating": "2", 
            "review": "Bloubergstrand Beach. Nice beach and a great view of the kite surfers was fun but be prepared to be sandblasted because of the strong winds."
        }, 
        {
            "index": 295, 
            "rating": "5", 
            "review": "Best views of Table Mountain. Be sure to visit the Eden on Bay area for stunning restaurants who cater for various taste and the best views of Table Mountain!"
        }, 
        {
            "index": 296, 
            "rating": "5", 
            "review": "The best view of table mountain. Wow - this is the best location for a portrait view of table mountain and the city of Cape Town. Excellent seafood restaurants in the location with plenty of other choices as well to suit all budgets."
        }, 
        {
            "index": 297, 
            "rating": "5", 
            "review": "Long golden beach with view of Table Mountain -. Loved the golden sand and crashing of the waves where you walk for miles and forget your cares - stop off at one of the many restaurants for a breakfast, lunch or dinner - a must on your travels. Smell the sea air - feel the wind in your hair and let the sand sooth your feet as you wander along picking up pebbles or little shells - a moment in time where everything stands still ...."
        }, 
        {
            "index": 298, 
            "rating": "4", 
            "review": "Fantastic site!. Bloubergstrand has fantastic views of Cape Town and Table Mountain. It has long white beaches and safe to take a walk there. There are sometimes wind but the view and atmosphere is worth going to view it."
        }, 
        {
            "index": 299, 
            "rating": "4", 
            "review": "beautiful. Very beautiful place. Its a long walk pathway along the beach staring from dolphin beach to Bloubergstrand Beach"
        }, 
        {
            "index": 300, 
            "rating": "5", 
            "review": "Lovely tranquil area. Exquisite view and beautfull beach. Lovely hotels and restaurants in the area with a beautiful view of table mountain"
        }, 
        {
            "index": 301, 
            "rating": "5", 
            "review": "Blouberg. This whole beach area is beautiful, regardless of the weather. There are many restaurants for those who are not all that interested in the scenery. Surfing, body boarding, walks etc. Areas for children to play in the water safely, skateboard ..."
        }, 
        {
            "index": 302, 
            "rating": "4", 
            "review": "Great view. Fantastic view of Table Mount, Lion's Head, and Devil's Peak. Nice clean beach, water too was cold to swim but a great place to relax and take in the scenery."
        }, 
        {
            "index": 303, 
            "rating": "4", 
            "review": "View of all views.. What a stunning view you get of the Table Mountain from Bloubergstrand. They have a stunning beach with lots of restaurants to go to. Lots of shops to go to if you not a sun seeker. On weekends you will find the beach full of wind surfers."
        }, 
        {
            "index": 304, 
            "rating": "5", 
            "review": "Get that picture perfect picture of the mountain. You can just relax on the powder white sands of the famous site of a battle between the Dutch and English many moons ago for the Cape, stroll along the beach or take that picture everyone takes of the mountain, city and ocean. To the right is the famous Robben Island."
        }, 
        {
            "index": 305, 
            "rating": "5", 
            "review": "Beautiful stroll along the beach!. What a lovely beach to stroll along. Some landmarks and fun places along the way. Ice cold water, but table mountain beauty. Loved the day at Blouberg!"
        }, 
        {
            "index": 306, 
            "rating": "5", 
            "review": "A real master piece. The stretch of coast is awesome. The place is abuzz with people yet you will find a place for relaxation and to sun tan.\nOne of the best sections of the coat line in Cape Town."
        }, 
        {
            "index": 307, 
            "rating": "4", 
            "review": "Mornings are the Best!. Bloubergstrand beach is best appreciated in the morning when one can take in the beauty while it's peaceful and calm. It must however be said that any day is a good day for the beach. It's good for the entire family with amazing views of what the Mother City has to offer. If you love mingling, there's a great mix of people (and dogs)"
        }, 
        {
            "index": 308, 
            "rating": "4", 
            "review": "Where classical pictures cannot be avoided. Just north of the Cape Town CBD lies this beach, on the edge of revitalized residential zones and Cape Town Bay. There are facilities for the beach visitors, sufficient bu not spectacularly good. From here, many classical pictures of Cape Town, Table Mountain, Lion's Head and Signal Hill are taken. You must be something of a photographic analphabete not to succeed in making the shot of your dreams. The bay water is very cold, as it is around all of the Cape Town west coast. Occasional sharks may also be spotted. This, after all, is the bay that prevented all but one prisoners from Robben Island to escape and reach freedom shore again ..."
        }, 
        {
            "index": 309, 
            "rating": "5", 
            "review": "Beautiful. Very beautiful beach.. Lots of entertainment around the beach area, restuarants, pubs, clubs, a park and petrol station with Bonjour, and milkylane!"
        }, 
        {
            "index": 310, 
            "rating": "5", 
            "review": "Beautiful. Bloubergstrand has one of the most beautiful views of Table Mountain. Just be prepared - it will always be windy and the ocean will always be very cold! Great ice cream and pizza close by.Kids and dog friendly!"
        }, 
        {
            "index": 311, 
            "rating": "4", 
            "review": "Interesting!. Lovely beach, beautiful views. Lots of people milling around and activities. We were there on a photographic tour and enjoyed the scenery."
        }, 
        {
            "index": 312, 
            "rating": "3", 
            "review": "Long beach with nice sand. Just a long street along the Bloubergstrand Beach, not very romantic. Very crowded on a sunday afternoon by locals."
        }, 
        {
            "index": 313, 
            "rating": "4", 
            "review": "The Island. Take a walk across to the Island when its low tide, but make sure to get back across before hide tide comes in."
        }, 
        {
            "index": 314, 
            "rating": "5", 
            "review": "Icy, Central, Happening. Bloubergstrand is stunning for kite flying, windsurfing, surfing, paddleski'ing and running your Huskies. The people are friendly, easy to chat to and there's always something happening. There are a large variety of Restaurants in the area and just around the corner you have the ever popular Blue Peter and Ons Huisie - well worth a visit.It's close to town, on the MyCiti bus route and really great as an outing for the family and also to go walking down to Milnerton lighthouse.Squeeky Clean sand, sometimes you see wales, dolphins and seals. Look, the water is really cold - but if you're on that side of town then it's to be expected. Lekker Local spot. Close to town. Casual attire, slip slops and shorts and ice cream places. Oh yeah!"
        }, 
        {
            "index": 315, 
            "rating": "5", 
            "review": "Beautiful place. Love the eatery around. All pubs and restaurants.. Love the senset. Its the best place to be around if you are a food lovers..Every place around are the best."
        }, 
        {
            "index": 316, 
            "rating": "5", 
            "review": "\"The must see view\". This is a must see view of Table Mountain. Also the beautiful view of Robin Island and the beautiful people and beaches."
        }, 
        {
            "index": 317, 
            "rating": "4", 
            "review": "A great view of the bay. A nice beach tow walk on- a long strip with a geat view of Cape Town city, the bay and the the mountain. It also allows dogs so quite a good space for dog lovers."
        }, 
        {
            "index": 318, 
            "rating": "5", 
            "review": "Great view of Table mountain. Coffee in the on the rocks retuarant on the beachfront, excellent service and friendly staff and a view to die for"
        }, 
        {
            "index": 319, 
            "rating": "5", 
            "review": "Beauty of Blouberg.. Blouberg is amazing, the view, the sunset, the romantic atmosphere attached to this beach is astounding. Sunset on Blouberg is a must see when visiting South Africa, and it is something for all to add to their \"to do list\". Blouberg is a family friendly destination, with lots to do, lots to see, and restaurants in the close proximity"
        }, 
        {
            "index": 320, 
            "rating": "4", 
            "review": "Undisturbed Table Mountain views . If you're a swimmer this beach is not one to write home about. The water is freezing and it tends to get quite windy.However it is ideal for kite - surfers.The best thing about the beach is the view. This is about the best place in Cape Town to get beautiful shots and views of the Table Mountain range.You can also see Robben Island in the distance.Also the sunsets are absolutely amazing. This is a beach with plenty of perks"
        }, 
        {
            "index": 321, 
            "rating": "5", 
            "review": "best sunset spot. if you like to see table mountain and to get a perfect sunset spot this is the place. also the beach it self is really nice. so if you are a romantic soul this would be the place."
        }, 
        {
            "index": 322, 
            "rating": "4", 
            "review": "hidden secrets of Blouberg. In autumn the wind dies down and you get some great beach days with far less crowds.\nIn summer, the sun is up very early in the morning and late the evening. Do go for these times too. The sunrise in summer is great at 04h30, and the sunset at around 20h00."
        }, 
        {
            "index": 323, 
            "rating": "5", 
            "review": "Great views. Windy on the beach, water is freezing but worth a visit as it has great views of table mountain and lions head. Nice long sandy beach for a walk set in a good residential area. Stayed in the area lots of time and always felt safe to wander around."
        }, 
        {
            "index": 324, 
            "rating": "5", 
            "review": "Lazy days and sunset beach. This beach looks directly onto Table Mountain and is beautiful. You can swim but the water is cold. On Sundays the nearby Hotel opens up it's gardens and serves great light lunches. At low tide you can walk out to the rock. A great place to take a wheelchair the car park is tar right up to the beach and presents great views"
        }, 
        {
            "index": 325, 
            "rating": "4", 
            "review": "Fun. Great to see all the kite surfers in action, kids playing on the beach. Hold on to your hat...it can be very windy here. Place worth a visit."
        }, 
        {
            "index": 326, 
            "rating": "5", 
            "review": "Magical sunsets. Not anywhere else in Cape Town will you experience a sunset like at Bloubergstrand Beach. Soft white sand and gentle current makes for a pleasant surf walk. Watch the sun go down and the new 7th Wonder of the world, Table Mountain is lit up."
        }, 
        {
            "index": 327, 
            "rating": "5", 
            "review": "Endless beaches and beautiful sunsets . This is one of the most magnificent views of table mountain ever. The beach is really long and very clean with fantastic jogging paths on the side! The ideal beach to practise yoga on as the sun is setting or to indulge in a gorgeous Cape wine."
        }, 
        {
            "index": 328, 
            "rating": "3", 
            "review": "Nice Beach and Great Views of Table Mountain. We stopped here on the way up to the West Coast - the beaches seem very clean and we had fun watching the kite surfers. But our main reason for stopping was to get some great pictures of Table Mountain!"
        }, 
        {
            "index": 329, 
            "rating": "4", 
            "review": "Gorgeous. Gorgeous beach with a lovely mountain in the background. It is well maintained and clean. Good photo oppertunity of the mountain."
        }, 
        {
            "index": 330, 
            "rating": "5", 
            "review": "what an expanse of sand and water!. Such a large beach with Table Mountain in the background and very few kite surfers on a week-day. One gets the feeling of an endless stretch of white sand with little sea-weeds....and much invigorating wind."
        }, 
        {
            "index": 331, 
            "rating": "5", 
            "review": "Worth the 30 min drive. Stunning views, super clean sand and water, and enormous empty beach to relax on, safe area, whats not to like?!"
        }, 
        {
            "index": 332, 
            "rating": "5", 
            "review": "Favourite destination. Discovered Bloubergstrand in 1972, loved the place then and still love visiting it.\nLovely ocean, beaches, rocks, views and sunsets.\nGood variety of restaurants in area to suit every taste.\nNot commercialised in any way, definitely my favourite destination in the world"
        }, 
        {
            "index": 333, 
            "rating": "4", 
            "review": "Whitest sand ever. The beach is long and beautiful with a great view of Table Mountain.\nIt is a bit of a drive from Cape Town central but worth doing just to experience.\nThe sand was blindingly white which is amazing."
        }, 
        {
            "index": 334, 
            "rating": "5", 
            "review": "Best views of Table Mountain. It takes about 30 minutes with good traffic to drive to Bloubergstrand beach from the V&A Waterfront but it is worth the trip for the amazing views of Table Mountain, Lions Head and Downtown Cape Town. The day we visited the beach it was very windy and there were hundreds of kite surfers out in the ocean. The view was even more beautiful with hundreds of brightly colored kites soaring in the air. It was so entertaining watching many of the surfers. Some of them would catch a wave and the wind at the same time and they would become airborne and soar over the waves for several seconds. It was a great way to spend an afternoon in Cape Town."
        }, 
        {
            "index": 335, 
            "rating": "4", 
            "review": "Exceptional. Bloubergstrand Beach offers the best of both worlds. It has table mountain on the horizon and great sandy shores. It is clean, well kept and very attractive. You will be able to grab lunch or dinner just across the road since it has easy access to restaurants."
        }, 
        {
            "index": 336, 
            "rating": "4", 
            "review": "Tonie's review. Well it was very nice visiting the beach at Bloubergstrand. Me and my wife parked our car close to the beach only to be chased by a policeman"
        }, 
        {
            "index": 337, 
            "rating": "5", 
            "review": "Beach with a view. Bloubergstrand Beach has exceptional views of the mountain and Robben Island. It is clean and very attractive with easy access to restuarants and places to have a meal or a sundowner - or even brunch. Love it!"
        }, 
        {
            "index": 338, 
            "rating": "5", 
            "review": "Best views of Table Mountain. What a great place to sit and watch the world go by.. Great restaurants on the beach front where you can sip CHEAP cocktails or beers and watch the surfers with the most amazing backdrop."
        }, 
        {
            "index": 339, 
            "rating": "5", 
            "review": "Great if you don't want to sunbathe. This is one of the prime spots for kite surfing in Cape Town but it also has one of the best views on Table Mountain. The entire area is subject to high winds in the evening but this has never been a problem for us as most of the restaurants are only a short walk away. We love the area as it has a small town feel to it."
        }, 
        {
            "index": 340, 
            "rating": "5", 
            "review": "A windy and wonderful beach with a view of Table Mountain to die for. If you like bracing air, and long sandy beaches, Bloubergstrand is for you.Go for wind-surfing, kite-surfing, kayaking, surfing and all types of water sports. The wind can pick up suddenly, so one has to watch this, if engaging in activity sports.A good place for playing with kids, so long as you watch them near the water."
        }, 
        {
            "index": 341, 
            "rating": "5", 
            "review": "Best view of Table Mountain. A drive out to Bloubergstrand is worthwhile for the amazing view of Table Mountain from where many of the photos are taken. Often there are many people with colourful kites on the beach which makes for a great picture. Not as pretty as the beaches of Clifton or Camps Bay just long with very fine sand and plenty of room. Lots of apartments overlooking the beach and restaurants here and there."
        }, 
        {
            "index": 342, 
            "rating": "5", 
            "review": "The ultimate Kodak shot. The totally ultimate place for a romantic photo. Take someone special, take a pic at sunrise or sunset or noon. You will find this is best pic in your album. If you go late afternoon, fantastic number of kite boarders too"
        }, 
        {
            "index": 343, 
            "rating": "5", 
            "review": "Superb Beach!. Looking for a different view of Table Mountain?...well this long white unspoilt beach offers just that. There is a very safe feel about it and there is a great selection of places to eat at. Its a great place to relax, but it can get very windy!"
        }, 
        {
            "index": 344, 
            "rating": "5", 
            "review": "Absolute heaven!. One of the best beaches I have ever been too. Incredible views with quaint micro hotels and lovely restaurants. The people were so kind."
        }, 
        {
            "index": 345, 
            "rating": "5", 
            "review": "Go and watch the kite surfers! Great action and pix!. Highly recommended.Go to relax, sit on the beach, watch the kite surfers, swim, or kite surf yourself. Great views of Cape Town and Table Mountain in the background. Bring your camera!A number of good restaurants are in the area along the road across the street from the beach.Check it out!"
        }, 
        {
            "index": 346, 
            "rating": "5", 
            "review": "No. 1. of all the beaches around Cape Town that I visited, this one is definitely my No. 1 favourite. It's also easy to be reached via public transport"
        }, 
        {
            "index": 347, 
            "rating": "5", 
            "review": "Nice place.. Enjoy the sunset at this place...good people, nice vue. You Can have a drink or dinner looking the sun falling down..."
        }, 
        {
            "index": 348, 
            "rating": "5", 
            "review": "Love this beach. We often go to the blue peter for sundowners and watch the sun disappear we love this beach and it is the best beach to take photographs of table mountain when it is a clear day. Lots to do here including surfing windsurfing as there is often a good wind we often used to go here just for the day with family and friend we used to be able to break on the beach but unfortunately you are no longer able to do this but it is still fun beach and big enough to find a space to sit in peace if you just want to read..."
        }, 
        {
            "index": 349, 
            "rating": "4", 
            "review": "A unique experience. We went to Bloubergstrand beach to get the view of Table mountain, unfortunately it was very misty but we were treated to the sight of 10 beautiful race horses being given a swim and then a roll in the sand. The wild sea the fog and the horses gave us an amazing photo op!"
        }, 
        {
            "index": 350, 
            "rating": "5", 
            "review": "Postcard view of Table Mountain. This is my stomping ground so I'lol going to have to try to summarize coz there's soooo much to say. To get there turn off of the R27 at the Dolfin Beach Hotel and drive to the information centre carpark. Most days there are hundreds of kite surfers - there is Kite Surfing lessons and kit hire across the road. anywhere along Blouberg beach is THE best angle to photograph Table Mountain. There are restaurants across the road if you need to eat but I suggest you drive further(about another 2km - it's signposted) to Eden on the Bay at Blouberg's Big Bay. At Eden there is one of those Yellow frames with the gps coordinates through which you can take a shot of the mountain. Big Bay has surf board and wetsuit rentals if that is your thing - the waves can get big but there are plenty of days for a novice to try their hand at surfing. All along the road to Eden and at Eden itself are eateries of varying descriptions - all the food is yummy so there's no one that stands out for me. The beaches are clean, ablutions are dotted all along the Blouberg coast - some of them are locked because they were being used as sleeping quarters for vagrants and hangouts for druggies (urghhh) but the ones at the main beaches are kept open and safe. The best swimming beaches are Small Bay, the Beach opposite The Blue Peter and the beach at Big Bay - the lifesavers clubhouse is at Big Bay. Swimming elsewhere could be dangerous unless you are a very good swimmer because of strong currents. When you park your car don't leave anything valuable visible in the car - that will just invite an opportunistic thief to break into your car. There are usually mounted and motorized police patrolling the entire beachfront to keep the area safe."
        }, 
        {
            "index": 351, 
            "rating": "5", 
            "review": "Rolling views. The beach and the views are just awesome,the beaches are clean , and you can take your umbrella ,chairs and just sit in the sun, there are also various sports, cycling rollerblade, walking , and of course eating"
        }, 
        {
            "index": 352, 
            "rating": "4", 
            "review": "A day at Bloubergstrand Beach. The scenery and many restaurants to choose from. If people watching is your thing this is the place to be."
        }, 
        {
            "index": 353, 
            "rating": "4", 
            "review": "Beutifull views. Despite the cold water it is a very nice place to view Table Mountain and table bay and the perfect place to enjoy a sun downer."
        }, 
        {
            "index": 354, 
            "rating": "5", 
            "review": "Best views of Table Mountain and sandy shores. If you are looking for the picture postcard photo of Table Mountain then this is your beach!\nClean beaches which run for miles from Blouberg with different points of interest along the way.\nAdacent to Bloubergstrand there are plenty of restaurants and bars as well as ice cream shops to sit and oogle at the view."
        }, 
        {
            "index": 355, 
            "rating": "5", 
            "review": "Best Views of the Mountain. If you want to get the best views / pictures of Table Mountian this is the place to go. The beach is situated across the sea from Table Mountain and on a clear day the view is simple stunning. I have taken many memorable photos from here and everyone who sees them agrees they are beautiful. The beach is quiet and does not have many shops / places to eat, unless you walk further away from table mountain."
        }, 
        {
            "index": 356, 
            "rating": "3", 
            "review": "Amazing view, but not much else. You can take a trip to Blousbergstrand, but it's not usually for the beach. There are heaps of great restaurants in the area and most of them offer amazing happy hours and stunning views of Table Mountain. When the wind isn't very strong, it's also very nice to run along the beach, or even walk your dog."
        }, 
        {
            "index": 357, 
            "rating": "4", 
            "review": "Wonderful views. Great beach in a rather ordinary area, popular for surfing, and kite surfing, which we found fascinating to watch. Just a short but pleasant drive out of town, but the views are to die for."
        }, 
        {
            "index": 358, 
            "rating": "5", 
            "review": "Probably the best view in the world.. Table View and Bloubergstrand have lovely white fine beaches, the sea is a lovely shade of blues used extensively by kite surfers. The view of Table Mountain and Cape Town is superb from here second to none in the world.Don't miss it if you visit Cape Town."
        }, 
        {
            "index": 359, 
            "rating": "3", 
            "review": "Overrated. Yes it's a nice beach but I really don't understand the hype around it. The view is nice, you can take your official Cape Town picture here but that's pretty much it. Restaurants are overpriced at the beach and when I walked around in the sand I had to dodge so much trash that it really wasn't fun anymore."
        }, 
        {
            "index": 360, 
            "rating": "4", 
            "review": "Excellent kite surf venue. Just happened to be there while about a hundred people trained with their kites for an ongoing competition ending on February 14"
        }, 
        {
            "index": 361, 
            "rating": "5", 
            "review": "What a windy beach. The view outstanding - the kite surfers in their hundreds ! Wow\nGreat place to visit - nice Restaurants everywhere"
        }, 
        {
            "index": 362, 
            "rating": "3", 
            "review": "Long beaches and beautiful view to CPT. Beautiful long and white beaches and a spectacular view to Cape Town and Table Mountain. When I was there the beaches were empty most of the time. A pity is, that the ocean is always so cold, that you barely can go to the water to swim (at least not me lol). The drive to Blouberg Strand takes about 30 minutes from the center of Cape Town, easly reachable by Uber taxi or Mycity bus."
        }, 
        {
            "index": 363, 
            "rating": "4", 
            "review": "great day on the beach. great if you like (or like to watch) kite surfing. The sea is cold not too good for swimming. avery chilled atmosphere"
        }, 
        {
            "index": 364, 
            "rating": "5", 
            "review": "Best views of Table Mountain. By far the best place to get a good view of Table Mountain, particularly at sunset. A short and easy drive along the coast from Cape Town"
        }, 
        {
            "index": 365, 
            "rating": "4", 
            "review": "Beautiful Beach!. Very windy beach (great for kite surfers). We didn't stay long the day we were there as the sand was kicking up...and the water is cold! Great area with nice restaurants across the road."
        }, 
        {
            "index": 366, 
            "rating": "4", 
            "review": "Beautiful beach. Clean beach, except for the weekends not busy at all. Great view on Robben Island and Table Mountain. Lots of restaurants nearby."
        }, 
        {
            "index": 367, 
            "rating": "5", 
            "review": "THE place for your holiday snaps. You have all seen the pictures from Bloubergstrand of Cape Town and Table Mountain. This is the spot for the keen photographer.The beach itself is absolutely beautiful. It stretches for miles with soft fine white sand. The day we were there it was quite windy, so not a day for sunbathing, a great day for wind surfing. I counted over 30 windsurfers along the beach at the one time. Beats people watching at the waterfront."
        }, 
        {
            "index": 368, 
            "rating": "4", 
            "review": "great photos. It is a brilliant place to go and take photos with Table montai in the backdrop. The area though is a bit downmarket, in spite of lots of newbuilds so not many nice cafes/restaurants to stop by. I would go just for photos. Also the beach is not very clean."
        }, 
        {
            "index": 369, 
            "rating": "5", 
            "review": "A beach with a view. Lovely place with great views of Cape Town and Table Mountain. Had a few drinks in the sunshine at the Blue Peter which was a nice change from a grey Manchester Airport."
        }, 
        {
            "index": 370, 
            "rating": "5", 
            "review": "What views!. I was fortunate to stay just a few minutes' walk from the Strand and Beach, so walked along there most days, both by day and at sunset. The Strand is a wide walkway, used by joggers, walkers, cyclists, dog walkers, indeed everybody - young and old. The beach is easily reached by means of gaps in the fencing and wooden slatted pathways, and the sand is soft and warm - ideal just to sit and look out to Table Mountain to the left and Robben Island to the right. It's quite breezy along there, which makes it ideal for kite surfing and surfboarding, both great to watch. There's a kite surfing school just up the way. By day it's lovely - felt very safe - and at sunset it's just superb. There are plenty of eating and drinking places just across the main road. I yearn to return."
        }, 
        {
            "index": 371, 
            "rating": "5", 
            "review": "Yes Yes Yes!. We stayed in Bloubergstrand and it was around 20 minute drive into the center. It was very peaceful but still close enough to do everything!! Sea was very cold!!"
        }, 
        {
            "index": 372, 
            "rating": "4", 
            "review": "Beach Beach n More Beaches !!. it is amazing all the different beaches in Cape Town have something or the other to tell, icy waters do not stop holiday makers from getting into the water"
        }, 
        {
            "index": 373, 
            "rating": "5", 
            "review": "Beautiful beach for surfing; great views of Table Mtn!. Well worth the short drive out here just for the beautiful views of Cape Town and Table Mountain. Felt less crowded than some of the other beaches, like Camps Bay. Great for surfing and walking as well."
        }, 
        {
            "index": 374, 
            "rating": "4", 
            "review": "Gentle walk on the beach. The beach walk is a must for all visitors to Cape Town. The views across the bay of Table mountain is a photo opportunity every few seconds.\nFor the more active there is Wind surfing and some days the wind is howling so pick your day well."
        }, 
        {
            "index": 375, 
            "rating": "3", 
            "review": "The Place to View Table Mountain from a Distance. Blouberg has a great beach with lots of restaurants along the beach which allow you to look at the view of table mountain from afar. Its absolutely, awesome, and there are also kite surfers to watch all day.Its a great place to relax and get a feel of Cape Town, watch runners come past and have a chill. Its bit out of the way though and not the best neighbor hood and does not have the dramatic scenery of Clifton or Houtbay."
        }, 
        {
            "index": 376, 
            "rating": "4", 
            "review": "Beauitful beach. Just outside Cape Town, lovely clear white sand. Ideal for walks or swiming. As the name suggests it can be very wild and uncomfortable on a windy day as the sand can blow right onto the road."
        }, 
        {
            "index": 377, 
            "rating": "5", 
            "review": "Kite paradise. Best place fore kiting, great beach nice people and good food. I visit this place 4 timers a year but the Dec-Feb period is the best.."
        }, 
        {
            "index": 378, 
            "rating": "4", 
            "review": "Great walking spot/ kite surfing. We are not kite surfers but it was incredible walking the beach watching the kite surfers. Restaurants nearby leave a lot to be desired, but the beach is a relaxed and never busy."
        }, 
        {
            "index": 379, 
            "rating": "5", 
            "review": "Serious view, serious wind.... If you've ever seen a panoramic photo of Table Mountain then the chances are that it was taken from Blouberg beach.You'll want to come here just to soak up the view and it's an easy enough place to get to.You won't want to swim in the sea as the waves and surf are quite fresh and the wind can make a beach visit a short affair. There are many better beaches in Cape Town for a picnic.It gets an \"Excellent\" 5 points because you can't come to Cape Town without going up the Mountain and there's no better view of the mountain than from Blouberg.We always enjoy an ice cream when we visit...especially when we're tormenting our European friends in December when they're up to their knees in freezing snow."
        }, 
        {
            "index": 380, 
            "rating": "4", 
            "review": "Best View. It's a place of great awesome, to see the city from across the waters. The beach has been well maintained by the local municipality indeed. On a summer's evening, there is nothing more relaxing and greater than to go here and stroll on the beach. Walking along the shore and absorbing all the beauty. It is also the perfect location to catch a few semi-good waves but mostly for kite surfers though.Or catching a good tan in peace and quiet. Dog friendly as well, so you can bring your pooch along to enjoy the waves with you! Parking isn't much of a problem, you'll just have to find one along the beach stretch. The ones closest to the local shops like Steers, Primi, Pakalolo, etc are always the first to go. Havent seen lifegaurds on duty, so swimming is not recommended - in any case the water temperatures are really freezing out here."
        }, 
        {
            "index": 381, 
            "rating": "5", 
            "review": "Best view. For that one iconic photo of Table Mountain, Bloubergstrand is the place to go! It also happens to be a beautiful, clean and very nice beach, even if sometimes very windy. Lots of great restaurants etc, nearby."
        }, 
        {
            "index": 382, 
            "rating": "5", 
            "review": "paradise. absolute stunning beach with view towards table mountain, loads of surf kiting going on but very choppy sea."
        }, 
        {
            "index": 383, 
            "rating": "5", 
            "review": "Love this beach.. relaxed and welcoming, love this beach, whether to swim, sunbath or just take the dog for day, its a great beach to visit."
        }, 
        {
            "index": 384, 
            "rating": "5", 
            "review": "Kitesurfing madness. Blouberg strand is quite an unique experience , this is the kitesurfing central in Cape Town one of your top ten travel destinations in the world."
        }, 
        {
            "index": 385, 
            "rating": "4", 
            "review": "A great vibe. It's a lovely place to chill with either the family or as a couple. The beach is clean and further a long at Big Bay there are a lot of trendy restaurants to get a good meal."
        }, 
        {
            "index": 386, 
            "rating": "5", 
            "review": "What a view !!. Blouberg beach is fantastic, the view over Cape Town city and the table mountain is stunning. The beach is a long stretch of white sand, not too busy, perfect for a picnic or to relax. Could be very windy though !! Plenty of surfers and coffee / bar to relax behind the beach. A must to see !!"
        }, 
        {
            "index": 387, 
            "rating": "4", 
            "review": "Trendy. Quite cosmopolitan very trendy beach resort mainly for younger people kite surfing in abundance and plenty drinking and restaurant bars"
        }, 
        {
            "index": 388, 
            "rating": "3", 
            "review": "perfect view of table mountain. perfect view of table mountain from here.\nnot the best of beach atmosphere though, with lots of pubs, restaurants, ice cream parlous etc."
        }, 
        {
            "index": 389, 
            "rating": "4", 
            "review": "The view of the mountain. The best view of the iconic Table Mountain and also Robin Island. Beautiful beach, good restaurants - a nice place to relax"
        }, 
        {
            "index": 390, 
            "rating": "5", 
            "review": "Best View in the World. You have got from here a picture postcard view of Cape Town with Tablemountain. The beach is clean, but the water cold. With the rigth wind you can see many Kite Surfers. Many restaurants in the surroundings round the day of."
        }, 
        {
            "index": 391, 
            "rating": "4", 
            "review": "Lovely for long walks. This is a great beach to spend the day on. You can go for long walks followed by a lovely (yet cold) swim and then have lunch at a restaurant closeby."
        }, 
        {
            "index": 392, 
            "rating": "5", 
            "review": "Fantastic Beach House. We lived at the beach, two houses next to the Blue Peter Restaurant. It was the best place. Perfect location and if you have seen your first sun downer...you know why."
        }, 
        {
            "index": 393, 
            "rating": "5", 
            "review": "Perfect Location. Beautiful Beaches, Small Shopping Mall, Amazing selection of Restaurants. The View is absolutely amazing. Definitely a perfect spot for Active People. There's a lot of Ocean and Beach Activities. Very well situated, and perfect to explore the rest of Cape Town.We stayed in Beach Front Apartments, and we could easily access the beach, mall and restaurant. The bus stop is adjacent to the Mall."
        }, 
        {
            "index": 394, 
            "rating": "4", 
            "review": "Nice beaches. About 1/2 hour from Central Cape. Beaches are clean with white sands. Downside is the the cold water of the Atlantic Ocean"
        }, 
        {
            "index": 395, 
            "rating": "5", 
            "review": "Beautiful. It was a short visit to this place. Amazing beach side and beautiful scenery around. Me and my kids enjoyed a lot especially the water is very clean and clear so you can have a nice swim. But be careful don't go deep and don't let your kids go. Its amazing place so enjoy your trip. Definitely recommended."
        }, 
        {
            "index": 396, 
            "rating": "5", 
            "review": "Views to die for. With golden beaches and awesome views of Table Mountain this beach must be one of the most beautiful in the world. Would like to own a house there!"
        }, 
        {
            "index": 397, 
            "rating": "4", 
            "review": "Great beach. Great views. Great beach for water sport (surfing, kite surfing etc,) Great beach for cycling and jogging. Gets windy in the afternoon."
        }, 
        {
            "index": 398, 
            "rating": "5", 
            "review": "Out of the way, but fab views. We normally head here for a walk down the beach & savour the views of table mountain.Park at Eden at Big Bay (big pick n pay supermarket car park) then head left down the beach to the news cafe about 3km away; watch the kite surfers, enjoy the turquoise sea & the white sand sparsely populated by the locals, watch the shipping containers with a back drop of table mountain.We really love it."
        }, 
        {
            "index": 399, 
            "rating": "5", 
            "review": "Best mountain views in Cape Town!. A photographer and kite surfers dream! We live in Bloubergstrand and it is just gorgeous! It can get quite windy, especially in summer, so be aware of that, but beach walks at sunset is just magic!"
        }, 
        {
            "index": 400, 
            "rating": "3", 
            "review": "Beach & Restaurants. Beach and the food. No need to book ahead,within period -Beach and food. No need to book, just walk in, waiting period 30 to 45 minutes, worthwhile wait"
        }, 
        {
            "index": 401, 
            "rating": "3", 
            "review": "Beautiful view. This is the beach where you get the perfect view of Cape Town. The only negative thing is that you can have a very windy day on the beach, because it is so open. Also you find the Blue Peter hotel opposite, which makes it a good choice for a drink or something to bite."
        }, 
        {
            "index": 402, 
            "rating": "5", 
            "review": "Great views of Table Mountain. We stopped here for lunch en route from Cape Town international airport to Paternoster. We chose it just for the view across the bay to Table Mountain. We weren't disappointed, it really is awe inspiring & to boot we enjoyed a great lunch at Petit Fours."
        }, 
        {
            "index": 403, 
            "rating": "5", 
            "review": "Great for a post card photo. This is the best spot to take a photo of Cape Town with the sea in front and Table Mountain as a back drop. The best thing to do is cycle from the city on the cycle paths to Bloubergstrand and have something to eat or drink at On The Rocks and cycle back. If you are tired, you can take the MiCiti bus back with your bike."
        }, 
        {
            "index": 404, 
            "rating": "5", 
            "review": "Best view in Cape Town. A variety of restaurants to choose from. Shopping malls with variety of shops. Beautiful view of Table Mountain.Can be a bit windy."
        }, 
        {
            "index": 405, 
            "rating": "5", 
            "review": "Best view in the world. You'll never forget this view of Table Mountain, with or without its tablecloth. Plenty of eating and drinking opportunities. Watch the surfers, kite surfers, paddle boarders, in fact if it's a new sea sport it'll be tested here."
        }, 
        {
            "index": 406, 
            "rating": "5", 
            "review": "Best beach spot. The beach is never over crowded and there are lots of outdoor activities like kite surfing. Or you can just sit on the beach and enjoy an ice-cream while taking in the sights. There are several restaurants that you can you sit back and enjoy a few drinks, pizza or sunset cocktails."
        }, 
        {
            "index": 407, 
            "rating": "5", 
            "review": "Nice beach to go have a walk on. The view of Cape Town and Table Mountain from Blouberg beach is awesome. Nice beach to go have a sunset walk on, or just to go play with your dog. Temperature of water is icy cold so would not recommend planning a day at the beach there unless it is really hot in Cape Town."
        }, 
        {
            "index": 408, 
            "rating": "5", 
            "review": "The best spot to see Table Mountain. Go here for excellent photo's especially for Sunset. If you drive a bit further you have a special sunset viewing area car park. Got some wonderful shots here."
        }, 
        {
            "index": 409, 
            "rating": "5", 
            "review": "Stunning. Well worth a trip here - whether it be for Sundowners or just a walk along the beach.It can get windy."
        }, 
        {
            "index": 410, 
            "rating": "5", 
            "review": "Table Mountain View. The best view of Table Mountain is from the Bloubergstrand Beaches. The Beaches are very clean and sufficient play areas for the smaller children. No Braai / Barbeque facilities available but i think without that facilities there the beach will stay clean and safe."
        }, 
        {
            "index": 411, 
            "rating": "5", 
            "review": "Awesome Views. Easily reached via Myciti bus, either from the waterfront or Civic Centre take the T01 to Table View where you will be directed to take the next bus to Big Bay. On the Front are an array of good restaurants, a large beach with kite surfers galore and a large yellow framework where you can take a photo with Table Mountain as a back drop. Allow plenty of time say a least half a day if you can spare it."
        }, 
        {
            "index": 412, 
            "rating": "5", 
            "review": "so versatile and still unspoilt. We often used to visit Blouberg beach front when we lived in the Northern Suburbs. The eventuality was we came to live here 12 yrs ago, The walks on the Beach front are fantastic. The surrounding areas are beautiful. The cafes and restaurants are varied and boast some of the most magnificent views in South Africa. Excellent coffee shops and great coffee...Carluccis, Eden Cafe and Izabellas have super coffee... There is still an unspoilt feeling surrounding the Beach front area from the initial beach front right through to Big Bay.. All types of waterss ports are available including a great following with the Kite surfing community. We urge you to visit and experience this fabulous venue."
        }, 
        {
            "index": 413, 
            "rating": "5", 
            "review": "windy but worth a visit. kite surfers paradise! this beach has a blue flag status and it is a must visit if you love to kite surf or if you like to watch the energetic bunch surfing! a spectacular setting with Table Mountain in the back."
        }, 
        {
            "index": 414, 
            "rating": "3", 
            "review": "Great walk & view, waters a smidge cold. Lovely place to walk & play on a sunny day. Water is a bit cold for swimming though. (But the surfers seemed to enjoy it)"
        }, 
        {
            "index": 415, 
            "rating": "5", 
            "review": "Beautiful Blouberg!. We live here and have this sight on a daily basis, there is no other place quite like it. That mountain and the sea are such a source of pleasure and the scenery is absolutely fbeautiful and best of all - free. On a beautiful sunny day its as if we are living in paradise. The weather is ever changing here so no 2 days are the same, what fun!"
        }, 
        {
            "index": 416, 
            "rating": "5", 
            "review": "Iconic early morning views. We went to this beach to photograph Table Mountain at sunrise. The view is iconic and has inspired artists and photographers alike. The morning we went did not disappoint. The views and photos we took were wonderful."
        }, 
        {
            "index": 417, 
            "rating": "4", 
            "review": "lived in this area. We actually lived for 5 years in Blouberg when we relocated to Cape Town. This area is something else as you do not feel that you are in the Western Cape. It is clean, beautiful beach although the water is cold. Lovely places to visit. Not crowded. They calls this area the playground of the rich and famous. Love it"
        }, 
        {
            "index": 418, 
            "rating": "4", 
            "review": "Lovely big beach. Beautiful beach with amazing views of Table Mountain and very picturesque at sunset. Nice restaurants nearby too"
        }, 
        {
            "index": 419, 
            "rating": "5", 
            "review": "For the iconic view of Table Mountain, this is where you go. I love visiting the restaurants on the waters edge. Some days the view of our beloved mountain is spectacular. Bring your camera along. Remember a few hundred other tourists will do the same. expect heavy traffic."
        }, 
        {
            "index": 420, 
            "rating": "5", 
            "review": "Sun, beach, Table Mountain view!. One of my favourite places on beautiful sunny days! With a stunning view on Table mountain. And when you have a wind-still day it is just perfect.And on windy days you have loads of entertainment with all the kite-surfers playing around.Will always be one of my favourite places!"
        }, 
        {
            "index": 421, 
            "rating": "4", 
            "review": "A view from my window. One of the first things I saw from my bedroom window was the Magnificent Table Mountain in all its beauty accompanied y the sound of the waves crashing upon the pristine beaches of Blouberg strand. This un-crowded beach close to all amenities is the ideal place to have a swim in the ocean or get that tan that all holiday-makers to Cape Town need to take home with them!!!!"
        }, 
        {
            "index": 422, 
            "rating": "4", 
            "review": "Loooong Walks.... My favorite bit about Blouberg is the long beach. You can walk all the way from the Dolphin Beach hotel to Eden on The Bay. Give it a try. Then stop off at Eden on The Bay and have a nice lunch and walk back again. In summer the area near the Dolphin Beach hotel is packed with kite surfers and it is amazing to watch these people do their thing. And dont forget the stunning view of Table Mountain from the beach. Robben Island is also in sight and it feels like you can swim over ;)"
        }, 
        {
            "index": 423, 
            "rating": "5", 
            "review": "Stunning Blouberg. Stunning view with all the other amenities withing walking distance. The best view of Cape Town. Really commendable."
        }, 
        {
            "index": 424, 
            "rating": "5", 
            "review": "Iconic!. The best beach with the best view in SA! Pure white sand, blue sea, Robben Island feels within touching distance and of course, the view of Table Mountain is spectacular."
        }, 
        {
            "index": 425, 
            "rating": "5", 
            "review": "World Class Kitesurfing Beaches. Blouberg Beach is renowned as one of the World's best kitesurfing beaches. During the summer season, you are likely to see an array of the best kite surfers in the World in action. There are plenty of Kitesurfing schools in the area for you to try the sport as well."
        }, 
        {
            "index": 426, 
            "rating": "5", 
            "review": "Beach with many moods. Everyone knows.. to get that perfect \"Cape Town\" photo with Table Mountain being the focus, you come to Blouberg.It's the beach with many moods - I LOVE sitting on this beach and just absorbing what is happening. It is a beautiful stretch of beach, perfect for kite-boarding!! Great areas for kids to play in rock pools or walking - dogs allowed (on leashes). In Summer it's packed with visitors from all over the world.. always busy with kite boarders. There are rocky areas but spots where one can surf or body board as well. The beach is kept clean. Beautiful spot if you want that perfect Cape Town photo - you can capture awesome sunsets here as the sun goes down over Robben Island.So for the photographer's out there - you want to capture the mountain, Robben Island, sunsets, sometimes whales/seals, gulls, watersport or kites.. this is THE spot to be!"
        }, 
        {
            "index": 427, 
            "rating": "5", 
            "review": "Nothing better!!. Went for a walk on Spring day, was the very best weather we could have asked for, sunny, clear blue sky, and the view of Table mountain from Bloubergstrand Beach, the beach is clean and well maintained. Keep it up!"
        }, 
        {
            "index": 428, 
            "rating": "5", 
            "review": "Loving Bloubergstrand Beach. This must be one of the most beautiful places in Cape Town. It is very, very windy- all the time, making it ideal for kite surfers. I love this spot for the white sand and blue water. The ocean here is spectacular and the view amazing. One of the nicest spots to view Table Mountain from a different angle. Some nice restaurants located in Blouberg and not too far from Cape Town city center."
        }, 
        {
            "index": 429, 
            "rating": "3", 
            "review": "classic view of Table mountain. a half hours' drive from the city centre./.on the mi city tableview bus route. there is a small waterfront area with a number of restaurants. A popular beach for surfers and kiteboarders."
        }, 
        {
            "index": 430, 
            "rating": "4", 
            "review": "Take a mile long walk. This must be one of the longest beaches with clean sand and exceptional views. I enjoy taking a stroll from Blouberg beach toward Milnerton, seeing Table Mountain, enjoying the sound and smell of the ocean, and drawing energy from one of the most spectacular natural environments. Wind free mornings are my best. Afternoons can be windy and very hot in summer. Have fun and re-energize (for free)!"
        }, 
        {
            "index": 431, 
            "rating": "4", 
            "review": "The best beach in Cape Town. the views the setting the feel of holiday and always so laid back.\nLots of restaurants etc\nSelection of foods available, kite surfing, beach walking and the sea."
        }, 
        {
            "index": 432, 
            "rating": "5", 
            "review": "Fantastic views, beautiful beach. Just off the main road going North, it's worth making the detour to admire the panorama of Cape Town and Table Mountain. No matter what camera you have, people will think you're a professional photographer: white beach, deep blue sea, Table Mountain radiant against a blue sky...it doesn't come any better...and it's free!"
        }, 
        {
            "index": 433, 
            "rating": "5", 
            "review": "Great views of the entire Cape Town. Worth the visit to see all of Table Mountain behind the City of Cape Town. Sunset is a particular nice time of day to photograph across the bay."
        }, 
        {
            "index": 434, 
            "rating": "5", 
            "review": "Blouberg!. The best the Cape has to offer. The view from Table Mountain is awesome. Lots of kite surfers who change the blue sky into a multi coloured rainbow. A definite place to visit is Blue Peter. And a long walk along the beach during sunset makes picture perfect memories!"
        }, 
        {
            "index": 435, 
            "rating": "3", 
            "review": "Decent view, decent beach.... Yes the beach is a lovely white sand. yes the distant view of CapeTown and Table Mountain is good. But it's a fair way out and the view isn't THAT good, hence my average rating. It was just pleasant..."
        }, 
        {
            "index": 436, 
            "rating": "5", 
            "review": "Beautiful. Lived in Bloubergstrand for a year and just loved it. The beach has a perfect view of Table Mountain, is easy to access, and gorgeous water. As others have said, the Blue Peter is a lot of fun for sundowners- kind of a dive hotel with a great bar. The only negative is that Bloubergstrand is a bit isolated from the rest of Cape Town, so once you're there, there's not much else to do."
        }, 
        {
            "index": 437, 
            "rating": "5", 
            "review": "Fantastic iconic view. Lovely beach with the iconic view of Cape Town. My daughter had the privilege of living here on her gap year and loved this beach, summer and winter."
        }, 
        {
            "index": 438, 
            "rating": "4", 
            "review": "no penguins :(. we visited this beach to experince and play up and close with Penguins. but to our diappointment we just saw them hiding in the bushes here and there. none of them in the beach on the water. May be it was cold for them. beach is nice with big boulders."
        }, 
        {
            "index": 439, 
            "rating": "5", 
            "review": "Best view in the world. Postcard perfect. Looks like the mountain has been painted onto the horizon. Better than Camps Bay A lovely uninterrupted view. Visit the Blue Peter for a great pizza and On The Rocks for a lovely lunch or dinner.Ons Huise is a lovely iconic restaurant but no fireplace so best enjoyed in summer."
        }, 
        {
            "index": 440, 
            "rating": "4", 
            "review": "Adopt an attitude accepting the vagaries of the weather. Children very very interesting for young children collect shellsMy Citi bus now has this beach on it's route what a blessing My view is enjoy the far stretching white beach enjoy the wind enjoy when cold weather prevails ============= Some dance in the rain others simply get wetGood views but I do not rate that as very important Carpe Diem for me because my daughter of 6 years was elated excited and enjoyed looking for shells on this lovely beach"
        }, 
        {
            "index": 441, 
            "rating": "5", 
            "review": "Beautiful beaches and stunning views. A 'must visit' for every traveller to Cape Town, South Africa!\nThe beaches are beautiful with stunning views of Table Mountain, amazing selection of restaurants, pubs, hotels, guest houses and much, much more.\nLet me show you around...."
        }, 
        {
            "index": 442, 
            "rating": "5", 
            "review": "a blue flag beach. no dislike s here . i love this beach .be advise that a 3 mm wet suite will keep u warm in cold water.or stay out of the water during winter .a clean sandy beach. there is cameras to keep you and your belonging safe, a good place to do all your water activity ,"
        }, 
        {
            "index": 443, 
            "rating": "3", 
            "review": "the view of table mountain is fabulous. the beaches in the north are more exposed for the wind but lovely to take long walks along and the views of table mountain is fabulous. dogs are welcome here and usually there is enough space for every one. crowded on weekends"
        }, 
        {
            "index": 444, 
            "rating": "4", 
            "review": "Go for a walk!. No crowds and wide open spaces. Can walk the beach right to Melkbosstrand. Dog friendly, as long as you clean up after your dogs. Beautiful sunsets."
        }, 
        {
            "index": 445, 
            "rating": "4", 
            "review": "A long beach great for walks or windsurfing. Just north of the city this long & wide beach is great for long walks or windsurfing. (Not all areas along Cape Town waterfront has bathing or accessible beaches & many are very rocky for walking alongside only.)"
        }, 
        {
            "index": 446, 
            "rating": "4", 
            "review": "Nice view. Very nice view, with marvelous sunsets. There are numerous bars and restaurants from where you can enjoy it. Cape Town and the table mountain on the background are faboulous"
        }, 
        {
            "index": 447, 
            "rating": "5", 
            "review": "Best view of Table Mountain. Bloomberg is not longer inaccessible by public transport thanks to myciti bus. Travelling by car go on the N1 from the CBD and look for the turn off for Milnerton. Follow the road all the way down Milnerton, Table View until you see the signs for Bloubergstand. On a nice day it's offers outstanding views of table Mountain - not to be missed."
        }, 
        {
            "index": 448, 
            "rating": "5", 
            "review": "Great view of table mountain. With the mountain in full view and the long, pristine, white sandy beach you will struggle to find a more beautiful beach setting.In summer Cape Town is plagued by a strong South Easterly wind aptly named 'the Cape Doctor' as it sweeps any smog out to sea. This makes the beach sand blow around your legs and it can sting. Avoid in strong wind but make sure you plan a visit. Truly one of the Capes gems and not to be missed."
        }, 
        {
            "index": 449, 
            "rating": "5", 
            "review": "Beautiful. Great view of Table Mountain, nice location. I would return here is warmer weather. It was a bit windy."
        }, 
        {
            "index": 450, 
            "rating": "5", 
            "review": "The Beach where you always like to be. Bloubergstrand Beach is a wide and sandy beach. Moist of the times there is a lot of wind, but with the high temperatures that's no problem. On a clear day you have a wonderful view on Cape Town and Table Mountain.Once you have been there, you always wanna stay and if you left, you like to return as soon as possible."
        }, 
        {
            "index": 451, 
            "rating": "4", 
            "review": "love this place. We are staying on the beach front and love this place it is winter and still a great place to stay and visit. Away from the hustle and bustle of the city and close enough to get around to all the major attractions. I would recommend for families with small children they love it here too. Not good for swimming but great views and nice walks."
        }, 
        {
            "index": 452, 
            "rating": "5", 
            "review": "THE BLUE PETER IS A JOL. The beaches are stunning, DO NOT attempt to swim as it is freezing cold. the view of table mountain is superb. U have to have drinks & maybe a bite to eat at the Blue Peter - legendary!"
        }, 
        {
            "index": 453, 
            "rating": "5", 
            "review": "Always go there when I am in town. Bloubergstrand is synonym with Cape Town. I always go there to look at the Mountain and some meal. When I have work colleagues I take them to enjoy one if our most beautiful sites in SA."
        }, 
        {
            "index": 454, 
            "rating": "5", 
            "review": "Best sunset .... Go there and take champagne with you, sit down somewhere and watch the sun set, the most wonderful place in this area,"
        }, 
        {
            "index": 455, 
            "rating": "4", 
            "review": "Spectacular views. This is without a doubt one of the best spots for a great view of Table Mountain (on a clear day of course). I enjoyed watching the kite surfers and families walking their dogs while taking a leisurely jog down the seaside. I found the beach and environment to be safe."
        }, 
        {
            "index": 456, 
            "rating": "5", 
            "review": "best view of Table Mountain. for the best view of Table Mountain, Robben Island and Table Bay, head to Bloubergstrand Beach and enjoy some sun bathing, swimming for the brave, and a lovely meal or sundowner overlooking Cape Town!"
        }, 
        {
            "index": 457, 
            "rating": "5", 
            "review": "Panorama of Cape Town. We were recommended to go here if we wanted to see the full panorama of Cape Town from land. We decided to go here for sunset and were not disappointed. We had a spectacular view over the bay and Table Mountain on the background and the setting sun gave it a magical feeling."
        }, 
        {
            "index": 458, 
            "rating": "5", 
            "review": "Top Location. We had a few hours to kill in Cape Town and with typical winter weather we decided to take a drive to Blouberg strand.We spent some time watching the waves with a perfect view of Table Mountain in the background.Despite the weather we enjoyed the time. It is strongly recommended to visit this location for the perfect view of Table Mountain."
        }, 
        {
            "index": 459, 
            "rating": "4", 
            "review": "the best view of Table Mountain. Amazing view of the mountain long sandy beach take your own deckchairs and umbrellas. Plenty of restaurant choices opposite the beach, no facilities or food outlets on the beach, Fabulous for windsurfing, and talent spotting. Can be very windy, icy waters"
        }, 
        {
            "index": 460, 
            "rating": "5", 
            "review": "Stunning Beach, Great View!. Lovely beach with great views across Table bay to the Mountain! Nice choice of eating places around too."
        }, 
        {
            "index": 461, 
            "rating": "4", 
            "review": "great views and great beach. lovely beach and very popular with kite surfers. good view of Table mountain. beach goes on for miles and is in pristine condition"
        }, 
        {
            "index": 462, 
            "rating": "4", 
            "review": "Great View of Cape Town. Our first stop upon arrival in Cape Town was by road from the North, and Blaauwberg Beach was it. What a great place to see the Cape Town skyline set against Table Mountian. The beach was wide and inviting. The strand walk was lined with shops and cafes to make it a memorable experience. Tourist information at the beach. Wi-fi seemingly everywhere."
        }, 
        {
            "index": 463, 
            "rating": "4", 
            "review": "Some of the best photo opportunities around. It's a busy beach in summer but it's always worth a visit; even early morning strolls or late afternoon walks are a treat. If you are looking for a photo of Table Mountain this is a very good spot to take it from. Robben Island is visible from here. If you enjoy surfing, kite surfing or stand-up paddling, you will find good company here. Be warned though, the water is icy. All year round."
        }, 
        {
            "index": 464, 
            "rating": "5", 
            "review": "Great views.. Fantastic views of Table Mountain, do not forget your camera. Beach is outstanding and is only a short drive from the city."
        }, 
        {
            "index": 465, 
            "rating": "5", 
            "review": "Lovely Place to be in. There are a lot of places available to stay in Bloubergstrand, and it is well connected via the myciti bus service to the main part of Cape Town. The beaches are excellent"
        }, 
        {
            "index": 466, 
            "rating": "5", 
            "review": "Wow, such an amazing scenery!. You have to make a stop at this beach and watch the huge waves crashing onto the shore, with Cape Town and Table Mountain in the background! It is an amazing sight!"
        }, 
        {
            "index": 467, 
            "rating": "4", 
            "review": "Nice views of Table Mountain. The beach has a nice infrastructure and a nice neighborhood. Unfortunately I've been there on a cloudy day, but I am sure the views of Table Mountain should be amazing. It seems to be a little out of the track for mass tourism."
        }, 
        {
            "index": 468, 
            "rating": "4", 
            "review": "Ultimate views. A short drive north of the city, gets you to the beaches and the best views of Table Top Mountain and the city. There are beach side car parks, toilets and changing facilities. Be aware of personal security here, never leave anything valuable as there are always opportunists, accept this and enjoy the beaches. I would recommend visiting early morning as the light on the mountain and city is stunning."
        }, 
        {
            "index": 469, 
            "rating": "4", 
            "review": "Great beach for all types of surfers.. The weather in February can be warm to hot but it takes a brave person to go into the water without a wetsuit. The water is the coldest I have ever experienced numbing would be a good description. Then again this beach, Big Bay and Camps Bay are more popular with the surfers than swimmers. To walk along, sit and sunbathe on super. Not far from any beach you will also find plenty of places to quench your thirst or enjoy a meal at very reasonable prices."
        }, 
        {
            "index": 470, 
            "rating": "5", 
            "review": "Beautiful white sandy beaches. Great place to take pictures and film of Table Mountain and the City. It does tend to get very windy over that side of the Bay"
        }, 
        {
            "index": 471, 
            "rating": "5", 
            "review": "Postcard-worthy shots of Table Mountain. Quiet, peaceful Blouberg Beach is about half an hour's drive from Cape Town and has the same powdery white sand as its more famous siblings, Clifton Bay and Camps Bay beaches, only less crowded. From here beautiful pictures of Table Mountain can be taken and it's an amazing sensation to suntan on the beach while gazing at the mountains."
        }, 
        {
            "index": 472, 
            "rating": "5", 
            "review": "Another world. Bloubergstrand beach is less than an hour from Cape Town, but feels like a different world - it felt more like Namibia than SA. It is on the Atlantic seaboard so too cold to swim, but nice beaches to sit and enjoy the view. Just a bit North are some nature conservation beaches that are also worth a visit. We had coffee at Petit Fours on the beachfront - quaint little restaurant with some excellent coffee."
        }, 
        {
            "index": 473, 
            "rating": "4", 
            "review": "Well worth a visit. We visited this beach just north of Cape Town on a weekday when it was fairly deserted expect for about a dozen kite surfers. They were taking advantage of the strong wind and great swells.The beach looked clean and falls sharply into the sea."
        }, 
        {
            "index": 474, 
            "rating": "5", 
            "review": "Breath taking. Breath taking views of the mountains, wonderful beach, was lovely strolling along the beach in the lovely warm sand, would never get tired of the views"
        }, 
        {
            "index": 475, 
            "rating": "5", 
            "review": "Picture perfect. This is where they take the postcard pictures. You can see the mountain in all it's glory. Understand why the area underneath is called the \"City Bowl\". See what the 2010 Soccer World Cup hype was about with the new stadium. Ample parking, great ice cream, kite surfing, walking, many restaurants and one of the best sunsets in Africa."
        }, 
        {
            "index": 476, 
            "rating": "5", 
            "review": "We never get tired of this view. I never feel I have really been to Cape Town until I go out to Bloubergstrand to see the mountain from that side of town. A wonderful, iconic view and a lovely beach to visit. Old style ice-cream sellers with their bicycles add to the charm."
        }, 
        {
            "index": 477, 
            "rating": "4", 
            "review": "a dream in Blue with a view to the table mountain. Where do you find as a European guy empty beaches, endless sand beaches which one of the most stunning views in this worlds - directly to the table mountain?And these beaches are totally empty - even in summer during week days - and 30 minutes from downtown Cape Town away!"
        }, 
        {
            "index": 478, 
            "rating": "5", 
            "review": "Fab views of Table Mountain. Well worth the drive out to see the mountain . The beach is mile after mile of fabulous sand. Found a nice little bar set back from the beach and just enjoyed the view"
        }, 
        {
            "index": 479, 
            "rating": "4", 
            "review": "Always impresses. We returned to the beach again, two years later, and soaked up the atmosphere. A lovely sunset but a bit windy. A few Guinness and a pizza at Doodles across the road to end our 1st day in Cape Town. Take your trainers and run or walk the promenade."
        }, 
        {
            "index": 480, 
            "rating": "5", 
            "review": "Amazing!. Make sure to visit cafe Eden and saint restaurant - two brilliant places!! Spend a day on the beach and view table mountain. My favourite place!"
        }, 
        {
            "index": 481, 
            "rating": "4", 
            "review": "Relax. One of the many beaches in Cape Town, a bit windy at times but has a perfect view of table mountain from a distance"
        }, 
        {
            "index": 482, 
            "rating": "4", 
            "review": "Amazing beach views. For us it was the end of a wonderful 3 weeks journey (two of them with a car), that started at Livingstone, Zabmia and was about to end a few hours later. Amazing beach with powerful waves. A good place to say good bye to the beautiful beaches of the Cape Town area.\nUntil we meet again...."
        }, 
        {
            "index": 483, 
            "rating": "5", 
            "review": "No other view like this. Love Blouberg... The kite surfers, the clean beach, the restaurants close by, the ice-cream at the corner, the paved walking lanes...will be back."
        }, 
        {
            "index": 484, 
            "rating": "5", 
            "review": "Breathtaking views, great food and beach. Great selection of restaurants and shops on the boardwalk, with fantastic views of Robben Island, Table Mountain and the constant surfskiing, kite surfing & surfing activities. \"Karoo Cattle and Land\" Restaurant served some of the best food we have ever enjoyed!"
        }, 
        {
            "index": 485, 
            "rating": "5", 
            "review": "Therapeutic. The view from Bloubergstand overlooking Table Mountain and the many kites is certainly a photographers dream and very soothing to the eye.Up and coming Big Bay waterfront with many spots to enjoy a sundowner and beautiful views."
        }, 
        {
            "index": 486, 
            "rating": "5", 
            "review": "Or, the windy city?. This is a para boarder or surfers dream place and we were amazed how young they start surfing here. It was very windy in each of the 3 occasions we visited but do not be fooled, you do need your sun screen for despite the cooler air, the sun is fierce! We spent several happy hours just watching the activity in e sea and people watching in general. Do not be in a hurry for food and drink from any of the beach-side cafe's for there is. I rush about any of them. I did manage to get food poisoning from one of the bars from a dodgy prawn cocktail so beware what you order!"
        }, 
        {
            "index": 487, 
            "rating": "5", 
            "review": "View and food. Fantastic views of table mountain a photographers dream we went to a resteraunt called blue peter the food and staff were great made to feel really welcome,the food excellent,and the views are great,walk along the beach and watch the kite surfers,some of the tricks they do are awesome,if in Cape Town you must visit."
        }, 
        {
            "index": 488, 
            "rating": "4", 
            "review": "Lets fly. This is a great open expanse of beach with a great view of Table Mountain. We spent some time there flying our board kite with no-one to bother us. Only downside is that there is not much choice on where to eat."
        }, 
        {
            "index": 489, 
            "rating": "3", 
            "review": "amazing view to cape town, but thats it. the view on to cape town and the table mountain is one of the most beautiful views you can get on to capetown. the beach itself is nothing i´d choose for my beach day though. its nice...but nothing compared to the beaches on the garden route"
        }, 
        {
            "index": 490, 
            "rating": "4", 
            "review": "Best Classic Views. Good place to visit along this shoreline giving unrivaled & spectacular classic views of Table Mountain. Also a brilliant place to park & watch the kite surfers.....& see the offshore activities of the commercial port as all the container ships & freighters wait to offload/load.....gives endless photo opportunities with combinations of sports activities with Table Mountain as the backdrop. Plenty of restaurants to chose from in the area be it snack, casual or fine dining you can find it in the area."
        }, 
        {
            "index": 491, 
            "rating": "3", 
            "review": "Nice place to visit. It is a an average beach to visit, but it is nice to have a walk along the paths and visit a cafe for lunch."
        }, 
        {
            "index": 492, 
            "rating": "4", 
            "review": "Great views of Table Mountain. Clean, beautiful beach with white sand and great views of Table Mountain and the city bowl. Bloubergstand is a mere 15 minutes drive from the city centre."
        }, 
        {
            "index": 493, 
            "rating": "4", 
            "review": "Big blast of fun. A fun place to hang out on the weekend and surf! Great view of table mountain too...for those who don't surf there are restaurants and shops with the same vibe"
        }, 
        {
            "index": 494, 
            "rating": "3", 
            "review": "Someone needs to look at building regulations. I first went to this beach in 1997 and it was a lovely quiet place with superb views of Table Mountain. When I last returned I found a huge amount of building work had gone on not always to the standard that I really felt fitted in with the surroundings.There is a balance to be struck between the power of the scenery and people's desire to live near the sea and I don't think they've got it right here.One visit I find sandy dunes, the next visit I find a collection of identical two bedroomed houses each with their own miniature gardens with the original landscape destroyed.Cape Town is a victim of its own popularity but don't let me put you off, there is still much to see. For those who have not visited before, you do need a hire car because things are not compact and there is no public transport system that we would understand in Europe. Car hire is cheap enough and the standard of driving fairly good. The only proviso is I would never drive at night if I can possibly help it. This applies more in the country than in the town."
        }, 
        {
            "index": 495, 
            "rating": "5", 
            "review": "Sun, sea & sand with fantasic views. Walk for miles & miles along this fantastic clean beach while looking towards & taking photographs of the City of Cape Town & Table Mountain. Can be windy & the sea here is freezing but its a great spot......"
        }, 
        {
            "index": 496, 
            "rating": "5", 
            "review": "best place to photograph Table Mountain. Go to Bloubergstrand Beach and look across toward Table Mountain…there she stands in all her glory with the city of Cape Town nestled below…best place to get her picture….truly a Kodak Moment!"
        }, 
        {
            "index": 497, 
            "rating": "5", 
            "review": "My favourite place in the world. I always come back to Bloubergstrand. Most beautiful view of Table mountain. Best place to go for a long walk next to the sea."
        }, 
        {
            "index": 498, 
            "rating": "4", 
            "review": "Great view onto Table Mountain. Also nice beach (not for swimming) but splash around in the waves. Restaurant Blue Peter ok, more for the view than for the food."
        }, 
        {
            "index": 499, 
            "rating": "4", 
            "review": "Great beach and fantastic surroundings. The only downside is that the sea is far to rough to swim in. I suppose that's why everyone was there with surf boards and wind sailing equipment. Still well worth visiting, lovely restaurants and shopping malls so plenty to do.a so much so I am looking to purchase a holiday home there and take up surfing."
        }, 
        {
            "index": 500, 
            "rating": "5", 
            "review": "THE View. We got off the plane and drove directly to Blouberg so our children would see Table Mountian and the bay from there on a perfect clear day..... there is nothing like that view! We found a great spot to eat right on the beach and parking was no problem. Only good if the day is clear."
        }, 
        {
            "index": 501, 
            "rating": "5", 
            "review": "Side Car Tour to Bloubergstrand. We took a side car tour to Bloubergstrand Beach. We spent several hours stopping at various points. It was a lovely beach that we would come back to if we are ever in Cape Town again. You have lovely views of the city and ocean. It was Heritage Day and we saw hand gliders above and many people on the beach. We did not stop at the many restaurants and shops that we saw. I believe this would be fun thing to do while visiting the beach on our own. I look forward to revisiting the area."
        }, 
        {
            "index": 502, 
            "rating": "4", 
            "review": "Weekend options. Bloubergstrand caters for everyone, you can walk on the broadwalk, cycle, have a meal, walk on the beach, eat ice-cream, have a drink, surf or do just about anything.Parking can be challenging and the sea is cold but a great place to meet friends and relax."
        }, 
        {
            "index": 503, 
            "rating": "5", 
            "review": "Lovely. We stayed in Bloubergstrand for a weeks holiday. We all enjoyed it so much I don't think we will book at another place in Cape Town again. Lovely sunset view and view of Table Mountain."
        }, 
        {
            "index": 504, 
            "rating": "5", 
            "review": "Great views of Cape Town. Scenically it is a beautiful beach. You can watch the kite-surfers doing there thing. It gets very windy but well worth yhe visit."
        }, 
        {
            "index": 505, 
            "rating": "5", 
            "review": "What a view!!. An amazing experience. A view of Table Mountain that you'll only see from this side of Cape Town. Small restaurants are available for a meal . The Kite Surfers make for good photo opportunities ."
        }, 
        {
            "index": 506, 
            "rating": "4", 
            "review": "WINDY BEACH. Great, never-ending beaches, views, views and views – sometime it feels as if you can walk over to Robben Island – Table Bay and Table Mountain is always spectacular form here! Some spots with great surf, cold (very cold...) water. The seemingly ever-present windy conditions are great for kite-surfing – with literally 100’s of kites zipping along the beach on a “good” day.Decently spaced toilets with showers and changing facilities, a well maintained esplanade meandering along the beach, bicycle paths and good supporting infrastructure.Funky right-on-the-beach hang-outs such “Ons Huisie”, Blue Peter, Moyo’s and many others make for a festive feel and cosy refuges if the wind really starts picking up.The on big down-turn – dogs, or no, people with dogs that don’t clean-up behind their dogs…… it seems to be a local cultural ting – owners just don’t seem to “pick-up” along this stretch of pristine natural beauty – not on the beach, nor on the walkways!Did I mention the wind?!? You have to like it or accept it……All things considered, a great destination."
        }, 
        {
            "index": 507, 
            "rating": "5", 
            "review": "what splendor!. best fish and chips at The Huizie, also a lovely little French tea shop and much more! the view on table mountain is breath taking!!"
        }, 
        {
            "index": 508, 
            "rating": "5", 
            "review": "Awsome Place to Stroll & Play. We love this Beach Incredible Views of Table Mountain which is always changing with the Weather.View of Robbin Island Lots always going on from Wind Surfing to Kite Boarding I close my Eyes and think I'm in San Diego.We walk this Beach every day and spend most nights having Sun Downer's at the Various Cool Resturants and Bars."
        }, 
        {
            "index": 509, 
            "rating": "3", 
            "review": "Best view of Table Mountain. This is the place to go to see the view of Table Mountain that's in all the photos and paintings. It's a lovely place with a nice beach but its always so windy there that its a chore often to even sit out at a bar for a drink."
        }, 
        {
            "index": 510, 
            "rating": "4", 
            "review": "Wind Blowing Experience. generally been there in the late evenings to watch sunset or a special event at night, like a fireworks display. Beautiful views but be prepared to get sand blasted"
        }, 
        {
            "index": 511, 
            "rating": "4", 
            "review": "Great view of Table Mountain. This is the place to take the classic photo of Table Mountain! GPS coordinates of the car park: 33.803160, 18.461410"
        }, 
        {
            "index": 512, 
            "rating": "5", 
            "review": "Spectacular view. I visit Bloubergstrand and its two restaurants:On the Rocks and\nOns Huisie regular for the food and view."
        }, 
        {
            "index": 513, 
            "rating": "4", 
            "review": "Great view, not always that clean. This is the spot to visit for sunsets and photo opportunities of the Mountain. The beach is very popular with kite surfers and can get crowded. Have also noticed litter there. Many restaurants and shops in the area if you want to get a bite to eat."
        }, 
        {
            "index": 514, 
            "rating": "5", 
            "review": "Photo opportunity. Best place to take the classic photo(s) of Table Mountain. Highly recommended. Beach and sea, sun and sand, what more could you want."
        }, 
        {
            "index": 515, 
            "rating": "5", 
            "review": "Great views. The best view of Table Mountain from a distance looking over the bay. The beach has white sand and very hot in Summer, but winter can be windy and rainy."
        }, 
        {
            "index": 516, 
            "rating": "5", 
            "review": "A beautiful sunset with the view of the Table Mountain. We liked it, because it is not full with tourists, there are a few resstaurants with very good fishfood, coming htere is easy and not far from Cape Town.\nWe went on several different days, when the weather was nice, when the weather was lousy, it is always beautiful."
        }, 
        {
            "index": 517, 
            "rating": "5", 
            "review": "take my Breath Away. This is one of teh most exquisite beaches in the world, even though the icy waters do not permit swimmimg. It's great for kite surfing, surfing, and other water sports. How some people commented there is little to do in the area is beyond me. The entire beach front area is laced with bars, shops, great restaurants and amazing seafood can be had! Check out the Onse Huisie (our little house) restaurant where traditional West coast quisine can be enjoyed in a national heritage house, with sweeping views over the ocean as waves break only metres away."
        }, 
        {
            "index": 518, 
            "rating": "5", 
            "review": "Location, Location, Location. Bloubergstrand. Well you know all those super views of Cape Town with the Table Mountain soaring above the city and Lion's Head mountain. Those are taken from BloubergStrand. The Strand, the beach is white sand and stretches for miles. Unless you are VERY hardy it is best to forget swimming. The water is icy cold - this is the South Atlantic. A walk on the beach - just soaking up the views is well worth it but check the season - in September it was 'blerry cold.\""
        }, 
        {
            "index": 519, 
            "rating": "4", 
            "review": "Perfect for Photos. This is a beautiful spot for photos, with an amazing view of table mountain. if your on vacation in Cape Town, this picture will be your album cover. There is little else to do in the area, so you wont stay long, but the beach is beautiful with white white sand, and the water is ok to put your feet in, but to cold for any deeper."
        }, 
        {
            "index": 520, 
            "rating": "4", 
            "review": "very nice view on the Table Mountain!. At Bloubergstrand Beach you have a very beautiful view on Cape Town and the Table Mountain! We visited this place in September and it was very cold and windy, but there were no many clouds :) When it is raining and there are a lot of clouds, you don't see anything of Cape Town. You can also see Robbeneiland in front of the beach. And you can drink or eat something in The Blue Peter at the Beach. When it's good weather you can sit outside."
        }, 
        {
            "index": 521, 
            "rating": "5", 
            "review": "EXCELLENT SEAFOOD AT DIE HUISIE. Die Huisie restaurant is right on the Blouberg beachfront and has excellent views of table mountain and Robben Island."
        }, 
        {
            "index": 522, 
            "rating": "4", 
            "review": "the best place for photos. The best place to get the iconic pictures of Table Mountain across table bay... and some good cafe's and bars around as well, worth an afternoon to sit on the beach"
        }, 
        {
            "index": 523, 
            "rating": "4", 
            "review": "One of my favourite beaches in Cape Town. Very clear views of Table Mountain and Robben Island.Water very cold,but long stretches of beaches and scenery makes up for it."
        }, 
        {
            "index": 524, 
            "rating": "5", 
            "review": "Go, you won't regret it. Beautiful view over the water to Cape Town and Table Mountain. Have a glass of chilled white wine and soak it all in !"
        }, 
        {
            "index": 525, 
            "rating": "5", 
            "review": "It's a breeze!. A most beautiful beach and fantastic views of table mountain. Exceptional for wind sports and plenty of parking.\nGlad to see they finally got rid of the grounded tanker!"
        }, 
        {
            "index": 526, 
            "rating": "5", 
            "review": "Relaxing day. This was a real nice place, the nature and the surroundings are really beautiful. The people is great and the restaurants around are good and not too expensive."
        }, 
        {
            "index": 527, 
            "rating": "5", 
            "review": "Iconic view. This is the view everyone sees of table mountain, lovely beach and fantastic views. Good eating places close."
        }, 
        {
            "index": 528, 
            "rating": "5", 
            "review": "The place to take pictures of Table Mountain. Bloubergstrand is by far my favorite place in Cape Town. If you want to take beautiful pictures of Table mountain and the sea, this is where you should be: postcard quality. You can sit or walk for hours here and forget about all troubles and cares. Really beautiful and worth the drive if you stay in another part of Cape Town. A must for international visitors."
        }, 
        {
            "index": 529, 
            "rating": "4", 
            "review": "Mountain and Robben Island views. The beach stretches for ever. Be warned that its not safe to swim! Swimming and surfing etc at Little Bay and Big Bay. Stunning view from the beach.One can imagine the first explorers landing here, in awe."
        }, 
        {
            "index": 530, 
            "rating": "5", 
            "review": "Table Mountain photo framed. If you are lucky and table mountain isn't covered in clouds, you will definitely get the best postcard shot of the mountain."
        }, 
        {
            "index": 531, 
            "rating": "3", 
            "review": "Best place for photos of Table Mountain across the bay. The water is very cold on this side and it is more likely to be windy than not, but it is worth the drive out there just for the best photos with Table Mountain in the background. It is also a windsurfer's paradise."
        }, 
        {
            "index": 532, 
            "rating": "5", 
            "review": "Best view of Tableberg Mountain. Cute restaurants, people walking there dogs, people just sitting and relaxing, this all you can find here. The beach is beautifull and awesome views. Always goes there when I am in Cape Town."
        }, 
        {
            "index": 533, 
            "rating": "5", 
            "review": "Beautiful view of Table Mountain. Whenever I visit Cape Town I go to Bloubergstrand Beach at least a couple of times per week. The view across the bay to Table Mountain is quite stunning."
        }, 
        {
            "index": 534, 
            "rating": "5", 
            "review": "What a view. This has been said many times before but I will say it again. This is THE most stunning view of Table Mountain ever, Anybody visiting Cape Town HAS to drive out there to witness it. The view makes all the negative comments here irrelevant."
        }, 
        {
            "index": 535, 
            "rating": "4", 
            "review": "Magnificent view. For the picture postcard view of Table Mountain, this is where you must visit. You have not 'seen' Table Mountain until you view it from here. Get onto the beach, listen to the crashing waves and take in the splendour."
        }, 
        {
            "index": 536, 
            "rating": "5", 
            "review": "Head to Melkbos. For a quiet rural beach head to Holbaai or some of the surrounding beaches in Melbosstrand. For awesome views of Table mountain that will make quintessential holiday pics for your collection this beach is highly recommended. You could take the My Citi to Melkbos. Pack your beach essentials and enjoy the sun. This is on the Atlantic seaboard so water are quite cold, bring a wet suit and surfboard if you are into surfing. Shops and eateries are to be found in Melbos \"proper\" but it is more congested here."
        }, 
        {
            "index": 537, 
            "rating": "5", 
            "review": "Cold water, gorgeous views. Cold water of the Atlantic makes a good laugh for the people not used to it, but the views towards Table Mountain are gorgeous."
        }, 
        {
            "index": 538, 
            "rating": "3", 
            "review": "lil trashy. the best part of it is calm waters to learn how to surf and the view.. otherwise it is trashy place..."
        }, 
        {
            "index": 539, 
            "rating": "5", 
            "review": "Long beautiful beach. A lovely stretch of golden beaches - with outstanding views across the bay of Table Mountain & the City."
        }, 
        {
            "index": 540, 
            "rating": "5", 
            "review": "The best photos of Table Mountain. We came here to take photos of Table Mountain, really worth it. This is about 25 minutes drive from Cape Town if there is no traffic, in traffic it can take about 45 minutes. The beach is almost empty during winter with just few dog walkers around, the view is perfect."
        }, 
        {
            "index": 541, 
            "rating": "5", 
            "review": "pretty pretty pretty. nice and chilled vibe on this beach. closeby to a load of restaurants and shops. not too busy, so a perfect little relaxed spot. lovely view of the table mountain as well. one I'll never tire of."
        }, 
        {
            "index": 542, 
            "rating": "4", 
            "review": "See CT from a different angle. This is a great beach and popula with couples, families, joggers, the lot. You get to see Cape Town from a different perspective. It is from this angle that you are able to see why Table Mountain is said to be looking like a table. The beach is clean, there are places to eat and generally enough parking. Try it"
        }, 
        {
            "index": 543, 
            "rating": "4", 
            "review": "Kite Surfers a plenty. If the wind is good, then the kite surfers make a fantastic addition to this wonderful scenic spot. My husband is a keen amateur photographer and loves getting those action shots of the kite surfers at play. Even without them, the views over the bay are magnificent. Lovely area for people cycling, jogging, walking the dogs or just taking a gentle stroll. We watched the fireworks from the beachfront on New Years Eve this year and even though the weather was terrible,the fireworks were still happening and hopefully we will be there again this year with better weather. Avoid the Cape Town traffic jams as you get just as nice a view of the fireworks across the bay without the madness of the crowds"
        }, 
        {
            "index": 544, 
            "rating": "4", 
            "review": "Stunning Views. Bloubergstrand Beach would be perfect if not for the freezing cold water. Stepping in, you feel as if your brain is going to explode and that your bones will break if you take another step in. The Kite Surfers love it but even they would not venture in without a wetsuit. Safe and clean. Leave your fishing rod at home as the only thing you would catch there is a cold."
        }, 
        {
            "index": 545, 
            "rating": "4", 
            "review": "Artist's inspiration. I can see why many artists have chosen this destination for paintings. Scenic and clean, many come here to walk, jog, meditate or play in the shallows. We bring our kids here every weekend to unwind."
        }, 
        {
            "index": 546, 
            "rating": "4", 
            "review": "What a view!. Fantastic view on the table mountain and on Capetown. Definately worth the detour!The beach itself is wide and beautiful,sit down or have a walk and seize this special moment in your life."
        }, 
        {
            "index": 547, 
            "rating": "5", 
            "review": "Best view of Cape Town. If you ever wondered where those postcard photo's are taken go to Bloubergstrand and you will get the view!!!"
        }, 
        {
            "index": 548, 
            "rating": "3", 
            "review": "Clean beach with a wreck nearby. This is a lovely beach with a stunning view of Robben Island and Table Mountain. All the shops are near and plenty to choose from. Lovely clean beaches with toilets close by."
        }, 
        {
            "index": 549, 
            "rating": "3", 
            "review": "Expected more. Just a nice beach with a spectacular view. Disappointed about restaurants and facilities behind. Take your camera and go just before sunset. I was a bit windy and chilly too in May, bring along a light jacket! Taxis are hardly found nearby so if you are taking one there make sure you get his number so you can call one and go back safe to town."
        }, 
        {
            "index": 550, 
            "rating": "5", 
            "review": "Awesome Winds. World class spot for kitesurfing South Easterly winds make this place super special. Big Bay Especially."
        }, 
        {
            "index": 551, 
            "rating": "5", 
            "review": "Great views of Table Mountain. We rented a lovely condo near the beach for a week and thoroughly enjoyed the spectacular views and sunsets from our 4th floor balcony. The kite surfers were amazing to watch! A nice place to be away from the city, but still close enough to visit. Just wish there were some better restaurants there. Plenty of pizza, sushi and take-away though."
        }, 
        {
            "index": 552, 
            "rating": "4", 
            "review": "Icy cold water, but glorious sun downers. There is only ONE way you should experience Bloubergstrand - Go to the Blue Peter Restaurant, order some beer and pizza and watch the sun set right over Robben island. The views of Table mountain is quite spectacular from Bloubergstrand, and when it is low tide, you can walk quite deep in to some sand banks of Bloubergstrand. Or do some kite surfing when the wind blows (which is often)."
        }, 
        {
            "index": 553, 
            "rating": "5", 
            "review": "Cold water Superb beauty. Long white beaches, view of the ships coming into the harbor and the mountain naturally. This is our home town and we love surfing and long walks on the beach."
        }, 
        {
            "index": 554, 
            "rating": "4", 
            "review": "stunning. get away from the crowds by walking along the long sandy beach drinking in that well known view of Table Mountain. Buzzy, happy place with plenty going on"
        }, 
        {
            "index": 555, 
            "rating": "4", 
            "review": "Two Words: Kite Surfers. You'll see wind surfers and regular surfers as well but I could sit for hours and watch the wind surfers!"
        }, 
        {
            "index": 556, 
            "rating": "5", 
            "review": "Breath Taking Beauty. Overlooking the Atlantic Ocean. Table Mountain magestically positioned across the water. Robin Island in clear view.White stretches of beach, families, children and dogs walking along the beach and the promenade. Dare devil kite surfers, jiggers and cyclists add to the mix. An eclectic mix of restaurants to relax in and enjoy a meal and drink with special people. An experience to treasure."
        }, 
        {
            "index": 557, 
            "rating": "4", 
            "review": "Best beach for Table Mountain views. This is place where most of the postcards of Cape Town and Table Mountain are taken. The views are amazing. Its a fairly safe beach too but exposed to the winds. Great for sunset walks and kite surfing."
        }, 
        {
            "index": 558, 
            "rating": "4", 
            "review": "Even when its windy it looks spectacular. This beach presents all that you want's. If the weather is bad just sit and admire the kite surfers. Careful of the doggy poo. Their owners is a bit reckless but look very happy to have a place still to run their dogs."
        }, 
        {
            "index": 559, 
            "rating": "5", 
            "review": "clean beach. this is the beach of preference for my family on a Sunday afternoon. very freindly icecream vendor makes the experience all the nicer!"
        }, 
        {
            "index": 560, 
            "rating": "3", 
            "review": "great for families. Blougerg is quite a windy area, especially when compared to the sheltered clifton beaches.It was very windy when we were there, but full of families. There are a large variety of self-catering accommodation within walking distance of the the beaches. The water is cold, but because of the wind it's great for wind-surfing and similar water-sports."
        }, 
        {
            "index": 561, 
            "rating": "4", 
            "review": "Perfect view of Table Top. Sections of the beach were slightly littered, plastic bottles etc., but the view of Table Top is just incredible. I visited Table View Beach to go kit surfing, sadly no wind so decided to walk down the beach to Lagoon Beach."
        }, 
        {
            "index": 562, 
            "rating": "3", 
            "review": "Visit because of the view. I did not find character, struggled with adeqaute parking and it is obvious that not much is done to make the beach 'user friendly'. However, the postcard view of Table Mountain is what draws me to Bloubergstrand beach every time."
        }, 
        {
            "index": 563, 
            "rating": "5", 
            "review": "The best view of Table Mountain. Mile upon mile of pure white sand, and there is no better place to take your pictures of Table Mountain."
        }, 
        {
            "index": 564, 
            "rating": "5", 
            "review": "Seaside. We stayed near the beach and didn't regret a minute. The views and walks are fantastic, the view of table mountain is exquisite. Fantastic for surfing."
        }, 
        {
            "index": 565, 
            "rating": "4", 
            "review": "If you need some wind, it's the place. It is definitively a road to drive on\nto enjoy sunset on table mountain.\nSUPERB\nFresh air, plenty of restaurants, and some places where the girls are warm. Try \"Peter blue\" to enjoy a nice pizza where it'scrowded of young people laying down with a drink to enjoy good time at 6pm"
        }, 
        {
            "index": 566, 
            "rating": "5", 
            "review": "beautiful view of Table Mountain and Cape Town at Sunset. very nice place to watch the sunset over Robben Island and then look back to Table Mountain. New development on the area, with a wide assortment of restaurants."
        }, 
        {
            "index": 567, 
            "rating": "3", 
            "review": "Windswept. The water is unbearably icy cold for swimming but watching the kite surfers in the afternoon is amazing. With the right wind conditions there are hundreds of kite surfers in the water - great for taking spectacular photos.There are a few eateries and bars along the main road after taking a brisk walk. They don't appear to be very classy places, just average, however they have a magnificent view of Table Mountain across the bay. There is plenty of parking (with the obligatory parking attendants expecting tips). The only complaint is that it can get very windy as it's very exposed to the elements. The sand from the beach blows across the road - there is a desperate need for environmental help for this beach. We noticed a feeble attempt at planting grasses on one section of the beach but a wall should be built between the footpath and the sand to stop the sand from moving across the road."
        }, 
        {
            "index": 568, 
            "rating": "5", 
            "review": "Bloubergstrand beach. Can be very windy, but the view of robin island and table mountain is stunning, always , kite surfers,. Suffers, wind surfing. And if you're lucky you can watch the seals playing in the surf"
        }, 
        {
            "index": 569, 
            "rating": "2", 
            "review": "Blouberg Beach. Way too many people by far and the South Easter will bury you in fine white sand if you sit in one place for more than 5 minutes - gets in everywhere and is really uncomfortable. Good for the kite-surfers but a pain for the rest of us “normal” folk. The only good thing is the view of Table Mountain. Stay away is my advice, honestly."
        }, 
        {
            "index": 570, 
            "rating": "3", 
            "review": "With Cape Town and Table Mountain as back-drop. Where the pictures of \"Cape Town with towering Table Mountain overhead\" are shot from! Nice beach but oftentimes windy. Great for kitesurfing."
        }, 
        {
            "index": 571, 
            "rating": "5", 
            "review": "Sunny and relazed. Space on the beach, clean and water perfect. There were lots of parking, toilets to visit and vendors to buy food and beverages. It was relaxed and not crowded with too many people. The tide was low and we were able to walk up to the rocks."
        }, 
        {
            "index": 572, 
            "rating": "4", 
            "review": "Splendid views. It goes without saying that you get the best perspective of Table Mountain from this pristine beach and look to your right and you see Robben Island too!"
        }, 
        {
            "index": 573, 
            "rating": "3", 
            "review": "Fantastic view of Table Mountain. The beach is not as well kept as one would like but the view is worth a visit. The sea is cold and although I did not visit the cloakrooms, they looked a little questionable"
        }, 
        {
            "index": 574, 
            "rating": "5", 
            "review": "Just amazing. What a beautiful beach. The views are breathtaking. The people are so friendly, little piece of heaven."
        }, 
        {
            "index": 575, 
            "rating": "5", 
            "review": "BLOUBERGSTRAND UNKNOWN BEST SPOT WHEN IN CAPE TOWN. To have this view, and enjoy being on the beach, the only place to stay is at Pinard on Sea. Absolutely fabulous, little known, Boutique Hotel (literally on the rocks) surrounded by fabulous restaurants like \"On the Rocks\" and \"Ons Huisie\" and moments that can only be created by the Cape of Good Hope."
        }, 
        {
            "index": 576, 
            "rating": "5", 
            "review": "I could die very happy here. As you enter Blouberg you are immediately mesmerised by the kite surfers - takes you a while to figure out that they are actually surfing and flying a kite simultaneously. This is as close to heaven on earth as it gets - the beach is not crowded - obviously cannot swim due to the cold water but the most relaxing beach around. loved it"
        }, 
        {
            "index": 577, 
            "rating": "5", 
            "review": "The best view in the world!. What more can you say! It is the very best few in the world and the closest you can get to Robben Island apart from on a boat. We were there on a clear day and it is such a special place!"
        }, 
        {
            "index": 578, 
            "rating": "4", 
            "review": "Bloubergstrand Beach. Miles of beach with great views of Table Mountain. On a windy day as many as 100 Kite surfers can be seen having fun."
        }, 
        {
            "index": 579, 
            "rating": "3", 
            "review": "Windswept beach. You will love this beach if you are a windsurfer but it's not one where you might swim and sunbathe. However, the natural surroundings make it worth a visit."
        }, 
        {
            "index": 580, 
            "rating": "4", 
            "review": "Plenty to see. Bloubergstrand is a long area of unspoilt beaches facing Table Mountain and Cape Town. The sea is a bit cold and the waves usually quite big but for an evening stroll or just to sit and watch the waves crashing in it is bliss. Take a walk further up to Big Bay and there are plenty of bars and restaurants to sit and watch the surfers and Kite surfers in action."
        }, 
        {
            "index": 581, 
            "rating": "4", 
            "review": "Beach Beauty. Best beach for views of Table Mountain. Great walking beach. Too cold to swim and can get windy. Kite surfers paradise. Many surrounding hotels and food outlets."
        }, 
        {
            "index": 582, 
            "rating": "4", 
            "review": "Love it - but they have to improve some things!. I love the view, the beach - even the ice cold water :-)But it is run done - some toilets are buried in sand, the wooden paths are partly destroyed, the police is busy harassing dog walkers - and seems to occupied to notice the homeless people or take care of people throwing away their rubbish without shame...and I will not even start talking about that wreck...or oilStill - I would rate it \"very good\" - but it could be much more"
        }, 
        {
            "index": 583, 
            "rating": "4", 
            "review": "Beautiful beaches but cold to swim. Feels like paradise - stunning blue waters and white sands, but the water is icy cold to swim in. A must to go check out the area, and the shipwreck."
        }, 
        {
            "index": 584, 
            "rating": "3", 
            "review": "Nice View To cold. to cold to swim . but nice beach. windy but view of table mountain is the best. needs to be more easily accessed"
        }, 
        {
            "index": 585, 
            "rating": "5", 
            "review": "Blouberg. Who cannot include this picturescue place on your itinerary.You get the most beautiful view of Table Mountain from Blouberg.You feel like being in another world and will leave Blouberg with good memories.Eat an ice cream stroll around or sit in your car if the wind makes it impossible to walk on the beach. Toilet facilities disgusting . A must see."
        }, 
        {
            "index": 586, 
            "rating": "5", 
            "review": "Best picture moment. Beautiful popular beach. Chill by the cosy restuarants or pack a picnic basket and enjoy the best view of Table Mountain. Enjoy sundowners by the Blue Peter and watch the breathtaking sunset. Don't miss it! This is your perfect spot for pictures of the mountain which will take a special place in your album."
        }, 
        {
            "index": 587, 
            "rating": "4", 
            "review": "Very Good Family Beach. Great family beach to swim, tan, have a picnic, children can play. Nice Ice cream stands, view of table mountain and Robben Island, and boats."
        }, 
        {
            "index": 588, 
            "rating": "4", 
            "review": "Holiday Beach. Very nice beach and surrounding area. The news cafe in Bloubergstrand area is one of my favorite in South Africa."
        }, 
        {
            "index": 589, 
            "rating": "5", 
            "review": "The spot for photos of table top. You have seen it on post card so here is the spot to take fantastic photos of table moutain, we we went twice sunset and mid morning, local eating places great beach lots of parking and good security"
        }, 
        {
            "index": 590, 
            "rating": "5", 
            "review": "Very nice beach. Enjoyed every minute of our stay on the beach - clean, white sand (looks like one of those exotic beaches that one sees only in magazines), close to all amendities, security."
        }, 
        {
            "index": 591, 
            "rating": "5", 
            "review": "Best view in the Cape. Make sure to visit Blue Peter and watch the sunset from the grass area in front of the pub, while enjoying an Ice cold beverage"
        }, 
        {
            "index": 592, 
            "rating": "1", 
            "review": "windy. the only good thing was the view across the bay of table mountain other than that would not bother to ever go there again. boring. windy as hell. no thank you"
        }, 
        {
            "index": 593, 
            "rating": "4", 
            "review": "A very peaceful, relaxing place. It is a very nice place to relax with family and enjoy the fresh air, there are also really nice restaurantsthere!"
        }, 
        {
            "index": 594, 
            "rating": "4", 
            "review": "Visit to Blouberg Beach. Beautiful clean beach with clean toilet facilities. Clearly a haven for kite surfers and fun to watch. Blouberg is beautiful with the ful view of Table Mountain. Many restaurants and shopping centres all around."
        }, 
        {
            "index": 595, 
            "rating": "4", 
            "review": "Very pretty. A beautiful area of Cape Town with white beaches and a close community. My cousin has lived there for a few years and loves it! We can't wait to go back!"
        }, 
        {
            "index": 596, 
            "rating": "4", 
            "review": "Wonderful view, a great place. Blaauberg Strand has perhaps the best view of Table Mountain. Only Robben Island has any hope of competing as a vantage point. At the outset, let me caution you: Blaauberg Strand is NOT for the casual swimmer. The surf is rough. Also, Cape Town has a cold side and a warm side (sea temperature), and Blaauberg Strand is very definitely on the cold side. You will not swim here, even on the hottest day! But apart from the great views, Blaauberg Strand also offers an expansive beach that is magical to walk along, literally for miles if you wish. There are good restaurants, and just sitting on the bech or walking along it are rewarding in their own right. It is also a mecca for surfers and kiteboarders"
        }, 
        {
            "index": 597, 
            "rating": "5", 
            "review": "Great escape from the city. The miles of beautiful white sand are good for kiters, surfers, swimmers and sun worshipers. Worth a visit when the winds are up just to see the tens of kiters weaving and jumping. I ran along the beach everyday for a week and never tired of the view of Table Mountain. Cafe of choice = Carluccis at the Table View end of the strand."
        }, 
        {
            "index": 598, 
            "rating": "4", 
            "review": "The Classic View. It is beautiful, and surprises visitors that you are looking South instead of North. The only other place you will get as good a view is from Robben Island. Always breathtaking, even when the weather is not at its best."
        }, 
        {
            "index": 599, 
            "rating": "5", 
            "review": "Excellent beach for surfers and just walking along golden sands. Yes can be windy but just wonderful to walk along this beach and to watch the sun down my favorite spot is at Blue Peter !"
        }, 
        {
            "index": 600, 
            "rating": "5", 
            "review": "fresh air and wonderful views. Brilliant white sands, virtually empty beaches stretching miles, and wonderful views of the distant Table Mountain, and city centre.But there was also plenty of fresh air; and the Atlantic winds really blow here."
        }, 
        {
            "index": 601, 
            "rating": "3", 
            "review": "Could Be Called Blowberg. The iconic Table Mountain pics are often taken from Blouberg beach. This place is seriously windy especially in the summer. A popular kite surfing area. But cant compare to the Camps Bay, Clifton even Muizenberg beaches."
        }, 
        {
            "index": 602, 
            "rating": "4", 
            "review": "great vieuw. In Bloubergstrand, you have a very good vieuw on the Table Mountain and ag good restaurant \"Ons Huisie\", they have good lobster."
        }, 
        {
            "index": 603, 
            "rating": "5", 
            "review": "Sundowner excellence. Nothing beats sitting on the lawn with a cold beer, watching the sun sink into the ocean. As you watch the last rays disappear, you can then watch all the locals posing up and down the strip in all sorts of motorised transport from Porsches to heaps of junk!!"
        }, 
        {
            "index": 604, 
            "rating": "5", 
            "review": "Opposite my brothers house. Couldn't miss a visit on the hottest day in September - thirty degrees Clean beach in a nature conservation area"
        }, 
        {
            "index": 605, 
            "rating": "4", 
            "review": "Sunset-tastic. THE place to go for great sunsets towards Table Mountain and Lions Head as the city lights up in front of your eyes. Always worth a quick visit."
        }, 
        {
            "index": 606, 
            "rating": "4", 
            "review": "Great beach. From Kite boarding to ice creams on the beach, this beach is stunning and has access to the beach front were you can get some food have a night out. This is a definate mst see..."
        }, 
        {
            "index": 607, 
            "rating": "5", 
            "review": "beautiful views. beautiful views of cape town. take a nice stroll along the beach and take a picnic basket. loads of sun watching kitesurfers"
        }, 
        {
            "index": 608, 
            "rating": "4", 
            "review": "So beautiful!. This beach has a gorgeous view of the mountains in the city and sports soft, white sand. There's parking against the beach that is easy to catch, and there's a lot of great restaurants near by to grab a bite to eat after relaxing in the sun."
        }, 
        {
            "index": 609, 
            "rating": "4", 
            "review": "Beautiful Beach. Lovely beach with white sand and miles of it too. Kite flying and delis ice creams at The Sea Breeze."
        }, 
        {
            "index": 610, 
            "rating": "4", 
            "review": "Blouberg Beach. It is very beautiful and stunning view of Table Mountain & Robben Island it is good for beach walk the beach is very active with kite surfers"
        }, 
        {
            "index": 611, 
            "rating": "5", 
            "review": "Wow - had to drag her away. We stopped on this beach in several spots on our final day for Driving around the western cape\nI had a hard time getting Sabine back into the car so that we could return it to the Hire company before being penalised...\nCome here with time to spare... it is quite an amazing beach. But do it in the summer."
        }, 
        {
            "index": 612, 
            "rating": "4", 
            "review": "Blue flag status - enough said. One of the most pristine beaches in South Africa. Was awarded blue flag status. Very safe and spectacular views of Table Mountain. Can get very windy as well though. Lots of pubs and restaurants all along the beach road with excellent B&Bs as well."
        }, 
        {
            "index": 613, 
            "rating": "5", 
            "review": "Beautiful views and so much more. Windy and chilly during our stay but the views and excellent restaurants - especially Ons Huise - far outweighed the weather conditions. Clean, super-organised, lovely."
        }, 
        {
            "index": 614, 
            "rating": "5", 
            "review": "Excellent Beach. We loved the clean beach with the beautiful view. We had lunch at Ons Huisie and spent some time sitting on Bloubergstrand Beach chatting with friends that we came to visit."
        }, 
        {
            "index": 615, 
            "rating": "5", 
            "review": "Sundowner Magic!. Sitting at the Blue Peter whilst the sun goes down is an awesome experience. The staff continually clean up glasses and cigarette butts from the grass, there was a live band when we were there on Sunday eve 16th Sept and the vibe was super."
        }, 
        {
            "index": 616, 
            "rating": "3", 
            "review": "Great view, thats about it.. Wonderful view of Table Mountain, but very little to do otherwise. A good restaurant called On the Rocks is worth the visit, and Ons se Huisie for true South African food."
        }, 
        {
            "index": 617, 
            "rating": "4", 
            "review": "Parasurfing paradise. A long, long, long stretch of beautiful white sandy beach. Gets lots of visitors on a sunny day - the sight of all the parasurfers with their multi-coloured 'sails' makes you want to get out there! Great restaurants can be found all along the strip."
        }, 
        {
            "index": 618, 
            "rating": "5", 
            "review": "Best view on Table Mountain. We are lucky enough to live close to this beach and can enjoy the fantastic view on Table Mountain almost everyday. It is a must view during your stay in Cape Town! The beach is very long and never crowded. During the windy summer months, this is also the best spot for Wind- and Kitesurfers."
        }, 
        {
            "index": 619, 
            "rating": "5", 
            "review": "Interesting view. Very interesting panoramic view on Table Moutain and Cape Town, very nice beach with plenty of shells if you like to collect them."
        }, 
        {
            "index": 620, 
            "rating": "4", 
            "review": "Iconic beach with Table Mt backdrop. Iconic beach with Table Mountain as a backdrop, beautiful, clear but cold water, it can get really windy, so choose a calm day, its truly magnificent"
        }, 
        {
            "index": 621, 
            "rating": "5", 
            "review": "The Best Views of Table Mountain. The walks along this beach, especially around sunset are some of the best ever experienced. That's why I live there."
        }, 
        {
            "index": 622, 
            "rating": "4", 
            "review": "A wndy place. A loveley sandy beach with table mountain in her classical pose as a background. As it is the Atlantic expect it to be windy, there are many kite surfers along here and Table View."
        }, 
        {
            "index": 623, 
            "rating": "4", 
            "review": "Stunning place, best view of table mountain.. I love looking across the bay to the mountain. Sometimes it has its table cloth(clouds) and sometimes it is so clear and stunning. One can see all the cargo ships go across the bay. See the city under the mountain. There are a few stunning beaches and lovely restaurants to sit and watch the waves. Love it. Go there regularly."
        }, 
        {
            "index": 624, 
            "rating": "5", 
            "review": "Great Place - Home is where the Heart is. Lots to see and do ... Great pubs ... even when the wind is howling !!\nDoodles the best pub in the area - great vegetarian options on the menu tooooooo..."
        }, 
        {
            "index": 625, 
            "rating": "4", 
            "review": "Post Card views of Table Mountain. Blouberg Beach is a favorite for joggers, walkers and kite surfers who enjoy this long sandy beach. You will get the best view of the Mothercity framed by the iconic Table Mountain. Plenty of free parking."
        }, 
        {
            "index": 626, 
            "rating": "4", 
            "review": "clean and bright. great beach, way to little law enforcement visible, the gays at the end of the beach are just disgusting"
        }, 
        {
            "index": 627, 
            "rating": "4", 
            "review": "Glorious Views of Magnificent Table Mountain. Blouberg beach stretches for miles - lovely white sand and glorious views of the most famous Table Mountain.On a sunny winter's day in Cape Town, it is a superb spot to be to soak up some sun, gaze at the mountain and enjoy breakfasts/lunches or sundowners whilst still gazing at the mountain.There are a number of restaurants in the area, many with sea views.The beach can get windy in summer which makes it a great favourite with kite surfers from all over the world. Watching these kite/wind surfers do their moves while tearing along at speed, makes for an interesting backdrop to the mountain.The sea is cold but most refreshing.Don't miss an outing to Blouberg beach while in Cape Town - it's a world famous view!"
        }, 
        {
            "index": 628, 
            "rating": "5", 
            "review": "Seems very familiar.... Of course...this is the iconic vantage point to take photos of Table Mountain and Cape Town. The beach is pretty windy, but the view is gorgeous! Whilst the area is very residential, there are little coffee shops dotted around, otherwise you could be in Brighton!"
        }, 
        {
            "index": 629, 
            "rating": "4", 
            "review": "Postcard. Lovely, Picture Postcard views. Gets windy and full in season ... but plenty of space and restaurants at Blue Bay"
        }, 
        {
            "index": 630, 
            "rating": "5", 
            "review": "Maybe the world's most beautiful single view. The coast around Cape Town is the most beautiful coast on earth, imho, based on a fair amount of travel! It is more beautiful than the Amalfi coast, and more beautiful than Big Sur in California and I would even say it is more beautiful than the magnificent Garden Route that heads East from Cape Town toward Port Elizabeth. Of every single view along this scenic marvel, Bloubergstrand is probably number 1, and may be the most beautiful single view on earth. A trip to the magnificent 'Mother City' is not complete without a trip to, and picture from, this amazing spot."
        }, 
        {
            "index": 631, 
            "rating": "5", 
            "review": "Just beautiful. The best spot from where to have a magnificent view of Table Mountain with Devil's Peak and Leeukop on both sides - a view not to be missed and cold be found nowhere else in the world - beauty of nature at its best"
        }, 
        {
            "index": 632, 
            "rating": "5", 
            "review": "One of the 7 Wonders of the World!. Hard to find a more beautiful scene! The MOUNTAIN. the white beach, the blue sea, dark rocks..... the med atmosphere...."
        }, 
        {
            "index": 633, 
            "rating": "5", 
            "review": "The views..... ....says it all. And a beautiful beach. If you into water sports, get your kite out and have fun - Restaurants are up and comming but drive further up the coast, to the new watterfront;-)"
        }, 
        {
            "index": 634, 
            "rating": "5", 
            "review": "Magical. Always blown away by the sheer beauty... Great restaurants @ Eden on the Bay."
        }, 
        {
            "index": 635, 
            "rating": "3", 
            "review": "Untidy. the beach needs a clean, there were lots of papers and 'stuff' on the sand which was really upsetting. The area near the Life Guard station was awful, there was horrible brown 'water' flowing into the sea. So sad because these views are unsurpassed."
        }, 
        {
            "index": 636, 
            "rating": "5", 
            "review": "Go for the view. A must do if you want the classic photo for your album back home. Beach surprisingly quiet."
        }, 
        {
            "index": 637, 
            "rating": "4", 
            "review": "great views of Cape Town and Table Mt. wonderful views of the city with the stunning Table mt backdown. Nice beaches and beautiful sunset to view over the water. Enjoy a nice refreshment from the Blue Peter and admire the wonderful views."
        }, 
        {
            "index": 638, 
            "rating": "5", 
            "review": "What a view. This beach offers the classic postcard view of Cape Town and Table Mountain. Great for wind surfing but the water can be chilly at times"
        }, 
        {
            "index": 639, 
            "rating": "2", 
            "review": "Windy. Must be the windiest spot in the cape - Great views of Table mountain"
        }, 
        {
            "index": 640, 
            "rating": "4", 
            "review": "really good particularly if there is little wind. water is cold. Surf, Kiteboarding, SUP mecca. Loads of good food and drinking spots. Carlucci coffee shop is a favourite with the locals, small always packed. Eden on the bay has many good spots to eat and drink. Take in Moyo's on a hot day with tables in a shallow pond"
        }, 
        {
            "index": 641, 
            "rating": "5", 
            "review": "THe very symbol of Cape Town. Is Table Mountain - as viewed from this beach. Can be windy and hot. Worth the effort and great for taking photos of the famous view!!"
        }, 
        {
            "index": 642, 
            "rating": "5", 
            "review": "Primi Night. We went out for a great dinner at primi and for a walk on the beach."
        }, 
        {
            "index": 643, 
            "rating": "5", 
            "review": "Nicest beach. Beautiful soft white sand, clean, and the most activities happening - surfers, kite surfing, etc"
        }, 
        {
            "index": 644, 
            "rating": "1", 
            "review": "West coast is not for me!. Besides the cool view of table mountain, it's wind swept, home to a nuclear power station, stark and the water is freezing! Southern suburb beaches are way better in terms of swimming and beauty."
        }, 
        {
            "index": 645, 
            "rating": "2", 
            "review": "Nice views but a bit dirty. I like the views from Bloubergstrand. The surfing and kite surfing are good, and you can go for long walks on this seemingly endless beach. However, the beach itself is a bit dirty and there are very few showers along the beach. Not really my top choice in Cape Town."
        }, 
        {
            "index": 646, 
            "rating": "4", 
            "review": "Picture Perfect. It is from here that those iconic shots across the water to Cape Town and Table Mountain are taken. Not really any other strong reason to visit. From Cape Town you get to Sunset Beach before Bloubergstrand - the pictures are the same and the beach is better."
        }, 
        {
            "index": 647, 
            "rating": "4", 
            "review": "Kitesurfer's Dream. Pretty beach with lovely views of the mountain. Also perfect spot for kitesurfing."
        }, 
        {
            "index": 648, 
            "rating": "5", 
            "review": "Water very cold. If you are into long walks, then this is for you. You can walk to Table View or Melkbos from here. Visit the Blue Peter for a sundowner. The evenings are great."
        }, 
        {
            "index": 649, 
            "rating": "5", 
            "review": "Long walks with great mountain views. Bloubergstrand is a great place should you want to take long walks on the beach, especially in the late afternoon. The beach offers fantastic views and photographic opportunities of Table Mountain and there are many restaurants and bars nearby."
        }, 
        {
            "index": 650, 
            "rating": "5", 
            "review": "Wow. This is a beautiful unspoiled beach with a huge choice of restaurants close by. Lots ro see and do but perfect just to sit and watch the kite surfers"
        }, 
        {
            "index": 651, 
            "rating": "4", 
            "review": "Picture Postcard. A nice beach, perfect views of table mountain - lots of bars, restuarants along the beachfront!"
        }, 
        {
            "index": 652, 
            "rating": "4", 
            "review": "Stunning view, but hold onto your hat!. The best view of Table Mountain - great for photo's. But the wind really does blow at this beach. Fun if you're a kite-surfer."
        }, 
        {
            "index": 653, 
            "rating": "5", 
            "review": "Amazing View. Blouberg is well woth a visit. You get a stunning view of Table mountain and the sunsets are amazing. It is also very popular with kite surfers."
        }, 
        {
            "index": 654, 
            "rating": "3", 
            "review": "Good view. This gives you the classic view of Table Mountain from across the bay. Good for photographs but better beaches at Camps Bay and nearer to Cape Town."
        }, 
        {
            "index": 655, 
            "rating": "4", 
            "review": "A holiday destination visit for Local Capetonians. What a view you get of Table Mountain! And the long white sand unspoilt beach... It's like going on holiday in your own backyard. Safe, friendly, facilites with a number of famous eating places nearby. A place to chill and have fun, relax or just stroll or run along the beach. Swimming and Kite Surfing big over here. And Robben Island looks like you can pluck it out the sea. The wind can get a bit out of hand..."
        }, 
        {
            "index": 656, 
            "rating": "4", 
            "review": "THE View. Officially the BEST spot to take pics of the most beautiful mountain in the world"
        }, 
        {
            "index": 657, 
            "rating": "5", 
            "review": "Views to die for. Great part of cape town, do not go on a windy day and take your camera."
        }, 
        {
            "index": 658, 
            "rating": "4", 
            "review": "See Table Mountain like on the postcards!. This is a great beach to go to and the views to table mountain can be spectacular. Water is not really swim-able as it is freezing, cut there is nothing more refreshing than jumping into icy cold water and having some body parts turn blue after a bit.... still fun.The thing I dislike the most is the wind.. the constant blowing wind here and in Cape Town generally is what turns a nice day into a day of trying to fighting to keep your eyes open.The locals and others are use to it, it seems and take the opportunity to wind surf and kite surf.The other warning about the beaches in Cape Town is about the sun. The sun can be really intense and it is easy to get sun burnt. This with a howling wind, make you feel like you've been through a dessert blizzard when you get back your hotel.If you wear a Hat, sunscreen, sunglasses, you are all set."
        }, 
        {
            "index": 659, 
            "rating": "5", 
            "review": "Fabulous beach and views. Some great restaurants here, plus a great view back to Table Mountain. Also you can spend many an hour watching the Kite surfers....."
        }, 
        {
            "index": 660, 
            "rating": "4", 
            "review": "Beautiful, perfect. I live in the area. It is magic. Walk here daily. Lovely view of Table Mountain. Beach has many moods, often windy when it is good for wind sports. One must be careful of over zealous law enforcement officers."
        }, 
        {
            "index": 661, 
            "rating": "5", 
            "review": "Fantastic view to Table mountain. Long beach to walk on and have a fantastic view towards Table Mountain"
        }, 
        {
            "index": 662, 
            "rating": "3", 
            "review": "There are better.... Bloubergstrand beach is not bad, but there are definately 'better' beaches in Cape Town, such as Camps Bay, Clifton and Big Bay. Can be a little deserted and unsafe at times."
        }, 
        {
            "index": 663, 
            "rating": "5", 
            "review": "A beach like no other - clean sand.... Excellent tourist destination. A beach that has clean sand, amazing views and a definite place to relax and unwind."
        }, 
        {
            "index": 664, 
            "rating": "4", 
            "review": "Bloubergstrand. Stunning view of the Mountain from a beautiful white beach!"
        }, 
        {
            "index": 665, 
            "rating": "5", 
            "review": "Small Bay is great for the kids with a park for them to play in and the sea is safe and not rough at all ,. loved Eden on the bay, sitting having cocktails and looking at table mountain, and all the kite boarders and surfers surfing. Beauty and View is un comprehendable. Something that you have to experience in your lifetime."
        }, 
        {
            "index": 666, 
            "rating": "4", 
            "review": "Happy Travellers. One of the most amazing beaches in the world with Table Mountain as a backdrop,lots of eating establishments and very safe."
        }, 
        {
            "index": 667, 
            "rating": "5", 
            "review": "Perfect secluded beach facing the beautiful mountain. This is where I live. You walk out of my house and straight onto the beach. It is absolutely divine. Not a lot of tourists and full of locals. Typically you can see surfers, stand up paddlers, kite surfers everywhere.\nAbsolutely stunning and relatively non- commercialised."
        }, 
        {
            "index": 668, 
            "rating": "4", 
            "review": "Windy west coast. The classic view of Table Mluntain is from Bloubergstrand beach about30 minutes drive from Cape Town on the coast road towards Malmesbury. Good place for sunsets and for food, and for kite surfing."
        }, 
        {
            "index": 669, 
            "rating": "4", 
            "review": "very nice beaches. its not to full and you have a feeling of space\nsometimes you need to go in the morning as in the afternoons it gets a bit windy, but i loved it"
        }, 
        {
            "index": 670, 
            "rating": "4", 
            "review": "what a view of Table Bay and the mountain.. There are so many photos and postcards of this beach with our beautiful iconic mountain in the background but you have to visit it in person to fully appreciate it. On a clear day the view out to Robben Island is also good. Although the coastline here is not really good for swimming, there's lots of activity from kites, windsailing, paragliding and of course surfing. It's rarely empty even on the coldest winter days. The sand is lovely and it's very popular with families with small children who have nopt yet got to the \"swimming\" stage. Take a picnic, get there early before the sun gets too strong and enjoy the views."
        }, 
        {
            "index": 671, 
            "rating": "4", 
            "review": "Always a nice cool breeze if it is boiling anywhere else. A wonderful wide, white open beach and you can walk for miles. We usually go there with our dogs and they also love it. After our walks we treat ourselves with a ice cream cone from one of the vendors next to the beach. Divine!"
        }, 
        {
            "index": 672, 
            "rating": "1", 
            "review": "Simply Awful. Dirty, crowded and very poor service at restaurant Zandbar"
        }, 
        {
            "index": 673, 
            "rating": "4", 
            "review": "Stunning views across Table Bay. An excellent opportunity to film or shoot the stunning setting of Cape Town with Table Mountain towering over it."
        }, 
        {
            "index": 674, 
            "rating": "4", 
            "review": "Awesome windy beach. Cold water and windy beach great for kitting. Loved walking on beach"
        }, 
        {
            "index": 675, 
            "rating": "3", 
            "review": "relaxing. relaxing, though go a km or 2 upwards towards big bay, you wont be sorry!"
        }, 
        {
            "index": 676, 
            "rating": "4", 
            "review": "Best view of Table mt.. The best view of Table mt. beach is Ok, lovely community along the beach front with some good restaurants."
        }, 
        {
            "index": 677, 
            "rating": "5", 
            "review": "fascinating if it is not a cloudy day. We had our engagement photo shots along the beach, using the Table Mountain as backdrop.......... this is the best decision we've made. Photos came out beautiful and stunning."
        }, 
        {
            "index": 678, 
            "rating": "5", 
            "review": "Best views of Table Mountain. Like: This beach offers the BEST views of the sea, Table Mountain (and surrounding mountains) and the city of Cape Town. White beaches which are made for walking endless kilometres! A wide range of restaurants in Big Bay, offers dining and other options on the beach - including entertainment for children.\nDislike: the WIND!"
        }, 
        {
            "index": 679, 
            "rating": "5", 
            "review": "The best view of Table Mountain in Cape Town. It's windy and wild, but for the ultimate photo opportunity of Table Mountain, you have to visit Blouberg. It's not particularly touristy especially for foreign visitors, seems to be mostly supported by locals albeit from upcountry like Joburg. A few nice pubs, restaurants making the most of the view, but nothing too sophisticated. So, if you want to see the locals having a good time and to take that perfect pic of Cape Town nestling below the mountain, Blouberg is worth a visit. With the new MyCiti bus service, it's cheap and easy to get to from Cape Town City centre as well."
        }, 
        {
            "index": 680, 
            "rating": "5", 
            "review": "Great place to stay. Excellent public transportation- bused run often, are very inexpensive, safe and clean- to get to the city of Cape Town. The best part- the view from here is post-card perfect! It's the famous view you always see of Table Mountain."
        }, 
        {
            "index": 681, 
            "rating": "4", 
            "review": "Worth a visit for the iconic views. Bloubergstrand beach is about a 20 minute drive north of Cape Town. About three/four miles short of it you come into a very newly built up area with high rise flats and eateries and a huge amount of parking - think it may be called Table View. Here you also get excellent views of Table Mountain - probably just as good as Bloubergstrand.There is adequate parking in Bloubergstrand and its outskirts - plenty of car guards around and R5 is well worth paying. Plenty of seats to take in and admire the famous views across the water to Table Mountain. It is a nice walk along the beach which is obviously very popular with locals. There are a couple of nice restaurants and an ice cream van which does a good trade. I did find the constant hawkers to be a bit annoying but then I suppose it is a tourist spot.Overall it is well worth a visit, if only to actually see the view of Table Mountain that you see on so many postcards and calendars."
        }, 
        {
            "index": 682, 
            "rating": "5", 
            "review": "Miles of beach. Bloubergstrand coveres miles of while sandy beach. The classic view of Table Mountain can be experienced from Bloubergstrand. The beach is used by everybody including kite surfers, families, and dogwalkers."
        }, 
        {
            "index": 683, 
            "rating": "4", 
            "review": "The beach with the view. The view of Table Mountain is fabulous. Good for exciting photography"
        }, 
        {
            "index": 684, 
            "rating": "5", 
            "review": "Wow what a view. the picture postcard of table mountain that is so famous, great places to eat and drink and a fabulous beach to walk on to get rid of all those extra calories."
        }, 
        {
            "index": 685, 
            "rating": "4", 
            "review": "Stunning Views of Table Mountain. Blouberg Beach is not for you if you like crowds and sitting cheek by jowl with the next sunbed. Blouberg Beach stretches for miles and is great for a long walk, some sun-tanning, picture taking or eating at one of the many restaurants right near the beach. There is always plenty of space and the beach is favoured by many local Capetonions.Wind-surfers make an interesting sight when the wind is up and there are great views of Table Mountain for those holiday shots. The beach is worth a visit even during winter as the views of Table Mountain are the best!"
        }, 
        {
            "index": 686, 
            "rating": "2", 
            "review": "Disappointment. Found Bloubergstrand to be very uninviting. The only thing we enjoyed was the iconic view across the bay to Table Mountain. Beach was very crowded."
        }, 
        {
            "index": 687, 
            "rating": "4", 
            "review": "The beach goes on forever. What a fabulous unspoilt beach and a great place to take photos of Cape Town and Table Mountain. Lots of places to stay for a holiday. Would not consider it a must see trip but does add another perspective to the photo collection."
        }, 
        {
            "index": 688, 
            "rating": "4", 
            "review": "Beautiful Beach. Great place to see Table Mountain, sandy beach and very cold water :)"
        }, 
        {
            "index": 689, 
            "rating": "4", 
            "review": "Picture postcard beach walks and Icy water. Views, Views Views - the ultimate picture postcard spot for photos of the fabled mountain from across Table Bay. Water is icy but paddling is bearable!"
        }, 
        {
            "index": 690, 
            "rating": "5", 
            "review": "best view of table mountain,and beach. Loved the rocky beach,majestic view of table mountain there's a little dutch restauant on the beach,and activity watching in Big Bay close by.Ab-sailing,surfing,people watching."
        }, 
        {
            "index": 691, 
            "rating": "5", 
            "review": "Fantastic view, seals and birdlife. Easy access, no parking problems, great view back to Table Mountain and very uncrowded."
        }, 
        {
            "index": 692, 
            "rating": "4", 
            "review": "Great views of the cape. A spot for sun bathing, watching the sun set, watching people, or just to take a few great photos of cape town."
        }, 
        {
            "index": 693, 
            "rating": "5", 
            "review": "Most beautiful beach in Cape Town. Beautiful clean beach with soft white sand and best view of Table Mountain in Cape Town."
        }, 
        {
            "index": 694, 
            "rating": "4", 
            "review": "What a view. The Bloubergstrand Beach is the place to go for a nice view of the table mountain and the \"skyline\" of cape town."
        }, 
        {
            "index": 695, 
            "rating": "3", 
            "review": "Stunning vista, not so good close up. Phenomenal beach, just too much beach & plastic detritus. I think the beach at Hermanus is the much better option if your starting point is Cape Town: Hermanus is worth the extra 30-40mins car ride."
        }, 
        {
            "index": 696, 
            "rating": "5", 
            "review": "Incredible view to Table Mountain. We love this part of Cape Town, because it was first place which we visited many years ago and we come back every time when we visit Cape Town, why? Because its many places for quite watching Table Mountain especially over sunset time! Our favourite place for relax time and quickly lunch/breakfest is Blue Pieter Hotel with outside benches place. Our children love costline beaches."
        }, 
        {
            "index": 697, 
            "rating": "5", 
            "review": "Iconic views of Table Mountain. Whenever I'm in cape Town I love to head here to enjoy the panoramic views , whether it's a walk on the beach at sunrise , sun bathing , a glass of wine at sunset or dinner. There is also a new development called Big Bay which has lots of parking , restaurants (formal indoor and casual beach side ones) and direct access to the beach for walks etc."
        }, 
        {
            "index": 698, 
            "rating": "4", 
            "review": "Beautiful and close enough to watch the waves from your car.. I live in Cape Town and often go to Bloubergstrand or Blouberg. as we call it. Lovely place to park your car in winter to watch the waves break on the rocks while you sip coffee or have a take away in your car . If you want to brave the cold strong wind in Winter you may prefer a walk along the foot path with the dog. Bring a jacket and a cap to cover your ears from the cold on your walk. Lovely in Summer to play in the rock pools and on the beach. Place to walk through to the ocean to the rocks when the tide is low and the 2 side of the ocean move apart - but always watch the tide so you not stranded on the rocks at high tide. Many little coffee shops , eateries off the beach to come and have breakfast while watching the sea even the Blue Peter Hotel close buy where you can sit on the grass and have a sun downer on a hot summers evening overlooking the sea & Table Mountain in the distance. Wind does blow quite a bit, hens the name Blouberg- sand can sting if you are on the beach -lovely in Summer to cool down. Bring your fish and have a braai ( barbecue ) at the beach."
        }, 
        {
            "index": 699, 
            "rating": "5", 
            "review": "Best view in the world !. Bloubergstrand (Afrikaans for Blue Mountain Beach) is the best place from where to see and photograph Table Mountain and its attendant peaks with the city of Cape Town reduced to toy town status below the mountains. An unforgettable panorama!This area is only about 20 minutes from central Cape Town on the other side of Table Bay and is reached by an excellent road.Also some interesting restaurants here .But remember this beach is not for swimming - water too cold!"
        }, 
        {
            "index": 700, 
            "rating": "5", 
            "review": "World Class Views, Stunning Beach. This is a beach that you just HAVE to visit. The sands are white and clean and the classic view of Table Mountain across the waters must be the most photographed view in South Africa. You will most certainly earn bragging rights by getting a photograph of yourself on Bloubergstrand Beach with Table Mountain in the background! People go there for 3 things - the views, the sunbathing and the water sports. The waters are cold (you have to go in with a wetsuit) but this does not seem to stop the hordes of adrenalin junkies getting into the water and doing their thing - it is apparently one of the top spots in the world for kiteboarding.The amenities are good - lots of showers and grass to lie on. There is a little tuckshop at Big Bay which sells enough to keep you at the beach if you get peckish, and the beach is patrolled by lifeguards. There is a lot of development on the go to upgrade the facilities so I can only imagine it getting better.The restaurants and b&b's in the area are also very good and all-round it is a wonderful location to spend a few days.Well worth a visit."
        }
    ]
}