{
    "category": "Cusco", 
    "entity": "Faces-of-Cusco", 
    "avg_rating_stars": 4.979020979020979, 
    "review_count": 143, 
    "rating_stats": {
        "poor": 0, 
        "average": 0, 
        "terrible": 0, 
        "very_good": 3, 
        "excellent": 140
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "It's so much more than Chocolate!!!!!!!!! You HAVE TO DO THIS!!. After a week long trip of Hiking Sacred Valley and Machu Picchu we ended our Trip with a few days in Cusco. With so many tours to choose from we came upon The Faces of Cusco. Our Concierge in our Hotel (Palacio del Inka) highly reccomended this Tour. So let me tell you........Look no further, this \"One Tour\" highlights exactly what is needed, and then some! You start your tour at a unique location right in the heart of Cusco City. Surrounded by Cathedral's, Musuem's and shopping with beautiful fountains and village squares. Vinay and Rivka greet you as you walk in, and tables are set up for Painting and making Chocolates. You immediately say to yourself, hmmm ok some down time, good drinks nice conversation ... all true until Rivka breaks out the Local Music Instruments and before you know it - you are standing on a stage and creating music like you are a Rock Star! Rivka's knowledge of the area and the history immediately transforms you into one of the locals and you find yourself excited for the next step of the tour. It truly is a unique experience, after a fantastic time... Kevin appears with his soon to be Protege from Texas \"Vanessa\", and they both take our group out and about in town. The team spent months perfecting the tour, visiting people and places that would make it what it is today. Make it - exactly what tourists need and want, everything was interesting no down time dragged out. Quick Tour of the City and a 1/2 day at the Market. You will see local items, none of the tourist trap gifts. You will learn their food, their traditions and their customs. The local vendors take the time to show you anything you have an interest in... Chocolate, Coffee, Cheese, Potatoe's, Ceramics it's amazing with a story for each. It truly is the perfect day and beleive me when you are done with the tour you will feel comfortable enough to do it yourself the next day ! Cusco is a GREAT CITY! and a must on a trip to Peru! Vinay, Rivka, Kevin & Vanessa make the perfect team for your perfect trip, which will be unforgettable."
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "Made us feel at home in Cusco . What a great experience!! Vinay, the owner of Faces of Cusco, and his team, Rivka, Vanessa, etc. have created a unique experience for those visiting Cusco. We were recommended, by our concierge Carlos at Palacio Del Inka, to try a tour of the local San Pedro market and meet the vendors selling their wares. We spoke with the various people selling their fruits, vegetables, breads, etc. and we were able to learn more about their culture and traditions than in any other setting. Although it is hard to escape the \"Turista\" experience in Cusco, Faces of Cusco definitely aims to go beyond and establish relationships with the locals, and it shows. Apart from Machu Picchu, this was the highlight of our trip.We were so impressed by the Mercado tour we asked about other events provided by FoC. They offer a number of different events (chocolate making, wine pairing, etc.) but we decided on the Pisco making event. So much fun! Vinay made us feel like we were hanging out at his home (with the giant map) and we learned so much about Pisco and how to make different drinks. A \"must do\" event if you like learning about local flavors and history in a fun, participative environment."
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "Great night with such great company. This place was so much fun! We were the only one booked for the night so it was a private and intimate class. Vinny and Rivka was so professional, fun, energetic, and just all around fun. Not only did we do our chocolate, did wine tasting, but we also talked about anything and everything. After touring throughout the week of September 6-8 in Cusco, it was a change of pace to do something local. I cannot rave enough about this place and how much fun we had. When in Cusco, please add this excursion to your iteniary! You will not disappoint."
        }, 
        {
            "index": 4, 
            "rating": "5", 
            "review": "Perfect for family. After an adventure filled Machu Picchu trip and a little r&r with family in Cusco to unwind....this was a perfect activity for our family! We have 2 boys (8 / 10) and they loved this (we did too!).....made chocolates and painted souvenirs. Really well run business and highly recommend!"
        }, 
        {
            "index": 5, 
            "rating": "5", 
            "review": "Great day in the market!. Amazing service for our market tour. Vinay was knowledgeable and helpful during our day. We were in a very small group and felt like we got first-class service! I would highly recommend this tour. If you can, make this your first stop in Cusco!"
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "Fun and interesting tour. Had a great time touring San Pedro market as well as learning many facts of Cusco and the Inca empire. As it is a small group tour there is a lot of flexibility and you can ask questions about any topic. San Pedro market was fun as we learnt about some of the souvenirs and their history to the food. Got to sample a lot of the food as part of the tour.Vijay, our guide, was very entertaining and gave a lot of great advise as well."
        }, 
        {
            "index": 7, 
            "rating": "5", 
            "review": "Wonderful tour!. The San Pedro market tour was excellent! The guide was super friendly and knowledgeable. I wasn't pressured into buying anything and thoroughly enjoyed the experience. This would be great for families, groups of friends or solo trips."
        }, 
        {
            "index": 8, 
            "rating": "5", 
            "review": "Market Tour - Best Tour in Cusco. I did the market tour with Vinay and Noelia and it was hands down the best tour I've experienced in Cusco and arguably one of the best tours I've ever had. Vinay and Noelia were incredibly knowledgeable about the city and Incan culture. It was a pleasure chatting with them about everything from Incan society to their daily lives in Cusco. It felt less like a tour and more like friends hanging out. The tour was split to be about a quarter city tour and three quarters market tour.The market tour was amazing. Vinay and Noelia personally knew all the best venders and we got to sample the best of the market. Not wanting to spoil anything I will just say that all the food we sampled was simply delightful and there were so many new tastes I have not experienced before. Furthermore Vinay and Noelia directed us to venders that sold their wares at prices way below any my girlfriend and I have seen in the city.They ended the tour by recommending a few food places that they really enjoyed. We only had time to go to two of them but both were so delicious and easily the best meals we've had in Cusco.In short, I cannot say enough good things about this tour. It blew us away and I highly recommend it for anyone who comes to Cusco."
        }, 
        {
            "index": 9, 
            "rating": "5", 
            "review": "Such a fun experience and you feel like family. I did the chocolate and ceramic painting class. Ivana and Noelia were so friendly and not only did I enjoy the chocolate making and ceramic painting, but I enjoyed becoming friends with the staff. They gave great restaurant suggestions and just made it a great experience. If you want to have a great time, get connected to Cusco and make your own souvenirs then go to Faces of Cusco"
        }, 
        {
            "index": 10, 
            "rating": "5", 
            "review": "Hilight of my trip. This was hands down my favorite part of Peru so far. Vinay spent almost three hours walking us through the San Pedro Market and also gave great background on the history and culture of Cusco and the Incans. He was extremely accommodating and told us that this tour was ours and he went above and beyond in insuring that we had an awesome time. Loved sampling the different fruits, cheeses, and chocolates, and it was obvious that he and the Faces of Cusco team have developed great relationships with the vendors. I know they also offer some other programs such as an introduction to Peruvian wines, painting your own local crafts, and chocolate making. Wish I had more days in Cusco so that I could do those too!"
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "Amazing Tour, Support the Locals. We had an amazing time with Faces of Cusco! Our tour guides Vinay and Ritka (Spelling?) were super awesome. While we were touring the market we loved that our tour guides had real conversations with the vendors. You could really tell that Faces of Cusco has established great relationships with the local people and that they really care about the people we were introduced to. We saw some other tour guides that just walked their clients through the market pointing out various things, but we actually stopped and chatted and had the significance of various wares and foods explained to us. While walking around the city they gave great tips on which places were good to eat at or shop at and made us feel very well taken care of. Faces of Cusco is highly, highly recommended - the best way to spend a few hours in Cusco!!!"
        }, 
        {
            "index": 12, 
            "rating": "5", 
            "review": "Love this place!. Amazing energy and interesting programs. I visited for the music one and would have done more if I had the time."
        }, 
        {
            "index": 13, 
            "rating": "5", 
            "review": "Best Market Tour & the Chocolate workshop was excellent too!. I had planned to do a chocolate workshop at the ChocoMuseo until I saw the Tripadvisor listing for Faces of Cusco. Why just make chocolate, when you can make cocolate while sipping an adult beverage!We made eight chocolates with our choice of a variety of fillings, milk chocolate and dark chocolate. While our chocolates were hardening we painted the typical ceramic bulls. I chose to sip a glass of wine, but other beverages were available including the non-alcoholic variety. This was a fun, relaxing way to spend a couple of ours (or 90 minutes, I don't recall exactly). The experience of making these items that many visitors purchase, gave me a greater appreciation for the artisans who create the handicrafts available in the shops and on the streets. This workshop would be fun and appropriate for children as well as adults.This workshop was of such excellent quality that I decided to take the Market Tour with them instead of simply visiting on my own. This was one of the best decisions I made in Cusco. The Faces of Cusco have done their homework. They knew many of the vendors and had developed a relationship with them that allowed us the opportunity to take photos at each stall we visited. We had two guides; one to guide us through the market and explain everything that we saw and one to help us take better photos. We also had the chance to sample some of the fresh fruits and vegetables that were new to us, as well as a few other goodies. These samples were included in the tour (no additional cost to us) and the vendors were paid directly. I appreciate giving business to the local population.I have been a Tour Director/Guide for twenty years, and Faces of Cusco is one of the best tour experiences I have ever had. I can't recommend them highly enough. If I am ever back in Cusco, I will look to see if they are offering a tour or class that fits into my schedule. They provide an excellent experience for a reasonable price."
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "Don't give this place a miss. We arrived here in the morning after seeing the good reviews on Trip Advisor. We were told we had to book in advance online for the afternoon class. We went on their website and had difficulties therefore emailed them, they responded right away and offered us a discount for the difficulties we were having. When we arrived the staff were very nice and informed us about the history of the chocolates which was interesting and you could tell they had a passion for what they were doing. We were given the choice of many beers and wines they had after we had made our chocolates and they even went further to reccomend bars for us to visit in Cusco which was a massive help for us. The decor was incredible and quirky and we felt very cosy here, if you have the opportunity to go here don't pass it. Highly reccomended, thanks for the fun evening and incredible tasting chocolates guys!"
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "Amazing Market Tour and so much more.. My boyfriend and I chose the market tour in the hope of getting a taste of the local culture before setting off on the Inca Trail. Everyone at Faces of Cusco were so friendly and professional. We had the lovely Vinnay showing us around and because we weren't in a hurry he showed us round the local area and gave us a bit of a history lesson too! The market was great and we had fun meeting some of the locals and buying souvenirs. Vinnay even suggested some great places to eat and get some last minute walking kit we'd forgotten. He gets on so well with everyone and has such a vast knowledge of the area and the people, it's lovely to experience."
        }, 
        {
            "index": 16, 
            "rating": "5", 
            "review": "Chocolate making & clay model painting. Found by my twelve-year-old on Tripadvisor, we enjoyed both the chocolate-making and painting fun and rewarding as we ended up with home-made souvenirs to bring home. Great job, FoC!"
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "This was our first thing we did in Cusco and it was worth it. . Vinay was our guide for the market tour, emailing for a reservation was easy and their location was easy to find. He gave us some pretty valuable advice about adjusting to the altitude, don't eat anything for a couple of hours before you land drink tons of water and stay away from alcohol for the first day or two. My friends and I were the only ones on the tour so Vinay switched things up a little. He showed us around Cusco a little before we went to the market, once we got there it was very evident that he was well liked and knew what he was doing. Overall it was an amazing first experience in Cusco, we learned a lot about the city and he gave us tons of great advice including some restaurants to check out during our stay. We even went back the next day to watch a soccer game! I would highly recommend them for a tour."
        }, 
        {
            "index": 18, 
            "rating": "5", 
            "review": "Tons of fun!. We did the Incan Indulgence class which involved us making chocolates and then painting pottery while sipping on wine. Our host was Ivana was great. She was very knowledgeable and was eager to make sure we had an amazing time. She basically scolded us for not making enough of a mess while creating our chocolates, haha. While our chocolates were hardening in the refrigerator we moved on to painting pottery. It had been about 25 years since two of us had painted like that but it was a blast. Our 13 year old managed to paint three different pieces! It was a really fun way to spend a couple hours. Highly recommended!"
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "Market Tour. What can I say the market tour was informative and fun. Vinay was a great host and guide introducing us to numerous market owners and no pressure to buy. Lots of tasting at the stalls cheese, chocolate, bread, fruits and produces - what not to like and it was a great introduction to Peruvian life and how the locals make a living. Vinay was extremely hospitable and friendly and had a great rapport with the stall owners I would have no hesitation in recommending Faces of Cusco had a fantastic morning with them. Vinay was also super helpful in advising us how we could locate our lost luggage and even offered to go to the airport with us he was awesome."
        }, 
        {
            "index": 20, 
            "rating": "4", 
            "review": "Thank you!. Thank you, thank you. I have the best walking tour ever around Cusco city. I am so glad that I went."
        }, 
        {
            "index": 21, 
            "rating": "5", 
            "review": "SO MUCH FUN!. We did the market tour of Cusco which included so much of the city also! We were met by our guide Vinay, who we had all to ourselves and was SOOOOO informative about Cusco and Peruvian history, food and folklore.Faces of Cusco have set up friendly bonds with locals inside and outside the markets so we had the chance to hear stories from the locals and buy locally made chocolate/coffee/bread/gifts but did not at any point feel hassled to make any purchases. The tour lasted a good couple of hours which was a great amount of time. I would recommend this to anyone."
        }, 
        {
            "index": 22, 
            "rating": "5", 
            "review": "Not the typical \"tourist tour\". I did the food market tour and it was 5 stars! Vyned our guide started by talking a bit about the incas, then led us to the market where he seems to know pretty much everyone. We tried a lot of different stalls - chocolate, cheese, coffee, fruits, super foods, bread,... And i can honestly say it was all delicious. Having someone talking about all these typical produces and knowing where to try them makes a great difference. Apart from the tour itself, we also got some great tips about where to eat/what to see/where to go in the city. Didnt feel like i was in a \"tourist tour\" at all. Would most definitely recommend this company to everyone in Cusco!"
        }, 
        {
            "index": 23, 
            "rating": "5", 
            "review": "Great way to learn about Cusco. We are so glad we tried out Faces of Cusco. We started with the Pisco class and it was just the two of us. You get to make 5 or so drinks and Kevin and Brian are great! We definitely left there feeling the effects of pisco, but the class was both fun and informative. The next day we took the market tour with Vinay and he was great. He showed us around the market and you can tell he's put a lot of time in to meet the sellers and they like him. He also knows their families and life story which is neat to learn about. He also gave us great recommendations of what else to do in Cusco and where to eat (or not eat!)"
        }, 
        {
            "index": 24, 
            "rating": "5", 
            "review": "Must do. The comments on here speak for themselves, obviously this is a super awesome company.I wanted to give a specific shoutout to the market tour. If you are debating which class to take, this one in particular is a really great way to better understand Cusco culture (and great for photography as well. That was what attracted me to that particular class initially)It goes without saying that the staff is awesome and you are in good hands. Ps: Vinnay thanks for helping plan our trip, we had fun visiting your favorite restaurants and tours."
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "Great experience!. We stopped by Faces of Cusco on a recommendation from our Inca Trail trek guide. We were looking for a place to watch the Barcelona/Madrid soccer game, and our guide said they put sporting events on a big projection tv. We knocked on the door before they were officially open, and were greeted with smiles and welcomes in perfect Spanish and English. They hadn't plan to air the soccer game, but since they didn't have a chocolate class booked that day, they switched gears and put it on! A good sized group of travelers from all over the world showed up, and they served great drinks and food from the restaurant next door. I had a few \"chilcanos,\" which the owner recommended as a locals pisco-based drink, and they were fantastic. While we didn't do a class with Faces of Cusco, I can confidently recommend them because of our experience with the friendly atmosphere and willingness to accommmodate!"
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "an incredible experience and resource in Cusco. Connecting with the people at Faces of Cusco was one of the best things that happened on my trip. I did their San Pedro market tour and loved it. It was super informative and also just plain fun. Our guide was extremely knowledgeable. He showed us the best vendors and got us samples of chocolate, cheese and a few different exotic fruit. The market would have been way too overwhelming any other way. In addition, whether you are going to be in Cusco for a week or three months, connecting with the people at Faces of Cusco is a great idea. They gave us some cultural tips, and wonderful recommendations for things to do/see/eat while we were there. HIGHLY RECOMMEND."
        }, 
        {
            "index": 27, 
            "rating": "5", 
            "review": "Everything I could've hoped for. My friend and I decided to do the Chocolate, wine and painting class and we were not disappointed. The recommendations on trip advisor did not lead us astray. Vinay was very welcoming and helped us enjoy the class and learn more about hot spots in cusco and Lima. Had we decided to take this class earlier in out trip, we definitely would've taken another class!"
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "Nicest people, best recommendations, and an awesome market visit. We stopped in here on our first day in Cusco because of others recommendations. I didn't really know what to expect, but they were SO nice. I felt like it was an entirely free travel agency. They totally understood what we were looking for and gave us some excellent recommendations of things to do and places to eat. Also, we ended up taking a market tour with them and we returned to San Pedro several times after that and got to see people we met and talked to during the tour. While it is not necessarily a Peruvian cultural experience, I would definitely recommend stopping in here and meeting some cool people while you're in the Plaza de Armas"
        }, 
        {
            "index": 29, 
            "rating": "5", 
            "review": "it was very funny. i saw the different masks and artifacts there and i can attest they are well made and looks great at your living room back home."
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Fun for the whole family and a nice break after days of hiking!. My husband and I took our six year old daughter to the chocolate making/painting class and we all had a blast! My daughter loved creating and eating the chocolates and it was nice to sit and relax in this welcoming environment. Kevin and David were gracious hosts, even helping with recommendations to local restuarants. We enjoyed the class so much my husband and I went back the next day for the cocktail making class with a few friends. If you're looking for a relaxing couple of hours and the opportunity to meet new people, Faces of Cusco is your place!"
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "There is no better way to spent a day in Cuzco . Faces of Cuzco offers everything a lazy chocolate lover like me needs for a successful day. Also if you hiked like every mountain around, a day for relaxing with Faces of Cuzco is never a bad idea. We, 2 students from Germany, spent the day with a family from the US. The team of Faces of Cuzco, Kevin and David, knew how to create a good atmosphere and how to deal with every age. It was a fantastic mixture out of creativity, chocolate and culture (hey, we painted a Tumi, isn't that culture?;)) Faces of Cuzco offers a wide range of experiences. Ours was the 'indulgence: chocolate, wine & painting!'. The next time we're in Cuzco, we'll definitely spend another day with faces of Cuzco. Thank you for the great experience!"
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "Unique family outing. So glad we scheduled this chocolate and painting tour! Such a fun and different thing to do in the midst of usual sacred valley adventures. Everything about the event was unique- the fun building with its cool decor and fun sayings, the hostess/host, delicious chocolate making, and pick ur Peruvian ceramic to paint. Tasty take away treats and souvenir paintings. Highlight how welcome we felt by Marta and Kevin too. Really nice getting to know Marta and loved how she gave our kids some extra lovin. Definitely one of highlights of our trip and not to be missed!!!"
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "Loved it.... I was extremely pleased at my experience with the faces of cusco. The team is super welcoming and courteous. .. I learnt how to make chocolates and whilst waiting for the my creation to cool they give you ceramics to paint which I loved doing and I came back with a lovely souvenir. It's a 2 hour experience and worth every minute so make sure you make the time to go"
        }, 
        {
            "index": 34, 
            "rating": "5", 
            "review": "Our Favourite Afternoon in Cusco!. My boyfriend and I took the chocolate making and painting class with Vinay this afternoon. The class was fantastic! We made delicious chocolates packed with all kinds of different yummy things, tried Peruvian craft beer, and painted traditional bulls. We were able to go at our own pace and everything was easy, well-organized and professional. Vinay's hospitality was absolutely fantastic! Not only did we enjoy the class, but we also got excellent tips about where to eat and what to do for the rest of our stay. I would highly recommend this to anyone who has a couple of hours in Cusco!"
        }, 
        {
            "index": 35, 
            "rating": "4", 
            "review": "Awesome Chocolate Making and Bull Painting. went here for a 2pm chocolate making and bull painting session. vinay was our host and he did a wonderful job of teaching how to make peruvian chocolates and how to paint the bulls. he also gave us 1 free alcholic drink while we completed the activities and also gave us a huge free slice of cake. vinay also gave us some dinner and gelato suggestions too! if you are in cusco, definitely take time to do this activity!"
        }, 
        {
            "index": 36, 
            "rating": "5", 
            "review": "So great we went twice!. My wife and I had a phenomenal experience with Faces of Cusco throughout our visit in Cusco. We had emailed Vinny beforehand to discuss class options because they didn't have a \"double class\" option with the two classes we liked most. He was incredibly responsive and so helpful! He even offered to meet up with us to help us learn more about the city of Cusco which was very comforting and appreciated. We ended up participating in two classes- the chocolate making class and the cocktail class. Both were 100% worth it! If we had more time I would take a class with Faces everyday in Cusco. Our chocolate class was with Ivana (unsure of the spelling of her name, so sorry!) She was so kind and even hand drew us a map to guide us to our next place. She had a great extensive knowledge of the restaurants around town and was able to easily give us several good vegetarian options. The class itself was perfect- we were greeted with plenty of drink options- both alcoholic and non-alcoholic. A perfect small size that gave us plenty of opportunity to get to know our other classmates. One of the best qualities about Faces of Cusco is that they make you feel like family. They had gotten wind that we were on our Honeymoon and gave us a small gift at the end of class and organized a great surprise for our cocktail class! So thoughtful! For the cocktail class Kevin was our teacher. Kevin was a phenomenal cocktail teacher!! It was a perfect combination of him teaching us the basics and then letting us guide it with our favorite drinks. The class was completely hands on as well- we were behind the bar doing everything ourselves! We had so much fun. This class is definitely one not to miss in Cusco. Both of our class teachers even offered to take pictures of us throughout the experience so we could focus on having fun. Thank you Faces for such a warm welcome to your home!"
        }, 
        {
            "index": 37, 
            "rating": "5", 
            "review": "Reviewing a super bowl viewing. I stopped by this place with a friend to catch a Super Bowl viewing. The staff were super nice and great hosts for the event. They have a bunch of local craft beers. They are a bit pricey but they are good.Next door, the restaurant even popped some popcorn for us. It was a welcoming environment to enjoy some Americana. Thanks, Faces of Cusco!"
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "WONDERFUL EXPERIENCE. This adorable restaurant and bar have so much to offer. Not only are the food, drinks and activities outstanding but the ambiance and staff are superb. We had so much fun painting bulls, drinking tea and relaxing as we adjusted to the high altitude before setting off for Machu Picchu the next day. The staff were unbelievably courteous, kind and helpful. Constantly we were told to \"make ourselves at home,\" and to \"feel right at home,\" and we did. This was where we learned what other places to explore through the wonderful staff. Overall it was an amazing experience and our trip would not have been the same had we not stumbled into this place, highly recommended!"
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "Great ale tasting session!. We dropped by here on our last day in Cusco after reading positive reviews on trip advisor and were able to have an ale tasting session. The owner was very welcoming and knowledgable and we were very grateful that he was able to accommodate us at short notice. A great place to visit and lovely people!"
        }, 
        {
            "index": 40, 
            "rating": "5", 
            "review": "Vinay the best bar owner in the WORLD!. I went here on Superbowl Sunday to watch the game and Vinay made everyone feel like they were at their own local bar. His level of service was literally second to none, knowing when people wanted a drink but without bothering them was like a sixth sense, and making sure everyone felt involved in the festivities.A 100% must if you go to Cusco"
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "Expats know their stuff. We met Vinay on our second day in Cusco and he warmly welcomed us in and told us of many many things to see and do in Cusco. He kindly offered to show us around town the following day and showed us some great shops and restaurants. We have been back to Faces of Cusco several times for their awesome beer selection and excellent live music scene. They also offer chocolate making and art classes during the week. A friendly and welcoming environment. Highly recommended. Between thw McDonald's and KFC on Plaza dw Armas. Look for a small 'Faces of Cusco' sign above a doorway / staircase."
        }, 
        {
            "index": 42, 
            "rating": "5", 
            "review": "Above and beyond.... If there's one thing you should do when first arriving in Cusco it's go and meet the people at Faces. They offered us invaluable advice and local knowledge about where to go, what to do and how to do it! Thanks to them, we've eaten like kings at their restaurant recommendations and had the best time. This is all before we'd done their Inca Indulgence course which is a very fun couple of hours of painting and chocolate making. Thanks to Vinay and his team."
        }, 
        {
            "index": 43, 
            "rating": "5", 
            "review": "So much fun!. Wow, what a great time! We first met Allende and Vinay when we popped into their shop to book chocolate making. We were kindly invited to join them for lunch, which was wonderful for us! Getting to know them and more about Cusco! That led to a very fun chocolate making and ceramic painting class with Allende and Kevin followed by an evening of fantastic live music and dancing! Yes, their shop gets turned into a very cozy setting much like a big kitchen party. And we all know those are the best!!! Would highly recommend this destination when you visit Cusco!!!!"
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "wonderful afternoon !. My daughter booked this after reading rave reviews and we were not disappointed ! The people who hosted us were very friendly and charming. It was very relaxed, fun making delicious chocolates, painting ceramics and drinking Peruvian beer. We had hoped to go back for an evening event but were too tired & had an early flight the next day sadly.Definitely one of our many highlights of our fabulous trip !!!"
        }, 
        {
            "index": 45, 
            "rating": "5", 
            "review": "Chocolate making was great!. Such lovely hosts and welcoming place to visit. Everyone is so knowledgable on what else to do in Cusco/ Peru and the chocolate making itself was heaps of fun. Great place to buy your pisco if you want to take some home as honest about brand quality and price."
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "Best place to watch NFL games in Cuzco. I had such an enjoyable evening here! My family and I wandered in because we had seen NFL games advertised, and we didn't dare miss our home team's game. Vinay, who I think is the founder, was probably the friendliest guy I've ever met. He got us set up with food from the restaurant for dinner, provided bar snacks for the game, shared his knowledge of the city, and provided helpful tips on how we should spend our next day in Cuzco.The food was great, especially the dessert. I love that we met many other Americans who had also wandered in for the football game, and were able to share our travel stories. I can't say enough how enjoyable this evening was, and I would absolutely return if I ever found myself in Cusco again."
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "Intimate venue, friendly staff.. Staff is very friendly. Local craft beer, music, young and cosmopolitan clientele. My partner and I enjoyed a few drinks and saw some local musicians play and stumbling into this place during a rain storm. I plan to be returning here next time I'm in Cusco."
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "NFL Sundays, Not a museum, but offers chocolate making classes and is a pub with live music at night. THis is one of the coolest places in Cusco. We watched NFL games on Sunday-which is not advertised. The owner Vinay is a huge Bills fan. for some reason tripadvisor misclassified them. During the day they offer chocolate and wine classes and at night has live music and great craft beer. This is a must see place for young people traveling and wanting to connect with others."
        }, 
        {
            "index": 49, 
            "rating": "5", 
            "review": "The nicest and most genuinely helpful group of people. My mom and I were doing some traveling in Peru this past September, including Cusco. I read about Faces of Cusco on TripAdvisor and so we stopped by to see what it was about. Even though they technically weren't open yet, they let us in and talked to us at length about Cusco in general, giving recommendations and tips. They were super helpful without any obligation to take their classes. My mom and I did end up taking 3 of their classes: chocolate making, market tour, and latin libations. All were unique and fun. My favorite was the latin libations class, it was great to learn drink recipes and I'm sure it would be even more fun if you had a small group of friends. Seems like a very chill and welcoming place, with a great group of people who understand what its like to be a traveler and aren't just trying to get your money. Highly recommend!!"
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "I LOVE FACES OF CUSCO!. My boyfriend and I were fortunate enough to take a Chocolate Making, Wine Tasting and Ceramic Places class at Faces of Cusco and we loved every minute. Vinay was beyond helpful, new a ton about the city, the chocolate, wine and history of ceramics. He also had an awesome collection of playlists to choose from. Had we taken this class earlier in our trip we would have definitely gone back and done the San Pedro Market tour. My boyfriend was able to go to FOC on a Sunday to watch a NFL game and was beyond excited about the experience. Good people and good times! You should definitely go!"
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "Great people, excellent programme! A must in Cusco. We spent an excellent night with live music and craft beer at Faces of Cusco. The owner and his team are great guys, all of them are really enjoying what they do."
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "Great place to watch NFL. Went here with a few friends after failing several times to find a good place to watch the Jets/Patriots game. The staff is very welcoming and had several TVs to watch all the games. They also offer a number of cool classes and events each day/night. If your visiting Lima, I highly recommend checking them out"
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "Great way to spend an afternoon. Found this place through trip advisor. Had an afternoon free so we booked the chocolate making afternoon class. It was a small group in total ( 3 of us and 2 others). The atmosphere was relaxed and the hosts were very friendly and helpful. The chocolate making was great fun and then we did some pottery painting. The class was supposed to be 90 minutes in total but our class continued for over 2hours at no extra charge. The cost included a glass of wine too which was a nice accompaniment to the class. Location was good too-on the main square.If you re at a loose end I would definitely recommend this."
        }, 
        {
            "index": 54, 
            "rating": "5", 
            "review": "NFL Sunday Ticket. This place was a find in Cusco where we were looking to enjoy the Patriots game on a Sunday. We had the pleasure of meeting with Vinay who was incredibly attentive and made us feel at home. Highly recommend if your looking for a chill place to hang out and connect with other travelers."
        }, 
        {
            "index": 55, 
            "rating": "5", 
            "review": "Bunch of cool human beings.. Woah. These guys are awesome. I did the photography San Pedro tour with Vinay and Jorge. Man I was bummed out when the tour came to an end, but I'll be joining some of the other activities with em. Highly recommended.Thanks again guys :)"
        }, 
        {
            "index": 56, 
            "rating": "5", 
            "review": "Great to meet other travelers. We had a really great time, and you can tell that the employees really enjoy the activities as well. They have great recommendations on places to eat and other things to do around Peru."
        }, 
        {
            "index": 57, 
            "rating": "5", 
            "review": "Awesome place, space, and people. My brother and I attended the Incan Indulgence event. It was super cool to be able to make tasty chocolates and paint some typical Peruvian clay figurines. Definitely would recommend doing the Faces of Cusco events. Also the recommendation for the restaurant, Panchita, in Lima was spot on. Such great food there! Very pleased with my experience and the cool little figurines and chocolates we got to take home!!!"
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "Missing Home? (or just want to watch NFL?). Great little spot tucked away behind the Baghdad restaurant. Vijay and crew are there to make you feel right at home... Literally. With sports on the screens and always looking to give you a piece of advice. Definitely worth stopping in for a craft beer (and a game)."
        }, 
        {
            "index": 59, 
            "rating": "5", 
            "review": "Great Market tour plus a bonus photography lesson!. This was definitely a two for the price of one tour! Vinay did an amazing job showing us around the San Pedro market, introducing us to the local vendors and giving us insight to the the Peruvian culture as we sampled many of Peru's unique foods. We were accompanied by Jorge who gave us a photography lesson allowing us to get great shots of the market, the best photos of our trip! The great service starts from the minute you contact the company, Vinay helped us book tours in Lima, gave us advice on what to pack for Mach Picchu and gave great restaurant recommendations in Cusco as well as other parts of Peru. I can not recommend this company enough!"
        }, 
        {
            "index": 60, 
            "rating": "5", 
            "review": "Great place to watch the NFL!. On my last day (Sunday) in Cusco, I was searching for a pub that would televise NFL games to kill a few hours while I wait for my flight. I couldn't find any but I came across 'Faces of Cusco' which made me feel right at home. Vinay, the owner, was amazing in making me feel welcome. He was fun, genuine, and knew a lot about the NFL as he is originally from the East Coast. They serve tailgate style food and have three TVs (One large and two medium size TVs) Vinay also made recommendations for me when I arrive in Lima to stay in the international lounge on my layover. Most importantly, he took his time to send me links to the SEAHAWKS coozie that I wanted so badly :) My beer came with a Seahawks coozie as he knew I was from Seattle. That personal touch made me feel right at home!Definitely check out 'Faces of Cusco' on Sunday if you are a fan of the NFL. You won't be disappointed! It is located right in the main plaza center."
        }, 
        {
            "index": 61, 
            "rating": "5", 
            "review": "Incredible. This may be one of the best kept secrets of Cusco. The owner went out of his way, on multiple occasions, to make sure we were having a great time. He is an incredible guy and is so helpful and friendly. Awesome little spot, great music, great people and a night to remember."
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "Incredibly helpful and generous . I wish we walked in here our first day in Cusco. Vinay was so incredibly warm, helpful and generous with advice on Cusco and Lima. I couldn't recommend visiting Faces more, you'll feel so welcome."
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "Friendliest place in the world. On our last day in Cusco, we saw a sign in the square about NFL tail gate so we went upstairs and we were so upset at ourselves that we only discovered this place on our last day there. Vinay is the most selfless, accommodating dude that I have ever met. In a country where terrible service is the norm, Vinay would go the extra mile to help us out. He provided us with free popcorn while we watched the NFL games and awesome chat and insights about the city. We are honestly kicking ourselves because we have never gotten a chance to do his tours or hang out with him more. Thanks Vinay, you're an absolute legend and can't wait to come back and visit you again soon. (Oh and try the food from next door... It's so good!)"
        }, 
        {
            "index": 64, 
            "rating": "5", 
            "review": "Friendliest place on the planet. We stopped in here to watch an NFL night game and stumbled into a group of new friends. Felt so welcomed! Vinay the owner goes out of his way to make you feel a part of everything. Couldn't have had a better time. He gave us travel tips and ideas that we followed up on. If I lived in Cusco, this place would be my regular hangout spot."
        }, 
        {
            "index": 65, 
            "rating": "5", 
            "review": "They are a Great Bar, too!. We didn’t learn about Faces of Cusco i time to enjoy one of their experiences in Cusco, but we did happen to stumble upon their bar/bistro which they had just open a couple nights prior last week. The PaloSanto Project was just doing soundcheck and we got great seats upon being greeted by Vinay, who accommodated our ever possible need. He had so much amazing information about things to do not only in Cisco, but also in Lima, where we were headed the next day. The music, the staff, the atmosphere and the beer were better than any place we had been in Peru the entire week prior. Next time we are there I will definitely be doing one of their experiences, simply because you cannot go wrong with people as wonderful and accommodating as Vinay and staff."
        }, 
        {
            "index": 66, 
            "rating": "5", 
            "review": "Great experience! We loved it. At the beginning I wasn't sure if I want to do this. I read a lot of v. Good reviews and tried to give it a try. I'm so happy that I had actually done it. Lots of fun, get to meet the people and take about your experience and adventure in Peru, and get alt of tips about places to go to and things to do. This is beside that chocolate making was lots of fun and turn out to be great experience specially when it's accompanied with wine sampling :) The painting part was fine, I'm not an artist but I got my self a souvenir from Cuzco. Definitely worth to check if you are in Cusco."
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "BEST THING TO DO IN CUSCO! A MUST!. I hope I can do this place justice in my review. We took the wine, chocolate, and painting class which was fun, different, and creative but this place is so much more than its classes! The people here are outrageously fun and they truly want to show you the best time. You can tell everyone her loves their job. I literally learned more about Peru (and India and Chile, and life) than I did in all of our trip to Peru. Vinay was excellent he gave us detailed maps and extraordinary tips for not only our trip in Cusco but also in Lima. By the end of the night my husband and I considered him a friend (not just because of all the wine haha) Our trip would not have been the same without a trip to Faces of Cusco. GO GO GO!!!"
        }, 
        {
            "index": 68, 
            "rating": "5", 
            "review": "i felt like a kid in a candy store with wine!. I was in Cusco back in June with my boyfriend and a bunch of his family, the hotel we stayed at mentioned faces of cusco so we thought we would check it out. They were very accommodating. When we showed up (a party of 7) they were already setting up for a group they had coming and asked us if we would mind coming back (we thought in a few hours or a day) they asked us to come back in 15 min so they could set up everything for us to be able to join the other party. the candy making was great they have an awesome craft beer selection and paining things made me feel like i was back in ceramics. Not to mention the owner and his friend who was there were both from New York (where we were all from) They were so down to earth and a lot of fun to just hang with after and have some wine and beer. If you are ever in cusco you MUST check this place out! you will not be disappointed i promise!!"
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "Must experience in Cusco!. Where to begin, Vinay and his staff went above and beyond during our travel in Cusco. The market tour was an informative and eye opening experience - so much to see while learning about both photography and the rich culture of Cusco. The staff has wonderful connections and recommendations of things to do and see while not only in Cusco but other parts of Peru as well. Thank you so much to the staff of Faces of Cusco for making our first impressions of Peru unforgettable!"
        }, 
        {
            "index": 70, 
            "rating": "5", 
            "review": "Take these classes! . I took 2 classes (Chocolate making/ceramic painting and cocktail making) and they were both very well thought out and executed. I appreciated the attention to detail. Vinay is super friendly and knowledgeable and made the classes really fun. He was also super caring and always willing to offer extra information/advice. I wasn't sure how to fill some of my extra time in Cusco but Faces was a great option, there should be more companies like this!"
        }, 
        {
            "index": 71, 
            "rating": "5", 
            "review": "Friendly Faces. My fiance & I signed up for the market tour and drinking... err, 'drink making' class during our stay in Cusco. When we got there it felt more like meeting up with old friends than starting another tour. All the staff are relaxed, personable and knowledgable which is exactly what we wanted.We had a few days in Cusco, however the evening we had first chose for the cocktail class their space was rendered unusable due to some delayed renovations beyond their control. It was no big deal to us, as we had experienced much worse, but Vinay went above and beyond to accommodate us the next night at our convenience.Top notch service all around from Giancarlo, Jorge and Vinay. Highly recommend anybody heading to Cusco rendezvous with these guys to get the most out of the city!"
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "Market Tour and Drink Mixing . We were four Americans in town before hiking. We were very glad to have found Faces of Cusco. First, we did the Market Tour. My wife had just bought a new camera, and she was able to receive some great Photography tips from one of the guides as we walked around the Market. After the class, the guys helped us plan the rest of our day. They gave us some restaurant options and other advice, which we appreciated. After we finished the Market Tour, we decided we had so much fun that we should do the Drink Mixing class that evening. Great fun! Definitely worth the money considering we had at least 4 drinks each.The class is very laid back, just like the tour. Everyone from the company was very helpful. Everyone visiting Cusco should do one of the activities with this company early in the trip. You'll have fun and you'll meet some friendly and helpful contacts to get advice for the remainder of your trip."
        }, 
        {
            "index": 73, 
            "rating": "5", 
            "review": "Join them for Sunday USA football too. Great people and good at everything they do. Visited them on Sunday afternoon and were welcomed like we were family. Teamed up with the Bagdad restaurant, which was another high spot. Thanks Faces for being a great Sunday afternoon in Cusco"
        }, 
        {
            "index": 74, 
            "rating": "5", 
            "review": "Cocktails waorkshop is awsome!. Been to Faces if CUSCO a few days ago, the cocktail class was great. You make 5 diffrent cocktails, including one if your own imagination ( spicy mojito is great!) the instructor Kevin was awsome and friendly.I would recommend everybody to go! Great value and great atmosphere.Cheers!"
        }, 
        {
            "index": 75, 
            "rating": "5", 
            "review": "Chocolate and painting super fun!!. We took the chocolate and painting workshop. The guide Ivana was very welcoming and warm, we got to talk a bit and were offered tea infusions.The workshop is very nice, you get to create your own bonbons with a variety of fillings and combinations (peanut butter very salty and yummy).Afterwards we painted some traditional figures of the Inka which really lets you go wild with colors but very gentle with the brush and all along we were served with local handcrafted bevereges ( I got the quinoa beer and my wife tried a white wine). By that time the chocolate hardens and you wrap it in colorful wraps or just eat what you've made.All in all, super fun, great atmosphere, many tips (the colca coffee was great, Thanx!!) And very tasty chocolate. Mucho recommendo"
        }, 
        {
            "index": 76, 
            "rating": "5", 
            "review": "Nothing like Faces of Cusco in the world!. I am going to put this in a bullet format (hopefully it comes through after I hit enter) so it is easier for people to read the main points of my review. To give my review some credibility, I have been to every continent and dozens of countries. I have NEVER encountered someone as nice and genuine as Vinay and the staff at Faces of Cusco in all of my travels.● Vinay single handedly made my family's trip to Cusco, Sacred Valley, and Machu Picchu exponentially better● Before I arrived, Vinay and I talked twice over Skype● Vinay listened to what I wanted● Gave great recommendations● Found great private tours for less than 1/2 of what my hotel was offering for group tours● Provided advice on places to eat, how to deal with altitude sickness, and general customs● My wife, son, and I had tons of fun at the Incan Indulgence event. The chocolate was great, ceramic painting was fun, and my wife enjoyed the wine.The only reason I rated Faces of Cusco a 5 is because I could not rate them higher. I cannot say enough EXCELLENT things about them. This small company has singlehandedly raised the bar on international tourism."
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "AMAZING San Pedro Market Tour!. My husband and I partook in Faces of Cusco’s San Pedro Market Tour on August 31. What a fantastic time! Our guides Vinay and Jorge began by giving us a brief lesson of photography. We’re unfamiliar with the ins and outs of photography, so greatly appreciated the quick lesson. The pointers they provided us really enhanced our photos in both Cusco and along the Inca Trail (which we embarked on the next day). After the quick lesson, we began our tour of San Pedro Market, which was fantastic! We felt as if we had a truly authentic Peruvian experience, and really enjoyed sampling the different foods and meeting some of the local people. Vinay and Jorge didn’t push us to buy anything either, and we really appreciated that. We could tell that they truly wanted us to enjoy Cusco as much as they did! With Vinay and Jorge, we felt as if we were hanging out with old pals. They were hilarious, knowledgeable and their zest for life and Cusco was evident and contagious! The customer service they provided exceeded our expectations. For example, Jorge helped with converting images on my memory card to a different format after the tour concluded while Vinay simultaneously gave us a quick lesson on Pisco. Faces of Cusco truly enhanced our time in Cusco, and I can’t recommend them enough! My only regret is not having enough time in Cusco to participate in some of the other tours they offer!"
        }, 
        {
            "index": 78, 
            "rating": "5", 
            "review": "Great Intro to Cusco. My husband and I booked the Latin Libations cocktail class on our first night in Cusco. (In hindsight, this was probably stupid to do on our first night at a high elevation, but luckily, it didn't bother us!) We arrived to our class and were greeted very warmly by Vinay and Giancarlo. The class was a ton of fun. We met some other travelers, made some great drinks, and really enjoyed ourselves. Vinay was able to give us some very much appreciated tips on where to eat and what to do while we were in Cusco, and helped put our minds at ease about the food. We stayed well past the end of the class learning about the area and enjoying the company. Would definitely recommend scheduling a class while you are in town!"
        }, 
        {
            "index": 79, 
            "rating": "5", 
            "review": "Could not stop laughing...and learning of course. The guys (Jorge and Giancarlo) were very friendly and hysterical. We cracked jokes the entire tour in Mercado San Pedro. But when we weren't being complete fools I did genuinely learn a lot. Everyone we went to see in the Market was self-selected for a reason. They were all very knowledgeable at their trade, friendly, and had beautiful personal stories to share. If you know nothing about photography I would definitely recommend this tour (there a great presentation of the basics led by Jorge). If you know quite a bit/are an expert in photography I would still recommend the tour. You’ll definitely learn a lot more. A great experience overall. Muchas gracias chicos! :)"
        }, 
        {
            "index": 80, 
            "rating": "5", 
            "review": "Chocolate, beer, painting and a warm welcome!. We chose the Andean indulgence class for an afternoon. Staff were super friendly and welcoming, and answered all our questions we had about Cusco. The chocolate was incredible and a lot of fun, and the ceramic painting was great. Thank you so much! Keep it up!"
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "A relaxing, entertaining thing to do w/ kids. We learned about Faces from TA and were begged by our daughters (11 and 13) to do the chocolate and pottery painting class.We were so glad we did! Bryan couldn't have been more welcoming and we enjoyed being off the busy Cusco streets for a few hours in Faces' lovely space.We made yummy chocolates and painted toritos (little bulls) and learned all the best places to eat and shop in Cusco. My husband and I even got a glass of wine!From start to finish, this was a highlight of our time in Cusco,the girls would tell you this was their favorite!"
        }, 
        {
            "index": 82, 
            "rating": "5", 
            "review": "So glad we stopped in!. I can’t say enough about Faces of Cusco! If you’re unfamiliar with Peru and are looking to get the most out of your trip you should absolutely stop in. My boyfriend and I visited Faces on our first day in Cusco and by the time we left we had the rest of our trip planned out. Everyone there has a ton of knowledge about the area and they’re willing to go above and beyond to make your trip exactly what you want it to be. My boyfriend and I did their San Pedro photo tour, their MP information session and attended a ceviche demonstration. All wonderful (I recommend doing the MP information session before you visit).I truly can’t thank Vinay enough for helping us make the best of our trip. It’s absolutely worth it to stop in and say hi, you won’t be disappointed. "
        }, 
        {
            "index": 83, 
            "rating": "5", 
            "review": "Great Bar. I went here with my husband for some drinks and we had a great time, this bar is cool and full of all sorts of people. We had a lot of fun and really enjoyed our company plus they have great drinks!"
        }, 
        {
            "index": 84, 
            "rating": "5", 
            "review": "Excellent- San Pedro photo tour. Faces of cusco, provide a tour within a tour, within a tour. Not only did we get to see and understand the colourful San Perdro market, but Vinay and his team provided us advice on the best places to eat drink and shop. Oh and thrown into that I also got taught how to use my camera- and finally migrate from being a point and press photographer.... Would recommend to anyone looking to get a glimpse into the real Cusco."
        }, 
        {
            "index": 85, 
            "rating": "5", 
            "review": "Photography market tour. Faces of Cusco is more than a tour company -- they are you ally in a foreign city. After a long Skype chat with Vinay while planning my trip, we finally had our market tour. It exceeded our high expectations. Vinay and Jorge were terrific hosts -- like friends showing us their home town. Our kids loved the tour, which was a welcome break from other activities in Cusco. Make a connection with Faces of Cusco when you first arrive -- you won't regret it!"
        }, 
        {
            "index": 86, 
            "rating": "5", 
            "review": "Excellent starting point in Cusco. Drop in for a drink, chat and advice.. My wife and I visited Faces of Cusco for their cocktail night and also 'inca indulgence'. Both were great fun and I wish we had the time to try some of their other sessions. Although the activites alone are recommended the thing that made Faces of Cusco stand out was the friendly staff and their depth of local knowledge. If you drop in during the day when a sessions not running they're more than happy to have a chat and answer any questions you may have; from best places to eat, things to see and how to get there and even more general advice about South America as a whole. No pressure to attend any sessions or sales pitches, just friendly advice. Go soon after you arrive in Cusco and they help you get the most out of your time there!"
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "Great way to pass an evening in Cusco!. My 22 year old son, husband and I took the Cocktail Class in July 2015. Kevin was a great teacher with lots of information regarding the different kinds of Pisco and making drinks. We learned how to make (and drink) Pisco Sours, Mojitos and Chilcano de Pisco. Make sure you eat before you go because you will consume a lot of alcohol!"
        }, 
        {
            "index": 88, 
            "rating": "5", 
            "review": "Book a class as soon as you get to Cusco!. My boyfriend and I had the best day at Faces of Cusco. We took the Inca Indulgence class, which included painted traditional ceramics (whilst learning about their symbolism) and making our own chocolates. The staff were the nicest people EVER, making the whole thing really relaxed and fun, like hanging out with friends. My boyfriend isn't the craft type, but he still loved it, and painted his ceramics in his football team's colours and gobbled all his chocolates in the same day. It was also his birthday the day we took the class and he was surprised with a DELICIOUS chocolate cake with candles on, such a nice touch.The presentation was excellent, and it's such a bargain for what you get for the price. They are also SO knowledgable on places to party, eat and visit in Cusco, so make sure you stop here first to get the insider tips. The cocktail making classes looked like a lot of fun too! Thanks so much guys, we had a wicked day! Maggie & Alex, London (/New Canaan!)"
        }, 
        {
            "index": 89, 
            "rating": "5", 
            "review": "Best thing we did in Cusco. We took the cocktail class and loved it so much we came back the next day to do the market tour and then after our Inca hike to take the chocolate class. This was definitely the best thing we did in Cusco, Vinay and Jorge are so kind and knowledgable about the city. They even went out of their way to take us to find a wrist brace and phone charger at a local market. A must do while acclimatizing in Cusco!"
        }, 
        {
            "index": 90, 
            "rating": "5", 
            "review": "Must do while in Cusco!. Fabulous fun evening of cocktail making. Very well organised and informative. You'll enjoy every moment as we did."
        }, 
        {
            "index": 91, 
            "rating": "5", 
            "review": "Great city. Local people are very friendly and ready to help you.They helped to find a good doctor when it was necessary and good hotel there"
        }, 
        {
            "index": 92, 
            "rating": "5", 
            "review": "Excellent Cocktail Class - Super Nice Business Owners. These guys are great! Vinay and Jorge put on a great cocktail class on our first night in Cusco. We were looking for something fun to do learning the to make a great Pisco Sour and Mojito is certainly fun, plus we just let loose and enjoyed Faces of Cusco's very modern, clean, beautiful studio. What we didn't expect was how helpful Vinay was and how much he went out of his way for us. He is an Ex Pat living in Cusco with great insights. As we got to know him during the cocktail class we mentioned that we had tickets for Machu Picchu but no plan as to how to get there - He ended up helping us with everything! He mapped out a good route for us to explore, helped us locate a driver to hire for the day, translated for us and helped us when we were low on Soles. He went so far above and beyond - he became a friend. Faces of Cusco is super fun, but more than that, it's a business full of authentic guys who really want to make your experience in Peru better. We were so happy we met them and learned to make great Pisco sours in the process!"
        }, 
        {
            "index": 93, 
            "rating": "5", 
            "review": "The friends you haven't met yet in Cusco. My girlfriend and I had a great cocktail class with Vinay and Jorge at Faces of Cusco. The class was very fun but the connection we made with Vinay that night was even better. He was so helpful in suggesting ways to make the next part of our trip a success and bailed us out of a small pickle we were in. If you are looking for a fun, unique tour, try anything offered by Faces of Cusco. If you are looking to make some local friends in Peru, visit Faces of Cusco. If you are looking for some wise advice tailored to your interests, try Faces of Cusco."
        }, 
        {
            "index": 94, 
            "rating": "5", 
            "review": "Fun, interactive and incredibly informative experience!. We stopped in to Faces of Cusco on a whim and we were so glad we did. Vinay and Brian were a wealth of resources on restaurants to eat at, things to do, what to see, etc. in Cusco. Without them, we would have been wandering the city! We signed up for the chocolate making/ceramics painting class and it was so much fun! We also signed up for the cocktail making class but I was unable to attend because I was sick (my friends loved it). HIGHLY recommend stopping in when you're in Cusco to take a class!"
        }, 
        {
            "index": 95, 
            "rating": "5", 
            "review": "Must visit. I stopped by this location a few times during my stay in cusco during a medical mission trip and I'm glad I did. The place makes everyone feel welcome with its great vibe and welcoming staff starting with the owner, Vinay, all the way through. He is very attentive and makes sure you have what you need. The service is very quick and we were thrilled every time we dropped by. They also have classes on making cocktails so it isn't like your typical bar. Highly recommend checking it out and making sure to speak to the owner who knows how to make everyone feel welcome."
        }, 
        {
            "index": 96, 
            "rating": "5", 
            "review": "Faces of Cusco Pisco Class. We had so much fun with these wonderful people. It doesn't matter what class you take with them. They are so kind and fun loving!!"
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "Awesome people, awesome time!. This class was great! We did the chocolate and wine class. The staff was super friendly and accommodating. Our group of seven walked up to their place about 15 minutes before the class was scheduled to start. Looking back, we should’ve planned ahead more and booked the class in advance, especially for such a large group. Despite the last minute notice, the staff merely requested ~15 minutes to set up. The chocolate class was great, with many selections to add to your individual chocolates. The class also included wine or craft beers from Peru. The beers were delicious and they had quite a selection! We then moved on to the arts & crafts portion of the class, which was also fun. Overall, it was a fantastic experience which was made even better by the super friendly and knowledgeable staff. Vinay, the founder of Faces of Cusco is an ex-New Yorker who has spent years traveling around the world, including all over Peru. He had many great tips and advice not only for Cusco but also for Arequipa and Lima, the next places we were visiting. The whole experience was in such a relaxed and friendly environment. Even after we were done we spent quite a while just speaking with Vinay and we never felt pressured to leave. It was as if we were chatting with people we’ve been friends with for years. Our whole group highly recommends Faces of Cusco to anyone visiting Cusco."
        }, 
        {
            "index": 98, 
            "rating": "5", 
            "review": "Good Times. This review is long overdue. During our trip to Cusco, Vinay and his Faces of Cusco staff treated my friends and I like family. Not only did we enjoy an evening of Pisco tasting and cocktail making, we also were supplied with some excellent information about the city, region and country. The suggestions they supplied were awesome and it made our trip through Cusco much more enjoyable. If we ever come back to Cusco, we will definitely stop by for a visit."
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "Must see or do in Cusco!. A unique place where every backpacker should go, when in Cusco. We only had an hour left when we got to know this place, but it sure as hell was one of the places we wished to have lots of time to check out all their services. The staff was so friendly and tried to make you feel at home, every step of the way. Their spritit actually made us feel bad about leaving Cusco without getting to know them more. Or was it the several delicious Pisco shots? We'll never know ;-) If you read this, Vinay, thanks for the experience and explanation about your selection of Pisco's. And if you ever need some Belgian beer, we'd be happy to supply! Kris and Feline"
        }, 
        {
            "index": 100, 
            "rating": "5", 
            "review": "Amazing company with amazing employees!!! MUST DO IN CUSCO!. I travelled to Cusco with a friend in May. We found Faces through TripAdvisor and signed up for wine, chocolate and painting class with Yvana. The class was absolutely amazing and a GREAT way to relax after the Inca Trail. Yvana is so sweet, the chocolate is incredible, and the painting and wine just make the experience perfection!More than that, we were able to meet many of the other employees at Faces and every one of them was incredibly nice and helpful. They would spend hours with us just chatting and giving us helpful tips about Cusco and even for Lima, our next destination. They had no agenda and were truly genuine people who want everyone to have the best possible experience in Peru. I have to give a special shout out to Vinay - he alone was one of our highlights in Peru and I hope you guys get the chance to meet him. Such a nice great guy! We were fortunate enough to spend some time with him in the San Pedro market and I would totally recommend taking the tour with him. They also have an event Friday night for expats that we were able to attend before our inca trail and when we came back. It is really fun and has great drinks with even better company so I would also highly recommend that. All in all, this is truly an amazing company with incredibly nice and awesome people. I would recommend taking the class (or more like classES) that most matches your interests because all of them are great! My friend and I will always miss all the people we met at Faces and will never forget them for making our trip to cusco truly memorable. Thanks guys!!!"
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "Amazing company!. My boyfriend and I travelled to Cusco just two weeks ago, and we're still talking about our experience with Faces of Cusco. We had such a fun cultural experience by signing up for the dance class. It was a big highlight of the trip and Giancarlo was a great teacher! The owner Vinay went above and beyond to make us feel welcome by giving us recommendations for food and activities in the city, preparing us for Machu Picchu by giving us a history lesson, and maintaining communication with us whenever we had questions. After meeting him for only 1 day, he made us feel like old friends. Would 100% recommend to all."
        }, 
        {
            "index": 102, 
            "rating": "5", 
            "review": "One of the highlights of our trip. We had a blast with Faces! Cusco can be a city where tourists feel like a constant target and have to guard against being taken advantage of - Faces is the opposite of that. Everyone is earnest, honest, and helpful, and visiting is like being part of a community. It's clearly a business established for travelers by travelers. They offer classes and outings to fill out the experience of Cusco (like market tours, chocolate making, cocktail mixing, etc.) and go above and beyond to help anyone that comes through their door. Words can't describe how at home I felt and how overwhelmed by kindness I was when the staff literally spent hours giving me recommendations on how to spend our time, where to eat, how much things should cost, etc.We did a market tour and the chocolate making class. We were so impressed with the thoughtfulness that has gone into these activities. For instance with the tour, the guide has literally talked to every stall in the market to ascertain which sellers are the most honest and sincere, and developed ongoing relationships with them. Despite the guide being foreign to Peru, this was a more intimate and satisfying experience than ANY we had with a local or native guide while in the country for a month. These experiences would usually be outside our price range, but in this case, I think it's worth it!"
        }, 
        {
            "index": 103, 
            "rating": "5", 
            "review": "Super nice folks!!!!. We really enjoyed our photo tour of the market and the great help and advice from the Faces of Cusco super friendly team!"
        }, 
        {
            "index": 104, 
            "rating": "5", 
            "review": "The Best Choice in Cusco!. We are SO glad we contacted Faces of Cusco! It made our visit to Cusco infinitely better than it would have been otherwise. We had 3 free days in Cusco after seeing Machu Picchu and before visiting Lake Titicaca and weren't sure how to spend them. On a lark, we sent a WhatsApp message to Faces of Cusco and Vinay answered immediately. He asked if we would like to meet for coffee and go over options. We figured, \"Why not?\". So, we met up at Morena, a cute restaurant/cafe near the main plaza, and Vinay spent about 45 minutes understanding our interests and giving us local recommendations. After learning our interests, he put us in touch with the planetarium in Cusco (which was AMAZING!), and a B&B in the Sacred Valley called Casa de Tres Osos (where we went on a hike, had an amazing home cooked meal, and made wonderful friends!). We saved our last day in Cusco for activities located at Faces of Cusco. We spent the early afternoon at Faces of Cusco learning how to Salsa and the evening learning how to make Latin drinks. We had SO much fun at both classes! We highly recommend contacting Faces of Cusco as soon as you arrive in Cusco, so that you can make the most of your time there. On another note, when there were protests that interfered with transport on our way to and out of Puno, we contacted Vinay and he said that he would help us out if we got stranded in Puno. Luckily, it didn't come to that, but it was so nice to know we had someone local to turn to if we needed a bit of help! Thank you Faces of Cusco, Vinay and the rest of the staff - all of whom were amazing!"
        }, 
        {
            "index": 105, 
            "rating": "5", 
            "review": "It's worth it just to meet the staff. Signed up for the chocolate/painting class when I was looking for something to do in Cusco. Before I ever showed up, the guy who took my phone call told me to call, text or stop by with ANYTHING I might need while in town. The staff is SUPER friendly and helpful, making my solo traveller self feel like I had an instant community to lean on while in town.I LOVED making the chocolates and, since the class wasn't full, I was even able to make extras. The candies were great and the company was even better.Even if you don't take a class here, stop by after 9pm for the best Pisco sour in town!Thanks Vinay!"
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "Wow! Do this!. Great people, had a lot of fun there! We did the chocolate workshop and painting of ceramics. Very great organised! You must do this!"
        }, 
        {
            "index": 107, 
            "rating": "5", 
            "review": "Brilliant find. We had some time to occupy ourselves in Cuzco and looked on Trip Advisor for suggestions and are so pleased we took the choice of going to 'Faces of Cusco'. We walked in off the street and were accommodated by an amazingly friendly team of people. We sat and discussed the options of which there were a number and decided to do a photography workshop using the covered market as source material. After a short briefing on some basic photography we set off for the market. Vinnie & H had several contacts in the market who were happy to talk about their products and gave numerous opportunities for photography that we could not have done had we visited the matrket alone. Vinnie is extremely knowledgable about Cusco and we learned a lot.Our session lasted over two hours and was really great fun and my husband and I felt we had learnt a lot both about photography and local produce and Peruvian food. I'm amazed at how comfortable we felt with two people we had only just met.If we return to Cusco Faces of Cusco would be our first point of contact for ideas and experiences which are not offered by the average 'tour operator'.Thanks Vinnie and team, you were excellent. We wish you the very best of luck for the future. And sorry to H for not being able to spell his name!"
        }, 
        {
            "index": 108, 
            "rating": "5", 
            "review": "\"Su casa, nuestra casa\". Backpackers since few month or weekly travelers, you will be surprise how Vinay and his team will welcome and help you.Not usual to feel that much confortable since the first 5 minin a place. Only to drink there artisanal beer or to get some informations, run for it ! *Unique place, unique team, unique experience*Thanks faces of cusco's Team!"
        }, 
        {
            "index": 109, 
            "rating": "5", 
            "review": "A must-do in Cusco. I had a couple extra days in Cusco after doing the Inca Trail and was very lucky to find Faces of Cusco. Faces is a group of passionate people, led by Vinay Raval, himself a backpacker and an avid student of Cusco's rich culture. Faces offers several activities that will help you to experience the local culture more fully. From a photography class at the local market to a chocolate making class, wine tasting, ceramic painting, a dance class, to and an informal get-together of visitors and ex-pats alike in the evening -- the activities are fun and allow you to meet local people and visitors to the town, hear their stories, and feel enriched by the interaction. Vinay and his team are also one of the best sources of information about the ins and outs of what Cusco has to offer. You want a recommendation? They got it! Just ask them a question, they will help you gladly! I took a photography class with Jorge. Vinay joined on the tour of the market and introduced us to several local growers/vendors. We heard their stories, tried their food, and took plenty of photographs, while Jorge, a professional photographer himself, advised us on how to make the photos look and feel more professional. Faces of Cusco helped to shape my amazing experience in Cusco. A huge thanks to Vinay, Jorge, and the entire team."
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "AMAZING PLACE AND AMAZING EMPLOYEES, made our entire trip to Peru unforgettable. I don't even know where to start talking about how incredible Faces of Cusco was for our visit to Peru. I traveled to Peru for 2.5 weeks with one friend, both of us 25 year old women. We planned to spend 3 days in Cusco prior to doing the inca trail hike, and signed up for the chocolate and wine making class at faces of cusco to treat ourselves after we returned from the hike. (See end of this review for specific discussion of this class).Vinay, the founder of faces of cusco, reached out to us prior to our visit to Peru to offer advice. We skyped with him for over 2 hours and he gave us information on food, things to bring, altitude, safety, things to do, what to see, not just in cusco but also in the other areas of Peru we were visiting. He did this with absolutely no agenda and without pressuring us to purchase any other services from Faces of Cusco. He genuinely wanted us to have the best experience we could in Peru and to provide as much help as possible. After we arrived in Cusco, Vinay offered to meet us to provide more detailed information on our trip. He met us and again gave us a plethora of information about Cusco's history, culture, sights to see and places to eat. He even walked around with us pointing out landmarks and interesting sights on our first day. It was a fantastic orientation to the city. However, his help didn't stop there. My friends suitcase was lost and Vinay even offered to accompany us to the airport to help with Spanish translation to ensure we got her suitcase--which we did with ease thanks to Vinay. Vinay also assisted us in setting up a day tour of the sacred valley sights with absolutely no gain to himself. He put us in touch with a trustworthy local tour company, and helped us build the tour around things that were of interest to us--seeing Incan sites, visiting a small village, and visiting a local brewery (Sacred Valley Brewery) with a driver and guide. The day trip was a fantastic experience and different than most touristy options that are offered. I believe it was based on a tour that Faces of Cusco may be setting up independently in the near future which I would recommend to any traveler. We also attended several of Faces of Cusco casual evening events where you can have drinks, meet other travelers, or even watch sports games. This gave us a safe space to hang out at night and an immediate group of friends in Cusco. We met other employees at Faces of Cusco and each was equally as kind and helpful as Vinay. By the end of our time in Cusco it really felt like we had a family and support network there. It absolutely made the difference in our trip to Peru, it would not have been the same without Faces of Cusco. Now to review the actual class we took at Faces of Cusco:The chocolate and wine class was taught by Yvana and was even better than I expected. You spend the first part of the class making your own chocolates with tons of delicious fillings. Then you drink wine and paint your choice of pottery pieces. It was the perfect relaxing activity for an afternoon, and Yvana was incredibly friendly, fun, and knowledgeable. The chocolates were DELICIOUS, and the pottery made a great souvenir. The wine didn't hurt either. I would absolutely recommend the class as a great way to experience local culture while taking a break from the hectic and tiring aspects of travel. Yvana also gave us extensive recommendations about things to do and see in Lima where we were traveling next. Vinay also gave us an informal version of the San Pedro market tour, which was so fun and informative. He knows so much about local culture, produce, farming, and crafts that it really feel like he is a local himself. He showed us around different booths and told us the history of mask making, chocolate making, potato farming, high altitude coffee, and other foods. I would definitely recommend the market tour if you have any interest in food or culture, as you will learn more from Vinay than I think anyone else in Cusco. It turned what would have been a 10 minute passive visit to the market into an active and fun learning experience along with demonstrations and free samples! We looked closely at things I would have walked right by and barely noticed. He can also fit the tour to your specific interests or desires, for example if you are a chocolate or coffee lover he can spend a lot of time on these topics. If you are traveling to Cusco no matter what your interests are please consider taking a class or tour with Faces of Cusco, it is truly a unique business run by amazing and genuine people who know more than anyone else I met about Peru (yes, even more than some tour guides we had for example on the Inca Trail) and want to help travelers have the best trip possible. I could not have imagined a more helpful, kind group of people and am so glad that we were able to spend time with them in Cusco!"
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "Where everybody knows your name. Faces is a pretty unique place. I've been to the Friday night meet-ups, rather than the workshops, and always had a great time. I always feel so welcomed and immediately at home. Vinay will greet you by name (if you're new this won't take long!) and take your things to put away for you. You can do the sort of things that only happen when you have a community feeling, like sit and play a game, leave your things unattended, change the music yourself or chat to the staff... I also love their attention to detail with things such as beer bottle jackets, free water, beautiful bathroom. The staff go out of their way to make sure you have a good time."
        }, 
        {
            "index": 112, 
            "rating": "5", 
            "review": "Great people!. I took the chocolate making and bull painting class a couple of months ago and had lots of fun. Ivana was our \"instructor\" - very friendly, personable, and had tons of great tips, especially during the painting session. I've also gone several times to their expat and traveler get-together on Friday night, and had a wonderful time meeting both locals and foreigners. The whole team at Faces is incredibly welcoming and kind, and Vinay is easily one of the nicest people in Cusco (or anywhere). He's a complete sweetheart who will help you in any way he can. I highly recommend stopping by Faces of Cusco when you're in town!"
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "Home away from home. I did the chocolate and wine session and loved it! It was so nice to be in an environment that was happy and home-like and the staff treat you like friends. All of them went out of their way with making recommendations and ensuring our time in Peru goes well. If you feel like having a laugh, seeing another side of cusco and being amongst awesome company - I recommend heading along to one of their sessions! A must do in Cusco"
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "Trip highlight. Was recommended to do this by a friend at the hostel we stayed at (Loki). We were so glad we took their advice! This was such an awesome part of our 2 weeks in Cusco. A great alternative to the Chocolate Museum. Walked in on a whim (kinda hard to find because it's not very well known (yet)) and they were able to accommodate us! We took the chocolate making class with painting. Was SO much fun and really relaxing. The music was awesome and the chocolate was so yummy. You get to eat so much! While the chocolates set you get to paint, and enjoy a glass of wine or beer! That was a nice surprise. The people who work there are awesome and made the experience that much better. I cannot recommend it enough!"
        }, 
        {
            "index": 115, 
            "rating": "4", 
            "review": "Fun, chilled out afternoon!. Two female friends and I visited Faces of Cusco for the chocolate and painting workshop. It was lots of fun, we particularly liked the focus on having a laugh rather than producing perfect chocolates and artwork (which was helpful given that a glass of wine is included in the workshop...). We were able to ask loads of questions about Cusco and came away having had a lovely afternoon and feeling very full of sweets and chocolates. Only negative was we wanted to stay longer...!"
        }, 
        {
            "index": 116, 
            "rating": "5", 
            "review": "A great way to spend the day. We decided to do the chocolate making and pottery painting workshop and had such a good time that we had to come back later that night to do the bartending class. I was sick at the time(unrelated to chocolate and pottery) but still had a great time. Vinay is a great guy to talk to if you have any questions about cusco. I would recommend that anyone spending any time in cusco should check out atleast one work shop."
        }, 
        {
            "index": 117, 
            "rating": "5", 
            "review": "Must do if visiting Cusco!. I was lucky enough to work with Vinay (the owner) and Axel early into our trip to Peru. They helped us with so much and made such a positive impact on our time in cusco. They are also a blast to hang out with and extremely knowledgeable and helpful. I would 1000% recommend this to anyone spending time in the area."
        }, 
        {
            "index": 118, 
            "rating": "5", 
            "review": "Loved Faces of Cusco!. We did the the chocolate/painting with wine workshop one afternoon while in Cusco. The staff was amazing and very helpful. We also attended the free Machu Picchu orientation. We had a great time and the orientation was imperative for me as I am an amputee and needed to know what I was getting myself into. Faces of Cusco offers deals in the \"off\" season as well."
        }, 
        {
            "index": 119, 
            "rating": "5", 
            "review": "Great idea and greater people. My boyfriend and I met the founder, Vinay, while we were doing a walking tour of Cusco last month. Since it was low season, we were able to jump onto a last minute cocktails class and it was so much fun. The whole team at Faces is awesome, friendly, and really offering something unique in Peru outside of ruins and typical tours. After we finished the cocktail course (and were a little buzzed) they invited to stay for a dinner on the house with them. There were two other Americans in the class as well so we all just sat down and had an awesome conversation. Coming out of it, we really felt like we had made some awesome new friends and done something very unique. Couldn't recommend these guys more- they know what they're doing and will make sure you have the best time possible. We continues to travel Peru and told everyone we met to try them out if you find yourself in Cusco. Amelia and Kit (Chicago, IL- 2/18/15))"
        }, 
        {
            "index": 120, 
            "rating": "5", 
            "review": "Unexpected Jewels of Cusco. The folks at Faces enhanced my trip to the Cusco region amazingly. From providing a great place to hang out and laugh with other travelers from around the world, to clarifying some of the mysteries of Machu Picchu and its inhabitants, Vinay and his crew brought my trip to a whole new level. It's a little amusing to see it labelled an \"attraction,\" because it's a bit of a bar, bit of a restaurant (so far), and about ten attractions in one. The San Pedro Market tour and photography lesson is remarkable--they have made personal relationships with the nicest vendors there (I got an awesome papier-mâché mask from Vladimir Ilich (!!), and the cheeses are awesome and so fresh!), so you can interact without feeling like a stranger. ...And that's really the key to all the experiences they offer...you feel like a member of an extended family there. All the folks are widely travelled or in the process of traveling, and know the mindset and needs of the peripatetics who pass through.Go to one event and I'm sure you'll want to stick around for more...whether the chocolate, wine, and art class (that I nearly missed my plane for!) with the multitalented Yvana and Clara, the Cajon class from Jorge (Sí, señor!), Kevin's lime-carving-and-tasty-bebida-making class (the perfect pisco sour, and the multi-layered crazy whatever it was that I may or may not remember), or Giancarlo's sweet salsa class, you'll be hooked. Oh, and the Machu Picchu presentation that I mentioned above...Clara and Vinay help to inoculate you, with solid scholarship, from the inevitable wild stories and claims you'll hear on your visit to that lovely place. If I write any more I'll want to go back, and I can't afford it just yet...so, to all y'all at Faces, and Brian too...muchachos, k nos veamos muy pronto!"
        }, 
        {
            "index": 121, 
            "rating": "5", 
            "review": "Excellent facilities and extremely friendly. Faces of Cusco was the perfect choice for a individualized and stressless tour of the San Pedro Market. Vinay met us at our hotel and took us to the market. He and his team of experts were extremely friendly. Great knowledge of Cuzco. Helped us with tips on better photography. Made it extremely easy on us to realize behind the scenes activities in Cuzco. We personally met several vendors at the market who showed us their products and handicrafts. Chocolate making and ceramic painting were fantastic and well organized in a charming / sparkly clean upstairs facilities. Meeting and chatting with Yvonna was a pleasure. When we finished our chocolate fun and ceramics we stayed for the free and very informative overview of Machu Picchu and the pre-Inka culture. Men you should try both (chocolate making and painting ceramics) you will enjoy it thoroughly like I did. Both are challenging but very gratifying. All in all it was a relaxing and fun way to enjoy our last day in Cusco. We followed Vinay's advise for dinner and had a great meal at Moreno. He provided other travel tips that were very insightful and helpful."
        }, 
        {
            "index": 122, 
            "rating": "5", 
            "review": "Feels like home. The second you walk into Faces of Cusco, you are treated like a long time friend. Vinay, and the rest of the staff, are prepared to do anything to make you feel comfortable and relaxed. They will not only go above and beyond what is needed, but will make sure your entire stay in Cusco is perfect. Their enthusiam for Cusco is contagious and it is nice to have them to give an insider scoop. Additionally, if you are staying for a long time in Cusco, Faces is the perfect place to meet other expats and friends. Again, Vinay will do anything to make the transition to life in Cusco simple and always has connections and insights into the way of living. There is no better place in Cusco than Faces to embrace the local culture while still having the safety of home."
        }, 
        {
            "index": 123, 
            "rating": "5", 
            "review": "Fantastic place to meet new friends and get an introduction to Peruvian culture.. Since arriving to Peru, I have been coming to Faces at least twice a week. Vinay and the team have been invaluable in making Cusco feel like home. Faces has amazing introductory classes in cocktails, chocolate, and the hectic San Pedro market, and hold fun cocktail hours during the evenings (love the craft beer selection!) This place, to me, feels like a haven among friends in Cusco. They also serve food from neighbouring Cafe Baghdad, win!!!"
        }, 
        {
            "index": 124, 
            "rating": "5", 
            "review": "Great option for exploring Cusco.. Faces of Cusco is ran by a great group of guys who are passionate about sharing their vibrant town with visitors. A group of friends and I stayed in Cusco for a couple days in order to prepare for our visit to Macchu Picchu. We took a tour with Faces of Cusco on our last day in Cusco and we had a blast. The market tour is phenomenal because the tour guides actually know most of the merchants and can give you in depth information about the foods in the market and even how the foods are made. Each of the guides are extremely friendly, warm and knowledgeable. They really make you feel at ease and as though you're getting a tour of the town from a close friend instead of a paid tour guide. I can't say enough good things about the tour; I highly recommend!"
        }, 
        {
            "index": 125, 
            "rating": "5", 
            "review": "Excellent Place to Meet Travelers and Experience Cusco. Faces of Cusco is the ideal place locally to meet travelers and have an amazing time while in Cusco. I've attended several Friday night socials and walk away each time with great new friends, fun memories and looking forward to the next week! The concept of Faces is a great place for travelers and locals alike to congregate, taste unique and rich Peruvian food, meet extremely interesting and fun people and simply enjoy their time in Cusco. Plan a stop at Faces of Cusco during your trip your itinerary... you definitely won't regret it!"
        }, 
        {
            "index": 126, 
            "rating": "5", 
            "review": "Interaction Even Better Than the Food & Drink. Vinay and his buddies have hit on a winning formula - Getting fellow travel-holics together to share food, drink, and travel stories. The cocktail class is a blast and just sets you up for the dinner party to follow. We were there during low season with just one other couple from the Midwest, but with more people the experience would only be enhanced. If you like striking up a conversation with fellow travelers in local watering holes, this is an ideal experience."
        }, 
        {
            "index": 127, 
            "rating": "5", 
            "review": "Amazing Tour!. My friends and I were lucky enough to do a Faces of Cusco Andean Market & chocolate class. It was so much fun! On the Andean Market tour, we were able to sample different things from the vendors (including maca!) and our tour guides were very informative. They knew the answers to all of our questions but didn't make it feel like a boring tour. The market is a great place to learn about the way of life in Cusco and Faces of Cusco really gives you an in depth look. After the Andean Market, we went elsewhere to learn about Peruvian chocolate. I had some of the best hot chocolate ever - I highly recommend it! Once again, our guides made it a great and fun experience. We learned all about the different kinds of Peruvian chocolate and even how it's made. We ended our day full, happy and well informed. It was one of my favorite days in Cusco and I wouldn't hesitate to book something with them again."
        }, 
        {
            "index": 128, 
            "rating": "5", 
            "review": "Great introduction to Cusco!!. My girl friends and I were in Cusco for a few days before our trek to Machu Picchu. We stumbled upon Faces of Cusco and decided to take a tour of the city and boy were we glad we did! Our guides were very knowledgeable, informative and fun."
        }, 
        {
            "index": 129, 
            "rating": "5", 
            "review": "Faces of Cusco - Great way to meet people. I thuroughly enjoyed my time at Faces of Cusco. It's Friday Night meet-up is a fantastic way to get to know others living in Cusco, the music was great, the atmosphere welcoming, and the conversation interesting and fun! I can't wait to go back again this Friday and to take part in all of the other activities they do!"
        }, 
        {
            "index": 130, 
            "rating": "5", 
            "review": "So much fun!. My friends and I went to Faces of Cusco during a down day on our trip to Peru last week to make chocolate, paint Incan pottery and drink wine- and it was AWESOME! We were tired and using this as a 'rest' day between exploring Machu Picchu and the Sacred Valley. Spending a few hours at Faces of Cusco was the perfect way to spend our day. The chocolate was awesome and we enjoyed talking to another couple and our hosts about Peruvian customs/tradition. After making chocolate we had a few options of Incan/Peruvian pottery; we each selected a piece and painted while drinking wine. Faces of Cusco is located right in Plaza de Armas, which is a great place to be. After we had a great meal at Cafe Baghdad next door and came back to Faces for a free Machu Picchu info session. We also received a discount from Faces of Cusco due to visiting in the low tourist month of February, but it would've been worth full price. A great way to spend time in Cusco, we had so much fun!"
        }, 
        {
            "index": 131, 
            "rating": "5", 
            "review": "Great for travellers. This place is right on the plaza and is a great place to hang out, have a pisco sour or tea/coffee and they run a number of activities throughout the day too, like salsa lessons, or a tour of the local market. The hosts are American, super friendly and you get the sort of service you are used to at home but not likely to get in many places in Peru (Peruvians just don't do customer service very well...). And on my Peruvian Toilet Rating System they score 15 out of 10!! Most of the customers are like-minded travellers so a great place to meet other people, especially if you're travelling on your own."
        }, 
        {
            "index": 132, 
            "rating": "5", 
            "review": "Awesome chocolate class. I'm crazy about chocolate and what a great experience! learned so much about chocolate and made beautiful truffles, they also give you wine as part of the class, loved it!!!!!"
        }, 
        {
            "index": 133, 
            "rating": "5", 
            "review": "Original, fun and enthusiastic!. Highly recommended by a friend we decided to spend an evening at this vibrant little spot in the city center of Cusco. And we did definitely not regret to do so! It was an interesting mixture of travellers, expats and locals coming together, yet from the very first beginning there was this feeling of being somewhere special. If you want to have a hell of a party, go somewhere else. If you want to actually get to know people, go to Faces of Cusco (and they do have really good cocktails and shots as well). It simply provides a wonderfully open-minded and enthusiastic atmosphere that one should definitely not miss out!"
        }, 
        {
            "index": 134, 
            "rating": "5", 
            "review": "Priceless info and great atmosphere. Faces of Cusco was a gem of info, hospitality, and friendliness! We stopped by accidentally and ended up getting a wealth of info (for free!) and meeting really cool people. In fact, we had just come from the Inca Museum and we got more out of Vinay's presentation on the Incas and Machu Picchu than the museum! The vibe there is young, energetic, informative, and welcoming. What I loved is there was no pressure whatsoever to book anything. Vinay is a wealth of free knowledge and tips. The tours they offer are different than any tours you'll find on the street, plus they are personal, not meant for mass tourists. If you're in Cusco, I recommend stopping by Faces of Cusco on your first or second day! Awesome orientation to Cusco, Peru, and the Sacred Valley!"
        }, 
        {
            "index": 135, 
            "rating": "5", 
            "review": "unique and fun must-visit in Cusco. Faces of Cusco gets you off the beaten tourist path. If you are a couple or a group and you're looking for a laid-back, authentic experience, this is your best bet. Vinay, the owner, will do everything he can to ensure you have a great experience. Especially highly recommended for Americans in Cusco looking for an experience that feels comfortable and trust-worthy but also unique and enriching."
        }, 
        {
            "index": 136, 
            "rating": "5", 
            "review": "Tons of fun with friends. I spent an evening with my friends and the amazing staff at faces of cusco, which turned out as lots of fun. Learning how to make cocktails, chocolate- and cajon-workshop. There was something for everybody. We learned and laughed a lot. Totalmente recomendable!"
        }, 
        {
            "index": 137, 
            "rating": "5", 
            "review": "Hospitality like no other!. Vinay and the FoC team is in their element! They know how to make others feel welcome in a city that may feel foreign. Their space is clean and well set up, and their bathrooms are the cleanest in the city!The offerings that they have created are fun, inspiring and different than any other company in Cusco. If you are looking for a good time and want to make new friends in a jiffy, than Faces of Cusco is the place to be!"
        }, 
        {
            "index": 138, 
            "rating": "5", 
            "review": "Full of Valuable Information. We were introduced to Faces of Cusco by Vinay, one of the founders. My friend and I were coming in blind to Peru. We are two women in our 20s. We didn't know much about the best places to eat, visit, spend our time, etc. My friend did know Vinay! He helped us out with tons of great information on Macchu Piccu, Sacred Valley and restaurants in Cusco. Vinay also hooked us up with one of his partners, Axel. Axel is a very cool and fun musician that took us to a concert and explored Cusco with us. Both of these guys are very trustworthy and professional, but can have fun and identify with their clients as well.If you need good information on a variety of topics in Cusco, these guys are the ones to start with. Both of them have awesome English (and I'm guessing Spanish) so if that's a concern for you, don't worry about it with this company! Totally recommend!"
        }, 
        {
            "index": 139, 
            "rating": "5", 
            "review": "Great way to experience the culture!. Had such a great time with the Faces of Cusco market tour with Vinay. He was super friendly, knowledgeable and fun! We learned so much about the culture and market and got to sample the local delicacies that we would have never have tried alone. We got to meet the locals at the market and really enjoyed the cultural experience. I would definitely recommend this company for anything class or tour they offer."
        }, 
        {
            "index": 140, 
            "rating": "5", 
            "review": "A great way to get to know the people and culture in Peru... The Faces of Cusco is a delight as the owner Vinay is a very personable, informative and passionate person. He took time out of his day to show me and my friend around the San Pedro market to get a closer look at what local life is like in Cusco. He knew a lot of the merchants there and I got to talk to them as well as test out some foods that I've never had before. I could tell a lot of people really appreciated his openness and I am grateful for all the knowledge he shared about the Peruvian way of life. If I wanted to be part of an experience where you can connect with the locals and learn about their culture, I would highly recommend hanging out with the Faces of Cusco! You'll have a blast doing so!!"
        }, 
        {
            "index": 141, 
            "rating": "5", 
            "review": "The magic half an hour tour!. Things can always start in a magic way, when you are ready for it.I'm on my life adventure with friends in Cusco, stopping at the Mercedo Central de San Pedro before our flight out. Puzzled by millions of kinds of chocolate, things were not easy either with our limited Spanish. A very nice young man helped with our chocolate choices. And he asked us for a favour of giving US a free tour in the market. What kind of favor is that!? Vinay, one of the founds of Faces of Cusco we later found out, has been doing market research for awhile. He's excited to test out his tours on us. We were nicely surprised by the passion, the knowledge, the relationship between him and the vendors. Even if we've been to the market for a few times, things felt, tasted, and seemed to be all different with stories and history being told, with people being connected.Limited by our time, the tour actually turned out to be the magic half an hour. With much being told and untold, we'd love to go back again. Don't miss Faces of Cusco - they will bring you a great Cusco experience!"
        }, 
        {
            "index": 142, 
            "rating": "5", 
            "review": "Unique and alternative!. Found about Faces of Cusco (a gem hidden in the Plaza de Armas) and I was more than pleased with their service. From dancing, to cajon classes to having the unique opportunity of meeting people from all over while making some Pisco cocktails. Definitely gonna go back to do the other workshop classes. An awesome way to stray away from the typical sightseeing in Cusco. Workshop site is super cool and well done and even better are the people running it. A definite must!"
        }, 
        {
            "index": 143, 
            "rating": "5", 
            "review": "a great cultural experience. I came to this place by a friend's recommendation and completely fell in love!The place offers a variety of different workshops that all have to do with the peruvian culture. I have participated in a cocktails' workshop, a salsa's workshop, a chocolate and painting workshop and a dinner night- all of them were super good! The workshops were really professional and fun. It was great to share them with different people from all over the world. The dinner was absolutely wonderful and involved traditional food with a gourmet touch. YUM!But with no doubt the best thing in this place is the amazing staff who runs it. You can actually see their passion and drive for making the best experience possible for their customers.I really recommend everyone who visits Cusco and wants a different and special experience to stop by :)"
        }
    ]
}