{
    "category": "Cusco", 
    "entity": "Tipon", 
    "avg_rating_stars": 4.631578947368421, 
    "review_count": 209, 
    "rating_stats": {
        "poor": 0, 
        "average": 9, 
        "terrible": 1, 
        "very_good": 55, 
        "excellent": 144
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "3", 
            "review": "Get there before 4:30 pm, beautiful drive up. I can only review what can be seen from the parking lot since the guards would not let us in. The guide books say it is open until 5:30 but the guards won't let anyone in after 4:30 pm. They can't leave until the last person gets out so they are not thrilled to let you in late. The drive up was worth it with fantastic views."
        }, 
        {
            "index": 2, 
            "rating": "4", 
            "review": "A fascinating place!. Tipon is an Incan agricultural site with an ingenious irrigation system. It's a pleasant and interesting place to spend an hour or two, walking around and through the various levels. And there were fewer tourists here than in other sites."
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "100% engineering . Amazing adventure that worth to try! Unbelievable water engineering masterpiece where you will find peace an tranquility"
        }, 
        {
            "index": 4, 
            "rating": "5", 
            "review": "south valley. Another good option is visit the south valley of Cusco, also is a a good alternative visit the Sacred Valley, these two valleys contain the best landscapes you can find in Cusco, too much culture and delicious food, without no doubt not to be missed, and even if they already have reliable agency as it is xtreme, even better."
        }, 
        {
            "index": 5, 
            "rating": "5", 
            "review": "Nice Place Outside Cusco. Took a Bus for 1.50 Soles from the center of Cusco. The hike through Inka Way was amazing with spectacular view from the height. If you can't find the way to reach the top the locals would be happy to assist you."
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "Few tourists! . Similar to Moray but based on a square design rather than curves. The stonework is in very good condition and the distribution of water throughout the site adds to its attractiveness. Great views of the surrounding area from the Inca site"
        }, 
        {
            "index": 7, 
            "rating": "3", 
            "review": "Tipton. This is an optional tour on the Friendly Planet and we did not enjoy as much as others. It cost $60U S dollars. Though it is a place to see the Inca terraces and their water distribution systems still working it is more spectacular for being done in the past and we kind of felt we could have saved the money. It does show how advanced and methodical those Incas where in solving issues to withstand the elements they faced."
        }, 
        {
            "index": 8, 
            "rating": "5", 
            "review": "Beautiful Tipon. We visited Tipon as part of the Cusco and Sacred Valley tours. The history was interesting and the landscapes were beautiful. I would recommend visiting this site as part of the Cusco and Machu Picchu experience!"
        }, 
        {
            "index": 9, 
            "rating": "5", 
            "review": "Fantastic, a must see. This was one of our favorite sites in Peru. Beautiful terraces and Inca water features in a gorgeous setting with no crowds. It's a nice walk to the top with beautiful vistas all around. Very significant history, a guide would enhance your experience. A very spiritual and peaceful place"
        }, 
        {
            "index": 10, 
            "rating": "4", 
            "review": "One of our favorite visits. Tipon is a terraced site for Incan agriculture where much of the irrigation has been restored so you really can see how it functioned. We are very glad to have been able to visit"
        }, 
        {
            "index": 11, 
            "rating": "4", 
            "review": "Beautiful Inca ag lab. Large terraces designed to observe and collect agricultural data. Beautifully landscaped with original Inca irrigation plumbing STILL providing water to the site and the town below!The terrace walls are designed to withstand earthquakes and to reflect sunlight which effectively raises the temperature within the growing plots. Reportedly the Incas studied how different seeds and plants might optimally grow in different soils which were imported. Native farmers still beneficially grow products in the imported terrace soils around the country."
        }, 
        {
            "index": 12, 
            "rating": "5", 
            "review": "Inca all the way. If it's a water system you want to see..that still works and looks awesome, then this is for you. Sometimes it is faster and cheaper to get there via private car or taxi. ASK!!! Have you Tourist ticket and then go and enjoy. The construct is wonderful and the views along the way spectacular."
        }, 
        {
            "index": 13, 
            "rating": "4", 
            "review": "Beutiful place and great example of Inca \"terrazas\". This is a great place to see the Inca terraces and their water distribution systems still working. It is a bit of a walk, as anything Inca is. Once you've seen the terrace system it is pretty much all the same, but this one still has water running through it and it is pretty good shape."
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "Nice short drive from Cusco!. I really enjoyed this attraction. It was huge and it was a great place to walk around. Definitely recommend this as a place to see. Not many people there so it was easy to take good pictures!"
        }, 
        {
            "index": 15, 
            "rating": "4", 
            "review": "great. Start the visit in the small village above Tipon . So you can visit the pre-Inca site above , and get a good overview of the site ."
        }, 
        {
            "index": 16, 
            "rating": "4", 
            "review": "Worth it. Extraordinary aqueduct system provides a lovely backdrop to learning about how the Incas grew their crops. It's easy to walk around and appreciate the beauty."
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "Beautiful ruins and terraces. This site has an extensive Inca terraces and some ruins of buildings. The ones up on the left are the only interesting ones. Here you can find an aquaduct and water gully that you can follow upstream for quite a distance. It is very pleasant to walk and look around for a while. If you walk up this water gully and like to take your time, reserve at least 2 hours (we spent 3 hours)."
        }, 
        {
            "index": 18, 
            "rating": "4", 
            "review": "Very cool site, but a little inconvenient to arrive. I went to Tipon in the morning from Cusco. I took a tipon bound bus from the avenida de la cultura stop, across from the hospital. I asked the bus driver to let me know when we were at my stop and he did. Then once I arrived (1 hour, 2 soles), I took a taxi to the ruins for 8 soles (they will try and get you to pay 12). I read in my Lonely Planet book that you could walk to the ruins, but the road was really windy and steep with buses flying up and down it so I took a taxi instead. The ruins themselves were really cool with an aqueduct system and big terraces. The view from the top is also breathtaking. Then I took a taxi back down to the bus stop (I just waited for one to come up and drop someone else off and then took it back down to tipon)."
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "Cusco, Vacation. This is a very enjoyable tour. It is short and as all we seemed to do involved walking good shoes for walking are a must."
        }, 
        {
            "index": 20, 
            "rating": "5", 
            "review": "One of our favourite sites in Peru! Don't rush through.... This was one of our favorite Inkan Ruins in Peru! There is so much to see and we didn’t even do half of it due to time constraints – wish we could have stayed longer to hike up to the ruins higher up in the hills! However, we still managed to see plenty! The site is very well maintained and the water still runs through the ancient channels! Take your time on this one - we spent about 40 minutes here but would have needed probably double that (or more) to be able to see all of it! The site is spread out over quite a large area with amazing views no matter where you are! We read up on the site before our visit and found it sufficient, otherwise I would recommend a guide as there is no information or signage. There are toilets at the entrance (not the cleanest, no toilet paper and a hole in the door where the lock should be, so anyone can see inside)! Wear sunscreen and a hat as you’re exposed to the sun the entire time. Entry is by Boleto Turistico."
        }, 
        {
            "index": 21, 
            "rating": "4", 
            "review": "GO FOR THE GUINEA PIG. The most authentic place to eat the Peruvian delicacy of Guinea pig. There a many places to choose from and they are located on the main road before you make the turn up to Tipon. Don't drink beer while you eat it as it will make you sick and make sure to have a shot of liquor after you are finished which is usually included."
        }, 
        {
            "index": 22, 
            "rating": "5", 
            "review": "Don't miss this place!. Most tourists are unaware this place exists! Make time to see it as it s fascinating. Engineering marvel that wild be difficult to build with modern equipment."
        }, 
        {
            "index": 23, 
            "rating": "4", 
            "review": "Pleasent and historical place. It's amazing on a sunny day. It's possible to make picnic with an incredible view. Speacilly locals go to the place."
        }, 
        {
            "index": 24, 
            "rating": "4", 
            "review": "incredible views well kept area so much history here. a must see site not too many steps but not suitable for anyone in a wheelchair, or with walking difficulties incredible views steeped in history i highly recommend it"
        }, 
        {
            "index": 25, 
            "rating": "4", 
            "review": "Worth the visit. While staying in Cuzco, we hired a taxi to take us to the ruins in the South Valley. We were glad to have taken the taxi vs a tour because it allowed us to take the time where we wanted. We did spend a few hours walking the Tipon area. The sophistication of the aqueduct system they built there was interesting to us, and therefore worth the visit. On this same day, we went to see Pikillacta which we found very interesting- an old large Huari city. It was very different than the Inca structures, so we enjoyed exploring it. In this area, the Rumicolca passageway is very close, so we stopped there as well. It is just once gateway, but interesting in structure with an aqueduct running along the top of this very tall structure. Although we went to the churches in Andahuaylillas and in and in Huaro, and they were impressive with their murals, they were just not our kind of thing. What we were successful in finding in Huaro, right on the same square where the church is is a museum of sacred stones. This is a relatively new museum housed in what seemed to be the same building with the village offices, but it was quite interesting to me, to see some of the stonework used in the aqueducts, but more than that a stone 'music table' that was very unique- where you they used a stone tapped on different places on the rock slab to make different tones... They also had stones with carvings, and petroglyphs there, pipes, and an authentic mummy. Kind of diverse collection of things, but many that we'd not seen in other museums, so we were glad we found it. (The taxi driver was not familiar with it, so we had to persist in the fact it was there in the village. The taxi driver was quite interested in the items in the musuem, so I think he was glad we persisted too!)."
        }, 
        {
            "index": 26, 
            "rating": "4", 
            "review": "Impressive water system. Nice archeological site right outside of Cusco. Worth the drive. Another demonstration of the advance techniques on the Inca civilization. Took local bus - collectivo- for 1.5 soles (instead of 50 soles for a taxi)."
        }, 
        {
            "index": 27, 
            "rating": "5", 
            "review": "Must see!!. Located high in the mountain tops of the valley, ruins are the most impressive, architecurally in the Sacred Valley heavily water based."
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "Out of the way but worth it. I really liked Tipon...it's usually grouped with the less interesting (and further away) Picallacta...but it's a very cool site similar to Moray...with active Inca fountains..."
        }, 
        {
            "index": 29, 
            "rating": "5", 
            "review": "Amazing Views. The grounds are amazing and the structures are out of this world. Very nice view points to see the site, you will not be disappointed."
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Amazing irrigation system. Very pleasant walk after hiking Machu Picchu for 2 days. The grounds are well kept and so green. This excursion was optional to our tour."
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "Hundreds of years old amazing natural irrigation system still functional!. We visited the Tipon Archeological Park, south of Cusco today. We booked a taxi tour through Taxidatum of Peru for Southern Valley tour. It took us about 40 minutes from our hotel to reach the site in the morning (including some rush hour traffic). It is way up in the mountain. The artificially created terraces are big and the irrigation system flows on both sides of each terrace. The amazing thing is that both the open channel and the underground ducts are still functioning after at least 500 years or more. Amazing Inka (or Wari?) ingenuity. In my opinion, this is a must see site if you come to Cusco. The entrance fee is covered by the Boleto Touristico."
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "Amazing . Another great place to visit. This inca site not only has terraces but also an amazing water system that takes water from glaciers at the top of the mountain and is used to irrigate all areas of the land. It also has a water temple at the top. Very clever and very beautiful. Definitely worth the trip and entry is included in the tourist ticket."
        }, 
        {
            "index": 33, 
            "rating": "4", 
            "review": "A bit of the beaten track. About 45 minutes from Cusco, this peaceful Inca site is worth a visit. Famous for it's terraces, it is also a place for ceremonies and purification thanks to the water systems."
        }, 
        {
            "index": 34, 
            "rating": "5", 
            "review": "Loved exploring Tipon on our own. (Budget Travelling). My wife and I travelled to Cusco for 10 days and Tipon was one of our day trips. (Bring Snacks if you don't like street food)We started by taking the city bus to the city of Tipon. It took around 45min and cost 4 soles. These are the buses that are racing through the city of Cusco and it'll have the name Tipon and other destinations printed on the bus. You arrive in Tipon on the highway and it's a very small town. There are always taxis waiting to pick people up and we arranged a round trip deal. If you don't do this they might up the prices for the trip back. When we arrived at the ruin site we used our Boleto Turistica del Cusco ( Ticket for Tourists in Cusco, it lets you into many sites and is quite cheap ) and entered the site. We never do tours because they tend to rush you and we like to set our own pace. The main site is amazing and easy to navigate. The real treasure here is on the left side when you enter. You can find older paths that lead up the mountain and ancient road that goes quite high up. We did this whole extra hike and loved it. I've heard that tours discourage this route. After we explored everything we took our taxi back to the town of Tipon and wait for the bus that took us back to Cusco. Great day and a great way to see some ruins for cheap. :)"
        }, 
        {
            "index": 35, 
            "rating": "5", 
            "review": "best historical site in Peru?. This was a fascinating trip and I would do it again in a heartbeat. This was a very interesting archeological site and I encourage others to visit this place and experience what I have experienced."
        }, 
        {
            "index": 36, 
            "rating": "5", 
            "review": "Inka ingenuity. Fascinating visit revealing the irrigation of water throughout Peru, Columbia, Bolivia and Ecuador.. Immaculate and fascinating. Highly recommended."
        }, 
        {
            "index": 37, 
            "rating": "5", 
            "review": "Take a day and go to Tipon!. We took the public bus to Tipon and walked the hour walk upo the hill from the center of the village. It is a nice walk and great conditioning if you are about to go on a trek. You can enter thel site with the Boleto Turistico you can purchase in Cuzco. Take a snack and spend the day exploring this amazing agricultural and hydrology experimental site of the Incas. Go alone, no tour needed."
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "Relaxing and beautiful. We enjoyed listening to the water flow all around us. This site was green and was a gorgeous contrast from the blue sky. We got a taxi here from cusco and also visited Picillacta for 120 soles. I think this site is worth a visit and is different from other inca sites. If you take the hiking path up to the left you will be rewarded with amazing views. Bring your own toilet paper to the bathroom, located near the entrance."
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "An Outstanding Andean irrigation system. Visiting the southern side of the Sacred Valley, you cannot miss Tipón. Located over the mountains you can explore another ancient set of terraces with irrigation systems to water the crops planted there during Inca times"
        }, 
        {
            "index": 40, 
            "rating": "5", 
            "review": "Lovely ruins . Tipon is quite beautiful and not nearly as crowded as other ruins. You could easily spend half a day here or more hiking and wandering around. Bring yourself a picnic lunch and find a shade or sit on the perfectly manicured lawn. There are plenty of hummingbirds here as well. And the waterways and irrigation is marvelous."
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "One of my favorite places on the trip!. Experimental Agricultural site. Amazing Inca architecture and agronomy! Spring fed acequias fed the terraced land. Beautiful."
        }, 
        {
            "index": 42, 
            "rating": "5", 
            "review": "this adventure was liked by my family. what a day we had...everything were perfect thanks to qorianka tours which helped us to make our decision in choosing the different tours in the city and outside...this one was perfect for our kids, thay returned to the hotel very tired from running up and down."
        }, 
        {
            "index": 43, 
            "rating": "5", 
            "review": "Worth the hike!. This site might be out of the local 'tourist route' but is very worth it! We took a local bus from Av. de Cultura heading E for s/1.5. After about an our we were dropped off in Tipon town. About an hour hike through the valley and then up a very steep hill (there is an alternative path for hikers). It was a beautiful walk and a great way to acclimatize to the altitude if you're planning on doing some other treks during your visit. (You can also take a tour or hire a taxi if you don't want to walk). The site is immense, and largely empty. Unlike some other Inka ruins we visited, this one still has the water flowing throughout. Another temple on a higher rise if you still feel like climbing!"
        }, 
        {
            "index": 44, 
            "rating": "4", 
            "review": "Tourist tour. Another attraction well worth a visit Check your time schedule and do the tours and walk arounds that you have time for as there is lots to see and do"
        }, 
        {
            "index": 45, 
            "rating": "5", 
            "review": "Tipon. Of all the Peruvian ruins I have seen, I think that Tipon was my favorite. It was fascinating and definitely worth the short trip outside of Cuzco."
        }, 
        {
            "index": 46, 
            "rating": "4", 
            "review": "Great archaeological site and avoid the crowds. Just outside of Cusco, easy to get to by bus and taxi up to the site, great site for water engineering from the Incas."
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "Beautiful and interesting!. The ruins and grounds are so beautiful and peaceful. The water systems are amazing and a wonder to see. The history of the Incas surrounds you and it is a sight to see."
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "Fantastic ruins. These ruins are the most complete of any that we have seen.The water system is extensive and functioning. Going the extra mile up the hill was the Pukara ruin. We followed the water channel to its start point. Take plenty of water and food upto this site. There is water and drinks available but no food. We walked from the main road after a 30 minute trip in a local bus which let us off at the main road intersection with Tipon. Cost was 1.5 sols each."
        }, 
        {
            "index": 49, 
            "rating": "5", 
            "review": "it was a beautiful visit. we were very delighted in being in a fountain complex for the nobility, my kids wanted to enter the water pools but the water was so icy cold, thanks to qeros tours for this election."
        }, 
        {
            "index": 50, 
            "rating": "4", 
            "review": "Awww Inspiring!!. The thought and engineering that took place so long ago in history makes me feel incompetent. The view cannot be matched in pictures, but rather should be experienced in person."
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "Amazing. It's amazing how the incas built this water channels.\n\"Besides being an archaeological complex, the site is home to one of the largest irrigation works in the terraces, with a great distribution of outdoor water channels.\""
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "Amazing!!!!!!. Don't miss a tour of this incredible exampled of Incan abilities. Not only is the scenery surrounding it worth the visit, but the explanation of the probable function & form is awesome."
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "Impressive Archaeological/Historical Sight. The sight is a very impressive Inca sight. There are large terraces surrounded by walls with functioning aqueducts, buildings. The scenery is beautiful and there are not too many people. We were able to admire the engineering and organization of the Incas up close and explore the sight from different perspectives"
        }, 
        {
            "index": 54, 
            "rating": "5", 
            "review": "Almost empty. We found this site interesting for 3 reasons, first was the amount of water flowing at the site, although not all the fountains are still operating, there is still a lot of water flowing here. The second reason is that there is a section of Inca trail above the site with an aqueduct in the middle and it still has water flowing in it. The third reason is that aside from locals having pick-nicks, the site was almost empty, I think we only saw 6 or 8 other tourists while there."
        }, 
        {
            "index": 55, 
            "rating": "5", 
            "review": "My favorite in the south of Cusco. Tipon is one of the wonders of Cusco, located in the south it has a very sutil energy and its magnificent engineering will amaze anyone the water channels and fountains are in perfect harmony with nature and the landscapes are incredible. Be sure to go with a guide or a travel agency or someone who knows the area. The logistics can be complicated"
        }, 
        {
            "index": 56, 
            "rating": "5", 
            "review": "this is a magic fountain. what i remember more of this place is that i found a casio watch running inside one of the stone canals that carry water from the mountains, and the watch was running well, the place is magnificent, even for a picnic."
        }, 
        {
            "index": 57, 
            "rating": "5", 
            "review": "Make the quick trip! Well worth it!. This seems to be a bit underrated of a destination but it should be definitely visited! One of the top ruin sites in my opinion."
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "Peaceful. This was my favorite Inca sight near Cuzco. We were not planning to make it out to see Tipon, but I am glad we did. Do not miss out on this beautiful place. It was quiet and peaceful with water flowing throughout. Very spiritual place."
        }, 
        {
            "index": 59, 
            "rating": "5", 
            "review": "I was here, amazing. I really didnt think the inka could do water canals as perfect as these...and with no modern technology..."
        }, 
        {
            "index": 60, 
            "rating": "5", 
            "review": "irrigation marvel. an interesting incan ruin just south of cusco, in the sacred valley. the irrigation system is an excellent example of incan ingenuity."
        }, 
        {
            "index": 61, 
            "rating": "5", 
            "review": "Family trip. This was worth seeing for sure. We had a tour guide tell us the history of this place which i would recommend. The terracing and the water irrigation system was amazing. The Inca people were certainly hard workers. Very interesting"
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "They really loved water as me. I really enjoyed to be at a palace or fortress especially done for the cult of water...I cant think of the inkas taking their bath in this ice-cold waters coming from high the andes mountains nearby surrounding the valley"
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "amazing example of Inca irrigation construction. We hired a private van and driver for $130 US. We already had the entrance fees. There were very few tourist because it is far from Cusco. But it is worth seeing."
        }, 
        {
            "index": 64, 
            "rating": "5", 
            "review": "Irrigation Marvel. We took an OAT optional tour of Tipon. It was a scenic drive outside of Cusco to get to Tipon. The terraced agriculture fields of the Inca's are certainly a marvel. Here the Irrigation system is amazing to see."
        }, 
        {
            "index": 65, 
            "rating": "5", 
            "review": "Holiday of a lifetime - Peru. And so the awe inspiring Peruvian icons continue to be shared: and Tipon as much as all the others. The story-telling behind the water channels is so interesting. Be sure to have a good guide.."
        }, 
        {
            "index": 66, 
            "rating": "4", 
            "review": "Interested in engineering feats? A must-see!. We thoroughly enjoyed our visit to Tipon. If you have any interest in engineering work, this is definitely worth it. The water flow/ distribution is absolutely amazing - even by today's standards. The ruins are beautiful, well-maintained and fun to explore."
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "Engineering marvel and worth a visit. You don't have to be an engineer to enjoy walking around Tipon. It's really an impressive and large site that's worth the time to visit when you venture outside the city of Cusco. It wasn't crowded, we didn't have any tour or guide but just enjoyed watching the water flow down the terraced levels."
        }, 
        {
            "index": 68, 
            "rating": "4", 
            "review": "Stunning. Tipon is less crowded than the Inca ruins and absolutely stunning. The water channels are unique and the views are spectacular."
        }, 
        {
            "index": 69, 
            "rating": "4", 
            "review": "Most unique ruin in Cusco. Tipon was on the top of my list of ruins to see. It is fairly small, very few buildings, but the fountains is what sets this one apart from the rest. Make sure you take the steep trail to the additional ruins that look over the land. I came on Father's Day 2015, and there were many locals picnic-ing in the park... Make sure to check with your taxi driver of how to return. I was waiting for 20 mins until a taxi returned, and it was only because their passenger forgot something!"
        }, 
        {
            "index": 70, 
            "rating": "5", 
            "review": "Tipon for people who marvel at works of engineering significance. Tipon is off the beaten tourist route and, with Machu Picchu, was a highlight of our trip. A simplistic summer home for one of the Incas, it was a hydraulic engineering wonder."
        }, 
        {
            "index": 71, 
            "rating": "5", 
            "review": "Very interesting place. I was amazed in this place to see how the Inkas build water chanels with such a precision. I would recommend to go with a guide tourist to get more information."
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "Off the path. This site was stunning and a welcome break from the often crowded sites in the Sacred Valley. The site is well preserved and has functional aqueducts. Fascinating. Of course, the setting is beautiful."
        }, 
        {
            "index": 73, 
            "rating": "5", 
            "review": "Hidden gem - Inca water temple. Visited this place as an optional on our last day in Cusco - found a hidden gem where not much visitors here. Marvel at the exceptional beauty of this water temple in a tranquil surrounding."
        }, 
        {
            "index": 74, 
            "rating": "4", 
            "review": "Lots and lots and love to have f stairs but beautiful nonetheless. Altitude was getting to me but once the climb was over, it was a beautiful site. The Incas were excellent engineers and builders."
        }, 
        {
            "index": 75, 
            "rating": "5", 
            "review": "Hydraulic and Agricultural Engineers Graduated Over 500 Years Ago!. It's amazing to see the several techniques the Quechua people had developed to irrigate their lands and to improve the agricultural results. Out of the many terraces you can find all over Cusco archaeological sites, here is where you can see the best."
        }, 
        {
            "index": 76, 
            "rating": "5", 
            "review": "way better than Macchu Picchu. After braving the bugs and overwhelming throngs of tourists taking selfies at Machu Picchu Tippon was fantastic experience.Hired a taxi to diver us to the site and wait for us while we explored. We paid 300 soles and the smile we got from the taxi driver I knew I paid rather handsomely for the excursion. I think you could get the same trip for 1/2 the fare.Their we two buses of students/tourists that arrived just prior to us. They did the usual tourist thing. Walk to the main terrace shoot a few selfies and leave (about an hour). They left and we had the whole site to ourselves. We waled an Inca trail (and water-duct) 1//2 way up the mountain behind the site. Views were amazing. !!!!!. Highly recommended DAY trip. Yes there is more to the site than first meets the eye."
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "An interesting stop on our Cusco City tour. The fountains and their construction with hand tools makes this a great stop on a tour of the city Historical sites"
        }, 
        {
            "index": 78, 
            "rating": "5", 
            "review": "Day trip to Tipon. These ruins were a bit out of the way, but it was a lovely peaceful day trip and on the boleto turistico."
        }, 
        {
            "index": 79, 
            "rating": "5", 
            "review": "Fantastic day visit. Great day visit to Valle Sur, much quieter than Sacred Valley and just as interesting. The Tipon hydraulically system is very impressive and an incredible 97% of the sight is original from the Incan period. A must visit in Cusco"
        }, 
        {
            "index": 80, 
            "rating": "5", 
            "review": "Fabulous. One of the best sight of the secret valley, what a feast of engineering and still working. Worth the detour"
        }, 
        {
            "index": 81, 
            "rating": "4", 
            "review": "Worth the trip. The peatonal way to get to Tipon is horrible. Longg way from the bus and also quite a way uphill by stairs. But the site itself is well kept and has plenty of water that you can use to refresh yourself after the walk. Feels like an ancient spa. Beautiful."
        }, 
        {
            "index": 82, 
            "rating": "5", 
            "review": "Unbeliavable. For all those engineers out there this is a must see. Hire a guide to tell you about the history of this amazing place. If you can go during the week day it is quite and a great place to just sit and take it all in. Truly a marvel in engineering."
        }, 
        {
            "index": 83, 
            "rating": "4", 
            "review": "Another Incan architectural achievement. A well renovated and preserved site of a typical Incan agricultural spot with sophisticated irrigation system in the Sacred Valley. A good hour's visit with tour guide to learn about the way Incans control waterflow in their aqueducts. Very educational in a scenic area and good photo opportunities."
        }, 
        {
            "index": 84, 
            "rating": "5", 
            "review": "Tipon: A hidden gem. A must see; off the beaten tourist tracks to the south of Cuzco. It is a magnificent water related construction with terraces and canals that make you stand in awe."
        }, 
        {
            "index": 85, 
            "rating": "5", 
            "review": "Interesting and EZ to get to. Very interesting ruin site. EZ trip from Cusco and can be combined with other places in the Sacred Valley. EZ and cheap to hire a taxi for the day."
        }, 
        {
            "index": 86, 
            "rating": "4", 
            "review": "Definitely worth the trip. Tipon is a good 30 minute drive outside of Cusco located high in the surrounding mountains. We visited a large # of Inca sites, but this was one of our favorites. The terraces and water works are beautiful and such an impressive engineering achievement. Recommend getting there early to beat the crowds and enjoy the serenity."
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "Peaceful and Intriguing. Tipon is beautiful and peaceful. Not crowded like the other sites and it is so interesting to see the different ways in which the Inca channeled water from a single source. This is one of my favorite Inca sites."
        }, 
        {
            "index": 88, 
            "rating": "5", 
            "review": "A lot of cuy restaurants. Beautiful city and we ate cuy (guinea pig) for the first time! It's nice and made in a traditional fashion by a friendly lady. Too bad we forgot the name of the restaurant."
        }, 
        {
            "index": 89, 
            "rating": "5", 
            "review": "Amazing design!. You can see how the Inca Empire made some beautiful places for rest and to preserve the beauty of the Pachamama."
        }, 
        {
            "index": 90, 
            "rating": "5", 
            "review": "Incredible site!. By so far, it is one my preferite site to be visited, with all water structure is definitely a pice of art. Magnificent in all way, Tipon is so rich of insights...Do not lose it!"
        }, 
        {
            "index": 91, 
            "rating": "5", 
            "review": "Very interesting site. Well worth a visit. Beautiful and simple and a contrast to the exalted heights of Machu Picchu. Amazing architecture of the Incas shown through water manipulation. Great walking around the site as well."
        }, 
        {
            "index": 92, 
            "rating": "4", 
            "review": "Relatively small site but worth the trip out of Cusco.. As an engineer, I was fascinated by the intricate aqueducts and canals. As a historian, I loved the intricate placement of the Puka Pukara (a fort, part of a national system of defense). And all done with precision 600 years ago!"
        }, 
        {
            "index": 93, 
            "rating": "4", 
            "review": "Nice tour in the morning. Not the most popular tour for the tourists but definitely deserves a visit. We were able to see the water paths actually working - very interesting."
        }, 
        {
            "index": 94, 
            "rating": "5", 
            "review": "Nice venture in the morning. If you like history. This a nice walk for the morning. Our tour guide made this a fun experience . We took a lot of pictures"
        }, 
        {
            "index": 95, 
            "rating": "4", 
            "review": "Certainly not a Disney-World-like package. Not much to see and still very nice. Don't ask me to explain because I'm not sure I could. My 10-year old wasn't impressed but mum and dad liked it. These are just a few terraces, but when we took the time to see them at the time they were in use, crowded with workers and who knows what, the site in itself gave out a really nice feeling. It's quite the opposite to a Disney-World experience where everything is being chewed and digested for the strongest possible wow-effect. So might not be for anyone, dunno"
        }, 
        {
            "index": 96, 
            "rating": "4", 
            "review": "General Tourist ticket confusion. Bought my general ticket here..... eventually. I couldn't speak Spanish & he couldn't speak English so I ended up with the adult Partial pass for me (which is only for ONE day) and a General child ticket for my son which is for 7 days (I had to show his passport for his age). I realised my error as I walked around the site and thought about the next week of tours i would be doing so I went back at the end but he wouldn't change it. In the end I had to buy another Adult ticket but made sure it was a general one this time. The site itself was quite peaceful and we saw a hummingbird flitting around. We got some great pictures of the ruins."
        }, 
        {
            "index": 97, 
            "rating": "4", 
            "review": "An amazing example of Inka's engineering. A great place to know about the Inka's engineering and the role of water in this culture. Actually, It is one of the engineering achievements of the Inka culture."
        }, 
        {
            "index": 98, 
            "rating": "4", 
            "review": "A fascinationg archeological site. The Cusco region has so many wonderful historical sites and this is one of the better ones - apart from the beauty and historical significance, you also wonder about the sophistication of their agricultural and water systems so many hundreds of years ahead of their time."
        }, 
        {
            "index": 99, 
            "rating": "4", 
            "review": "Still one of my favourite archeological sites. This little gem just east of Cusco is becoming more popular. The road in has been very well upgraded and it is an easy taxi-ride from Cusco. This water temple offers stunning views of the Sacred Valley and a glimpse at the Inca's reverence for water and mother earth. The site is being gradually restored and upgraded and it is in very good condition. As well as the broad terraces leading up to the ruins there are impressive aqueducts that lead to a sacred three-channel water fall from the aqueducts. To the right are small ruins and the trail to the left takes you up to more ruins and even more spectacular views. It is a wonderful place to be late in the afternoon when the sun begins to set over the Andes. This is still a little known site and you often have most of the place to yourself. There are washrooms next to the parking area."
        }, 
        {
            "index": 100, 
            "rating": "5", 
            "review": "Tipon-a less-visited Inca site. I got to Tipon on a pulic bus out of a terminal at the south end of town. Ask the driver for Tipon. He will leave you at the little town that is the access Take a cab up the hill to the site (long hot walk) He'll either wait for you or come back for you. It's all a little vague (I spoke no Spanish) but it works like all the magic of travel. The site is very open and lovely. You can hike the Inca trail from here. Had I known that I'd have made an effort to come earlier in the day--too hot once I got here. I had come from Pikillacta. The same city bus, just further down the road. Piklillacta is adjacent to the road. I'm really glad I came to these under-visited sites. And my bus adventure was phenomenal: http://miriamfeder.com/miriam-feder-blog/on-the-bus-south-of-cusco-trip-report-6/"
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "Water works, galore. Many of the irrigation channels and ceremonial baths are still functional, which amazes me! In one place, one channel of water was split into two and then into 4, and the symmetry of the falling water was beautiful."
        }, 
        {
            "index": 102, 
            "rating": "5", 
            "review": "Very green!. It's a close drive outside of Cusco. The setting is stunning and a very pleasant experience. Few tourists! Love the running water."
        }, 
        {
            "index": 103, 
            "rating": "5", 
            "review": "Agricultural and Hydraulic Engineering Center. This is an amazing place to see how smart the people were to achieve all what they did. You walk up and down for, at least, an hour."
        }, 
        {
            "index": 104, 
            "rating": "5", 
            "review": "A hidden gem. Tipon is most definitely worth visiting. It is an Incan terraced area complete with an ingenious irrigation system. Don't know why this site is not more visited."
        }, 
        {
            "index": 105, 
            "rating": "5", 
            "review": "Beautiful and without tourists. Tipon, in the Southern Valley, is well worth a visit. The hike up is great exercise and the site is expansive, interesting and has beautiful views. Unlike sites in the Sacred Valley, we encountered very few other visitors."
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "'Magic' with water. I got the multi-day pass which was well worth it as I planned on visiting multiple ruins including this one. Next to Macchu Picchu I'd rate this 3rd on my must see list. We took a bus for a few soles on to the town which stopped at the Plaza. We then started walking up to the ruins hoping to find the trail that leads up to the ruins but never found the start and ended up walking along the road. It is a distance away but luckily a passing taxi stopped and offered us a ride at a discounted rate. The ruins itself is remarkable, to see what the Incas managed to do with water so long ago and that it still seems to be working today is simply amazing!"
        }, 
        {
            "index": 107, 
            "rating": "5", 
            "review": "Fascinating use of water. I love visiting ancient ruins so I will be more biased that I truly enjoyed this trip. I like looking and analyzing how the ancient past did their own irrigation and equally fascinated by the gardening system they used commonly seen in many other parts of the world in mountainous regions. Tipon is a great start in the many wonders of Cusco."
        }, 
        {
            "index": 108, 
            "rating": "4", 
            "review": "Check out a book on from the library. Beautiful very ancient site- even before the incas. Hydrolic system amazing and nice stroll around. Drive to get too nice also."
        }, 
        {
            "index": 109, 
            "rating": "5", 
            "review": "nice ruins and guinea pig!. the place is really good so if you book a tour make sure its before lunch! because in the nearby town you will have the best guinea pig ever, so many places to choose from wow"
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "Incas did it again. After I thought I had seen all the ruins I needed to see the Incas amazed me again!!! It was this incredible system of irrigation that needs to be seen to show how smart the Incas truly were. With a guide you could learn more but alone is still nice!"
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "A must go. Not a lot of people know about this place but it is really fantastic. It is interesting to see how the Incas managed their water and this is the right place to go to see this. Most of the place is original and only some percentage was recontructed"
        }, 
        {
            "index": 112, 
            "rating": "5", 
            "review": "Wonderful side trip. When you come to Cusco and Machu Pichu, take some time to do some side trips. Tipon is highly recommended. The fountains and irrigation systems are amazing. We were there in May and everything was green. Very beautiful."
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "Wow!! Don't miss it, if possible. This site is not on the Top Five lists around Cusco, but probably should be! The day I was there, with a dedicated guide, there was one smallish tour group - and a lot of local Cusco families.Tipon consists of a series of very-carefully-laid out terraces, with a single watering source, characterized by its magnificent four-spout fountain. This fountain feeds water into the hight terrace, and from there channels and engineered water-falls feed the water to the lower terraces.An overlooking ridge sports a \"high place\" placed strategically to overlook both the valley below and the terraces. And more than one ancient Inca road-way connects this site to others nearby.[This site is part of the full-fare Boleto Turistico for Cusco and Sacred Valley ruins.]"
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "Very special if you have the time and love the Incan Stones. I will always start my reviews by saying \"visit Cusco after Sacred Valley and Machu Picchu\" as it is higher and you have less chance of Soroche. I found Tipon really interesting and beautiful. Not as big and daunting as some of the other wonders but still amazing if you feel you would like to see more of the fantastic accomplishments of this ancient culture. It is South of Cusco and so in a different direction so you need the extra day or half day in the area and there are also other interesting stops along the way and you could easily spend an entire day. I guess I have to review the places along the way separately."
        }, 
        {
            "index": 115, 
            "rating": "5", 
            "review": "Must visit.. Ancient hydrolauic irrigation system well preserved and a working facility till date. It's a must do in cusco. Keep time on hand to climb the different levels, easy to navigate stairs, to go to the top of this hydraulic marvel, and enjoy the place."
        }, 
        {
            "index": 116, 
            "rating": "5", 
            "review": "Interesting tranquility. Off the main tourist routes this site is a worthwhile visit with working water features & lovely views."
        }, 
        {
            "index": 117, 
            "rating": "4", 
            "review": "Ruins. Peru is the best place to capture the essence of Inca civilization. The best learning grounds for Inca, Tipon is yet another masterpiece from this era with articulate and impressive skills of architecture in work. The place is serene, peaceful and was a great stop in our Peruvian trip. They also have a lot of restaurants around which can be a great trip round off."
        }, 
        {
            "index": 118, 
            "rating": "5", 
            "review": "Wonderful Water Temple. The importance of water was recognised by the Incans and they show their love and respect for water here. I loved the stonework and all the fountains. This place is special. Make sure you have a guide. Check out Aspiring Adventures their guides are great."
        }, 
        {
            "index": 119, 
            "rating": "4", 
            "review": "Exploring Peru. Peru is an amazing counry to explore. My wife and I enjoyed going to the usuall but we also enjoyed getting outside of the mainstream and doing some great hiking with increadable vistas."
        }, 
        {
            "index": 120, 
            "rating": "4", 
            "review": "Ruins and guinea pig for lunch make for a nice half day trip from Cusco. We took a private taxi from our hotel in San Blas at 9am. We went straight to the ruins of Tipon and got a guide- this was the only ruins we visited where the guide told us that payment was voluntary. The ruins are not as extensive as some of the others we visited, but there is more water. I guess if you like ruins you will like these. I did. We did run into a couple who must have walked up or had their taxi leave and they were stranded up there. Sadly, no room in our taxi for them- so be aware to know how you are getting back into town. Our guide said the best place in the town of Tipon for 'cuy', or guinea pig, was El Rancho. That is where we ate. It was succulent, tender, the skin was crisp and fatty. If you have had rabbit, it is similar. It had been stuffed with some herbs that looked vaguely like yarrow. Between the two of us we could not finish one cuy. I think it was 35 soles, or about 12USD. We heard in Cusco that if you are in Tipon, any restaurant will have good cuy, and we saw the little domed ovens all along the road. I thought it was worth the trip- but I always taste the local food. We were back in San Blas before 1pm."
        }, 
        {
            "index": 121, 
            "rating": "4", 
            "review": "Interesting taste sensation. This place is known as the guinea pig capital in Peru. There you can taste fresh roasted guinea pig which is the national delicacy of Peru. It tasted pretty good, just takes a little courage to taste it though"
        }, 
        {
            "index": 122, 
            "rating": "4", 
            "review": "Nice quiet place.. I ventured myself via local bus to get there. But let me let you know that the place itself is way up on the mountain and on foot it might take you 30 to 45 minutes to get there. I opted to hire a local taxi, which gives you 45 minutes to visit the area. The price I paid was a bargain, if I am not mistaken it was about 25 soles.Once again if you book this through a travel agency, do it as a private tour and not part of a group. Going on your own or in a private tour gives you the change to take photos and visit the area without being rushed."
        }, 
        {
            "index": 123, 
            "rating": "5", 
            "review": "Beautiful, beautiful, beautiful!. I guess I got a little 'ruined-out' by the end of my time here in Peru but this one was my favourite and I'll always remeber it. Its history is very interesting, but what really stood out for me was the peace and serenity. A lovely place to stop, rest a while and take it all in!"
        }, 
        {
            "index": 124, 
            "rating": "5", 
            "review": "Artful terraces with water fountains. This place is unique, as you will find the signs of art and craft of the Inca elite and their slaves to transform a landscape into a symbolic and artful relief for water fountains and terraces. Go and see the stone walls, the sparkling water fountains, and use your time to walk up the mountain and follow the water channel - you will find more Inca quarters. From the top you can walk down to the Valley."
        }, 
        {
            "index": 125, 
            "rating": "3", 
            "review": "interesting. Tipón, located east of Cusco, are Inca ruins which may have been a park for the upper class or an agricultural centrum. Even today water rushes through the channels, and the wide terraces are in perfect condition. Several surrounding ruins have been excavated, and many more are visible below the soil."
        }, 
        {
            "index": 126, 
            "rating": "5", 
            "review": "andean terraces. wherever you go in cusco, always the history, and the landescapes will fascinating you, y loved this places all the architectural desing are perfect."
        }, 
        {
            "index": 127, 
            "rating": "4", 
            "review": "Incan ruin with nice breeze. Good historical place close to Cusco. It has mysterious water channel flowing through and no one knows the source of the water. Nice open space kind of place used to do Incan rituals in the mountain and you can hike around the place. It is not going to Wow anyone like Machu Pichu as it literally has only some water channels and steps in the middle of the mountain but can be visited once at least for the breeze"
        }, 
        {
            "index": 128, 
            "rating": "5", 
            "review": "magic water. This site is beautiful of serenity… How to go ? take a Combi (bus) in San Francisco square you will find some bus said Bus LEONES and ask to the driver if he go to Tipon, you will pay 4 or 5 soles to go until the Tipon village.After you have the choice to walk until the site 40 minutes walking or to take a taxi until the site.Don't forget you Tourist Ticket the full one. About the site : Tipon is huge site and you can easily walk in this place 4-5 hours if you like to walk you can follow the hydraulic Inka canal until the mountain or ti go until an other village above Tipon.if you go on this village don't forget to stop of one of the restaurant in the border of the road, why ?? because Tipon in the best place to eat Cuy (Guinea pig) on good local restaurant is El Rancho ;) enjoy your day"
        }, 
        {
            "index": 129, 
            "rating": "5", 
            "review": "Another Magical Place. I would say that Tipon is a must if you are visiting Cuzco.It is less than an hour away. Even after visiting Macchu Picchu it still astounds you. Walk all the way to the top and see the water canals. It is simply BEAUTIFUL and peaceful. One of my favorite places!!On the way back you can visit Oropesa with its ovens for bread!"
        }, 
        {
            "index": 130, 
            "rating": "5", 
            "review": "Well Worth the Time. Tipon is a beautiful and a spiritual place. The sound of water is everywhere and the views across to the mountains are beautiful. Our guide was from a small Inkan village and we agreed that if you could build a simple house on one of these terraces and listen to the water as you went to sleep there would not be a better place to be."
        }, 
        {
            "index": 131, 
            "rating": "5", 
            "review": "Incredible Inca engineering. The trip up the mountain was by a very narrow rode to a small parking lot. The entrance was beautiful but small. When we walked up the ancient stone stairs to the top of the first wall I was again in awe of the building skills of the ancient people. The terrices just kept going and the water channels were still working. WOW!"
        }, 
        {
            "index": 132, 
            "rating": "5", 
            "review": "A great ace to explore. We took a taxi to the ruins for 30 soles, the ruins are beatiful and intricate with the water still flowing in the channels today. There are some trails and roads around that we didnt have time to explore but i guess it vould be a great day hike. There is no resturant so bring your own food and drinks. We walked down from the site to the main road, there is a trail so you dont have to walk where the traffic is. From the main road it was easy to catch a bus back to cusco."
        }, 
        {
            "index": 133, 
            "rating": "5", 
            "review": "A nice quiet place to reflect.. The history of this place was very interesting. Our guide was well versed in English and Spanish. It was more hiking and after Machu Picchu we were tired but we did it and glad we did. Very informative and guides very friendly."
        }, 
        {
            "index": 134, 
            "rating": "5", 
            "review": "Undiscovered Gem. Tripon is a royal Inca retreat built on an older site. It has extensive terraces, working fountains,and the ruins of a palace. The paths are easy to walk but they climb quite a bit to the palace, a fabulous walk. Not much is said in guide books about Tripon and so we were stunned by the beauty of the place. It is best visited by cab because it is about 25km from Cusco and up a steep driveway."
        }, 
        {
            "index": 135, 
            "rating": "3", 
            "review": "The cuy place. Had heard they had the best \"cuy\" here, so went there for dinner but came apparently a bit late. When we arrived at 7.15pm almost everything was closed, we were lucky to find one place that was about to close to serve us some food. However we were so happy to get some food so we stupidly did not ask for the price before we ordered our food, ended up paying 35 soles for a cuy and then plus another 9soles for a beer. Otherwise a very interesting experience"
        }, 
        {
            "index": 136, 
            "rating": "5", 
            "review": "Great Inca Ruin. This can be easy done from Cuscu via a collectivo (local bus). No need for expensive tours. Check the Cusco Tourist Information for details."
        }, 
        {
            "index": 137, 
            "rating": "1", 
            "review": "Single admission not possible. We had a passing day in cusco to enjoy so decided to make our way here. When we got to the admission box we were told we had to purchase a ticket for various sites around Cusco, and that to pay to just see this site is not possible. We tried the 'slip them 20 soles' technique someone on here suggested but it didn't work. They've possibly clamped down on that in recent months. Anyway I think it's pretty ridiculous you have to pay for a 130 soles ticket that 'entitles' you to see places you may not want/ have the time to see. This place just represents the very worst part of visiting cusco - they try to milk tourists for all they're worth."
        }, 
        {
            "index": 138, 
            "rating": "5", 
            "review": "A Beautiful Magical Place. Tipon was very elegant and refined with its beautiful fountains and terraces compared to other sites in the Sacred Valley and Cusco. The location was also very scenic. The walls were masterpieces of Inca construction."
        }, 
        {
            "index": 139, 
            "rating": "5", 
            "review": "Hidden historical gem. The irrigation channels and fountains are worth the trip out from the city. Going with a guide is a must to truly get the most out of this enchanting place."
        }, 
        {
            "index": 140, 
            "rating": "5", 
            "review": "Underrated. This place is not very much visited and I don’t understand why. It’s beautiful and has a very interesting history behind it. Go with a guide to explain to you the details of this place, because if you are going alone its seems like just terraces and some water lines. We visited this places as part of a private tour that includes some sited in the south of Cusco. To visit just this place it would be about 2 hours with the ride from Cusco."
        }, 
        {
            "index": 141, 
            "rating": "5", 
            "review": "The water temple was great. This is a beautiful ruin. Actually, mostly still working today. It is set in a beautiful location, with cool running water and lovely terraces. We spent over an hour here and there were very few people. i really enjoyed it."
        }, 
        {
            "index": 142, 
            "rating": "5", 
            "review": "Heart of the city. A busy central square with much both ancient and modern. Stroll down to the Central Market for a bewildering array of products...."
        }, 
        {
            "index": 143, 
            "rating": "5", 
            "review": "undiscovered gem. This is an amazing site to visit. it's about 1 hour bus ride from cusco. take the Los Leones bus into the centre of Tipon (1.5 soles) and then you have to hike up about 45 minutes but the views are amazing. To get in you need a ticket that lets you into to other sites like Pisac but i 'tipped' the guy 20 soles and he let me in. It is thought to have been a laboratory of agricultural products because of the various micro-climates found within the complex. Even now the channels, and the wide terraces are in perfect condition and it is still used in parts of tipon today. The site seems to be a secret coz it has nowhere near the number of visitors as Machu Pichu"
        }, 
        {
            "index": 144, 
            "rating": "4", 
            "review": "Water system. Nearly an hour's drive from the centre, it's a good thing to see. The canal system is super interesting. Nice walk around, better with a guide to tell you what the various things are."
        }, 
        {
            "index": 145, 
            "rating": "5", 
            "review": "Important Site. This site is important to understanding the Inca engineering and science. The hydrological design is genius and that they had such a sophisticated agricultural experimental strategy was amazing!"
        }, 
        {
            "index": 146, 
            "rating": "5", 
            "review": "Great Inca ruins. This is a wow-site! Beat my expectations. It's not very popular among tourists, we arrived there in the afternoon on our first day in Cusco, and there were 3-4 dozen people there who mostly left by the time we were leaving. This is a definite plus. The site is thought to be a park for the Inca elite and the wide terraces support this notion as they are unusually wide to compare with agricultural terraces of Pisac or Machu Picchu. But the main attraction here are the fountains with water supplied thru the elaborate irrigation system of above- and underground canals. You can climb up to the fortress ruins (signs for Pukara) and from there hike up the Inca canal, the main water artery. It's a multi-tier aqueduct going up the hill where remains of some Inca structure are located. A hike there may take 1-1.5 hours in my estimate. I regret we didn't do that since in addition to seeing the source of water and getting a great view from the top it would be a nice way to acclimatize ourselves to the altitude of Cusco. I should have read a bit more on the subject before arrival. Anyway, we walked up 5 sections of the aqueduct up to the alternative water source running underground from a nearby hill. The main spring at the top is probably dry and the upper portion of the canal is not functional at this time. Along the canal there is a small ritual plaza with nice stonework. Going back to the fortress will lead you down to the temple with a small fountain. It took us about 2-2.5 hours to do the site, but with the hike up the hill you can spend the entire day there. We hired a taxi from Cusco and went to Piquillacta and Rumicolca after visiting Tipon. Excellent site. Included in the Boleto Turistico."
        }, 
        {
            "index": 147, 
            "rating": "5", 
            "review": "WOW! Very cool place.. This has so much historic value, I suggest reading up on it before visiting. It is just incredibly beautiful and you can do some great hiking, climbing and acclimating preparation, especially if you plan to hike the Inca trail! We loved it and got some gorgeous photos while there."
        }, 
        {
            "index": 148, 
            "rating": "5", 
            "review": "Awsome, less crowed Inca site. Incredible water channels and fountains, beautiful stone work, less crowded site. Can be combined with some other great near by Inca and Wari sites for a great 1/2 day trip many don't see."
        }, 
        {
            "index": 149, 
            "rating": "5", 
            "review": "A must see to understand the whole INKA world view.. This site may seem less-important to some, but speaks volumes of the INKA world view and how they lived in what might be considered by some as in-hospitable living conditions. Open your mind when you visit this archeological site."
        }, 
        {
            "index": 150, 
            "rating": "3", 
            "review": "Interesting but not a must see !. This is an archeological site containing old Inca fountains and irrigation systems. Nothing is explained on the site as everywhere in Peru. Is nice to see but not a must."
        }, 
        {
            "index": 151, 
            "rating": "5", 
            "review": "Hidden jewel. Yes, this place is amazing and very often forgotten because it is not on a traditional touristic path. If you like a quiet place Tipón is the place. You won't regret!"
        }, 
        {
            "index": 152, 
            "rating": "5", 
            "review": "An overlooked gem!. It takes some doing to get there on your own. 70-90 minutes in a colectivo (under 2 soles) that you can catch at Plaza San Francisco in Cusco. It is only about 10 miles away from Cusco but you have to go through its entire suburbia with lots of traffic. Then from the village square of Tipon you can either hike up to the site in about 45 minutes or take a taxi (4-6 soles depending on the number of people). Just be aware that you may have to wait for the taxi for 5-10 minutes. Once you are at site, you will be rewarded. Compared to Saqsayhuaman, Ollantaytambo.., there is no crowd and very few tour buses. The site is an old Inca farming village with wonderful terraces and a small fort. What sets Tipon apart is its irrigation system that has been restored in 2002. Make the trip and you won't regret it!"
        }, 
        {
            "index": 153, 
            "rating": "5", 
            "review": "Lovely and uncrowded. Tipon is a site that it seems most people don't see.. it's south of Cusco, and not in the Sacred Valley, but well worth arranging an extra trip to see. It's set high up on a mountainside, and is is excellent condition. The fountains and running water harnessed by the Inkas still flow smoothly and rapidly throughout the site. The terraces are immaculate. There is also a walled living area up to the left that's worth the hike up the steps. The overall site is not huge when compared to many others, but is less popular, so even in the height of the season, you might have the place to yourself. There were woman in the parking lot selling hot chocolate, candy bars and cocoa tea. There were bathrooms, but as in all of Cusco, bring your own toilet paper.Take your time and enjoy the site and the vistas... I would allow several hours to putter around."
        }, 
        {
            "index": 154, 
            "rating": "4", 
            "review": "Beautiful. We arrived at Tipon, when arrived it's almost close and the rain was about to come. We all tried to climb up there. I have to praise the officer who's there that he did his job very well. My guide brought us to a certain place up there to take spring water and put it on our face and that's the secret of making him look younger than his age. He said if we believe that we have to visit Tipon every 10 year.There was no people, once arrived. I took pictures and fresh air as much as I can. I love this place. It make me calm."
        }, 
        {
            "index": 155, 
            "rating": "4", 
            "review": "Definitely worth a visit. very nice park...if you can, go independently to spend as much time as you like...cheap organized tours also available from Cuzco"
        }, 
        {
            "index": 156, 
            "rating": "4", 
            "review": "Beautiful place. Very pretty and few tourists. Well worth it if you are in the area. Entrance fee was only a few dollars. A very interesting and serene place."
        }, 
        {
            "index": 157, 
            "rating": "5", 
            "review": "Beautiful and impressive ruins. This is definitely a must see! If you have time, I can recommend taking public transport - just get a cab and ask for collectivo to Tipon, it takes 30-60min to get there, depending on traffic. The site itself is just stunning - take your time to explore and enjoy!"
        }, 
        {
            "index": 158, 
            "rating": "5", 
            "review": "Stunning!. Hardly any tourists when we visited Tipon but the site is incredible! One of our favorite Inca sites in Peru. The incredible ingenuity and engineering skills of the Incas is clearly visible here. The site is easily accessible by car and then the site requires some uphill walking to access the terraces and see the incredible water channeling and drainage features. We spent about 2 hours at the site in the early morning and thoroughly recommend adding Tipon to your itinerary when in the Cusco region."
        }, 
        {
            "index": 159, 
            "rating": "4", 
            "review": "Time for cue. I went for Tipon not for the ruins, but for me it was all about trying the Cue.So i took a taxi from Cusco and he drove us until a family restaurant. So there we tryed a \"fresh\" cue just as the locals are used."
        }, 
        {
            "index": 160, 
            "rating": "5", 
            "review": "Not to be missed!. Our guide decided to show us Tipon only because we had a bit of extra time - granted we hustled our butts off. It was worth it! This is what the locals would call an alternative tour as it is not on all of the guide's itineraries. It is absolutely beautiful, and there is a lot to learn here. Don't miss it! Was a highlight of our trip."
        }, 
        {
            "index": 161, 
            "rating": "5", 
            "review": "Wonderful engineering!. This is an archaeological sight that isn't visited by as many tourists, we had the place mostly to ourselves. Beautiful!"
        }, 
        {
            "index": 162, 
            "rating": "4", 
            "review": "Tipon zoo. We visited the zoo in Tipon and really enjoyed seeing all the native South American animals however some enclosures are in need of a revamp. It's not very well known as it's quite small however I'd encourage you to go check it out on the way to the ruins. Hopefully an increase in tourist dollars will enable them to build larger enclosures."
        }, 
        {
            "index": 163, 
            "rating": "5", 
            "review": "Well worth the effort. While not as grand as Machu Picchu and other Incan sites and a little more difficult to find, this site is one of my favourites because it is out of the way and not as popular. As a result your are often the only ones there and it retains a very peaceful and spiritual character that puts you in touch with history. The heart of Tipon is the flow of water through its aqueducts and the terracing that falls dramatically down the site. The views are spectacular and if you make the effort to hike up the trail to your left as you walk into the site you will end up with a dramatic view across the Andes, especially at dusk as the sun sets. If you follow the aqueduct up into the hills you will be amazed at how far it goes and the peacefulness that you find. Apparently it is a two hour hike to the upper ruins and the source of the water. I have been there twice with groups of students and we have had a local shaman or holy man who has done a blessing ceremony. It is quite moving in this setting."
        }, 
        {
            "index": 164, 
            "rating": "5", 
            "review": "A must see on your trip to Peru. Tipon is not on the usual list of tour destinations in Peru, but it should not be overlooked. Very close to Cusco, it is worth the drive. Set high above the local city with great views of the mountains and valley below."
        }, 
        {
            "index": 165, 
            "rating": "5", 
            "review": "Great place and it's not touristy. One of the great wonders of Inca engineering and you can spend couple of hours exploring this beauty"
        }, 
        {
            "index": 166, 
            "rating": "5", 
            "review": "Worth the visit. We went to Tipon as part of an underground tour to the other side of the valley. It was highly recommended by our private guide who took us to Maras, Moray and Chinchero.Great engineering, with a water canal system from Inka times. Impressive to see this architecture. Plus all the landmarks on our way there.Another highlight from Tipon, is that the town under the same name close to the ruins has good guinea pig. Definitely worth to try."
        }, 
        {
            "index": 167, 
            "rating": "4", 
            "review": "A gem. We caught the local bus from Cusco and walked an hour uphill to the site ( you could catch a taxi) 10 soles entry fee. We didn't have a guide so found the lack of a map or information limited us. Hardly anyone there when we visited- very peaceful and atmospheric- loved the irrigation channels. Suspect the whole of the site would warrant a visit of several hours. Walked back down and easily found a place to enjoy a well earned beer."
        }, 
        {
            "index": 168, 
            "rating": "4", 
            "review": "Nice ruins, tasty guinea pig.. Don't waste your money on a taxi but take a bus for 2 or 3 soles to Tipon.The ruins are quite impressive and the area they are in is perfect to walk around for a few hours, and the cuyerias in the nearby town offer very tasty guinea pig.Tip: order a cuy al horno (oven baked guinea pig) and a cuy frito (fried guinea pig stomped flat) and share them!"
        }, 
        {
            "index": 169, 
            "rating": "5", 
            "review": "Incredible Engineering. This was one of the places we stopped during our tour. The engineering was incredible...to this day, the water still flows! Kudos to the Incas."
        }, 
        {
            "index": 170, 
            "rating": "4", 
            "review": "Incredible Inca Water and Acueduct Engineering and Agronomy Laboratory. Besides the greatness of the Inca civilization, go to Tipon to admire the engineering feats of the Inca empire building agronomy terraces and water channels"
        }, 
        {
            "index": 171, 
            "rating": "5", 
            "review": "Best Place for Cuy. Cuy was on my list when it came to tasting all Peru had to offer and local advice was to visit Tipon. Stop over for lunch and spend the afternoon visiting the tremendous archaeological site. It still doesn't receive that much traffic from tourists, in fact it may just be empty if you visit in the afternoon (most tour groups visit during the day). Very tranquil and stunning scenery."
        }, 
        {
            "index": 172, 
            "rating": "5", 
            "review": "Inca ruins and guinea pig. Not as well known as other Inca sites outside Cusco but worth haggling with a taxi driver to take you out there. The ruins are above the town of Tipon and well worth a couple of hours visit. If you want to try authentic roast guinea pig (cuy) there are a load of places on the main road where it's available. There is also a small \"zoo\" which has a number of Andean animals (pumas, foxes, monkeys and birds) although they are not kept in the best conditions."
        }, 
        {
            "index": 173, 
            "rating": "5", 
            "review": "Fantástico!. Parece cenário de filme ou de game. A água correndo sem parar pelos aquedutos em volta dos terraços e, tudo funcionando perfeitamente depois de séculos. Inacreditável!Looks like movie or game scenario. The water running nonstop by aqueducts around the terraces and everything working perfectly after centuries. Unbelievable!"
        }, 
        {
            "index": 174, 
            "rating": "4", 
            "review": "Love Tipon!. Whilst the ruins are beautiful (amazing water features), the town is also full of character. As travellers in Peru will well know, nothing there ever really goes to plan. In my short time in the town (we were there to borrow some objects from the new archives up on the hill), I helped herd sheep, pigs and celebrated the Saint Carmen with kids dressed as devils who threw at passers by. Its crazy, mad and very Peruvian."
        }, 
        {
            "index": 175, 
            "rating": "5", 
            "review": "Capac Cocha Water Ceremony. We were lucky enough to run into a Capac Cocha ceremony in honor of the water. Perfect surroundings for the ceremony and impressive water canals all over the place. After the ceremony we hiked up to the ruins which supposedly are the remains of the ancient village. The canal bringing the water down from the mountains is just stunning up there.This site is included in the general Cusco tourist ticket (boleto), but most tourists don't have the time to visit the place."
        }, 
        {
            "index": 176, 
            "rating": "5", 
            "review": "Fascinating water features!. Almost didn't go, but had an extra day with nothing to do so hired a taxi for the day to head to the ruins east. So glad we did! The water features here were very impressive!"
        }, 
        {
            "index": 177, 
            "rating": "4", 
            "review": "excellent view. Not crowded. Beautiful view of surrounding mountains. Bring toilet paper avoid bathrooms at parking area as are very dirty."
        }, 
        {
            "index": 178, 
            "rating": "5", 
            "review": "Wonderful Spiritual Energy. This ancient land has wonderful spiritual energy...If you are spiritually awakened, I highly recommend that you spend several hours there."
        }, 
        {
            "index": 179, 
            "rating": "5", 
            "review": "Sweet serenity. Because it's not the most popular of Incan ruins you can skip the crowds and simply enjoy the beauty of this great site. We didn't even take a tour, just used public transportation to be able to really spend some time wandering and enjoying all that Tipon had to offer."
        }, 
        {
            "index": 180, 
            "rating": "3", 
            "review": "Cuy and ruins. Town doesn't have much to offer, the impressive irrigation system of the ruins of Tipon though makes the trip worth it.And of course here is the place to try Guinea Pig.I suggest to take the colectivo from Cusco and blend in with the locals to get there."
        }, 
        {
            "index": 181, 
            "rating": "5", 
            "review": "Overlooked but shouldn't be.. One should consider that there is more than just Machu Picchu here. The minor ruins are less crowded and still worth seeing. Stairs are killer on old knees but my body forgave me once at the upper tiers. The ruins are well kept. The ticket agents are less stoic than MP. Hire a taxi for a day and see some of the smaller ruins."
        }, 
        {
            "index": 182, 
            "rating": "5", 
            "review": "A must see if you are a few days in Cusco. Magnificent water terraces from the Inkas. Peaceful place with a great view. You can go there in approx. 1 hour from Cusco by bus or collectivo."
        }, 
        {
            "index": 183, 
            "rating": "5", 
            "review": "Majestic. Although their not sure what the incas used this place for you get theFeeling it was an Incan Meditation resort"
        }, 
        {
            "index": 184, 
            "rating": "5", 
            "review": "Tipon you so closed to the sky. Tipon is located very closed to Cuzco, only 1 hour drive. There are a healing stone and healing water. You can see the knowlege of the Incas."
        }, 
        {
            "index": 185, 
            "rating": "5", 
            "review": "Do not miss. If you have the time, be sure to include this site in your visits while in Cusco city. Its a functioning irrigation system from the Inca times"
        }, 
        {
            "index": 186, 
            "rating": "5", 
            "review": "Incredible Engineering. Tipon was the hacienda of Wiracocha, one of the last Inkas. This place is one of the best examples of the vast knowledge of mathematics and engineering that the Inkas must have had. The water system and the perfect construction of crop terraces is really amazing. Another place worth visiting near Cusco."
        }, 
        {
            "index": 187, 
            "rating": "4", 
            "review": "Peaceful setting. This is an area of well-preserved ancient agricultural terraces and irrigation system is further away from the Cusco Plaza, so if it's not on your tour, you can take a local bus tour there. The waters are mystical and healing according to our guide. Lying in the grass meditating, several of our group fell asleep to the sound of the manmade waterfalls. Down in the parking lot workers who maintain the site had lunch sitting on a low rock wall. A nice place to visit if you have time between all the must-see spots."
        }, 
        {
            "index": 188, 
            "rating": "5", 
            "review": "Good Guinea Pig. Tipon is one of the better places to go for ruins outside of Cusco. Of course I would recommend everyone seeing Machu Picchu and the Sacred Valley, but Tipon and the South Valley are a must. A lot of tourist agencies in the heart of the city offer tours to the South Valley for about 60 soles, not including entrance fees. You could get a taxi too, and if you do you should catch it on Pavitos street, just a few blocks away from the Avenida el sol. The Tipon ruins are the most peaceful and include a beautiful view looking down. If you go on any of the tours though you may not have enough time to enjoy the regional delicacy of cui, or guinea pig. If you do have time, you will notice in the main part of the town numerous cuyerias or restaurants that serve them. Tipon is known for its guinea pig, and it beats anything you'd find in the city of Cusco proper where they serve you a slice and charge you a huge chunk of change. In Tipon, they serve the whole thing, stuffed with herbs, and alongside other sides, generally potatoes. It looks small, but it's filling, more so when the altitude cuts back your appetite. If you are really serious about trying cui, this is a place where you can't go wrong. Sometimes there are people outside waiting to greet and convince you to go to their family's restaurant. If this happens to you...I say you should go for it. It means they got their stuff up and running, and you'll be getting your cui quickly. If you have people with you who don't want guinea pig, then there might be other meat options available too, like the Cuscenian style chicharrones, not pork rinds but fried pork bits."
        }, 
        {
            "index": 189, 
            "rating": "5", 
            "review": "Perfect place to meditate. I am reluctant to write a raving review of this place simply because crowds would utterly ruin the energy of Tipon. While not as spectacular as Machu Picchu (nothing else in Peru really compares to MP), Tipon is the most peaceful, gentle place to visit in Peru. It seems largely undiscovered by tourists--and that is a good thing as the energy of Moray is not disturbed by hoards of people like that of MP. We went on a Sunday, and most of the visitors at the site were Peruvian. If you are interested in flash and glitz, this isn't the place for you. But if you want to commune with Pachamama, Tipon is the best place to do so--it is my favorite site on both of my trips to Peru."
        }, 
        {
            "index": 190, 
            "rating": "4", 
            "review": "interesting little visited site. Take a bus from Cusco to visit Tipon to see an intriguing example of Inca skill at creating intricately irrigated terraces We went on a Saturday and practically had the place to ourselves.."
        }, 
        {
            "index": 191, 
            "rating": "5", 
            "review": "Wonderful Inca's arqueological sight. You have to give time for yourself to visit this Inca's former heritage......on your way to Andahuaylillas you can do it!! It is a must!!!!"
        }, 
        {
            "index": 192, 
            "rating": "5", 
            "review": "Another Inca marvel. This was an add-on and we were very glad it was. While we are not dealing here with the grandeur of Macchu Pichu or Ollaytantambo, Tipon inspires by virtue of sheer ingenuity. That the aqueduct system would be working after centuries is amazing in itself. A good guide will help you understand remarkable features of the arrangements as well as the purported purposes. Not a major draw in itself but definitely worth the trip if the opportunity arises."
        }, 
        {
            "index": 193, 
            "rating": "4", 
            "review": "Worth it if you have the time. This place is probably the most beautiful showcase of the Inca's hydrologic knowledge; and up to today a beautiful place to be at. Actually I also look for it when flying out of Cusco; when you sit on the left side about 5 minutes after take-off. Nice outing for half a day; but not when you're only in Cusco for a few days."
        }, 
        {
            "index": 194, 
            "rating": "4", 
            "review": "Water temple. A smallish temple used by Incas on way to Cusco. Good if seen on part of tour but I wouldn't just go to see this by itself. A nice walk along a stream to the temple and if you want the full story definately get a guide"
        }, 
        {
            "index": 195, 
            "rating": "5", 
            "review": "Peace. I went there on my own.I took a bus that goes there( if you are adventurous go to Av de la cultura and check buses that go to Tipon) I did like it because I found myself surrounded by the sound of the water that flows in this pretty interesting archeological complex. It is said that Tipon was an agricultural place . The andenes are well preserved so it is worth going."
        }, 
        {
            "index": 196, 
            "rating": "5", 
            "review": "A gem!. I live in Cusco and absolutely love to visit Tipon as often as possible! Not only are the ruins impressively intact, the cuy (gunea pig) in the little villlage is the best I have had and I try to make it a few times a year just for that. There is also a cool little zoo located on the side of the mountain near the ruins. I highly recommend a visit to Tipon to anyone and everyone visiting Cusco!"
        }, 
        {
            "index": 197, 
            "rating": "4", 
            "review": "Inca perfection. Tipon is a small site, but has some great features. It's about a 30 minute drive outside of Cuco city.The area mainly consists of the platforms used for agriculture, but has beautiful water ways running through it. Tipon sits ontop of a mountain, and these water ways provide the main source of water to the villages below. The views from Tipon are lovely, and the roadway to reach this site is well paved."
        }, 
        {
            "index": 198, 
            "rating": "5", 
            "review": "Aquaducts. Very nice place, full of grass, and many aquaducts to watch.It's included in the touristic ticket, so it's a great things that you must not miss.an important thing i watched, is that it actually has many people taking care of it, many gardeners, many guards, and locals offering their cars to bring you there for S/.10. Excellent experience!"
        }, 
        {
            "index": 199, 
            "rating": "5", 
            "review": "Water, not stones - is the central theme. This underrated site is highly unique. If you thought ruins are old stones, think again and visit Tipon - here it is all about water as a source of life for the terraces. And there is so much symbolism in the way the water is arranged all along this brilliant site. I went late afternoon on a cloudy but dry day in January, and it is one of those sites where I hope to return some day."
        }, 
        {
            "index": 200, 
            "rating": "3", 
            "review": "Other ruins are better but very uncrowded and you can explore at you leisure. We paid 130 soles for a minibus and you will need the 130 soles 10 day pass. We were the only people their which was a pleasant change after MP. You need about 90 minutes there and if you do it in the morning why not stop for a Cuy (guinea pig) lunch in the town just before the ruins as it is the local speciality with Cuyerias everywhere."
        }, 
        {
            "index": 201, 
            "rating": "3", 
            "review": "Terraces and Cuy. We enjoy stopping here, not only for the ruins, but also for the Cuy. If you are interested in trying Cuy, this is a good place, you can hike around the ruins in the morning to work up an appetite and then enjoy a nice lunch afterwords. I suggest heading for the top and then explore your way back down."
        }, 
        {
            "index": 202, 
            "rating": "5", 
            "review": "Worth the effort. Slightly off the usual tourist trail, catch the bus (2 soles) to Oropesa from Cuzco and get off at Tipon. A taxi from here (13 soles) will take you up the steep and winding road (save the walking for coming back down!). A very well preserved site demonstrating Inca ingenuity for irrigation and survival in the hills. Make sure to walk up to the hill fort on the bluff overlooking the valley for terrific views of the local mountains and down towards Tipon town, Oropesa and the snow-covered mountains towards Puno. Missed this off a trip a few years ago, but very glad I came this year and I would rate it more highly than Sacsayhuaman, less of it than Pisac but still very well worth the effort. Man at the gate suggested 20 minutes to walk down to Tipon; allow an hour down as there is plenty to photograph and you'll need to catch your breadth."
        }, 
        {
            "index": 203, 
            "rating": "5", 
            "review": "A TOP HIKE. We went by car to this wonderful place. Our guide suggested to explore the ancient aqueducts on the top and from there to enjoy a lovely walking following one of the inca trails. The view of the archeological site is wonderful and after the first hike and getting to the fountains where we put our feet in the cold water renew us at the level to have the courage to walk down to the valley by the inca trail. We recommend to take your day for this and to bring some fruits and enough water due that there is nothing around. Our van was not expensive and for the four of us we payed $ 40 from Cusco. We loved the place and would like to explore the mountain in the top and as good hikers, we will return soon to Peru to visit other areas."
        }, 
        {
            "index": 204, 
            "rating": "5", 
            "review": "Surprisingly nice. This was not on our original plan, but a guide at another site recommended it and we had time, so we added it on, and it was truly lovely. Not many people there, and no guides, either. The site is an homage to water, so has channels and fountains and was quite pretty. We climbed to the top, which had surprise interesting ruins and an unbelievable view.We hired a taxi for the day and had him drive us around the Sacred Valley; as the buses all follow the same schedule, this meant we were able to go to sites when the buses weren't there. It was awesome to be able to do this (we had many sites practically to ourselves), we spent as much or as little time as we wanted at each place, and had no \"forced\" shopping experiences that others told us about. Highly recommend this approach (it cost more than bus tickets, but I'm sure we saved money in the markets!!!). The taxi was also able to drop us off at one end of a site and pick us up at another spot, so we didn't have to backtrack."
        }, 
        {
            "index": 205, 
            "rating": "4", 
            "review": "Inca ruin conserved and not full of people. Tipon is place where you can see some very Inca ruins in a very good shape yet, and at the same time, relax. The place is not full of tourists and very well conserved. At Tipon you will see some of the famous \"terrazas agricolas\", place where the Inca people used to plant and cultivate many different foods."
        }, 
        {
            "index": 206, 
            "rating": "3", 
            "review": "Fantastic Irrigation system site. On the road to Puno you willlso find this fantastic Inca irrigation system site with lots of water still flowing after 500 years of its foundation."
        }, 
        {
            "index": 207, 
            "rating": "5", 
            "review": "tough to get to but worth it. We took a day trip to the south of Cusco with stops at the Inca gate, Pikillacta, the Wari ruins and Tipon. They were all interesting and not many tourists. The road up to Tipon was under construction so they only let you go up during the lunch hour and you have to head back down by 1 PM or you have to stay up there till 4PM. We were only at the site for 45 minutes which was rushing it but glad we made the effort. The irrigation engineering was amazing and the site is well preserved."
        }, 
        {
            "index": 208, 
            "rating": "5", 
            "review": "Eat cuy, hike to Tipon. From Cusco I took a taxi to the bus terminal heading to urcos. Between s3 and s4. Bus to Tipon itself cost s2 and took 50 mins. Ask to be let off at the junction to the ruins.Walking along that road you'll come across at least two cuyeria that do roasted or deep fried guinea pig. It's so good! I had the cuy al horno or roasted version. For s30 I had a whole pig, noodles and four potatoes. The walk to the ruins is fairly straight forward. There are distance markings so just follow those. You should pass a rather sad looking zoo. That's the half way mark. Bring water. There's no store up there. The site itself is pretty massive if you're willing to walk the entire thing.Students bring your ISIC card. Like most national attractions you get a discount when you show it. Did I mention how amazing the view is from top?"
        }, 
        {
            "index": 209, 
            "rating": "4", 
            "review": "More Inca ruins. I’d already been to a few Inca ruins including MP and the sites around Cusco and Ollantaytambo in the previous week and I didn’t think there was anything unique at Tipon. However, I still enjoyed it – it was very peaceful and I spent about 2 hours walking round the site and taking photos.I travelled there independently from Cusco – caught a bus from Av de le Cultura to Tipon township and then a taxi up the hill to the ruins. There was a queue of taxis at the Tipon bus stop waiting for passengers to get off. I‘m glad I didn’t attempt to walk up the hill – the 4 km road is quite steep and it rises to 3400 metres. I walked back down; taxis passed me on the way but I didn’t mind the downhill walk.Entry to this site is included on the Boleto Turistico, or you can pay an entry fee (S/. 10) when you get there.If you wanted to see more ruins and had the energy you could catch another bus from Tipon to Pikillacqta (further along on the same road)."
        }
    ]
}