{
    "category": "Cusco", 
    "entity": "Mercado-Central-de-San-Pedro", 
    "avg_rating_stars": 4.54421768707483, 
    "review_count": 294, 
    "rating_stats": {
        "poor": 0, 
        "average": 16, 
        "terrible": 0, 
        "very_good": 102, 
        "excellent": 176
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "A true local market. This is a local market as you would find one in Lima or Arequipa but as you can find literally anything here, it is an absolutely must-do / must see.You can find cloths, food, meat, vegetables, herbs, chicha, .... name it you find it.Stroll around and enjoy the sound, smell, aromas and don't forget to take a fresh fruit juice"
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "True Peruvian flavor. This place is very cool! The juice vendors and the food counters! We had a 2 course meal of fresh Peruvian food and a drink for a total of 10 sol. We left very full and satisfied. This is a great place to get souvenirs as the vendors are there to help but they don't harass you like the Plaza des Armas. So many things to see and try."
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "A photographer's dream!. This is one of the most diverse and lively markets I've seen, with everything from food to clothes to sundries being sold. The sections for breads and cheese are extensive, and there are also a couple of casual sit-down restaurants to get a cheap meal. A feast for the senses!"
        }, 
        {
            "index": 4, 
            "rating": "5", 
            "review": "A sight to see!. We visited the market as part of a private tour of Cusco. Just a short walk from the main square. So much to see - it is a feast for the eyes! We stopped for a glass of fresh juice- delicious! If we had more time we would have returned for a more leisurely visit"
        }, 
        {
            "index": 5, 
            "rating": "5", 
            "review": "Fun and diverse. This is a delight of sights and sounds. It's fun to see the mountains of goods. Negotiated a great deal on a sweater for my daughter. They have everything from toys to food."
        }, 
        {
            "index": 6, 
            "rating": "4", 
            "review": "Lively and interesting! . We loved this market. We ate here on a few occasions, food is cheap and cheerful. The juices and smoothies were delicious and the ladies very friendly and chatty. We bought fruit, nuts, oats, eggs etc. here and it's great value, all very fresh too. A great spot to visit!"
        }, 
        {
            "index": 7, 
            "rating": "4", 
            "review": "Cheap local eats. Chicken soup...fresh fruit juice...cheese...and many more local cheap stuff... you can expect to pay less than 5sol for food.Handcraft here are cheaper than those stores around the main plaza. Bargaining is a must!!"
        }, 
        {
            "index": 8, 
            "rating": "5", 
            "review": "A huge variety of products!. Some people say that something you can.'t miss when you visit a town is to visit its market and this is a very colorful place full of all kinds of products. As a peruvian I have visited many markets in my city but going to this one in Cuzco was more than I ever expected. So many new products to see, herbs, cheese, traditional bread, flowers, meat, etc, I was also surprised by the big number of stands that serve traditional dishes and cheap prices, locals eating there and many nice people working at the market."
        }, 
        {
            "index": 9, 
            "rating": "4", 
            "review": "Must see. Everything is for sale here, from souvenirs to fresh fish, meat, cheese, fruit juices and complete meals. Great experience."
        }, 
        {
            "index": 10, 
            "rating": "4", 
            "review": "Cow's snout anyone?. Great place where all kinds of fruit, meat, herbs, spices are sold and eaten in seamingly make-shift stalls! Real people doing real business. Just wander around and try some stuff you like, the food is conveniently organised by category. A little downside is that the tourist stalls with their completely indistinctive offerings are also present and taking more and more space. The road from the centre to the mercado is nice as well, with its gate and less polished shops."
        }, 
        {
            "index": 11, 
            "rating": "4", 
            "review": "Great local market with fair prices . If you're going to be staying in Cusco for a while and you want to cook yourself a meal the San Pedro market is the place to go to get your ingredients. The market is decently clean and there is a huge variety of vendors selling every fruit/veg/meat you can imagine. There are also many handicraft sellers in the market if you are looking for souvenirs. The market is only a 5 minute walk from the plaza de Armas and is well worth a visit."
        }, 
        {
            "index": 12, 
            "rating": "5", 
            "review": "Best place to shop in Cuzco!. You can find anything at the San Pedro market....from food to clothing to household items. Get all your souvenirs for family and friends. The people are friendly, always eager to help you find what you want, and always ready to bargain. Be sure to haggle a little as it's expected and they do tend to call a higher price initially. It is also centrally located and easy to find from the Plaza de Las Armas."
        }, 
        {
            "index": 13, 
            "rating": "5", 
            "review": "One of my favourite places in Cusco. A bustling & popular market in Cusco centre, with a huge range of souvenir, produce & food stalls. I recommend grabbing a made-to-order fruit juice from one of the many stands as you enter & also visiting Mari’s food stand (#837) at the back of the market for delicious cheap food. I wasn’t sure how easy it would be to find a veggie-friendly lunch, but Mari was really welcoming & made me a plate of her ‘Super Vegetariano’ dish fresh to order - rice, salsa, fries, plantain, avocado, grilled cheese & banana chips, all for less than £2! A great place to wander round, soak up the atmosphere & look at the impressive (& sometimes unusual) range of produce on offer. While you’re here, make sure you get some Peruvian specialties – plenty of stalls sell corn, chocolate, chia seeds, maca, quinoa etc. & grab some fresh lucuma & cherimoya from one of the fruit stands."
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "Sit down for a glass of juice. Loved it here. Right past the Arch of San Francisco, a quick walk from the main square. The first thing you'll see when walking in are the rows and rows for fresh juice. Do yourself a favor - order a refreshing, fresh juice and sit down to relax. They have stools all over the place for you to take a load off, people watch and enjoy the best juice you'll ever drink.After you're refreshed, the rest of the market is filled with clothes and art, souvenirs and gifts. In the very back, you'll see plenty of places to have another seat with a very healthy serving of glorious soups and other beautiful dishes. Enjoy!"
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "Plan to spend 2 hrs ! . Just a few blocks from Plaza del Armas , this market has just about everything. Fresh flowers, textiles of every design , sweaters , teas, chocolates, and 2 Aisles of Fresh Smoothies.. choose yr favorite combo .. carrot, pineapple, orange, mango ."
        }, 
        {
            "index": 16, 
            "rating": "3", 
            "review": "Good for lunch . The market is not that great in terms of stalls and variety of products. They sell the same things as everywhere else. However one thing that is really good about the market is the many food stalls serving cheap set lunches which are available for between 5-10 soles. I recommend only getting food that has been boiled or fried as hygiene doesn't seem to be cared for."
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "A Must See!. A great place to buy souvenirs and eat lunch. Try the food stalls! You will not be disappointed. And so cheap! A full meal for about 5 Soles."
        }, 
        {
            "index": 18, 
            "rating": "5", 
            "review": "Best Source for Souvenirs, Obligatory Gifts, Indigenous Dining. Happened to be in the immediate area during one of Cusco's infrequent rainstorms. The mercado is reasonably watertight. It is divided into a central area of 2 or 3 lengthy corridors that demarcate the \"food court,\" a periphery of stalls that offer soft goods, and additional rows of other assorted merchandise perpendicular to the \"food court.\" Remarkable was the fact that although there was an enormous volume of raw foods (butchered, but unwrapped, meats, poultry, fish), cheese, breads, cakes, there were no flies on the foodstuffs. Perhaps it is the altitude. If you are an adventurous gastronome, with access to cooking utensils, there were amny intriguing offerings. If you do not seek unnecessary labor, you could sit at any of many cafes, and dine with the locals. Prices, both for meals (mainly rotisserie chicken, sopas, and fish) and souvenirs are quite reasonable. Haggling is an expected behavior. The mercado is great fun for an hour or so."
        }, 
        {
            "index": 19, 
            "rating": "4", 
            "review": "local/touristic. Easy to find a few blocks from plaza de armas .Large building with tons of food ,fresh squeezed fruit drinks , cheese, meats.Quinoa,nuts & several stalls preparing meals. Very social gathering around a meal.plus tons of touristic items,backpacks, bags,t shirts,key chains, mugs, you name it Peru paraphernalia.we where warned by several locals that the was a lot of pick pockets there.We had no trouble.Picked up a few items and enjoyed the colours,sights, & smells of the San Pedro market"
        }, 
        {
            "index": 20, 
            "rating": "5", 
            "review": "Should go. If you loke to understand the native culture that you are visiting it is a place that should be visites! I thought that amazing and very interesting!"
        }, 
        {
            "index": 21, 
            "rating": "4", 
            "review": "Fun. Good place to have fun, enjoy peruvian culture, buy some groceries and souvenirs at low prices... Full of color!"
        }, 
        {
            "index": 22, 
            "rating": "4", 
            "review": "Pretty good market. This market was fun to explore but I must say, after being around most of Peru, it is NOT cheap. Of course it's cheap if you're a westerner but compared to the rest of the markets in , say, Arequipa, Lima and other most other cities, you'll likely be paying more here than the others. Still not overly expensive and good as a one stop shop for all your souvenirs (and cheaper food) but if you're looking for the best deals the this is not the place."
        }, 
        {
            "index": 23, 
            "rating": "5", 
            "review": "A market you have never seen before!. Markets are great to experience culture. Locals are doing there grocery shopping, eating the breakfast and are haggling for the best and lowest prices. This market is no exception and a must visit while visiting Cusco. It is situated in the centre of the city and can be seen in less than an hour. You'll be amazed by the things they are selling and how products including vegetables and meats of all kinds are presented. Personally I have seen quite some market but this market knew how to trigger my senses in different ways. They offer great fresh juices which I highly recommend. If you have a strong stomach and if you are adventurous enough you could join the locals for either breakfast, lunch or dinner! This market is also a great spot for photographers. A tip would be to either take pictures on longer range, or kindly ask to take pictures. They might ask for a contribution, 1 sol is the usual amount to pay."
        }, 
        {
            "index": 24, 
            "rating": "5", 
            "review": "Amazing. Cultural. Must see. Awesome market. Highlight of my entire trip in Peru. Food, clothing, desserts, spices and seeds. Anything you could ever want is here. It shows the culture of cusco. Women are tailoring clothing in the entrance and then the typical vendors selling the fabrics and bags. Amazing fruit, meat, but stands. Cute dessert and breakfast booths. Not very clean inside at all but so rich with culture."
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "Awesome market...has it all!. Really enjoyed this traditional city market. Ridiculous mountains of fruit...all kinds. Great local specialties throughout...nuts, chocolate, keepsakes and all the usual fish, meats and produce one would expect. Some reviewers are wary about the hot food stalls but I ate my way through the place without a problem...special shout out to the \"chicken soup lady\"...you can't miss her little stall due to the tightly packed locals squatting on plastic stools while other similar stalls are uncrowded. The soup was absolutely fabulous...loaded with tender chicken, veg and noodles with an optional spicy onion/pepper garnish...the flavor and quality are unmatched...and all for 6 soles!!!One of the very best lunches we had in the whole country.Overall, a fun, fascinating and filling afternoon!"
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "Great market, especially for food. We spend some good times here during our stay in Cusco. We bought fresh fruit, vegetables, cheese and nuts. Don't miss the cheap Brazil nuts only 2 soles for 100g of the 'broken ones' ;-)"
        }, 
        {
            "index": 27, 
            "rating": "3", 
            "review": "Good experience. Walking around the market was a good cultural experience and definitely something to do in Cusco but it wasn't the cleanest place so maybe avoiding eating there."
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "Bustling market but not the cleanest place. This is a typical market in South America, where you can get pretty much everything.There are tons of different stalls though they tend to be grouped according the their specialty.It is a crowded place and I would not recommend people eating here unless you have a bullet proof stomach or have been here for a while (you will see meats and chickens as well as fish and cheeses seating on the heat for long time along with roaming dogs in the same area).It is a place to buy cheap crafts. No alpaca or baby alpaca sold here. No silver here either (it is a similar alloy called alpaca)"
        }, 
        {
            "index": 29, 
            "rating": "5", 
            "review": "Vacation. Crowded, and beware of pickpockets, but otherwise a great place to buy souvenirs, We had done our teenagers souvenir shipping from regular touristy places, and found the exact same things for a fraction of the prices, we ended up getting more things just because they were so cheap, the shopkeepers all spoke broken English so we could bargain with them and got even better deals."
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "You Want it? You Got it!. This Mercado has “everything” a shopper wants and needs. Starting with clothing, handicrafts to the actual fruits, vegetables, meats, herbal items and magic potions. The meats, including the famous Cuy (the pig) are all found here. Even if you do not want to buy, you can get around and be entertained just watching everything! Some of the items found (meat) include vats of fruit juice, roast lechon (sucking pig), tamales, pig head for soup, tamales and many other items. You will truly be entertained."
        }, 
        {
            "index": 31, 
            "rating": "4", 
            "review": "Best place for local items. We did not get to eat at the market, so we just shopped around. It is very similar to a farmers market- mostly fresh produce, a food court, and clothing. There were lots of alpaca sweaters to choose from and relatively cheap - you can definitely bargain. I love visiting farmers markets in other countries because you get a great sense of the people and culture. Worth a visit! Why 4 stars? It is very crowded... I wonder what time of day is best to avoid crowds."
        }, 
        {
            "index": 32, 
            "rating": "4", 
            "review": "Local Experience. San Pedro Market is a hub for locals (and visitors) to gather and buy produce, meats, and other goods. It's a bustling, crowded place with loud corridors and a variety of products. You could spend a few hours walking it, and it's surrounding plaza. I got mixed opinions from locals on whether or not tourists should eat the food there. I'd already gotten sick once, so didn't risk it myself. But would probably give my stomach a few weeks to assimilate beforehand."
        }, 
        {
            "index": 33, 
            "rating": "4", 
            "review": "Amamzing place for juice, food and produce.. The central market in Cusco is a veritable mix of fresh produce, juice bars, local food and souvenir shops. We stopped by most days to have breakfast juices and/or lunch at one of the many stalls. The ceviche is tasty and we love the different fish. If your on a budget you'll live here, if your not stick your head in and enjoy the atmosphere."
        }, 
        {
            "index": 34, 
            "rating": "5", 
            "review": "A place that never disappoints me . As I do as a ritual every time I go to Cusco is visit this market.Most of tourists go to have a very interesting tour: taking pics of fruits and regular life in Cusco. In my case, I go shopping from bread or cheese for family and friends and mostly, I go to drink fresh fruit juice.For less than one and a half dollar (the cheapest one) you can have almost three pitchers of juice. The most expensive one (about four dollars) contains Malta beer (Cusquena of course, we are in Cusco!!!!) so this kind of juice is a super power one!Well, the market is divided in categories, so it's and interesting place to hang out. It never disappoints you!!!"
        }, 
        {
            "index": 35, 
            "rating": "5", 
            "review": "Bargain, Buy Local, and Experience the Open Market. This market is large, colorful, active, and offers everything from food to flowers to clothing. The market opens early and winds down in the late afternoon. This market offers a chance to experience Cusco, take pictures, enjoy \"Peruvian home cooking\" at a kiosk, and ask questions. If you like bargaining, you can get items for 1/2 of the retail price. I will post some pictures of the different areas; there is an area for clothing, alpaca blankets (very nice), fruits, nuts, meats, fish, flowers, teas, coffees, sweets. Immerse yourself in Cusco."
        }, 
        {
            "index": 36, 
            "rating": "5", 
            "review": "Awesome chicken noodle soup and fresh juice. Organised into different sections/rows, the market has it all- from fresh produce to cheap tourist knick-knacks. The fresh fruit juice was a delicious. I highly recommend the chicken noodle soup (free soup and noodle refill!)! We saw locals and tourists eating there so had no problems trying it out. The 'chilli' garnish (what we would call salsa) was very tasty!"
        }, 
        {
            "index": 37, 
            "rating": "5", 
            "review": "Local market. If you like local markets this is the one for you. There are the most amazing set of ladies selling fresh fruit drinks prepared before your eyes, great value and great taste. The rest of the market is all fresh food- meat, cheese, veg, fruit. Anything you could want. Plus the Peruvian equivalent of a food court. Great place just to wander round and take in the local sights."
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "A must visit Market. A must see when you come to Cusco. I believe this is the largest market in Cusco, and certainly has a fabulous selection of foods and souvenirs at excellent pries. On Saturdays the market is more oriented to locals, but still worth the visit. Keep your stuff close at all times!"
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "You gotta visit the market - huge and bustling with loadsa cooked food options. Pretty big place. Probably 50+ ready food vendors, plus all the fresh food vendors. Also clothing/souvenirs. Its a good place to come for lunch. Recommend!"
        }, 
        {
            "index": 40, 
            "rating": "5", 
            "review": "Authentic and cheap market frequented by locals!. One of our favorite activities in Cusco! A huge market truly for the locals, with stalls selling everything from local ingredients (including freshly severed cow heads - not for the squeamish!) to some cheap tourist fare (the cheapest you'll find in Peru!). Avoid buying anything near the Plaza de Armas and just come here instead! It was incredibly interesting to see the local produce and meat products, which are organized into categorized rows. One of our favorite areas was the juice stands, where you can get fresh juices for a few soles. Don't walk away after you finish your cup - you get 1 or 2 refills!"
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "Great food! . Go here for a good and inexpensive meal. The row with fresh made juices was a favorite. Also possible to buy various souvenirs."
        }, 
        {
            "index": 42, 
            "rating": "5", 
            "review": "This is a Cusco highlight.. This was definitely one of the most interesting stops in any of the urban centers I visited while in Peru. You can learn a lot about a culture by checking out their local foods. This place is huge. You'll find meats, vegetables, herbals, textiles, shamanic goods, tourist trinkets, flowers, etc etc. If you are able, I recommend a guided tour. Lots of stories and info behind the goods you are looking at."
        }, 
        {
            "index": 43, 
            "rating": "4", 
            "review": "What do the locals eat with a side of souvenirs. Nice little market which has all the juice, meats, cheeses, nuts, and souvenirs you want. There is also a health section to fix any aliments. Not that i tried any, but it's a good free tourist attraction to look. Make sure to see Shirley at stall 81, she makes a mean juice and gives a great conversation."
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "See the locals. Visited during a Sunday afternoon so some stalls were closed up. There are plenty of souvenir stalls but of greater interest are the food stalls. Fresh juices with fruits we weren't familiar with but all delicious. Always interesting to see how cultures sell their food and how they sell it. Stall holders are not very keen to talk to you, even with a fluent spanish speaker. It is the experience."
        }, 
        {
            "index": 45, 
            "rating": "5", 
            "review": "Must see in Cuzco. The Mercado Central de San Pedro is one of the best and most traditionally authentic markets that I have been to in South America. It is unique in that it contains both trinket shops and food in one place, so you can experience real-life Cuzco all at once. Even if you do not buy anything, it is worth it just to walk around. You can tell that it is not just a tourist spot- many Cuzco residents go to the market for their every day needs. While there is a huge section of stands that serve food for very cheap prices, if you are a foreign traveler (especially from the US) I would not recommend eating there, simply because such places can make unaccustomed travelers quite sick. Regardless, it is a must visit for anyone passing through Cuzco!"
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "Almost all you or the local population could want.. The San Pedro market offers a huge variety of goods in a presumably well managed jumble of stalls selling clothes, fish, bread, meat, fresh juices, chicken meals,flowers, the usual international mix of tourist tat, etc. Many in local farming dress and some life stories in the faces of the aged. A good way to experience some of the local produce and culture, as in many parts of the world."
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "Very interesting market. Almost anything you eat in Cuzco will come from here. Might as well look at your meal while it is covered with flies. Friendly staff will explain the operation."
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "a must see. the market is 5 min from the square. there are many sights to see there! the fruit smoothies are good.. also try the corn with cheese.. and we bought cheese and bread and nuts for lunch"
        }, 
        {
            "index": 49, 
            "rating": "4", 
            "review": "Okay to spend a few hours of your day. Huge local market with a variety of different goods for sale. Meats, vegetables, fruits, flowers, section of food stalls, etc. Easy to walk to from Plaza de Armas. We took a taxi from Plaza San Blas only because they had all the roads closed and blocked on Friday the 24th because of the Inti Raymi festival and the cost one way was 6 Soles.I would recommend trying some fresh juices from one of the vendors, they are refreshing and so tasty and at 5-6 Soles, you cannot go wrong. We are pretty adventurous eaters and would have tried a bowl of the \"Caldo de Pollo\", which seemed the common food offered everywhere, but we were still pretty full from breakfast and skipped it. Just an FYI, especially for the ladies, bathroom situation is pretty nasty, they have a huge bathroom building outside, but they are those squatters holes. We walked quite a ways away from the mercado in search of a restaurant and I was lucky to find one that let me use their bathroom it wasn't that much better, but definitely an upgrade from the squatters."
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "San Pedro Market. This is a must see for those who are traveling in Cusco. This is a true marketplace for the locals. My group did not buy anything in the market place, but that was not from a lack of buying opportunities. The market is an easy walk from the central square even with children in the group."
        }, 
        {
            "index": 51, 
            "rating": "4", 
            "review": "Dynamic local market. The market is big. It contains different sections as fruit, vegetables, meat, cooked food, clothes, souvenir, etc. The fresh extracted fruit juice is delicious, and costs no more than 5 soles for two cups. Cooked food stall is crowed with locals. The food looks interesting, but I haven't dared to try one. The cloth and souvenir stalls are worth a visit. The first offered price is already at least 30% cheaper than the final offer I got from the shops in Sacred valley. Of course, the negotiation can reduce further the price. But generally speaking, I guess that it is hard to find any authentic local hand made souvenir without a very decent budget. The original packages of scarf, bags in the market show that they are made in China."
        }, 
        {
            "index": 52, 
            "rating": "4", 
            "review": "Very agressive sellers. If you visit Cusco, this is a must place to go. Many sellers. Small restaurants. Clothes. Food. Vegetables. Meat. Remember Cusco seller offer a first price , they are good negotiators. The first price is the initial offer it, then ask for a reduction. Leave the place to see other places and compare prices. Return and ask for a reduction, because is lower in other places. Then will agree. Do not buy the first price. There are places to eat cheap. But I do not recommend you to eat there. Only locals go."
        }, 
        {
            "index": 53, 
            "rating": "4", 
            "review": "Everything under the sun and then some.... This local market has 4 sections - the fruits/vegetable section, the fresh meat section, the food section and surrounding it the knick-knacks sections. The fruits/vegetables sections has a huge variety of goods - there are 3500 varieties of potatoes to start with! There are fruits from the jungle that I have not seen before, along with many recognizable tropical fruits. Roots, vegetables, tubers of all kinds - it is a riot of colors and smells for the senses.The fresh meat section is not for the squeamish - much like what one finds in Asia, freshly slaughtered meat is hung in open air, alongside innards, and heads of various animals. Can't have it any fresher?The cooked food section is apparently very popular for lunch with the locals - we did not try eating here. One popular dish is a stew cooked with the sheep's head - has a strong aroma to it, which is likely what one smells as one gets closer to the stalls. On the other side of the market though, are the fruit juice stalls where fresh fruit juices are extracted - delicious. One special drink consisting of a mix of \"stuff\", mainly fruits and root extracts and dark Malt Beer, called \"especial con malta\", is a popular drink for energy and health benefits. It may seem strange to mix malt beer (stout), with fruit juices, but it actually tastes pretty good - try it! But be forewarned that it is pretty filling and you are drinking beer even though diluted, so there is alcohol in the drink! But definitely worth trying and yumm!The last section is the section where they sell all sorts of knick knacks - good deals to be had if you are willing to bargain, and shop around. An interesting insight into what the local Cusco-ans eat, drink, buy especially if you can snag a local who will explain some of the \"so called strange\" (unknown) stuff to you."
        }, 
        {
            "index": 54, 
            "rating": "4", 
            "review": "Fun to Visit to Shop and Eat. A huge market that's almost a little overwhelming. Tons of clothes and food and restaurants and all sorts of souvenirs. Hard to haggle with the vendors though which I didn't understand based on my previous trips to markets in other countries--perhaps a misunderstanding on my part. Had a lot of fun just walking around and bought a fun hat but did not try any of the food, though there were so many cheap smoothie and food options!"
        }, 
        {
            "index": 55, 
            "rating": "4", 
            "review": "Feel the local vibe. This market is a place to embrace the local culture, especially the food. A lot of different fruits, meats, and dishes are available. Have a nice tropical juice! very delicious and cheap."
        }, 
        {
            "index": 56, 
            "rating": "5", 
            "review": "Love this place!. We went here for breakfast almost every morning! Mostly locals and everyone is very friendly. There are tons of places to eat, from soups, to juices to ceviche. It was a great way to start off our days in Cusco!"
        }, 
        {
            "index": 57, 
            "rating": "5", 
            "review": "Great mercado for shopping and eating. The San Pedro Central Mercado in Cusco is worth a visit. It's not far from Plaza de Armas. Between souvenir shopping and eating, we spent almost two hours at the Mercado on our first visit. And, we liked our lunch so much that we went back to the Mercado for lunch another day.  This local market sells food, fruits, flowers, clothes and souvenirs. Vendors are willing to negotiate prices for souvenirs. Prices are a little cheaper than at the Pisac market, but I'm not sure that the quality is better. But who can really tell how much alpaca is in a sweater or scarf."
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "One of the best experience in Cusco. This place really worth a visit! It is a proper market with various type of fruits, food, vegetable, fish, etc., but I liked this market more than any other I have seen in Peru or Bolivia. It is a great place to have there delicious and cheap lunch and also if you want to try best smoothie I can fully recommend it. Try smoothie place number 59, Rina, she was absolutely amazing, she even gave us free drinks during our second visit and was trying to speak with us all the time, even when our Spanish skills were really, really bad."
        }, 
        {
            "index": 59, 
            "rating": "5", 
            "review": "A must see!. I loved my time in the Mercado Central!! Be sure to stop and have a smoothie. One will easily serve two to three people. While some may be put off by the sights in the meat aisles, it gave me an appreciation for Peruvian nose to tail eating. Lots of shopping available for tourists. Shopkeepers here were much less aggressive than at the handicrafts market near the train station. Do yourself a favor and use the restroom in your hotel or at a restaurant prior to your visit to the market. The only restrooms available are public squatters."
        }, 
        {
            "index": 60, 
            "rating": "4", 
            "review": "Great spot for a visit. You can buy practically anything here. It is a busy place of commerce for locals with trading in all sorts including all types of protein and produce, flowers... They have lots of street food though I didn't try any. There are plenty of souvenir shops and they are much cheaper than most other places. My husband bought a hat here and the exact same hat was almost three times the price in Plaza de Armas. Wander through and see the weird, the wonderful and the rest of it."
        }, 
        {
            "index": 61, 
            "rating": "5", 
            "review": "Great place to visit-and Free. This is a working Mercado where the locals go to pay their food. Here you will see everything, from Fried Guinea Pigs, to more types of grain and fruit than you can identify, as well as local food counters were they provide the local food dishes for sale. Please be respectful of the shoppers and sellers. Perfect break from the rest of the tour spots."
        }, 
        {
            "index": 62, 
            "rating": "4", 
            "review": "Interesting market offering everything from fruit to meat to crafts. This was a fun stop during our time in Cusco. It's a proper market filled with fresh fruit, vegetables, fish and meat. You can buy dried fruit and nuts, too, which made for nice snacks while trekking. We visited at the end of the day, and I'd really recommend going first thing in the morning. The meat sits out on the counters all day and the smell was...interesting. Worth a stop to grab some snacks or cheap arts and crafts."
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "A highlight of Cusco!. We headed back into this market over and over - fresh fruit for breakfast, a quick 'street food' lunch, nuts and dried Inca berries for our Inca Trail trek. Recommended!"
        }, 
        {
            "index": 64, 
            "rating": "5", 
            "review": "A must see!. The market was amazing to visit. You can find anything here! Make sure you try a juice from one of the juice ladies!"
        }, 
        {
            "index": 65, 
            "rating": "4", 
            "review": "Great Souvenir Shopping. San Pedro Market is not far from my hotel Tierra Viva Cusco Centro. This local market sells food, fruits, clothes and souvenirs. I went there for shopping the souvenir. Here we can find Cusco Region including Machu Picchu souvenirs. The price is cheaper than in Machu Picchu market."
        }, 
        {
            "index": 66, 
            "rating": "4", 
            "review": "Good market!. A nice, well sectionised local market with lots of cheap and good food for lunch. Join the crowd! Just sit where the locals sit and don't hesitate to queue. The market closes around 5PM."
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "a place to choose a wide variety of fruits. if you like to eat natural, this is your placer...from simple juices to the most elaborated peruvian food at good prices and all fresh from the country."
        }, 
        {
            "index": 68, 
            "rating": "4", 
            "review": "Great Fun Shopping and Learning More About Local Culture. This is the third market we have been to on this trip and it is one of the best. You need to explore markets like this to really get the local color. Also there are plenty of photo opportunities as well as lots of souvenir shopping."
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "Fabulous Market!. Located not far from Plaza de Armas this market has everything!From artesanal clothing, souvenirs to little cafes where you can grab a bite to eat/drink to buying all the local produce including meat, fruit, veg, nuts, seeds etc!It's a fabulous market & the prices are great too - don't waste your hard earned pennies on buying souvenirs from anywhere else - save them & go to San Pedro Market - it's cheaper & you can definitely get a bargain or two!A must go to market whilst your in Cusco!"
        }, 
        {
            "index": 70, 
            "rating": "4", 
            "review": "Great, cheap food and souvenir market. The San Pedro market has a souvenir area where you can buy essentially anything to bring home from Peru. It also has a food section which offers excellent basic meals at cheap prices. This is a great place to get a local bite, but not a good place for someone who wants a restaurant atmosphere, is looking for service, or wants anything fancy."
        }, 
        {
            "index": 71, 
            "rating": "5", 
            "review": "Great market!. Don't waste your money buying souvenirs and food (quinoa, chia, kiwicha, pecans...) in Lima or in any other place for that matter... This market has it all at a much better price! 12 soles for 1kg of red/black quinoa, 5 soles for 500g of white chia.... I can only say that I regretted not having bought more!"
        }, 
        {
            "index": 72, 
            "rating": "4", 
            "review": "Get your souvenir shopping done under one roof. Take the stroll down avenida Del Sol to this swap meet type of environment with hundreds of different vendors. There is a lot of repetition in merchandise - Peruvian dolls, jewelry, blankets, sweaters, shoes, bags, purses, textiles, and all sorts of souvenir type trinkets. Basically the same things that are found all over Cusco under one roof and basically for the same price. Adult sweater 35-40 Sol, Childrens 25-30 Sol. But remember things are not authentic. They will say for example that the sweaters are alpaca, but they are actually acrylic. It's a great place to buy cheaper stuff if you want the look of Peru for less. Vendors are not too pushy to sell. If you are not interested, just say \"maybe later,\" which is code for I'm not interested. I would recommend this place for souvenir shopping."
        }, 
        {
            "index": 73, 
            "rating": "5", 
            "review": "Cusco must see. The market is definitely worth visiting for anyone interested in seeing the local culture or buying local souvenirs. The variety of foods available in the food court offers a tasty treat"
        }, 
        {
            "index": 74, 
            "rating": "5", 
            "review": "can't miss this market while in cuzco!. this incredible little market is the best place to buy everything! try exotic local fruits and amazing soups and juices, all at ridiculous prices! you can also buy magical implements at various shamanic stalls, including San Pedro cactus, mapacho cigs and even ayahuasca! the clothing here is also high quality and deals abound. friendly people here will help you, embrace you and give you directions to anything you need! even if it's a suitcase to take home all your stuff!"
        }, 
        {
            "index": 75, 
            "rating": "5", 
            "review": "Cheapest and Best. You should be able to find anything you need at this place, and at the right price too (after a little haggling, of course). Natural fruit juices, clothes, souvenirs, dried fruit, meat, eggs, veggies, chocolate, frog legs, chicha... it's all there. Especially great is the local flavor; there are some tourists, but it's dominated by the locals and you can actually feel like you're getting some different culture.Also a great place to stop for lunch. 6 soles for a delicious menu? Yes please!"
        }, 
        {
            "index": 76, 
            "rating": "4", 
            "review": "Don't miss a visit to this market. Amazing displays of every day life in Peru, anytime spent walking through this market will be rewarding. The displays and varity of fruits will impress and the prices are so cheap. Fresh fruit juices are a must to try. The variety of goods to buy is unlimited , we purchased leather hand bag, authentic costumes, braids and fruit. Certainly a highlight to experience ."
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "Great place to find anything you need. You want cheap food, you get cheap food. You want clothes, you get clothes. There is everything in this market. It's one of the places where you really feel you're with the peruvian people. There is a lot of tourists too, but you can see when you enter that it's a place where locals go too."
        }, 
        {
            "index": 78, 
            "rating": "5", 
            "review": "the stomach of the town. a typical market where peruvians go for luch and gringos to drink a very healthy, i met one guide of qorianka who told me about the lares trek in his agency QORIANKA tours, i accepted and dont regret, it was the most thrilling & amazing tour of my visit hiking on faraway tracks, it was a nice service and very dependable."
        }, 
        {
            "index": 79, 
            "rating": "4", 
            "review": "Half Food, Half Crafts market. Lots of food options here. You can buy juices, Ceviche and LOTS of meats. They have all the body parts of many animals here for sale. There are also crafts stalls which pretty much all sell the same thing, same same but different. This place is definitely worth visiting. Oh FYI the same person who designed the Eiffel Tower also designed this building, he made it open so it wouldn't smell as bad."
        }, 
        {
            "index": 80, 
            "rating": "4", 
            "review": "Amazing place. Great if you wanna check locally products and have a cheap meal! Mine was 5soles in one of the street food stalls!You can find eeverything in the market!I did not enjoy that much the corridor where the butchers are though....very smelly!Amazing fresh pressed juices corridor!"
        }, 
        {
            "index": 81, 
            "rating": "4", 
            "review": "Cusco: eat poquito, see and buy a lot. A Peruvian told me the rules for surviving the altitude in Cuzco: Comer poquito, caminar poquito, dormir solito\" Eat little, walk just a little and sleep alone. Still, if you have enough air, you can't miss the market, because you see all the colours, the food, the people and the best prices for handcrafts. Among its niceties, you get signs in three languages: Spanish, English and Quechua."
        }, 
        {
            "index": 82, 
            "rating": "3", 
            "review": "I love Markets this one not so much. Crowded, Little Far and Smelly . I usually love markets but not this one, just a few shopping stalls, this market is big but almost everything is food. so If you are going craft shopping you better explore the streets of cusco (behind Plaza the Armas on the way to San Blas) much better."
        }, 
        {
            "index": 83, 
            "rating": "4", 
            "review": "Worth a visit, cheapest meals in town. El \"mercado de san pedro\" is a covered food/souvenir market next to San Pedro church. Here you can try a lot of different peruvian meals for the cheapest price in town. I m teavelling on a budget and i loved it. 5/6 soles (peruvian currency) for a soup and a first course, plus a glass of muña/coca leaves tea. Great! You can also buy grocery or peruvian souvenir. Don t miss it!"
        }, 
        {
            "index": 84, 
            "rating": "4", 
            "review": "Everything you need.. Great local market with amazing sights and sounds. You can buy almost anything here at local prices -- cheese, chia seeds (US$ 2 for a large packet), quinoa, fruits and vegetables, juices, teas, alpaca sweaters, tourist tee-shirts and more. At the far end of the market are the meat sellers and there are some interesting sights to be seen there. Not for the squeamish though.Many locals can be seen buying groceries and having a meal there. Cooked food is available and there are benches you can sit and eat by the counters. Fruit juices seem to be a thing here. There are rows and rows of them."
        }, 
        {
            "index": 85, 
            "rating": "5", 
            "review": "Good market. Spent several hours at this market. Very easy walk from Plaza de Armas. It is the place where locals do their shopping and have breakfast and lunch. The Fruit drinks are freshly made and excellent. Worth visiting and enjoying the local flavor."
        }, 
        {
            "index": 86, 
            "rating": "5", 
            "review": "You have to be there to believe it. My husband and I always visit local markets - we feel that food represents culture and we love learning new things, how food is prepared and new ingredients to try. This market is not huge but very colorful and not a tourist trap. The locals shop here. I tried on a beautiful Peruvian hat and they did not have my size - while I walked to other stalls the vendor found one for me and traced me down with no pressure whatsoever and gave me great price! I also was looking for fresh nuts and dates and three of the vendors could not have been more helpful. Even if you don't speak Spanish a bit of pointing and tasting goes a long way!"
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "Very tasty breakfast!. We had such a rewarding breakfast here! This is the perfect place to start your day. It has a very cultural feel and the food here is much more local and less tourist than we had anywhere else. Also, great prices. About 5-10 soles a meal."
        }, 
        {
            "index": 88, 
            "rating": "5", 
            "review": "Great Indoor Market. Large Indoor market area with various interesting food options, an emphasis on meats, cheeses and on fruits and plenty of fruit juices and smoothies to sample"
        }, 
        {
            "index": 89, 
            "rating": "5", 
            "review": "Exotic Fruits! Local foods! And more.... I went here and tried exotic local fruit like Lucuma, Tuna(cactus fruit) & cherimoya(a different kind of custard apple from what we have in Asia. The market has everything from food, juices, grains, dairies, souvenirs, breads, etc. After we explore the market, we went outside to get emoliente, a traditional Peruvian drink believed to have some kind of health benefit. Recommended!"
        }, 
        {
            "index": 90, 
            "rating": "5", 
            "review": "Incredible cheap eats and local culture. My sister and I went here two mornings in a row for incredible breakfasts. This isn't a super touristy place (although we didn't feel out of place) and it's a great place to watch locals doing their shopping and getting a bite to eat. There are little stalls where you can sit and get food cooked for you while you wait (get the hot chocolate!) and an incredible area with juice bars. Even though I was careful about eating raw produce in Peru, the juices are made fresh without water from peeled produce and we were fine drinking it two days in a row. Come hungry!"
        }, 
        {
            "index": 91, 
            "rating": "5", 
            "review": "Wonderful local market with products ranging from fruits to hats. Very nice market, offering cheap food and souvenirs and clothes. Also good to take photos. Definitely go there:)"
        }, 
        {
            "index": 92, 
            "rating": "5", 
            "review": "A real market.....Must visit.. This is a must visit market in Cusco. We had a fresh squeezed juice in these markets....A great start...Walk around and feel like a local. We went with a guide who showed us around........It is busy so carry gear safely."
        }, 
        {
            "index": 93, 
            "rating": "5", 
            "review": "Festive adventure for your eyes and stomach!. Markets tend to be very vibrant and exciting places for certain \"2nd world\" countries and this is definitely a gem of a market place!I recommend u visit the market early on in your visit to Cusco for many reasons.As the start of this review mentioned...its exciting! This place is filled with food stands that serves local dishes for cheap, and stores that sells local produce. Very colorful and full of aroma! You get to sit down with locals and tourists alike and order a dish from visual displays from one of the many food vendors. Try a cerviche stand and watch how they put together this \"fish salad\" dish! Ingredients are all put out in the open in plastic containers and the market place isn't the cleanest place in the world...dont come here if u only tolerate restaruantsAfter a meal and u explore the rest of the market and check out some fresh produce u can try. I recommend everything from the fresh fruits, nuts, bread, and even quinoa if u got cooking ultilies in ur accomodation. Eating and buying from the market is definitely your thing if ur on a budgetYou can also wander the streets surrounding the market building itself as the area is one big market area. There is some desert/sweets vendors on one of the streets that u can find easily. Some of the cakes looked REALLY good and dirt cheap tooone big WARNINGDont go to the toilet there. I'm an asian and dirty toilets aren't new to meBut that public toilet is horrendous. U pay 1-2pesos to use it and the place is probably the dirtiest place u can imagine. They even got a big plastic barrel filled with water that people wash from.TIP: go to the toilets before u make ur way to the market. Bring some hand sanitizerOtherwise the market was awesome!"
        }, 
        {
            "index": 94, 
            "rating": "4", 
            "review": "Interesting, food, sourvenirs. come here to check out interesting produce, experience a large local market and buy the souvenirs you see all over the city at cheaper prices. Located close to the tourist centre of the city, adding this in to our day felt cultural, fun and very worthwhile.Note: bargaining by around 10% accepted"
        }, 
        {
            "index": 95, 
            "rating": "5", 
            "review": "A great time to wander by yourself. By the way, some sections are not for the smell-sensitive. There is a section of cheeses, meats and chocolates, along with a clothing, fruit and eatery section. I got my backpack handle repaired there and my shorts mended for 2 and 1 sole, respectively.I went there for my final souvenir shopping and saw the best prices there. It also helped that I shopped a lot of goods at one stall and asked for a discount.Wander in there and spend some time looking if you're not in the mood to shop. Really colorful place."
        }, 
        {
            "index": 96, 
            "rating": "5", 
            "review": "So much fun. This a very worthwhile stop. Well, we always stop in public markets everywhere. Take the time to ask questions about things that are unique because they will love to inform you when you show an interest."
        }, 
        {
            "index": 97, 
            "rating": "4", 
            "review": "Shop around to avoid getting ripped off!. San Pedro Market is a great place to get souvenirs. (It’s not just food and fruit vendors). It was also open on a Sunday, when most other things are closed in Peru. (Though not all of the stalls were open)However, because the vendors know that their clientele is mostly tourists, many will quote you some pretty high prices. For example, I wanted one of those tiny alpaca magnets (that are probably made out of synthetic instead of actual alpaca). Everyone was quoting 2 soles, when I know for a fact that my friend bought them for one. It’s kind of exhausting, but I hate getting ripped off. Alternatively, you don’t need to go to San Pedro to get souvenirs. I found that poking my head through some courtyards near the Plaza del Armas was also good, and sometimes even cheaper. Everyone pretty much sells the same stuff, so just start searching early!"
        }, 
        {
            "index": 98, 
            "rating": "4", 
            "review": "A Colorful Experience. The San Pedro Market was interesting to visit with all of the different stalls, we really enjoyed walking through the fruit area as there were many fruits that we had never seen or tried before. Lyle the owner of the B&B we were staying at was with us and purchased a few of the fruits to try with breakfast, theChirimoya was my favorite. Lyle also took us to a lady at the bottom (dining) area where we tried some doughnut like things called picarones, which were sweet and delicious, we were told that they are made from Pumpkin and sweet potato."
        }, 
        {
            "index": 99, 
            "rating": "4", 
            "review": "where the locals go to trade their crops. We were probably on the few tourists walking through this market. This is where the locals go to trade/sell their chickens, potatoes, grains with the locals. No bathrooms. Great for looking/tasting some fruits that you've never seen. Don't expect to buy anything here. Very interesting stop. Go with your guide and not alone!!"
        }, 
        {
            "index": 100, 
            "rating": "5", 
            "review": "Fun place to stroll through and get authentic flavors of Cusco. An authentic market where the Cusco local folk buy a lot of their food. They have a number of food courts for eating food. It was relatively crowded when we were there on a weekday morning. Unfortunately I didn't have the time or the courage (or a strong stomach) to try anything here. I knew that I had to be careful about eating the fruits or probably even the fruit juices. There are a number of stalls for souvenirs, but the market did not seem to be a typical tourist trap. The San Pedro Market was a fun place to walk around and get a good idea of the culture of Cusco and Peru in general by experiencing the food and other supplies that are here for sale."
        }, 
        {
            "index": 101, 
            "rating": "4", 
            "review": "Large market with variety of stalls. The market is huge with both outside street vendors and inside stalls. There are a variety of stands selling flowers, cheese, meat, bread, fruits, chocolate, dried goods, etc. There is also a cafeteria in the back of the building.\nThis place is definitely worth a visit."
        }, 
        {
            "index": 102, 
            "rating": "4", 
            "review": "Local market. Central market in Cusco, you can walk from the Plaza de Armas. I went there for breakfeast a couple of times and the juices are worthed, they serve you more than one glass. You can also buy fruits, meat, spices..."
        }, 
        {
            "index": 103, 
            "rating": "5", 
            "review": "Worth a visit. Its a place worth the visit. You can get delicious juices, souvenirs, food, etc. It´s the right place to see the daily life of the cusco people.\nYou can spend a morning or afternoon there. And it´s close to the main square.\nDon´t miss it."
        }, 
        {
            "index": 104, 
            "rating": "5", 
            "review": "Absolute must visit . San Pedro market is simply a must see.It's a large covered market that has everything imaginable for sale. The sights and smells overwhelm your senses.From unrefrigerated butchery to florists, San Pedro cactus and mummified Llama foetuses to sweet and sticky cakes......every turn, every stall has something to see.Just remember as others have written, it's a working , living market not just a place for curious visitors....I loved it here. And, as it was on my door step so to speak I visited daily.I also wandered the market stalls set in the avenues and alleys of Belen, again a fantastic experience despite what you might read elsewhere. Take a few simple precautions, such as nothing in back pockets tips things and be mindful of pickpockets and you too will enjoy this area of Cusco.Just a final note. I spoke to a number of people who where horrified at the meat products for sale and the lack of refrigeration ....,I asked them where they thought the expensive restaurants around Plaza de Armus purchased their meat....,Tesco or Waitrose ."
        }, 
        {
            "index": 105, 
            "rating": "5", 
            "review": "Incredible Market!. This market is in San Pedro neighborhood in Cusco. We walked from Plaza de Armas. It's a huge market, very worthwhile going. They have just about everything from spices, clothing, flowers, chocolate to cow's heads. It's a must see if you like markets and want a taste of culture. Highly recommend going."
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "Something for all the senses. Be prepared to experience shopping in a whole new way. Lots of stuff to see, smell, touch and taste!"
        }, 
        {
            "index": 107, 
            "rating": "5", 
            "review": "Fabulous Market for food and provisions.. So many sellers. I tried the sweet empanadas from a sweet young girl who was working the stall with you adorable sister. Had such a great meal with the locals-the chicken is amazing in peru and a must try. for both cultural and food reasons you should visit for sure."
        }, 
        {
            "index": 108, 
            "rating": "5", 
            "review": "Must visit and experience but respect the locals re taking photos. We visited the markets a number of times. So much energy, so much to see, so much to buy or taste. The black corn was on our list to find. The store owner was marvellous in letting us take photos. Another great were the rows of juice stands. Ladies make and sell juice on order. We had one on each visit. The seafood is another must to experience"
        }, 
        {
            "index": 109, 
            "rating": "4", 
            "review": "You can get anything you want - meals, ingredients fruit, veg, meat, breads. Great place to visit. If you are hungry eat in. Great colours of flours, veg. Tourist crap if you need it too."
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "Hard to believe the variety. An amazing variety of Corn, Potatoes, and Quinoa on display and it's all for sale. We visited on a Saturday and the place was packed with people shopping for their Sunday meals."
        }, 
        {
            "index": 111, 
            "rating": "4", 
            "review": "An interesting place to visit. This was our first visit we did in Peru. With our guide we saw nice interesting spots with varieties such as spices, vegetables, fruit and marvellous smoothies."
        }, 
        {
            "index": 112, 
            "rating": "4", 
            "review": "Small market, cheap food if you are brave enough to eat there! 😵. It's a good size market, I live in The Hague and we have a much bigger market. Some of the souvenir shops are cheap but you can find cheaper somewhere else. Go on Sunday mornings, it's full of locals who come to eat there after coming from the church. I did take breakfast there but it was bread and cheese and a cup of coffee. Very cheap! And if you like fresh juice go there. For 5 soles you get 3 glasses of fresh made smoothies! I used to go there every day, also to chat with the ladies. In a restaurant you pay 7 soles for 1 glass! I did buy some fruits and nuts but outside the market they are cheaper. Maybe because I am tourist that why I get charged double. Go to my friend Kathy for a smoothie, she is at the entrance of the market. And if you dare to eat there, meals are very cheap."
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "Quite a site. For Tourist and Locals.. A local market with many gifts, food, and items for both tourist and locals. Many stands for lunch or a fruit drink. A great culture experience in the center of the city."
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "Picturesque Cusco Market!. In this market you can find a great variety of things; many of them are not common in some other cities of Peru; and, of course, in the world. Once you're there, try some really fresh fruit juice; have a look at the different types of corns and potatoes; and much more!"
        }, 
        {
            "index": 115, 
            "rating": "4", 
            "review": "Fresh Fruit!. Best place in town for fresh fruit. Anything you want or want to try......you can get it here! Also has a lot of trinkets great at this time of year for Xmas!"
        }, 
        {
            "index": 116, 
            "rating": "3", 
            "review": "Ok - if it's the only market you gonna see in Peru. The market itself is big and has sections for souvenirs as well as normal everyday products and food. With a big focus on tourists the place feels a bit fake (it isn't). But you still get a glimps of how more normal markets elsewhere in the country look like. Good thing is that you find some goods (esp. food) cheap here. So pay this market a visit at least once while in Cuzco."
        }, 
        {
            "index": 117, 
            "rating": "4", 
            "review": "Bustling with Energy. Our tour guide brought us through the market and stopped at some stalls for a few demonstrations. It is the heart of the city and a fantastic place to pick up some food at the prices the locals pay."
        }, 
        {
            "index": 118, 
            "rating": "5", 
            "review": "Street food at its best. Cheap way to eat great food feeling like a local. One of the few markets in which it didn´t turned out to be a artisan flee market.Go for the food court in the back. I went for the Ceviches and later stopped by a sort of milky drink stand, which I knew after drinking to be a sweet quinoa-cinamon drink."
        }, 
        {
            "index": 119, 
            "rating": "5", 
            "review": "A little dark but the heart of the city. Best place to buy fruits/food and the cheapest place in town to lunch (5pen). We often took our breakfast there and even bought sandwichs for our treks"
        }, 
        {
            "index": 120, 
            "rating": "4", 
            "review": "Interesting market. It's always very interesting to visit markets whilst travelling as it reflects the local culture and this one was no exception. I liked how they sectioned the food stalls so they all sold the same type of food, easy to see which type of food or which food stall is popular"
        }, 
        {
            "index": 121, 
            "rating": "4", 
            "review": "Cultural Tour!. It has everything.. clothes, fruit & vegetables.. local cheese..You´ll get another percpective of the city. Go walking through all the passages. Could be an unpleassant experience to see the hanging pigs and meat and smell them.. but it won´t take too long if you walk fast.Some of the things you can do there: Have your clothes sewed.. drink a fresh juice for a ridiculously low price.. and ofcourse, have luch at one of the food places."
        }, 
        {
            "index": 122, 
            "rating": "5", 
            "review": "Mucha variedad de productos a muy buen precio / Excellent variety of products at very good price. I enjoyed very much buying fruits, fresh juice, having cheap lunchs, walking there is an experience itself"
        }, 
        {
            "index": 123, 
            "rating": "4", 
            "review": "This is a must do!. A very interesting market with so many sights and smells. This market is open daily and is a feast for the senses. There are numerous vendors under one roof selling everything from tourist souvenirs (hats, scarves, key chains, wooden wares, ceramics, etc.) to pig heads. There is a wide variety of grains, fruits, vegetables, meats, breads, cheeses, as well as grocery type items like jam. We didn't sample the food, but there was plenty of opportunity to try the local soup or fresh juices. The \"meat department\" was interesting as there was a variety of fish, chicken, pork and not sure what else.Even if you don't buy anything it is a great way to spend a couple of hours simply wandering around looking at the different items and people."
        }, 
        {
            "index": 124, 
            "rating": "4", 
            "review": "A slightly more authentic view of Cusco than most of the downtown!. San Pedro market is within 5 minutes walk of the main square, and house stalls selling all sorts of stuff from touristy trinkets and clothes (of course) to fresh produce, bread etc together with rows of food stalls where locals eat cheaply across the day. (Be careful of the hygiene issues though if you are tempted!) On all sides of the market itself are street vendors selling all manner of things including more touristy tat for sure. As you drift down hill around the back of market, things really get interesting as you see street upon crowded street of curb side sellers peddling all sorts of fresh produce etc. This is perhaps more interesting, but also be mindful the streets are crammed with people, cars and vendors so the risk of the odd pickpocket may rise accordingly!Enjoy!"
        }, 
        {
            "index": 125, 
            "rating": "5", 
            "review": "Great market. San Pedro market has a lot to offer.From typical tourist wares (at much better prices than Plaza De Armas) to a great place to get cheap traditional food (literally eat where the locals eat - soup for 2.5 soles) - it's worth the visit."
        }, 
        {
            "index": 126, 
            "rating": "4", 
            "review": "Definitely worth a visit to San Pedro Market. We visited after walking the Inca Trail, so we were comfortable in buying fruit, cheese, olives and bread. The prices were reasonable and we didn't need to do much bargaining.The market is grouped into aisles for various items ranging from flowers, bread, meats, beverages and even souvenirs. We were able to get our mementos at around 20% less than the shops closer to the main plaza de aramas."
        }, 
        {
            "index": 127, 
            "rating": "5", 
            "review": "Love, Love, Love this market. Every time I am Cusco I head to this market. It is one of my most favourite places to go in the city.They have a number of juice stands where ladies wave you in for a fresh juice. I always stop at the same stand - \"Urbelinda\". She's on the end. If you order a juice, just make sure you don't order the Combo Mixto (3/soles) as it comes with water which may not be good for your stomach. All others are pure fruit. I like the orange, maracuya & mango.There are also a lot of vendors selling everything from fruit to clothes to meat & cheese. Very interesting to see how the people of Cusco shop.In the back there is a food court of sorts where you can get very cheap food.Although I have never had an issue, make sure you keep your eyes open in the market and keep things in your inside pockets. As it is crowded, there can be pick-pocketing."
        }, 
        {
            "index": 128, 
            "rating": "5", 
            "review": "So exotic the shamanic booths are the best. This is the most wonderful place. I always get all my fruit, vegetables, bread and coca leaves here. It was named for the near bye church which was name for San Pedro Cactus. Which you can buy there.."
        }, 
        {
            "index": 129, 
            "rating": "4", 
            "review": "Fun, to walk around and reminded me of markets in Mex. Just a regular market in Latin America. We walked around and purchased, salt, coffee and chocolates. We also had a freshly juiced drink, a must."
        }, 
        {
            "index": 130, 
            "rating": "5", 
            "review": "Small and Peaceful town. Great to stop by to see the traditional culture if you get some time. Pure and Quiet. Shopping for local food and souvenirs."
        }, 
        {
            "index": 131, 
            "rating": "4", 
            "review": "Interesting market to have some food and the best juices in the city!. If you have time I really recomend you to visit the market, you can eat very cheap and you can have a very good juice in the corresponding section."
        }, 
        {
            "index": 132, 
            "rating": "5", 
            "review": "Unique experience. Loved this market! This is where the locals shop. It is divided into sections and you can find everything there! Even bought a candle and lit it at a shrine there for my mom. You can easily spend a few hours there. No need to book a tour, taxis will take you. It only cost 4 sols from our hotel for four people. Get your fare negotiated up front. The local food served there is tasty. Have fun there! I found lots to buy."
        }, 
        {
            "index": 133, 
            "rating": "4", 
            "review": "Fun place to shop. We actually did 95% of our souvenir shopping here. It's a fun place to shop, people watch and drool over the selection of food! Unfortunately, my sensitive tummy does not allow me to eat market food but I did see many tourist eating at the stands and juice bars. Prices are excellent here for souvenirs. I walked away with knitted purses, bowls and hats."
        }, 
        {
            "index": 134, 
            "rating": "5", 
            "review": "Must see. Sept 18This was the first stop of the Cusco city tour. After a very good buffet breakfast with a la carte hot egg dishes, we left our well-located Hotel Palacio del Inka at 8:00 with our wonderful guide Jimmy and driver Alejandro.As others have mentioned, this market has everything you want from produce, food (eg, bowl of chix soup is 5 soles), souvenirs, and meats. I bought 1/2 kilo of Peruvian (Tunkimayo) coffee for USD$13.Of interest to me were prepared packages of gift offerings in the native offering, Pachamama, that worships Mother Earth and gives thanks for everything life has given us. The Incan priest, or shaman, Roberto Flores Solis, had opened two similar packages for his ceremony to us five days ago in a eucalyptus grove just above Cusco. It was deeply moving and memorable."
        }, 
        {
            "index": 135, 
            "rating": "4", 
            "review": "Worth a visit. This market is worth stopping by. It has amazing produce and even a warm food section. Good place to get cheap touristy items like sweaters and mitts aswell. Even if your not looking for anything in particular it is fun to walk around and explore."
        }, 
        {
            "index": 136, 
            "rating": "5", 
            "review": "Explore, eat and live like a local. If you love exploring and discovering places where locals go to, San Pedro mercado is the place to come to, come early if you can. Here you will find the freshest produce and raw ingredients used to cook all the amazing Peruvian food. You can pick up souvenirs at really great prices and if you're feeling hungry (and your stomach is ready) try some of the dishes that are freshly prepared everyday. A wonderful place to come see and taste the delights that Cusco has to offer."
        }, 
        {
            "index": 137, 
            "rating": "3", 
            "review": "Visit in the morning or early afternoon. We visited the market late afternoon, and almost all the stalls were already closed. To get the full experience, come earlier in the day or in the early afternoon to avoid disappointment!"
        }, 
        {
            "index": 138, 
            "rating": "5", 
            "review": "Amazing produce. We came to San Pedro Markets with our guide Darwin from Condor Travel and Nemesia our cook for our culinary cooking class. Nemesia, being local took us to all the stalls to buy ingredients we later made into a fantastic lunch at her place. We loved it so much we went back later and after reading another review tilted 'Picarones' we went back in the afternoon to eat the tasty Picarones (doughnuts) for S/-2.5 you get 4 on a plate covered in honey - divine and the lady is so cute. We bought some souvenirs that we thought we reasonably priced. We want to go back for lunch tomorrow!!"
        }, 
        {
            "index": 139, 
            "rating": "5", 
            "review": "Quite an experience!. Amazing market! Biggest in Cusco! There is an aisle for each category : fruits, veggies, meat, cheese, potatoes, corn, spices, weird stuff ( frog logs and donkey noses! yes, donkey noses that smell horrible - could not find anywhere what they use them for ), fresh fruit aisle - had an amazing fresh \"cocktail\" , tasted and bought the most delicious raisins and crunchy corn here, beautiful flowers, nuts. You can see locals easting here - food smells good - they cook it right in the market! very interesting place - would totally recommend it!!!!"
        }, 
        {
            "index": 140, 
            "rating": "5", 
            "review": "nice place to visit. It opens at 7 am. I arrived early (because I had agenda). It was amazing. The colors, the smells, the variety of natural things of all origins.Maybe the meat part is a little heavy..."
        }, 
        {
            "index": 141, 
            "rating": "5", 
            "review": "So much to see. Would highly recommend a morning wandering through the maze of stalls that sell just about everything you could imagine in fruit, vegetables, meat, fish, meals to eat in, all sorts of health cures and flowers. This is what a market should be like !"
        }, 
        {
            "index": 142, 
            "rating": "5", 
            "review": "Avoid the animal parts aisle if you have a weak stomach.... This is the largest, most beautiful produce and flower market I have ever seen. There are huge aisles of fresh flowers, as well as all types of fruits and vegetables. Chocolates, home herbal remedies, anything you could possibly want is here. (Avoid the souvenir aisles.) We ate the local bread, several fruits (\"sweet apple\" was best) chocolates and numerous other local foods. We purchased large shelled pecans to take with us. This was one of the highlights of the day. Locals eat here, lined up on stools and benches at tables. Chicken soup looked good."
        }, 
        {
            "index": 143, 
            "rating": "3", 
            "review": "As local as it can get. If you really want to know how the locals live, eat, or do grocery shopping, this is the place to visit. Grab a fresh (papaya, pineapple, strawberry) juice, enjoy a cheese (queso Andino) sandwich and coffee with fresh cow's milk for breakfast. Or a typical Cusqueno lunch that has a great cost benefit. If you are not hungry, simply buy some quinoa and local spices for your cooking back home. Also a good place to buy local souvenirs. The funny part is that our hotel concierge tried to convince us not to go, since it can be dangerous. Let's be honest, the place is as local as it can get, and it's not the cleanest place around. If you are a hygiene freak (nothing wrong with this), then you can skip this place."
        }, 
        {
            "index": 144, 
            "rating": "3", 
            "review": "Clear tourist/local divide . San Pedro market is touristy. It caters to tourists, and at any time of the day, at least half the people here will be tourists. Once you step out of the San Pedro market and walk around the surrounding areas, you will see the outside market catering entirely to locals. The divide cannot be stark enough."
        }, 
        {
            "index": 145, 
            "rating": "5", 
            "review": "interesting morning. Took a food tour of market. Our guide was able to give us history on the women who sew local costumes nad sell through the market, as well as the variety of fare. Obviously a cheap lunch is available for anyone doing a self guided tour, and for the foodies out there this market is more than big enough to find plenty to enjoy."
        }, 
        {
            "index": 146, 
            "rating": "4", 
            "review": "Picarones. The San Pedro Market is a popular place for the more adventurous eaters to visit and if you are one of the adventurous then give Mama Naty a try, she has a big sign and is usually busy, but you will not be disappointed or go away hungry. If you have room after eating at Mama Naty then go to the next isle over and look for a very sweet little lady making Picarones, out of all of the Picarones I have had in Cusco, hers are definitely the best, and in case you are wondering Picarones are kind of like Peruvian doughnuts but are made from pumpkin and sweet potato."
        }, 
        {
            "index": 147, 
            "rating": "4", 
            "review": "Great place to visit!. When visiting the Andes, we see lots of archeology sites so it's nice to see a local and authentic market for a change. If you can, do it with a guide that will explain all the different cereals, vegetables and fruits that you can find, their medical use etc... And try to taste a few things (chocolate, quinoa bars, juices), it's really worth it!"
        }, 
        {
            "index": 148, 
            "rating": "5", 
            "review": "Good Variety of Local Articles. I went to this market and it was one of the best I have seen in South America. One can find an assortment of articles from local food items to music CDs (be warned they are all copied and duplicate) to electronic equipment. There's tons of clothing, spices etc. Do ensure you come earlier in the day as that would be the quietest time to visit."
        }, 
        {
            "index": 149, 
            "rating": "5", 
            "review": "A must do in Cusco. So glad we got a couple of hours in the market just before we left. Large variety or vendors from food and clothing to groceries and juices of all kinds. Shop (and bargain) for souvenirs or enjoy a quick breakfast at one of the stalls, you must spend some time soaking it in as the world in Cusco goes by!"
        }, 
        {
            "index": 150, 
            "rating": "3", 
            "review": "has become quite touristy now.... Unfortunately this market became quite touristy lately and locals are hardly going here anymore for big grocery shopping. On the other hand, everything is cleaner here (still quite messy though), well presented and organised.... And still feels local and authentic... As long as it's not like those famous markets in Madrid or Barcelona I guess it's still worth a visit."
        }, 
        {
            "index": 151, 
            "rating": "5", 
            "review": "Treat for the eyes. A truely beautiful display of al variety of spices, chees, fruits and vegetables. So clean for a farmers market! ask before you take pictures."
        }, 
        {
            "index": 152, 
            "rating": "5", 
            "review": "Great local market. If you want to see how the locals shop instead of the straight up tourist shops the this is the place to go. They sell anything and everything and at a fraction of the cost of what you'll pay around the main square. Goes on everyday but expands out bigger on the weekends. Definitely a must see while in cusco!"
        }, 
        {
            "index": 153, 
            "rating": "5", 
            "review": "Great little place for cheap food to cook yourself. Great little place to go shopping! has souvenirs in the front, then all your meat, then fresh fruit and then vegetables. Then right at the far back is where you can eat, cheapest place in town by far, too!... if you don't mind just rice and egg it's 3 Soles!"
        }, 
        {
            "index": 154, 
            "rating": "3", 
            "review": "Don't bother unless you are searching for things to do. I've been to many markets around the world and this is of only average interest. It has fairly common variety of merchandise, and the food did not appear very appetizing to us. The most interesting parts of our time in the market had to do with a company that was holding a celebration and an informal dance in one of the corners. I would only visit this if you have already hit many of the other highlights in Cusco."
        }, 
        {
            "index": 155, 
            "rating": "4", 
            "review": "You'll find almost everything here. You'll find from fruits and food to everything you need to make an inca's ritual. Very colorful, also you get in touch with locals. Prices are cheap than restaurants. In you're short in money should eat there everyday."
        }, 
        {
            "index": 156, 
            "rating": "5", 
            "review": "Fascinating…its where all the locals are.... Diverse, fun, really get to see the nice people…great eats…it was the most authentic part of Cusco…great interaction with the people"
        }, 
        {
            "index": 157, 
            "rating": "4", 
            "review": "Try the Smoothies. Cool little market off the main historical district. They have everything under the sun - meat, vegetables, handicrafts, restaurants. There is a whole row of vendors selling fresh fruit smoothies. A definite must."
        }, 
        {
            "index": 158, 
            "rating": "5", 
            "review": "Eat here every day. San Pedro Central market is a market close to San Pedro church. On weekend and holidays, the market expands many blocks with people selling all sort of things on the streets. Fruits, vegetables, meats, seafood, housewares, etc... We eat at the market without any problem and we are from USA. Local cuisines are organized along specialties sections in the market. We eat mostly in the soup section. This market is a good place to have good, local foods."
        }, 
        {
            "index": 159, 
            "rating": "5", 
            "review": "Local market that caters to locals.. We went there every day for lunch and dinner. We are a family of 4 from the US. Have no problem at all handling foods or drinks. Good place to buy fruits and vegetables. That market expands to several blocks during weekends and holidays."
        }, 
        {
            "index": 160, 
            "rating": "4", 
            "review": "Quite an experience. A visit to Cusco would not be complete without visiting the market. It is about a 10 minute walk from the Main Square. There were tourists browsing around, but by far the clientele were locals. This is where they shop. You will see whole butchered hogs ready for the pit or parts thereof. Many whole chickens ready to cook. Different stalls had piles of fresh vegetables and fruit, as well as many packaged goods. We found a bag of chia for $2 that one in our party said would go for $20 in the US. Along with general grocery items, there were a few souvenir type shops. There also is an extensive food court area where one can buy and eat almost whatever you want. The visit to the market was quite an experience."
        }, 
        {
            "index": 161, 
            "rating": "5", 
            "review": "Colorful market. We visited this market hoping to catch lunch at one of the pop up restaurants we had read about. However we were not so sure about the cleanliness of the food and so we decided not to risk eating there. We did buy some cheese and bread and had a little picnic on the Plaza just outside the market. We had fruit smoothies in the market and the ladies who make them were super sweet! Lots to look at in the market-- so colorful and a great glimpse into local culture."
        }, 
        {
            "index": 162, 
            "rating": "5", 
            "review": "Experience the local way of life. This place gives you an insight to the way people eat and live in Cusco. The variety of foods and the preparation of foods are interesting to watch. If you are a foodie you will want to go here to view the exchanges and liveliness of the market."
        }, 
        {
            "index": 163, 
            "rating": "5", 
            "review": "GENUINE PERUVIAN MARKET. The San Pedro Market in Cusco is frequented by locals and tourists alike. Poultry and meat are butchered and displayed without refrigeration, but so fresh that the market is without offensive oder. Jewelry and other gifts surround the periphery and are reasonably priced even before bargaining. A worthwhile destination while touring Cusco."
        }, 
        {
            "index": 164, 
            "rating": "3", 
            "review": "Big market. Similar other markets around the world, Here the people from cuzco buy the species, fruits,etc. You can see the traditional market at Peru. Take care outside at night. Is little far from the Place ( around 10 blocks )"
        }, 
        {
            "index": 165, 
            "rating": "5", 
            "review": "The real Cusco. Step outside of the Centro Historico and go to the Mercado de San Pedro. No expensive restaurants right here although there are some nice ones nearby. There is of course a church and there is a nice arched gate before you enter here. There are street vendors selling all types of food and merchandise for a much cheaper price. There is quite a variety. The street food is better than most restaurants but buy it freshly made. It will cost a dollar or two or maybe three if your hungry. It's very crowded here especially outside the market which I prefer. Cheaper prices."
        }, 
        {
            "index": 166, 
            "rating": "4", 
            "review": "A Fascinating Place. While planning our Peruvian vacation our group decided to add a cooking class to our agenda. As part of that event our chef took us through the San Pedro market to demonstrate how the community acquires products for their local kitchens. The market covers a very large area, under roof but still in open air. The market is divided into a number of well marked areas including Fruits, Vegetables, Juices, Textiles, Spices, etc. The juices area was unique as those vendors were very vocally active in getting our attention. There are also plenty of souvenirs available in the market as well as a \"restaurant\" where you can sit down and enjoy lunch in the market. The meat department was amazing not only for the quantity and variety of meats but also because there was large quantities of meat on display without the aid of refrigeration. Although not the exclusive means of transport, many of the vendors use wheelbarrows to supply the market. Quite a colorful sight! We had previously noticed that there were a disproportionate number of wheelbarrows for sale in local storefronts. We had found one of the answers!"
        }, 
        {
            "index": 167, 
            "rating": "5", 
            "review": "Full of Options. I loved these markets. Extremely well segmented and signed, with some amazingly delicious and cheap set menu options. Theres a fresh juice bar section, textiles and ware's to purchase for super affordable prices."
        }, 
        {
            "index": 168, 
            "rating": "5", 
            "review": "Outstanding Cultural Experience. San Pedro was fun, cheap, and tasty. It's the central (black) market that rumors say the locals patronize. At San Pedro one can find anything: souvenirs, dog food, fresh fruit, or meals. The prices for souvenirs are the best in town, pre-bartering. The foods are insanely cheap and give you a taste of real Peruvian food. And, if you're from a westernized country, the meats section is a must.Recommend setting aside 1-2 hours for a complete visit to San Pedro."
        }, 
        {
            "index": 169, 
            "rating": "5", 
            "review": "Veryyyy Interesting! Must see.. This is a must see in Cusco. We loved walking through the market and blending like a local. Try the juice. Buy from the locals. I wasn't brave enough to try the food. Check out the photo below. Great experience."
        }, 
        {
            "index": 170, 
            "rating": "4", 
            "review": "mix with the locals. Like one of the recent reviewers, I always make it a priority to visit local food markets when travelling as it gives a real taste of the country, and this one is no exception. A short couple of blocks from the plaza it is an easy way to fill an hour or two. I heard about the pickpockets and even though it was quite busy I felt safe and escaped 'untouched'. Lots of photo opportunities, but be aware that some of the vendors may not want to be photographed just as some may not want to answer your questions about their products - I usually find they are in the minority and this was no different in Cusco - simply hold your camera up for them to see and you will get a reaction that is easy to understand"
        }, 
        {
            "index": 171, 
            "rating": "5", 
            "review": "Authenic Puruivan Local Market. This is must when in Cusco. One of my favorite places to go during my travels is the local market – it’s really the only way to see the real culture, food, traditions and every day local life. I could have spent hours and hours walking around here. For some, it may be too much – for me - it’s why I travel, as I enjoy getting out of my comfort zone, and learning about other cultures. We went on Saturday, and then again on a weekday - both days were busy. There is an array of colors, foods, grains, clothes, fruit juices, prepared foods, bread – anything needed for daily life. Make sure you walk inside the building where you will find food stalls, fish, meat, fresh juices, etc. The “animal parts” section was quite the experience. Some areas are difficult to swallow (or smell), but who are we to judge? Make sure to respect the locals, and be aware when taking pictures - most locals don’t want their pictures taken, so try to be discreet. Also, as in any area with crowds, watch you pockets and bags, as this would be an easy place for pickpockets, although we had no issues. Outside the “market” area you can walk for blocks & blocks and discover more local shopping areas. We enjoyed this area, but again be safe – we had a police officer stop us, reminding us to be aware of pickpockets. Although I would have loved to tried the food, we didn’t, as I didn’t want to take the chance of getting my pristine Western stomach sick. Per Western standards, the market food is unsanitary and is obviously not regulated as you see dirty hands touching food everywhere, not to mention the flies landing on the food. We had a friend who ate at this market and had no problems – just eat at your own risk"
        }, 
        {
            "index": 172, 
            "rating": "5", 
            "review": "great - just go but dont be afraid of engaging with folks - be considerate about taking photos.. Really happy to have visited on a number of occasions to take a juice and relax - yes chill with the stall holders and browse for my cooking class and for random supplies for trekking. Don't approach the lady skinning frogs legs - but in general remember these are people at work doing trade and business - part of that - like in your home country - thust a camera in their faces without common courtesy of considering."
        }, 
        {
            "index": 173, 
            "rating": "4", 
            "review": "Great Food at great prices. To really see how the locals live and eat, visit the market to see all sorts of animal, produce and lots of meals to choose from. The food stall are organized by type - sandwiches in one row, rice platters, soups vendors etc."
        }, 
        {
            "index": 174, 
            "rating": "5", 
            "review": "Watch your wallet. My rating comes with a big caveat - beware of pickpockets. You think you'll see them coming but you won't. Other than that, this is an authentic, exhilarating Peruvian experience....roast guinea pigs on skewers, etc. Just be ultra careful."
        }, 
        {
            "index": 175, 
            "rating": "5", 
            "review": "Very large, and has everything you need!. If you're looking to buy any fresh food or even some souvenirs, this is the place to do it. Be warned that the meat section has foods that are atypical for Westerners and may freak you out a little bit, but it's a great place to walk through. Watch out for sanitation, though - it is quite sketchy in most places, as the people will handle the food and your money with gloves on and don't change out their gloves, so it's basically like they're not wearing gloves. If you go to the fruit smoothie section, you can get 3 cups of the smoothie for the price, which turns out to be a great deal!"
        }, 
        {
            "index": 176, 
            "rating": "5", 
            "review": "This Market has it all. Full of colour, character and an excellent place to grab some local food with the locals. It's a busy place with lots of sights, sounds and smells to be absorbed. Definitely worth a visit."
        }, 
        {
            "index": 177, 
            "rating": "5", 
            "review": "Recommendable!. Visit San Pedro Mercado if you want to see and experience cusquenias life. The market is a huge space they sell fresh food, fruits, different kind of juices, cheap handycraft and more.This was probably the most local place you can visit in Cusco."
        }, 
        {
            "index": 178, 
            "rating": "5", 
            "review": "Wow!. This is a market to beat all markets! It is huge, and sells everything from fresh chicken soup to fruit smoothies to dog chow. You want it? It's here. My 5 travel companions and I went to this market on several occasions. We are all artists and photographers, and the lure of the market was insatiable. Fresh Peruvian cheeses, hot fresh baked sweet breads, nuts, chicken soup, everything but the kitchen sink smoothies from fresh fruits. Wow! Also incomparable for people watching. You may even see head bones from butchered alpacas on counter tops. One morning we saw a pig being delivered, before we left we saw the pig - head and feet removed, laying on a counter ready for butchering to spec. It is not pretty, but a reminder that in many countries meat is not delivered in pretty styrofoam packages in shrinkwrap. Lot's of old grannies sit on the concrete floor selling everything from quinoa to mushrooms. Just a friendly word...this is the reality of these folks, so be considerate with cameras."
        }, 
        {
            "index": 179, 
            "rating": "4", 
            "review": "Amazing cultura and very good special juice.. I recommend everyone to see this market where locals actually shop and eat. There is a huge food court with home made meals. Its not recommended to eat for tourists because of sanitary conditions. However we tried and amazing special freshly squeezed juice with dark beer, canned milk and lots of different fruits and vegetables. It became the most delicious smoothie I ever had. We shared this huge drink with our guide."
        }, 
        {
            "index": 180, 
            "rating": "5", 
            "review": "A must see. This was an awesome market! You have to go! My daughter purchased a selfie stick on the plaza and it didn't fit her phone but she was able to trade it for an awesome bag here with no problem. You have to go just to see the sites even if you don't plan on purchasing anything."
        }, 
        {
            "index": 181, 
            "rating": "5", 
            "review": "Comprehensive. I was impressed with the market. It was big. There was a large variety of things sold, from textiles, jewelry, to fresh produce, food and coffee. One could get lunch (local Peruvian) there if inclined. The merchants weren't pushy. We bought some local coffee and chocolate. It was better than the Pissac market. I'd recommend all visitors taking a gander."
        }, 
        {
            "index": 182, 
            "rating": "4", 
            "review": "Price is right. As others have stated, this is a market for the people, as well as visitors. Everything from cows noses and jaws to coca leaves, maca, chia, fresh fruits and corn, chocolate, dresses for your daughters and Peruvian handicrafts! Prices here are half of what they were in the \"artisanal\" market, and we didn't bother to do any negotiations as the prices were already pretty low and certainly reasonable. Lots of stalls at the back to sit and eat, either chicken soup or rice dishes, average cost was 5 soles, pretty cheap eats! There are lots of stalls outside the market too, we spent about an hour wandering the streets there, streets are none too clean, but the market was."
        }, 
        {
            "index": 183, 
            "rating": "4", 
            "review": "Something for everyone. San Pedro was far better than the supposed \"artisan market\" up the street. It's more authentic, less tourist-trappy. You can buy all the usual hats and accessories, as well as view the food.....So many kinds of potatoes! Interesting place to wander through."
        }, 
        {
            "index": 184, 
            "rating": "5", 
            "review": "Huge variety of local produce, goods and food stalls. We loved wandering through each aisle to see the wide variety of produce and goods for sale. The flower area smelled amazing and the fruits looked delicious! We had juice at one of the juice bars and chatted with the nice girls serving there. Our favorite was the pineapple orange juice but the mango, orange and passion fruit juice was also very good. It's a great spot to see many local people and get a small glimpse of the culture. You only need about 30 minutes to an hour to see everything but could spend much longer enjoying food from the various stalls. These seemed very popular with the locals."
        }, 
        {
            "index": 185, 
            "rating": "5", 
            "review": "A great atmosphere. This is definitely one to visit in Cusco. It's a fabulous mix of all sorts of food and other products with places to eat simple food and to drink a huge variety of fresh juices. It is probably the most colourful place in an already colourful Cusco."
        }, 
        {
            "index": 186, 
            "rating": "4", 
            "review": "A Feast for the senses. I almost missed this fabulous market so make sure you don't. Inside you will find fresh fish, fruits, vegetables, meats, grains, cheeses, flowers, medicinal herbs and the usual assortment of local handmade clothing. Reasonable hot meals are served at the back of this mercado. Juice bars abound where you have a choice of local fruits made into delicious smoothies for less than 10 soles. This is an opportunity to eat local for less."
        }, 
        {
            "index": 187, 
            "rating": "5", 
            "review": "A Must-See in Cusco!. Lots of tourists in Cusco on their way to Machu Picchu. A rare place not far from tourist sites where you can mix with the local population. The sites, sounds, and smells are incredible. The soups served in the mercado are also quite exceptional and priced for locals, not tourists. The locals we met were quite friendly and we loved the rare chance to converse with Peruvians not in the tourism industry."
        }, 
        {
            "index": 188, 
            "rating": "4", 
            "review": "Don't miss this great local market. A food market is always a great place to begin to understand the food culture of a place that you are visiting.This bustling market, often missed from tour guide itineraries, shows a fascinating mix of ingredients and cooked foods, alongside clothing and other manufactured items.Added to this, the colourful and engaging images of local people, just getting on with their lives, makes this a place not to be missed.You can of course also eat there with them too and enjoy authentic and inexpensive local foods."
        }, 
        {
            "index": 189, 
            "rating": "5", 
            "review": "The True Wealth of the Incas. San Pedro is the main local market of the locals, the descendants of the Incas, and here you can see fabulous displays of the source of the wealth of their imperial ancestors. No, not rooms full of gold; that gold was the result of their wealth, nor the source. The source was agriculture. It's been estimated that the farmers of the Inca's empire most of the foods that are eaten in the world today: no mean feat given that most of the empire was either frigid mountain or scorching desert. But the Andeans gave the Irish their potatoes, the Italians their tomatoes, the Central Europeans their Hungarian paprika and the Southeast Asians their Thai peppers as well as the quinine in the gin and tonics that were indispensable in malarial lands. Not to mention peanuts and cashews, squash and sweet potatoes, papayas and strawberries. Where would the Hawaiians be without pineapples? Where would the Belgians be without chocolate? Or Bugs Bunny without carrots? Luckily for world cuisine, much of this cornucopia has spread to the ends of the earth. But not all of it. Some of the best stuff is still largely unknown. But it's known in the San Pedro Market, and bought and sold every day. Here you can see 20 different varieties of corn in every color in the rainbow (as well as white, black, and grey, which were inadvertently left out of the rainbow), arranged as artistically as the goods at a Hanoi flower mart (see picture). There you can find long, long rows of potatoes, forty different varieties, purple, green, lemon with red spots, others long and thin like delicate fingers, with tiger stripes of black on orange (see photo). Back toward the east side of the market, one section is devoted entirely to hierbes medicinales: what ails you, neighbor? Gastritis, ulcers, prostate, diabetes? We've got you covered, whatever it is, and no, you don't need a prescription! (See photo) Recalling that these were the folks who'd given the medical world quinine, ipecac and the coca leaf, I wanted to ask what they had for altitude sickness, but my Spanish failed me. There are of course lots of other things at San Pedro, and other reviewers have discussed the fruit juice stands, the innards row, the poultry, the sausage vendors. But markets on other continents have such things. I was drawn to the items unique to the Andes. Extending that to coastal Peru, San Pedro has a good, cheap and popular cevicheria as well, in the northeast part of the market, which is well worth a stop (see photo)."
        }, 
        {
            "index": 190, 
            "rating": "5", 
            "review": "Must see!. Brilliant place to get cheap everything! When visiting Cuzco you must spend 20-30 mins meandering through the market here where they sell dream catchers, multi fruit smoothies, a selection of glorious cheeses and nuts to grilled whole Guinea pig!The different smells of the market mixed with browsing without any hassle make this a memory not to forget!"
        }, 
        {
            "index": 191, 
            "rating": "4", 
            "review": "Shop With The Locals. Worth a visit to wander amongst the locals and tourists alike where you can buy the obligatory alpaca handicrafts, pan-flutes, key rings etc but also a dizzying array of local produce. Rows of juice bars, fresh fruits and vegetables, meats, fish, and homewares all jostle for space and customers alongside clothes, handicrafts, dressmakers and jewellers. The sights and smells, particularly those of the butchers and fishmongers, add to the colour and atmosphere. Well worth a visit just to wander and mix it with the locals whilst maybe picking up a bargain or two."
        }, 
        {
            "index": 192, 
            "rating": "4", 
            "review": "Go for cheap eats. We met some gals who were backpacking and had been eating at San Pedro Market almost exclusively. We went to check it out and it's no wonder these gals on a budget were here every day. The food was great and insanely inexpensive. It's great to walk around the various produce sections but in the back are stalls you can eat at. Most are serving variations on the same stuff so just look for the happiest looking lady behind the counter or busiest seating area. There is also a whole row of vendors doing fresh fruit juices. Great stop-- especially on a budget."
        }, 
        {
            "index": 193, 
            "rating": "5", 
            "review": "Tasty and fresh food that's very reasonable . It's where the locals eat and hang out. Loved the Mercado and used to visit this place everyday. From the fresh juices to avocado sandwich for breakfast, ceviche for lunch and saltado for dinner- I enjoyed it all. Lots of food carts and stalls with different local food are set up outside the Mercado in the evening. Good place to pick up dry fruits and souvenirs too. I would highly recommend visiting the Mercado while in Cusco."
        }, 
        {
            "index": 194, 
            "rating": "4", 
            "review": "Super market - prepare to haggle. The market is kind of divided in two. First there's the set menu food hall and juice bar which is really authentic, great value and absolutely buzzing with local Quechua folk. Don't miss this, unless your stomach's playing up :SOn the other hand the fresh food and definitely the textiles markets are very set up for tourists. There's a good range and you can negotiate, but you might need a few tricks to get a bargain.Whatever price you go for, the stall owners generally act offended! So persevere. The best tactic we found was to wait for a local to shop in the stall you wanted, so you could hear the 'real' price of things and refer to that in your bartering.Overall, a great fun place to be - don't miss it.For more Cuzco travel tips, check out our blog!https://ednaventures.wordpress.com/2014/12/09/cuzco-a-beautiful-countdown/"
        }, 
        {
            "index": 195, 
            "rating": "5", 
            "review": "Don't miss this local market!. An aisle for EVERYTHING! Meats, vegetables, fruits, breads, flowers, souveniers - it's all right here and everything has its' own aisle! We had been told the history of the bulls adorning Peruvian homes and wanted to bring a pair home with us. We found them here! Our guide purchased and shared with us some traditional Peruvian bread that was the best bread I have ever eaten - anywhere! I could have wandered through this market for hours. There is also an entire aisle devoted to serving lunch so stop for a bite to eat. More into smoothies? There is an aisle devoted to making those creations as well. Unbelievable market. Don't miss a visit!"
        }, 
        {
            "index": 196, 
            "rating": "5", 
            "review": "A wonderful local market. A large covered market area where locals shop. Here you can find all kinds of fresh and cooked foods, treats, fruits, vegies, and souvenirs at cheap prices. Like many local markets this is a non-touristy site that any tourist should take the time to visit."
        }, 
        {
            "index": 197, 
            "rating": "5", 
            "review": "Where the locals shop. This is the main local market in town and features staples of daily Peruvian life, a food court in addition to more touristy items for gringos. It's an easy walk from Plaza San Francisco and well worth checking out."
        }, 
        {
            "index": 198, 
            "rating": "4", 
            "review": "Great market for food and souvenirs. This is a great multi-purpose market with lots of stalls devoted to fresh juice and cheese and you can buy chocolate (cooking and artesian). Souvenirs are 40 per cent of the price we were quoted at the Machu Picchu craft market for the identical product. We brought chocolate as gifts as well and they were cheaper than in the supermarkets across from the market. Thankfully there aren't many fresh meat stalls so the market doesn't smell rancid."
        }, 
        {
            "index": 199, 
            "rating": "5", 
            "review": "Largest market! Great shopping.. This market is huge! Definitely allow time here to explore the local artisans, great flowers, food and more. As a vegetarian, I skipped walking up and down the meat aisles...there was plenty to see from afar. I recommend planning to eat lunch here - there are plenty of stands serving soup and other food to eat. Many vendors do not speak English, so be ready to ask a few questions in Spanish."
        }, 
        {
            "index": 200, 
            "rating": "4", 
            "review": "Must see! . The San Pedro market is cusco is the best one that I have visited among cusco and Lima. We visited this place as park of the cooking class and then come back later again by ourselves. It is interesting to see all the various products here, like the collection of different type of corns across Peru! I bought some coco candy here as souvenir which is cheaper than the shops near plaza de armes. (please notice that it is illegal to bring coco leaves back to your home country). There are many many small stalls that sell juice and food. The caldo de pollo here is excellent!! Big bowl is s/10 while small bowl bowl is s/5 !"
        }, 
        {
            "index": 201, 
            "rating": "3", 
            "review": "Fun if you have time. I wouldn't go out of my way to go here, but if you have some time to spare, it's worth it. Close to many of the other Cusco attractions, and they sell a great variety of stuff. A good selection of food, as well as tourist items."
        }, 
        {
            "index": 202, 
            "rating": "3", 
            "review": "Try not to eat here!. The San Pedro market is a nice place to go and buy seeds, fruits, plants souvenirs even candy and such but please refrain yourself from eating there. You can see a bunch of local people eating there but the sanitary conditions of the market are really poor. Even our tour guide told us that he would not recommend us eating there. I did try the \"Choclo\" which is a type of corn that people eat over there with cheese. Pretty good."
        }, 
        {
            "index": 203, 
            "rating": "5", 
            "review": "Best Market of the Trip. The San Pedro Market was hands down the best Market we went to and we did go to a bunch. Our guide took us here our 1st day in Cusco for the juice and it was delish. The place is so cool and the locals are friendly. It is a must see in Cusco. My husband even tried the Chicha - purple corn beer. The juice is so fresh and made from anything you can imagine. The shopping is pretty decent too for alpaca items."
        }, 
        {
            "index": 204, 
            "rating": "5", 
            "review": "Great place to get lost. Our Airbnb apartment is just a few blocks from the San Pedro market, and we are so happy to have ended up here, both to be outside of the direct Plaza de Armas tourism and, more importantly, to be near this market.We have been several times on our trip, and it is really the perfect place to stock up on anything. Despite the chaos that first presents itself, this market is actually very organized. It is roughly divided into local crafts, food supplies for sale (an aisle each for cheese, bread, various meats, etc.) and fresh food for purchase. Once we got the hang of it it became very useful for supplies.Having now traveled a bit around Cusco, the prices are not heavily marked up here; in fact, they were often lower (and more up for negotiation) than in several other places. We bought, in no particular order, sweaters, hats, socks, bananas, a bucket of fresh local fruit, a ham sandwich, tamales, and a miniature alpaca. They even have supplies like batteries, tea, etc.This is like having a giant grocery store where everything is fresh and local and you have lots of variety. Definitely one of the highlights of the trip."
        }, 
        {
            "index": 205, 
            "rating": "5", 
            "review": "Great place to spend an hour or two. The San Pedro market is a great place to spend an hour or two. With stalls full of fruit, flowers, grains, potatoes, meats, fish, it's a colourful and sometimes pungent place to visit.Not to mention the stalls of clothes and fabrics around the outside, and the many stalls selling ready to eat food.Note - both our Inca Trail guide and a woman I bought coffee from told me to be careful with valuables. The coffee vendor specifically told me to put my wallet in my front pocket and keep my hand on it. So, more than other places in downtown Cusco, pickpocketing may be an issue here. So just be careful"
        }, 
        {
            "index": 206, 
            "rating": "5", 
            "review": "Worth a visit!. I visited San Pedro as part of a cooking class, and am happy I did. It was interesting to see all the produce options, fresh flowers and cheeses, etc. there were a few spots that were rough in terms of meat displays and live animals (frogs), but that goes with the territory."
        }, 
        {
            "index": 207, 
            "rating": "4", 
            "review": "amazing. located very close to the city center, this colourful and very crowded market is a must when you visit cuzco. just pay attention at the pickpockets around, they r very skillfull"
        }, 
        {
            "index": 208, 
            "rating": "4", 
            "review": "Great local market. This was probably one of the best markets we've ever been too. Spacious. clean and a huge variety of things to buy, all laid out in a logical and easy way to follow. Large food court with some of the best value food I've seen. Highly recommend a visit."
        }, 
        {
            "index": 209, 
            "rating": "5", 
            "review": "Fun local market. This isn't your usual shopping as it is a local market that sells a combination of everything from food stuff like meat, vegetables to clothes and art & craft items. It's got a wet market kind of setting where I think the locals actually go.I went there to get my stash of Palo Santo wood and traditional floral water to bring home and it was fun looking at the local market. I don't think it's a typical touristy kind of place and that's precisely why I like it. You might still want to bargain a bit as some of them know you're a tourist and will quote you higher prices but generally, the prices for the art & craft stuff is comparable to the ones outside and it isn't a hell lot cheaper. It's nice to just check it out anyway."
        }, 
        {
            "index": 210, 
            "rating": "4", 
            "review": "Very local . This is really where you need to go to experience the local culture. I have been to many street markets in the world and this one is very unique as they have everything separated. One row of cheese. One row of breads. Then one area with sweet food and one with soups. We decided to have the potato soup with cilantro and no meat to be safe. And it was the best soup of our trip. Don't be scared just try it."
        }, 
        {
            "index": 211, 
            "rating": "5", 
            "review": "Best Local Market in Peru. This market has everything. We entered through the food department which is mainly patronized by the locals. Everything you can imagine and then some. Does not smell all that good (the meat section) but you will see meat that you could not identify. Very interesting. The craft section, mainly for tourists was very large. We noticed that the merchants were not especially agressive, but we were able to bargain with them. We found items that we did not see anywhere else in Peru. We spent only about an hour in the market as part of a city tour, but it would be easy to spend an entire day. We were looking for black Quinuoa in a sealed package so we could take it home. It took awhile but we found it and had no problems with customs."
        }, 
        {
            "index": 212, 
            "rating": "5", 
            "review": "Authentic food market. A wonderful, local, authentic food market. It seems to be the place were the locals do their grocery shopping. There is also a food court that serves local dishes for cheap. Take a few minutes for a walk through - it's just a few minutes walk from Plaza de Armas."
        }, 
        {
            "index": 213, 
            "rating": "4", 
            "review": "A sight to see. It smells, it's crowded, and vendors are literally chasing you down to buy their product. But absolutely worth a visit. You can get lost in all the items there are to buy, eat and drink. Some of the strangest stuff I've ever seen, too. Spend some time people watching - it was a great afternoon."
        }, 
        {
            "index": 214, 
            "rating": "4", 
            "review": "Wet, dirty, but go anyway!. Went to San Pedro as part of a guided tour in Cusco. Enjoyed the visit and was fun to see what's sold there. Horrors - go visit the meat section and have a look! ;-) We bought local chocolates as souvenirs to bring home. Memorable - must go. It is only a short walk from the main square."
        }, 
        {
            "index": 215, 
            "rating": "5", 
            "review": "Fantastic wet market, great souvenirs, fresh fruit juice stands. San Pedro markets is not far from the main square about 10 minutes stroll. It has an excellent wet market with some very exotic foods. Not for the faint hearted...takes eating snout to tail very literally. There were affordable souvenirs to be bought and the best tasting fresh fruit juices. Well worth the visit."
        }, 
        {
            "index": 216, 
            "rating": "5", 
            "review": "Local market of food and places to eat. This market was really nice to watch - its mainly food but we arrived at lunch time and enjoyed seeing the locals all sit around big tables and had the traditional soup. There is not too much to buy that you cant find in other places around Cusco, but It was a nice trip to the market and the area."
        }, 
        {
            "index": 217, 
            "rating": "4", 
            "review": "A glimpse into local life. We visited this market as part of the Cusco tour with G Adventures. It is a giant complex packed with stalls selling all kinds of goods you can imagine. It has such a local favour and it's eye opening to see the different produce and customs of the locals. The market is organized by sections: there are vegetables and fruits (hundreds of potato varieties and the most exotic fruits from the amazon); meat stalls (all kinds of animals and cuts); dried goods; flowers; handicrafts; food. Perhaps the most interesting is what our tour guide coined the \"ritual and 'witchcraft' section\". These stalls are filled with goods and products that are used by locals for all of their history. There are things used for rituals and praying, artifacts and charms for luck and blessings, herbal remedies for sickness, and so on. It was a very interesting stroll, just be careful of your goods and wallets (our guide made sure to remind us before we head in and we all came out safe and sound)."
        }, 
        {
            "index": 218, 
            "rating": "4", 
            "review": "Definitely worthwhile if you like food markets. This had what you'd expect from a local food market, allowing you to really understand what people in the city eat. In addition to many food stalls, there's a large section of stalls with prepared food to eat for really authentic yet really cheap meals (eg we had a rice dish that was most of both my and my wife's lunch for the equivalent of $1.20 USD).The only part I didn't like was that all food stalls of one kind where adjacent to one another and appeared to be required to use the same format (even signs). While this certainly helped to section things off - they even had overhead signs like I'm a grocery store - I felt like it took away from the creativity and surprise, and led to this strange situation where if you're looking down an aisle, all the vendors would waive to you to tell you to come to theirs even though each stall was basically identical."
        }, 
        {
            "index": 219, 
            "rating": "4", 
            "review": "Great experience!. A true local covered market selling everything, and I mean everything. Huge place. Fruit and vegetables to make your mouth water, eating, clothing, housewares, everything. A real cultural experience."
        }, 
        {
            "index": 220, 
            "rating": "4", 
            "review": "Great place for buying food. This place is a great option for buying unexpensive food in Cusco.You can find fruits, bread and lots of nuts, olives...They also prepare meals and juices there, but that I didn´t tried.You can also find lots of handcrafts and other stuffs too..."
        }, 
        {
            "index": 221, 
            "rating": "5", 
            "review": "Nice little market with great cheap food. They have everything at this market, and its really nice to walk around to have a look. The food at the market, or well, ive only tried the juices and soups, but its so good and so cheap! You get a good portion of soup for 2,50 soles. Look for the quinoa drink, its only 1 soles and definitely worth trying!"
        }, 
        {
            "index": 222, 
            "rating": "5", 
            "review": "Fantastic . The short story is that this is a fantastic local market with incredible, cheap food, a ton of different spices, medicines and so on and also great options for buying cheap clothes and other souvenirs/gifts. I ate here every day and never once felt unsafe or poorly treated (although being a gringo one must really be fine with a little bit of eye rolling and attitude)."
        }, 
        {
            "index": 223, 
            "rating": "4", 
            "review": "Most interesting food market I have ever visited. Many tour books suggest going to local open markets to get the 'flavor' of a place [flavor in two ways]. The market in Barcelona was neat, but this place beats all others I have been to – by a head. Donkey head that is – which you can buy whole here, or just the snout. Or get a whole cattle head. Of course there are whole pigs. Live frogs. The list goes on and on. And not a refrigerator in sight. Not just meat - we bought nuts, dried fruit, bread, fruit – and ate it most of it immediately. We also went back to the cooked food [lunch] area and had a pecado frito placa. A piece of fried fish [bone in], lentils, rice and beans to cover the plate [placa] for 3.50 soles – about a buck and a quarter!"
        }, 
        {
            "index": 224, 
            "rating": "4", 
            "review": "Interesting place. It's an experience. One can find (and buy) there anything local, from out-of-season lucuma to San Pedro and coca leaves, of course"
        }, 
        {
            "index": 225, 
            "rating": "5", 
            "review": "A shopping experience. Going here is a feast for the senses! I wish we had visited on our other free days. Unfortunately, we had only four hours to browse before we headed to the airport. They sell everything--it's like a flea market, a farmer's market, a street food fair and an artisan market all mashed into one busy place. Lots of great photo opportunities too and a great way to immerse yourself in local culture. FYI, keep your valuables and money close to you when wandering. I had a few friendly stall owners warn me when I was fumbling for money in my pockets like an idiot.When I come back to Cuzco, I will do most of my shopping here."
        }, 
        {
            "index": 226, 
            "rating": "3", 
            "review": "A slice of local life. If you have a half hour - well worth a look.All sorts of foods and goods. Many items can be bargained."
        }, 
        {
            "index": 227, 
            "rating": "4", 
            "review": "Good place to pick up souveniers. We did almost all our shopping there but fruit smoothie that my husband had made and bought there made him very sick. I did not have any because I am always wary of local water that is not bottled. Bargaining is acceptable here especially if you buy more than one item."
        }, 
        {
            "index": 228, 
            "rating": "5", 
            "review": "A feast for the eyes- but not for the feint of heart. Be prepared to be barraged by sights smells colors and sounds. See weavers stalls, toys, horses heads, pigs heads, meats of all sorts (don't worry- they cover them with sheets overnight) peppers fruits vegetables frogs legs cauldrons of steaming soups. Bring your camera for spy shots of the people."
        }, 
        {
            "index": 229, 
            "rating": "5", 
            "review": "Best Value. This is where I bought most of my food. I would often eat here as well. There is no where else in the world where you could get a home cooked meal for S./3.50 ~ $.1.20. This meal comes with a large bowl of soup and a class of Manzanilla or mint tea.It is a place you must see."
        }, 
        {
            "index": 230, 
            "rating": "4", 
            "review": "Mercado Central de San Pedro (San Pedro Central Market). If it is locally grown, it can be found at the San Pedro Market. Here you’ll find fresh produce, meats of numerous varieties, homemade cheeses, grains and even kitchenware, clothes and home decorations. The market is divided up much like a grocery or department store, with booths selling similar items on the same aisle (or multiple aisles).Definitely check out some for the items available. Need a whole hog or a side of beef, just a few llama steaks or even a guinea pig for dinner? It is all available. There is also a food court serving local dishes prepared on site, complete with roving musicians. Of course there is a tourist section selling souvenirs. In this section, beware of the ‘alpaca’ scarves and other items sold here. The prices reflect authenticity.If you have a little free time while in Cusco, you should visit San Pedro Market. If you only walk through or spend a greater amount of time exploring each aisle, visit the market and absorb the local culture and a part of the daily way of life in the Andes. It is east of the train station and just a few blocks west of the historic district."
        }, 
        {
            "index": 231, 
            "rating": "5", 
            "review": "Working market filled with local produce, a find for foodies.. This market is bustling and filled with people selling everything from fresh produce to grocery staples. There are a few handi-craft stalls, but only a few.This market is great for seeing truly local foods. Cheeses, breads, grains, spices, dried seaweeds, and more. There is a section devoted to animal parts, so if you are squeamish to such things, you may want to avoid the meat area.There were all sorts of foods that were unfamiliar: little freeze dried potatoes, partially dried fish eggs, and various roots and tubers.In the center of the market are vendors making fresh fruit juices and other things to eat at the market. We stopped for a bowl of chicken soup, it was simple and very tasty. If you are adventurous, sitting and having a bowl of soup is truly a local eating experience."
        }, 
        {
            "index": 232, 
            "rating": "4", 
            "review": "Really cheap!. You can find really cheap crafts than downtown! Its open from 6:00am til 8:00pm and you can get there walking from the plaza."
        }, 
        {
            "index": 233, 
            "rating": "3", 
            "review": "Clean and Interesting. We were brought here for the \"Behind the Scenes, Cusco\" and tasted the Chuta Bread and a different \"pipino\" cucumber fruit!We were introduced to a lady who is like a human food processor. She cuts potato like a machine in a precise julienne and also diced in perfect pieces! Amazing!"
        }, 
        {
            "index": 234, 
            "rating": "5", 
            "review": "Top tips for visiting Mercado Central de San Pedro, Cusco Peru. - Not your usual fancy French or Italian market- Dirty water and food waster everywhere, that's what makes it so authentic.- This is where all the locals shop for their daily groceries- Things are so much cheaper in the market- A bag of 200g - 500g quinoa literally cost 5 soles. A 50 gram chia seed cost 2 soles.- Don't be afraid to join in the locals and have a bowl of famous chicken noodle soup for 5 soles (see picture). It is so flavoursome!- Along the way to the San Perdo market, you will see tons of cerviche stall. They are only 2 soles for a small tiny plate sold at the street stall. I strongly encourage and recommend you to try it. I had 3 plates in a row, guarantee no food poisoning. It is truly a brand new culinary experience for the most famous dish in Peru.- Didn't really see a lot of gringos hanging out in the food markets here. Maybe they were worried of being mugged or having food poisoning. - The market also sells touristy souvenirs but super overpriced.- Wear a good pair of covered shoes because you do not want to wet your feet with dirty water.- Lots of quail eggs sellers, steamed boiled potato sellers and fruit/vege sellers.- Very difficult to find a toilet around here.If you think my reviews have been helpful to you, please click 'Yes' for 'Was this review helpful?'"
        }, 
        {
            "index": 235, 
            "rating": "5", 
            "review": "Great cultural experience, yes the market.. You have many traditional souvenirs and textiles to pick from. There is also the food market. Exotic fruits, vegetable, cheese, meats, breads, chocolates, its all there and then some...You can also get a great bowl of freshly made chicken noodle soup for 5 sole, cheap and delicious. Great fun for all!"
        }, 
        {
            "index": 236, 
            "rating": "5", 
            "review": "A 'must see' in Cusco!. If you want to buy souvenirs and yet experience the best from the local culture, this is the place to go."
        }, 
        {
            "index": 237, 
            "rating": "4", 
            "review": "Full of Surprises. This is a fun little market to visit! It was designed by Eiffel and gets a lot of popularity points for that! Definitely worth a walkthrough! Keep your eyes peeled because you will be sure to see some interesting things!"
        }, 
        {
            "index": 238, 
            "rating": "5", 
            "review": "Excellent place to taste local culture. I went to Mercado Central in Cusco in a rainy Sunday. Not many people were out that day but was perfect to take pictures and taste the local culture. You can find local handcrafts in this market. I got me an alpaca with cap and scarf at an incredible low price! outside the market, there were public protests about public transportation cost and I heard they would go on strike the next day. Overall, a great experience!"
        }, 
        {
            "index": 239, 
            "rating": "5", 
            "review": "Get the local experience. If you really want to know what the locals do and go, San Pedro Market is the place to be. Not to mention it's the cheapest place for lunch. We spent 5 soles (a little less than $2) each for a big bowl of chicken soup. And we went to the pricey chicken soup aisle.Rows and rows of produce (fruits, vegetables, raw meat, fish) and other products. We spent several hours wandering up and down the aisles marveling over what you would buy there."
        }, 
        {
            "index": 240, 
            "rating": "5", 
            "review": "Local experience. My friends and I loved San Pedro market. We thoroughly enjoyed bargaining for souvenirs here and finishing off the experience with a bowl of chicken soup. The chicken soup was one of the best meals we had in cusco (cheap, tasty, authentic). I only wish I could go here again."
        }, 
        {
            "index": 241, 
            "rating": "5", 
            "review": "Experience the Cusqueno daily live. Come to visit San Pedro Mercado if you want to see and experience the locals' daily life. The market is an enormous space that houses over a hundred fresh food stores and tens of eateries serving delicious local cuisine.\nGreat atmosphere. Good food. (Very) cheap eats. Wonderful locals.\nThis was probably the most local place you can visit in Cusco."
        }, 
        {
            "index": 242, 
            "rating": "3", 
            "review": "everything at once. If you want to see what the locals eat, go to the mercado. Here you can find all sorts of fruit, veggies and meat (litteraly everything!). you can also buy souvenirs."
        }, 
        {
            "index": 243, 
            "rating": "5", 
            "review": "So Unique. What a total culture experience! Loved this place. Nothing makes you feel like you are in a totally different culture than the San Pedro Market. So many colors, flavors, smells, things to wonder at. Not for everyone, but if you really want to experience something totally different. This is the place. Needless to say, great prices on everything."
        }, 
        {
            "index": 244, 
            "rating": "4", 
            "review": "Lots of unique things to see!. San Pedro Market is a 5-10 min walk from the Plaza de Armas. While there are handicrafts sold in one area, go to see the diverse food. See how the locals shop. Room temperature meat/seafood waiting to be bought-smells a bit...mounds of fruit, sacks full of grain, cheese, unique breads. This is definitely worth walking through. It can be done in 30-45 minutes. There are food stalls where you can sit and order. There are interesting things to see just outside the market, too-people selling food from their wheelbarrows, carts with small birds laying eggs on the bottom with a woman cooking them and selling boiled eggs on top. Great place for photos."
        }, 
        {
            "index": 245, 
            "rating": "5", 
            "review": "Unique!. Very cool place. The meat market was astounding- cattle heads, brains, entire pigs, etc. I highly recommend the juice section. Cheap, healthy, friendly, and great tasting! You can also get very cheap meals in the restaurant section if you're brave enough to trust what they're serving."
        }, 
        {
            "index": 246, 
            "rating": "5", 
            "review": "Don't miss!!. This market is amazing. So many colors, people, variety, smells (good and bad). It's worth going to look around even if you don't buy anything. I recommend going to the food stalls in the morning and getting a fried cheese and avocado sandwich with some chocolate con leche. Amazing and super cheap. Look out for donkey snouts."
        }, 
        {
            "index": 247, 
            "rating": "5", 
            "review": "Where the locals go. For a town sustained by tourism it is nice to duck into the Mercado Central to escape the touts and higher prices. A nicely sectioned covered market, this is where you can pick up some local produce or that little something to take back home. Some decent food options are also found here. Just a short walk from the main square."
        }, 
        {
            "index": 248, 
            "rating": "4", 
            "review": "Great local market. Mercado Central is a great place to get a sense of the breadth and diversity of produce available in Peru. The variety of vegetables and fruit is incredible and there are stalls to get excellent fruit juices. The stalls include some typical breakfast and Chufa dining experiences and the market is filled with folks doing their regular daily shopping. We thoroughly enjoyed this mercado because, unlike some others, this felt much less touristy. We bought several incredibly delicious fruits to try and also had some wonderful conversations with vendors in the market."
        }, 
        {
            "index": 249, 
            "rating": "4", 
            "review": "Oldest Market in Cusco & Very Fun!. I love visiting local markets wherever I go so of course had to take a trip to San Pedro. The stalls are always filled with the things the locals need to buy, as opposed to the typical tourist markets. The wet section- the fish market... the meats... the produce... and all the dry goods are always a trip to check out.This market spills outside the covered marketplace to the surrounding streets, and they are really fun to walk thru as well. I had one of my most memorable meals of this trip from a street vendor, who was deep frying chunks of meat laid over vegetables. Questionable sanitation? Undoubtedly. Delicious? Oh yeah!"
        }, 
        {
            "index": 250, 
            "rating": "3", 
            "review": "Bit of a let down. Went with high hopes of lots of god stuff to buy but just usual tourist stuff. Smell and sights of food stalls was awful especially for a vegetarian. Only there half an hour. Better markets in Cusco"
        }, 
        {
            "index": 251, 
            "rating": "4", 
            "review": "a must. Great place to see and understand life in The Andes. Check the meat market and definitely stop by for breakfast at any of the jugos stands."
        }, 
        {
            "index": 252, 
            "rating": "5", 
            "review": "Highland soup and 'real' Cusco. My husband and I visited the market on our second day in Cisco. It is fun, lively and attractive - anything and everything piled high for sale. And it feels as if you are seeing a 'real' bit of Cisco. It isn't as overwhelming as the markets in more developing countries and is a better experience for it. We got very little hassle from anyone - nothing more than a friendly \"senor/a\" (said once or twice per stall holder, with a smile).We had read that Highland Soup is good for the altitude headache so chose a stall with lots of customers. It was actually one that was in the main market area rather than the main eating area but that wasn't really a conscious choice (the one with lime green cushions on the benches). We paid 10 neuvo sol for 2 huge bowels of soup (chicken, veg and pasta) and it was wonderful. And the headaches went for an hour or so! Highly recommended!"
        }, 
        {
            "index": 253, 
            "rating": "4", 
            "review": "Come here for lunch. It’s only a short walk from Plaza de Aramas in the Historical District, and it’s where you’ll get some great photo ops (see my pictures). You’ll find many items for sale here at local prices. My partner bought wool fabric for 5 soles per metre and found a tailor here to sew up a coat for seven soles.There are several juice bars in another section where you can get fresh fruit juice, and a food court where you can eat chicken and vegetable soup, ranging from 4 soles to 10 soles for a big plate (I’ve eaten here several times without getting sick).If you’re into drugs you can find San Pedro, Mesculin, Maca and Harina de Coca, among others, sold legally at this market. Just be sure not to take them with you when you leave the country."
        }, 
        {
            "index": 254, 
            "rating": "4", 
            "review": "Too much to see. I blame the market on my teenage son feeling ill. He was fine with the cooked food area, and even the fruits and veggies, but when he saw (or smelled) the butchers, with accompanying flies, I think that was the end of his adventures for the day.There is a lot to see, and this market is as big as any I have ever really seen before. Fortunately, it was broken down into sections, so unless you are up for the gore, stay out of the meat area. Not sure how they got the pig head to look like he was smiling, but definitely a photo in my album."
        }, 
        {
            "index": 255, 
            "rating": "5", 
            "review": "Deceptively cool visit. Now if you want to see something really crazy, check out the Mercado Central de San Pedro. Not only will you have the usual offerings of vegetables, fresh juices, breads, and souvenir items like at the Cusco Artesian Market, but you’ll get to straight up see butchering of llama and alpaca (there was a dude with an axe hacking away at the body of an alpaca or whatever. I too frightened to take a picture of him). The smell of blood definitely made my stomach turn when I first walked it, but the sensation did go away after a while. Making sure that we weren’t just being nosy outsiders looking in, we started to chat up one of the llama head sellers and she was surprisingly very friendly and open to answering our questions. Definitely a deceptively cool place once you get over how shady and dirty it looks."
        }, 
        {
            "index": 256, 
            "rating": "5", 
            "review": "Loved this place!. This market has everything from clothes, accessories, fruit/veg, meat, cheese, bread and delicious fruit juice and food stalls. You can literally spend hours here wandering around and it gives you a great insight into Peruvian life. I highly recommend getting a fresh juice and something to eat."
        }, 
        {
            "index": 257, 
            "rating": "5", 
            "review": "For the Cusco from within. Originally this was the most important after the parade for Cusqueños social center. Thousands of people came to do their domestics shopping, eating or drinking your favorite beverage. Also, the nearby villages came herding their llamas or mules were staying near the old houses in the surroundings of Cusco and sell their products in this market.Subsequently, he remained the most important for those who lived in Cusco city. Those from remote villages found other smaller markets, to the present can be seen that many cars come in to sell their products.The Mercado de San Pedro, today remains the center of commerce where they are from meat, milk, juices, etc. etc. and many foreign visitors are enjoying their food.Its location, within walking distance of the main square, we recommend visiting and enjoy breakfast!"
        }, 
        {
            "index": 258, 
            "rating": "5", 
            "review": "gives you a glimpse of Peruvian culture. It's a market that is as popular with the tourist as it is with the local population. From the smell of the freshly made juices to the one of the meat resting on the counter waiting to be sold, to the view offered by the colorful shirts and wide variety of fruits, the market has everything to to awake all your senses. It is also possible to try a Peruvian food court. Just sit on the bench at one of the restaurants counter."
        }, 
        {
            "index": 259, 
            "rating": "4", 
            "review": "Fun to be here. It's quite an interesting market for fruits, vegetables, huge breads, cheese, meat, juices etc. It gives you a flavor of the local tastes and preferences. You can also buy souvenirs here."
        }, 
        {
            "index": 260, 
            "rating": "4", 
            "review": "An overall Cusco market experience. If you visit Cusco and have some time, this market is a 'must-see'. Everything you'd find elswhere in Cusco you find it here. Traditional clothing, fresh vegetables & fruit, the most delicicous 'jugos' (juices) , herbs, spices etc.The area where meat is being sold i wouldn't recommend to people who are very sensitive or with a weak stomach.There are guardians over all the place, but still you should protect your personal belongings for pickpockets."
        }, 
        {
            "index": 261, 
            "rating": "5", 
            "review": "A \"must see\". I always love to visit local markets, and this one doesn't dissapoint.. The fruit juices, I could drink all day... If you want, you can eat with the locals for prices from 1-4 dollars a meal. Just wander around and see which food appeals to you, because you have a variety of peruvian food choices, but mostly chicken soup, which is fantastic, and the classic rice and beans.. The people are really nice and friendly and helpful and compete with eachother to attract customers."
        }, 
        {
            "index": 262, 
            "rating": "4", 
            "review": "Love it!. We're in Cusco for several months, so this is our regular grocery store. But if you're just here for a short time, be sure to visit the San Pedro market if you want to get a sense of how the Cusqueños live. If you speak any Spanish, the women are happy to answer questions about the produce and let you sample the breads and fruits that are new to you. Try the Chuta bread, it's sweet, anise-scented & heavenly and famous all over Peru. The meat aisles aren't for the softhearted, but they are certainly interesting! Eating at the food counters is probably not a great idea for short-term tourists. I've been here for months and my body didn't process my San Pedro lunch well. :("
        }, 
        {
            "index": 263, 
            "rating": "4", 
            "review": "Daily Incan Life. The life of Cusco lives in Mercado Central de San Pedro. The smells, the food are fill up the atmosphere. You really get to see Peru with not a huge Spanish influence but more of Incan through and around the market. I highly recommend to try the fruit juices as they are extremely cheap compared to the restaurants around the city.It is an amazing experience to see a different side of Cusco and how everyday people live through the capital city."
        }, 
        {
            "index": 264, 
            "rating": "5", 
            "review": "The true flavors of Cusco. We were out early and came across the San Pedro market. At the early hour, locals were drinking fresh fruit juices and eating steaming bowls of chicken soup. Each isle is filled with the most delicious breads, cheeses, fruits - everything you need! The meat isle was not for the faint of heart - I was so sad that I had no where to cook! We came back for lunch - we each had a two course meal of delicious soup and the plate of the day - rice and lentils with salad. I only ate the tomatoes and they were DELICIOUS! DO NOT miss this market!"
        }, 
        {
            "index": 265, 
            "rating": "5", 
            "review": "must see, must eat. Leave all you premonitions behind and venture into this market. try some of the food, try the cuy. Really one of the most interesting things to see if you're an american or european. I have lived in NYC my whol life and have never encountered anything like it. dont worry about things and just get into it."
        }, 
        {
            "index": 266, 
            "rating": "5", 
            "review": "True market with great food court. A true market, not some kind of tourist only place, interesting to see a bit of local live. All organized by section, vegetables, cheese, spices, etc. Obviously food court is the most attractive part, with a lot of local delicacies to try ; same goes for 'juice section' where almost any fruit or vegetable gets transformed into a delicious juice."
        }, 
        {
            "index": 267, 
            "rating": "5", 
            "review": "Don't miss it . The best, most colourful, untouristy market ever. 144 types of potatoes, witch doctor stalls, corn, food stands selling sheeps head soup and live frog soup for potency, baskets, whips, clothes, fruits abounding, hideous meat stands and loads of locals, you name it, here it is.Do have a cuppa on one of the tea and coffee stands, it didn't kill us. The highlight of Cuszco. Mind your bags everyone says, some no-good-niks from Lima come and target tourists."
        }, 
        {
            "index": 268, 
            "rating": "5", 
            "review": "A genuine Peruvian market. an interesting way to spend half an hour seeing how the locals shop. The meat/entrails/fish/fruit/flowers sections were the most interesting. Although could have done without the piles of severed donkeys heads with mouths open showing their teeth! Great to see the locals (and some tourists) eating at the food stalls where soup is about 30p and you can have a whole meal for £1.10. A few tourist stalls have crept in but still worth a visit."
        }, 
        {
            "index": 269, 
            "rating": "5", 
            "review": "An nice escape from the tourist traps. We stayed in Cusco for a few days only, but the San Pedro markets was our favourite spot in the city, and a great escape from the other tourist traps in the town. You can choose to just wander around, taking in the sights and sounds. The market sells fresh food, groceries, souvenirs, meat, cheese - and it makes for a nice experience just checking things out. It also has (and this is our fav bit) a big section dedicated to food - rows and rows of juice stalls, breakfast stalls, and lunch stalls. We ate there a number of times - breakfast and lunch - and will highly recommend it. We tried the cafe con leche and the torta for brekkie; and the arroz con huevos y plata (rice with fried egg and avocado), heaped with the special chilli salsa. Delicious!!"
        }, 
        {
            "index": 270, 
            "rating": "5", 
            "review": "An authentic market!. If you are looking for an authentic market, this is it! It is an easy walk from the Plaza de Armas. I really enjoy going to markets when we travel and prefer ones that are more authentic and less \"tourist oriented.\"You won't find many (or any) other tourists here ... it is just a real look at the bread, produce, meat, soups, etc. that are purchased by local residents."
        }, 
        {
            "index": 271, 
            "rating": "5", 
            "review": "A visual smorgasbord of sights. This is the truly authentic local market. It's certainly worth the walk to come visit and see for yourself. Lots of variety (meats, flowers, produce, gifts, etc.) We were too hesitant to buy any food, though. Just took pictures! Way more locals than tourists here, which can be refreshing but a little intimidating too. We came at lunch time and it was especially crowded with locals getting meals. Our guidebook (and other reviewers) warned us of pickpockets so we were careful and didn't have any issues."
        }, 
        {
            "index": 272, 
            "rating": "5", 
            "review": "This was one of the highlights of our trip. We happened to stumble upon this huge market near downtown Cusco, and what a find! Row after row of textiles, followed by rows of butchers (Americans are certainly not used to seeing pigs heads, entrails, and organ meats prominently displayed!), then fruits & vegetables, cheeses, chocolates, and in the back were dozens of restaurants. I knew once my husband saw them I would never eat at a sit down \"touristy\" restaurant again while in Cusco. I opted for soup, figuring that the hot temperature would keep the bacteria down. It was absolutely the best meal I had in Peru, and we went back several times with no problems. They greeted us like we were long lost friends, sitting elbow to elbow with locals on long benches. What a wonderful experience. I'm convinced that you are more likely to get \"traveler's diarrhea\" or other creepy-crud from a touristy place in which you'll pay 10 times what you pay at these little places!"
        }, 
        {
            "index": 273, 
            "rating": "5", 
            "review": "A Relief To The Touristic Hell!. All Authentic Cusco! Think of it as the ultimate farmers market. Meat, veggies, fruits, herbs with a huge fresh juice section as well as a massive section in the rear where vendors cook and sell food. The cleanliness is a little questionable but I didnt get sick. Also the souveiners and such there are great as well. Walking distance from the square."
        }, 
        {
            "index": 274, 
            "rating": "5", 
            "review": "Love this market. Spent most of our time in Cusco in this market. Great prices on fresh juice (did not have any ill-effects from drinking mango, carrot, and strawberry juice here). We also had a snack of rice with avocado, egg, and fries at one of the stalls, cheap and delicious. Bought a large clay pot for cooking, a vacuum thermos, t-shirt for grandma, some salted beans, and other odds and ends here at great prices. Also enjoyed the churros. Enjoy this market! (Tip- they don't open super early. Go around 9. They close at 7pm)"
        }, 
        {
            "index": 275, 
            "rating": "4", 
            "review": "Real Local Markets but watch your bags!!!. Great opportunity to get amongst the locals. Some fantastic photo opportunities. Cannot stress enough, watch your stuff! Visiting the markets today, someone attempted to get into my day pack in the immediate area of the markets. Luckily the main part of the day pack had a lock on it - now both sections have pad locks. They threw grain into my hair to distract me and attempt to steal what they could from the small section - luckily there was nothing of value there."
        }, 
        {
            "index": 276, 
            "rating": "5", 
            "review": "Wonderful glimpse of authentic Peruvian cuisine and culture. I absolutely loved the afternoon we spent at the San Pedro Market. It is full of authentic \"hole-in-the-wall\" food and juices. We bought a ton of weird fruit to try and it was a great adventure. They also have wonderful, dirt cheap 100% cocoa chocolate. Just be careful and try not to bring anything of value. This place is known for pickpocketing so you have to be careful."
        }, 
        {
            "index": 277, 
            "rating": "4", 
            "review": "The Art of Bargaining!. This place is the epitomy of bargaining. Any goods you can bargain down. But please my tripadvisor friends, if you want authentic alpaca, 100% sure you wont get it at any market in cusco. Those things are very limited and only sold at high end stores (unfortunately). But the sweaters and scarves at still very beautiful and inexpensive. Bought a colorful soft scarf for $5. Great bargain. Another great thing about the market was the fruit juices and vegetable soup. Although its true that the cleanliness of the place is in question, the soup was really delicious. I didnt get sick at all. I ate at the market twice and they gav me seconds. Imagine a large bowl of soup plus seconds for only $1.20. Cant beat it. If you want to know about medicinal plants in the market, please ask for Doris. She is the best thing in the market. The friendliest New York Native willing to help you with any questions. Awesome lady!"
        }, 
        {
            "index": 278, 
            "rating": "4", 
            "review": "Real Cusco. Interesting, original and not touristic local market. Here you can see, smell and feel real Cusco! Take a walk through the market, it will only take around 30 minutes and you can shop several things cheaper than in other markets. A must see!"
        }, 
        {
            "index": 279, 
            "rating": "5", 
            "review": "Best spot for lunch in Cusco. I can’t recommend this place enough. The sheer variety of trinkets and Peruvian wares is staggering, running the gamut from tacky to outrageous. But the real draw is the food. Rows of vendors serve a vast array of cheap and hearty dishes, including potatoes, corn, fresh breads, delicious soups, rice dishes, and every cut of meat imaginable. I ate lomo saltado all over Peru, but it was never as tasty as it was here. What’s more, the portions are huge, and the prices (a BIG lunch runs less than 5 soles) are awesome. Eat the hot sauces! They're good on everything.Ordering can be daunting at first. The overwhelming number of variations on a single theme can be hard to decipher. For instance, one could order lomo saltado with avocado (palta), eggs (huevos), and countless other addendums. If you aren’t sure what/how to order, just hang around and watch what the locals do. Knowing even a little Spanish or Quechua will serve you well here, but people are friendly even if you struggle. The fresh fruit/juice stands (there are literally dozens in a row) are also wonderful. Choosing one seems rather arbitrary, since they all seem to be peddling the same stuff. A warning: drinks are often mixed with ice (i.e. the local water), but it never affected us. It’s mostly locals in here, so you’ll stand out a little bit – but that’s part of the fun. I’ve heard others mumble about safety and/or the relative cleanliness of “street food,” but you’re missing an essential Cusco experience if you don’t eat here at least once."
        }, 
        {
            "index": 280, 
            "rating": "5", 
            "review": "Must visit this market!. San Pedro was the first market we visited and it was amazing. This is a market the locals frequent... with anything and everything you would ever need! The meat market was most interesting... and the veggies, fruit and flowers displayed beautifully! The woven products were located around the perimeter and you could find most anything your heart desired! We came back the morning before we left for more woven items as the prices were awesome."
        }, 
        {
            "index": 281, 
            "rating": "4", 
            "review": "A Very Interesting and Lively Local Market. Our local tour contact suggested this market after we told him that we liked local markets. We were not dispapointed. It was within walking distance from our hotel so we started early to see the surrounding area and then went to this market. Most of people were locals except for us and two other Americans with their guide.We started in the fresh fruit section where there were,also, fresh fruit juices squeezed right there.They had a big section of souvenir stores, big loaves of bread, lots of fresh meat ( they had heads of pig and sheep), vegetables and a big section of cafeteria. We did not have time to try their soup but we tried their bread. We had some slices of fresh pineapple that were so sweet. I tried some of the hard boiled quail eggs. The outfit of the local Inca people was very colorful. We thoroughly enjoyed the visit to this market."
        }, 
        {
            "index": 282, 
            "rating": "5", 
            "review": "Great Market. This is a great market - locals eating, crafts, flowers and nice fresh food everywhere. It was just at the end of the block from our hotel. It is covered, so great for anytime."
        }, 
        {
            "index": 283, 
            "rating": "5", 
            "review": "Buy your Peruvian wares HERE!. It is likely that you will be touring many a market while in the Cusco area. From Pisac to the tourist trap outside of the train station in Aguas Calientes. They are all selling the same stuff. You can get all of this at San Pedro, for a fraction of what the other markets are selling. Get your bracelets and bags and clay ware. In addition to the tourist goods the sites of the market place are really wonderful. Hundreds of different types of potatoes, grains, vegetables, meats, fishes, fabrics...you can find pretty much everything from the market place. Buy the local salt from Maras and the aji powders. Great to cook with when you are missing Peru at home."
        }, 
        {
            "index": 284, 
            "rating": "4", 
            "review": "The real Cusco. Where locals go to shop. You can get very affordable alpaca knitted goods (cheaper than in the stores), food (although I wondered about the cleanliness) and sll kinds of fruits & vegetables. A must see!"
        }, 
        {
            "index": 285, 
            "rating": "5", 
            "review": "now you're really in cusco. though you will see some fellow tourists here, this is a 100% local market. have a nice long walk through every section, and then go get a juice (you can't miss the three aisles of juicers). choose your juice lady, i recommend one that smiles while she's shoving her menu in your face. afterward, go to the prepared meal area, and enjoy your lunch, which will be filling and cost about 75 cents a person. be subtle and careful about taking pictures. mostly nobody minded, except the guy who flipped me off when i took a picture of his chickens."
        }, 
        {
            "index": 286, 
            "rating": "4", 
            "review": "Smells, colours and taste of Cusco. Worthwhile a walk through. Can see all in 30min, food, flowers, meats, locals, chicken soup, food hall.....juices!! Make sure while there you stop for a fresh juice for a few soles, worth it and then continue your day."
        }, 
        {
            "index": 287, 
            "rating": "5", 
            "review": "MUST SEE!. This is an authentic market of Peru. I wish I ate here more often but we discovered the last day! The food is the best price and with so many vendors the cost is low and just look for where the locals eat to find the best tasting stall. Beautiful displays of local foods. MUST visit!"
        }, 
        {
            "index": 288, 
            "rating": "5", 
            "review": "Great market to see how locals eat and shop!. A must see if you like wandering through markets! A busy place full of locals.. Be careful with your bags etc but I found it safe. The amazing array of fresh juice stores, chicken soup stores where locals eat on benches or standing, the fresh fruit and vegetables and different grains and cereals sold there are a sight. The alpaca and local products there are also a tad cheaper and you can bargain more. I wished I came here first for souvenirs!!!! "
        }, 
        {
            "index": 289, 
            "rating": "5", 
            "review": "Definitely a must visit in Cusco. I love visiting markets around the world, and this was was one of the tops for me. More than just plenty of stuff to buy and interesting foods on display it's a functioning cafeteria! We went here twice for delicious fruit shakes at one of the many stalls, then again for lunch where we got steak, rice and beans as well as ceviche...all delicious and cheap.If you want a real local experience for lunch be sure to check this place out!"
        }, 
        {
            "index": 290, 
            "rating": "5", 
            "review": "Very colorful! Great place to visit!. We really enjoyed this place and even tried some foods (drinks). I highly recommend this place to every traveler visiting Cusco. My impressions are captured here: http://youtu.be/mhJweAbzqP0 (\"Cusco's Colorful San Pedro Market, Peru\")."
        }, 
        {
            "index": 291, 
            "rating": "5", 
            "review": "Must-see market. For me this is a must-see in Cusco! You'll see all kinds of activity while you browse the stalls. You can find produce, prepared foods, and holistic health consultants. It's also a good place to shop for some souvenirs much more cheaply than many other places in Cusco. As with any place, be vigilant about your belongings. Make sure you try a delicious fresh juice!"
        }, 
        {
            "index": 292, 
            "rating": "5", 
            "review": "Great place to get a feel for the local people and products.. On our last morning in Cuzco we decided to visit the Mercado Central de San Pedro. This is the market where the local and area people buy and sell produce, meat, grains, cheese, flowers and many of the items they use in their daily lives. If you go, and want to shop, take Soles as they will not take American dollars. The market was a busy place packed with people buying and selling, some with booths and some simply sitting in an aisle with their products in front of them. One area had what we would refer to as a food court where the locals were all enjoying hot steaming soup. There were cooked chickens stacked on the counter and when someone would order soup, a chunk of chicken was chopped off and dropped into a bowl of steaming broth, vegetables and noodles. In one area women were busy chopping up meat, and from the looks of it, nothing goes to waste - including bull’s noses. There were aisles packed with beautiful fragrant flowers, stacks of herbs, vegetables we could not begin to identify and an interesting array of people of all ages.For us this was a must see stop where we could see how the area people trade and the types of products that are produced in the area."
        }, 
        {
            "index": 293, 
            "rating": "4", 
            "review": "Large variety of unique Andean produce with local flavor. Visiting Cuzco's central market you'll feel you've been in touch with the \"real \" people. All kinds of shoppers come to this clean and orderly market to buy foodstuffs from the region, like dozens of varieties of potatoes or the \"best corn in the world.\" Delicious bread from Oropesa is also available. You can also have a healthy breakfast or lunch for a small fraction of Plaza de Armas prices. The place is recommended even if just for visiting. Be careful with your belongings, especially outside the market."
        }, 
        {
            "index": 294, 
            "rating": "4", 
            "review": "Local flavor. Not far from the Plaza de Armas, across the street from San Pedro church and San Pedro train station. The mercado is a good place to spend an hour. Apart from selling fruits, vegetables, meats, fish, etc. there are also booths that sell handicrafts, traditional medicines, etc. An interesting place where you can get real local flavor."
        }
    ]
}