{
    "category": "Cusco", 
    "entity": "Planetarium-Cusco", 
    "avg_rating_stars": 4.699346405228758, 
    "review_count": 306, 
    "rating_stats": {
        "poor": 0, 
        "average": 13, 
        "terrible": 4, 
        "very_good": 50, 
        "excellent": 239
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "Fantastic!. We really enjoyed our time at the planetarium. It's a family operated place and they're all really lovely people. We learned so much about the Incan night sky and got to see Saturn and the moon through telescopes which I'll never forget! Really inexpensive and a must do if you're at all interested in the stars/planets/etc."
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "Fantastic evening in Cuzco. Family operated planetarium, it included a view of the sky as well as some history about astronomy done by the Incas. It is a lovely family, you shouldn't skip this one at all!"
        }, 
        {
            "index": 3, 
            "rating": "4", 
            "review": "Great way to spend the evening. A visit to this family-operated attraction is a great way to spend the evening in Cusco. The cost is 50 soles, which includes a ride to and from central Cusco, and the program is offered in English. You need to make reservations using their website, but you don't actually pay until the end of the program that evening.The planetarium show was excellent and provides a basic overview of astronomy, the night sky over Cusco, and its importance to the Incas. However, the highlight was the telescope viewing. We looked at Saturn (which was spectacular!), the moon, Mars, two star clusters, and a binary star system. Make sure to check the weather forecast before you go because overcast or rainy weather will obviously impact the telescope viewing."
        }, 
        {
            "index": 4, 
            "rating": "5", 
            "review": "Wonderful. This is a a family run planetarium. Everyone there is so passionate about the culture and stars. I learned a lot about the Inca culture and how they used astronomy. The staff do a great job pointing out the different constellations. We got to look through the telescopes and see stars and planets. It is chilly they did provide a blanket. Highly recommend!"
        }, 
        {
            "index": 5, 
            "rating": "5", 
            "review": "Feel their passion!. Not too many people know about this place in Cuzco, I am glad I found it on Tripadvisor. You start with a very interesting explanation about how the quechua people used astronomy in their lives, you also see the constellations at the domo and what is the best part is to go out to see the sky through their telescopes. I went there twice, the first night was a little bit cloudy but we could see Saturn, some constellations and the Milky Way; the sky was much better the second evening and I had the honor of sharing some more time with Mr. Erwin Salazar while the rest of the group received the introduction, so he showed me different celestial bodies and it was great to know more about how the Planetarium started, then I laid down on the grass to watch the stars while the rest of the group were looking through the telescopes! IT WAS AMAZING, clear skies in a magic place! Just bring a very good jacket because nights in Cusco are cold."
        }, 
        {
            "index": 6, 
            "rating": "4", 
            "review": "Wonderful experience. This family-run planetarium was a delight. The love of their culture and the stars is evident. I learned a lot about the Incas and the stars. Best of all was looking through their many telescopes. Priceless!"
        }, 
        {
            "index": 7, 
            "rating": "5", 
            "review": "A higlight of my Cusco trip. Well worth the money. I wanted to get acquainted with the southern sky before heading off for my Salkantay trek. It turns out this was the only time I saw any stars - the moon was either too bright or the clouds too thick - so I am double grateful I got a chance to visit the planetarium. Next time I am south of the equator I will come during a new moon!"
        }, 
        {
            "index": 8, 
            "rating": "3", 
            "review": "Fun but pricey . This was a really nice excursion - pick up was prompt, the guide was enthusiastic and knowledgable, and the setting was comfortable. However, I would say it's only worth it if the sky is clear. 50 soles is a lot to pay for just the presentation itself so make sure to check the weather forecast beforehand!!"
        }, 
        {
            "index": 9, 
            "rating": "4", 
            "review": "Fun, Random Experience. The planetarium in Cusco was really cool - neat to hear about the stars from the Inka perspective. Their culture was very advanced in terms of astronomy, and relied heavily on the stars to master agriculture as well. Tour picked us up in Cusco, and once we arrived, they gave us a bit of a lesson, let us see stars and constellations ourselves through their giant telescopes, and then showed us the classic dark room planetarium stars. Note, it was one of our first nights in Cusco and we hadn't realized how cold it can get once the sun sets. Take a jacket! You will be outside for part of it."
        }, 
        {
            "index": 10, 
            "rating": "5", 
            "review": "Family business that cares. I really enjoyed the planetarium in Cusco (it's actually just outside Cusco's valley). The family that owns and operates it is very excited about cosmology, and this rubs off in their presentations. They are so clearly excited about their planet, the stars, and the cosmos. That enthusiasm makes the visit worth it."
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "Freezing but fun!. They aren't joking when they say to wear lots of layers--but they hand out blankets as well, which is very nice. You're picked up in a square near the Plaza de Armas and driven up near Sacsayhuaman. There's a little intro and then some star gazing and a planetarium show. Unfortunately it was a full moon, so we weren't able to see a lot of stars with the naked eye, but they still looked gorgeous in the telescopes! Overall a fun experience!"
        }, 
        {
            "index": 12, 
            "rating": "5", 
            "review": "Great information on Inca understanding of the cosmos. This is a family run business which offers interesting insights into the southern night sky. The tour picks up from one of the smaller plazas in central Cusco and takes people in a bus to the planetarium, which is a small building next to a playing field away from the bright lights of Cusco. Stars and planets are viewed from telescopes on the lawn, and the planetarium is in fact a projection onto the ceiling of the building. Nevertheless it is very interesting particularly when discussing Inca understanding of the stars, and those from the northern hemisphere get an explanation of the southern night sky and a look at the milky way if the night is clear. Dress warmly and choose a night with no moon, for best viewing"
        }, 
        {
            "index": 13, 
            "rating": "5", 
            "review": "Interesting and educational experience!. Our experience in Planetarium Cusco was great! We were picked up in downtown Cusco in the early evening. A mini bus takes you to the Planetarium. We were presented information on the significance of astrology for the Incas, which I found incredibly interesting. In a special room simulating the night sky, we then learned more about different constellations and how to recognise them. In the end, we observed the night sky through telescopes. I enjoyed the fact that the Planetarium is a family business. Everyone was also very passionate about what they were doing.Really worth a visit!"
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "Fabulous & interesting experience!. We decided to give this a try as something a bit different and we were not disappointed! You meet in the square and are taken to the planetarium near the Sascy ruins. Our guide was great with good English and a good knowledge of astronomy, it mainly focused on the Southern Hemisphere and he gave a good explanation of how the Inca's etc used the night sky to guide them. Following a history on the Inca's we went into the planetarium dome where we learnt more about how the Southern and Northern Hemispheres worked and about the constellations which was fab. The final part of the tour was outside looking at the stars both with the naked eye and through the telescope. This part was done by a different guide who clearly knew a lot about the stars and planets and was very passionate. He used a laser to point out the constellations then we used the telescope to view star clusters, Mars, Saturn and most impressively of all the moon. Def worth the 50 soles each to experience this!"
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "Highlight of my trip to Peru. I'm an amateur astronomer and whenever traveling I carry my portable telescope to both observe objects I don't get to see in my location in the US as well as share with others the splendors of the sky.My wife discovered the existence of this planetarium and we booked a visit the only night we were free. We were met at a park in downtown Cusco and driven to the Planetarium's location out of town.We were absolutely amazed at this family run passion project. Upon arriving we were brought into a room and given a brief introduction on how the different Inca sites are aligned with the Winter and Summer Solstices. For such a small operation they had huge backlit photographs professionally made and hung on the wall.After this intro we went inside their planetarium, a room they had installed a spherical ceiling into, and their own homemade star and constellation projectors. For such a small operation the way they created this planetarium was absolutely ingenious. Here we were given a tour of the Southern Hemisphere stars. Following this was a very professional slide show that explained the Incan constellations. Even though I'm an avid astronomer I learned a great deal from this part of the tour.Finally, the tour ends outside looking at objects in the sky through two telescopes and a pair of binoculars they have on hand. At this point the tour was handed over to the Uncle who excitedly showed us Mars, Saturn, and the double star Albireo. Unfortunately, the night was hazy so we couldn't observe any deep sky objects.If you are visiting Cusco definitely keep an eye on the weather and book a trip to the planetarium! As I said before, it's a family run passion project that was informative even for experienced astronomers, great for kids, and filled with enthusiasm for the subject. My wife and I are already making plans to return in a year and want to visit this place again."
        }, 
        {
            "index": 16, 
            "rating": "5", 
            "review": "Enthusiastic family-run operation. Pick-up from central Cusco, they take you out to their building and give a short lecture explaining importance of sky to Incas, then take you into their Planetarium dome. Then they take you outside and point out different constellations and planets through their 2 telescopes. This latter part is cold (it's late, dark). Wear really warm clothes!"
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "A great evening of learning - for adults and kids. We had so much fun at the planetarium. The family that runs it is so knowledgeable and so passionate that it is infectious. We learned about the stars in the southern hemisphere and about Incan astronomy, then went out and used their telescopes to see some incredible sights. Our kids loved it, but we did too - and most of the people there were adults"
        }, 
        {
            "index": 18, 
            "rating": "4", 
            "review": "Inca Sky. Very informative, educational view of the constellations the Inca saw. One of our favorite activities in Cusco. Dress warmly."
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "A definite highlight! . We booked to do the planetarium due to the excellent reviews and my love of space and what an amazing choice. We were picked up from the centre of Cusco and driven out to the family run planetarium high up in the mountains. Such a beautiful tranquil place. The family were so informative and passionate about space. Outside we saw clearly Jupiter, Mars and Saturn it was simply stunning. This was definitely one of our favourite trips and would highly recommend a visit."
        }, 
        {
            "index": 20, 
            "rating": "5", 
            "review": "Educational. Extremely interesting and educational. The best part was the woman who guided us through. She had a great personality and made everything interesting and entertaining."
        }, 
        {
            "index": 21, 
            "rating": "4", 
            "review": "Interesting trip!!. We booked this on a whim and were able to get in same day! It was a quick trip but definitely worth it. You will hear a lot about Incan history- but the best part is when they take you in their planetarium and project the stars/constellations. The stories and information we heard here about the Incan relationship with the stars and sky were very unique. this isn't something you can hear about on a city tour or anything. And it was a really cool way to get ready for our trek to Machu Picchu- we were able to recognize constellations where we were hiking! Only downside was that it was a cloudy night so we weren't able to see anything out of their telescopes."
        }, 
        {
            "index": 22, 
            "rating": "4", 
            "review": "Unique Experience! Group was way too big!. We were really looking forward to this very unique experience – and it was truly something very special! The evening was very informative and after an interesting talk, we went outside and got to look through three different very powerful telescopes, aimed at the moon, the nearest star to earth visible from the Southern hemisphere and a planet with it’s moons. We were in awe at what we saw! It was absolutely freezing, despite our thermals and layers of clothing, gloves and hats! Our hosts handed out blankets to everyone, which really made a huge difference, especially while we were outside. We booked a private experience by email directly with our hosts and shortly before our departure to Peru, the date was changed due to a personal commitment on their end, which understandably happens, but we would no longer have a private experience, which was quite disappointing. Our hosts met us in Cusco at the agreed meeting point in Cusco to drive us up to their home. (No charge for the ride!) Our hosts were absolutely lovely, very personable and likeable – quite funny and quirky too. The talk we had was very interesting and we really enjoyed it. We especially enjoyed the comparison between modern astrology and the way the Inkas and ancient people of Peru viewed and utilised the stars. The only criticism I can offer is to limit the group sizes. We were about 40 people and it was a tight fit. We had to be split into two groups, which caused a bit of a disorganized situation a few times. Also, with the viewing through the telescopes we had to line up for quite some time and then got only a few seconds to have a quick look. If the group was much smaller it would have been more manageable and a more unique and personal experience - and everyone would have had enough time at the telescopes. Getting back to Cusco could not be done all in one go and we had to wait for the first round of buses to return before we finally got our turn. It was absolutely freezing and a very uncomfortable wait. Take a torch for the walk back to the minibus – it is pitch black and there are stairs involved! Lucky we had ours! I would certainly recommend this experience, but fork out the extra money and do a private tour (then hope it won’t be cancelled)."
        }, 
        {
            "index": 23, 
            "rating": "4", 
            "review": "Fascinating family business, not just for star gazers. Had this recommended and would recommend to others. You are taken by bus out of town and then three stage visit with first part on Incas and the stars, then planetarium type show and finally out side to look through telescopes. I am not a star gazer but was fascinated as were both teenage kids. But wrap up warm, blankets were provided but it's cold. Family business, privately run and their enthusiasm came through."
        }, 
        {
            "index": 24, 
            "rating": "4", 
            "review": "Planetarium Cusco. I went here with my tour group. A pleasant evening out. A small planetarium but extremely informative. We were provided with blankets to keep us warm and whilst inside the heater was also on. Time was spent inside with a ceiling screen presentation then outside to view through the telescope."
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "A different Cusco experience!. A wonderful family run experience! You will be picked up with the rest of the evening's group close to plaza de armas and taken up above Cusco to a nice house/garden in a minivan. The rest of the evening will be spent in a small planetarium learning about new, old and Inka specific zodiacs , learning about the stars importance to the Inkas and gazing at Saturn's rings through telescopes. Bring warm clothes for the last part, but no worries if you forget - there are lots of blankets. We loved it, thank you!"
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "Impressive and worthwhile.. I was travelling with some Canadian students (14-18 yrs old) during spring break and we booked a tour at the planetarium as we had some free time while in Cusco. I admit I wasn't expecting much but I was totally impressed after our tour. I'm amazed at the love, dedication and commitment the family has to share and teach others about astronomy. Loved looking through the telescopes to see Jupiter, the moon and a cluster of stars, breathtaking!! We ALL had an enjoyable evening and definitely one of the highlights of my trip to Peru :)"
        }, 
        {
            "index": 27, 
            "rating": "4", 
            "review": "Interesting visit. I'm from the northern hemisphere so this was interesting. First time I have seen the southern cross. The guide was very enthusiastic about the planetarium."
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "Tied everything together. The tour was interesting and helped tie together all the information we had learned at other sites. The stars were very important to the Inca empire. The guide spoke good English and was funny."
        }, 
        {
            "index": 29, 
            "rating": "5", 
            "review": "Loved This!. We recently spent four days in Cusco before we started our journey on the 4-day Classic Inca Trail hike. On our second night, we visited the family-run planetarium and we couldn't be more pleased with our decision! Not only did we learn about the constellations of the Incas, but also more of their history. It was really helpful as we visited the Sacred Valley the next day - especially Ollantaytambo! I would definitely recommend this to anyone planning to spend time in Cusco, and I'd suggest doing it early in your visit. It's was a great experience, taught us a lot and allowed us to impress the other hikers with our knowledge of the stars once we got on the trail!"
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Great way to learn about the sky you'll see on trail!. Just 2 hour experience but you learn a lot about the southern sky. I saw Jupiter and Saturn for the first time with their huge telescopes. They pick up and drop you off and offer both Spanish and English presentations. I'm excited to have gone this before my Salkantay hike where I'll get an amazing view of the Milky Way!!"
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "Inka Skys. This is a small family run planetarium with an amazing view of the night sky. It's on a historical reserve of sorts so the facility is built in a very Cusco fashion. If you speak or understand Spanish I recommend you take the tour in Spanish (of course the English tour is great also) The head of organization is an astrology professor with an amazing way of being informative and entertaining in a story telling sort of way. It's definitely worth it! Oh and if you are going in Peruvian winter dress warmly!"
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "Great! . We had a wonderful time - our guide Jose was very passionate and knowledgable about astronomy and related it to inca history. They have their own made projector which was informative and visually spectacular. Furthermore, we got to see Mars, Jupiter and Saturn! I have to say a special thanks because I wasn't feeling well - the staff were so lovely and facilitated me seeing Mars, Jupiter and Saturn after the rest of the group - thank you! Well worth a visit!"
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "Fantastic Experience!. We had a great time on the tour. The company is family run and all of them are passionate and extremely knowledgeable about the subject. I learned so much on my tour. It was definitely a highlight of my time in Cusco!"
        }, 
        {
            "index": 34, 
            "rating": "5", 
            "review": "Gorgeous evening. Had the best time here, if you have the time in Cusco you should absolutely check it out. It's a family run operation and they absolutely love what they do. It is utterly magical standing outside stargazing with other travellers, a really special evening."
        }, 
        {
            "index": 35, 
            "rating": "5", 
            "review": "If you are in Cuzco, do this. . Amazing evening. The hosts know their stuff, it's part Inka history, part stars. Brilliant way to spend the evening."
        }, 
        {
            "index": 36, 
            "rating": "5", 
            "review": "Lots of fun!. First, to fully appreciate how much fun we had a little background is needed. We did this on our first day in Cusco. We were all feeling terrible. The altitude was taking its toll on us. And it was really cold. There was debate about even going since we were hurting, but we did go. And we had a blast! The hosts are extremely passionate about space and the stars so you can't help but get excited too. Two of our family of three are space nerds, so getting to see Jupiter through the telescope was really exciting."
        }, 
        {
            "index": 37, 
            "rating": "3", 
            "review": "Enjoyable but not spectacular. This family run planaterium sits on the hills above Cusco. The night we went it was overcast so the only star gazing was inside at the roof. The show was interesting but not brilliant. They showed the different constellations visible in the Southern Hemisphere. The bench around the wall was uncomfortable after a while. We were given a blanket to put around us.They weren't pushy to up sell any souvenirs."
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "Incredible night of stargazing! . I went to the Planetarium my first night in Cusco. Privately run by a local family, they pick you up between 5:45 and 6pm from downtown Cuzco and take you to the Planetarium site, up narrow, rocky roads and your very own adventure. I felt safe with our guides, and they clearly have it down to a science because at least two other groups were there that same night. You start indoors, where they explain the stars and how to spot them. If you're usd to the Northern Hemisphere, it's a treat to see the Big Dipper upside down! They have blankets available towards the back, make sure to grab some! It gets cold outside. Once outside, they'll point out various stars and planets that you can see either with the naked eye or through the telescope. On my night, we saw Jupiter! Really cool, not rushed so you have time to enjoy or look again if you want. Could use some snack or hot beverage option. You pay in soles before you leave, 50 per person.Wonderful nighttime activity! Definitely go!"
        }, 
        {
            "index": 39, 
            "rating": "3", 
            "review": "I expected more. First of all - it's a PRIVATE planetarium. I was hoping to experience something unique but experience was average. They picked us up in Cusco and drove 5 minutes up the hill. I thought we will go into the wild so we could enjoy the best conditions to watch stars. But the place is still within the city, so you get all this glare from city lights ! First part was interesting - when they talked about stars and legends. But part in which we actually watch the stars is really so-so. They have one mid size telescope, so you won't see a lot of details... I must say it was way overpriced experience.It's a family business so I wish them all the best, but there is a lot of things they can improve:-move your base further away (to total darkness) and give more time for individual experience- make smaller groups - it's not good to wait for your turn for telescope in a group of 20 people- lower your price or offer better experience"
        }, 
        {
            "index": 40, 
            "rating": "3", 
            "review": "not the number one of the activity you can do in Cusco. The introduction was OK, I had a few new informations. looking the stars.. mmm.. I expected to see more than this with telescopes! was for me not very special.. the planetarium at the end was OK.our guide was friendly and it's good organised. I think is not the number one of the activity you can do in Cusco.. but if you have a lot of time.. then do it. it's not expensive."
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "An excellent educational and entertaining evening. We were taken by mini-buses from the square up to the observatory on the hillside above Cusco about 10 minutes drive away.The evening was split into three: general details of the sky at night and the constellations, information about the Inca astronomy and finally practical viewings through binoculars and a telescope.The evening's group was split into three with each sub-group rotating through the activities. It was very well organised and wonderful to see the enthusiasm of the family members as they took us through their presentations.A really excellent and informative evening and highly recommended, but wrap up warm as it can get cold up on the hill at night!"
        }, 
        {
            "index": 42, 
            "rating": "5", 
            "review": "Perfect evening activity. We were able to get into to this activity through our hotel. It was well worth the 50 Sol per person. They show you Inca constellations and their meanings and let you star gaze outside as well. We had a great view of Jupiter. Bring warm clothes because it gets chilly at night. Also their dog gandalf is great."
        }, 
        {
            "index": 43, 
            "rating": "5", 
            "review": "A most interesting night. We were a group of 7 and we all enjoyed our experience learning about the Inca sky and seeing it with our gracious hosts. Do not miss this one!!"
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "A must-see if you're in Cusco! . This is my first Trip Advisor review, but I feel so strongly that I have to write about the planetarium. They were able to squeeze is in last minute, and everything was very well run and organized. We started in the planetarium and learned about constellations in the northern and southern skies. Everyone in this family-run business is extremely knowledgeable. We then learned about Inca constellations, ancient time telling, and how they learned to predict the weather. Finally, we went outside to stargaze. We saw a few clusters that you are not able to see with the naked eye, as well as Mars, Jupiter and 3 of its moons. Bring a warm coat for this part. They also provide blankets if you need them. It is the perfect amount of time, and they drop you back in Cusco just in time for dinner!"
        }, 
        {
            "index": 45, 
            "rating": "5", 
            "review": "Great experience!. It was a great experience and we learned a lot! Would definitely recommend as a way to spend an evening in cusco! You meet in a square in cusco and travel by van to the planetarium nearby. The guides were very friendly and knowledgeable."
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "Very educational and fun visit. Very knowledgeable and passionate guide. Great overview and introduction to the Southern sky and the ancient Incas’ constellations. Made us want to stay up all night to learn and see more. Saw Jupiter's bands and its four Galilean moons."
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "Excellent. Visited May 2016 and thoroughly enjoyed myself. The telescopes showed us Jupiter and its moons as well as earths moon and some stars. Planetarium itself was good but the stars of the show are the family that run this place. Very funny and informative and made the experience all the more enjoyable! Recommended!"
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "Family Run and Wonderful. They pick you up in the center of Cusco and drive you up to the planetarium on the hill. This was a great introduction to the night sky of the southern hemisphere and some of the cosmology of the Incas. If you are lucky enough to get a clear night, they will bring out some telescopes so you can view some planets and stars (whatever is visible that night).This was a perfect activity before trekking as we were then able to identify some constellations from our campsites in the mountains."
        }, 
        {
            "index": 49, 
            "rating": "5", 
            "review": "Really interesting!. A very interesting and informative guide to the constellations. Very highly recommend it for people visiting Cusco."
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "Star gazing. Fantastic planetarium. Guide was so enthusiastic, you couldn't help but love it. Saw stars and constellations. Great evening."
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "Interesting astronomy event!. Get to know the southern sky.\nListen to interesting stories about Inca astronomy.\nGood way to spend time after sunset in Cuzco.\nWould be even better if observe more objects."
        }, 
        {
            "index": 52, 
            "rating": "4", 
            "review": "Interesting. The people that run this private planetarium are certainly enthusiastic. It is really an audio visual show with some interesting Constellations drawings on a dome ceiling. Not a full scale Planetarium by any means. They have two telescopes outside and it can be cool so dress warm. This affords you a closer look at a particular constellation or even a planet. We saw Jupiter. A long drive from Cusco however and on an iffy road."
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "Very informative. We went here because my girlfriend loves the stars, I had no clue about astronomy but learned a great deal about it on this tour. all the explanations were great and we had a clear night, so we could check all what we learnt on the sky"
        }, 
        {
            "index": 54, 
            "rating": "5", 
            "review": "Excellent visit. I'm not a astronomy enthusiast but I enjoyed every minute of this visit. This is not a high tech planetarium but a family business, which made this different and fun. The staff (family) were very professional and passionate about their jobs, making this visit very memorable. Definitely worth a visit and experience something different other than the Inca ruins."
        }, 
        {
            "index": 55, 
            "rating": "4", 
            "review": "Very enjoyable evening . Our visit to this small family run planetarium was a great way to spend an evening. The love and excitement the staff feel for astronomy and Incan/Quechua culture is very contagious. Highly recommend to anyone who likes the night sky."
        }, 
        {
            "index": 56, 
            "rating": "4", 
            "review": "Really cool and different. A really neat family run star program. They pick you up in buses from the city center and take you up the windy road to their homemade planetarium dome just outside the city really close to saskeewama. Jose the English guide gave a really nice heartfelt introduction to Incan astronomy. This was followed by an insightful planetarium dome presentation, and lastly a real view of the stars thru telescopes. Despite the family probably doing this show every night, it was such a pleasure to see how they were so into it."
        }, 
        {
            "index": 57, 
            "rating": "5", 
            "review": "Charming and enjoyable. We visited the planetarium yesterday evening with our children ages 3, 7 and 9. Although it is not exactly geared for kids, the presenters are so engaging and kind and accommodating, that our kids really enjoyed the experience, as did my husband and I. My favorite part was learning about the Inca constellations and connections to the culture. But it is a full planetarium presentation, so you also get a great review of the Greek constellations and astronomical distances, etc.."
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "Better than Cusco tour!!!. I said better than Cusco tours, because the Planetarium's staff really KNOW what they are doing, they take it serious and they really love what they are doing, they are not improvised locals trying to get money from tourist like I experienced with the tourist guides.I am very happy with the experience, specially my children enjoyed it !!100% recommended."
        }, 
        {
            "index": 59, 
            "rating": "4", 
            "review": "Enthusiastic staff and intimate stargazing experience.. Great evening activity for any age. We had a cloudy night but the enthusiasm of the staff and fellow travellers made the experience very enjoyable. Very knowlegeable and friendly staff. Easy pickup Regocijo Square."
        }, 
        {
            "index": 60, 
            "rating": "5", 
            "review": "A great little planetarium. My daughters (10 and 12) , my husband and I had a great time. We were unlucky with the weather because it was very cloudy but we managed to see Pluto. Our guide was very passionate about the incas and the sky. Definitely worth a visit"
        }, 
        {
            "index": 61, 
            "rating": "5", 
            "review": "what a amazing night. watching at the faraway stars and constellations make me travel in imagination to the origins of our universew...its a educating visit, recommendable."
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "Great Experience to enhance the Cusco experience!. I was not sure what to expect but I was pleasantly surprised by the experience. The staff knows what they are talking about, they are entertaining and informative! If you have a couple of hours one evening this is well worth the time and the money!"
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "Amazing stars. Very nice excursion after which I can said that stars come closer to me)) nice lecture and wonderful experience of sky observing)"
        }, 
        {
            "index": 64, 
            "rating": "5", 
            "review": "Educational and fun!. If you have any interest in astrology, you should definitely check out the Planetarium. The people are lovely, know their stuff and fun. We were unable to view the night sky because of rain, but we still learned a ton and were reluctant to leave when our time ended."
        }, 
        {
            "index": 65, 
            "rating": "5", 
            "review": "Best museum/attraction experience ever!!. What can i say. I was planning this visit as a surprise for my girlfriend on our last night in cusco, and boy was it wort it...the way they explained everything with so much passion and enthusiasm was incredible, i wish all my teachers in high school would have been like that haha. I loved seeing my gf listening with an open mouth, im sure i had a similar expression on.my face...after talking to us about inka astronomy, they took us to their small dome, it was fantastic! I cannot describe everything here, there was too much shown amd talked about, all i will say is go go go!!! If you have the chance to:)Sadly there were alot of clouds there for the last part, star gazing, but nothing else could be expected for that time of the year. Still, that didnt change the fact that we both looooved the tour, and we are coming back in june to see you guys again, and gandalf ;)Lukas & maricielo"
        }, 
        {
            "index": 66, 
            "rating": "3", 
            "review": "Passionate folks and informative presentation. Jose and his family run this humble planetarium. They pick you up at Plaza Regocijo, so keep your eyes peeled while you're waiting so you don't miss the pickup. They provide a very informative presentation on astronomy and how it affected the early cultures of Peru. This is followed by a presentation in the planetarium dome and then gazing at the moon and stars (if visible) through some high-powered telescopes and binoculars. We weren't quite as wowed as we anticipated based on the reviews, but it was still a unique experience and we're happy to support a family that is passionate about educating folks on early astronomy. Although they provide some blankets, I'd recommend bringing a warm jacket as it gets cold once the sun sets."
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "Planetarium Tour. took this tour with my family, make sure you bring a warm coat as it can get very windy up at the mountain for night observation. Would recommend the tour."
        }, 
        {
            "index": 68, 
            "rating": "5", 
            "review": "A highlight (excuse the pun) of Cusco. You travel uphill out of Cusco to an isolated site in a small valley. We first had an explanation of the constellations in each hemisphere - it's a long time since I learned so much in such a short time. We then moved through to the dome to look at the skies as we see them and learn how the Incas developed a total connection with their environment. Sadly the skies weren't clear but this didn't detract from our enjoyment. A really knowledgeable and interesting member of the family brought the skies to life. Wrap up warm if you're going in winter."
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "Absolutely AMAZING! . This is a lovely family run business, and our guide did a fantastic job explaining to us all the stars, constellations, ancient beliefs and its many stories. You also get to learn about how astronomy shaped agriculture back in the Inka period which is absolutely fascinating. The place is built in a lovely serene area where you could easily see stars during the non cloudy season. Unfortunately, the sky was completely clouded on the night of our visit but we were not left disappointed at all because the dome and its projections along with the guide's excellent presentations more than made up for it! I have not met someone who explained the stars so well and with such animation! An absolutely memorable evening. Do come - you won't be disappointed!"
        }, 
        {
            "index": 70, 
            "rating": "5", 
            "review": "Excellent!. We really loved our visit to the small and charming family run Planetarium. Jose was the perfect, super knowledgable host (on astrology but also Inca's in general) and the dome with the projection of the night sky and presentation on Inca astrology all very interesting. A good activity even if it's cloudy because so much of the presentation is done in the dome. one of our favourite Cusco outings."
        }, 
        {
            "index": 71, 
            "rating": "5", 
            "review": "AMAZING!!!. So worth a evening in Cusco! This is a family owned business and they do an excellent job explaining the role of the stars in Incan history. Then they take you outside with a nice telescope and look at the night sky. We were able to see the moon and Saturn along with her rings."
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "GO!!!!!!!. This planetarium is modest but is very intimate and the people running it are amazing and so passionate about what they do. I had one of my favorite times in Cusco at the planetarium Cusco! It is barely advertised but worth every sole! I would go 10 times if I could but we are leaving tomorrow. You are also supporting a local, family run, operation. I would give it 6 stars if possible. GO!!"
        }, 
        {
            "index": 73, 
            "rating": "4", 
            "review": "May want to skip in the cloudy season; See Sacsayhuaman on the drive up.. I emailed Ana Maria if there were any last minute open spots for a tour on the same day. Ana Maria was very responsive, and luckily for me, there was a tour that night (they are typically not open on Sundays, but this time they happened to have a large tour participating, so I was able to come along—so if you only have time on a Sunday, you might as well shoot an email to ask).Set your expectations a bit low…this is nothing like the planetarium in large cities (I was a bit worried when we pulled up to a small farm-like area with llamas in the front yard), though they have a dome where they show constellations. The pick up was at 5:40, and the lecture lasted about 1.5 hours. We were supposed to then go outside to spot constellations, but as we were in the rainy season (their summer month of January), and so we couldn’t see anything. I did appreciate that they are a family-run business that operate out of labors of love. They genuinely care about the environment and human connection to it. I hope that they can survive. Also, an added addition: I didn’t have the chance to see Sacsayhuaman. (Well, I decided to skip it, actually, because I figured it wouldn’t have compared to Machu Picchu). The “observatory” is located close to Sacsayhuaman, and so I got to see most of it on the drive up the hill. Student price: 30 soles. Adult price: 50 soles (I’m not sure I would have paid the 50 sole admission fee…)."
        }, 
        {
            "index": 74, 
            "rating": "5", 
            "review": "Worth a visit!. If you are into astronomy and the stars this is a very cool place to visit! The owner and his nephew are very passionate about their work with the sky and have very cool information to share. You have the opportunity to look into 2 different telescopes and see different stars and constellations for yourself! Part of the tour is indoors and part is outdoors. They do offer you blankets to keep warm outside but if you tend to get cold in chilly weather bring an extra layer. Definitely worth a visit!"
        }, 
        {
            "index": 75, 
            "rating": "5", 
            "review": "Interesting, relaxed and informative evening. Visited the family run planetarium before Christmas with the family and it was great - really well presented and very informative - pickup from near the chocolate museum was very handy - recommended for families - dress warm as it gets chilly after the sun goes down."
        }, 
        {
            "index": 76, 
            "rating": "4", 
            "review": "A great experience in a small family-owned planetarium. This is definitely an experience I would recommend. They have their own private transport from the center of Cusco and the tour has several parts - a presentation about Inca astronomy, a planetarium projection focusing on the Southern constellations, and observations outside if weather permits. Our tour guide was quite knowledgeable and showed us a few important stars and objects in the sky. Many of the facts he told us were very interesting - for example that the Incas knew how to predict El Nino from the brightness level of the Pleiades. As constructive criticism, I would point out that when we went outside to observe it was still twilight, so do it later in the summer months. Also, the observation outside was too short - by the time it got really dark and it happened to clear up a bit, we had to go. I would have liked to have the option to stay longer in their yard in order to observe, maybe even by my own. Perhaps they can give that option and then call you a taxi? The observations outside did not focus much on the Southern Sky, which is why I went primarily - most tourists would be from the Northern hemisphere I imagine. Overall a very worthwhile and recommended experience."
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "Don't miss this if you're in Cusco!. I don't want to give you any high hopes before your visit but I can't lie to you when I say that this was probably one of the best experiences I had in Cusco. To really appreciate this lovely evening at the Planetarium I'd recommend you to atleast visit the Qurikancha or Machu Picchu.This family business is very passionate and this is felt throughout the whole tour. I was completely mind-blown when I left the place. It felt as if this event was the ribbon that tied up all of the new information I had absorbed about the Inkas deep connection with the nature and cosmos.I was also genuinely happy to see that some of that spirit didn't fade out with time but rather was passed on into this family.I can agree with some of the negative comments that the meeting in the plaza seemed somewhat unorganized, but you have to be somewhat distracted if you do not see the young gentleman in a blue jacket with the planetarium logo on it.We had a bus leaving just before the tour was over, the staff were very kind to us and arranged an earlier transport for us so that we wouldn't miss it.I miss Gandalf already! (for those who make a visit)"
        }, 
        {
            "index": 78, 
            "rating": "4", 
            "review": "my family is crazy for the stars. We could learn more of the universe by watching to the program on this planetarium, and with the help of the owner, possible to watch & identify some constellations, stars and the moon (that night the sky was quite clear)...it was very interesting and educating to sign for this tour."
        }, 
        {
            "index": 79, 
            "rating": "5", 
            "review": "Very knowledgable host; we learned a lot. We had an evening free in Cusco and made arrangements for this visit. This is a family business. We were met on time at the exact location and escorted to the planetarium. The young man who gave the lecture was very well informed and told us facts that we found useful later as we toured Machu Picchu. Unfortunately, it was cloudy and we did not get to star gaze but it was an enjoyable, informative evening."
        }, 
        {
            "index": 80, 
            "rating": "5", 
            "review": "Awesome evening!. My two friends and I visited the planetarium during our stay in Cusco. It was such a great evening! You're picked up from a square and taken about 10-15 min outside of the city to a family run farm-esque feeling place. The family that owns the planetarium is clearly passionate about what they do which in turn also made my friends and I excited. There are two parts to the evening...the first part starts inside their planetarium where you learn about southern hemisphere constellations. The second part you go outside and get to look through their telescopes. They provide blankets but definitely suggest bringing jackets and sweaters because it can get very cold at night!"
        }, 
        {
            "index": 81, 
            "rating": "4", 
            "review": "great way to spend an evening in Cusco. This was a well run family operation that offered lots of great information. We did this our first night in Cusco and it was a great way to be out without being overly active while acclimatizing to the altitude. Very interesting to learn about how the Inca used the stars. Worthwhile"
        }, 
        {
            "index": 82, 
            "rating": "5", 
            "review": "Fascinating place. Run by a Family who explain everything so interesting\nA must if you have time and visiting Cuzco\nyou can even look through the telescopes ans see Saturn"
        }, 
        {
            "index": 83, 
            "rating": "5", 
            "review": "Very enjoyable. One of the highlights of our trip to South America. Enthusiastic team gave very engaging presentation following which we were able to look through telescopes at the night sky. We even got to see saturn's rings! Definitely worth a visit."
        }, 
        {
            "index": 84, 
            "rating": "4", 
            "review": "Good visit, good information and well presented. The visit was great, I would say a bit short and quick. At the end of the session we were supposed to use the telescope, but the guy who does it was not there, and our guide was not experienced with it, although he has good knowledge of what he spoke about"
        }, 
        {
            "index": 85, 
            "rating": "5", 
            "review": "Enthusiastic and interesting! . This little gem is kept very quiet in Cusco but I'm delighted a friend suggested we go! Family run planetarium, uncle picks you up from plaza regocijo at 5.40pm and brings you up to the planetarium where his niece and nephew talk you through the importance of astronomy to the Incas. The dome simulates the southern hemisphere sky where they point out all the important constellations and then take you outside to look through binoculars and telescopes. Impressive work even on the cloudy night we were there! Well worth a trip. Suitable for all ages."
        }, 
        {
            "index": 86, 
            "rating": "4", 
            "review": "Cloudy night - not much to see. They are really passionate about astronomy and provide lots of information about Inca beliefs in relation to the stars as well as modern theories. Unfortunately it was really cloudy the night that we went which meant once we got outside we couldn't see much at all. However, the indoor stuff was amazing. It gets VERY cold, even indoors, so rug up."
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "Well worth a couple of hours of your time. Learn about the stars with a very nice host in this family run business. For the sake of 50 Soles per person it's well worth the money"
        }, 
        {
            "index": 88, 
            "rating": "5", 
            "review": "Educational, Fun and Friendly!. My travel partner and I really like astronomy, and had never learned about the Southern skies. We called the planetarium from our hotel, and they left a message for us telling us they were open. They picked us up in a tourist van at a nearby square, a guy in a Planetarium Cusco jacket came to find us. They take you up the mountain aboout 15 minutes to a small family place with a \"farm\" type feel. The tour takes about 2 hours, and begins with an introduction to Inca history and mythology. We then got to see a star map and interactive presentation, learning about the night skies and galaxies visible at this time of year. It really set the stage for actually looking through the telescope outside! Jose was fantastic, and the blankets we got were a nice touch! I highly recommend this as an early evening activity-- just be sure to bring warm clothes!"
        }, 
        {
            "index": 89, 
            "rating": "5", 
            "review": "Enjoy Maltesers with your eyes! Yummy Yummy Yummy.... Have you tried Maltesers before? Come here to enjoy it with your eyes. If you join the sunset and moon rise tour, you are able to view not only the sunset scenery with Milky Way and sunset ray but the moon rises. The brightness of the moon is irresistance to taste like the inner layer of Maltesers. I have never viewed and to know that the moon is so so bright under the telescope. Do drop by Colca Canyon and enjoy this marvelous experience that I once have had just a couple of weeks ago."
        }, 
        {
            "index": 90, 
            "rating": "5", 
            "review": "Absolutely wonderful!. We decided it would be worth learning about the constellations so we could understand a little better what we'd be seeing at night on our Machu Picchu trek, and wow, this Planetarium is worth the visit! Ana Maria's enthusiasm is contagious. She was a wonderful teacher, as was her uncle. The Planetarium is a family run business, and their passion for the stars was incredible. Not only did we get to see the constellations projected in their dome, but we also went outside and saw star clusters, the moon and Saturn with its rings, through their telescope. It was an amazing experience!"
        }, 
        {
            "index": 91, 
            "rating": "5", 
            "review": "A great way to learn about the Incas and astronomy. Our family really enjoyed this family run business. My children ranging from infant to 13 years old enjoyed the tour as well. It was interesting to hear about the history of the Incas incorporated in the presentation. The best part was being able to see Saturn and its ring using the telescope. We would highly recommend this experience!"
        }, 
        {
            "index": 92, 
            "rating": "5", 
            "review": "Wonderful -- and accommodating to young children. We loved every moment of it. They were so great. They had blankets and music (although the live music may not happen every night, but I wish it did!). They joked with our toddler and incorporated him into the presentation hen he was getting fidgety. You can tell it's a family run operation by how nice they were. And the information is so great. When we got home, we started looking at the stars in our backyard, practicing what we learned in Cusco. We did a lot in Cusco, but this was by far our favorite thing in town. It's a must!"
        }, 
        {
            "index": 93, 
            "rating": "5", 
            "review": "Amazing! Worth every penny!. A family run business that inspires you! It also gives you the history on why the stars, moon and sun were so important to the Inkas an how we now as a population have lost their importance. You view the stars inside in the dome built room and then then the images with a detailed explanation to why and where they came from. After you move outside to view several stars and images via telescopes. The highlight for me was viewing Saturn! Well worth booking and supporting this family run business."
        }, 
        {
            "index": 94, 
            "rating": "4", 
            "review": "Fun Way to Learn More about Incans and Support Family Business. This is a small, family run operation and they are all very knowledgeable. We learned a lot about how the Incans used astrology for agriculture and many other things. We were also taught about the constellations of the southern hemisphere before going outside to observe them. It was a great activity to do before visiting Machu Picchu!"
        }, 
        {
            "index": 95, 
            "rating": "5", 
            "review": "Don't Miss!. This was excellent. It is shame that there is so much light pollution where the planetarium is located, but don't let that deter you. It is a very neat family, doing what they love and just so passionate about it. Dress warm as the temperature drops at night, the presentation is good fun, and the view over the city driving back is pretty amazing. Don't forget the \"gift-shop\" ...well there isn't one. but it helps support what they do and they have odd little bits for sale like a poster, coffee mug or stickers that my family got a kick out of and so inexpensive compared to all the stuff pushed to you in Cusco during the day. So if they don't offer anything up, ask, as they likely have something and it is for a good cause. I booked the \"tour\" through my accommodation, and it was a little disorganized waiting for the driver...but they found us and we all got to know each other while we waited in a very cute square just off the main square. The chocolate museum was just there, so there was something to help \"pass\" the time. I really enjoyed it."
        }, 
        {
            "index": 96, 
            "rating": "4", 
            "review": "Nice and informative. As an hobby astronomer I found this fun and informative. Got pointed out southern hemisphere only constelations, viewed two double star systems and Saturn. The planetarium session with the Incas dark constellations was nice. It would have been nice if the location to be further from the city though, we could see the milky way but I guess light pollution is ver hard totackle even in Cusco."
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "Amazing experience. This place is amazing, a must do while in Cusco. Inexpensive and the tour is awesome. Definitely recommend it"
        }, 
        {
            "index": 98, 
            "rating": "5", 
            "review": "Must see attraction. I signed up for the planetarium tour and had the best time. We met up in a square located near plaza aramas. We then drove up to Saqsaywaman. I have to admit my expectation was to see a modern day planetarium, so when we drove up to their building I was at first taken aback. However, it was explained to us since they are located in a national park there are a number of regulations that prohibited new buildings to be erected. In any event, it was a good opportunity to keep an open mind. I'm glad that I did. The tour is broken up into three parts. The first part is more lecture oriented. The second part is in the planetarium itself. The third part ties both the first two parts together and how it relates to the Inca civilization. I won't go too much into detail, but I had a great time learning about the stars and how also the Inca viewed celestial spaces. The guy who gave the tour really loved talking about astronomy which made it more enjoyable for me. If you go to do a hike afterwards through the hills, it's really cool to know this stuff before hand. I would not hesitate to recommend this to anyone visiting Cusco. It's fantastic and one of the highlights for me during my time there. I also saw Saturn and its rings!!!!! so amazing!!!"
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "Unbelieve experience!. First, let me just say that I am NOT a planetarium person. My friends and I were looking for attractions near Cusco and decided to go. Turns out, this was one of my favorite experiences during my time in Peru! This planetarium is run by a family and they are SO enthusiastic and passionate about the subject that it rubs off on you. Being on a mountaintop and observing the stars with and without the telescope was unbelievable! I would highly recommend going here--it is worth every penny and you will never forget it."
        }, 
        {
            "index": 100, 
            "rating": "5", 
            "review": "Nice guide and tour. The planetarium is small and they don't have big telescopes like I've seen in the US but the tour was interesting and the guide very nice! Price is reasonable."
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "A warm welcome and really interesting. We had a fantastic evening here. This is a family run business and you can really get a sense of their enthusiasm and willingness to share knowledge about the stars. The staff were really friendly and the presentations were great. We were lucky enough to get some great sights through the telescope before the cloud rolled in - we'll be looking for the little silver llama when we head to the sacred valley next :) Highly recommend this if you're in cusco! We had a little trouble booking through the system on the website, so would recommended emailing or whatsapping them directly."
        }, 
        {
            "index": 102, 
            "rating": "5", 
            "review": "Amazing. An amazing tour! They sit you down and give a talk on the history of the incas and how they used astrology in day to day life. Then you are shown all the star constellations in their dome room. When it's dark outside you have a chance to look at planets and stars through a telescope and also see all the stars. They provide blankets which help keep warm but dress for cuscos night time chilly weather! An amazing tour, well worth the money and they do student discount!"
        }, 
        {
            "index": 103, 
            "rating": "5", 
            "review": "Stellar storytelling and stargazing!. The Planetarium Cusco was a surprise highlight of our trip. It’s a private family operation run by people who are truly passionate about the night sky and Peruvian history/folklore. The uncle/niece guide team used interactive storytelling to teach us about outer space and how the stars influenced the Inca people. A mini theater with a rounded dome displayed a projection of the night sky, where we reviewed the common constellations (some unknown to me in the southern hemisphere) and also learned the stories behind ancient Inca constellations. After the indoor presentation, they equipped us with blankets and hot tea to go outside for live sky viewing with their big telescope. Unfortunately the clouds of the rainy season were not cooperating, but amazingly the knowledgeable professor was able to reveal a bright star in Andromeda and Mars for us before we called it a night. Gandalf the dog was also a treat to meet. Absolutely wonderful. Dress warmly!"
        }, 
        {
            "index": 104, 
            "rating": "5", 
            "review": "Great evening activity. This is a fantastic activity. The information presented on the southern sky is really interesting for those of us who live in the northern hemisphere, especially learning how the Inca viewed the sky. We got to look through a telescope outside afterward at several different constellations. They picked us up in Cusco at a central place we could walk to from our hotel."
        }, 
        {
            "index": 105, 
            "rating": "5", 
            "review": "AMAZING night out. THANKS ANA, you are a STAR ;). This one of our most enjoyable evenings out on tour to South America! Firstly and most importantly Thanks to ANA, she was really funny and most importantly she has a skill of turning a complicated subject like astronomy and making it fun and easy to understand. We viewed the cluster stars, Jupiter, Venus and Pluto all on the telescoped and also sat in a auditorium where Ana showed us the INCA science of astronomy which was really amazing. We learnt alot and had a really good time, Thanks ANA. You are a STAR ;)"
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "The Big Black Llama in the sky. This is such a great hidden secret! Family owned planetarium with loads of pasion and humor. We were picked up just before dark from Regocijo square in the centre and brought to the planetarium just outside of the city. The tour had three stages, a story on the way the Incas used the stars and constellations, a moment to view different planets and stars outside and last but not least, a viewing in the dark dome where they reveal the western and inca constellations. Did you know the inca's had \"dark constellations\" existing out of the space between groups of stars in the milky way? All stages done with such love and dedication! I've been recommending this place to pretty much anyone heading to Cusco."
        }, 
        {
            "index": 107, 
            "rating": "5", 
            "review": "Great show and a good education on the southern sky and on Incan Astrological efforts.. Great show and a good education on the southern sky and on Incan Astrological efforts. This private and family owned planetarium does a great job."
        }, 
        {
            "index": 108, 
            "rating": "5", 
            "review": "A fun place to visit while in Cuzco.. I highly recommend a visit to the Cusco Planetarium early on in your stay. It is an opportunity to really gain an understanding of the stars in the southern hemisphere and how the science of the Inca coordinated to create a unique and highly advanced system for growing food and weather prediction. The opportunity to look through telescopes is an added plus and the planetarium show is packed with fascinating facts. You will enjoy it."
        }, 
        {
            "index": 109, 
            "rating": "5", 
            "review": "No frills, just a passion for the sky and all its wonders!. This is a wonderful place for everyone in your family. The staff (all relatives of the astronomer) are passionate, knowledgeable and speak English very well.Each member of our family (ages 11-58) enjoyed our visit.Very cold at night..bundle up!"
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "Cannot recommend this highly enough!. Amazing experience run by an incredible family who love astronomy! Their casual approach to booking and picking you up at one of the squares in the centre of Cusco continues as they give you the whole tour before asking anyone for any money, it really did feel like their priority was that we enjoyed the experience and learnt all about the stars as the Incas saw them rather than simply a money making enterprise. And the stars are amazing out there!!!!"
        }, 
        {
            "index": 111, 
            "rating": "4", 
            "review": "A fascinating variation to the normal planetarium. A must on any trip to Cusco, gives you another perspective to the archaeological sites. It's an interesting mix with maps of the constellation coupled with Incan astrology"
        }, 
        {
            "index": 112, 
            "rating": "5", 
            "review": "A highlight of our trip. Totally loved our trip to the planetarium. Staff was wonderful..Great knowledge and very friendly. We had a clear night so we got to see many constelations we cant see here in N. America."
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "So simple, so modest, so nice. Family-run planetarium with small financial means by great love for astronomy and passion to share it. We found it by chance through this site and loved it. Very, very cold at night (July) so please, take a few extra jumpers and gloves and woolly hats etc. but definitely worth it. We had totally clear sky, had the good fortune to see Saturn with its rings and Jupiter with 4 of its moons, aligned as the best of military parades.They do a beautiful slide show inside before you go out to see the real stars and planets."
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "The best experience in Cuzco. We spent the most lovely time at this home made planetarium, we learnt so much and the owner and the writer of a great book is the very same scientist that will welcome to his most magnificent creation, the sighting of the abets and the stars with the understanding of the INKA cosmogony is just thrilling. Is a must to go in cuzco"
        }, 
        {
            "index": 115, 
            "rating": "5", 
            "review": "A great look at the Inca sky!. My wife and I went to the planetarium upon a recommendation from our local guide and it did not disappoint. There were three steps to the tour: first a presentation on how the Incas used their knowledge of astronomy to improve their livelihood (especially in reference to agriculture); then a show in an indoor planetarium which exhibited various standard constellations as well as those that the Incas used (be careful not to miss the dark constellations, which are very special as few cultures ever used them!); finally we went out and took a look at some stars and planets. The whole experience was very enjoyable and the staff were great (it is a family business). Beware to dress appropriately as it gets quite chilly towards the end of the tour."
        }, 
        {
            "index": 116, 
            "rating": "5", 
            "review": "A nice way to finish the day!. First of all, BE ON TIME! They aren't kidding when they say they leave promptly. We nearly missed our ride, thanks to a bit of traffic. Despite still being a small facility, their enthusiasm shines through all they do. We had a great time being guided through the southern skies. Dress warmly!"
        }, 
        {
            "index": 117, 
            "rating": "1", 
            "review": "Disappointing. It has been awhile since I visited this and I have never written a negative review, but this was very disappointing.What I thought were a few pictures in the waiting room was one of their main features. Also, there were 8 people attending the very cold night and we had to wait to get a glimpse of the telescope We couldn't wait for the night to end so we get into a warm taxi and get something to warm us up."
        }, 
        {
            "index": 118, 
            "rating": "5", 
            "review": "Great Experience. Loved the staff....Was a little chilly during our visit and they brought out blankets for everyone. Very knowledgeable, entertaining and hospitable. Must see during your stay in Cusco"
        }, 
        {
            "index": 119, 
            "rating": "5", 
            "review": "Nice evening out to see and hear about Inca astrnomy. Joined this tour to see the stars from the Southern Hemisphere. It was very interesting, they had Spanish and English guides to explain abut the Incan astronomy and also show us some of the constellations like the zodiac animals. Unfortunately the sky was a bit cloudy but we did see some stars."
        }, 
        {
            "index": 120, 
            "rating": "5", 
            "review": "Pretty Impressive!!!. I have to say, this experience was pretty fun. I have always loved astronomy and star gazing, so this was a must for me. This family run planetarium was pretty impressive and very informative. My 7 year old really enjoyed it!!!"
        }, 
        {
            "index": 121, 
            "rating": "5", 
            "review": "Lesser known attraction in Cuzco. The planetarium was a great value couple of hours and worth searching out. It is family run and they are very enthusiastic about astronomy and sharing this with the visitors. The pick up is not at the main plaza and is a little hard to find but they seem to work it out."
        }, 
        {
            "index": 122, 
            "rating": "5", 
            "review": "Intimate Yet Professional Planetarium. We reserved a few spots with this site for a last-evening-in-Cusco experience. We were delighted by the family, the planetarium dome, Gandalf, Jose, and the star gazing with his uncle. Every effort is made to make guests comfortable. What we learned added to our knowledge gleaned from various visits to the archaeological sites. Despite shifting clouds, we were able to see Saturn's rings, Jupiter's moons, Venus, numerous star clusters, the southern cross, and more. It was a fun and intimate setting and well worth both the fee and the time."
        }, 
        {
            "index": 123, 
            "rating": "4", 
            "review": "run by a family that loves their work. loved the personal touch. We were in a large group but they made sure that we all had opportunities to use each telescope and ask any questions. It's a small planetarium but a lovely excursion."
        }, 
        {
            "index": 124, 
            "rating": "5", 
            "review": "Great experience. Great family business. Learnt a lot about the southern hemisphere and the inka history. Everybody was enthusiastic and really liked to teach us something. Even got a pickup from the city"
        }, 
        {
            "index": 125, 
            "rating": "5", 
            "review": "Magical evening. We had a fantastic time - even though it was a cloudy night. The family are wonderfully accommodating and really informative."
        }, 
        {
            "index": 126, 
            "rating": "5", 
            "review": "Erwin and family are important archeoastronomer outreachers. Totally recommend it.. I have so many things to say about this planetarium, that I don't know where to start...Let me begin saying that I am a professional astronomer and I totally recommend the visit if you, too, can value the work of a man and a family that have no support at all from the government to pursue their research and promote science education and outreach. If you are expecting a full dome digital planetarium theatre, then just don't go. Save your planetarium visit to some other place in the USA or Europe. Cuzco planetarium is a family business run by passionated local amateurs astronomers trying their best to spread their Inca cosmovision knowledge. As a professional astronomer, and an astronomer curious on the field of cultural astronomy (ethnoastronomy, archeoastronomy, etc.) I have no words to express my gratitude to have visited Cuzco Planetarium and the opportunity given to learn with Erwin about his findings on Inca astronomy. If you are going with kids (5-10yrs), believe me, they will totally love it.If you are passionated by astronomy or amazed by how the Incas used astronomy on their daily life, you will also loved it.If you are more interested in a cinema-like planetarium, then skip the visit."
        }, 
        {
            "index": 127, 
            "rating": "4", 
            "review": "Learn about Inka's science. Nice, funny presentation about the Inka's science, how they observed the stars and the seasons through structures.They predict what and when to plant, that made them so strong.After this, we have presentation of the southern star maps, and went out to see them in real.50S pick up / drop off is very nice price for this."
        }, 
        {
            "index": 128, 
            "rating": "5", 
            "review": "Best weeknight activity in Cusco . We heard about the Planetarium on a whim and decided to try it out on a free night in Cusco. We were incredibly impressed with the experience and the amount that we learned about Incan history. Would recommend to anyone."
        }, 
        {
            "index": 129, 
            "rating": "5", 
            "review": "Very Accommodating. Ana Maria and her family were extremely accommodating, providing myself and several study abroad students with a wonderful experience on a Sunday evening (when they are typically closed). Everyone was extremely friendly and knowledgeable. If you are looking to do something that is outside the typical \"tourist\" activities, make sure to include this experience during your stay. Highly recommended!"
        }, 
        {
            "index": 130, 
            "rating": "5", 
            "review": "Passion Generations Long. This little planetarium is well put together and driven by the passion of an entire family. A self made dome, a presentation hall and a series of telescopes to see the sky for yourself. If you're into space, or this is your first time in the southern hemisphere, go here. NOTE: You have to make a reservation, something that I missed on their website. Regardless, they were accommodating."
        }, 
        {
            "index": 131, 
            "rating": "5", 
            "review": "Great Family Business. I went here because I wanted to learn more about constellations in the Southern Hemisphere. When the evening started I was worried that the planetarium was not going to impress me but it really did. This family-run business is small, but they have impressive telescopes and a star dome. Before the clouds rolled in we were able to see the binary stars at the bottom of the Southern Cross as well as Saturn (its rings!) and Titan. Inside we learned about how Portuguese sailors named the southern constellations. Most interesting to me was the stories about the Inca constellations- especially the black llama! I thought it was a great evening in Cusco and I would recommend going- especially if you have an interest in the stars."
        }, 
        {
            "index": 132, 
            "rating": "5", 
            "review": "Simply Amazing!. We loved every minute of our trip to the planetarium! We had a clear night and so were able to see tons of stars through the telescope. The presentations inside the planetarium were so informative and fun! Thank you so much for a magical night under the stars of the Southern Sky!"
        }, 
        {
            "index": 133, 
            "rating": "5", 
            "review": "Amazing what this family-run Planetarium can do. We were so impressed by this little family-run Planetarium and how much knowledge and passion they have.This was easy to book. If you call on the phone or email, service is prompt and English is good.Pick up and drop off to/from the Planetarium appreciated.The brief lecture in the beginning was inspiring.Very impressed with the quality of the telescope used for Star-gazing. And the time in the dome with the story and information we received equally impressive.If you're at all curious about learning more about Incan history, astronomy, and the universe, this is a go-see attraction while you're in Cusco."
        }, 
        {
            "index": 134, 
            "rating": "5", 
            "review": "Stellar Experience :). Planetarium Cusco completely exceeded my expectations! My parents and I (I'm 17) visited in early June, and we had a beautifully clear night, which I understand is pretty common this time of year. The planetarium is family-run and it feels like it- we were welcomed by three family members bearing warm blankets, and Gandalf the dog. There are three parts to the experience- a lecture on the history of Incan astronomy, stargazing outside (using a telescope, we saw the Jewelry Box Cluster, a globular cluster, Venus, and Jupiter and its four Galilean moons), and a tour of the zodiac and southern constellations in the dome. The family members were welcoming, funny, and well-informed. I would definitely recommend this experience!"
        }, 
        {
            "index": 135, 
            "rating": "5", 
            "review": "Amazing!. This was such a fabulous way to spend an evening! We have a teenage budding astronomer and she and my husband and I found the entire evening fun, informational and inspiring! We had a very clear night and so in addition to the introductory presentation and the presentation in the planetarium, we were able to go outside and see the Jewelry Box Cluster, a globular cluster, Venus (which we could also see with the naked eye), and Jupiter and its 4 biggest moons - all through an impressive telescope. It was also fun to see the Southern Cross and all the new constellations in the Southern Sky. We would DEFINITELY recommend this activity!"
        }, 
        {
            "index": 136, 
            "rating": "5", 
            "review": "Awesome Evening, Super Informative, Lots of Fun!. I read about the Planetarium Cusco in my travel guide, and when I saw the picture of the Inca astronomy at Qorikancha, I knew we needed to go to the planetarium! You do need to make a reservation, though they were able to squeeze in one extra person. We made our reservations just a few hours in advance, and it was totally seamless. They picked us up in the square across from our hotel, with the rest of the group and drove us up to the planetarium, which is near Sacsayhuaman, overlooking the city. The building itself is small but cozy, which was wonderful on a chilly night. We started with a brief history lesson about the Inca civilization and how important astronomy was to them. The woman who was presenting was fantastic, super informative and approachable. After the history lesson, we went outside and used two telescopes to look at Jupiter, the moon, and several beautiful stars and constellations. The night sky was incredible, and the staff did a great job pointing out the main constellations and giving us plenty of time to enjoy them. They even brought us hot tea!Then, we went back inside and had the chance to experience their lovely planetarium, with Western constellations, and then the beautiful Inca constellations. All-in-all, a memorable evening with lovely hosts. I would definitely recommend this to anyone before hiking in the area. The best part was being out on the trail and looking up and identifying so many of the constellations. Absolutely breathtaking. It's easy to see why the Incas were so involved with the stars. A must-visit while you're in Cusco!"
        }, 
        {
            "index": 137, 
            "rating": "5", 
            "review": "Wonderful tour of the night sky. We didn't have a chance to make a reservation, but they made room for us anyway. Funny and friendly staff picked us up and showed us the wonders of the southern hemisphere. They spoke excellent English and showed us a half dozen things in their telescope, explained many significant Incan astronomical phenomena and then invited us to the planetarium to explore some artificial constellations.This was such a fun and unique experience for us. Really great!"
        }, 
        {
            "index": 138, 
            "rating": "1", 
            "review": "Stood us up :(. I arranged a tour with Planetarium Cusco three months in advance. They requested that we switch out date so we did, and agreed to meet at the regocijo square at 6:40 pm.We waited for thirty minutes and even had a nearby store call them for us but there was no answer.Very disappointed in their lack of professionalism and communication."
        }, 
        {
            "index": 139, 
            "rating": "5", 
            "review": "Great family run operation. We had a fun time at the planetarium despite it being cloudy and not a very good night for stargazing. Very well organized transportation and presentation. We learned about modern astrology as well as the astrological beliefs of the Incas. Very interesting material and it was cool to see the virtual dome projection of the southern sky."
        }, 
        {
            "index": 140, 
            "rating": "5", 
            "review": "Fun, family run evening's stargazing. A great and fun way to spend the evening.It is also a great way to familiarise yourself with the stars and constellations in the Southern hemisphere, prior to a trip on the Inca Trail or other areas of low light pollution.The presentation gives you the opportunity to see the stars projected onto the dome of the planetarium and then to physically go out and see them through the telescope.The family are very friendly and present everything with a sense of humour and fun. They are also very accommodating and and give you blankets to keep you warm on the colder evenings.Trips can be booked in advance and they will pick you up from the square."
        }, 
        {
            "index": 141, 
            "rating": "4", 
            "review": "Has to be alright on the night. Good meeting and presentation given in three stages. I was unfortunate that it was a cloudy night but learnt a lot about El nino and the dark constellations. Quite a treat really, but a bit steeply priced. I would advise to do this before trek to get the most value from the information given."
        }, 
        {
            "index": 142, 
            "rating": "5", 
            "review": "A Must Do!. In anticipation of our camping towards Machu Picchu, I booked a visit to the Planetarium for my husband and I. We are Northern Hemisphere folks so I was looking forward to seeing the Southern sky. We were picked up from a central location in Cusco and driven up to the Planetarium (appropriately situated away from lots of light pollution) and met by some friendly dogs. It was, obviously, very dark and it's an uneven hill down to the building so be warned. The family who runs the planetarium are delightful folks. Uncle Erwin is the man behind the telecopes and was a sweet man. He queued up some telescopes outside on real stuff and whenever I leaned over the eyepiece he'd say something like, \"Take your time, really enjoy it.\" You can tell he's a space buff and wanted to share that love with others. His niece was the one who lead our little group through the indoor planetarium section. She was also a lovely woman. Sure, we saw some cool planets (we also had patchy clouds that night) but it was the people that really made the visit. This family is doing something they love and their enthusiasm comes across to visitors. And now I get to look for the Black Llama in the milky way!"
        }, 
        {
            "index": 143, 
            "rating": "5", 
            "review": "Great experiance!. Even with their private budget, family run Cusco Planetarium is a treat for stargazers. They know so much, and show so much personal interest and enthusiasm! It was hard to leave!Very good organisation with the transport from the centre and back.Thank you for you excellent work! Great people who love what they do, and is happy for sharing, is worth much more than any government grant =)I could recommend this also for families with children from maybe age 10 and upwards, the stars in the sky is fascinating for any age."
        }, 
        {
            "index": 144, 
            "rating": "5", 
            "review": "Amazing.... Having researched this Planetarium, before our visit...we were fortunate to enjoy and appreciate the 'clear sky'...the presentation by Professor Cavazos and his Niece...was truly, an amazing experience. Discovered so much more about constellations below the Equator..."
        }, 
        {
            "index": 145, 
            "rating": "5", 
            "review": "What a night.. Fantastic evening, picked up in Cusco. Excellent knowledge of both hemispheres, inca and modern astronomy. Made to feelVery welcome in a very homely observatory."
        }, 
        {
            "index": 146, 
            "rating": "5", 
            "review": "Great experience!. Coming from North Europe i am used to different view of the stars. Everything gets explained. Staff is extremely passionate and helpful!"
        }, 
        {
            "index": 147, 
            "rating": "5", 
            "review": "great place!!. the professor erwin has great knowledge , is fun and i got really good information , also i went with a group of friends and the sky was very clear , was a great experience i got to see saturn !! was so exciting."
        }, 
        {
            "index": 148, 
            "rating": "5", 
            "review": "A MUST in Cusco! . An excellent family owned initiative located 12 minutes away of Plaza de Armas. The whole experience takes between 2 to 3 hours. Try going before visiting Machu Picchu or the Sacred Valley, since there is plenty of helpful information that would add to the experience and knowledge of Inca history. Totally recommend it!!"
        }, 
        {
            "index": 149, 
            "rating": "5", 
            "review": "Very Interesting!. It's a great thing to do before you do the Inca trail, the staff were super friendly and created a really nice atmosphere, you can feel their passion for the night sky. Reasonably priced and worthwhile to support this family business."
        }, 
        {
            "index": 150, 
            "rating": "5", 
            "review": "Don't miss this!. If you come to Cuzco, you will visit all the traditional touristic site, but I highly recommend non to miss the visit to the Planetarium! It's a great experience and a very interesting way to understand the Incan astronomy and cosmogony and you'll learn how the incan sites were strictly connected and aligned with stars. Inca had an amazing astronomic knowledge and their lives were related with sky, earth and nature. Discover all about this great ancient culture at the Planetarium!"
        }, 
        {
            "index": 151, 
            "rating": "5", 
            "review": "Hidden gem. One of the highlights of my trip to Peru - a real hidden gem. We learnt things about the Incas that countless other tours didn't tell us about. A wonderful, peaceful and charming night. Great family business doing something brilliant with passion and knowledge."
        }, 
        {
            "index": 152, 
            "rating": "5", 
            "review": "one of the best things. takes you out of the city for an amazingly informative view of the night sky, you feel like you're in the country, and the guides were young, well informed, and seemed genuinely interested, which made it great for us too."
        }, 
        {
            "index": 153, 
            "rating": "5", 
            "review": "Space, Stars, and a little bit of history. Wasn't sure what to expect, but this family run planetarium really knocked it out of the park and were even able to do it with their rustic setup. You don't need anything fancy to talk about the stars and the influence that it had on the culture in Peru. They go into a lot of the details of how the constellations were named and the stories behind them. After the presentation we went outside and used their telescope to see the stars, planets and even a galaxy (blew my mind!). We also got lucky since there were only 3 of us, so it was a bit more personal and we could ask questions, etc.Great little side trip if you have time..worth it.Thank you!"
        }, 
        {
            "index": 154, 
            "rating": "4", 
            "review": "A planetarium in the city!. Who knew this existed? Apparently a lot more people than I would have thought. This attraction is actually listed in the Lonely Planet book although the price has increased since then (50 soles).Well worth a visit if you are into space, even if you are not it is pretty cool! They talk about the history behind the sky both from a modern perspective and from the Incan point of view.After some talks, they bring you to the planetarium portion of the building which is a rounded dome where they project the sky with the constellations and talk about how there is a different set depending on the hemisphere that you are in.Then they take you outside and show you a few stars (clusters, double stars, and even stars you cannot see without a telescope). We also got to see Saturn which was pretty cool.The experience is very enjoy and will last roughly 1.5 hours. If you have some time in the evening, this is a very neat attraction."
        }, 
        {
            "index": 155, 
            "rating": "5", 
            "review": "So worth the visit. Thank you for such an informative and wonderful presentation. The stories alone were worth it, but to connect the inca with modern astronomy was sweet. The presentation was stellar and we just loved it. It was uber cool to see the southern stars which we normally don't get to see! Best..."
        }, 
        {
            "index": 156, 
            "rating": "5", 
            "review": "Amazing!. The guys who ran it were very interesting and passionate, there was the right amount of information and looking at the night sky with the telescope was fascinating! A must do in Cusco if you have any interest in the stars and the Incan´s relationship with them."
        }, 
        {
            "index": 157, 
            "rating": "5", 
            "review": "Amazing storytellers. This is a small, humble, family run business in which an uncle and nephew lead presentations that detail how the incan people interacted with the night sky. Presentations are offered in both Spanish and English. Both presenters are extremely inspiring in the way they speak due to the passion they have in the subject matter."
        }, 
        {
            "index": 158, 
            "rating": "5", 
            "review": "Awesome night sky!!!. It felt like the sky was so close at the Cusco Planetarium making this well worth the price and something I definitely recommend while in Cusco. We met Ana Marie at the Plaza Regocijo and were taken by the planetarium's van to their site. Be sure to dress warm as you are outside part of the time. We were greeted with Coca tea and given blankets but it was a bit cool on the September evening we were there. We started with a brief lecture explaining the constellations and what the night sky meant to the Incas. Once the lecture was complete, we went outside to where we were able to observe stars and planets through their telescope. Afterwards we went back inside for a virtual guide of the stars in their planetarium room. I had never seen the southern cross before, but was always able to locate it on clear nights during the rest of my trip in Peru."
        }, 
        {
            "index": 159, 
            "rating": "5", 
            "review": "Under the Stars!. Our tour to the Cusco Planetarium started with being picked up from one of the squares. After a short 10 minute ride we arrived and were greeted warmly. Our guide was very informative and passionate. You could feel her energy and enthusiasm during the presentation. Afterwards we stepped outside (dress in warm clothes as it gets pretty cold) and were given hot tea and blankets. We observed various stars, clusters and planets through the telescope. It was well worth the price and would definitely recommend it."
        }, 
        {
            "index": 160, 
            "rating": "5", 
            "review": "Very Educational!. At 12,500 ft the evening sky is almost touchable making the Cusco Planetarium is a must visit. The cost is 50 soles per person or 30 soles for students (~$18US). Your experience starts are Plaza Regocijo which is the very next square from Plaza de las Armas and where you are picked up by the planetarium's van. They are very punctual. When you arrive, you are greeted with Coca tea and their doggy. Depending on the sky that evening, you are given a brief lecture explaining the constellations and what it meant to the Incas. Once the lecture is complete, you either go to the telescopes, or enter the planetarium room for a virtual guide. Unfortunately for us, we were in Cusco very briefly and the night we picked to go turned out to be overcast. The staff is very nice, and if weather conditions don't allow for a telescope view, they grant you another visit, free of charge, so you can come on a clear day. Our stay did not permit for another day, but it was nice to know we had this option."
        }, 
        {
            "index": 161, 
            "rating": "5", 
            "review": "A must while in Cusco. I have never been into a Planetarium, I made a reservation by mail, they answered promptly. They recommended dress warmly, so I didWe were 22 people and everybody thought it was one of the highlights while in Cusco CityProfessor Salazar is an amazing person, full of knowledge of the stars and a very funny and friendly person. Ana Maria makes a perfect match to her uncleDo go, you will be happy that you did it."
        }, 
        {
            "index": 162, 
            "rating": "5", 
            "review": "So great! . I really enjoyed my experience at the Cusco Planetarium. Highlight was seeing Saturn through the telescope. This is the real deal! Bring plenty of layers if coming in the cold month of August. They provided hot tea when we were outside. This organization is privately funded. Support them and help keep this organization going. Pick up was about 6pm and drop off around 8pm. Side note: my Lonely Planet guide quoted $30 soles but I was charged $50 soles. Not a huge deal but bring extra cash in case."
        }, 
        {
            "index": 163, 
            "rating": "5", 
            "review": "Under the stars. A great evening with very enthusiastic and funny people, who share a lot of interesting informations about the stars."
        }, 
        {
            "index": 164, 
            "rating": "5", 
            "review": "a must see. this is a must see, these people are so nice and the whole thing is just really a great evening, you gt use telescopes, have the incan cosmology explained, real nice people!"
        }, 
        {
            "index": 165, 
            "rating": "3", 
            "review": "Fun thing to do in Cusco. We visited Cusco and went to the planetarium show one evening. They pick you up with a group of 10-15 people and drive you up the mountain. This is not a real planetarium like you think of in the States, it is a family business and their building is a little log cabin. They tell you a bit about Incan history and why astronomy was important. They also have a domed room and project the stars on the ceiling and show you the shapes of the constellations and their meanings. Then you go outside and they have a big telescope, maybe 4 ft. long and show you maybe four stars and everyone takes a turn looking at them. The cool thing was some of these stars you can't see from the Northern Hemisphere. The staff was very nice and offered everyone fleece blankets. It was very cold! Highly recommend bring a ski jacket or a winter coat of some sort. This was a fun thing to do, but not mind blowing. I think some of the other reviews exaggerate a bit."
        }, 
        {
            "index": 166, 
            "rating": "5", 
            "review": "Excellent experience. Enthusiatic staff. And an Awesome dog called Gandalf.. A short but excellent 1.5 hour experience hosted by the kind and enthusiatic staff at the Cusco Planetarium who were keen to share their passion for and knowledge of the sky. The tour began with a presentation on how the Incans understood the sky followed by a walkthrough of the various constellations. Afterwards, the Director of the Planetarium showed us what the Moon, Saturn, etc. look like through a telescope. The Planetarium also has a super friendly resident dog called Gandalf and several lammas.Tickets were 50 s./each."
        }, 
        {
            "index": 167, 
            "rating": "5", 
            "review": "Brilliant friendly place. Great evening. The family run planetarium is very interesting and they are clearly very passionate about what they do. It does get very cold. They have blankets but wrap up warm before you go."
        }, 
        {
            "index": 168, 
            "rating": "4", 
            "review": "Loads of spirit!. I loved our visit to the planetarium! It is run by a family who are SO SPIRITED and excited to share their knowledge - fun and hilarious! Learnt a lot, but didn't feel like you were in a lecture theatre. The tour picked us up in the Plaza, on time. Had a quick bus trip up to the planetarium and then started the tour which was three parts. Part 1 - star maps and story telling in the domePart 2 - outside, looking through telescopesPart 3 - back inside for more storiesIt was freezing when we went but they bundle you up with nice fleecy blankets.BONUS: they have a lovely flea less labrador called Gandolf. Worth the visit - good for older kids too."
        }, 
        {
            "index": 169, 
            "rating": "3", 
            "review": "Cusco Planetarium. The panetarium was unique. I didnt enjoy the experience but that doesnt mean you wont. If you ar interested in stars and whatnot then its great for you. Otherwise you might find yourself literally falling asleep like I did. The staff (family owned and operated) was extremely nice and very knowledgeable as far as I could tell. If your a student you get a 20 soles discount. Overall I didnt have the best time but definetely worth a try if you think you might be interested in it."
        }, 
        {
            "index": 170, 
            "rating": "5", 
            "review": "Beautiful little spot outside cusco. I highly recommend going to the planetarium. The guide was great and it was wonderful to learn about how the Incans interpreted the stars. Dress warm!"
        }, 
        {
            "index": 171, 
            "rating": "5", 
            "review": "A Little Bit of the Heavens. Really loved the amount of information received from our very enthusiastic host. Amazing what a telescope will reveal that the naked eye can not see. Loved seeing the Southern Hemisphere sky."
        }, 
        {
            "index": 172, 
            "rating": "5", 
            "review": "See the Inca's stars, understand their reality. If the Incan buildings and beliefs seem impenetrable in their mysteries, this experience will help you make sense of their perspective. It really helped me."
        }, 
        {
            "index": 173, 
            "rating": "5", 
            "review": "An awesome celestial experience. Viewing the southern sky for the first time, high in the Andes, is unforgettable. The constellations were brilliant and we looked at Jupiter's rings and moons through a telescope. Maria is really enthusiastic and entertaining, and her planetarium show indoors included the Inca constellations (llamas, naturally). Wrap up warm!"
        }, 
        {
            "index": 174, 
            "rating": "5", 
            "review": "Great night. I definitely recommend doing this. It's very cheap and really interesting, especially if you are remotely interested in astronomy. The two hours were spent learning about the night sky and stars, the Inka's interpretation of the stars and stargazing outside with a hot cup of tea. Ana and her uncle are lovely people. We got ripped of for 40 soles at the travel agency where we booked the trip, and Ana promised if we didn't get the money back, she would personally go down there and get them back for us. Definitely do this, it is a different experience from what you usually would do on your travels."
        }, 
        {
            "index": 175, 
            "rating": "5", 
            "review": "Fascinating experience!. Ana and her uncle present for just under two hours with an impressive combination of knowledge, enthusiasm and wit. I emailed the planetarium in the early afternoon and received a prompt response confirming availability for the evening. The presentation is given in English and Spanish. It begins with a projection of the cusco sky at night onto a domed ceiling with Ana and her uncle showing all of the visible constellations. The presentation then turns to the Incan constellations and the importance of astronomy to the Incan people. The tour concludes outside viewing constellations and planets through their telescope (blankets and mint tea supplied)."
        }, 
        {
            "index": 176, 
            "rating": "5", 
            "review": "Enthusiastic/Great Background on Incas and the Milky Way. This was the first 'tour' of our adventure in Peru and it was a perfect choice. Ana Marie provided great background and information on the Incas and how they used the stars for agriculture. It gave a great foundation for the rest of our trip and the amazing places we would see. When we arrived the night was cloudy and we thought we were only going to be able hear the lecture and see the planetarium but like clockwork the clouds parted and we were able to look thru the telescope. We saw Jupiter with it's dark bands and 3 huge moons, Mars, the Souther Cross, double starts and even other galaxies. We even saw 2 shooting starts. This was a wonderful experience. We loved it!!! Don't miss it."
        }, 
        {
            "index": 177, 
            "rating": "5", 
            "review": "Interesting explanation of Incan astrology...... Thoroughly enjoyed my visit to the cusco planetarium. The pick up service was prompt and efficient. Ana Maria had me enthralled with her passionate explanation of the Incas and their association of the stars with their agricultural practices. The dome was beautiful. Unfortunately it was cloudy when it was time to view the stars however the planets aligned (so to speak) and the sky cleared. The professor showed us Jupiter, Mars, clusters and galaxies. His enthusiasm was infective. Blankets and warm tea were a lovely touch. A great experience which I highly recommend."
        }, 
        {
            "index": 178, 
            "rating": "1", 
            "review": "HORRIBLE SERVICE. My sister and I made a reservation with the planetarium. We waited at the meeting point for forty minutes after the meeting time (and we were there 20 minutes early) before returning to our hotel. When we returned to the hotel we phoned to determine why the planetarium employee did not show up. She said she was there. The planetarium employee did not announce herself or move around the small square to see if we were waiting for her despite our reservation. We had planned our day around the outing and wasted a significant amount of time. Don't waste yours."
        }, 
        {
            "index": 179, 
            "rating": "5", 
            "review": "Amazing. This was one of the best things I have done in Peru! Intimate group, and the most enthusiastic guides! Learned so many interesting things, was fascinating to learn about how other cultures used and interpreted the stars. Great value. My only advice: wear LOTS of clothes, it was freezing!"
        }, 
        {
            "index": 180, 
            "rating": "5", 
            "review": "I would give this more than 5 stars if I could. Picked up in town. This was one of the best experiences of my two weeks in Peru and I am not an astronomer. The enthusiasm of the owners was wonderful. I saw Jupiter through their telescope. It was cold. A starry night which made it good but cold. They provided blankets"
        }, 
        {
            "index": 181, 
            "rating": "5", 
            "review": "Spectacular Night. We thoroughly enjoyed our night under the stars. Blankets and hot tea warmed us from the inside out and the information and star gazing were out of this world! A must do whilst in Cusco!"
        }, 
        {
            "index": 182, 
            "rating": "5", 
            "review": "Charming & informative. Ana Maria is delightful! We arranged to visit the Planetarium via email with her. It's not in Cusco, but about 10 minutes outside. Conveniently, they pick you up in one of the town squares for your evening visit. Out at their cosy farmhouse/observatory, Ana Maria explained the Incan views of astronomy and the heavens, and how it influenced agriculture. Then we went into the dome (!) for more information and an introduction to the constellations of the Southern Hemisphere. Outside, we observed Jupiter and its moons through the telescope, and enjoyed visiting with their dear dog Gandalf. Plus blankets and tea! All these facts were incredibly fun and helpful when seeing ruins and stars along the Inca Trail. Highly recommended!"
        }, 
        {
            "index": 183, 
            "rating": "5", 
            "review": "Cusco skies explained beautifully. I loved this delightful planetarium tour! Astronomy has played a big role in Peru and we were informed very entertainingly and visually about the constellations and history at this lovely planetarium!"
        }, 
        {
            "index": 184, 
            "rating": "5", 
            "review": "So much information about incas and the southern sky. This was definitely one of the most interesting places i've been. The people are extremely enthusiastic about the stars, they are proud on the incaculture and will tell you all about it. I've learned more here than in any other museum in Cusco. It was also a really nice opportunity to see the stars and planets and the moon through a telescope, I don't know much about astronomy so everything was new to me and awesome to see Jupiter so close."
        }, 
        {
            "index": 185, 
            "rating": "4", 
            "review": "Enthusiasm makes up for low tech. The astronomer who runs this family business clearly loves his work and his enthusiasm for astronomy is infectious. They opened up the small but totally adequate planetarium for our family, showed us the constellations and night sky over Cusco, gave us information about Incan constellations, and then we went outside to look through a telescope at planets, nebulas, and stars. It was fun for our family of four (kids 12 and 14). Dress for the outdoors!"
        }, 
        {
            "index": 186, 
            "rating": "5", 
            "review": "Down to earth. Very enthusiast and knowledgable staff! the professor really shared his passion. Witty family owned planetarium. A modest operation add to the charm of the place they will pick you up and bring you back to a well known plaza in the center of town. blankets and tea offered to cozy up in the (potential) cold of cusquenian nights. Loved it!"
        }, 
        {
            "index": 187, 
            "rating": "5", 
            "review": "I don't even like astronomy and the lesson was fascinating/a fun trip for my kids. This was one of the highlights of our time in Cuzco. We had a great time together as a family and overall both kids enjoyed themselves tremendously (ten-year old was fidgety during the initial part that was lecture-based). We each got a little blanket with stars on it to help keep us warm, we saw Jupiter through the telescope (they made sure to rush us out when the sky was clear to ensure we saw Jupiter before the cloud cover might have prevented it). The instructors obviously knew a lot and were friendly, with one providing English translation since the majority of the group we were with spoke Spanish. They provided round-trip comfortable transportation from the Plaza de Armas. I think serving hot chocolate would be a plus for kids, as neither drank the tea. Dress warmly. It's a lot of fun and a great experience in a beautiful location just outside the city."
        }, 
        {
            "index": 188, 
            "rating": "5", 
            "review": "Great pre-machu picchu activity. My friend and I learned so much about Machu Picchu and andean culture during this cozy class. We liked the dome, blankets and tea too. My only suggestion is to light up the stairs with a flashlight. It's cheap, effective and prevents falls."
        }, 
        {
            "index": 189, 
            "rating": "3", 
            "review": "Interesting facts, enthusiastic host, not cheap so it's your luck if it rains.... We decided to visit the planetarium based on the great reviews on Tripadvisor although this place was not listed in Lonely Planet's SA on a shoestring. It turned out that this was not the wisest financial decision as the cost of 50 soles/ pax was a tad too expensive, given that we didn't get any actual viewing of the stars due to the rain. The 1hr+ presentation was rather interesting with a good introduction to Incan astronomical beliefs, plus Ana Maria is a very knowledgeable, friendly and engaging host. While the weather is beyond's anyone's control, we felt that the planetarium could have reduced the entrance price of 50 soles by at least 10-15 soles as a matter of goodwill when it rains. I also think if the group is big (10-20), the price should also reflect the time one gets at the telescope."
        }, 
        {
            "index": 190, 
            "rating": "5", 
            "review": "Peruvian Stars. My wife and I were in Cusco last April. Very last minute we decided to visit the planetarium. They were flexible with their hours and stayed open late for us. A driver met us and we drove up the beautiful hillside to a quaint planetarium where we were greeted by Ana Maria, our host. Ana Maria had a vast knowledge on the Peruvian sky and it's influence on the ancient and modern cultures. We saw star formations through a telescope and sat under the cold stars with blankets while drinking hot Munya tea. Sitting on the Cusco hillside we had great discussions on the Inca, their agriculture, and it's influence from the stars. This was a very intimate and unforgettable experience."
        }, 
        {
            "index": 191, 
            "rating": "3", 
            "review": "Ok but could be better. The Cusco Planetarium have friendly and enthusiastic staff but the program could be better. I think the cost (50 Soles) is a bit high for the 1 1/2 hour presentation but the pick up and drop off was nice. The program included quite a bit of time in their dome on constellations but when we went out side they didn't point out any of the constellations they discussed inside. We only spent about 10-15 minutes outside actually looking at the stars. The lighting from the neighbours made seeing things difficult.I am interested in astronomy and found the program mildly interesting but I have no idea how it could be rated as the 8th best attraction in Cusco."
        }, 
        {
            "index": 192, 
            "rating": "5", 
            "review": "A great experience in Cusco!. The Planetarium is definitely a place to visit during your stay in Cusco. It is run by Ana Maria and her family, including their cute dog, and they really do their best in order to give the visitors all their knowledge as well as their sincere passion. For this reason they did organise the visit even we were a group of three people, while they usually organise visits for at least six people. All the explanations are comprehensible even for those who are astronomic illiterate and they make you discover a new world! Since the Planetarium is quite far from the center, they pick you up in town and they drive you till the Planetarium."
        }, 
        {
            "index": 193, 
            "rating": "4", 
            "review": "Enjoyable different experience. I found this to be a nice experience. The fact that this planetarium is so different from what you expect makes it very special. Located in a small rustic cottage by the hills where they give you a presentation and teach you about the starts and constellations projected on a dome. Then, you go outside (gets cold but they provide warm blankets) where you can look at the beautiful open sky and see the moon, stars, and galaxies using their professional telescopes.The organizers' passion about their ancestors and astronomy quickly immerses you into it. If you have the time, this is an experience to remember."
        }, 
        {
            "index": 194, 
            "rating": "5", 
            "review": "Fun experience!. I really enjoyed my time learning about the Southern hemisphere's night sky. They will pick you up in the small plaza beside plaza de armas and take you to their facilities just up on the hillside.There are three aspects of this experience:1) First thing you do is learn some interesting facts about astronomy and agriculture and the Incas,2) Next is find out how to navigate through the night sky and some fun things to look out for and also how the south compares to the north sky.3) You'll get a chance to look through their telescopes at clusters, the moon (which is actually super cool!), venus, and other things that may be up there depending on the weather conditions. Although it's not a government operated planetarium (so don't expect some super advanced equipment), the organizers (who are super fun and enthusiastic as noted by other reviewers) definitely make up for it and you still get to see amazing sights!It's a very fun alternative to going to a bar; I only wish that I had been able to go when I first arrived rather than at the end of my trip.Tip:- If there is something you want to see in particular, let them know and they will try to find it for you in the telescopes.- It can get cold, so bring your warm clothes! They give you hot tea when you're outside using the telescopes.- Their communication is very good; just send them an email with any questions!- They pick you up around 5:30PM and drop you back in the plaza about 2 hours laterIts not super cheap (s/50, s/30 for students/children), but if you budget for it, it's an enjoyable excursion you should try!"
        }, 
        {
            "index": 195, 
            "rating": "5", 
            "review": "Best memory of Peru. I'm going to begin by saying you HAVE to do this.The enthusiasm of the lady was incredible for starters, she has so much passion about the stars its highly addictive.Before you look through the telescope, the Northern and Southern Hemisphere constellations are explained. This is then followed by what the incas believed and gazed at.When we went outside to look through the telescope I saw the Milky Way, the moon, Venus and a double star. Unbelievable value for money. Easily the best thing I have done in Peru, if not South America."
        }, 
        {
            "index": 196, 
            "rating": "4", 
            "review": "An evening under the stars. The enthusiasm these people have about stars (and dark spaces between stars) is absolutely contagious. They put such an effort into showing you the splendors of the night and explain how important star gazing was for agriculture and the success of the Incas. Seeing the moon through their telescopes is breathtaking. One thing that would be nice would be to have a brochure of some of the highlights/where to look for things as it all happens so fast and I have since tried in vain to remember the different things they told us about specific stars.There has been some confusion about the price. The price was 50 soles per person (as of September).I would definitely recommend this unique experience."
        }, 
        {
            "index": 197, 
            "rating": "5", 
            "review": "Really excellent. We went based on the prior reviews and were not disappointed. This is a lovely family-run business and a really nice way to spend an evening in Cusco. We enjoyed all aspects of the visit - from the informative intro, to the star gazing, to learning more about the constellations under the dome. I'm pleased to say that I can now identify Venus, the Scorpio constellation, Alpha, Omega, etc."
        }, 
        {
            "index": 198, 
            "rating": "5", 
            "review": "Quite possibly the best attraction in Cusco. The Planetarium is quite possibly the best attraction to be found within the city of Cusco itself. A short 20 minute ride up to the Reserva ecologica de Llaullipata brings you to a very different looking planetarium from those you may be used to. This however just adds to the charm of the place. The guides are spectacular, extremely knowledgeable in what they are presenting and incredibly passionate about what they study. Their good vibes and enthusiasm only add to an incredible experience. To top things off, you get to see both Saturn (something I never thought I'd see) and the moon through their telescopes outside. Something in Cusco that cannot be missed!"
        }, 
        {
            "index": 199, 
            "rating": "5", 
            "review": "I will never forget how much I loved this experience.. This is a wonderful, family run, friendly, informative and fantastic value experience.You can see the moon and Saturn and more through the telescopes, learn about the stars, Incan history and how they used and interpreted the stars, hear stories and snuggle up under a starry blanket which is provided.All information is provided in Spanish and English, and you are collected from town and taken in a safe and comfortable minivan to a beautiful setting for a wonderful experience.I loved this place beyond words."
        }, 
        {
            "index": 200, 
            "rating": "5", 
            "review": "A really enjoyable experience. The hosts were very welcoming and had great knowledge of the night sky. The talk was interesting and the planetarium show was great. Luckily we did get to do some stargazing before we were clouded out. The location was very convenient and getting picked up and dropped off in central Cusco made it all so easy. Well worth it."
        }, 
        {
            "index": 201, 
            "rating": "5", 
            "review": "Inca night sky a totally new experience. Wow, this really blew my mind. Who knew the Incas looked at the dark parts of the sky to find their constellations, rather than the stars? It was also so fun to look through the telescope at the night sky for real. This is a great, great attraction."
        }, 
        {
            "index": 202, 
            "rating": "5", 
            "review": "Nice way to spend an evening. The visit was very well presented by very enthusiastic and friendly owners. We were lucky to have visited on a clear night although looking at the stars outside was only part of the attraction."
        }, 
        {
            "index": 203, 
            "rating": "5", 
            "review": "Fun and well-done experience. This was a nice, different way to spend an evening. The guide was very knowledgable, and the tour was interesting and interactive. There was a short lecture, some time in a state-of-the-art dome, then some telescope time outside. Although it was cold, there were warm blankets provided. Seeing the stars of the Southern Hemisphere and Saturn (and understanding their significance to the Incas/knowing what we were looking at) greatly contributed to the overall experience. Definitely worthwhile."
        }, 
        {
            "index": 204, 
            "rating": "5", 
            "review": "best sketchy van ride of my life. Don't let my title dishearten you, it was a very nice van that took me to a very nice place! This planetarium is family-run and quite small, but it packs a big punch in the way of astronomy, especially explaining how the Inca and the Spanish viewed the Southern sky. I learned a lot in a short amount of time, and my group had lots of fun viewing projections of the constellations and then using telescopes to look at them. The staff was helpful, friendly, and kind, and if that isn't enough to convince you to come here, they also have a gigantic white dog named Gandalf who just wants to cuddle and talk to you. Also, they have stickers. Vive la Planetarium Cusco!"
        }, 
        {
            "index": 205, 
            "rating": "4", 
            "review": "Meet Gandalf!. The Planetarium experience was good, it has a dome to project the night sky and Andean constellations. You can also see stars outside the planetarium with their telescopes, you can even see Saturn and its ring if you're lucky. They also keep a really cute huge white dog called Gandalf. You have to meet Gandalf!"
        }, 
        {
            "index": 206, 
            "rating": "4", 
            "review": "very interesting. Good to get to know the southern hemisphere and to get info about how the inka used the constellations for agriculture. The staff is super friendly and the telescopes of great quality."
        }, 
        {
            "index": 207, 
            "rating": "4", 
            "review": "fun night out. We were a few days from heading out on the Inca trail, and the idea of seeing the southern sky from camp is part of the appeal. Planetarium Cusco is a small family run business whose love of astronomy and the history of the way the inca saw and used the night sky is apparent in every part of the experience. We didn't have the clearest night, but we made the most of it to see saturn, the ring nebula, and several other astronomical sights through telescopes, as well as a planetarium show about the southern constellations and the unique inca 'dark constellations' that can be seen in the milky way. there was also a brief talk on the significance of some of the inca ruins as astronomical sites. the only negative thing i could say was that i wanted even more of that."
        }, 
        {
            "index": 208, 
            "rating": "5", 
            "review": "nteresting, educational and worth a visit. Did this on our very first night in Cusco as were too out of breath to do anything else :) And very pleased we did. Got picked up from the town centre and taken to a house on a hill just 15mins outside of town. Started the star gazing with an indoor lecture about stars and astronomy importance in the Incan culture. Have to say I was really impressed about the energy and enthusiasm the the lady put into that lecture (bearing in mind she probably does that every night) and learned so much not only about the Incan astronomy but also the culture, history, politics and Peru climate. All very interesting and informative. The theory was followed with some practical peeking into the telescope outside, allowing to look at different stars. Was blown away by seeing Saturn through telescope (and even got a sticker at the end to say I have seen one :)) The nights in cusco are cold so we were given blankets and cups of warm tea, which was a nice touch. All in all - very interesting, educational and worth a visit while you're acclimatising for anything more strenuous."
        }, 
        {
            "index": 209, 
            "rating": "5", 
            "review": "great evening out. collected from plaza regocijo at dead on time and taken above cusco towards sacsayhuaman into the hills where a little establishment lies hidden away. here the enthusiastic staff gave a talk and demonstration about the southern hemisphere stars before we headed off outside to see the real thing whilst clutching a mug of warm tea. a small scope was set up outside and gave us amazing views even of the rings of Saturn which was visible the night we were there. minor downside was confusion over price quoted (25 soles pp) when price was 50 soles pp, but didn`t detract much from a fascinating and enjoyable evening out."
        }, 
        {
            "index": 210, 
            "rating": "5", 
            "review": "A must!. A friend of mine organized a visit to the Planetarium. I agreed because I had nothing else to do, and so I had no expectations at all. A van picked us up (very punctually!) from Plaza Regocijo, which is located only one block from the Plaza de Armas. When we arrived, I was surprised as it is not exactly the type of planetarium you expect. Actually, it's just a little house up in the hills, near Saqsaywaman.We were about 15 persons, half of them spanish speaking, the other half was an english speaking group. But that was no problem at all, we had 2 guides so we split up into 2 groups. I was in the spanish speaking group. Our guide, a Prof. who is also the director of the Planetarium, explained us a lot about the Inka's and their relation to the stars, the universe etc. It's just amazing what the Inka's already knew about the whole universe. Actually one could say that their whole culture was connected to the stars, our sun, the milky way...the Professor explains this amazingly good, and you will be fascinated from the first minute he starts talking!After a lot of interesting explications, you will have the possibility to have a look trough their telescopes. We were able to observe Alpha Centaury, the second \"nearest\" sun to the earth, the lower star of the \"cruz del sur\" constellation and as a highlight planet Saturn with his moon Titan.If you don't come here, you will definitely miss a highlight of Cusco!"
        }, 
        {
            "index": 211, 
            "rating": "5", 
            "review": "Great little family business. Really informative and interesting. The staff do really well with the basic equipment. Not far from town and the transport is good. I would recommend before going up to machu picchu."
        }, 
        {
            "index": 212, 
            "rating": "5", 
            "review": "Great experience; enthusiastic staff. A group of ten of us went on this great trip, and it was worth every penny. The staff is knowledgable and highly enthusiastic about the content. The small planetarium is intimate and informative, and their equipment is good quality. I would highly suggest going, if you have an evening free."
        }, 
        {
            "index": 213, 
            "rating": "5", 
            "review": "How can I make a reservation?. My family and I will be in Cusco end of this month and the planetarium seems to be a interesting place to visit. Can anyone tell me how I can make a reservation? Their web site is not working. Thank you for your help in advance!"
        }, 
        {
            "index": 214, 
            "rating": "5", 
            "review": "Planetarium cusco. My friend and I did this on a whim and really enjoyed it. You have to call ahead because space is limited and they only go three days a week. It is a family run operation. They gave a nice talk about the Incan culture and then we went into an indoor planetarium and stepped outside to view the constellations and some stars. It was nice to apply that knowledge in the following weeks to continue to find stars and constellations on the dark inca trail and in the jungle"
        }, 
        {
            "index": 215, 
            "rating": "5", 
            "review": "A fun, unique experience with wonderful hosts!. You are picked up in the center of Cusco in a comfortable van and driven 15 minutes up the hill near Sacsaywaman. Nightly shows include a presentation about Incan history and culture through the lens of astronomy. Then you visit the planetarium and get a review of the constellations with a focus on the southern sky. There is also a slideshow that shows theIncan constellations including the dark constellations. Finally, you go outside and look through their very good telescope. We saw the Omega Centauri globular cluster, binary stars , and an excellent view of Saturn.The hosts are incredibly gracious and enthusiastic making for a fun and unique experience. They give you a lap blanket on arrival and serve herbal tea."
        }, 
        {
            "index": 216, 
            "rating": "5", 
            "review": "Very interesting and enjoyable. We absolutely loved the Planetarium in Cusco. Very knowledgable staff. Interesting facts and fables about Incan astrology. And a look at the night sky through a telescope - AMAZING! It was a freezing night in Cusco, so I recommend you wear warm clothes (although they do provide blankets and tea)."
        }, 
        {
            "index": 217, 
            "rating": "5", 
            "review": "Don't Miss the Planetarium. Looking through the telescope we could see Saturn and the rings around it! Our host spoke excellent english, they also provided hot tea and blankets. It gets darn right cold in the evenings in Cuzco."
        }, 
        {
            "index": 218, 
            "rating": "5", 
            "review": "Excellent!. My husband and our two children (ages 7 &9) visited the planetarium this evening. It was as amazing as all the reviews suggested. The sky was overcast when we arrived, but by the time we finished learning about the constellations (in the dome) and the Inca sky, the clouds cleared. We had an amazing view of the southern cross and we were able to see the rings around Saturn with the telescope. My children especially enjoyed Gandolf, the adorable white dog that lives at the planetarium (the only dog in Cusco we allowed our children to play with). All of the staff was amazing, we enjoyed our mint tea and blankets. The building does not appear to be a planetarium from the outside, but don't let the appearance fool you. Remember to bring cash, credit cards are not accepted. This is a must see if you are visiting Cusco!"
        }, 
        {
            "index": 219, 
            "rating": "4", 
            "review": "So much fun!. This was a highlight of our trip. The staff are very knowledgeable and kind, and their enthusiasm is infectious! We learned so much that helped us as we tours Machu Pichu and the Scared Valley. Definitely recommend you check it out, well worth the value!"
        }, 
        {
            "index": 220, 
            "rating": "5", 
            "review": "Awesome. This was truely a great experience. The staff were friendly and fun and it was a special thing to be able to see the stars in such a unique setting."
        }, 
        {
            "index": 221, 
            "rating": "5", 
            "review": "The trip to Cusco was made perfect by this experience. This was a lovely experience. The whole family is engaged in the effort to educate visitors about the Andes, the Inca skies, and astronomy. The enthusiasm they project is unmatched, and the little touches make this a perfect experience (they pick you up at Regocijo square, when you arrive you are given a blue stars-and-moons patterned fleece blanket, and hot cups of mint tea to warm you up while you stargaze). Also, there is a friendly white dog named Gandolf to keep everyone company!I feel so lucky that I heard about this and would strongly encourage anyone traveling to Cusco not to miss this. It is the perfect outing between a trip to Sacsayhuaman in the afternoon and before dinner (you finish with the stargazing around 8 or 9). You will feel invigorated by this family's passion for the skies!!The current charge is 50 soles ($18 US) which is a complete bargain for a 3 hour rich experience, transportation included."
        }, 
        {
            "index": 222, 
            "rating": "5", 
            "review": "Southern Cross and other constellations!!. My family of 4 including a 20 and 18 year old loved this sight! We were picked up by a van and taken from the center of the city to the plantetarium which is close to the ruins. We loved the education and experience of seeing the stars on such a clear night about Cusco. Also, we were able to see Saturn with its rings from the telescope! awesome"
        }, 
        {
            "index": 223, 
            "rating": "4", 
            "review": "Very good. We were unfortunate to go on the one overcast night during our entire so was unable to use the telescope, but the tour of the building was very interesting. I would recommend it, as even without the telescope the Cusco sky is unpolluted and crystal clear, making stargazing an amazing experience."
        }, 
        {
            "index": 224, 
            "rating": "5", 
            "review": "A must-do in Cusco. My sister and I were the only visitors the night we went to the planetarium. We were picked up at our hotel and transported to a lovely setting. The indoor presentation was informative and interesting with diverse information about Peru and the Incan culture included. The outdoor star gazing was marred only slightly by an overcast sky with occasional glimpses of the Southern Cross and other stars and planets. I strongly encourage everyone to visit, before or after your excursion to the Sacred Valley."
        }, 
        {
            "index": 225, 
            "rating": "4", 
            "review": "Impressive Planetarium. Modern Planetarium- our kids loved it- Very clean and comfortable and a must do if you have interest in this type of activity"
        }, 
        {
            "index": 226, 
            "rating": "5", 
            "review": "Unique experience stargazing. This is my first time to the Southern Hemisphere so when I heard about this planetarium I knew we had to try it.It was very convenient-they picked us up and dropped us off in Cusco. We especially loved going outside and learning about the night sky. I saw the Southern Cross for the first time, as well as other constellations like the boat and mosquito. Through the telescope they showed us Orion Nebula, and Saturn, among other things. I had never seen Saturn's rings before- kudos to them for showing us such wonderful sights!The whole experience from pick-up to drop-off was just under 3 hours, with 2 of them at the planetarium and about 15 min each way driving. Highly recommended."
        }, 
        {
            "index": 227, 
            "rating": "5", 
            "review": "Outstanding night sky experience. We had a fabulous visit at this wonderful attraction. They picked us up at one of the main squares in Cusco, took us to the planetarium site, just as the sun was setting. The very enthusiastic staff provided an entertaining and informative description of the southern hemisphere night sky, the Inca view of the heavens, and even the agricultural and political context! Then we saw wonderful things in the night sky through their telescopes, and an entertaining planetarium show with a lovely emphasis on Inca mythology. A perfect evening outing in Cusco that beautifully complemented the Inca Trail trek we set out for the next day."
        }, 
        {
            "index": 228, 
            "rating": "5", 
            "review": "This was a pleasant surprise.. We decided to go to this after reading a couple reviews. it was interestig to book, you need to call in the morning to set up your visit. They instruct you where to meet and then they come pick you up at that location to visit the Planetarium. The briefing they give you basically gives a lot of insight into the ruins and the significance of the things you see at the ruins.it turned out to be one of the best things we did to understand the history and agriculture in the Sacred Valley.i'd recommend this to anybody. Wre from Seattle Washington area so we've never seen the Southern Cross Constellation. We got to see it from the Planetarium as well as a few others in the Southern Hemisphere."
        }, 
        {
            "index": 229, 
            "rating": "5", 
            "review": "My daughter and I thoroughly enjoyed our experience. The staff at the Planetarium was very nice and very enthusiastic. They provided us a lot of interesting and hands on knowledge about the Incas and how they used the night sky to help found a civilization. It was a fun and different experience."
        }, 
        {
            "index": 230, 
            "rating": "4", 
            "review": "A beautiful experience. The staff at the planetarium is very friendly, knowledgeable and passionate about what they do. That translates to the audience immediately. They care about your comfort and provide you with warm tea and blankets on cold nights. They also indulge your questions and speak to you and either Spanish or English depending on your needs. This is a great activity for families or for adults who love to stare at the stars. My favorite part was learning about the Incan constellations. The only recommendations I would have would be to purchase stronger telescopes (I'm no expert but I have seen the rings of Saturn from sea level with a telescope in the everglades, in my mind that makes me think that at an altitude of over 11,000 feet I should see a clearer picture of Jupiter rather than what looked like zooming in on a star) whenever possible and to arrange for a darker setting in which to enjoy their knowledge and the beauty of the skies. I understand their limitations and with those mind I believe they do the best they can with what they have and that this is a great experience for a clear night in Cusco."
        }, 
        {
            "index": 231, 
            "rating": "5", 
            "review": "Unusual way to spend an evening learning about Inca constellations. A wonderful little gem in Cusco City. The bus picks you up early evening from one of the squares and takes you to the planetarium on the hill side overlooking the city. First an introductory talk (English and Spanish options done separately) which was wide ranging about the history of the stars and its uses - for example in agriculture. Then we went outside where it had got very dark very quickly and had a wonderful session star gazing. The hosts used laser pointer pens to pick out constellations and planets. This was excellent as no matter how hard I have tried in the past I have never picked out anything more than Orion's Belt! Next the big telescopes came out and the very knowledgable and passionate professor picked out some of the best sights in the night sky - including Jupiter and the Orion nebular - where stars are born.Finally a presentation inside the planetarium dome showing the constellations with helpful pictures overdrawn and an explanation of the inca astronomy of dark constellations which was fascinating. It was very cold but we were provided with plenty of blankets and we were impressed with how the trees had been planted around the site to minimise the light pollution from the city - very effective. An excellent evening costing 50 soles each which I highly recommend to anyone before embarking on the inca trail to learn a few basics to appreciate the night sky along the trail."
        }, 
        {
            "index": 232, 
            "rating": "5", 
            "review": "A wonderful experience, don't miss it!. Located high in the hills above Cusco, (the drive itself was beautiful) we were thrilled to observe the night sky, free from the lights of a big city. Through their telescope, we were able to observe different planets and the moon, very clearly. It was amazing to be given an explanation of astronomy from the point of view of the Incas. Very friendly, enthusiastic, very kind. Go!"
        }, 
        {
            "index": 233, 
            "rating": "5", 
            "review": "A must!. Great place to visit before visiting the inca ruins in Cusco! :) they are also very friendly and they offer you some coca tea and blankets if you feel too cold. Better to go visit around winter time where the sky is clearer."
        }, 
        {
            "index": 234, 
            "rating": "5", 
            "review": "One of the best attractions in Cusco. If you even a passing interest in astronomy, science, or the advancement of the Inca civilization I highly recommend this site! You have to meet the van at the small square adjacent to the Plaza de Armas and then you will be driven to a remote location (don't worry!) about 15 min away. My wife and I were there with another family so it was a small gathering and quite cozy. It's best if you can aim for a clear night's sky for the star gazing but with the usual hectic travel schedules this is not always possible.The staff there are passionate about astronomy and are very easy to talk to. They made a wonderful presentation and handed out blankets/hot tea as it is quite chilly at night. After the presentation they take you outside and show you different stars/constellations and how they were used by the Incas for predicting seasons, rains, etc. I actually got to see Saturn and the Moon through the telescope which was amazing. This is enjoyable for all ages."
        }, 
        {
            "index": 235, 
            "rating": "5", 
            "review": "A wonderful educaitonal experience. The Cusco Planetarium is a delightful addition to the overall cultural experience found in this part of the Andes. My wife and I were delighted by the presentations especially the opportunity to view several southern hemisphere deep sky objects through the telescopes at the Planetarium site.Of especial note is the care the presenters gave to describing Inka constellations, which are mostly \"dark or black\" constellations produced by dust clouds obscuring stars in the Milky Way. I would have preferred to hear more about those (the resident astronomer, Prof Salazar is an expert on Inka constellations and star knowledge). Northern hemisphere astronomy buffs should not miss the opportunity to see the glories of the southern skies....and so close to town (but with minimal light pollution)! Some of the astronomy knowledge presented (intihuatanas, the Oyanti pyramid, the Q'enqo \"awakening the puma\") will be invaluable in enhancing visits to nearby Inka sites including Tipon and Machu Picchu.Prof John Stocke, CU Boulder astronomer"
        }, 
        {
            "index": 236, 
            "rating": "5", 
            "review": "Excellent!. Our family of 5 were the sole visitors to the Planetarium Cusco one night during the first week of January. I had my doubts as our driver neared the site (and seemed to keep getting lost), but they were all dispelled from the moment we arrived. We were greeted by the staff of 3 with soft blankets and a cup of tea to ward off the chill night. We spent the next couple hours entranced by the presentation! When it ended we went outside and were thrilled to have a chance to see Jupiter through the telescope, even though the clouds were significant. Our 3-generation group learned a lot, and also appreciated spending time with people who so clearly love what they do. It was a very worthwhile side trip for us in Cusco."
        }, 
        {
            "index": 237, 
            "rating": "4", 
            "review": "Fun and informative, book last minute and make sure the sky looks clear!. You get picked up from the square besides the Plaza de Armes and it is about 15 minutes up to the location. Housed in a converted barn there is a talk on the stars and how they were used by the Incas (at least their best guess) followed by an interesting show in the small planetarium. The best bit was seeing the stars and moon through the telescopes outside afterwards.The kids loved it. Just make sure it is a clear night. Expensive by Peruvian standards but not bad by western prices."
        }, 
        {
            "index": 238, 
            "rating": "4", 
            "review": "Fun and worthwhile experience. The planetarium is a really fun experience! It's a privately owned planetarium run by incredibly passionate people. While we had the misfortune of fog (as is often the case), we did have a lovely time hearing about the Incan mythology, exploring their planetarium theatre, checking out the moon with their high powered telescope and seeing the view. What a breathtaking view above Cusco! Transit is super easy (they pick you up from the Plaza and deposit you right there)."
        }, 
        {
            "index": 239, 
            "rating": "3", 
            "review": "Nice, but cloudy.. Since I went during the rainey season, it was very cloudy. The couple gave a nice explanation and tour, but they didn't turn on the telescopes while I was there due to the clouds. I really wish they turned it on just so I could see."
        }, 
        {
            "index": 240, 
            "rating": "5", 
            "review": "Raining but still great. A small family run planetarium that explains (in your native language) how the Incas saw the heavens, and why. We were there on a rainy night and didn't get to peer through the telescopes, but it didn't matter, the presentation and exhibits were very earnest with a lot of pride for the Inca culture, and helped explain some of the things we had seen at Maccu Piccu."
        }, 
        {
            "index": 241, 
            "rating": "4", 
            "review": "check the cloud cover before visiting, generally great eveninig. do check the cloud cover and what interesting observations you can perform on the night you plan to visit the planetarium. the visit there starts with a bus ride up to the Sacsowouman hill from Cuzco. then there is a short lecture on Peruvian sky, methods of observations and Machu Picchu's parts. then we sat for a show of starts in their own in place planetarium cinema. at the end of the visit, weather permitting, we looked at some cool places on the southern sky - we saw a nebula where the stars are born!"
        }, 
        {
            "index": 242, 
            "rating": "3", 
            "review": "Good, but not great. Excellent service. First of all, don't try to get there by taxi. They have a transportation system, use it. Because I didn't have much time in Cusco and had already booked several activities, I tried to get there by taxi. The taxi driver had no idea of where it was, charged me 15 Soles (all rides in Cusco cost 4) and almost didn't find it. Overall, it was a very good experience, the service is great, just don't expect much of the scientific part."
        }, 
        {
            "index": 243, 
            "rating": "4", 
            "review": "Stars aren't just for dreamers. This is a small, private company operated by very passionate and friendly astronomers approximately 15 minutes away from Cusco - don't expect anything too grand, but do be happy that you are investing in a local business and cause.We went to this planetarium before doing the Inka trail, and though it didn't help us recognize constellations too much, it did confirm how important the stars above were for the Incans - both in terms of their faith and for agriculture. It was especially interesting to learn how the Incans were the only civilization to also have \"dark constellations.\"We were a small group of 4, which nicely felt like a private showing. Unfortunately, the moon was almost full the night we went so it was pretty hard to see many stars. If you're flexible, I recommend visiting when the moon is least bright. We also didn't spend as much time outside looking at stars or planets through the telescope as I would have liked. Perhaps if we had an even later start time, we might have possibly been able to see more. Alas though, so much of visibility is contingent on the weather and the moon.The student discount costs 30 soles which made the experience affordable. Their dog, Gandalf is the sweetest dog I met in Cusco (and I met a lot of dogs there), and all in all, how can you not enjoy staring at the stars?Don't forget your sweater! It gets really chilly."
        }, 
        {
            "index": 244, 
            "rating": "5", 
            "review": "Stars like you've never seen in your life!!. WOW - what can i say - i saw the surface of the moon through this telescope!!! I saw the rings around saturn!!!!!!!!! YIP- through this amazing telescopeSaw the South Star - the Southern Cross and a few other constellatioins - their names evade me at the moment!!THe stars here as absolutely AMAZING - all twinkly like you could almost reach out and touch them!Dont hesitate in going here - just book it - you will not be disappointed!!! AMAZING!!!"
        }, 
        {
            "index": 245, 
            "rating": "5", 
            "review": "A must do in Cusco.... My wife and I went along to this after seeing an entry for it in Lonely Planet and it's high rating here on TripAdvisor. Neither of us are stargazers, so we didn't really know what to expect. We arranged the trip incl. transport for S50 each, which is pretty reasonable.We got picked up later that evening and brought up to the planetarium, about 15 mins from the centre of Cusco. We were in a group of about 10 people which was a nice number. After a brief introduction into how the Inca's viewed the skies and some examples of this, we were fortunate enough to be brought outside for some live stargazing through their telescopes. I'd never done anything like that before and was really struck by this part of the trip - Mars in particular looked amazing through the telescope.After looking at a number of different interesting features in the night sky, we went inside for the planetarium which again was pretty amazing. I can't complement the staff here highly enough - their enthuasism for what they do was contagious. Even their dog, Gandalf, was one of the friendliest dogs I've ever had the pleasure of meeting."
        }, 
        {
            "index": 246, 
            "rating": "4", 
            "review": "Informative, Funny, and Passionate. There are three components to the Planetarium experience: 1) A informative talk2) Dome projection of night sky3) Telescope experienceThe talk was charming and interesting, providing just enough information for my inquisitive mind, but not too much that I started zoning out. Always a fun experience, I love planetariums for the projection presentation, I was at first disappointed as we were presented with the more well-known western astronomy bits and constellations, but quickly perked up as discussion on the Incan astronomy and astrological myths began (my favorite part!) Sadly, the clouds weren't cooperating and we missed out on telescope use that night, but I imagine that would have been lovely as well.The family's passion for the stars and their heritage definitely comes through with a high level of warmth, consideration, and intelligence. However, a few suggestions:1) It's cold in there, is there not anything at all they can do to warm the place up? (Bring your mittens and hats and scarves!)2) For those needing English translation the dome projection experience was at times difficult to follow (at times the Spanish and English overlapping one another), I am hoping over time they can smooth out the kinks in the presentation 3) Just a bit of hands-on or interactive experience would be lovely - especially if the telescope experience is not happening due to weather!Overall, lovely experience - highly recommend it! :)"
        }, 
        {
            "index": 247, 
            "rating": "5", 
            "review": "Amazing Little Museum. Tiny museum but so well done. Excellent explainations of how Incas used stars and sun alignment in their lives. The guide was very personable, and looking through the telescope outside was really fun."
        }, 
        {
            "index": 248, 
            "rating": "5", 
            "review": "Great experience. Based off other TripAdvisor reviews, we decided to come here and were not disappointed. Keep in mind the planetarium is a private business and not a public observatory as you would expect in the US. The day we were scheduled to go, it rained and they were more than willing to accommodate and move the tour to another evening which had better weather. Transportation to and from the planetarium was easy and seamless since they picked us up and dropped us off. The evening starts at around 5:40pm and ends around 7:45pm. The tour is in 3 phases, 1) short lecture where you learn about the history and importance of the stars to the Incan people, 2) going outside and looking through telescopes at the stars, and 3) coming back inside for a brief presentation in their observation dome. The evenings are cold in Cusco, and they gave was hot tea and warm blankets for when we were outside looking through telescopes. It was really interesting and helpful especially since we would be going on our 4 day Inca trail hike to Machupicchu and would be able to take that knowledge with us as we star-gazed at night. Overall, a great experience and an activity that can easy be done in a short evening."
        }, 
        {
            "index": 249, 
            "rating": "4", 
            "review": "Interesting Evening Lessons. We were picked up at promptly 6pm and taken to the Planetarium. We had no expectations of the place and had time to kill. I enjoy watching people who are passionate about what they are doing and I don't think you will find anyone as passionate as the Professor and his niece. Also learnt a few more things about the Incas and Cusco, which is always a good thing. We went at a time when the sky was cloudy so we did not see the stars at all but the nice thing about the Professor and his niece was they invited us to visit the following day to see the stars, alas we were leaving then."
        }, 
        {
            "index": 250, 
            "rating": "5", 
            "review": "Great way to fill in the evening. We did the planetarium for something to do one evening. Being from the Northern hemisphere, I had only heard of the Southern Cross but had never seen it until going the the planetarium. Also, I had never seen the rings of Saturn except in pictures. The professor who owns the planetarium is very passionate and excited about astronomy and gets a kick out of showing off the different constellations and planets."
        }, 
        {
            "index": 251, 
            "rating": "5", 
            "review": "The best way to connect the dots how the incas knew about astronomy and agriculture.. If you still have doubts about the way how the inca's cities were built. You will find your answers in a great atmosphere followed by a cup of tea and a night sightseeing telescope. By Adriano Giannella"
        }, 
        {
            "index": 252, 
            "rating": "5", 
            "review": "Fun and interesting. We got lucky. When we arrived at the planetarium, it was cloudy. Throughout the (interesting, information) indoor portion, it stayed that way, but within 5 minutes of going outside to use the telescopes, the sky cleared up completely and we had some amazing views. It was my first realization that I was outside of the northern hemisphere for the first time, as I saw constellations like the Southern Cross. I even got to see Saturn and it's rings. Definitely recommended as a fun evening activity before a late dinner."
        }, 
        {
            "index": 253, 
            "rating": "3", 
            "review": "Fun to look through the telescope. The family that runs the planetarium is incredibly friendly and helpful. They go to great lengths to make you comfortable in the cold (blankets and tea included), and are very enthusiastic. The indoor presentation didn't have too much information, but really I think that's because most of the information about the Inca is unknown. Much of what they share is stuff you will hear elsewhere while traveling through this area. The best part was looking through the telescopes at the star clusters and Saturn (which was cool, but as you would expect, brief.) If you don't have much time in Cusco I would probably skip it."
        }, 
        {
            "index": 254, 
            "rating": "5", 
            "review": "Very interesting. Great night, learnt alot, staff are excellent, gandolf the big friendly dog is beautiful. Best part is the viewing of Saturn through the microscope. Recommend to anyone even slightly interested in the skies or the incas"
        }, 
        {
            "index": 255, 
            "rating": "5", 
            "review": "great thing to do in cuzco. interesting, super informative, great to visit with kids, they have a ver organized visit and they pick you up at the plaza in cusco, reasonable price also"
        }, 
        {
            "index": 256, 
            "rating": "5", 
            "review": "An introduction into Inca astronomy: just plain amazing.. After reading the gushing praise about this facility on Trip Advisor, we booked a night with them while in Cusco. A van picks up the group (ours was about a dozen or so) on Plaza Regocijo, located just a block or so from the main square. It is a ten minute drive to the planetarium proper.The evening presentation is divided into three main sections over two hours. First, a twenty minute introductory lecture is given reviewing the role of astronomy in Inca culture and its role in helping make decisions regarding religious offerings and crop cycles. Various storyboards are used during this time in addition to a 3-D model of the solar system. Next, the group is taken into the planetarium (indoor “artificial sky”) where a professor of astronomy displays various constellations from both the northern and southern hemispheres and continues basic concepts begun during the first lecture. Lastly, weather permitting (we had crystal-clear skies), the entire group goes outside to see various planets, stars, and constellations on professional telescopes. These machines aren’t the usual rickety contraptions on tripods but the real deal; I saw the rings around Saturn and Mars for the first time in my life! Attention to customer service is superb throughout the entire process: blankets, tea, and goodwill are in abundance throughout your stay until your return to Cusco about two hours after arriving.Later in our trip, we could put a lot of the information to good use when hiking the Inca Trail the following week when the Milky Way and Southern Cross suddenly became identifiable (and therefore meaningful) instead of functioning as passive sky ornaments. Other topics such as the role of the summer and winter solstice kept popping up while we were at Machu Picchu. As perhaps the biggest compliment to the family who organizes this, I just recently purchased my own (very amateur) telescope and will be watching the moon through its phases next month.An overall excellent experience: inexpensive, well organized, useful, and entertaining."
        }, 
        {
            "index": 257, 
            "rating": "5", 
            "review": "great introduction to Inka and pre-Inka culture. My wife and I visited here soon after arriving in Cusco--while getting over jet lag and adjusting to the altitude.....a wise choice, since it wasn't physically taxing.The young lady who made the initial presentation was enthusiastic about talking about Inka contributions to the world. And the gentleman was so thrilled to show us the southern sky and how it figured importantly in Peruvian cultural thought through his very powerful telescope. Another group was supposed to join the two of us, but they didn't show. No problem. We were given a \"private tour\" with no extra charge.This was a wonderful experience and a terrific introduction to what we were later to see in the Cusco area."
        }, 
        {
            "index": 258, 
            "rating": "5", 
            "review": "Calling anyone interested in science. Cusco is filled with cutural attractions. This is the only science one, and its great. We didn't need an organized tour, the two of is just called the number on their website and got a spot that night. They picked you up and drop you off in the main square. Everything was really nice, the presentation was wonderful and we leaned a ton. Worth the $. Do it before your hike."
        }, 
        {
            "index": 259, 
            "rating": "5", 
            "review": "Don't miss this if you have time!. I have lived in Sao Paulo, Brasil for over a year now and never did know where the southern cross was, but now I do, thanks to the education I received at this wonderful family run planetarium. I can also pick out several other constellations found only in the southern hemisphere. We saw several planets through the telescope and other interesting things. I would recommend you spend the time to learn a bit about the southern sky and Inka history..."
        }, 
        {
            "index": 260, 
            "rating": "5", 
            "review": "Very Enjoyable!. We did this tour with kids, ages 6-15. The tour was interesting and entertaining, and the 3D diagrams were really cool. The tour guide is very passionate about her work, and explained everything, although here or there you miss a word because of the tour guides spanish accent. The blankets and hot tea they served when we went outside was a nice touch and kept us warm when we looked through the telescope outside.*Recommended for children ages 9 and up*Slightly expensive (50 sole for adult, 30 for child)"
        }, 
        {
            "index": 261, 
            "rating": "5", 
            "review": "amazing experience. Had a private tour of the planetarium with my 8 year old son. It was one of the highlights of our time in Cusco. LOVED looking through the telescope at end of program. Saw rings of Saturn and several other stars/planets. Chilly outside while viewing - but, they provide warm blankets and hot tea!"
        }, 
        {
            "index": 262, 
            "rating": "5", 
            "review": "Passion!. I liked so much this tour, the planetarium is a family business and they are really passioned about their job giving us the best they can, explaining everything about Inca's astronomy and the southern sky!"
        }, 
        {
            "index": 263, 
            "rating": "4", 
            "review": "We enjoyed it. We chose to do the Planetarium the night before our Salkantay trek so that we could use some of our new knowledge on the hike. We were told we were going to be picked up in Plaza de Armes on the stairs of the Cathedral. We happened to notice that they were having a parade in Plaza de Armes and all of the streets were shut down. I asked my hotel to call them to confirm our pick up point. They tried all of the numbers but the people in charge were not around and kept telling our hotel to call back. About 30 min prior to leaving our hotel finally speaks with someone who agrees with the traffic and has us meet them somewhere else. They showed up 15 minutes late but there was a lot of traffic. We were dropped off at a small home about 15 minutes from our pick up point. It was very cold and they had a lot of people there that night. They handed out blankets but did not have enough for everyone. The lady who spoke had very good english and you could hear her passion behind her stories. They bring you into a dark circular room after the introductions and explanations where they show you constellations on the ceiling. This was actually really nice. Everyone in our group though wished they could have shown each constellation by itself so our imaginations could visualize it better. After the dark room, we all went outside to look into the big high powered telescopes. Clouds were starting to roll in, so we could only see a few constellations. The southern cross was very beautiful. We were also shown Saturn and you could actually see its rings!!! That was awesome. During our trek, we would look up and find ourselves finding all of the stars and constellations that they taught us. We had to leave a little early since we all had to be up at 4am the following morning. The lady said that the van was dropping us off at the hotel, but we were dropped off in Plaza de Armes and had to walk 15 minutes back to our hotel."
        }, 
        {
            "index": 264, 
            "rating": "5", 
            "review": "Best tour ever.. So this trip was really awesome. Ana told us to meet in Plaza Recogocito and the bus showed up exactly where it was supposed to. It was kind of hard to miss since they had a a decal on the side of the bus. It actually showed up on time and they waited for about 10 minutes after 530. Ana was really nice and she spoke very good english. We learned a lot of interesting things about the stars and how the Incas interpreted the sky. The sky wasn't cloudy so we got to see a lot of neat stars. We actually got to see Saturn which was like, unrealsies. The visit to the planetarium definitely was a highlight of my trip - and I've seen practically everything here."
        }, 
        {
            "index": 265, 
            "rating": "1", 
            "review": "Waited for an hour to be picked up. Nobody came.. This was the second tour in Cusco that we really looked forward to, without anybody showing up. We made reservations via the website, but didn't get any reply. A day later we called, and got the information that the contactform on the website doesn't work.So why do you put it there?We made reservations and were told to be in a small square next to the big Plaza de Armas. We waited there for half an hour and then decided to call the numbers on the website. One was picked up by a very young girl, who could just say that her mother was not home. An other number was picked up by a tour agency, who said they couldn't do anything for us. Another one wasn't answered.What is it about Peru that you get unclear directions about where to be, you wait for an hour, and in the end nobody show's up? A big disappointment, we were really looking forward to this. And unbelievable how businesses are just fine with disregarding tourists like this, that are willing to pay 50 soles per person. And have a 4 year old girl picking up the phone while people have been waiting in the cold for an hour.A big blemish on our stay in Cusco."
        }, 
        {
            "index": 266, 
            "rating": "5", 
            "review": "Definitely a must when you visit Cusco. Excellent for a family vacation... We and our kids learned a lot about the Inca's relation to the stars... Also we could see a beautiful setting with a great presentation."
        }, 
        {
            "index": 267, 
            "rating": "5", 
            "review": "The Incas had a great understanding of the universe. I found it interesting the way they called the milky way the celestial river .with all the animals drinking from it coincidence we have animals too like leo cancer &the zodiac,&that was pre colombian.!?funny."
        }, 
        {
            "index": 268, 
            "rating": "5", 
            "review": "One of a kind experience!. This was such a fun activity during our trip in Cusco. We learned so much about the Incan culture and also about astronomy in general. The hosts were so welcoming - giving us blankets and warm tea while we were outside star-gazing. The tour was delivered in excellent English and the hosts were SO enthusiastic about what they showed us - their excitement was contagious. It was so easy to contact them via email and they set up transportation for us from the main square. I can't think of any way they could improve this. Highly recommended!"
        }, 
        {
            "index": 269, 
            "rating": "5", 
            "review": "Great evening experience. This was a last minute discovery for us and what a lovely little gem! Highly informative and insightful - would strongly recommend a visit, especially on a clear night as the star/planet gazing is quite incredible. Van pick-up was from the main square, where we were taken up to the tiny planetarium in the hills behind Cusco. Hosts share a wonderful passion for Inca astronomy."
        }, 
        {
            "index": 270, 
            "rating": "5", 
            "review": "Interesting and informative. The site is small but informative. The Tour is divided into three components. The first section is informational with exhibits, section two is in the dome where you can see the constellations! and section three is outdoors with the telescope. Unfortunately section three didn't happen on my visit since it was cloudy! Will definitely try to go back when I return (for section two and three)."
        }, 
        {
            "index": 271, 
            "rating": "4", 
            "review": "Enjoyable evening in cusco. My boyfriend and I went to the planetarium this evening and really enjoyed it. Gives a great background and insight into the incas and their beliefs and methodologies. Hosts were very welcoming and knowledgeable. Recommended!"
        }, 
        {
            "index": 272, 
            "rating": "5", 
            "review": "My favourite Cusco attraction. My 2 best friends and I found this on trip advisor and decided it was a must do prior to our PeruTreks Inca Trail 4 day hike as we all loved planetariums and star gazing. We were travelling the month prior to arriving in Cusco, but Ana Maria was very efficient and we were able to organise a tour via email. We waited at Plaza de Armas, and the driver appeared at the appointed time. We were driven up the mountain to the Planetarium. What initially looked like a little farm and shed out the back, quickly gave way to a a quaint observatory, informative charts and awesome telescopes. The presentation on Inka astronomy, the links to agriculture, practical usages and integration with culture were fascinating. It helped us understand what we saw along our trek to Machu Picchu. Bring warm clothes as it gets cold at night (gloves, hat, scarves, warm jacket: layers are best), camera, you may find a small torch or headlamp helpful for seeing where you are walking. They do have a torch but it is hard to see after dark. Don't let the simple appearance fool you, the information is well researched. Our Spanish is terrible, but Ana's English is excellent and understanding the wealth of knowledge she presented was not a problem. Look closely at the 'pierced drum' which is used to shine the constellation onto the inside of the dome. The family were so thoughtful, they brought us hot tea and blankets to keep us warm whilst we were star gazing through the telescopes outdoors. Would highly recommend this to all ages, and that visitors organise to do this soon on arrival to Cusco. The 2 to 2 and half hour experience was over all too quickly"
        }, 
        {
            "index": 273, 
            "rating": "5", 
            "review": "stars. I have been to a few of these in europe.. but i like this one best.. very quaint."
        }, 
        {
            "index": 274, 
            "rating": "5", 
            "review": "Great evening, very interesting. We had a wonderful experience at the Cusco Planetarium. Learned a great deal about Inka Astronomy and enjoyed a beautiful view of Jupiter."
        }, 
        {
            "index": 275, 
            "rating": "5", 
            "review": "The simplest and most exciting planetarium I have ever been. I like visiting planetariums in my trips. The interesting point is that although this is the simplest planetarium that I have ever visited, it is at same time the most interesting one. It is a family enterprise (or at least seems to be so). You will have at around one and a half hour class of the Inca astronomy (and comparisons with the mainstream astronomy) with people who really love what they are saying to you. Also, depending on the weather conditions you will see the stars through good telescopes. I have not seen this attraction in any traditional guide, just through trip advisor. I recommend the planetarium to anyone visiting Cusco who likes planetariums. Anyway, it is interesting to go only if you have more time in your visit to Cusco. "
        }, 
        {
            "index": 276, 
            "rating": "5", 
            "review": "An excellent introduction to both Incan culture and astronomy. As an astrophysicist, I was incredibly impressed with the facilities that the planetarium had-- without any external funding, they managed to build a planetarium bigger than my former university's, and had several telescopes set up for outside observing. It was much more than just a planetarium show, with a detailed background of Incan astronomy and its uses both inside and outside of the dome, along with the night-time observations of several planets and deep sky objects. They also were able to schedule an affordable private show for two people (as we were there during a time with few tourists); they are also bilingual, for non-Spanish speakers like myself. This institute provides a much needed introduction to cultural astronomy and acknowledgement of the wonderful contributions of the Incas to the field."
        }, 
        {
            "index": 277, 
            "rating": "5", 
            "review": "An amazing evening. I went to the planetarium as the only English speaking person in the group and was to feel really comfortable. The introduction and explaination was fantastic, especially how little Santi translated everything that Ana was saying perfectly. Although it was too cloudy to see the stars, I still had a wonderful time"
        }, 
        {
            "index": 278, 
            "rating": "5", 
            "review": "Amazing!. We went to visit the planetarium on the 30th and had AN AMAZING time. We were explained what the sky meant to the incas and then we learned how to spot different constellations. As the sky was clear we were able to see the moon, orions belt, subaru and jupiter. We were so lucky the weather was perfect! We were able to take a picture of the moon through the microscope and it came out PERFECT, we could actually see the moon's craters in the picture!! If you want a glimpse of what you can see, go to their facebook page, we've tagged them on our picture!"
        }, 
        {
            "index": 279, 
            "rating": "4", 
            "review": "Eye opening and culturally valuable. These guys went out of their way to get us to the Planetarium in time for the show. To the point that they arranged a special driver to take us there, the rather dignified and eloquent Founder of the Planetarium himself! We were SO glad they did. This tour is a very complementary way to understand the Sacred valley and its deeper history, through the eyes and the skies of its own native people."
        }, 
        {
            "index": 280, 
            "rating": "3", 
            "review": "not what I expected. Let me start by saying that this is interesting but not the highlight of a trip to Cuzco, since just walking by the central plaza or going to Saccsahuaman and watch the city from a high hill is more impressive. I like the idea of watching the stars on the south hemisphere and I thought this place has its own beauty but it should not be one of the most attractive attractions of Cuzco."
        }, 
        {
            "index": 281, 
            "rating": "5", 
            "review": "Planetarium Cusco was the highlight of our stay in Cusco!. We called Ana,the planetarium guide, at 5:00 pm on her cellphone and at 6:00 she, Robert, and Professor Salazar picked us up in Plaza de Armas to take us up to the planetarium. We four were the only people with a reservation, but they were willing and eager to share their wealth of knowledge with us!Ana told us interesting stories about the Incas, the skies of the southern hemisphere, and about the history of Cusco, the Incans, and Peru. All of us (ages 13-70) were very intrigued by all that she taught us.After the introduction, she took us into the planetarium for a terrific demonstration of the stars, constellations, and the Incas' interpretations of what they saw in the sky. Professor Salazar has put a great deal of research and time into making a terrific presentation, and Ana did a wonderful job of explaining it to us in English.The entire project is obviously a labor of love! I highly recommend this as an activity to do in Cusco, especially before you journey to Machu Pichu."
        }, 
        {
            "index": 282, 
            "rating": "5", 
            "review": "Sweet fun place, learned a lot, great experience. My friends and I were all meeting in Cusco before commencing a lodge to lodge trek to Macchu Picchu. One of them found this, thought it would be fun our first night. Wow, so glad she did, it was perfect! Drove up the rural road from Cusco, we immediately all knew we were in for a treat. In the age of digital high tech everything, we all really loved and appreciated how old fashioned this planetarium is, yet we did not need high tech to see and appreciate the constellations in the southern hemisphere. I particularly loved the Incan constellations, the black llama, rainy season, just fascinating. I felt like we were with family, during the demonstration. They passed out night-moon fleecey blankets to all of us! We then wore them outside when they passed out hot mugs of tea and we took turns checking out Jupiter and its 4 moons through the telescope, stunning!! It was the most perfect way for us to all gather, enjoy something fun, learn about Cusco, Incan history, enjoy the stars and the hospitality!"
        }, 
        {
            "index": 283, 
            "rating": "5", 
            "review": "Despite altitude adjustment and jet lag, whole family enjoyed it!. This was our first activity in Cusco, just a few hours after arriving. Our hotel recommended staying in to acclimate, but this was the perfect activity for the evening. We met on the street and were driven up to the small but very cute planetarium. This is not a fancy or high tech operation, but we loved it! I particularly liked the low-tech, but incredibly useful and informative exhibit about the stars that form the Southern Cross constellation. This simple exhibit of foam balls on fishing wire explained the position, size and relative position from the Earth of the stars in the constellation in a way that I found more effective than the fancy CGI animations you'd see in a high tech planetarium. The best part was viewing Southern Hemisphere stars and constellations outside. My husband is on the board of a Northern Hemisphere space museum, so we see a lot of high tech stuff, but this museum was charming and interesting without all the bells and whistles...and even our tech savvy 13, 13, and 10 year olds were interested and completely enjoyed themselves (again, despite jet lag and altitude adjustment!). Highly, highly recommend!"
        }, 
        {
            "index": 284, 
            "rating": "5", 
            "review": "A passionate review of the night sky. This family owned and run Planetarium is the prefect mix of technology and hospitality . We learned about the constellations planetarium-style, and then got to see the real ones outside with the help of Annie and her uncle (excellent English is spoken). This was a special treat for our group as we were all from the northern hemisphere and had never seen the southern sky! Annie gave us blankets for outside stargazing to fight off the night chill, AND while we were viewing Saturn, brought us hot tea! Annie and her family are knowledgeable and passionate and it is contagious. This was one of my favorite activities in Cuzco."
        }, 
        {
            "index": 285, 
            "rating": "5", 
            "review": "Beautiful evening explanations. Cups of tea, blankets, storytelling and telescopes - a great way to spend an evening in Cusco, and the perfect thing to do before the Inca trail - impressed our guide with our knowledge gained the evening before, and pointed out Scorpio to our fellow hikers. Fabulous introduction to the Inca world."
        }, 
        {
            "index": 286, 
            "rating": "5", 
            "review": "Great introduction to Inka worldview and Southern Hemisphere skies. This is a great thing to do early in your trip to the Cusco area. If you come from the north, you're going to want to know what you're looking at in the beautiful starry skies when you're out in the Andean countryside. Plus, a careful study of the stars was crucial to Inca science and religion, and forms part of the great architectural achievements of the Inca empire. This is a very friendly, informative, enthusiastic and energetic family-run operation deserving of much support. They adapt their talks to the ages, interests, and languages of the audience. Added benefit, they pick you up downtown and take you back downtown, so you don't have to find the place yourself at night."
        }, 
        {
            "index": 287, 
            "rating": "5", 
            "review": "A fantastic evening, I learned and saw so much!. I had contacted Prof . Erwin Salazar after seeing his Youtube video about the Pisac site (http://www.youtube.com/watch?v=WRkoKM-iABI). He met my mother and I at the planetarium's departure point where some other people were waiting. We were whisked off to the planetarium's site near Sacsaywayman. Ana Maria gave a very nice presentation in English and then translated for Prof. Salazar while he treated us to a very nice planetarium presentation about the Inca constellations and star names. After the presentation we headed outside for a look at the skies and a had peek through their telescope. We saw many things that we Northern Hemisphere dwellers never see, including the Southern Cross and the Centaur. He trained the scope on the Jewel Box, Alpha Centauri, M7, Saturn and a comet to top it all off! A very memorable night. I only wish we had more time to visit with Prof. Salazar..."
        }, 
        {
            "index": 288, 
            "rating": "4", 
            "review": "Special evening experience in Cusco. The planetarium in Cusco is a special, semi-private experience, missed by most tourists to the area. On the night we went, it was just my husband and me, one other couple from the U.S., the guide and a professor. It felt like we were on a private tour with two very enthusiastic hosts. They will pick you up in Cusco and drive you up to the planetarium, nestled in the hills. Depending on the light and the clouds, your tour may vary, but for us we started outside, looking through two telescopes at different celestial objects the professor found: the rings of Saturn, distant moons, clusters of stars... then we went inside to get a tour of the planetarium from the English-speaking host, and a short star show. It was fascinating to learn about the ancient and modern local interpretations of the stars - such as that the Incans saw constellations in the black spaces of the milky way galaxies - and to learn more about the southern sky. It's not the biggest facility in the world, but the enthusiasm of the hosts and the charm with which they share their love of the stars is contagious. It was a special night!"
        }, 
        {
            "index": 289, 
            "rating": "5", 
            "review": "Fascinating Experience. My girlfriend and I were really glad we did this. We did it at the end of our stay in Cusco, and we both think it would have been better to do this first - it explains the alignments of several historic buildings with the solstices, the significance of the layout of Cusco itself, and is the most historically accurate view into Cusco's past I encountered while there (some tour guides you'll come across there will be weaving their own stories). Since I had heard it all by the end of our trip and I like to challenge guides out of curiosity and to gauge credibility, I have to admit I was really impressed with the professor's knowledge. It would have been a great foundation for the rest of our visits in the Cusco area.We wished we had called earlier (we called the penultimate night) so that we could have been there on a clearer night and with a group (instead of individually since it's a lot less money), so don't make the same mistake we did there. Honestly, if it hasn't become clear already, this place was an afterthought for us, but we wish we had made it one of our targets from day one!"
        }, 
        {
            "index": 290, 
            "rating": "5", 
            "review": "What a treat!. We were lucky to have a clear night. We were able to gaze at several features in the sky, so different from what you'd see here in the US."
        }, 
        {
            "index": 291, 
            "rating": "5", 
            "review": "fascinating and beautiful!. great combination of inca history and star gazing, without being too long or expensive. Highlight was seeing the rings on saturn and learning about Inca astronomy and how it influenced the city of cusco and their places of worship. A great alternative to a night out in cusco and perfect before heading to macchu picchu!!"
        }, 
        {
            "index": 292, 
            "rating": "4", 
            "review": "GREAT FUN. Great introduction to the stars of the Southern Hemisphere as well as astronomy of the Incas. The guides (English and Spanish) are friendly, well informed and enthusiastic to share their knowledge. We wish we had gone out before we did the Inca trail. A great alternative night out in Cusco."
        }, 
        {
            "index": 293, 
            "rating": "5", 
            "review": "Brilliant thing to do on a cusco evening. This was a fantastic experience and very educational. Not only do you star gaze (we saw saturn and its rings) but you get a lesson comparing inca astrology to what know/believe today. Who would have thought cusco was built to align with the sun and that the incas could reliably predict el niño from the stars. fascinating and well worth the money. Take warm clothes as it gets very cold outside!"
        }, 
        {
            "index": 294, 
            "rating": "5", 
            "review": "A must see!. The planetarium far exceeded our expectations. They were very accommodating with our schedule and were so passionate about their work. My fiancé and I are novice stargazers, but the staff at the planetarium met us at our level of understanding. Not only did we learn about the night sky of the southern hemisphere, but we learned so much about Incan history and culture. This is an amazing value and a must see if you have a free evenin in cusco!"
        }, 
        {
            "index": 295, 
            "rating": "5", 
            "review": "A wonderful insight into Inca sky. This a very fascinating experience. The planetarium is modest but very well organized and wonderfully run.The stories, history, architecture of the Inca astronomy are amazing.The tour was very personal and our guide Ana Maria very knowledgable. We got to see Saturn and it's rings.Don't miss out on this experience!My advise though bring layers and hats it gets cold."
        }, 
        {
            "index": 296, 
            "rating": "5", 
            "review": "A very unique experience!. This is a one-of a kind experience in Cusco that I definitely recommend! You learn so much about the theories and constellations. And the dome with the simulated display of constellations is fascinating!"
        }, 
        {
            "index": 297, 
            "rating": "5", 
            "review": "A stellar evening.. This is a fantastic way to spend an evening in Cusco. We were blessed with clear skies and so after a tour of the Planetarium inside, where clever displays show the ancient methods of stargazing, we were taken outside and treated to a quick tour of the star systems available to us that night. Then we looked through the telescope at parts of the Solar System, before returning inside for the actual Planetarium show. The Plantarium is a family run enterprise and as well as imparting to us their expert knowledge it is obvious that the people involved are there because they want to be. Their passion for the heavens is infectious. Highly recommended."
        }, 
        {
            "index": 298, 
            "rating": "5", 
            "review": "Starry Night in Cusco, Peru!. only spent 2 nights in peru. i'm glad one of them was used to experience planetarium cusco. while the explanations on the importance of astronomy to the Incas was interesting, the virtual display, night sky viewing of the southern constellations and especially the telescopic viewing of Saturn, Venus, jewel box star cluster, alpha centuri... were extrordinary. would highly recommend this to anyone who enjoys looking up at the stars even if only for a moment."
        }, 
        {
            "index": 299, 
            "rating": "4", 
            "review": "Nice. A short and pleasant activity for a reasonable price, certainly worth experiencing if you want to know more about the Incas' astronomy knowledge which influenced their art and way of building cities, temples etc., and above all of course if you want to discover the Southern hemisphere sky in the planetarium and outside with profesional material and thus be able to have a short but magic look at, among others, Saturn and its rings, Venus, the Southern Cross, or the mountains and valleys of the... Moon."
        }, 
        {
            "index": 300, 
            "rating": "5", 
            "review": "Wonderful experience ~ Highly recommended to Astronomy enthusiasts. If you love stars, you have to go there ~ pick up/drop off from hotel. Dr. Erwin and team are true enthusiasts with big hearts in promoting the rich cultural and astronomical ties within Cusco. Go check it out before all the light pollution \"invades\" Cusco. With the unique location of Cusco, can see 80% of the sky ! They are a private organization striving to preserve the culture ~ Excellent work Ana Maria, Roberto & Dr. Erwin ~ Please keep up the good work !"
        }, 
        {
            "index": 301, 
            "rating": "5", 
            "review": "not to be missed. This one one of the hightlights of our trip. My daughter who teaches high school astronomy said that the history of Inca astronomy was wonderful. THe staff were friendly, knowledgeable. Because you are over 10,000 feet high there is so little atomsphere that the images of the plantes, Ring nebula, star clusters and other sky objects was amazing. We were part of a group but flt as if we had an individual tour. The Professor of Astronomy is a charming gentleman who answered all questions in a kind, intelligent manner. Not to be missed. If I return to Cusco I will be back with this wonderful group. Finally this is one of the few times when the price was really too low for all of the value Paul Hart"
        }, 
        {
            "index": 302, 
            "rating": "5", 
            "review": "Astronomically Amazing. Planetarium Cusco was beyond a great and relaxed experience. Ana Maria was a lot of help reserving time to show us around. It included Transportation to and from the sight and wonderful descriptions of Astronomy in Peru and in general. The most interesting part was the Inca Astronomy information that they provided. Definitely a must see sight. Breath taking views of the night sky. Suitable for all ages."
        }, 
        {
            "index": 303, 
            "rating": "4", 
            "review": "A wonderful night at the Cusco Planetarium. The Cusco Planetarium is a unique and fantastic opportunity for visitors to Peru. Visits are arranged by individual appointment. They include transportation to the site and begin around 6:30 pm. The facility is located on the hillside over looking the city or Cusco, Peru. It is small and informal but the exhibits and presentations are professionally done. Information is in English and Spanish and is suitable for Adults and for children. The typical presentation covers general astronomy, the Southern night sky, and the Astronomy of the Incas. It involves a brief lecture, two presentations in an intimate but high-quality planetarium, and then live outdoor star-gazing. The staff is very knowlegeable and informative. They can answer any questions you may have and tailor the experience to your interests. Dress warmly and expect to have a good time."
        }, 
        {
            "index": 304, 
            "rating": "5", 
            "review": "one of the best things we did in Cusco. We found out about this place from a lonely planet recommendation and were fortunate that the owners could arrange a spur-of-the-moment group visit the night before we left on the Inca Trail. Though it doesn't explicitly say on the website, you can book visits most any day, so just send them an email. We had no disappointments, it was reasonably priced and lots of fun.This is a locally-inspired venture by a friendly guide and an astronomy professor who is absolutely enamored with the sky, and makes you feel that way too as you learn the constellations of the southern skies through a telescope on the outskirts of cusco. Genuine oohs and aahs galore!If you're in town for more than 2 days, I would not miss this one."
        }, 
        {
            "index": 305, 
            "rating": "5", 
            "review": "Excellent - recommended. My husband and I visited this planetarium in March 2010. We had a great time! The visit was very entertaining and educational. They picked us up in front of our hotel and drove us to the planetarium (very close to Cusco) and back again. The tour was in English. We really recommend this activity!!"
        }, 
        {
            "index": 306, 
            "rating": "5", 
            "review": "Cusco Planetarium. When I was planning a trip to Peru last November with my family I tried to find an observatory but had no luck. Having never been to the southern hemisphere, I thought it would be interesting to take a look at some of the southern hemisphere's sky objects. Fortunately, I found out about the Cusco Planetarium just before we left. I contacted them and they agreed to meet us at our hotel in Cusco and take us to the planetarium. This was the night before we were heading out to Machu Picchu.The planetarum is located at the edge of town within a small ecological reserve. They picked us up at 5:30, and we arrived 10 minutes later. We went in and Ana Maria provided a 15 minute lecture (in English!) of the southern sky and its relation to Inca culture. This was very good and I recommend it to anyone prior to going to Machu Picchu. You will understand the astronomical objects and features of the site better.We then went into the planetarium. Ana Maria was joined by her father (the astronomer brains) and they pointed out the Southern Cross and other constellations, as well as Alpha Centauri (the closest star to earth after the sun), and other objects. They discussed their meaning to local cultures. We spent about a half hour there.Then we went outside just as the space station flew by, which was cool. They provided hot drinks and kept a wood stove burning to keep us warm (it gets surprisingly cold in Cusco at night because of its elevation) as we looked at several constellations and other objects with the naked eye to get oriented. Then they pulled out an 8\" reflecting telescope and we looked at several features - the Jewel Box cluster (the prettiest object I've ever viewed through a telescope), Saturn with two of its moons, a variety of other open and closed clusters, and a binary star. They then drove us back to our hotel by 7:30.I highly recommend the planetarium. It is not the typical \"touristy\" fare. You will see a real slice of Cusco, get a concise lecture on the southern sky and what it meant to earlier cultures, and see beautiful objects that you can never see in the northern hemisphere. The price is very reasonable, too. My only regret is that I did not try and talk them into pulling out the 14\" Celestron reflecting telescope I spied by one of the exhibits to take a look at some deep space objects, but maybe next time.This tour is appropriate for kids of all ages and will please non-astronomers as well as astronomers unfamiliar with the southern hemisphere sky. My boys (12 and 10), and my wife both enjoyed it as much as I did."
        }
    ]
}