{
    "category": "Cusco", 
    "entity": "San-Blas", 
    "avg_rating_stars": 4.392663043478261, 
    "review_count": 736, 
    "rating_stats": {
        "poor": 3, 
        "average": 74, 
        "terrible": 2, 
        "very_good": 282, 
        "excellent": 375
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "4", 
            "review": "Beautiful neighborhood for a stroll. We stayed close so we took morning strolls through San Blas and loved how charming it felt. Be ready for stairs. But no one is in a hurry so it's a good place if you want a slower place than the Plaza de Armas area. Only took one star away because we couldn't find anywhere to sit and have a cup of coffee."
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "Get to know the other Cusco. We walked our way through this neighborhood and was a very nice afternoon to stroll around these small houses and streets in Cusco. Go there to see the other side of Cusco!"
        }, 
        {
            "index": 3, 
            "rating": "4", 
            "review": "San Blas, a network of picturesque alleys. San Blas is one of the oldest neighborhoods in Cusco. Its original inhabitants were the Incas, who wove a network of picturesque alleys full of stairs. Cars can barely move in that landscape, that makes it not advisable to carry suitcases.It is remarkable the small church of San Blas, which contains its own treasure: the pulpit, carved in wood, most beautiful in the world."
        }, 
        {
            "index": 4, 
            "rating": "4", 
            "review": "The place to wander and buy stuff. If in Cuzco you need to go and see this area (take the road to the left of the main cathedral in Plaza des Armas and head up the hill). There are roads and alleys, shops and courtyards full of alpaca, baby alpaca, art, souvenirs, maps and lots more besides. You can wander around and if you want baby alpaca scarfs or throws, then this is the place to get them - do not wait until you get to Lima, as they have very little and it is more expensive. There are also some great restaurants and bars."
        }, 
        {
            "index": 5, 
            "rating": "5", 
            "review": "Lovely area of Cusco . I stayed in San Blas and didn't leave. I thought the stone streets and old buildings and beautiful views made the area absolutely charming. I felt safe walking around alone day and night. There were lots of great stores and restaurants. Visiting the markets were fun. I was there on a Sunday when the museums were closed so wasn't able to do that. I visited many of the churches and plazas which were lovely. It was fun just wandering around. I highly recommend staying and spending time here."
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "Most beautiful part of Cusco. San Blas is the most beautiful region of Cusco! Lot of fun coffee shops and restaurants. Check it out!"
        }, 
        {
            "index": 7, 
            "rating": "4", 
            "review": "Lots of handcraft shops. Around here you will find...lots of handcraft shops hidden in a narrow streets and a hole in a wall.There are local women dress in typical dress and carry baby alpaca waiting to take picture with you at the price of 1 sol"
        }, 
        {
            "index": 8, 
            "rating": "5", 
            "review": "Nice traditional area. Almost at the top of the town an old square lined with small shops and cafes. You get s good view over Cusco from here. There are a lot of locals selling hand made textiles but they aren't pushy and don't really bother you, is is a good area just to stroll around and is the center for pottery"
        }, 
        {
            "index": 9, 
            "rating": "3", 
            "review": "Nice walk with.... .....interesting shops. The San Blas Square had vendors and was fun. We had been told that the architecture was interesting, but we did not find any of that."
        }, 
        {
            "index": 10, 
            "rating": "5", 
            "review": "Perfect for all. I read a ton of reviews before coming here. A lot said to take a taxi to the top because it was too steep? Ok, it is seriously one block of steepness, not an issue unless you are ninety with a bum knee... We went to Peru with out two toddlers (a story in itself) and they both marched up that hill no problem. Besides the fact that there are shops all along the way up...so plenty of places to rest if you had to. We loved San Blas and next time I would love to spend more time there just drinking at a local cafe. Beautiful for all. So no taxi, or you will miss all the shops and all the fun."
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "This is a Great place to stay too in Cusco.....but Lots of steps...Lots. Cool neighborhood in Cusco, great restaurants and small inns. Very affordable area, safe and walkable. But Lots of steps. So when you go down to the main part of Cusco, you have a really good walk up coming back. But Cusco is very up and down period, so not so important. I really liked the neighborhood and did some shopping there. Fine quality you just have to look for it. Mostly tourist trinkets, but some really good stuff if you look. A little more of a hippy area, but very nice to visit and I would not miss it."
        }, 
        {
            "index": 12, 
            "rating": "4", 
            "review": "Hill climb = great view. Seems like the hill weeded out some of the tourists. Great area to explore. Narrow streets, artists and shopping."
        }, 
        {
            "index": 13, 
            "rating": "5", 
            "review": "Great neighborhood. I stayed in the San Blas area of Cusco while on vacation. It was a cute area and very close to the Plaza de Armas. We never had to take taxis anywhere in Cusco because of the convenient location. There were also a lot of great restaurants in this area (Incanto, Don Tomas, Pachapapa, etc). We were also able to walk to Sacsayhuaman from here (little bit of a hike, but definitely doable). I recommend staying at Orquidea hostel in this area (very cute hostel, clean, wonderful staff, and cheap..it felt more like a bed & breakfast than a hostel). If you're looking for a hotel instead of a hostel, there is a Marriott there too."
        }, 
        {
            "index": 14, 
            "rating": "4", 
            "review": "The best part of San Blas!. Pachupapa right across the street. There are nice locally produced products in the area. My wife loved Pachu papa, where she was able to have guinea pig. She thoroughly enjoyed it. i have an calzone which was very good, though not excellent. Also, the local beer is actually very good. We had wonderful seats in the courtyard, though those seats will not work if it is raining!"
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "Best square to read a book. Amazing location, doesn't attract a lot of people because it is up on a hill but I loved it. Very calm and serene. Could sit here all day on a bench, reading a book and watching people go by"
        }, 
        {
            "index": 16, 
            "rating": "4", 
            "review": "lovely artisan area of cusco. just wander round at your leisure, look at local craft and do not miss the covered Mercado de San Blas: sit down and take a fruit juice with a gorgeous omelette."
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "Fun and lively. Nice to wander the streets of art galleries and cafes. It is full of life and colour, and is up on a hill. Be careful in the narrow streets."
        }, 
        {
            "index": 18, 
            "rating": "5", 
            "review": "Beautiful square in cuzco. One one side is a church and on the other is a line of quaint shops and a chocolate museum. Its a beautiful place to relax during the evening or early morning, because the midday sun is very hot! There's also a beautiful water fountain and at the top of that fountain, you can get a beautiful view of Cusco."
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "Great views from Cuzco at one of its most beautiful neighborhoods. This is a great place to visit if you want to enjoy the sunset and Cusco at night, there are many restaurants, bars to enjoy. This is also the neighborhood where you can find work from well known artisans from Cuzco. Take your time to go there, be careful with the altitude as you need to walk many stairs up."
        }, 
        {
            "index": 20, 
            "rating": "2", 
            "review": "Thought would be Artistic....Didn’t meet our expectations. Thought this area would be so cool but was disappointed....a few art shops but to my disappointment, it largely had the same touristy shops as elsewhere with very other shops on the artsy side."
        }, 
        {
            "index": 21, 
            "rating": "4", 
            "review": "Nice neighbourhood. Away from all the hustle at Plaza De Armas just a short walk past the cathedral, quiet cobblestone streets, no cars and little shops."
        }, 
        {
            "index": 22, 
            "rating": "5", 
            "review": "Nice \"barrio\". Nice to stroll around and eat or drink something. It's a little bit above from the plaza de armas, but within walking distance. Quiet neighbourhood, also if staying in a hotel there."
        }, 
        {
            "index": 23, 
            "rating": "5", 
            "review": "Pretty and lovely views! . A really pretty and quaint area of cusco. Lovely narrow streets to wander around. As you walk higher up you can get beautiful views of Cusco."
        }, 
        {
            "index": 24, 
            "rating": "4", 
            "review": "bohemian area?. This area is frequented by artists and artisans. Nice shops with local handicrafts and textiles. Jewelry shops also."
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "If you're in Cusco, stay in San Blas. We were so happy to be in San Blas and not in Cusco! Cusco was overcrowded and overwhelming. San Blas is a tiny neighborhood with small walking streets that wrap around the plaza, lined with delicious restaurants, boutique shops, yoga studios, and cafes. It was the perfect place to be! Don't miss it!!"
        }, 
        {
            "index": 26, 
            "rating": "4", 
            "review": "The other side of Cusco. Maybe it's me, but Cusco city centre seems very polished and cultivated for a Latin American city. If you agree, please don't miss out on this area. You can stroll around nice little twisty roads where you are surrounded by more alternative bars, hostels and shops. Best thing is that people actually live here and you can get a notion of their lives and daily business. It takes a climb, but it's worth it!"
        }, 
        {
            "index": 27, 
            "rating": "5", 
            "review": "Beautiful district with lots of galleries and very narrow streets.. Heard a lot about this Art district in Cusco and so finally went there. Its walking distance from the Main square, Plaza der armas. The narrow and up the slope streets lead to this district. On the way there are lot of street vendors selling handmade bands, chains, lockets etc. The main square of this district has markets and also around this district lots of markets selling the art stuff. The prices might be expensive here than other places. Walked around on the narrow streets and checked some galleries. Its a nice place with charm."
        }, 
        {
            "index": 28, 
            "rating": "4", 
            "review": "Fun Area to Explore. In Cusco, have a quick look at the Plaza de Armas and then head for San Blas. The small streets are fun to explore with all of their small shops, restaurants and bars. I much, much preferred finding places to eat here and wished I'd had time to explore a little more."
        }, 
        {
            "index": 29, 
            "rating": "4", 
            "review": "A wonderful part of Cusco. San Blas is an atmospheric and picturesque neighborhood in Cusco with limited traffic, blue doorways and quaint cobble streets. It is a short but steep walk from the Plaza de Armas which you need to bear in mind if you just arrived (higher altitude). It is full of little shops of local crafts, clothing, jewelry, art, and items made from alpaca as well as lots of street sellers.I've visited it a number of times and always love it with its benches by the fountain as well as the beautiful San Blas Church."
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Upscale Cusco neighborhood. We visited the San Blas neighborhood several times while in Cusco. You have to climb steep stairs to get to it. This is easier to do after you are used to the altitude a bit. There are shops all along the climb as well as great examples of Inca stone work. We ate at a restaurant called Pacchapappas (not sure of the spelling) - great food - don't miss the brownie dessert - we had to go back twice to have this."
        }, 
        {
            "index": 31, 
            "rating": "4", 
            "review": "Quaint plaza with shops and vendors. Cute plaza area with the best souvenirs I picked up throughout my Peru trip. Make sure to visit the vendor that makes guinea pig and alpaca figures from alpaca fur! There are many persistent street vendors that will ask you to purchase their goods, so be prepared to only buy items you really want!"
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "We spent 3 Days in San Blas and loved it. Prior to coming to Cusco I searched many different types areas for accommodation. I am very happy to choose this area. Like others have said it is full of little shops of local crafts, Jewellery, art, everything made from alpaca and street sellers as well. There is a lot to see here and well worth paying a 5 sols taxi fare to get up the hill to wander around at your leisure. Great area for food as well with small shops selling English books, Stamps, Bakery, water , snacks. It's all in San Blas for sure."
        }, 
        {
            "index": 33, 
            "rating": "4", 
            "review": "Quiet place at the hill above Cuzco. This is a nice area of Cuzco, with an interesting church, with benches to relax at a fountain , the Coca Museum and good restaurants."
        }, 
        {
            "index": 34, 
            "rating": "4", 
            "review": "Nice part of the city. San Blas is one part of the Cusco city. To go there you have to walk a little, because the area is a little higher than the Plaza de Armas, so its not very easy to climb, but has a lot of nice places and cafes, so is a nice place to go if you are in Cusco."
        }, 
        {
            "index": 35, 
            "rating": "4", 
            "review": "An attractive part of Cusco. Cobbled steep streets, blue doorways and Windows, limited traffic and small shops signify the area that is San Blas. Not very large - probably wander around in an hour but worth the visit."
        }, 
        {
            "index": 36, 
            "rating": "4", 
            "review": "You just have to see the Baroque Pulpit. Apparently carved out of a single piece of cedar, the pulpit is mind blowing - the carving is so intricate. Not to be missed."
        }, 
        {
            "index": 37, 
            "rating": "5", 
            "review": "Such a nice neighbourhood!. Do not miss it if you are in Cusco! Nice little streets with shops and cafes. I loved it so much! Must go!"
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "Authentic. Everything available in a short walking distance. From hand-crafted momentous to gorgeous garments to last made of alpaca at the best rate compared to mall. Delicious food at several restaurants all while taking in the local atmosphere. Something for everyone. Enjoyed a week stay and did not tire of things to see!"
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "What a find . So glad we were told to visit this area . We spent a good couple of hours ambling around the pretty streets and wondering into the art shops. Bought some good quality local souvenirs."
        }, 
        {
            "index": 40, 
            "rating": "5", 
            "review": "Great art section of the historic part of Cusco. Great art section of the historic part of Cusco. Fallen Angle restaurant is in this square. Stop in to look at the décor, but better places to eat in the area."
        }, 
        {
            "index": 41, 
            "rating": "4", 
            "review": "Arty neighbourhood. I loved this part of Cusco. Lots of arts and crafts shops. I bought more than I should have. This was my favourite part of Cusco."
        }, 
        {
            "index": 42, 
            "rating": "4", 
            "review": "Nice area with good access to rest of Cuzco . Pretty little square, nice spot with some nice buildings around and good access to elsewhere. Some locals selling wares,but much less in your face than elsewhere in Cuzco."
        }, 
        {
            "index": 43, 
            "rating": "5", 
            "review": "Must see the church. Excellent Church tour, historic. Great fountain and photo site. Go to the bell and see the view of the city"
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "beautiful square. san blas is a quiet place that's good are not as in the central square of fear that all vendors approach you also many lugarex to have coffee with free wifi."
        }, 
        {
            "index": 45, 
            "rating": "4", 
            "review": "fun. a good place to have more the feel of the locals hang out, not one where all the tour buses stop!! good if you have extra time in Cuzco"
        }, 
        {
            "index": 46, 
            "rating": "4", 
            "review": "Worth a visit. Splendid old church in a pleasant little square surrounded by a few nice boutique shops. The church inside is ornate and the best bet is to buy a ticket for five of the attractions it works out much, much cheaper no well worth it, I think about 30 solos per ticket as opposed to about 20 for just one church! The church boast a very ornate and intricately carved pulpit where you can spot the heads of anti-Catholic figure heads such as Henry Vlll and Elizabeth l.Well worth a visit!"
        }, 
        {
            "index": 47, 
            "rating": "4", 
            "review": "Nice market to shop. At the top of San Blas, is this great artisanal market. Had an exploring the stores and stalls and discovering amazinf and affordable souvenirs and clothing."
        }, 
        {
            "index": 48, 
            "rating": "3", 
            "review": "Not what I expected. San Blas is a plaza and a long street with shops. Some shops were interesting. Most not at least to me. I do have to say if you like adventure walk down the street. Narrow sidewalks - very narrow - with car whizzing by. Would I do it again? Once is probably enough."
        }, 
        {
            "index": 49, 
            "rating": "4", 
            "review": "Nice local market. Just a 10-minute walk from Central Cusco, this is a quieter, quaint version of the bigger markets, with locals sitting around, doing photo shoots, playing music."
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "tour of cusco. beautiful area of cusco. the church is gold and gorgeous, not allowed to take pictures inside, but worth the price of admission."
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "Lots to see. Don't miss the church.. We wandered around here a bit as suggested by various guides, which was interesting. We then visited the church in the square, which has a fantastic carved pulpit as well as the usual array of statues and paintings. We were then invited to go up the bell tower, which wasn't mentioned in the guide book. Not for the infirm, but a great view over the city."
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "Nice area. We stayed in the San Blas area of Cusco and loved it. Lots of hotels, restaurants and shops all within walking distance. Very close to the Plaza de Armas."
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "Good shopping and nightlife. Nice trendy little shopping area with bars, restaurants and hostels. Well lit at night and a large variety of shops. Open until 2100. Only downside is it is on a hillside that always seems to go up!"
        }, 
        {
            "index": 54, 
            "rating": "5", 
            "review": "San a las Market a Must Do!. This place has such amazing and cheap lunches. Sweet sandwiches or omelettes and all sorts of delicious made to order juices! A must do!"
        }, 
        {
            "index": 55, 
            "rating": "5", 
            "review": "Quaint plaza away from the frenzy of Plaza de Armas. I love this area because it's not as crazy as the main square. Lots of artist studios and galleries line the plaza, along with many people selling their crafts. There are also many places to eat in the area. I'm staying for a month in the San Blas area and look forward to exploring the many streets around the plaza."
        }, 
        {
            "index": 56, 
            "rating": "3", 
            "review": "Shopping. San Blas is mostly about shopping. You have to walk North from the Plaza de Armas and it is a steep climb but you can rest along the way by looking in all the shops. At the top you can shop personally made items at different booths."
        }, 
        {
            "index": 57, 
            "rating": "5", 
            "review": "Super Place .Fantastic Views.. Walk Up to San Blas....a serious walk UP !!! many shops and cafés worth visiting. It's the Trendy part of Cusco with rather different choices and energies!! The view at night is fabulous as is the choice of food..especially for vegetarians! Lots of Shamanic shops and things to buy!! Enjoy and don't miss it BUT take your time....it saps the energy going up!"
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "Relaxing place - San Blas. This place has a different feel from the main square, it is a more chilled out place. We had a meal and went for coffee, Very quiet, less sellers. I would come back again!"
        }, 
        {
            "index": 59, 
            "rating": "4", 
            "review": "Cure square up the hill. A small square up the hill from the Plaza de Armas with assorted artisans selling their wares, some of which might actually be a little different from the overwhelming number of souvenir shops in town.."
        }, 
        {
            "index": 60, 
            "rating": "4", 
            "review": "great for shopping and eating. Love this spot! There are great little shops there and nice restaurants including a very nice vegan restaurant."
        }, 
        {
            "index": 61, 
            "rating": "4", 
            "review": "Pretty Little Spot. It is worth the walk to get here. Lovely little part of the city with an artistic vibe. We enjoyed it very much."
        }, 
        {
            "index": 62, 
            "rating": "4", 
            "review": "cute neighborhood. cute area of Cusco. Some small shops and restaurants are there. much quieter than the Plaza del Armas area of town."
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "Lovely neighborhood . This neighborhood of quaint narrow cobblestone streets lined with hotels, shops and restaurants makes for a nice walk.\nWe also walked through the local San Blas market, would not recommend this. It's about 1/50 the size of the San Pedro market."
        }, 
        {
            "index": 64, 
            "rating": "5", 
            "review": "AN INTERESTING AREA. The plaza San Blas area is a very interesting part of Cusco. There are many old and interesting buildings in the area. There are also a pleat hora of restaurants for every taste and budget."
        }, 
        {
            "index": 65, 
            "rating": "4", 
            "review": "Good area to stay. We stayed in San Blas on our visit to Cusco. It is very central, but still quiet at night. Only a short walk to the Plaza de Arms and other popular areas. Ther are plenty of mini markets and restaurants close by. Pick up for tours can be easily arranged to meet at the church on San Blas Plaza."
        }, 
        {
            "index": 66, 
            "rating": "4", 
            "review": "Nice square and view. It is super nice to walk around San Blas as it is not as busy as the Plaza de Armas, the cathedral is simple but with a nice view from the top."
        }, 
        {
            "index": 67, 
            "rating": "4", 
            "review": "Busy and quaint with lovely market in the square. Very pretty atmospheric little square in the bohemian district of Cusco, nice to sit and chill for a while, with a lovely little market, quirky shops, cafes and restaurants."
        }, 
        {
            "index": 68, 
            "rating": "3", 
            "review": "Beautiful part of town. Great area of Cuzco, somewhat annoying are the narrow Streets. Cars don't leave any room left for pedestrians!"
        }, 
        {
            "index": 69, 
            "rating": "3", 
            "review": "It was ok, good for souvenirs.. This was billed as a bohemian location. Didn't really come across as particularly hippish ( is that a word?). It had good souvenirs a nice fountain/waterfall, and a neat plaza but it wasn't anything particularly special."
        }, 
        {
            "index": 70, 
            "rating": "4", 
            "review": "Cute plaza, narrow streets. Narrow streets with little shops and good restaurants. The plaza is quiet and had a local vibe. Worth the walk up from Plaza de Armas. Lots of lodging options too."
        }, 
        {
            "index": 71, 
            "rating": "5", 
            "review": "Pretty area, nice stores. Nice to walk around and look at low-end and high-end stores. There are good restaurants too. The square is small and usually has street salespeople."
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "Lots of Shopping. Narrow streets, lots to observe and snap photos of. Great shopping, prices appeared to be less expensive than in the main tourist area (Plaza de Armas)"
        }, 
        {
            "index": 73, 
            "rating": "3", 
            "review": "I don't get it. Nothing special.. Went there expecting a nice shopping district. Didn't see much noteworthy, there's a little square that isn't much more impressive than any other square in town. Shops were nothing special. I wouldn't bother going out of your way. Check out San Pedro market instead."
        }, 
        {
            "index": 74, 
            "rating": "4", 
            "review": "Peaceful Plaza. Plaza San Blas was such a quiet and peaceful place. It is a definite stop if you are visiting Cusco for a few days. There is not too much to see here, but if you just want to get away from the city center for a bit and see some great views, then this is the place to go. We went during the day right before our flight and loved it. I heard that if you go during the night it is a totally different experience than the day."
        }, 
        {
            "index": 75, 
            "rating": "4", 
            "review": "Nice cosy place. Much more cosy than the main square. There is a small market and some people playing music. It is also a nice view on the city."
        }, 
        {
            "index": 76, 
            "rating": "5", 
            "review": "Nice place to relax. I went to San Blas with my husband and two kids (ages 7 and 5). We had a nice, quiet and relaxing time sitting in San Blas main square and watching the water fountain. There is also a nice and very old church next to the plaza that is worth the visit. During the day time there are also a lot of artesans with nice things to see and buy. San Blas plaza is only a short 3 block walk to the Cuzco main plaza. On your walk to the main plaza there are a lot of local art stores with amazing cuzquenian paintings. The 12 angle stone is also near back. Highly recommend this place."
        }, 
        {
            "index": 77, 
            "rating": "4", 
            "review": "A Very Famous Tourist Spot and Destination. This neighborhood is one of the more popular destinations due to the myriad activities and services available for the curious tourist. The entire area has narrow cobbled streets, adobe structure and Inca Stone walls, a magical place that offers music, arts, handicrafts, cuisine, jewelry, pottery, carving and various crafts. San Blas is very near the Main Square (about four blocks). You can find a sitting spot and “people watch” or walk around and get entertained by the items mentioned here."
        }, 
        {
            "index": 78, 
            "rating": "3", 
            "review": "Peaceful, not over crowded.. This was not far from the hotel I was at but it is a smaller plaza and not quite the attraction the Plaza de Armas is. However I did find it was a nice place to sit down and recover from the walk up the hill after the visit to the Plaza the Armas."
        }, 
        {
            "index": 79, 
            "rating": "5", 
            "review": "Great area . Beautiful area. Not far from central square. Great shopping and restaurants. Just be careful of narrow walkways and uneven steps."
        }, 
        {
            "index": 80, 
            "rating": "5", 
            "review": "Very artistic view. There are plenty of stairs you have to climb, but it is very nice. It gives you a very nice view of the city."
        }, 
        {
            "index": 81, 
            "rating": "4", 
            "review": "Loved the markets! Realy enjoyed San Blas! Must do in Cusco!. We visited the plaza of San Blas mainly for the markets and weren’t disappointed! Quite a few unique handmade things here, which I haven’t seen at the other markets. It is not a huge plaza but much more laid back than Plaza de Armas, giving it a really authentic Peruvian feel. You can almost imagine yourself sitting here on a Sunday afternoon, sipping on coca tea while the world goes by! I recommend visiting the Coca museum on the plaza. I can’t remember the entry fee but it was really something very insignificant and it was extremely interesting! We just stumbled upon it and I’m glad we stepped inside. The narrow cobbled lane with beautiful original Inkan stone walls, leading up to to San Blas Plaza is very pretty and lined with various little shops selling interesting things and very cheap souvenirs! This is also where you will find the very famous Inka Man who will pose for a photo with you (for a propina, of course)! Also along the way to San Blas, you will come across quite a few traditional old women with baby llamas or little kids in traditional dress who want you to pose for a photo with them (once again, for a propina!) Careful, the women will shove the llama into our hands and then be very upset if you don’t give her money for the privilege. This is a nice experience to have once or twice but it becomes quite a bit annoying after a while – not so much about having to pay every time as it is only a few cents - but it’s really a nuisance how the old women – often with an unwilling child in tow - practically step in your way and become quite rude if she’s ignored. I guess tourism created this mentality so we can’t really blame them for wanting to make a living. Careful of those steps and cobblestones – through years of use, they’re shiny and slippery as hell! My feet just went out from under me and landed me on my backside on top of my camera ($580 damage!...) It was a hot day and I was wearing thongs – not a good idea! Wear something with grip on the sole if you value your tailbone!The whole San Blas area was very pretty and colorful! Many photo opportunities if that’s your thing! I would allow a whole afternoon for this as rushing through would defeat the object. Really enjoyed the whole experience! Definitely a must do in Cusco!"
        }, 
        {
            "index": 82, 
            "rating": "4", 
            "review": "Nice town. Nice town in Cusco. Very arty, with lots of arts and crafts shops. You could spend all day here browsing."
        }, 
        {
            "index": 83, 
            "rating": "3", 
            "review": "Small but warm square. A small square with good shops of ceramics and museuns. There is possible to see the fountain and de Museum of Coca. Place to take a break."
        }, 
        {
            "index": 84, 
            "rating": "5", 
            "review": "Wonderful area to stay and to explore. Our hotel was in San Blas and I was glad we decided to stay here. Even though we loved the central historical area, it's quite lively and not too quiet. San Blas is so pretty with its narrow, cobbled streets and character-laden buildings, which include hotels, restaurants, artist studios, and various shops and businesses. It's quite a hilly area so if you have bad knees or have trouble with the altitude, this can be a tough place to get around in. We had been at altitude for over a week by the time we got to Cusco, and it was always a bit tough walking back to our San Blas hotel at the end of the day. I had to take it slow. It's not far from the central square so it's convenient while being away from the hustle and bustle."
        }, 
        {
            "index": 85, 
            "rating": "1", 
            "review": "Beware - Shady Practices (Cuidado). I had accidently booked one evening at this hotel on Booking.com when I was planning to spend 2 nights in Cusco - when I went back to booking the hotel had no availability... i immediately requested to cancel the reservation because of the error and the lack of availability for the second night... Booking responded that it was at the hotel's discretion and had not approved. I proceeded to call the hotel to explain the situation and they were as unsympathetic as you could imagine.. there was response was that it did not matter because their hotel policy was their hotel policy. I asked to speak with the manager and they said he was unavailable but would return my call - which never happened.Anyway so I tried to dispute the charge through my credit card and the hotel basically said that i never notified them and sent a no show receipt to the credit card company basically to say that I made the reservation and never showed up.Beware of this hotel - as these are clearly shady practices. You would think that the base of their money is made from tourism that they would have a little bit more tact and a higher level of customer service."
        }, 
        {
            "index": 86, 
            "rating": "5", 
            "review": "Fresh old area of town. San Blas area is perfect for walks, little shopping or it's lovely hotels; it's just a few steps away from Praza de Armas"
        }, 
        {
            "index": 87, 
            "rating": "4", 
            "review": "Go on Saturday for the Artisan Market. A bit of an uphill walk from Plaza de Armas takes you to this somewhat arty and bohemian quarter of Cusco. On Saturdays, the square next to the San Blas church hosts an artisan market - vendors selling pottery, knits, bags, silver, artwork. A great place to pick up souvenirs."
        }, 
        {
            "index": 88, 
            "rating": "5", 
            "review": "Much calmer than the plaza de Armas . I have really enjoyed spending time in the plaza San Blas and surrounding area. It is much calmer and smaller than the Plaza de Armas, but still really close to the action."
        }, 
        {
            "index": 89, 
            "rating": "4", 
            "review": "Just like home. These stone alleys could be anywhere in europe. With ex pats from all over selling you hand made trinkets, offering you yoga classes, or some western style food to look over Cusco at. Good for a free walk in the very least."
        }, 
        {
            "index": 90, 
            "rating": "5", 
            "review": "Friendly People and Super Fun Time!. I met some really fun loving and great people in San Blas, including the bars and Plaza. It's a steep walk from Cusco city center but worth it."
        }, 
        {
            "index": 91, 
            "rating": "3", 
            "review": "San \"Grass\" Blas. Full of hippies ready to sell you \"handcraft\" tchotchkes. Great place to grab food or stay while you're in Cusco. The area is safe and pretty clean. Watch out for the land mines (dog pooh) located on the sidewalk is everywhere"
        }, 
        {
            "index": 92, 
            "rating": "5", 
            "review": "Cool Area with a Great View. Artists, shops, restaurants and a view from atop the main square. Nice walk up the hill and great picture ops once you are there."
        }, 
        {
            "index": 93, 
            "rating": "3", 
            "review": "Why bother?. one of many, many plazas in Cuzco. Couple expensive shopping places and a few places to eat. Good place to rest as you trudge up hill to your hotel."
        }, 
        {
            "index": 94, 
            "rating": "5", 
            "review": "Artist section of Cuzco. We stayed at the Tika Wasi Boutique hotel, 491 Esquina 7 Angelitos. Great views and easy walking to Plaza de Armas, and the many shops and restaurants in the San Blas neighborhood. Fine art to nick nacks are available."
        }, 
        {
            "index": 95, 
            "rating": "5", 
            "review": "Beautiful. It reminded me a bit of Santorini, Greece. Beautiful white buildings with blue trip on the hillside looking over Cusco. It's a gorgeous walk from Cusco and would make an excellent day trip with Sacsayhuaman and Cristoblanco."
        }, 
        {
            "index": 96, 
            "rating": "4", 
            "review": "Nice visit. The area is central to many walking sites & good restaurants. Good place to stay while in Cusco. More artsy than elsewhere, museums, Plaza's, etc."
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "Artistic and relaxed. The cosy and at the same time busy streets of the San Blas area are definitely my favourite area of Cusco. Firstly because it seems to be one of the oldest parts of the city, remains of Inca walls in abundance. Secondly because it is a great place to be if you want to relax, just sit on the square in front of the church, enjoy life, music, the lovely and creative people. Many hidden jewels - just don't be afraid to turn round a corner, through a doorway, just enter. If you are looking for nice souvenirs and handicrafts, again, this is the place to be. Enjoy!"
        }, 
        {
            "index": 98, 
            "rating": "4", 
            "review": "Nice square adjacent to historic church in arts community. Nice square with fountain, surrounded by local craft shops and dealers. Artisans can be found making items on the square. Church charges admission to view interior. . A disappointment."
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "Delightful walking in a historical village!. San Blas is the old town portion of Cusco. It holds so much character and is just a few blocks from the main plaza. The main square has a delightful area to relax next to an amazing water feature. Sunshine abounds in San Blas and the market is one of the best places to grab a bite to eat especially prepared by the local women."
        }, 
        {
            "index": 100, 
            "rating": "5", 
            "review": "the best. visiting san blas was incredible, that place was the famous artistic location, here you can find the best musicians, art people."
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "Definitely a nice area to stay in and explore. We stayed in the San Blas area of Cusco for 5 nights and enjoyed this area very much. Many great restaurants and the area is safe anytime of the day. You can easily walk to pretty much anywhere you need to go and if you cannot, there are taxi's readily available since there are lots of stairs to climb up in this area."
        }, 
        {
            "index": 102, 
            "rating": "5", 
            "review": "Worth an afternoon's visit . A casual part of town with narrow streets, moderate traffic and lots of choices in restaurants, artisanal goods, art galleries, cafes and great views over the entire city. But be prepared for steep walks up and down uneven streets with very narrow sidewalks (or none at all). Try The Meeting Place for good cafe food, The King of Maps for the map lover in the family, Korma Sutra for good Indian food and Taco Mania for tasty Mexican food."
        }, 
        {
            "index": 103, 
            "rating": "4", 
            "review": "Marvellous Cusco. I spent one full day in Cusco and another half day, when returned from Machu-PicchuReally I feel Cusco deserves two / threee days. The basilica is a real baroque gem. My Cusco Hotel was Casa San Blas where everything is precious.The San Pedro Market was where all handcrafts are cheaper"
        }, 
        {
            "index": 104, 
            "rating": "4", 
            "review": "lots to see. the san blas sight has many historic Inca artifacts to see. I think it cost 10 sole to go and it is wort doing.. this is close to the square"
        }, 
        {
            "index": 105, 
            "rating": "4", 
            "review": "Pretty. We stopped here to visit a cafe nearby. This area has small stores, art galleries, museums, and vendors. It feels very hippy and hipster-ish. There is a church here to and its beautiful!"
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "Hip neighborhood. We stayed here during our Cusco trip and highly recommend San Blas. They have nice artisan shops, solid restaurants and cool bars. The views are super too."
        }, 
        {
            "index": 107, 
            "rating": "5", 
            "review": "During our visit to peru - 4d3n inca hike, Sacred city tour, moray, we ventured out on our own to San Blas.. We really enjoyed this area more than Plaza d armas. Fabulous place to eat called Green Point - their daily menu is only 15 soles - includes 4 courses and a drink. Fresh made bread and vegetables."
        }, 
        {
            "index": 108, 
            "rating": "4", 
            "review": "Shopping. Many store keepers and shops. Great time to just roam around this district. Make sure you negotiate with people, because you'll always get a lower price."
        }, 
        {
            "index": 109, 
            "rating": "4", 
            "review": "A bohemian place.. It is a small place to go, full of little gourmet restaurants, a nice square with an art and crafts fair. The locals sell nice handmade pictures, wool itens and silver jews. The cafes and beer houses are perfect for a rest during Cusco walk."
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "Visit with best friend, before and after Inca Trail trek to Machupicchu. San Blas is a lovely part of town. I am so glad we stayed at a hotel there rather than around Plaza les Armas. It is a short walk from Plaza les Armas, but much calmer and quieter."
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "Visit with best friend, before and after Inca Trail trek to Machupicchu. San Blas is a lovely part of town. I am so glad we stayed at a hotel there rather than around Plaza les Armas. It is a short walk from Plaza les Armas, but much calmer and quieter."
        }, 
        {
            "index": 112, 
            "rating": "4", 
            "review": "If you are into arts and crafts this is the place to go to. Nowhere on our entire 3-weeks' journey on the Altiplano did we Encounter such a splendid selection of arts and crafts and paintings at such quality and such reasonable prices as in the shops and galleries around Plazoleta de San Blas."
        }, 
        {
            "index": 113, 
            "rating": "4", 
            "review": "Cute neighborhood and plaza . I enjoyed This area of cusco. There were pushy sales people but you have that everywhere in cusco. We visited the church and enjoyed the bell tower view."
        }, 
        {
            "index": 114, 
            "rating": "3", 
            "review": "It's a fountain. Really nice little area, but only really worthwhile because it was on the way back to the place we were staying. Worth a walk-through"
        }, 
        {
            "index": 115, 
            "rating": "5", 
            "review": "Historique Center. It' s a charming place in the historic place. You have a good view, and i love the bohem atmosphere."
        }, 
        {
            "index": 116, 
            "rating": "5", 
            "review": "Handcraft quarter. You most go there and lose yourself in these streets! You will find many little shops that are selling typical handcraft in Cuzco. It's a place to enjoy!"
        }, 
        {
            "index": 117, 
            "rating": "4", 
            "review": "Quaint neighbourhood. Going up the steps to the Mirador in this neighbourhood and walking along the narrow alleys reminds me a bit of Granada, Spain. Similar narrow alleys that cars cannot go thru, with great vistas of the city. The vista point/Mirador provides a good overview of the city - we were there in the day and had a great view - wanted to come back at night to look at the lights, but the thought of climbing those steps again in high altitude dissuaded us ... but I am sure it would be a great view of the city - not sure about the stars though as there could be light pollution from the city... the Mirador has a couple of displays showing how Cusco was constructed along the lines of a puma.Walking down from the Mirador, one reaches the San Blas Plaza, where the local artisans come and sell their goods - pretty good quality and at reasonable prices (after bargaining of course). The San Blas church is here, entry ticket needed, but same ticket gets you to the main Cathedral. The San Blas church has an elaborate hand crafted pulpit - their claim to fame, and some paintings, etc.The churches in Cusco when compared against the grand churches in Europe pale in comparison but perhaps it is in this stark difference, and in the absorption of local beliefs/traditions into the Catholic imageries & decorations that makes a visit to one of these churches interesting. There are restaurants and shops around the plaza, Pachapapa being one of them where we had a good dinner one evening."
        }, 
        {
            "index": 118, 
            "rating": "5", 
            "review": "Quiet, neat, good food. Great, quiet little neighbourhood with some interesting restaurants that was out of the way from the main tourist centre."
        }, 
        {
            "index": 119, 
            "rating": "5", 
            "review": "Walking the steps up to San Blas was rewarding.. You will definitely feel the effects of the high elevation while walking up the steps, but San Blas is just too pretty and quaint to miss."
        }, 
        {
            "index": 120, 
            "rating": "4", 
            "review": "nice part of cuzco. this is a cool little are with lots of shops, restaurants and bars. well worth an afternoon walk about. Green Point vegan is close by and this was spectacular."
        }, 
        {
            "index": 121, 
            "rating": "4", 
            "review": "Little Square with a Fountain and Some Stands . We stumbled upon this square while trying to find a tour company. It's a small square with locals and tourists. There are some stands selling souvenirs in the center. Great place to take a break and people watch!"
        }, 
        {
            "index": 122, 
            "rating": "5", 
            "review": "Great little church. I recommend getting the four church tour pass. I listened to the audio tour, which was great. This audio tour was ily about 15 min but was very interesting. The walk up to the church was beautiful also."
        }, 
        {
            "index": 123, 
            "rating": "5", 
            "review": "Tiny. It's a tiny square with a fountain. You can meet plenty of hipsters there trying to sell their stuff . There are loads of coffee shops and restaurants."
        }, 
        {
            "index": 124, 
            "rating": "4", 
            "review": "Cute plaza. This plaza is not as big as plaza de armas, but still has its own beauty. There are few restaurants near the place, as well as souveniors stores."
        }, 
        {
            "index": 125, 
            "rating": "5", 
            "review": "Nice mood. Very peaceful place. This place is located behind plaza de armas. But not very far away. Still you can reach there by foot. Anyway, fountain is beautiful, and you can check out some museums around it and restaurants too."
        }, 
        {
            "index": 126, 
            "rating": "4", 
            "review": "Overlook above San Blas. If you are in the San Blas area you may want to find one of the streets that continue to rise out of that area as there is a very nice park that overlooks Cuzco there that has several signs that highlights what you can see from there like the churches, monasteries, etc. it really is a lovely view and informational. When we found it the locals were just enjoying the park space there (maybe more free of tourists than other parks/areas?"
        }, 
        {
            "index": 127, 
            "rating": "5", 
            "review": "Unique and beautiful. Very Unique wooden decorations and beautiful paintings. Ask a taxi driver to drop you at the church first and from there it will be an easy stroll down to Plaza del Armas."
        }, 
        {
            "index": 128, 
            "rating": "5", 
            "review": "Excellent Artisan quarter. Headed to San Blas church as had bought a ticket to visit the cathedral, archbishop museum and a couple more churches. Learnt a lot about cuscan art which I found fascinating as I am studying a theology degree. It is amazing how Peruvian spirituality has been incorporated into Catholicism. Good views of Cusco from the church tower.Walk up from plaza de armas is steep and narrow with lots of interesting artisan shops. Learnt that stepping inside the shops was a great way to recover your breath. There is also more art and craft at the plaza where the church is with a beautiful fountain. Definitely worth visiting."
        }, 
        {
            "index": 129, 
            "rating": "5", 
            "review": "Fun Evening in San Blas. We had an excellent dinner at Pachapappas, did a little shopping, and enjoyed the plaza and fountains after dark. It's an easy 4 block stroll up from Plaza de Armas."
        }, 
        {
            "index": 130, 
            "rating": "4", 
            "review": "Great Shopping!. You can find really good textiles and ceramics here. The prices are higher than in the market, but so it the quality. It is also a pretty place to visit. There is also a museum you can visit if you have time."
        }, 
        {
            "index": 131, 
            "rating": "3", 
            "review": "Lots of activity on the weekend.. There are vendors set up on the weekends--always quite interesting. A great place to eat up at San Blas is The Meeting Place. They have the best waffles!! The water fountain at San Blas is pretty at night if they have the lights on. Have never been inside the church."
        }, 
        {
            "index": 132, 
            "rating": "4", 
            "review": "Lovely little place good shops. This little beauty has a fountain waterfall and lots of lovely local shops.\nPerfect for art work or grabbing a drink or even some souvenirs!\nThe coca museum is here too and worth a look for the giggle!\nNice little sun trap here. Very enjoyable"
        }, 
        {
            "index": 133, 
            "rating": "5", 
            "review": "Our favorite in Cusco. Full of retail featuring local artists and home to an outstanding museum of Inca artifacts, this was our favorite area while visiting Cusco. If you are looking for textiles and ceramics a level up from those found in the markets, San Blas should be on your list. A great area for your \"home base\" if spending a few days in Cusco."
        }, 
        {
            "index": 134, 
            "rating": "3", 
            "review": "Artist's meeting place. Full of little artists stores, handcrafts, recommended for interested tourists. We were lloking for paintings and wood frames, they were very nice."
        }, 
        {
            "index": 135, 
            "rating": "4", 
            "review": "Nice square. The square is adjacent to the San Blas Church, on the higher section of the same name neighborhood located on the hill behind Cusco's Cathedral. There is a large fountain, a day handcrafts market and many shops and restaurants."
        }, 
        {
            "index": 136, 
            "rating": "5", 
            "review": "A nice neighborhood behind the Cathedral of Cusco. This old neighborhood is accessible from steeped cobbled stone streets ob both sides of the Cathedral of Cusco. It is famous for the large number of artists and artisans that live there and the many small shop where you can buy paintings in the unique Cusco style, plus a variety of handcrafts. There are also some large and most luxurious hotels, as well as dozens of smaller simpler ones and hostels, plus many informal restaurants. The neighborhood is on a hillside, only a few hundred meters from the main square of Cusco. The San Blas Church at the top is worth visiting also."
        }, 
        {
            "index": 137, 
            "rating": "5", 
            "review": "Definitely worth seeing. It's a steep hike from the Plaza de Armas (main plaza), but a must see as this is really very typical of Cusco. Surrounded by old houses and the the Iglesias San Blas, it is almost traffic free which is also nice."
        }, 
        {
            "index": 138, 
            "rating": "5", 
            "review": "Nice area to use as a base in Cusco. We were really happy we chose to base ourselves on Tandapata in the San Blas area - this square and the locals produce market were highlights but it's also a great location for exploring the historical center and the sites on the hills above town."
        }, 
        {
            "index": 139, 
            "rating": "5", 
            "review": "Great base for exploring Cusco. When we were looking at AirBnB places for our Cusco stay, we only looked in San Blas and loved using it as our base. We could walk down to the historical center, explore San Blas including the nice locals' produce market, and walk up to Sacsayhuaman and Cristo Blanco. Recommended!"
        }, 
        {
            "index": 140, 
            "rating": "4", 
            "review": "Fun neighborhood. Great area to walk around in. Lots of shops and little restaurants. The streets are very narrow and cobblestone so wear comfortable shoes. The buildings have inca foundations and you can see the original walls. Great place to take pictures."
        }, 
        {
            "index": 141, 
            "rating": "4", 
            "review": "A quiet neighborhood in the hectic city. We stayed at the Casa Andina San Blas while there and enjoyed the neighborhood. It's such a laid back part of Cusco and definitely worth a visit. It's set on a hill and offers amazing views of Plaza de Armas."
        }, 
        {
            "index": 142, 
            "rating": "4", 
            "review": "Lovely neighborhood in Cusco. Definitely worth a morning or an afternoon just wandering around. The church is spectacular. Lots of shops and a handful of places to grab a bite if you get hungry. Don't miss it when you arsenic Cusco - it's an easy walk from the Plaza de Armas and well worth whiling away part of a day there."
        }, 
        {
            "index": 143, 
            "rating": "4", 
            "review": "Pretty nice with a market and church. A short but inclined walk from the Plaza de Armas this plaza has a small market with of handicrafts and souvenirs. Walking around it is a pleasure for photographers as there are many small steep streets and beautiful old corners. There is also a very simple and quaint church worth visiting after seeing the extravaganza of the churches in the center of town. You can also climb to the bell tower for a great view of Cusco.There are various restaurants around the area."
        }, 
        {
            "index": 144, 
            "rating": "5", 
            "review": "Great area to explore. We enjoyed walking through this area, checking out the local life and the numerous and varied shops. The 12 sided granite rock is within this area as well."
        }, 
        {
            "index": 145, 
            "rating": "5", 
            "review": "Great little plaza. All uphill, but worth the walk to this quaint little plaza. There is shopping, restaurants, and a beautiful little church."
        }, 
        {
            "index": 146, 
            "rating": "5", 
            "review": "Chilled side of Cusco. Just a few minutes walk up the hill from the plaza de armas you will find San Blas plaza, where there will be live music, chilled bars, hand crafted goods, good cheap food, lots of veggie/vegan options. Nice spot to get away from the hustle of the main streets"
        }, 
        {
            "index": 147, 
            "rating": "5", 
            "review": "Quaint neighborhood. This is a beautiful quaint neighborhood, with tiny cobblestoned streets and alleys, and even an Inca wall. There are many shops and restaurants. It is uphill to get to the main square!"
        }, 
        {
            "index": 148, 
            "rating": "4", 
            "review": "Small market here in the morning. Small vendors out in the open air here. Nice little square where we picked up small items for the grand kids."
        }, 
        {
            "index": 149, 
            "rating": "5", 
            "review": "Best neighbourhood in Cusco. this is a nice place to stay, quiet, no traffic, and with plenty of restaurants around, only 10 min walk form Plaza de Armas"
        }, 
        {
            "index": 150, 
            "rating": "5", 
            "review": "Favorite neighborhhod. This is the artsy bohemian section of Cusco. It's situated on the side of a hill and the narrow cobblestoned alleys are a delight to explore. Lots of small shops selling art, textiles and jewelry. "
        }, 
        {
            "index": 151, 
            "rating": "5", 
            "review": "A must. . Staying in cusco for a month in many different locations. San blast is a must. Beautiful coffee, amazing restaurants especially if your a vegetarian. Peaceful and quite and only a 5 min walk to all the bars in the plaza."
        }, 
        {
            "index": 152, 
            "rating": "4", 
            "review": "Bus up, walk down!. Get a bus to the top and walk down, enjoying the atmosphere of this part of the city. Shops and restaurants to stop at. Go to the local market to see how the Peruvians shop."
        }, 
        {
            "index": 153, 
            "rating": "4", 
            "review": "Fun Area, Tons of Shops. The San Blas area of Cusco is one of the oldest in the city and is full of a ton of fantastic shops and the beautiful San Blas Church. Also has duds like the Twelve Angle Stone. Worth the time to wander around drink in."
        }, 
        {
            "index": 154, 
            "rating": "5", 
            "review": "Nice change from Plaza de Armas. We stayed in San Blas and really enjoyed it. There are unique and interesting restaurants on quiet, cute, winding streets. There are lots of artisans and shops but not the hard sell you get around Plaza de Armas. The church is pretty and the entry cost is included in the religious site ticket you can purchase. On the weekends, there is a market in the plaza next to the church. The waterfall in the church plaza is really pretty."
        }, 
        {
            "index": 155, 
            "rating": "4", 
            "review": "Worth A Look. Our Hotel (Illa Hotel) was 200 feet from the San Blas Plaza and church, and right in the middle of this quaint neighborhood with its narrow cobbled stone streets. San Blas has lots and lots and lots of shops, and, depending on your shopping mood, it can take you.literally over an hours to make the 2-3 block walk down the street to Plaza de Armas. It also has a whole array of restaurants to choose from, We enjoyed our Hotel and this neighborhood immensely."
        }, 
        {
            "index": 156, 
            "rating": "4", 
            "review": "Cool part of Cusco -- just above town and not so touristy. Also a new view of the hills in the neighborhood. Coca museum now charges but worth the fun tour. Nice places to eat and it's off the beaten path."
        }, 
        {
            "index": 157, 
            "rating": "5", 
            "review": "good walk.... I enjoyed walking through San Blas during my time in Cusco. Hope to come back again very soon to this beatiful city"
        }, 
        {
            "index": 158, 
            "rating": "3", 
            "review": "Artsy area. It was nice. Very arsty. Neat little streets but nothing that overly \"Wow'd\" us. Glad we went to check it out but don't think our trip would have been ruined if we had missed it."
        }, 
        {
            "index": 159, 
            "rating": "5", 
            "review": "Close to the Center: San Blas. Just two blocks from the Plaza de Armas, you will find a neighborhood filled with artisans. Cobbled stone narrow streets give San Blas a delightfulaccent"
        }, 
        {
            "index": 160, 
            "rating": "4", 
            "review": "NICE PLACE. My hotel wasi in sam blas is a veru good places but i litle dnagerous you have to try to bakc early tho hoteland the sundays you can find a tradicional andesn marketthe restaurant arent good but for coffe will be ok"
        }, 
        {
            "index": 161, 
            "rating": "5", 
            "review": "plazoleta. very interesting neighbourhood, hippie, many galleries, coca museum, shops and very good restaurants"
        }, 
        {
            "index": 162, 
            "rating": "5", 
            "review": "San Blas. very interesting neighbourhood, hippie, many galleries, coca museum, shops and very good restaurants"
        }, 
        {
            "index": 163, 
            "rating": "5", 
            "review": "an artist heaven. we loved to visit all the galleries and shoped about a lot of items, we didnt know what to take...its amazing"
        }, 
        {
            "index": 164, 
            "rating": "5", 
            "review": "lares trek at qoriankas style. happy to have met qorianka tours for they arranged me the lares trek....something indescriptible...and after those 5 days, a stroll by the san blas quarter is somethingh good for culturte for its neverending art galleries."
        }, 
        {
            "index": 165, 
            "rating": "5", 
            "review": "The most beautiful district in Cusco . It is a pittoresque neighborhood with narrow streets, blue white colonial houses and a lot of artists. There are a lot of galleries, interesting shops, cafe and restaurants. I loved this place and I searched for a hotel there in my second visit to Cusco."
        }, 
        {
            "index": 166, 
            "rating": "4", 
            "review": "Got historical area. Visited the area of San Blas which has one of the oldest churches in Cusco. There is a little market on the square selling local goods and there are a few bars and restaurants around. Good to visit if you like to learn about local culture. There are a few museums there and the walking tour goes there for a visit."
        }, 
        {
            "index": 167, 
            "rating": "4", 
            "review": "Hostel-y part of town with artisan wares and coffee houses. Well worth a wander around here - there are lots of souvenir stalls but also some great artisan jewellers and ceramic shops. I'm not sure how safe it would be at night to wander alone as it is a little off the beaten track. In the day time it is great - lots of coffee shops with cake and wifi."
        }, 
        {
            "index": 168, 
            "rating": "4", 
            "review": "Convienient to many hotels. My daughter and I walked around the area. Beautiful architecture, street vendors, and tiendas. There is an ATM (3 together) in a doorway on the corner"
        }, 
        {
            "index": 169, 
            "rating": "4", 
            "review": "A cool neighbourhood. San Blas is definitely the \"cool neighbourhood\" in Cusco. Full os nice small restaurants and bars it's a good place to end your day in Cusco."
        }, 
        {
            "index": 170, 
            "rating": "4", 
            "review": "Small plaza, lots of shops, and music bar. I haven't spent much time in this plaza. The time I have spent here was trying to avoid one man trying to sell me art. He was nice but then got mean and I kept refusing to buy. Other than that, the cathedral is beautiful! And it's nice to sit on the bench and listen to the water, surely not as crowded or busy at Plaza de Armes, if you want a small town feel."
        }, 
        {
            "index": 171, 
            "rating": "5", 
            "review": "Hermoso lugar. Neigborhood amazing. It has beautiful smalls streets and a lot of handicrafts. I love their streets. This place has a quite square with waterfalls bling"
        }, 
        {
            "index": 172, 
            "rating": "4", 
            "review": "Cute area of town. Loved the cobblestone roads of this area - however be careful of traffic on the narrow streets! Lots and lots of tourist shops here and nice views of the city."
        }, 
        {
            "index": 173, 
            "rating": "4", 
            "review": "Visiting Cusco. After returning from our sacred valley visit, we went at night to this artistic area, is nice to walk around, some of the little streets were derty, but many other streets in Cusco were as well, it looks as part of the culture overthere. If you have time, visit the area, there are many little restaurants and little galleries too."
        }, 
        {
            "index": 174, 
            "rating": "3", 
            "review": "Sleepy neighborhood. Much of the neighborhood seemed to be closed for business on the weekday afternoon when we visited. There seems to be a backpacker/bohemian vibe, but it was tough to get a feel for the area because the streets were largely deserted and businesses closed."
        }, 
        {
            "index": 175, 
            "rating": "3", 
            "review": "Interesting area. Hilly area. Interesting neighborhood. Enjoyed the fountain and rested in the courtyard. Passed through in earlier in the morning and there were few people."
        }, 
        {
            "index": 176, 
            "rating": "4", 
            "review": "Art, crafts and llamas in one block. That is true for a lot of Cusco, but still the artists in San Blas have an interesting conversation. The place is pretty and you can visit, for free, Museo de la Coca."
        }, 
        {
            "index": 177, 
            "rating": "4", 
            "review": "Picturesque. Very pretty boutique shops on the way, uphill walk to San Blas little tiring. Can walk around the residential area there. Very rustic and artsy decor all around. Worth the visit."
        }, 
        {
            "index": 178, 
            "rating": "4", 
            "review": "It's chilled out. There isn't much happening here. I basically chilled out in the square. A fee shops exist around the square. And some Street vendors"
        }, 
        {
            "index": 179, 
            "rating": "5", 
            "review": "Atristic Treasures Found Here. This is an art lovers' oasis in Cusco. Friends who had visited Cusco recommended Awana Wasinchis Fair Trade. What a great find. We were told that the color combinations are more subdued, because of the owner's guidance of the craftspeople. Venturing further into the area, we stopped at the pottery workshop of Galeria Arte Olave. The work is exquisitely patterned, but since we were capacity challenged for our luggage, I chose 2 tiny hand painted pots, which will become necklaces."
        }, 
        {
            "index": 180, 
            "rating": "5", 
            "review": "¡A Fantastic Day Out!. San Blas is a much better environment to walk around and really enjoy, the special exhibitions are generally really interesting, there's a lot to see and if you love art, history and tradition then San Blas is the place to be. Also, there's a lot of climbing up steep paths, with an spectacular view at night. Highly recommend a visit to this area."
        }, 
        {
            "index": 181, 
            "rating": "4", 
            "review": "some interesting things. We walked through San Blas on our way down from Sacsayhuaman--saves walking up from the main square. We were told that it was the artists neighbourhood, but we found more art type shops as we got closer to the main square. Still, we found some good places near the San Blas church. Right above the fountain there is a little shop called Sacred Silver Joyeria that is run by a nice couple. He is the jeweller, and she does the sales. Worth stopping in. Also, there is a little bakery called Pantastico here--take the time to seek them out. Great banana bread, and everything we tried was delicious. The San Blas Market is much quieter than others like San Pedro, but it was a good place to get fruit juice and sandwiches for really low prices. You can hang out with all the backpackers there. They are happy to share tips about what to get."
        }, 
        {
            "index": 182, 
            "rating": "5", 
            "review": "A VERY GOOD OPTION. good option if you want to find out the history of artisans find many craft at regular price and good if you want to escape dispatchers flyers in the central square."
        }, 
        {
            "index": 183, 
            "rating": "5", 
            "review": "A must visit! . Stroll through the tiny streets of San Blas, have a coffee or tea at L'Atelier, and pop in the local bohemian and artisan shops. San Blas is a very pleasant district in Cusco just 10 minutes walking from the central plaza and a great way to escape s little from the bustling tourist activity of the city."
        }, 
        {
            "index": 184, 
            "rating": "3", 
            "review": "Fun hike up to this neighborhood, but nothing special here to see.. The walk up to San Blas was interesting and great for acclimatization to the altitude. The fountain was pretty, but the church and shops around the plaza weren't all that interesting to us."
        }, 
        {
            "index": 185, 
            "rating": "5", 
            "review": "Live here!. I lived for one night at Garden of San Blas and I wish I could stay longer. Jesus, the owner, knew everything about Peru and arranged tours for us even when we were hiking the Inca Trail. Love the place and would like to come again!"
        }, 
        {
            "index": 186, 
            "rating": "5", 
            "review": "Charming, a \"must\" visit when you are in Cusco!. I say a \"must to visit\" because of altitude sickness I almost missed San Blas. San Blas is clearly one of Cusco's oldest neighborhoods dated around 1563. It's uphill and quite a hike and you'll sure to catch your breath but the sights, sounds, artistic picturesque area will take your breath away."
        }, 
        {
            "index": 187, 
            "rating": "3", 
            "review": "Not Much To See. There isn't much to see here. It is a nice \"tuck in\" activity while in Cusco but not a lot to do in San Blas."
        }, 
        {
            "index": 188, 
            "rating": "4", 
            "review": "Beautiful location, lots of shopping. The walk up the hill to San Blas from our hotel was short and fun. Narrow streets were cool, but be careful! Watch for cars.Tons of fun shopping. Most shop workers are willing to make a deal. Great view of the city. Loved it!"
        }, 
        {
            "index": 189, 
            "rating": "5", 
            "review": "Great area. We had a nice time roaming this area and found great shopping and found where they had and made carnival Masks !We ate at Pachapapa and it was fantastic"
        }, 
        {
            "index": 190, 
            "rating": "5", 
            "review": "Best hang-out spot in Cusco. San Blas is a gorgeous square two blocks away from la Plaza de Armas full of quaint, artisanal stalls and surrounded by cool bars and delicious culinary spots. If you find yourself there of an evening, Taco Mania (just behind the water feature) must not be missed."
        }, 
        {
            "index": 191, 
            "rating": "5", 
            "review": "Main Square. This is the main square of Cusco our hotel was just few steps close to plazoleta de san blas.. I had great time in Cusco"
        }, 
        {
            "index": 192, 
            "rating": "5", 
            "review": "Good view over Cusco. Went with our tour guide..A little out of the way worth the climb so as to see the view over Cusco.Great to walk the narrow streets and soak up the culture"
        }, 
        {
            "index": 193, 
            "rating": "5", 
            "review": "Wonderful artisian shops. We were able to find those special gifts that were not the usual touristy junk. Many items were custom made by the store owner, others by local craftsmen. Highly recommend a visit to this area."
        }, 
        {
            "index": 194, 
            "rating": "5", 
            "review": "Be prepared to climb steep roads. It was a surprise for me to find San Blas. But it turned out to be one of the highlights of my visit. There is a lot of climbing up steep paths and at night the view is spectacular."
        }, 
        {
            "index": 195, 
            "rating": "5", 
            "review": "Hidden secrets. Great place to explore all the little markets hidden behind the walls. Shopping tends to be a more expensive in this part of town so be prepared to bargain or pay that little bit extra just for being there. Home of some of the best restaurants in the city including Map Café, Cicciolinas and El Soleil . Great Museums up this end of town and some interesting artesian shops. Check out some of the boutique hotels and the Marriot for great interior design and a pisco sour."
        }, 
        {
            "index": 196, 
            "rating": "4", 
            "review": "Artists Quarter. Just a few minutes away from the historic centre. San Blas has a lot of character with narrow cobblestone streets, art galleries and old buildings. We found it to be much less crowded than the more touristy historic centre."
        }, 
        {
            "index": 197, 
            "rating": "5", 
            "review": "Arduous, but worth it.. San Blas is on a hill above the historical section of Cuzco. It has many fine restaurants and shops. The streets are impossibly narrow and the old Inca steps make you gasp. The views of the city are the best. Although there is a pizza joint on every block you still feel as though you went back in time. San Blas Plaza is always bustling with music and street life. One downside is their propensity for fireworks which are set off with astounding regularity regardless of time of night."
        }, 
        {
            "index": 198, 
            "rating": "4", 
            "review": "A unique neighbourhood. We stayed in the San Blas district where you get a sense of the history and art in this artisans area. Narrow cobblestone roads, lots of shops and restaurants and many examples of early architecture still exist."
        }, 
        {
            "index": 199, 
            "rating": "5", 
            "review": "Nice bars and restaurants with some live music. It is a lot of climbing towards the San Blas, but I have had some good meals there and a good night in a bar with live music. The climbing towards San Blas is the only thing that kept me from going there more times. Especially after a day of already walking through the whole city of Cusco."
        }, 
        {
            "index": 200, 
            "rating": "4", 
            "review": "Better than the Centre of Cusco. San Blas is 5 minutes from the centre of Cusco and better. Lots of different cafes and eateries and some cool little bars and shops. Accommodation seems better value and there are some great yoga studios."
        }, 
        {
            "index": 201, 
            "rating": "4", 
            "review": "An alternative Cusco. San Blas is a really nice area of Cusco and only a 5 minute walk from Plaza de Armas. It's full of art, hippies and good food so definitely make your way up the steep steps to get to it. Great views over Cusco too, especially pretty at night."
        }, 
        {
            "index": 202, 
            "rating": "2", 
            "review": "Nice but Overrated. The church is definitely worth spending time. Tons of history. The plaza is pretty dirty and small and crowded with taxis pretty much all day. There are a couple of nice restaurants around there (Jack's Cafe and Green Point - great vegan spot down the street). A good very traditional weaving shop next to the fountain but the rest of the shops are standard tourist stuff.Would not recommend staying in a hostal anywhere around there. Very noisy at night with a couple of loud night clubs right near the plaza. Lots of people hanging around there that don't make it real comfortable to walk around later in the evening. Watch out for religious holidays around here. Expect exploding fireworks at all hours, continuously night and day. Impossible to sleep anywhere near the plaza when things are in full swing. Such events are common and also accompanied by VERY loud music on stages that play well into the night. People gather in the plaza early on such days and drink warm beer all day into the night. Lots of drunk people hanging around during such events.Good for a swing through to see the church but that is about it."
        }, 
        {
            "index": 203, 
            "rating": "5", 
            "review": "Traditional. A real Cusco neighbourhood.. Perfect to know the traditional handycraft... all the surroundings has lovely views of the city, and god restaurants also (my favorite Pachapapa)"
        }, 
        {
            "index": 204, 
            "rating": "3", 
            "review": "Okay . Okay place but you need a guide.Reviews are really terrific, though, from many of the falls. Lots of nice little architecture of items to be witnessed."
        }, 
        {
            "index": 205, 
            "rating": "5", 
            "review": "in this plazoleta we found a lot of worthy places. this is a typical little square full of activity and with a lot of people from 4 corners of the world, we could even see some scot showing off their bagpipes, at moments we thought we were in europe."
        }, 
        {
            "index": 206, 
            "rating": "5", 
            "review": "this is the bohemian neighbourhood. in this little section of cusco you can find gourmet as backpacker restaurants to refill your belly with the most appetizing and delicious peruvian food youve ever have...i like it for i can find a lot of backpackers and adventurers eager to accompany me on some tours."
        }, 
        {
            "index": 207, 
            "rating": "5", 
            "review": "we were here eating good. in this place of cusco you can find excellent food, typically peruvian for the varied budgets, from the cheapest to the gourmet finest dining with wine, i liked it so much and advice to visit here."
        }, 
        {
            "index": 208, 
            "rating": "5", 
            "review": "great section of the city!. We booked 4 nights in Cusco and enjoyed every minute of it! There is so much to see in this wonderful city and a must do is a walk over to San Blas. We stumbled on this interesting section of Cusco while looking for a recommended place to have lunch. Loved the little art galleries, artisan shops and eateries. The plaza is small and quaint and a lovely place to pass the afternoon people watching. You don't want to miss this."
        }, 
        {
            "index": 209, 
            "rating": "2", 
            "review": "Uninspiring . What to say other than a very small Plaza with some artists with mass produced, poor quality products for sale. Take a walk to it if you must, sit and rest, move on...."
        }, 
        {
            "index": 210, 
            "rating": "3", 
            "review": "Overrated little plaza. As the title states it seems as the reviews for this tiny plaza are getting way out of hand.Usually there were lots of cars parked right beside it and sure the waterfall is pretty and colorful.Worth a visit? If you have absolutely nothing else to do, maybe.. but even then it's a close call."
        }, 
        {
            "index": 211, 
            "rating": "5", 
            "review": "this is the artist borough of cusco. I realkly liked to pass by this section of the city for I could by some souvenirs from the best cusco artists"
        }, 
        {
            "index": 212, 
            "rating": "5", 
            "review": "Great area to stay!. I stayed around san blan square and I really recommend it! Great cafes, b&b's, shops, restaurants. On saturdays there is a market in the square selling great bags."
        }, 
        {
            "index": 213, 
            "rating": "4", 
            "review": "Charming quarter in Cusco. The San Blas area is quite charming to walk through with narrow streets or stairways, artisan shops, many restaurants offering fresh local daily menus, the main square with its water fall as well as the San Blas church (oldest church in Cusco). Compared to many other historical and monuments in Cusco, the church looks quite flat from the outside and does not stimulate tourists to go in. Nevertheless the inside is worth the 45 minutes and the 15 soles entrance fee which include an audio guide (for an extra 10 soles we bought a combi pass allowing entrances to three other sites in Cusco). The church has several paintings attributed to the school of Cusco and the main attraction is the intricately carved pulpit made out of one piece of wood."
        }, 
        {
            "index": 214, 
            "rating": "4", 
            "review": "Amazing view of Cusco. A charming walk through the winding roads of cusco with an amazing view at the top. Lots of friendly locals and cute places to eat on the way."
        }, 
        {
            "index": 215, 
            "rating": "5", 
            "review": "Adorable neighborhood in Cusco. San Blas is a great little neighborhood within Cusco. Tiny steep streets crammed with shops and restaurants and churches. A great place to wander around. Local artists shops all over."
        }, 
        {
            "index": 216, 
            "rating": "3", 
            "review": "Tiny little plaza sourrounded by artists. Will take a hike to get to, but the san blas neighborhood is fund and this small plaza may be worth it for good hikers, it is about 200 steps up from the main square in cusco"
        }, 
        {
            "index": 217, 
            "rating": "5", 
            "review": "Beautiful little cobble street area. Lots of nice shops and character neighbourhood... Very nice restaurants and a lovely cathedral. Worth the walk."
        }, 
        {
            "index": 218, 
            "rating": "4", 
            "review": "Nice neighborhood. We walked around here and to us, the best time to visit is the afternoon. There are a lot of shops and restaurants here to visit. Good place to wander around!!"
        }, 
        {
            "index": 219, 
            "rating": "3", 
            "review": "Cool neighbourhood. It was raining when I wandered up to explore the San Blas neighbourhood but that turned out to be a good strategy for randomly ducking into museums and galleries and shops. Many small markets are tucked away into courtyards and very good deals can be had on textiles and other goods."
        }, 
        {
            "index": 220, 
            "rating": "4", 
            "review": "Pleasant afternoon and evening. I've been here a few times at different times of the day. It is best to visit the site in the afternoon and stay until evening. Wander the tiny streets, stopping for coffee in cafes, visit the local church and explore the local galleries and street vendors. In the evening the restaurant is open, and often plays live music."
        }, 
        {
            "index": 221, 
            "rating": "5", 
            "review": "I made a lot of friends here. it was one lonely night when finishing eating out I met a big group of local people, they invited me to a party outside cusco and we decided to go with them, my girlfriend was very happy because she wanted to know the sacred valley, we went into the party, and...surprise, it was a wedding party and we were not dressed up as we should be, well our locals friends helped us to let us in...the people here was so friendly and accepted us to havetheir gringos at their party."
        }, 
        {
            "index": 222, 
            "rating": "4", 
            "review": "A lovely quarter. This area of Cusco is full of interesting shops and galleries, each having their own specialities. It's a lovely place, very relaxing and welcoming."
        }, 
        {
            "index": 223, 
            "rating": "4", 
            "review": "A nice, artsy area. This is the artist area of the City and a nice place to stay and visit. It is convenient to the Plaza de Armas, as well as some lovely high-end shops where you can get \"real\" alpaca goods such as sweaters, socks, gloves, jackets, coats and hats. Plenty of charming coffee shops are in the area as well."
        }, 
        {
            "index": 224, 
            "rating": "5", 
            "review": "ijd town cusco. We stayed in san blas for two days.very charming part of cusco.up on the hill with stunning views of the city, small shops and restaurants everywhere.very narrow streets due to the fact it was built during the Inca period.(they did not have cars then).All cobblestone roads so wear sturdy shoes.The church was very cool"
        }, 
        {
            "index": 225, 
            "rating": "3", 
            "review": "check out Limbus. There will be market on Friday and Saturday if I remember it right. Market is nice with some pretty jewelries and hand-made things. It's worth to take a look if you are on souvenir shopping. During day, you can see people reading on the benches or local people singing casually by the side. But you have to check out Limbus a few minutes' walk from the plaza. The view is great. Especially at night, the food is divine, drinks too. Last time I were there, there's live music too. Great place!"
        }, 
        {
            "index": 226, 
            "rating": "3", 
            "review": "Quaint and Quiet on a Sunday. The Plazoleta de San Blas was very quiet on the Sunday we visited. It is quaint and there were very few people there. There were a few shops open but we did not need a lot time here. It is probably very different on the other days of the week when everything is open."
        }, 
        {
            "index": 227, 
            "rating": "4", 
            "review": "Nice neighborhood but you need to clime, but you won't regret it. . Nice are with lots of shops and nice restaurants. The ⛪ church was small but very beautiful, too pictures are not allowed. The souvenir shops here are not cheap. So buy somewhere else. However if you you want to buy beautiful souvenir, buy them here. Stop on you way up for a nice cup of coffee or a Pisco Sour"
        }, 
        {
            "index": 228, 
            "rating": "4", 
            "review": "Great area outside of the city center. Short walk from the center of the city. Great place to go at night as there are many great restaurants and that are close to many hotels/hostels."
        }, 
        {
            "index": 229, 
            "rating": "5", 
            "review": "Very interesting and charming neighborhood 10 minutes uphill from Plaza de Armas.. Beautiful little area, of narrow streets, charming eateries and lodging of all kinds, interesting shops and the lovely San Blas Plaza. Let yourself get lost wandering the lanes, stop for a coffee at the Meeting Place Café. There is a little market every Friday and Saturday at Plaza de San Blas. Oh and if you go way up the hill, there is a wonderful mirador to overlook the entire city of Cuzco. It really is not that far from there to the White Christ statue."
        }, 
        {
            "index": 230, 
            "rating": "4", 
            "review": "Very nice neighborhood. San Blas is a neighborhood of Cusco, where you can find narrow and steep streets, full of peruvian history and craft shops."
        }, 
        {
            "index": 231, 
            "rating": "4", 
            "review": "Very safe area, lots of artsy shops, good restaurants and cafes. San Blas is a safe area, lots of quaint shops and great cafes. Its close to the main portion of town (10 min walk down hill, 15 min up hill) and for a taxi its super close and quick. (I'm a tall, white, Spanish speaking gringo and the most I paid for a taxi around Cusco was 4 soles. Aprox $1.32 USD. The area is very safe, We walked around at all different times of day and night. The negatives: In many areas of San Blas there is a strong sewage smell  Lots of stray dogs (friendly but watch your step for dog poop)"
        }, 
        {
            "index": 232, 
            "rating": "4", 
            "review": "Quaint Quarter. Unfortunately, we walked to San Blas on a Sunday when the the entire city was quiet as everything shuts down. There were a few stores open but, overall, it was very quiet."
        }, 
        {
            "index": 233, 
            "rating": "5", 
            "review": "great vibe!. Nice district of Cusco to visit. Great shops and restaurants! We really enjoyed the vibe in this part of Cusco!"
        }, 
        {
            "index": 234, 
            "rating": "4", 
            "review": "Lovely place. Lovely San Blas, with it's church, plaza, shops and restaurants. It's a good place to hang around, or just sit and enjoy the view."
        }, 
        {
            "index": 235, 
            "rating": "4", 
            "review": "Most beautifilul quarter of Cusco. In San Blas you have nice Hotels, small placas, very recommandable restaurants (See my review for Green Point). So a good place to stay and explore Cusco. And the center is just a ten minute walk away"
        }, 
        {
            "index": 236, 
            "rating": "5", 
            "review": "Best Neighborhood to Stay in Cusco. We were staying in this neighborhood. I absolutely loved it! It´s so brautiful and it has a very unique vibe. I recommend just seatting in the plaza and read a book or watch your serrounding or climb the stairs up to the view point (Mirador) on the city. There are many cafes and art galleries. Most restaurants open at 6pm. In my opinion it isn´t worth the $5 to see the Pulpito in the church. And ofcourse, there´s the san blas market where you can have a fresh juice for a bargain or a lunch.. Great vibe!"
        }, 
        {
            "index": 237, 
            "rating": "4", 
            "review": "A cute place to visit. This is a nice small plaza that you should go during your visit to Cusco. You will find small but good restaurants around the area."
        }, 
        {
            "index": 238, 
            "rating": "4", 
            "review": "Take a guide. This was really interesting and added to our macchu picchu experience. I'm not one much for ancient history but the engineering, ways of living and beliefs I find really interesting and our guide targeted these things rather than rattling out dates etc. Worth a visit."
        }, 
        {
            "index": 239, 
            "rating": "5", 
            "review": "Great church, don't miss it!. It is small, but very beautiful and located in a great neighborhood. Great pulpit and great paintings!"
        }, 
        {
            "index": 240, 
            "rating": "4", 
            "review": "San Blas has great places to eat and shop. San Blas is a great alternative to the busy Plaza de Armas. They have a ton of great eateries (Taco's, BBQ, Crepes etc.). We also especially like the Saturday artisan market as they have some different and unique items not often seen elsewhere."
        }, 
        {
            "index": 241, 
            "rating": "3", 
            "review": "Cute but very touristy. Cute area but very touristy. Some lovely rococo frames still being done by hand and there are other,artists as well BUT mostly tourist junk for sale in most shops."
        }, 
        {
            "index": 242, 
            "rating": "5", 
            "review": "Great!. Cusco is one of those cities that you can get around by taxi a a very reasonable rate. There are lots of restaurants and coffee shops. Take your time and see and meet the people. They are really friendly. Even though the altitude is 11,000 it did not hamper our trip."
        }, 
        {
            "index": 243, 
            "rating": "4", 
            "review": "Best place in Cusco. Close to everything, if you stay there, it is just 10 minuts to city senter.Very nice , full of life place,good restorants,bars."
        }, 
        {
            "index": 244, 
            "rating": "5", 
            "review": "Restaurants. A beautifull place, where you can find a great number of good restaurants, but prepare for the hills"
        }, 
        {
            "index": 245, 
            "rating": "4", 
            "review": "Great plaza in Cusco. This is a lovely plaza in Cusco close to the main square.\nIf you are in town on a Sunday, they have a bunch of people selling food in the square. You can get a great plate of arroz con pollo for only 8 soles!"
        }, 
        {
            "index": 246, 
            "rating": "5", 
            "review": "Awesome. San Blas is a nice place, lots of nice handicrafts and nice buildings. This is the most beautiful quartier in Cusco"
        }, 
        {
            "index": 247, 
            "rating": "5", 
            "review": "Best neighbourhood in Cusco. We stayed in the San Blas area for a week. With its narrow streets and walkways, cosy bars, cafes and restaurants, it is the perfect spot to avoid the craziness of the more touristy areas. Each day there is something going on in the square, stalls, music etc. See separate reviews for the El Grial Hostal, Green Point, Boheme and Yoga Room. All recommended spots in San Blas."
        }, 
        {
            "index": 248, 
            "rating": "5", 
            "review": "Quirky, Beautiful, Felt like Home. My favourite neighbourhood in Cusco -- find a hotel here and stay here! It has shops, pharmacies, hotels, yoga rooms, healing centers, Green Point delicious restaurant, narrow streets, cobble stone streets, and loads of character!"
        }, 
        {
            "index": 249, 
            "rating": "5", 
            "review": "The Artists' Neighborhood in Cusco. There are several stores that show the different styles of the various families that have been creating for generations. The most important is the House/Museum of the Mendivil Family."
        }, 
        {
            "index": 250, 
            "rating": "3", 
            "review": "More of the same. One becomes a bit jaded by so many people merchandising similar offerings, and our group found this group of merchants did not offer unique pieces. Climbing the stairs above the piazza afforded a view of Cusco and also of the piazza. Venturing much beyond here appeared to lead to less desirable areas so we headed back down to the center of town."
        }, 
        {
            "index": 251, 
            "rating": "3", 
            "review": "Not quite as advertised. This neighborhood of narrow streets is tough to navigate with the traffic rushing through as one heads up or down the steep streets. Shops along the streets offer religious objects especially paintings along with the usual tourist offerings. While the area is interesting and a fine workout, I think it has only idiosyncratic offerings."
        }, 
        {
            "index": 252, 
            "rating": "4", 
            "review": "Quaint and Beautiful!. This was one of the most peaceful places we walked around Cusco as the city center is away and the tranquility there is so great. The plaza is not that impressively amazing, but its how quiet and charming it is that makes it unique and great! We had a blast just chilling there for a few hours!"
        }, 
        {
            "index": 253, 
            "rating": "4", 
            "review": "Quaint and Cute Plaza!. We wondered around the streets of Cusco and stumble upon this cute little plaza. We ended up sitting on one of the benches and just listen to some old man playing the Beatles on his guitar. This was a very cool and unique experience away from all the buzz that Cusco has to offer!"
        }, 
        {
            "index": 254, 
            "rating": "5", 
            "review": "Wonderful area of Cuzco to walk around and explore.. This area is the upscale area of Cuzco. It is a great area to walk the cobblestone streets, visit museums and shop."
        }, 
        {
            "index": 255, 
            "rating": "4", 
            "review": "Nice peacful plaza !. Small out of the way plaza peaceful place to listen to water do a little shopping - cute shops and museum . Great Restaurant PACHHAPAPA!! brick oven outdoor restaurant , excellent pizzas , traditional drinks , traditional food."
        }, 
        {
            "index": 256, 
            "rating": "4", 
            "review": "One stop on the Church and Cathedral circut. This is one of the 6 places included in the 30 sol combined ticket. All the places are on a walkable circut and can be done in less than a day. All except the last have audio guides which are confusing at first but you get the hang of it! Each church and the arch bishops museum have fantastic works of art and massive gold alters and chapels. Makes a big impression!"
        }, 
        {
            "index": 257, 
            "rating": "4", 
            "review": "History !. History, history.Great . You can enjoy at the weekend , walk at historic place and enjoy the time ! Not many places around the America have walls and houses with more than 400 years and with perfect conditions.Good restaurations."
        }, 
        {
            "index": 258, 
            "rating": "4", 
            "review": "Relaxed, welcoming feel just off the main plaza. Slightly less busy than the main tourist areas of downtown Cusco. Numerous yoga, vegan and new age places to visit. Would recommend as a place to relax away from the streams of tourists elsewhere."
        }, 
        {
            "index": 259, 
            "rating": "5", 
            "review": "Best place to stay. The San Blas area was the best place for us to stay. We felt safe and didn't mind walking uphill to return to our hostel. Loved the small local market in the square and narrow streets."
        }, 
        {
            "index": 260, 
            "rating": "5", 
            "review": "Fantastic artists. The weekend is the best time to visit the Plaza, that is when the small stands are set up for the local artisans. However any day is great to peruse the shops nearby or the free artisan museums on the perimeter. It's also a great place to just sit and people watch with fewer interruptions that at the Plaza de Armas"
        }, 
        {
            "index": 261, 
            "rating": "5", 
            "review": "Beautiful neighbourhood. I loved walking around this neighbour, and look at the traditional houses. If you are up for a walk, as I did, early in the morning, and climb stairs you can reach places with amazing views of the city. It has lovely shops, cafes and restaurants and it is quieter than the city centre. I would recommend to book an hotel in this area."
        }, 
        {
            "index": 262, 
            "rating": "5", 
            "review": "Worth a visit!. This lovely arts neighborhood sits hi up a hill overlooking the city. Worth the walk up the hill for a bit of a different experience in architecture, shops, and views. The church itself is worth the trip. Really unexpected beauty and history in this church despite its unassuming exterior and small appearance. We had a guided tour and found it to be very interesting. So much to learn just about the carved wooden side pulpit! The history of how the Spaniards converted the natives is fascinating. I love the small ways in which the natives \"rebelled\" and included their own rituals into the church."
        }, 
        {
            "index": 263, 
            "rating": "4", 
            "review": "Quiet plaza with a fountain!. This little plaza is tucked out of the way. The roads leading to it are extremely narrow and at some points you'll be crushed against the wall as cars pass. Once you get here, it's a nice little plaza with locals meeting and hanging out. It has a fountain which lights up at night. Certainly less active than the Plaza de Armas, but still nice as a stopping point.There are a few interesting shops in the immediate area that are worth checking out if you're on a shopping spree."
        }, 
        {
            "index": 264, 
            "rating": "5", 
            "review": "Great Neighborhood. It was a walk to reach this area but well worth the visit to the Church and square. We visited on a day there was a craft fair and my wife purchased a sweater. The local people were willing to bargain within reason which was very acceptable by us."
        }, 
        {
            "index": 265, 
            "rating": "5", 
            "review": "Nice ambience. This neighbourhood is full of small art galleries, some are open in the morning, others still open in the evening. The streets are narrow and full of travellers. Many modest restaurant. it requires a slow 2300 feet/700 meters slow climbing from the he town main square (easily reached in 10 minutes or less)."
        }, 
        {
            "index": 266, 
            "rating": "4", 
            "review": "Loved the environment. Definitely worth a visit. Nice environment, shopping mainly, but though it's completely nice, specially at night"
        }, 
        {
            "index": 267, 
            "rating": "5", 
            "review": "Lovely place. Fantastic narrow streets lovely old walls and houses is located closer to the cusco city center Impreso ve woe of the city."
        }, 
        {
            "index": 268, 
            "rating": "5", 
            "review": "Make the detour to here.. Just a few minutes from the main plaza in Cusco, but with some much nice artisan shops and a very nice city view."
        }, 
        {
            "index": 269, 
            "rating": "5", 
            "review": "You never get tired of been there!!!. Is an small but beautiful district of Cusco. The place is well know as the district of the artists but it has more things to show us, like the church, the square, the streets and galleries of art."
        }, 
        {
            "index": 270, 
            "rating": "5", 
            "review": "Charming pedestrian district in Cusco. We stayed here twice and loved all the little passages with shops, hotels and cafes. Lots of craft shops. Very pleasant to walk around...although on a hill. Visit La Hada for an ice cream!"
        }, 
        {
            "index": 271, 
            "rating": "5", 
            "review": "Fun place to browse and negotiate a deal for great local art. A quick walk up one the narrow avenue off the main plaza, San Blas is a great place to find hidden art treasures or a simple trinket to remind you of your trip to Cusco. Vendors are affable and hard negotiators, but always willing to deal. Don't miss this little side trip to Cusco!"
        }, 
        {
            "index": 272, 
            "rating": "4", 
            "review": "Charming square and neighborhood. Our hostal was on Plaza San Blas, so we were in this part of Cusco quite a bit. It is a beautiful square anchored by a church and small open/park area with a nice fountain and is considered the \"bohemian\" part of town. It is flanked by some nice restaurants, one of which, The Meeting Place, really stood out for its tremendous milkshakes. Further afield in the San Blas neighborhood are many shops with native art and crafts. This part of town is uphill from the Plaza de Armas, so the tourist foot traffic is mostly people staying in the San Blas area hotels and hostals. For those not staying the area, it is work a hike up the Cuesta San Blas. If you go far enough up, you can get some good Cusco views. There is a good walk from the area up to Saksaywayman.The only downsides, for me, were the ubiquitous guys trying to sell art prints and a steady stream of cars along Carmen Bajo and turning left on Cuesta San Blas."
        }, 
        {
            "index": 273, 
            "rating": "5", 
            "review": "Neighborhood Treasure. While taking pictures of the several streets we found this Treasure. If you have extra time walk through the neighborhood and explore."
        }, 
        {
            "index": 274, 
            "rating": "4", 
            "review": "Cute place. Nice place to walk around and see the views from above. Being here makes you think that you are somewhere in Spain rather than in Peru. I wouldn't suggest buying things in this area though. You can find similar stuff down closer to the main square and around San Pedro market for way cheaper. The guide books say it is but better quality in San Blas but I am not so sure..."
        }, 
        {
            "index": 275, 
            "rating": "5", 
            "review": "To walk and walk. A beautiful, narrow street shared with cars and small \"llamas\", among hundreds of sourvenir shops will lead you to a neighbourhood place at the top of a hill, where there is also the Iglesia de San Blas and the square. Real and authentic artisans have their shops there."
        }, 
        {
            "index": 276, 
            "rating": "3", 
            "review": "Not much to see -. A little disappointed -- there wasn't much to see here. Small shops that are very typical. The plaza was a pleasant place to sit and relax."
        }, 
        {
            "index": 277, 
            "rating": "5", 
            "review": "Fun neighbourhood to explore. We love exploring all the galleries and shops in San Blas. It's easy to spend a whole afternoon wandering around, shopping, or window shopping. If you have a bit of extra time in Cusco, spend a laid back afternoon in this neighborhood!"
        }, 
        {
            "index": 278, 
            "rating": "4", 
            "review": "Bohemian Cusco. Easygoing romantic square, with a fountain etc. visit the Meeting Place cafe when you're there. Also a relaxed stop if you walk back down from SasquaHuaman fortress."
        }, 
        {
            "index": 279, 
            "rating": "4", 
            "review": "Beatiful. Lovely town to walk around and enjoy the beautiful stone walls and cobblestone roads. Very steep hills though, I had to take frequent breaks. We visited the local lithier who played beautiful music on his various instruments, made by him."
        }, 
        {
            "index": 280, 
            "rating": "5", 
            "review": "Great walk and view. Great Colonial location for walking by yourself and exploring the Colonial homes and local stores, the trek begins from plaza of Cuzco, some up hill we are there, also great views."
        }, 
        {
            "index": 281, 
            "rating": "5", 
            "review": "Art everywhere. This neighbourhood is recognized for its art. You can find souvenirs and \"artesanias\". For me the best kinf od art was the paintings. There are tons of small stores and one gallery with amazing paintings from local artists. You can also find people selling their own art on the streets."
        }, 
        {
            "index": 282, 
            "rating": "4", 
            "review": "San Blas church. One of the greatest works produced during the colonial period in Cusco is the pulpit of the church of San Blas in the artisans' quarter. I've admired this pulpit twice now on different trips. It is said that the pulpit was carved from a single piece of cedar and that the skull in the pulpit is that of the artist, Juan Tomas Tuyro Tupac. It is definitely worth a stop."
        }, 
        {
            "index": 283, 
            "rating": "5", 
            "review": "Do not miss it!. The \"pulpito\" carved in wood is the most fantastic piece of wood art I have ever seen. It took the artist (a local) 20 years to complete. The \"retablo\" is also breathtaking. Ask for the video guide when you enter the church. It provides valuable info in various languages."
        }, 
        {
            "index": 284, 
            "rating": "4", 
            "review": "A very pleasant neighborhood, a short walk from the center.. This is a wonderful little neighborhor full of interesting little shops and restaurants. It but a short but steep walk up the hill from the center. The day we were there, there was a small art show in the area in front of the church."
        }, 
        {
            "index": 285, 
            "rating": "5", 
            "review": "San Blas Market. We found this market in the San Blas Square by accident and it was the best one in Cusco. Most of the venders there were selling their own hand made products. Definitely above any other markets we came across in Cusco."
        }, 
        {
            "index": 286, 
            "rating": "3", 
            "review": "Nice neighborhood . You walk uphill from the centre through a typical narrow street with some shops and you end up at a small square with a souvenir ('artisanal') market. Not super special but ok to do, but take it easy with the stairs. The thin air makes any climbing brutal. At the square we had a drink and waffle at the Meeting Point cafe. Pretty good and free internet."
        }, 
        {
            "index": 287, 
            "rating": "5", 
            "review": "Artists paradise. Amazing place, love the artisans street and quaint shopping and churches all around. I bought a lovely painting from one of the local artists."
        }, 
        {
            "index": 288, 
            "rating": "4", 
            "review": "Nice neighorbood. San Blas is a very nice neighborhood. It feels very authentic. There is also a nice handcrafts market on the Plaza (Fridays and Saturdays, I believe) and a nice view of the rest of the city.Consider that this is a relatively long climb, specially if you're not used to the altitude yet."
        }, 
        {
            "index": 289, 
            "rating": "5", 
            "review": "Nice place. You can get great photos at the top of the stairs. Very beautiful in the evening. To visit at any time."
        }, 
        {
            "index": 290, 
            "rating": "3", 
            "review": "It's ok. First it is a good walk to get there. Of course you can see the church as well. But I've seen better parks than that one, for example the one in front of the cathedral. But it has a nice fountain and the church has a nice altar. But not worth the 10 soles they charge for I think."
        }, 
        {
            "index": 291, 
            "rating": "4", 
            "review": "worth the climb. The whole district is a fascinating area for handicrafts. The church is very special, with an altarpiece to rival that in the Holy Family church beside the cathedral. There is also a magnificent pulpit intricately carved out of a single cedar tree - rather macabre is the skull of the woodcarver above the pulpit."
        }, 
        {
            "index": 292, 
            "rating": "5", 
            "review": "A neighbourhood not to miss. I loved all of the side streets, laneways and small shops that feature such a wide range of crafts, art, and fine goods. This is where the artisans are who do the carving, the gilding, the sculpting and the painting. You can watch them at work in their studies and buy directly from the people who create the items. Prices can be a bit higher but you are getting the top of the line in most shops. There are also lots of street vendors and artisans from the countryside who have very unique goods. It is a rabbit warren and some of the best places are down the narrowest streets. Lots of places for good food and beverages and look for internal courtyards where there is even more and some of the best are on upper floors with great street views. It is a safe area during the day and early evening but as usual look out for scammers. Take a cab to the San Blas church and square and take your time walking down to the main Plaza de Armas."
        }, 
        {
            "index": 293, 
            "rating": "4", 
            "review": "Great atmosphere. What a fun taxi ride here! Fantastic cobblestone streets so narrow you could almost touch both sides at once. What we imagined an Andean town to be."
        }, 
        {
            "index": 294, 
            "rating": "5", 
            "review": "A second home. I lived here for two months whilst studying Spanish and it is one of my favourite places in the world now. I felt extremely welcome and comfortable, even when my Spanish was really bad. It is a beautiful city with an incredible history and the locals are wonderful. There is a nice mixture of new and old and I can't wait to return one day."
        }, 
        {
            "index": 295, 
            "rating": "4", 
            "review": "Up up (and up and UP) and away!. The San Blas neighborhood is home to many MANY stairs, which seem more challenging at the high altitude. However, do accept the challenge to tour a beautiful part of the city with great views. Have a drink at Limbo and overlook the area:)"
        }, 
        {
            "index": 296, 
            "rating": "4", 
            "review": "Beautiful Atmosphere!. Spent a few hours at San Blas during a day tour! It is family friendly so you can take your kids. The Spanish influence architecture throughout the town is beautiful. The views are incredible you can see down to the main square of Cousco. Make sure you have a cup of coca tea to avoid elevation sickness."
        }, 
        {
            "index": 297, 
            "rating": "5", 
            "review": "Beautiful plaza and great vibe. Really nice place to go and spend time. Some nice cafes around where you can take your book and chill out."
        }, 
        {
            "index": 298, 
            "rating": "5", 
            "review": "Church disco!. Great atmosphere each night at San Blas. The Peruvians seem big on partying in front of their churches!. Each night there were bands playing and families dancing. Great atmosphere and lots of bars and restaurants. We ate at Pacha Papa - highly recommended."
        }, 
        {
            "index": 299, 
            "rating": "3", 
            "review": "Decent accommodation for only average value. This hotel is well located near most of the tourist sites in Cusco. The rooms are comfortable and clean and the staff is friendly and speak English. They also are happy to help you organize day trips, transport to and from the airport (although it was very confusing whether this was included in the price for one way, both ways, or just as an additional add on).Cusco can be an expensive tourist trap. This place is no exception. For over $100/night you can probably find better as there is nothing particularly exceptional about this place in my opinion. You will have a dependably decent experience probably.The shower was very dependably good, which is not the case in all of Peru. The rooms were not heated and even with the two space heaters they gave us, it was pretty cold there. The little hot water packs were nice though and helped. The free teas in the lobby and decent breakfast were also nice. They had an issue charging our credit card and our payment ended up not going through after we had already left. They requested our credit card info over email which was not acceptable and we had to return to the hotel to pay in the absence of a better option."
        }, 
        {
            "index": 300, 
            "rating": "5", 
            "review": "Great Area of Cusco. This is a wonderful plaza area. Close to the main square. Great restaurants. Excellent little shops. Just a perfect area to stay in Cusco."
        }, 
        {
            "index": 301, 
            "rating": "5", 
            "review": "Fun neighborhood. Quaint, artistic neighborhood close to everything you need and yet safe and welcoming. Our hotel was based here, and we enjoyed the hike back to it after a day out."
        }, 
        {
            "index": 302, 
            "rating": "5", 
            "review": "Mercado de San Blas for great local meal. The San Blas area is certainly one of the most interesting in Cuzco. Walking around the historic neighborhood you will see a lot. For a very cheap but insanely good lunch I recommend eating at the Mercado de San Blas at the place which I've attached in my picture. The Machu Picchu sandwich along with the juice I had is one of the most satisfying meals I've had in a while. The sandwich is loaded with chicken, tomatoes, eggs, cheese, herbs, and a huge helping of amazing avocado. (the best avocado I've ever had) The sandwich will set you back 5 soles as will the juice. Simply incredible quality for the price. I will return while I'm in Cuzco."
        }, 
        {
            "index": 303, 
            "rating": "5", 
            "review": "Can get an amazing view of Cusco. Very cute neighborhood....slightly on higher elevation. So be prepared to get winded on the many stairs. But it is worth it to get the amazing view of the city."
        }, 
        {
            "index": 304, 
            "rating": "5", 
            "review": "Explore - but be prepared for steep hill. A short uphill walk (challenging on your first day at altitude, much easier after being here) takes you to the San Blas area. It's only 3 blocks from the plaza. The area has shops, restaurants, and streets to explore. But it is a steep uphill walk. Worth exploring - especially for the weekly market. But be cautious on selecting a hostel here- the walk is exhausting until you are used to it."
        }, 
        {
            "index": 305, 
            "rating": "5", 
            "review": "Beautiful churches. Take a ticket once and for all for 3 churches and save time and money. They are worth visiting and close to each other even if you must climb a little for this one. Restaurant pachapapa in front of the church is authentic and good"
        }, 
        {
            "index": 306, 
            "rating": "4", 
            "review": "So many shops and places to expore. I enjoyed walking all over San Blas and went to their Saturday market for some locally created art and jewelry. Its a short walk to Plaza de Armas and on to San Pedro market. Con: You'll need to watch out for poop from all the mangy homeless doggies tearing into the garbage (yuck). Poor things."
        }, 
        {
            "index": 307, 
            "rating": "5", 
            "review": "Nice and quiet. I lived in San Blas for over a month. It is a very quiet and artistic area. On the street over the fountain there are small coffee shops with internet where you can stay for hours and they make excellent different kind of cake. There is a small plaza where you can take sun while listening local musiciens exercising on there instruments. It is very easy to get a taxi and get to any direction."
        }, 
        {
            "index": 308, 
            "rating": "5", 
            "review": "Get your hiking shoes on!. Well, my daughter swears by pretty sandals and she was fine but there are lots of stairs. We walked from San Cristobal Church and was able to avoid most of the stairs. The narrow roadways and hills and shops make this a very pretty visit. We visited workshops, galleries and stores. There was a pretty fountain and church at the plaza. A very quaint area."
        }, 
        {
            "index": 309, 
            "rating": "5", 
            "review": "Great area of Cusco for dining and shopping!. San Blas is the artist enclave in Cusco. A short walk (uphill!) from the main square puts you in the middle of shopping, artists selling their wares and some great restaurants. Worth the venture up the hill!"
        }, 
        {
            "index": 310, 
            "rating": "4", 
            "review": "Old Cusco. I was delighted by the steep narrow streets and alleyways. I found the shops, with their doors standing open, very interesting. The age of the place was very evident in the architecture. Certain times of the day saw a lot of cars and very little space to be out of their way, but most of the time there were only pedestrians. Street dogs, as through all of Peru, wander freely, taking little notice of humans, and are given right of way by drivers."
        }, 
        {
            "index": 311, 
            "rating": "3", 
            "review": "Meh. My guidebook raved on and on about San Blas being the best part of Cusco. Honestly, I didn't see any particular charm to this area. There are a couple of decent coffee shops and restaurants, it may be worth your time to walk through, but I wouldn't feel terrible if I missed it entirely."
        }, 
        {
            "index": 312, 
            "rating": "5", 
            "review": "Go to the church and get the audio guide. Amazing church, carvings unique and amazing square to visit. You can buy a mult church ticket as save a bit Lots of artists studios to browse also"
        }, 
        {
            "index": 313, 
            "rating": "3", 
            "review": "Nice church, great hike to get there!. The hike to this church was a bit more interesting for me than the church itself. The church is plain, yet very historical. If you are in the area, it is worth checking out."
        }, 
        {
            "index": 314, 
            "rating": "4", 
            "review": "Great Shopping in Cuzco. San Blas has the best shopping for Peruvian handmade work that we found in Cuzco. There are a number of restaurants at San Blas, but we ventured down a couple of blocks to Jack's for a more American dining experience. Just a couple of blocks more took us down to the Plaza."
        }, 
        {
            "index": 315, 
            "rating": "4", 
            "review": "Arts and craft abound. This is a very touristy area with many cafes and restaurants for eating with alley after alley of all the usual trinkets for tourists. Well worth the look but there are cheaper areas to get your souvenir."
        }, 
        {
            "index": 316, 
            "rating": "4", 
            "review": "Great Neighborhood with good restaurants, cafes and art shops. About 5 to 10 mins from Plaza de Armas is the San Blas neighborhood. It is quieter and at the same time has many restaurants and cafes that were very cool"
        }, 
        {
            "index": 317, 
            "rating": "4", 
            "review": "Nice place to shop. If you don't mind walking high up hill ,you can find very nice shop in good prices too !! But I had done most of my shoping around the sq ...so hope others would shop here . And you can take nice picture too !!"
        }, 
        {
            "index": 318, 
            "rating": "3", 
            "review": "Interesting square and architecture. Interesting square set in the hillside (isnt everyhing?), the church and surrounds are worth a look. There are a lot of street vendors which is good, although some can be pushy - especially the 'struggling artists' selling their mass produced prints. One thing to chase up, there is a small (ie about 20 seats max) restauraunt on the upper left side of the plaza that only opens in the early evening. It is run by one lady who makes pasta to die for!"
        }, 
        {
            "index": 319, 
            "rating": "5", 
            "review": "Cute, quiet area, just up the hill. We stayed in the San Blas area (Tierra Viva San Blas), and just loved it. It's a short walk, few blocks away from the main Plaza de Armas square, and it uphill (good exercise). I love how close it was to the main square, but yet it wasn't in all the activity. The San Blas square is small, not as impressive of Plaza de Armas, but it has some cute shops and restaurants to explore. Being uphill, San Blas has great views from above."
        }, 
        {
            "index": 320, 
            "rating": "5", 
            "review": "Good area to stay in Cusco. We stayed right off Plaza San Blas and enjoyed the area. It was a bit calmer than the main centro area, even though it was only about a 10 minute walk away."
        }, 
        {
            "index": 321, 
            "rating": "5", 
            "review": "Beautiful and cute!. Short walk away from the Plaza de Armas (uphill, so not easy) but there is a shopping area that has anything that you might need/want. It's quite cute, and has lots of restaurants if you are looking for a place to sit and eat. There are also many travel agencies and you can talk to them if you are looking for anything."
        }, 
        {
            "index": 322, 
            "rating": "5", 
            "review": "Good place to stay. Great place to stay in Cusco - away from the noise of the plaza del armas and the best restaurants and yoga studios are in the area"
        }, 
        {
            "index": 323, 
            "rating": "4", 
            "review": "Loved this part of town. I really enjoyed the shops and cafes in San Blas. I took the Free Walking Tour and we ended up in a music shop here. A man showed us popular Peruvian instruments he makes and played some of them for us. This is a great neighborhood!"
        }, 
        {
            "index": 324, 
            "rating": "4", 
            "review": "Nice neighborhood. Nice neighborhood to stroll through or stay in - away from the more touristy area. Lots of shops and restaurants. And hills."
        }, 
        {
            "index": 325, 
            "rating": "4", 
            "review": "A bohemian area of Cusco overlooking the City. Lots of quaint restaurants and shops in a safe area. Very hilly and steep in parts.An up and coming area ."
        }, 
        {
            "index": 326, 
            "rating": "5", 
            "review": "Great shopping, but you have to negotiate. Be sure to stay away from the tourist stores that give kickbacks to tour guides and go to the independent shops where many owners live and work in the back. They will work with you a bit on price, especially if you buy more than one item, and then you also know the goods are really made there."
        }, 
        {
            "index": 327, 
            "rating": "5", 
            "review": "Some of the best views. Lots of artisans and restaurants and some of the best views of the city. Take the walking tour of Cuzco with Marcos (meet him at the fountain at Plaza de Armas any day at 12:30) and you will end up at a great restaurant at the foot of San Blas."
        }, 
        {
            "index": 328, 
            "rating": "5", 
            "review": "Good for walking!. If you are up for a good walk, this is a great place. there are lovely bars and restaurants with a nice view, live music."
        }, 
        {
            "index": 329, 
            "rating": "5", 
            "review": "Hostal Las Pleides, San Blas Area. Loved this 8-room Hostel. Stayed 2 nights before and after our Salkantay Trek. Staff prepared early Breakfast & Coco Tea. Clean,heated, hot water (usually) and caring service. Recommended*"
        }, 
        {
            "index": 330, 
            "rating": "3", 
            "review": "Artisans? Yes, but not exactly what I'd expected. When I heard of San Blas as the \"artists' quarter\" - I had something fairly concrete in mind. Painters and sculptors, etc., working in original ways to create original works of art. San Blas (unless we just didn't get to the right parts - and we were in the courtyard/plaza of the church!) is more artisanal than artistic. And the resulting efforts are rather duplicative and repetitious. If you have seen one store's collection, you've likely seen them all. (In my impression, at least.) So apart from the fact that the climb got us easily within reach of the MAP (Museo de Arte Pre-colombino) - and lunch in its courtyard restaurant, I'd say I was disappointed by what I saw in San Blas."
        }, 
        {
            "index": 331, 
            "rating": "4", 
            "review": "Nice little spot to buy gifts. This was a little plaza with a few shops where people can go to buy souvenirs. The people were all very nice and very polite"
        }, 
        {
            "index": 332, 
            "rating": "3", 
            "review": "Nice little plaza with fountains and shops,. Not far from Plaza de Armas and short walk uphill.\nBest to spend some time and to take photos with the fountain's backdrop. There are shops, cafe's and the San Blas Church."
        }, 
        {
            "index": 333, 
            "rating": "5", 
            "review": "Beautiful area. This little area is Cusco is very beautiful. The narrow cobble streets add to the charm of the area that has its own small plaza with plenty of restaurants and galleries around. You have to climb uphill to get here, but it's about a ten minute walk which is well worth it!!!"
        }, 
        {
            "index": 334, 
            "rating": "5", 
            "review": "Great walk or stay!. Recommend this area for having a wander and even great for staying. Cute little cobbled streets with crafts and street food. We stayed in this area and the accomodation was really good both times."
        }, 
        {
            "index": 335, 
            "rating": "5", 
            "review": "Encatada boutique hotel. The neighborhood is very bohemian with lots of stairs and hills.With great views of the city and very narrow streets are some are just for pedestrians."
        }, 
        {
            "index": 336, 
            "rating": "4", 
            "review": "Art Street. San Blas is pretty impressive with the streets filled with glimpses of the best Peruvian art culture can offer. There are artworks, handicrafts and quite a few souvenir shops. The people are warm and friendly and the streets are pretty safe and have a lot to offer. Definitely worth checking out while around the area."
        }, 
        {
            "index": 337, 
            "rating": "4", 
            "review": "Interesting working neighborhood. We bought the three-church tour pass (started at La Catedral on Plaza de Armas) and ended up wandering around this neighborhood's tiny streets. If you like fiber art, you must see the Museo Laura with famed artist Maximo Laura's work on display."
        }, 
        {
            "index": 338, 
            "rating": "5", 
            "review": "San Blas neighborhood. This is a beautiful and historic area of Cusco. We stayed in a hotel up the hill. The area is touristy. We walked everywhere even later at night. The area was safe, the people friendly and we had no problems."
        }, 
        {
            "index": 339, 
            "rating": "5", 
            "review": "Great artsy area!. San Blas is a great artsy area of Cusco with lots of great resturants and shops. There is also a really nice little church and a square to hang out in. It[s a bit of a walk uphill from the main square but well worth it!"
        }, 
        {
            "index": 340, 
            "rating": "5", 
            "review": "bohemian. very nice, very bohemian. The streets are full of sellers with paintings and antiques. Beautifull at night,"
        }, 
        {
            "index": 341, 
            "rating": "5", 
            "review": "Hippie San Blas. It is a lovely area with typical hippie vibes, good coffee places, local markets. Fewer gringos than the Plaza de armas"
        }, 
        {
            "index": 342, 
            "rating": "5", 
            "review": "A walk but worth every step.... A very cute plaza.. a must while in Cuzco.. stay and have a beer one of the little bars .. many vendors in the area.. dont miss it.."
        }, 
        {
            "index": 343, 
            "rating": "4", 
            "review": "Quiet neighborhood with plenty going on. We chose to stay in San Blas rather than near the Plaza de Armas and are glad we did. It is much less crowded and restaurants and shops have better prices. It is fun strolling around, although it is uphill when coming from the main plaza. We found the artwork we were hoping for in a small shop in this neighborhood."
        }, 
        {
            "index": 344, 
            "rating": "5", 
            "review": "Don't miss this neighbourhood. Whatever you do - don't miss the five minute climb up from the main square to San Blas. It's less touristy and has pretty little squares with nice shops. Bought a lovely silver ring from one in the Plaza San Blas. Great photos of cobbled streets, tiled entrances and old doors. Go early before the crowds. At 10am it was peaceful"
        }, 
        {
            "index": 345, 
            "rating": "5", 
            "review": "Definitely worth the walk. Loved walking this area, exploring the narrow streets. Be sure to wear comfortable shoes because of the cobbled streets and many many steps. Lots of small shops and unique cafes. Gives you a real flavor of Peru"
        }, 
        {
            "index": 346, 
            "rating": "4", 
            "review": "lots of local vendors. Lots of local vendors there selling lots of hand made articles. From paintings of local scenes, hand woven tapestries and a great little coffee shop hidden in a corner."
        }, 
        {
            "index": 347, 
            "rating": "4", 
            "review": "cool, trendy and very hippy part of town. a short walk uphill from the plaza de armas, this part of town is quite a hippy, colorful and very cozy part of town. You find a lot of yoga places and small shops. Also, there is a small plaza around a church. Very cute and worth the walk."
        }, 
        {
            "index": 348, 
            "rating": "5", 
            "review": "A great area of Cusco to check out!. The streets are filled with vendors and restaurants, if you need anything, you can get it from the San Blas area!"
        }, 
        {
            "index": 349, 
            "rating": "5", 
            "review": "A Wonderful Walk, with Views and Coffee. Lots of arts and cafe's and incredible views of Cuzco!At night you will find local art exhibits and events, and even some live music. But a few levels above the noise of the city disappears and you are left with sky, the city and the surrounding mountains - just wonderful!"
        }, 
        {
            "index": 350, 
            "rating": "5", 
            "review": "Beautiful but many stairs. Our hostel was in the San Blas area so we really got to experience this place.San Blas is beautiful and has many good restaurants (i.e. pachapapa right across from the church), stores and places to see. The downside is that it has many steps. If you need a rest, it was easy to go into a store and look at things. San Blas by the church also has a market where there are many stores. It is very picturesque. Just be careful of the cars. The streets are narrow and can only fit one car. Sometimes you are sharing the streets with a car and you have to go up against the wall to let it pass."
        }, 
        {
            "index": 351, 
            "rating": "4", 
            "review": "The nicest place in Cusco city. San Blas is a nice place with charm. You can find handricrafts and of course you can relax with the nice views and streets"
        }, 
        {
            "index": 352, 
            "rating": "5", 
            "review": "Don't Miss San Blas Church. Don't make the mistake of avoiding a bit of a hike up the hill to visit the San Blas Church, the oldest in Spanish Cusco. It is easy to visit just the Cathedral and the Jesuit Church (Iglesia de la Compania) and call it a day with churches, but the little San Blas Church has both history and charm. An excellent audio guide in Spanish or English is included."
        }, 
        {
            "index": 353, 
            "rating": "5", 
            "review": "Historic and walkable. While visiting our daughter, who lives on Carmen Bajo in San Blas, we roamed up and down the hills of San Blas exploring shops in every nook and cranny, and visiting museums. A beautiful and historic part of town. The steps will leave you winded, especially if you're just off the plane. But the sights won't disappoint."
        }, 
        {
            "index": 354, 
            "rating": "3", 
            "review": "Not what i used to be. This used to be a nice place, but it keeps on losing its charm. Full of stores, cafes and restaurants. It is no longer what i used to be.Cuzco has nice architecture, but it is loosing its charm. Quite sad."
        }, 
        {
            "index": 355, 
            "rating": "4", 
            "review": "SHOPPERS DELIGHT. Narrow streets with plenty of local shops to hunt for souvenirs and bargains, dont be afraid to haggle, you can get up to 405 discount if you push enough. Lovely old buildings"
        }, 
        {
            "index": 356, 
            "rating": "5", 
            "review": "San Blas is the BEST. Get away from the touristy main plaza and wander up hill on the cobblestoned streets (wear non heeled shoes) and see this area. San Blas is a great district. A bit dirty maybe with the dog poop etc.. but quite a interesting place. Great street art, nice little shops, wonderful views and really cool streets. Take the time to wander San Blas Bario. Find some really unique things to buy rather than the typical touristy stuff."
        }, 
        {
            "index": 357, 
            "rating": "3", 
            "review": "Nice little neighborhood. I decided to visit this place as soon as I got to Cusco the alleys around preserve this colonial style and and small church but the area wasnt that clean and the shops around this area offered quite expensive souvenirs, if you have free time you can do it"
        }, 
        {
            "index": 358, 
            "rating": "5", 
            "review": "Almost off the beaten path. Very tranquil spot, yet still tourist-oriented. Nice when you want to get a break from all the tourist-filled streets around the plaza.You will have to climb uphill for a bit."
        }, 
        {
            "index": 359, 
            "rating": "5", 
            "review": "Fun bohemian, artsy district up the hill from the main plaza. San Blas is quieter than most parts of town and features narrow cobblestone streets in addition to its own smaller plaza with a church and pretty fountain. There are many artists selling their wares along with fun cafes, restaurants and boutique hotels. This is definitely one of the better parts of Cuzco and worth your time if you don't mind walking uphill."
        }, 
        {
            "index": 360, 
            "rating": "5", 
            "review": "Artisan Centre. San Blas is Cusco's artisan centre and is around the Plaza de San Blas. We took a 10 minute taxi ride from Plaza de Armas to avoid the uphill climb. The square has a beautiful mini waterfall, the old Church of San Blas, very interesting shops and art galleries and local folk selling their wares."
        }, 
        {
            "index": 361, 
            "rating": "4", 
            "review": "Bohemian experience. This backpackers district is unique and a nice change from the craziness of the major tourist plazas in the center of town. Narrow, windy, cobble stone streets give you a different feel from the bus and auto crazed life elsewhere. Backpackers sell homemade wares in the area too."
        }, 
        {
            "index": 362, 
            "rating": "5", 
            "review": "Very cool place. We initially had a hotel near the main street in Cuzco. We changed hotels and end up in San Blas....and we couldn't have been happier. Gorgeous narrow cobblestone streets, great views, eclectic restaurants. ...etc. it was an experience in itself. I would very highly recommend staying in this area."
        }, 
        {
            "index": 363, 
            "rating": "4", 
            "review": "Get lost in San blas. Beautiful place to get lost and walk around, there are plenty of coffee places and small shoot to buy everything from jewelry to clothes. Loved it here."
        }, 
        {
            "index": 364, 
            "rating": "5", 
            "review": "Casa San Blas. This Bed and Breakfast was wonderful during our stay in Cusco. The entire staff was cordial, considerate, and attentive."
        }, 
        {
            "index": 365, 
            "rating": "5", 
            "review": "Artsy & Bohemian. It’s worth the walk up the hill to see the church and wander the shops. Good collection of art shops, some religious stores, and local artists. Don’t miss the pulpit in the church."
        }, 
        {
            "index": 366, 
            "rating": "5", 
            "review": "A tiny gem that packs an art wonder wallop. The Iglesia de San Blas is a beautiful little gem and the main reason for walking up to the plaza but there are many other charming reasons to go. The Iglesia's pulpit of carved wood is an absolute treasure. It is must-see. I was completely wonder-struck. I still am. I wish I had done the audio tour, but honestly the splendor of the alter, paintings and pulpit spoke for themselves. The bookstore on the main square was delightful. The plaza is a relatively peaceful respite from the more aggressive street peddlers of the Place D'Armes although there still are plenty. But the fountain and for us sun-drenched public square were refreshing. Just off the plaza is another must-see: the Museo de Maximo Laura. Just breathtaking textile art."
        }, 
        {
            "index": 367, 
            "rating": "5", 
            "review": "My favourite area in Cusco. The authentic feeling you get when walking in the streets of San Blas is priceless. I love the small tiendas and the peaceful atmosphere."
        }, 
        {
            "index": 368, 
            "rating": "4", 
            "review": "Pretty square.. The area is popular with backpackers in which you normally find the artisan side of life. This is no exception, we spent a couple of hours exploring the square and surrounding area. The shops are a great place to pick up colourful and quirky presents for yourself, friends and family.Nice coffee shops the one we chose had great staff and calorific cakes..!!"
        }, 
        {
            "index": 369, 
            "rating": "5", 
            "review": "lost in san blas. little cafe, pedestrian street, color, boutique and laboratories, a very pleasant break very close to plaza de arms"
        }, 
        {
            "index": 370, 
            "rating": "5", 
            "review": "Great Part of Town !!!. Great vegan cafe called Green Point in San Blas.Cool shops, and amazing street hill views... We Love Peru !!!We love Peru !!!"
        }, 
        {
            "index": 371, 
            "rating": "5", 
            "review": "still a pintoresque historic quarter. Not far from the historic center and the Center square of Cusco you walk up to San Blas, where you can find bars, coffeeshops, restaurants, terraces and colonial houses built on Inca walls, and from San Blas with its incredible imagery artisans you have spots like the 7&7 Coffee Shop in Tandapata, from where you overlook the whole historic part of Cusco. It is not destroyed by modernisation and its inhabitants and entrepreneurs are very active to keep San Blas safe and attractive. The only downside is that Cusco municipality has not enough resources to collect the garbage, so some days you will come across piles of garbage destroyed by dogs, as the garbage collectors do not come every day."
        }, 
        {
            "index": 372, 
            "rating": "5", 
            "review": "The best part of the new Cuzco. Lots of shops, including colonial art and framing. I would stay there next time, at the CuscoSan Blas Tierra Viva hotel."
        }, 
        {
            "index": 373, 
            "rating": "5", 
            "review": "nice experience great view. its like a nice way to know cusco, beautiful little streets, and unique places to eat, to visit and to buy souveniers, ask for the san blas mirador is really nice ;)"
        }, 
        {
            "index": 374, 
            "rating": "5", 
            "review": "Walk the Inca-carved stone streets. San Blas was uphill from our hotel, so we took a taxi up (5 soles=about $1.65), then walked around the San Blas area. There are lots of shops and a variety of sites nearby: the Pre-Columbian Art Museum, the Cathedral, Jesuit Monastery, the Machu-Picchu/Yale Museum. Just walk and enjoy!"
        }, 
        {
            "index": 375, 
            "rating": "4", 
            "review": "picturesque. located very close to the main square, this colourful and picturesque quartier makes you feel to be in greece. you'll enjoy the crowded square full of old ladies who sell their artcrafts. very recommeneded"
        }, 
        {
            "index": 376, 
            "rating": "5", 
            "review": "take a little hike, it's beautiful. I love this little plaza. You will find people taking a stroll or just sitting on a park bench looking at the fountain. I love the souvenir shop on the corner of the plaza, they had some things I had never seen in town before."
        }, 
        {
            "index": 377, 
            "rating": "5", 
            "review": "Atmospheric. Great neighborhood with tons of attractions and eating options. Walking around is just a pleasure and getting lost in the streets to find another historical gem is just my kind of traveling."
        }, 
        {
            "index": 378, 
            "rating": "4", 
            "review": "Beaituful and Peaceful. San Blas is the most expat neighborhood in Cusco. It is composed of many little alleyways and streets in which you can easily get lost. To get to the main plaza you just need to go from the main plaza (right side of the cathedral) and continue forward, passing the 12-angle stone, past Jack's Cafe, and up the hill until you reach the cathedral of San Blas. San Blas plaza is right next to the cathedral. It has a beautiful fountain at the end. 2 blocks away from the plaza is a little market with local greens and food. And there are MANY hotels, restaurants, and cafes all around. On Saturdays, there is an artisan market right on the plaza with pretty affordable and unique works of art from local and international artisans. It's a beautiful side of town that you should definitely visit while in Cusco."
        }, 
        {
            "index": 379, 
            "rating": "4", 
            "review": "Quirky boho place with loads of little restaurants. small streets with character, loads of tiny intimate restaurants with good menu del dia options, lovely San Blas church, dont forget the boleto de turistico (2 or 110 day options) covers this church and many other interesting sites."
        }, 
        {
            "index": 380, 
            "rating": "4", 
            "review": "A neat area. We stayed just a block from San Blas square. This area has some lovely museums (artisan, weaving) and lovely, somewhat \"higher end\" alpaca wool shops. The itself had a little market and when we were there bands played as it was a festival."
        }, 
        {
            "index": 381, 
            "rating": "5", 
            "review": "hadicraft masters. this quarter is famous in cusco because, here are located all the most important artisants of the cusco, as mendivils, also is very nice the also is very nice his pulpit made in cedar wood"
        }, 
        {
            "index": 382, 
            "rating": "5", 
            "review": "A little jewel hidden from the city centre. San Blas is a very local typical neighbourhood, and although tourism there too had its print, it is less to be felt than in the cusco city centre. here people live, and you can feel a little with them. First week of February the saint is honoured with music and dances!"
        }, 
        {
            "index": 383, 
            "rating": "5", 
            "review": "My favorite spot!. Full of restaurants, little plazas and shops!\nWe stayed there and loved it!\nClimb it up slowly and make sure to stop in the little shops and check some of the great artwork!"
        }, 
        {
            "index": 384, 
            "rating": "5", 
            "review": "Music, drinks and art. San Blas is the ideal place to go for some drinks at night. The music and the ambiance is just amazing."
        }, 
        {
            "index": 385, 
            "rating": "5", 
            "review": "Very beautiful neighborhood for walking. I loved walking around this neighborhood. It was the best part of Cusco for me with the most personality and with the feel of what the city must have been like years before it became a huge traffic clogged city."
        }, 
        {
            "index": 386, 
            "rating": "5", 
            "review": "Great area for a stroll. If you are up for a good walk, this is a great place. I stayed in this area for two weeks, and I enjoyed the view of the fireworks over Christmas and New Year from this vista. Lovely area. Great views and lovely places to eat ."
        }, 
        {
            "index": 387, 
            "rating": "4", 
            "review": "Great photogenic area.. What a wonderful area to walk around early in the morning. The narrow streets have so much charm and character. The whole area is clean and in area you come to intersect many of the old Inca trails. This is a great walk around area in Cusco that should not be missed."
        }, 
        {
            "index": 388, 
            "rating": "5", 
            "review": "Interesting exploring on the narrow Inca streets. We stayed at Tierra Viva in San Blas and enjoyed exploring the streets that travel around the hill of San Blas. Lots of great restaurants and sights to see and the higher you go, the better the view."
        }, 
        {
            "index": 389, 
            "rating": "4", 
            "review": "Good Picture Opportunity. Small area off the main strip but go here to take some cool picture of the rooftops of the old city of Cusco."
        }, 
        {
            "index": 390, 
            "rating": "5", 
            "review": "Great area. We stayed in San blas while acclimatizing for our 4 day inca trail hike and the area felt vert safe and freindly. The stairs will give you a preview of what the hike will be like if your doing that ( which I strongley recommend)."
        }, 
        {
            "index": 391, 
            "rating": "5", 
            "review": "Nice area and beautiful observation point. It is worth climbing all the stairs to reach the observation point of San Blas (check with hotel the location on the map). It is breathtaking! you can see the whole town and the mountains around. Morning/afternoon are better times to visit because at noon it is very hot and there is no shadow."
        }, 
        {
            "index": 392, 
            "rating": "4", 
            "review": "Lovely neighbourhood. San Blas neighbourhood is great for restaurants and shopping. A must when you are searching for a special memento. Very artsy and beautiful."
        }, 
        {
            "index": 393, 
            "rating": "4", 
            "review": "One of the best churches to visit in Cusco!. The church was small and lovely! The pulpit is amazing! The best part? This was one of the new churches that offered an audio tour. I was able to learn the history of the little church and community without having to deal with tour guide and their schedule/pace. I could listen to the facts and then turn it off and proceed at my own pace. Loved it!"
        }, 
        {
            "index": 394, 
            "rating": "4", 
            "review": "Small interesting church. This church is part of the integral ticket which includes the main cathedral and archbishop's palace. Make sure to ask for an audio guide, it is not actively advertized, but is included with your admission. Quality of recording and information is great, but may be difficult at time to identify the item being discusses. The whole religious circuit is very interesting."
        }, 
        {
            "index": 395, 
            "rating": "4", 
            "review": "nice locality. we chose to stay in a nice apt in this locality. yes, we have to climb steps to reach our apt but it has a lovely local flavor. the cathedral and the plaza are neat too"
        }, 
        {
            "index": 396, 
            "rating": "5", 
            "review": "So beautiful!. The San Blas District in Cusco is very beautiful. Its a very clean area with cobblestone streets and lots of shops, restaurants and shopping. The people were very friendly and the prices for things were reasonable. We stayed at the Casa San Blas Boutique Hotel. I would highly recommend it."
        }, 
        {
            "index": 397, 
            "rating": "5", 
            "review": "Artisans' Area. Wander through the San Blas neighborhood and you will find all sorts of art work, handicrafts and such while walking down Inca roads."
        }, 
        {
            "index": 398, 
            "rating": "4", 
            "review": "Favorite neighborhood. We stayed in San Blas off of Recoleta for three weeks. We also spent some time in Wanchaq, and we both preferred San Blas. San Blas is a Bohemian neighborhood, with artisans surrounding a beautiful small square and very clean market. Cusco streets are noisy because they are flooded with taxi drivers who honk at you to get your attention. However, many of the streets in San Blas are too narrow for cars, and it was nice to have a quiet stroll in the busy city. The neighborhood is north of Plaza de Armas, the main tourist square, and a quick walk to most places you'll want to go as a tourist. My boyfriend and I ate lunch at the San Blas market a few times because it was so cheap, at 4 soles per person (1.33 USD). With it comes a bowl of soup, a plate of food and a glass of juice. There are a dozen places within the market to get food or jugos naturales. They also have fresh produce and meat."
        }, 
        {
            "index": 399, 
            "rating": "5", 
            "review": "Beautiful. Wonder around small streets and ancient houses. Many foto opportunities. Many different places to visit. Do visit the local market and by delicious tropical fruits. The San Blas church worth the (rather short) visit, and it is included in the Archbishop ticket."
        }, 
        {
            "index": 400, 
            "rating": "5", 
            "review": "Beautiful area. This is a great area of Cusco. There are many options of stores, restaurants and it is very close to Plaza de Armas."
        }, 
        {
            "index": 401, 
            "rating": "4", 
            "review": "Pleasant part of town. We stayed in the San Blas neighborhood during our visit to Cusco. It is a quiet part of town, 15 minutes uphill from the plaza. It has a pretty small plaza and some nice streets to walk."
        }, 
        {
            "index": 402, 
            "rating": "5", 
            "review": "An interesting place near Main Square. It's an area just a few blocks away from Cusco Main Square. You can find several nice place in very old buildings to enjoy Peruvian and international food. The view is just great."
        }, 
        {
            "index": 403, 
            "rating": "5", 
            "review": "Expensive area. Cool place to visit, but not so cheap to have some food or drinks there. So, if you are in a low budget just walk around but dont stop."
        }, 
        {
            "index": 404, 
            "rating": "5", 
            "review": "The Audio made the tours. Short, sweet, informative and beautiful. Great hike up to the church as well. Nice view by the bell tower, many vendors surrounding the church for more souvenir shopping."
        }, 
        {
            "index": 405, 
            "rating": "5", 
            "review": "Artist community, shops and restaurants. We ate at Macha Papa restaurant and walked through some shops. I appreciated the art and originality of all the offerings. This beyond T-shirt shops."
        }, 
        {
            "index": 406, 
            "rating": "5", 
            "review": "Beautiful neighbourhood. We stayed in this neighbourhood for 10 days and loved it. My husband took Spanish classes for the week in this neighbourhood that were excellent. There is a great market where lots o ladies cool lunch for 6 soles and it is beautiful."
        }, 
        {
            "index": 407, 
            "rating": "5", 
            "review": "atmospheric and adorable. Definately roam around in this very atmospheric section of Cuzco. Lots of artists and painters, galleries and restaurants dot this steep neighborhood. We loved walking around and going into the various courtyards and shops and taking in the sunset from this area. Very bohemian and has a ton of soul."
        }, 
        {
            "index": 408, 
            "rating": "5", 
            "review": "Quiet andt ypical. This is a nice area that doesn't get too many visitors and not too much traffic. It was nice to relax on a bench near the church and even have a nap."
        }, 
        {
            "index": 409, 
            "rating": "4", 
            "review": "Nice slipery stone made streets. This is a nice place to wander around\nFull of cafes, artists atelies and other small business\nIt is a little bit hard to walk on the streets, 'cause they are made of old stones and since the sidewalk is no narrow you sometimes have no other option..."
        }, 
        {
            "index": 410, 
            "rating": "5", 
            "review": "A small but pretty square. This is a charming little square. It is headed by two staircases that form part of a waterfall like water feature.\nLots of little shops front onto the square."
        }, 
        {
            "index": 411, 
            "rating": "5", 
            "review": "great view. Very nice but you need good legs and physical beacuse you have to walk by steps but the view is great to the city"
        }, 
        {
            "index": 412, 
            "rating": "5", 
            "review": "Quaint and full of colour. Perhaps the nicest area in town and best kept for a nice sunny day..if we were to return this would be where we would eat and stroll.full of artists studios and for good reason."
        }, 
        {
            "index": 413, 
            "rating": "4", 
            "review": "Nice Bohemien quarter of Cuzco. Nice old houses, small streets, bit bohemien, food acceptable. Only negative : you have to climb a steep hill"
        }, 
        {
            "index": 414, 
            "rating": "5", 
            "review": "A spiritual place. This little church took me by surprise. Compared to the big cathedrals in the Plaza de Armas it does not look like much from the outside, but keep in mind it was the first church built in Cusco and before that, guess what...it was an Inca burial ground. Before that... who knows. I do not identify with any particular religion, but felt that this site is sacred. The cost for the entrance and tour is minimal and they provide you with an nice short audio tour. After visiting this church I felt much more connected to the of the city of Cusco and it's deep history."
        }, 
        {
            "index": 415, 
            "rating": "4", 
            "review": "Great place in Cusco. I enjoyed the culture, the sights and the great prices. If you want to find some great reataurants in Cusco, San Blas is the place!"
        }, 
        {
            "index": 416, 
            "rating": "4", 
            "review": "Fascinating area. Nice colonial back street area. Lots of nice little eating places and even the odd museum !Felt very safe wandering around during the day."
        }, 
        {
            "index": 417, 
            "rating": "4", 
            "review": "Worth the walk. We walked up the hill to the top of San Blas and, breathless though we were, we were glad we did. There was one store that had excellent ceramics. There were 4 of us and one of our companions bought two prints, which were lovely, at another shop."
        }, 
        {
            "index": 418, 
            "rating": "4", 
            "review": "Nice streets to take a walk in. Nice artists' quarter, you can loose youself walking through these streets. Nice shops and small galleries."
        }, 
        {
            "index": 419, 
            "rating": "5", 
            "review": "Cusco Distilled. This is a lovely spot, a short, but uphill, walk from the center of the city, but well worth the the effort. Charming small square surrounded by colonial era buildings, a magnificent church and at least one memorable restaurant."
        }, 
        {
            "index": 420, 
            "rating": "5", 
            "review": "Must visit while in Cusco. You must visit San Blas while in Cusco. It just a cute, artsy little part of town where you'll want to wander around, visit shops, stop in a cafe, etc."
        }, 
        {
            "index": 421, 
            "rating": "4", 
            "review": "Good area to stay and visit. Quite a few shops to browse around, although we couldn't find any jewelry. Lovely little square to watch the world go by."
        }, 
        {
            "index": 422, 
            "rating": "4", 
            "review": "Beautiful area. San Blas is an area where there are lots of hostels and gringos. Lots of artsy people hang out there. They often have live bands at the clubs there as well as artisans that come with their wears on the weekends, The only problem I have is you have to walk(climb) to most of it. There is a steep incline from Plaza de Armas. The altitude is bad enough, when you do this for the first time you fee as though you are going to burst a lung. Take a taxi as far up as you can and give it a try."
        }, 
        {
            "index": 423, 
            "rating": "5", 
            "review": "Great Neighborhood with lots of Personality. I love hanging out here with all the crafters - I will come play music with them or just chat when I have a free day in the city. Lots of good food and shopping - you cant go wrong!"
        }, 
        {
            "index": 424, 
            "rating": "4", 
            "review": "quaint with some fun markets. Our hotel was in this area and in exploring around San Blas we found a little market of shops, a fish market and/or produce market, a fountain and some nice restaurants."
        }, 
        {
            "index": 425, 
            "rating": "5", 
            "review": "Loved this neighborhood!. San Blas is cool unto itself, but the walk from the Plaza de Armas to San Blas is really great as well. You get to see so much. Lots of eating, drinking and shopping to be had - but mostly it's the local artists and their wares that make this area so special."
        }, 
        {
            "index": 426, 
            "rating": "5", 
            "review": "Beautiful!. San Blas is a small little area of Cusco, full of culture. The people are down to earth and welcoming. There are tons of little cafes, resturants and many great, cheap places for vegetarians to eat. San Blas also offers many free or cheap galleries and places to biew all sorts of art. A must to visit!"
        }, 
        {
            "index": 427, 
            "rating": "5", 
            "review": "Beautiful Neighborhood in Cusco. Although very steep and hilly, the neighborhood is the best place in Cusco to explore. Lots of restaurants and shops."
        }, 
        {
            "index": 428, 
            "rating": "4", 
            "review": "Artisan Center. this is the centre of the artisan, around the Plaza de San Blas. close to the Main square of cusco, the are shops and art galleries"
        }, 
        {
            "index": 429, 
            "rating": "3", 
            "review": "Artisty neighborhood. This was very close to my hotel (a block away), it is packed with small art galleries but you must go into each one to really get a feel of the artist work each has something unique and differs from the typical art crafts you find in the rest of the local markets. Be warned, to be allowed into the San Blas church you have to either pay or by a collective ticket that allows entrance to a variety of churches in town included Cusco's Cathedral at the main plaza. San Blas church has a pulpit carved out of a single piece of wood that it is worth paying for. Adventure on side streets, I personally found the best local offerings at places that are kind off the main tourist path specially those located on Carmen Alto street."
        }, 
        {
            "index": 430, 
            "rating": "4", 
            "review": "Worth the huffing and puffing. Walked up and down the main street to/from Plaza de Armas. Lots of souvenir shops and restaurants. The original inca walls with a man dressed up as an Inca King was interesting. Stay at one of the B&B/hotel up on the hill for the great view of Cusco day and night."
        }, 
        {
            "index": 431, 
            "rating": "4", 
            "review": "Charming neighborhood. This is a charming neighborhood up the hill north of main square Plaza de Armas. There's a small central square lined with little shops and restaurants, further up there are winding cobblestoned streets with more shops, boutique hotels and tiny coffee shops. It's worth wandering around aimlessly taking in the picturesque views from various vantage points. Take it slow if this is your first day at this altitude. We had dinner at Pachapapa in the square, a very nice Peruvian restaurant - order carefully, the portions are large."
        }, 
        {
            "index": 432, 
            "rating": "5", 
            "review": "Vegan Travelers Paradise. As a vegan enthusiast of the arts, I always seek out the bohemian neighborhoods. I really loved San Blas!! There are so many great veg friendly restaurants, charming streets, and local artisan shops. I spent one whole afternoon just walking around taking pictures of the street scapes. It's a little dark and deserted at night, so be careful ! I wouldn't walk around alone after 11pm or midnight because it's simply not well light and there aren't many people around. Really LOVED dining in this neighborhood. A definite MUST if you're vegetarian, vegan, or health foodie."
        }, 
        {
            "index": 433, 
            "rating": "4", 
            "review": "Artsy. Located a little north of the plaza is the San Blas district. You'll need your walking shoes and be prepared for some steep roads. There are many small artisan shops to explore ranging from artists to instrument makers. Fun few hours, just more taxiing on the legs and lungs than I imagined."
        }, 
        {
            "index": 434, 
            "rating": "4", 
            "review": "Great little neighborhood but watch your step!. This is a fun neighborhood to explore. So many little streets and niches. The streets, steps, and walkways are mainly old cobblestones that have been burnished by time and wear. They are super slippery when wet. I love dogs (I'm a vet) and there are lots of them everywhere. Mostly friendly, but be sure to avoid bites! Our guide told us of one traveler who was unable to do their long-scheduled Inca Trail trip due to a bite on the leg the day before departure. And there aren't many places for the dogs to go, so there is poop everywhere. Wear shoes with good traction, beware the poop, and have separate shoes to wear in your hotel room for cleanliness."
        }, 
        {
            "index": 435, 
            "rating": "5", 
            "review": "Great little neighborhood. My friends and I had a nice time visiting the church and markets in the neighborhood an easy walk up the hill from the Plaza Armas"
        }, 
        {
            "index": 436, 
            "rating": "5", 
            "review": "BEAUTIFUL BUILDINGS AND HILLY STREETS. We stayed in this area and it was quite quaint with narrow streets in the hilly area. It is an easy walk to the main plaza and the great churches of Cusco."
        }, 
        {
            "index": 437, 
            "rating": "4", 
            "review": "Healing House. Healing House is located in these congested streets. The steps, the hills, the people - all absolutely fascinating. Even the taxi driver had difficulty wending his way through this area! The taxi drive itself is worth the visit! :)"
        }, 
        {
            "index": 438, 
            "rating": "4", 
            "review": "San Blas neighborhood. Make sure to see the church in San Blas Plaza. Also eat at Pacchapapa's. Great food! Try the trout or the roast lamb. Yummy!!!! Also don't miss the fiber artist, Maximo Laura's museum and gallery. His tapestries are amazing. They illustrate Peru's history in vibrant amazing colors and textures."
        }, 
        {
            "index": 439, 
            "rating": "5", 
            "review": "Love it!. Not only can you find amazing restaurants, but also great galleries to shop!! Had a great experience watching an artesian create those fabulous frames! Extremely friendly people! Great shopping! Please do not forget to visit the church of San Blass, pay a guide to share what they know! One thing I would love to share is that we must learn to respect the places of worship, As tourist we can be so loud and obnoxious! If we are there please stop and listen! Leave your chattering for when you are outside! People are very warm and generous!!! Can't wait to get back!"
        }, 
        {
            "index": 440, 
            "rating": "3", 
            "review": "Touristy place with lots of artwork and merchandise. A good place to buy souvenirs and/or artwork like pictures, statues etc. It is a nice and safe neighbourhood with many good restaurants and shops."
        }, 
        {
            "index": 441, 
            "rating": "5", 
            "review": "Great up-the-hill neighborhood.. This neighborhood up the hill from the Plaza has some great side street restaurants, shopping, and tiny bars. The place gets going at dusk and ends with the fireworks from Cuzco celebrations.\nA must visit area."
        }, 
        {
            "index": 442, 
            "rating": "5", 
            "review": "Near but easy to miss this place. I understand if you do not walk too much around in Cusco, because of high altitude sickness. However, there are small sections of places in Cusco where innate Peruvian culture still vividly alive. Please make your time to visit here and there. TOTALLY WORTHY!"
        }, 
        {
            "index": 443, 
            "rating": "5", 
            "review": "San Blas is a nice district with shops and restaurants. We stayed in SanBlas and enjoyed our time there, many shops and restaurants to enjoy. Be fit for the steep hills!"
        }, 
        {
            "index": 444, 
            "rating": "4", 
            "review": "San Blas neighborhood. We spent a morning wandering the narrow streets of Cusco's San Blas district. This is the artist area. There were several artist shops that were worth visiting, although not all were open."
        }, 
        {
            "index": 445, 
            "rating": "5", 
            "review": "San Blas is where it is happening in the historic district.. This is my favorite part of the historic district of Cusco. Don't let the small size of the Plazetos San Blas fool you. While it is lovely with its large water fountain and artsy craft stands and stores, there is so much more to the broader area of San Blas. My favorite hotels are in this area and the place is hopping until 10:00 at night. There are many small wonderful cafés to be found along its many side streets, as well as some very well known, larger restaurants. There are also great bakeries and unique antique shops. Take the time to walk along Carmen Alto, Lucrepata, and even Recoleta. The beauty of San Blas is discovering it's very steep and narrow streets and the fun of peering into the many ancient doorways. Because my hotel is on Cuesta San Blas I have spent a lot of time here and love how active it is with young tourists at night. You can also pass through this area on your way up to Saqsayhuaman if you are on foot. No need for taxis here or anywhere in the historic district! You can reach it all by foot if you have comfortable shoes. And it is all cobblestone, so leave your heels at home!"
        }, 
        {
            "index": 446, 
            "rating": "5", 
            "review": "Great area. This is the best area to stay in Cusco. You can walk everywhere from here yet it is so nice and quiet in your hotel."
        }, 
        {
            "index": 447, 
            "rating": "4", 
            "review": "A little enclave up in Cusco. This little neighborhood about a 10-minute walk up the road from the Plaza in Cusco is full of small art galleries and little restaurants. A nice, peaceful place to do some meandering."
        }, 
        {
            "index": 448, 
            "rating": "5", 
            "review": "marvecastel \"Amazing\". The plaza (Incan and colonial Square), and the Chapel were amazing! The work on stone and wood are excellent. The neighborhood is full of local artists and artisans. For a person that likes history and values art and culture, this is a perfect place to visit."
        }, 
        {
            "index": 449, 
            "rating": "5", 
            "review": "great neighborhood to get lost in. charming, artsy, funky, beautiful neighborhood to explore while in cusco. great little shops for souveniers and cool restaurants."
        }, 
        {
            "index": 450, 
            "rating": "5", 
            "review": "Fun Artsy Neighborhood. Pretty neighborhood with beautiful, whitewashed architecture and colorful doors. Craft center of Cusco, with artisans selling their wares. Gorgeous area and fun for buying handmade souvinirs."
        }, 
        {
            "index": 451, 
            "rating": "4", 
            "review": "Great place to visit and stay in Cusco. Wonderful array of restaurants, shops and excellent places to stay. Its elevation above Cusco ensure wonderful views of Plaza del Armas (be ready for some steep uphill walks though!) and its narrow streets and alleys are just waiting to be explored.\nA must do when travelling to the beautiful city of Cusco."
        }, 
        {
            "index": 452, 
            "rating": "4", 
            "review": "Cute place in Cusco !. This place is full of nice shops and good restaurants. Is charming and unique. You can buy nice souvenirs, paintings and eat good, for instance, Pachapapa restaurant is very good in the area."
        }, 
        {
            "index": 453, 
            "rating": "5", 
            "review": "superb church. what a great place this church is got a tour from the local guy there he was so proud of the great church and its fantastic history!!!"
        }, 
        {
            "index": 454, 
            "rating": "4", 
            "review": "hipster. cute little markets and spots to check out. there's a market on the weekends where they sell small trinkets."
        }, 
        {
            "index": 455, 
            "rating": "5", 
            "review": "gorgeous plaza. this area of cusco is full fo all kinds of great places to stay, eat buy great artesania. the fountains are nice to hang out by"
        }, 
        {
            "index": 456, 
            "rating": "3", 
            "review": "not what it was 'cracked up' to be. The plaza was full of older men drinking heavily as well as a really bad band consisting of mostly drunk men. The shops were OK, but many seemed to specialize in gaudy gold trinkets and Catholic pictures and statuary. Not at all the \"artsy\" community we had heard about."
        }, 
        {
            "index": 457, 
            "rating": "4", 
            "review": "Artistic Part of Cusco. Good for a 1 to 2 hour walk thru the shoppes and street vendors of San Blas. Walking the narrow streets in the evening is a neat thing to do! If pressed for time in Cusco, this is an area you could omit, as I did not see any \"Must see\" places or events here."
        }, 
        {
            "index": 458, 
            "rating": "4", 
            "review": "Authentic neighbourhood. Loved it here - narrow windy streets winding up a hill, lots of artisans, a bohemian type of character. Lots of little shops with a different type of product, and cheaper, than the nearby upmarket Nazarenas shops. Lots of cheaper cafes."
        }, 
        {
            "index": 459, 
            "rating": "4", 
            "review": "the cheaper part of Cusco. When you are in Cusco you should walk through the narrow streets of San Blas. It has a lot of tinny shops with some Original souvenirs. You can also have pretty cheap and delicious food here. the plaza is pretty and the people are friendly."
        }, 
        {
            "index": 460, 
            "rating": "5", 
            "review": "Beautiful and Quaint. Great little shops at the plaza with nice merch and cheaper prices than other areas. Don't miss out! Great place to get souvenirs."
        }, 
        {
            "index": 461, 
            "rating": "4", 
            "review": "Sweet small village. Hidden in San Blas, one will find delicious peruvian fare, with spectacular museum, will feel like you walked into a village hundreds of years ago."
        }, 
        {
            "index": 462, 
            "rating": "4", 
            "review": "Neat church in neat neighborhood. Great neighborhood with cafes and small restaurants and shops, nice market in the plaza, but buy a ticket and see the church. While the church in general is very nice and worth the trek, it really is all about the pulpit. WOW! Woodcarvers, be very, very jealous of this artisan's talent. They have a book on the pulpit for sale for the art historian/architecture buffs."
        }, 
        {
            "index": 463, 
            "rating": "4", 
            "review": "Worth walking thru it. The artsy district of the city of Cusco where you walk thru narrow streets, visiting art galleries and checking out the many stores around. It composes part of what cusco is all about, so I'd say definitely make it there and walk thru it, even if it's just for an hour or two."
        }, 
        {
            "index": 464, 
            "rating": "5", 
            "review": "Artsy area of Cusco. We walked up here our last night. There are art galleries and nicer handicraft stores. It has a neat vibe. Skinny streets. Sidewalks that get down to about a foot wide. Its up a hill a bit, so the views down towards the rest of Cusco are pretty-especially at night all lit up. There is a church up there. We got there just as a craft fair was being taken down for the night. Fun stores to wander in and restaurants. We wish we had ventured up there earlier, so we could have visited twice."
        }, 
        {
            "index": 465, 
            "rating": "5", 
            "review": "Artsy Hip Cusco. We where walking back into Cusco from our day hike to the ruins above the city which is another adventure. As we came down the beautiful stone streets surrounded by ancient stone walls quarried by the Incas we arrived in a lively area of shops and restaurants where we bought an oil painting from a local artist and made dinner reservations for later that evening at Pachapapa. A beautiful part of Cusco."
        }, 
        {
            "index": 466, 
            "rating": "4", 
            "review": "Interesting area. you can get some great buys on alpaca blankets and textiles here. You probably don´t need to go further than the plazoleta of San Blas because then it starts getting a bit ´bohemian´. We wanted to eat at Papapacha but the wait was too long and we thought it was over-priced so we ended up at a restaurant in the Plaza Mayor which was better, Chicha. Try it!"
        }, 
        {
            "index": 467, 
            "rating": "4", 
            "review": "Funky little area of Cusco. Worth the hike up the narrow street to see the large water fountain and small church. Lots of nice funky shops in this area which has a nice selection of cool things to purchase. Also, has several good restaurants in the area."
        }, 
        {
            "index": 468, 
            "rating": "5", 
            "review": "San Blas a must. If you are in Cusco for only one day, be sure to leave a few hours to walk up through the San Blas area. It is much less touristy than Plaza del Armas, with great shops, pastry shops and cafés."
        }, 
        {
            "index": 469, 
            "rating": "5", 
            "review": "Great walking in narrow streets. Outdoor artisan market on weekends, carved pulpit in the church (on the left wall near the front (from a single tree) is trull;y spectacular if you appreciate woodwork (incredible details, on a massive scale), highly recommend Jack's as the safest food in Cusco."
        }, 
        {
            "index": 470, 
            "rating": "4", 
            "review": "San Blas Church. Beautiful church specially the altarpiece but falling apart with no maintenance at all everywhere. Peru authorities do something!"
        }, 
        {
            "index": 471, 
            "rating": "4", 
            "review": "Worth a Visit. This is a small \"Bohemian\" area of Cusco full of small shops of artisania and galleries. It is a great place to wander around, sit in the central square, have a coffee or lunch."
        }, 
        {
            "index": 472, 
            "rating": "5", 
            "review": "Festival was amazing in town.. Prices very reasonable for alpaca sweaters and other items.\nAtmosphere fantastic! Had a festival and they were passing around free sandwiches and drinks and dances being presented in front of the lovely water wall fountain."
        }, 
        {
            "index": 473, 
            "rating": "5", 
            "review": "Lovely fountain in artesian area. The steep walk up the hill to the church and market area is well worth the walk. Many little galleries to explore as you walk up to the market area."
        }, 
        {
            "index": 474, 
            "rating": "4", 
            "review": "Artist quarter. Plazoleta de San Blas is at the heart of one of the nicest districts in Cusco. It is a popular area where tour groups stay and there is a young backpacker feel about the place. The square itself has a large fountain at the back and is populated with artists selling their wares. Surrounding the square are a number of galleries and San Blas church which has an ornate carved pulpit. You will also find a museum to the Peruvian artist Hilario Mendivil."
        }, 
        {
            "index": 475, 
            "rating": "4", 
            "review": "Bohemian Art Quarter. San Blas is one of the nicest districts in Cusco to walk around. It is situated on a hill, just five minutes walk from the Plaza de Armas and is centred on Plazoleta San Blas. This square has a fountain running along the back and is surrounded by art galleries and quaint shops with balconies. Narrow cobbled streets lead down to the main part of Cusco, many built on visible Inca foundations. San Blas Church is one of the oldest in town, it has a lovely carved pulpit. There is also a museum to the Peruvian artist Hilario Mendívil."
        }, 
        {
            "index": 476, 
            "rating": "5", 
            "review": "Lose yourself for a few hours walking aimlessly thru SB. Most of the time you have in Cusco, SV, and MP will likely be focused on Incan ruins, religious buildings, and specific sites. Do yourself a favor and set a few hours aside to wander thru SB and just up the ambiance and architecture this incredibly interesting neighborhood. The winding, narrow streets remind me of Chinese Hutongs! Also there are domestic dogs everywhere, far too many to ever count once you start climbing into the warren's den of streets further up from the church.There is a church and plaza with an excellent waterfall fountain, and some small shops adjacent to it. If visiting on the right day ( and I am not sure which this is, it was there one day and not the next ) there is a craft market in the plaza. The area around the upper part of the plaza has a real hippy, backpackers feel to it with vendors setting up shop on blankets on the sidewalk and selling handmade crafts and bodywear. I know time is so precious when traveling, but if you can spare a morning to just lose yourself in SB I think you will enjoy it immensely!"
        }, 
        {
            "index": 477, 
            "rating": "4", 
            "review": "Cool area of the city. Not far from the main square. On the way there you can see the 12-sided-stone. San blas is a nice little area."
        }, 
        {
            "index": 478, 
            "rating": "5", 
            "review": "Charming neighborhood. Lots of great shops and restaurants to explore down many side streets. Some interesting art galleries too."
        }, 
        {
            "index": 479, 
            "rating": "4", 
            "review": "Lovely hilly neighborhood. Charming, old world, with lots of good places to eat (not the usual tourist traps). Visit and if you can, stay there."
        }, 
        {
            "index": 480, 
            "rating": "4", 
            "review": "the wall at san blas. great look for the 12 sided stone, there will probably be an inca king standing next to it for photos..."
        }, 
        {
            "index": 481, 
            "rating": "4", 
            "review": "nice neighborhood, great views.. nice neighborhood, great views. nice art and souvenirs. i was with kids and stroker is not the best option, sling would work better"
        }, 
        {
            "index": 482, 
            "rating": "5", 
            "review": "San Blas. Beautiful. It looks down on the city. Has nice shops, restaurants, etc. I liked the feel of it. Very peaceful and less harried than the center of Cusco."
        }, 
        {
            "index": 483, 
            "rating": "3", 
            "review": "Just a part of Cusco. Lots of shops selling paintings and religious artifacts. Step walk up if you have a problem with the altitude"
        }, 
        {
            "index": 484, 
            "rating": "3", 
            "review": "Lovely uphill area. Climb the stairs/side walk and stroll this lovely barrio. Hailed as the art center of Cusco, it really isn't much of one. The area is picturesque and worth the short climb."
        }, 
        {
            "index": 485, 
            "rating": "4", 
            "review": "Away from the main crowds.. Good place to find some local crafts without the hordes of people. Good place for lunch right across from church. Some local crafts vendors on street. Quaint area. Good place after walk down from ruins."
        }, 
        {
            "index": 486, 
            "rating": "5", 
            "review": "Best View of Cusco. Walking pass the hippies selling cheap bracelets you climb steps to be rewarded with a magnificent view of the Cusco. Worth every effort."
        }, 
        {
            "index": 487, 
            "rating": "5", 
            "review": "cozy. San Blas is very beautiful, a very special neighbor where you can find artisans. The church is very beautiful too, the fountain and the restaurants around it. I would recommend visiting San Blas between 6pm and 9pm, maybe for dinner."
        }, 
        {
            "index": 488, 
            "rating": "3", 
            "review": "Nice neighborhood...scruffy San Blas plaza. The highlight of San Blas is the narrow street or two that eastward up the hill from Plaza de Armas into this neighborhood with its original Incan walls....San Blas feels moderately \"nicer\" than other surrounding neighborhoods but the stores appear to sell pretty much the same artisan crafts/hats/blankets, etc to be found all around old Cusco...perhaps there are some specialized gallerys there that we missed but it didn't appear so. Jack's Cafe is supposedly great in San Blas. The small little San Blas plaza at the top of the hill was a dissapointment, however, with the church either closed or requiring admission $$ and the adjoining plaza was weed-strewn and not very pleasant."
        }, 
        {
            "index": 489, 
            "rating": "4", 
            "review": "Nice environment, good walking. Give a break on just jumping to one attraction to the other in Cusco town and surrounds, and take a couple of hours to promenade at San Blas. Calmly walk around in the streets behind Cusco cathedral and San Blas square. There are countless handcraft shops selling cheap souvenirs (certainly where you'll find the largest variety) to art galleries with beautiful pieces, and a handful of small and nice places to eat scattered in the streets. It is touristic, no doubt; but it is also very much Cusco in itself."
        }, 
        {
            "index": 490, 
            "rating": "4", 
            "review": "A nice neighborhood. San Blas is located pretty close to the center, it is a nice artisan neighborhood. You can find small restaurants and cafes, as well as souvenir shops. It is a short walk uphill, and all the way to the top you can have a view of the city of Cusco. It is easy to go around and discover different things around there. There is a church in their small square which is very nice.At night there is a also a couple of bars around which host live bands. If you want to get out of the crowded center, San Blas would be my recommendation."
        }, 
        {
            "index": 491, 
            "rating": "5", 
            "review": "So much to experience. The shops, the cafes, the winding, cobblestone streets and the view at the top of San Blas make this a must-see destination while in Cusco."
        }, 
        {
            "index": 492, 
            "rating": "5", 
            "review": "Fun Bohemian area to walk through. This is the artist section f Cusco, about 4-6 blocks up from Plaza de Armas. It is a hang-out for bohemian/hippie types, among local residences. We quite enjoyed just walking around and getting lost amid the maze of narrow streets, stumbling onto to a local market, and discovering small shops with interesting things to browse."
        }, 
        {
            "index": 493, 
            "rating": "4", 
            "review": "A Great Area of Cusco. This charming area is a must visit while in Cusco. A 10 minute walk uphill from the central Plaza de Armas, along Triunto Street which turns into Hatun Rumiyoc, brings you to the heart of San Blas with a nice adobe church, the Iglesia de San Blas. While we visited there was a small religious festival about to happen. The locals were building a large religious display up containing statues of many saints. There were also local artisans showing their wares for sale in the main square of San Blas. The view over Cusco from the top of the church is not to be missed. There are many shops to poke around in. A greast way to spend to an hour or two."
        }, 
        {
            "index": 494, 
            "rating": "3", 
            "review": "Parish church. You should visit this church if you are in the vicinity, it's not worth a detour. It's nice enough but if you've seen the larger churches at Plaza de Armas you are probably satisfied already. You can walk up in the tower for a view of the surroundings. An endearing touch is the sign asking visitors not to toll the bell (the rope is there for you)."
        }, 
        {
            "index": 495, 
            "rating": "3", 
            "review": "Small, but quiet.... San Blas is a smaller and quieter park that is surrounded by quaint cafes and shops. It is not laden with solicitors who will relentlessly bother you. If you are looking to sit in the park and read or to enjoy some nice little eateries, then this is the place for you."
        }, 
        {
            "index": 496, 
            "rating": "5", 
            "review": "Great spot to visit.... Distance walking from downtown Cusco, very close to Plaza de Armas...local artists..arts...very pretty"
        }, 
        {
            "index": 497, 
            "rating": "4", 
            "review": "San Blas by evening. We ventured up the long steps to San Blas last night to visit the Indian restaurant Korma Sutra. I didn’t like the restaurant much, but I loved the area, with it’s narrow cobblestone laneways and abundance of cafes and bars (see my pictures).I wouldn’t recommend staying here though, as the climb up the stairs from town would get old very quickly. Because it’s a trendy area the hotels and hostels here tend to charge a premium. The weekend market in San Blas might be worth checking out."
        }, 
        {
            "index": 498, 
            "rating": "4", 
            "review": "Great place to do some shopping. We walked up the street from the cathedral to the San Blas church. The street is v. narrow and has shops all along it. We learned that we could bargain with the shopowners and find some good prices. Everyone was v. friendly... However, do NOT venture beyond the San Blas church as the area becomes less safe."
        }, 
        {
            "index": 499, 
            "rating": "3", 
            "review": "Artists area of Cusco. A walk around the area will reveal various types of local art.There are a variety of restaurant hidden amidst the streets and are worth checking out. The famous? 12 sided stone will be found in an Inca wall not far from San Blas area."
        }, 
        {
            "index": 500, 
            "rating": "5", 
            "review": "Cool cultural neighbourhood. Must see, especially on Sat & Sunday market days.Great architecture. Square with fountain.Street above the fountain is compared to Las Ramblas from Barcelona. Take the stairs up from the fountain, turn left walk a short ways and stop in to the Luther there, very talented man where you can view, play, and purchase traditional instruments (guitar, flute, drums)."
        }, 
        {
            "index": 501, 
            "rating": "5", 
            "review": "San Blas is great!. San Blas is a nice place to walk around, it's great specially because it's on the top of the mountain and it has amazing views of the city! The area is chill, it has some nice restaurants, and great to walk around. If I had to choose a place to stay in Cusco I would not stay here as you need to walk up the stairs a lot and it's heavy duty.... jajaja I would recommend something closer to Plaza de Armas..."
        }, 
        {
            "index": 502, 
            "rating": "4", 
            "review": "Most beautiful part of Cusco. Nice hike up from Plaza de Armas. Charming small galleries. restaurants/ coffee shops ( very touristy though). The most beautiful views on Cusco."
        }, 
        {
            "index": 503, 
            "rating": "5", 
            "review": "Great neighbourhood. Very safe neighbourhood. Lots of shops, galleries, and restaurants. It is meant to be a very arty community."
        }, 
        {
            "index": 504, 
            "rating": "4", 
            "review": "Worth a walk around. Up a couple of hills, past all the street vendors and you come to this little square. Nice to walk around but I guess our experience was shortened by a torrential downpour. However it did force us into a small café for a coffee and a beer and made me realise that there are probably quite a few nice little restaurants around this are so if you are looking for something different from the main square walk up to this area. Also plenty of little shops selling local crafts."
        }, 
        {
            "index": 505, 
            "rating": "5", 
            "review": "The place to be!. This is the most traditional \"barrio\" of Cuzco. In case you are looking for authenticity and a great cultural experience then make sure you book one of the many hostals in this part of Cuzco. We stayed at the “Pension Alemana” and would always go back there. Enjoy!"
        }, 
        {
            "index": 506, 
            "rating": "5", 
            "review": "Hippie Heaven!. Definitely the bohemian part of town, if you want to get away from the typical tourist stuff for a moment in time. Head up to San Blas Square and enjoy the treasures it has to offer ... especially the vendors above the waterfall."
        }, 
        {
            "index": 507, 
            "rating": "4", 
            "review": "Great Location. It was a bit of a puff up the stairs to get there, especially when lugging around suitcases, but there's lots on offer - views, cafes, bars, restaurants, accommodation."
        }, 
        {
            "index": 508, 
            "rating": "5", 
            "review": "A must if you're in Cusco. Really quaint and nice to visit. It was nice to see a different part of Cusco. Great restaurants there!"
        }, 
        {
            "index": 509, 
            "rating": "5", 
            "review": "Cobblestone Streets. Cobblestone streets with breathtaking views. Don't go there the very first day you get to Cuzco. Need to acclimate to the altitiude. Just a few steps in this area will wear you out. Great places to shop and eat."
        }, 
        {
            "index": 510, 
            "rating": "4", 
            "review": "Old town Cusco. This part of Cusco is amazing. Narrow cobblestone streets, so steep that the sidewalks are stairs. Unfortunately the cars race through here as though these are normal streets. And the sidewalks in places are maybe a foot wide. So there have been a lot of near misses!The shops are quaint and there is a lot to choose from just walking down a street. The vendors are REALLY pushy, though. They don't take no for an answer. Don't buy the paintings from the street vendors! The first guy told us that he had studied in art school for 5 years and was now trying to sell his paintings. 5 minutes later another guy was selling his paintings. The exact same paintings!!! Huh."
        }, 
        {
            "index": 511, 
            "rating": "4", 
            "review": "Lovely. Very nice but be prepared to pay the locals 1-2soles for a picture. Maybe even more if they have a llama and let you pet it. We avoided this as they are just exploiting perus natural atmosphere."
        }, 
        {
            "index": 512, 
            "rating": "4", 
            "review": "Great little neighborhood. Definitely worth the trek uphill. I found it less 'touristy' (if that's possible in Cusco) that most of the rest of the town. Really enjoyed the views from the tiny streets."
        }, 
        {
            "index": 513, 
            "rating": "5", 
            "review": "Gorgeous. Simply charming. It is a trip to get up there, especially when you just off the plane. Don't miss it, it's one of the cutest places i've ever seen!"
        }, 
        {
            "index": 514, 
            "rating": "5", 
            "review": "Great neighbourhood to walk around. Hilly*, picturesque neighbourhood with plenty of shops, cafes/bars/restaurants, museums, hotels and narrow streets. Close to the main square and enroute to Saksaywaman.\n*Not the most easy place to walk if one has mobility limitations."
        }, 
        {
            "index": 515, 
            "rating": "5", 
            "review": "Different side to Cuzco. The more sophisticated side to Cuzco, nice art work stores and more chic restaurants, well worth the walk in the area."
        }, 
        {
            "index": 516, 
            "rating": "5", 
            "review": "Wonderful Neighborhood. We stayed in San Blas for 8 nights before and after the Inca Trail. It's so cute and each side street has numerous cute/inexpensive shops and amazing restaurants. Even though it's a little up hill (difficult when you are suffering the altitude), it's nice to be above the busy city square. One day I fell ill and the rest of our trekking group went out. I was well enough to walk around alone that afternoon, and I felt completely safe."
        }, 
        {
            "index": 517, 
            "rating": "3", 
            "review": "Tourist Trap. Apart from the hippy waffle cafe (which was great), and the Church, the rest of the area is a bit twee with stalls selling the same things that can be found elsewhere. Not really worth the drag up the (quite steep) hill."
        }, 
        {
            "index": 518, 
            "rating": "4", 
            "review": "San Blas. Charming area of Cusco. We had a guided tour of the cathedral which was a highlight. Stumbled upon a German restaurant, Heidi, with a filling prix fixe menu for 15 soles ($5)."
        }, 
        {
            "index": 519, 
            "rating": "5", 
            "review": "San Blas. Very nice area, with easy access to many great restaurants. The narrow cobblestone streets accommodate both pedestrians and motor vehicles, so be aware. Short walk to Plaza de Armas, Cusco and the San Pedro Market, which is a must visit, not only for their fruit smoothies but also for lunch at one of the local food vendors; it is actually quite an experience for about $1.00 US.Area appeared fairly safe; but of course one has to be careful in any part of the world. The locals are the most helpful people that I have encountered thus far."
        }, 
        {
            "index": 520, 
            "rating": "5", 
            "review": "San Blas rocks!. For the last month, I've been staying in the San Blas area in a small hostel at 114 Tanda Pata with private room, bathroom and use of a kitchen for just 20 soles a night and feel at home in this wonderful community. This is a hippy and artesian area with narrow cobbled streets and an array of bars, cafes, restaurants, shops, galleries etc to explore. I've been here for four weeks already and never tire of exploring the area. The San Blas market is small and there's a fantastic Veggie food stall called Govinda Lily's just by the main entrance where you can eat a delicious 2 course meal for just 6 soles. There are also some fresh juice stalls which are amazing value. The church at San Blas is home to an incredible pulpit carved from a single piece of cedar wood which is a work of art and a must see. I feel very safe here, no matter what time of day or night I'm wandering about. I like to sit in the Plaza facing the water feature and writing my journal. More often than not, local people come and sit next to me and I have the opportunity to practise my Spanish. There's an amazing bakery on Tanda Pata called Pantastico and their chocolate brownies are the best I've ever tasted (on the right as you go up the stairs by the water feature). Their vegetable empanadas are great too. I'm going to find it difficult to leave this area - I feel so at home here."
        }, 
        {
            "index": 521, 
            "rating": "4", 
            "review": "Very good artist district. It is known by the artistic production, but also by the parties. They told me that being alone at night could be dangerous, and I heard many stories of women been attacked, but was fi9ne for me. Sure we have to be alert, because the locals or the peruvians who are there will also be offering some druggs. I like this place and was thinking in renting an appartment for longer stays."
        }, 
        {
            "index": 522, 
            "rating": "5", 
            "review": "Well maintained; charming. Narrow streets and sidewalks, tiny shops, and a well maintained central plaza make this a charming area. Lots of great restaurant options, some with a great view from the second story overlooking the plaza (I recommend Limo). There are plenty of tourists around, so expect merchants, taxi drivers, and restaurant servers to offer their services.Be warned, pedestrians do not have the right of way when crossing the street!"
        }, 
        {
            "index": 523, 
            "rating": "3", 
            "review": "Town Square. San Blas is a nice little gathering place--another town square. Shops and vendors surround the perimeter.Watch out for the older folks dressed in original garb with lamas...it's one soles for a photo but after you snap the photo each person will fight you for a sole each...not fun when you were led to believe you already paid them."
        }, 
        {
            "index": 524, 
            "rating": "5", 
            "review": "be sure not to miss. Be sure to walk the steep street up to San Blas, you will see the original Inka foundations along the way, and it is an interesting section of town to explore for shopping, lots of tourist stuff of course, but other interesting shops mixed in"
        }, 
        {
            "index": 525, 
            "rating": "4", 
            "review": "Beautiful at night!. Nice, artistic district. The fountain at the center is gorgeous at night and a must see. Lots of cute little shops and street vendors, but at night really is the best time to check this area out."
        }, 
        {
            "index": 526, 
            "rating": "5", 
            "review": "Quaint unique area with lots of hidden gems. We wandered up to this quaint area, the narrow streets, small shops and numerous eateries. Wandered might be a strong term, as we'd only just arrived in Cusco and were trying to acclimatise, getting there involved many steep steps (usually not a problem) but 3,000m higher up it was a struggle.It also has some great views over Cusco. Overall a must do when you visit Cusco!"
        }, 
        {
            "index": 527, 
            "rating": "4", 
            "review": "Naked old lady bathing in water feature. LOL!!! We were there waiting for a taxi, when an lady striped down and took a bath in the falls. There is a great restaurant in the back corner of the plaza that serves great waffles, but none of us can remember the name. Also local merchants selling their goods."
        }, 
        {
            "index": 528, 
            "rating": "5", 
            "review": "Perfect, charming area to stay in Cusco. Narrow cobblestone, charming streets, views of the hills, charming small squares with charming small churches (and a large density of artisan markets, and small shops). A short walk from the center and to many excellent places to eat."
        }, 
        {
            "index": 529, 
            "rating": "4", 
            "review": "The up market end of town. Yes this is a entertainers corner, the Arty-music-jewelry- foodie area, views all over Cusco, plenty of reasonable accommodation- if you are unsure of where to stay this is for you-safe and easy walk to the central Square (everything in Cusco)."
        }, 
        {
            "index": 530, 
            "rating": "5", 
            "review": "Laid-back hippie and artistic neighborhood. Looks a world of difference compared to rest of Cusco.Liked pretty much the atmosphere, nice bars and restaurants with amazing food set up in menu's at a relatively low cost."
        }, 
        {
            "index": 531, 
            "rating": "5", 
            "review": "San Blas Plaza. We stay at the hotel Casa San Blas, the plaza was like a 3 minute walk, very small quiet area ,\nthere is not much to do except to relax, walk, take pictures, souvenirs, eat, churches"
        }, 
        {
            "index": 532, 
            "rating": "5", 
            "review": "Great street to visit!. We wandered up this quaint, narrow street and really enjoyed it! Lots of shops and great feel. A must when you visit Cusco!"
        }, 
        {
            "index": 533, 
            "rating": "3", 
            "review": "Watch out for the hippies. Yes it is a nice place but it would be even cooler if it weren't for the dirty hippies that linger around stinking up the joint. I have nothing against such people most of them are just having fun traveling from place to place, selling their artisan stuff. Some on the other hand are drunk, high and just begging. One joker asked if he could \"borrow\" 100 soles. How about five...right across the face! The most concentration of hippies smells like a toilet because, well they pee anywhere and every where. If you go there I wouldn't go to late in the day."
        }, 
        {
            "index": 534, 
            "rating": "4", 
            "review": "A great area to explore. We all enjoyed wandering the streets/paths/steps that wound through this hillside community with great views of Cusco"
        }, 
        {
            "index": 535, 
            "rating": "4", 
            "review": "Artisan Neighborhood. With shops and small restaurants, this is a lively, interesting neighborhood in Cusco. Stroll the streets, poke into the galleries and boutiques, stop for a pisco sour or meal at one of numerous cafes and restaurants."
        }, 
        {
            "index": 536, 
            "rating": "5", 
            "review": "Best place to stay while visiting Cuzco. I really enjoyed San Blas. Just the right blend of quiet & quaint, and artsy cafes and tourist shops. Small little streets lined with interesting places. It's built on a steep hill, so you get a workout walking around.The only thing I would change about San Blas is the vehicle traffic. Pedestrians do NOT have the right of way, and the streets are very narrow."
        }, 
        {
            "index": 537, 
            "rating": "4", 
            "review": "Great neighborhood to explore from. I stayed in two different areas during my stay. The first was in San Blas and the second was near the train station. San Blas was much more beautiful, safe and friendly than the other neighborhoods we walked through. Highly recommended."
        }, 
        {
            "index": 538, 
            "rating": "4", 
            "review": "Quaint neighborhood in Cusco. San Blas has no real access by car. A leisurely afternoon or morning walking thru these cobble stone narrow streets will be appreciated. There are shops and restaurants. If you have time, I would highly recommend spending a few hours in San Blas and have lunch."
        }, 
        {
            "index": 539, 
            "rating": "5", 
            "review": "Artsy, steep, lovely, quiet!. The walk from the Plaza de Armas up into San Blas requires a lot of endurance! Narrow stairs all the way up may be a challenge but well worth it.San Blas is so quiet and interesting. Many shops, restaurants, and hostels along the path. Streets are narrow and a bit muddy when it rains so mind your wheeled suitcase! Love the quaintness and architecture. The locals are so kind and helpful.GO! What are you waiting for?"
        }, 
        {
            "index": 540, 
            "rating": "5", 
            "review": "Nice neighborhood. It has a nice view to Cuzco. There you can find many cafes and bars with different themes. the streets are narrow but very nice. It is a beautiful place to walk day and night. It is quiet but with a very bohemian life."
        }, 
        {
            "index": 541, 
            "rating": "3", 
            "review": "Only Visit if You Have Extra Time. I wanted to visit this area because I had heard it was the artists' district. I think my expectations were too high. It had the same cheap, touristy things as other areas. I was looking for art galleries - maybe we just didn't have enough time to explore. i would only recommend visiting if you have extra time - but I would not make this area a priority in Cusco."
        }, 
        {
            "index": 542, 
            "rating": "3", 
            "review": "Over hyped. Nice markets, great location but in the evenings, it was over run with travellers and drunk 20 year olds. Pricey and upmarket restaurants - should be better than it is."
        }, 
        {
            "index": 543, 
            "rating": "3", 
            "review": "Interesting little area. Lots of interesting shops in this area, However I discovered that the artisional market had the same stuff for much cheaper. Definitely bargain as much as you can here!"
        }, 
        {
            "index": 544, 
            "rating": "3", 
            "review": "market streets. Charming alleys with local artisans keen to sell their wares. Reminded me of Souqs in Tunisia. Practice saying 'No' before you go and stick to your budget."
        }, 
        {
            "index": 545, 
            "rating": "4", 
            "review": "beatutiful square. Good restaurant directly across from the church with a nice outdoor patio. Cant recall the name of it, but the food was delicious. The Alpaca steak was the best we had in Cusco."
        }, 
        {
            "index": 546, 
            "rating": "4", 
            "review": "Go to the Markets. Go to the markets, go tp the juice (jugos) stands, and ask for a jugo de lucuma con leche. Get lots of brown sugar. It is the best thing ever. The fruits are organic, and so fresh."
        }, 
        {
            "index": 547, 
            "rating": "5", 
            "review": "You must walk up here to get a real sense of Cuzco. It is steep but worth it. We took a lane up and because it's on hill behind Plaza de Armas it would be very hard to get lost. Just windy lanes and a wonderful square with artisan shops and a fab museum dedicated to a famous local dead artist whose name evades me but which isn't in Lonely Planet.Down a bit and you come across the most bijou Plazoleta Nazarenas which boasts 4 five star hotels. Too posh for us unfortunatelyLots of good restuarants around."
        }, 
        {
            "index": 548, 
            "rating": "5", 
            "review": "neighborhood to stay in. If you don't mind the hike up to reach your hotel every night, I recommend this neighborhood for lodging. Easy access to the main square, great restaurants and nice little plaza at the top of the hill."
        }, 
        {
            "index": 549, 
            "rating": "5", 
            "review": "Bohemian San Blas. Nice place to have a traitional meal in Restaurante Pachapapa. Only 15 minutes away from the city center in Cusco. You will like the small streets and the ambiance."
        }, 
        {
            "index": 550, 
            "rating": "4", 
            "review": "Go late as nothing is open in the mornings. The views of the city from the San Blas area are lovely, and worth the hike up the steep steps to get there. However, if you're looking to visit the shops and eateries in this area, go after about 1pm as nothing much is open before then. There are some nice handicrafts for sale from a small open-air market at the top of the fountain in the San Blas Square where there are artisans making their wares, and hair braiding is on offer. Check out The Meeting Place Cafe in the Square for good, cheap, socially responsible food - 100% of profits go to local charities and projects."
        }, 
        {
            "index": 551, 
            "rating": "4", 
            "review": "Historic neighborhood. A beautiful and historic area in Cusco city that one must walk. It also houses really nice shops with all kinds of handicrafts for sale. Also check for antiques"
        }, 
        {
            "index": 552, 
            "rating": "5", 
            "review": "The Bohemian heart of Cuzco. Artisty, unique, authentic\nSan Blas is the patron saint of artists and the neighborhood is just that an artistic display of paintings, crafts, jewelry. Must visit."
        }, 
        {
            "index": 553, 
            "rating": "5", 
            "review": "Great place to purchase art. San Blas was a bit of a hike from the Plaza de Armas but it is worth it. There are lots of shops selling amazing religious paintings, as well as the traditional touristy stuff too. Several good restaurants are located here too."
        }, 
        {
            "index": 554, 
            "rating": "3", 
            "review": "very touristy. The district is for artists, unfortunately most of the work on display is more touristy than artzy, nevertheless if you spend enought time there you can find some interesting work that elsewhere could be worth something"
        }, 
        {
            "index": 555, 
            "rating": "4", 
            "review": "Good food and shopping. Pachapapa restaurant is here; lots of shops selling Cusquena art.\nChurch here has one of the most impressive carved wooden pulpits in the Western Hemisphere."
        }, 
        {
            "index": 556, 
            "rating": "4", 
            "review": "Worth the hike. San Blas isn't undiscovered. But it's better than milling through the throng of people closer to the plaza. If obviousness bothers you, San Blas is a partial cure: the walk up from the plaza may make your head throb (given that you're already at 11,000 feet above sea level), but it's worth the hike to find quality artisan shops, funkier little bars and 4-table restaurant nooks, lesser-known courtyards and a wandering llama or two. In San Blas, the general law of overseas travel applies: The less convenient a place is to get to, the fewer bozo travelers you'll encounter and the more interesting your experience will be."
        }, 
        {
            "index": 557, 
            "rating": "4", 
            "review": "Worth a tough walk up. Very steep clim up here but it's a nice area. On your first day if you are not acclimatised yet you may find it to tough going to get to it so leave it to the second day"
        }, 
        {
            "index": 558, 
            "rating": "5", 
            "review": "Pretty view. Love to sit here and just read and see how life goes by, but it feels great! What i dont like so much is all the mochileros trying to sell you candies, im old enough to get candy from strangers, but i have no clue how they were done, they never look that good, be aware of it."
        }, 
        {
            "index": 559, 
            "rating": "5", 
            "review": "Loved it!. I lived in Cusco last year and first lived near the market (on Chaparro Road). I didn't like it at all, and I quickly moved to San Blas. San Blas has this really amazing vibe. It feels rustic and old, but yet retains many lovely restaurants and a square with a church. It's of course full or tourists and people trying to sell things to tourist. So the only annoying thing is that I would walk out my front door and have half a dozen sellers trying to sell me something. But it's just an amazing place and I am sure I will move back there again sometime in the future."
        }, 
        {
            "index": 560, 
            "rating": "3", 
            "review": "Great Location. We stayed at San Blas while traveling to Machu Picchu. The staff was helpful and stored our packs for a couple of days while we visited Machu Picchu - very helpful.The included breakfast was adequate and on par with what we paid for our accommodation.The room was a good size with comfortable beds. The bathroom was adequate, but like many hotels and hostels, the hot water was sporadic.Because Cusco is in the Andes, the nights are cold, so be prepared to pile on an extra blanket - which was available in our room.The location was great to explore the older areas of Cusco.There was good Wifi but weHad to go to the roof top patio - not a hardship.The restaurant next store was worth a visit too. Very good food reasonably priced. Overall, good value accommodation for the seasoned backpack traveller."
        }, 
        {
            "index": 561, 
            "rating": "5", 
            "review": "San Blas. Excellent place to live in Cusco! The view on the city is amazing and because of the steepness you will see if you are acclimatized for your trek!"
        }, 
        {
            "index": 562, 
            "rating": "5", 
            "review": "Beautiful area to explore and shop. San Blas is a short walk from the main Plaza de Armas. There are picturesque streets and alleys, and the stairs really aren't too bad. Good restaurants, too. The San Blas Plaza is certainly worth a visit when the artisans are out. Plenty of handmade goods to look at and purchase! The vendors all approach you to buy (like anywhere else in Cusco), but they aren't pushy and respect a \"no, gracias.\" For a good view of the city, keep walking higher in the neighborhood and turn around!"
        }, 
        {
            "index": 563, 
            "rating": "5", 
            "review": "Well worth the climb up!. The hike up the hill to this neighborhood was tough while we were acclimating, but it was well worth the view we were rewarded with! The bohemian neighborhood is filled with art galleries, churches, street vendors and of course Jack's place if you are looking for a traditional (non peruvian) big breakfast and sandwiches! Keep climbing up until you reach the overlook and look out over the city on the tiled roofs and congratulate yourself for the climb up. Your photos will be stunning!"
        }, 
        {
            "index": 564, 
            "rating": "4", 
            "review": "Walking Tour information helps with this area. We enjoyed walking around this area. But I think that it helped that we were following the walking tour information in our book, since it helped us to see areas we may have missed otherwise. It has a nice quaint feel to it when you get away from the clouds."
        }, 
        {
            "index": 565, 
            "rating": "5", 
            "review": "Great art, shops, plaza, restaurants.. Great Saturday local artisan mercado. Enjoyed a couple of dinners at PacchiPapas. Many music festivals take place in front of the fountain."
        }, 
        {
            "index": 566, 
            "rating": "5", 
            "review": "Fun Neighborhood. Fun place to walk around and shop, have a drink and eat. They had music playing in the square that we enjoyed."
        }, 
        {
            "index": 567, 
            "rating": "4", 
            "review": "The artistic area of Cusco. Prepare to do a lot of walking as this area is set on a very steep uphill , but if you make it to the top of the stairs the view of the city is incredible. We stopped at a little café for drinks and a bite to eat. The area looks very old and run-down, but there is nothing wrong with the food!"
        }, 
        {
            "index": 568, 
            "rating": "4", 
            "review": "Nice part of town. I stayed at a hotel in this district. It is very pretty and high up. Has a lovely park and nice bars and restaurants."
        }, 
        {
            "index": 569, 
            "rating": "4", 
            "review": "Nice neighborhood. Windy streets with a lot of shops. If you've been tramping through the mountains and your wife needs a taste of civilization, take her here to do some shopping."
        }, 
        {
            "index": 570, 
            "rating": "5", 
            "review": "A beautiful place to stroll. This is a really romantic place. Little streets, little shops, little restaurants. It is a wonderful place to get lost and stroll around. The only one problem is the traffic. Inside this gorgeus streets circulate lots of cars. That's unbelievable. This should be banned to preserve the magic atmosphere of the place."
        }, 
        {
            "index": 571, 
            "rating": "4", 
            "review": "Interesting wanders, historic areas. Just up from the Plaza de Armas in Cusco is this neighborhood of steep and narrow cobblestone street and stairways with historic stone buildings all around. Many little testile shops art museums/shops, restaurants and hostals/hotels as well as some interesting museums and historical attractions are in the picturesque neighbourhood. Well worth a half day wandering"
        }, 
        {
            "index": 572, 
            "rating": "1", 
            "review": "dangerous!!! dont go at night!!!. if you dont want to get rob or kipnaped by a local taxi and bring to the atm machines to get money..dont go at night !! is very dangerous, lots of drougs and young pic pocket crazy young drogatic kids"
        }, 
        {
            "index": 573, 
            "rating": "4", 
            "review": "very nice public square. we were fortunate to be in Cusco the for Mother's Day weekend. There was a celebration in the square involving native dancers and music. There is a small craft market in the square every Sunday that is very nice."
        }, 
        {
            "index": 574, 
            "rating": "5", 
            "review": "A Must. This small, quiet Plaza has true Peruvian charm. The small church is quite interesting, and the Plaza is surrounded by really neat shops. Also in the Plaza, you will find Pachapapa Restaurant, one of the best places to eat in Cusco. Don't miss Plaza San Blas!"
        }, 
        {
            "index": 575, 
            "rating": "3", 
            "review": "Visit if you have seen everything else that you want to see. We were disappointed in San Blas. It was not a pretty artsy area as I had hoped. The shops were uninteresting and not well-stocked. I enjoy to some extent every area that I get to see of a city I'm visiting, but we could have used the time a little better visiting somewhere else."
        }, 
        {
            "index": 576, 
            "rating": "5", 
            "review": "Excelent place for shopping. you have to go if you want to shop and see the real Peruvian Culture, always try to get a discount. walk calm, you really get tired at that height."
        }, 
        {
            "index": 577, 
            "rating": "4", 
            "review": "Good Shopping. If you have time, visit the neighborhood of San Blas. We enjoyed this area more than the busy, tourist-centric Plaza de Armas. The neighborhood features \"mom and pop\" stores that didn't pressure us into buying their wares. The area is very picturesque and fun to just walk around. On Saturday's there is a market in the square next to the San Blas church."
        }, 
        {
            "index": 578, 
            "rating": "5", 
            "review": "Charming artsy section of Cusco. After spending about a week total in Cusco, San Blas was my favorite little section. The restaurants, shops, and boutique hotels were among the most charming, clean, and unique. The streets are postcard lovely and I felt safe walking with my friend or by myself, even at night. We were fortunate to have booked our hotel in this section, completely by chance. I recommend Casa del Campo, and Encantada Botique Spa hotels for off the beaten path, affordable small hotels."
        }, 
        {
            "index": 579, 
            "rating": "5", 
            "review": "San Blas. Great little area of Cusco. Art district. Great place to pick up some local art at great prices. Be prepared to walk hills though because this area of Cusco is up the hill."
        }, 
        {
            "index": 580, 
            "rating": "5", 
            "review": "chill, bohemian sector of Cusco. most picturesque part of Cusco! some nice lunch places and bars here too, smaller and more laid-back ones than the plaza.it's actually been the \"artists quarter\" since the Inca's time!"
        }, 
        {
            "index": 581, 
            "rating": "4", 
            "review": "Watch the narrow streets. The streets are narrow and traveling by taxi in San Blas can at time get your heart pumping! We loved this little neighborhood with it's winding steep streets."
        }, 
        {
            "index": 582, 
            "rating": "3", 
            "review": "Nice to get lost... but watch the P00P :-(. Such a nice neighbourhood... However some people and many dogs think this is like a public toilet which really screws the experience a bit... Nevertheless, when looking where you walk this is still a grateful experience."
        }, 
        {
            "index": 583, 
            "rating": "4", 
            "review": "Great little square with best view from top of church. We went to the church to take a peak at the wood work with the artist's skull placed on the top. There is also a mini catacomb with two skeletons and a good view of cusco's tiled roofs from the top of the church."
        }, 
        {
            "index": 584, 
            "rating": "4", 
            "review": "Good place for a walk. Good place to have a walk around a people watch. There are some steep hills leading up from the bottom but it still a nice walk"
        }, 
        {
            "index": 585, 
            "rating": "4", 
            "review": "Good place to people watch. Loved the little streets of San Blas, full of life, people playing random instruments and dancing around the square. Great place to sit of and just enjoy the happenings! Also plenty of nice places to grab a bite to eat and get a drink!"
        }, 
        {
            "index": 586, 
            "rating": "4", 
            "review": "The place to stay in Cusco. A quaint section of Cusco just off the main plaza filled with small shops, restaurants and places to stay. Small cobblestone streets that add to the charm of this district of Cusco you cant go wrong by finding a place close to the small San Blas plaza. Has the feeling of old town with a new flair, feels like a small village above the main plaza. Best shopping in town...."
        }, 
        {
            "index": 587, 
            "rating": "5", 
            "review": "San Blas. On our recent visit to Cusco, Peru, we had an opportunity to see the San Blas area. It was about a 15 minute walk from the Plaza de Armas (Square of the Warrior). It was a nice walk, but slightly uphill. The sidewalks are very narrow, but it didn't seem to be an issue as there was little vehicle traffic.San Blas is the more bohemian part of Cusco with a large variety of shops, restaurants, and colorful streets. The San Blas Church is situated on the square with the same name. The church is a simple adobe structure with a pulpit carved from a single tree trunk. It was built in the middle of the 16th century on an Incan temple site. The square was quiet on the morning we were there. And although there was a fountain, it was not running. Around the square are a number of unique artisan shops, many selling religious works, as well as the usual tourist souvenirs. Also, most of the shops were selling items of clothing made from alpaca. On our walk back down to Cusco center, we happened upon a lovely shop in an old colonial mansion. It had a central courtyard full of colorful flowers and a fountain. For any visitor to Cusco, San Blas it a must-see."
        }, 
        {
            "index": 588, 
            "rating": "4", 
            "review": "Beautiful Neighborhood. This is one of the most well conserved neighborhoods in Cusco. It's also one of the nicest, most beautiful, and most expensive. This is a great place to go to splurge on a dinner or some early evening drinks. This is /not/ the neighborhood to find economical hotels, though I'd like to think it would be possible...somewhere."
        }, 
        {
            "index": 589, 
            "rating": "4", 
            "review": "Would be really lovely if not filled with dirty hippies.. This is one of Cusco's truly iconic neighbourhoods filled with little artisan workshops, a beautiful colonial church and lots of small restaurants and bars. There is also a pretty fountain and square to sit in and soak up the vibe. The only problem is that the vibe now consists of dirty back-packing vendors who are many times high as a kite or noticeably drunk in the middle of the day. I have and always will be a bit of a tree-hugger who enjoys a drink every now and then and have back-packed through a good chunk of South America but in this case it really detracts from how beautiful the neighbourhood is. Also when I say dirty... I literally mean dirty."
        }, 
        {
            "index": 590, 
            "rating": "3", 
            "review": "Jack's Cafe best in San Blas!. I really like Jack's because they served me the best Cappucino I've had in YEARS! And it was like $3 USD. Also they serve a 'proper' American breakfast if you're in the mood for omelettes, egg sandwiches, etc. Very close to Plaza de Armas and near a little market as well. Go here!"
        }, 
        {
            "index": 591, 
            "rating": "5", 
            "review": "Lovely neighborhood, right in the artisan district of Cusco. Around every corner you'll find beautiful art and textiles, as well as small little restaurants and hidden hotels...like Casa San Blas Boutique Hotel. If you're looking for a good value, and plenty of stuff to do, and just far enough away from the center of everything...this is your spot."
        }, 
        {
            "index": 592, 
            "rating": "5", 
            "review": "Salt Pans. Having never seen anything like this before, it was well worth the trip - we were there during the rainy season (and we did get stuck in the mud on the way there, but go out very quickly wih the help of all on the bus)! Lovely trip to get there!"
        }, 
        {
            "index": 593, 
            "rating": "3", 
            "review": "Nice walk to see San Blas. If you have nothing else to do walk up the steep hill to San Blas.\nSame shops as everywhere else. Nice square with fountain but that is about it."
        }, 
        {
            "index": 594, 
            "rating": "5", 
            "review": "Where all the hippies went!. San Blas is a very pretty area of Cusco, in what used to be a residential district above the main centre. It is characterised by small, winding streets only one car wide, almost vertical climbs, small houses and - thanks to the tourists - lots of boutique places hither and yon. It's also rather a hike up the hill, and there are fewer commercial nasties than there are further down. The place is centred around a small plaza. The church is pretty enough. There is an antiques store, a Spondylus jewellery store, a store you can have your aura read by a half Arizonan, half Peruvian 'capitalist indian', a folk art museum containing spectacular papier mache and plaster works, and a couple of the usual tourist shops. Food is also available above the plaza. There is also a market on Saturdays and Sundays (though it seems to be rather erratic) in the square. It's not cheap - if youre thinking of stocking up on souvenirs, hit the Central Market (San Pedro) down the hill. There are many travellers with earnest expressions, striped clothes, unusual facial hair and crystal jewellery...I thought they had died out years ago!"
        }, 
        {
            "index": 595, 
            "rating": "5", 
            "review": "Bohemian Place. San Blas is a very nice area to visit while in Cusco. The walk from the main plaza up to San Blas is very nice, with great cobble stone streets, and amazing stone buildings. San Blas is quiet and bohemian, with lots of artists on the streets, and nice vibes."
        }, 
        {
            "index": 596, 
            "rating": "5", 
            "review": "cute little plaza. we stayed almost next to this plaza, its small and cute, a lot of people walk through there. cuscos main square is about 3 blocks down hill from here, so make sure u have confy shoes,, the streets are stone paved and they tend to get sliperry sometimes. you will also see a lot of souvenir shops make sure you dont accept the initial price when they see you are a tourist they tend to raise price ..theres is plenty restaurant close by and a couple of bars...be prepapred for the walks keep in mind cusco is located @ 3300 METERS of altitude . have fun & travel smart"
        }, 
        {
            "index": 597, 
            "rating": "4", 
            "review": "Unique. Romantic , touristic , Unique area in center Cuzco . Make sure that you are wearing good NON slippery shoes . Going through involves climbing style walking on slippery shiny stone covered streets . Above the average quality souvenir stores . Do NOT waist your precious daytime hours to visit . instead save evening and/or late evening hour for this . !!! The area gets more ...''alive'' after dark . !!!"
        }, 
        {
            "index": 598, 
            "rating": "4", 
            "review": "Very hilly but cute little streets, shops and little deli's/bistros. A good walk, as its very up and down, but felt safe and nice to walk around in... San Blas is the area right off the main square, behind the Cathedral. Many good little restaurants/delis/bistros with affordable (and healthy and delicious!) fruit shakes, fries, sandwiches, etc."
        }, 
        {
            "index": 599, 
            "rating": "5", 
            "review": "artists place. lovely artists habitat where you can get good coffee. If you're vegetarian head for lila's veggie place in the market."
        }, 
        {
            "index": 600, 
            "rating": "4", 
            "review": "Quaint and Quiet Neighborhood. San Blas, the artist quarter, is a labyrinth of narrow streets with great cafes, restaurants and shops to explore. It's a nice respite from the crowded and noisy central area. We stayed in San Blas and don't regret it. In fact, we spent quite a bit of time exploring the neighborhood, popping in and out of quaint cafes and shops and snapping photos at picturesque corners. The coca museum is located here, and is quite an educational and interesting experience."
        }, 
        {
            "index": 601, 
            "rating": "5", 
            "review": "San Blas market. Fun way to spend some time and money. All authentic Peruvian crafts and at reasonable prices. Indian women actually weaving the cute hats that are seen everywhere. Even a few live llamas are standing around!"
        }, 
        {
            "index": 602, 
            "rating": "4", 
            "review": "The Pope liked it too. This small church has a phenomenal carved alterpiece. Although if you have been to the cathedral first, probably nothing anywhere else in any religious establishment in Cusco will particularly stand out for its wow factor. Even so, you still could not fail to be impressed by the workmanship in this particular piece.I cannot remember if it was Pope John Paul II or the current pope, back when he was a cardinal, who had visited Cusco and declared this church to be his favourite spot of all of those he visited. Tough to argue with him although his reasons were undoubtedly different from ours.Since you will undoubtedly be visiting the cathedral complex spend the extra 15 soles or so for the complete boleto religioso, which gets you into the archbishopric museum as well, and visit this small church. Do go upstairs - there is no sign telling you either to do so or that you are not allowed. The sight of the last dozen years' or so fancy robes worn, I imagine because there are no signs whatsoever, in the annual Corpus Christi procession is almost worth the price of admission in itself.You can also sneak outside onto a little balcony which gives a pretty good view of the city as well. As an added bonus the little square beside the church has a thriving artisan's market on certain days of the week."
        }, 
        {
            "index": 603, 
            "rating": "5", 
            "review": "Stay there, you won't regret it!. It's the nicest neighbourhood, just 3 blocks from the main square, with pedestrian streets!You can stay at the very well rated Pantastico Hostal and try their bakery, with plenty of yummy stuff!"
        }, 
        {
            "index": 604, 
            "rating": "5", 
            "review": "great art to buy. This was a great place to buy creative, unique and well made gifts. We also enjoyed the San Blas church with the incredible pulpit which was made out of one huge piece of wood. Look for the artist's skull at the top of it. interesting......."
        }, 
        {
            "index": 605, 
            "rating": "4", 
            "review": "Nice place to ramble through. There are lots of shops and restaurants to while away an afternoon in. Some nice artisan shops, I found a shop with beautiful handmade handbags, only problem was trying to choose."
        }, 
        {
            "index": 606, 
            "rating": "5", 
            "review": "San Blas. There are endless shops and restaurants. You will walk until you are short of breath, then sit down and have a hot Mate and people watch. It is a fabulous place"
        }, 
        {
            "index": 607, 
            "rating": "5", 
            "review": "get lost in the narrow streets. perfect place to get rid of your map and just get lost in the narrow, Venice-like streets. there are number of small restaurants, all serving menus for a portion of the price down the hill around Plaza de Armas. note that San Blas is located on a hill - the walk up in Cuzco at 3450m abvoe sea level can be a struggle."
        }, 
        {
            "index": 608, 
            "rating": "4", 
            "review": "Great artisany and market and food!. No: all uphill (fun when you're healthy though ;)YEEEESSSS: Great artisany, alpaca sweathers, jewelry, and a great foreign patisserie with the best brownies and cakes just up the steps of the square, on the right."
        }, 
        {
            "index": 609, 
            "rating": "5", 
            "review": "Take a walk. We walked through this area and were really impressed with the shops. We had some of the most delicious hot chocolate from a small candy shop and browsed many other local shops in the area. It is amazing to see the ancient ruins, colonial roads, and modern buildings merge together in this lovely area."
        }, 
        {
            "index": 610, 
            "rating": "4", 
            "review": "Nice day trip. It's nice to walk through these narrow streets and buy some inexpensive and very nice preuvian crafts."
        }, 
        {
            "index": 611, 
            "rating": "4", 
            "review": "Nice area, pretty touristy. The San Blas area is actually a really neat place to walk around. The streets are very narrow so that only one car can pass through and most streets cars don't even attempt to drive on. The tall white walls of the buildings hold your gaze and the many little cafes and restaurants can keep you within the few blocks for your whole trip, but might burn a hole in your wallet. This is a pretty touristy area meaning that the prices are high and there is a street vendor on every corner. It's still a good place to check out and take pictures, but look for food elsewhere if you're on a budget."
        }, 
        {
            "index": 612, 
            "rating": "5", 
            "review": "Awesome walk!. Cusco is such an amazing walking town that you cannot help but fall in love with it. The walk to San Blas with the fountains was great. We found a great lunch spot with a balcony overlooking the city. Then we made the decision to find our way to Cristo Blanco. We ended up climbing hand over hand through brush to get there."
        }, 
        {
            "index": 613, 
            "rating": "3", 
            "review": "a different dimension to cusco. this is a nice area, I went up here at night and as you go uphill and you see the back ground mountains behind you with all the street lights that go up towards it is very pretty. I wish there were more bars or at least more signs. I went to two bars both with live music from 11 pm. One of them was the 7angelitos that were having a buenavista social club band. Didnt get to stay but it was getting more crowded the later it got."
        }, 
        {
            "index": 614, 
            "rating": "5", 
            "review": "Beautiful. Beautiful neighborhood! Take comfortable walking shoes and lots of money... Dont miss the 12-angle stone!"
        }, 
        {
            "index": 615, 
            "rating": "5", 
            "review": "My favorite Neighbourhood. Amazing little neighbourhood, beautiful colonial part of town on the hills of Cusco. Love walking through the little streets, walking in the little clothing stores and restaurants. Great to have a coffee there in the morning admiring the amazing views of Cusco"
        }, 
        {
            "index": 616, 
            "rating": "5", 
            "review": "The highlight of Cusco!. My option of Cusco was pretty average when I arrived because of the overwhelming tourism and high prices until I discovered San Blas. This quaint area was full of cheap guesthouse accommodation and many good quality restaurants. There are many fantastic places to eat especially the San Blas market where you can get some great filling menus of the day for barely anything and some of the cheapest but best fruit salads!You cannot miss visiting San Blas if you are in Cusco!"
        }, 
        {
            "index": 617, 
            "rating": "5", 
            "review": "Great to get lost up here..... Brilliant vibe, lots of interesting shops and a BRILLIANT sandwich shop called Juanitos if I recall which was an epic experience for lunch!"
        }, 
        {
            "index": 618, 
            "rating": "5", 
            "review": "Beautiful Area. If you are anyway arty then you will love this part of Cusco - colourful and interesting - folk selling their wares - but not pushy or anything like it - more into discussions about different things -lovely place for a wander and lovely place to stay!! Lovely folk as well!! Loved staying in the part of the City! Highly recommend it too!"
        }, 
        {
            "index": 619, 
            "rating": "5", 
            "review": "cool town. Has a bit of a hippie feel. Nice shopping. You need to visitArt by Merida. The works of Edilberto Merida. Beautiful works of art."
        }, 
        {
            "index": 620, 
            "rating": "5", 
            "review": "Great views and arty area. It's a nice walk - a bit steep (ish) but take your time, look in the alleys and shops, there are lovely sights to see on your way up here. Stop for a drink when you get to the fountain above the local square."
        }, 
        {
            "index": 621, 
            "rating": "4", 
            "review": "great area!. The San Blas area of Cusco is really nice. All those little streets (up and down) with lots of restaurants, bars, shops (artifacts, art, crafts, etc) Nice little square at the church.\nIt has a really nice atmosphere and that just alongside the city center."
        }, 
        {
            "index": 622, 
            "rating": "5", 
            "review": "Artsy community off the beaten path. Ditch the larger artesenal markets and get your goods here. This quaint community is tiny but packed with craft stores, antique stores and some of the best dining in Cuzco. I really wish we had stayed in this area."
        }, 
        {
            "index": 623, 
            "rating": "5", 
            "review": "Oh so nice:). The nicest little streets, perfect for spending a day chilling your way around Cusco! Certainly the place to live if you'll be staying in Cusco for a long time."
        }, 
        {
            "index": 624, 
            "rating": "5", 
            "review": "Quiet and peaceful. Like the whole area of San Blas, it's Plazoleta is nice. Quiet, peaceful and full of hippies juggling and chilling around! Good place to spend some time for yourselves;)"
        }, 
        {
            "index": 625, 
            "rating": "4", 
            "review": "Cute artisan neighbourhood with places for lunch.. Cute little neighbourhood for an afternoon stroll. You most likely walk through it anyway as Cusco is relatively small. Many artisan workshops and stores. Great place for lunch is apparently Jack's bar."
        }, 
        {
            "index": 626, 
            "rating": "4", 
            "review": "Saturday Artesenal Market. Did not feel like I was getting sold to by snake oil salesman. A more relaxing place to peruse some interesting trinkets on a Saturday (believe Sat only)."
        }, 
        {
            "index": 627, 
            "rating": "5", 
            "review": "Great area. Great area, restaurants, shops, galleries, crafts, music .A fantastic suburb just 10 min from the centro.Slightly uphill from centro and at the altitude it's enough to have you gasping if you don't take it easy. Great for an afternoon stroll. Galleria Merida well worth a look great pottery of the worker by now deceased potter but work goes on by widow and daughter. worth it to meet senora merida alone."
        }, 
        {
            "index": 628, 
            "rating": "5", 
            "review": "Nice neighborhood church. It's a little annoying to have to buy one's way into every church in town, but that seems to be how it is in Cusco. This one's very nice, but the plaza nearby is even nicer - great place to hang out, lovely fountain, with a bazaar on Saturdays."
        }, 
        {
            "index": 629, 
            "rating": "4", 
            "review": "Slow browse through this little holy place. Although we saw several cathederals/churches in Cusco, I really enjoyed this little church's stories, art, and displays."
        }, 
        {
            "index": 630, 
            "rating": "4", 
            "review": "Nothing better than an afternoon of aimless wandering. Beautiful old quarter. There are a mix of high-class and budget bars, cafes and restaurants. But best is just to wander."
        }, 
        {
            "index": 631, 
            "rating": "5", 
            "review": "Great Area. Built on steep hill, a wonderful area to explore, with a lovely square church and fountain at the top"
        }, 
        {
            "index": 632, 
            "rating": "3", 
            "review": "Artsy neighbourhood. These tight, cobblestoned streets feature a lot of original, artsy shops. There are some true diamonds in the rough, stores that feature truly original, artistic goods. However, there are also many shops and stalls that sell the typical peruvian goods, and are not particularly original. Beware you're not overcharged for these items. Also, at night once night hits, many narrow streets do not have street lights, and can be very dangerous to navigate in the dark."
        }, 
        {
            "index": 633, 
            "rating": "5", 
            "review": "This is it!. As far as we could tell, this was the place to stay! The neighborhood is largely geared towards pedestrians, great shopping, lots of food opportunities. Just don't get swindled by the \"Shaman\" at the San Blas market.....beware!"
        }, 
        {
            "index": 634, 
            "rating": "5", 
            "review": "great area. Worth the hike up the hill to see the colored fountains. Pachapappa restraurant is also a great find..eat in the open courtyard with a clay oven!"
        }, 
        {
            "index": 635, 
            "rating": "3", 
            "review": "Avoid Sunday. Our schedule resulted in us have Sunday afternoon as free time in Cusco. We had thought to explore San Blas but found much of it closed and in hindsight we should have known better we ended up back in the Plaza de Armas where the shops were open."
        }, 
        {
            "index": 636, 
            "rating": "5", 
            "review": "Really nice. Just a short walk from the Plaza, San Blas is worth a visit. You must eat at Juanito's...the best sandwich place in Cusco!"
        }, 
        {
            "index": 637, 
            "rating": "5", 
            "review": "Coolest part of Cusco. This area had the cutest stores, most helpful shopkeepers, and nicest hotels/eats. The winding, cobbled streets sometimes wound up the mountain into secret views, plazas, lounge bars, surprise chocolate or pastry shops, art galleries, and quiet neighborhoods. Late at night, some of the restaurants turned into live music venues. Artsy, creative, fascinating area."
        }, 
        {
            "index": 638, 
            "rating": "5", 
            "review": "San Blas is a place where the history is alive. . The charm of this part of the old Inca capital is captured in its steep streets and in the façades of its colonial buildings. Simple, humble but very beautiful, San Blas has become synonymous with Cusco, and any visit is sure to include it."
        }, 
        {
            "index": 639, 
            "rating": "4", 
            "review": "quaint bohemian town. is a small town with alot of hippies. Is 10 min walk from the Plaza. Nothing much to do unless you like arts.."
        }, 
        {
            "index": 640, 
            "rating": "3", 
            "review": "One of the nicest waterfalls in Cusco. My favorite part of San Blas is the waterfall in the plaza. There are some lovely wooden benches that you can sit on that face the waterfall. I don' t think that people are really that genuine that sit around making jewelry and slowly become dirtier and stinker. It's an experience that you could do or not do. There are more enjoyable and more beautiful places in Cusco, don't miss out on other adventures."
        }, 
        {
            "index": 641, 
            "rating": "5", 
            "review": "Dining and art. We stayed fairly close to San Blas and enjoyed the dining and art that is in this area. There is also interesting buildings to observe and narrow alleyways to explore"
        }, 
        {
            "index": 642, 
            "rating": "5", 
            "review": "Good food and shopping. This area has lots of good shops and resturants and the main plaza has a pretty fountain that the locals performed in each night"
        }, 
        {
            "index": 643, 
            "rating": "5", 
            "review": "Walking through alleys. Have a walk from the alley on the right hand-side watching the Cathedral from the Plaza and you'll go through a very tiny alley where you'll see the 12 angle's stone and then go up through a steep alley with stairs and you'll reach San Blas neighbourough, where you can get lost in the small alleys and exploring the place. At night there's a very nice place called Los 7 angelitos, where you can get food, beer and live music and don't miss out the other one \" Km 0 \", where you'll get the same things."
        }, 
        {
            "index": 644, 
            "rating": "4", 
            "review": "Lovely street. The best street in Cusco City. Many shops, hotels,restaurants, museums and historical places. Just take your time as it goes uphill."
        }, 
        {
            "index": 645, 
            "rating": "4", 
            "review": "best place to shop. Check out the small shops ofering fair trade handicrafts. Their products are actualy made by hand and are much nicer than the tourist junk you see everywhere. There are vendors in the square that you can bargain with, and some Peruvian hippies selling funky jewelry."
        }, 
        {
            "index": 646, 
            "rating": "4", 
            "review": "Artisan area. The cathedral was a surprise inside, since it is so simple on the outside, The many shops around the square are great to visit. As the morning went on, more and more people set up tables in the square to sell their crafts."
        }, 
        {
            "index": 647, 
            "rating": "5", 
            "review": "Just unique !. Beautiful area, full of life, restaurants, that unique Cusco look and very close to the main Plaza de Armas."
        }, 
        {
            "index": 648, 
            "rating": "4", 
            "review": "Cute Area. San Blas is a nice little walk about with varying little things to see. I is supposed to be an artisanal area and there is a night market which I found on Friday and Saturday nights. I found it fun to find all of the super-steep roads/walkways and stairs."
        }, 
        {
            "index": 649, 
            "rating": "4", 
            "review": "Saturday market. Try to be there on Saturday morning to visit the artesanal market.Very lively with sellers of knitwear, paintings, music instruments"
        }, 
        {
            "index": 650, 
            "rating": "5", 
            "review": "Great neighborhood to wander about. But it is steep! Not something to tackle upon arrival in Cusco is you're not prepared for altitude sickness."
        }, 
        {
            "index": 651, 
            "rating": "5", 
            "review": "Get lost!. Great area that is very chill during the day and has great views. Lots of neat little narrow streets to explore aimlessly. Stop and have a beer outside looking over Cusco!"
        }, 
        {
            "index": 652, 
            "rating": "4", 
            "review": "Great area less the bussle of Plaza De Armas. San Blas is a great area to wander through the cobble stone streets. It is a little steep walking up to get there but the views are worth it. I did this yesterday and would consider walking there near sunset to get the night views. There is a little church up in the plaza with many artisan shops around and with lots of restaurants and cafes to choose from.Also saw a few Yoga places if you are a yoga fanatic. Enjoyed this area much more than down the main touristy square."
        }, 
        {
            "index": 653, 
            "rating": "5", 
            "review": "THE area to stay in. We got lucky and ended up in a Hostal in San Blas. This is the area to be in. It is just a short walk from the main square and all the shopping you will ever need to do. Great restaurants that aren't quite as crowded as the other side of the square which we avoided, just too many people."
        }, 
        {
            "index": 654, 
            "rating": "5", 
            "review": "A real local feel and great art!. I went in the evening when the locals were out enjoying a costumed show for the children! The energy was exuberant! The plaza is small, but lined with jewelry and textiles from local artisans. Most was of much better quality and skill than can be found at the Inca Market. Don't miss visiting the small historic church or the many art galleries. My personal favorite was the small museum set up by the Mendívil family known for their long-neck sculptures. It will seem a bit scary at first walking through a small passageway, but it opens up to a small courtyard where the family lives and works. There you can view some of the art being made as well as a room full of long-neck sculptures made by their family."
        }, 
        {
            "index": 655, 
            "rating": "4", 
            "review": "Interesting to explore. A short, but steep, walk up from the Plaza de Armas, this little neighborhood was colorful and surprising with its artisans working in the plaza outdoors. It was worth a few hours during an afternoon stroll. The prices for goods were reasonable there, too."
        }, 
        {
            "index": 656, 
            "rating": "4", 
            "review": "Prepare to go UP, UP, UP. San Blas area of Cusco is neat....but be prepared to climb stairs....that along with the altitude...you'll be huffing and puffing. Just wander around the narrow streets and admire the views. The doors of the houses are beautiful, often with carved animals or symbols above them. Sneak a peek into some of the courtyards.... you can actually climb all the way up to the Christ Redeemer statue....."
        }, 
        {
            "index": 657, 
            "rating": "5", 
            "review": "very bohemian - worth to go there!. magnificant artists, marvellous typical houses, very nice Plaza with little shops and restaurants. Very nice galleries! art is not very expensive there."
        }, 
        {
            "index": 658, 
            "rating": "4", 
            "review": "cool neighborhood. its got its own vibe but is still walking distance to the center square. lots of great restaurants and good area to check out in cusco"
        }, 
        {
            "index": 659, 
            "rating": "5", 
            "review": "Great for wandering and eating and the views. My favorite thing about San Blas is the winding cobble stone streets and the white wash walls perched on top of the old Inca stonework. You could take a map, but it's better just to start wandering and let yourself be surprised. Beautiful purple Bougainvillea flow over some of the walls. There are some shops and restaurants, especially near the Plazoleta San Blas but apart from that it's quiet and quaint. So take a left at Carmen Alto, and then a right at Siete Angelitos, then take a turn down Siete Diablos and keep wandering. You can always walk down the hill to get to the plaza or up to get to the highway, Cristo Blanco and Sacsayhuaman ruins. Aside from climbing all the way up to the road San Blas offers some of the best views over the Cusco valley. As for the plazoleta, it's great place to sit in the sun and read a book. You can people watch too, but it's a lot calmer than the Plaza de Armas. Hippies and street artists regularly gather to practice and mingle in the Plazoleta. There's little church and a small artisan market on the weekends and some great little shops that surround the plaza. Do you do yoga? Visit Cusco Yoga Inbound for a 1.5 hr class in the morning or the evening. Visit the Frogs or 7 Angelitos bar for live music. The Meeting Place is a nice spot for coffees and light lunch. Proceeds go to a good cause. El Buen Pastor is the best for a pastry. If the San Pedro market is too overwhelming for you, try the San Blas market. Just climb up the steps above the purple wall and fountain and hang a right and then another right once you hit the end of the alley. The offerings are simpler but prices may be better. Stop in for a pizza dinner at the cozy Sumaq restaurant on 7 Angelitos. The competitor across the street is delicious too! Then there Prasada I and II and El Encuentro for vegetarians and Jack's for good homey food. Te quiero mucho, San Blas."
        }, 
        {
            "index": 660, 
            "rating": "5", 
            "review": "Excellent shopping!. Loads of beautiful hand-crafted goods. Be ready for a little prodding from the vendors. :o)"
        }, 
        {
            "index": 661, 
            "rating": "5", 
            "review": "Charming. This neighborhood has very steep and narrow alleyways, with quaint little shops and restaurants. It has an artsy, festive atmosphere. At San Cristobal Church, there are beautiful views of Cusco below and the mountains beyond. We really enjoyed spending time in San Blas."
        }, 
        {
            "index": 662, 
            "rating": "3", 
            "review": "Nice part of town. This is a great part of Cusco. I looks down on the city and at night it was beautiful."
        }, 
        {
            "index": 663, 
            "rating": "5", 
            "review": "Interesting Area--Hard Walking. Somewhat away from the tourist hordes, this is a very interesting part of Cusco. If you continue walking up behind the church, you get good views and explore interesting alleyways, etc.There are many very good and inexpensive restaurants in the area. To name two of the favorites located on Calle Choquechaca--Jacks' Cafe (usually crowded) and Quinta Eulalia (wonderful Peruvian/Andean food). My favorite is Pacha Papa, opposite the Church of San Blas. It has a delightful interior courtyard to eat in and the food is exceedingly good and Peruvian. I would highly recommend \"salterito\"--an appetizer of lima beans, cheese, corn, peas, onions and tomatoes.No real dislikes. But for some the steep walk up to San Blas from Plaza de Armas would be a major slog. If walking is not your thing, you can take a taxi up to the Church and walk down."
        }, 
        {
            "index": 664, 
            "rating": "5", 
            "review": "Our hostal was here. We stayed at Amaru I on the prettiest street in San Blas...home of the famous 12 angled stone. It was a delight to walk to and from our various activities each day along these beautiful, narrow streets. They are filled with artisans selling their crafts."
        }, 
        {
            "index": 665, 
            "rating": "5", 
            "review": "Great views. Great views. Only walk up there when you are acclimatized to the altitude and be prepared to be hassled non-stop by people selling paintings and asking for donations. I did, however, buy a painting and the art student was very kind to then show me around and explain things about the buildings."
        }, 
        {
            "index": 666, 
            "rating": "4", 
            "review": "Very pretty little spot with great atmosphere.. We went to San Blas to see the square, the church, and the fountains. At the very top of the square, they have great weaving and alpaca scarves for very reasonable prices. This is a pretty little spot and we enjoyed the walk from Rumi Punku (only a five-minute walk to San Blas."
        }, 
        {
            "index": 667, 
            "rating": "3", 
            "review": "Small market place. Cute stop if you are wandering by, but not worth going out of your way for. Seems to be the same items being sold in every other shop."
        }, 
        {
            "index": 668, 
            "rating": "5", 
            "review": "Nice!. Don't miss walking up to this area! Great view at the top. Lots of good artists shops. Some bars."
        }, 
        {
            "index": 669, 
            "rating": "4", 
            "review": "Lovely small plaza, waterfall and church. This was a very lovely small plaza. We came from Cusco and approached through some small streets. The plaza is a bit below the main street level and is surrounded by small shops and St Blas church."
        }, 
        {
            "index": 670, 
            "rating": "5", 
            "review": "Beautiful plaza!. San Blas area has nice cobbled streets and traditional houses. The small plaza of San Blas is really cute and has an open market with interesting things to see and buy. Also from the top of the plaza (up the stairs) you can enjoy beautiful views. Nice and cheap cafes and light lunch in the area too!"
        }, 
        {
            "index": 671, 
            "rating": "3", 
            "review": "It is just fine. We stayed in an apartment in San Blas and while we liked living there, I don't see any reason for tourists to come. There are some shops and a church but nothing special."
        }, 
        {
            "index": 672, 
            "rating": "5", 
            "review": "charming. My hotel was in san Blas and it's so charming.... The narrow streets are kind of romantic!"
        }, 
        {
            "index": 673, 
            "rating": "5", 
            "review": "Unique in the world. This neighborhood is unique, walking at night, in those streets, very romantic, very special."
        }, 
        {
            "index": 674, 
            "rating": "5", 
            "review": "Cultural place. My whole family enjoy a free dance performance for free in this petite square , good place to purchase handycrafts of course before buying any thing ask for a reduction on the price in every thing you want to buy from the street sellers"
        }, 
        {
            "index": 675, 
            "rating": "4", 
            "review": "An area to explore.. Cusco is a great city, yet small enough to walk to most places/sights without any problems. San Blas is an area you souldn't miss."
        }, 
        {
            "index": 676, 
            "rating": "3", 
            "review": "Nice place to stay. We stayed in a hotel in this area and shopped as well. The choices are limited but we did find some great deals. It is a little away from the bustle of center of Cusco but by no means quiet. You will find it fun."
        }, 
        {
            "index": 677, 
            "rating": "4", 
            "review": "Place of artists. Nice narrow streets and square. There are many locals selling paintings and jewellery."
        }, 
        {
            "index": 678, 
            "rating": "5", 
            "review": "A little out of the way square with a lot going on at it. A little out of the way square with a lot going on at it. We stayed near here or we might not have gone to this site. But there was always a lot going on at it. If you are not staying up in the hills of the San Blas district, as we did, you might want to come here anyway to get a feel for the hilly nature of the area with the tight streets. You will not wonder why you do not see locals smoking if you hike up to this square. when you h"
        }, 
        {
            "index": 679, 
            "rating": "5", 
            "review": "Great place to stay. We stayed at the Pension Alemana and the area is the neighborhood to stay at. We walked during daytime and every night (even at late hours), we always felt safe. The area has a bohemian mood to it, the streets are stone paved, you find multiple handcraft shops, painting stores, coca store (that sells coca cookies and brownies) and several bars and restaurants. Just be prepared for a walk...as it is hilly."
        }, 
        {
            "index": 680, 
            "rating": "3", 
            "review": "Trinkets line the way.... Nice view from the top, but you'll have to fight the barrage of trinket sellers and choch along the way... Many more interesting sights to see without the uphill walk."
        }, 
        {
            "index": 681, 
            "rating": "3", 
            "review": "Not much oging on!. We walked over to San Bas twice to see what it had to offer. Both time the plaza was devoid of merchants and shoppers!"
        }, 
        {
            "index": 682, 
            "rating": "5", 
            "review": "Such a cool vibe to this neighborhood!. We stayed in San Blas before and after our Inca Trail hike. You can walk everywhere. There are tons of restaurants, shops, bars, and art galleries. We traveled all around Cusco on our visit, but loved loved loved San Blas and will be staying there again on my next visit!!"
        }, 
        {
            "index": 683, 
            "rating": "4", 
            "review": "Close, but not too close. We stayed at Pension Alamenia and really enjoyed it. We were a 5 min walk from the main square and had a scenic view of Cuzco and surrounding mountains.\nAlso San Blas has good restaurants and unique shops."
        }, 
        {
            "index": 684, 
            "rating": "4", 
            "review": "Fantastic old ruin. An ingenious attempt by the Incas to manufacture Micro climates for the use of Agricuture, also a visit to the Desecrated Inca cemetry was facinating, to get the most out of this, a guide is a must."
        }, 
        {
            "index": 685, 
            "rating": "4", 
            "review": "Walk through this district taking your time. There are so many interesting places and art shops. You have to spend time here, browse through the narrow streets and go into the little courtyards and shops, you will find very nice Peruvian crafts here. Be aware that many women and children will approach you, with a lama by their side, asking you to take a photograph. The catch is that they expect you to pay up to 5 soles for each photo, so choose your 'models' with care."
        }, 
        {
            "index": 686, 
            "rating": "4", 
            "review": "Excellent choice of small restaurants.. Don't pay high prices in Cuzco in 'recommended' restaurants, not worth the money. Instead eat and drink in a variety of small restaurant/cafes by the San Blas area: you can have a 2 course menu for about 8-12 new Soles."
        }, 
        {
            "index": 687, 
            "rating": "5", 
            "review": "Bohemian part of Cusco. Cusco could be the tourist trap that you would want to avoid but we have to say that it has too much charm and too much character to call it a tourist trap. We think you'll find that its just more than a stop over to Machu Picchu. Check out the Bohemian section of the Cusco. There you can find a lot of great restaurants, cafes, and museums that have a little different \"flavor\" than the shops near the center. You'll see what we are talking about when you get there."
        }, 
        {
            "index": 688, 
            "rating": "3", 
            "review": "Visit to San Blas. We walked uphill (many tourist shops along the way) to visit this small colonial church with good views from the tower. We had limited time and with hindsight would have given the San Blas area a miss."
        }, 
        {
            "index": 689, 
            "rating": "4", 
            "review": "Great for a Walk. I would recommend taking a walk up San Blas while you are in Cuzco- it is a beautiful part of town! Just watch out for the street vendors!"
        }, 
        {
            "index": 690, 
            "rating": "5", 
            "review": "Cozy area. We stay here at Nawin Cusco Eco Apts. The host were great & very helpful."
        }, 
        {
            "index": 691, 
            "rating": "4", 
            "review": "Interesting neighborhood. Cuzco is a terrific town if you take time there. We were there three nights and had two full days to explore. San Blas is a charming neighborhood but be warned that if you walk, it is a bit of climb up to it. Some artisan stalls, galleries, but we enjoyed just street walking and people watching."
        }, 
        {
            "index": 692, 
            "rating": "5", 
            "review": "One of the best places in Cuzco. All of Cuzco is wonderful.... San Blas is a must. It is not as busy as Plaza de Armas which makes it nice. Also, the street vendors are less in your face and the surrounding stores are more friendly, very Mom and Pop."
        }, 
        {
            "index": 693, 
            "rating": "5", 
            "review": "I love it. So much that i bought a house here... any questions dont be shy.. its my home."
        }, 
        {
            "index": 694, 
            "rating": "3", 
            "review": "smaller than expected. The hype of San Blas is more than the actual experience. There was very little to see. However, the walk there is nice on the cobblestone streets. It takes about 10 minutes from the Plaza de Armas. There are some shops along the way selling expensive artsy items. The day we went there was a craft show in the Plaza. Mostly the same touristy things they sell in the center of Cusco. A so-called \"shaman\" tried to hustle me by reading my aura and telling me that I needed to buy a $220 USD pendant from him to cure what ailed me. I declined. The entire trip to San Blas took about an hour, then we were bored and left."
        }, 
        {
            "index": 695, 
            "rating": "5", 
            "review": "The artists shops. Take your time & explore. There are so many individual artists shops, everything from jewelry to paintings to clothing. Everyone was very friendly."
        }, 
        {
            "index": 696, 
            "rating": "4", 
            "review": "An older part of Cusco. This part of Cusco is a bit of a hike from the Plaza de Armas in Cusco, especially at the altitude of 11,00o ft., but it is worth it. There is a beautiful church in the Plaza, a really cool fountain and a ton of artisans selling all kinds of Jewelry, sweaters, food and (anything else that you may want to relax). There are a lot of good restaurants and bars that have live music. The musicians in Peru are really good and they love their 80s and 90s rock mixed with local Peruvian favorites. Great for a stop during your day or dinner at night. Pizza, Indian Cuisine and Peruvian food, of course. Don't forget to try a Pisco Sour!"
        }, 
        {
            "index": 697, 
            "rating": "4", 
            "review": "Interesting area of old Cusco - narrow steep streets. This is an interesting place to just walk up and down the streets. Some are very steep. Lots of small stores selling art and other crafts. Also lots of restaurants. Also the location of the 12 sided stone which is interesting if you like the Inca architecture."
        }, 
        {
            "index": 698, 
            "rating": "4", 
            "review": "Don't mind the climb. It's a bit of a puff getting up the hills and staircases that link San Blas together but well worth it to enjoy a traditional and unspoilt Cusco neighbourhood. I wonder how they move furniture in and out of so many house that don´t have road access. There are great eateries and Korma Sutra Indian restaurant is a gem!"
        }, 
        {
            "index": 699, 
            "rating": "4", 
            "review": "Cool trendy area with better products for sale than the plaza. This area is great for grabbing a bargin and some beautiful clothing, you have to hunt it out though. Only problem is that it is at the top of a hill. Ensure you are acclimatised before venturing out this far, even small hills can take the wind out of you sail at this alititude if youre not used to it."
        }, 
        {
            "index": 700, 
            "rating": "5", 
            "review": "Trendy Cusco. I've never stayed in San Blas during my visits to Cusco, but I've walked the streets and just love this area. It's the trendy area of Cusco, offering higher end products to adventurer and tourists. Its very quaint and quiet."
        }, 
        {
            "index": 701, 
            "rating": "5", 
            "review": "Don't skip this place!. Enjoy Cuzco by your own feets.. just wallk and breath!"
        }, 
        {
            "index": 702, 
            "rating": "5", 
            "review": "San Blas neighborhood - Cusco. Our hotel was in this part of Cusco and we passed through the Plaza San Blas a few times each day. There was almost always something going on in the plaza. People set up stalls and sold art and handwork. There was a performance by Andean dancers one night. There was usually some music. There are a few good restaurants and some art galleries and studios. Very enjoyable."
        }, 
        {
            "index": 703, 
            "rating": "5", 
            "review": "Important Artisian Community. You will find not only the most famous artists here but it is also peaceful, lovely with the water feature and also to see school children. It is a great place to buy authentic mirrors. I recommend Mendivil two locations very special."
        }, 
        {
            "index": 704, 
            "rating": "4", 
            "review": "Tourist Cental. San Blas is a great neighborhood with lots of artisan shops, restaurants, bars, hotels/hostels, and general places catering to tourists. It will not give you much of an \"authentic\" Peruvian feel, but it's a great place to eat, shop around, and meet other tourists."
        }, 
        {
            "index": 705, 
            "rating": "4", 
            "review": "Lovely old streets. This is a great part of Cuzco. You feel like you have stepped back in time walking around here. There are lots of streets with stairs, so it keeps you in good shape and you get to see some nice vistas of Cuzco from the higher parts. It is a very nice way to spend a couple of hours."
        }, 
        {
            "index": 706, 
            "rating": "4", 
            "review": "Handcrafts market. San blas hosts a nice handcrafts market on saturdays at the plaza and many art galleries surrounding it. The views from Cusco are beautiful."
        }, 
        {
            "index": 707, 
            "rating": "5", 
            "review": "Go here!!. This is a really cool area of Cuzco. I highly recommend walking around the neighborhood!"
        }, 
        {
            "index": 708, 
            "rating": "4", 
            "review": "Wish there were more open options. I thought that San Blas would have more restaurants, shops, bars, etc. Maybe I didn't hit the right streets or have the magic password, but it was hard to find any real activity after the merchants on the square closed down. Fountain, Church and Square were good."
        }, 
        {
            "index": 709, 
            "rating": "5", 
            "review": "Lovely area of Cusco. My favourite part of Cusco this area is behind the main cathedral in Plaza de Armas. Full of small cobbled streets and alleyways. Boutique hotels, coffee shops, small independent shops and some lovely restaurants."
        }, 
        {
            "index": 710, 
            "rating": "5", 
            "review": "San Blas!. One of the most beautiful places to wander around.The little house with pink or blue doors, it is great.Being in San Blas at dawn is one of the most beautiful memories I have."
        }, 
        {
            "index": 711, 
            "rating": "5", 
            "review": "Fun artist neighborhood. This neighborhood is a bit of a climb from the Plaza, but well worth a visit. Find lots of cute little restaurants and hotels here, as well small art exhibitions and shops. Look for the house of Hilario Mendivil whose work is characterized by the long necks, and for the house of the local ceramic artist (how I wish I had written down his name) whose work is known for its big hands and feet, symbolizing the hard labor of the campesinos. A lot of hidden gems in this neighborhood, and pleasant to stroll around in."
        }, 
        {
            "index": 712, 
            "rating": "4", 
            "review": "Better take a taxi and walk back down to the Plaza. San Blas is a beautiful part of town. It's about 15 - 20 minutes walk from San Blas to Plaza de armas. The best way to visit this place is to take a taxi from Plaza de Armas (very cheap) and then walk back down. I think it's not more than 5 soles. usually the driver will stop at the church and you can walk around the area. There are some nice souvenir shops around also."
        }, 
        {
            "index": 713, 
            "rating": "4", 
            "review": "Favorite Part of Town. I really liked this area of Cusco but if your going up there prepare to walk uphill (or take a taxi if your lazy). Check out The Meeting Place if your homesick for some American food."
        }, 
        {
            "index": 714, 
            "rating": "5", 
            "review": "Great place to unwind and see a \"non-touristy\" Cusco. We loved San Blas! Sit on a bench and listen to the didgeridoo player near the fountain. Smell the incense, wander through the art shops and listen to live music in one of the many artsy bars. Walk through the cobblestone streets and stop in for some brick oven pizza. San Blas is much more relaxed that Plaza de Armas. No vendors, few tourists....just a cool spot to watch the sun set."
        }, 
        {
            "index": 715, 
            "rating": "5", 
            "review": "The best part of Cusco to stay. Handy to everything with an unspoilt character. I stayed at Casa de mama de cusco - good value"
        }, 
        {
            "index": 716, 
            "rating": "5", 
            "review": "Beautiful square in Cusco. This beautiful square is located in San Blas the Bohemian artistic neighborhood of Cusco. Here you can find several good artisan shops, restaurants and bars with live music. The square also provides great views of the city."
        }, 
        {
            "index": 717, 
            "rating": "4", 
            "review": "nice neighborhood, more hippies than downtown. The traditional artists's barrio in Cusco. Look for the sculptor's home off the plaza (creates the famous long-neck pieces)."
        }, 
        {
            "index": 718, 
            "rating": "5", 
            "review": "The Bohemian Cusco. This part of Cusco is something looked over by visitors with little time in Cusco. It takes some effort to get there but once there you can enjoy some of the most beautiful streets and squares in Cusco. On top of this it has also great views on the surroundings."
        }, 
        {
            "index": 719, 
            "rating": "5", 
            "review": "artistic heart. The artisans of san blas were one of the reasons I visited cusco a second time. The san blas plaza is surrounded by wood workers and artists practicing techniques dating back to the early colonial times when the cusco school of art was most famous. On the weekend the artisans market is a must see."
        }, 
        {
            "index": 720, 
            "rating": "4", 
            "review": "Cobblestone streets. Lots of things to see, art shops, intersting hotels good restuarants. Easy to spend a whole day exploring"
        }, 
        {
            "index": 721, 
            "rating": "5", 
            "review": "lovely area. safe. lovely sqare with shops bars and restaurants. close to hostel."
        }, 
        {
            "index": 722, 
            "rating": "4", 
            "review": "Worth the climb to this picturesque part of Cusco with great views over the city. A picturesque locale with a church and square which with its white walled houses and blue painted doors and windows has a real Mediterranean feel. Lots of shops down alleys off the mmain street which is quite steep and demands a slower pace in the rarified air. Plenty of local colour and atmosphere."
        }, 
        {
            "index": 723, 
            "rating": "5", 
            "review": "San Blas. If I could choose to live in Cusco I would definitive would live in this neighborhood."
        }, 
        {
            "index": 724, 
            "rating": "4", 
            "review": "San Blas. Nice quiet area with artisan shops and pleasant buildings"
        }, 
        {
            "index": 725, 
            "rating": "4", 
            "review": "Worth the hike uphill. Walk around this bohemian neighborhood and slip into the Meeting Place Cafe on Plazoleta San Blas. As you walk up towards the mountains there are great views of Cuzco city center."
        }, 
        {
            "index": 726, 
            "rating": "4", 
            "review": "Bohemian, quaint, makes you linger. Great area to stay while in Cuzco. It's full of bars, cafés, restaurants and hostals to keep you entertained and chilled out for days. I wouldn't stay anywhere else in Cuzco."
        }, 
        {
            "index": 727, 
            "rating": "4", 
            "review": "Nice area. This section of Cusco, adjacent to the Plaza de Arrmas has many little restaurants, shops and hotels. The competition keeps the prices down and the value up. Plenty of places to enjoy a drink."
        }, 
        {
            "index": 728, 
            "rating": "3", 
            "review": "hostels and shopping. The tight streets and winding roads were a challenge. Most of what we saw in San Blas were hostels and shopping opportunities. We did happen upon some sort of play happening in front of the fountain in the main plaza."
        }, 
        {
            "index": 729, 
            "rating": "4", 
            "review": "Quaint and well worth a visit. Pleasant, convenient area with shops, restaurants and other attractions.A steep walk up from town but worth it. We sat in the square after lunch which was most pleasant. A slight 'hippy' air about it maybe ( reminiscent of my youth in the 60s!!). We tried to get into the church but two chaps sitting on the steps barred the way and wanted money. We retreated, sensing a scam attempt."
        }, 
        {
            "index": 730, 
            "rating": "5", 
            "review": "Great location for a stay in Cusco. Great location, lots of restaurants and bars but has that quiet village feel. Lost count of the number of corner shops and laundry places so great for an extended stay."
        }, 
        {
            "index": 731, 
            "rating": "5", 
            "review": "Must See. You have to take a few hours and walk around San Blas. I enjoyed the old narrow streets and found many different things for sale in and around the square. I was told not to walk around there at night by myself but that applies for many places."
        }, 
        {
            "index": 732, 
            "rating": "5", 
            "review": "Exceptional artists including two of Cusco's most famous sculptors. This precious plaza with the cathedral, children, fountains, great restaurants and the most beautiful artisian work I have seen. Olave and Mendivil are famous and you can just stand there wathcing them work and truly feel inspired.This is a bohemian district of San Blas, where you will enjoy popular artists who are dedicated to weaving, sculpting, and molding wonderful works of art.I plan to study spanish in a school called The Amauta which is located in this devine district."
        }, 
        {
            "index": 733, 
            "rating": "5", 
            "review": "beautiful place. i liked the sotres with a lot of souvenirs, the restaurantes, the people"
        }, 
        {
            "index": 734, 
            "rating": "3", 
            "review": "Not all that. If you are looking to score some sweet deals San Blas is not the place for you. Things were much cheaper in the Cusco markets."
        }, 
        {
            "index": 735, 
            "rating": "4", 
            "review": "very well located!. This charming street is the best street to stay overnight! Close to everything : the center, good restaurants, ..."
        }, 
        {
            "index": 736, 
            "rating": "4", 
            "review": "Great value, great location. Other than a barking dog and lots of street noise, we loved this place. Free internet in the lobby too."
        }, 
        {
            "index": 737, 
            "rating": "5", 
            "review": "Ahhh, San Blas. OK I'm probably looking at this through rose-tinted spectacles, but I love Cusco and San Blas is where I lived for a few months (my mate stayed there for 2 years!) You're living amongst/with Peruvians, there's a great view across the city, it really is a lovely little neighbourhood. If you can, visit for the fiesta of los trembeladors, it's brilliant."
        }
    ]
}