{
    "category": "Cusco", 
    "entity": "Santuario-Animal-de-Cochahuasi", 
    "avg_rating_stars": 4.542553191489362, 
    "review_count": 282, 
    "rating_stats": {
        "poor": 5, 
        "average": 11, 
        "terrible": 5, 
        "very_good": 72, 
        "excellent": 189
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "Amazing!. It is a small animal sanctuary only a short drive from Cusco. The work they do is amazing! All the animals are super cute and the guide is very informative of each animal and why they are there. The squirrel monkeys definitely stole my heart! ❤️ Worth the trip for sure!"
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "Short but Worthwhile. The tour is cool and informative but they also do good work here. A lot of the animals were inured or abandoned so they are kept here."
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "Close up! amazing place. Small but very compact sanctuary is a rescue home for many animal spices. Apart of typical peruwian animals like alpacas, wikunias, CONDORS, you can see black bear cub, hairless dog, 2 pumas, felis (predator cat), and many many other. Animals are being rescued from smugglers or found close by their dead parents. They also have first in Peru condor breeding program which is really interesting taking under consideration that condors have one partner for whole their life. All breed condors are being relisted back to nature in Machu Pichcu area. unfortunately such a big cause is not donated by government so they accept all donations. All products from their shop are from alpacas which lives in sanctuary. Good lesson for whole family, great place to visit.."
        }, 
        {
            "index": 4, 
            "rating": "5", 
            "review": "Highlight of our Trip. We enjoyed out time at the Sanctuary. The animals were well provided for and very approachable. Be sure to leave a donation or to buy something to keep them supported."
        }, 
        {
            "index": 5, 
            "rating": "5", 
            "review": "AMAZING - This is a must do when in Cusco.. This was so much fun. You can't get this close to some of these animals anywhere else. I know someone else reviewed this and thought it was a sham but these people really are helping the animals. Like Puma that were rescued from a Discotech and have been declawed. They couldn't survive in the wild. The people are doing good work. There's a tour agent on the Plaza de Armas that will sell you a ticket and ride. You can find them on the sanctuaries website."
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "Close up of Lamas and Alpaca. Small and Compact Animal Sanctuary where you get fence -close to Lamas and different coloured Alpacas. Get to see loom weaving by weavers and shop at the amazing store. Tourist prices but for those who have no time to shop for Alpaca buys...this place came in handy. Good Quality of Alpaca shawls and sweaters."
        }, 
        {
            "index": 7, 
            "rating": "5", 
            "review": "They really care about helping the animals here. We were on a Sacred Valley tour, saw the sign, and decided to stop. For a very reasonable entry fee, we got our out guided tour to see llamas, alpacas, condors, and various big cats (probably a few more I'm forgetting). You can tell the staff really cares about rescuing the animals."
        }, 
        {
            "index": 8, 
            "rating": "4", 
            "review": "worth a visit. We stopped here while on our way to Pisaq from Cusco. We were given a tour of the facility by one of the volunteers. Some sad stories of animal mistreatment. There was no admission fee - donation only at the end of the tour. There was also a gift shop but no one pressuring you to buy anything."
        }, 
        {
            "index": 9, 
            "rating": "4", 
            "review": "Very nice stop, and no too \"zoo-ish\". hit this on our way out of Cusco and on way into Sacred Valley. Worth the stop. Staff was knowledgeable and animals were well cared for. Entry is by voluntary donation."
        }, 
        {
            "index": 10, 
            "rating": "1", 
            "review": "DO NOT VISIT!!! horrible place for animals!. This place is a commercial enterprise pretending to be a \"non profit sanctuary for animals\" while using the poor animals simply to make money. The animals ARE NOT released to freedom, don't believe any of the stories they tell you. This is pure exploitation of the animals and poor treatment of these poor animals for commercial purposes alone. DO NOT SPEND YOUR TIME AND MONEY in this place. This place should be closed by the Peruvian government and the people who run it should be thrown in jail."
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "More interesting than the ruins. We hired a motorbike and stopped off on the way to Pisac. 10sol donation and you get a little gift. The girl giving us a tour spoke in both Spanish and English and gave us lots of information about all the animals. I admire the work they do here and the staff seemed caring and passionate (they're all volunteers). A wide variety of animals. Obviously it would be better if they were in the wild but unfortunately that's not possible with some of them. For example the pumas had had their claws removed for performing in a nightclub so they'd be unable to survive in the wild. The work they're doing to release condors is excellent considering they have no government support. I found this tour more interesting than any of the ruins I saw that day and the next."
        }, 
        {
            "index": 12, 
            "rating": "5", 
            "review": "Saw a Spectackle Bear. Visited on a tour of The Sacred Valley a charitable organisation which rehabilitates and cares for the indigenous wildlife of Peru including Spectacle Bears,Condors,Pumas ,Llamas all appearing content in their outdoor surrounding.There were Monkeys and Macaws in a glass fronted shelter.We were asked for a donation of 10 Soles each which we happily provided and were given a key ring in return.You did have to exit via a gift shop but there was no pressure to purchase any local products on offer."
        }, 
        {
            "index": 13, 
            "rating": "5", 
            "review": "Lovely, caring place for animals in need.. I visited the sanctuary during my travel to Peru in September 2016. I’m animal lover and an activist myself, so this visit was kind of a ‘must do’.They are doing a great job out there. The place itself is not big, but animals are kept in good conditions, are well fed and looked after. They are working on new enclosures too, for example: for the spectacled bear they look after. I had a feeling that people working there are really keen and caring. It was a great opportunity for me to see some of the Peruvian animals, I wouldn’t have seen otherwise. OK, I’d rather see them living free, but also rather see them living safe lives in the sanctuary, than in bad hands. All the animals in there are rescued. People who work there told me many of their stories, some really sad indeed. They have quite a lot of species living there: lamas, alpacas, vicunas, parrots, tortoises (which I saw eating their lunch :) ), Andean foxes (stunning), pumas (truly amazing). And even a funny looking Peruvian hairless dogs. The sanctuary’s work on re-introducing the condor population in Andes is fantastic. It takes a lot of effort to breed those magnificent birds, and they are doing this out there. Some of the birds I’ve seen will be released soon. Once you’re there, you’ll have an opportunity to see condors flying. The experience is just fantastic.I have booked my travel to the sanctuary via an agent, but left a donation too, as I’m not sure how much of my fee would actually go to the sanctuary. So, if you go there, please dig deep, as this is what keeps them going."
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "Deeply caring staff to rehabilitate creatures - a feel good experience!. This is a rehabilitation centre not a zoo where animals and birds are wonderfully cared for, rehabilitated as well as breeding for certain species. This is my 4th visit and every time I leave (giving a generous donation) I feel good and friends with me are also are deeply respectful of the work being done to 'undo' harm caused by people trying to traffic exotic animals. It is wonderful to see and experience beautiful creatures close up such as the Condor and learn so much from the well informed guides. Truly worth a visit !!"
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "A worthwhile road-side attraction. Returning from a day of birding in the mountains above Cuzco, our guide asked if we wanted to see Condors. Of course! Then he told us about this place, and we were game to go. A member of the staff gave us a tour and explained the many animals they are caring for. In addition to walking among threatened condors (that are being bred in captivity for release into the wild), we saw vicuna, giant rabbits, tortoises, \"domesticated\" pumas (so doomed to living a life behind bars), Peruvian hairless dogs, and several species of parrots that had been injured or clipped and could not survive in the wild. The admission fee was only about $3.50 and worth every penny. After learning about the amazing conservation work the staff is doing, we made additional donations. We arrived just before closing time, so we could only gaze at the lovely gift shop and snack bar through the windows."
        }, 
        {
            "index": 16, 
            "rating": "5", 
            "review": "Great place to see conservation in action.... Great place to see conservation in action. Condors at close quarters indigenous dogs - friendly and very informative staff and relaxed atmosphere. I was not under pressure like other folks who were whizzed through on their bus tours of the sacred valley. Take the time to ask and speak to the people to understand the local issues. Good stuff."
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "Great morning out from Cusco. After being in Cusco for a few days we were looking for something a little different from museums and inca sites and we discovered this place.The sanctuary clearly does some good work and really glad we visited. Hope they manage to keep it up."
        }, 
        {
            "index": 18, 
            "rating": "5", 
            "review": "Non-profit, donations welcome, it's pretty awesome. I wasn't here for long. Met Albert, my tour guide, at the beginning of the sanctuary and I was surprised there was no entry fee. He showed me around and told me how all the animals came to be there and their plans for them. Beautiful llamas and alpacas and they even have a little bear cub running around like a puppy. Se llama Moses. The condor exhibit was pretty cool, too. There's about a half dozen and they sometimes fly from one end to the other. Impressive to witness. At the end, they ask for a donation. I gave 10 soles and received a free gift. I also spent a little in their gift shop, which also goes toward their cause.Enjoy!"
        }, 
        {
            "index": 19, 
            "rating": "4", 
            "review": "Sincere people. The animals here have been rescued from animal traffickers. The people working here seem genuinely fond of the animals. Efforts are made to reintroduce the animals to the wild, though some, born and reared in captivity, will not be able to survive in the wild. There is also a handicraft centre where traditional weaving is done, and you can buy some of these products in their shop."
        }, 
        {
            "index": 20, 
            "rating": "4", 
            "review": "Worth the time to Visit. If you want to see llamas, pumas and condors up close, this is a worthwhile visit. The tour specialist at the sanctuary will make the condors fly while you are in the cage. Great photo opportunities with llamas too. Plan to spend about thirty minutes to one hour. The sanctuary is small, but worth the time to visit. Thumbs up!!!"
        }, 
        {
            "index": 21, 
            "rating": "5", 
            "review": "Great fun. I read about this place on a google review about sights around Cusco, and that review mentioned something about a baby bear. And because I have been wanting to see a spectacled bear ever since hearing David Attenborough narrate a documentary on the cutest mother-cub story, I dragged my boyfriend here. We saw lots other than Moises the cute but kinda shy and mischievous bear. There was a broken-beaked toucan, lots of vicunas and llamas and alpacas, and the guides will tell you the differences between all of them. Vicunas are the most expensive ones. But security is pretty tight here so you wouldn't be able to shave or smuggle or kidnap anything from here. There's also a couple of big cats, and even a condor flight show. Lots of different types of monkeys and birds. Best part is that visitors help support an awesome cause. Take a bus here from Cusco and haggle the price down (most operators know this place by its name so it should be easy to find, and it's located right by the main road), it should cost a little less than going to Pisac."
        }, 
        {
            "index": 22, 
            "rating": "5", 
            "review": "Helping the animals. This place was a great surprise. They are in the business of looking after Andean animals that have been rescued from traffickers or poor conditions. The staff here clearly love the animals and do their very best to look after them. Yes, the animals are in enclosures but often they cannot be released (eye damage, claws removed by cruel owners etc). You will see Andean Condors swoop to collect their food, pat Alpacas and come close to wild Cats and bears. It's an easy way to see a stack of animals that you probably won't come across in the jungle. Plus, you are supporting one of the few NFP services that help some of these highly endangered species. The tour is technically free but you should give a sizable donation to support this worthy cause (we gave 100 Sols each). "
        }, 
        {
            "index": 23, 
            "rating": "5", 
            "review": "Amazing place!. We stopped here on the way to Pisac from Cusco - what a brilliant place! The staff were very well informed and passionate. We saw pumas, baby armadillos, condors, wild cats, vicuñas and many more. We also got to hold the tortoises and stroke the alpacas and llamas. Try and leave a generous donation at the end as these alone are what is keeping the sanctuary running."
        }, 
        {
            "index": 24, 
            "rating": "5", 
            "review": "Go and support their efforts. Upclose and personal with many of the local wildlife that has been rescued and many who are awaiting to be released. Go and support them with donations (no charge to go in). The experience is amazing."
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "A great place doing important work. Visited the sanctuary as part of a Lares Valley trek. It was wonderful to see puma and condor, although sad that they needed to be at a sanctuary. The staff were wonderful and very knowledgeable. The animals are well cared for and happy. They were in the process of building a new enclosure for the speckled bear cub when I was there. Well worth a visit and support for their work."
        }, 
        {
            "index": 26, 
            "rating": "2", 
            "review": "not my thing. The animals looked sad. They were confined to what appeared to be somewhat small areas, especially the condors who are enormous and couldn't fly far."
        }, 
        {
            "index": 27, 
            "rating": "5", 
            "review": "A must see. What a treat to see the native animals of the region up close. The staff provided up close experiences with the animals as well as interesting information about each animal. The highlight was the flight of the condor right above our heads! The staff are caring. All that and you are making a donation to support the work there!"
        }, 
        {
            "index": 28, 
            "rating": "3", 
            "review": "an animal recovery center is clearly needed. It was heart -warming to see the mission of this place -- to rescue seized and unwanted wild animals. The Andean condors and pumas were particularly compelling -- and their stories heart-rending. However, we were dismayed to see the baby spectacled bear in a tiny concrete enclosure where he was exhibiting neurotic behavior due to his cramped quarters -- he was frantically pacing back and forth ---and the same goes for another animal in a dark box in the middle of the sanctuary -- maybe a coatimundi? It was hard to see what it was. Overall we admired the work of this place but felt strongly that a few of the rescued animals needs were clearly not being met due to insufficiently sized and barren enclosures, and this greatly concerned us."
        }, 
        {
            "index": 29, 
            "rating": "4", 
            "review": "see the condor and other typical andean animals. this is a non profilt animal \"hospital\". They help wild animals being found hurted or in private and hostile environments. You learn a lot about them and see the condors fly landing just in front of your feet - no reason to be frightened ;-)"
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Very impressive work. This is a must stop for anyone concerned about the environment and animal protection. Great for all ages."
        }, 
        {
            "index": 31, 
            "rating": "3", 
            "review": "Neat sanctuary, wish the facility itself was better and better maintained. This is a neat \"roadside\" attraction with the ability to interact direct with rescued llama, alpaca and other animals. Amazing display with the condors in their enclosed area that you walk into. Conditions overall seem bad for the animals, especially for the monkeys. Restrooms exist but were nasty. They work solely on donations. It's a good stop to make if in the area."
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "Superb little place, they really care for the animals, and offer a great shuttle service. with the little resources they have, You can tell they are really rehabilitating them and trying their best to care for them, and the animals seemed happy and well taken care of. They offered a shuttle service to and from cusco and a guided tour for 20 soles which was amazing. the flight of the condors is something i'll never forget.they need all the help they can get so please visit and support them!"
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "Superb sanctuary! Condors up close and personal! Fantastic way to see endangered local species !. We stopped at this sanctuary without expecting much and boy were we delightfully surprised. The English speaking staff are fantastic and explain about the rescues of these delightful birds and animals. There were amazing condors flying overhead and spreading their wings. Macaws that mated for life. Curious llamas always ready for a photo. Tiny monkeys, Andean mountain wildcats (leopards), vicuñas and guinea pigs. After seeing the great work being done here it was a pleasure to buy great gifts at the gift shop. Well worth a visit just outside of Cusco. It was a nominal donation for entrance. One of our favorite spots on the trip."
        }, 
        {
            "index": 34, 
            "rating": "4", 
            "review": "Fun half day!. The people at the sanctuary really care about the animals that they have rescued. We really enjoyed our time (and it was even raining when we went, so that says ALOT!)."
        }, 
        {
            "index": 35, 
            "rating": "5", 
            "review": "Great place, fantastic people. The people working here are doing fantastic work. The Sanctuary is a non-profit working with injured, orphaned, and abandoned animals. The work they are doing to reestablish the Andean Condors is beyond words. We were lucky to be visiting when it was feeding time for the spectacled bear. He's adorable and a bit bashful, and certainly loves his fruit. The Andean mountain car was also a treat. They also had a selection of llamas, alpacas, vicunas, huge bunnies, macaws, toucan, and pumas! At the end of the tour, we also were treated to an explanation of the natural dyes used in the wool. It is well worth the trip to see the animals, and support this great cause."
        }, 
        {
            "index": 36, 
            "rating": "5", 
            "review": "a very important side trip. it was very funny for the amount and variety of local animals to be seen, it was a big surprise that we find this enroute to pisac and we just stopped for 30 miunutes, it was a delight to feed the alpacas and see the women make their stuff..."
        }, 
        {
            "index": 37, 
            "rating": "5", 
            "review": "Loved it. We had a great visit. We loved seeing the animals! We spent about an hour here. It is a great experience learning about the local animals and seeing them very up-close. We loved touching many of the animals."
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "it was an interesting visit. thanks to ttc we could visit this absolutely charming place were you see local animals and also you get a glimpse of the techniques for creating colorful garments the inca way made from local materials as vicuna and alkpaca wool and tinted with organic colors from roots, herbs, earth and so on....very instructive and educational to understand the locals."
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "Please visit, they are doing good work here. We loved stopping here on our day exploring around to the Pisac area. This sanctuary is a family run private organization and are dedicated to rescuing and looking after animals which have suffered mistreatment of any kind. We would recommend a stop to visit and to leave a donation so that they can continue their awesome work. If you have children, this would especially be a great little detour while exploring around the area."
        }, 
        {
            "index": 40, 
            "rating": "3", 
            "review": "Nice museum for explainations of the Lama & Alpaka's. The museum is worth a 1/2 hr visit - then you can see some of the animals ( in roundup).It ends in their store,"
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "Great break with the kids. This is a great stop with kids. Stretch your legs, pet some llamas and learn something about the different wool"
        }, 
        {
            "index": 42, 
            "rating": "5", 
            "review": "great work. the sanctuary whist small do an amazing job saving, rehabilitating and releasing animals. the condor breeding program is an amazing initiative to boost their populations in the wild. the english speaking guide was great, very informative with a noticeable love of the animals.."
        }, 
        {
            "index": 43, 
            "rating": "5", 
            "review": "Repopulating the Condor. This was a stop that we made on the extended Sacred Valley tour with Action Peru Treks. We were buzzed by the Condors as they left their enclosure and flew down to their meal on the ground near us. We also saw Pumas, Llamas, Alpacas, Monkeys, Toucans and more."
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "Sacred Valley Tour day. This was a wonderfully unexpected stop on our tour of the Sacred Valley. We got to see Condors up close as well as Llamas, Alpacas, Pumas and others. We also got to see a woman working on a loom and were shown how the beautiful colors of Peru textiles are created!"
        }, 
        {
            "index": 45, 
            "rating": "5", 
            "review": "Great stop for animal lovers!. This was a great stop and added nice variety to seeing Inca sites all day. We hired a taxi to drive us up to this sanctuary (about a 1/2 hour from Cusco), wait for us, then drop us at Sacsayhuaman. It was a wonderful morning. The guide at the sanctuary was great and spoke English. We loved seeing the bear, llama, vicunas, alpacas, wild cat, puma, exotic birds, snakes, and of course condors. We spent about an hour there. Also, I'm not a shopper but I bought a beautiful scarf from their shop and wish I had bought more for family and friends. The quality and value seemed better than anything else I encountered the rest of the trip."
        }, 
        {
            "index": 46, 
            "rating": "4", 
            "review": "Worthwhile Afternoon Excursion. Ccochahuasi Animal Sanctuary is about 30 minutes outside of Cusco by private transfer - we opted to have the Sanctuary pick us up in the main square, and were efficiently transferred to and from the Sanctuary. A collection of animals including llamas, alpacas, vicunas, condors, small cats, spectacled bear, and birds are available for viewing. Individuals guides appear to be assigned to visitors as they arrive. The guided walk through the small sanctuary took about an hour, although they're quick to move you through the experience. A nice opportunity to learn about their rescue and breeding efforts in the local area - hopefully they will be able to expand their facility in the near future."
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "Best Stop of the Trip!. We were thrilled to get this experience. We booked our tour through Incas Chacana in the main plaza and were bussed up to the Animal Sanctuary. Our guide was incredible. He was so passionate about the animals and very clearly loved them and the work the Sanctuary does.We were able to have up-close encounters with llamas, an alapaca, turtles, a macaw, and a condor. We were able to learn about the process for alpaca shearing, fur dying and cleaning, and the process by which they make many of the textiles in Peru."
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "Awesome!!!. One of the coolest stood outside of Cusco. My wife and daughter loved it. First time I've seen a condor, let alone have it fly over my head. They have a speckled bear too. Well worth the stop."
        }, 
        {
            "index": 49, 
            "rating": "5", 
            "review": "opportunity to see the local wildlife and the caring people who look after them. This is a place worth seeing. Throughout the sacred valley there are animals walking wild, being herded or forced into posed photography. This Animal Sanctuary offers opportunities to see the major wildlife of this area in the care of people who are not after a quick buck. There is a store there in which one can buy woven goods at competitive prices and at the same time contribute to this wholesome work of animal rescue."
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "Highly recommend visiting!. This animal sanctuary is small but worth a visit. We saw all types of animals from the region, including Llamas, Alpacas, Vicuñas, Wild Turkeys, Parrots, Andean Condors, Monkeys, and many more. We were able to see the Andean Condors up close and fly above us. It was a real treat to see Vicuñas up close, too. They are not domestic like the Llamas, so they are only found in the wild.The animal sanctuary provided a tour guide that walked us through the animal sanctuary. There was no entrance fee but you are asked to give a donation of at least 10 soles. You're allowed to take a little souvenir for your donation. You don't need a lot of time here, but I highly recommend visiting!"
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "Rare animals in captivity. This place is a good stop half way between cusco and pisac. with a small fee you get to see rare indigenous species that have been rescued and kept in captivity, some they set back free if its possible.. they have condors, pumas, a wild cat, macaws, vicunas, llamas, falcons, eagles monkeys and more that you get to see from up close! Worth the visit!"
        }, 
        {
            "index": 52, 
            "rating": "4", 
            "review": "Visit to site. Nice visit... charming animals and families that care for them with a cute little craft area. Andean children running around"
        }, 
        {
            "index": 53, 
            "rating": "4", 
            "review": "Great place to take the kids!. We live about 50 minutes from this place & always take our guests to see the animals. There are quides who are eager to show you around & even have a foto shoot w/the alpacas! You can even be in the \"cage\" with the condors and watch them soar to get their meat! Highly recommend this place!"
        }, 
        {
            "index": 54, 
            "rating": "5", 
            "review": "Great Stop. We stopped here during a trip through the Sacred Valley and what a great stop. This is a small animal sanctuary for endangered Andean wildlife. They work on donations and volunteers and have done a very nice job with the facility. The staff is very friendly and happy to explain what they are trying to accomplish. Having only seen Andean Condors in photographs it was amazing to see them up close."
        }, 
        {
            "index": 55, 
            "rating": "5", 
            "review": "Great stop - the condors are amazing!. We weren't sure about this place before our visit but the privilege of seeing condors up close convinced us to give it a try. It was a quick but enjoyable stop and we bought some of our favorite souvenirs of the trip there. Recommended!"
        }, 
        {
            "index": 56, 
            "rating": "1", 
            "review": "Disappointed. After all the positive reviews and photographs of this place, I was pretty excited to stop here. We, and the couple who came in after us, were forced to pay the 10 soles donation to enter, and did not receive the small gift other reviewers had gotten. We weren't given an opportunity to feed or touch the llamas and alpacas, as other reviewers talked about. We were given brief 1 sentence explanations, and were rushed to the next animal, and then practically shoved out the door. I'm going to guess they were about to close when we got there, and if they had said something, we would have come back the following day to get the true experience, instead of this mess we got, making us believe they were more interested in taking our money over anything else. What a huge disappointment."
        }, 
        {
            "index": 57, 
            "rating": "5", 
            "review": "Six Feet From a Condor!. On the Cusco - Pisac road. Magnificent condors, that will fly over your head, and perch almost within touching distance. Breathtaking.Plus the other wonderful animals mentioned. i think these people do a great job here, and deserve your visit. Plus make sure to pop to Awana Kancha just up the road, to feed llamas, alpacas, vicunas."
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "You get to pet the animals. Non profit org. Its a shelter for animals. They save animals. Its a great small zoo that shows off an small array of animals. Theres even a vultures that you can seriously get close too. The trainers let you in the cage and the vultures are trained to fly around. I love it. They have a lot of alpacas and lambs too. And parrots that say ola! No entrance fee but you are asked nicely to give a donation. Please don't be stingy its for a good purpose. Btw, they have free guides that tour you around the mini open air facility. I loved it!And if you havent seen perus' dog, its there. 3 hairless dogs abound. Funny looking dogs."
        }, 
        {
            "index": 59, 
            "rating": "5", 
            "review": "Amazing! Recommend to everyone! . This sanctuary is an amazing, family run, not for profit sanctuary that rescues wildlife of all kinds from poachers and traffickers. I visited for 2 hours today and wish I could have spent more time! The staff are well informed and happy to give insight into the animals backgrounds and future. We were fortunate enough to encounter puma, Vacuna, condor, wild cat, monkeys, Falcons, parrots, macaws and a baby bear! All which had been rescued from poachers or traffickers and taken to the sanctuary to improve their health etc before they will be released in the future. It was fantastic to see these animals up close and know that they are there for a positive and temporary purpose. I am so surprised this sanctuary is not more widely known or advertised, I would recommend absolutely everyone who visits Cusco to check it out!"
        }, 
        {
            "index": 60, 
            "rating": "5", 
            "review": "Fantastic opportunity to see local wildlife. The Ccochahausi Animal Sanctuary is a scenic 30-minute drive outside of Cusco that happens to take you past the Saqsaywaman ruins and several vistas of the city. The sanctuary itself has a wonderful collection of animals that it took in after they were rescued by local police from abusive owners and illegal exotic pet smuggling rings, such as pumas, macaws and monkeys. They also rehabilitate other animals with the hope of eventually releasing them. At the time of our visit, they had a couple falcons."
        }, 
        {
            "index": 61, 
            "rating": "3", 
            "review": "Good short stop in the sacred valley. Interesting animals. The opportunity to be up close to the animals is excellent. The condors were very cool - bigger than expected."
        }, 
        {
            "index": 62, 
            "rating": "4", 
            "review": "Worth supporting. Stopped here briefly on the way to Machu Picchu. I was impressed by the enthusiasm of the volunteers and the passion of the owners at this small sanctuary. A positive impression to counter the thousands of chicken factory farms that Peru has."
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "we loved the animals. my wife liked a lot the technique used for their colourful dresses / attire...i loved the way the animals are kept in good condition."
        }, 
        {
            "index": 64, 
            "rating": "5", 
            "review": "Must See when traveling to Cusco from Sacred Valley. Our taxi driver asked if we wanted to visit an animal sanctuary to see condors. We said Yes, not knowing what to expect. We were amazed and impressed with this free (donations only) visit to a well kept, preserved animal sanctuary. The English speaking guide took lots of time to answer all our questions. The animals are 'rescued', many from domestic situations or illegal trafficking. Good for this sanctuary to provide natural habitats for them to rehab or live. We also loved the artisan textiles sold at their store, and found some beautiful pieces to take home."
        }, 
        {
            "index": 65, 
            "rating": "5", 
            "review": "Care of endangered species. This visit was unexpected and our driver included it on our trip to Pisac. Fascinating and a pleasure to see a bear, puma and condors in a caring environment."
        }, 
        {
            "index": 66, 
            "rating": "5", 
            "review": "Quick and fun. Fun stop between visiting Inca sites around Cusco. The sanctuary is small and houses llamas, alpacas, vicunas etc. that kids (and adults) can feed, pet etc. There are also animals rescued from trafficking or trade - rare wild cats, pumas, condors and more. The staff member who took us around shared each one's names and stories, making the experience very memorable."
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "ADMIRABLE. Our guide suggested that we stopped in the Sanctuary even though it wasn´t on the itinerary. I was so glad we accepted.They rescue animals from trafficking or hunting. They had monkeys, turtles, condor, alpacas, vicuñas, llamas and much moreIt is a great experience watching the rescued condor fly towards you!!!I strongly recommend this placeTips help the mission"
        }, 
        {
            "index": 68, 
            "rating": "5", 
            "review": "Quick Tour. This animal sanctuary is awesome. It is small but has a variety of native animals of Peru, Condors, Lamas, Alpaca, Monkey, Bear. The staff were very friendly and welcoming."
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "Wonderful look at the less commercial side of cusco. This is not a zoo but more like a rescue for abandoned or illegally captured animals. Though it's very small, it's clear that the staff have a real love for what the do. There are many of their own pets there as well. There's a nice shop which is a bit expensive but everything is locally made and some profits go to the sanctuary. The little orange cat is insanely friendly. If you go to pet her you may end up holding her all day!"
        }, 
        {
            "index": 70, 
            "rating": "5", 
            "review": "Very much worth a visit!!!. From the website for the sanctuary we were able to hire a driver for about $10 round trip each to take us from our hotel to the sanctuary. The animals were very well cared for and the grounds although small were very nice. The guide spoke English very well and gave us a history on all of the animals at the sanctuary. The condors were the best part as we got to go into the flight cage and observe them flying right over our heads!"
        }, 
        {
            "index": 71, 
            "rating": "5", 
            "review": "Ccochahuasi Animal Sanctuary worth a visit. Ccochahuasi Animal Sanctuary is worth a visit! You will see CONDORS! Nice to see a place caring for abandoned and injured wildlife."
        }, 
        {
            "index": 72, 
            "rating": "4", 
            "review": "Small but worthwhile attraction on your way to Pisaq. Family owned animal sanctuary with a large variety of Peruvian fauna, including llamas, alpacas, vicuñas, Pumas, condors, monkeys and macaws. Leave a donation as it is a good cause"
        }, 
        {
            "index": 73, 
            "rating": "5", 
            "review": "the inca trail was a courageous deed. we finished this hike as a family, we started united together and ended it united together also, there were some minute delays but our guide bruno knew how to deal with us, thanks again to qorianka tours for its help."
        }, 
        {
            "index": 74, 
            "rating": "5", 
            "review": "Sanctuary and Serenity. What a beautiful Place, it's not very large compared to Sanctuaries in the United States, but it was one of the cleanest and everyone I encountered was able to answer all my questions and genuinely seemed to care about the animals, and raising awareness for the Animals Continued Safety.\nI left this tour with a huge respect for everyone involved."
        }, 
        {
            "index": 75, 
            "rating": "5", 
            "review": "Beautiful place with very interesting guided tour. Absolutely loved it here! Intimate place, yet with loads of animals, alot of which i have never seen before in real life. Our guide gave us a very detailled tour and explained everything in spanish (my gf had to translate the parts which i couldnt understand, it was funny :D ) then we saw the condors feed, which was scary and impressive. They explained to us were the animals were from, and the even had a small baby bear from the andes! Cute and sad, i hope that he recovers soon so he can be released:) they seem to care alot about the animals there, way better than any commercial zoo i have been to. If i had brought more money with me i would have bought some of their beautiful products to support them more. But i am definitely coming back:)"
        }, 
        {
            "index": 76, 
            "rating": "5", 
            "review": "One Cusco's best attractions. This amazing place is free to the public, but you should definitely donate when you leave! It's a rather large enclosure where they keep all sorts of rescue animals (condors, llamas, vicuñas, dogs, mountain lions, turtles, parrots...) and you can go right up to most of them. The llamas will eat alfalfa right out of your hand, and the vicuñas might lick your hands. You can even go into the condor enclosure and see those beasts up close, I have to say they're absolutely terrifying. You can also see how they make alpaca textiles and use all natural dyes from plants. Their store has some of the best pure alpaca products in town (anything you buy on the Cusco street is guaranteed to be some fake-ish blend). I certainly recommend it, their products are legit, beautiful, and support a great cause."
        }, 
        {
            "index": 77, 
            "rating": "4", 
            "review": "Sad stories, happy ending. Condors flying over you, pumas, ocelot, vicunya and an peruvan hairless dog. Interesting. Tickets 10 soles a person ( ca 3,30 USD). When you buy something in the shop your (and your companies ticktes can reduce to zero). But the goods are extremely expensive. All natural wool/colors.What I consider ridiculous is that when you want to work here as volonteer you have to pay about 2500 USD for half a year. For animal lovers a must go (but the stories are sad). You can come ther out of Cuzco by ordinary bus (a few soles)."
        }, 
        {
            "index": 78, 
            "rating": "5", 
            "review": "A great experience!. This was one of my favorite things on our trip to Peru. We saw many different animals and learned all about them. Its small, but very scenic and informative. Have your cameras ready to take pictures of their Condors flying. They get so close to you! Its amazing to see these wonderful animals up close. The condors were the highlight of the sanctuary. At the end, they ask for a 10 nuevo sole donation and give you a little pen for each donation."
        }, 
        {
            "index": 79, 
            "rating": "5", 
            "review": "Condors up close. I found this to be a very worthwhile stop on our Sacred Valley tour day, we got to see many Peruvian animals as well as get up close with a few condors, which by they way are some big birds. One of the best things about this place is their mission to educate the locals about some of the endangers animals in the area, but they are also hoping to be able to bread and release condors in the future to help increase the population."
        }, 
        {
            "index": 80, 
            "rating": "5", 
            "review": "A must do in Cusco. On top of all the Incan ruins this animal sanctuary is a must do in Cusco. It is small but a perfect opportunity to get up close to animals as well as support the organisations rehabilitation and care for injured and trafficked animals."
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "great animal sanctuary. an excellent place to visit. this is apparently a non-profit zoo that cares for injured animals. off the beaten path, but worth a visit"
        }, 
        {
            "index": 82, 
            "rating": "5", 
            "review": "Great experience to be so close of Condors! . It was really nice to see those animals (puma, condor, llamas, araras). I do not like to see animals locked but they say it is not a zoo. They take care of them untill they are good to go back to nature life. Aurelio was a good guide at the local!"
        }, 
        {
            "index": 83, 
            "rating": "4", 
            "review": "Glad we stopped. It's good to know this place exists. For a very small entrance fee you can see some animals up close. The condors were magnificent even though they are not that pretty. Well worth the stop. They have a small gift shop. If you purchase an item part of the proceeds go for the care of the animals."
        }, 
        {
            "index": 84, 
            "rating": "5", 
            "review": "Perfect while you're acclimatising. A three trip which is great fun and easy on the lungs while your not accustomed to the altitude. Llamas, alpacas, condors, Pumas, wildcats and vicuña small very cute etc. but the tour was made by the excellent tour guide Jimmy. You can see how much the guides love all of the animals, a very intimate and friendly attraction."
        }, 
        {
            "index": 85, 
            "rating": "5", 
            "review": "Very privledged experience.. This sanctuary was not a stop that was listed on our tour through Sacred Valley. It was an unexpected stop. So awesome! These guys operate as a non-profit pulling money in from small education outreach donations and local artisans providing weaving demonstrations and sharing cultural knowledge. First time I have ever pet a condor, llama, or alpaca in my life. They house a few of the animals sacred to Peruvian ancestral culture (Condor, Puma) as well as animals that have been an important part of Peruvian culture (Llama, hawks, wild cats, guinea pigs, etc). These animals earn their keep. The condor is something like 50 yrs old and has been putting on flight shows for the reserve for years now. What a privilege it was to stand next to and pet that Elder. A real treat seeing all of the animals, hanging out with them, and learning a bit more about them. Truly unique experience. Most folks who are not around wildlife or familiar with these animals should consider a visit. Nothing like seeing the animal peoples that inspired the Peruvian cultural monuments!"
        }, 
        {
            "index": 86, 
            "rating": "5", 
            "review": "Great stop on the way to Pisaq!. This was probably my favorite place in Cusco after Macchu Picchu. Small animal sanctuary with many types of rescued Andean wildlife- some that you can pet! A real up close and personal encounter. The short tour is completely run by donation (suggest 10 soles) and is a wonderful little pit stop. Take the 30 minutes to check it out!"
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "They love wildlife, like you love wildlife!. This is about animals, but I'll start with the people - the people who care for their wards.When I visit any animal sanctuary I expect the staff and volunteers to be animal overs but the flks I met here are truly \"passionate\" about the their work and the animals under their care. Our guide, Pedro, was both passionate and eager to share his wealth of knowledge about his charges.The sanctuary is part petting zoo ( where you can touch llamas, alpaca, and native deer while learn the difference between llama, alpaca and vicuna), part Felidae refuge (where you can view pumas and an Andean mountain cat. SPOILER ALERT: To my knowledge, no one who likes house cats can walk away without wanting to smuggle the mountain cat home in a suitcase.), and part aviary. In addition the sanctuary has monkeys and tortoises.Several species of birds can be view - some caged, some not. The Andean condors are not caged. Visitors can get within arms-length of these magnificent birds which weigh about 11 kilograms (25 pounds) and have a wingspan of 3 metres (10 feet)! Having one glide over you, inches from your head, is an experience you're not likely to forget!"
        }, 
        {
            "index": 88, 
            "rating": "5", 
            "review": "Great little wildlife place!. My friend and I visited this wildlife sanctuary in August 2012. We really enjoyed seeing the native animals. We were able to go into the enclosure with the Andean condors and have them fly over us. It was incredible to feel the wind from their enormous wings. They are huge. I loved watching them hobble around on land too, they are not very graceful walking, too big. They do really great work here rescuing injured wildlife. Great place to visit and donate to."
        }, 
        {
            "index": 89, 
            "rating": "4", 
            "review": "Interesting place. If you have an extra hour and are around the area go to this place. The animals you will see here were rescued. You can be very close to the stately Condor"
        }, 
        {
            "index": 90, 
            "rating": "5", 
            "review": "Amazing . Jimmy showed us around and it was fantastic. The people of this sanctuary are real heroes! Seeing an Andean condor up so close was a real memory for life. They have plenty of other animals too (including wild cats and pumas). Just wished I left a bigger voluntary contribution at the end of the tour (Ccochahuasi should set up a PayPal account for more voluntary contributions).GO!!! You won't regret it!!"
        }, 
        {
            "index": 91, 
            "rating": "4", 
            "review": "Anima Rescue. This a good change in pace from Inca ruins. They have a great dedication to preserving wildlife and rescuing injured animals. There are llamas, alpacas, cats, pumas, turtles, condors, hairless dogs, parrots, and more. They also demonstrate natural dyes and weaving skills. A donation of 10S per person is requested in exchange for a small gift. Well worth the time! It takes about 20 minutes to do the tour."
        }, 
        {
            "index": 92, 
            "rating": "5", 
            "review": "An interesting side stop. The sanctuary does an admirable job of helping to rescue wild animals from abuse and injury. The operate on donations and I would recommend a visit as well as a donation."
        }, 
        {
            "index": 93, 
            "rating": "5", 
            "review": "Get Close to the Wildlife of Peru!. Really worth a stop! The guide will help you understand the rehabilitation, breeding and release goals of the sanctuary. Special treats were the condors, pumas, llamas and vicunas!"
        }, 
        {
            "index": 94, 
            "rating": "3", 
            "review": "A good break on your road trip. It was a interesting stop. Nice to see they are helping the injured and endangered animals. There was no charge to enter. Nice friendly people."
        }, 
        {
            "index": 95, 
            "rating": "5", 
            "review": "Excellent!. Excellent views and animals of the andean life, i recomended the condor´s fly is very intense and beautiful"
        }, 
        {
            "index": 96, 
            "rating": "5", 
            "review": "A Must-See for Animal Lovers. I included a trip to this animal sanctuary on my free-day while in Cusco. However, while touring the Sacred Valley with our private guide, she kindly agreed to take us there early since it was on the way to a town. I was ecstatic! At the entrance, we met with a sanctuary guide who was so helpful and informative. He took his time to show us each exhibit and interact with some of the friendlier animals, like the alpaca and deer. We even got to go into the condor habitat and see one of them fly. Their wingspans are huge! It was sad to hear about the abusive histories of some of the animals, but I was glad to see they're in a safer place. I read some reviews of people complaining of the habitats animals are in, but the staff are doing what they can with the limited resources they have. This is not America and we need to be mindful and sensitive of that. They are doing what they can and I applaud them for that.At the end of our tour, my husband and I gladly gave a donation."
        }, 
        {
            "index": 97, 
            "rating": "2", 
            "review": "Day Trip to The Animal Sancutary. Yes I was grumpy and running low on sleep, but we took the bus form the Cuzco square and it took 2 hours to get to the park because we had a quickie drive through tour of everything in Cuzco. Same on the way back. We only were given about 30 minutes at the sanctuary and at times I was doubting how much of a sanctuary I was at. They make the condors fly over you, it is cool... but I have a feeling the condors don't appreciate being chased and forced to fly.Hindsight I would have skipped it, not sure why it has such a high rating on Trip Advisor."
        }, 
        {
            "index": 98, 
            "rating": "2", 
            "review": "Have low expectations. So I just went today with my wife, after reading a ton of reviews this was a must. After finally figuring out through their website that is improperly listed here (google it) you can buy your ticket and get transport to their location for S/ 30. Great deal right? Well everything went smooth till 15 people got into a van made for 9 tops. We got to the sanctuary, it did have good parts like close contact with local animals. However you are rushed through with a guide there is no taking your time at the exhibits. The animals are in very cramped quartets, especially the fox who was essentially in 4' x4' cage. There reintroduction plans for young animals is sad. They have a 6 month old condor that has no space to fly more then three flaps. The young puma who they plan or releasing has little to know real world experience as it lives in a cage with its mother and two adults.  At the end of the day I know they mean well and I did donate knowing that they are doing good things for animals in need. They truly need help from a zoologist or two which is why I would still say go do they can make improvements.Lastly the way home. What a mess. We were dropped off at the blanco Jesus. The driver said ten minutes. Before we knew it everyone was out of the van and on a tour bus. After a minute a person other than the driver came over and informed us to head into the bus. 40 minutes later we finally made it back to Cusco. This is my experience I hope yours is better."
        }, 
        {
            "index": 99, 
            "rating": "4", 
            "review": "Interesting.. We got to see a Condor, which was magnificent! Wingspan of about 18 feet and they had then flying, then standing beside us. Great idea to help the animals but not too much else to see. It was on the tour but could have missed it."
        }, 
        {
            "index": 100, 
            "rating": "5", 
            "review": "So amazing to see a condor close up. We were so fortunate to make the trip to this valuable sanctuary. Volunteer guide Aurelio was so passionate about the work they do here in saving such beautiful animals. The Macaws were gorgeous, as w ere the llamas. Having the Majestic condors flying so close to us and having photos with them was a fantastic experience."
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "A Highlight of our Trip!. We visited Ccochahausi and it was such a wonderful experience! They are doing so much amazing work with these endangered and once abused animals. The sanctuary is large, clean, and the enclosures are well designed. It was about a 30min drive from Cusco. A van picks you up from Cusco and the transportation is included in your ticket. The ticket is 30 soles or about $10. An hour guided tour and education about each of the animals is also included with your ticket. They are doing great work through conservation and education for Condors, Vicunas, large cats and many other species. Our guide was so great, spoke English, full of information, and answered all of our questions. I highly recommend spending some time here! They are non profit and privately funded so if you do go, please donate what you can to help save these amazing animals :)"
        }, 
        {
            "index": 102, 
            "rating": "5", 
            "review": "The condors are worth the trip. I had no idea that condors were so HUGE and so ugly!? The sanctuary is small and reasonably well kept. The animals in this sanctuary are well cared for and interesting."
        }, 
        {
            "index": 103, 
            "rating": "5", 
            "review": "Getting Bigger. One of the nice things about living in the Cusco region is that I have the opportunity to visit places like the Cochahuasi Animal Sanctuary on a fairly regular basis and have had the pleasure to see it growing. When I first visited over 3 years ago they had, among other things, 3 condors, 3 pumas, and 2 vicunas. Now they have 7 condors with one mated pair, 4 Pumas (the new one is the offspring of two of the existing) and about 6 vicunas. They have also added many parrots and some monkeys to the animals that they are now caring for and while it is sad that this is something that is actually needed, it is good to see that they receive enough support to continue to grow and take in animals that are injured or miss-treated."
        }, 
        {
            "index": 104, 
            "rating": "5", 
            "review": "Fantastic experience with condors!. A very pleasant surprise during our stay in Cusco! After finding this sanctuary on tripadvisor, we got a taxi which took about 40 minutes to get there and absolutely loved it! The staff are doing excellent work at this sanctuary and they had fantastic and interesting animals to see and interact with. You can feed the llamas, step inside the condor enclosure and watch them take flight over your head! At the end of the trip, the staff only ask for a donation and you receive a handmade gift after donating. A brilliant experience and friendly, welcoming staff who are doing a fantastic job with the animals."
        }, 
        {
            "index": 105, 
            "rating": "5", 
            "review": "For what it is, time well spent. It isn't a big sanctuary but has adorable animals, llamas, Vecuñas, alpacas (?), birds, wild cats, pumas, condors and monkeys. A tour, including transportation from cusco, cost 30 soles pp. Our tour guide led us through the park, telling us about the animals and letting us touch most of them. Even the gigantic condors! Unfortunately the monkeys were in a glass cage but a worker let me in as it was my birthday and they were all over me, great experience. thanks for that!"
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "More evidence of a culture that is as concerned about its ecological heritage, as it is of its cultural heritage.. Unassuming as you arrive, once you walk the grounds you will be hooked at the amazing things being done by this small volunteer organization that exists solely on the gratuities of travelers and visitors from the road. From the condors to the Pumas in residence, its a chance to see as well as experience first hand beautiful and majestic wildlife that graces Peru. Don't miss this stop if you get the chance to visit!"
        }, 
        {
            "index": 107, 
            "rating": "4", 
            "review": "Small Animal Sanctuary, but big on photo opportunities!. Great to see Llama's, Alpaca, Condors all so well looked after. You learn some interesting facts about the animals, as well as standing near the Condor for a photo, this bird is huge! There is also a shop selling goods mainly made from baby Alpaca fur, which is softer than the adult version. It wasn't a cheap place to buy from, but genuine, which you are not always sure about when buying on the streets of Cusco. Lovely to see a traditionally dressed woman weaving, a great photo opportunity! These ladies have the patterns in their heads, which have been passed down the generations - no books or computers to check from. Great place to spend an hour or two."
        }, 
        {
            "index": 108, 
            "rating": "5", 
            "review": "An Accidental but well-worth-it stop!!!. Our guide knew of this place as we were headed back to Cusco after our Sacred Valley tour and offered to stop. It was a wonderful tour of a place that takes in all sorts of wounded or otherwise impaired birds and animals from Peru - Pumas, Condors, Vicunas, Llamas, Alpacas, Monkeys, wild Peruvian Cats. It costs nothing, although they ask for a donation, which one has no trouble making after the very personable tours given by one of the caretakers,"
        }, 
        {
            "index": 109, 
            "rating": "4", 
            "review": "condors puma and llama guinea pigs up close. with all the attention to inca ruins it wa sanice detour to see these wild life up close ,the keepers also coaxed the condors to fly for us so we got a real close visual on their wing span also saw lady weaving and using various colors to make an intricate design."
        }, 
        {
            "index": 110, 
            "rating": "1", 
            "review": "Misadvertising at its worst. We were very excited to go to the animal sanctuary - to see Andean condors and other indigenous species up close. We went to the main square in Cuzco to their office to sign up for an excursion and were told it would be a half hour drive out, one hour with the animals, and a half hour back. Fine. But that's not how it worked out. It took 70 minutes to get out there, not because it was a far distance, but because it was a \"tourist\" route with a drive through the squares of Cuzco, and a stop at one of the ruins to take pictures. Really?!? We were confused. When we arrived at the sanctuary, we were rushed through in 27 minutes. Yes, we did spend some quality although very brief time with the condors, but everything else was a \"run through\". And the guide didn't mention the hairless dogs that were there (which we were told elsewhere were bred in Peru because of the fleas). Nor were we told of other cages which held species of monkey indigenous to Peru, many more birds, and who knows what else. Frustrating! There was also a gift shop which sold items made from alpaca hair - fine, beautiful, colorful, well-made items whose sale was intended to raise further money for the sanctuary. However, there was little time for us to purchase anything. Thankfully I was made aware of this by fellow tourists and was prepared mentally beforehand to know exactly what I was looking for. The bus driver very rudely ordered us back on the bus. Vamoose, vamoose! And now began the ride back with yet another lengthy stop at another ruin for pictures, time which would have been better spent at the animal sanctuary. Now we were doubly and triply frustrated. Thankfully, we were not the only ones. And thankfully, one of our assorted group spoke fluent Spanish. He expressed his frustration, politely, to a tour guide on the bus but was brushed off. Four of us decided we needed to go to the main office back in Cuzco and speak out rather than let other people be railroaded through such a disappointing experience. There we were told that we hadn't read the information correctly on the website, or that the person who signed us up and took our money hadn't explained things correctly. When we went to the website and pointed out the specifics, he refused to listen. We don't speak Spanish, and he refused to acknowledge us until....I looked him straight in the eye and said that I would go on TripAdvisor, express our disappointment and discourage others from going. Immediately he understood me and offered a full refund. Did we take it! Yes, because they were in the wrong.If you go on this excursion, make sure you have all details in place. You can even refer to this review. This could be a very wonderful experience if you get what is advertised on the website. The rating we give refers to our total experience, not to the sanctuary itself."
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "Highlight of Cusco, great to get up close with the animals of Peru!! Puma's - wow!!!. This was a highlight for us seeing the animals, it still bothers me they are in captivity but at least they have been saved from traffickers etc. They are well looked after and some will be released back into the wild. If takes about an hour from downtown Cusco. A guide will show you around and you can get up close with many of the animals, Lama's, birds, Peruvian Dog and Concords. Our guide was very informative, we learn't about their habitat and how the environment has changed for many of them. At the end of the tour there is an option to buy local products to help support their sanctuary. It was all very educational and well run, highly recommend it. Beautiful animals!!!"
        }, 
        {
            "index": 112, 
            "rating": "5", 
            "review": "A well-maintained sanctuary for Peru's animals. We visited the Ccochahuasi Animal Sanctuary to see some of Peru's most beautiful animals, and we were so happy we did! The volunteer staff was knowledgeable about animals, and they answered any questions we had. The condors and alpacas were our favorites! Make time to visit the gift store; the money goes toward maintaining the sanctuary."
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "Condor Experience amazing!. Fabulous wildlife sanctuary. The staff are doing an amazing Jobe protecting these beautiful creatures."
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "Amazing animal sanctuary. The condor was awesome! The animals there are amazing! Great tour guide and an awesome gift shop. Loved it all."
        }, 
        {
            "index": 115, 
            "rating": "4", 
            "review": "Watch birds and animals up close. We stopped at the animal sanctuary on our way to Ollantaytambo. There are various that are under care here. We saw llamas, alpacas, vicunas, pumas (but they didn't come close to us). We also saw different types of macaws and saw 2 big condors fly over our heads.They had a lady weaving wool of the baby alpacas and had a Peruvian 'hot' dog roaming freely.Well worth a 30 minute stop."
        }, 
        {
            "index": 116, 
            "rating": "4", 
            "review": "El Condor. Seeing the condor up and personal was pretty amazing especially watching the older one lord it over the younger male. i never realised they were able to live to over 60 years"
        }, 
        {
            "index": 117, 
            "rating": "5", 
            "review": "Flight of the Condor. Loved this!!! It was definitely a highlight of our visit to Peru. We loved the sanctuary, the stories, and the Flight of the Condor. Highly recommend don't miss this!"
        }, 
        {
            "index": 118, 
            "rating": "5", 
            "review": "Any animal lover must stop there. We asked our guide to see the special Peruvian dog, therefore, he changed our tour to see something out of the schedule (one of the benefit of private guided tour).We arrived to this animal sanctuary and met Lino Chaves Gonzales, who explained us the different animal in the sanctuary, with also demonstration of the condors (in one word WOW). Any animal lover near Cusco must demand to go to this Animal Sanctuary and to pay some money as a donation. It took us less than 30 minutes to see those poor animals and also the Peruvian dogs (a very special kind of dog), but we left there with a lot of satisfaction . "
        }, 
        {
            "index": 119, 
            "rating": "5", 
            "review": "Enjoyable side trip. We had a lovely few hours here. You can get up-close and personal with animals you wouldn't otherwise have an opportunity to encounter. Bring your camera and your courage! As a knitter, my one sadness was that despite their impressive display of naturally dyed yarns, they weren't actually selling any of them."
        }, 
        {
            "index": 120, 
            "rating": "5", 
            "review": "Close Encounters of the Bird Kind. We had a great time at the animal sanctuary. Considering they arrange transportation to and from Cusco for you for only S/.30 each, it's a very good deal. You can get up close to a lot of beautiful Andean fauna: vicunas, llamas, alpacas, hairless dogs, rabbits. They have several macaws that you can hold, and they have a few aviaries with various birds of prey that were impressive. There is an enclosure where they keep the famous Andean Condors, and they have trained them to fly over your heads - very exhilarating, and it makes for great pictures.The best part is that all of the resident animals were rescued - either they were injured or orphaned. Those who can be are released once they are rehabilitated, and those who can not are kept safe at the sanctuary. This is a great cause which we were happy to support.The only complaint that we had is that it felt a little bit rushed, as they had to get the bus back to Cusco in time for the next group.We also used this as transportation to Pisac from Cusco - you can catch the bus across the road from the sanctuary for only S/.2."
        }, 
        {
            "index": 121, 
            "rating": "5", 
            "review": "Excellent. This is an amazing non profit sanctuary that helps rehabilitate injured and animals in need of help. Once they have recuperated they are released back to the wild."
        }, 
        {
            "index": 122, 
            "rating": "5", 
            "review": "a quick stop but definitely worth it. This is not a big fancy place but it's worth it to see the condors fly right by you and get some great pictures with them and other animals. There is also a chance to purchase some handmade alpaca goods (and other things), they seemed to be better quality for the prices compared to other places."
        }, 
        {
            "index": 123, 
            "rating": "4", 
            "review": "Worth a stop!. My taxi stopped here on the way to Pisac. I went on a quick tour (10-15 minutes), which included an explanation of the different camelids (llama, alpaca, vicuña), and viewing of other local animals like pumas and condors. The guide took my picture with an alpaca and a condor. There is no entry fee but there is a donation box. As this organization's aim is to promote animal well being and protect endangered species, I encourage donations! I highly recommend heading here to familiarize yourself with the animals of the area."
        }, 
        {
            "index": 124, 
            "rating": "5", 
            "review": "Wonderful sanctuary!. We stopped here on the way to the Sacred Valley. We got to see native species up close including the Andean Condor (who seemed fascinated with the contents of my purse); the Vicuna; the pumas; wild cats (they are both beautiful and crazy); the Peruvian hairless dog; different species of birds; llamas; and alpacas. The people who run this sanctuary are kind and committed to saving these animals. Definitely a worthy cause and a great place to stop to appreciate species which are endangered but will hopefully be saved with the efforts of people like those who run this facility."
        }, 
        {
            "index": 125, 
            "rating": "5", 
            "review": "Interesting animal sanctuary. Awesome tour ! There's nothing like hugging a llama and having a condor fly right toward you! A great place with an admirable mission."
        }, 
        {
            "index": 126, 
            "rating": "5", 
            "review": "Animal Encounters and Education. Where else can you have such good face-to-face encounters with Peruvian animal life, especially wild species? And the sanctuary does important educational and conservation work."
        }, 
        {
            "index": 127, 
            "rating": "4", 
            "review": "A Nice Animal Charity and Visit. This a non-governmental charity that takes care of injured animals. It is about 20 minutes from Pisac. We were given a tour by the staff and saw alpacas, llamas, vicunas, parrots, pumas, eagles, even condors -- my son was able to feed a couple of them. We even got into an enclosure w/ the condors and saw them fly. There is no admission fee but donations are welcome. The charity also runs a store where you can get alpaca and other goods, which supports its mission. A very refreshing visit after climbing the Pisaq Ruins!!"
        }, 
        {
            "index": 128, 
            "rating": "5", 
            "review": "Outstanding!. This was an unexpected stop, and ended up being one of our favorite parts of our trip. Great people doing great work. The animals are so cool!!!! The flight of the condor was spectacular. I can't say enough good things."
        }, 
        {
            "index": 129, 
            "rating": "5", 
            "review": "Met cousins of the Camel. On the way to PISAC stopped to see this animal sanctuary where I got to see for the first time one ALPACA and the other cousins of the CAMEL. This is a must to get to know the Peruvian pack horse."
        }, 
        {
            "index": 130, 
            "rating": "4", 
            "review": "Condors and pumas. Awesome value ,although it takes 3/4hour from Cuzco to get there, and the same back but its a great option and you are supporting a brilliant conservation cause... and they really really need the money , and it shows. So buy something from the shop or give a donation."
        }, 
        {
            "index": 131, 
            "rating": "5", 
            "review": "You should always visit an animal rescue centre. Great to see condors fly. They do what they can with very limited funds and they need more visitors. They run a bus from the centre of Cusco which is included in the fee."
        }, 
        {
            "index": 132, 
            "rating": "5", 
            "review": "They Do Great Work Here. Our tour group stopped here and we took a informative tour. The guide introduced us to many of the local wildlife which they rescued. This is a not for profit sanctuary that is mostly supported from the tours and sales in the shop that they operate. They take in distressed wildlife - nurse them back to heath and then. if possible, release them back into the wild. I urge all to stop by, take the interesting tour and support this worthy cause."
        }, 
        {
            "index": 133, 
            "rating": "5", 
            "review": "Fascinating. It was amazing to see the animals that were rescued. we saw Condors, Turtles, Pumas, and pure bred Lamas with blue eyes."
        }, 
        {
            "index": 134, 
            "rating": "5", 
            "review": "Don't Miss This Stop on the Road from Cuzco to Pisac. Wonderful educational tour of this wildlife rehabilitation shelter, where you can see up close the Andean Condor, Pumas, bobcat, llama, alpaca, vicuna, etc. Staffed by a bioethicist and wildlife biologists with whom you can talk about issues in the care of these animals. No fee to enter, but please leave a donation to help support the work if you agree that it's important!"
        }, 
        {
            "index": 135, 
            "rating": "3", 
            "review": "Chance to see a Condor. I liked that we were able to see animals up close, especially the condors. I also think have your video ready to catch the condor in flight."
        }, 
        {
            "index": 136, 
            "rating": "4", 
            "review": "Interesting visit. I went to their office and bought a ticket for the 130pm tour and I was the only one who went! I'm surprised they took just me. Anyway, the whole thing took about 2 hours. I was hoping to see more animals, but it was OK. The tour guide's English wasn't as good as my Spanish so we did most of the tour in Spanish. The tour guide told me at the beginning of the tour that I should tip him for his services (I hope this means they don't pay him anything and he's working for tips). A trip to the gift shop is probably in order, but too much pressure to buy something. I didn't feel rushed to see all the animals at all. Glad I went. I would recommend it if you have the time. Probably money better spent here than 25 soles just to walk into the church on the main square (in my humble opinion)."
        }, 
        {
            "index": 137, 
            "rating": "5", 
            "review": "Worth it. The sanctuary is definitely worth the visit if you have time. Make sure to get your ticket from the right place though (see their website)."
        }, 
        {
            "index": 138, 
            "rating": "5", 
            "review": "Wonderful work :). The group they took was not too big, so it didn't feel rushed or too touristy. Apparently there's only one agency that sells the tickets, which is across the road from Plaza de Armas.I loved the way they actually have a genuine interest in the animals they have. The guide we had was lovely and helpful and answered all of our questions. It's very easy to see all the rescues trust their caretakers and it was interesting to know more about them.Altogether it was a great experience, which I wold really recommend."
        }, 
        {
            "index": 139, 
            "rating": "5", 
            "review": "Great experience. This was my favourite excursion while sum Cusco. After seeing so many abandoned animals it was refreshing and heartwarming to see the dedication to animal protection. Very cool also to see Pumas, condors and monkeys. And I finally understood the distinction between llamas and alpacas!"
        }, 
        {
            "index": 140, 
            "rating": "5", 
            "review": "great surprise. Our group stopped here and we were so surprised to be able to see all of the Peruvian animals up close....the puma and condors especially! The vicunyas were amazing too- they tried to jump through the fence and attack us- wild and untamed creatures! Beautiful birds, llamas peruvian hairless dogs, and alpacas. We loved the handicrafts here, and enjoyed the display of dyeing and weaving. Great sanctuary, with great care of injured animals. Well worth the stop!"
        }, 
        {
            "index": 141, 
            "rating": "5", 
            "review": "An Absolute Must if you like Animals.. Ccochahuasi is a small animal sanctuary that does the very noble job of helping out animals that need help, animals that have suffered at the hands of humans, they get a second chance here. Here you can see llamas, alpacas and take pictures with them. You get to see several Peruvian hairless dogs, cuys, turtles, pumas, different andean felines, as well as condors. You can see them fly from one side to the other, it makes for an amazing experience. They charge 30 soles, pick u up from the Cusco Plaza de Armas, do the tour which takes roughly 45 minutes and then drive you back to Cusco, all for 30 soles (10 dollars). While you're there you can donate a little something, every cent helps. Give them a call and arrange for the pickup when you're in Cusco. You wont' regret it."
        }, 
        {
            "index": 142, 
            "rating": "5", 
            "review": "Surprise in the middle of nowhere. For a 10 sol donation, you get a personal tour and to see Peruvian animals up close. We enjoyed seeing and learning about the animals and the Sanctuary's rescue efforts. We also learned natural ways to dye the yarn and watched a young girl weave. Well worth the stop for a good cause."
        }, 
        {
            "index": 143, 
            "rating": "4", 
            "review": "Condors. This is worth a quick stop to see the work they are doing with the animals and also to see the amazing condors. This stop took half an hour at most. A guide will show you around and tell you about the animals and will get the condor to fly."
        }, 
        {
            "index": 144, 
            "rating": "5", 
            "review": "wonderful and unique experience. this was a wonderful opportunity to see indigenous peruvian animals that I would not otherwise have been able to see. It's really very inspiring, rather than sad. The sanctuary attempts to rehabilitate the animals and send them back into the wild if possible. If not, it provides a safe and comfortable environment for them while raising awareness. Definitely worth a visit!"
        }, 
        {
            "index": 145, 
            "rating": "2", 
            "review": "Not enough time to look around!. We visited this sanctuary in March, but I was a little disappointed. We arrived and was assigned an English speaking guide who was very enthusiastic but seemed to rush us around very quickly. I thought that I would have enough time to take pictures afterwards but this was not the case. The Condors were very impressive but still caged non the less. They are also man handled to get them to fly over tourists heads! The whole trip took about an hour...(including the bus ride from Cusco)"
        }, 
        {
            "index": 146, 
            "rating": "5", 
            "review": "Surprisingly great!. I wasn't enthusiastic about the idea of seeing caged condors but I was won over. It's so clear that the heart of this establishment is in the right place and it is heart breaking to realise so many of these animals have been rescued from far worse cages. It was incredible to see condors, lynxes, flimingos and more up close. I think they should build a small picnic area and maybe have a small cafe too. We would have stayed longer if there was anywhere to sit down. My kids would happily have stayed all day."
        }, 
        {
            "index": 147, 
            "rating": "5", 
            "review": "rescue zoo. I was so happy to see what this rescue zoo is doing for so many unfortunate animals. Very informative and such amazing animals and local crafts to see. A must!!"
        }, 
        {
            "index": 148, 
            "rating": "4", 
            "review": "A good overview of peruvian wildlife. We really enjoyed our hour here. It came as a bit of a surprise but the location was great. We loved seeing the condors in flight even if they were not in the wild."
        }, 
        {
            "index": 149, 
            "rating": "4", 
            "review": "Great way to see some Andean wildlife. This was a really fun outing. You get info on llamas, alpacas and vicuñas, and later a pretty good explanation on traditional andean craftsmen turn the fur into fabric. And you can get up close to the llamas and alpacas (not viceñas - it seems they're nasty critters).And the highlight of course is the condors. You get to see them fly, see them up close.It's a great introduction to Andean wildlife, including the threats they're facing and the efforts being made to help repopulate them.A fun and educational couple of hoursSome logistics in terms of getting there from Cusco (because I found their website a bit confusing). There is a foreign exchange/tour place right on the Plaza de Armas called Inkas Chakana - it is NOT the place I found online called Chakana travel on Procuradores.The bus ticket/tour combo was great - we showed up shortly before 9 am, and were on the \"bus\" (in reality a minivan) about 15 minutes later. It's a very scenic drive, followed by which you get driven back to Plaza de Armas. A little over 2 hours in total. It's convenient and an easy way to get there and back."
        }, 
        {
            "index": 150, 
            "rating": "1", 
            "review": "Stood up by the driver. Had made arrangements for the 9am tour and made our payment online. Showed up to the meeting point 20 minutes early. When it was 10 minutes past the pick up time, I called and was told it would be another 15. An hour later, a guy shows up in an unmarked van and told me to come back for the later tour. Since we booked other afternoon tours, we just asked for our money back (to which he complied). Found the whole encounter disappointing and unprofessional. "
        }, 
        {
            "index": 151, 
            "rating": "5", 
            "review": "Flying Condors!!. This place was recommended by our taxi driver. It is a sanctuary that rescues animals that are mistreated or abused and cannot return to the wild. Among the collection of many alpacas, llamas, pumas, tortoises, there are 3 massive condors. The cage is huge. Large enough to allow these majestic birds to spread their wings and fly. Absolutely breath taking. There is also a display of how the alpaca yarn/fleece is dyed using natural dyes, while a woman weaves some of the amazing tapestries. Unique, authentic treasures to purchase here as well."
        }, 
        {
            "index": 152, 
            "rating": "5", 
            "review": "Unexpected delight. Our guide for the day suggested a stop here and we were not disappointed. Seeing the rescued animals and hearing their stories was educational. Never guessed we would see condors. Shame on the humans who harmed the animals and kudos to those who operate the sanctuary. A treasure."
        }, 
        {
            "index": 153, 
            "rating": "4", 
            "review": "Awesome Peruvian jungle creatures who need support.. Great animal sanctuary. I saw the following animals (note this list is not exhaustive): - tortoises - alpacas - condors - falcons - pumas- monkeysIt's a family run organization and your visit helps. My heart was broken at the sight of one eyed falcons, pumas whose teeth and claws were removed for entertainment purposes, and Gonzalo the monkey, who was found crawling with parasites due to inadequate care. Not only did I get a sampling of native Peruvian fauna, I felt I was truly supporting an organization doing good work."
        }, 
        {
            "index": 154, 
            "rating": "5", 
            "review": "Another Trip Highlight. We stopped at the sanctuary on our way back from the market in Pisac. Our kids and I loved it. A staff member gave us a tour around the grounds and we were able to see many animals up close. We especially enjoyed seeing the condors! It is great to see somewhere so dedicated to helping these animals that need a home!"
        }, 
        {
            "index": 155, 
            "rating": "5", 
            "review": "Condors--up close and personal!. Family-run, open-air animal sanctuary featuring llamas, alpacas, guanacos, macaws, bobcats, Peruvian hairless dogs, and condors. All animals have been rescued and are being rehabbed. The condors were amazing! You can walk right up to their perching spot and take a portrait with them. The caretakers can even encourage them to fly across the sanctuary so you can witness their magnificent wing span. This alone is worth the visit!! The sanctuary also runs a small weaving exhibit, which showcases how alpaca wool is transformed from fiber to colorful woven goods. Especially interesting is the simple exhibit displaying the natural origins of the most commonly used dyes for these woolen products. There is also a gift shop where I purchased a beautiful, reasonably priced sweater and clean washroom facilities on the premises."
        }, 
        {
            "index": 156, 
            "rating": "4", 
            "review": "Condor. Very interesting place. They are rescuing wildlife and trying to rehab for the wild. Wish there was not the need but we saw condors here."
        }, 
        {
            "index": 157, 
            "rating": "5", 
            "review": "Outstanding place to see Condors and other animals. Staff was friendly and helpful.. We got to see some interesting animals including Condors and Pumas."
        }, 
        {
            "index": 158, 
            "rating": "5", 
            "review": "Support!. Do not miss out on this!! Great opportunity to see exotic and local wildlife. Groups like these deserve our support and we can enjoy these wonderful experiences while we do that."
        }, 
        {
            "index": 159, 
            "rating": "5", 
            "review": "Must see. Really nice place near Cusco. A must see. Friendly staff and friendly animals.Take a taxi to get there kind of cheaper than the tour from Cusco."
        }, 
        {
            "index": 160, 
            "rating": "5", 
            "review": "Glad to support it.. As some have said before, there doesn't appear to be a great deal here, but what they have in the collection, and what they have achieved is terrific. Just to be able to sit close-up to a pair of Condors, on the ground and skimming overhead, was worth the trip alone, but then there are Llamas, Alpacas, various hawks, Peruvian dogs, various parrots, Coatis (?) and a little demonstration of Andean weaving. There is no pressure to buy or donate, though I am sure everybody does at least donate, as they appear to be doing great work for Andean wildlife.The site is on the road to Pisac, we went independently on a local bus and carried on to Pisac, I am sure operators in Cusco must offer this trip, and they do have their own bus service in and out of Cusco."
        }, 
        {
            "index": 161, 
            "rating": "4", 
            "review": "Quick drive, nice tour, good organization. We took an 11 am trip to the sanctuary. It was easy and safe to book in the office at plaza de Armas. We left on-time on a small bus (bigger than minibus), see official website. It was about 40 min drive. When we arrived we were split into two groups (Spanish and English speakers) and had our tours. The sanctuary is mostly for animals rescued from illegal smuggling operations. We learned about alpacas, llamas, and vicunas. We saw condors and saw them fly. We learned about natural colors used to dye the yarn (very interesting). We would recommend this trip to anybody who is interested to learn more about native and not so native animals and birds, and for those who may not have too much time. Oh, and your money supports animal protection efforts. Another thing, we felt safe during our trip to and from. Visit itself was about 1 h, but with transportation ~2.5 h."
        }, 
        {
            "index": 162, 
            "rating": "4", 
            "review": "Fun afternoon. Ccochahausi offers a shuttle bus that picks up in the Plaza de Armas every afternoon at 3:30pm. For S/25 they take you to the sanctuary and return you to the plaza…visiting the sanctuary is free, your visit is donation based. We had a wonderful tour and saw llamas, alpacas, rescued birds of all types, condors, rabbits, and more. The sanctuary gives you an opportunity to interact and see animals you normally wouldn't get the chance to. Many have been rescued from the black market and have injuries that make it so they could not survive in the wild. Overall I think Ccochhausi is doing a great job, especially considering they are a family-run project that runs soley on donations. Definitely recommend!"
        }, 
        {
            "index": 163, 
            "rating": "5", 
            "review": "great job. on Dec 2, during our stay at cusco, we hired a taxi from inkatravels for the whole day and stopped at this sanctuary on our way to pisaqwe were the only visitors and were taken on a special guided tour of the facility and given explanations of the various animals housed there.saw the condor taking flight in the ground as we sat comfortably and watched... the eagle, macaw were great toohighlight was the cougar family esp the little cub... we put our hand thru the grill and petted it to heart's content while its mother rested nearby and dad paced a distance away...put 50 soles in their donation box and took a couple of souvenir pencils... nice experience for sure"
        }, 
        {
            "index": 164, 
            "rating": "5", 
            "review": "A sanctuary for rescued animals. Loved it!!! Well kept/ We had a great guide that explained all about the animals they have there. They are rescued animals. Some from circus life, others injured, etc Very interesting. They also show you the process of dying their wool with the use of natural plants.Highly recommended."
        }, 
        {
            "index": 165, 
            "rating": "3", 
            "review": "Nice work. The sanctuary has a few interesting animals, including a tame llama you can pat. The real value is what they do. They rescue animals who've been abused, birds who've had their wings clipped and can't fly, condors, etc. it's clean and cool to see the condors fly, but there's not a whole lot to see. I liked the gift shop - nice quality and some proceeds go to the sanctuary."
        }, 
        {
            "index": 166, 
            "rating": "5", 
            "review": "Absolutely amazing animal and bird haven. Dedicated souls saving animals and birds from predators - Aka MAN - and giving them a sanctuary - sometimes for life - by providing for them in an amazing habitat. Condors, Pumas, Llamas, alpacas .... Please support this non-profit and the animals and birds will thank you."
        }, 
        {
            "index": 167, 
            "rating": "5", 
            "review": "Best Part of Peru. This was the best part of my trip to Peru; I enjoyed this visit more than I enjoyed Machu Picchu! The ride to the sanctuary is amazing in itself; you pass through the Sacsayhuamán ruins, a small town, and gorgeous views in general. On the way back our driver even stopped to let us take photographs of the scenery. Once you get to the sanctuary, it's a once in a lifetime experience. You are so close to all these animals who were treated terribly and are now being nursed back to health and given a chance to live and reproduce. Many of the animals you will see are also endangered. It doesn't cost anything to go (so they say but that wasn't my case) but they will follow you around the store and try to find a way to get money out of you; I donated 10 soles and was still haggled afterwards when they tried to get me to pay for a girl who rode up there in the same van even though she wasn't actually WITH me which pissed me off. You will find people trying to get money out of you everywhere you go in Peru though so I suppose that it's normal. All that being said, this is definitely a cause worth donating to. At the moment there is a two month old puma that you can play with so go go go!!!"
        }, 
        {
            "index": 168, 
            "rating": "5", 
            "review": "family fun. kids and wife loved this place, and will long remember it. their exposure to animals was superb, they felt things were cared for well, and they talk about it still."
        }, 
        {
            "index": 169, 
            "rating": "4", 
            "review": "Nice stop along the way. Nice stop along the Sacred Valley, best part was seeing the Peruvian dogs that hang around. It's a good cause and could use some support if you have the time"
        }, 
        {
            "index": 170, 
            "rating": "4", 
            "review": "Good way to help and learn. Birds and animals get food and protection at this sanctuary. The highlight comes with a demonstration of condors flying--one surprised me by zooming right over my head and giving me an intense sense of its size. We also got a kick out of a bunny that hopped through a fence and suddenly realized it was inside the puma cage. The rabbit gave a quick \"uh oh\" look and barely made it back out as the female got rose with great interest. The facility is small and simple; the animals seem well treated given their injuries or circumstances make it impossible for them to live in the wild. No fee, but every donation gets a warm gracias."
        }, 
        {
            "index": 171, 
            "rating": "5", 
            "review": "Worth the visit!. This was an unplanned stop for us but I am so happy we made it! This animal sanctuary helps injured, abandoned or endangered animals and allows you to get very close to many amazing species such as the Condor. The team here is doing a good job, there is no entrance fee, they only request a donation to keep the place running! The tour is about an hour and you can take some great photos!"
        }, 
        {
            "index": 172, 
            "rating": "4", 
            "review": "Nice place to support local projects. We stopped here on our way into Cusco. There is no entry fee but on the way out they do suggest making a donation. They have someone show you around that explains the work they do and the different animals you are seeing. It maybe takes 15-20 minutes to see?? We did learn a lot and it gave us the opportunity to ask questions about the local animals. The place does great work rescuing animals from various unfortunate incidents. I have mixed opinions about the shop on the way out. It is set up so that local weavers can make money - and I'm in favor of that. They have some nice things (which are cheaper - but not as refined as what you will find in the Cusco boutique shops). I thought the lady working in there was way too pushy. I probably would have bought more if I felt comfortable browsing. But with her pushing things on me I just wanted to escape. So I grabbed a scarf, paid and left!"
        }, 
        {
            "index": 173, 
            "rating": "5", 
            "review": "Up close with a Andean condor. It is a rescue sanctuary for animals. Definitely worth to visit. You will see the typical animals from this region being nursed back to health. To me what was truly amazing was the experience of being so close to the Andean condor. No where can you see them up close. Kudos to the team working in this sanctuary."
        }, 
        {
            "index": 174, 
            "rating": "4", 
            "review": "Great place to visit. Very good place to visit...very happy with the overall visit. Highly recommended.....Not sure what else to say regarding this location."
        }, 
        {
            "index": 175, 
            "rating": "4", 
            "review": "Nice place to help support the local animals.. We visited this very briefly on the tour of the Sacred Valley. We only spent a few minutes just to see the condors. Our tour guide was attacked by a new condor and was immediately put on \"time-out\" in a separate pen. After that they push the condors up to the top of the enclosure to get them to fly over your head. I felt a bit bad that they were herded like that for people's entertainment but this was a minor gripe. This location is supported by donations so please make sure to drop some money off."
        }, 
        {
            "index": 176, 
            "rating": "4", 
            "review": "Nice place to visit and support the refuge. We visited this as a stop on our Sacred Valley tour. We only spent a few minutes as the location is quite small but we were able to watch the condors in their habitat. One of them actually attacked our tour guide (the guide mentioned that the condor was a new addition and was still adapting). He was put on \"time-out\" in a separate enclosure. This place runs on donations so please make sure to drop off some money on the way out."
        }, 
        {
            "index": 177, 
            "rating": "4", 
            "review": "Great Stop on the Way to Pisac Market. Our private taxi driver suggested we stop here, and we are glad we did. We were able to see condors, pumas, alpaca, llamas, vicunas, parrots and other animals up close. The fact that they have rescued most of these is an added benefit. The cost, 10 soles per person, is minimal."
        }, 
        {
            "index": 178, 
            "rating": "5", 
            "review": "Close, personal, amazing animals. Went to this animal sanctuary today with 2 friends. We just walked to the main square in cusco and there was a man with a brochure asking people to visit. We had already looked it up on trip advisor and wanted to do it, so he rang his driver and within 5 minutes a big taxi was there to take us. 25soles each person. Taxi was clean and the driver spoke English. The sanctuary was brilliant!!! Puma, macaws, condors, eagles, lama, alpaca and more. Guide spoke English and told us about each individual animal. Where it was rescued from, why it was rescued, and if the animal was able to be re released. They rely on donations (as the actual tour is free, the 25soles is transport). Beautiful place and very nice people. Highly recommend visiting! 10/10"
        }, 
        {
            "index": 179, 
            "rating": "5", 
            "review": "Great quick tour....make the trip!. Everyday at 330pm the Ccochahuasi bus picks people up from the Plaza in Cusco. For S/25 per person they will drive you out and back. Taxi is easy as well. There is no fee for the Sanctuary itself but donations are greatly appreciated. Overall this place is really nice and they're trying to do a good thing. Most of the animals are from the black market, others were found injured and they're trying to rehabilitate them. The tour is fairly quick but the staff are nice and quite knowledgeable. The Pumas are quite a site, especially the new born. About 3 weeks old as of this posting. There are also Condors, Andean Bobcats, Vicunas, Guanacos, Macaws etc..... Go take a look for yourself.....make a donation.....take some great pictures. Kid friendly for sure, but I am an adult and enjoyed it quite a bit."
        }, 
        {
            "index": 180, 
            "rating": "5", 
            "review": "A surprise to come across . On the way from sacred valley to cusco, we stopped here. It was a pleasure to tour the sanctuary. The grounds are not grand by any means, but we had an amazing guide take us around to share with us about each of the animals that are in rehabilitation here as well as the history of the animals in inca culture. There was also a display of traditional threads from the alpaca wool and how those are dyed. The gift shop has many beautiful items and proceeds go towards benefitting the sanctuary. Initially, we were unsure about stopping here, but we are glad we did. The condors are a special sight to see."
        }, 
        {
            "index": 181, 
            "rating": "4", 
            "review": "Free day? worth a look.. We asked our hotel in Cusco to book this. Within an hour the refuge bus picked us up. We were shown throughout the park with our own guide. This took about 1.5 hours. We were allowed to go up to most animal's and were even given a condor show. You can see they are doing the best the can with the little money they have. We also saw a puma cub. You won't regret going for the little amount it costs."
        }, 
        {
            "index": 182, 
            "rating": "4", 
            "review": "So much to see. I left she who rules to go see this as I was more interested in the other wild life in the area,but have to say her photographs seem to show I missed something special."
        }, 
        {
            "index": 183, 
            "rating": "4", 
            "review": "Wild animal rescue project. We stopped there on the way from Pisac. It's a wild animal rehabilitation project with few dedicated people working there. They run a small shop selling alpaca wool products to support the project. The prices are high but it all goes to the animal rescue. We bought a hand-made poncho. There's no entry fee but they ask either for a donation or a purchase. Please donate and support them"
        }, 
        {
            "index": 184, 
            "rating": "4", 
            "review": "Saving wild animals. We stopped there on the way from Pisac. It's a wild animal rehabilitation project with few dedicated people working there. They run a small shop selling alpaca wool products to support the project. The prices are high but it all goes to the animal rescue. We bought a hand-made poncho. There's no entry fee but they ask either for a donation or a purchase. Please donate and support them"
        }, 
        {
            "index": 185, 
            "rating": "5", 
            "review": "What a gem!. I am so thankful for people like those who work here, dedicating their lives to saving and caring for animals. We stopped here on suggestion from our hotel and I'm so happy we did. We got a great tour and got to go in with the Condors! We saw our first Inca Dog, three Condors (and got video of them flying) and Pumas! Very educational and they also have local artisan weavers and a beautiful gift shop on site. Donation only! Please be generous. Worth a visit for sure, one of our highlights!"
        }, 
        {
            "index": 186, 
            "rating": "5", 
            "review": "Awesome!. This place takes care of animals that have been abused/neglected and/or cannot be re-released into the wild. They do great work here. Good place to go and get up close views of some rare animals and learn more about each species. Wonderful English speaking guide gave us a great tour! Thanks!"
        }, 
        {
            "index": 187, 
            "rating": "4", 
            "review": "Glad we went. A bit small for the pumas and condors but they are rescued. Getting there: we showed up up the tourist info centre in the main square several doors down from Mushroom lounge & bar. They called the company for us, and within 5 mins our ride had come. 25 soles each for return trip & tour & we donated 10 soles at the place because we didn't want anything from the gift shop. You can pay by visa/maestro (& probably MasterCard) at the place. We understood the English tour even tough her English wasn't perfect.As for the animals - got to see vet cute llamas and alpacas (including teenage ones), went in the condor cage & saw them fly, 3 pumas up close, macaws, a fox, and some other peruvian animals and parrots. Also usual animals roaming free such as rabbits, ducks, guinea pigs and a beautiful stream in the middle. The animals seemed happy and well cared for, but needless to say pumas and condors need much larger cages than this family can provide."
        }, 
        {
            "index": 188, 
            "rating": "5", 
            "review": "Llama's to hug!. This was such a great place to visit, one of our highlights of the trip. Lots of animals to see and touch. Plus this supports a good cause!"
        }, 
        {
            "index": 189, 
            "rating": "3", 
            "review": "Friendly Llamas. We stopped here at the sanctuary on our way to the Pisac market. It was an interesting place, with several animals, birds, reptiles, etc .The enclosures seemed to be adequate for the species they kept. It was good to see the giant condors had room to fly. The one thing that I didn't like, the Peruvian hairless dogs on the property looked like they were starving. The rest of the animals looked well cared for. They had a llama that was used for tourist photos, he was pretty cool. There is no fee for a visit, however a small donation is greatly appreciated."
        }, 
        {
            "index": 190, 
            "rating": "5", 
            "review": "A Great Cause. We weren't going to go here because of the rain that day but we decided to stop on our way to Pisaq. It was definitely worth it. The volunteers/workers there rescue animals from several places. The pumas, for instance, that were in the shelter were rescued from a show and because of the way they were treated in the show they will never be able to be released into the wild. The variety of animals there is also a unique experience and one can get a lot closer to them than in the wild. After you have seen all the animals they have a weaving display with a weaver in traditional dress. You don't have to pay anything but donations are encouraged and there is (quite pricey) gift shop available as well."
        }, 
        {
            "index": 191, 
            "rating": "3", 
            "review": "A bit of a tourist trap. I was really hoping to be able to write a better review for this place, but my experience just wasn't what I was hoping. My \"guide\" didn't speak much English at all, which I know I shouldn't expect, but the next tour group to go through had a guide that was fluent. Given they knew I was an English speaker, it would have been nice to get a guide that did as well. The animals are great and appear to be pretty well taken care of. At the end of the tour, I gave them my donation (while everyone stared at me to see how much I'd put it). They told me I had 15 more minutes before my driver would be back (I saw the driver off in the distance who was clearly ready). This 15 extra minutes is just a ploy to give you an escorted tour through their gift shop. After I was done, they asked me for $50sol for the visit. I told them I had already donated and they left me alone. Again, the animals were great and the drive to the location has some pretty amazing views, but the human interaction left something to be desired."
        }, 
        {
            "index": 192, 
            "rating": "5", 
            "review": "Excellent to see Condors up close. My husband was really disapointed when we only saw one condor in the Colca canyon however the trip to the sanctuary more than made up for it.It is great to be able to see the condors flying so close to you, they are quite majestic when they fly.Definitely recommend with children or on the way to Pisac."
        }, 
        {
            "index": 193, 
            "rating": "5", 
            "review": "Unique experience. The whole sanctuary is just lovely. Animals are happy and so friendly. The sanctuary made us feel that animals are treat with love and care. And they show by the way interact with us."
        }, 
        {
            "index": 194, 
            "rating": "5", 
            "review": "Do it for the animals. Worth a brief stop between Cusco and Pisac. Several different kinds of animals and very nice tour guide. Make sure to leave a donation as it's how they feed the animals."
        }, 
        {
            "index": 195, 
            "rating": "4", 
            "review": "The kids loved it. Our kids are loved it. Not up to the standards of US sanctuaries, but they do a good job with what they have. Our son wanted to see condors and this was a chance to do so and see them fly up close. The gift shop sells products to help support the sanctuary, they were a little pushy in the sales, but it was for a good cause. No entry fee, but they do ask for a donation.Worth stopping at."
        }, 
        {
            "index": 196, 
            "rating": "4", 
            "review": "Very Fun!. Our driver took us on a Sunday afternoon drive outside of Cusco on one of our \"down\" days. We stopped here and at Awana Kancha to see the llamas, vicuñas and other animals.At Ccochahuasi we were amazed at the various animals. It was a pleasant visit with an earnest and knowledgeable guide. And, where else will a condor swoop over your head?!"
        }, 
        {
            "index": 197, 
            "rating": "5", 
            "review": "Excellent trip out from Cusco. We visited the sanctuary on a bus from the main square in Cusco. We had read about it and wanted to go, but just came across the bus by chance. We had a private tour, as we were the only English speakers on our bus. It was really interesting hearing how the animals had been rescued, and the work that is going on there. Also the dyeing and weaving is interesting too. I would definitely recommend it if you have a few hours and have seen enough Incan remains!"
        }, 
        {
            "index": 198, 
            "rating": "5", 
            "review": "worth. This Sanctuary was really educational. They have animals who are quarantined and they also take care of exotic animals, that have been extracted from their natural habitats. Very interesting and worth cooperate with the cause."
        }, 
        {
            "index": 199, 
            "rating": "5", 
            "review": "Condors! Condors! Condors!. Our bus made a stop here on the fly. We quickly toured the grounds with high hopes of getting to see condors. Not only did we get to see them fly, we also got up close pictures with these fantastic creatures. We got there at feeding time which was hysterical because of the animated geese!The 'admission' is free, but after hearing how all the animals are saved from various horrors, we all donated generiously to help the sanctuary. Good for a quick stop over if you are traveling in the area."
        }, 
        {
            "index": 200, 
            "rating": "4", 
            "review": "Nice idea but sad. I visited the animal centre last week. It was a small operation fund purely by donations. There are a few animals that they rescue but cannot be released back to the wild. I think it is very nice of them to do this for the animals. However I cannot help to feel sad for the animals in captive although they are nicely care by the people in the centre, the cages are still very small for these animals. I saw 3 pumas there, one is a female puma they rescue from a night club, her crawls have been removed so she can never go back to the wild. I saw her in a very small area and just cannot help feeling sad for her. There are also 6 condors, they are huge birds, they also cannot be released to the wild so they are in a netted area. Tho its bigger then the puma cages but these birds are really big and have wings spread around 8 foot or maybe even bigger. Again the area where they were kept are not very high and not very big at least in my opinion is not big enough for these big birds. I understand that soneone has to start somewhere and at least these people have good hearts for the animals. We didn't bring a lot of money with us that day as we did not expect to stop by this centre. At the end we only donated 200 soles. So if you plan to go, please donate generously so hopefully in the near future they can expand their facilities so these poor animals will have a bigger and more proper home. After all it is a nice place to visit if you like animals."
        }, 
        {
            "index": 201, 
            "rating": "5", 
            "review": "A great place to Peruvian wildlife. I´m writing this review a couple of months later so apologies if the details aren´t spot on.We were having difficulty finding information on exactly when the bus left as one user had mentioned there was one around 3:00 every afternoon but that was it. We ended up asking in a tour shop near the square and the guy called the sanctuary for us who then picked us up 5-10 minutes later. I think it cost us 10 soles more because it was an unscheduled pickup but we didn´t mind as the money goes towards funding the sanctuary.The sanctuary itself was fantastic with more variety of animals than we expected. We were greeted at the gate by a young billingual guide who spoke excellent English and knew a lot about the animals. By luck we arrived a few minutes after a llama had given birth which was a fun surprise for the staff as well. There were macaws and other tropical birds and of course the amazing condors that swoop down over your head and are so big! Other higlights were the 3 pumas (two rescued from a discoteca in Lima), a cranky vicuña, 2 wild cats and a friendly deer.They didn´t push at all for donations but we were happy to give more at the end and then purchase some of the handmade products in the shop as it was probably the first place we were guaranteed to get the real baby alpaca wool products that all the market vendors claim to sell.Highly recommended!"
        }, 
        {
            "index": 202, 
            "rating": "5", 
            "review": "Do not miss!. This place is incredible. We visited on a tour with our taxi driver on the way to pisac, it would be difficult to find alone! Our guide Maurice was very helpful and was able to tell us stories about each individual animal they had rescued and what exactly they are trying to do to either release them again or continue to care for them. No it's not the biggest place nor is it glamorous but they are trying there best with what little funds they have and it's very admirable. Don't understand other reviews complaining about size of cages or the fact that they are keeping them in captivity, they are trying to help, the pumas cannot be released right away as they were used as show animals in night clubs and they might not survive. If your unimpressed with the size of the space they have then donate more money and help these kind people out!"
        }, 
        {
            "index": 203, 
            "rating": "4", 
            "review": "Trip to the Sacred Valley and Cusco. This is a very interesting stop on the way to the Sacred Valley. It was encouraging to see the native animals taken well of. A small donation ( maybe 10 sol) is greatly appreciated by the staff. We were given a condor topped pen,"
        }, 
        {
            "index": 204, 
            "rating": "5", 
            "review": "Unique experience. a real hidden treasure, many locals didn't even know about it, I emailed them directly and they picked us up at the main plaza next day and took us to a very special sanctuary, it was not a zoo but a more unique place, we were able to be inside the condor cage and have a condor flying over our heads, what an experience. Their store is kind of expensive but we were into animals not shopping."
        }, 
        {
            "index": 205, 
            "rating": "4", 
            "review": "Better than a 3rd day in Cusco. Cool animals, you get right next to them. There were macaws just walking around everywhere, Condors that fly right next to you, and a puma in a cage. Very nice, like a petting zoo with better animals. They are still trying to get better organized, and they sell things like everywhere else, but still seems like they are trying to do good work."
        }, 
        {
            "index": 206, 
            "rating": "4", 
            "review": "Great animal sanctuary. This was a great place we stopped by based on TA reviews- it was such a fun experience! Beautiful animals and a great cause-I was swept up in the moment and bought a baby alpaca table runner for $300 and my tour guide laughed at me later, saying I had been swindled. I'll chalk it up to a donation to the sanctuary :)"
        }, 
        {
            "index": 207, 
            "rating": "5", 
            "review": "Animals Up Close. The sanctuary does amazing work in bringing back to health wild animals and releasing them back, when possible, into the wild. There is no entrance fee, but the guide gave us such an impressive tour of the place that we really wanted to give a large donation. You can see condors flying, pumas and other creatures up close. The visit takes about an hour at most, so this can easily be combined with other trips in the Sacred Valley."
        }, 
        {
            "index": 208, 
            "rating": "5", 
            "review": "Awesome. Our tour guide brought us to this zoo on our way to the Sacred Valley. It was very cool to see all of the native animals up close. They even have a condor enclosure you can enter and see these birds fly. There is no entrance fee but expect to feel obligated to spend money in their store to help support them as they receive little funding. Definitely worth stopping at."
        }, 
        {
            "index": 209, 
            "rating": "5", 
            "review": "Help the animals!. During our visit to the Sacred Valley on June 21, our guide asked us if we would like to stop at this refuge, that we had not heard about. It is not a zoo but a care-center for animals that have been illegally captured (some for illegal trafficking) or injured. The staff are volunteers, some are students from the area who care about the animals. Any animal that can be is re-habilitated and released back into their environment but there are some animals that are outside of their territories (like the strange looking bird from Brazil) and have to remain as permanent ´guests´. The one-in-a-lifetime experience of being in a large enclosed area with the condors and then having them fly over your head is not to be missed. These condors are more beautiful than the young condors in Colca. On your way out, you will be asked to make a contribution to this refuge as there is no entrance fee charged. It is a very worthwhile stop-over and it is a pity that it is not promoted more; it only takes a brief stop!"
        }, 
        {
            "index": 210, 
            "rating": "5", 
            "review": "You'll feel good having visited this refuge. I am not into zoos, and I don't like seeing animals in cages. However, each animal here has a much better home than where they came from. The guide will walk you through and tell you why they acquired each animal. For example, 2 pumas were rescued from a nightclub in Lima. Others were rescued from the black market. There are a few Peruvian hairless dogs that live there. These were neat to see and pet. The store benefits the refuge. They sell sweaters, stuffed llamas, t-shirts, hats, etc. You can tell the workers feel passionately about their work. It seems like they have done much good in the 6 years since they've been open."
        }, 
        {
            "index": 211, 
            "rating": "5", 
            "review": "One of my favorite things I've done in Peru. This animal sanctuary is a bit hard to get to but well worth it. We first went to see the ruins surrounding Cusco and hired a taxi from there (Qunqo). It is a 30 minute taxi ride. We paid 90 soles (about $27) round trip plus the driver waited one hour for us while we were at the sanctuary. When we walked in we saw several macaws and parrots out in the open and just feet from us. They had 5 giant condors, 3 pumas and several other exotic animals, all with their own story on how they were rescued and why they are there. All of the animals there are sick, injured, or were rescued from various tragic situations, all with the intention of being reintroduced to the wild when well again. You get to be up close and personal with each animal. The sanctuary is an amazing place with amazing people. We had the most wonderful experience there seeing these exotic animals up close, learning about different animal species, and even getting the opportunity to touch some of the animals. It is free to enter but donations are encouraged so be generous!"
        }, 
        {
            "index": 212, 
            "rating": "5", 
            "review": "animal refuge. Good opportunity to observe wild animals at close. I could even touch a condor. It was a unique experience after seeing these huge birds in Colca valley in their original habitat. Please keep in mind that it is not a zoo but a rescue center for injured animals. The tour is free but they live on donations so please be generous with your contribution..."
        }, 
        {
            "index": 213, 
            "rating": "4", 
            "review": "Condor Fly by. This rehabilitation facility for local animals. There are Llamas, Alpacas, Guanacos, puma, parrots and condors. We did not see the puma.The highlight is condors flying over your head. The condors walk up a hill and when the worker signals them they fly right over the heads of the visitors. There is also a weaving demonstration.One hour is plenty here."
        }, 
        {
            "index": 214, 
            "rating": "4", 
            "review": "Caring for the less fortunate animals. We toured the facility which rehabilitates injured or neglected animals. The area is set up to accommodate each type of animal including the mighty condor. A demonstration of weaving gives an appreciation for the work involved. The gift shop at the end of the tour helps to fund this worthy effort. This is a private facility not funded by the government."
        }, 
        {
            "index": 215, 
            "rating": "5", 
            "review": "An excellent place to visit. Excellent tour of the animal sanctuary! We especially liked seeing the Andean Condors in flight and the Pumas!"
        }, 
        {
            "index": 216, 
            "rating": "5", 
            "review": "Only place to see a condor?. This is an actual condor rescue facility, and was told it's the only place to see one. We saw pumas (sacred to Peruvians), and they have llamas and vicuna too, although those last two are seen lots of places. Quick tour by a biologist includes having him call to the condors who will fly right at you and over your head (if you are quick enough, you get a great photo op). They exist on donations, and a tourist shop which has lovely things."
        }, 
        {
            "index": 217, 
            "rating": "5", 
            "review": "Must visit when in Cusco. One of the highlights of our Peru trips. Amazing place, great mission, wonderful people. Take a break from touristy Cusco and spend a couple of hours in a magical place."
        }, 
        {
            "index": 218, 
            "rating": "5", 
            "review": "Great mission!. We were really impressed with this place - great educational message, outstanding facilities for the wildlife and a nice selection of items to purchase to support their cause. We got most of our souvenirs here!"
        }, 
        {
            "index": 219, 
            "rating": "4", 
            "review": "Loved this. If you love animals, this is for you. They have the cutest little collection of llamas, alpacas and a couple of spitting vicunas! Huge condors, and the star of the show was the owner's Peruvian Hairless dog! He's so ugly he's cute. It was also fun to see how the weaver's use natural dyes in coloring their yarn. There was a lady there weaving that had the fastest fingers I've ever seen. This is a fun, relaxing stop!!"
        }, 
        {
            "index": 220, 
            "rating": "5", 
            "review": "Great Attraction on your way to Pisaq. My family and I stopped here with our tour guide on our way to the Pisaq market. This was one of the highlights of our trip. You got to see many Peruvian animals that have been rescued. We saw llamas, alpacas, pumas, condors, macaws, etc. It was great!!! The people that work there are knowledgeable and passionate about the animals. The tour is free, but please make sure to leave a contribution/ tip since it is how this sanctuary survives. They have a great gift shop with things for every price range."
        }, 
        {
            "index": 221, 
            "rating": "4", 
            "review": "A great stop on the way to Pisac. A neat little place where they care for abandoned former pets. An interesting hodgepodge of species. The highlight is the condor flight.There is not charge, but you should expect to buy some souvenirs at the end of your visit. The souvenir prices were reasonable."
        }, 
        {
            "index": 222, 
            "rating": "4", 
            "review": "A fun and educational side trip. We stopped by this sanctuary as part of a day tour of the Sacred Valley, and we definitely enjoyed getting close to some of the unique animals of Peru including 2 of the animals sacred to the Inca (the Puma and the Condor). It is a small place but everyone is enthusiastic; I particularly enjoyed the demonstration of how natural dyes are made for the alpaca wool. A visit to the gift shop is a great way to support this organization."
        }, 
        {
            "index": 223, 
            "rating": "5", 
            "review": "Rehab facility for the injured. Great job these people are doing, the sanctuary was free of charge to visit, a donation is gratefully accepted on exit... and a free gift given as a thank you.We saw the condors up close and personal, llamas, macaws, pumas, guinea pigs and heaps more. Be supportive and visit this amazing place. Do it for the animals."
        }, 
        {
            "index": 224, 
            "rating": "5", 
            "review": "Wonderful place to spend a few hours. This was included in one of our tours and we thoroughly enjoyed this visit, where they rehab injured animals. We were lucky to see the condors up close - they are huge, pumas, macaws, alpacas, llamas, all sorts of interesting animals. We gave a donation at the end of our visit and we received a free gift as a thank you. Very enjoyable."
        }, 
        {
            "index": 225, 
            "rating": "5", 
            "review": "Great place to see some rare animals. This animal sanctuary is a really neat place to see some rare rescued animals up close and personal. You can take lots of pictures and even interact with some of the animals. The tour guides speak English and explain all of the animals and where they were rescued from. We saw turtles, llamas, parrots, a puma, swans, condors... the condors even flew right over top of us. There is no entrance fee, but they do encourage donations. Our hotel called a taxi for us, and it was 80 soles round trip to take us there and back to our hotel in Cusco. My only complaint was that I would have liked more time in the santuary to interact with the animals, it felt a bit rushed even though we were the only customers/guests there."
        }, 
        {
            "index": 226, 
            "rating": "5", 
            "review": "See Rescued Animals for Release. Great work by volunteers and donations to rehabilitate rescued animals from local areas and the Amazon and prepare them for release back into their habitat. Terrific opportunity to see some rare species and get close to many.No entry fee, but after your tour, if you're not motivated to make a donation you obviously don't have a heart."
        }, 
        {
            "index": 227, 
            "rating": "4", 
            "review": "Cochahuasi Animal Sanctuary. I enjoyed the tour and seeing the animals (especially Condors, Pumas & Macaws). The sanctuary is small but they seem to be doing good work and it´s an interesting thing to do for a morning or afternoon in Cusco away from the main tourist haunts. Lots of people don´t seem to know about it so if you want to go just go to the main square (Plaza de Armas) and near the fountain there are representatives from the sanctuary and they have a bus to take you there (once you pay for the bus the entrance and guided tour are free/included). There are also some nice alpaca textiles that you can buy if you want some souvenirs which will also support the sanctuary."
        }, 
        {
            "index": 228, 
            "rating": "5", 
            "review": "short & perfect day trip. if you have 2 hrs to spare, take this trip! for 25 soles well spent, a shuttle from Plaza de Armas will take you to and from the animal sanctuary. Once there, you will get a 45 min guided tour of the intimate sanctuary. The stories about each of the animals there is wonderful, and the sensitivity they have towards each animal is noticeable and appreciated. The super-friendly deer and baby alpacas are a definite highlight, as well as the beautiful macaw parrots and close encounters with the condors and Peruvian hairless dog. Super cool. The education the staff provides is awesome. I actually loved learning about the process of processing and coloring the alpaca hair/fabric. Any donation and purchase goes to a good cause! So worth the short time investment!"
        }, 
        {
            "index": 229, 
            "rating": "5", 
            "review": "The world needs more people like these people. I absolutely loved this place. I was impressed with the volunteer guide and his presentation about each animal. The surroundings in which the animsls are kept are clean, accommodating of their individual needs. The condor show is spectacular. The shop overcharged me for some items but I figured it was all going to a good cause so didn't mind.Not many tour operators want to take you here. It's not flash or showy - just down to earth, back to basics where people show respect for abused animals in a caring environment run on the smell of an oily rag. Do yourself a favour and visit. They will appreciate your donation and you'll be rewarded as well."
        }, 
        {
            "index": 230, 
            "rating": "5", 
            "review": "Great little animal rescue operation. On the way from Cuzco to Urubamba if you go Via Pizac (Longer but with great things to see.) A small group of very dedicated animal lovers have Condors, Pumas and other rescued animal you can see. You can even go in the Condor Pen and they fly over you.Great stop over and buy a t shirt or some Lama wool and you will be helping a great cause"
        }, 
        {
            "index": 231, 
            "rating": "4", 
            "review": "Small but nice. First, I would like to say that this is a very small sanctuary. I expected a slightly larger area with more animals. However, other that that, my experience at the animal sanctuary was very good. My tour guide spoke good English. He also seemed to be very knowledgeable, friendly, and, most important of all, to genuinely care about the animals there at the sanctuary as well as elsewhere in Peru. There is a nice little gift shop toward the entrance/exit of the sanctuary and I got several very great photos with native birds. Overall, this was a very good experience. My advice to others: just do not expect a really long time at the sanctuary. It can be completed by 90% of people in 15-45 minutes just depending on how much time they chose to spend on each step of the tour. My favorite parts of the tour were listening to the small baby animals and standing right beside a very large, very sociable acting native bird."
        }, 
        {
            "index": 232, 
            "rating": "3", 
            "review": "Enthusiastic staff. Enjoyed my visit, caring staff but 3 pumas and 4 condors, not sure there is much conservation. Funded by donation. Good exhibition of wool dyes. They force 3 condors to fly for food. Having seen condors in the wild later in our holiday felt sorry for the 4 here"
        }, 
        {
            "index": 233, 
            "rating": "5", 
            "review": "unique experience for a great cause. I had wanted to check out this place since reading about it on Tripadvisor...but wasn't sure how to reach it on my own (not many locals knew about this either!). It turns out that they send out shuttle buses to the Plaza de armas in Cusco twice daily (not sure what time they come in the morning, but the afternoon is at 3pm). Look for reps wearing green vests, round trip costed 25 soles.Upon arrival, I was greeted by one of the workers who explained in detail in English about each animal (where they came from, what Cochahuasi is doing for them..etc). Saw many of the endangered animals up close, including the flights of the 3 condors.They do ask for a voluntary donation but were not pushy at all in the end. they also have a shop selling beautiful locally made textiles and clothing/accessories, with the proceeds going back to the sancutary.Overall an unique experience in Cusco, highly recommended for anyone wishing to go off the typical \"touristy\" path in Cusco and learn more about these endangered animals."
        }, 
        {
            "index": 234, 
            "rating": "1", 
            "review": "Small, simple but perfect to see animals up close. This is a really small center where they rehabilitate animals from the andes and some from the amazon. I think they do a great job, the animals looked good and are taken good care of. It's simple but the volunteers speak English and can tell about the animals they have. You also have the possibility to stand right next to a condor, that was amazing."
        }, 
        {
            "index": 235, 
            "rating": "5", 
            "review": "lovely!. this is an incredible place to visit for those loving animals, I would say that when you come out after the visit, you feel yourself relieved thinking that people take care of the animals, struggling against the illegal hunting and commerce, ah! and you can take great pics."
        }, 
        {
            "index": 236, 
            "rating": "5", 
            "review": "Worth your time.. My brother and I hired a taxi for the day to see the Sacred Valley. We stopped here and it was worth the whole day's trip. I have seen a condor refuge outside of Otavalo, Ecuador, but they did not fly over my head. Enjoy the picture."
        }, 
        {
            "index": 237, 
            "rating": "5", 
            "review": "Please visit and contribute!. This very special sanctuary for endangered and injured animals relies on donations from the public. See condors in flight and learn about the local animals."
        }, 
        {
            "index": 238, 
            "rating": "4", 
            "review": "Small but wonderful sanctuary!. It wasn't the most amazing thing I did in Peru, but you get to see a condor fly, and the people are very friendly. They speak English too, so you can have a tour in English if you want."
        }, 
        {
            "index": 239, 
            "rating": "5", 
            "review": "Tremendous!. What a superb find! Truly delightful! On the road to Pizac is this little animal sanctuary where they have accepted injured or abused animals. The staff are quite charming and you will see more Peruvian animals in five minutes than you will during the rest of your holiday. This includes Pumas, wild Andean cats, unusual mammals and you will even see Condors flying. Quite fascinating and very interesting. Do visit them and support them: no entry fee, just a donation or buy something from their small shop if you wish. Probably one of the best local attractions for adults and children alike."
        }, 
        {
            "index": 240, 
            "rating": "5", 
            "review": "TRIP HIGHLIGHT, AS PROMISED. Last year another family told us that their kids loved this place above all else during their trip to Cuzco. It held true. This was probably my kids' favorite place to visit while we were in the Cuzco area. Seeing the condors was the highlight, and also a territorial Vicuna (who knew?) up close. :)"
        }, 
        {
            "index": 241, 
            "rating": "5", 
            "review": "Had a great time. We loved our visit here. The pumas didn't come out of their \"cave\" but the condors were really amazing to see and very friendly!"
        }, 
        {
            "index": 242, 
            "rating": "5", 
            "review": "Must see if you're close by.. First off I'm shocked by a few of the comments. One guy states he thinks the animals would be better served in the wild. These animals are in a sancuary because they can not function in the wild. You will see some of the animals are injured. You will have a condor fly right by your head and get as close to them as you like. The staff who I imagine are volunteers are very helpful and friendly. They even gave us an awesome whistle for donating. 5 stars for sure!"
        }, 
        {
            "index": 243, 
            "rating": "5", 
            "review": "Best place to find exotic animals. I saw a lot of animals, like condor, puma, birds of different colors, etc. The staff was very friendly and gave us the tour of the place. This place took care of animals that were abused. They sell some scarves, sweaters, etc. and the earnings go to protecting these animals."
        }, 
        {
            "index": 244, 
            "rating": "4", 
            "review": "Animals saved here. A 20 min trip from Cusco. Get to see a Condor, Llamas, Vicunia and Alpacas. Free, but you can donate any amount, it goes to saving these animals."
        }, 
        {
            "index": 245, 
            "rating": "5", 
            "review": "Once in a lifetime experience having condors up close and personal. A magnificent opportunity to see rare Peruvian native species and help a wonderful cause. Ask to see it as most tours skip this gem."
        }, 
        {
            "index": 246, 
            "rating": "5", 
            "review": "Condors, Amazon parrots and Puma's. Our family loved every moment of this sanctuary, up close and friendly with massive condors, hand feeding rare parrots, whilst seeing puma's recovering from human interaction. The guides are great and kids will just love it as you enter the condor cage and see and feel them fly over your head. A wonderful morning"
        }, 
        {
            "index": 247, 
            "rating": "5", 
            "review": "GREAT EXPERIENCE!. Great things come in small sizes! This place is great... lots of animals, all rescues, way better than forking your money over to a Zoo. Staff was very friendly, and the Condors flying over your head is something which words will not do justice.... definitely recommend this place to all my friends!"
        }, 
        {
            "index": 248, 
            "rating": "4", 
            "review": "Way to see a condor up close. During our day trip in the Sacred valley, our taxi driver recommended stopping here and it was worth it. It's a great initiative to protect and rehabilate animals that were in captivity/poor conditions and are not fit to reenter the wild.The lady who showed us the different animals and told us about how they came into the shelter's care was very passionate and informative. She also shared information about the species and some of the challenges these species face in the wild.There is a nice gift shop or you can make a donation to the center if you want. An added bonus is that you can see condors from up close (less than 4 meters away)."
        }, 
        {
            "index": 249, 
            "rating": "4", 
            "review": "Fantastic. We visted here today and really enjoyed ourselves. It's obvious how much they care for the animals and are passionate about showing the public around. I'm not a fan of zoos at all and was a little apprehensive before visiting as I hate seeing animals behind bars but the stories behind each animal and the rehabilitation that occurs here is very positive. There are lots of parrots and macaws which are free to come and go when they please! Remember to give a generous donation as this place depends on it!"
        }, 
        {
            "index": 250, 
            "rating": "4", 
            "review": "Healing animals of South America. We stopped on our tour of the Sacred Valley. It was worth it to see so many animals up close. We also enjoyed the weaving and shopping at the store."
        }, 
        {
            "index": 251, 
            "rating": "4", 
            "review": "Rare Opportunity. Sharon and I dropped in here on our way to Pisaq Markets in the Sacred Valley about 20 minutes out of Cusco.We were warmly welcomed and escorted (probably a little bit quickly) through the complex by a English speaking attendant which helped immensely with our understanding of the animals in the Sanctuary.It is really very small and the visit only took about 30 minutes but gave us the rare opportunity to see Condors up close and see Pumas ... all be it in a very small enclosure.We couldn't quite decide whether this was in fact a real sanctuary where the animals were offered time to come back to some health to be repatriated or whether it was a zoo for the benefit of the tourist trade ... the rhetoric while we were there was all about animal welfare and rescue so I will give these guys the benefit of the doubt.A good opportunity to see some S American animals up close.We left a generous donation which was warmly received.Drop by and support them ... animal welfare in S America is hard work."
        }, 
        {
            "index": 252, 
            "rating": "4", 
            "review": "Something a little different. For 20 soles a person they will drive you out to visit this rescue center with condors, parrots, vicuña, even a tortoise. They are providing a home and rehab for injured or endangered animals and will ask for a small donation. They also have many lovely things in their gift shop, with profits going to the animal's care."
        }, 
        {
            "index": 253, 
            "rating": "4", 
            "review": "They need some help. Animals looked well cared for except the macaws, they need to be moved into a heated area. Trying to do good work but should work closer with governmental agency like Inrena to meet government standards. Not worth the taxi ride out to see this attraction. It's a rehabilitation center not a zoo, so don't expect to see many healthy animals."
        }, 
        {
            "index": 254, 
            "rating": "5", 
            "review": "Wonderful animal experience. We stopped by as part of an animal volunteer project. This sanctuary was a great stop on our tour. Really interesting - nice to see animals \"living happily\" together."
        }, 
        {
            "index": 255, 
            "rating": "5", 
            "review": "Great way to see Peruvian animals up close. I had been trying to get good pics of the Condors and Acunas earlier in the trip but couldn't, as they were in nature. But here in the sanctuary it was nice to see them up close and also being cared for by loving and attentive staff. It's a great thing to support and I definitely did! I wish I could've stayed longer!"
        }, 
        {
            "index": 256, 
            "rating": "5", 
            "review": "Feeding Llamas and Condors Grazing your Head!. We stopped by this animal rescue on our way to the Sacred Valley of Pisac and absolutely loved it. We learned a great deal about the animals in the Andes region and were able to pet & feed different varieties of Llamas & Alpacas and even see condor feed while we were in their cage!The animals are lovely, as are the staff. It is worth stopping by if you're headed to Pisac from Cusco and PLEASE support their cause!"
        }, 
        {
            "index": 257, 
            "rating": "5", 
            "review": "Loved this place - would recommend visiting it. This is one of our favourite places we have been on our trip so far. We pulled in as we travelled from Cusco to Pisac.Most of the animals are rescued and you don't pay to get it but give a donation or buy something from their shop.I love places like this where they are helping animals and the people who worked there were really friendly and willed the Condors to fly over you!A great little place that isn't advertised as much as it should be."
        }, 
        {
            "index": 258, 
            "rating": "5", 
            "review": "A nice thing to support. This is an excellent opportunity to see some of the south american wildlife. Thank goodness someone sis doing this. The birds are gorgeous and there is some wild cats that are a beautiful also."
        }, 
        {
            "index": 259, 
            "rating": "4", 
            "review": "Love the Condor fly by. This place is great, we take our guests here often and they allwayse love it. The people at Cochahuasi are providing abused and misstreated animals with a safe and caring enviroment and do their best to rehabilitat and release back to the wild any animals they can. The highlight of the visit is when they take you into the Condor enclosure and draw the birds down from the top with food, The Condors will typically fly right over your head, I have even had wingtips graze my hat on occation. I highly recoment this to anyone traveling to Pisac, the entrance fee is very reasonable (donation) and you would be helping support the animals."
        }, 
        {
            "index": 260, 
            "rating": "5", 
            "review": "Bigger and Better. This was my second visit to Cochahuasi and I was very impressed with the improvements since my last visit 2 years ago. More animals and better enclosures, especially for the pumas. They have added a fiber and weaving demo and the gift shop is now truly impressive. They seem to have more visitors now, which is great, although the guides were a little rushed and too quickly herded us to the shop when another group showed up. Still, their mission is important and I'm sure they'll find the right balance. And, of course, the condors are amazing!"
        }, 
        {
            "index": 261, 
            "rating": "5", 
            "review": "Take the time to visit here!. I am a veterinarian and my husband found this place online prior to our trip. Needless to say, I had to visit, and I was not disappointed. The sanctuary is full of beautiful and well taken care of animals that each have an interesting and often sad story about how they ended up there. Some of the animals here included pumas, macaw parrots, guanacos, vicunas, Andean condors, storks, and white tail deer. One of the staff members greeted us as soon as we arrived and proceeded to show us around the sanctuary. She took us inside the Andean Condor enclosure, which was absolutely incredible. These birds are huge and will fly right over your head while you are in the enclosure. It is unlike anything you'll experience in the US. The Condors hopped around us and acted curious while our guide explained to us how endangered they are and that they hope to soon start a breeding program at the facility. It costs nothing to visit the sanctuary but they do accept donations, which we gladly gave. This place is a little bit of a drive outside of Cusco but we easily got there by taxi and it was well worth it."
        }, 
        {
            "index": 262, 
            "rating": "5", 
            "review": "Well worth a visit. The sanctuary are doing great things for the animals and it is worth taking time out to stop to visit whether you are heading to Pisac or Cusco. The kids loved it as did the grown-ups. A nice variety of animals to view. Payment is by donation and the guides tell you in full detail how long the animals had been there and how they were discovered."
        }, 
        {
            "index": 263, 
            "rating": "5", 
            "review": "Gem of the Area!. Our tour guide stopped with us here last minute. We loved the chance to view so many animals up close. (This is a rescue animal place if you weren't aware.) We saw condors, macaws, pumas, a stork, vicuña, llama, alpacas, turtles, and I'm sure I'm forgetting something! A young man walked us thru the whole area explaining every animal too. It's definitely worth your time to look this place up."
        }, 
        {
            "index": 264, 
            "rating": "5", 
            "review": "Face to face with condors. It's a wonderful little place to visit. Not really signposted and a bit out of the way so a taxi is probably the best way to get there unless you are on a tour that stops there. Entry is free, donations and/or buying from the gift shop is encouraged. Volunteer show you around and tell you the stories of how the animals got rescued, what they do at the sanctuary to help rehabilitate, their breeding programs and why some of them can no longer be released into the wild. There's a big collection of native animals - puma, Andean deer (which you can feed), macaws from 3 countries, alpaca, llama, vicuna, tortoise, a baby toucan and of course, the 3 majestic condors. There's also a pet hairless Peruvian dog. We learnt a lot of interesting facts about the types of animals as well as the individuals. As others have mentioned, you get to go into the condor cage and see them fly over your head, as well as get up close and person to have a good look at them. Absolutely amazing experience!"
        }, 
        {
            "index": 265, 
            "rating": "4", 
            "review": "Worth the short trip to be next to Condors. I would have missed this as a tour because the tour was being sold on the Street. I was amazed to find out and in fact did stand right next to two condors with their wings spread open. The place is safe and a very nice drive over the mountains overlooking Cusco. The dive took about a half hour at 35 mph. There are also Pumas, llamas, al pacas, etc. Even though caged, this is up close and the animals seem well cared for. The cost was only 20 soles for everything. This appears to be non-profit and they do accept donations but they do not ask for them or push anything on you. I highly recommend if you want to see condors up close and personal."
        }, 
        {
            "index": 266, 
            "rating": "5", 
            "review": "a do not miss site. I read about this on WikiTravel which I will always consult from now on as well as Lonely Planet which did not include. This fine family does not charge you to observe at close range pumas, tortoises, vicunas, jungle cats and the mighty Andean condors. Clean surroundings and where else would you EVER see a flying condor at 20 feet? Donations accepted. Be charitable when buying from the excellent store there and-or leaving a healthy donation to this altruistic family."
        }, 
        {
            "index": 267, 
            "rating": "5", 
            "review": "Hidden Treasures. Our private guide recommended this locale and it was amazing, educational and would highly recommend a stop. The Cochahuasi guide provided a very compelling explanation of the history of the animals and how they came to live at this sanctuary. You get a very close up, hands on type of tour. There is no charge to visit, but they ask for donations or you can shop at their store. The woven goods that they sell are all locally made and are the finest that I saw in Peru. The textiles are worthy of any museum store. The clerks will also explain the story woven into each piece.... ranging from wall hangings, to scarves, ponchos, bedspreads, all exquisite and made from the various wools, naturally dyed. To me, this was one of the well hidden highlights of Peru. Highly recommend for the mission, the animals, the textiles and for the local families that are supported by the sales in the store. This whole area is so beautiful and the Santuario is no exception."
        }, 
        {
            "index": 268, 
            "rating": "4", 
            "review": "Get up close with native animals. This was a lot of fun and a great short stop on our way back from Pisac to Cusco. We stopped for about 45 minutes. Our guide spoke very good English ANC showed and explained how they got many animals, including vicunas, pumas, and condors.Seeing the hugs condors fly by was impressive, and they took our picture with it, too.They had a nice shop with quality items for sale, and a donation box where we could choose to give to support their animal rescue efforts. Overall a great stop!"
        }, 
        {
            "index": 269, 
            "rating": "4", 
            "review": "Get buzed by a Condor. This is an interesting place to visit that not only affords you the opportunity to see a variety of Peruvian animals, but is also doing some good in the process. Aside from rescuing a variety of animals, the center is also hoping to start a Condor breeding program to help increase the number of wild condors. The center is does not charge any admission and only requests donations, it is also the only place I know in the Cusco area where you can be buzzed by a condor."
        }, 
        {
            "index": 270, 
            "rating": "4", 
            "review": "Got blessed by a Condor!. During my all day Sacred Valley tour, the Ccochahuasi sanctuary was my first stop.By Northern American standards, it's small and some animals are in rather tight caging. However the people running the sanctuary and making the effort to save animals native to their country. My guide gave me insight in the various animals and why there are there. Some were there due to illegal smuggling, others because of injuries, some because the lost of habitat,etc.I will admit that learning the difference between Ilamas, Alpacas, Guanacos, and Vicuna was helpful.The Puma stayed in his area and didn't see him.There are several colorful parrots on site. There are also three Condors. The guide went to get food for them and told me when they start flying down to duck. The first time I thought that I ducked low enough. But I got brushed on my left side (almost knocked down) when he came flying. The second time I knew to duck lower!! The guide told me to me touched by a Condor will bring good luck, we will see!!The next area has a local woman demonstrating weaving techniques and the use of items for natural dyes. I got to get a great viewing and demo being the only person there.The guide requested a donation for the sanctuary. She wasn't pushy about it and grateful for the assistance.There is a small shop with Alpaca items on sale. I did purchased items that were reasonable in cost.While it don't look like much, stop by and pay a visit to learn about animals native to Peru"
        }, 
        {
            "index": 271, 
            "rating": "5", 
            "review": "By chance a gem. We visited CCOCHAHUASI on our way from Pisac to Cusco. First the llama-Alpaca Ranch where we hand fed and mingled with them. Now we know the difference between llama, Alpaca, Vincuna and guanacos.Then across the road to the sanctuary. Puma, Condors, parrots, and many more. And a guide tells you about each and the rescues and some sad stories, and some happy ones. And to be in the aviary with the condors ...............It´s all free and all they ask is a donation and not in any demanding way.Yes easy to criticise them on cage size (see below - but they are far bigger, cleaner and better than many zoos) but these people care and have got off their backsides and are doing something. Lovely animals, lovely people, educational, and great feeling to be able to help in a tiny way. Highly recommended and it is on most peoples routes to and from the valley."
        }, 
        {
            "index": 272, 
            "rating": "4", 
            "review": "Worth A Stopover. A small place, but worth it. About 30 minutes outside of Cusco, on the way to Pisac. The highlight is the 3 Peruvian Condors which are huge! They let you get right next to them, and they will fly off which is kind of nerve racking considering how large they are. They even make a swooshing sound when they fly because of their size. They had 3 pumas though only 1 was visible, and other animals though not much. They ask for donations at the end and have a gift shop which helps them. Spent about 45 min there as a guide walked us through."
        }, 
        {
            "index": 273, 
            "rating": "3", 
            "review": "Interesting, great chance to see condors.. We found a volunteer handing out flyers in plaza de armas. We had a taxi take us there and back for 20 soles (£5) for 40 mins journey each way. The place itself is very run down , no sign on outside u would drive past not knowing it was there. We had a volunteer show us round , which felt quite rushed. The enclosures were in bad conditions and in need of repair. We were told the stories of how the animals came to sanctuary and it was encouraging to hear that some animals are released into wild. The enclosure with the condors was amazing experience, there were 3 in there and u got to see them fly. At the end of visit u can choose free pen or whistle which was sweet. There is shop and small snack hut.we gave 50 soles donation. Visit Here if u want seething different to do and if u want to support a worthy charity!"
        }, 
        {
            "index": 274, 
            "rating": "5", 
            "review": "A Must See in the Sacred Valley. This is sort of an animal rescue/zoo/educational venue that is a must see. We also didn't have this on our itinerary and it was empty, so I suspect that it doesn't get visited by most tour programs, but our local guide thought that our kids would like it and it was one of the main highlights for us in the Sacred Valley, Cusco Peru. It isn't very commercialized like many \"petting zoos\" in the sacred valley that let you feed alpaca and llama, but it has a much better mission and has a broader selection of endangered animals. Please try to support them with a donation or purchase when you visit. The Condors and Puma are amazing."
        }, 
        {
            "index": 275, 
            "rating": "5", 
            "review": "Great Place to see Condors. This is a great place, run by animal lovers, the animals come from neglect, or are seized animals, some are rehabilitated to the wild some will stay forever due to the abuse they suffered, it is well worth your time to see."
        }, 
        {
            "index": 276, 
            "rating": "5", 
            "review": "Condors, pumas y mucho mas!. This place was one of the highlights of my visit to Peru, but it was not on our group itinerary. We heard about it from some locals. It is run by two brothers, I think, with science backgrounds, who decided someone had to do something to educate people about the poaching of condors and declining populations and mistreatment of other animals native to the Andes. They rescue, rehabilitate and release, if possible, many species of animals. But the main attraction is the condors. They actually had a breeding pair, and were releasing young birds to the wild each year.I think it's important to see past the touristy veneer and get at least a glimpse of the real Peru, the real people and the real problems. The Santuario Animal Cochahuasi is a good place to start. But you will probably have to make your own arrangements to get there. Though it is right on a highly traveled road between Cusco and Pisaq, at the time I was there (July 2011) the owners said they didn't get too many tourists because they refused to pay the tour guides to stop there. They wanted every dollar possible to go directly to the animals. This is a don't-miss attraction in the Sacred Valley. They are dedicated to the important work they are doing, and your donation dollars (there is no admission fee) will help immensely. They have a great little gift shop, as well, and you can be assured your purchases are furthering the work."
        }, 
        {
            "index": 277, 
            "rating": "4", 
            "review": "Pumas and Condors. Something you do not expect to see, but if you have time stop there and see how in simple way, the family who works there have a great intention in the protection of some species in danger. A photo with the condors was awesome."
        }, 
        {
            "index": 278, 
            "rating": "4", 
            "review": "Nice. We had a lot of fun here- the animals were well treated and the guide was very nice. We got to see pumas, condors, llamas, alpacas, dogs and parrots. The kids got to hold the parrots on their arms and after they were also allowed to carefully hold puppies. We had a great time!! Nice souvenir shop. Donations are highly appreciated there. Recommended!!"
        }, 
        {
            "index": 279, 
            "rating": "5", 
            "review": "One of my peru highlights. One of the best things i did my whole trip, about a 30min-45min drive out of cusco, nice scenic drive. no entrance fee, runs on donations and a store they have. was greeted by a young tour guide, told us all about every animal in there, how they got there, if they can be released again or not, what they eat, and what eats them. pumas, peru deer, alpacas, lamas, parrots, jungle cat kittens, birds of prey, Condors, and a few others. condors have a nice large avairy that you can walk in and get pretty close to the big birds and get nice pictures. and they show you where they get the colours for the alpaca wool, like certain rocks and plants for different colours. they have a large shop to buy many fine baby alpaca times and other animal items and sculptures. with a donation you get a parting gift of a wooden condor whistle, a really nice unexpected treat. A great small sanctuary worth seeing and a worthy cause to donate to.there is also a alpaca/lama petting ranch just down the road, only 4 or 5 pens, but a few different kinds and you can hand feed them, ask for grass if there is none out. also on donations, and has a shop that serves alcohol! haha."
        }, 
        {
            "index": 280, 
            "rating": "2", 
            "review": "Sanctuary or Jail?. OK, there were lots of cool animals. And they were well cared for. I just had a problem w/ the idea of whether this was how we, or al least American's, would view a \"sanctuary\". It had a very zoo-like feel. Can't believe the Pumas or Condors would not have been better served in the wild."
        }, 
        {
            "index": 281, 
            "rating": "5", 
            "review": "A must-see for any animal-lover who visits Cuzco or the Sacred Valley. Whever I travel, I try to support local animal charities, shelters, or humane organizations who care for animals. When in Peru, I looked for such a group prior to traveling and found this sole review for the Ccochahuasi Animal Sanctuary. I visited the sanctuary in May 2012 and was very impressed with the facility, the experienced guides and the up-close-and-personal experiences with unqie animals offered at this facility. It is approximately 45 minutes from Cuzco and admission is free - the center survives off visitor donations and certainly I was happy to give them one for the important work they do for animals in the region - rescuing them when injured or when traded illegally in the black market. We say many animals - including pumas and bobcats - but the flight of the magnificent condors was perhaps the highlight of the visit - these exquisite birds (wing span of up to 11 feet) flying so close that the force of their wings moves your hair. It was nothing short of spectacular. The guides are friendly and informed and seemed prepared to speak with travellers from many nationalities speaking many languages. I encourage any animal-lovers to visit the Sanctuary - help the animals by donating to this worthy cause - and bring back some souvenirs for your loved ones that go a long way to supporting the wildlife in Peru."
        }, 
        {
            "index": 282, 
            "rating": "5", 
            "review": "A great program. Our guide asked if we wanted to visit a \"zoo\" on the way to Pisac. I was not so interested but she said it had condors and you could see the animals close up. So, we decided to stop not expecting much. We were quite glad we did. We were able to go inside the condor aviary and actually touch them. We saw several other animals as well that have been rescued from injury or bad situations. Some are in cages and others in an open area. There are llamas, hairless dog, tortoise, parrots and birds, coati, etc. They educate on why we should not buy souvenirs that use condor feathers and other important ways to help the animals and birds in Peru. They exist on donations from visitors to this place. It is definitely worth the 45 minutes it would take to visit here."
        }
    ]
}