{
    "category": "Cusco", 
    "entity": "El-Camino-Salkantay-Trail", 
    "avg_rating_stars": 4.786206896551724, 
    "review_count": 145, 
    "rating_stats": {
        "poor": 1, 
        "average": 4, 
        "terrible": 2, 
        "very_good": 12, 
        "excellent": 126
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "The views are priceless. A week ago I did the Salkantay 5D/4N.The Trek itselfIt's a beautiful trek starting from the mountainous area (2900m) over the Salkantay pass (4650m) back down to the cloud forest (1800m) and up to Machu Picchu on the last day (2400m). The first day you will hike around 5 hours and ascend 900m. In the afternoon you have the possibility to visit beautiful lagoon Humantay, it's another 400m up but worth the pain. The second day is the most demanding one, in the morning 850m up, in the afternoon 1750m down with a total distance of around 25km. When you are on the highest point, ask your guide to go to lake Salkantaycocha, another beautiful lagoon which most groups miss. After you have passed the highest point the landscape changes slowly and becomes cloud forest. It's getting warmer but prepare for rain. The third day is not comparable to the first two and much easier, it's not even a 4 hours walk along a gravel road. After that you have the chance to visit hot springs in Santa Teresa, where you will be brought by bus. Day 4 you will walk around 6 hours, the first part is also along a road while the second part leads you along a railroad to Machu Picchu Pueblo. On the last day you will get up at 3:30 to get to Machu Picchu by 6am and enter as one of the first groups which is amazing. After 9am Machu Picchu is far too crowded, so enjoy the morning hours. The hike up in the early morning is very demanding as it contains 1700 stone steps, you will sweat like hell even though it's still cold. In the afternoon you will walk back along the railroad and then get back to Cusco by bus which takes 6h. Where to bookYou can do the trek yourself, but the tours offered in Cusco are reasonable priced, from 170$ (student with ISIC card 150$) including accommodation, guide, food and mules. The group sizes are 10-20 people which is a perfekt size (you don't walk together all the time as everyone has his own speed). There are also private tours for much more, but I think in a group you have more fun than alone or with private guide. Don't book from abroad or online, just go to Cusco and book your tour for tomorrow!OrganizationThe first 3 nights you will sleep in campsites, which are surprisingly good, the last night in a simple hostel. The mules will carry 5kg of your baggage (if you want them to take more it's just a few dollars). You can rent walking sticks (which you don't need) and a warm sleeping bag for 10$. Tents and mattresses are included and also carried by the mules. The food along the trek is good, but could be a bit more. I haven't heard big complaints about any guides and had a good one by myself. But when doing a 170 bucks tour, have in mind that you chose the cheapest option. Recommendations:- Do the cheap tours if you are on a budget, nothing to worry about- Visit the lagoons I have mentioned, they are stunning and have a dip in them or in the rivers, it's refreshing!- Be prepared for all weather conditions- Do the hot springs (day3, 10 soles) and zip line (day4, I didn't do it, but the photos and videos looked great) as these are the most boring hiking parts. you won't miss much. Book the zip line in advance when booking the trek, it's cheaper in the agency.- Visit the Sun Gate in Machu Picchu, it's another 45min hike but offers great views"
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "Excellent approach to Macchu Picchu. Not wanting to arrive in Machu Picchu via bus, we found this alternative, which required training ahead of time to be able to cross the 4500 meter pass of Salkantay without altitude sickness, and required stamina to hike 6 hours a day. It was well worth it, especially since the Mountain Lodges of Peru make sure their guests are welcomed, well fed, rested and happy."
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "Priceless views. We did the 5D/4N Salkantay Trek with Alpaca - the views itself were as varied as they were breathtaking - from the first day conquering Abra Salkantay and hiking through the snow, to the latter days experiencing highland jungle and then walking across the original path that Hiram Bingham originally took to discover Machu Picchu, this trek certainly has it all. The best part about it were that we hardly encountered any other travelers at all."
        }, 
        {
            "index": 4, 
            "rating": "4", 
            "review": "They can't spoil the natural beauty. We wanted to offer our children, aged 9 and 7 a trek that they would remember and this walk certainly provided the challenge yet reasonable safety we were looking for. There are lots of tour companies who arrange this trip and many act largely as middlemen between guides, cooks/arrieros etc. and those who run the campsites. You get what you pay for in terms of quality of service. The first campsite at Sorypampa was abysmal; owned or managed by a hard-faced man out of Dickens, who rents his horses to ascend the path at 4600m. Capitalism being what it is, it is a matter of supply and demand and he has the supply! That area is ruined somewhat by barbed wire fencing and litter - they really should be more sensitive to the setting! The campsite at Chaulay was better. As a way of getting to Macchu Picchu it serves its purpose though some of the walking is along country roads rather than paths and the last walk to Aguas Calientes is definitely underwhelming. But what you do get is a sense of perspective and we are small compared to nature! Very proud of how well our sons coped with the challenges! You can do it all yourself, as some people we noticed did, but for a few hundred $ we decided to go with a company and, despite the cold food and poor English of the guide, it was worth it for the ease of access."
        }, 
        {
            "index": 5, 
            "rating": "5", 
            "review": "The reason I went Peru. The trek was the most awesome thing I did in my life. It's not an easy trek, but all the effort you put in the way worth it. It's awesome, really awesome."
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "great adventure into the incas. its a tough trek up through the Salkantay mountain and gets very cold thin air but its a great challange and its all worth it when you get to see Machu picchu!!!The views are fantastic all the way and you really get a feel of how it once was when the incas ruled"
        }, 
        {
            "index": 7, 
            "rating": "5", 
            "review": "Spectacular mountain trek. We hiked the Salkantay Trail as part of an REI guided tour. Stayed in lodges run by Mountain Lodges of Peru, which is an absolutely first class operation. Phenomenal food and accommodations at each lodge. The trail itself is spectacular. The views of Mt. Salkantay are some of the best anywhere in the world. Trail conditions are a little rugged due to heavy use by pack animals, but I would recommend this trek to anyone who loves to hike and can find their way to Peru."
        }, 
        {
            "index": 8, 
            "rating": "5", 
            "review": "Salkantay Trail. What a great alternative to the initial Inka Trail. We had a great group and a great gide, we were like a little family, even if at the beginning, I didn't know anybody of the group. I really had a good experience."
        }, 
        {
            "index": 9, 
            "rating": "5", 
            "review": "Go with Alpaca Expeditions. These guys are the best. Great food, great guides, great teams. They will take care of you 100% ...."
        }, 
        {
            "index": 10, 
            "rating": "5", 
            "review": "Not for the faint hearted. El Camino..be sure that this IS a true Camino. It is costly to get a three/four day tour with altitudes that are challenging and treks on glaciers that will test the best and fittest. What I found strange was that some tour operators allowed people to take on this very, very challenging feat without screening!! Simply put you are going to 6000m ..climbing with a pack on your back..fully clothed for mountain climbing..on ice at times....in very dangerous conditions ..without any serious training or preparation. Oh..you do get a half day learning how to climb a glacier with the proper gear but COME ON!!! Anyway. If you want adventure..absolute exhaustion and elation afterwards at serious altitude with pretty much zero sleep and rest.. GO FOR IT. It is super...wonderful..exciting.....and dangerous. Don't be fooled by the sales people who say..it's easy..IT IS NOT even for the fittest as altitude does not recognise fitness or age or any normal circumstances except ARE you altitude ready and crazy enough to do this Camino. Highly recommended.....seriously!! But beware..."
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "Amazing trek. Challenging but well worth the effort! Salkantay Glacier won't be here forever. Our guide from ViewPeru was terrific and the porters and cooks were outstanding. Bring warm clothes for the highest point!! Gloves, hats, scarves and good boots."
        }, 
        {
            "index": 12, 
            "rating": "5", 
            "review": "This was a major highlight of our trip to Peru. This is a great place for photographers. The photos I took were so cool. It was by far the highlight of the trip. Swam in a glacial lake at 14k ft there."
        }, 
        {
            "index": 13, 
            "rating": "5", 
            "review": "Trail offers stunning views around each corner. We traveled the trail in July and had perfect weather, cold in the mornings and evening perfect hiking weather during the day. The views are amazing and the vegetation is constantly changing and very diverse. Be prepared for all weather, and watch out for crazy horse teams galloping back down the pass!"
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "Great hiking experience for both begginners & seasoned trekkers!. We did the 5 days 4 nights Salkantay Trek, and this was a great hiking experience. You'll need a couple of days to acclimatize in Cusco before hitting the ground. It suitable for both beginners and more experienced hikers. The second day is the most challenging as you start at 3800m (second camp) go through the Salkantay pass at 4630m, and then hike down to the 3rd camp 2800m. Overall you'll see beautiful landscapes ranging from country-side, mountain to jungle. Highly recommended."
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "Salkantay Trek with Mountain Lodges of Peru. I just returned home after trekking for 8 days in the Vilcabamba range, up the Salkantay Pass, en route to visit Machu Picchu, with Mountain Lodges of Peru. First off the trek is a great way to see the Andes. Requires a reasonable fitness and the maximum elevation is 4600m at the pass. But the views are phenomenal, and the Humantay glacial lake was unreal.Mountain Lodges of Peru took care of everything, from my hotel bookings in Lima and Cusco, airport transfers and then of course, the trek itself with 4 wonderful lodges in strategic locations along the trek.It's hard to pay tribute with words, but the beauty of the region, and a different ecosystem we encounter everyday on the trek is a life-enriching experience. Our guides Joseph Rivas and Jimmy Murillo were experienced, English speaking and extremely knowledgeable of local geography, flora and fauna.And what was more important was the attention paid to safety and altitude sickness with the right medications and safety equipment brought along for the trek.Definitely something for the bucket list and I'm glad I did it. I would recommend this trek with Mountain Lodges of Peru to anyone!"
        }, 
        {
            "index": 16, 
            "rating": "5", 
            "review": "Just amazing! . This was an awesome experience, beautiful views along the trail, the lake is stunning!!! If you are courageous you can jump in, I didn't kkk during the nights was very very cold, so be sure you have enough warm socks and a very good sleeping bag! The way up to the Salkantay mountain is very hard 'coz of the altitude and the cold, we had snow while going up!!! But nice also ;) it's an amazing experience where you meet all kinds of people and be in contact with nature all the time, away from civilization"
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "Amazing experience. One of the most amazing trekkings i've ever done. You should be in a good shape and bring warm cloth, but it is totally worth every step! And amazing finish with Machu Picchu!"
        }, 
        {
            "index": 18, 
            "rating": "5", 
            "review": "Fascinating scenery. Incredible views along the Salkantay Trail. It's not hard to see why Nat Geo rates it a top 25 trek in the world, with so much variance. The Salkantay mountain itself is an important deity in Quechuan culture and walking up to the pass is an incredibly worthwhile challenge. The trek is long, but with a decent tour company for food and pace it's quite accessible. Ensure you acclimatise for a few days in Cusco beforehand, but if you're a nature-lover, do this and not the Inca trail"
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "Mountain Lodges of Peru. This review is for Mountain Lodges of Peru, the company we chose to do the Salkantay Trail.We did the 6 night trek and I am very, very happy with the company. We were 4, but our total group was 11 (I think they max out at 12). The Salkantay trail is gorgeous, demanding, spiritual, just awe inspiring. You can do the trail in 4 days and camp in tents or you can do it this way.I won't spoil the many special touches that make the trek with MLOP so special but I'll say that they have wonderful food, incredible small lodges in very, very special locations and a world class staff. Ruben and Gilbert were our guides and they were truly wonderful."
        }, 
        {
            "index": 20, 
            "rating": "5", 
            "review": "Amazing trip with Mama Coca. We went on this trip with Mama Coca Tours on Procuradores Street in Cusco, it was excellent throughout, on the first night they gave us an extra fleece liner for our sleeping bag, whilst others were freezing, we were quite cosy.The day from Soraypampa is the toughest, the walk to Salkantay Pass is hard work, you have the option to get a horse, which can be good as this the highest day of the trek at about 4650 meters. The rest of the walk to Hydroelectica over a couple of days takes you through amazing and differing landscapes, views and scenery. From Hydroelectica you walk to Machu picchu Pueblo (agua calientes) along the flat train tracks, this is an equally interesting walk.The day in Machu Picchu is fantastic, I highly recommend getting a ticket to Huayna Picchu - it is vertigo inducing but the views make it worth the effort (you need to book in advance). We really enjoyed this trip though in quiet season there were still quite a lot of groups on the tour. It also one of the cheaper options compared to taking the train."
        }, 
        {
            "index": 21, 
            "rating": "5", 
            "review": "Very happy with the trek and Lodges. I am writing to express my appreciation to Mountain Lodges of Peru for such a great trek. Your organization helped our group enjoy a wonderful vacation. Johan was an exceptionally gifted guide who astutely managed the various personalities within our travel group, set a pace that helped us finish the trek without any problems, and was always polite, humorous, and informative. The lodges were beautiful. We enjoyed the trip immensely."
        }, 
        {
            "index": 22, 
            "rating": "5", 
            "review": "Definitely do the Salkantay trek rather than the classic Inka Trail. We decided to do the Salkantay Trek rather than the Classic Inka Trail and I'm so glad we did. To start off, the trek is 5 days rather than 3 and you get to experience a different environment and climate each day, from the highlighands, to glaciers to Jungle and of course finishing at Machu Picchu."
        }, 
        {
            "index": 23, 
            "rating": "5", 
            "review": "Salkantay Trail Trek with Mountain Lodges of Peru. The experience is simply amazing. While the Trek is a serious one, not to be taken lightly, Mountain Lodges of Peru is the way to it. Each night you stay in a lodge with a real bed, hot shower and great (actually really great) food. The guides take care of everything for you allowing you to focus on the trek. Now this trek is not a stroll. It is rocky, steep, narrow (very narrow in places) and you cross \"bridges\" over deep steams that are made of twigs. The air is thin and you have to work really hard but the reaching the summit provides an incredible feeling of accomplishment.The Lodges are really well done and provide an experience far superior to tenting. Each day's ends around 4pm. You can relax with a wine, beer or soft drink. Dinners are simply excellent. You wake early the next morning ready for the day's effort.Day one and day two are day trips from the first lodge that allow you to acclimate and for the guide to judge the group. They set the pace accordingly, allowing for frequent breaks on the more arduous sections. Day three is the big day. For our group the day lasted 9 1/2 hours with three of the group using the 911 horses (they are there if you can't keep going). It is worth point out those same three people did not use Diamox or anything else to help them with the altitude. We did and had no issues.Day four is a shorter day, but downhill. With the steepness of the trail and a lot of rocks, in many ways I found it harder - especially on my knees. Day 5 is another long day, but it is the last one. It is hard because there is a train to catch and the guides keep a more rigourous pace so the train is not missed. And of course day 6 is Machu Picchu. Not much to say that you can't read somewhere.To sum up, I cannot give MLP a higher rating. The guides took amazing care of those with altitude sickness, provided deep insight into the trail and what we were seeing and took great care of us all. While this option may be more expensive, it is completely worth it."
        }, 
        {
            "index": 24, 
            "rating": "5", 
            "review": "MLP Lodges were great. Great lodge trek staying at MLP Lodges. People in our 12 person group booked via various agencies. Guide pace was good. Acclimitization rate was good. Come to Cusco a couple days early. Lots to do there"
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "Amazing views - good workout. We trekked the 3 day tour and can definitely recommend it as alternative to the Inca trail. You ascent as high as 4600m, therefore you should be reasonable fit and acclimatized, alternatively you can rent a horse that carries you up the first part. The rest is going down gradually. There are camp sites and villages then later on the way that offer drinks, and some even hot showers (for 20 soles) but a bit primitive ones....It is a bit full of tourists, so not exactly empty and completely calm, but it still has enough magic to make me look over that fact.Tipp:1) Take your own toilet paper, while there are toilets, there is no paper in them.2) take extra money to buy water and snacks3) There are many camp sites, some around villages later on that have even a hot shower4) bring change of clothes, it is VERY dusty especially later when you descent from Salkantay pass, and the horses and mules carrying equipment make the dust go really everywhere in your body, clothes, etc.5) nights are cold - bring warm clothes6) if you are unsure about high altitude or not fit - take a horse up the first part to the pass, otherwise its worth going slow and steady - no need to rush!7) start early in the mornings8) Bring some 1 soles coins, some bathrooms are paid (not all)"
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "Trek of a lifetime. Being that this trek is mainly overspill for the oversubscribed Inca Trail, I was not expecting the trail to be so diverse, quiet, and beautiful. The environment changes so rapidly with altitude. For my tour group at least, the Salkantay trek was very challenging, but this made it much more enjoyable."
        }, 
        {
            "index": 27, 
            "rating": "5", 
            "review": "Serious Trek - Do Your Homework. The Salkantay Trail is not difficult but its altitude and weather mean you need to go prepared for the worst. We were surprised at the number of people who walked this track without proper clothes or boots, or attempted it with a poor or non existent understanding of the potentially fatal consequences of altitude sickness - one case of one group who had a member threatening cerebral oedema yet neither they or their guide were aware of what was going on. We walked in the driest month but had snow (pass was blocked the day after we crossed) and driving, freezing rain. So many trekkers were wearing denim and had no cold weather gear and ran the risk of hypothermia. It is a spectacular trek but can get crowded very quickly across the pass. Despite the numbers we enjoyed the trail pre and post the Salkantay Pass and appreciated the mix of alpine and forest/jungle."
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "Amazing experience!. We did the 4 day hike including visiting machu picchu. It was a tought hike but got to the end after all. If you want you can take a horse at the hardest to the Salkantaypass. You walk trough so many different environments. The first day it was normal bush and highlands, second day you walk past snowy mountains in the morning and cloudforest in the afternoon. So surreal! The sleeping places were comfortable and the cook made us delicious dinner. We went with South America Trek Sac. They make the trips with small groups (we were only 3) but you meet a lot of people along the way as all groups take the same route."
        }, 
        {
            "index": 29, 
            "rating": "5", 
            "review": "Amazing nature. The trek, which ends by Machu Picchu, was simple amazing - by far the most beautiful trek of my life! The nature you will experience during this trek is simply breathtaking."
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Incredible hike!. My husband and I hiked the Salkantay Trail through Kaypi Peru Tours and the hike was simply incredible! The views are gorgeous and we got to stay with and meet locals as well as other travelers on the hike. This hike was tough, but definitely worth it if you are looking for a once in a lifetime adventure!"
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "Great trek, off the beaten path. This was a fantastic trek. We did a 4D/3N with Alpaca Expeditions. We saw maybe two other tour groups the entire time, except (obviously) in Macchu Picchu/Aguas Calientes."
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "Amazing trek with changing scenery along the way. We completed this trek with Enigma over 4 days and had a fantastic time. One thing we realised was that each tour company takes you on different treks. Some are longer than others, and post Salkantay they detour off and do different walks. Our walk hiked to Salkantay pass on the first day. It was a tough climb of about 900m due to the altitude we were at, starting at about 3700m. Post that slow and hard climb it was much more manageable. Our third day was another similar climb but at lower altitude so it wasn't as hard as day one. The walks through cloud forest were superb, and one of the key highlights on this trek was the restaurant on the other side of that mountain on the third day that looked out over Machu Picchu and the peak of Salkantay. We got a great visual of where we'd come from, and where we still had to go whilst enjoying a fabulous meal at this very remote restaurant."
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "Trek of a life tme with Llama Path!. We did the 5 day Salcantay trek with LLama Path. We couldn't have been in better hands. We also were glad we did not get to do the Inca Trail. This was so much better. It was 9 of us, my husband and I being the oldest respectively 50 and 45. We had 2 guides, 5 mules + one ambulance mule which thankfully nobody used and two helpers, 3 horseman and a chef! We loved every single minute of this trek. We walked for (about) 62 miles in 5 days. The highest elevation was 15.255ft and the coldest temp. was 18F. We saw an valance which was one of the coolest experiences ever, we walked through coffee plantations, we dipped in hot springs, we ate avocados and tropical fruits straight from the trees, we saw countless waterfalls, parrots, some monkeys, we made new friends and ultimately we saw one of the wonders of the world.I would have not want to see Macchu Picchu in any other way, thank you Roger and Javier from LLama path for giving us the experience of a life time!"
        }, 
        {
            "index": 34, 
            "rating": "5", 
            "review": "they took us almost to the mountainfoot. my family enjoyed some walkaround by this attraction and an easdy transport from/to made the difference... how nice to have a good excursion with so many details offered to us, its worth for the price and surely we will come again next year for another big attraction."
        }, 
        {
            "index": 35, 
            "rating": "5", 
            "review": "Mountain Lodges of Peru (MLP). I had waited over 40 years to make this trip and was rewarded with a life changing experience that far exceeded any expectations I had. The care and respect shown by the team from MLP was humbling the trek challenging the interaction with local communities and traditions wonderful."
        }, 
        {
            "index": 36, 
            "rating": "4", 
            "review": "Great hike and a bit longer than Inka trail. We just came back from this hike and would recommend it. The only possible downside, from a North American, is that people don't really respect the trails in that there is a sense that you just drop your trash, or at least the banana and other peels. I also saw water bottles and candy wrappers. It sort of takes away from an epic experience. The trail goes through everything from 15,000 feet to about 6,000. You go from high altitude to canopy jungles and cloud forests. We went with Alpace Expeditions and they did a fantastic job. Make sure your tour operator provides boiled water at least once a day or you'll be stopping to buy it."
        }, 
        {
            "index": 37, 
            "rating": "5", 
            "review": "Amazing beauty, truly breath taking. Your experience might depend on the tour company you hire, We had a beautiful time, truly amazing we had a great tour guide, very knowledgeable, This is a long hike and will recommend some experience hiking."
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "The Sacred Salkantay Mountain. I had signed up for a 4 day trek to Machu Picchu with OneSeed Expeditions from the USA. The company uses local guides and supports the local communities. I loved the trip. The Salkantay Trail was beautiful and quite a climb. There were 8 in our group. The first day of the trail was easy. We had spent two days in Cusco getting acclimated. On the first day of the trek we took a bus through the Sacred Valley to the trail head. We picked up our horsemen and potters, put on our day backs and began walking. The trail was well marked and our guides set a reasonable pace. It was a gradual uphill and after about an hour and a half we met up with our cooks who had prepared our lunch. We spent the rest of the afternoon hiking to the Salkantay Pampa were we spent the night. The guides helped us determine our hiking skills. And although we all seemed to be in good physical condition, two in the group were feeling the altitude and two saddle horses were ordered. The second day was he hardest. We went hiked up another 2000 feet to the Salkantay Pass. By this time I showing signs of altitude sickness. Thank goodness we had the pack horses as they sent one down the trail to pick me up. The top of the pass was beautiful We could see the glacier covered mountain and stopped to give the small sacrifice offering we had prepared the night before with loam fat, tea leaves, herbs and towers. It was a beautiful spot to meditate. There was no snow on the trail at eh pass but we had crossed some ice covered streams and we all put our down jackets on as we stopped at the pass. We stared our decent and walked about about two hours before stopping for lunch. Then we continued another 5-6 hours to our second camping area, just beyond the town of Colpampa in the rainforest. The decent was also beautiful. We traveled form the alpine terrain of the pass into a green forested are along the stream and riverbed. The real was well established with dirt, and rock outcroppings. The hardest part of the trail was the loos gravel that made it slippery. One member of the group slipped and twisted her ankle. Her boot gave her support, but she hurt her knee. This slowed her down. I was slowed by the altitude sickness and the loose gravel. However, we all made it to our campsite before dusk and enjoyed the beauty of the rainforest. Day three was more hiking. It was mostly down hill, but often we had to climb up small ridges to go down the other side. Our third night was a home stay at a coffee plantation. It was so nice to get a shower.Helpful hints: 1. This can be done with tour guides or on your own. I really liked that everything in in our package was arranged in advance and we did not have to worry about tents, water, food, bus piece ups etc. We saw at lest three other trekking companies on the trail. Our guides knew the other guides and although we passed by each other and walked together for short distances, we each had our own snack stops, lunch stops and camping spots. With the difference in the cost of living in Peru, I would recommend that you hire a tour guide and cook. 2. Be as physical prepared as you can, but recognize that the altitude and cold may affect you. 3. Enjoy the beauty . 4. There are ecolodges along the way so you can walk but may not need to camp. 5. Bathrooms with running water at the little town areas cost s/1-2 (soles). Botttle water on the trail is about s/ 6-8."
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "Not just a walk in the park. The steep climb and altitude are a small price to pay for the amazing views an the magic of Peru. Be prepared for the hike and spend at least two days in Cusco before they trip to prepare ft the altitude."
        }, 
        {
            "index": 40, 
            "rating": "5", 
            "review": "Amazing experience. Did the Salkantay Trek in April of 2015 (dropdown only goes back to July 2015). One of the most memorable experiences of my life. The sceneries are amazing and breathtaking. There are certain parts that are a tough hike, particularly the first 2 days and especially when going up the Salkantay Pass. Make sure to acclimate in Cusco for a few days, drink lots of mate (coca tea) and soroche pills (altitude sickness pills that you can buy in pharmacies in Cusco) or you will get altitude sickness. But the toughness of the hike is part of the experience.There is a hot springs when you get to Santa Theresa which feels great after you've been hiking for 3 to 4 day, also surrounded by beautiful mountain scenery all around. The experience is then topped off the last day when you arrive at Machu Picchu.Definitely worth it and recommended. If given a chance, would definitely do it again."
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "AMAZING!. This is probably one of the most memorable experience of my life. The sceneries are just breathtaking.You have to experience to undertsand it. Love every minute of it. Tough hike on certain parts but worth it. Would so recommend doing this to see Machu Picchu!"
        }, 
        {
            "index": 42, 
            "rating": "5", 
            "review": "Incredible, rewarding trek. We did the five-day Salkantay Trek with Quechuas Expeditions. This hike is unforgettable. The first two days are cold and involve high elevation and spectacular mountains. The third and fourth days are hot in the rainforest, with a visit through a coffee farm on day three and thermal springs in the evening, and an option to zipline part of the trek on day four. Day five is the spectacular culmination of the trek, when you arrive at Machu Picchu!"
        }, 
        {
            "index": 43, 
            "rating": "5", 
            "review": "Beautiful Trek trough the Andean Mountains. Beautiful experience.. Three day walk through valleys and mountains. You camp on the first and second night at well structured plants. The mountains around are awesome, majestic and daring. The first day you dont go very high. 3400m, but the trail is easy. The second day you go to 4600m, in a very steep trail up the mountain, You get to the Salkantay pass, right in front of the big mountain. It is really impressive. After the pass you go down to 2800m to a campsite near a small city. It is worth doing the treck. You will find people from all over the world walking by your side."
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "Most interesting way to Machu Picchu. If you are looking for a trek where you can see glacier lakes, climb over 15,000 ft over a mountain pass, and hike all the way down to the jungle to catch part of the inka trail this is the hike for you. Many have said it is better than the inca trail and I believe that after my experience. I booked with Mountain Lodges of Peru (7d/6n) since I have never backpacked and camped before so this option provided comfortable beds, hot showers, amazing three course meals, while still providing an unforgettable experience. The company booked every transport needed as well as hotel rooms before and after the trek. We had vegetarians and individuals with egg allergies and the company provided for them nicely. Our tour had horses available for those who could not make it over the pass due to the altitude. They arranged horseback riding and zip lining as separate excursions in the afternoon. We had a wonderful coffee demonstration where the lady roasted coffee beans for us that night for us to take home on our trek. The company also provided us a pachamanca experience complete with Guinea pig and taught us how to make Pisco Sours. We had 2 guides Raul and Gilbert so we had a professional on either end if someone ran into trouble. Our main guide Raul was so knowledgable about the constellations, the animals, the plant life, Machu Picchu, and the Andean culture. He was such a delight and you could tell he really enjoyed what he did."
        }, 
        {
            "index": 45, 
            "rating": "5", 
            "review": "The Hardest Thing I've Ever Done. The Salkantay Trail is the the most challenging thing I have ever done in my life. The feeling of accomplishment you feel when finally reaching the Salkantay Pass(16,495 ft) is profound. If you want an experience of a lifetime this will satisfy you."
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "Great hike less crowded than Inca trail. This is a good hike to do if you are trying to avoid the crowds on the Inca trail. it is a day longer and travels through some very scenic areas and real villages. it is 36 miles with the second day being the longest (12.5 miles) and toughest hike day over the Salkantay Pass. also unlike the the Inca trail, for now you are not required to have a licensed guide to hike it to Machu Picchu."
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "Maiden Adventure..worth the efforts!. We did 5D/4N Saklantay Trek with Alpaca Expeditions. I must say we never expected such a service...everything was great...the lead guide was very helpful..experienced and understanding. This sure once in a life time adventure which sure requires perfect fitness."
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "Amazing treck!. I made the Salkantay Trail as there were no places available at the Inca Trail and it was really good! I enjoyed a lot the way and we had amazing guides taking care of all our needs"
        }, 
        {
            "index": 49, 
            "rating": "5", 
            "review": "Horse riding with Mountain Lodges was brilliant. Mountain Lodges of Peru are a superbly run, community and eco conscious company. I chose to ride for 5 days, well cared for and fit quarterhorses, great equipment ( abetta endurance saddles) expert guides and challenging trails. The last 2 days I joined the other hikers to walk from Lucmabamba to the Hydro and a day at Machu Picchu, including scaling Waynapiccu.The lodges were excellent, Jacuzzis, comfortable beds with nice sheets, turn down service, lots of hot water. Good food, sometimes very good food. Car it and well trained guides, Leo and Oscar were super during our ride over the pass: Claudio and Wilbur great on the treks. The vistas are fantastic, the variety of flora ( orchids, bromeliads, lupines and more) unparalleled.If you are a reasonable rider I highly recommend this trip."
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "Incredible journey. My guided tour (4D/3N) was dynomite!! So much more than what I had expected. The sights were just awe inspiring. Not sure how many times I said the word \"wow\". April was perfect as it had not entered the rainy season yet. No Inca ruins on this trail but the views made up for it."
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "Awesome Trek on Salkantay Trail. My wife and I had an awesome Salkantay Trail trek with Mountain Lodges of Peru. The guides, Antonio and Henry, were smart and engaging and did a great job of leading the trek. The lodges were top notch and the food was delicious. I would heartily recommend Mountain Lodges of Peru to anyone interested in a first-class trek to Machu Picchu."
        }, 
        {
            "index": 52, 
            "rating": "1", 
            "review": "Never book with MUNDO INKAIKU!. We booked the Salkantay Trek with Ronald Maaskant from Mundo Inkaiku in Arequipa. He promised us a lot but didn't come through on most of them. This caused us a lot of trouble both before and after the trip. Therefore a warning, never book anything with them. If you have a problem or a difficult question they just hang up the phone."
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "Salkantay Trail with Mountain Lodges of Peru. This was the trip of a lifetime for us. The guides were amazing- very knowledgable about the flora and fauna, history, and so good at working with a variety of personalities. The lodges were just right- comfortable beds, good food. Nice without being over-the-top fancy, and with great service. The best way to describe the hike is that it was so wonderful that, when we got to Machu Picchu, it was just a couple more great days on top of a great week. Highly recommended."
        }, 
        {
            "index": 54, 
            "rating": "5", 
            "review": "Challenging and Beautiful Trek. We did the 5d/4n Salkantay Trek to Machu Picchu with SAM Travel Peru. The trek is challenging with the altitude going over the pass at over 15,000 ft. The views in the high mountains are stunning and the descent from the moonscape of Salkantay into the jungle through cloud forest is a crazy transition in just one day of walking. It's like being on two different planets in the same day.Our tour company took us to a campsite at Llactapata with a view of Machu Picchu across the valley. This was a great part of the trip and much better than some other itineraries that camp in the town below Llactapata with no view and more bugs.This is a once in a lifetime trek that I highly recommend."
        }, 
        {
            "index": 55, 
            "rating": "5", 
            "review": "we would like to return always. it has been so good the service offered at qorianka tours that my wife asked me for an extended tour next year...i would like to sign in with your agency, thanks qorianka."
        }, 
        {
            "index": 56, 
            "rating": "5", 
            "review": "thanks to qorianka i can get a good choice. there was an unsurpassing trip the one which qorianka tours opted for us, we were enjoying our vacation and contacted the best agency in cusco."
        }, 
        {
            "index": 57, 
            "rating": "5", 
            "review": "Heights and Sights I've never seen!. As I walked Salkantay, I thought to myself \"How did I get here? What was I thinking?\", but when I made it, I had never felt more prouder of myself. It is worth it all! If you wish to challenge yourself and are determined to do so no matter what, then do it! It's worth the trip up!"
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "a tremendous hike. thanks to qeros tours for having arranged this tour for my family, it was completely done by all and always had thir help and assistance with the kids."
        }, 
        {
            "index": 59, 
            "rating": "4", 
            "review": "Life changin. If you're a broke college kid looking to trek through Peru, DO THIS TRAIL. It's a great challenge and an amazing time. You definitely grow as a person, and keep your wallet full. IT'S FREE. That alone should be a no brainer."
        }, 
        {
            "index": 60, 
            "rating": "5", 
            "review": "it was the dream hike for my wife. and a good way to lose some weight for me, all the fixture was made thanks to our agency qorianka tours who treated us well like kings from start at arrival to finish at departure at the airport."
        }, 
        {
            "index": 61, 
            "rating": "5", 
            "review": "Beautiful trek, choose company carefully. My husband and I did the Salkantay Trek with a company called 'Salkantay Group' booked through Wayna Picchu in Cusco. On the day we booked, the customer service was phenomenal with Shanda answering every question we had and more. Unfortunately, it was downhill from there. Arranging to pick up our rented sleeping bags (and drop them off after the trek), and meet our guide for our briefing became quite a drama requiring several phone calls, and the person who collected us at 5:30am (half an hour late) on the first day of our trek had no information of our names or the fact that we were vegetarian, leading to some later confusion with our cooks. The trek itself is amazing and beautiful, with the majority of the best trekking done on the first two days. The last three days are nice but not so much off the beaten path. We were not expecting the hot springs to be as lovely as they were and that was definitely a highlight for us. The food was also fantastic every single day, and our accommodations nice. Unfortunately our guide Virigilio got quite drunk on a number of occasions and was unable to adequately plan for the following day in terms of what was happening, optional activities ect, coming to a head the night before our ascent to Machu Picchu when he had no tickets for us. The included tour of MP also seemed very half hearted and rushed. This is probably not the case with more expensive packages, so although we had a fantastic time on Salkantay, and a great group of fellow trekkers, I would advise that 'you get what you pay for'."
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "Sakintay trek. Go with Alpaca Expeditions. Absolutely spectacular. We did not see any other trekkers for 3 whole days. Breathtaking ( no pun intended)"
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "Soo beautiful!. The hike can be challenging if you are not used to long treks but the views makes it worth it. Do not miss Humanity Lake! Your guide would probably take you there during the first day and I can assure you it is one of the most beautiful places on earth! So peaceful and so beautiful!"
        }, 
        {
            "index": 64, 
            "rating": "5", 
            "review": "DIY Salkantay trek. Took this trail on my own without a group and a guide. If you have previous experience with such kind of trails and have at least one buddy with you to help if needed you can do it too. The agencies will most likely try to scare you with dangers you can meet along the way but the only real danger I have met was a big scary black bull saying right infront of me on the road the first day - we had to make a little detour to avoid it.Collectivo from Cusco 15 soles, camping either for free or up to 10 soles per tent and if you take your food with you you can do it for next to nothing. Dont forget to buy a water purification tablets because bottlet water may be realy expensive near the camp sites (Soraypampa camp 8 soles for 1 litre - 6x more than in city) while you can find plenty of water sources along the trail for free.The most rewarding experience comes the second day after climbing up to Abra Salkantay, the highest point of the trail and seeing the mountain from there. After this it wont be such a thrill any more but it is still nice trail which will lead you through beautiful valleys, mountain creeks and then across coffee fields.I was there on the beggining of March, in the wet season and on two days out of five was a little bit rainy but otherwise great weather and except from two groups nobody else on the trail, which was great. I heard that in the main season there can be 15-20 organised groups a day so I was really glad I came there when I came.I would suggest you to take a car from Mollepata heading up at least half way on the first day as otherwise you will be facing 3-4 hours of relatively boring walk along a road. You can invest this time better and maybe hike to the lake in Soraypampa - I did not get a chance to see it but it looks really nice from the pictures of others."
        }, 
        {
            "index": 65, 
            "rating": "5", 
            "review": "Amazing Experience. Completed the Trek with my daughter, what an experience to share for the rest of our lives. Very challenging and fulfilling. Each day had a different view, task, challenge which we loved and as for the scenery and people, I can not put into enough words, mountains, wildlife, glaciers, hot springs, zipline, villages, people. We were well looked after by our guide and our cook was unbelievable, our meals were amazing never thought we would eat that well. Make sure you take enough money for extras and tipping which we did but it was still not enough. We paid upfront for our entries but once we arrived at certain places they wanted more, which we disputed so be aware. There are plenty of stops along the trek to buy water, snacks and in some places alcohol. Toilets are available, in some rest areas you will need to pay a small fee. Enjoy and make the most of it, wonderful trek"
        }, 
        {
            "index": 66, 
            "rating": "5", 
            "review": "Stunning!. The incredible contact with nature, the andes and legends of the Incas is a little resume of the experience you will have in here, so Beautiful!"
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "Amazing variety of scenery. We did the Salkantay Trek mostly because we made our plans after all the available spots for our dates were filled for the Inca Trail. However, I am so glad we did Salkantay! Because the altitude changes so much, you hike through so many different ecosystems from snowy peaks to cloud forest to coffee farms. We went with Llama Path, who I would also recommend for great guides and incredible food.You do want to be in good shape to do this hike and make sure you've spent several days to acclimate to the altitude before starting out. There is a lot of hard uphill hiking, but there is also a lot of downhill that can take a toll on your knees. Be sure to bring hiking poles!"
        }, 
        {
            "index": 68, 
            "rating": "5", 
            "review": "Wow. This was very special. The trek was long tiring and amazing. The higher we got we could hear the glaciers cracking. They were a beautiful color. Our guide was wonderful. He played condor passé on his pipe as I struggled up and up. Vest time ever."
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "Wonderful Salkantay Trek to Machupicchu January 20-25, 2016. The experience was absolutely fantastic! Amazing scenery, We saw a colourful lagune the first day. the best guide, excellent cook could not have asked for anything more. I even got a high altitude birthday cake! One of the best trekking services I've had so far. One piece of advice, avoid rainy season if possible. Heavy rain was a little bit annoying for one time. We really recommend Machupicchu Exploring if you are planning to come to Peru."
        }, 
        {
            "index": 70, 
            "rating": "5", 
            "review": "Amazing hike. One of the best hikes that I've ever done. I booked a tour for a 5-day trek. The tour included all the necessary things such as food, tent, sleeping bag and the entry fees to Machu Picchu. The food was surprisingly good. The scenery is truly amazing. You start at a high altitude to climb up through the mountains to see Salcantay and end up in the jungle at Machu Picchu. It will be cold the first day or two but once you get down to the jungle you will feel the change of climate. Bring sunscreen and mosquito repellent, you won't regret it."
        }, 
        {
            "index": 71, 
            "rating": "5", 
            "review": "Mountain Lodges of Peru Salkantay Trek. This was the fourth challenging trek that I have completed in Peru, and one that I would recommend without reservation, especially as a preferable alternative to the conventional Inca Trail. The Salkantay Trek is far less crowded, and has more spectacular scenery, beginning as it does amid the glaciers and snowy peaks of Salkantay and ending with hummingbirds, orchids and a unique view of Machu Picchu. It is quite achievable by anyone who is reasonably fit. There is a challenging but amazingly beautiful climb of 800 m one day to the Salkantay Pass, and an easier climb on the last day, but the rest is a very pleasant amble downhill.Having camped on my previous treks, I decided to spoil myself this time by staying in the Mountain Lodges of Peru. I am very glad that I did so, and would recommend the lodges to anyone for whom the extra expense is feasible. The trek was perfectly planned, with two very easy days of acclimatisation before the ascent of the Pass, the arrangements ensured complete comfort and safety, and my guide Antonio was excellent. After a strenuous day's walking, there is nothing quite like coming to a lodge with delicious food, a comfortable bed, a hot shower, and (at most of the lodges) a Jacuzzi where one could luxuriate outside in the hot water, gazing at the snow-capped mountains with a drink in one's hand."
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "MTS 10 Day Salkantay Lodge to Lodge trek. I was fortunate enough to be invited on a Mountain Travel Sobek 10 Day Salkantay Lodge to Lodge trek in mid September. All flights and accommodations in Peru were booked by the agency. Everything was top notch: Hotels, Lodges, guides, and food. While the hikes were strenuous and the bugs plentiful, relaxing in a hot tub while sipping a Cusquena, underneath the watchful gaze of the mighty Salkantay, was a memorable experience."
        }, 
        {
            "index": 73, 
            "rating": "4", 
            "review": "Not what it used to be but still worth it. very VERY busy now at times.great views and can EASILY be done WITHOUT using a tour company!!!! there is NO permit necessary and there are plenty of camp sites, shops and fresh water available on route. there is even a company that charges you 80$ (instead of 300/500$) and uses the local communitys houses to put you in. gives you a map of the route each day and also a packed lunch. all food is provided and you have somewhere to sleep... what more could you ask for?!?!stunning views and well worth it. cut across to llaqtapata instead of going via santa terresa for a final day that not many people do. unique view of machu picchu and some ruins that most people never visit."
        }, 
        {
            "index": 74, 
            "rating": "5", 
            "review": "Great Views. If you take this tour you will see some great places, It can be an all day thing, try and go to each spot for at least 1-2 hours, some of the tours rush you around to fast at each site."
        }, 
        {
            "index": 75, 
            "rating": "5", 
            "review": "Awesome Outdoor Adventure. We went on the 4-day, 3-night hike. We were a small group of four with a great guide. The scenery is breathtaking and so varied. On Day 2, we descended 6,000 ft. in elevation from glaciers and mountain passes to dense jungle. On Day 3 it was Incan ruins, flowers, and fruit trees. Our first view of Machu Picchu from across the valley was stunning."
        }, 
        {
            "index": 76, 
            "rating": "1", 
            "review": "Very disappointing. The first two days of hiking were great. A bit hard but certainly doable. The third day is a (bit boring) short walk ending up with taking a bus to Santa Teresa, where, after dinner, a campfire was lit, loud music was turned on and lots of alcohol was consumed by most of the group. Not really something you would expect on a hike through nature and we definitely didn't appreciate it (and all the drunk people) The fourth day you get the option to go ziplining, walk three hours to hydroelectric (on the same road as the cars) or take a 'bus' for 10 soles to go to hydroelectric and start walking from there to aquas calientes alongside the railroad. We opted to take the bus, because we didn't feel like walking alongside the normal road. We ended up taking the same transport as the rest who went ziplining, waiting there till they were finished and going to hydroelectric all together. All in all we were disappointed by the amount of other groups on the same trail, the cultivated 'campsites', the powerlines and roads through the otherwise beautiful nature and the last two days of walking. If you enjoy real hiking through nature, I would recommend spending the money on some good treks in huaraz, and just taking the bus straight to hydroelectric and walk to aquas calientes from there."
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "Amazing views!. Best trek ever! My favourite view was the laguna in the afternoon of the first day, definitely worth the effort!"
        }, 
        {
            "index": 78, 
            "rating": "4", 
            "review": "Not as easy as I like. Much more difficult than the Inca trail (as I've been told) and much cheaper! The Salkantay is worth a visit and is one of the best ways to get to Machu Picchu! The trek was much more difficult than expected. On day 2 we had terrible weather and snow at the higgest pick of the trek. You could only see 5 meters away. On day 2 you walk 7.5 Km uphill and another 15 Km downhill. If you survive this, the rest of the trek is very nice and enjoyable :) Best of luck and be carefull when going down! specially on day 2, as there are a lot of rocks. I think is 67Km total."
        }, 
        {
            "index": 79, 
            "rating": "5", 
            "review": "Not for the faint of heart.... This trek is outstanding. The vistas are incredible, and the trail isn't over-trafficked. You do have to contend with horses moving up and down the trails, even at high altitudes, so be prepared for this. Altitude is a serious concern and adversely affected several folks in our group. The ascent is tough, but doable, the biggest issue being the altitude. Altitude medication (prescribed by your doctor) may be a consideration, as it helped many of the folks on our group. The descent is challenging - many mid-sized rocks make the trail a challenge for anyone with knee / hip / ankle issues. Highly recommend bringing trekking poles."
        }, 
        {
            "index": 80, 
            "rating": "4", 
            "review": "Mighty Salkantay!. It was an awesome difficult trek, but so worth every minute! I was not as prepared as I should have been yet I did it all the way!"
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "Awesome . It is a very hard treck but totally worth, beautiful views every day! We got some snowing in the way what was very lucky! Don't bring much stuff just sport clotles all water prof and warm jackets!"
        }, 
        {
            "index": 82, 
            "rating": "5", 
            "review": "One of the best treks I have done!. Really enjoyed this trek, I am pretty fit and found it ok though some who might not be so fit may struggle as it is a lot of walking.\nThe stars were incredible at night, so was the scenery. We stopped for lunch by the river on the second day with ice capped mountains as the backdrop. Unforgettable!"
        }, 
        {
            "index": 83, 
            "rating": "5", 
            "review": "An amazing trek with a cherry on top - Machu Pichu. Salkantay is a one in a lifetime experience, the 74 km for the 5 day treks are hard, but the view, totally worth it. The scenario changes from mountainous and arid to a snow peaks then amazonic jungle as far as the eye can see. There are a lot of prices and guided tours, best book locally as you can haggle, but pay attention! The main differences are the train ticket (Which class), hotel/hostel in Aguas Calientes and what kind of food and shelter you will have during the camping. Our price was 239USD on August, was with fine services and good meals. Bring your sleeping bag, and a light pack with snacks, water and a few warm clothes for the first 2 days. A must-go. For experienced backpackers and hikers, it's still possible to do it without guides, there are a few camping spots along the way, but its easy to get lost on molepata on the 1st day. 2nd day also demands attention on the path, there is some bifurcations, bring a map!"
        }, 
        {
            "index": 84, 
            "rating": "5", 
            "review": "Hiker's paradise!!!. Salkantay is one of the most spectacular trails of the world thanks to the amazing views of the snowcapped peaks and different ecosystems that You see while hiking."
        }, 
        {
            "index": 85, 
            "rating": "5", 
            "review": "Mountain Lodges of Peru - Salcantay Trek. Let me start by saying the MLP trek was THE BEST travel experience of my life! MLP gets an unqualified enthusiastic FIVE STARS. I’d do it again tomorrow in a flash!We were fortunate the other folks on the trek (twelve of us in total) were some of the nicest easiest to get along with people I have ever encountered.All comments are in the spirit of “revealing the experience” to folks who are considering it, and to aid MLP in improving their customer experience.THE TREK – 4 starsWell-trained runners, bikers, or hikers will have no difficulty with the grade of the trails or the altitude on the hike – in fact, we struggled with the glacial pace of the trek and discovered the best option was to “yo-yo” off the back… lag behind and then hike at a reasonable pace and catch up to the group. Note the only qualification for participation is the ability to “write the large cheque” – some folks needed to be ferried over the passes on the “mule of shame.” Segregating into “A” and “B” groups would improve things.That said, the extreme downhill section into Aguas Calientes is brutal on anyone’s knees. Sleeping at 11-12,000 feet is difficult at times for anyone.OUR TREK GUIDE – 4 starsEnrique (Keke) was a strong leader, very accessible, and generally knowledgeable (but not a PhD naturalist or historian). An area needing improvement is to provide more instruction on hiking and outdoor etiquette. Some women on our trek left their toilet paper behind after they ‘pee’ed’ (unconscionable). Several trekkers apparently had no previous hiking experience, leaving only 3-4 feet between hikers on the trail – aesthetically unappealing (what did they see but the backside of the person in front of them??) and extremely dangerous to others on the steep muddy downhill sections. Nor was enough instruction about hydration given for the uninitiated (e.g. drink every 20 minutes, pee a lot, and if you feel thirsty you’re already dehydrated).THE LODGES – 5 starsAmazing design & architecture. Large rooms, comfortable beds, attentive staff. THE FOOD – 4 starsSome meals better than others, but excellent considering all food must all be carried by mule.MACHU PICCHU – 1 star -- Sadly the biggest disappointment… MLP really gets the Machu Picchu (MP) visit wrong & needs to re-think this critical piece. Do you: …really want to trek 6/7 days to MP, then have only ½ day to rush thru the site? …really want to arrive at a 5 star $600/nite hotel at 4pm, exhausted, then get up the next day at 4am, check out and queue for the bus to MP? …do you want to do all of the above exhausted from the trek?Fortunately we chose to stay an extra day.How it CURRENTLY WORKS:- Day 6 - Arrive Aguas Calientes 4pm- Day 7 – Up at 4am, queue for MP bus; 7am arrive MP, depart MP 1:30pm for trip back to CuscoHow it SHOULD BE: extend the trip by 1 1/2 day- Day 6 - Arrive Aguas Calientes 4pm- Day 7. Rest, recover, and relax at 5 star InkaTerra Hotel - Day 8: Explore MP all day [it’s best after 1pm because: a) 1,000’s leave w/only a few hundred visitors remaining; 2) the light is much better in the pm];- Day 8.5 Depart for Cusco in the early am.Note: The Tierra Viva is actually a better hotel choice w/bigger nicer rooms & beds than Inka Terra for $115 / nite (I guess the extra $500/nite is for Inka Terra’s manicured grounds, tiny hot tub, and comically incompetent restaurant wait staff).SECURITYAs much as the MLP experience feels like “family,” securing your valuables is a must. One couple had $2-300 stolen from their room at the Salcantay lodge.EQUIPMENT YOU’LL WANTHiking boots are a must! I backpack the Sierra Nevada in runners, but with the rocky muddy trail, runners would have been a disaster.Poles: I have never used them, and was more than skeptical. MPL provides wooden poles on day one – w/out 2 borrowed poles the steep downhill sections would have been difficult and dangerous. Use poles!Our August trip in the “dry season” included a 5 hour slog over Salcantay Pass in a blizzard, 12” of accumulated snow, with rain several times throughout. Bring appropriate gear; investing $1.00 in a plastic poncho is priceless.All comments in the spirit of improving the experience. This was a 5 Star trip of a lifetime!© Mark McLoughlin 31-Aug-2015"
        }, 
        {
            "index": 86, 
            "rating": "5", 
            "review": "Simply the best trail to Machu Picchu. booked this trail from a hostel in Cusco, it was the cheapest one, 5 days long and totally awesome. The guide was great, other people were great (other backpackers) and the scenery was something to behold. From speaking to friends that had done the Inca trail a few days prior, the Salkantay trail seems to be the better option. Although you stay at a hotel the night you arrive at the bottom of Machu Picchu, you get up early and get to the front of the gate, our group were literately the first ones through. Guys on the Inca trail wont get there for another hour or so, by that time the place is swamping with people. although I did't mind the crowds (got to expect it nowadays), getting to see the place for a few minutes without anyone else around was really special. Oh, and take a hat, its not warm"
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "Best alternative trek to Machupicchu. If you couldn`t book the inca trail to machupicchu the best option is by salkantay during the trek you can enjoy amazing places like turqouise lakes, beautiful snow mountains, jungle of cusco, the last day after the 4 days hiking we get machupicchu w as very good trek"
        }, 
        {
            "index": 88, 
            "rating": "5", 
            "review": "Lodge to lodge trek way to go!. We took a 7 day tour and it was beyond amazing. It was pretty tough, but worth the effort. Staff, lodging, food, views - everything was amazing!!! Highly recommend"
        }, 
        {
            "index": 89, 
            "rating": "5", 
            "review": "Incredible views and awesome trek. Great views from all around Salkantay from day 1 where you hit the mountains where it can get freezing cold (like snow and ice cold) to the tropical humid rainforest where you get lots of mosquitoes and lots of flora and fauna.Amazing place with incredible views. Have to train for the hike and ensure have enough time to get acclimatized in cusco before setting off as it would be tough on the lungs."
        }, 
        {
            "index": 90, 
            "rating": "5", 
            "review": "5D/4N Salkantay trek to Machu Picchu. Scenery on the Salkantay trek was breathtaking, every part of it, be it top of the mountain, plateau or cloud forest, was unique and there was an unexpected diversity all throughout the trek. We met very few tourists during our hike, we walked sometimes for many many hours before seeing other groups, and the best of all: no wifi! Time had another meaning there, at times we were forgetting the date or day of the week.It was amazing to see the remote communities living a simple but hard life in the middle of nowhere, and even more amazing to see kids playing with home-made toys and looking sooo happy!"
        }, 
        {
            "index": 91, 
            "rating": "5", 
            "review": "A must go once in a lifetime. Very tough walk, but with an amazing view. An unforgetable experience. But be prepared to walk a lot with low air in the lungs."
        }, 
        {
            "index": 92, 
            "rating": "5", 
            "review": "Awesome. Awesome trek! The views are incredible and you get to know different kinds of atmospheres and climates."
        }, 
        {
            "index": 93, 
            "rating": "3", 
            "review": "Pay attention to the detail. Salkantay trek itself was beautiful. The hike to machu pichu was just as good as the destination itself. My fiance and I did the 5d/4n trek with Salkantay Trek company. I recommend asking a lot of questions. There is a wide range of prices between companies and a lot of hidden extras. The company we went with was one of the more expensive ones but there was still a lot of hidden costs in there. They also expected a tip even though on their website it said they didn't expect tips and even though it was one of the most expensive. When people only tipped a bit they completely changed how they behaved. They stopped being nice, they didn't give anywhere near as much information. Then for the ziplining, which costs $20, the guide said it was $30, blatantly lying so he could pocket $10 from every person. We knew this fact and I called him out on it and he then reduced his work ethic even more. Really pathetic work ethic! Don't go with Salkantay Trek Company! Definitely do the salkantay trek though, just with a cheaper, better option."
        }, 
        {
            "index": 94, 
            "rating": "5", 
            "review": "Trip of a lifetime. Made the trek to Machu Piccu with National Geogrpahic Adventures. We stayed in beautiful isolated mountain lodges each night. A chef and sous chef hiked with us each day and prepared our meals along the trail and at the lodges - often three courses at both lunch and dinner. Unbelievably, meals were truly gourmet and creatively plated. The hiking is strenuous and you must be in very good shape to enjoy it. Scenery along the trail is beautiful beyond what words or pictures can convey. Unlike the crowded Inka Trail, this route is only lightly used. We saw almost no other hikers the whole time, but we did get to meet local Andean mountain people. Hats off to National Geographic Adventures for putting together the perfect trip."
        }, 
        {
            "index": 95, 
            "rating": "5", 
            "review": "Unique experience.. Exhaustive but totally worth it, amazing trek thru different landscapes, from Salkantay pass on 4600m high to the jungles."
        }, 
        {
            "index": 96, 
            "rating": "5", 
            "review": "Beautiful trek. My friends and I did the 5-day trek to Machu Picchu via the Salkantay with Colibri ecotours. It was the best, and most physically challenging, hike I have ever done. Day 2's ascension was crazy hard, but so so so worth it. The views were spectacular. We were fortunate to have great weather (clear & sunny, but very cold). I would recommend this trek to anyone traveling to Machu Picchu."
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "Trekking to Machu Picchu. Even though you can go to Machu Picchu by train and bus (actually quite expensive), I decided to do the 5-day trekking and don't regret it! The landscape is amazing, our guides were super sympathic and when finally arrived at Machu Picchu you can be really proud of yourself! :) The trek is quite challenging as the distances each day are big and on the second day you go up to 4630 m above sea level. I very much liked the camping atmosphere, too. Just be aware of the low temperatures at the campsite in the first night - I got a heavy cold afterwards! "
        }, 
        {
            "index": 98, 
            "rating": "5", 
            "review": "Breathtaking. We hiked three days of the Salkantay trail before joining the Classic Inka trail on the fourth day. The Salkantay trail is amazingly beautiful. At the highest point we were 5,100metres and seemed close enough to reach out and touch the layers of snow hanging from the Salkantay Mountain. Having camped at the base of the mountain on our first night it was particularly cold; the 5am start didn't help with cold conditions however, once you're on the move and start ascending it doesn't take terribly long to start to feel your toes again. The terrain changed with the altitude, firstly in the valley it was green underfoot and some smaller trees and shrubbery; as you climb the mounting it becomes almost completely shale and rather unstable. View the green lake from 5,100m is a vision to behold.Going down the other side was no easy challenge and using both poles still needed a great deal of attention.Camping the following night our guide said \"put on everything you have - it's going to be a colder night\", and he was correct. It was extremely cold and with four layers on every part of our bodies including wearing our puff jackets underneath our thermal sleeping bag liner and our four seasons sleeping bag we did manage to have a relatively good sleep - until the donkey started up at 5am. Nature!Day three was hiking in the Valley to the Inka Trail control and this was a great insight into life in the countryside. We seemed to come across every farm animal and more on this day. Llamas, alpacas, pigs, donkeys, horses, dogs, condors and all manner or locals going about their daily lives; walking to the nearest town, harvesting potatoes and just moving their livestock.And the best part was that we were the only people walking the trail - no groups, no noise - it was amazingly being the only ones out in this wonderful countryside."
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "Takes your Breath Away. A trek of a lifetime. Salkantay is one of Peru's most valued Abu's. A beautiful site for all to see."
        }, 
        {
            "index": 100, 
            "rating": "5", 
            "review": "awesome!. really liked all of the trails. first getting higher and higher until over the clouds was amasing. really nice to have horses carrying our luggage over to the next campsites. and knowing that there was a possibility to sprain your ancle and not have to walk-take the horse instead. not so many people, but more than i thought. traveled in a group of two wich was really nice since we could set the pace ourselves. it's a walk through a genuine peru. passing living areas of the locals.the salcantay pass was supernice! glaciers and snowy tops of the mountains. the first night before the pass was supercold, didn't sleep very well at all..slept in big jacket, rainpants, wool socks, a hat, gloves and a sleepingbag. inside a tent that was inside of a wind cover. water was available to buy all the time. no need for waterpurifying tablets at all. sunscreen well needed. two last days was alot of going down action. you have to have really good shoes. amasing trekk! really recomend it. even the part where you walk beside the railway tracs."
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "Must be in shape for this trip. If you are going to do this hike, prepare well. Travel very light (if you are going with one of the first class camping ventures like Alpaca Expedition where they carry most of the other stuff for you. Just take what you need for the day as you'll get your stuff at night. You are truly taken back in time, meeting with horsemen and riding on donkeys and meeting the mountain people who live up there in a little hut. I just don't know how they survive. Please see my review of Alpaca Adventures for more pics and details."
        }, 
        {
            "index": 102, 
            "rating": "5", 
            "review": "walk the Salkantay to Machu Picchu. (recommending the Salkantay walk in general, no specific vendor). amazing views, fewer crowds, and more challenge (altitude & distance)."
        }, 
        {
            "index": 103, 
            "rating": "5", 
            "review": "Do this trek!. Much more spectacular views, and much less crowded than the Inka trail. The ecology ranged from rocky valleys (with the most incredible starry skies at night), to following rivers, passing waterfalls, and trekking through the mouth of the jungle. The altitude on the first two days made every uphill feel like a mile-long sprint, but the scenery made it absolutely worth it. I would also recommend booking this with the Xtreme Tourbulencia company I used -- they couldn't have done a better job!"
        }, 
        {
            "index": 104, 
            "rating": "5", 
            "review": "A Fantastic Trek. Our group of 10 hiked the Salkantay Trail and were thrilled. We saw very few people along the way which was nice and we got to view all kinds of brilliant scenery. You go through all kinds of extremes - we started in shorts and t-shirts and slowly added layers till we were all bundled up as we approached the glacier. It is a challenging hike as you are going up and it is at altitude. So be prepared! After we peaked around 15,000 feet, we slowly descended and took off our layers. But again, the scenery was beautiful. We visited glaciers around the world but this one was one of the prettier ones."
        }, 
        {
            "index": 105, 
            "rating": "5", 
            "review": "Great Hike Better than Ina Trail. My husband an did the Inca trail 5 years ago and it was good, but the salkantay is much better in my opinion. Less people, better views, and everchanging Landscape.Its a lot more challenging than the Inca trail, so you shoudl be a good hiker. I read it was voted in best 10 treks in the worl by national geographic and i can agree, not that i have done all but this was in my top 3 treks. We did the trek wiht Uncover Latin America and had a great time everything was planned perfectly."
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "SPECTACULAR. Before committing to this trek, we read tons of reviews, looked up recommendations, and tried to be as prepared as possible. There are simply no words that can possibly adequately describe how magnificent this was. It must be experienced. If you are at all pre -disposed to think you might enjoy this, there is only one word - GO! Some surprises: 1). It is hard. Very hard. No matter how hard you might think it is, it's harder. Our group ranged in age from 28 to 65, and we all did it! But it was hard. Yet at the end of each day, we were all thrilled, excited, motivated, happy, tired, and sure we couldn't do it again the next day. But somehow miraculously we felt great by morning and couldn't wait to get started again. 2) Our strength training really paid off! My advice: train, train, train. Be sure you can do squats (wilderness bathroom visits), have endurance, and exercise your arms! Poles are an absolute necessity from day one (three of our group thought they didn't need poles and were begging by day two) and your arms will get a big workout. 3) Layering clothes really works. Short sleeved shirt, long-sleeved shirt, jacket. We were peeling and adding at various times throughout most days, and I was grateful for the layers. 4) I thought I could use a cheap backpack. Do NOT make this mistake. Even though the animals carry your large bags, you still need a day pack with water (LOVED the camelbacks!), rain gear, snacks (they provide, you carry), clothing layers, sunscreen, bug spray, etc. Take a backpack that straps above the chest and at the waist. You'll be glad for the support. 5). MONEY: during the trek there really isn't any place to spend much money, but before and after there are lots of opportunities to help the local people by purchasing their goods. And you will want to, I promise. They give the best prices if you pay cash. We had to go to the ATM's a couple of times - once before starting the trek and once after. Get more Peruvian money than you think. You will encounter lovely mountain people who don't want handouts - just the opportunity to earn an honest living. And they don't take VISA. We have been on quite a few high adventure trips, and this was by far the most profound, incredible, amazing experience of all. If you are reading this and even thinking about it, do it. But be prepared, because it is worth every single minute we spent training and getting ready."
        }, 
        {
            "index": 107, 
            "rating": "5", 
            "review": "Great alternative to the crowded Inca Trail. I really enjoyed hiking Salkantay. You get higher than the Inca trail and get some views of snow capped peaks including Salkantay. 5 days walking this trail and I did not see other tourists until we did the section near Aguas Calientes. If you want to stay away from the crowds then this is the hike for you to Machu Picchu."
        }, 
        {
            "index": 108, 
            "rating": "3", 
            "review": "Not what expected. i was under the impression that we would be hiking the entire time surrounded by beautiful nature. Wrong. We were walking on the road next to cars and on the train tracks most of the time. Disappointed."
        }, 
        {
            "index": 109, 
            "rating": "4", 
            "review": "Stunning views. We walked the Salkantay trail solo and we really enjoyed it.The pass is really easy to follow and well formed. The first two days are really challenging, especially the climb to the the pass at 4600m. We took a collectivo from Cusco to Mollepata and start walking from there. Their is a specific walking pass so you don't need to follow anymore the road up to Soraypampa. Just follow the blue sign with the hikers on it :)As we started to walk by mid-day, we were after all the tourist group so apart from locals hording their mules, we didn't see any other peoples.It is really easy to find places to camp for the first 2 nights (up to a bit after Huaracmachay) but after, the vegetation become very dense and you are not allowed of free camping after La Playa. Their is one campground at La Playa. Once you arrived at Hydro Electrica, it is another 12km along the rail to join Aguas Calientes. It took us 3 days and a half to walk the track but the third day was really long (34km). If you have time, take an extra day.Absolutely beautiful walk - definitely worth it"
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "Best hike I have done!. I love my hiking and was advised that this was a better hike than the Inca trail, not just because it was harder and higher, but because less people trekked it. I thoroughly enjoyed the whole hike; from our knowledgeable and fun guide, JP, to the other keen walkers in my group (Go Team Condors!!) to the MOST INCREDIBLE scenery through deep valleys, lagoons, glaciers, jungles and finishing off at the amazing Machu Picchu.The first night of camping was the most authentic but the rest of the camp sites were fine. The food by our Chef, Edgar, was some of the best I have eaten! And I am gluten free! Our tents and main bags were carried by horses as well as the Chef equipment so we could happily hike away with our daypacks. I bought my trek whilst is Cusco and the whole experience was an absolute bargain for what I got. Enjoy folks!"
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "Trek of a Lifetime!. OK, here's the low down on trekking the Sankantay Trail and trekking in Peru in general. First, it's an absolute must. I went with my mid-20's sons and it was the trip of a liftime. The bonding experience is beyond belief. Second, I cannot recommend this trek enough. I am so happy we chose this uncrowded trek vs. the Inca Trail (500 people per day). I have not done the Inca Trail but I wouldn't change our decision no matter what. We did the 5 day Sankantay Trek with Terra Quechua. They did a great job and their guide Abel was amazing. Third, it ain't easy. Although I'm a very in-shape 59 year old, I started doubting myself after the first couple of hours on day one. However, if you hang in there, breathe and put one foot in front of another (for 6-9 hours per day) you will experiene Peru like no other. From rain forest to grasslands to glaciers (at 15,000 ft.) down into rain forest and thick jungle, the trek is incredible. You will see other people but no more than 20 at the saddle under the shadow of Sankantay Mtn. Otherwise, you are basically alone. Wear really good well fitting hiking boots (not trail runners) and pack as light as you can. Bring mosquito spray (for the last day when you're in the jungle) and be ready for the trip of a lifetime. Arriving in Aquas Calientes (the town below Machu Picchu) is an amazing experience - do not miss it."
        }, 
        {
            "index": 112, 
            "rating": "4", 
            "review": "4 day 5 night Salkantay trail. First things first - full disclosure, my wife and I had never really hiked before in our lives -total amateurs. So take everything here with knowing that. Couple of things I want to point out.1. It's awesome. So much fun and rewarding to finish the trek. While we were hiking and walking it seemed like it was taking forever (we walked over 80km) but now that it's finished it seems like it went by fast - go figure. But again, the feeling of accomplishment is wonderful and worth it almost by itself.2. If you are a fast walker, like we were, it doesn't really matter - it's likely that you will finish at the campsite that night with the entire group - which means that there are various points along the walk where you sit and wait for everyone. Some of these spots are nice and have facilities with drinks, food and bathrooms - so of these are just on the side of the trail.3. The trail itself is pretty worn down. There isn't a lot of ..I am not really even sure how to say it - but, I guess land that hasn't been walked on. This is not to say that it's an easy hike, but you definitely don't feel like you're doing something that no one else has done. The beaten path and the crowded trails are constant reminder that this is tourism at it's best.4. It's much more tiring than I anticipated. And I should have known - the trail is rated as \"difficult\" on just about every website. I was completely wiped out when we got back to Cusco on night #5. Over 80km (40ish miles) of hiking. Leaving our campsite early, hiking for 8-10 hours, and the repeating took a toll on my body. Make sure that you are prepared and in shape. Practice hiking if you can. We had 13 people in our group. 4 had to take a van on day #4 (1 due to injury, 3 due to exhaustion). One day 3 we had 2 people take horses. The trail got us!5. Machu Picchu is rushed. It's a bit sad in some ways, we spent 4 days hiking our tails off and the holy grail felt rushed. This could have been exclusive to our tour operator - but I don't think it was. We arrived to MP early to see the sunrise (it was very foggy - and my understanding is that 70% of the time it's that way...seeing the sunrise is a bit of a myth). We had a several hour tour from our guide and at around 10am we were set free. BUT we had purchased the access to Machupiccu Mountain and had to catch the 2:55pm train (be at station around 2:30pm) which meant meet at the lunch spot in Cusco at 1:30pm which meant catch the 1pm bus from MP to Cusco which meant that the recommended 3hr roundtrip hike on Machupiccu mountain was all that we had left after the guided tour. The park doesn't close until (I think) 6pm. That means if you wanted you could stay one more night in Aguas Calientas and then not leave the park until closing. The crowds are much smaller in the afternoon. I kind of wish we would have stayed one more night and had the opportunity to walk around MP for longer. The place is so dang cool.6. There is a ton of horse pooh on the trail the first two days. You either walk in it...or spend the entire time trying to avoid it. I was warned about the amount of pooh and was still surprised by how much there was. 7. Bring walking sticks!! If you are a pro hiker than you know what you need and don't need. If you are not - you have two options. Bring your own or rent them. At the last minute we rented the sticks and were so happy that we did. One of the trekkers in our group only began to use sticks on day 4 after his wife suffered a knee injury and he was pleasantly shocked at how useful they were. You're spending quite a bit of money to get here and complete the trek - spend the extra money to get hiking sticks!"
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "Salkantay trek cabin to cabin. Salkantay trek was AMAZING, and we stayed in very comfortable rustic cabins. Refugio Salkantay took us and this is local family that was attentive and caring!!! The Salkantay trek goes from about 11,000 feet to about 15,000 feet in elevation to a gorgeous Andean peak covered with glaciers! There is a side hike to the Salkantay turquoise glacial lake!Then the trek follows a stream down into a deep valley dropping into a green flower filled tropical jungle with wonderful butterflies!! It is an amazing trek!!We paid $100 per person, stayed in cabins each night, and Refugio Salkantay provided delicious home cooked dinners, breakfast and packed home cooked lunches!! We had no guide in the trail but the trail is very well marked, impossible to get lost. It was an unforgettable experience!! My best, most FUN part of traveling to this area!!"
        }, 
        {
            "index": 114, 
            "rating": "4", 
            "review": "do it yourself and its great!. there is a company that you can go through at the south american explorers club that is around the $100 mark. they give you a map of each day on the morning of each day. they give you a pack lunch and they have someone meet you in a local home stay at the end of each day who puts you up in a local village. they cook you huge meals, dinner and breakfast. then you get up in the morning, they give you a pack lunch and a map for that day and send you on your way! its a much much more interesting way of doing things, contributes directly to the local people as opposed to large over charging travel agencies and is so much fun! also if you can, take the time and cut over the mountains to llaqtapata and drop down to hidroelectrica instead of going all the way round via santa teresa. i promise you will be the only tourists in an inca site (only discovered in 2003) that you can actually see machu picchu from. do it!"
        }, 
        {
            "index": 115, 
            "rating": "5", 
            "review": "tough hike but beautiful. this was higher altitude than we expected, but what an incredibly beautiful place. Worth it. Almost 17,000 ' and quite cold at night, so plan accordingly."
        }, 
        {
            "index": 116, 
            "rating": "5", 
            "review": "We're so glad we chose this!. We just got back from our visit to Peru and the Salkantay trek was by far the highlight. We are avid hikers and in good physical condition, plus we spent about a week in Puno and Cusco before the trek (both are above 3000m elevation), so it really wasn't especially difficult for us. The only difficult part for me was carrying 15kg of camera gear!I learned that there are a whole cadre of booking companies one can go through, but it did seem like we all ended up staying in the same campsites and basically having the same experience (except for whoever paid the $5000 for the lodge and horseback option).The trip was very well organized and the food was excellent! Sometimes things were a bit rushed, especially in the mornings when the guides wanted everyone up at 5 and hiking by 6 am, but it worked well overall. The day we crossed the pass was a long day of walking, and the downhill was tiring, but it was so worth it.We did a 4d/3n option that allowed us to take a minibus from the second camp area to Santa Teresa, skipping 5 hours of walking, and giving us enough time to visit the excellent hot springs. Some of us even did the zip line, which I heard was very good.The third night was at a nice hostel in Aguas Calientes, and the 4th morning at 4:30am we started walking up to Machu Picchu. It was great to be up there when it first opened, and get a tour of the ruins with our trek guide before the huge crowds arrived. After the tour we had hours to explore on our own, and time for dinner in Aguas Calientes, before taking the late train and bus back to Cusco.This was a fantastic experience and I'd encourage anyone to try it, even if you're not in top physical shape. Our group had people of all experience levels and they all made it fine. One guy needed to hop on a horse for part of the uphill, so that was a nice backup option to have.Every place we camped had a small shop with bottled water, sodas, beer, and basic snack items. Yes, the prices are marked up from normal, but at least you aren't drinking river water, and you only need to carry enough water for one day at a time."
        }, 
        {
            "index": 117, 
            "rating": "5", 
            "review": "beautiful trek. very difficult trek for beginners but so worthwhile. Amazing views of the snowy Andes and the rainforest! Check this one off the bucket list ;)"
        }, 
        {
            "index": 118, 
            "rating": "5", 
            "review": "Incredible trek. We booked via 'Friends of the Nature' but later discovered the actual tour company that puts everyone together is KB adventure tours. We paid 210USD inc Machu Picchu Mountain. The five day trek was incredible, the food was delicious and the overall experience was one of our best in South America. Worth the blisters."
        }, 
        {
            "index": 119, 
            "rating": "4", 
            "review": "Wonderful Views! Unique Landscapes!. The Salkantay route passes through an incredible variety of landscapes. Starting in Alpine terrain, you trek the first two days to a high pass (4,700 meters) surrounded by glacier peaks. There are a number of gorgeous, glacial lagoons near Soraypampa (first day camping). Although the lagoons are off the route, I highly recommend taking the detour. From the high pass, you descend into the humid, cloud forest terrain that surrounds Machu Picchu. Contrary to common belief, you do not need a guide for the Salkantay trek. Unlike other routes in the Cusco area (Ausangate, Choquequirao), Salkantay is heavily traveled. I encourage anyone with outdoors experience to go without a guide. The agencies in Cusco often charge high rates and provide poor quality service (e.g. wet tents). If you do book with an agency, I recommend you take time to choose carefully. A great option for the trek is Refugios Salkantay. You hike on your own, as the route is clearly marked, but you stay in cabins along the way. For about $130 they provide lodging for three nights along the route and all meals up through the fourth day (the day you arrive to Aguas Calientes). I found the lodging to be quite cozy and the food quite good. They provide instructions and maps for those worried about finding their way. Furthermore, Refugios allows you to hike on your own without carrying a heavy pack and gear. Trekkers need only a day pack their clothes, water, and the lunch provided by Refugios. For those who lack backpacking gear and want to go at their own pace, Refugios Salkantay is for you.Despite the high volume of tourists, Salkantay is still less crowded than the official Inca Trail (which, for the record, takes up to months in advance to book). Although I have not done the official Inca Trail, I have heard from multiple people that the views are considerably better on Salkantay. If you are looking for an easier trek with great views, choose Salkantay. If you are looking for a more isolated route, I would personally recommend the Ausangate loop."
        }, 
        {
            "index": 120, 
            "rating": "5", 
            "review": "Best trip of our lives!. My wife and I did this trip in November of 2013. Really was an amazing adventure. The guides were awesome and spoke perfect English. The lodges themselves were 1st class all the way with very comfortable rooms and modern baths. In the main lodges were a sitting area, a bar and the long dinner table for the group dinner. Speaking of food I would say it was good not great and I think it was luck of the draw on the skill/quality of the Chief that traveled with our group for the entire week.The views and the people on the trek were wonderful and interesting group. (we became good friends with 2 couples we met on this trip) 1st tip is bring your swim trunks for the 2nd day you do an out and back to a glacier lake-ya got to take the plunge! I will say that you may find it tempting to book this through REI but I would highly recommend going with Mountain lodges of Peru themselves. The group ahead of us was guided by REI (you only overlap with another group at the largest of the lodges on the 1st night) and they had a more sterilized trip IMO. At one point we walked across the lip of a 100 foot waterfall and was crazy but a great memory but the American led REI group turned around the day before and were bussed around.Another point is yes the trip is expensive but well worth it. They broke the 12 of us into 2 groups allowing the faster people to go a head and they put a guide and horse with the older/slower of the group. The last day you do a 2 hour private tour of Machu Picchu before the crowds move in with your guide. I would recommend to go to Mountain lodges of Peru's web site and check out the photos. Exactly what you are going to see on your trek. Every one on the trip agreed that it was the best trip any of us had ever been on. I agree."
        }, 
        {
            "index": 121, 
            "rating": "5", 
            "review": "The best way to get to Machu Picchu. To start with this is a spectacular trek to get to Machu Picchu.We booked through our a hostel, and learnt that most of the hostels in Cusco work together and everyone is grouped together, unless you go with a specialised company like Salkantay Trekkers and so on. To be honest everyone walks the same route and stayed in the same camping spots, the only difference is the price and apart from that its all the same, We paid $230 this was for 5 days 4 nights, compared to some who paid in excess of $450+. Okay there food looked good, but i preferred the quantity we got at the end of a long day to something fancy.Going on to the actual hike, it was superb, the guides where great and informed us along the way about the area we where and what was coming up. They are very conscious about the altitude and peoples different levels of fitness. The breaks throughout the day where timed and never rushed, everyone in the group never felt hurried.The camp sites for the first two nights where under shelter and the third was on grass, the hotle in Aguas Calientes was basic for the forth night.The food was surprisingly good, i thought is was going to be more rustic but it was great and a different everyday, apart from the soup.The hiking was hard in places ranging from up-mountiain struggle to downhill knee shaking, take hiking poles.There is plenty of water along the way, just make sure you either bring money, or purification tablets.We hiked though snow so go prepared, with good hiking boots. You don't have to pack like mad, think very light as its three days with a mule, the forth day with all your stuff and the fifth is just taking a few items to Machu Picchu its self.Apart from some information i listed, this hike is awesome, i met some people that did the Inca classic and i am glad i picked this one, the scenery was epic!Enjoy the Salkantay Trek, take plenty of mosquito repellent!"
        }, 
        {
            "index": 122, 
            "rating": "3", 
            "review": "A fun trek - could have done independently. We booked our tour with Refugios Salkantay (http://www.refugiossalkantay.com/salkantay-trek-4d3n-1/) through the South American Explorers Club in Cusco, Peru. The trip cost $100USD plus $30USD for a temporary SAE club membership. We chose the four day, three night trek and were attracted to this company because we could trek independently, but still have a place to stay and a meal every night. The trip was well organized for the entire time, but I think it's overpriced for what you get. Once we started the trek we realized how easy it would have been to do on our own. Many of the places we were paying to stay also offered free or very cheap platform covered camping. The food was hit or miss. The third night the tour leads you to Santa Teresa rather than Llaqtapata which is a mistake! Santa Teresa does have nice hot springs but the town is run down and dirty. We also got bad advice about walking from Santa Teresa to Hidroectrica. Do not do this! The road is a highway with constant construction and is very dangerous to walk on. Once we had been walking for two hours (after finally finding the trail), we decided to walk back to town and get a taxi. On the 30 minute drive to Hidro we did not see one person walking (very unusual for Peru, right?).The Salkantay trek was not as rustic as we had imagined. I would describe it more as a \"cultural trek\" rather than a \"wilderness trek\". You walk on packed dirt road following the donkeys most of the time. We heard great things about the trek to Choquequirao which is longer, more remote and more difficult. If we could do it again, we would choose this path rather than Salkantay."
        }, 
        {
            "index": 123, 
            "rating": "5", 
            "review": "A road less traveled. We booked this trek through Backroads. It was an epic journey. Lodges hold your own group of 12 (except for Salkantay Lodge which holds two groups). We saw about 10 other hikers in total. Lots of gorgeous scenery from snowy mountain peaks, glacial lakes, flora, fauna, farmhouses, horses and donkeys, rain forest, raging rivers. The lodges are rustic but cosy. Electricity until 11 pm, great pisco sours, most have hot tubs, wifi, communal areas for games and cards and dancing, hot water bottles in your bed for turn down service, thick duvets. The guiding was superb. Information about flora and fauna, geography, history, geology, spirituality. It was the most memorable trip we've ever done. Even without Machu Picchu at the end (which was spell-binding) this trip would have been amazing."
        }, 
        {
            "index": 124, 
            "rating": "5", 
            "review": "The best way to go: Salkantay lodge to lodge trek. The Salkantay trail is the one you'd take if you choose to do a lodge to lodge trek from Cusco to Machu Picchu. There are 4 lodges on the trail, Salkantay, Wayra, Colpa and Lucma, owned by Mountain Lodges of Peru. You can book with MLP directly or go with a tour company in the US (e.g., REI, National Geographic, Sierra Club, etc). The trekking part is basically identical (7 days including the day at Machu Picchu) regardless of who you book with because there's not much variation on the time and route to each of the lodges. Costs vary however as some program inclusions may differ. For instance, 1 day at Machu Picchu vs 2 days, or whether site entrance fees are extra, as well as level of support during the trek (whether you have to carry all your own drinking water).Besides the package program, if you are coming from sea level, you might also want to add a few more days in Cusco prior to the trek (we added 3 and it was just right for us) to acclimatize as Cusco is at high enough altitude (3400 m) where most people would experience at least some mild discomfort, and the last thing you want is to be bogged down by altitude sickness during the hike (not to mention that Cusco is a very charming city worthy of a few days in its own right). At the end, if the program only gives you one day in Machu Picchu, it's worth extending a second night so that you'll at least be able to spend a full day at MP because afternoon's the best time to visit as most day trippers leave after lunch, so you'll practically have the site to yourself.The trek itself is not overly strenuous as there is plenty of rest and downtime built into the itinerary - for instance you only hike a few miles the first day on a pretty level grade, and the second day is optional if you want to rest (since you'll be returning to the same lodge) - although usually no one would want to miss it because the destination is a most beautiful glacial lake. The third day is probably the hardest, as you'd go over the Salkantay pass at 4630 meters and the last kilometer before the top is quite steep. Also if there is a day you'll encounter weather issues - rain or snow - this will be it as mountain climate is unpredictable (regardless of dry or rainy season). We had snow turning into rain half way up the mountain, although luckily neither was particularly heavy. Then it rained heavily again on our descent just as we reached our lunch tent. This is also the day you need to dress warmly as it could get quite cold. After that the next couple of days of the trek would be quite easy, as it's mostly downhill into the cloud forest, until the last day when you'd have to rush up and down to catch the train to Aguas Calientes. With some tour operators you might be able to skip this last leg (to conserve energy for the big day in Machu Picchu - especially if you also want to climb Wayna Picchu) by hitching a ride with the luggage van to the train station but then you'll miss the chance to get a rare, although distant view of MP. Overall, I'd say this is one the best trips we've had and we enjoyed the trek immensely (neither of us are seasoned hikers and this was my first and only multi-day hike ever). The scenery was so amazing and spectacular, there was never a boring moment. And the best thing was at the end of each day, you get to relax at a very cozy and comfortable lodge in the most beautiful setting, have a super delicious meal, and soak in the hot tub while continue to enjoy the picturesque views all around. One more thing to note is that while there is minimal tourist crowd on this route you do share it with local working traffic: horse or mule caravans transporting stuff from one town/village to another so step carefully (sometimes impossible) as there will be a lot of animal droppings on the road. Other than that, everything's pristine!"
        }, 
        {
            "index": 125, 
            "rating": "5", 
            "review": "Salkantay Trek to Machu Picchu. Awesome, life changing experience that allows those who do office work for a living to really enjoy the great outdoors and see how other people live. This trek was the best way, in my opinion, for somebody who is 50 something to hike through the Andes with the end goal of visiting Machu Picchu, without camping. The guides were knowledgable, well prepared, and fun. The cooks were authentic and skilled. The lodges were comfortable, well maintained and rustic. Although Machu Picchu was massive, mysterious and amazing, the beauty of this trek was more about the journey. My advice: Don't overpack, don't walk too fast, follow the guidance provided by MLP, and drink lots of water."
        }, 
        {
            "index": 126, 
            "rating": "5", 
            "review": "Salkantay trek to Machu Picchu.. This was the trip of a lifetime! I loved it! We booked our trip with Mountain Lodges of Peru, and began our trek on July 20 2014. Our guides, Jose and Pepe were outstanding! The lodges were inviting, comfortable and well appointed. The cook and his brother who traveled with us prepared the most delicious meals. I love Peruvian food. We traveled in a small group - they will accommodate up to 12 or 13 - which consisted of 4 couples, all of us in our 50's, and a family with 3 teenage boys. We were lucky to be able to trek with a wonderful group of people. The trail is spectacular, beautiful, breathtaking and challenging. The challenge is mostly due to the high altitude and at times the distance we hiked. We calculated that we trekked 50 miles over 7 days, ending up in Aguas Calientes for our final day spent at Machu Picchu. We also hiked up Huayana Picchu, which was simply awesome. We spent 4 days prior in Cuzco to acclimatize, and we also took diamox for 3 days, which did help with the altitude. Cuzco is charming and I highly recommend spending some time in this delightful city prior to beginning your trek. The folks at Mountain Lodges of Peru were well prepared, and provided us with perfect pre-trip suggestions for packing and preparing ourselves for this adventure."
        }, 
        {
            "index": 127, 
            "rating": "5", 
            "review": "Salkantay Trek with Mountain Lodges of Peru. I had the most fantastic experenice on this trek with Mountain lodges of Peru. Before starting this trek we spent 3 nights acclimatising to the altitude in Cusco which is vital in order to gain full enjoyment of the trek if you are not already used to the altitude. The trek gains a maximum alititude of 4800m on the third day of trekking. Although challenging in places the trek is overall extremely enjoyable and doable for those with reasonable fitness used to hill walking etc. What puts this trek above the others in Peru in my opinion is returning to the beautiful lodges after a tough days walking and the fact that you seem to have the andes to yourselves unlike the busy inca trail and conventional salkantay. The lodges are all maintained to an extremely high standard, the food is excellently prepared and the staff are all extremely friendly. They are extremely relaxing places to unwind and soak up the atmosphere and spectacular views of the andes. Day 1 of trekking is long but not particulary challenging but it is quite a long day so pace yourselves and get used to walking at the altitude. Day 2 involves a trek up to a glacial lake (this day I found the toughest but also the most beautiful and was the highlight for me - as although it is short it is quite uphill and I was still adjusting to the trek at altitude). They advise that this walk is optional but due to its beauty and importance for acclimatising the next day I would say it is essential. We took a dip in the glaical lake which we had to ourselves apart from the others in our small group - this was revitalising and not to be missed. The third days is up to salkantay pass. Its is challenging and we were hit by a severe unexpected snowstorm even though we had beautiful weather the two previous days - so bring warm cloths for this day as we were not prepared for that! Day 4 of our trek was adjusted as after the snow/rain storm there had been several landslides but we stil enjoyed a beautiful 3 hour trek along the river and an exciting river crossing which is not usally involved in the trek. The next day was a reasonably challenging trek uphill again where you gain a fantastic view of machu picchu from an adjacent mountian - the most spectacular view in my opinion. You even enjoy a beautiful lunch overlooking machu picchu. The final night before visiting machu picchu itself we stayed in a hotel which was not run by mountain lodges of peru but still part of the trek called inkaterra - this was the only let down on the whole trip. It was tacky crowded and the food was of poor quality. The next day you will visit machu picchu. Machu picchu is beautiful although much more crowded then what you will be used to on your trek so be prepared for that. We climbed the mountain huayna picchu - not to be recommended unless you are comfortable scrambling on rocks. I would truely recommend this trip, the beauty, privacy and luxury are not to be missed and its well worth it."
        }, 
        {
            "index": 128, 
            "rating": "3", 
            "review": "Mountain Lodges Of Peru Salkantay Trek. I did the Mountain Lodges Of Peru lodge to lodge trek in March.Overall I enjoyed the experience. I feel a little out of sync with other reviewers who have given the trek an excellent review however I felt overall it was average on the basis that the experience met, but didn’t exceed, expectations based on its cost.The positives were that our guide was excellent and very knowledgable. The lodges are very comfortable and a couple are in beautiful locations. Compared to the main Inca Trail the paths are not very congested which makes the walking much more enjoyable. If you are looking for a challenging trek, however, then this is not the one to do. I’m over 40 and I felt that, especially given the relative comfort that the lodges provided, that we could have pushed a little harder during the days. The first and third days are tough but the remainder are not full days and generally downhill. The toughness of the trek largely comes from battling altitude sickness. I definitely recommend spending a day or two in Cusco beforehand acclimatising as altitude sickness, coupled with the tough days all being at the start of the trek, makes the early part tough. Half of our group had less than enjoyable first couple of days. Expect to get some rain each day. This is not a huge issue on this trek because you can dry your gear at the lodge every night but still it’s important to come prepared. Also expect some mud, there are several long sections of track full of it.Food on the trek was OK but let’s face it, after walking for a few hours in the rain, even the guinea pig they serve up tasted good!The mountain scenery on the second and third days is spectacular. After this, it is largely less interesting jungle scenery. And then at the end you have Machu Picchu which is spectacular. This of course is the big hook for doing this trek because it appears to be the only complete lodge trek to Machu Picchu. So if you want to do a Machu Picchu trek in some comfort then this is one of only ones on the market. Without Machu Picchu I would say that there is more spectacular mountain scenery in other parts of the world including a little further South in Patagonia. Our guide had done both the Salkantay and Inca Trail many times and he felt that the Inca Trail was more a more interesting and rewarding walk. At the end of the day, Machu Picchu is going to be the highlight of either trek.Overall an enjoyable experience but if you have a moderate level of fitness and want to walk in relative comfort then I would investigate some of the higher end treks on the Inca Trail."
        }, 
        {
            "index": 129, 
            "rating": "4", 
            "review": "For experienced hikers only. I signed up to the Salkantay trek really not having much information about it. I can´t remember my tourism agency´s name right now, but they really should have given more info before starting or signing up (or paying) for the tour. Either ways, I am happy I was so badly informed because maybe if I knew what I was getting into, I probably wouldn´t have done it.Anyways, some tips for the dumb-dumbs like myself that the agency didn´t gave me:- water is not included. Even thought it appears as included in most tourism packs, true is they just stop the hike in strategic points with little rural stores were you can buy the water. Not expensive anyways. but the tour doesn´t provide it and this is something to take care of.- the trail itself is NOT for starters. You MUST practice at least a month before starting this adventure. The day 2 (always mentioned as the hardest one) is HELL. Keep 100 soles (around 37 US$) to climb up the most dificult part riding a horse. Swallow your pride in this one, trust me!- It´s gona be seriously cold. Don´t be cheap in scarf, gloves and beanie.- Take pain killers with yourself. Really, it`s been like 6 days I`m over it and my knees still hurt as hell.- Do NOT overpack. They are very serious about the weight they allow and carrying extra stuf in your backpack is a terrible idea.Other wise, great experience. If you´re overthinking about it, just leave it...."
        }, 
        {
            "index": 130, 
            "rating": "5", 
            "review": "Rewarding Trek. My grilfriend and I opted for the Salkantay Trek and it was so worth it. We went with Salkantay Trekking and had the best agency experience here in South America (we have been travelling for the last 4 months). The food was excellent, two chefs were looking after us during the four days trekking and what they cooked was simply delicious. Our guide Ramiro was very competent and funny. We had a great time on the trek but also in the evening playing cards. The trek itself is challenging especially on the second day. As our group (6 people) was very eager to walk, Ramiro suggested an alternative route on the fourth day starting in Lucmabamba and passing through the Inca Site Llactapata. This detour was worth the additional effort and rewarded us with an amazing view from Llactapata to Machupiccu. The tour ended in Aguas Calientes, where Salkantay Trekking organised a small but very comfortable little hotel, which was very flexible with breakfast times (4.15 am). As every day, also the day of the Machupicchu was very well organised and Ramiro was a great guide. We decided to change our train ticket to 14.55 in order to benefit from the view of the valley Sagrado. The change in time was well communicated, and at our arrival in Ollantaytambo a driver was waiting for us. Overall an amazing experience, highly recommendable!"
        }, 
        {
            "index": 131, 
            "rating": "5", 
            "review": "Salkantay trek in rainy season: just beautiful!. Peru in February means it's rainy season in the Andes and the Inca trail is closed. No worries though, the 5d/4n Salkantay trek is a fantastic alternative hike towards Machu Picchu! Maybe we were lucky with the weather, but the short periods of heavy rain were no problem with proper rain gear. Added effect: no crowds on the trek!Especially the first and second day are breathtakingly beautiful when you climb the Salkantay mountain. After that you descend towards Santa Teresa via cloud forest and the scenery changes yet again when you reach Aguas Calientes on d4. This hike is difficult at times due to the heights (4960m at highest point) and some steep climbs, but certainly doable for not too experienced hikers in decent shape. Wherever you book (at least in low season), you seem to end up in the same group. Value for money is fine though: you get good food and shelter for 5d/4n; transportation (including train on the way back); guides; and entrance to Machu Picchu for around $215. Your visit to MP will hardly be cheaper when you organize it yourself via public transport from Cuzco and it's a lot cheaper than the actual, touristy Inca Trial. If you've got the time, this is a fantastic way to experience Machu Picchu as the climax of a long hike!"
        }, 
        {
            "index": 132, 
            "rating": "5", 
            "review": "Gorgeous hike to Machu Picchu. Having done both the Salkantay trek and the Inka trail, I have to say that I much prefer the former!Especially the first and second days are filled with gorgeous scenery and challenging but very manageable hiking (comparable to the Inka trail and far easier than the Ausangate circuit).The beautiful mountains, lakes and valleys made this one of my all time favorite hikes!Furthermore, the hike is very affordable (about 400 soles for 5 days of hiking, food, accomodation, transport, MP ticket, train and bus back to Cusco, etc.) and Machu Picchu actually manages to live up to the hype!So if you are around Cusco and have a few days to spend I would strongly recommend this amazing hike!"
        }, 
        {
            "index": 133, 
            "rating": "5", 
            "review": "The Very Best!. As a first time solo traveller the staff at MLP were exceptionally efficient, professional and thoughtful. Valerie was brilliant. She advised and suggested my every step from my arrival in Peru, to my departure 5 weeks later. My transfers, my airport hotel, my Cusco hotel and the most amazing trek. Everything was exquisite and can not be faulted . I loved it all and would highly recommend the Salkantay Trek. How can you beat incredible mountain scenery, beautiful lodges and decadent service. It was a trip of a lifetime. The very best memories."
        }, 
        {
            "index": 134, 
            "rating": "5", 
            "review": "A special trip. We did the trip with Mountain Lodges of Peru('MLP') and spent an extra day at Machu Picchu at the end of the trip. I booked the trip independently from the UK and MLP were very helpful and professional from the start and throughout. The hike is not particularly physically challenging as the distances each day are relatively short, but the altitude needs to be respected. MLP's guides are excellent, they are well trained and monitor you for altitude sickness throughout providing advice and care as necessary. The mountain lodges are wonderful, set in amazing locations, comfortable and cosy and the hot tubs at the end of a hike are a bonus. The best thing about this trip is the way it immerses you in the culture and the different environments of the Andes. You cross mountain passes at 4600m and descend through the cloud forest to more tropical jungle conditions before reaching Machu Picchu. We also enjoyed our visit to a school which is supported by MLP, and the nightly briefings on the birds, flowers, stars, food, history and culture of the region. The food served on the trip was delicious and locally sourced. There were 12 of us in our party and we hardly saw any other hikers the whole trip which I think is the big advantage of Salkantay over the traditional Inca Trail. Our guides Guido and Claudio were fantastic and made the trip even more special. Guido knew the best spot to see the sun rise over Machu Picchu and got us there in plenty of time thereby ensuring that we enjoyed the spectacle perfectly. I would recommend this trip and MLP without hesitation."
        }, 
        {
            "index": 135, 
            "rating": "5", 
            "review": "5 day/4 night with Mythical Trails!. We had an INCREDIBLE time with Mythical Trails on the Salkantay Trek! I would highly recommend the Salkantay trek for those who are more adventurous and can handle a little more strenuous of a hike (you hike up to the Salkantay Glacier at over 15,000 feet and then hike down, which is painful on your knees so watch out for that!). It is absolutely gorgeous. The 5 day/4 nights was perfect, I am so glad we chose that length of a trip, we were tired by the end, but not too tired to enjoy Machu Picchu. Mythical Trails is a newer company, but I would absolutely recommend them. We had a guide, Frank, horseman Wilbur, and chef Guido. First, Frank was incredible, he always knew so much information and we just laughed a ton all the time. It was only my boyfriend and I on the trip, which we thought would be kind of weird, but it really allowed us to get to know Frank, which was so fun! Guido, was the best chef in the world. He made the most incredible food I've ever eaten. We are both vegetarians (we eat fish) and it was some of the best vegetarian food I have ever had. His cooking helped us to have the energy each day to hike, we could not have done it without him. Wilbur was also great, he was always at the camp early to set up and make us feel at home. We always felt comfortable and had a great time. We were always allowed to go at our own pace, it was nice to be the only ones so that we could go as fast/slow as necessary. Mythical Trails also allowed us to borrow sleeping bags and hiking poles free of charge, which I know that other companies charge extra for that. On the first day we hiked to the camp by early afternoon and Frank suggested an add-on of hiking up to a gorgeous Lagoon. Although it was a tough afternoon hike, it was well worth it as the lagoon was breathtaking! Highly recommend Mythical Trails for your Salkantay Trek!"
        }, 
        {
            "index": 136, 
            "rating": "5", 
            "review": "Salkantay Trek. The Salkantay trek is an incredible trek! You will see all kinds of landscapes, from the glaciers (4629m) and the jungle (1200m). We had the chance to do some zipline in Santha Theresa, which was amazing! We met people from all around the world and we had lots of fun!!"
        }, 
        {
            "index": 137, 
            "rating": "5", 
            "review": "Salkantay Trek with Mountain Lodges of Peru. Why do it this way?* A trek with no camping - to have lodges means being outside the national park hence Salkantay route* A trek with horses to carry most luggage* A trek with fewer people - 12 people from the lodges plus perhaps 50 campersThe trek is well organized, the start time from the lodges is after the campers and luggage horses have set off. Apart from returning horses the trail is quiet with plenty of time to appreciate the scenery. The pass skirting the Salkantay morrain, the view from LLactapata to Macchu Picchu being particularly good. The trek is challenging but we OAPs managed fine main point to bear in mind is becoming acclimatised to the high altitude before the Salkantay pass at 4600m and particularly the lodges at 3800m and 3900m. The lodges are very comfortable and there was opportunity to visit a local school and coffee producer."
        }, 
        {
            "index": 138, 
            "rating": "2", 
            "review": "surprise - a hike you can do on your own. As everyone we wanted to reach Machu Picchu not via the rip-off-tourist-train and were almost out of practice of hiking - so we did the Salkantay. First it was kind of surprising that, apart from two Israelis, we've been the only solo-Trekkers on that days. But fear not, we've not been alone. Squeezed in between around 50 Tourtrekkers and probably another 50 Mules and Muledrivers it was sometimes hard to appreciate the landscape around. No matter how fast or slow you hike, you'll be most probably squeezed inbetween at least two groups...As we did the Trek alone, we started at Mollepata, meaning that you have to walk the first day, 20k's, along a dirt Road. Landscape was nice, but Tourcars that drop their People close to the first camp spoiled the fun. But we weren't up to pay 20€ just to get the first camp.The 2nd day up to the pass was really challenging but also the most beautiful. The pass itself is not technical its a broad, dusty path - maybe disappointing.The rest - well, if you have the possibility to be around South America and have been in the Low- and Highlands than there's nothing really new or thrilling to see.Just the Walk along the Traintreks is really recommendable as it gives you kind of first feeling for Machu Picchu. But you can also do this, if you Bus there from Quito (also the only cheap option, to get into Machu Picchu).If you really think, you must walk to Machu Picchu, then do it. But i would recommend using time and money for way more interesting hikes - e.g. the Cordillera Blanca"
        }, 
        {
            "index": 139, 
            "rating": "5", 
            "review": "Beautiful and varied terrain. We did the Salkantay trek with Mountain Lodges of Peru, a great way to combine trekking and comfort. The trail itself is amazing. The day we crossed the pass, at more than 15,000 feet, felt like a huge accomplishment! In following days we descended into the cloud forest and what felt like real jungle. We trekked through Llactapata and got views of Machu Picchu across the canyon. Amazing. Highly recommend this route!"
        }, 
        {
            "index": 140, 
            "rating": "5", 
            "review": "An absolutely stunning trek!!. I have done a few treks around Cusco and this is my favourite. Walking up the valley towards Salkantay and seeing the contrast of the amazingly blue sky with the craggy white peaks of Apu (mountain deity or protector) Salkantay is one of my favourite hiking experiences. I don't do well with altitude so this hike was a bit of a struggle for me and the freezing temperatures at my first campsite, Soroycocha were tough but by far outweighed by the crystal clear night sky with the moon reflecting off of the glaciers of Salkantay. You hike through agricultural land, past a glacial morraine, a couple of glacial lagoons (bit of a side trek) and into the high jungle with butterflies, bamboo and orquids. This is truly and unparalleled hike!!"
        }, 
        {
            "index": 141, 
            "rating": "5", 
            "review": "FABULOUS!!!. Did this unforgettable trek with four guys plus Hector - our guide!! Three guys were from CHicago and Ed was from England!! I did it on horse and was very glad i did - purely from the ascent part of it!! The descent i didnt need the horse!!! Just purely for the up!!!and it was worth the few dollars more for this!! Took the stress off any altitude probs i thought beforehand i may have had!!! Had a blast with the guys - we did it through Pachamama Explorers - i dealt with Agness - who was fantastic - answered all my questions in a timely fashion and i would highly recommend them to deal with!! Did this as Inca Trail gets sold out 3-6 months now in advance so was too late - but am glad i did this trek now!! One day i will go back and do the Inca Trail!! Anyhow you land at Macchu Pichu on either trek!!! Highly recommend this trek! We went via Santa Theresa - and camped there for the night after the Santa Theresa Springs - great laugh around the camp fire with the \"local refreshments\" and then Machu Picchu - Just WOW!!!! Highly recommend!!!"
        }, 
        {
            "index": 142, 
            "rating": "5", 
            "review": "Salkantay. A very nice trekking. Being at the foot of the Salkantay glacier is absolutely great. Also the walks in the tropic area is very nice."
        }, 
        {
            "index": 143, 
            "rating": "5", 
            "review": "The Salkantay Lodge was worth the trek uphill.. The Salkantay Mountain glowed silvery green under the light of the full moon as we kept warm outside seated around the fire pit.Great food and charming staff."
        }, 
        {
            "index": 144, 
            "rating": "4", 
            "review": "Do the Salkantay - whether or not you are doing the Inca Trek. One of my favourite treks.. Salkantay This is often marketed as the alternative Inca Trail. I did both. I am glad I did. They are completely different treks. The routes, the terrain, the sights, even the access into Machu Picchu are completely different. Price as well. I did the Salkantay with Andean Path. in the end it didn't matter as we were grouped into a larger group of 16 with people who signed up with other companies. The difference was the pre-trek service level. While some in our group were caught by surprise, the manager of Andean Path, Tania, has explained everything to us and made the proper disclosures. The trek itself was beautiful. Day 1 was in my opinion the toughest. Ascending almost 1,000m after getting up at 330 in the morning. Nice scenery helped. And coca tea and the sublimes and other chocs I loaded up on. Day 2 was the day we crossed the high pass at 4,650m. Some in our group took up the option to take the horse from camp to the high pass. Rest of us walked it. It's the longest trekking day but also the most gorgeous. Watching the changing colours and views of the snow capped Salkantay as the  light hit at different angles while we progressed is an incredible experience. From the high pass down to camp, you see the more rugged side of the Salkantay range. Day 3 and Day 4 are short trekking days through mostly forest. Lots of flowers and other vegetation. River. Mostly descending, it gets pretty warm. At Santa Theresa on Day 3, we went to the thermal springs. A soak after 3 non-showering days is a big enough attraction on its own. Add warm water. Add watching the sun set over the surrounding mountains. Add ice cold beer and chips. Day 4 we had a choice.  Couple of people in our group did a zip line. 1 walked all the way - 3 hrs along the highway. Rest of us took the van and drove the same route for close to 40minutes. My advice: if you are not tired walk it. We were told there's nothing to see but the highway winds along the river. At a point we saw water bursting out of a cliff face. There were pretty flowers. Awesome mountains. We got off at the hydroelectric station and walked along the railway tracks into Aguascalientes. Mas o menos 3 hours. Caught our first glimpse of the Machu Picchu along the tracks. Day 5 - rise at 430am to make the climb to Machu Picchu and avoid the bus loads. Other thoughts:I had good guides in all of my treks in Peru, both in Cusco and in Huaraz. Juan Carlos was our guide on this one and Chino was the second guide. The Salkantay  was tough in parts and more so for some in the group than others. But they were always encouraging. And they were motivating. Juan Carlos especially gave color to the Andean culture. From offerings, beliefs, way of life to the connection of the Andean people with Nature, Pachamama, to the properties of some of the plants we see along the way, Andean culture became something I can understand and appreciate. "
        }, 
        {
            "index": 145, 
            "rating": "5", 
            "review": "5 day hike through the highlands. This is an amazing hike that takes you past mountains of over 5000 meters, to the cloudforest and finishes in Machu Picchu."
        }
    ]
}