{
    "category": "Dubai", 
    "entity": "Meydan-Racecourse", 
    "avg_rating_stars": 4.597014925373134, 
    "review_count": 469, 
    "rating_stats": {
        "poor": 7, 
        "average": 25, 
        "terrible": 2, 
        "very_good": 110, 
        "excellent": 325
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "Meydan!!. Absolutely fantastic horse racing facility that is open to the public. Public has free entry to races, raffles. Entire families attend and have a family outing. Seating is plentiful and seats i.e. view is fabulous. Meydan Hotel next door is great for drinks and appetizers and one can view the race from the balcony. Prices are high for instance an expresso is AED 25, beer is AED 48. Shisha available too. Service is fantastic."
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "Great night. Lovely evening spent in the winners restaurant watching the racing - food good service quick and efficient - complexities of Dubai racing raffle expertly explained - definitely will be coming back"
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "Superb. If watching horse race is your thing then this place is like the ideal place for you to spend your day."
        }, 
        {
            "index": 4, 
            "rating": "5", 
            "review": "Awesome Racing Experience. An awesome racing experience in pure granduer and luxury. Whatever they do, they do it LARGE here in Dubai. A must visit for visitors to Dubai, if the racing season is on."
        }, 
        {
            "index": 5, 
            "rating": "4", 
            "review": "Amazing Place. If you love racing, this is the place to go.The course is amazing, perfect view seats and VIP treatment."
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "A guide tour of Meydan. We had a guided tour of Meydan,what a fantastic experiance.Mark made the tour even more special with his vast knowledge& passion for racing at Meydan.We had an inside of how the stables operate on an every day basis also a special mention to Brian.A trip not to be missed for the racing enthusiast."
        }, 
        {
            "index": 7, 
            "rating": "5", 
            "review": "Entertaing Evening. Fantastic facility well worth a visit even if you arent really into horse racing although that does help. Free entry to certain areas and always seems to be a good crowd there."
        }, 
        {
            "index": 8, 
            "rating": "5", 
            "review": "Impressive. Have been to the Maydan hotel rooftop function area for a Gala Dinner and it was overlooking the race course. The whole facility is impressive."
        }, 
        {
            "index": 9, 
            "rating": "5", 
            "review": "A day at the races. You put on your best shoes and your favourite hat and you head on out to Meydan Racecourse. The feeling you get standing there overlooking those magnificent beasts run, gives you a feeling of complete elevation. The facalities at Meydan can be compared to that of the rest of Dubai: unprecedented. Treat yourself, have a look at their private party packages and go enjoy something very special and in any other part of the world probably more exclusive, making the Meydan a uniquely inviting experience."
        }, 
        {
            "index": 10, 
            "rating": "5", 
            "review": "equine athletes performing. Meydan race course is near to Dubai area. Race entry to general admission is free to publice except Dubai world cup day (end of march). You can go with your family and children and watch world's best equine athletes performing. The race will start from November 2016."
        }, 
        {
            "index": 11, 
            "rating": "4", 
            "review": "Spectacular but needs care and attention. The racecourse and the races are magnificent but parts of the building fabric are disappointing. There needs to be some work done to keep the building exterior as spectacular as the design It was great to see it in Star Trek too."
        }, 
        {
            "index": 12, 
            "rating": "4", 
            "review": "Beautiful horses, Thrilling races. We went there for one of the races, I don't remember which one but we have full access and could view the horses from up close and fell in love with each one of them. The Arabian horses are majestic and you can see it from up close and in action and what a sight it is."
        }, 
        {
            "index": 13, 
            "rating": "5", 
            "review": "So close and yet so far. This has to be, structurally and aesthetically, the best racecourse in the world today. Yet....other than World Cup night, it leaves much to be desired in terms of atmosphere. I attended Super Saturday and it was a crying shame that arriving with no organised plan, my colleague and I were sold a very expensive hospitality package into a VIP enclosure that easily catered for over 150 people and yet had an entire total number of 2 for half the race meeting, when we were then joined by another 8. The racing was superb, the prize money on offer incredible, the quality of horses on display world class - yet the atmosphere was flatter than a midweek meeting at the Vaal in South Africa or some resolute English country side course.So much potential and yet so little delivery in terms of customer experience.I will go again - for the horses and for World Cup night - but will have to do some serious research into where I land up, if I am to go on any other night other than the big one."
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "Well worth booking. We booked a trip to visit the Meydan and a tour of the stables. Very informative and to see how well the horses are looked after, you are served breakfast when you get there and you can watch some of the horses on the gallops."
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "Can be visited countless times and great for all the family!. I've visited Meydan annually for the past 4 years and every time it's served as a consistently great day out. I usually visit with people of all age ranges and it always goes down a treat, definitely visit!"
        }, 
        {
            "index": 16, 
            "rating": "5", 
            "review": "Dubai world grand prix. We visit Meydan race course for Dubai world grand prix.Nice horses, fireworks, concert.... Worth it."
        }, 
        {
            "index": 17, 
            "rating": "4", 
            "review": "Celebrated not bday here. There was a race on Nov 7th in Medan and my sis in law gifted me Meydan race tickets. Had an excellent time there. Dinner was excellent."
        }, 
        {
            "index": 18, 
            "rating": "5", 
            "review": "World Cup Day. I visited here twice, once the day before fir what's called Breakfast with the Stars (the horses and jockeys) and the next day for race day.The race course is delightful, large, clean with attentive staff.We booked the tickets with open bar and food, it's slightly higher in price but worth it, lunch is either finger food or sit down hot buffet. Nice food too.The only very difficult thing is getting a cab back as many people are trying at the same time. "
        }, 
        {
            "index": 19, 
            "rating": "2", 
            "review": "No atmosphere. There is no atmosphere as there is no betting. hard to get a taxi after the races. Food was good and facilities were good also but if you enjoy racing UK style this is not the place for you."
        }, 
        {
            "index": 20, 
            "rating": "5", 
            "review": "Amzing experience. It was an amazing experience to watch the race sipping your favourite drink. Would recommend and will go again on the next season."
        }, 
        {
            "index": 21, 
            "rating": "4", 
            "review": "Fun Times. Getting in and out is a pain, especially for big events like the Dubai World Cup. We were in the premium section, which had a great selection of food and drinks, but it was a bit crowded and there was definitely a lack of indoor seating."
        }, 
        {
            "index": 22, 
            "rating": "5", 
            "review": "The Best. Dubai has become such a great destination....places like meydan are just a must see for all those who visit"
        }, 
        {
            "index": 23, 
            "rating": "5", 
            "review": "Good venue that lends itself to events. I have been here for live concerts as well as for the races. Meydan is a good venue with ample parking and organization."
        }, 
        {
            "index": 24, 
            "rating": "5", 
            "review": "Honeymoon. Me and my husband stayed in this hotel as part of our honeymoon in September 2015 before going on to Mauritius and we absolutely loved it. Everyone is so friendly and staff always recommending places to visit and make reservations if you don't have anything planned. On arrival we were given a welcome drink and a wet towel to cool down (which you will need). Everything is so extravagant from huge velvet chairs to massive chandeliers. There were hidden doors in your hotel room to store luggage and there are door bells rather than people knocking. The rooms were very modern with touch pads everywhere for lights and curtains in the bathroom. There was a tv (we think) in the bathroom above a huge bath but we were not sure how to work this. There was also a separate shower which was amazing. When we stayed it was not very busy and all of the staff remembered our names when we were walking around the hotel. We went in the pool on the roof which was an infinity pool with amazing views. Towels are provided and the waiter also handed out fruit while you were up there.We ate in the steak restaurant one evening and everything was delicious, we would definitely recommend.As we were on our honeymoon we had a lovely cake left for us in our room on arrival and also one presented in the steak restaurant for desert which was very nice. There are always taxi's outside and if you want one, the door man will pull one over for you.The hotel is slightly out of the way from the centre where all of the action is but it does not take long to get into the town and not that expensive.We really enjoyed our stay here any only have positive things to feed back. We would love to come again when the racing is on."
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "nice golf course. i play there is a really nice golf course , nice staff very helpful , there was no horse race , but i will be back for them ....."
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "Not just a racecourse. A must visit. Good restaurant with great menu. We went to play golf on the Track course many times. Great course and price is not bad. always started with good coffee, a visit to the Pro shop , good golf and then brunch."
        }, 
        {
            "index": 27, 
            "rating": "5", 
            "review": "World Class. Visited the Meydan Racecourse because i was lodging at the Meydan hotel and i must say this is without one of the best horse race courses i have ever been to. the location and the facilities on ground is out of this world."
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "One of the most profitable races take place here. It's not a surprise to many that Dubai holds some of the most profitable races.The seasons are short due to the hot weather in Dubai, so go and join the frenetic scene if you have time."
        }, 
        {
            "index": 29, 
            "rating": "5", 
            "review": "Worlds Best Racecourse. Was there for Dubai World Cup 2016. It was my first time attending the World Cup. An amazing expereicne one have to visit Meydan if they are visiting Dubai."
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Must do in Dubai. We went to last Dubai world cup and it was truly an incredible experience. We've never been to a horse race, and did not know if we liked it, but truly enjoyed ourselves. We only got the cheapest tickets (50dhs), but were a bit disappointed by the dining options that came along with it. Everybody can roam around freely in the whole area, but you are only allowed to access the restaurants dedicated to the ticket class you bought. Accordingly, we were stuck with the likes of Pizza Hut, which was not worth the occasion, but our bad. Next time I'd go for more expensive tickets to get the full experience, but if you don't plan to eat or drink there you might as well be fine with the general access."
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "Great facility …!. For the aficionados of horse racing, this is must place to visit. No gambling. Great atmosphere and extremely safe. A must visit during the Dubai World Cup."
        }, 
        {
            "index": 32, 
            "rating": "3", 
            "review": "Weird experience. I like the stadium as a whole.But i went there in its early days when it had recently opened. I attended a race. It was so chaotic and hot and sultry due to the weather. Elton John performed later that night in open air on a stage erected on part of the course. The sound was pretty bad, We couldnt hear much. We also couldnt find any place to eat either. I dont know, are you not supposed to be eating at the stadium? Maybe youré only allowed your drink in hand? I hope things have changed now. Plus the icing on this sticky night was the whole place was infested with british folk, most of them didn't seem to know jack about the game, they just want to wear their hats and coats and insta themselves living the life in dubai. it was a real putoff..."
        }, 
        {
            "index": 33, 
            "rating": "4", 
            "review": "Amazing spectacle. Safe happy environment. We took a cab to the course (ask to be dropped at the entrance to the stand!). A great friendly, happy atmosphere. What a different no gambling, no drinking, makes. So different to the 'swim through' at a lot of Australian race meeting. We went to the first meeting of the season, free entry! Would love to be there for Dubai Cup season.We had plenty of time to catch our flight home after the racing ended."
        }, 
        {
            "index": 34, 
            "rating": "5", 
            "review": "Well organized and managed. The hotel around and the race circle all advanced built , also the management effort is a big witness of the place , the near by community developed very high end villas and palaces , adding that it's very close by design district , dubai mall , boulevard sheikh mohamed ,"
        }, 
        {
            "index": 35, 
            "rating": "5", 
            "review": "great family day out. Wow !!! Firsly they hit you with this massive glass wall aquarium, with the most amazing ammount of fish of all types and sizes, then if ypu want to venture deeper and what an adventure sharks , massive king size alligators, too many to mention, when its done the dubai way its really special, it took us hours to get round , worth every penny."
        }, 
        {
            "index": 36, 
            "rating": "5", 
            "review": "End of year party. Absolutely Fabulous service and really accommodated our needs. Food was a lot better then expected and everyone had a fabulous time. I would recommend this for a staff party event as it was actually quite cheap per head for what we ate and drank."
        }, 
        {
            "index": 37, 
            "rating": "4", 
            "review": "HIGH CLASS ENVIRONMENT!. It has been existing to be in this place because you can enjoy the to select your horses during the presentation! People are very well dressed and elegant! The class at the nd of the day!"
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "Meydan racecourse is stunning. I had a chance to participate in a 2 day conference at The Meydan hotel at the Racecourse and it was a great experience.The view is fantstic and on race days it is amazing.On the costly side but definitely an indulgence worth picking up."
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "Beautiful place for shows and concerts. I visited Meydan for a show and found it simply amazing. They have ample parking space and it is beautifully designed. They have a club, good restaurants to eat etc."
        }, 
        {
            "index": 40, 
            "rating": "5", 
            "review": "Dubai World Cup. What a place! Amazing day here, great racing & amazing fireworks in the evening. Plenty of seating, could do with more bathrooms, always a line for those."
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "The Dubai Gold Cup is growing in stature. Ascot was once a bit special, and maybe still is, but now perhaps only in the Royal Enclosure, the rest has sorted of descended into a rather large jolly up. Nothing wrong with that maybe and if it's for you, then great. The Meydan has the feel for me that Ascot did twenty years ago, and the weather is a lot more reliable. So it is well worth timing a visit to Dubai to take in the races, if you want to dress up and have some civilised fun watching the gg's. the Champagne is in abundance, as are the ladies in their hats. The tote may be absent, but in the age of smartphones and online gaming you won't be deprived of a flutter, just the feel of cash in your hands and the queue to get on before the start. Not sure I'll miss either here, as for me the cash only seemed to go one way at Ascot."
        }, 
        {
            "index": 42, 
            "rating": "4", 
            "review": "Dinner at Meydan Racecource. Superlative!! both in taste and location!! The view is amazing!! I didnt stay in this hotel as I thought it would be damn expensive! And Indeed it is. The structural layout here are an amazing testimony of what the power of money can achieve. It overlooks a lush looking racecource"
        }, 
        {
            "index": 43, 
            "rating": "3", 
            "review": "Nice view from Meydan Hotel. I have an opportunity to stay at Meydan Racecourse Hotel in December. It's an amazing 5 star rate hotel which connected to racecourse where you can watch the racer train themselves every morning between 5~6am. Racecourse were a bite off shape & damage and it's was really a distance away to Emirate Mall with no other transport with only accessible with Taxi, limo or by car"
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "A million dollar experience!. A party of eight of us went to the Dubai World Cup on Saturday 26th March. The whole day was incredible from the moment we left the car to the moment we took the shuttle bus back to the Dubai Mall to get a taxi. It was a privilege to attend the most prestigious event in the world and to people watch all the race-goers in their finery. The horse racing was very exciting as was the spectacular firework display we were treated to post races. Dubai certainly knows how to put on a show. It wasn't finished there though, mega star Janet Jackson provided the entertainment to finish the day with her Unbreakable Tour set. A day not to be missed. Thank you Meydan, it was fantastic."
        }, 
        {
            "index": 45, 
            "rating": "5", 
            "review": "A stunning race course. Beautiful race course with great views from the stadium and feels so much smaller that it really is as you get such good views. Also offers great restaurant choices with pretty good packages available"
        }, 
        {
            "index": 46, 
            "rating": "4", 
            "review": "Opulent. There was no racing on the day of my visit but the course and the hotel are opulent and I can just imagine what it would be like on racing days. Well worth a visit."
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "And they're Off!!. Live entertainment after the races. Janet Jackson this year. Not the best racing in the world,my opinion,but the richest!! A real spectacular. Shame you can't have a bet"
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "Breakfast with the Stars. The early start and long journey was well worth it. We were greeted by friendly staff (at 6am). The set up was lovely, and the breakfast choice was endless. The racing celebrities mixed with the fans and were happy to chat and take photos. My original thoughts were that it was an event that would be a one off, but we are already planning to go back next year."
        }, 
        {
            "index": 49, 
            "rating": "5", 
            "review": "World Cup 2016. Beautiful racetrack and facility. I would have loved to take a tour but none were scheduled the weekend of the World Cup. We sat in the Gallery section and were very pleased with the seating. We were just past the finish line and high enough to have an excellent view of the race. The Gallery area was not crowded and seats are not assigned so there is ample opportunity to sit in different locations as well as access to the rail for closer viewing. The Gallery package also allows entrance to the Parade and Apron areas. We enjoyed the food buffet and drinks as part of the Gallery ticket package. The buffet and dining tables are indoors, easily accessed and well laid out. I didn't feel rushed and crowded as is the atmosphere at the Kentucky Derby. We had a wonderful day at Meydan which was perfected by a CA Chrome win. Beautiful fireworks after the race and Janet Jackson performed in the Apron area after the fireworks. We took the free shuttle from the track back to the Dubai Mall after the concert."
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "Fantastic Day at the World Cup Race Meeting. We had tickets for The Gallery for our first visit to the Dubai Worl Cup and were were not disappointed in the slightest, in fact we had an amazing day - all the food you could eat, as much drink as we could handle, fantastic evening's racing, fireworks, Janet Jackson pop concert made for one great experience. upon arrival we were immediately escorted by golf buggies to our hospitality area where you walk the red carpet to enter - you get free bets to win large cash prizes, and plenty of seating and space so never felt that busy or uncomfortable. Despite it being a hot day the stands are well positioned so the sun is behind them and all indoor areas well air conditioned. If really wanted to go town there were competitions for best dressed lady, couple and best hat, so plenty of great fashion on view and these offered some fantastic prize packages"
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "Fantastic day out even though I am not interested in horse racing.. What a place to visit. Was worth every penny and the place is so big and everything is so well organised. Must visit. The race course looks spectacular and the atmosphere is out of this world. Be care as the drinks inside the race course are very expensive to say the least. The fireworks display is something not to be missed."
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "fantastic. this was our 4th visit to the dubai world cup at meydan , love it every year , great course looking forward to going again next year"
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "dubai world cup racing2016. What an amazing experience you have to do it to believe it fantastic atmosphere and extremely well organised"
        }, 
        {
            "index": 54, 
            "rating": "5", 
            "review": "World Cup Day Meydan. The ultimate racing day at Meydan. Paid 1500 dhs (250 quid) which included entrance into terraces with outside seating, excellent view of trackside and finish line. Food and drink included all day, just had to pay extra for champagne. Good choice of food and drinks. Indoor restaurant area. Lots of races to watch, amazing fireworks and concert for closing ceremony. Definetely need to do this at least once."
        }, 
        {
            "index": 55, 
            "rating": "5", 
            "review": "Amazing Racecourse. A one of a kind racecourse! Truly unique! Visited for the Dubai World Cup and must say the event was very professionally planned."
        }, 
        {
            "index": 56, 
            "rating": "5", 
            "review": "Amazing and super Excitement. Visited Dubai in Feb and a friend invited me for dinner to Meydan , was super thrilled to see the course in flood lights and night races. track is lush green and so the paddock . Had super fun with delicious food."
        }, 
        {
            "index": 57, 
            "rating": "4", 
            "review": "horse racing!!. Meydan racecourse is the home of Dubai World Cup, the most coveted horse race in the world. Been to a few and enjoyed it to the most. Glamour all around u. excellent!!"
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "Excellent. Oh wow is this the best horse racing stadium in the world at the moment . This is an incredible venue from the hospitality to the race track . Went to see the Dubai World Cup last week and was a fantastic day . We had the premium hospitality suite the food and drink was ever flowing with all sorts of food and any drink you wanted . The seats were very comfortable for 8 hours and nicely protected from the sun by the thoughtful overhang if the roof . Very cleaver . Would recommend the experience to anybody even if your not interested in horse racing ."
        }, 
        {
            "index": 59, 
            "rating": "4", 
            "review": "Lovely base for a holiday in Dubai. My husband and I spent 5 nights at the Meydan on our first trip to Dubai. The setting of the hotel is wonderful surrounded by well manicured gardens and the race course looks amazing. We stayed in a room on the 8th floor which was huge, tastefully decorated and immaculate. Our room (looks like most if not all of the rooms) had a balcony which overlooked the racecourse. It was great to see the horses being trained first thing in the morning.Breakfast was a typical buffet style with continental breakfast and cooked breakfast being offered everyday served in Farriers Restaurant. Tables were offered inside and outside with views over the racecourse. We found eating earlier was better as the restaurant was better as the restaurant got quite busy and tables weren't always as clean as they could have been. A couple of times we asked for coffees which didn't arrive although we didn't chase them either. When you arrive for breakfast you are shown to a table which is great but then relies on the staff chasing you, sometimes as you leave to get your room number. The process could be streamlined so easily if you had to give your room number before being seated.The pool area was lovely located on the top of the hotel with views over the racecourse and out to the City. We found it to be really peaceful and quiet with staff to bring out towels and a drinks service too. Prices were about what we'd expected with alcoholic cocktails c. £9 and Non-alcoholic cocktails about £6.The hotel is a 20-30 minute drive away from the City and there is a shuttle provided although we used taxis. Taxis were readily available from the front of the hotel and ranged from £12-£18, averaging around £15.Room service was very tasty, reasonably priced with quick service. We ate in Shiba which was serving Chinese and Japanese food the night we went. Again, the service was excellent and the food was very good although we did think £90 for two starters, two mains, one side and two cocktails was a bit pricey. We had an amazing five nights at the Meydan and would recommend this hotel. Although out of the city centre the hotel was peaceful with great views of the Dubai city skyline. Would have been a 5 star review but for the haphazard breakfast process."
        }, 
        {
            "index": 60, 
            "rating": "1", 
            "review": "Not what was expected. Whilst the horses racing is the richest prize money in the world, the grandstand and the atrium incredibly impressinve the rest is of a very poor standard, unkesss you are lucky enough to be a guest in a private suite . The public equivalent to the Royal Enclosure is sadly lacking. Buffet food to be eaten off very flimsy plastic plates, plastic cutlery and glasses. No allocated seating in the premium area restaurant which was the standard of a rather lower class cafeteria. No screens to watch the action on the racecourse and no windows. Allocated seating was the only plus. The dress code is certainly not adhered to.There is little or no atmosphere in the grand stand due to no betting which is sort of understandable.A bitter disappointment all round. We are lucky enough to be members of British racecourses where the hospitality and service is terrific, despite the weather.I would strongly recommend saving your money and not going as is an expensive evening for not a lot."
        }, 
        {
            "index": 61, 
            "rating": "4", 
            "review": "Dubai World Cup 2016. The Dubai World Cup is an annual affair since 1996 and is a real carnival held on the last Saturday in March.We were a large group of friends availing of corporate hospitality courtesy of Meydan and had an excellent view of proceedings from our Suite 305.Free flowing food and beverage and a wonderful mix of races, light and sound displays, concluding with the final race for the evening which is the Dubai World Cup - the richest race in the world.Janet Jackson came on stage at the end for a concert but the acoustics were not too good so we left well before the concert concluded.Overall a lovely evening at a world class racing venue."
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "Dubai World Cup Absolutely Fantastic. We were in Dubai for a few days and coincidently the Dubai World Cup Races were on that Saturday. I have to tell you this is one amazing Racecourse!!!. It was a nightmare getting into it as we took a taxi and then had to drove around loops for ages and then got dropped off in open spaces to take a bus into the place. Anyway after that we had to get scanned like in airports except shoes belts everything came off. Security was tight.Once we got into the Apron Views Area which is where we bought out tickets for ( great value at $170AUD) and where all expats go. The track was amazing, the grandstand just out of this world. To watch some of the richest horse races in the world at this place was definitely one thing to do, would love to come here again. Bring plenty of money as the drinks and food are pricey compared to prices in Australia."
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "A DAY AT THE DUBAI RACES. I thought it was so facinating unlike in Australia in dubai we just chose the horses and if they come in the order they pay us we did not have to pay to bet in. and they bring the food to u while ur watching the racss."
        }, 
        {
            "index": 64, 
            "rating": "4", 
            "review": "Impressive. We dressed up for the occasion, although it is not necessary. Unbelievably huge. Can get a drink although expensive but cannot place a bet. All the big screens show the horses, trainers etc. but because there is no betting you do not have any odds to follow or know who is likely favourite. Well worth a visit. We paid £20 for entry in front of the paddock and just short of the finishing post, good spot and that includes a free drink."
        }, 
        {
            "index": 65, 
            "rating": "4", 
            "review": "Wow experience. Really enjoyed watching the race.Very clean and well managed place.Real entertainment.Will recommend to all race lovers."
        }, 
        {
            "index": 66, 
            "rating": "5", 
            "review": "What an amazing racecourse. We went to the Super Saturday race meeting and had a fabulous time. We bought our tickets for the premier seating area on line and picked them up at the ticket office on the day. (At 50 AED each it worked out at less than 10 pounds per ticket)The seating area was perfectly placed in line with the finishing post.This is an amazing venue and the racing was top class.If you are a gambler you need to be aware that there is no betting allowed on the racecourse"
        }, 
        {
            "index": 67, 
            "rating": "4", 
            "review": "A must!!!. Great experience. Great ambiance. You can go for free or paying from 50 aeds. We paid and enjoyed. Good fast food and drinks. It's a great evening from oct to mar to go in family or with friends. It's really a must go!!!"
        }, 
        {
            "index": 68, 
            "rating": "5", 
            "review": "Buffet brunch is amazing. We went for the buffet brunch as well as to enjoy the racing. Never been to a horse racing event before and was pleasantly surprised. The food was great and you could eat and drink all you wanted. Including lobster, oysters, crab and a myriad other choices. When you enter you get a free race card to see if you can predict the winners etc, no betting but this does allow you to win money if you forecast the right results. It makes the day more fun and good for the family too. They have supervised kids area with games and face painting, live band while you eat and it all adds up to an entertaining day out."
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "Great! Simply Spectacular!. My family and I went to the Meydan Racecourse over two days - the first on the 3rd March and the second on the 5th March. On our first visit we were escorted to the winners enclosures where we were able to see the races for that evening in luxurious setting; dinner served that evening was a five-course meal - the service was very good and the advice gained regarding the horses was useful.On the 5th March we went to the Promanade Parade Section where we learnt more - the atmosphere was fantastic and it was great fun choosing the horse one thought would win! All in all a fantastic two days at the Meydan Racecourse! The area is massive and there is plenty of room for everyone - truly a great attraction."
        }, 
        {
            "index": 70, 
            "rating": "4", 
            "review": "Great facility. Like horse racing should be. A beautiful place. No gambling like in the States though. Great grounds and sights."
        }, 
        {
            "index": 71, 
            "rating": "4", 
            "review": "Amazing place. So this place is quite far out and but you sort of see it rising out and the building looks spectacular. I am not a horse lover so I don't have a natural affinity to this place. The races were in the evening so it was very cool. The place is gigantic so one can really walk anywhere. It was really an elegant night out. There is no gambling here. Having said that when we came it wasn't too crowded so I couldn't really feel the intensity of the competition."
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "A must for a horse lovers. Not being a great fan of horses, we went out both for the stables tour as well as the Championship Races. Meydan is huge and the horses are taken care of in an unimaginable manner. No smell, super clean, you know who is the star there. For any horse lover a must visit attraction in Dubai. And the races are for free."
        }, 
        {
            "index": 73, 
            "rating": "4", 
            "review": "Great evening out!. We went to a Thursday evening meeting, we went in the public area - free to get in. At the gate you are given 2 cards; 1 is like a raffle ticket - you put your name and phone number and the winner gets a cash prize, the 2nd is a free betting slip to select 6 winners, again cash prizes for successful punters! A local guy helped us fill in our cards, it was great fun! We could get down to the paddock and next to the track, so great view of the racing. We were thrilled to see the famous American superstar California Chrome having a prep run before the World Cup later in March - of course he won, he got a huge cheer!"
        }, 
        {
            "index": 74, 
            "rating": "4", 
            "review": "Fantastic racecourse . We booked the Winners Parade restaurant and the views are great. You can see the horses in the parade ring and most of course. The large screens can easily be seen. We went twice and the service was better the first time than the second. However, the food was very good and the staff were very pleasant. The only negatives were the air con was too high and it got very cold inside, the second problem to watch out for is the pillars. The two times they tried to put us behind pillars, but they did respond to my wife's complaints and found better tables. The only other thing to be aware of is the glass panels above the first tier can block your vision, so ask for a table on the lower tier. The dinner ticket does allow you to go to the parade ring also and if you ask the waiter will show you the way."
        }, 
        {
            "index": 75, 
            "rating": "5", 
            "review": "Superb again.....Silks. This is the 4th time over the last 3 years we have been racing and spent the evening in Silks. There is a wide selection of food at the buffet and the drinks are free flowing. The staff are great and our waiter for the evening was outstanding, Prasanna was always on hand to top up drinks , clear the plates etc , he goes about his work with a cheery attitude and smile , which can only enhance your evening . The racing was great too."
        }, 
        {
            "index": 76, 
            "rating": "5", 
            "review": "Highlight of our trip. We went to the first night of the Dubai World Cup Carnival. We chose one of the dining packages so had a wonderful view of the horse arena and winning post. Our meal was delicious and the service outstanding. We had a wonderful night and loved the whole atmosphere (even though we found the no gambling very odd) definitely worth a visiting."
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "Beautiful track. Came here not knowing what to expect, We were fortunate enough to be in a luxury box with friends. The views were outstanding and food amazing, This was a fantastic night out. The excitement and quality of track and stadium incredible."
        }, 
        {
            "index": 78, 
            "rating": "5", 
            "review": "An evening at the races. This is an amazing racecourse, very similar in design to the new Ascot grandstand. Extremely good for viewing with the large screens watching the racing.(no need to take binoculars). Would recommend the premium enclosure(approx £10) where you have your own seat with an at seat service for food and alcohol(or you can fetch your own). Very colourful race cards are provided free of charge together with pool betting(similar to tote jackpot) for which the pot is provided by the racecourse authorities"
        }, 
        {
            "index": 79, 
            "rating": "5", 
            "review": "Great night's racing. We made a return visit to Meydan for the Dubai Carnival races and booked a table at the Winner's Circle restaurant. Food was high quality and plentiful and there were unlimited alcoholic drinks available. Great views of the racecourse and the parade ring."
        }, 
        {
            "index": 80, 
            "rating": "5", 
            "review": "Silks restaurant package. We have visited many racecourses in the UK and other parts of the world - this is the best.Food is superb and service even better.Free WiFi so if prepared in advance you can place your bets during the evening if you need to. Did mine in advance so could fully enjoy the evening.Take a taxi to and from the racecourse - not expensive from the Dubai Mall or Business Bay (Best) Metro -30DM £6 Each way.Even saw the might Crome win - good luck for Gold cup night !Hope to visit again soon"
        }, 
        {
            "index": 81, 
            "rating": "4", 
            "review": "Amazing...and a bit strange. I love the races so really wanted to see what it was like in Dubai. Facilities, horses ,jockeys all top class. Very reasonable to get in - there is a free area but only 50 dhs to get in the premier enclosure by the finishing line. I went on a Thursday night and it was quite quiet and lacked a bit of 'buzz'. No betting but there was a pick 6 type game with prizes . Staff at the course were very attentive and helpful. Alcohol is served in the premier enclosure but expensive 45dhs for a beer. A good evening out !"
        }, 
        {
            "index": 82, 
            "rating": "5", 
            "review": "Beautiful Experience. Each visit is a beautiful experience..Great staff! Well managed service!!And great dining menus!!Visited the World Cup Carnival races last weekend and was a great experience.Looking forward to the World Cup Races"
        }, 
        {
            "index": 83, 
            "rating": "4", 
            "review": "Great Brunch Buffet. Went for brunch with the girls here. I don't like horse racing particularly but there are no jumps here so I made an exception. The choice of food at the buffet was huge. The service was very very good and the place was full to the rafters. There is a play area for children with a ball pond and face painting keeping them amused while their parents enjoyed their day. No gambling allowed naturally but you do receive a race guide and it's fun to pick out your winners. I'm not sure if you would have access to an online account with a betting site. Car park is quite sprawling and I found the signage confusing. That's a small downside to a great day."
        }, 
        {
            "index": 84, 
            "rating": "4", 
            "review": "Nice Day Out. The facilities are all good and the grandstand itself is very smart and luxurious in parts. The race meets are well organised and there are a decent selection of options for meals and packages. The racing can be clearly seen on the screens but the track is well positioned so that most of the races can be seen from the stands anyway. Would go again"
        }, 
        {
            "index": 85, 
            "rating": "5", 
            "review": "Thursday evening race evening. What a fantastic set up and location. No betting. Dubai love their facing and they do it in style. It is a great evening out. Plenty of places to eat and drink."
        }, 
        {
            "index": 86, 
            "rating": "4", 
            "review": "Good night out. Free entry on the night we visited. Great for families, loads of people there with kids, eating picnics, running around etc. Fab atmosphere and an amazing racecourse. Nothing like it in the UK."
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "Superb nights racing . This was god second time that we visited Meydan. We booked a table in the winners circle which was a four course meal with drinks package. The food was lovely, the view from our table was fantastic and the whole evening was amazing... We even had 3 winners!!The facility is the best racecourse I have ever been to and is a must for race goers. The photo is the view from our table"
        }, 
        {
            "index": 88, 
            "rating": "4", 
            "review": "Interesting night at the races. We spent an evening here enjoying the races - sadly no winners for me but enjoyable all the same. Very strange without all the bookies taking bets but racing was still well attended by young and old. As expected the race track and the stands were immaculate. The stands are very grand and you could easily get lost. Food and wine was reasonable and it was great to see all the different cultures enjoying watching the races. Worth a night time visit given it's reasonable entry fee."
        }, 
        {
            "index": 89, 
            "rating": "5", 
            "review": "International Sporting heritage in the UAE. If you want to see magnificent horses of international and Arabian descent this is the place to go for world class racing. Beautiful hippodrome and pageantry. The Emirati and its large ex-pat community together attend events here and the love of horses is evident as the love of these thrilling races.A fun early morning stop on your visit to Dubai."
        }, 
        {
            "index": 90, 
            "rating": "4", 
            "review": "Great experience. Try the brunch at The Terrace overlooking the race course. It's a great way to enjoy an entertaining day out!"
        }, 
        {
            "index": 91, 
            "rating": "5", 
            "review": "Fantastic evening at Silks, recommended. Fantastic evening at Silks Restaurant here. My 2nd time coming but this time with family. Drinks were never empty, food was excellent, racing was well explained even for novices.\nWill definitely be back"
        }, 
        {
            "index": 92, 
            "rating": "4", 
            "review": "Hotel was excellent. Great hotel, excellent service and ideal for a night stay. We had a great view of the racecourse and breakfast was excellent. Recommended for couples, families and even oldies :)"
        }, 
        {
            "index": 93, 
            "rating": "5", 
            "review": "Lovely racecourse in Dubai. This is a lovely racecourse. We want there for the Friday Brunch. An amazing array of foods from all over the world. Sitting overlooking the racecourse it was a great day out. I would love to go to the actual races there. Camels, horses etc"
        }, 
        {
            "index": 94, 
            "rating": "3", 
            "review": "Southwell By The Sand. Almost impossible to get to by public transport and even worse getting back. It might be free to enter but everything else is expensive. In reality, a lot of the horses did not appear to be that classy - There are a few British exports who used to be good but are now past it and certainly won't be going to stud. The \"breakfast and stable visit\" had all the signs of being a massive rip-off. $150 or so for a buffet breakfast and a tour of the track's expensive restaurants, some stables and the weighing room. At Epsom this used to be $5 and you'd get a certificate to show that you had weighed in (at a completely fictional weight)"
        }, 
        {
            "index": 95, 
            "rating": "5", 
            "review": "Awesome . We visited Nad al Sheba 7 years ago while Meydan was being built. It was a terrific racing experience then but tonight at Meydan was in a different class again. The race course is just awesome. As avid race goers in the UK we've been to most tracks, including Royal Ascot and Epsom Derby many times. Meydan is something special again, even on a modest weekly race night."
        }, 
        {
            "index": 96, 
            "rating": "5", 
            "review": "A wonderful evening with amazing hospitality.. We pre booked our evening at the races prior to flying out for our holiday in Dubai very easily on the Meydan website.We booked in the Winners circle restaurant for an inclusive package of food and drink.First race was at 7pm and drinks were served from 6.30pm Word of warning a 20 min taxi ride at this time of night takes over an hour so we were a little bit rushed but our fault!Shown to our table excellent view wall to ceiling glass over the winners circle (obviously!!) and the winning post you cannot fail to be impressed the champagne arrived and then we relaxed and started to enjoy the evening. We were served by a young man named 'Robin' from India who was studying hospitality and doing his placement at the Meydan Winners circle Restaurant, he was an amazing young man who will go far in his chosen career I hope they recognise this at the Meydan and give him a job!!The food choice, wine and drinks package was of a very high standard and for anybody that likes the races this is an experience not to be missed.The icing on the cake was seeing Sheikh Mohammed Bin Rashid and his entourage (there was plenty of them) enjoying the races and the horses from the Godolphin stables.We loved Dubai and this was our favourite evening out, if you get the chance you wont be disappointed."
        }, 
        {
            "index": 97, 
            "rating": "4", 
            "review": "Exciting Place. great place for watching exciting horse races during the 20th anniversay celebration of the Dubai Worl Cup"
        }, 
        {
            "index": 98, 
            "rating": "5", 
            "review": "amazing. For once the racing was on during our trip to Dubai so we decided to go. We went to the Silks restaurant which offered a buffet meal and a balcony overlooking the winning straight. The staff were very attentive without being obtrusive and the food was lovely. Great experience, really enjoyed it.Would advise getting a taxi to it, took us approx 30 minutes from Dubai Marina and cost approx 75 to 80 AED."
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "Great Nights Racing. Had a great nights racing, well worth a visit. We entered the general admission area which was free, you also get free betting on six races with good prize money if you're fortunate to pick the winners."
        }, 
        {
            "index": 100, 
            "rating": "5", 
            "review": "New Attractions planned near Meydan. There is a whole new attraction venue planned near / next to Meydan. There should be a whole new 3D / 4D type of venue place in the making in the next few years that shall include light shows, fashion shows, sports events and be the trend setting venue place in the whole Middle East. Discussions are under way. Watch this spot."
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "Great . What a fabulous racecourse!\nI can see why the industry loves to race at Meydan and the polo exhibitions are first class.\nGreat facilities. Everything feels luxurious and splendid\nHard not to feel the vip service here.\nSuperb Dubai!"
        }, 
        {
            "index": 102, 
            "rating": "5", 
            "review": "Beautiful Racecourse. We did the winners circle restaurant with set menu and drinks. Service and food were great. Our hotel booked the tickets for us and it was really easy to pick them up at the track. However, if you want to gamble you have to do it with your own group as there is no tote or bookmakers."
        }, 
        {
            "index": 103, 
            "rating": "5", 
            "review": "Unbelivevable site. Fantastic evening of racing. We had a meal in the Grandstand which was great, it included drinks in the price. Views from the grandstand are fantastic. Strange to go racing and not bet, but still a great memory."
        }, 
        {
            "index": 104, 
            "rating": "5", 
            "review": "Supeb Race course. Famus place for world racers. Once a year here we have Special meydan race events too. All arround the peoples coming thee"
        }, 
        {
            "index": 105, 
            "rating": "4", 
            "review": "love horses? love a bit of betting? love drinks and networking?. Then this is the spot for you, your friends and then some. Lots of entertainment through out the day and night! Got to try out Club WHITE"
        }, 
        {
            "index": 106, 
            "rating": "4", 
            "review": "A must visit for race goers. My daughter and I had a wonderful visit to this fabulous race course, The Winner's Circle Restaurant was very comfortable, food delicious,all staff couldn't be more attentive and helpful, the view, parade ring,winner's enclosure and TV screens made this a truly memorable visit.So why only the 4 rating?We have the best Stall Handlers in the World, and this visit confirmedthis for me."
        }, 
        {
            "index": 107, 
            "rating": "5", 
            "review": "Must be visited in Dubai. I had visited Meydan at the openning of annual horse races, we were there with big team of freand and we really liked it. Good view from the restaurant, food is very good. Service is not perfect, but it is a small thing comparing to beautiful horses you may see thtough the windows."
        }, 
        {
            "index": 108, 
            "rating": "5", 
            "review": "class. We decided to take the early morning stable tour starting with breakfast at Meydan Hotel a delightful experience. Then on to stable tour with an experienced guide and driver. What a nice time met the farrier saw the horses being shod & were given a horseshoe each. Watched horses on gallops & exercising in hydro pool. we were allowed to visit jockeys room, some place. On to winners circle then shop and told about various resturants and hospitality deals. A super visit"
        }, 
        {
            "index": 109, 
            "rating": "4", 
            "review": "A nice change. We went to Winners Circle with a group of friends and really enjoyed it. The 4 course meal was great quality fine dining and the drinks kept flowing from the attentive staff.It's good to try it, I'd recommend it."
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "The place to go BEFORE the World Cup Carnival.. By visiting Meydan on Thursday evening BEFORE the World Cup, you can enjoy a delicious meal and a 7 race card for the cost of a brunch an without all the hassle of too many other racegoers! 5 course dinner with selected drinks is a real bargain and a fabulous night with quality food and great service in Tiers restaurant. Back again for our 4th consecutive visit this week!"
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "World cup!. Dubai world cup is one of the finest nights in Dubai you should make it a \"must do\". Amazing food, awesome entertainment."
        }, 
        {
            "index": 112, 
            "rating": "5", 
            "review": "A Night to Remember. I am not a normal visitor to any Racecourse but the facilities at Meydan have to be seen to be believed. They are outstanding."
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "Great Day. Being horse racing lovers we had to visit Meydan for New Year Racing - we booked the Winners Circle restaurant and it certainly was a treat - would highly recommend it"
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "Racing Dubai. I have been racing at Meydan a number of times and have, most often, eaten in Silks restaurant which is buffet style and caters for the whole family.If you are going and are interested in the racing make sure when you book that you get a table with a window view so that you can eat and watch the racing."
        }, 
        {
            "index": 115, 
            "rating": "5", 
            "review": "Relaxing evening at the races. We bought the Premium Seating at 50 Dh per person, which gives a lot more space but the Grandstand seating is also a lot of fun and interesting. One key to remember, arrive to the races at least one hour before the first race so that you have time to participate in the various race picking, gambling is illegal so you need to participate in a full contest and prizes awarded on that basis. Otherwise get on some off track betting site and bet online....Beautiful course, lots of parking, great facilities, very relaxing, have fun!"
        }, 
        {
            "index": 116, 
            "rating": "5", 
            "review": "delightful evening. Meydan was a great night out. We were expecting crowds like you see on TV, but we felt like we had the place to ourselves.Tickets for “The Premium” were 50 Dirham, and allow you to go up really close to the parade ring and near the rail by the finish line. There’s a free section as well, which looked like a lot of fun (but is not by the finish line). Beer and wine is not available in the free section, but is for sale in the other sections.The best part was the atmosphere. Although it looks all glitzy, it’s really friendly, like a small-town racetrack. For example, when a young girl asked one of the winning jockeys for a souvenir, he smiled and tossed her his goggles.Also, are great views of the Dubai skyline from the desert side.Would totally recommend this for both visitors and residents."
        }, 
        {
            "index": 117, 
            "rating": "3", 
            "review": "Race day at winners circle restaurant. To start with the good... the food was good quality and somewhat innovative so well done to the chefs other than the selection of cheeses for the dessert option. It was a shame the waiting staff let you down, service abymissmally slow from the drinks waiters and food waiters (maybe) the level of English understanding of the waiting staff which was well below par for such a venue was a contributing factor, but the maitre'd was not organising and directing staff efficently. We were one of many tables complaining (and to be frank I don't complain unless it is REALLY bad). The reason it gets an average was saved by the quality of the food otherwise maybe NO stars"
        }, 
        {
            "index": 118, 
            "rating": "5", 
            "review": "Dubai Racecourse - Wow. Amazing, we took a tour through our hotel, it was an early start 7.30am arranged our own transport, taxi to the hotel, had a fab breakfast and watched the horses training with the sun coming up. at 8.15 we were taken to the stables where we saw the horses being bathed, trained, on the treadmill, swimming pools, went back to the hotel and were shown around the suites where you can pay to watch the racing and all the different packages were explained to us, if we were to go to Dubai again to watch a race, the next one now is March the huge race. Saw the jockey room, fitness room, shown Frankie Datoris saddles - it was a fab morning out, finished at 11.45. defo recommend and would do again."
        }, 
        {
            "index": 119, 
            "rating": "5", 
            "review": "the best place to catch a race. meydan racecourse is still the place to go for a camel race..packed on weekends its also a good place to meet other high society socialites"
        }, 
        {
            "index": 120, 
            "rating": "4", 
            "review": "True horseman experience. Magnificent state of the art race track impeccably designed and maintained. Manicured grounds and beautifully landscape for spectacular racing.mno betting allowed so the purist racing enthusiastic fans will enjoy it the most as well as conissorers of beauty and architecture landscape."
        }, 
        {
            "index": 121, 
            "rating": "4", 
            "review": "Breakfast and Stable Tour. Breakfast at the hotel overlooking the race course was superb and the tour of stables and other facilities excellent. Our guide was excellent, but the management had made him into a walking billboard by introducing each restaurant and bar as we went round."
        }, 
        {
            "index": 122, 
            "rating": "5", 
            "review": "Meyadn Stable Tour: Behind the Scenes at the Races. Far more than expected, this is a great way to spend a morning in Dubai. The breakfast buffet at the Meydan Hotel was a sumptuous beginning, followed by an extended and informative tour of the stables and grandstand. The guide has been in horse racing most of his life and in the UAE since the early 90s, a veritable walking history book of Dubai racing and breeding. While in the stables guests can interact with horses, in addition to seeing them fed, washed, shod, run, and taken for a swim. The grandstand tour started to get a bit tedious as it was obviously part marketing, selling box and restaurant reservations. Otherwise, great value for money. Go do it."
        }, 
        {
            "index": 123, 
            "rating": "5", 
            "review": "Saw a long time ago..was quite nice. I plan on going back next time I visit Dubai. Great to see how the racing industry is in other countries ."
        }, 
        {
            "index": 124, 
            "rating": "5", 
            "review": "world class racecourse....... I visited the racecourse with my friends....Before reaching the spot,it was a thrilling excitment for all of us. Whatever is constructed in Dubai ,that would be world class which is usually the policy I believe.We parked our car outide the stadium. There is 5 star hotel attached in the Racecourse stadium.Wow......We watched the race from the top of the 5 star hotel. Fantastic The race track was very beautifully formed with lush green grass. It was a treat to our eyes.I strongly recommend this place to be visited in Duabi. Congratulations to the Dubai Government for having constructed a marvellous race course......"
        }, 
        {
            "index": 125, 
            "rating": "5", 
            "review": "Another world of beauty!!!!. All the arrangements make the place amazing! You walk in - you are greeted, escorted, accommodated... what else you need? ... Horse races? ... They are just amazing ... I had a premium ticket cost 50 AED, if you are interested in the races then it is for you as the other options are more focused on food and beverages. The atmosphere is very nice feels like the atrium is alive... Dont miss the next races guys! A glass of beer, cool weather(take some jackets its cold in winter) and new friends..."
        }, 
        {
            "index": 126, 
            "rating": "5", 
            "review": "What a view from Meydan Hotel. A very well kept racecourse, offers a great view from Meydan Hotel. Lush green tracks, the racecourse has maintenance teams working every morning. The riders emerge early morning to train. Overall the racecourse looks scenic."
        }, 
        {
            "index": 127, 
            "rating": "5", 
            "review": "Wonderful experience. Booked a corporate suite for fourteen of us, very reasonably priced for four hours of fabulous food and drink in your suite with adjoining viewing balcony to watch the horse racing. This is a great night out!."
        }, 
        {
            "index": 128, 
            "rating": "4", 
            "review": "Went for Brunch with friends. Weird location given that there was nothing going on apart from the luch, but selection of food, like at most brunches in Dubai, was fantastic.Kids well looked after and plenty of drinks to wash it all down with.May choose somewhere else next time though as it is a little isolated and a bit far from downtown."
        }, 
        {
            "index": 129, 
            "rating": "5", 
            "review": "Evening at the races. Book an evening for the first race night of the season book table in the winner'scorch restaurant it was waiters service the four course meal was excellent and endless drinks good view of the races looking over the finish line did not have to more from our table we had a good view of ever thing"
        }, 
        {
            "index": 130, 
            "rating": "5", 
            "review": "Impressive. Hug place , you will feel it only when you attending white sensation festival which hosting there every year in October Don't miss next year"
        }, 
        {
            "index": 131, 
            "rating": "5", 
            "review": "Great Night Out. We went racing to Meydan with friends who live in Dubai for an evening meeting in December also booking to also have dinner in the Winner's Circle restaurant.The views from our table, looking out across the final straight towards the winning post, was excellent - they also have several huge screen directly in front of you for when the horses are on the other side of the course. Its was a large restaurant but all the tables are banked so that no matter where you sit the views are completely unimpeded. You pay a fixed price for four courses but you could choose your starters and main courses and the price also includes all drinks (which included spirits and several choices of white, red & rose wine).In my experience, when catering for large numbers the food tends not to be the best but I was happily proved wrong as our meal was excellent and served very hot.Your ticket also allows you to wander down to the parade ring and access most of the outdoor areas and its well worthwhile popping down to soak up the atmosphere for at least one race as well as to take in the sheer size of the grandstand which is just huge.We saw six races and whilst it's slightly odd (for us anyway !) that you are unable to gamble we had a fantastic evening and hope to return one day."
        }, 
        {
            "index": 132, 
            "rating": "4", 
            "review": "Meydan Stable Tour. Offered by the Meydan hotel, this tour gives you the chance for a 'behind the scenes' glimpse of the stables and the racecourse facilities. This is a must for anyone who loves horses and/or racing.The morning starts early at 7.30 for breakfast in the Meydan Hotel, was somewhat disappointed with the standard of food here, not what I would expect for a 5 star hotel.After that, its onwards to the stables to meet the beautiful horses and to see a bit of their morning routine. You can get up close to the horses for a pet which is wonderful. It would have been nice, however, to learn a bit more about them, which bloodlines they come from, their race history etc. I would say, more time should have been spent in this part to learn all of this.After that, you get taken to the racecourse and you can go onto the turf and visit the jockey's room and see the facilities there. You also get shown the restaurants and facilities indoor for if you were to visit a race (perhaps a little too much time spent doing this part).All in all a thoroughly enjoyable visit, more information on the horses (as well as time spent) from the tour guide would have been nice."
        }, 
        {
            "index": 133, 
            "rating": "4", 
            "review": "World Class Racing. We went for the Dubai World Cup in March, what a day. Superb racing in superb surroundings. Had gallery tickets which included food and drink. He night ended with kylie minogue on stage. What a day !"
        }, 
        {
            "index": 134, 
            "rating": "4", 
            "review": "Hospitality night. A really great value for money evening which would cost you 5 Times this amount at Ascot.Great views over the course with very attentive staff. Although they are a bit green early in the season. Perhaps need a few more run outs?If you are in a group of 4 or more it is fine, but if only 2 or 3 of you, you can hear the next tables easily and listening to expat bores, is not really my idea of entertainment....Even if you are not a racing fan , it is good fun.I would recommend that you pre book your return taxi though as that can be a hassle at the end of a good evening.Very good food for a corporate type environment."
        }, 
        {
            "index": 135, 
            "rating": "5", 
            "review": "Amazing racecourse, great facilities for the horses and humans!!. Views from the Meydan Hotel balcony are spectacular, the racecourse is just superb. the horses have every amenity. If you are lucky enough to have a view from the sky bubble you will be rewarded when you watch a race"
        }, 
        {
            "index": 136, 
            "rating": "5", 
            "review": "Must visit for the Dubai World Cup. I attended the Dubai World Cup 2015 and it was a superb experience. It was my first time visiting this racetrack and it is a solid piece of artwork...very well designed and constructed. Service at Meydan is top notch like at most places in Dubai. The atmosphere was surreal and fun...I definitely recommend ppl check this place out for weekly races during race season or for the biggest event, the Dubai World Cup :)"
        }, 
        {
            "index": 137, 
            "rating": "3", 
            "review": "Dissappointing . After an amazing experience last season we were very disappointed when we visited as a group for the first race meet of the season.The venue remains stunning however the service at the Winners Circle last evening was not what we expected.We booked three tables for the 4 course meal and drinks offer expecting a repeat of the fantastic experience we had had as a smaller group last year. Arriving promptly at 6.30 as requested we filled in our race cards and asked for them to be collected. When someone finally collected them we were told it was too late. Our starters were not served until 8.45 and then our mains arrived after the final race. Then staff obviously in a hurry to clear us out served desert while mains still on the table.Having paid 475aed each for this experience we were all dissapointed with how our meals were served.Having recommended this venue to the others I was embarrassed. Such a shame."
        }, 
        {
            "index": 138, 
            "rating": "5", 
            "review": "Great Venue . Went here for an event 30 thousands people partying and drinking Dubai is a good night out. Also a great view from the hotel."
        }, 
        {
            "index": 139, 
            "rating": "5", 
            "review": "Amazing race course and fabulous tour.. Booked a tour at the course as my daughters have a big interest in horses and I must say we were all thoroughly impressed with the course, the stables, the informative tour and the great breakfast in the Meydan hotel.We were met by our guide Mark who looked after us all morning, Mark gave us so much information and delivered with an obvious passion, the stables and horses within were immaculate and the actual course stands were something else, the behind the scenes stuff was fab too. all in all this is a wonderful tour and not just for enthusiasts of racing or horses, all my family found it most interesting and fun. I would have no hesitation in recommending this tour, great value for money too. Hats off to Mark who looked after us, a thoroughly nice chap..."
        }, 
        {
            "index": 140, 
            "rating": "5", 
            "review": "Bigger and Better than Pune of India. I have never seen a race course like this in India. Three parellar ways to horse racing. Do visit on Friday for race."
        }, 
        {
            "index": 141, 
            "rating": "5", 
            "review": "Lovely Views. We booked a hospitality dinner & drinks for a special occasion & could not fault anything, food & drinks very good & service was excellent, lovely setting with views over racecourse"
        }, 
        {
            "index": 142, 
            "rating": "5", 
            "review": "Experience. Amazing place to go to visit,even if there is no racing on it is well worth the effort to see..there are fantastic restaurant's at the track beautiful .setting.."
        }, 
        {
            "index": 143, 
            "rating": "5", 
            "review": "Fun in the sun. Had the opportunity to go to the world cup here in Dubai, and it was a very good race day however just remember you can not place a bet at the race course. it was very expensive to get in about £80 however it is Dubai. the drink and food was very good inside and the atmosphere unreal,"
        }, 
        {
            "index": 144, 
            "rating": "5", 
            "review": "See The Dubai World Cup at Meydan Racecourse.. We visit Meydan for The Dubai World Cup Horse Racing. An excellent venue to enjoy the races! Something for everyone from Hospitality to basic Apron viewing."
        }, 
        {
            "index": 145, 
            "rating": "5", 
            "review": "At the Dubai World Cup. Amazing race course, hosts world's richest horse race.Very lively, well-dressed crowd. Wide variety of refreshments."
        }, 
        {
            "index": 146, 
            "rating": "5", 
            "review": "Nice racecourse. nice racecourse, we have seen it when it was prepped for the upcoming races. It looks really good and big."
        }, 
        {
            "index": 147, 
            "rating": "5", 
            "review": "Must visit place. I have gone there many times and the Meydan hotel has some amazing and best restaurants wit the amazing backdrop of race course, a must go place"
        }, 
        {
            "index": 148, 
            "rating": "5", 
            "review": "Spectacular world cup. Have been to Meydan several times now for the Dubai World Cup. The venue is spectacular and the race day s buzzing and full of fantastic atmosphere. Try it."
        }, 
        {
            "index": 149, 
            "rating": "4", 
            "review": "First class dining and entertainment. This sporting attraction is typical for Dubai. Food and restaurants are very good at all levels. Children are welcome and the food selection caters for all tastes. Various beverage options are available. Excellent service."
        }, 
        {
            "index": 150, 
            "rating": "5", 
            "review": "5 Star horse racing course. Its an amazing place to visit during Dubai Racing season. You can also visit it in the morning and see the horses in training. Its a massive green space, and unique architecture. seeing it from far away will never convince you that this is a racing track."
        }, 
        {
            "index": 151, 
            "rating": "5", 
            "review": "Amazing place, especially for Horse lovers. I go every Thursday, always looking forward to be there , ready for the races. The racecourse is majestic."
        }, 
        {
            "index": 152, 
            "rating": "5", 
            "review": "Superb horse racing course but without the official betting. Meydan is the home of the Dubai World Cup, the richest racing meeting in the world hosting some 70k audience in a big Ascot style with pomp and circumstance and high totty factor. Race season normally starts end Oct / beginning of Nov where I would recommend going for good value of money entertainment to either the buffet style hospitality open for all or the table service Tiered Restaurant for set menu. Go with a big group so that you can do your own self-arranged betting as normal betting is not allowed in UAE (and also blocked over internet)."
        }, 
        {
            "index": 153, 
            "rating": "5", 
            "review": "Fun and unusual experience. We visited the race course with friends for one of the most prestigious horseraces and been lucky to stay in one of the sponsors lounges. Wow what an amazing experience it had been joining such event for the very first time. I highly recommend to it to everyone who seeks to experience something new. Great organization, clean facilities, fantastic atmosphere...stayed the whole day. Also went back to Meydan for a life concert of Lady Gaga. Again great organization, spacious and superb music environment. Just make sure you remember well were you had parked your car...endless parking decks."
        }, 
        {
            "index": 154, 
            "rating": "5", 
            "review": "amazing dubai. Amazing experience good to go with lots of old friend in Dubai.best experience I have ever had.thanks Kim for letting us know."
        }, 
        {
            "index": 155, 
            "rating": "5", 
            "review": "Great day for the races... Exciting place to be, and to watch the races. I used to go race tracks in the USA, and enjoy an afternoon of races. This place is nicer and newer, with great ambiance. I highly recommend it, especially on a nice Friday afternoon."
        }, 
        {
            "index": 156, 
            "rating": "4", 
            "review": "Meydan Racecourse. You have to check out a race while in Dubai. This racetrack is so grand and a must see. During the off season it's very quiet but if you are with a good group of friends it will be a fun night."
        }, 
        {
            "index": 157, 
            "rating": "5", 
            "review": "This is how you do horse racing. Make sure you plan ahead and that there's an event or race taking place before you set off on your visit."
        }, 
        {
            "index": 158, 
            "rating": "4", 
            "review": "External visit no race . Our friends live right by here and took us to give us an idea of its sheer size.They've invited us to come back next year and take part in the Dubai gold cup. I'm very tempted. You can just tell it must be the racing event of the year and the dress code would be dress to impress.It's clean, modern and very lush. I think we will be definitely back!"
        }, 
        {
            "index": 159, 
            "rating": "4", 
            "review": "World Cup Review - a bit late !. Went to the World Cup meeting earlier this year - one of the 'must do' events on the Dubai Calendar. We had an all inclusive package near the finish line.The whole day was very good - just a shame that the big screen by the finish line was not used to show the Kylie concert after the racing as this would have made the experience better. The food, drinks and atmosphere were all excellent."
        }, 
        {
            "index": 160, 
            "rating": "5", 
            "review": "Another thing to do while in Dubai. Apart from the World Cup, there are smaller horse races between Nov-Mar. Great social activity to do if you are in Dubai - dress up, have a bubbly, watch the race, talk to people. Good fun!"
        }, 
        {
            "index": 161, 
            "rating": "5", 
            "review": "class apart. a place of sports and sophistication ! its a v classy place for a bright sunday! u can bet and play and enjoy dubai"
        }, 
        {
            "index": 162, 
            "rating": "5", 
            "review": "Fabulous Dubai Worl Cup, best horse racing in the work in the best venue by far.. Visited this venue for the Dubai World Cup, it's wonderful. Buy the best tickets that you can afford, we had premium (by the finish line) they were amazing, you can see everything you need to see and more, plus free food and drink ALL day! Preferable than a hospitality view which is a little disconnected to the racing I feel. Book you return car journey!!!"
        }, 
        {
            "index": 163, 
            "rating": "5", 
            "review": "A Tourist Must during the Race Season. Race Nights in the Warm Evenings of Dubai are a great way to enjoy one of the best Race Scenes in the World. Even the lead up races for the Dubai World Cup are entertaining and a great way to spend an evening with friends."
        }, 
        {
            "index": 164, 
            "rating": "4", 
            "review": "Dubai World Cup. Enjoyed a fun filled day at the races watching the Dubai world cup, and then entertained by 'Kylie' for the aftershow party.Yes its expensive, but everything is Dubai is!"
        }, 
        {
            "index": 165, 
            "rating": "5", 
            "review": "Collections of Horse Through bred.. The richest World Cup is Dubai World Cup for Horse Racing.. the passionate of Horse lovers can be visit this place Meydan, connected with HIFI five Star Hotel Meydan Hotel. Early morning people can reach and visit the stable house, horse training, practice and etc.. The Race happens on last week of all the time but you can can book and check the availability by calling Dubai Equestrian Club."
        }, 
        {
            "index": 166, 
            "rating": "5", 
            "review": "the most expensive horse race course in the world. if you have any interest in horses or horse racing you have to see this. the worlds biggest most expensive mostest mostest (it is Dubai after all) race course."
        }, 
        {
            "index": 167, 
            "rating": "5", 
            "review": "Tre chic!. If love horse you can't miss this place..An amazing hotel, very elegant... Good food..wonderful people...If you like to smoke shisha you can do it here..Someone will take care of you helpung to chiose the taste and then you only have to wait fir an amazing horse race!Indulge @ Meydan!"
        }, 
        {
            "index": 168, 
            "rating": "4", 
            "review": "far out. This has been built far out in the desert with a special beautifully made road leading upto it. It has the Meydan Hotel attached for best views & also a Tennis Centre.However it would be difficult to access if you didn't have your own transport since public transport to this area doesn't seem to exist"
        }, 
        {
            "index": 169, 
            "rating": "5", 
            "review": "No Races - Just golf & the bar.. Went to golf at night. Awesome course. Great bar after with Pool, foosball and darts. Large Screens to watch TV and great service."
        }, 
        {
            "index": 170, 
            "rating": "4", 
            "review": "hot air balloon and lanterns. first time we've been here was in november 2011 when they had the hot air balloon and lantern activities... was definitely one of the most amazing scene... hope they could make it an annual activity here in dubai..after the lantern show, we came here during other weekend family activities and we've seen horse parade just once.. ;)"
        }, 
        {
            "index": 171, 
            "rating": "5", 
            "review": "Out of season visit. Stayed at hotel out of season and delighted with the hotel, location and facilities. Can imagine how wonderful the atmosphere is during horse racing season."
        }, 
        {
            "index": 172, 
            "rating": "4", 
            "review": "For the World Cup. So, I went to the World Cup there, so I'm not sure if this counts, as it wasn't a typical experience. But, parking was a nightmare. We had a parking pass given to us by someone in the Royal Family, so it was great parking, but totally impossible to find our car at the end of the night (you'd think it would be easy to spot the x3 in a lot full of Bugattis and Bentleys, but we were so turned around and my feet hurt so much from my shoes that we ended up being two barefoot gals running around the parking lot. Ok, enough about parking. The place is huge and beautiful. Lots of security. Lots of people trying to get into places they aren't allowed haha, we saw several women doing what is equivalent to \"sweet talking their way backstage\", but to security's credit, they held their own. Food was great, we were high up so had a wonderful view. The crowd was strange, many expats who didn't even care where they were, seemed that they didn't even know there was a horserace going on (but who can blame them, those big hats can be distracting)."
        }, 
        {
            "index": 173, 
            "rating": "5", 
            "review": "Dubai Gold Cup. Fantastic upmarket racecourse, no betting though and not many ladies here. Great to have a look around the place and free entry."
        }, 
        {
            "index": 174, 
            "rating": "5", 
            "review": "Bubbly Brunch at the Meydan. A lovely afternoon spent with friends and our 4 children. All in all 6 adults and 8 children. There was a bouncy castle set up,tables and chairs with pencils and paper and a children's Buffett area with options available even for the fussiest little eaters. The children were happy which meant U.S. adults could enjoy our time together. The food was delicious and there was anything you could want in a Buffett. Everything was there. A large desert section and a large bread section. The service was fast and the plates were cleared away very quickly so no build up of dirty plates at the table. The toilets were very clean."
        }, 
        {
            "index": 175, 
            "rating": "4", 
            "review": "A lavish spectacular extravaganza. The Dubai Races at the Meydan are truly extravagant and spectacular. At least once in a lifetime experience. The Races themselves are quite charged and exhilarating. Additionally in the boxes, the food/ drinks are quite lavish and continuous.Added to this the entertainment concludes the evening.Global singers complete the night but usually they come on quite late. SO while you may enjoy the races , by the time the entertainment comes up you are either too exhausted with the excitement or had one too many. But ideal for the young at heart."
        }, 
        {
            "index": 176, 
            "rating": "4", 
            "review": "Well maintained, classy. Very picturesque, green course - an amazing view in the desert. Quite far from the city and the surrounding hotel and infrastructure is a little over the top. Very expensive restaurants. But the viewing galleries and facilities within are world class and worth atleast a visit"
        }, 
        {
            "index": 177, 
            "rating": "4", 
            "review": "Visit to the Dubai World Cup. This venue is a horse racing track and is only worth a visit on race days. If you want to have a flavour of expat Dubai then visit it on World Cup Day. This is the richest race meeting in the world and takes place at the end of March usually around the 28th.If you like crowds and mingling then the lawn areas offer great vibe. Don't arrive to early as after the races there is usually a top entertainer to sing for you into the early hours of the morning.If you prefer a relaxed environment then book a restaurant seat where you can relax with friends and family."
        }, 
        {
            "index": 178, 
            "rating": "4", 
            "review": "A good night out. We went to see a couple of races, apparently you cannot gamble, so that takes the pressure off, and saves your cash. a great experience we got up close to the horses on the track and in the winners ring. lots of eating places and you can get a drink,"
        }, 
        {
            "index": 179, 
            "rating": "4", 
            "review": "Fun afternnoon at the Races.. My husband, my in-laws and I went to the races in the late afternoon, on New Year's Eve, before heading out to a party. We had seats outside, near the presentation area and right at the track. We was a fun few hours watching the races and making our private wagers on who would win in each race. There was also drinks and food available, just inside, with some delicious choices. The downsides:Although you could bring your drinks outside and they would serve you drinks outside, you could not eat outside. So if you wanted to eat, you had to go inside and stay in. They had screens up so you could still watch the race, but it would have been nice to have had the option of eating outside too.When we arrived there was a cue at the main entrance and one of the guards waved us through another entrance. This was great and we quickly went to our seating area which was quite far away from the main entrance. This was a mistake.....Although gambling is not permitted in the UAE, you could make predictions on which horses would win and if your predictions were correct, then you could win money. However, we got all the way to our seating area to find out that you had to pick these prediction forms at the main entrance. They did not have any available with the person you submitted the forms to in our section. We did not realise this (the guards who waved us through never said) and we had no time to go all the way back to the main entrance to get some. This did not detract from the fun time we had, but it was a little annoying as we were looking forward to making our predictions on the races.Anyway, a day at the races is good thing to try. They also have an Ascot type affair there each year, so that would be another fun event to attend at Meydan Racecourse."
        }, 
        {
            "index": 180, 
            "rating": "5", 
            "review": "day at the races. excellent day out at the dubai millions will be back next year,concert after always good this year kylie last year j lo"
        }, 
        {
            "index": 181, 
            "rating": "5", 
            "review": "Amazing Venue, Amazing experience. I recommend this venue for concerts and the races!! Parking at Meydan Racecourse is very convenient too."
        }, 
        {
            "index": 182, 
            "rating": "4", 
            "review": "Night golf in Dubai at Meydan. Flood-lit golf course allows you to play at night in Dubai where the days are often too hot to play during the day time. Fun experience. Don't hit the ball outside the fairway area as the rough is not lighted. Many lost balls."
        }, 
        {
            "index": 183, 
            "rating": "2", 
            "review": "Mayday hotel - like a labyrinth!. I came to the Meydan Hotel for a congress over a few days in May 2015. Man, that hotel's layout is so confusing! Floors suddenly end, elevators take you to some floors but not others (why???), signage is terrible, staff don't know enough English to advise you on where you need to go. Also, there is a lot of construction going on, and the hotel (given it's connected to the racecourse) is pretty much in the middle of nowhere. I have no idea what the rooms and facilities are like (beyond their conference rooms), but if you're travelling to Dubai, I advise you to stay somewhere more centrally located."
        }, 
        {
            "index": 184, 
            "rating": "5", 
            "review": "Quiet Lunch. If your looking for a quiet getaway for lunch in Dubai the Meydan Hotel at the race course has a coffee shop and restaurant on the ground floor and sitting out on the terrace one is overwhelmed with the scale of the building sweeping around the race track and the wonderful expanses of green grass in all directions… Best to go in cooler months so you can enjoy the terrace..the World Cup meetings are also something that needs to be done once in your life…bit hectic at times and very crowded but well worth a visit"
        }, 
        {
            "index": 185, 
            "rating": "5", 
            "review": "Great venue. Tiers restaurant is a great place to enjoy a meal. Overlooks the finish line to watch the horse racing. Excellent value, superb quality of food, service excellent, would definitely recommend"
        }, 
        {
            "index": 186, 
            "rating": "5", 
            "review": "Dubai World Cup. If you want to be part of the biggest horse race in the World, don't miss the DWC. It's fantastic day out with lot's trendy people who like lots of fun and its a chance to put on your Sunday best and impress. The standard of racing is the best in the World and only the super best take the prizes!"
        }, 
        {
            "index": 187, 
            "rating": "5", 
            "review": "Huge Racecourse. A beautiful place to go to in winters.The horse racing is worth a watch with all the Big shots of UAE.This place can be enjoyed froom the restuarants and bars located in the Meydan Hotel"
        }, 
        {
            "index": 188, 
            "rating": "5", 
            "review": "Awesome Property. Amazing experience is the world, a property located little off beat from the center of the town but , a mix of excellent luxury and Dubai Race course, many movies have been shot here"
        }, 
        {
            "index": 189, 
            "rating": "5", 
            "review": "world cup amazing, dinner amazing, breakfast with the stars. went there to have dinner at a balcony in the buffet and had an amazing dinner including variated food from all Asia, Lebanese, Thai, Chinese,etc and also occidental food. Furthermore, also went to this years Dubai Wold Cup and there is nothing left to say, if you have the possibility dont doubt and go! Also assisted to Breakfast with the Stars this year from 6am to 12pm, luxury breakfast full of horse related people, horses training, interviews and amazing food. Cool experience and all of them very different one from the other! Amazing architecture also, and full of luxury in the inside."
        }, 
        {
            "index": 190, 
            "rating": "5", 
            "review": "Super restaurant and atmosphere. We paid for a combined entrance and restaurant ticket, where we had a 3 course meal included. We were quickly sown to our table which had a superb view over the racecourse and finish line. The staff were immaculately dressed and mannered. Nothing was too much trouble for them. The food was amazing and the service was exemplary. From our table we had good views over the paddocks where we could see the horses parading before and after each race. Large TV screens enabled us to see close up how the race was progressing. A wonderful evening was had by our family."
        }, 
        {
            "index": 191, 
            "rating": "5", 
            "review": "Go here for the Dubai world cup!. Go for the world cup.. it' an amazing experience and it's like a free concert at the end with some very good performers over the last few years e.g J LO, kylie minogue. The style is unlike any other race event in the world, but that's partially why I love it. Be as crazy as you want. They wear ball gowns nearly and get away with it!!!"
        }, 
        {
            "index": 192, 
            "rating": "4", 
            "review": "Venue for the World's richest horse race.!. The swankiest most well maintained horse racing course in the region..Is used for rock concerts and big social events as well."
        }, 
        {
            "index": 193, 
            "rating": "4", 
            "review": "Horse racing destination . Its very huge horse racing course..The building is unique and very huge..So busy during the Hourses world cup.."
        }, 
        {
            "index": 194, 
            "rating": "5", 
            "review": "One of the best in the world who love to see horse-races. As I knew the old Meydan Race course very well, I was really curious to find out about the new one. Well, for my opinion it became too big and too show-off. Architecualwise a very interesting interpretation, including the Meydan Hotel. But see yourself...."
        }, 
        {
            "index": 195, 
            "rating": "5", 
            "review": "A great concert venue. Attended the AIBA awards at the Maydan Racecourse. The venue is great and spacious. I would recommend balcony seats as the view is better. The openness of the venue makes it spacious and less claustaphorbic."
        }, 
        {
            "index": 196, 
            "rating": "4", 
            "review": "An experience to be done at least once. As expected the Dubai Gold Cup experience is truly spectacular from the build up to the races through to the fireworks and celebrity guest appearance; this year Kylie Minogue. We really enjoyed ourselves and a great place to people watch but probably the biggest surprise we had not anticipated was quite how boring it would be; I imagine on a second visit you'd struggle to keep enthralled. The racing starts a little later in the afternoon and goes on into the evening, followed by fireworks and music/dancing. One thing we had not considered till we got there, which is stupid really, as we've been to Dubai loads of times, is there is no gambling so no putting on bets for the races. Now having been to major races both in England and Ireland, half of the excitement is running in between races to put some small token bet on the next race then running back to your seats or walking round to look at the horses - we've had great fun with our 8 year old, who always picks the 'prettiest' one with the nicest mane braid. It's just a bit of family fun, not serious and we always walk away a few quid down but that's half the fun and keeps you interested. Here you don't really get up in between races other than refreshments so the afternoon can really drag on a bit with not a lot to look forward to other than people watching (the event oozes wealth!) the fireworks and show at the end. So if you have never done it, by all means it's a once in a lifetime day/evening out, but if you love the atmosphere at the Curragh and racing to see the horses, the jockeys and quickly putting a small bet on then you might be a little disappointed."
        }, 
        {
            "index": 197, 
            "rating": "5", 
            "review": "amazing. I m a little one sided as my friend built this place he was the project manager it truly is a fantastic place to visit and stay the infinity pool on the roof is breathh taking."
        }, 
        {
            "index": 198, 
            "rating": "5", 
            "review": "Aamzing!. Great and remarkable opportunity to have a horse course and training. Possibility to arrange small races and competitions. "
        }, 
        {
            "index": 199, 
            "rating": "5", 
            "review": "Fireworks, Horses, Fun!. Meydan Racecourse is a great place to visit in March. Usually it's the Race Time, so you will be able to see great horse race, enjoy a great day with friends and drinks outside, see one of the best fireworks in the world as well as dance till the early hours and watch the performance of some big star such as Jennifer Lopez, Kylie Minogue. There is someone new every year. Don't forget to book your tickets in advance as well as decide what you gonna wear. Gentlemen usually wear a tux, a black suit and even a top hat, while ladies dress-code is an elegant dress and a piece of art head piece. Attention: The best dressed couple wins a valuable prize, while the best-dressed female with stunning hair-do and a head piece has a chance to win a luxury car, such as Jaguar, for example. Get ready and go for it!:)"
        }, 
        {
            "index": 200, 
            "rating": "5", 
            "review": "Sureal Racing in Wonderland. As a life long horse racing enthusiast I was thrilled at the opportunity to have a VIP pass to this years World Cup Championships. It was made all the special by having friends Eclipse award winning trainer Jeff Bonde and California Chrome along with his trainer Art Sherman there as well.The facility must be seen to be believed. Approximately 11 stories with a hotel and an infinity pool on the top level...breathtaking. The opulent luxuries ooze from every corner. There were 80,000 people, not a single racing form, not a single ticket, no one handicapping or engrossed in trying to figure out their next wager as there was no wagering of any sort. It was like the twilight zone. Even web sites linked to online gambling were blocked. The merciful Sheik simply builds a racing palace, and puts up $30,000,000 in purses while inviting the world's best horses to compete against his best horses with all expenses paid. Bizare. When you venture inside the magnificantly appointed grand stands you are greeted by an open bar, a lavish buffet and a music group playing on a stage near by. They don't even pipe the call of the race inside. The races are more of a carnival than a handicapping challenge to be conquered. In an era of fiscal austerity and closing decaying facilities it was in disbelief that I glanced off to the distance and so the prestine grounds of the former race track, a exact duplicate of Churchhill downs abandoned yet meticulously maintained.Amid the world's tallest building, the world's only 7 star hotel and the ability to ride a camel across a nearby set of dunes, Meydan Racecourse stands out as another must do experience...particularly when they are racing."
        }, 
        {
            "index": 201, 
            "rating": "5", 
            "review": "One for a Winter Night Out. Everyone has heard of the Dubai Gold Cup horse race, but forget all the bling of that day out, an evening at Meydan is a fantastic way to spend a few hours in Dubai doing something different. The entry is very affordable, and once track side you have a seat and a full view of the course. You can get food and drink (including wine and beer) and can even walk up to the track itself to get close to the horses. Highly recommend for an alternative night out during racing season. Note it's casual - jeans and sweaters, boots or flat shoes."
        }, 
        {
            "index": 202, 
            "rating": "3", 
            "review": "A racecourse in the midst. We have never attended this venue to stay yet, or to attend a musical event or horse race. I personally will not contribute my earnings to horse racing. However the grandness of this building, is quite impressive. The inside of the building feels like you stepped into something grand and chic, and the views at night across the course are quite peaceful. There is a stillness out there. The food at the smorgasboard restaurant (sorry cannot remember the name) was okay. Just that, the price was fantastic, and the view was great. The array of options was not vast. This place feels a little bit further out from Dubai. Which is nice sometimes. :)"
        }, 
        {
            "index": 203, 
            "rating": "5", 
            "review": "Dubai Gold Cup. What an amazing racecourse truly fabulous experience. Have been interested in racing for many years & have been to quite a few in the UK with the idea of Meydan on my bucket list & now it's ticked!! The whole afternoon & evening racing was wonderful followed by the best firework display ever then Kylie !! The food & drink outlets were plentiful & reasonably priced a well enjoyed day ....."
        }, 
        {
            "index": 204, 
            "rating": "5", 
            "review": "Fabulous Venue to enjoy with friends and family!. Reserve a booth when going to the horse races. They serve fabulous food and great beverages to you and 50+ friends."
        }, 
        {
            "index": 205, 
            "rating": "5", 
            "review": "Breathtaking Venue. This place is amazing! the building itself is one of the longest in the world, being over 1km Long! This place is huge! I recommend you come to a raceday at Meydan, it will not disappoint!!"
        }, 
        {
            "index": 206, 
            "rating": "4", 
            "review": "Great view of the race course. Huge space for MICE events. Nice view of the race course. Conveniently located. A great place for big events. We had our tradeshow party there and we enjoyed a lot."
        }, 
        {
            "index": 207, 
            "rating": "5", 
            "review": "Dubai World Cup. Loved everything I was there the day before the race and had a look around, on race day it was superb"
        }, 
        {
            "index": 208, 
            "rating": "5", 
            "review": "Lovely. I love it ...amazing ,relaxing ..Ive been with mu hustband and we walk around we staop for a coffe and we did some shopping ! it s wow . Absolutly beautiful.."
        }, 
        {
            "index": 209, 
            "rating": "5", 
            "review": "What a View. Our first experience. Tickets brought by friends - included four course dinner, drinks and of course a fabulous view of the racing. Full table service, friendly and attentive staff. Fun with a group of friends."
        }, 
        {
            "index": 210, 
            "rating": "3", 
            "review": "Rather disappointing. I was excited about our visit to the Meydan as one would expect that it would be as palatial and opulent as the rest of the city.Sadly I have to put in behind the likes of Ascot, Sha Tin in Hong Kong and even Cheltenham’s panoramic restaurant.The staff were find and the food was OK but I was hoping for rather more.."
        }, 
        {
            "index": 211, 
            "rating": "5", 
            "review": "Day out at Dubai world cup. Great day at the races and Kylie Minogue finished it off. Fantastic! Don't worry so much about the dress code that is advertised! The food was fast food style with a few bars. Careful of some of the \"dance moves\", we kept our distance! (Ahem!)"
        }, 
        {
            "index": 212, 
            "rating": "3", 
            "review": "Varage with poor service. We sat outside and were very slow to be served and the food was only average. It was well overpriced for what we got. The view is nice however."
        }, 
        {
            "index": 213, 
            "rating": "4", 
            "review": "A great day out at the races!. Great ambiance, happy people decently priced food and beverages. Quest were a little too long but that's only to be expected at the Dubai World Cup!! We will definitely be visiting again next year."
        }, 
        {
            "index": 214, 
            "rating": "5", 
            "review": "Awesome. I happened to visit races right before world cup... with my friends and sister. It was one of the most amazing and fantastic experience of my life. Before going to race i knew nothing about horses and race. But it was so eady to understand and i enjoyed a lot. Being there felt so royal lol"
        }, 
        {
            "index": 215, 
            "rating": "4", 
            "review": "World cup fun!. Brilliant atmosphere, array of food options in the Apron views area... looking forward to next years event!"
        }, 
        {
            "index": 216, 
            "rating": "5", 
            "review": "Simply Magnificant. You don't have to be a Horse Racing Buff to enjoy the spectacle here - admittedly we came to watch the Dubai world Cup - but the whole splendour & orginisation of this place puts most other racecourse (& sports arenas) to shame - 1 mile ... yes 1 mile of Grandstands - seating for 70,000 spectators - lush green grass & luxurious surroundings - the inside is vast beautiful & spacious - Definitely on the 'to do' list"
        }, 
        {
            "index": 217, 
            "rating": "5", 
            "review": "Dubai World Cup!. Horse racing aficionados, we were delighted with the excitement and glamour of this race day, particularly for the beauty and power of the horses. Veteran people watchers, got a lot of enjoyment at seeing the 'passing show', particularly the wonderful hats worn for the occasion."
        }, 
        {
            "index": 218, 
            "rating": "4", 
            "review": "Great experience. Went to the Dubai World Cup and thoroughly recommend a visit if you are in Dubai. Excellent value, shame you can't have a bet."
        }, 
        {
            "index": 219, 
            "rating": "3", 
            "review": "Horse Racing-World Cup. We went to the World Cup Horse racing event and BEWARE of the type ticket that you purchase for this event. We purchased \"general admission\" which was a significant amount less than the \"Apron View\" ticket. The views were the same, however it was less crowded on the Apron view side and there was significantly more \"Westerners.\" We sat with many \"locals\" and what appeared to be tribes people from all over Africa. We didn't have seating available, the food court was overwhelmingly crowded and overall it wasn't the best experience. The race course was nice to visit if you are planning to watch an event. Definitely take heed, however to your seating."
        }, 
        {
            "index": 220, 
            "rating": "4", 
            "review": "Friday Brunch. Enjoyed the Friday Brunch at Farriers. A massive selection of good quality food, everything from seafood, salad bar, oriental, an outdoor BBQ where food was cooked to order and my favourite part, the cocktail station!!! There was a also a decent live band on which made for a really enjoyable afternoon. Good value!"
        }, 
        {
            "index": 221, 
            "rating": "5", 
            "review": "Great Night. We booked to go to the races while in England and picked up out tickets at the races on the day. We payed 75 quid per person to go into the Silks restaurant, this included superb complimentary food and drinks. Well worth the money whilst in Dubai as the prices of the drinks are very high. The view of the racing from the restaurant balcony was great.Well worth the money and the best night in Dubai."
        }, 
        {
            "index": 222, 
            "rating": "5", 
            "review": "Brilliant venue for the family.. I have a few secrets about this place and I will never share them with anyone :-) see for yourself and revert with a review."
        }, 
        {
            "index": 223, 
            "rating": "5", 
            "review": "Dubai World Cup. Had a fabulous day at the World Cup Races, as with everything in Dubai the facilities are superb. Drinks not overly expensive, good selection of food. We had been worried about the heat - but when the racing started at 4pm the sun had moved behind the stadium.It ended with one of the best firework displays I have seen - and another highlight Kylie Minogue to finish off a perfect day.Transportation after the evening show was brilliant an army of buses free of charge ferried the thousands to different area's of Dubai where numerous taxi's waited, so we hadn't to wait an hour for taxi's from the stadium. So well thought out."
        }, 
        {
            "index": 224, 
            "rating": "5", 
            "review": "Dubai World Cup. Race course and facilities are superb - puts many UK race courses to shame. The World Cup ended with a fantastic fireworks display - nothing like we have ever seen before. Toilets/Catering facilities clean and no lengthy queues."
        }, 
        {
            "index": 225, 
            "rating": "5", 
            "review": "Longest Hotel. This Hotel is slightly far from the city=> Less Crowded=> Unique Restaurent=> If you are a tourist try to avoid this as you taxi bill will come a lot=> You can go there and enjoy there meals."
        }, 
        {
            "index": 226, 
            "rating": "5", 
            "review": "This was a Birthday Treat for my birthday. I thoroughly enjoyed my day at the races, I haven't been to a racecourse before so I really enjoyed it, especially with it being the World Cup, I enjoyed seeing everyone dressed up and just people watching really."
        }, 
        {
            "index": 227, 
            "rating": "5", 
            "review": "World Cup. Brilliant viewing and access with Gallery tickets inc alcoholic drinks, afternoon tea followed by hot buffet meal."
        }, 
        {
            "index": 228, 
            "rating": "3", 
            "review": "Dubai Races. Disliked the complete lack of service and cleanliness in The Apron. area....also the extremely poor choice & quality of food & seating in that area on World Cup Day. On my previous visit I thought the place had 'teething' problems but it was more crowded & unclean this time. Nobody seemed to be concerned or oversee the comfort of the ticket holders."
        }, 
        {
            "index": 229, 
            "rating": "5", 
            "review": "A very special day out.. I visited Meydan for the World Cup final day, - it was something I had wanted to do for some time.We booked places in the Sky Bubble, and found the food and drinks to be of a very high quality indeed; nobody was going to go hungry or thirsty in there!The view of the races was excellent, but the lack of any crowd noise diminished the atmosphere a little.Everything at the course ran like clockwork, and I would go again like a shot!PS - just like the people have said, be prepared for a very, very long queue for a taxi afterwards!"
        }, 
        {
            "index": 230, 
            "rating": "3", 
            "review": "Mixed feelings. Great race but facilities are average. I loved the racecourse itself, it was exciting and astonishing to watch the horses. Fashion show by ladies and gents in terms of dresses and hats was also lots of fun. However facilities are definitely to be improved. Number of ladies bathrooms is so limited, that one has to spend up to 45 in the queue to get in and miss lots of racecourse. Food variety is not wow also, perhaps could bring some higher level food options for those willing to pay but eat healthier."
        }, 
        {
            "index": 231, 
            "rating": "5", 
            "review": "Amazing experience. Visited the course during a race night whilst staying at the hotel for a sporting event. Fab building and decor, helpful staff and incredible viewing areas for the races."
        }, 
        {
            "index": 232, 
            "rating": "4", 
            "review": "Dubai World Cup. I was in Dubai for this very important horserace this year. The Meydan racecourse is a huge and organized facility that, even with thousands of people attending the race on that day, kept its organization and offered a great show for the public."
        }, 
        {
            "index": 233, 
            "rating": "5", 
            "review": "lovely place. It was a great venue that I explored on the World cup day very well organised, huge parking, good food and the race was awesome !"
        }, 
        {
            "index": 234, 
            "rating": "5", 
            "review": "Great day out. We went to the last night of the Dubai Gold Cup. Great fun, excellent for people watching, great fireworks and after races concert featuring the wonderful Kylie Minogue. If you do go either leave a bit early to get a taxi in a timely manner or else you may find yourself with a bit of a wait."
        }, 
        {
            "index": 235, 
            "rating": "5", 
            "review": "Great day out. Top class race day in Dubai. again i love this place it has great food clean and above all standards way above what you get in the uk"
        }, 
        {
            "index": 236, 
            "rating": "4", 
            "review": "If you are not crazy about horse races and don´t mind missing the show at the end of the race, go for the cheapest ticke. If you are not crazy about horse races and don´t mind missing the show at the end of the race, go for the cheapest ticket. This applies to the most important race day of the year. It´s great to look at the wonder of this infrastructure. It is just huge. Again, if you don´want to spend the entire day there and don´t mind staying with the common people, jsut go for the cheapest ticket (Dhs 25) and see a few races. You´ll get most of what the ones who paid US$100( and much above ) did."
        }, 
        {
            "index": 237, 
            "rating": "5", 
            "review": "its the best no doubt about that. we attended this years 20th running of the dubai gold cup. we had booked entry passes at £85 pp approx this got us in to the apron viewing area, we had to attend the ticket office on arrival to pick ours up and had no trouble at all, we were in a que for no more than 5mins, as we had the apron views tickets we did not have to que to enter either, we went through security and entered the grandstand, there was loads an loads going on with entertainment of the highest order ! all people are dressed in their finery so the occasion is special ! we made our way to our area which was decked with picnic tables and umbrellas and close to the bars, prices were not to bad with bottles of water at £1 then pints of beer at £8 and measures of spirits at £8 also. food court must hold 15-20 places to eat and all approx £10 pp for burger/pizza with chips and a soft drink. the racing finished with a spectacular firework display the likes of which i have never experienced before ( i have seen Edinburgh at the new year) and this put it in the shade so to speak ! after display an announcement was made and kilye minouge was driven along the track and on to a stage where she performed ! free to all who stayed behind ! we left at approx 1am fairly exhausted but very elated ! would go again tomorrow !! it is by far the biggest and most glamorous of all horse racing venues worldwide and everybody within the horse racing fraternity and further afield should go if they get the chance it is spectacular !!"
        }, 
        {
            "index": 238, 
            "rating": "5", 
            "review": "A dream come true. One of the main reasons we went to Dubai. We were lucky enough to go to the Dubai world cup, we got general admission tickets and for less than £10 for 2 adults and 1 child this was amazing. Get there early and you can bag great seats near the winners enclousre for a fraction of the price of the next level entry."
        }, 
        {
            "index": 239, 
            "rating": "5", 
            "review": "Dubai World Cup 2015. What a fabulous day out this was. We booked Premium Seating and although we thought these expensive, we decided they were worth the money.The open bar, afternoon tea and evening buffet were all very good with a wide selection of food and drink. The service was excellent and every one so helpful and friendly.The racing was, as you would expect, of a very good quality - made all the better that I managed to get 5 winners!!Fantastic firework display after racing and Kylie was superb. Wish they had shown her on the big screens.Little bit chaotic afterwards waiting for taxis, but what can you expect. We were directed to get one of the many free buses to take us to the Trade Centre and get a taxi from there. Seemed like a good idea, but on arriving at the Trade Centre there was no taxi queue as such. Not many taxis about and it was just a free for all. All in all a brilliant day and we hope to do it again."
        }, 
        {
            "index": 240, 
            "rating": "5", 
            "review": "Hot... Hot.... Hot.... Hot. Crazy hot outside, Cool and air conditioned inside. Thats all that mattered to me :)The food was good, the lobby was amazing to hang out in and the people were, as always in Dubai, Interesting"
        }, 
        {
            "index": 241, 
            "rating": "5", 
            "review": "World Cup - Best Race date yet!!. What a place to view some of the best horse racing in the world. Excellent views anywhere you stand or sit. We had Apron views and the atmosphere was fantastic, very safe no hassle (unlike UK venues) and great drinking areas in the warmth of the desert sun. All made better by several winners.The food court sold one of the best pizzas I've had and Kylie finished off the event after some awesome fireworks All in all a very impressive place, well organised, clean and the building itself IMPRESSIVE."
        }, 
        {
            "index": 242, 
            "rating": "5", 
            "review": "world cup. Great days racing at a terrific venue, with fantastic viewing from any spot.Buffet,drinks and facilities were very good.Only thing i will say is don't expect the atmosphere you find at the races in England."
        }, 
        {
            "index": 243, 
            "rating": "5", 
            "review": "DWC 2015. What an awesome experience - you have to do this once in your life! The best racing facility in the world!!!"
        }, 
        {
            "index": 244, 
            "rating": "5", 
            "review": "\"Gorgeous\". One of the best horse racing events i have ever attended in my life.This place is gorgeous and at the same time a nice view and relaxation of mind after a long weekday events of work."
        }, 
        {
            "index": 245, 
            "rating": "5", 
            "review": "Stunning venue. Booked last minute to come to Dubia was not able to get tickets for the races from the course so had to buy through agency. Yep over priced.Sat in the gallery on the winning line so great views of the racing and even better I had four winners.Buffet afternoon tea and dinner was good and plenty full and the open bar was adequate.Kylie Monogue was playing after the racing but was to far away for us to see her perform.This was the only down side to the day you couldn't get close enough to watch her perform.It would have been better if they put her performance up on the big screen."
        }, 
        {
            "index": 246, 
            "rating": "5", 
            "review": "What a place. Spent a day here for the World Cup had such a lovely time met some really nice people They really know how to put on a good show. fabulous firework display and Kylie minogue in concert she was great. Really enjoyable only moan was a trying to get back to hotel as there was not enough taxis for the amount of people in the stadium. Worth a visit"
        }, 
        {
            "index": 247, 
            "rating": "5", 
            "review": "Maydan stable tour - absolutely worth it!. The stable tour is fantastic! It runs from about 7:30AM to about noon and the cost was 250 AED per person. It starts with a buffet breakfast at the Meydan Hotel - which was very good. Then you enter a bus and they take you to various parts of the racetrack/stables. We were able to see/touch many of the horses and get pictures with them.  We met the farrier and learned quite a bit from him. He was very gracious and answered all our questions (Sorry, I did not get his name. Was it Alan???). He was really quite knowledgeable and was quite easy to speak with. He even gave us an old horseshoe as a souvenir.  We also got to see the equine 'swimming pool'....the jockeys' dressing room....some real saddles/boots.... the winner's circle...and a trip to the huge bubble observation deck (that's probably not the official name). Here you have great views of the Dubai skyline. A bottle of water is provided for you as it does get warm. The final stop was the exhibition where there was a movie....some information about horse racing and Dubai. The Dubai World Cup trophy was there and we were then allowed to dress up in hats and get our picture taken with it. Each person got a copy of the photo (even if you were in a group photo) and it was free. There were also some jockey outfits there that you could dress in. A lot of fun. They provided you with a bag of goodies upon completion of the tour. This included a race booklet, magazine, and baseball cap with DUBAI on it. There is a visit to the souvenir store in case you were interested in purchasing anything (mugs were a great price at only 15 AED each). The guides were superb. Mark was a great guide - never rushing, provided lots of information, very easy going. He was accompanied by Jessie (a former jockey with tons of information) and Brian (who guided us through every step). Kudos to that team. Bring a camera and maybe some water. To get to the tour, you must drive or take a taxi. Follow the signs for the HOTEL....valet parking is free.  I live in Dubai and I have to say that I enjoyed it immensely even though I don't follow horse racing. I would highly recommend this for either tourists or residents. As the title says - it's absolutely worth it!!"
        }, 
        {
            "index": 248, 
            "rating": "5", 
            "review": "A great night at a spectaular racecourse. I went to a night of the World Cup of Racing Carnival and was very impressed by the experience. I have been to courses in many parts of Australia, Asia, US and UK and this is a great course. We had a dining table booked right on the window of a magnificent stand about 120 metres from the winning post. The food was very good (4 courses), there was a free flow champagne, wine and beer package and even though it is illegal to gamble, if you have a phone and an account with a corporate bookie, i don't think you would have any problems getting on. Package was about US$120. If the place had one drawback it did not have alot of atmosphere due to the size of the place and there are no punters cheering home a winner."
        }, 
        {
            "index": 249, 
            "rating": "5", 
            "review": "The most glorious thoroughbred racing venue in the world. Simply unforgettable!. For a city that strives to be the biggest and best in the world, this racetrack is right on par. As if the sheer size and beauty isn't enough, they also make it an extravagant experience as well.I spent three days at Meydan, leading up to the Dubai World Cup. The first day featured Breakfast with the Stars during morning workouts. The tents and tables were set with beautiful decorations. The food was plentiful, delicious, and offered a great variety. The juices were very fresh and tasted spectacular. There was live music and interviews with jockeys, trainers, owners, etc. Indoors, there was a great display of all the past World Cup winning horses.After breakfast, we walked toward the Meydan hotel to go to the Meydan museum. It was small, but high quality. It's free, but they ask you to \"register\" by typing your email address on an iPad. The museum starts with a short video about Sheikh Mohammed bin Rashid Al Maktoum, and his vision to promote horse racing in Dubai, and his ascent from beginning Godolphin to adding Darley, growing Dubai, to the present day glory of the Dubai World Cup. Most of the museum exhibit is a timeline of events, but there are a few artifacts, and we did get to see the trophy that would be presented to the owner of the winning horse of the World Cup. You get a personal guide who accompanies you through the museum. I think some guides are better than others. Ours stood silently next to us, and made me feel awkward, while others were actively explaining things to their guests. The highlight of the museum is the lifelike recreation of Dubai Millenium, Sheikh Mohammed's Godolphin horse who won the World Cup in 2000. There was amazing attention to detail in making that statue a perfect recreation of that horse at exactly the moment that he crossed the wire in the World Cup. At the end, you get your picture taken with the horse, and you get the picture, a hat, and a pen in a neat Dubai bag for free.The next day we went to the track for morning workouts which started peacefully under the lights, featuring the highest quality horses from throughout the world. Then we were treated to a brilliant desert sunrise before workouts wrapped up.World Cup day was as epic as you would expect. The races themselves were larger than life, and there was always something to keep you entertained. The evening culminated in a celebration of the United Arab Emirates honoring the guests who visited from throughout the world. There were musical performances, dancing, and the most amazing fireworks display anyone has ever seen.Meydan truly is an unbelievable place. Every race fan should make it their goal to visit once in their lifetime."
        }, 
        {
            "index": 250, 
            "rating": "5", 
            "review": "What an experience. We went to Dubai specifically for the Dubai World Cup - the last day of the Meydan Festival. We were in the First Class Lounge which is well worth the expense, the atmosphere was brilliant, the food was very good, all of the staff were very polite and excellent view of the racing, the fireworks at the end and the live show"
        }, 
        {
            "index": 251, 
            "rating": "5", 
            "review": "Great experience. Went for the Dubai World Cup Day. Food was really fabulous and plenty of it. Worth paying to be in the seating area (near the finishing post). Was surprised you could take your drinks to your seat, with a holder for your beer. Free food and drink all day. Advise you to go past the first area you come to (packed out). Go through turn right for 40 yards to another entry point. Loads of room and same food, only no queues. The fireworks display was better than any Disney ones I have seen. Concert by Kylie Minogue was really good, although it would have been great to see it from the stand where we were."
        }, 
        {
            "index": 252, 
            "rating": "5", 
            "review": "Dubai world cup. I loved this day. It was an amazing experience. Only cost approx £4.00 for general arena. Very close view of the horses and the track. Much more extravagant than any race in England. Saw Michael Owen. The Dubai royal family. And Kylie Minogue closed the show. It was an amazing day."
        }, 
        {
            "index": 253, 
            "rating": "5", 
            "review": "Dubai World Cup. What an experience for such a great price. We were able to go and get general admission for very cheap. It looks more like a football stadium from the outside than a horse track. If you can go for a race I would recommend it. Only downside is there is not betting allowed at the track."
        }, 
        {
            "index": 254, 
            "rating": "5", 
            "review": "Loved the race!. Had a great time at World Cup. Loved the show and fireworks! Parking was a bit of a hassle, but getting out after was easier than expected."
        }, 
        {
            "index": 255, 
            "rating": "4", 
            "review": "World Cup 2015 Review. Overall a great experience and I would definitely return to attend the World Cup again in the future. For people familiar with Dubai you'll be used the shambolic organisation of logistics and the poor communication of information. We booked tickets for the Gallery (around £275 per head). The info pack told us to go to Gate F. When the taxi dropped us off we asked several members of staff where Gate F was located. Some said that it was next to Gate C, others said that there was no Gate F. We actually needed to access Gate A but it took some time to discover this. The Gallery tickets provided food and drink all day. Staff manning the bars were just about the worst bar staff imaginable - many had little grasp of English. We had to teach the first barman how to make a Gin and Tonic!Food was actually superb. Great range of fish, salads, hot curries, sushi and Italian dishes on the buffet. Even though this is the biggest event of the year at this location the atmosphere does not match any large horse racing event in the UK. The crowd are very subdued, there's not much cheering and the stand is so big that it always feels half full. Getting home is not easy - everyone leaves after the concert so there are no taxis available. Buses took us all to the city and dropped us at a Metro station but the last metro had left about an hour earlier. Hundreds of people were then roaming the streets looking for a taxi. Even though it seems like an expensive ticket we got food and drink all day, really good access to the horses and jockeys and got to see Kylie in concert so we were at the track for 10 hours. There's also a very impressive firework display after the last race."
        }, 
        {
            "index": 256, 
            "rating": "4", 
            "review": "Great day but lacks atmosphere other than World Cup Day. Meydan is a spectacular horse racing track. Perhaps the best in the world. But as with sporting facilities of this size, it needs the crowds to bring atmosphere and do it justice. Also the absense of betting facilities will reduce the impact to Westerners who are used to this adding to 'the package' of a day at the races."
        }, 
        {
            "index": 257, 
            "rating": "5", 
            "review": "Great access to the horses and the racecourse. You could go right up and touch the horses! You get to go down into the jockey's room and out into the winner's circle. Really enjoyed it"
        }, 
        {
            "index": 258, 
            "rating": "5", 
            "review": "Top billing. It was our second visit to the Tiered Restaurant and just like the first visit the food and service were hard to fault. I recommend a night out, even if you are not a horse racing fan as it is always fun, with a chance to win a few prizes and also the meal is great value for money and the wines served are more than acceptable. It's a pity the wine no longer included champagne but I gather the Prosecco soon became a good substitute. For all visitors to Dubai I recommend a night out and for those hard up if at the end of your holiday it is free entry to watch and still get the chance of winning."
        }, 
        {
            "index": 259, 
            "rating": "4", 
            "review": "Racing at Meydan. We had an enjoyable evening at Meydan racecourse, although regular British race goers who we met there were disappointed at the lack of atmosphere, There is no Gambling in UAE. And this they felt detracted fro their enjoy,net. However, we enjoyed the spectacle of the racing ."
        }, 
        {
            "index": 260, 
            "rating": "5", 
            "review": "Superb Silks. 2 nights racing whilst we were in Dubai. We had an absolutely fantastic evening on both occasions. Excellent choice of food and drink, brilliant waiters/ waitresses. Good views of the racing if you get a table by the window, however, there is a terrace where you can watch and savour the atmosphere. Great value for a night out."
        }, 
        {
            "index": 261, 
            "rating": "5", 
            "review": "Maydan. Fantastic building and course. Whether at the Maydan Hotel for a meal or the tack for the races, the whole atmosphere is astounding. A dinner on the terrace whilst the races are on is a great experience. Watch the horses, which are treated like kings and in magnificent condition."
        }, 
        {
            "index": 262, 
            "rating": "5", 
            "review": "Great value restaurant. Brilliant value, wonderful attentive staff - excellent food! We had a great seat directly over the winners enclosure, couldn't have been happier."
        }, 
        {
            "index": 263, 
            "rating": "5", 
            "review": "Fantastic day out. I was invited by friends to spend a Saturdy afternon with them at Silks restaurant at the racecourse to watch several races....my first visit and hopefuly not the last.... A great day out in very impressive surroundings watching first-class racing"
        }, 
        {
            "index": 264, 
            "rating": "4", 
            "review": "very big. very big and very beautiful, for a while you will forget that there was dessert around, little far from city center but worth the visit"
        }, 
        {
            "index": 265, 
            "rating": "5", 
            "review": "Great to watch the Night Raes. Fantastic to sit on the balcony and watch the horse racing at night! The horse races are not on all year round due to the heat but if you're there when they are on - do stay at the Meydan Hotel"
        }, 
        {
            "index": 266, 
            "rating": "5", 
            "review": "Truly awesome. Totally a league above and beyond UK racecourses. Very civilised and orderly, luxurious and a sight to see. The biggest and most manicured racecourse I have ever been to. We had dinner there with a view overlooking the ring which was fascinating to see the beautiful horses so closely. Obviously the only drawback is you can't bet but it didn't ruin our experience. The food was very nice and the service was good too. Easy drop off and pick up points right outside for taxis etc. A real must if you can."
        }, 
        {
            "index": 267, 
            "rating": "5", 
            "review": "Owners and Trainers. Really enjoyed the décor of the hotel with a fantastic view of the race track a must when visiting Dubai. What a place that is built in the city. And the atmosphere on race days no were in the world will feel better."
        }, 
        {
            "index": 268, 
            "rating": "4", 
            "review": "What a place.. amazing atmosphere, and the place is huge, well worth going to what can only be described as a land scraper!! "
        }, 
        {
            "index": 269, 
            "rating": "5", 
            "review": "Incredible Venue. This is a must see for the horse blood type. It's an over-the-top facility, with everything from fine dining, to night club. One problem- no wagering allowed. Strange to visit the track and not loose money on the ponies, but... Incredible bloodstock, obviously, given Sheik's investment. It has to be the most impressive structure every built for this use. Had a great time and will come back for the World Cup next year."
        }, 
        {
            "index": 270, 
            "rating": "5", 
            "review": "Super Saturday. Booked Silks for this event. Had a wonderful time with a wonderful buffet and as we booked the drinks package there was a plentiful supply of beers sparkling wine shorts etc. The service was excellent and even though you cannot place bets due to their laws you get a type of lottery form which can win you prizes if you pick the winners. A thoroughly enjoyable day which we would like to repeat."
        }, 
        {
            "index": 271, 
            "rating": "4", 
            "review": "Great Experience. We booked the Silks Buffet on one of the World Cup racing days. It was a lovely evening and I thoroughly enjoyed the experience although didn't have any winners. We were lucky enough to have passes to the winners enclosure so could see everything really close up."
        }, 
        {
            "index": 272, 
            "rating": "5", 
            "review": "Down at course level. My wife and I enjoy going to the races on Thursday nights at the Meydan, but apart from the World Cup we don't pay to go into the upmarket areas. Most of the time we go in the free areas and mix with all the 'workers' who come for a free night out. Down at ground level you get a chance to hang over the rail at the parade ground, smell the atmosphere, then just turn around and watch the race on the enormous screens and see them pass the winning post. Turn back around and watch them come right past you into the winners enclosure. You can get a OK shawarma between races if you're prepared to join the disorganised queue, no alcohol at this level, for that you need to pay to get in the stands.But for a free evening out and if you want a very outside chance to win on one of the many race prediction games then go down market at course level. It's totally free, free parking, free entry, free programme and race schedule, that has to be amazing value. At the parade ground rail you may even get spoken to by one of the owners, maybe even one of the Sheikhs, which has happened to us or our guests more than once."
        }, 
        {
            "index": 273, 
            "rating": "5", 
            "review": "Got to do this. Amazing. Full stop. The best horse racing venue! Booked the silks restaurant. Food, drink and service was first rate. Dress code is smart casual. Men are ok in jeans and a shirt. Girls dressed up a little more. Really worth it. Great experience. No betting is weird but we placed our bets before hand and so still has that excitement. Will definitely return next year."
        }, 
        {
            "index": 274, 
            "rating": "5", 
            "review": "What an Experience!. My husband and I have never bet on anything! However, going to the races is truly an awesome experience! We always get seats under the apron near the parade ring. It's great to see the perfectly-groomed horses parade before the races. We still don't have a clue about choosing horses, but the experiences is truly worth it!"
        }, 
        {
            "index": 275, 
            "rating": "5", 
            "review": "Lovely buffet. Nothing to dislike - good buffet, limited a bit but lovely nevertheless. Great staff too who were very attentive."
        }, 
        {
            "index": 276, 
            "rating": "4", 
            "review": "Professional Gathering. Food and ambiance is good.......Race course is well maintained.....Its one of its kind Sports based luxury resort.... Nice Place to visit and experience a different world of sports....."
        }, 
        {
            "index": 277, 
            "rating": "5", 
            "review": "Love Horse Racing?. Meydan Racecourse is a horse racing facility located in Dubai, United Arab Emirates. It opened on 27 March 2010, replacing Nad Al Sheba Racecourse, which formerly occupied the same site. It can accommodate over 60,000 spectators in a 1 mile-long grandstand. When not used for races it will serve as a business and conference integrated facility. A horse racing museum and gallery are also planned. The development also includes a nine-hole golf course. The 7.5 million m² Meydan Racecourse includes Meydan Marina, The Meydan – the world's first five-star track-side hotel with 285 rooms, two race tracks and the Grandstand, which comprises a hotel, restaurants, a racing museum and 72 corporate suites for entertaining throughout the year. It has a 2,400 metre left-handed turf race track and a left-handed 8.75-furlong (1,750 metres) Tapeta synthetic dirt course. It operates from November through March and features the Winter Racing Challenge, Dubai International Racing Carnival and the Dubai World Cup Night. The Dubai World Cup is the world's richest race day with over US$26.25 million in prize money."
        }, 
        {
            "index": 278, 
            "rating": "5", 
            "review": "horses and classy races. the best one can come across. the best horse flesh around the world competes here on the racecourse. the best arabian pure bloodline can be watched in action here."
        }, 
        {
            "index": 279, 
            "rating": "5", 
            "review": "Silks at the races. Great food great service great views of course 80 quid inc lovely buffet and all alcohol at meetings would reccomend"
        }, 
        {
            "index": 280, 
            "rating": "5", 
            "review": "Best. We liked everything about this place from start to finish could not fault anything from stable visit to eating in hotel everything was 5* plus a few more"
        }, 
        {
            "index": 281, 
            "rating": "4", 
            "review": "Off my Bucket list .. We are regular attending British Racetracks this compares with our best Ascot or York . The facilities are top class. We Paid 100 DHS each ( approx £20 ) for parade ring lounge tickets with tiered seating near the finish line . Better value then any we've been to .We had a great days racing and a fantastic experience. Taxis to the venue in fact Taxis in Dubai are totally reasonable . Their is no on course betting but the course provide free place tickets for each race ."
        }, 
        {
            "index": 282, 
            "rating": "5", 
            "review": "Best Horse Track Course I have ever seen. There is not much to say. It is a race horse where everything is perfectly fixed (track and services). It is located next to Meydan Hotel so if you are at Hotel it is just there."
        }, 
        {
            "index": 283, 
            "rating": "5", 
            "review": "great racing. Visited last Thursday and Saturday race evening events, dining in the tiered restaurant. We had a brilliant view on both nights with our table in the middle tier directly above the parade ring and near finish line. The meals were awesome on both nights and the young man who served us was friendly and efficient, very commendable as he told us he was a trainee and the Thursday was his first race night. I would recommend these events, value for money and will definitely go again."
        }, 
        {
            "index": 284, 
            "rating": "5", 
            "review": "Stunning Place for a night out. Stunning Race Course. you will love this place even if you are not into horse racing. went on a Thursday. Tickets are affordable. also you can chose packages which includes more fun and closer view for a good price. food and drinks were serviced to our seats. Had a really nice evening. FYI - Betting is illegal in UAE"
        }, 
        {
            "index": 285, 
            "rating": "5", 
            "review": "World Cup Carnival - February 2015. I visited Meydan for the World Cup Carnival meets on the 26th and 28th of February. The grandstand and facilities are immense - think Ascot but about triple the size!I caught a taxi from the nearest Metro station - Business Bay (cost 25 Dirhams/around £4) and the journey takes about 10-15 minutes depending on traffic. I opted for the 50 Dirham ticket/premier seating by the finish line. Access is via Gate A and be sure to collect your free betting slip and raffle ticket as you enter. This is the only gambling allowed at the track due to UAE laws. You can also collect a free race card from the information desk located inside. One part of the betting slip involves picking the winner of each of the six nominated races (races 2-7 in my case) - the Pick 6. If you manage to do so you're likely to collect a five figure cash sum if your the only winner. You'll also collect money if you manage to pick 4 or 5 winners as well. The other part of the betting slip is the tri cast - if you get any of them up well done! The raffle ticket had seven prizes ranging from £1000 - £100 and the results were announced after race 6 on the big screen. Be sure to give this and your betting slip to staff twenty minutes before the first nominated race. All types of alcohol are served inside. I went for pints of Heineken which cost 40 dirhams/£7. Apparently alcohol is one of the few things subject to tax in the UAE which is why it's expensive. You can either buy from the bars of have a waiter bring them to your seat. Although it's a very good view in the premier seats, there was not much of an atmosphere due to the fairly low numbers in attendance. This was the case on both days I visited and was the only slight disappointment. There were seven races in total each night (non world Cup meets generally have six). The first went off at 18:45 and the last at 22:15 hours. There is a taxi rank directly outside gate A. I waited five minutes for one on the Thursday and about 15 on the Saturday. There are taxi marshals controlling the queue, they do however offer the 'Lexus' taxi which are parked on the other side of the road. These are plain, white coloured, Lexus cars that cost about three or four times the price of a standard Dubai taxi. Overall, it's definitely worth going to Meydan if you're a racing fan, even if the atmosphere is a good deal more restrained that the likes of the UK. The crowd was a good mix of locals, families, expats and tourists - all well behaved, even me!"
        }, 
        {
            "index": 286, 
            "rating": "5", 
            "review": "Nice Evening. I purchased the Silks buffet package. The buffet was very well done and reasonably priced. The viewing balcony was 100 meters before the finish line. With the Silks package I could go to the ring to view the horses before the race. There is no parimutuel betting at the track."
        }, 
        {
            "index": 287, 
            "rating": "5", 
            "review": "Fun day out. Definitely buy the more expensive seats. Husband got his designer sunglasses stolen at the security check, and no one was interested when we reported it ! Still had a good day though, although took for ever to get a taxi, and decided to walk to main road to try and get one. That kind of put a cloud over the day, so,would research a taxi home before I went next time."
        }, 
        {
            "index": 288, 
            "rating": "5", 
            "review": "Briliant night out in Dubai!. Absolutely love Meydan nights out! The racecourse is stunning, set behind a spectacular hotel. you can get tickets to watch the racing for 50-100 dirhams during the racing carnival, takes place thursday/friday nights in the Winter. They serve wine and food to your seat and you can get really close to the horses andthe jockeys. It's a best kept secret and I can't beleive more people don't go!"
        }, 
        {
            "index": 289, 
            "rating": "5", 
            "review": "Great Experience!!!!. We decided to celebrate Valentine's Day here as we were in Dubai & had a lovely time in their beautiful glassed in restaurant with a window seat overlooking the parading horses & the finish line. We purchased a four course meal for a fairly reasonable price & they had special things for Valentine's Day like a basket of bread in heart shapes, heart shaped chocolates with coffee etc. Good service & a great venue. As betting is illegal in the UAE it takes the edge off the visit for most non-UAE residents (you can, of course, place bets through other countries, & many people do) but for residents it's just a nice family day out with a play area for the kids & quite a few different areas to sit & food outlets to choose from. If you don't have your own car you will need to take a taxi (be careful not to take an unmarked car or it will be expensive). Coming back, the taxi line is long & the cars which arrive are mostly unmarked so you will need to negotiate a price - this is MOST important. There is a free shuttle bus which runs to Dubai Mall but it can take a while during peak times. We would definitely go again when in Dubai during their winter!!!!!"
        }, 
        {
            "index": 290, 
            "rating": "5", 
            "review": "First time but won't be the last .... My houseguest suggested we go for a Dubai Carnival night (on a Thursday). She researched and booked Premier seats opposite the Winning post and although I'm not a horsey person, I thoroughly enjoyed the 'experience' ! It's worth going as it's in the cool of the evening, there is much to see and enjoy and the food and drinks (serviced to your seat) just makes it that much more enjoyable for a cheap evening out. Oh and a great night time shot of Dubai's skyline! Do try it !"
        }, 
        {
            "index": 291, 
            "rating": "5", 
            "review": "Great area. Went here since they had a APC event that was being held there it's really tricky to find and yes we got a taxi and the taxi didn't even know where the Resturant was !!!!! Be careful when going and plan ahead !"
        }, 
        {
            "index": 292, 
            "rating": "5", 
            "review": "SPECTACULAR FOOD IN AMAZING SURROUNDINGS. Dined in the restaurant overlooking the racetrack. An amazing experience with excellent food. The menu is very specific with regard to explaining the steaks available and recommend how they should be cooked. We sat in a window with the very high backed dining chairs; they were an experience on their own!!The food was delicious and the staff were very attentive and helpful.We were very lucky in that there was racing on the night we ate and it all added to the wonderful atmosphere.Highly recommended."
        }, 
        {
            "index": 293, 
            "rating": "5", 
            "review": "The World's largest - a must for any racing fan !. We are a pair of 70year-old racing fans (National Hunt), but our three-day stopover in Dubai, en route to Mauritius, just happened to coincide with the Carnival . . . Not up for debate !As we were staying in Deira, on the opposite side of Dubai, we used the fabulous, and incredibly cheap (£4.70 for a Day ticket to go anywhere, as often as you like) Metro to sightsee prior to then getting a short taxi ride from Downtown Dubai to the racecourse. The last race was 10.15pm, and a taxi had us back at the hotel by 11pm, for £16. Amazing - it's a long way.It is like arriving at an international airport ! The taxi driver took us to the Meydan Hotel, whereupon we were given a buggy ride to the Ticket Office ! It is so big, we'd still be walking now without that ! We paid £10 each to allow us to have a good look round, although we could have got in for free.The seating is very comfortable, with lots of space, and a drinks holder in the armrest. We had a substantial albeit snack, meal, which - with drinks - cost £20 for two. It was entirely satisfactory. The staff want to serve you in your seats; cleaning is continual, even to polishing the handrails throughout the evening.As gambling is not allowed, we were surprised to find our ticket included a 'free bet' for a Placepot-type draw. We didn't find the winners though ! Equally surprising was that alcohol was freely available, whereas in Dubai generally it is only available in tourist hotels.The no-gambling also means no bookies and therefore no betting slips and NO LITTER !!! In addition littering in the street in Dubai will cost you £100. So there isn't any. UK please note !! The horses arrive at the start by means of a subway horsewalk, so that's difficult to see. Unsaddling is right in front of the stands. However the finish is where it should be, the screens are about 100m long, and there are continually-updating times shown on another huge screen.It goes without saying that the racing is first-class, and we even had Rishi Persad commentating ! This facility is so worthy of all the superlatives. It deserves its reputation and is a must-do for any racing fan lucky enough to visit Dubai. It is a very different experience to UK racing - as it should be."
        }, 
        {
            "index": 294, 
            "rating": "5", 
            "review": "They do this well in Dubai. For me this was one of those boxes that I wanted to tick and what an impressive place this is. The food and drinks here are also very reasonably priced and if you have any interest in horse racing this is a must."
        }, 
        {
            "index": 295, 
            "rating": "5", 
            "review": "Meyden Races. Excellent value with the drinks package in the Tiered Restaurant, brilliant seats and professional friendly service."
        }, 
        {
            "index": 296, 
            "rating": "5", 
            "review": "\"FREE \" ....... You really need to experience this... yes its free to get in to EVERYONE , so as you can imagine all the \"locals\" make an evening of it , rugs picnics and kids ..... think we were only two of a handful of Europeans there !!!! ( although you can book a table there for dinner at a cost ) take a taxi there and back ,,,,"
        }, 
        {
            "index": 297, 
            "rating": "5", 
            "review": "just back. Visited last week for dubai carnival stayed in the meydan hotel ,all i can say is wow.Anybody who is seriously interested in horse racing dont hesitate to pm me."
        }, 
        {
            "index": 298, 
            "rating": "4", 
            "review": "Great way to spend an evening. What a huge and amazing place - must be the best in the world! We went as a group of 4 and paid AED 100 each for the Parade Ring Lounge. The outside tables were next to the Parade Ring and the beautiful Arabian horses could be seen close up as they walked round- they are all amazing! Whilst most of the time, the starting gate was out of direct view, the 3 huge screens opposite had all the action until they came into view on the straight and thundered past the finish post in front of us.The waiters outside were very attentive and keen to keep us topped up with wine or beer. The restaurant area was very pleasant and spacious. The bar snack food was OK but Sushi was served in a plastic box, as if straight off the supermarket shelf. The cheesecake desert was the same and totally unnecessary, as there were not many diners and it would have only taken a few seconds to put it on a plate.Overall, it was a great experience and a lovely way to spend an evening."
        }, 
        {
            "index": 299, 
            "rating": "5", 
            "review": "Race course to visit. Agin, nothing to dislike. The Grand Stand is humongous very lushy and plushy. It is a palace for race goers and an honor for the horse owners to win on such a race corse."
        }, 
        {
            "index": 300, 
            "rating": "5", 
            "review": "First visit here. Went here for the Dubai Carnival and thoroughly enjoyed it. Had booked my tickets beforehand for premier seats, these did not cost much but were worth it."
        }, 
        {
            "index": 301, 
            "rating": "4", 
            "review": "Hotel, Racecourse, concert venue all in one!. Having watched the racecourse being built, it was a treat to return recently to see the finished product. Lovely to sit outside and look over the racecourse. If you are luck enough to stay in the hotel over winter you may see the horses being worked on the track in the early morning."
        }, 
        {
            "index": 302, 
            "rating": "4", 
            "review": "Excellent facility but lacking atmosphere.. We booked the tiered restaurant facility which included a 4 course dinner and alcoholic drinks in addition to the table for the evening. (Approximately 90 gbp/person)The food was very acceptable for this type of event and the young restaurant staff were helpful and attentive throughout the evening.The racing was of a good quality, alas; due to the culture of no betting the crowd's interest in the racing seemed to wain as the evening progressed.Sadly, for a stadium of such magnitude the atmosphere was lacking - for us it was simply a \"nice\" evening at the races without being exciting or in the least bit exhilarating.I daresay the crowds and atmosphere would increase 10 fold if gambling was allowed but appreciate this may never happen with all due respect to the country's culture and way of life."
        }, 
        {
            "index": 303, 
            "rating": "4", 
            "review": "Good experience - again - but beware of rip off taxis!. Booked the tiered restaurant for 29 January, and once again the 4 course meal was delicious and service very good, with fab views of the finishing post. However, our night was ruined when we made the mistake of being pressured by a persuasive man by the taxi rank into getting into a cream coloured cab from outside Meydan to our hotel on Ras Al Khaymah : we should've got out when we saw there was no meter :( the driver got lost at least twice and kept asking for directions, and when we finally reached our hotel, charged us an extortionate fee of 427 dirhams. Bear in mind it cost us 160 for the outward journey, this was one rip off and I'd like to warn other travellers."
        }, 
        {
            "index": 304, 
            "rating": "5", 
            "review": "Amazing place to visit.... One of the best places to visit, if one is interested in Horse racing... The whole concept of Meydan is truly exceptional...."
        }, 
        {
            "index": 305, 
            "rating": "5", 
            "review": "Fantastic. Great value for money. Half the price as home. Emailed re tickets and they were there waiting. Our trip to the Races made our holiday"
        }, 
        {
            "index": 306, 
            "rating": "5", 
            "review": "Best Horse Racing in the World. The Dubai Carnival is on in Q1 and what a great racecourse - more important is to go there with a group and hire a box so that you have your won private area with drinks and food served throughout the evening. With all the change sin the past few years Meydan is very easy to drive into - just make sure if you go for the box option you know which part of the car park you want to be in to cut down on walking too far. If you are visiting Dubai try and include the world famous Dubai World Cup in March the culmination of 19 days of superb horse racing"
        }, 
        {
            "index": 307, 
            "rating": "5", 
            "review": "Dubai World Cup Carnival. Wonderful evening at the races in the Tiered Restaurant. Well looked after and excellent VFM. Two comments for future visitors to note:1. Dress code says ladies should wear hats - no one else did apart from our table!2. Availability of taxis at the end was very poor and the queue was long. So either pre nook a taxi or get the free shuttle bus to Dubai Mall and pick up a taxi from there."
        }, 
        {
            "index": 308, 
            "rating": "5", 
            "review": "Superb Race Course. Excellent facilities, No expense, spared Luxury. Brilliant accomerdation and amazing views of the race course, from my hotel room and the swimming pool, very helpful staff, nothing was too much trouble, food and restaurants were all exceptional, yes I will be back, next time I am in Dubai. Nice location away from the shopping areas though there is a complementary shuttle-bus, to all the malls. (Marina Mall about 20 min depending on traffic)."
        }, 
        {
            "index": 309, 
            "rating": "5", 
            "review": "Excellent! . Went for the races for a friends 50th birthday and it was such a great day out. There's food and drinks everywhere, for every budget and the people watching is fantastic for all the crazy outfits and hats. Great day!"
        }, 
        {
            "index": 310, 
            "rating": "3", 
            "review": "Plan your transportation & accommodation . If you do make it to Meydan to experience a race make sure to book a room at the hotel for the full experience. Meydan racecourse is located deep inside the desert so consider planning your accommodation and transportation."
        }, 
        {
            "index": 311, 
            "rating": "5", 
            "review": "A fantastic 60th birthday present. I have always been interested in horse racing , I am a fan of the goldolphin operation so to go to the meydan racecourse was a dream on my 60th birthday. My wife bought a drinks package at the tiered restaurant where we had a fabulous time had a great view of the racecourse the paddock and of course the winning post. The food and the service was absolutely first class I was presented with a fabulous cake and the staff were great a truly great birthday present that I will always remember , if in Dubai and you want to do something different you will not be disappointed."
        }, 
        {
            "index": 312, 
            "rating": "5", 
            "review": "awesome place. every thing about this place is fantastic- cant wait to go backHotel, pool, restuarants, Service Race course itself- Just Mint!"
        }, 
        {
            "index": 313, 
            "rating": "4", 
            "review": "At the Meydan for business. This is an amazing place: a mile long hotel with view on the racecourse. We usually we do business events here twice per year. The staff is very supportive and every details is arranged to perfection, from the snacks to the technical support. Finally the buffet dinner has a very wide choice from Iranian to middle eastern and be sure to leave some room for dessert, although it would be difficult no to overeat, since the choice (again) is super."
        }, 
        {
            "index": 314, 
            "rating": "5", 
            "review": "World Cup Carnival Races Meydan Racecourse. Went to this venue one evening as a treat for my husband celebrating his retirement. We stayed in Dubai for two nights before boarding a cruise ship.The track is beautifully maintained , we had superb seating as we were dining at the Grandstand Restaurant. This was worth every penny and highly recommended.Service at the venue was perfect and the meal was outstanding, The restaurant can be pre booked on the Meydan website. It was a great experience for our last night in Dubai."
        }, 
        {
            "index": 315, 
            "rating": "5", 
            "review": "Great night at the races!. Before heading to the racetrack to watch the horse races, we asked around to get an idea of what to expect... Unfortunately nobody seemed to have been to the racetrack or know anything about it. They are missing out! Make sure you get the premium seating, it is definitely worth it. The place is amazing, really clean, great food and bar service, and you get freedom to go down on the grass close to the horses. We had no problems and a fantastic night! This place should definitely get more attention than it does!"
        }, 
        {
            "index": 316, 
            "rating": "5", 
            "review": "Great venue. Went to the first race of the Dubai World Cup racing. Paid for ring side lounge seating for 100 AED which gave you outside seating and waiter service to your table. Great spectical although slight anticlimax in that no betting is allowed at the course with it being an Arabic country. They do provide you with a coupon on entry though where you pick the winners of each race and a cash price is on offer. Worth a visit."
        }, 
        {
            "index": 317, 
            "rating": "2", 
            "review": "Still not got it right. Very poor service, kitchens unfinished, lack of decent management, facilities unfinished, toilets smell aweful, so much potential, but it is never going to make it until they sort out the management."
        }, 
        {
            "index": 318, 
            "rating": "5", 
            "review": "State of Art Course. World Class Racecourse with excellent facilities - however there is no on course gambling there. Alcohol is served in the bars, but is quite expensive."
        }, 
        {
            "index": 319, 
            "rating": "3", 
            "review": "Waste of impressive space. This racecourse is massive and the races are empty...I'm sure the World Cup gets a larger cored but this building and the accompanying hotel is massive!!! Abandoned might be a good word, the bathrooms were dusty and looked unused. The racecourse is impressive though by size as far as desert goes. This is also away from town but a cheap 15 minute cab ride away from downtown"
        }, 
        {
            "index": 320, 
            "rating": "4", 
            "review": "Stable tour. This tour operates on Tuesdays and Wednesdays see http://www.meydan.ae/equestrian/stable-tours for time and dates.If you like racing and horses - this is for you. It is led by Mark Monkhouse - the tour starts with a buffet breakfast at the hotel then a short hop to the stables. We were able to see the horses in their stalls as well as the general day to day activity of a stable. Horses being shod and bathed. We were shown their special food charts - one horse even had to do a demo on their special treadmill. We went on to see the horses' own swimming pool and then back to the racecourse to visit the course and behind the scenes in the jockeys' room. An enjoyable and interesting morning for both adults and children.The only downside is that it is not easy to book. The concierge at the hotel arranged our visit but Mark Monkhouse says the hotel is working on a new booking system which will enable potential participants to book on line."
        }, 
        {
            "index": 321, 
            "rating": "4", 
            "review": "Go for the Dubai World Cup - otherwise do not bother. Besides Ascott in the UK the Dubai World Cup has become an annual event that should be marked in your calendars not only if you are a horse enthusiast. DWC has become a focal point for socialites and business people alike and draws in more visitors year after year. The one-day event features the world's highest denoted price money, which is why every jockey that has rank and name will be represented. Other than during DWC most of the Maydan hotel is closed and besides the race track there is not really much to see.Tip: book the \"Apron Views\" category for DWC; it offers the best value and allows you to be immediately besides the race track for excellent views."
        }, 
        {
            "index": 322, 
            "rating": "5", 
            "review": "Racing like you have never experienced it!. Amazing. It surely beats a wet winter racing meeting in the UK! What an experience. Opt for the all inclusive tickets which have access to a great suite for viewing with an excellent four course meal and all alcoholic drinks."
        }, 
        {
            "index": 323, 
            "rating": "4", 
            "review": "brunch. Fab Friday brunch away from the busy jumeirah area!! Great food choice and quality along with attentive staff and good choices for children"
        }, 
        {
            "index": 324, 
            "rating": "4", 
            "review": "Good one. Meydan hotel is bit far from the city but once you reach there & visit Racecourse, you will feel that its worth visiting this place. Make sure you have a car with you as getting taxi is very difficult task specially after late evening."
        }, 
        {
            "index": 325, 
            "rating": "3", 
            "review": "Fantastic place for watching race - avoid the expensive \"stable tour\". Meydan Racecourse is an impressive place to visit, especially for watching races which start from November (planning available on http://www.dubaiworldcup.com/visit/calendar/racing-calendar). Outside for the worldcup, there are good seatting areas accessible for free (but you may choose to indulge yourself a nice diner with front view).I would however not recommend the \"stable tour\" which is proposed by the Meydan hotel. This is very pricey and you don't get really much value for your money. You are taken in a bus tour around the infrastructure and visit one of the stable. What is really lacking is a good guide. No overall background information on the importance of the horse race for the region, how the races are organised. how horses are trained, how is the life of a jockey,...there are so many topics which could be covered during this tour. Don't expect seeing horses training either. You see them in their boxes."
        }, 
        {
            "index": 326, 
            "rating": "3", 
            "review": "People gave strange looks.... It was interesting to see how everybody were so pumped up for the race. The facility was great, you could buy food downstairs. There were big screens so you could keep track on the horses and of course you can make bets with your friends/loved ones/family. But people were giving us strange looks which made me feel like we weren't welcomed, but that's just my interpretation of it."
        }, 
        {
            "index": 327, 
            "rating": "5", 
            "review": "Well worth a look. Totally over the top - in a fun way! You won't believe your eyes at the size and the features of this place. Worth a visit just to stroll around and gaze. Don't miss the groovy lifts!"
        }, 
        {
            "index": 328, 
            "rating": "5", 
            "review": "Racecourse with in the Hotel complex.. Excellent location for all horse lovers alike.Throughbreed and local horse compete each other in huge luctratic price of the evening."
        }, 
        {
            "index": 329, 
            "rating": "5", 
            "review": "Perfect viewing. Very well organized with ample parking and seating available. Clear views of the races with big screens providing all details. The lounge offers dining and up close viewing opportunities. Well worth a visit or two just for the experience and the lovely winter weather."
        }, 
        {
            "index": 330, 
            "rating": "4", 
            "review": "doing it again. wow its an amazing place to be, had a great experience there during the richest horse race in the world event as well as JLo's concert.... good times out there"
        }, 
        {
            "index": 331, 
            "rating": "5", 
            "review": "Great night out. We've been 3 or 4 times including the Dubai World Cup (wouldn't recommend going to this!) on an average race night this is great fun, bit weird not having bookies which can make the racing crowd a bit more subdued, but good value for money and for a night out with friends"
        }, 
        {
            "index": 332, 
            "rating": "5", 
            "review": "Christmas Day Celebrations. Just to say an absolutely fantastic day!!! Would definitely visit again, food excellent and brilliant value for money."
        }, 
        {
            "index": 333, 
            "rating": "5", 
            "review": "Lady Gaga concert. We were 4 girls who went for the Lady Gaga concert on 10th Sept, ;14. Loved the place. The seats were lit up in florescent colors and looked amazing at night. Everything was comfortable and the rest rooms were clean even though the event attracted more than 50000 guests minimum."
        }, 
        {
            "index": 334, 
            "rating": "4", 
            "review": "Brunch at the Race Course. The race course offers a wonderful setting for brunch. Use of the corridor for seating and serving slightly odd (best to ask for a table inside the restaurant. Good spread of food and entertainment for the children. Wine disappointing. Service excellent!"
        }, 
        {
            "index": 335, 
            "rating": "5", 
            "review": "breath taking. colossal race course with 5 star facilities, be it the paddocks or the general area the view is spectacular"
        }, 
        {
            "index": 336, 
            "rating": "5", 
            "review": "Beautiful Racetack. No expense was spared in the construction of the new Meydan Racecourse. It's modern, efficient, parking is easy and free and racing is always exciting. Sheikh Mohammed's horses are always in the running and you're just as likely to see the Ruler of Dubai mingling in the crowd or around his horse(s) as they prepare to run."
        }, 
        {
            "index": 337, 
            "rating": "5", 
            "review": "Dubai World Cup. This is one of those events not to be missed. Get in the Bubble room and let the party roll. However those who have been there before please do not give your tickets to the children or young adults outside when you are leaving in the early evening before the concert. Such incidents allowed up to 1000 people inside using those tickets and we had to stop one person stealing a friends handbag, while several bottles of Champagne in ice buckets were stolen from the intruders. This was a damper to the end of the night between 9pm-Midnight. Midday to 9pm was fantastic. Looking forward to the next world cup and hopefully security is better this time round."
        }, 
        {
            "index": 338, 
            "rating": "5", 
            "review": "Great venue. Been here a couple of times, once for the horse racing and once to see Usher and Katie Perry concert. Great venue, easy parking. The horse racing is a great evening out, even if your not interested in horses -just go and enjoy the experience..."
        }, 
        {
            "index": 339, 
            "rating": "3", 
            "review": "mainly for concerts or horse racing. The main arena is good an modern. Everything around it is basically desert. The only time its open is during concerts, camel or horse races.. Nothing so grand, unless your attending an event"
        }, 
        {
            "index": 340, 
            "rating": "4", 
            "review": "Meydan. Good place. It.s better to go when they have horse race so that you can see a real race between the most beautiful arabian horses."
        }, 
        {
            "index": 341, 
            "rating": "5", 
            "review": "Amazing. Had a fab time here for our friends birthday celebrations. Food very good and this race track is amazing. We booked a food and drink package and it was great value for money."
        }, 
        {
            "index": 342, 
            "rating": "5", 
            "review": "Dubai World Cup Horse race. go if u are in dubai during the race\nthe girls are dressed with great hats\nchampagne are flowing like a new year\ngreat artists\nwell arranged from the locals\nbest race with most money in the world\njust go"
        }, 
        {
            "index": 343, 
            "rating": "5", 
            "review": "Visited during Dubai World Cup week. Stunning track. As a racing fan its akin to a football fan going to Wembley or a golfer playing at St Andrews. Fantastic facilities, outstanding views of the track from anywhere and first class attention to detail. I met one of the Dubai Royal Family Princes whilst there and they couldn't have been any nicer. Although bodyguards were rather scary!"
        }, 
        {
            "index": 344, 
            "rating": "5", 
            "review": "Amazing amazing..... Simply put this was an enormous feat to get a 1km long race stand available in the time they did, when we visited it was only half full, but none the less more impressive.\ngreat atmosphere, catering to all budgets."
        }, 
        {
            "index": 345, 
            "rating": "3", 
            "review": "Average. The racecourse itself was lovely.. But the atmosphere wasn't very exciting. Definatley not for children."
        }, 
        {
            "index": 346, 
            "rating": "4", 
            "review": "Evening at the Races. During the early part of the year the racecourse holds evening 'brunch type' events where you can watch the racing from the elegance of their restaurant on tiered levels so all can see the action. Very expensive to get a table here during the Gold Cup weekend so a great opportunity to eat here. Food good, not brilliant but it's the whole package that makes it worthwhile and allows you to choose horses in races (not gambling) so you get involved - great fun."
        }, 
        {
            "index": 347, 
            "rating": "5", 
            "review": "Spectacular horse racing venue. Attended the World Cup and we were impressed with everything about the event and the racecourse. Beautifully designed, amazing views, impeccable service (we were in one of the lower level sections near the finish line). Also took a tour of the racecourse, the stands and the stables a few days later and continued to be impressed. Well worth the trip and highly recommend to anyone who wants a great racing experience. The Meydan Hotel adjoining is awesome as well."
        }, 
        {
            "index": 348, 
            "rating": "5", 
            "review": "Awsome Racecourse. This is one of the world's best racecourse developed under the guidance of HH Sheikh Mohammed Bin Rashid Al Maktoum."
        }, 
        {
            "index": 349, 
            "rating": "5", 
            "review": "A Racetrack To Beat All Others!. The grandstand has to be seen to be believed - it is huge! If you think Ascot's is big, this is much bigger! I went on a public holiday to an 'everyday' meeting and the public areas were rammed, as it is free entry. However, for a much more pleasant and refined experience, pay the 150dhms to go in the Parade Ring Bar/Restaurant, where you get space, air conditioning, alcohol and excellent food. Well worth the money."
        }, 
        {
            "index": 350, 
            "rating": "5", 
            "review": "Business Function Review. I recently had the pleasure of attending a business function at the Meydan and the whole experience was delightful. Lovely views over Dubai and the Racecourse and the meal and service was wonderful."
        }, 
        {
            "index": 351, 
            "rating": "5", 
            "review": "World cup a must but with the vip package. We all paid 13oodhs for the vip package at the world cup and must say that it was worth every penny, the views were good and the food and drink was in abundance at the right times, the concert afterwards was also part of the package and great value, not to mention the racing itself (lacks a little atmosphere as no betting) however you pick 6 horses on arrival for the chance to win some great prizes."
        }, 
        {
            "index": 352, 
            "rating": "5", 
            "review": "Meydan World Cup Horseracing. Incredible. Nothing bad at all to say! Excellent atmosphere! Excellent view from the Sky Bubble lounge! Excellent service, food and drink! Brilliant!"
        }, 
        {
            "index": 353, 
            "rating": "4", 
            "review": "Dubai Races. We were in connections Lounge and got a great meal and very good service. unfortunately no betting was possible but it was a great evening out."
        }, 
        {
            "index": 354, 
            "rating": "5", 
            "review": "Amazing facility, best I have ever seen for horse racing. Its an unbelieveable stadium and has great facilities. We were there for the world cup this year and really enjoyed the event. The all weather track si further away than the grass track so a little harder to see. The views from the bubble lounge is amazing both of the course and the city of Dubai. One to see a horse race at for sure."
        }, 
        {
            "index": 355, 
            "rating": "5", 
            "review": "Horse racing by floodlight. A great place to watch the horse racing almost continually whilst having dinner under the stars! The buffet was excellent and the general ambience of the hotel,racecourse and outdoor dining was an excellent and unusual experience."
        }, 
        {
            "index": 356, 
            "rating": "5", 
            "review": "ISOLATED BUT ROYAL. Its one of those places which you would curse for booking initially. This will though change very quickly as this place gets to you slowly but surely... race course is nice. Roof top swimming pool is beautiful. staff is very courteous."
        }, 
        {
            "index": 357, 
            "rating": "4", 
            "review": "Great night out. Lovely atmosphere and good views of the racing.I recommend this for small groups to go and have a flutter and some fun."
        }, 
        {
            "index": 358, 
            "rating": "5", 
            "review": "Beautiful. We attended the dubai world cup here, very well made and a real treat, parking was very organised , i recommend to all"
        }, 
        {
            "index": 359, 
            "rating": "5", 
            "review": "Awestruck. AwestruckWe had lots of fun at the Apron Views and what an experience it was at the concert after .Seeing J-Lo perform, such a Delight."
        }, 
        {
            "index": 360, 
            "rating": "5", 
            "review": "So we landed here, and coincidentally the world cup was on.. Friend of mine said, \"lets go to the Dubai World Cup\" upon landing in Dubai.Not knowing what we got ourselves into, a yes was given. Now this is how you entertain!!! amazing diversity, with different areas for different Punters. We had all access and check out the pictures!Fireworks. Drinks. Sheiks.And apparently there was a horse race somewhere. I imagine the hotel attached to this would be quite good :)You could eat your food off the floor if you were that way inclined it is that clean."
        }, 
        {
            "index": 361, 
            "rating": "4", 
            "review": "Good restaurant at the Meydan racecourse Hotel. The view is amazing and the food is tasty with a lot of variety. The buffet is worth it. The service is very good and very friendly. In fact I have been there twice now and would love to go more times"
        }, 
        {
            "index": 362, 
            "rating": "5", 
            "review": "Executive Housekeeper. The hotel is one of the best we have stayed at. It felt exclusive and the facilities matched this most of the time. The room 703 were the biggest & room very clean and the best layed out I have ever stayed in and the food/breakfast was great at the Z Everyone in the hotel was also very helpful and always deal with a smile. Thank you, Narendra."
        }, 
        {
            "index": 363, 
            "rating": "4", 
            "review": "Going to the Races. Meydan racecourse is a great place to watch horse racing. Apart from World Cup day the prices are cheap and the stadium is state of the art and very clean. Food and drink are easily available and not too expensive by Dubai standards. Wide range of options are available from fully catered meals to casual fast food style. the only down side is that there is not betting on course due to the local laws."
        }, 
        {
            "index": 364, 
            "rating": "5", 
            "review": "great night at the races. Second year running and another spectacular night at the races.We upgraded this year to premium1 and loved it , will definately be rebooking the same for next year.The food and drink on the all inclusive was pretty special, was not expecting it to be as good, although everything in Dubai is done on a grand scale.Cant wait for next year."
        }, 
        {
            "index": 365, 
            "rating": "5", 
            "review": "A must do if you are interested in horses at all!. Loved the stable tour - seeing the horses and their daily regime. Grand stand is amazing as is the magilis. Went on the stable tour last year but this year the tours were finished when we went so had the afternoon tea in the hotel overlooking the racetrack - what a view! The afternoon tea was superb - way too much to eat but what a relaxing way to spend an afternoon!"
        }, 
        {
            "index": 366, 
            "rating": "4", 
            "review": "Atelier Festival. Visited Meydan a few times, but primarily for Atelier music festival. Very well organised, absolutely spectacular night of fun and great music. Well worth it!"
        }, 
        {
            "index": 367, 
            "rating": "4", 
            "review": "Great day out. It was my first time coming to Meydan an what a perfect time i chose to visit for the Dubai World Cup. There was a group of 40 of us and what a day we had! Unfortuunetly we purchased our tickets too late and was not able to dine there. However we had great view of J-Lo perfoming and spent the majority of the day in the Moet stand. The only thing i missed was the atmosphere compared to the Grand National in Aintree in the UK. However we did make the most of it and would only probably ever come again for another big event!"
        }, 
        {
            "index": 368, 
            "rating": "4", 
            "review": "Bit dull !?. I was holidaying in Dubai February this year and as we enjoy horse racing in UK & Ireland we decided to get glammed up & go to the evening racing here, went for the hospitality package, badges, dinner, drinks VIP - was lovely. Though we found the racing sedated & races over very quickly - no real atmosphere or excitement amongst the hospitality suites or crowd below !Though was a lovely experience & evening ☺️"
        }, 
        {
            "index": 369, 
            "rating": "5", 
            "review": "Fantastic evening!. We went to the races to have dinner in the tiered restaurant, it was perfect! Such a lovely view overlooking the course and the winning post. The evening went very quickly and was very relaxed. The service received from our waitress was perfect. Lovely food, lovely company and a perfect setting! A night to remember !"
        }, 
        {
            "index": 370, 
            "rating": "5", 
            "review": "Meydan Racecourse. By far the best racecourse in the worldThe Dubai World Cup night is a spectacle to beholdOnly fault is the traffic control before and after racing, needs to be addressed"
        }, 
        {
            "index": 371, 
            "rating": "5", 
            "review": "'' High Tea ''. Been to this place more than once but the afternoon tea is always consistent... stayed for the sunset with a glass of bubbly on the lobby terrace..the view of the race track and neighboring green areas is something that makes one think you are in one of the tropical places in another country."
        }, 
        {
            "index": 372, 
            "rating": "5", 
            "review": "a world class racecourse. i was there recently for the dubai world cup. the racecourse is among the finest i have seen. the world cup day was spectacular, with a grand fireworks display and a jenniffer lopez concert at the end.the facilities are top class,public transport. was adequate, with a bus service on world cup day, taking you to the dubai mall metro stop, which is fairly central."
        }, 
        {
            "index": 373, 
            "rating": "4", 
            "review": "Horse bling to the max. I do not like horse racing one bit. However, I do like to people watching, drinking and having fun with friends. This is a blast for all of that. This event is very Dubai. Over the top and maxed out on bling and people showing off their wealth. What a blast. If you are going to go, make sure you go with a group of friends to make the most of it."
        }, 
        {
            "index": 374, 
            "rating": "5", 
            "review": "World Cup Day. Brilliant venue, very similar to Ascot, but on a bigger scale. The firework displays were fantastic, a great days racing. Finished off with a Jennifer Lopez concert. Great"
        }, 
        {
            "index": 375, 
            "rating": "3", 
            "review": "Veni Vidi but no Vici. We had a Brunch at El Meydan. At the end we walked outside to see el Meydan. The brunch was good and the race track unfortunately was just empty. Saw I came I saw but did not witness a race.The green is beautiful in this landmark.To get there you can be lost if you don tknow your way."
        }, 
        {
            "index": 376, 
            "rating": "5", 
            "review": "Magi meydan. This was the reason we went to Dubai and we were not disappointed. Got there for the gates opening at 1400 and what a day/night we had. We got our picture taken as we went in and yes we bought it (well you have to don't you lol) lovely memento. As it started to fill in the atmosphere was fantastic everyone chatted, laughed, mingled, and cheered. This is the place to people watch the ladies with their gorgeous dresses and big hats, and big heels (bare feet later on ) drink was quite dear about £6 a bottle of beer, but hey it's only once a year. Food was fine we didn't go for a fancy meal pizza did us. Just before the big race the lights dimmed and the music show with fireworks began.....loved it. Then the World Cup race and then Jennifer Lopez to end a fantastic night. Kinda organized chaos afterwards getting a taxi but we managed.....All in all we had a fantastic time and so glad we were there. :-)"
        }, 
        {
            "index": 377, 
            "rating": "5", 
            "review": "Super Saturday. A first class facility with great racing action. We visited on Super Saturday and had an excellent time. We got tickets in the Parade Ring Lounge and were up close and personal with the horses and all the action. Great service surrounded by great action and wonderful people."
        }, 
        {
            "index": 378, 
            "rating": "5", 
            "review": "Amazing Racecourse. We went to the tiered restaurant and had an amazing meal while having a great view of the racecourse. The building itself is amazing, its worth going just to see the grandstand. Entry to the main stands are free.For a country that aren't allowed to gamble, it has a great atmosphere and every one is cheering at the finish line. There is a free bus that takes you back to the main town for free at the end of the night, but if looking for a quick exit, there are plenty of taxis, and they are cheap."
        }, 
        {
            "index": 379, 
            "rating": "2", 
            "review": "Another venue with no traffic engineering. We went this past Saturday to the races. After being in Dubai for 9 years, when we received an invitation from Emirates, we decided to go.Firstly getting there is a disaster. The same road is used once taxi's drop you off, so no traffic engineering or forethought has gone into the design. Getting out is another story...The food quality at the Emirates hospitality tent is appalling and if this is showcasing what they can do, they are doing themselves a huge disservice.Food is served on plastic plates and drinks in plastic cups, this is the world's richest horse race, premiere occasion and everyone dressed up, eating as if you are in a fast food court in Al Quoz.All in all a terrible day and waste of time."
        }, 
        {
            "index": 380, 
            "rating": "5", 
            "review": "World's best architectural beauty. I am lucky and fortunate to ba a part of the Meydan team while this was developed from March 2007 and culminated in March 2010 to be presented to the world by HH Sheikh Mohammed Bin Rashid, you must visit this while visitng United Arab Emirates (Dubai/Abu Dhabi), the bubble lounge restaurant, the world's longest grandstand with marina, world's largest LED screen, only dual equine racetrack (turf and synthetic), largest carpark (shape based on national bird falcon), the crescent roof with LED lights, everything came alive from our visionary leader's dream. The five star Meydan hotel is adjacent, with IMAX theatre."
        }, 
        {
            "index": 381, 
            "rating": "4", 
            "review": "Expensive, glamorous, pretentious. Dress up to the nines, socialize and drink! - Arguably one of the best days out in Dubai. We were in the Apron Views section; Moët Chandon area. It's expensive: 320AED entry plus 600AED minimum per bottle of champagne. Wish there were healthier food options. LOVED JLo as the after race entertainment! Advice for ladies: wear comfortable shoes!!!"
        }, 
        {
            "index": 382, 
            "rating": "4", 
            "review": "World Cup 2014. A wonderful venue, however, starting to fray at the edges. We purchased a Sky Bubble ticket which is a function area at the very top of the grandstand, comprising 3 floors. Due to poor ticket sales only part of the 7th floor was turned into a function area with food and beverages. This was quickly swamped by ex pats who tucked in to the unlimited alcohol and soon lost interest in the races and went into party mode. The next two higher floors were empty and there were some spare chairs, so we and a handful of others , went up there, enjoyed relative peace while watching the races. The trouble with the Sky Bubble is it has a massive structural steel triangular lattice to support the glazing, which obstructs the view markedly. Also there are no outdoor balconies so you miss the noise and excitement of the race. In the end we ended up in the general public area, trackside on the grass and enjoyed ourselves much more. The general cleanliness of the Sky Bubble area was poor with door handles missing on external doors, filthy toilets on floor 8 and dirty glazing. Nowhere near the crowd of Flemington on a Melbourne Cup, considering the prize money on offer."
        }, 
        {
            "index": 383, 
            "rating": "5", 
            "review": "Great organization of Dubai Horserace world cup. As we attend every year this special annual world cup , such a great organization from arrival with huge parking space availability , guidance on the way to reach hotel where the race taking place , in the premium lounge where we were booked a lavish buffet and open bar were inclusive ,direct access to grass field just few meters away from the race track where the horses passing is given to guests of this area which is great , as the tradition with such events everyone super dressed up and ladies decorating their heads with the different colorful hats making this event such a joy and fun ! we will be back again next year for sure ! only wish if event could be held on Friday instead of Saturday as next day is working day but understanding that many guests and organizers come for a weekend from Europe and around the world . keep up."
        }, 
        {
            "index": 384, 
            "rating": "5", 
            "review": "a touch of england in the middle east.... want to get all geared up and have an eccentric hat and fab outfit ladies? I sipped orange juice but champagne is flowing and the horses are so beautiful definitely something to see... I find the fauna of the crowd more interesting than the horses, as individualism is at its best! but love the horses ..."
        }, 
        {
            "index": 385, 
            "rating": "5", 
            "review": "magical meydan. we went to teirs restaurant with a fab view and top class service. great food and drink and very glamorous! will definately be going again."
        }, 
        {
            "index": 386, 
            "rating": "5", 
            "review": "5 Star 5 Star 5 Star Wonderful. Upon arrival the grandure of this place just amazes you, We had tickets for the parade ring & lounge area and it was simply exquisite, Very luxurious, very nice reasonable priced food available, Alcohol served, Stella was £8 a pint. The facilities, the staff, the pick 6 ticket was alot of fun, you could even win a car on the night, I could not fault anything about this place, Simply amazing cant wait to go back, will try the tiered all in restaurant next time, A nice place to get dressed up, have a lovely evening, taxis as always cheap & plentiful."
        }, 
        {
            "index": 387, 
            "rating": "5", 
            "review": "Top notch evening. We were in Dubai and it coincided with a race night Thursday 13th March the last race of the season before the gold cup. we booked in advance online tickets for silks including food and drink. We arrived at around 6pm and were shown to our table with a glass of prosecco. There was an outside balcony area offering seats and view over the racecourse. From that moment on the drinks were flowing and the service was fantastic whenever your glass looked empty another was brought from the great selection offer. The food was great and such a choice. Loads of shellfish within the starters. A carvery of beef was also available. You could just graze all evening. The racing was a great thing to see. We had a great eveing and would return. Taxis were easy to get afterwards outside."
        }, 
        {
            "index": 388, 
            "rating": "5", 
            "review": "A sense of brotherhood. Leaders are identified by humanity and vision. On behalf Meydan can find. humanity, vision, hospitality, sports and whatever you want. "
        }, 
        {
            "index": 389, 
            "rating": "5", 
            "review": "Fantastic value and night. This was our first night on our trip and we only managed a 2 hour sleep before going having been up pretty much 28 hours. We thought it was going to be a struggle truth be told. Taxi from JBR was £13 including tip which is pretty amazing considering the distance covered. Same trip back home would easily be £50. It's a wonderful setting from the outside and reminded me a lot of Ascot back home. I had bought tickets for Silks restaurant with free alcohol for about £70 which turned out to be the best value ever. From the moment we arrived at 6pm to the minute we left at 10pm, our glasses were topped up constantly with lovely Prosecco. The views from our table looking over the course were magnificent and we could sit outside for each race and still be topped up. The good was exquisite. Glorious. Amazing. Fantastic. Many other ways to define excellent. Great variety and felt more gourmet than buffet. Constantly refreshed and heated perfectly as well. The guys were really helpful when puting on the pick 6 and tricasts etc and whilst we didn't win any of the big prizes on offer, it was good to have the chance without paying a single penny......or dirham.... as it's free to enter. When leaving there were plenty of taxis and we got back to our hotel very sharp. An excellent experience and one I would urge all to do if lucky enough to be here when racing is on."
        }, 
        {
            "index": 390, 
            "rating": "4", 
            "review": "A nice view and nice lounge to chill at.. A nice view and nice lounge to chill at while catching a horse race at the same time. It is a huge venue. Service was a bit slow and under staffed."
        }, 
        {
            "index": 391, 
            "rating": "5", 
            "review": "Beautiful, Fun, and Free. We were lucky enough to make it to a race during our stay in Dubai. General admission is free to anyone, just be aware that they don't sell alcohol or food. The Meydan is stunning, and the horses are beautiful. The building is worth going in itself. After a couple of races, we had drinks at the connected bar, Qube, and watched the final race and people watch (including the jockeys). Next time, I think we'll opt for getting into one of the boxes."
        }, 
        {
            "index": 392, 
            "rating": "5", 
            "review": "What a great night out.. This has to be the best value night out in Dubai. We paid around £80 per head for the tiered restaurant which included a fabulous four course meal, alcoholic drinks and the racing entertainment. The views were spectacular and you could just about drink the cost in wine alone (at Dubai wine prices). The best meal and night out possible in Dubai."
        }, 
        {
            "index": 393, 
            "rating": "5", 
            "review": "Fabulous evening's racing. With two nights to spend in Dubai we were so lucky that there was racing at Meydan. It was one of the best evenings I have experienced ever. We booked tickets for the Silks restaurant before we left the UK. On arrival at the racecourse we were transported to the ticket collection office where our tickets were in our hands with one minute. No queuing or waiting for them to be found. Once in the restaurant the views of the course were amazing and my husband and I upgraded our tickets so that we could have some drinks with the delightful buffet which ran all evening. The staff looked after us very well indeed especially the young man from Nepal (I am sorry I don't have his name).The racing was magnificent - all the horses were top class. Sheik Mohammed has really built a first class venue. Ascot and other top English courses could learn many lessons from Meydan. Brilliant."
        }, 
        {
            "index": 394, 
            "rating": "5", 
            "review": "Fantastic Meydan. My wife and I visited on 6 February and I satisfied a long term dream to visit the track. We did the tiered restaurant package with drinks at £75 each and I can not fault anything . Our table at the lowest level was immediately above the combined parade / winners enclosure. We had a super view of the finish and the large screens are the largest I have seen at any event. We enjoyed smoked duck breast followed by lamb shank or a fish dish followed by cheese and biscuits. The accompanying wines were enjoyable too. We had almost exclusive service from a relatively new Indian waitress and she did a wonderful job throughout. Every member of staff we encountered was a credit to Meydan.Top tip is the first race is not usually included in the six to follow!Top tip two is allow 30 minutes in aCar from Dubai MallOur taxi was able to drop us off and collect us without delay but there was not a full house."
        }, 
        {
            "index": 395, 
            "rating": "4", 
            "review": "Fantastic Night. Went to Meydan Racecourse with a friends.There is ample parking and it is easy to get into the track. Once inside, I was greeted by helpful staff. My friends and I were in the Premier Section, but even the free areas appear to be well maintained, clean, and it is easy to see the track.There is are several venues for eating and the prices are reasonable. The food and drink are good quality and staff members will bring your orders directly to your seat. The stands allow for easy viewing of the race action as well as the pre race activities. There is also the opportunity to win prize money and everyone is allowed to participate and the picks are explained prior to the start of the first race. This is truly a nice place to spend an evening and the facility is first class. I highly recommend a visit to the racecourse for a fun evening with family, friends, and it is kid friendly."
        }, 
        {
            "index": 396, 
            "rating": "5", 
            "review": "amazing. booked silks.the food drinks service were beyond reproach.only passed ayr racecourse today 08 /02 /2014 and the billboard stated hospitallity started from £125 idon`t think so! time they woke up and smelt the coffee."
        }, 
        {
            "index": 397, 
            "rating": "5", 
            "review": "good night out. great value compared to UK racing . Lovely food and the entertainment was fab ! The only down side was the taxi wait was abit long."
        }, 
        {
            "index": 398, 
            "rating": "5", 
            "review": "everything is 5 star. Went last year at \"Carnival\" time & could'nt wait to get back.if you can then you must go for the tiered restaurant.4 course meal, all the wine you can drink overlooking the parade ring & winners enclosure & of course the track.Huge wide screens right opposite.If you like your racing then this is the best £75 you will ever spend.Excellent quality of racing which encourages a lot of the top jocks from Britain to \"winter\"Try getting this value in U K , absolutely impossible"
        }, 
        {
            "index": 399, 
            "rating": "4", 
            "review": "For the free racing but it was excellent - will go again & even pay!. After a year in Dubai we finally made it to Meydan racecourse. Entry was free and there were 6 races on the card. It included some top jockeys like Fallon & Dettori.... Food was very reasonable & plenty of seats in the Grandstand. It was Chinese New Year so between races there was even entertainment on the stage. All in all a good night out...(racing starts at 18:30 due to the heat)."
        }, 
        {
            "index": 400, 
            "rating": "2", 
            "review": "MEYDAN REVISITED. I visited Meydan in January 2012, and booked seats in The Tiered Restaurant - a wonderful experience. My family in Dubai have been to (I think) Silks, again a good experienceThis month I revisited to take advantage of the free entry, and to admire a 5.5 furlong stand. There was good quality racing, a Listed Race, but no Group Races, but under the floodlights and the all weather track being so far away, we might just as well have been at Wolverhampton!The catering is a choice of franchised outlets; I hate McDonalds and KFC, but they would have been welcome. The Red Carpet Restaurant stall was particularly virulent.I love racing; I do not bet so that was not a problem; I like a drink on course but that is not available in the public enclosure. the race cards (free) did not list the officialsIf you like racing go to one of the better enclosures and have a good night outIf you want to take a look at the free enclosure, take your own picnic and a hip flask.I look forward to being back at Bangor soon. On a long holiday, I also went racing in Bangkok and Motokurara - I hope to report, but Tripadvisor cannot recognise them!Enjoy your racing on holiday!"
        }, 
        {
            "index": 401, 
            "rating": "4", 
            "review": "Excellent Facility. I had the pleasure of attending the horse racing at the Meydan Racecourse and was impressed with the facility. There is ample parking and it is easy to get into the track. Once inside, I was greeted by helpful staff. My party and I were in the Premier Section, but even the free areas appear to be well maintained, clean, and it is easy to see the track. There is are several venues for eating and the prices are reasonable. The food and drink are good quality and staff members will bring your orders directly to your seat. The stands allow for easy viewing of the race action as well as the pre race activities. There is also the opportunity to win prize money and everyone is allowed to participate and the picks are explained prior to the start of the first race. This is truly a nice place to spend an evening and the facility is first class. I highly recommend a visit to the racecourse for a fun evening with family, friends, and it is kid friendly."
        }, 
        {
            "index": 402, 
            "rating": "5", 
            "review": "Beautiful race course. Here horses are treated better than many human beings, in their training facilities!!The race course is built with the all weather material, which protects horses from getting injured.A very glamourous event is the DUBAI WORLD CUP, every March. The richest Horse race in the world, due to the horses value and prize given (10m USD)"
        }, 
        {
            "index": 403, 
            "rating": "5", 
            "review": "Fantastic. We had an enjoyable night of Racing after purchasing a ticket with a view of the winners enclosure No winners but a good evening. Not very busy I'm sure that will improve closer to the Carnival"
        }, 
        {
            "index": 404, 
            "rating": "5", 
            "review": "Dubai World Cup,. Nothing suits Dubai like the Dubai World Cup.Being the Worlds richest Horse Race, the World cup entices all lovers of horse racing together. From the entertainment, the racing, seeing the best jockeys in the world and the whole ambiance all in one.If your in town during the end of March, you have to book your tickets early and experience a one in a life time day at the races."
        }, 
        {
            "index": 405, 
            "rating": "5", 
            "review": "Fantastic Horse Racing. The racing in Meydan is a fantastic way to spend some quality time watching some of the worlds best horses. They have different levels of tickets including fee tickets, but I suggest buying parade ring passes. you get up close to the horses, see the jockeys and trainers.Love going to Meydan races."
        }, 
        {
            "index": 406, 
            "rating": "5", 
            "review": "Fabulous experience. What an amazing race course the stand is fantastic and looks stunning at night which us when we went. Staff here are brilliant and we were taken to the entrance by golf buggy to buy our tickets and then dropped off at the entrance loved it!"
        }, 
        {
            "index": 407, 
            "rating": "3", 
            "review": "Pleasant venue.. Visited 2nd Jan so not Dubai World Cup but still good evening. Entry free and seating on ground level plus level 1 and 2. We didn't book for tiered restaurant which I am sure is a great experience. Food Hall was typical fast food with lots if kids about. Not quite racing experience I am used to but a pleasant way to spend the evening."
        }, 
        {
            "index": 408, 
            "rating": "4", 
            "review": "Meydan Golf Course. There is a 9 hole Golf Course along side the RaceCourse that we played. It was good value and the course was in very good condition. Not too expensive and a soft drink and Burger was part of the deal in the excellent clubhouse. As with most Courses in Dubai Driving Range, buggies with ice filled coolers congaing bottles of water are all part of the deal. As dusk drew close on came the floodlights so play continued"
        }, 
        {
            "index": 409, 
            "rating": "5", 
            "review": "First meeting of the season. Meydan on a \"standard\" evening's racing is Ascot without the attitude; Churchill Downs without the crowds; Flemington without the Fosters; Longchamp without the \"louche\". In other words its a world class racing venue with a true soul. Strange to be somewhere where gambling is not permitted but there is a free to enter competition. At the bargain basement end is free admission but we went for broke and reserved a table in the pay-and-view \"Tiered\" restaurant. A choice of 2 starters, 2 mains and dessert plus wines and other alcoholic drinks for 450 dirhams for the pair of us - excellent views, excellent food and excellent value. To be fair this was the first meeting of the season so there were a few glitches with the service but nothing that spoiled the overall enjoyment of the evening. As a first time visitor there are a couple of tips we have noted:The first race for most evening meetings is at 6.30pm which coincides with some of Dubai's worst traffic jams so factor in plenty of time to get to the course.If booking tickets on line they can be easily collected on the evening from the ticket office this avoiding any risk of postage / additional costs.Anyone keen on racing visiting Dubai during the \"season\" should make an evening at Meydan a MUST!"
        }, 
        {
            "index": 410, 
            "rating": "4", 
            "review": "Nice 9 hole course.. The course is well presented with some challenging holes. The clubhouse is modern and has a restaurant and sports bar. You can play in the evening as it is floodlit. Very enjoyable visit."
        }, 
        {
            "index": 411, 
            "rating": "5", 
            "review": "Races , good resturants and nice place to stay iin. I love races .. But when i visited it was off season so i enjoy the beautiful hotel and good resturante ..\nI really love the design of Mydan . You can watch the race from you hotel room or from the launges"
        }, 
        {
            "index": 412, 
            "rating": "5", 
            "review": "Not just a racecourse. Within the confines of the Meydan estate and dwarfed by the fabulous racecourse grandstand, lies the nearest thing to a public golf course that you can experience in the UAE. A challenging nine hole spread of a superbly maintained and managed golf course with all of the facilities that any social or competitive golfer could possibly want. Fully floodlit to accommodate golf at all hours, The Track Golf Course at Meydan is a very pleasant and welcoming establishment, and it was no surprise to see that Troon Golf - possibly the best golf facility management company around - were responsible for the day to day organisation. After the golf, the QUBE Sports Bar lives up to all of the other top quality features that the Meydan Estate has to offer. Definitely a 'must return to' on my next Dubai visit."
        }, 
        {
            "index": 413, 
            "rating": "5", 
            "review": "Incredible experience. My husband is really into racing and has visited many racecourses and this is the best by far! Track and grandstand are really fantastic. Even if you don't like the racing you will be impressed by this beautiful building. The staff at really friendly and were happy to go the extra mile. Although there was no racing on whilst we were there, we had a great time and got to see some of the horses. Will definitely be back."
        }, 
        {
            "index": 414, 
            "rating": "5", 
            "review": "Out of this world. The racecourse is amazing, we went to the Dubai World Cup 2012 and it was the most incredible experience I have ever had. The vast size of the place and the atmosphere was out of this world."
        }, 
        {
            "index": 415, 
            "rating": "3", 
            "review": "Stunning venue. Besides the gorgeous horse racing track and grounds, there's really nothing going on here BUT if you are a fan of architecture, landscaping, and horses, this is a must visit."
        }, 
        {
            "index": 416, 
            "rating": "5", 
            "review": "Great day/night out. This massive event lives up to the hype! The atmosphere is fantastic and everyone makes a great effort on the day. Not being to actually bet at the venue is bizarre but easy to circumvent. Overall, the overriding feeling is one of enjoyment and that people are there to have a good time (which is not always the case at other Asian race courses). Delighted to have gone and would go back in a minute."
        }, 
        {
            "index": 417, 
            "rating": "4", 
            "review": "Races and happy Faces. Was there during the World Cup...what an atmosphere with the racing under the most brilliant floodlights....the presence of the reigning Sheikh and family just added that pazaz to the whole deal! Great!"
        }, 
        {
            "index": 418, 
            "rating": "5", 
            "review": "Amazing visit for racing fans. Went here on the first evening of the 2012 / 13 season . I am a huge racing fan and always wanted to see this magnificent venue . I was not dissapointed it was fantastic . On arrival your photo is taken with a track backdrop a lovely souvenir to have and not to expensive. Food and drinks available at reasonable prices for dubai and a great night out."
        }, 
        {
            "index": 419, 
            "rating": "5", 
            "review": "Don't miss it. We were lucky just to arrive in Dubai to see the World Cup. Don't miss the opportunity to see the world greatest horse race. The racetrack is than everything in Dubai big and beautiful. You can see the best racehorses during an evening. The opening ceremony is amazing"
        }, 
        {
            "index": 420, 
            "rating": "5", 
            "review": "Meydan The Track Golf Course. Had the pleasure of recently playing the Meydan The Track golf course, and enjoyed every minute of it, was great value at 222DHS which included range balls and cart hire, will be playing there again asap."
        }, 
        {
            "index": 421, 
            "rating": "4", 
            "review": "World class. World class facilities...world class jockeys world class horses....all big rollers...pay a visit during the dubai gold cup to experience the amazing meydan....keep an eye on the calendar for the dubai gold cup..."
        }, 
        {
            "index": 422, 
            "rating": "5", 
            "review": "Dubai world Cup 2013. We were very excited to attend our first Dubai World cup last Saturday March 30, 2013. Dubai world cup is the richest thoroughbred horserace with a total combination prize of $27.25 million of 9 races. The last rase being the world cup race prize was $10million.13 countries participated at the event. 10 -16 horses participated in each race. The race is held annually at the last saturday of March at Meydan racecourse . We arrived at 5 pm, doors had been open at 2.00 p.m and the first race had started at 4.30. As we were pulling in to the parking lot we waited inline for a good 20 minutes. They had public parking a little away from the racecourse . They had shuttle buses transporting ppl from the parking lot to the racecourse. It was timely and very organized. Tikets ranged from 25 AED - 3500 AED. We bought our tickets a few days ahead of time from the Meydan ticket office as we were told tickets will not be sold at the gate the day of the race.Surprisingly most of the high priced tickets were sold out only the 1200 AED and the 350 AED tickets were available. The difference was 1200 had drinks / food included and the 350 did not. However there were a few restaurants on the 1st floor. The Meydan racecourse is very impressive, takes your breath away at first glance. Having been open just 3 years a go, It is a modern racecourse with a majestic grand stand that accommodates 60 thousand spectators. Ladies were dressed to impress. Some made some serious fashion statement with outrageous hats and accessories. It was truly fun to see all the fashion hits and misses, certainly fashion police would have had a field day. There were some awards for the best dressed lady, best dressed man and best dressed couple. The ambiance was truly wonderful and relaxing. Nice weather, great entreatment, a fun place to socialize with friends.Between the races there were a few entreatments such as beautiful fireworks and very impressive acrobatic airplane shows. There were 9 horse races the last one being the big money race. I was rooting for the US based horses such as Royal Delta and Animal kingdom. I was so trilled to see 'Animal Kingdom' win the $10million race. This 5 year old thoroughbred race horse was pulled out of races in 2012 due to leg injury. It was so wonderful to see him win this race by an impressive two lengths. What a comeback !!After the award ceremony the celebration continued with an amazing solo concert of Seal . The concert was an icing on the cake ! excellent show. Seal was amazing as usual. Unfortunately we did not stay till the end of the concert as we had a flight to catch in a few hours.We thoroughly enjoyed this event. I highly recommend it. If we are in Dubai during the next world cup we will definitely attend.A few suggestions - The duration of the event is a good 10 hours. There will be a lot of drinking . I suggest to take a taxi home/ hotel. It is safe and saves you time from the parking long line.Dress fashionably but tastefully. Avoid too reviling dresses as it is offensive to the coulter. Keep in mind betting is not permitted in Dubai but world cup races are widely available for betting in the US. It is truly a glamorous and fun event. A must attend if in Dubai during the event.Enjoy!!"
        }, 
        {
            "index": 423, 
            "rating": "4", 
            "review": "World Cup. Excellent day at the World Cup. Layout to watch the race and facilities are good. Few points to be mindful off.Queues to the ladies - are about the longest I've ever seen. Admittedly it's a bit race, but happens every year and not sure what it's like inbetween, but the queues where back down the corridor. Fast food area - extremely slow. Waited for nearly an hour at the chicken stall (which looked to be the fastest queue). So time it here wisely.Taxi's - forget it. We gave up and got a bus to Emirates Mall and then made our way in a taxi from there. Friends told us the next day they waited nearly 2hours for a taxi, so staying later and the shuttle bus option proved to be a wise move, even though it seemed crazy slow at the time.Though the race and atmosphere itself while there is brilliant. And all the above aside, I would go again. Just make sure some plans b and even c are made in advance :)Enjoy"
        }, 
        {
            "index": 424, 
            "rating": "4", 
            "review": "Great spot. I am a regular at Meydan racing track, but its more than that. Some great restaurants and great bars.I recommend the Qube bar...great craic and great staff. Ask for Brenton when you are there. Will gladly show you around."
        }, 
        {
            "index": 425, 
            "rating": "4", 
            "review": "A Day @ the Races. Well laid out and organised..plenty of space, opportunities for dining, however the ladies bathrooms on the ground floor need to be better signposted. There were 50+ desperate ladies waiting to use the toilets on the level opposite the food court, when they one directly underneath were empty.The only dampenere on an otherwise fantastic day out. Next time will explore all the other amenities Meydan has to offer."
        }, 
        {
            "index": 426, 
            "rating": "2", 
            "review": "World cup.. What a farce!! Unorganised chaos.. Never again. Attended World Cup 2013 at Meydan.. With group of friends.. What a disappointment.. Tickets for apron views which was fine, nice views close to bars but NO seating.. Very small area of tables and chairs not sufficient for number of guests.. Had to stand all day in heels. Not a nice experience .. Food court .. What a shambles! Queues for tasteless dry chicken or pizza we wired 90 minutes for 3 pizzas!! Trying to get drinks from bar.. 20 to 30 minutes.. another useless poorly organised event.. meydan F & B manager should be ashamed. ..... Bathrooms! Ladies forget it unless you want to queue for 40 mins?? Very few toilets for apron views, Irish village area absolute bloody disgrace!! meydan wake up! You're selling drinks ( slowly) people need to pee.. . So many ladies complaining about lack of toilets... Oh the buses to get to car park after event.. What a complete and utter mess. No signs, no actual bus stops and people running after buses all over the roads.. Complete shambles ... Police directing traffic & buses but to where?? Nobody directing people to buses or organising anything! Could not actually believe what a mess it was.. Who was in charge of transport?? needs to wake up.. Totally horrid end to an already average day.."
        }, 
        {
            "index": 427, 
            "rating": "5", 
            "review": "A royal treat. We went for one of the early World Cup weekend race days and had a great time. Good atmosphere, with an opportunity to see the UAE royalty. If you want to eat well pre-book a Metdan restaurant as the booth food is distinctly average."
        }, 
        {
            "index": 428, 
            "rating": "3", 
            "review": "great race course forget about the food. We had a great night at the races, great views, staff were friendly but the food in Silks was not worth the money, wouldn't bother again"
        }, 
        {
            "index": 429, 
            "rating": "5", 
            "review": "Interesting. Even if you are not interested in horses it is a great place! Just go to Meydan Hotel for a cup of tea on the terrace, enjoy the park, the beautiful view, the fantastic architecture and the lovely cup of tea!"
        }, 
        {
            "index": 430, 
            "rating": "5", 
            "review": "Tiered Restaurant - fantastic views, food and night. We booked a set menu package at the Tiered restaurant. Every table had a fantastic view of the course and we were lucky to be in the middle so excellent view of the paddock and finishing line. We had a lucky six draw card to fill our before going to the restaurant so had some fun checking our horses against the entry. The food was excellent, 2 choices of starter, main and dessert plus 2 choices of white and red wine. Staff were excellent and very attentive, also asking when you wanted the next course to be served."
        }, 
        {
            "index": 431, 
            "rating": "5", 
            "review": "Amazing experience. We booked a package at the tiered restaurant for the Thursday night racing. What an amazing racecourse! Our table was overlooking the parade ring and very close to the finishing line. The view was spectacular. The whole atmosphere of the place was fantastic and on being shown our table we were given both the food and drinks menu. The food was excellent & much better than expected and drinks all very good brands (you could drink Remy Martin cognac all night if the mood took you!). The service was impeccable with drinks constantly being topped up & we were asked if we were ready to accept each course. Although not regular racegoers we thoroughly enjoyed the race programme & were excited to have the opportunity to watch Kieron Fallon race! The super six competition is a great way to get involved in the absence of gambling. We would thoroughly recommend this night out and fully intend to repeat the experience on our next trip to Dubai."
        }, 
        {
            "index": 432, 
            "rating": "5", 
            "review": "I love this place!. We have visited the Racing Carnival every year since the old days at Nad Al Sheba. At Meydan, we always go to the panoramic restaurant. It was initially \"finding its feet\" but gets better every year and the food quality and level of service this year was truly outstanding.Great views of the course although getting down to the paddock takes a while but it definitely makes a great night out. Highly recommended!"
        }, 
        {
            "index": 433, 
            "rating": "5", 
            "review": "Fantastic Night - A Must. On our visit to Dubai we decided to visit Meydan Racecourse for one of the Thursday night Dubai Racing Carnival series races after reading reviews here.We booked the Tiered Restaurant which was 450AED pp which includes house alcoholic beverages as well as a 3/4 course set menu. The views are brilliant onto the racecourse which gave you a clear view of the paddock as well as the track. Standard entry is about 25AED pp which gives you limited access in building but can go out by track.There is 6 races each Thursday night and you can book online which we did from the UK. Taxi out to Meydan was about 40AED and 30mins from our hotel in Bur Dubai area. There is no betting allowed which we forgot as Dubai is in a Muslim country, in which betting is illegal. This brings a weird twist to going to the horses. There is however a scorecard system in operation which is free, thus no betting. The card has the six races on it and you choose the horse against your program which is provided in each race and management take the body of the card away leaving you the counterfoil. I am unsure what the winning prize is as we were useless at picking the winning horses that night. The food is exquisite and the staff are very tentative to all your needs. There is a waitress/ waiter for ever two tables. We had a fantastic night and I would highly recommend a visit to the racecourse on your visit to Dubai."
        }, 
        {
            "index": 434, 
            "rating": "5", 
            "review": "My Father owns and loves Race Horses!. Two years ago, I had my father over from Vancouver, Canada. One of the favorite things we did together while he was here for one month is visit and watch the racing, we were able to make it to three race night out of four! I think he felt this was one of the best places (venue) for horse racing in the World and he's been to many of the other well know tracks World wide. All I can say is if your here in Dubai during race season then it is worth a trip and have a wonderful evening out with either family or friends to Maydan."
        }, 
        {
            "index": 435, 
            "rating": "2", 
            "review": "The worst Golf club ever. This is simply the worst golf course of the UAE. For the same price you can get a lot better. When you get there, you do not know if you are in a parking or in a golf club. Rates are very expensive. The golf carts are the worst of the UAE. Go and spend your money somerewhere else..."
        }, 
        {
            "index": 436, 
            "rating": "5", 
            "review": "Meydan Horse Racing, can't miss it !. We (My husband, Kids and I) were so lucky to had chances to watch the horse race whilst we're here, in Dubai. One of the most pretigeous horse race in the world. My daughter is crazy about horse and the racing, this is how we got to visit some of the horse race, either when it was still in Nad Al Sheeba and now in Meydan. Of course we did not go every weekend (usually on Thursday night). We always had a good time there, watching the racing along with the nice dinner at the suite or the restaurant, was wonderful."
        }, 
        {
            "index": 437, 
            "rating": "5", 
            "review": "Amazing track!. The horse racing season is only a few months a year, and then only on certain days of the week, on Thursdays and then maybe on one day on the weekend. We got the paddock passes which allowed us to roam freely for the most part. There is a hotel there also and if you stay at the hotel, I believe you can get a room with a balcony that overlooks the track. We stayed and had dinner at a lovely restaurant there on the ground floor by the paddock. The food was DELICIOUS and reasonably priced. There is no betting there, of course, but the races were fun to watch regardless. There are gift shops there so you can get a nice memento, but the prices are crazy high. It was a GREAT time at a GREAT facility."
        }, 
        {
            "index": 438, 
            "rating": "5", 
            "review": "Best night of our holiday. We booked a table in the Tiered Restaurant for the last night of our 5 day trip and I can honestly say it was the absolute high point. My boyfriend is a racing journalist and I'm a keen race-goer so we were both looking forward to the actual racing but the hospitality was second to none. The price of the tickets for two worked out at less than £160 and for that we had a delicious 4 course dinner and unlimited alcoholic drinks for the evening as well as having the best seats in the house. Getting out the taxi, the course certainly has the wow factor and once we got up to the restaurant it was equally as impressive. Huge floor to ceiling windows gave uninterrupted views over the course and our table directly overlooked the parade ring and has an excellent view of the finish line.All the staff were super helpful and friendly and nothing was too much trouble, lots of photo taking!!!The meal was delicious, and spaced over the evening so you could enjoy the racing between courses. It was a very different experience to racing in the UK due to the lack of betting but the \"pick 6\" competition they run did give an element of excitement to proceedings.Overall though I can't recommend the experience enough, it was excellent value for money, completely fabulous and racing in England will never be the same again now I've experience it Dubai style."
        }, 
        {
            "index": 439, 
            "rating": "3", 
            "review": "Meydan Golf The Track. Apologies to horse racing fans as this is mostly about the golf facilities.Having been a fan of the original Nad Al Sheeba facilities including the golf club I was disappointed with the new 'Track' facility that has been built around what remained of the old course. The grass quality is poor and patchy, on the occasion we plaid two holes floodlights were out and the signage around the course is so small and unlit it doesnt make finding your way easy. For the same cost there is the lovely Faldo course at the Emirates course.On a positive the track is amazing as is the grandstand it will be even better maybe world class when it is all finished lots of loose ends everywhere."
        }, 
        {
            "index": 440, 
            "rating": "5", 
            "review": "Brilliant racecourse!. We visited on 10.01.13 and had an amazing evening. We ate in The Tier restaurant which was excellent, brilliant food and service at a very good price in comparison with racecourses around England. The racing was enjoyable and I would recommend visiting even if your not a racing fan as its an unforgettable experience."
        }, 
        {
            "index": 441, 
            "rating": "5", 
            "review": "While in Dubai you have to visit Meydan Racecourse. We booked the restaurant package online for the Tiered restaurant, which included entrance fee, a delicious 4 course meal and alcoholic drinks for £80 each - and it was well worth it. Easy transaction where you just show your printed confirmation at the ticket office and they give you your badges and racing pack. Waiter service at a lovely table overlooking the finishing post, with stunning views across the course and what an atmosphere. It was all very well organised with excellent service: we will be back."
        }, 
        {
            "index": 442, 
            "rating": "3", 
            "review": "Fantastic Structure. This race course is streets ahead of any other racecourse in the world. However the infastructure is lacking, massive car parks but bad traffic jams, taxi ranks, everybody seems to jump the lines. Restaurants everywhere but food leaves alot to be desired.Best thing to do is buy a cheap seat, which is great value for money, watch the races and bring your own food oh and arrange for a car hire or taxi to pick you up at a pre-determined spot, then you will have a great time. Also, try going to the weekday races which is less cowded."
        }, 
        {
            "index": 443, 
            "rating": "5", 
            "review": "Fantastic night what. Great venue. We booked to go racing here whilst still in the uk and I have to say we really was not disappointed. We booked the meal & drink package in the tiered restaurant and was had a fantastic night The food was very good the drink was served throughout without us needing to ask for it. And the racing was just exceptional! We was seated so we could see the winning line easily. The track is simply beautiful We had a fantastic evening from beginning to end. Say didn't win on the pick 6. It we didn't care as the night was extremely good."
        }, 
        {
            "index": 444, 
            "rating": "4", 
            "review": "The World Cup. The atmosphere, the electrifying positivity in the air - Dubai out does itself every year. It seems like one big party, celeb watching and dressing up to the hilt all a part of it. Event not to be missed."
        }, 
        {
            "index": 445, 
            "rating": "5", 
            "review": "A Great Night at the Races!. I took visitors to the first race meeting of the new season last Thursday (8th November) and had booked dinner at the Tiers Restaurant. We had a wonderful evening. The racing was fun and we each had a go at the 'Pick Six' free competition. The restaurant was excellent. The ambience was modern, but very stylish. The food, drinks and service were first class. And the view of the parade ring and race course was outstanding. The full length windows were right above the parade ring and opposite the winning post. Couldn't have been better.Everything at the race course was well organised and all staff were very courteous. Overall, a wonderful evening."
        }, 
        {
            "index": 446, 
            "rating": "1", 
            "review": "Fur Coat and no knickers!. 2012 world cup, we paid for the 1200aed tickets for VIP seating and all inclusive (food and drinks). This is no means the most expensive package but never the less not cheap. We should have gone with the 300aed seats.The food was inedible, cheap and poor quality and variety. Dried out spring roles, sad sandwiches and rock hard scones served on plastic plates in a canteen.The drinks available were limited and again poor quality... for 200 pounds I would expect more.The seat area was quiet, no atmoshere and this was only made worse by the death of 2 horses, one in the first race. I know this cannot be helped but all in all this was the most expensive and disapointing day we have ever had in Dubai. In total almost 3,000aed for my and I which we could have used to go to Oman or anywhere for a weekend away."
        }, 
        {
            "index": 447, 
            "rating": "5", 
            "review": "Amazing Day Out!. This is definitely the event of the year! We've been several times and its fixed in our calendar as its so much fun. Forget the horse racing, just go for people watching, champagne and a good old fashioned knees up!"
        }, 
        {
            "index": 448, 
            "rating": "5", 
            "review": "A Great Day Out!. This is a great day out: an excuse to get dressed up, meet up with friends and have a fantastic time"
        }, 
        {
            "index": 449, 
            "rating": "5", 
            "review": "The expats day out..... One of the best days out in the year for expats residiing in dubai. a party atmosphere joined with plenty of alcohol. a great day out."
        }, 
        {
            "index": 450, 
            "rating": "5", 
            "review": "Great night out. Would recommend this. great night out for all, great banter"
        }, 
        {
            "index": 451, 
            "rating": "5", 
            "review": "The Dubai World race meeting at Meydan. Well the horse which I liked and fancied Won the Dubai World Cup for the UAE"
        }, 
        {
            "index": 452, 
            "rating": "5", 
            "review": "The race of champions. The horses represent countries and the crowd is a global mix of racing buffs.. Superb venue with state of art stands and viewing options ..\nvery well organised .."
        }, 
        {
            "index": 453, 
            "rating": "3", 
            "review": "Dubai Gold Cup. Overpriced but a good day out with everyone dressed to thrill!"
        }, 
        {
            "index": 454, 
            "rating": "4", 
            "review": "First time exp. This was my first exp of horse racing. It was fantastic. The best dressed crowd I have ever seen. A lot of fun. Its more about the social experience rather than the horse race."
        }, 
        {
            "index": 455, 
            "rating": "4", 
            "review": "Take the high seats. Spent a lot of money on Premium seats #3. Avoid this area if you want to see the race. We had 2nd row seats, which meant that someone was standing in front of us continually. Fortunately, we were able to walk around on the apron to get a better view. The bathrooms were out of order for the first 3 races - no water and trashed. I did not think the food was as bad as some of the other reviews, but it was a madhouse trying to get to the buffet. Better crowd control is required because some people refuse to queue. Beautiful facilities, but with a few kinks to work out still. The horse racing however was first rate. Everything that you would expect from the richest race in the world. Over-the-top entertainment in between races. There was a helicopter circling during the races that made it impossible to hear announcements - like having a race at an airport."
        }, 
        {
            "index": 456, 
            "rating": "4", 
            "review": "Dubai World Cup 2012, plenty of drama!. The Dubai World Cup is one of the biggest event of the Dubai social calendar and is open to everybody, the cost depends from the ticket you buy, from the simple one to the VIP areas. At the Meydan race course you will see all the social fabric of the emirates which is very interesting, and also lot of visitors because these races attract people from all over the World. You will see the most elegant ladies in Dubai in their finest outfits, some also in dreadful attires just to attract attention! At least one month before the event, which always takes place at the end of March, the tailors in town are busy, ladies are choosing dresses, shoes, trying the hats and fascinators which just arrived at M&S, Debenhams but also, for more up market, at Al Wafi mall, Burjuman and the best address in Dubai for the most beautiful hats, Eve Michele in Jumeira. The local magasines (Ahlan, Grazia...) give fashion advices for the occasion. There is a lot of anticipation and excitment in town prior to the big event and the hope for some ladies to win the best dressed, best hat prices. Before, the races used to be in Nad al Sheba but three (I think) years ago it moved to bigger and better facilities at Meydan. I went twice to the event in Nad al Sheba and liked it very much, so I was very excited for the first time at Meydan. The weather was nice which was a relief because the days before had been dusty, windy and hot and everything was going very very well until the 3rd race. One of the horse fell badly during the race, didn't get up and the race had to be cancelled. I was completely shocked because the few times I went to a big race, twice at Nad al Sheba and twice au Grand Prix de l'Arc de Triomphe at Auteuil Paris, I didn't witness an accident like that. It spoiled my pleasure a little and made me think that \"un accident est si vite arrive\" (an accident happens so quickly), in a second in front of your eyes. This is part of the sport of horse racing I suppose but I didn't really realised this until now. It is not only nice hats and designer dresses, there is also pain and hurt in it. I didn't stay until the end and I read later that 2 other horses were hurt when the race ,which was cancelled ,was rerun! I am not sure I would like to go again next year, the fun went a little out of it for me."
        }, 
        {
            "index": 457, 
            "rating": "3", 
            "review": "Awesome! If you don't eat.. Today we were invited for THE race. No need to highlight the venue. The best Dubai has to offer its people. Great views, fabulous track, unfortunately a horse broke its leg, Sheikh Mohammed was there, great fire works, sky diving, a stunt plane, name it. But how on earth do they dare to serve this food???? They should be ashamed! Sandwiches without fantasy, dry, boring. But even worse was the buffet diner. I went for seafood. Cheap, seared Chilian salmon, tasteless, pale. Presented by a chef of the JW Marriott. A 5* hotel. Big mistake. The sushi wasn't sushi, but a disaster, thai fish cakes, embarressing! Dim sum: if you don't know how to make it, just don't try. The only chef how's ok is the pastry chef. His chocolate mousse was great, as were the carrot cakes. The rest of the food was a big, BIG disappointment. Reducing food costs doesn't mean offending or mistreating your guest. People who paid a lot of money for a nice time out."
        }, 
        {
            "index": 458, 
            "rating": "4", 
            "review": "Ascot on steriods. The grandstand and facilities at Meydan are miles ahead of any other racecourse in the world. Around £27 will get you a gold badge which gives you access to the trendy glass fronted paddock lounge and your own seat (very comfortable) in the grandstand. The beer is expensive but having waiter service and not having throwing elbows at the bar to get a pint between races for me makes up for the extra cost. It's a very different racing experience but not necessarily better. For me the place lacks atmosphere (I went on Super Saturday 2012). In fact, I drew a few puzzled looks as a shouted my horse in, very different to Cheltenham the next week.Definitely worth a visit but for me it''s behind Longchamp, Cheltenham and York in the top racecourse stakes."
        }, 
        {
            "index": 459, 
            "rating": "5", 
            "review": "Fantasy Racing. We went to the Tiered Restaurant at Meydan for Super Saturday. This race meeting is a few weeks before the World Cup and includes some the horses running in the World Cup plus all the top jockeys including F. Dettori.The racecourse and grandstand are perfect. Almost looks unreal. Tiered Restaurant is an amazing experience. Superb seats and service. What a way to watch horse racing. A must do in Dubai even if you have no interest in horse racing.Only downside was the meal was not great but overall this did not prevent us loving the whole experience."
        }, 
        {
            "index": 460, 
            "rating": "5", 
            "review": "A great event. Have been to all of them since it moved to Meydan. Great opportunity to drew up and be seen(and watch a few who have imbibed beforehand falling off their Louboutins). The entertainment is excellent and a decent set of horses usually wins."
        }, 
        {
            "index": 461, 
            "rating": "5", 
            "review": "the horse paradise. this is a must see attraction in Dubai we were lucky the racing season only happen in march so we were able to see the races on the 17 march 2012 the final is on dubai cup on the 31 march. YOu would see what money can do , dont forget the sheick of dubai is a horse fanatic this race track cost 2,2 to 3 billions dollars with the hotel attach to it a must ssee in dubai"
        }, 
        {
            "index": 462, 
            "rating": "5", 
            "review": "Loving Duba. I love the horse racing in Dubai. It's a rare chance to dress up to the nines and get to see some really good fashion, and have a great time. The horse racing is good fun too."
        }, 
        {
            "index": 463, 
            "rating": "4", 
            "review": "Colourful and buzzing. If one enjoys the races then the Dubai World Cup is world class and an international event, a must see. The Meydan is a very grand and impressive building, designed to look like a falcon, with a 5 star hotel ,all has been taken into account."
        }, 
        {
            "index": 464, 
            "rating": "5", 
            "review": "Royal Ascot with warmth. I took my daughter and her husband to Meydan in March. I determined not to stint, so pre-booked tickets for the Terrace Restaurant. What a night out, even if you are not a racing fan!A 7 course dinner - all small portions so not bloating, but all delicious. Drinks included (less champagne), a waiter devoted to our table, which overlooked the paddock, and the winning post. Excellent racing including a Group 1 Race. When I asked to leave the air conditioned terrace to go down to the paddock, an escort/guide was provided.This was racing in style and comfort. If only they had jump racing there!"
        }, 
        {
            "index": 465, 
            "rating": "5", 
            "review": "horse racing. Fixture of Dubai sporting calendar, dress to impress"
        }, 
        {
            "index": 466, 
            "rating": "5", 
            "review": "Best racecourse I've ever visted. I had a great night out at the horse racing.The Meydan racecourse grandstand is simply amazing. It is about half a mile long with fantastic facilities and views over the course.I sat in the Premium Seating (approx £10) and you get a great view with refreshements served at your seat if you wish. A pint of beer was about £6 though. The Pick 6 game is a bit of fun with a really good cash prize to the winner if you can pick all 6 winners.Getting back to the city centre afterwards was a bit chaotic - there seemed a lack of normal taxis so I ended up getting a private hire car which was about double the normal price. Still only about £11 to get back to city centre though.If you are a sports fan then you must visit Meydan Races."
        }, 
        {
            "index": 467, 
            "rating": "5", 
            "review": "Pure Perfection. If you want to visit the world's biggest racecourse visit Meydan. If you want to visit the world's richest horse race visit the Dubai World Cup. It is just a magic night - go and enjoy it - world class sporting action."
        }, 
        {
            "index": 468, 
            "rating": "4", 
            "review": "A night to remember forever. Went to Meydan for the Super Thursday meeting 2011 and had pre booked the tiered restaurant package for myself and my wife as part of our 25th wedding anniversary trip, paid about £160 each for 5 course meal with house wine included. The view from our table was outstanding, right over the paddock/unsaddling area with the winning post just to our right. You couldn't miss Dettori's flying dismount.The grandstand is huge, it's free to get in at the lower levels, thats where all the locals go, and you start paying the further up the chain you want to go. If you go just for premium seating, this is directly opposite to the winning post with great views, access to bars and food outlets within the grandsatnd, a siimilar set up to UK racecourses and is around £10/20 for the seat depending on the meeting.The evening started slowly as the staff were not overly attentive to the tables in our area of the restaurant and the service wasn't great, but once I had been spoken to the floor manager about this it improved sufficiently. The meal itself was good, not excellent as you might have hoped. However you go for the overall experience if you are a racing follower and this can't be faulted. Obviously no betting, gambling is illegal and websites are blocked, but if you are a regular racegoer use other methods. You are given a pick 7 competition entry form based on 7 races, which is like a jackpot, but they will pay out on less winners if nobody picks 7. I was lucky to get a return of about £100 on 4 winners because nobody got more than 5. The fun I had trying to fight my way down from the stands ,past security guards, and in to the paddock to claim my prize will live with me forever, there were 100's of locals all claiming to be one of six winners.Without the help of one of the waiters I kidnapped to help me I may never have made it. not the biggest win ever but one of the most exciting. Also very lucky to meet a couple away for their 25th as well and hopefully we'll meet again at Hamilton races and be friends for a long time. It all helped Meydan be a memorable experience."
        }, 
        {
            "index": 469, 
            "rating": "4", 
            "review": "Amazing display of money!. Living down the street from Aintree Racecourse I'm hard to impress when it comes to Horse Racing.I worked a long hard day at the Dubai World Cup in 2005 and can honestly say those people pay for what they get! The tents are fabulously decorated with gold and extravagant champagne flows like it's tap water, the luxurity is off the charts. Betting is not permitted in Dubai except by phone and so alot of the atmosphere is lost that you would expect at such an event.It's an amazing day out and I would recommend it to anyone who has a flutter during the Grand National, myself being one of them. Just be prepared for one hell of a taxi que, that's if you stay as late as we did, I think we eventually left at 12-1am.A fun day to be had and a good chance to get dressed up and feel like a millionaire!"
        }
    ]
}