{
    "category": "Dubai", 
    "entity": "Dubai-Desert-Conservation-Reserve", 
    "avg_rating_stars": 4.604938271604938, 
    "review_count": 648, 
    "rating_stats": {
        "poor": 4, 
        "average": 41, 
        "terrible": 3, 
        "very_good": 150, 
        "excellent": 450
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "Al Maha Desert Resort. As a desert conservation area this was exceptional. The large area is enclosed and Arabian Oryx, Arabian Gazelle and Sand Gazelle have been introduced and they are increasing. The first two are easily seen during the cooler parts of the day. The temperature during the day reached 44 degrees. Facilities included guided walks, safaris, hair raising dune drives outside the conservation area and falconry. The restaurant staff were very friendly and helpful. The evening meal from a wide menu was five courses. The suites were scattered in the shrub lined dunes. Suites one and two are quite a distance from the restaurant but just telephone for a buggy and it soon arrives. Suite to accommodates at least five people. The suite is air conditioned, cleaned every day and the beds are made up whilst you take your evening meal. There is a small swimming pool at the front and birds and animals come for a drink if the surroundings are quiet."
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "Nature! In Dubai! How incredible!. In the midst of this man-made city in the sand-pit, who knew there'd be a wild life conservatory!I'd been to the desert before, but I didn't know I'd been tot he Red Desert, which has brilliant red sand but no signs of life.In the conservatory, the sand is a dull tan color but there are animals in exchange! I saw little gazelle, ibex, goats, camel, sand lizards, snakes, and even little bugs.Go here on a desert safari with your kids and have a great time seeing what little wild life and nature that Dubai has."
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "Dubai Desert. Had a wonderful evening seeing the wildlife, dune bashing, enjoying the sunset and a wonderful dinner at the Dubai Desert Conservation Reserve. Definitely recommended!"
        }, 
        {
            "index": 4, 
            "rating": "5", 
            "review": "Must see in UAE. This is a great experience to see desert before sunset. Drivers will give you adrenaline, as they are driving very fast through desert. In the evening you will have dinner and ride camel."
        }, 
        {
            "index": 5, 
            "rating": "5", 
            "review": "Very Good. Its a very good experience. Riding a camel on the desert, watching falcon, different type of dances, sunset, etc."
        }, 
        {
            "index": 6, 
            "rating": "4", 
            "review": "great place. It is a must do to go on a Safari through this reserve. so many tours go here and it is nice to visit afternoon and see the amazing sunset."
        }, 
        {
            "index": 7, 
            "rating": "5", 
            "review": "Sand bashing!. Make sure your driver is an experienced one. Newbies don't drive fast, that takes away the edge from the sand-bashing experience!"
        }, 
        {
            "index": 8, 
            "rating": "5", 
            "review": "wow. Best experience that i have had in dubai till now because the cars that were use for us were extremly good."
        }, 
        {
            "index": 9, 
            "rating": "5", 
            "review": "A safari adventure you would not want to miss. The 4x4 wheel drive on the sand dunes was amazing, the Falcon show was interestingthe Sunset amazing,then the food & Drink, the camel ride was great and the foot awesomethe Bellydancer was enchantinga must do"
        }, 
        {
            "index": 10, 
            "rating": "5", 
            "review": "4x4 Adventure with dinner and a show. Arabian adventures took us out to the dessert and went crazy over the sand dunes in the 4x4 s then a Falcon show and a camel ride then to a traditional dinner under the stars. It was awesome."
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "Exciting trip into desert. We were picked up and taken for a red dune bashing experience. Our driver was very experienced and took us on quite an exciting journey over the dunes. My heart was racing but it was a trip I would highly recommend. The sunset is lovely and the dunes are spectacular"
        }, 
        {
            "index": 12, 
            "rating": "5", 
            "review": "good fun. Desert safari was always on my bucket list and overall i would give this activity 4/5. If you like dune bashing this is the thing for you but it also gives you headache and nausea. Eat light and drink lots of water."
        }, 
        {
            "index": 13, 
            "rating": "5", 
            "review": "Dubai Desert. The Desert is very safe, beautiful and for families and even kids as well. My husband and kids really enjoyed our safari ride."
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "Much better desert experience than Riyadh!. The hills are much steeper and the sand is more cleaner compared to Riyadh's Red Sand. It is a nice place to watch sunset too!"
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "Go of the Arabian adventure on wheels!. This is a great adventure. Prior to the start you will stop from restroom and snacks. You can even do an ATV ride. Then it starts...hold on to your seatbelt and the seat in front of you. A girlfriend of mine on the trip took her \"Dramanine Treatment\" 12 hours before, the afternoon and right before. She was so right, if you get motion sickness take the drug! I was in a car with someone who got really sick and it was rough. At the end you will complete the tour with a true arabian desert meal complete with entertainment and henna tattooing if that's what you want. This was truly enjoyable. :)"
        }, 
        {
            "index": 16, 
            "rating": "5", 
            "review": "A Must. we did this trip and it was fab the food was very good we had great fun on the quad bikes as well they really look after you"
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "Dune Bashing. We went with Arabian Adventures, the trip was brilliant, they have their own camp at the end of the dune bashing, camel rides, henna and the food was nice. Our driver was Masood. Would definitely recommend this company."
        }, 
        {
            "index": 18, 
            "rating": "4", 
            "review": "Once go and experience it. Cultural Place of Dubai and it has great experience. Desert dance and camel ride is awesome and amazing sunset view also."
        }, 
        {
            "index": 19, 
            "rating": "4", 
            "review": "A wonderful Experience.. We started from the hotel.. stopped in midway for quad biking which was great fun. Then started the real fun of dune dashing..it was great..cant put in words. Later went to camp where dance, tanoora show etc.. the food was disappointing (which I was told earlier also)"
        }, 
        {
            "index": 20, 
            "rating": "5", 
            "review": "What a cultural thrill!. This was an amazing adventure, the journey was interesting, the destination was spectacular. The 4WD dune adventure was totally thrilling. Plus watching the sunset over the sandy desert was so amazing! We recommend this adventure to all - children and adults. Note: wear good shoes - ones that you can shake sand from easily. The sand is hot and surprisingly soft. Exciting!"
        }, 
        {
            "index": 21, 
            "rating": "5", 
            "review": "Mustt Go ....... If you are anyway in UAE this is a must experience ...\nYour own roller coaster on sand ....Amazingly amazing"
        }, 
        {
            "index": 22, 
            "rating": "5", 
            "review": "Tour with Knights adventure. Had a great couple of hours doing the desert safari - great sand dunes and really exciting\nWell organised and safe\nI recommend Knights who had great cars and fantastic drivers"
        }, 
        {
            "index": 23, 
            "rating": "5", 
            "review": "The best tour ever!. My trip to the dessert will be unforgettable! Arabian adventure made this day so so special! Ayaz our guide was so warm and well educated, he also made us feel comfortable and made his best for us to enjoy every minute of our day! The dessert tour started with a Falcon show and camel photos then we had a 45 minute ride of the dessert with amazing views and beautiful sceneries to take awesome pictures which will remain in the memories forever. After that we went to a Camp that they have settled in the dessert OMG what an impressive place, they have hookah, camel rides, the best dinner, henna, belly dancing show... You name it they got it! Arabic Adventures focuses on quality and service which is what I felt from the moment I hopped in the car!"
        }, 
        {
            "index": 24, 
            "rating": "5", 
            "review": "Peaceful. This desert safari provided by Arabian Adventures, was amazing. You got a lot for the price! Pick up from hotel, hawk show, desert ride in SUV, pictures taken in desert sunset. Then your last stop is a oasis in the desert with Bbq, drinks, henna, hookah, belly dancers, and star gazing. Last but definitely not least CAMELS RIDES! Will do it again!"
        }, 
        {
            "index": 25, 
            "rating": "4", 
            "review": "ADVENTURE OF DESERT SAFARI. All the tourists who visit DUBAI have to take desert safari ride adventure. We have booked tour of RAYNA TOURS AND TRAVELS. We got fully adventure in DESERT SAFARI. Our Driver Mr. Bilal alias Sunny was a excellent driver who had good command over steering. We enjoyed very much."
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "wonderful day. Osman was professional driver in desert and would like to stay long time. my family enjoyed with sunset view."
        }, 
        {
            "index": 27, 
            "rating": "4", 
            "review": "we enjoyed dune bashing .. once more ... we enjoyed this activity if you are in emirates plz go for desert safari. service was very prompt . our hotel staff booked this for us . that land cruiser is specially maintained for dessert safari they had fixed few pipes. we love dune bashing, Arabic dance , food drinks. they have other activities in there camp side like quad bike ride, camel ride hukka , and other activities . my driver was very friendly and funny.I love desert safari activity."
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "Desert Safari. This was the highlight of the trip and must visit kind of thing in your list. At times it was scary going up and down the Dunnes but it was so much of fun.The tour was bit expensive for a family of four and at the end of day it was worth every penny. In the evening, the belly dance show was beautiful in the middle of desert.Will visit again."
        }, 
        {
            "index": 29, 
            "rating": "5", 
            "review": "The Highlight of our Trip. Don't miss the Desert Safari tour when you visit Dubai.It includes ATV (Optional), Dune Bashing, Camel Riding, Shisha smoking, Henna, Costume Photo ops, Belly Dancing, Tanoura Dancing and buffet dinner of great local foods.Don't miss the ATV driving in the real orange colored desert. It was fun and thrilling. Dune bashing is like a roller coaster ride. Nausea warning though specially on kids. Bedouin Camp which is in the middle of the desert have good sound and light system. Stage is located in the middle of the camp and all visitors are gathered around it.Overall it was the highlight of our visit to Dubai."
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Dubai Desert Conservation Reserve. This by far was a top venue we enjoyed. The experience of the desert, wildlife, falcon demonstration, camel ride, dinner and heritage will make you appreciate it all."
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "Excellent outdoor activity in Dubai. The quad bike in the dessert, the dressing local, the sundown, the dinner and the belly dancing just made our evening. A must do in Dubai"
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "Make sure to use sun block and take sun glasses.. Another must -do in Dubai. Just note if you have joint or back problems then this would most probable be unsuitable. The land-rover drivers are very skilled and it is a smooth ride but the camel ride is not as comfortable. But if you can bear the bumpy ride then do not miss this fantastic day out. I love the fact that it is very safe to venture out as a girls only group or single parent family. Just use common sense!"
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "Great outing into the desert. We did the conservation drive and it was simply wonderful. We were able to see some arabian deers and a herd of oryx as well as some birds. Our guide Paulo was superb; friendly, informative and knowledgable. He showed us some great places to take photographs and the breakfast at the Al Maha resort was scrumptious! The conservation area is huge and it is lovely that such a vast space has been dedicated to preserving the flora and fauna. We can definitely recommend this trip and will be doing it again the next time we are here."
        }, 
        {
            "index": 34, 
            "rating": "3", 
            "review": "Great dune and camel ride. It was by far the best thing to do in Dubai.The dune ride with the car was just fun pure, amazing as so was the camel ride.The reserve is lovely but after a while you have seen everything and its getting a bit boring while waiting for dinner.At least it has a bar where you can have some alcoholic drinks as well.The dinner is okay. It has a huge range of different meals but its not my taste, so I did not really like it.The entertainment was nice but I expected a bit more or different or both.Overall, its really a great experience but in my opinion, it is too much touristy."
        }, 
        {
            "index": 35, 
            "rating": "5", 
            "review": "dessert safari. groupon voucher trip, dune bashing fun a little scary, camel rides, hold bird of prey, sand boarding, and quads at small extra charge then traditional meal in camp and entertainment, belly dancer, turine dancer and fire dancer. henna tattoo, good fun"
        }, 
        {
            "index": 36, 
            "rating": "5", 
            "review": "A camel ride into the sunset. This was the highlight of a five week trip through Europe and then on to Dubai. The trip into the desert. followed by the 45 minute camel ride and then an enormous meal in a desert compound was outstanding. Highly recommend this to anyone"
        }, 
        {
            "index": 37, 
            "rating": "5", 
            "review": "AN ABSOLUTE MUST DO. A definite highlight of the trip. Our guide was informative and friendly, the sand dune experience was thrilling and had the opportunity to get out of the car and take beautiful photos in the desert. Then, at the conservation reserve, the food was delicious and plentiful and the entertainment was excellent; belly dancer, henna, shisha, camel rides just to name a few. Arabic coffee and dates were served upon entry which was a pleasant highlight of the evening. Cannot recommend this enough, it is simply a must do. Also value for money - such a long tour (almost 6 hours) with food and drink included, as well as constant entertainment!! One word of warning though - if you are a contact wearer, DO NOT WEAR YOUR CONTACTS!! The desert sand irritated my eyes and I was not wearing my contacts, cannot imagine how irritated my eyes would have been was I wearing contacts."
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "Worth to visit. I visited there many times part of the desert safari. This area is very well maintained and worth to see and experience the dune bashing. Also you can see some wild animals normal seen Arabian deserts."
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "Great experience . Loved dune basing and the desert sunset. Ended with a really good BBQ meal in the middle of the desert, was actually surprised at how good the food was. A great experience all round!"
        }, 
        {
            "index": 40, 
            "rating": "5", 
            "review": "GREAT. It's one of my best experience in town. It should definetely be checked. The cars are new and the experince was soooo great."
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "Great Guide Great 4x4, food and entertainment.. Our guide Arafat arrived at our hotel for a guided evening of entertainment which included 4x4 sand sand dunes, eagle show, belly dancing show, food and drink, camel rides, and henna. You couldnt ask for more!!!Arafat was kind and patient with all our questions and gave really good information on all the places we past when we left the city centre. I believe he has been doing these tours for a long time and he is definitely professional, knowledgeable and very very good at his job!The whole evening flew by so we didn't get the opportunity to do everything. This was a gift from my new husband for my birthday and it couldn't have been any better. There were about 60 cars in total and about 6 people per car. The whole thing was extremely well organised with all cars stopping at several points for the pictures with well organised timing and precision. Would do it again...."
        }, 
        {
            "index": 42, 
            "rating": "4", 
            "review": "Awesome adventurous trip. Dubai Desert Safari is one of the most awesome and unforgettable trip. The service was too good. I was picked up from my hotel and dropped in the same jeep. The driver was brilliant. I enjoyed camel safari plus bbq dinner and belly dance. Overall perfect trip."
        }, 
        {
            "index": 43, 
            "rating": "5", 
            "review": "A lot of fun, bit touristy. Fun day in the desert dunes. Usually followed by Arabian tourist stuff: BBQ, henna tattoo, belly dancing, dance twirling, camel rides etc."
        }, 
        {
            "index": 44, 
            "rating": "4", 
            "review": "Dinner by under the Arabian Stars. We used Arabian Adventures as the tour and wished there were more variety of food and our camel rides a bit longer rather than just a couple of metres."
        }, 
        {
            "index": 45, 
            "rating": "5", 
            "review": "Amazing. What an adventure!!! The car ride on the safari was unbelievable. A little scary driving on a small strip of sand. Over all it was awesome."
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "WHITE ARABIAN ORYX. Go and see the white Arabian Oryx up close and personal and then treat yourself to a night of luxury at the Al Maha Desert Resort, a completely majestic hideaway on the Dubai - Al Ain road."
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "Sunset Desert Safari. Wow! what a worthwhile trip this turned out to be. It's a must if you are visiting Dubai. I was picked up at my hotel at 4.30pm along with some others and driven to the Dubai Desert Conservation reserve for my Camel ride into the desert to witness a great Falcon show and very informative talk, then onto a beautiful oasis to feast on a abundance of food which was cooked to perfection. Watched some dancing, got a Henna Tattoo followed by a talk on the stars/solar system (optional) then relaxation on ground carpets and optional smoking pipes. After a lovely evening a Jeep ride back to the pick up car and back to Hotel around 10.30pm. Excellent trip for everyone."
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "Desrt Safari - No one can miss. This is the place where you will enjoy the most peace and calm, if you have already spent good time in Dubai Malls and Entertainment parks, our ride was for 45 minutes in 4X4 vehicle the SUV was going ups/downs on dunes where you could see how the vehicle in front of you is skidding on sands, sometime it thrilling otherwise this was joyful ride. any age person can do this, this dosnt require age to enjoy, my father in law who is 76 years old enjoyed this with me.after this 45 minutes of sand dunes, our vehicle took us to the camp, where we were served food (veg and non veg) both options available along with unlimited Soft Drinks and Water, but if you want to try liquor then you need pay separately. during food there were dance performances. Apart from food and performances you can try Seesha (Hukha), Mehandi (Heena), camel ride, a photo with Eagle, Liquor (Paid), Quad ride, we did this tour through \"Rayna Tours and Travels\" and they organised it well. Driver \"Gaffur\" (if not forgot his name by now) was really good and informative."
        }, 
        {
            "index": 49, 
            "rating": "5", 
            "review": "A true Desert experience with the know how. Beside all the excitement and trill of the Desert Safari, the Reserve provide a more in depth knowledge and a different sight of the desert. We join the Platinum Heritage tour and spend most of the ride along side the Reserve.If you are lucky, you will encounter quite a various of animals living here.It is highly recommend to ride on open top vintage Land Rover to maximize the experience."
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "Sand Bashing. Excellent Sand Bashing and sand surfing.We also did quad biking- Don't wear flip flops the sand is very very hot. Trainers and socks a better option."
        }, 
        {
            "index": 51, 
            "rating": "3", 
            "review": "BEST Dessert Sand Dune riding experience. If you are in Dubai and have finished visiting the sky-scrapper and mall filed tourist attractions, ensure heading out to the Dubai Desert. There are multiple agencies organizing trips to the desert conservation reserve. A typical tour consists of the following:1. Ride to the desert conservation reserve from your doorstep.2. An exciting sand dune riding experience in your SUV en-route to a camp. Nothing beats this experience.3. Our camp had entertainment like dance performances and you could get hookah, ride a camel/horse and also rent an ATV bike to ride the sand dunes.4. They also have food options throughout.5. After enjoying a day amidst the desert, you get a ride back to your home.Overall a must do experience, being in the middle of a desert. We were far away from any civilization. Ensure you choose a reputed tour group for the best experience."
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "WOW.... The trip was amazing!!! we had wonderful time and driver is outstanding (Mr. Irufan). The buffet dinner bit spicy and the dancing was superb..."
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "Safari Desert. This was so much fun and worth the money. Riding trucks in sand, camel rides, sand skiing. Dinner and belly dancing was great. Need to bring cash for quads. We did not. It was an amazing day"
        }, 
        {
            "index": 54, 
            "rating": "4", 
            "review": "Simply beautiful. one of the most wonder attraction in Dubai, its a great place for a tour to discover the wonder of the Arabian Desert."
        }, 
        {
            "index": 55, 
            "rating": "5", 
            "review": "Great Adventure in the Sand Dunes. We did an inexpensive (about $45/pp) tour that involved driving over the dunes in roller coaster fashion, then dinner in a \"Bedouin\" camp. Had to put quotes around that because it was a stationary tourist camp (Bedouin's are nomadic). Still had a great dinner and entertainment with belly dancers and a nice traditional male dancer. Great experience."
        }, 
        {
            "index": 56, 
            "rating": "4", 
            "review": "Everyone must experience at least once in a lifetime !!!. Toyota Cruiser wehicle by chauffer comes and pick you from your address on time. Adventure takes around 7 hours. You share the car by other people. Dune bashing, camel and ATV riding are not include the price. Hena tatoo, dinner soft drinks, shisha and dance performs are included the package price.Prices are very flexible. Make a good bargain and do not let hotel staff earn commission over your trip fare.Enjoy!"
        }, 
        {
            "index": 57, 
            "rating": "5", 
            "review": "Best tour i ever got!. Place is amazing, drivers are carefull, dunes are orange color its an amazing view. Two shows while sitting, camells, hena tatto, hooka and all its free"
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "Fascinating. The Desert Safari and dinner was a nice introduction to the mystries of Arabia. It was fun and the shows were original"
        }, 
        {
            "index": 59, 
            "rating": "5", 
            "review": "Not to be missed on a trip to Dubai. We went with a jeep safari company owned by Emirates airlines. This was a superb evening. Picked up at our hotel at 4pm and returned at 11pm ish. Just google this to see what is on offer. You get exactly what is offered and all aspects of the safari are excellent and extremely well organised. You are part of a very large group, but this does not dtract, infact it adds atmosphere to the evening meal part of the trip."
        }, 
        {
            "index": 60, 
            "rating": "5", 
            "review": "Fantastic Desert!. oh... the desert is fantastic! Can't wait to visit Desert on sunset)) Very recommend to visit it!!!!"
        }, 
        {
            "index": 61, 
            "rating": "5", 
            "review": "An amazing experience - one of its kind. Have done this multiple times, and never tire of the same.\nThis is a one-of-its-kind experience and a must-do during your visit to Dubai.\nTake a pick of any of the providers. But ensure that you do extra due-diligence and you can find a very good deal!!!"
        }, 
        {
            "index": 62, 
            "rating": "3", 
            "review": "Roller coster ride in 4x4. Usually they take you at the desert in 4x4 suv's. The ride is breath taking. The loud music, the ups and downs in your land cruiser is sure to make your day at desert safari. But the belly dance, the sheesa and especially the food is worst. If you are a sheesa lover then they are sure to disappoint you. It will choke the hell outta your threat with its red hot base. The buffet has both veg and non veg. But it will taste like as if it was prepared days back and was preserved to serve you now."
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "Best experience!. Take the tour! It`s a great experience when you visit Dubai! Take notice that I don`t recomand it on summer.. it`s too hot outside. Made it on winter! Take a vip tour.. it`s not that expensive and it will worth every penny!"
        }, 
        {
            "index": 64, 
            "rating": "4", 
            "review": "A brilliant idea. My friend and I did a tour here with Emirates Holidays and loved it. It is a beautiful place and very quiet. The wildlife is varied and the guides know the area and the species well. I found this much better than the typical desert safari tours offered as you learn more about the history of the species and what is being done to conserve them."
        }, 
        {
            "index": 65, 
            "rating": "4", 
            "review": "Unique experience of car riding in the desert. This is awesome experience which cannot be explained in words. Driving in desert dunes require special skill. You enjoy riding in desert which you should not miss it. After riding they take you for sun set and camel riding. After all these you will have a dinner and belly dancing. All together this is lifelong remembrance."
        }, 
        {
            "index": 66, 
            "rating": "5", 
            "review": "WOW. Excellent safari with relaxing meal and shisha. i learned from our driver new things cause i had safari with my own car but with them it was excellent experience ."
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "Spectacular. I booked the dessert safari with Platinum Heritage group. It was an amazing experience and the staff members of Platinum Heritage are great. Don´t miss it."
        }, 
        {
            "index": 68, 
            "rating": "4", 
            "review": "Fun. We thought it was real fun to do the dune bashing,adrenalin is pumping because you think the car is going to turn over anytime.The desert is magical. Sunset,camels,food and entertainment."
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "The visit is worth the trip to Dubai. It was a very deep experience in spite of the hot weather everything was simply perfect and well organized"
        }, 
        {
            "index": 70, 
            "rating": "5", 
            "review": "take care of every thing. The Dubai Desert Conservation Reserve (DDCR) is the UAE’s first national park. Carefully planned rehabilitation over the years has resulted in a protected environment for the last of the desert wildernesses. With the rapid development of Dubai as a major business centre in the Gulf, the Dubai Government has long recognised the need to preserve its unique and beautiful desert habitat, and the many threatened flora and fauna species within. This unique reserve was created for the protection of those endangered species and for the conservation of the natural desert habitat and heritage."
        }, 
        {
            "index": 71, 
            "rating": "4", 
            "review": "Preserving Desert Plants and Fauna. This tour was part a bigger adventure not in the Conservation Area. We have been efforts to plant areas of native plants and trees like palms and native grasses. Not only do they seem to stabilize dune areas but the shade provides a welcome rest point for some animals yes some animals are found to the area."
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "Sandduning with Arabian Advertures. What an exhilarating experience! Our driver was excellent and made the experience exceptional. The dinner/bazaar following was very enjoyable, and the falcon flying exhibition was very educational."
        }, 
        {
            "index": 73, 
            "rating": "5", 
            "review": "Wildlife and sand dunes. We did this reserve with a tour, great playground,\nAnimals and sand dunes we did a 4x4 ride was fabulous,\nAlso oasis was great place to see falcon in flight"
        }, 
        {
            "index": 74, 
            "rating": "5", 
            "review": "Very hot, a must see while in Dubai!. Dress accordingly, wear sneakers and bring a hat! Make sure you have a camera handy! Lot's of beautiful scenery."
        }, 
        {
            "index": 75, 
            "rating": "5", 
            "review": "the best if in Dubai. the best experience for me and my wife in Dubai... the bike experience on the sand.. the land cruiser dune bashing... the sunset.. the camp site barbeque dinner.. the cultural dances and belly dance performed at the camp site.. it is just an awesome experience, irrespective of the area you belong to on this world.. you will love it.."
        }, 
        {
            "index": 76, 
            "rating": "5", 
            "review": "Tour Dubai!. the landscape is very beautiful! there are a lot of companies that did this tour, pick up and dropp in the hotel."
        }, 
        {
            "index": 77, 
            "rating": "4", 
            "review": "Fun thing to do during one day. One day activity, they pick you up from the hotel in the afternoon around 16:30, since we were there during the summer they go later because of the sun and the heat, and the drive was about 45 minutes to the reservation from Dubai centre. The cars are really good and big so there is enough room and the ride was special. Really gumpy and hot, a lot of people had to take breaks due to nasuea but it was fun. Didnt go that fast tho and the drivers could be more aggressive in their driving but still it was a experience. In the evening they stopped at a big tent were we could sand board (not worth it unless you like soar muscles from running in sand) camel riding, holding falcons, barbeque, shisha, henna and belly dancing. It wss a nice evening and I would recommend you to try this."
        }, 
        {
            "index": 78, 
            "rating": "5", 
            "review": "Must. Its a must do when in Dubai .Desert safari is unique its own ways and you can truly experience the Desert ... The camp ,the Hookah ,camel ride etc everything was great ..."
        }, 
        {
            "index": 79, 
            "rating": "5", 
            "review": "awesome!. you go to the dunes on a 4 wheel drive. the driver was very good and knowledgeable. Is very important that you take something for motion sickness because the ride on the dunes is very radical. you stop to see a beautiful sunset before going for a fun Camel ride and a meal on the desert, very interesting, there was also a show of belly dancing. I really enjoyed!!!"
        }, 
        {
            "index": 80, 
            "rating": "3", 
            "review": "good...but not perfect. my personal experience was not so good, just ok...you will do everything like camel ride, hukkah , buffet but everything in very low quantity."
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "Enjoyable trip. We went into the reserve in a 4 wheel drive. The guide was knowledgeable and ensured that we enjoyed ourselves in the sand. The trip also included a meal and drinks which was fun"
        }, 
        {
            "index": 82, 
            "rating": "5", 
            "review": "Woow. Superb, being in the car on the dunes and after in the middle of nowhere only you and wind, really nice time also on the camp. Highly recommend !!!"
        }, 
        {
            "index": 83, 
            "rating": "5", 
            "review": "stunning. A real insight into the lives of the history of the Emirati people. The area has a fantastic history and culture far removed from modern day Dubai. A real gem."
        }, 
        {
            "index": 84, 
            "rating": "5", 
            "review": "Good time. Been to desert safari in Dubai. With quad biking, Dune bashing, and Belly Dance etc. Nice evening to spent on these activities in desert safari."
        }, 
        {
            "index": 85, 
            "rating": "5", 
            "review": "Enjoyed by all. A special evening.. Loved the jeep ride over the sand dunes, the visit to the Bedouin village and plentiful local food. Do try the camel ride under the stars - felt like Christmas!"
        }, 
        {
            "index": 86, 
            "rating": "5", 
            "review": "Peace and serenity in Dubai. I visited the DDCR with a guided tour from Arabian Adventures - well recommended for a visit for sunset shots, shisha, and an experience duning!"
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "Wonderful Experience. A must do.. We did a trip to to the desert in a four wheel drive Toyota Safari. I paid a little extra and we had the car to our selves. we really had a great time. Our driver was excellent and really knew what we was doing. He really knew how to handle the sand dunes and took us to a couple of spots that were quite deserted. It can get quite busy out there with other vechiles so this was not an easy task. I think that this experience is must for any visit to Dubai. We then had dinner at a desert resort after this with great food and entertainment but for me the highlight was the four wheel driving in the desert sand dunes."
        }, 
        {
            "index": 88, 
            "rating": "5", 
            "review": "Must go!!. Had an evening here with Arabian Adventures. The reserve is clean and the sand is lush and unspoilt. Where ever we stopped in the reserve the sand was beatiful and it felt untouched by anyone. Local animals stroll around in the distance. Lovely place and well protected."
        }, 
        {
            "index": 89, 
            "rating": "5", 
            "review": "The best tour ever. They pick us up at the hotel at 4 pm with the luxury tour privat car 5 people and once we arrive to the reserve we move into a 60 jeep great tout and well explained. We finish the tout in a Bedouin village with belly dancing and lots local grill coked food that included camel meet stew and lots of other local food. It was great."
        }, 
        {
            "index": 90, 
            "rating": "5", 
            "review": "A must visit when in Dubai. You can go to alot of cities around the world and they all have skyscrappers and shopping mals. How many cities have a desert so close that you can actually tour and even spend the night. Excellent experience"
        }, 
        {
            "index": 91, 
            "rating": "4", 
            "review": "Great desert day out. The main attraction are the white Oryx which are cared for by the government. The site of coming across the herd on your desert safari is really impressive. There are lots of little gazelles bouncing and running around and on our last visit we saw vultures and lizards too. The drivers are all safe and speak English and are well informed about the environment and you can book for desert barbeques which they can set up for you at nightfall. Don't do this between May and Septembeber it is simply too hot but when the weather cools a bit this desert adventure can be very rewarding"
        }, 
        {
            "index": 92, 
            "rating": "3", 
            "review": "don't go for Safari. well if you go to dubai as a tourist you might be interested to go in a tour to the desert, it is a very nice idea, but avoid to go on Safari paid trip, you can rent a 4+4 car and enjoy a trip by urself but sure u need to know how to surf in desert and have all the needed thing for all situations... go with friends to Alkhawaneej take ur drinks or food and table with chairs and enjoy the night, there are places for camping also you can use them,,, personally I prefer going with friends and be free than paying money to eat cold food or go wherever they want me to go..."
        }, 
        {
            "index": 93, 
            "rating": "1", 
            "review": "A desert experience filled with terrible times. Not only is getting to the place alive a challenge but the disorganised racing around of cars with ridiculously loud head banger music leaves one numb. The amount of trash in the desert is sad to see."
        }, 
        {
            "index": 94, 
            "rating": "5", 
            "review": "Dancing with the Sands. All you need is water, your camera and light sporty attire to enjoy comfortably the wide paradise of beautiful desert. Better take a ride and feel free to go as far as you can, be refreshed and feel re-energized after."
        }, 
        {
            "index": 95, 
            "rating": "5", 
            "review": "Stunning Scenery. Stunning scenery.This nature reserve is beautiful.We saw lots of the animals are hat live on the nature reserve and our guide AD Bhatti was very good at spotting and pointing out these animals."
        }, 
        {
            "index": 96, 
            "rating": "5", 
            "review": "Great place to visit. finally got a chance to visit the desert...this place was nice and I even got a chance to ride a camel for the first time...The sand was soft and the wind was breezy...This is a must do if you are ever in Dubai!!"
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "The beauty of the natural world of UAE. This is where the country came from so make sure you see the real world of history that we make the change from. Nature is to be respected."
        }, 
        {
            "index": 98, 
            "rating": "5", 
            "review": "Dinner in the desert. This is a must do trip. Highly entertaining and enjoyable. Felt at times like we were the only people out there."
        }, 
        {
            "index": 99, 
            "rating": "4", 
            "review": "good to see desert. you can feel desert is what during the 4 wheels car to driving at sand.you can not imagein the feeling but you can feel after this tour."
        }, 
        {
            "index": 100, 
            "rating": "5", 
            "review": "Dessert Safari. Desert Safari a popular destination for action and adventure in Toyota Land Cruiser. When we reached the dessert area the drivers lower the tyre pressure to make the sand driving easier, we had 40 minute tour of the sand dunes at high speed, usually driving up them and sliding down them sideways over sand dunes, it was really a thrilling experience after the Dune Bashing, we took a halt in a Camp located at mid of dessert where we experienced Camel Ride, Sand Boarding, Heena Painting, Belly dancing, Tanoura show , Fire Show, ATV bike rides & BBQ Dinner, here I got a chance to wear Arabic costume Kandura (long white cloak) and Guthra (headscarf) & Agal (black cord which is fastened around the head)"
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "Breath Taking Sun Set. Went on desert experience trip and bbq with belly dancers. Was very enjoyable and the desert is beautiful. Would highly recommend."
        }, 
        {
            "index": 102, 
            "rating": "5", 
            "review": "I had the luck to live from 2009 to 2012 (3 years) inmid of the Rub Al Khali desert.... I read a lot of articles and books about the Rub Al Khali desert, the largest desert of Arabia. I was fascinated of this phenomenal desert!I had the luck of my life to land a job just inmid of the Rub Al Khali desert, in a small town 170 km southwest of Abu Dhabi City.I didn't buy a 4-wheels drive jeep, but a very beautiful Lexus convertible car. Yes, a convertible car! Driving with open roof is a fun in the sunny winter in the Arabian Emirates. I enjoyed my wonderful car and the excellent roads in the Emirates. I drove 135.000 (!!) km in 2 1/2 years. The best time in the Emirates is from October to March; the summer is terrible hot and the climate in Abu Dhabi CIty and in Dubai city is terrible humid, because of the evaporization of the water in the Arabian Gulf. Definitely a \"MUST\" in the Emirates is a 4-wheels drive trip into the desert! You will never forget this phtantastic experience of a drive into the desert."
        }, 
        {
            "index": 103, 
            "rating": "5", 
            "review": "Arabian nights. An amazing experience to the desert, driving up and down the sand dunes was exciting, although some may become sick from the up and down motions. The first stop, the bird show was least impressive, but we took great pictures at sun down and dining under the star was amazing, live shows vary depending on season.... great food, unlimited wine and beers.. .Highly recommended!"
        }, 
        {
            "index": 104, 
            "rating": "5", 
            "review": "Dune Bashing and Belly Dance. If you are going outing in Dubai and do not go for Desert Safari, you have missed some thing.Here is the trip advice and experience for you.When you travel there go in a team of 4 or more. So that the package will be less costly and can be shared. Carry some snacks with you for time pass on travel or during belly dance.The price of desert safari starts around 60AED per person. There will be other price also but 60 AED is worth it. You will need to travel to the spot on your own or with a tour package. The cost usually includes the Dune bashing , Camel ride and belly dance. A high cost ticket gives you a luxurious SUV like hammer. But dont worry even least you will get Land cruiser with the starting price. It will be a roller coaster ride and you will love it. It is totally safe and exciting. in evening you will have to watch belly dance and tamura dance or even a magic show. This is an hour or little more event followed by dinner buffet.Contact your tourist for a sky diving price in case if you are willing to afford."
        }, 
        {
            "index": 105, 
            "rating": "3", 
            "review": "Good. Still a bit of a work in progress but worth a visit if you have the transport as it is about half an hour outside Dubai.Nice water features and birdlife."
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "Very Good!. The best way to enjoy one of the biggest desert on earth at only 45 minutes from your hotel. Great experience on sunset including dune driving, falconry, dinner in camp, stars observatory... It is a must!"
        }, 
        {
            "index": 107, 
            "rating": "5", 
            "review": "If you do nothing else, do this excursion. This was a great experience and is a definite MUST DO when visiting the desert, especially if this is your first time here. The drivers are pros! Don't worry at all. Just relax and have a good time.The Russian dancers were ok, but if you are attending a Middle Eastern buffet with a belly dancer, do you really want to see a Russian girl attempting to look \"Arabic\" as your dancer?"
        }, 
        {
            "index": 108, 
            "rating": "5", 
            "review": "Lovely experience. We chose to do the tour in the enclosed Mercedes SUV, but you can also do it in one of the big open top vehicles...I live here, so I've had my fill of dust, sand and blazing sun.First they tie your headscarf on, which is a cool if touristy little touch. Then we went to see the falconer. The one the day we were there was a lovely South African lady who really knows her stuff. You get a chance to actually get up close and personal with three different breeds of falcons, which she will handle and feed while she tells you all about the fascinating history of the falcon in the UAE. I knew falcons were important here, but I never really understood why or how they were used until this trip. Very informative. The highlight of this portion of the visit to me was the owl that this handler had with her. What an amazingly beautiful bird!Then we went to a different area for a short camel ride. I've ridden camels before and it's always a fun thing to do. Both of us that were on this trip are horse people. But if you think riding a camel is anything like riding a horse, think again! It is a really different experience! The camels themselves are really gorgeous animals...very stoic and regal and simply HUGE!They then took us to a \"majlis\"-type area and gave us a snack and cold drink (or coffee, your choice), which was a nice touch. Then you drove out into the dunes to search for the Oryx. We saw several of them, as well as a small Arabian deer.Overall a nice way to spend an afternoon and well worth the trip."
        }, 
        {
            "index": 109, 
            "rating": "4", 
            "review": "Radical safari at Dubai desert. We decide to do a safari radical on desert,I found, loads of garbage all over, people do not respect the environment, and authorities, should keep the tourist area around Dubai, as clean as Dubai city.Apart of that We enjoy the rally, and we had dinner somewhere, but excellent food Quality. I suggest to all tourists to do it."
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "Desert safari. Simply awesome. Here I need to pen in a few words regarding our tour guide \"Faisal Khan\". What an expert driver he is on sand dunes. Gave us a thrill of our lives with his expert driving over the dunes while at the same time keeping us in laughters all throughout. Such a nice soul. I wish to add here a special mention the way he handled the car once when it got stuck on the dunes at an very awkward angle. Imagine he is Persuing his MBA at the same time and taking care of his family. I highly recommend him guys when your doing a desert safari there. You can pickup his details from J W Marriott marquis who I also thank for putting us with him. God bless him and his family."
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "Brillient. Totally worth a visit - don't miss going for one of the Safari and Dinner experiences...it's magical."
        }, 
        {
            "index": 112, 
            "rating": "5", 
            "review": "A must go!. It was an amazing experience to see the desert in Dubai. It doesn't compare to Egypt but it's great. Specially to take some cool photos.\nI didn't appreciate the way they treat the camels or the falcon. Also I didn't stay for dinner, Eating camel is not something I'm looking forward to do."
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "Woo hoo!!!!!. This was my second time o the Desert Safari and it was just as exciting! The driver was very good and although we spent most of the time teasing my colleague who was petrified, we all managed to enjoy it too. We were there in Ramaddan so we didn't get to see the belly dancers, but the tanoura and another dancer with LED lights on his skirts were very good. Worth it! Plus, I got a camel ride too."
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "Sun, sand and food. An exciting afternoon and evening. A 4wd trip through the desert witness plenty of up and downhill action. A lovely stop at the top of a sand dune to watch the sunset into the desert. A great dinner at a tent camp with plenty to eat and a good choice of food."
        }, 
        {
            "index": 115, 
            "rating": "5", 
            "review": "Fantastic day out. A must if you are in the area, fantastic place to visit and experience. All the family enjoyed the desert safari."
        }, 
        {
            "index": 116, 
            "rating": "4", 
            "review": "A sea of sand. The place is incredible, mainly for those that haven't had many contacts with desert. It's very big and the sand seems to merge with the sky at the horizon in all the directions you look.The drawback is that there are a large number of cars making Safaris (I was also inside one) and so you don't have a place that you can get out, have seat and enjoy safely and the place where the Safari stops is not so beautiful."
        }, 
        {
            "index": 117, 
            "rating": "5", 
            "review": "Fun experience. This is an activity that you have to do. So much fun and adventure. Dune buggy rides, camel rides, belly dancing shows. Riding the dunes. It was exhilarating."
        }, 
        {
            "index": 118, 
            "rating": "5", 
            "review": "Unique experience. The trip on Dubai desert for sure is an unique experience. We book this trip streight from the hotel, and we go with ALT Dubai.Very nice, good driver and the camp was incredible with traditional food and belly dance, cammel ride and shisha."
        }, 
        {
            "index": 119, 
            "rating": "5", 
            "review": "Thrilling experience. Luckily I got a front seat. The ride through the dessert and dune bashing was very adventurous. After the dessert safari, there were nice dance and performance shows in the mid of the dessert. It is an amazing way to spend your evening."
        }, 
        {
            "index": 120, 
            "rating": "5", 
            "review": "Desert Safari. What a ride of a life time - lol- hold on tight to your set belts. These drivers are so skillful -driving over the edge of the sand dunes, one feels as if the car will roll over. Totally enjoyed that tour"
        }, 
        {
            "index": 121, 
            "rating": "4", 
            "review": "GREAT TIME, buuuuuuuuut. This tour was great - the jeep sand driving was awesome, lots of fun. The camel ride was a joke! You get on the camel, go approximately 10 steps and back and that's it. I was very disappointed in that! They offer you a \"real\" camel ride for $25 more, then you get a meal (the air-conditioned section is $25 more), only thing free is water and soda and the buffet. The \"extras\" were never mentioned when booked. Was disappointed with the camel ride part mainly. Food was NOT very good, but I am a picky eater so........."
        }, 
        {
            "index": 122, 
            "rating": "3", 
            "review": "Amazing Desert in Dubai!. I really enjoyed riding 4x4 having dune bashing, first i was feeling dizzy after i feel the enjoyment of the rides heheheh. Feeling happy on this day."
        }, 
        {
            "index": 123, 
            "rating": "3", 
            "review": "Very touristy !. We felt the place very touristy and camel ride very short. Snaps with eagles is fun but sale of those snaps is super expensive. Okie dokie experience though we liked the landscape."
        }, 
        {
            "index": 124, 
            "rating": "5", 
            "review": "Sunset Dinner. pretty awesome place to organise a group drinks and cocktail and then head to dinner with some folk music and dance. private property well managed"
        }, 
        {
            "index": 125, 
            "rating": "4", 
            "review": "Great but short. You must do it if it is the first time is Dubai.It is a few hours trip, but very interesting.Tip: Check first with your hotel before booking this trip with another organisation, because it might be cheaper for exactly the same experience."
        }, 
        {
            "index": 126, 
            "rating": "5", 
            "review": "A remarkable landscape. You will love this. We did it with Platinum and we would do it again. The opportunity of seeing such a vast landscape so close to a major city is extremely rare. Do it!"
        }, 
        {
            "index": 127, 
            "rating": "5", 
            "review": "Whow. The dunes are something that everyone should experience, if you like wild rides..Also the dinner in the dessert is wonderful and the entertainment is fabulous"
        }, 
        {
            "index": 128, 
            "rating": "5", 
            "review": "Beautiful sunset. Dubai desert tour was the greatest experience of my life . They were hired by the hotel , which took us back . The desert sunsets we watched it , looks stunning . The desert is very delicious dinner , free henna for women , and many other programs there is ."
        }, 
        {
            "index": 129, 
            "rating": "5", 
            "review": "Fantastic Experience!. I had the best time on the desert safari. From start to finish it was such good fun and the time went by so quickly. We got picked up and driven to the desert which took about an hour from our hotel (a little pit stop at a small shop where we could buy water, snacks and use the bathroom). My friends got head wraps, but I wouldn't say they are entirely necessary. It's up to you if you want to pay for one. I suppose it adds to the desert experience! The dune bashing was unbelievable. I feared for my life and couldn't stop laughing and whooping the whole time. It was like a perilous rollercoaster. You go in a parade of about 6 jeeps, so you can see the ones in front of you sliding all over the place which adds to the fear. It was awesome. Keep your seatbelt on for sure, hold on tight and don't have any windows open. Some drivers are more daring than others, so be prepared for some reckless moves. The desert was beautiful, though and after much bashing we stopped to take photos and absorb our surroundings. Another tip- wear shoes that don't allow much sand in. When we arrived at the BBQ, we were welcome to enjoy an hour of camel riding, henna, buy souvenirs and shisha (you could pay to have it at your table). We were then promptly served starters, mains and dessert plus soft drink. The food was SO GOOD! I piled my plate high and was very satisfied by what i ate. There was plenty for everybody and there were a good few of us. The performances were also amazing- a fire dancer, a spinning man and belly dancer really got the evening going. They were great to watch. I would recommend this to anyone. It's definitely value for money- it included a lot of things and we all had such an enjoyable day."
        }, 
        {
            "index": 130, 
            "rating": "5", 
            "review": "Exhilarating experience. We had the most wonderful driver called Mohammed on our desert safari. The entertainment during dinner was exquisite, The food was very good. I even has a henna painting for free."
        }, 
        {
            "index": 131, 
            "rating": "5", 
            "review": "ADVENTURE IN JEEP. Not for old ages or pregancy womens and those suffer from back problem..it is fun scary thrill to travel jeep on desert safari.best adventure for colleges teens"
        }, 
        {
            "index": 132, 
            "rating": "5", 
            "review": "Awessome..dont miss. Desert safari in 4Wx4A car is awesome experience.It cant be described, just experience the up and down on sand dunes. Dinner after safari is not good, but you will get it in package, so be prepare for dinner. No belly dance in holy month of Ramadan."
        }, 
        {
            "index": 133, 
            "rating": "3", 
            "review": "It's experience of desert in car was stomuch vomiting experience. Where is happiness in it i no where found anything but in desert you will feel relax. I saw allah and mohammed peace be upon him on sky in cloud clearly. It was written in arabic. Belly dance must see. Tour huts of foods was good."
        }, 
        {
            "index": 134, 
            "rating": "5", 
            "review": "Very beautiful. It was lovely to drive in to the open desert but please ensure that you have experienced drivers and good strong 4x4 vehicles which have been modified to go into the desert. Also ensure that you have plenty of water, food and a full tank of gas."
        }, 
        {
            "index": 135, 
            "rating": "5", 
            "review": "Desert Duning Dubai. The sand dune bashing was surreal. I had never been to a desert before. The desert safari tour brings people to the interior and good part of the desert. As far as the eye can see, its all sand dunes. I felt out of this world. As much as I enjoyed it I became very dizzy after 15 mins. But it was worth it. We took a 10 min video from the front seat and had it uploaded to Youtube. The second part of the tour for me was a bit disappointing. After the duning they took us to a man made desert camp. It was the attitude and the way they ran the camp. They always try to get people to spend more for various things. We were treated like cattle herds during the buffet dinner. They told people to hurry and move along the queue lines. So we had to quickly take our food and move along. A lady asked us if we would like to have the VIP table which meant a proper seating table and food would be brought to us during the shows and before everyone gets to eat. The charge was 150 USD for my husband and I and our two small children. Later she reduced to a 100 USD. She said the queue would be very long. We declined and later when dinner started there we three queue lines and the wait was not long and line moved quite fast. The shows were good. I wish dinner started earlier instead of about 7.30pm or past that."
        }, 
        {
            "index": 136, 
            "rating": "5", 
            "review": "Desert Safari. I have been to desert safari earlier also.....this was my third visit...its a good experience once again.....the ride is very adventurous....then the belle dance, followed by fire dance. The food is good.......in all a must for the visitors......"
        }, 
        {
            "index": 137, 
            "rating": "5", 
            "review": "Doon Bashin. Amazing Trip, Doon bashing, Sheesha, Tandura Dance, Belly dance. Food was not so good. But the overall experience was amazing."
        }, 
        {
            "index": 138, 
            "rating": "5", 
            "review": "nice place must visit its hatta oman value for money. nice places very enjoy the ride, free dinner, bely dance, shows was there nice & very enjoy with family or friends dance was superb must visit"
        }, 
        {
            "index": 139, 
            "rating": "4", 
            "review": "nice. A nice piece of well conserved desert with few animals and touristy infrastructure - that serves the purpose of providing a novel experience to tourists - sand smashing in SUV , and very short falcon show, camel rides and evening wet up of belly dancing with drinks .. overall a good show for one time visit"
        }, 
        {
            "index": 140, 
            "rating": "5", 
            "review": "A must do activity in Dubai. One of the best \"tourism\" activities I have done. Dune Bashing, Live dancing show, camel riding, Quad Bike and good food is what you want to have as memories. Book a safari with sunset programming. Amazing to be in the desert when the sun will set down. A combination of a jeep safari, dinner in the desert and a great Toyota Land Cruiser brings the complete fun to you!!! It's an activity one must not miss"
        }, 
        {
            "index": 141, 
            "rating": "4", 
            "review": "Popular attraction to tourist. We visited the desert by 4x4 wheel drive which is quite popular among tourists. This program has provided an exciting option to visit the famous desert in addition to other entertainment like camel ride, dune bashing, belly dancing, shisha testing, Arabic coffee and BBQ dinner. Your trip is not complete without it."
        }, 
        {
            "index": 142, 
            "rating": "5", 
            "review": "We visited this reserve from the air via a hot air balloon. The desert is very cool to view from the air. We were able to see different types of animals from the air."
        }, 
        {
            "index": 143, 
            "rating": "5", 
            "review": "Highlight of our holiday. We booked a desert safari with Arabian Adventures. Had a fantastic trip complete with falconry display, camel rides, henna tattoos, watching the sunset, food under the stars and a belly dancing show. Totally recommend it as this was the highlight of our holiday."
        }, 
        {
            "index": 144, 
            "rating": "4", 
            "review": "Beautiful!. The desert is beautiful and the dune bashing was an experience! The entertainment was great and the food was AMAZING!! The only thing I didn't like was there was lots of trash in the desert and I noticed the drivers were just throwing the trash out the windows. I hope that's something they stop in the near future to bad to ruin a a beautiful treasure. If we go back we'll do it again!"
        }, 
        {
            "index": 145, 
            "rating": "5", 
            "review": "great. This was really fun. After driving trough the desert we had some great barbeque meal with exellent entertainment"
        }, 
        {
            "index": 146, 
            "rating": "5", 
            "review": "A memory for life. We went out here to relax for a barbecue, tires on our Jeep were deflated to allow travel over the sand, parked up beside an oasis, set up the barbecue, deck chairs table etc, kicked off the shoes and just crashed out to the setting sun in 42 degrees, food finished watched a new full moon come up over the desert, lit a fire and chilled out for another three hours, what an incredible experience, never to be forgotten. We re-inflated the tyres and headed back to the City under a full moon at 27 degrees C, could have stayed all night!"
        }, 
        {
            "index": 147, 
            "rating": "5", 
            "review": "Amazing Experience!. If you go to Dubai and do not grab the opportunity to go to the Desert Safari, do dune bashing and enjoy the desert night camp, my friend, you are seriously missing a lot!"
        }, 
        {
            "index": 148, 
            "rating": "5", 
            "review": "4wd sliding!. Unbelievable experience. Thoroughly professional team by Arabian Adventures. The scenery, food, drinks and entertainment was exceptional."
        }, 
        {
            "index": 149, 
            "rating": "5", 
            "review": "AMAZING experience. We visited the Dubai Desert Conservatin Reserve during out stay at Al Maha resort. The experience was simply stunning and amazing. The area is just breathtaking and special. I never thought that desert could be so beautiful! A MUST!"
        }, 
        {
            "index": 150, 
            "rating": "5", 
            "review": "Morning nature safari including breakfast. We joined others going on an early morning nature safari in the Conservation Reserve that included a 'Bedouin' breakfast. We were picked up from a nearby hotel in a comfortable, 4-wheel drive vehicle. While it could have seated quite a few, we had it to ourselves, so all four of us could enjoy a window seat.We saw lots of oryx and gazelles, and two large lizards, plus many birds. We enjoyed the 15-minute camel ride to our breakfast spot in the shade where we enjoyed good Arabian coffee, fresh dates, pancakes with honey, chickpeas, and noodles. Was this genuinely a Bedouin meal, or just one that would appeal to visitors from 3 continents?The starting point in the Conservation area had neither toilets nor water, so make sure to go before you leave home, and bring your own drinks. Water was provided, however, as part of the breakfast, and there were toilets near there, though we were not told about them."
        }, 
        {
            "index": 151, 
            "rating": "5", 
            "review": "Desert - Breathtaking....sunsetting. made my 50th Dream come true by being in the desert, riding on a 4x4 and camel ride!!! wow what more than a 50 year old woman want."
        }, 
        {
            "index": 152, 
            "rating": "4", 
            "review": "A bit different desert experience. Above and beyond the usual desert experience, this park offers insights into flora and fauna that can thrive in this environment with consistent conservation efforts. This might not be worth the trip (1 hour each way from Dubai) unless it is combined with other nearby activities."
        }, 
        {
            "index": 153, 
            "rating": "5", 
            "review": "Exhilirating!. The safari was awesome. We very much enjoyed it and would definitely do it again. The rush was terrific!"
        }, 
        {
            "index": 154, 
            "rating": "5", 
            "review": "The most wonderful adventure in Dubai. Desert safari is the most wonderful adventure tour in Dubai. The skill of experienced drivers is really amazing. It gives a different thrill and value for money. Don't miss the belly dance and fire show after the desert safari, which generally come as a package"
        }, 
        {
            "index": 155, 
            "rating": "5", 
            "review": "Exciting . Really an exciting experience. We love it, an experienced driver pick up us from hotel with a hammer, and we went to the desert, exciting driving in the sands, and then interesting show full of dancing and singing, and a complete dinner at the end.we would do it again."
        }, 
        {
            "index": 156, 
            "rating": "5", 
            "review": "Exciting trip. We had an excellent tour of 4x4 what an experience in the desert and complicated by a nice food and belly dance yooh it was nice."
        }, 
        {
            "index": 157, 
            "rating": "5", 
            "review": "Out of World Experience. Desert Safari is something one can't missing if you are in Dubai ; exclusive attraction and if you can book your safari on Haamar ride nothing like it\nCamps are wonderful with cultural everts and Nice arabic food"
        }, 
        {
            "index": 158, 
            "rating": "4", 
            "review": "Desert Experience. You can have a taste of the desert with safety by visiting here. If you want you can book and stay at Al Maha Desert Resort for better experience."
        }, 
        {
            "index": 159, 
            "rating": "5", 
            "review": "May 2016. Went for the afternoon safari with North Tours - only £35 each and includes 45 minute dune bashing in 4 wheel drive (hair raising and no good if you get travel sick...). Then had beautiful barbecue in a camp in the desert - first class food, loads of it and soft drinks are free. Entertainment is average though (the ubiquitous belly dancer etc). Pay for extras e.g.: quad biking."
        }, 
        {
            "index": 160, 
            "rating": "5", 
            "review": "A roller coaster ride. This is a must do. Enjoy the trip to the desert in a 4x4, The ride alone was a real roller coaster and enjoyable. Once you arrive you get to choose various activities like riding a camel etc. You then relax whilst you are entertained by a fire show and belly dancers, The meals were deliciously prepared on fire."
        }, 
        {
            "index": 161, 
            "rating": "5", 
            "review": "A must do in Dubai. We loved our tour! You'll see wildlife, dune bashing (make sure you take Dramamine if you get car sick) and have dinner under the stars at a Bedouin camp. Wear tennis shoes instead of sandals would be my suggestion. The sand is really pretty and so fine!"
        }, 
        {
            "index": 162, 
            "rating": "5", 
            "review": "nice tour. comparing to red sand dune trip, this is similar but less beautiful pictures view . But I still enjoy it ! The driver always care of us to ask us if we can take the ride. One more thing, I asked if he can teach me sand drive since I drive SUVs daily. He agreed . However, it was kind of dark, so I did not try."
        }, 
        {
            "index": 163, 
            "rating": "5", 
            "review": "HOLD ON TO YOUR HATS. This is a must driving up and down these dunes by a driver who knowes the limits of the vehicle. Get on board for a thrill of a life time."
        }, 
        {
            "index": 164, 
            "rating": "3", 
            "review": "One time only activity. I would advise other travellers to book online to get a better deal. We got an excellent one as we were happy to take the free shuttle service till the spot from where safari starts. (our hotel was 2 mins walk away from the common pick up point). We were then taken on safari in land cruiser which was thrilling. Its a 10 mins drive to the camp where all the entertainment shows await you. You are served free meal which is not very exciting or appetizing. In all fairness I would not want to rate it bad but to me it was one time affair. I don't think I would like to do it again if I ever visit Dubai again."
        }, 
        {
            "index": 165, 
            "rating": "5", 
            "review": "scary but amaaaazing. Really fun but scary to at the same time. Would love to do this again and the driver who picked us up from the hotel to the desert was truly a very nice gentlemen."
        }, 
        {
            "index": 166, 
            "rating": "5", 
            "review": "This is an absolutely fantastic trip!. This is an absolutely fantastic trip! If you are keen to learn about the heritage of Gulf this is a great place to start. Entertaining throughout and a great way to absorb the culture. Camel ride, a falcon show, visit and dining at beguine camp, so much information about traditions plus entertainment. Everything done just a right way. This is definitely a must do!"
        }, 
        {
            "index": 167, 
            "rating": "5", 
            "review": "Exciting excursions. One of the exciting excursions in Dubai is very cheap can hear a wonderful tour of the desert and enjoy Bedouin tent and belly dancing with tasty food"
        }, 
        {
            "index": 168, 
            "rating": "5", 
            "review": "So much fun!. We had very good driver, who drives the jeep (Hummer) fast but good, it was scary, but actually it was fun. Dinner was delicious, we tried the narghile and we was impressed by the dancing show."
        }, 
        {
            "index": 169, 
            "rating": "5", 
            "review": "Classic sand dunes. Classic landscape of sand dunes with the occasion wildlife that isn't afraid of you. Dune bashing in Toyota Land Cruisers is exhilarating."
        }, 
        {
            "index": 170, 
            "rating": "5", 
            "review": "Ultimate experience. Never miss Dubai dessert safari if you are in Dubai. You will experience a roller coaster ride in Dubai safari. It is completely different experience and not very expensive. You get to see Belly dancing show and other entertainment."
        }, 
        {
            "index": 171, 
            "rating": "4", 
            "review": "Sand dunes, sand and more sand. This is quite good fun - beware if you suffer from motion sickness however - the drivers are really good and they are safe - the experience of being in the desert is unique.The dinner was a buffet and pretty good - with camel rides to try if you feel so inclined. Its about an hours drive outside of Dubai so make sure you have enough time"
        }, 
        {
            "index": 172, 
            "rating": "5", 
            "review": "What a drive. Sadly I suffer from travel sickness & Vertigo so what should have been a very enjoyable adventure was a bit of a nightmare for me however the excursion itself and people involved were all fab"
        }, 
        {
            "index": 173, 
            "rating": "5", 
            "review": "Scary but fun!. It was really cool, the ride was scary but fun as well and at the top we enjoyed sand boarding. The highlight was the BBQ dinner, food amazing and it was fun doing belly dancing"
        }, 
        {
            "index": 174, 
            "rating": "5", 
            "review": "So much fun. Abbas was such a great driver and I had so much fun in the desert. While the food was outstanding and plentiful, the VIP treatment through Milan tours made it even better. Another great tour with Milan tours and their outstanding guides. Everyone needs to do the desert tour and hopefully, you will get Abbas as your driver"
        }, 
        {
            "index": 175, 
            "rating": "5", 
            "review": "Brilliant 4x4 safari experience along with Beduin village trip. Whilst I had to admit I was not looking forwards to this trip, organized by my company after our Middle East conference, I have to say it was a brilliant experience all round, A must do if you visit Dubai"
        }, 
        {
            "index": 176, 
            "rating": "5", 
            "review": "Rollercoaster on 4 wheels!. That's how the drive through the desert felt! Driving over some of the sand dunes felt like we were falling off the edge of the earth! I think this was the highlight of our trip. We used Ocean Travel Tour company which was very organized. The view at sunset in the desert is very picturesque (I took an amazing award winning photograph: if I do say so myself lol)"
        }, 
        {
            "index": 177, 
            "rating": "5", 
            "review": "I totally recommend it. If you are going to Dubai you have to do this. the experience is wonderful, the people are so nice and is not expensive at all."
        }, 
        {
            "index": 178, 
            "rating": "5", 
            "review": "Best part of my trip to Dubai. A must do for any one visiting Dubai. The ride theorugh the desert is beautiful, the sunsets magnificient. We had some people complain about how rough the drive was but we had a wonderful driver that reduced speed when we asked him to. It was a fun fun trip and would definitely do it again. For less than $100 we did the safari and had a wonderful dinner in the desert with drinks and belly dancing, henna, all free!"
        }, 
        {
            "index": 179, 
            "rating": "5", 
            "review": "Also Dubai has beautiful nature!!. Different but beautiful. A must see. I can highly recommend a visit to the desert in this particular area with the nice red sand colors!"
        }, 
        {
            "index": 180, 
            "rating": "5", 
            "review": "Breathtaking adventure. This was the one of the things to do before you retire, amazing experience and breathtaking location with wide variety of events in desert. Must visit place for all who visit Dubai."
        }, 
        {
            "index": 181, 
            "rating": "5", 
            "review": "Exhilarating and enjoyable experience. We booked the tour with dinner at the camp in the Reserve. We were picked up at our hotel promptly at 4.30 pm as advised. It was about a 45 mins drive to the Reserve and we were given a running commentary by our driver Paulo along the way. We hopped off the air-conditioned MPV to a land rover, an option we have chosen.The alternative is to ride on a camel. It took another hour or so driving in the desert to reach the camp in the Reserve. Along the way, Paulo stopped at various scenic spots in the desert for photo opportunity. Bringing a camera is a must. We saw some wild life and rare desert plants and Paulo provided a detailed description and conservation efforts to keep them.On reaching the camp,it was almost pitch dark and the temperature cooled down quite a bit from the 40 C plus during the ride in the desert. We were given a tour of the camp and the traditional cooking facilities. Some local entertainment were arranged before dinner. The dinner was amazingly good and tasty with lamb cooked in the traditional Bedouin style, in a hole in the ground and other middle eastern cuisines, It was the first time we drank camel's milk and it tasted like skim cow's milk. The tour was very well organised, the drivers and staff at the Reserve were friendly and helpful and a great meal. Overall, a great adventure not to be missed. In particular, thank you Paulo for being such a friendly and knowledgeable driver/guide."
        }, 
        {
            "index": 182, 
            "rating": "5", 
            "review": "Vacatio was sweet,. My husband and i, did this we loved it, must try. I took awome pic. Is a amazing veiw, is a amazing experience, being in a desert in the other side of the worLd. Im from florida, my husband got me this trip as bday gift."
        }, 
        {
            "index": 183, 
            "rating": "5", 
            "review": "Adventure ride and masti to the fullest. Dune bashing , belly dancing , camel ride and much more . Food here is a disappointment , specially vegetarian food , is not palatable"
        }, 
        {
            "index": 184, 
            "rating": "5", 
            "review": "4 wheel drive and dinner. While we were in Dubai, we felt we must do a 4 wheel drive and dinner in the desert. The 4 wheel drive was exciting while the dinner was very enjoyable and relaxing."
        }, 
        {
            "index": 185, 
            "rating": "5", 
            "review": "Excellent; a must do. If you don't like roller coasters, do not do this as the rides over the dunes feel like a non-stop roller coaster. I personally enjoyed it (but I enjoy roller coasters), however, some other people in the car felt a bit car sick. Overall, the beauty of the desert will win your heart. A day you will never ever forget."
        }, 
        {
            "index": 186, 
            "rating": "5", 
            "review": "Desert Safari. Good drive on the sand dunes. Went on a Hummer. Drivers drop the tyre pressure before taking us to the dunes. Slopes are quite rollicking. Sunset view is great with the orange skyline"
        }, 
        {
            "index": 187, 
            "rating": "4", 
            "review": "Amazing Experience. Desert safari in Land cruiser was an amazing experience. They pick & drop you from your hotel. Just before entering the desert, they remove good amount of air from the Tyre so that they can do the roller coast ride. Then the journey was amazing, going up & down through sand dunes. They stop in between for sun set in some place. ."
        }, 
        {
            "index": 188, 
            "rating": "4", 
            "review": "Go bare footed or in thongs. This is amazing! We were here in the late afternoon and I was expecting the sand to be boiling hot, but it was nice (it was April). The sand is so fine that it will go through all your footwear. It is nice to wear either no shoes or thongs to avoid the sand going through your footwear."
        }, 
        {
            "index": 189, 
            "rating": "5", 
            "review": "Dune Bashing Morning Drive. Booked this excursion through our hotel the day before. Got picked up from our hotel around 7.30am in a comfortable 4x4 for the 1 hour drive to the desert conservation reserve.The dune bashing experience last around an hour with multiple stop-off points for photographs. We then tried the Sandboarding and Fat Cat Bike activities.Definitely recommend the sandboarding! This was so much fun and our guide was kind enough to video our attempts for us.Our guide was friendly and very knowledgeable - keen to share a lot of information about the wildlife and surrounding areas.Breakfast was provided for us in the Bedouin camp - pastries and jam, fruit cocktail and muffins. Much welcomed after our early start. We departed the conservation reserve around 11.30am which was perfect as the heat was picking up. Definitely recommend for a thrill!"
        }, 
        {
            "index": 190, 
            "rating": "5", 
            "review": "Sundowner Dune Dinner Safari. Another must for your visit. The evening includes: sand dunes in a 4X4; sunset photo opportunity; falcon display; camel ride; dinner in a Bedouin encampment. Fantastic."
        }, 
        {
            "index": 191, 
            "rating": "5", 
            "review": "Sundowner Dune Dinner Safari!. if you want a perfect tour of the desert take the Sundowner Dune Dinner Safari with Arabian Adventures."
        }, 
        {
            "index": 192, 
            "rating": "5", 
            "review": "Great Fun..... a must do.. Booked this online on the day! Picked up from Hotel 3pm and taken to desert area. Transferred to land cruiser and then out into dunes for 30 minutes or so \"dune bashing\". Thrills and no spills!. Quick photo stop and then off again. Finish up at arabic bbq after quick camel ride - Watch sunset over spectacular dunes then evening entertainment includes local dance, fire eater and belly dancer. Buffet meal and unlimited soft drinks. An enjoyable day out and great value at AED 120! Will do again."
        }, 
        {
            "index": 193, 
            "rating": "5", 
            "review": "Its a must do things for Adventure lovers. You can say it a kind of extreme sport. Riding in curve of sand with Land Cruiser or Hummer is gives a thrills with its name only."
        }, 
        {
            "index": 194, 
            "rating": "5", 
            "review": "Desert safari must. You have to experience this! Complete with Dinner and bell dancers. Drinks also available and you can do a little shopping"
        }, 
        {
            "index": 195, 
            "rating": "5", 
            "review": "An unforgettable afternoon!. First time enter into the desert, have feeling with excitement but also a bit scary! The pumping ride with four wheel drive up and down the desert was like riding roller coaster which will never found in other places."
        }, 
        {
            "index": 196, 
            "rating": "5", 
            "review": "Loved this tour. Tour is a must. Camels, falcon, food, dancer make for a memorable evening. This was one of my favorite tours in any country."
        }, 
        {
            "index": 197, 
            "rating": "5", 
            "review": "Driver was a nutter. Definitely not for the faint hearted, driver was incredible, throwing a two tonne 4x4 land cruiser over the sand dunes like a rally driver, fantastic views at the several stopping places.."
        }, 
        {
            "index": 198, 
            "rating": "4", 
            "review": "Amazing exprience. Take the passenger side front seat only if you are not weak at heart. Amazing adventure. A must do for anyone who visits Dubai."
        }, 
        {
            "index": 199, 
            "rating": "5", 
            "review": "Had a great time !. Had a good time, loved the safari, the dunes were awesome, the bellydancing with food is at the end of the day just before you leave, will take a whole day to do everything."
        }, 
        {
            "index": 200, 
            "rating": "5", 
            "review": "DESERT SAFARI. It is one of the best experience. had dinner in the desert and was nicely made. saw belly dance and tanoura show. best place"
        }, 
        {
            "index": 201, 
            "rating": "3", 
            "review": "Work in Progress. While it's great to see so much land dedicated to conservation, and the work that's going on here is commendable, until an apex predator is introduced, it's just the desert equivalent of cows in a field. The Arabian oryx and gazelle are plentiful, but there's not much else to see. When the Arabian wolf is introduced (imminently), the whole ecosystem will become something much more exciting, with the animals behaving more like the wild animals they effectively are, rather than the pampered zoo creatures they think they are. With the wolves will come a greater presence of vultures, sand fox, rodents, and an all-round better conservation reserve. Then this will be a place perfect for expeditions and ethical camping holidays. In the meantime, if you don't know much about the desert environment, it's not a bad place to begin your learning."
        }, 
        {
            "index": 202, 
            "rating": "5", 
            "review": "very amusing experience. One hour drive from dubai, you will enjoy a great desert experience. Book in place your desert safari and you will enjoy a great sunset and a touristic but good dinner \"all you can eat\" with belly dancers."
        }, 
        {
            "index": 203, 
            "rating": "5", 
            "review": "Beautiful and peaceful!. Well looked after and taken care off Reserve! A short drive out of Dubai and an excellent location for a short break!"
        }, 
        {
            "index": 204, 
            "rating": "5", 
            "review": "Awesome !. It was an outstanding moment to get in the desert and do a \"safari\", you'll enjoy the music and the traditional dance, as well as the camels... The one i had taken was said to be 65 years old? !!! Enjoyed it big time !"
        }, 
        {
            "index": 205, 
            "rating": "5", 
            "review": "Small trip. If you want to enjoy at the desert, you can go. The place is okay but evening shows are better. Nice.."
        }, 
        {
            "index": 206, 
            "rating": "5", 
            "review": "Unforgettable Experience. We arranged this tour through our hotel. We were picked up around 3 p.m. in a luxury white SUV that could seat seven people. We had a one-hour drive through the outlying villages to the desert area. The driver was amazing and answered our questions about life in Dubai. A stop to view or purchase your own ATV desert ride, buy refreshments, and use washrooms, gave the driver time to lower the tire pressure in the vehicle so it was ready for the dune ride.With the music cranked up we slid, slided, and rode the dunes for about twenty minutes -- exciting and not for the faint of heart or back. We then stopped to take pictures of the dessert landscape.Followed up with the trip to an oasis where we sampled the local food, music, camel rides (optional), and an excellent show. The sunset was fantastic.This was a highlight of our Dubai trip."
        }, 
        {
            "index": 207, 
            "rating": "4", 
            "review": "Excellent experince. The desert safari is done by Land Cruiser with an experinced Driver who are only allowed to drive in the dunes.It is a life time experience while travelling up and down the sand dunes.The sun set as seen from there is a beautiful sight.There are companies in Dubai who carry out the trips for a costs per head and it also includes other programes and dinner at night on desert camps"
        }, 
        {
            "index": 208, 
            "rating": "5", 
            "review": "Dune bashing and dinner in the desert!. Loved my experience in the desert! Went dune bashing, saw a falconry display, picked wild dates off trees (delicious!), had a (very) short camel ride (wish it was longer) and ended with a luxury dinner in a tent in the middle of the desert complete with henna tattoos and belly dancing. Even if it was a bit touristy, I totally didn't care. This was an incredible experience and I'd for sure do it again!"
        }, 
        {
            "index": 209, 
            "rating": "4", 
            "review": "Unexpected. I wish I was told about the wild and long ride through the sand. My stomach was upset, some people in my group even vomited. But the dinner and the shows afterwards were spectacular. not to mention the Camel ride, the free henna and the Hooka.(all inclusive)"
        }, 
        {
            "index": 210, 
            "rating": "4", 
            "review": "Nice experience even if is a fake. Is a fake like everything in Dubai, but you can take very nice pictures and have a very nice dinner in the luxury camp."
        }, 
        {
            "index": 211, 
            "rating": "4", 
            "review": "So exciting!. Our trip to the desert was so exciting for our little grandson, Frank. The more he squealed for joy as the driver of our jeep style 4 by 4 went up and down the sand dunes the more the driver chose to go up and down them. Nana was not as keen. The heat of the desert was like that of an oven. ( May ) The food provided at the camp was lovely ,very authentic and so was the whole experience but be aware you are sitting on very hard cushions and rugs on the floor. Maybe not as exciting for pensioners like ourselves. A great experience and one I will never forget but a one off for me!"
        }, 
        {
            "index": 212, 
            "rating": "5", 
            "review": "Authentic Desert Experience. Working with a tour group, we traversed the Dubai Desert in 4 wheel SUV's. It was barren (of course) but the sunset was breathtaking."
        }, 
        {
            "index": 213, 
            "rating": "4", 
            "review": "Desert splendor. The UAE have perfected the art of making their visitors to enjoy everything about their country. The desert experience is breathtaking and watch sunset from the sand dunes was breath taking!!"
        }, 
        {
            "index": 214, 
            "rating": "5", 
            "review": "unbelieveble. All I can say - this was the highlight of the trip. Really really happy with this experience. we took a tour with a company - Arabian adventures. there was six of us in a car and our driver was very good. he shared a lot of knowledge about UAE and Dubai history and some interesting facts. He was driving carefully, but still with a fun :) and constantly was asking if we are ok. driver said that some times people are feeling sick while driving in the desert, but we were fine and really enjoyed it. There was enough stops to take pictures were noting else is visible just a sand :) we really had enough time and the was no rush at all, so we felt relaxed and happy to experience it. The evening program was quit good and the diner was great (they served some alcohol) - eat what you want and as much as you want. really amazing experience and I would repeat it again and again. still unbelievable how the people survived in the sand and how did they found the way, as there is nothing just a sea of sand :)"
        }, 
        {
            "index": 215, 
            "rating": "4", 
            "review": "fun mix. seemed a little chaotic at first, but then the drive, the ATV ride on the dunes, camel rides, the shows, the food,etc...was worth it."
        }, 
        {
            "index": 216, 
            "rating": "4", 
            "review": "A bit of nature left in the Emirates. The Dubai Desert Conservation Reserve is well worth a trip, this should be organised from Dubai. As far as we could find out an individual trip is not possible except by staying in the Hotel of the National Park.We travelled 45 minutes around on the sand roads of the National Park, which was nice but to our impression too short.The advantage of the National Park was that we have not seen the tours of 4WD cars driving up and down the dunes, destroying everything what may grow or live in the desert. We hope that this shall not be allowed in the National Park."
        }, 
        {
            "index": 217, 
            "rating": "3", 
            "review": "Dune Bashing. Dune bashing overall was fun but I hoped there was more to do. The camp after the safari was fun, the alcohol deals were amazing. 30 AED approx for a Corona. Again a must do when you visit Dubai. The evening slot of 4pm is the best to see the sunset, to see the desert through daylight and moonlight."
        }, 
        {
            "index": 218, 
            "rating": "4", 
            "review": "Good Experience. The desert safari I booked with Happy Tours, because I went on my own, I ask them to pick me and drop me from my apartment, and they did that, that safari include Dune bashing, Camel ride, bike ride, Henna painting, shesha smoking, belly dancing and some cultural activities, buffet supply of food including Veg and Non Veg.Whole activity would take about 5 hours. (but most of this places are handle by Indians or Pakistanis , i mean it is not real Arabic, so in experience wise its good but i felt that it is not real Emirate thing.)"
        }, 
        {
            "index": 219, 
            "rating": "4", 
            "review": "its a desert experience only. this is highly recommended if you have not been in the desert; great experience with sand dunes and camel riding; can also book for a safari"
        }, 
        {
            "index": 220, 
            "rating": "5", 
            "review": "took the jeep ride and camel too. the camel ride only lasted about three minutes. so it was very disappointing, they had sand boarding but it was only one ride down that lasted about ten seconds unless you wipe on on the way down. the jeep ride was awesome and the dinner dance show was okay. please consider tipping the drivers they really appreciate it."
        }, 
        {
            "index": 221, 
            "rating": "5", 
            "review": "Worth going. I would recommend booking with the Dubai Conservatory group. Though more expensive it's a better service and experience."
        }, 
        {
            "index": 222, 
            "rating": "5", 
            "review": "Take a Dramamine before you go, but do not miss it..... We did a dune safari with my wife: unbelievable experience, but if you have motion sickness, take a Dramamine before you go. You will see in sunset in the desert, which is spectacular! The four-wheel drive will be go climbing dunes, one after another at very fast pace. The sand will be kicked sideways by the tires, the car will slide down taking impulse and climb another dune...Your heart beat will speed up while your go-pro saves the memories for a later sharing with your friends...."
        }, 
        {
            "index": 223, 
            "rating": "4", 
            "review": "Different but nice experience. A nice experience.You are taken to the middle of the dessert in a Jeep. That journey per-se is a different and adventurous ride.There are some cultural activities, food and other fun activities once you get to the middle of the dessert.Whole activity would take about 5 hours. Best kept for the afternoon/evening time.Bear in mind that it can be very hot during mid day at the middle of the dessert.SO make sure you take enough water to hydrate yourself. Of course you can also buy refreshments in the middle of the dessert, as well if need be."
        }, 
        {
            "index": 224, 
            "rating": "5", 
            "review": "Fantastic evening. The desert safari is a fantastic experience. Dune bashing to belly dancing to dinner - Everything was well organised and the experience overall was great!"
        }, 
        {
            "index": 225, 
            "rating": "5", 
            "review": "A must do in Dubai!!. We booked safari with Desert Rock Tourism! We booked over e-mail and lady called us daay before the trip to confirm it all. We paid directly to the driver in front of the Lulu Supermarket. Dune driving, camel ride, hanna painting, and dinner - everything was great! Recommend!"
        }, 
        {
            "index": 226, 
            "rating": "4", 
            "review": "Desert Safari. Desert Camp is Great, Dune basking is adventurous in Desert Safari, if you go to safari then ride Quad bike or Burpi (four wheeler jeep)"
        }, 
        {
            "index": 227, 
            "rating": "5", 
            "review": "Excellent reserve . Excellent conservation reserve. There are two ways to really take advantage of this great place. Staying at Al Maha or doing an organised tour with Platinum Heritage. Both are fantastic. You won't see any quad biking, dune bashing or fake tourist belly dancing rubbish here. What you get here is an education into desert life and some true culture"
        }, 
        {
            "index": 228, 
            "rating": "5", 
            "review": "desert safari. My best experience yet! It was amazing driving in the desert, riding the quad bike in the desert and seeing the belly dancers, henna application by the locals"
        }, 
        {
            "index": 229, 
            "rating": "3", 
            "review": "Get ready for a bumpy ride!. Booked a dune bashing session. Sands were lovely but if anyone is going dune bashing - beware - its a very bumpy ride and recommend you don't eat anything beforehand!"
        }, 
        {
            "index": 230, 
            "rating": "5", 
            "review": "Great place. We did the 4 wheel drive /camel ride. It was great fun riding over the dunes. the driver was great showing us the dunes. They great drivers"
        }, 
        {
            "index": 231, 
            "rating": "4", 
            "review": "Great experience. Went with my husband and 24 year old daughter. We all thoroughly enjoyed it. The dune bashing was enjoyed by all of us and we had a chance to have our pictures taken with falcons. We did the sand boarding, and had a nice dinner with a live show which was enjoyable.Only part of this trip we didn't enjoy is the camels. We felt very sorry for them, seemed to be very over worked and were not given any rest. The camel owners would put 2 rider on each camel and have them walk about a couple of hundred yards and back again, then let the riders off and do it all over again with out any rest. In some cases the 2 riders would be 400 lbs & more. You could see the camels struggling and being over worked."
        }, 
        {
            "index": 232, 
            "rating": "4", 
            "review": "desert safari in the morning. i did the morning safari which is not attached with all the night activities only dune bashing , liked it very much the power of land cruizer and the skill of driver tested. advantage in the morning if the crowd is less they do more wild driving."
        }, 
        {
            "index": 233, 
            "rating": "5", 
            "review": "GREAT EXPERIENCE. Its a very well organise tour. Starting with pick-up, the adventure between the dunes and the great dinner at the bedouin camp !"
        }, 
        {
            "index": 234, 
            "rating": "5", 
            "review": "Adventure. Package include all dinner , dune bashing, a falcon show, camel riding . children enjoyed all and also they had belly dancing and local entertainment . Good Fun"
        }, 
        {
            "index": 235, 
            "rating": "5", 
            "review": "Just Deserts. This was highlight of Dubai trip, filled with 4WD dune drifting, animal watching and ATV circuit riding. More than a marina walk, the desert opportunity - the onyx, deer and stars - and insanely fun driving left memories the sands of time won't cover. Must do and possibly for less than this number indicates."
        }, 
        {
            "index": 236, 
            "rating": "5", 
            "review": "VACATION 2015. This is one thing you must do when ever in Dubai,else you have not been to UAE. The life style of an Arab is attached to the Desert. The fun here is memorable and you will always wish to come back soonest."
        }, 
        {
            "index": 237, 
            "rating": "5", 
            "review": "Beautiful Place!. It was awesome!!! Best experience ever! I loved this tour, I highly recommend it. I Enjoy this day on my trip!"
        }, 
        {
            "index": 238, 
            "rating": "5", 
            "review": "Desert Adventure. During a visit to Dubai we booked to go on a desert adventure in a 4X4. The company picked us up in Dubai and took us out to the desert where we were treated to an hour of desert driving over the dunes - what a BLASTHighly recommended and a MUST on anyones bucket list of things to do.Absolutely AWESOME"
        }, 
        {
            "index": 239, 
            "rating": "5", 
            "review": "Awesome adventure. We really enjoyed the excursion - desert safari. Sand bashing was a bit scary as the drivers really go wild on these expensive land cruisers. At every curve it almost felt like the vehicle is going to turn over a good adventure overall though. Family really enjoyed the time in the camp were food and drinks were served as well as different shows and camel back rides"
        }, 
        {
            "index": 240, 
            "rating": "5", 
            "review": "A great experience. We did a dinner dune safari with Arabian adventures, great from start to finish, dune driving, falconry, camel ride, henna painting, food and drink. Only down side was we were in the very back of the jeep and it was a bit tight for my husband who is tall."
        }, 
        {
            "index": 241, 
            "rating": "5", 
            "review": "need some adrenaline ??. as a beach person I couldn't imagine that I'd fall in love with desert but I did.... it was breath taking being on the desert, the infinity feeling it gives you need to experience it to understand.and of course for sure for some adrenaline you need to take the desert ride but make sure that you are not getting sick cause there were few people really got sick on the ride so be sure you are not too full and something in case to ease your stomach :) and try to go there on the sunset so you can enjoy watching the sunset before the dinner"
        }, 
        {
            "index": 242, 
            "rating": "4", 
            "review": "Amazing experience. Desert Safari was really nice experience with driver Mr Ali from Oasis Palm tours. but the BBQ dinner by Oasis was not even like worth rushing, limited options, most of the items finished before all tourist get it. Oasis BBQ staff treated tourist like beggar and came here without paying anything for free food.Dance performance was really amazing.I will suggest to not miss the Desert Safari but stay away from Oasis Palm. There are other travel agencies also which provide same package"
        }, 
        {
            "index": 243, 
            "rating": "4", 
            "review": "Breath taking Experience. We chose this adventure because we wanted to see the desert. In Dubai, we saw a lot of man made buildings but not much of nature. We were surprised that our driver is Pakistani. We shared with him our previous visit to Gilgit. The Reserve offered many options, some of them not common experiences, like falcon watching and rolling up and down the sandy landscape. There are choices of difficulties.We chose the least challenging but my poor wife still felt nauseated. There was a nice desert meal and Belly Dancing. People could ride camels but I preferred taking picture of the beautiful sunset. A Desert Sunset is indeed a memorable experience."
        }, 
        {
            "index": 244, 
            "rating": "4", 
            "review": "This is a MUST-DO for Dubai visitors. Whaooo; this was a great experience, and real thrill for adrenalin junkies. Certainly beyond my expectations.We were issued 4X4 Toyota Land Cruiser, with a very experienced and friendly driver from Iran (Bashir). the trip started off with forward and sideward sways and swing on the SUV cutting through dunes and sand. I couldn't stop the wife and kids screaming through the near-vertical drops, side-swings, crest rides, etc. It was really fun and different.The food at the camp met basic expectations, considering the venue and how far it from 'civilization'. a buffet in the desert is an experience.we had some star gazing moments where one comes in touch with nature, and wonder at the majestic creation of God, and his awesomeness (for those who believe). You cannot but realize how small you are in comparison to this great creation, and why you cannot afford to live without acknowledging the existence and rights of the next person.A bit disappointing was the belly dancer; just one girl swinging her hips through the session. It was nice at the start, but quickly became mono-tonous. I guess they could introduce some more excitement here.Overall, great experience, I will certainly want to do this again, though I am sure my spouse has had her fill already."
        }, 
        {
            "index": 245, 
            "rating": "5", 
            "review": "Ride the Camel thru the Desert Sands. Had a wonderful experience in Dubai riding a camel and having traditional Bedouin dinner. The reserve is located about an hours rude from the main city. You have the option to pick your type of experience. There is a jeep excursion or camel ride. We chose the camels. So glad we did. What fun. The ride was about a 45 min thru the desert with your guide. From there we stopped and joined the rest of the group for a falcon show and a glass of cold juice. We all got into jeeps and headed for the Bedouin camp where we were introduced to their way of life and hospitality. We were fed a variety of food from chicken rice to lamb and stewed camel. A beautiful dance and a relaxing moment with a hookah. A must do for anyone."
        }, 
        {
            "index": 246, 
            "rating": "5", 
            "review": "Best trip in Dubai!. We did the Platinum heritage tour here and it did not disappoint. We saw plenty of oryx and arabian gazzeles. The desert is gorgeous."
        }, 
        {
            "index": 247, 
            "rating": "5", 
            "review": "A must in Dubai. The desert is beautiful and amazing. 4 wheeling and dune bashing is something you must do if ever you visit Dubai. It's a one in a lifetime experience and hard to pass up."
        }, 
        {
            "index": 248, 
            "rating": "5", 
            "review": "Amazing full day activity. If you are in Dubai and you didn't do this activity then you just waste your money. Amazing Desert activity."
        }, 
        {
            "index": 249, 
            "rating": "4", 
            "review": "Pleasant enough drive. We visited the conservation area as part of a luxury desert experience. The drive in 1940/50s Land rovers was good and a pleasant experience. The reserve is not really teeming with wild life - we saw some antelope but little else. The sand dunes though were interesting especially the way they are formed and continually shifting."
        }, 
        {
            "index": 250, 
            "rating": "4", 
            "review": "Memorable and exciting ride - colder than you think. Desert is cold during Mar, 21Degress Celsius during night time. Experience the bumpy ride, while the driver will try to get you vomit during the ride. Settle down in the middle of no where, enjoying the smooth sand and sun bath with cold breeze. Enjoy private function in the middle on desert within a castle with buffet, Shisha, belly dance, traditional dance."
        }, 
        {
            "index": 251, 
            "rating": "5", 
            "review": "Memorable. The Desert safari is a must for all those adventure lovers and first time visitors to Dubai.\nThese drivers are professionals and know how to drive the vehicles over the sand. The entire experience is memorable and not worth missing."
        }, 
        {
            "index": 252, 
            "rating": "5", 
            "review": "the Desert safari. wow the ride was good and enjoyable in a 4x4.you will drive in the warm desert for almost or more then five teen minute.there we did the dune bashing and on return there was camel ride and sand ski.dubai desert safari is an amazing thing you can afforded to miss out when visiting the UAE. These safaris kick off mostly in the morning."
        }, 
        {
            "index": 253, 
            "rating": "5", 
            "review": "best thing to do when in Dubai. we really enjoyed the desert safari!! the ride is like a roller coster , everyone enjoyed it ,from our 5 year old son to my 58 year old mother !!!"
        }, 
        {
            "index": 254, 
            "rating": "5", 
            "review": "must go thing. i had booked my desert safari the day i reached dubai as this was first thing i wanted to do. and i was not at all dis appointed"
        }, 
        {
            "index": 255, 
            "rating": "5", 
            "review": "I tried North Travel Company. I tried north Travel Companyit was wonderful Especially the Driver Akbar was very friendly and he is very talented drive"
        }, 
        {
            "index": 256, 
            "rating": "3", 
            "review": "Nice and Attractive for European. floating on sands is very attractive and have a ME dinner in desert is fantastic. but usually regular tours too short."
        }, 
        {
            "index": 257, 
            "rating": "5", 
            "review": "Awesome experience. We went for desert safari and it was one of the finest rides we ever had?. The chauffeur was brilliant and absolutely very skilful...The Range Rover was literally going up and down and we have never seen something like this before... Thoroughly enjoyed the trip and also the belly Dancing and other programmes that were conducted on the camps.."
        }, 
        {
            "index": 258, 
            "rating": "5", 
            "review": "Beautiful Experience. Lovely experience, serene, quiet and a wonderful experience. Lots of fun driving through the desert, particularly beautiful when the sun was setting. If you are lucky you will be able to see a few animals in the desert."
        }, 
        {
            "index": 259, 
            "rating": "2", 
            "review": "Only for dune buggy fans. I took a group of photographers to shoot here and we were all bitterly disappointed. This is an activity for those who like dune buggy rides that are quite perilous (as evidenced by all the auto parts scattered around the site). Tire tracks everywhere. We did not take one image."
        }, 
        {
            "index": 260, 
            "rating": "5", 
            "review": "A great experience you can't do in many other places in the world. We started off by being picked up from our cruise ship. we had been warned to avoid the back seat in the 4wd as there wouldn't be to much leg room. Guess where we ended up in the back seats, but we were ok with them. Leg room was ok, but my issue at nearly 6 foot was no where to put my feet and getting in and out wasn't easy.Once at the reserve they took you to see some hawks being flown where free soft drinks were provided, and then off you went to the roller-coaster drive through the desert.You couldn't have been throne around more in your vehicle, it was a unique experience, but make sure you hold on tight.They do stop a couple of times for you where you can get out and take photos. Unfortunately if you are at the back of the convoy like we were there is no way you can get a photo without people in it as all the other people have been at the location for a while before you, and very soon after you get there they start calling you back.We were on the sunset trip so at the stop to see the sunset you had to walk to the top of next dune to avoid people in your photos and then when you got to that dune you found someone on the next one in you way and so on. After about 4 dunes you finally got a view with nobody in it. Why these people couldn't have stopped at the first dune which meant we all got a view with nobody in it I don't know.After the sunset we were taken to a camp, where you got to experience more of the local life, camels rides, sand surfing, henna tattoos, food, drinks, pipe smoking, belly dancing, and finished off with them switching off the lights so you could see the stars.A great all round experience, and you get to bring some of the desert home with you with all of the sand in your shoes."
        }, 
        {
            "index": 261, 
            "rating": "5", 
            "review": "Definitely worth experiencing. We enjoyed the desert safari and the camp, with some performances, the atv bikes and camel ride.\nThe food at the camp was v average though."
        }, 
        {
            "index": 262, 
            "rating": "5", 
            "review": "DUBAI WHITE SAND. the wind blows the sand in waves, it is like a picture post card, we rode on camels here and we walked in the sand to the highest place it was clean and the cool sand was therapy to yr feet. we just walked and took pics.There were other people, we had egales on our hand we had to wear protection so we did not get scracted. It was like out of the movies but we loved every bit of it."
        }, 
        {
            "index": 263, 
            "rating": "5", 
            "review": "is good to ride the dunes. is a place to go if you are travelling this part of the world. but you have to be careful if you have car sickness. the only thing that did not be good is all the trash thrown by travellers and locals directly on the sand."
        }, 
        {
            "index": 264, 
            "rating": "5", 
            "review": "Arabian AdventuresDesert Safari - so much fun. Arabian Adventures Deserts safari was the best fun ever, Wajid our driver was awesome, he made the experience so much fun with his great stories and sand dune driving skills. If you want a great experience ask for Wajid, but be prepared if you ask for extreme as he will deliver."
        }, 
        {
            "index": 265, 
            "rating": "5", 
            "review": "Amazing. Not far from the city, This gives you a sense of the way is was 50 years ago . Bring eye drops because the sand blows around"
        }, 
        {
            "index": 266, 
            "rating": "4", 
            "review": "ADVENTURE. If you like adventure this is for you.Is a great adventure tu do, you will love it, have fun and ride a Camel"
        }, 
        {
            "index": 267, 
            "rating": "5", 
            "review": "Great adventure. I loved this part of my trip. It was amazing to see the dessert, ride the camels and watch the sunset :)"
        }, 
        {
            "index": 268, 
            "rating": "4", 
            "review": "GOOD ADVENTURE WITH THE FAMILY!!!. So many things to do:-Dining-Watch the fa con show-Ride a camel- Watch the bally dancing.- Take sunset and dunes pictures."
        }, 
        {
            "index": 269, 
            "rating": "4", 
            "review": "Adventure in Dubai Desert. ID you visit Dubai and do not visit Dubai Desert then you did not see Dubai. The Dubai Desert is really a must see attraction."
        }, 
        {
            "index": 270, 
            "rating": "5", 
            "review": "A must do especially for expats or tourists. We did a dinner tour that included dune bashing, a falcon show, camel riding, an amaazzing dinner, & belly dancing. My husband and I took our 2 children, ages 10 & 7. We all had a blast. I cannot recommend it enough. There were plenty of opportunities for stunning sunset pictures against the beautiful sand dunes too."
        }, 
        {
            "index": 271, 
            "rating": "4", 
            "review": "Nature is amazing. This area was so worth a visit. I'm not sure if you have to do it as part of a tour but we were in open-top old cars and there were so many animals that we passed. In the height of summer it was very hot but not too unbearable."
        }, 
        {
            "index": 272, 
            "rating": "5", 
            "review": "Desert Safari. One word for this - WOW.\nDesert safari is the bestest thing I've enjoyed in my stay at DUbai. Land cruiser, Sand Dunes, Desert.. just wow, wonderful experience."
        }, 
        {
            "index": 273, 
            "rating": "5", 
            "review": "Great experience of the desert. I've wanted to go out into the desert for several years and this trip didn't disappoint. I believe there are only a couple of companies that are licensed to take visitors into the reserve and the trip I was on went out in old Land Rovers. That suited me fine because I didn't like the idea of the dune bashing that appears to be done in modern 4x4 vehicles. The Land Rover trip was slower but, having been trained to drive cross-country in a Land Rover, I wasn't convinced that the driver really knew what he was doing. On the up side, we saw many Arabian Oryx and the views across the desert were stunning.The tour finished at a recreated Bedouin camp with Arabic food and drink. Overall hugely enjoyable and definitely recommended."
        }, 
        {
            "index": 274, 
            "rating": "5", 
            "review": "Excellent Experience. Simply loved the experience of Dessert Safari with your Land Cruiser moving up and down on the Sand dunes. The Sunset experience and the nature makes it a timeslap."
        }, 
        {
            "index": 275, 
            "rating": "3", 
            "review": "Interesting for Dune rides and Wildlife. If you want to see the authentic desert, ride the dunes and encounter wildlife such as Oryx and gazelle this is a good place."
        }, 
        {
            "index": 276, 
            "rating": "4", 
            "review": "Good as any other desert. This desert is also good as any other deserts that you would find. I went to the desert on my desert safari."
        }, 
        {
            "index": 277, 
            "rating": "5", 
            "review": "self. This was a very good desert safari experience and worth the money and the time we enjoy. I would say they offered a lot for the money we spent for the safari."
        }, 
        {
            "index": 278, 
            "rating": "5", 
            "review": "Bumpy ride into the deserts. The ride is really bumpy and you may feel a bit nauseated. But once you get off, you will see what nature can do even with just sand. Enjoy the elaborate dinner buffet and some fun rides in the sand."
        }, 
        {
            "index": 279, 
            "rating": "3", 
            "review": "nice people, unique 4x4 but a little difficult on windy days.. We ended up doing this tour on a windy day, thus ended up getting a lot of sand in our eyes, ears, and clothes. The folks operating tour were pleasant the meal was good, however the falcons did not take flight."
        }, 
        {
            "index": 280, 
            "rating": "4", 
            "review": "Well preserved red sandy desert. Choose tours that go here.. Only 4 tour companies can enter DDCR (Dubai Deser Conservation Reserve). One of them is Lama Tours. When you do desert tour, I would recommend any tour that takes you to DDCR instead of the other deserts. DDCR area has red sand and very few bushes/trees. So you get a nice feel for desert. Also the dunes around here are bigger."
        }, 
        {
            "index": 281, 
            "rating": "4", 
            "review": "What an experience!. We had a crazy ride through the desert in a 4x4 truck, we was going up and down the sand domes. We then had dinner in the desert. It was an amazing experience, would definitely recommend."
        }, 
        {
            "index": 282, 
            "rating": "5", 
            "review": "Dubia. Great afternoon for every one in a four by four white car\nPicked up from your hotel. We got back to hotel about 9,30 ish\nVer very good"
        }, 
        {
            "index": 283, 
            "rating": "5", 
            "review": "Excellent. Dubai desert safari remind us our Rajeasthan's Thar Jaisalmer tour. This was as excellent as the same. Lots of similar activities like traditional dance, nice dinner , rides with add on Desert safari in hummer car ( not available in Thar). Ride was was awesome, driver (Mr. Pal) was master in his job. If you add more fun, go for night safari."
        }, 
        {
            "index": 284, 
            "rating": "5", 
            "review": "WOW. We went dune bashing here in 4 x 4's. What a great time! We then watched the sunset over the dunes, and our photos are so good, they look like professionals."
        }, 
        {
            "index": 285, 
            "rating": "5", 
            "review": "Fall in love with the desert!. Venture yourself into the Dubai Desert Conservation Reserve and fall in love with the desert as I did. This was my first time in the desert and it definitely was the most memorable experience I brought home from Dubai. I did a nature safari in the morning and did get to see and climb not only the most beautiful sand dunes ever but also some of the protected flora and fauna of this beautiful yet fragile biome, including the lovely oryx and desert gazelle. A unique experience not to be missed!"
        }, 
        {
            "index": 286, 
            "rating": "5", 
            "review": "Amazing. This is a unique experience- You will need to do it to feel the real. Highly recommended for family. You can but your specific clothes at the shop near the Reserve"
        }, 
        {
            "index": 287, 
            "rating": "4", 
            "review": "Good nighttime activity. If you've never been slip facing in the desert this is a must. At £40 for 6 hours of fun which includes food, soft drinks, camel riding and entertainment it's pretty good value."
        }, 
        {
            "index": 288, 
            "rating": "5", 
            "review": "Great adventure . This was my 3rd visit to the dessert safari.It has always been fun enjoying the bumpy rides, the beautiful view of the dessert, amazing sunset view where you can take great photos.The buffet dinner is not so great but I have always enjoyed the sitting arrangements. At the camp site you can also enjoy free henna painting, camel rides, dress up in traditional clothes and take pictures, buy souvenirs, enjoy the tanura and belly dances.Overall, its a place you would want to go back to on your second trip to Dubai."
        }, 
        {
            "index": 289, 
            "rating": "5", 
            "review": "Worth an experience. Very well preserved natural habitat. unfortunately we couldn't see much animals but was a good experience altogether."
        }, 
        {
            "index": 290, 
            "rating": "5", 
            "review": "recommend go for outdoor desert safaru. nice tour and nice view ..recommend to do some survey and choose the right tour guide and driver.tour about 6 hours."
        }, 
        {
            "index": 291, 
            "rating": "5", 
            "review": "Evening safari. We went with Arabian adventures on an evening safari through the desert that included a Bedouin meal and entertainment as well as a thrilling \"Dune bashing\" ride in 4x4s.A hugely enjoyable experience that included wild animals , belly dancing, henna tattoos and a meal.I would not recommend it for anyone with back or neck problems as whilst it was exciting in the 4x4s which were very luxurious you do get thrown around quite a bit."
        }, 
        {
            "index": 292, 
            "rating": "3", 
            "review": "Sickening!. Either we have the worst luck or... Yeah we had the worst driver - he drove like a maniac all from the collection from our hotel, to the desert (got a puncture on the way so had to swap tyres), weaving in and out of cars, was really scary. Got there, and unlike the other drives on the sand, this guy had to be the fastest, and get there first, which resulted in a bone shaking and crazy drive, which made me very sick! We then got beached on a sand dune and was towed off very very harshly by another car with no warning at all. I'm surprised my girlfriend didn't get whiplash as she nearly headbutted the seat in front of her. All in all, pretty horrifying and dangerous. I would typically like something like this but this guy was an idiot and didn't have a care in the world - speeding while texting on his phone, barely holding the wheel, blaring his music... The manager was nice, he helped us ride a camel and it was cool. The rest was horrible."
        }, 
        {
            "index": 293, 
            "rating": "5", 
            "review": "\"Amazing Safari\". We Done amazing dessert safari last week with Driver Sajith and Rashid,These both drivers are talented and amazing,helped alot my family to Enjoy the fantastic evening,and the dune bashing verygood and tent also well.food very tasty,over all very good,we will b back soon."
        }, 
        {
            "index": 294, 
            "rating": "4", 
            "review": "Thrilling. The Desert Safari is a thrilling experience. This is quite exciting for the young as well as for the old."
        }, 
        {
            "index": 295, 
            "rating": "5", 
            "review": "having fun. i visit last saturday in dessert safari with my friends having fun,........we rode a land cruise and had a adventure in desert! desert was really beautiful and after riding we went to a camp and there we rode camel and we had dinner and there was Arabian dance and a lot of show and drawing Hana we pay only 65dhs only."
        }, 
        {
            "index": 296, 
            "rating": "4", 
            "review": "Amazing. We went 4WD over the sand dunes with some locals. It was hairy and fun. Would do it again. You could come across some stray camels if you are lucky."
        }, 
        {
            "index": 297, 
            "rating": "5", 
            "review": "Nice dune drive and dinner. Beautiful dunes and landscape, fun drive, and very good dinner under the stars, well worth going, can recommend this."
        }, 
        {
            "index": 298, 
            "rating": "5", 
            "review": "Beautiful. Well worth a visit to see how the desert is being preserved. An interesting discussion followed by a classical display of belly dancing."
        }, 
        {
            "index": 299, 
            "rating": "4", 
            "review": "Desert Safari - A must do, if it is your first time to a Middle-Eastern Country. If this is a first time for you to a Middle-Eastern country, then the desert safari is definitely a must-do. There are numerous companies offering different packages. Cheaper ones will have shorter trips. The package normally includes dune bashing, a stop-over to enjoy the sunset over the dunes, a camp site buffet dinner and belly dancer, swirling dancer, camel rides and henna painting. Some also offers ATV rides (included in package or additional price). Pick up is usually arranged from your hotel if you are staying in Dubai. They have early morning runs or evening runs. For evening runs, which is best in my view, they will usually pick you up at about 5.30 to 6.00pm (or earlier). Sometimes, the picking up of different guests from so many different hotels, can take a long time. To avoid this, try to go in a group from the same hotel.Over the times that I have been on the dessert safari, I find that the driver makes the biggest difference. Sometimes, when you are lucky, you get a driver that is very knowledgeable and shares a lot of interesting information with you. Sometimes, if you are unlucky you get one that is inexperienced, i.e. you get stuck in the dunes and it takes time to get out of it, at the same time, they are very quiet and just drive (suspect this is because they can’t converse well in English). Most of the time the ‘nothing to write home about’ buffet dinner will consist of barbequed meat and pseudo-traditional fares. Something that I found really weird was that most of the belly dancers were not Arab, they are usually Russian or Brazilian and other non-Arabs. Just to share also that one time, we had a belly dancer that was actually rather fat (nothing against fat people here), it is just that it was not something you would expect of a belly dancer.Tips: 1. Avoid Fridays and Saturdays, as it gets too crowded. 2. Do not have any heavy food before taking the desert safari. 3. Best time to go is during winter months – much more comfortable and enjoyable. 4. Also for safety reasons, best to exclude children below nine years old, to my opinion."
        }, 
        {
            "index": 300, 
            "rating": "4", 
            "review": "Did an organised tour into the desert. * dune bashing - hold on tight!* camel rides - it's bumpy!* henna - beautifully done.* Shisha - traditional experience.* belly dancing - great show.* BBQ - nice and spicy!* sand boarding - brilliant fun.* camping out overnight -priceless.Loved every minute."
        }, 
        {
            "index": 301, 
            "rating": "5", 
            "review": "Away from the glitz and the glamour. A desert experience is simply a must do when visiting the UAE. We camp quite a bit as we live here and only need to travel a short way from home to set up tent in the dunes. Your experience will really depend on the company you go with. It has gone from being a luxury trip out at around 100 pounds per person to numerous companies now offering the trip at very competitive rates - 2 for 1 vouchers are in the Entertainer Book/App. If you go expensive there will be a longer drive - check how long - and fewer people. Avoid Fridays they are busy plus you have all us expats and locals out in the dunes too as Fridays is our day off. We tend to keep away from the tourist though if camping. If you are opting for a morning drive get sunrise - early start but worth it and it is often in the morning after a nights camping that we will see oryx and gazelle wandering across the desert. Camels are pretty easy to time as they will go into the farm for breakfast so you can see them heading across the dunes. All the camels you will see are female and they are tethered so they dont bolt off. Camels down Shk Zayed road would not be conducive to health and safety these days but they did used to roam around the city freely and we often found them in the school playground or just stood in the middle of the road.The usual tour will be a short drive - again health and safety measures are in place and these drivers are under strict rules as to where they can and cannot take you and how far up a dune they can go etc.. not in the old days when bashed up tour cars used to be brought back in the dead of night under tarpaulin so as not to put off business. A stop for sunset and photos and a soft drink is usually on offer followed by the camp site with camel rides, henna painting, belly dancing and the buffet. The more expensive ones will have all these costs covered - check the cheaper ones and what they include.You will have to wait until everybody in your car is ready to leave so you cant decide to just go when you want unless of course you have a car full of guests then pretty much the driver will go when you are ready. The camp is deceptively close to the road so only track on the way out - no dunes - and that is a good thing - nobody wants to be travelling through the dunes at night.It is a great trip - yes a bit touristy these days but if you are here then its simply a must do"
        }, 
        {
            "index": 302, 
            "rating": "4", 
            "review": "Amazing experience. The dune bashing was fun. The food is quite authentic. Loved every part of it - the dunes, the sunset over them, the setting for people and the food"
        }, 
        {
            "index": 303, 
            "rating": "5", 
            "review": "Must Itenary For Dubai>>Desert Safari. You Just cant miss this.This is possible only in UAE and Egypt.I did it with 2 year kid.We enjoyed it.BBQ Dinner and Dance was okay can be skipped."
        }, 
        {
            "index": 304, 
            "rating": "4", 
            "review": "Entertainment at its Peak !!!. Avoid on Fridays !!!As we went on Friday and it was over crowded due to local holiday, normally 20-25 minutes dune bashing in a 4x4 vehicle was limited to just 10 minutes, the desert camp was jam packed with more than 800 people.First activity was photo opportunity with majestic falcon for 10 dirhams each, then AVT drive 100 dirhams for 30 minutes which is too much, then camel ride, one long que for free ride of just 100 meters and another 25 dirhams which is not crowded but we have to pay, then welcome drink, Emirati coffee with dates, then cultural show was awesome !!! and then Belly dancing !!! and finally BBQ dinner which was Ok.We booked our Desert safari through Happy Tourism and paid 115 dirhams each including picking us from our hotel Jood palace ( old Taj palace ) Diera area by a 4x4 vehicle."
        }, 
        {
            "index": 305, 
            "rating": "5", 
            "review": "Must Do In Dubai. If you came to Dubai but didn't go for dessert safari than your trip to Dubai is not completed.Enjoy the best sand dune bashing in 4x4 cars and lovely arabic tents to spent a wonderful evening."
        }, 
        {
            "index": 306, 
            "rating": "4", 
            "review": "On The Land Roller Coaster Ride. This is a must-visit in Dubai if you have only a short trip there. It's a thrilling experience in the desert and for a first timer, I must say it's exciting and took back a memorable journey with me. We were picked up by the 4WD to the desert for a fun ride. I didn't know that a 4WD can be used as a \"roller coaster\" on the sand too! Our driver, Sulaiman from Hormuz Village, is an experience driver and it was beyond thrilling to be in his car. He sped up at the edge of a hill and just drop at the cliff and the car just roll down. I don't think anyone have such driving experience unless you drive through a desert everyday to go to work. I was warned not to roll down the window nor puke in the car without a plastic bag. I was definitely trying to hold myself together not to puke. At the Hormuz Village, we get to go on camel rides, ATV rides, sand board, tried out hanna tattoo and even smoke Shisha (smoke pipes). Some of the rides, we do need to pay but most of it is already in the package. We went with a tour group hence everything has been paid for. Else you can contact Hormuz Village for arrangement. I met a German girl who was there alone and she booked it through the internet. It sounds pretty easy. Our dinner was buffet and some BBQ meat. It was just so-so. Stage show was definitely entertaining."
        }, 
        {
            "index": 307, 
            "rating": "3", 
            "review": "An artificial experience. This tour is the equivalent to a commercial \"Luau\" one can get from any hotel in Hawaii. Although the tour does provide that which is advertised, the product is very commercialized. The SUV ride was fairly short with longer \"Photo op\" stops, the falcon demonstration was short and fairly bland, the camel ride was about 100 metres, the food was not genuine bedouin food and the photo booths in the camp were too remindful of those available on cruise ships - for an exorbitant price. The entire staff are foreigners, as in non-native UAE nationals, and even the belly dancer is from Brazil. Hardly an authentic Arabian experience.True, it's a good way to see the desert. But the whole experience has been really too commercialized to maximize tourist dollar expenditures."
        }, 
        {
            "index": 308, 
            "rating": "5", 
            "review": "Excellent. Dubai Dessert safari is organised in dessert area .. its amazing .. Desert Conservation is Hudge area"
        }, 
        {
            "index": 309, 
            "rating": "5", 
            "review": "Excellent fun! but bad camps.. great safari, great fun, great photos. went with get your guide and our driver rafeek was a great person. made us enjoy every moment. village camps however are just a waste of time. bad tasteless food and too crowded to be enjoyed."
        }, 
        {
            "index": 310, 
            "rating": "5", 
            "review": "Arabian Adventures (Emirates). I did this trip with friends 12 years ago, so this time when I went with my partner, I insisted on doing it again. We booked at the hotel and were collected from there. An hours drive and you arrive, you are taken into the reserve and stop at a small tree'd area to see a falcon show. Then onto the exciting bit, 4x4 over the dunes. The tour stops for photos at sunset, which are spectacular. Please do take a jumper or cardigan as once the sun goes the desert is really quite cold.You are then driven to the camp, where a lovely 3 course self serve meal is provided. They do serve wine and beer as well as soft drinks. Camel rides are available and photos with a falcon. You can have henna tattoos done all included in the price. There is a show after the food and the belly dancer entertains with skill and sass! Before you leave they invite you to star gaze and switch off all the lights, that is quite spectacular.Highly recommend this, approx GBP 60 per person, but worth it. The trip is about 6 hours in total 3pm - 9pm."
        }, 
        {
            "index": 311, 
            "rating": "4", 
            "review": "“real desert”. One must take a Jeep Safari in Desert.It's a life time memorable experience. Camel Safari is also good."
        }, 
        {
            "index": 312, 
            "rating": "4", 
            "review": "Desert Nature Reserve. About 30 km outside Dubai City a visit to this nature reserve is an excellent way of introducing you to the desert landscape and its flora and fauna. We went with Arabian Adventures in a 4-wheel drive land cruiser that was ideal for driving off-road on the dunes. Be warned that the dune driving can be uncomfortable and I would not recommend it if you suffer motion sickness. On our visit we encountered gazelle, were able to sample the delights of fresh dates and had a brief camel ride. Another trip on offer is a sunset supper and if you have never seen the desert at night it is something I would recommend. Our trip was just for half day and our driver, who was from Pakistan, was excellent."
        }, 
        {
            "index": 313, 
            "rating": "5", 
            "review": "Amazing experience. I loved the dessert safari. They charged us AED 300 which included a buggy ride on the sand dunes, camel ride, activities and dinner in a camp - including belly dance, tanu dance, BBQ dinner, pics in the local dress, and other activities. It was quite a different experience. Dinner was good, a delight for the non-vegetarians. The dances were amazing, the rides on the sand dunes was super fun. The driver was good, the rides were smooth and fun. we watched sunset in the sand dunes - very picturous. Overall a great experience. Various tours charge different rates for the different categories of the safari, I was very happy with what we got for AED 300.Would definitely recommend that visitors experience the desert safari. It was a highlight of my trip."
        }, 
        {
            "index": 314, 
            "rating": "5", 
            "review": "desert all the way you can see...!. the experience of this place makes you meet your inner self, gives the feeling that sometimes you need to be alone as well.the desert is spread as far as you can see so to get a good experience you will need to go deep inside. there are many camps which operate in the desert. basically haveing food, hooka and seesha, mehandi, fire shows and belly dancers and tamura dance....apart from these there is the activities like dune bashing, and camel rides and buggys and dirt bikes... will give you a awesome feel if you try any...do's and dont'sgo there in the evening and stay till dark try and book a personal vehicle carry a jacket.... it can get cold do not expect really good food or a variety of options carry your camera...you can get some great pictures no matter how bad you are at photographywear sand friendly clothes.if you are not ok with adventure do not try the buggy. "
        }, 
        {
            "index": 315, 
            "rating": "5", 
            "review": "Amazing dunes.. Our driver was superb. We went up and down dunes over the sides of them with the sand spraying. I admit I was clutching the seat every once in awhile but everyone else just laughed. We visited some camels and petted them in their enclosure. Altogether a fun extra excursions!"
        }, 
        {
            "index": 316, 
            "rating": "5", 
            "review": "Private Sunset Dune Dinner Safari. Oryx, falcons, gazelles, dune bashing, delicious food, camels, henna painting! This is a well organized tour. Our driver/guide Raheel picked us up from our hotel and took us on an adventure!"
        }, 
        {
            "index": 317, 
            "rating": "4", 
            "review": "A Great Ride. From the start it was great. Our driver picked us up from the Hotel and was on time. He was very friendly and spoke English very well. On the drive to pick up the other passengers he did a little site seeing telling us some of the places we were passing.The overall experience of riding the dooms was fun. If you love rollercoasters then you will certainly love this ride.We took a break right at sunset to watch the sunset and give our stomachs a chance to relax. I am not going to pretend I wasn't glad that we stopped when we did. I was starting to feel a little ill by this time. After watching the Sunset (almost set) we set off to the camp where we had dinner and a show. It was a few companies there but we had a table setup for our group and it was a good show. The buffet style dinner was a bit of a letdown due to the long lines and the average food that was served.But overall it was a great experience and if you have time and are in Dubai I would recommend doing this trip. But always checkout the company you pick online reviews. We used Funtours a good rating online and about average price and the fact they were on Groupon."
        }, 
        {
            "index": 318, 
            "rating": "4", 
            "review": "Thrilling!. Great thrill on the 4x4 in the desert, dune bashing it's called. Driver came to pick us up at the hotel, picked a couple of others as well and we made our way. The drive in the desert was so exhilarating, I can't speak for other drivers but ours (Abbas) is very good and the car was always under his control. Tip: carry water when you leave town, there's a stopover before the desert but prices are expensive. And it's a while before food is served."
        }, 
        {
            "index": 319, 
            "rating": "5", 
            "review": "Life time experience. Our family enjoyed it the most. Interesting rides on SUV on sand desert. Best time in January and February. You can enjoy belly dance in the evening and little buffet dinner."
        }, 
        {
            "index": 320, 
            "rating": "5", 
            "review": "Must Visit Destination of Dubai. If you are in Dubai you must plan to visit this place. Its good for people of all ages, especially for children. They provide you a ride through sand dunes in a good four by four SUV like Land Cruiser or Hummer. Most of the trips are followed by buffet dinner in a camp amidst dunes."
        }, 
        {
            "index": 321, 
            "rating": "4", 
            "review": "Must do in Dubai - good experience. Got picked up in 4x4 Toyota and few others were added, headed to desert with stop on the way where the driver reduced tyre pressure and then I came to know was to reduce the bump that we are going to have in the desert safari. It was awesome ride on the dunes, much like fun ride. We were then taken to a camp with lot of people where food and drinks were arranged with other activities. I enjoyed the Bele dance the most but felt it could have been longer. Food was good but place was over crowded and arrangements were hasty. Overall good experience. Recommend to all tourists going to Dubai."
        }, 
        {
            "index": 322, 
            "rating": "4", 
            "review": "WOW. We went for desert safari at this place in Nov15. Enjoyed a lot with family. Nice dunes which rush adrenaline in your blood."
        }, 
        {
            "index": 323, 
            "rating": "5", 
            "review": "woooooow, so exciting. That was soooooo gooooood. I like it. so good driver and beautiful view in desert with delicious dinner, Arabic dance, fire dance, light dance, henna drawing, some south Iranian music, riding desert motor and riding camel. perfect experience."
        }, 
        {
            "index": 324, 
            "rating": "5", 
            "review": "Adrenelin pumping experience. This is an experience not to be missed. A ride on the dunes,over the dunes and down the other side. I am absolutely glad to have experienced this thrilling ride. Not for the old By the way ,i am 68 YRS. A very taxing ride. Definitely not for the old and infirm and for children."
        }, 
        {
            "index": 325, 
            "rating": "5", 
            "review": "WOW to an amazing time!. you MUST, MUST do this when in Dubai. I had a marvelous time in the desert. the tour guide was very friendly, accommodating. prepare yourself for a fun, enjoyable and bumpy ride in the desert. I was definitely surprised and told all my friends about this. I had an amazing time."
        }, 
        {
            "index": 326, 
            "rating": "5", 
            "review": "The evening safari is a must. I highly recommend an evening safari excursion through the Desert Conservation Reserve. After an exciting ride over the sand dunes in a modern 4by4 we had a most enjoyable evening in a Beduin camp, with a buffet meal. This is a must do if you have a few days in Dubai"
        }, 
        {
            "index": 327, 
            "rating": "5", 
            "review": "Thrilling!. Ericsson was an excellent driver! The desert tour was amazing from the perfectly fine sand, to the sunset, to the mild mannered camels, to the dinner and entertainment. This is a must experience excursion!"
        }, 
        {
            "index": 328, 
            "rating": "5", 
            "review": "Desert safari. Fantastic experience worth every penny, did the tour with dubai destinations (driss) would do this again. Highly recommened"
        }, 
        {
            "index": 329, 
            "rating": "4", 
            "review": "dune bashing. dune bashing was an amazing experience so were the sand scooters. a must for thrill seekers. once in a lifetime experience"
        }, 
        {
            "index": 330, 
            "rating": "4", 
            "review": "Half Day Tour of the Dessert. This tour was really amazing. The cool Breeze of Desert, the Desert Safari, and in the evening. Lovely Food & Drinks with the Belly Dancing Show."
        }, 
        {
            "index": 331, 
            "rating": "5", 
            "review": "Dubai Desert. Wasn't over excited to go, but wow this was really a great thing to do ,,hit the dunes in 4 wheel drive vehicles,,staff are very competant and the adventure is really worth it"
        }, 
        {
            "index": 332, 
            "rating": "5", 
            "review": "Camels!. I was able to take a sunset Camel ride across the desert here. It was the highlight of my visit. We stopped at sunset and drank champagne at a little makeshift bar they had set up. Loved it."
        }, 
        {
            "index": 333, 
            "rating": "4", 
            "review": "Nice place for adventure lovers. Its a nice place to be if you are adventure lover types. The sand bashing part is thrilling. Guys with me simply loved the bumps which give you goose-bumps. Go with a fairly empty stomach asa drive could give you some dizzyness. The later camp part of the safari is good, the food served is even better. The belly dance etal is thrill for some.Over all a good experience."
        }, 
        {
            "index": 334, 
            "rating": "5", 
            "review": "Dubais Desert. one of the best experience while in dubai. best visit time is during sunset time. you can enjoy beautiful sunset and beautiful dances."
        }, 
        {
            "index": 335, 
            "rating": "4", 
            "review": "Cool excursion to the desert.. The sand dunes surround you and the golden sunset is amazing. The falcon handler was funny and engaging. Beautiful!"
        }, 
        {
            "index": 336, 
            "rating": "5", 
            "review": "Adventure... Comprising five per cent of Dubai's total land area, the park received permanent protection in 2004 as the government moved to maintain a balance between Dubai's rapid development and the need to preserve its natural and cultural heritage.The International Union for Conservation of Nature and United Nations Environmental Programme gave the park international Protected Area status in 2008, establishing DDCR as the regional benchmark for sustainable development and conservation."
        }, 
        {
            "index": 337, 
            "rating": "3", 
            "review": "Fun and exiting.. we went on desert cruise, in the afternoon, and our main destination was a dinner in the middle of the desert.the drivers were polite, smiling, and had full control over there cars.the drivers do some tricks on the sandy up-slops, it's very much like an off-road kind of experience, but less aggressive.there isn't really much to see except sand everywhere."
        }, 
        {
            "index": 338, 
            "rating": "5", 
            "review": "Dune bashing!. This a must do when in Dubai! We loved it. We did a morning tour with dune bashing and fat bike riding. Love it!Try it!"
        }, 
        {
            "index": 339, 
            "rating": "5", 
            "review": "best dessert safari. we had a wonderful time the tour was wonderful,the people soo loving and kind,we really enjoyed our tour ,special thanks to our driver shafik every helpful."
        }, 
        {
            "index": 340, 
            "rating": "3", 
            "review": "Thriling and Fun experience. Its a desert safari with landcruze ride.Its a ride on sand with up and down the sand dunes.It takes about 20 minutes.Seating in the middle is preferable and if you are in a group .,then elderly and aged should not seat on backseat as there are jurks.If you have a package,then you can enjoy belly dance followed by buffet dinner and also you can have free complimentory photo in traditional arabic style dress.Heart patients and infants should not take this ride."
        }, 
        {
            "index": 341, 
            "rating": "5", 
            "review": "Lifetime experience !!!!. You will love it from the point you will sit in that SUV and come back after desert safari... it is more than just roller coaster ride.. you are actually on sand at one instance and then you will just see sky.. and then suddenly you are going down from sand mountain.. absolutely stunning... Prefer front seat with camera in one hand and handle of SUV in one hand.. you will love the experience from there... once you get down from SUB,, you see beautiful sand dunes all over with sun view... loved it and totally recommend it.."
        }, 
        {
            "index": 342, 
            "rating": "3", 
            "review": "A tourist attraction. Fun in the desert for about 20 minutes and then you get to a park where you have some food such as shawarma and a belly dancing show done by a Russian lady. Waste of time"
        }, 
        {
            "index": 343, 
            "rating": "5", 
            "review": "A great ride. the desert safari was one of the highlights of our trip. The skilled drivers take you for a car ride up and down the sand dunes. It is a thrilling and fun experience. Usually you can book a package deal where after the safari you can stay back for the night show + buffet dinner in the middle of the desert"
        }, 
        {
            "index": 344, 
            "rating": "5", 
            "review": "Sundowner Desert Safari. This is must-do when visiting Dubai. A great 4WD experience through the sanddunes, riding on a camel, dinner and drinks in an \"oasis\" - wow!"
        }, 
        {
            "index": 345, 
            "rating": "5", 
            "review": "Thrilling & Pleasing Experience :). Its was Exciting and thrilling experience one should go and enjoy the Arabian Sand dune with belle dance and mouth watering food . :)"
        }, 
        {
            "index": 346, 
            "rating": "1", 
            "review": "4 Corners Events Desert Safari- TERRIBLE FOOD POISIONING. Don't waste your money! Big money grab ! 2 people of our group of 4 got the worst food poisoning . The only good part was the dune bashing and seeing the desert. The rest of the evening was a poorly organised tourist trap. Don't waste an afternoon and evening doing this when there are plenty of other things to do in Dubai give it a big miss!"
        }, 
        {
            "index": 347, 
            "rating": "4", 
            "review": "Drive the Arabian Desert. It's a good chance to have a look at the famous Arabian Desert, to drive on dunes and to have a sandboarding experience."
        }, 
        {
            "index": 348, 
            "rating": "3", 
            "review": "Dune bashing - a worthwhile rip-off run by expats?. It remains a thrill to go dune bashing for anyone who has never been to a sand desert. It is busy - up to 200 vehicles screaming through the dunes on most days and a dusty meal in a prefabricated 'Berber village' - authenticity NOT guaranteed. That includes entertainment provided by other expats.It is all about making money - along the road at pit-stops or at the 'village'. Even locals putting falcons on your arm, grabbing your own camera to take bad photos and charge you for it.Trying to say no is difficult as they almost 'force' you into things where they can part you and your money......."
        }, 
        {
            "index": 349, 
            "rating": "5", 
            "review": "Great Experience. We had no idea what to expect here but it turned out to be very fun, informative and interesting. I would highly suggest the camel ride and found the hawk demonstration to be really interesting."
        }, 
        {
            "index": 350, 
            "rating": "5", 
            "review": "Great night.. Picked up from the motel mid afternoon and arrived back around 10pm. Sand dunes, shows, camel rides and food was great. Really enjoyed."
        }, 
        {
            "index": 351, 
            "rating": "2", 
            "review": "Very poorly managed Desert safari!. Desert Safari is very poorly managed show! Dessert safari ride is cut down to 15-20 minutes. Managed by very unprofessional people. Everywhere they ask for money! Food arrangements were pathetic. Long queues everywhere for food! Food was served to the tourists as if they were beggars! Belly dance which was main attraction of the show was performed last and by the time we start enjoying this show, driver starts hurrying up to go back to vehicles!"
        }, 
        {
            "index": 352, 
            "rating": "3", 
            "review": "disappointed. Make sure you get a driver that speaks to you and explains why they stop and how you get to have a camel ride"
        }, 
        {
            "index": 353, 
            "rating": "4", 
            "review": "ENJOY...Desert safari, camel ride, scooter dance & dinner . Nice trip it starts after 3 pm... land cruiser is our vehicles ... dessert safari is amazing experience. . If u r lucky .. experienced and funny crazy drives will drive for u... then after 30 minutes u will go to a camp .. There camel ride .. scooter ride ... dance .. then take photos with valture. . Hookka. .. snacks ... carpets for purchase .. beer ... finally dinner ... totally cost around 150 to 180 AED ... so don't miss this enjoy"
        }, 
        {
            "index": 354, 
            "rating": "5", 
            "review": "Great Experience!. It is a great experience to visit Dubai's desert dunes.The trip is not exactly comfortable, you may feel sick since car is jumping all the time but having those views at sunset worth it!"
        }, 
        {
            "index": 355, 
            "rating": "5", 
            "review": "Desert Safari. It was extremely worth experience in desert safari. nice ride in desert little bit scary. same like rola costa drive."
        }, 
        {
            "index": 356, 
            "rating": "5", 
            "review": "Conservation In Mind. Went to this lovely conservation center on a desert tour and was beyond impressed. There are animals and vegetation galore, and the conservation center does a great job with security and keeping those out who would cause harm to this environment. One thing I found interesting is that while they do provide food to the oryx, they move the food around from time to time to preserve their natural instinct to hunt for the food, instead of making them become dependent and lazy. I thought this was a thoughtful, respectful tribute to the wild nature of these animals."
        }, 
        {
            "index": 357, 
            "rating": "5", 
            "review": "Desert Safari!. Do yourself a favor and sit in the front seat of a 4x4. It will be the best time of your life. A good tour will include belly dancing, shisha smoking as part of the dinner experience."
        }, 
        {
            "index": 358, 
            "rating": "5", 
            "review": "“What an adventure!”. You have not been to Dubai if you haven't gone on the desert safari. The whole experience in the land cruisers was spectacular. The adrenaline rush in the dunes was my highlight. The sunset was wow! Another beautiful surprise awaited us - the dinner in the desert seating in a yoga position. Never been to a yoga class but I did it. Too bad it was prayer day I missed out on the belly dance. I must do a repeat."
        }, 
        {
            "index": 359, 
            "rating": "5", 
            "review": "Great. The safari is just great! Loved the ride! The desert seemed so romantic! And sunset in the desert is something! Make sure to catch it!"
        }, 
        {
            "index": 360, 
            "rating": "5", 
            "review": "a must. Booked with \"city tours\". Really good. Quad bikes the kids loved (dont pre book, cheaper to pay when you get there) The dune bashing was a buzz and entertainment and food were good."
        }, 
        {
            "index": 361, 
            "rating": "4", 
            "review": "wonderful. The dubai desert tour was an absolute blast and the night shows were amazing! I was a little let down on the camels, they seemed a bit aggressive I assumed because of the conditions they're kept in i.e chained mouths etc, that was the only let down I didn't enjoy the ride too much."
        }, 
        {
            "index": 362, 
            "rating": "4", 
            "review": "a must try. ask for a good driver if you are not an adrenalin junkie\nThe desert drive was worth the cost.\nFood offered is limiting"
        }, 
        {
            "index": 363, 
            "rating": "5", 
            "review": "What an adventure!. You have not been to Dubai if you haven't gone on the desert safari. The whole experience in the land cruisers was spectacular. The adrenaline rush in the dunes was my highlight. The sunset was wow! Another beautiful surprise awaited us - the dinner in the desert seating in a yoga position. Never been to a yoga class but I did it. Too bad it was prayer day I missed out on the belly dance. I must do a repeat."
        }, 
        {
            "index": 364, 
            "rating": "5", 
            "review": "Beautiful. Great place to get away from the city. It's wonderful to see the wildlife roaming the desert - they get very close too. It's a pretty special place to visit."
        }, 
        {
            "index": 365, 
            "rating": "5", 
            "review": "Gooo dunes gooo. All guides speak very clear English. they drive the sand dunes like they own them are always very clear as to what would be happening next. The food is average, henna tattoos are great (for her) and the entertainment is good. Can be your favorite activity in Dubai!"
        }, 
        {
            "index": 366, 
            "rating": "4", 
            "review": "amazing. For the best moments of excitement and adrenaline in combination with extra comfort in the desert camps"
        }, 
        {
            "index": 367, 
            "rating": "4", 
            "review": "Great Experience!. Overall it was an great experience. It was scary as there were many ups and downs and cars were sliding everywhere,"
        }, 
        {
            "index": 368, 
            "rating": "5", 
            "review": "One in a million experiance. This was the most amazing experiance ever. The car ride through the dunes was like nothing else. then the supper and live entertainment....wow!!"
        }, 
        {
            "index": 369, 
            "rating": "4", 
            "review": "Interesting eveninh in Desert. Enjoyed Dune Dashing and performances at Desert safari. Camel ride too short. Food needs to improve."
        }, 
        {
            "index": 370, 
            "rating": "5", 
            "review": "Beautiful area. What a beautiful area. The color of the sand, wide view, oryx. And we went true by fat bike!! It was not to warm so that was great."
        }, 
        {
            "index": 371, 
            "rating": "5", 
            "review": "Sand Dunes were thrilled. - Best for Adventurers and bachelors\n- Not suitable for kids and elders\n- Bit costly but worth try once in a life time"
        }, 
        {
            "index": 372, 
            "rating": "5", 
            "review": "This is one attraction which should not be missed.. The Car was suppose to pick us from our hotel. We were 7 and car was allotted to us. We requested the supplier Zafar to change the pick up from Hotel to Miracle Garden which he agreed upon. A Land Cruiser with driver name Prajeesh was provided to us. Driver took us to a resort near the desert and asked us to take a rest for an hour before he took us to main desert and camp area. There were desert scooter operating and people were taking a ride there. After that driver took us to camp area the route to the camp area is through dense desert. The ride took about 40 minutes out of which about 35 minutes were in desert with car providing a nice roller coaster ride on sand dunes. It is one experience which should never be missed. The kids and adults equally enjoyed the ride. We arrived at the camp area where free camel ride for photography was provided to guests. The food and soft drinks were included in desert safari price. The food though not great but was still ok types. There were variety of Salads on offer with Some rice and Dal and Curries. We did not had food there as kids did not liked the look of food. There was Arabic and Belly Dance as entertainment.The high point of the attraction is Car zipping on sand dunes. Once in a lifetime experience."
        }, 
        {
            "index": 373, 
            "rating": "3", 
            "review": "good experience. good experience, but i felt very sick off sand dunes, and they take you to a shop and try and force you to buy dubai outfits."
        }, 
        {
            "index": 374, 
            "rating": "5", 
            "review": "If you can only do one thing, do that. Some \"fun\" driving in the sand dunes, very exciting and certainly not good for people prone to motion sickness and then a nice relaxed dinner in a camp. Of course, all tourist attractions, such as belly dancing, camel riding etc. available. The food was not particularly edible for my taste, but overall it was a very relaxing experience walking barefoot on the cool sand at sunset all around the small impromptu shops in the camp, having henna tattooes and tasting pita bread just baked in front of you in the traditional oven."
        }, 
        {
            "index": 375, 
            "rating": "5", 
            "review": "sooo cool !!. Great journey, driver was so professional - realy very good, crazy adventure. Ask for Rifaqat Ali, he is great !!"
        }, 
        {
            "index": 376, 
            "rating": "3", 
            "review": "Not reliable. Our trip got cancelled on 26 Dec and we had to reschedule and look for a new available date. We emailed nd got no response so we phoned. This was the only way to confirm a new booking. Our driver collected us on time but we had lots of other guest to collect and missed the sunset. The drive was okay, the food fine and the show okay. Everything was included so no hidden cost."
        }, 
        {
            "index": 377, 
            "rating": "4", 
            "review": "Wonderful Experience. Must do in Dubai and an unique experience. Only be little bit careful if you have motion sickness . You may feel nausea while doing desert rides."
        }, 
        {
            "index": 378, 
            "rating": "5", 
            "review": "a good place to enjoy. hotel pickup. long drive ti desert. buffet was gud, dance was well... loved to b in the cold desert."
        }, 
        {
            "index": 379, 
            "rating": "5", 
            "review": "Amazing time - Desert Safari. The best part of Dubai trip for us was the desert safari. We left hotel at around 3 pm and reached desert at around 430 pm after picking up others from different locations.It was an excellent drive through the desert during the dune bashing time with going up and down the dunes giving a feel like a roller coaster ride. Our driver was very nice and he even raced other vehicles in the desert with comfort which gave us a more thrilling ride. We stopped at a place for sunset photography.Following our dune bashing, we went to a place for dinner in the middle of the desert. We had a small camel ride which was fun too. Buffet dinner was nice with barbeque and a variety of Indian dishes as well. We had a couple of shows (belly dance, etc.).It was a nice experience in the desert. Had a lot of fun. Highly recommend desert safari to anyone who visit Dubai."
        }, 
        {
            "index": 380, 
            "rating": "5", 
            "review": "Must Visit!. This is definitely one of the most important highlights of any Dubai trip. The Dubai desert safari is a must-do activity and noone should return from Dubai without experiencing the amazing off-roading, dune bashing activity by 4x4 off-roaders!"
        }, 
        {
            "index": 381, 
            "rating": "4", 
            "review": "desert safari by evening. the desert safari is a must if you visit Dubai region. The quad ride/sand boarding in monstrous SUV's are once in a lifetime experience. The other attractions of henna/shisha are for the women & men folk as optional. The dinner spread is sumptuous but not very tasty ( this is my 2nd experience)But to sit in the middle of nowhere in a desert & watch sunset & moon come up with some belly dancing is a different experience"
        }, 
        {
            "index": 382, 
            "rating": "4", 
            "review": "Desert Safari. It's another must if you are travelling to Dubai. They have Hummer, Prado and Merc 4x4 which gives you thrill like any roller coaster. Drivers love to hear the feedback and more you clap and scream, more dunes they chart in return and you can always see a smile on their faces. They drop you to your allocated camp where you can enjoy dances and performances which are fun to watch, unlimited food and sheesha are served to you. There are lot of other fun like camel riding, ATV driving and sand art which is there to keep you busy. Don't forget to take warm cloths if you are going in Dec/Jan as nights can be chilly."
        }, 
        {
            "index": 383, 
            "rating": "2", 
            "review": "Good tour, bad driver. Our driver was 30 minutes late. Ok, no biggy. Then he drops us in the middle of nowhere to watch the sunset, then disappears. Said he needed to help another driver. Then, at the end of dinner and a show was nowhere to be found. We were last to leave. No excuse or apology, just an insincere sorryWent through city discovery who just seems to collect the money. They outsourced to orient travelDunes were great. Dinner was pretty good for a buffet in the desert. Dancing was funThe experience was spoiled by the bad driver"
        }, 
        {
            "index": 384, 
            "rating": "4", 
            "review": "Desert Safari. You must try the desert safari at Dubai. The tour operator picks you up from your hotel about 3 pm and drop you back there about 9 pm. You are taken to a meeting point in the desert. The actual safari will take around 45 minutes, the experience is fun but not dangerous, we had a couple of pensioners in our jeep, they loved it.You are then driven to a desert entertainment area. The dance, drinks, food are all good, every one got up to dance together after the show."
        }, 
        {
            "index": 385, 
            "rating": "5", 
            "review": "Nice!. in that desert there are stunt jumps aka Dune Bashing organised and there are even camps for dinner and sheeshas and the food is healthy and even camel rides are organised there and oh i forgot there is the quad bike drive also.Nice Place..."
        }, 
        {
            "index": 386, 
            "rating": "5", 
            "review": "Arabian nights. we came here for Dune Bashing which was a lot of fun, however we had a woman in our car who kept complaining it was going to fast at 1 point she souted at the driver that she wants to get out and get a taxi???hmmmmm dont think you can get a taxi in the middle of the desert so she had to grin and bare it. this however did not put us off and we were screaming to go faster, loads of fun :). wew ere then taken to a spot in the desert where you can have camel rides and pose with the falcon's we were then served food (not arabic food which was disappointing more indian food onion bhaji, curry, there were some BBQ meats etc) it was then time for the show which was an eastern europen belly dancer (not very authentic) but the spinning man was amazing how hes costume just lit up very hypnotising and the fire man gave a brilliant show and actually saved the show. we were then driven back to our pick up locations. all in all a good time."
        }, 
        {
            "index": 387, 
            "rating": "5", 
            "review": "Once in a lifetime experience!. Experienced Dubai Desert Conservation Reserve during our recent visit to Dubai. It was an amazing experience and I highly recommend it."
        }, 
        {
            "index": 388, 
            "rating": "5", 
            "review": "What a fantastic adventure. We thoroughly enjoyed our trip to the desert, 4 wheel drive dune ride, which was so much fun and dinner and show in the Desert. It was great value and a lot of fun."
        }, 
        {
            "index": 389, 
            "rating": "4", 
            "review": "we were there for the desert safari. The ride was fun. Food ok normal only is buffet style. They have activities like camel riding, ATV and some others. Overall, great experience."
        }, 
        {
            "index": 390, 
            "rating": "4", 
            "review": "It was nice but not so breathtaking. I took this excurcion beacuse of the safari in the sands. But actually it wasn't so breathtaking as I wanted it to be. The sands are always awasome, it is definitely worth going there. The village after the safari was not big, specially created for tourists. I liked food, there was enough of evrything, the show was intereting and also there was a free shisha. Also you could take photos in traditional clothes and ride a camel for free. Riding on a hourse should be extra paid."
        }, 
        {
            "index": 391, 
            "rating": "4", 
            "review": "experience of a lifetime. its exciting and very nerve racking but very safe and i enjoy the thrill of it very much even the camel ride and my henna tatoo and the food"
        }, 
        {
            "index": 392, 
            "rating": "3", 
            "review": "A good experience. A good experience for people visiting Dubai for the first time. The jeep ride was amazing and a bit scary but well recommended for a first time visit. But the night entertainment at the camp was a bit disappointing."
        }, 
        {
            "index": 393, 
            "rating": "5", 
            "review": "Great expirience in Dubai desert. As first time in desert like this one. First it was strange to see sand all around. Local guide help us to be familiar with surroundings. Amazing was riding on camels, look at evening sun and local traditional dancers. Recommend!"
        }, 
        {
            "index": 394, 
            "rating": "5", 
            "review": "Peace and tranquility in Dubai. A truly hidden gem.. We've lived in Dubai for 5 years, and for the first 4 had never heard anything about the Dubai Desert Conservation Reserve. And that is part of the secret of the place, for the moment.A 45 minute drive from downtown, and a short drive out into the Reserve, and you could be a million miles from anywhere. Peaceful, unspoilt, seemingly endless rolling red sand and a healthy spattering of Arabian Orynx, Gazelle and birds.You can't just drive into the Reserve though, you need a valid reason to be there, like a day trip or overnight stay at the Al Maha Desert Resort, a stay with Platinum Heritage, a trip with Arabian Adventures, or a Falconry experience with Royal Shaheen. Before you ask, we're not employed by any of these - but we are extremely pleased to have this desert beauty on our doorstep."
        }, 
        {
            "index": 395, 
            "rating": "4", 
            "review": "A must visit place. As we all know that UAE is mostly a desert.and Dubai has lots of Desert adventures . This attraction is one of them. It is a wonderful and extraordinary experience that one must have."
        }, 
        {
            "index": 396, 
            "rating": "5", 
            "review": "Wonderful Experience. Took a Desert Safari at the Dubai Desert Conservation Reserve and it was a wonderful experience. The only thing is that the reserve closes early so we had to get out before they close."
        }, 
        {
            "index": 397, 
            "rating": "5", 
            "review": "Try it. Really new and perfect experience, very exciting safari experience, nice Arabian dancers and a good dinner and snacks, you will love it just try it."
        }, 
        {
            "index": 398, 
            "rating": "5", 
            "review": "Saw it from the Hot air Balloon. We were flying low in our Hot Air balloon and could see the Conservation reserve. Very neat, saw a lot of animals and dunes. Very clean too."
        }, 
        {
            "index": 399, 
            "rating": "4", 
            "review": "Amazing day at Safari. The best tourist attraction in Dubai.. we have an amazing experience. The Dune bashing was like riding in a roller coaster."
        }, 
        {
            "index": 400, 
            "rating": "5", 
            "review": "Fantastic. Awesome experince with cruiser ride & the club which is located in it overall experience i can't explain in the words...."
        }, 
        {
            "index": 401, 
            "rating": "4", 
            "review": "A must. Fun.. We took an organized tour with 25 cars which could have been a bit of a zoo, but it was well organized and our driver took good care of us. Dinner in the desert with the show part was fun."
        }, 
        {
            "index": 402, 
            "rating": "4", 
            "review": "Awesome Trip..... Went with relatives who were visting from INDIA. We were picked up & dropped at our home. Dune bashing was great. Then were driven for optional camel ride & dirt bike ride, for which we needs to pay seprately. After that they have taken us for belly & tunura dance show, both Veg & Non Veg food was avaliable. It was a memoriable experience for relatives coming to Dubai.."
        }, 
        {
            "index": 403, 
            "rating": "4", 
            "review": "Cool experience. Nice different environment. Cool breeze of evening desert. Must visit once and will be memorable event for entire family."
        }, 
        {
            "index": 404, 
            "rating": "5", 
            "review": "Nice Desert. People who comes to Dubai will enjoy the desert drive and enjoy this place Superb drive in the four wheeler drive."
        }, 
        {
            "index": 405, 
            "rating": "5", 
            "review": "Best part of the Trip. This is the best part of the Trip... I would suggest this to be done in the last... As there would be something which you will remember till last. Even ask for your safari driver for Quad bikes rides... They will take you... its fun... Food is highly ok... Please carry your personal food with you."
        }, 
        {
            "index": 406, 
            "rating": "4", 
            "review": "The ride through the desert was exhilarating!!. The thrill of riding in 4x4WD vehicles at high speed across the sand dunes is exhilarating. The driver must be used to hearing everyone screaming and nervously laughing away by now but no one in our car had to use the special bags intended for those feeling queezy after the ride. I did not enjoy seeing the 5 minute falcon show. The camp where dinner was served was very nicely decorated though as it was already dark by the time we got there, there was no point in going on a camel ride. The food was tasty and plentiful. The show was very good especially the incredibly tireless belly dancer."
        }, 
        {
            "index": 407, 
            "rating": "5", 
            "review": "Great Experience. this is a trip not to be missed out on as a first time trip to Dubai. We did the trip that drove through the nature reserve in the old fashioned jeep, it was fun, and I highly recommend the experience."
        }, 
        {
            "index": 408, 
            "rating": "5", 
            "review": "A must do in Dubai. Simply the best thing we did while in Dubai. November to February are the best times of the year to do the Safari. We were picked up at our hotel at 2:30PM and returned at 9:30 PM. Rode a camel, watched a falcon show in the desert, watched the sunset, saw an Arabian Antelope and Arabian Orxy in the reserve. After the sunset we head to the camp in the desert for our dinner under the desert sky and stars. Had my sandals off the whole time we were in the Desert Reserve. Temperatures were absolutely perfect. 85 degrees at 4PM and when we left the Desert Reserve it was 80 degrees. Shorts and a light t-shirt weather. Fantastic. A must do."
        }, 
        {
            "index": 409, 
            "rating": "4", 
            "review": "Fun Fun Fun!. What a thrill ride. We had an amazing time during the desert safari. The entertainment was great.. although the food provided by the tour company we booked through was okay... the safari itself made up for that. A must to do at sunset in Dubai."
        }, 
        {
            "index": 410, 
            "rating": "5", 
            "review": "beautiful. Wow....totally awesome sights and views...do NOT forget your camera! Loves the camels...they were trained to be so friendly!"
        }, 
        {
            "index": 411, 
            "rating": "4", 
            "review": "The desert safari was great. The desert safari was great and very unexpected. The jeeps were driving through the deserts going up and down the sand dunes with such speed and surprise. It felt like a long roller coaster. We were able to get out to the desert just in time for sun set. It was amazing."
        }, 
        {
            "index": 412, 
            "rating": "4", 
            "review": "nothing has changed. 2nd time doing this trip and it's the same as the first. Nothing new. For a first timer, simply expect to be driven up/down and around the desert, watch a lady tell you a brief story about the history of falconry, the show allows the Falcon to only make 2 flights that are super quick, have a buffet in the desert at night, camel ride, eat, watch a belly dancer. Free food and drinks once at the compound. Food/beer/wine is the same each time. Will not do this a 3rd time"
        }, 
        {
            "index": 413, 
            "rating": "4", 
            "review": "Great Desert Trip. Well worth the trip. The falcon display was informative, the dune bashing fun and the food at the stop was authentic and good."
        }, 
        {
            "index": 414, 
            "rating": "5", 
            "review": "Desert Sunset and camels too. The Dubai Desert Conservation Reserve was a relaxing get-away after spending several days in the city of skyscrapers, huge malls, and staggering amounts of sightseeing. The sand dunes are beautiful, especially as the sun was setting. We did see wildlife, both at the feeding station which allows for good close-up photos and just running amongst the desert foliage. The cultural dinner, entertainment and the camel ride (go around in a circle ) are fun and well done. If I were to do it again, I'd opt for the camel ride outside the reserve fence for a different experience."
        }, 
        {
            "index": 415, 
            "rating": "5", 
            "review": "Nice Joy Ride!. I enjoyed the fun desert car drive gosh it's like you are in an action movie! can't believe I survive the thrill ride hehehe"
        }, 
        {
            "index": 416, 
            "rating": "5", 
            "review": "Desert delight.... The desert is quiet, locals cool, camels lazy as expected and fun to ride, though short but yeah what the heck"
        }, 
        {
            "index": 417, 
            "rating": "5", 
            "review": "Super Experience. The desert conservation reserve has a boundaty of approximately 93 square kms and the sand is just pure brown and parts of it is a beautiful red. In winters there is desert sand boarding an quad biking but all the year through there are several desert rides, sundownder and overnight stay by arabian adventures, secrets of the desert which covers dune riding, sliding, lots of opportunities to take pictures and see some arabian Oryx and Gazzelles up close. The view is breath taking and there is just acres of sand dunes approximately 225 square kilometers."
        }, 
        {
            "index": 418, 
            "rating": "1", 
            "review": "Terrible. Not nice, camel ride was literally two steps forward and back again.. Waste of time and sand dunes the size of average uk house and the 4x4 went up and down then for 30 min to get to camp so very travel sick"
        }, 
        {
            "index": 419, 
            "rating": "5", 
            "review": "Something differant but great! buy through dubizzle for cheap deals. The desert safaris are something totally different to the hustle and bustle of dubai and well worth doing. You get an awesome sunset along with different activities, shows and food included. Make sure you check on dubizzle first for a cheaper rate 60-100 AED"
        }, 
        {
            "index": 420, 
            "rating": "5", 
            "review": "Breathtaking.. The beauty of this reserve is overwhelming. The dunes are a kaleidoscope of color and texture, the animal life is breathtaking and the experience is one you won't soon forget."
        }, 
        {
            "index": 421, 
            "rating": "5", 
            "review": "Amazing. Dubai desert is one of my fav activities there. The peacefulness of the desert, the colors of the sand , the dunes , it is truly a magical mystical place"
        }, 
        {
            "index": 422, 
            "rating": "5", 
            "review": "SURFING THE DESERT. An unforgetable experience surfing the desert in a 4WD.A feel of how the Badwin used to live in the yester years.A wonderful dinner and local show in a tent like environment to experience their life style.Free flow of drinks,henna drawing , delicacies and camel ride for the brave heart. An experience not to be miss!"
        }, 
        {
            "index": 423, 
            "rating": "5", 
            "review": "Remarkable entertain in desert. Unforgotable memories, heaven in desert ride in car jeep in desert, excited riding. Best food, drinks, dance"
        }, 
        {
            "index": 424, 
            "rating": "5", 
            "review": "Drive through the Desert. Driver over the sand dunes was thrilling and at times heart pounding. It was the most superbly organised drive."
        }, 
        {
            "index": 425, 
            "rating": "5", 
            "review": "Al Jalal Village was great. We did out tour through Viator. We had a hotel pick-up and drop-off, camel ride, ATV, dune bashing, henna and dinner with belly-dancing. Well worth it. At first, our guide made a quick stop for some pics and we thought that was the extent of it. It wasn't. Stay patient. There's so much more."
        }, 
        {
            "index": 426, 
            "rating": "5", 
            "review": "Dubai Desert. What a wild ride! Not all companies that do this drive are as wild or drive crazy. The level of driving is determined by the people in each ride or maybe by each company driver? The ride also has a cookout later with much entertainment of traditional foods and dances with camels to ride. A great family ride for the afternoon and evening. Do go when its cooler."
        }, 
        {
            "index": 427, 
            "rating": "5", 
            "review": "A must do!. One of the best evenings spent in dubai! We booked one of the tours and we went to this reserve. We saw a falcon show.. Got to see gazelles up close.. 4x4 drive in the desert.. Watched the sunset.. Camel riding.. Got Hennas.. Had a traditional arabic dinner with arabic music and an oriental dancer.. And we also had some time left for some star gazing.. All the activities needed to give you the right taste of the arabic culture. I would do it again anytime. Well worth the money."
        }, 
        {
            "index": 428, 
            "rating": "5", 
            "review": "Sundowner. Well worth the money and taking the time to do this. The driver of our car was well experienced and took care ensuring everyone was okay due to the steep sand dounes. Sick bags were available if required as well as water and any questions answered with full explanation. The food at the reserve was amazing and so well organised with lots of other things available, camel riding, henna tattoos shisha and a bell dancer all included in the price. A must do!"
        }, 
        {
            "index": 429, 
            "rating": "4", 
            "review": "Must try. It's nice to go safari in Dubai Desert, enjoy the camel ride, and the dinner with entertainment, also the tattoo henna for girls"
        }, 
        {
            "index": 430, 
            "rating": "5", 
            "review": "Experience not to be missed. This is a must do when visiting Dubai, the sand dunes 4 wheel drive experience,camel ride,and the amazing mealplus belly dancing creating wonderful memories"
        }, 
        {
            "index": 431, 
            "rating": "5", 
            "review": "AMAZING EXPERIENCE. you must do it. It is perfect. jeep are going too fast in the desert and it is an amazing experience. except that you can have an idea of the desert (a few kilometers away from the city) of how people live in the desert and understand their culture. if you can stay the night it will be great. i would defenetely would do it again."
        }, 
        {
            "index": 432, 
            "rating": "5", 
            "review": "I can't describe it with words. This thrilling and breathtaking experience is a must. The drivers are polite, the surroundings are amazing, an experience of a lifetime! You can snap awesome images and you can ride a camel, get a henna tattoo or hold a falcon. Don't hesitate and book!"
        }, 
        {
            "index": 433, 
            "rating": "5", 
            "review": "Excellent. It was an experience of a life time, from the sand dunes ride, camel ride, diner, tattooing, belly dancing and to top it all the Arabian night... it was spectacular. The sunset was a big plus."
        }, 
        {
            "index": 434, 
            "rating": "4", 
            "review": "Surprising sight of wildlife. Great to see the animals in what I imagined was an empty desert. Worth taking a good camera to capture the variety of wildlife."
        }, 
        {
            "index": 435, 
            "rating": "5", 
            "review": "amarzing. Held one of my wishes ( Safari dubai )It all starts aboard jeeps 4 × 4c om air conditioning, into the wilderness making the pick up tourist hotels. Make a small camel ride. Make your engine growl and roar on the sand in an area of dunes free tracks. Enjoy a typical buffet dinner (barbecue Arabic, dates & coffee) served in the open among the tents. Presentation of various art shows with music including Arabic belly dancing and other dances. Try henna tattoo (option for women !!!) lol"
        }, 
        {
            "index": 436, 
            "rating": "5", 
            "review": "A must do experience Desert Safari in Land cruiser car.. Desert Safari is the most important activity in Dubai .It is a must do experience. The Land cruiser car take you in the desert climbing sand dunes with ease . Its a thing to experience . We were shouting all the time when the car was coming down the dunes. Then the camp where dinner is served and the filk dances performed for 2 hours .You can also do camel ride here."
        }, 
        {
            "index": 437, 
            "rating": "5", 
            "review": "New Exposure and Heritage for all to enjoy .. That was a lot of fun we took the crazy Toyota ride in that desert fast and furious but nice culture and history of the tribes .Night activities are fantastic ,food is fabulous ."
        }, 
        {
            "index": 438, 
            "rating": "4", 
            "review": "Sandy. You'll see plenty of gazelle, a falcon show, ride a camel, and have a day in the desert. Feel like T.E. Lawrence for the day out in the eerily quiet dunes and ever-shifting sands."
        }, 
        {
            "index": 439, 
            "rating": "5", 
            "review": "Adventurus. Its very Adventurous place to ride in Land criuser in the desert very excited and enjoyed lot thare, With belly dancing and dinner provided by them after that really good."
        }, 
        {
            "index": 440, 
            "rating": "5", 
            "review": "Adventurous experience !. Great experience, BUT, don't even think about it if you have problems with your back or motion sickness - the only way of getting to the desert is safari drive, we have seen lots of motion sick people))) If you pay a bit more for your trip, it means you going to a better camp with better seats, better dance programme and better dinner."
        }, 
        {
            "index": 441, 
            "rating": "5", 
            "review": "DESERT. You can say that you have been to Dubai only after you go and see the desert and enjoy some camel rides and belly dancing..."
        }, 
        {
            "index": 442, 
            "rating": "5", 
            "review": "A Grand Night Out. In the late Aftenoon, we went driving through the red sands of the conservation area, and then had a lovely dinner, it was a beautiful tour."
        }, 
        {
            "index": 443, 
            "rating": "5", 
            "review": "I never tire of looking at the desert and seeing the wild animals. A wonderful resort with a plethora of wild animals and plant life. Activities within the conservation reserve are strictly controlled to enable regeneration of the ecosystem. In the winter months, the views of the Hajar mountains behind the vast expanse of sand is so beautiful."
        }, 
        {
            "index": 444, 
            "rating": "5", 
            "review": "A taste of life as bedouin. We went on a sand dune 4x4 drive which was exile rating and at times for some scary, but we were always in safe hands. At the end of the drive we went sand boarding which was also great fun as well as a short camel ride. It was all very well organised at a purpose made camp set in the desert surrounded by sand dunes. There was then a dancing show, henna tattoos on offer and a very tasty BBQ dinner. For some adults a shushes were also on offer. All in all a great cultural experience to give a flavour of life in the Middle East. Great value for money!"
        }, 
        {
            "index": 445, 
            "rating": "5", 
            "review": "Must visit. One of the interesting place must visit in Dubai. You can drive a dessert motor bike and try to ride camel."
        }, 
        {
            "index": 446, 
            "rating": "5", 
            "review": "Nice. Well if you go to the desert you have to ride a camel,, What agreat fun trip you will enjoy the Desert Sunset is beautiful ...."
        }, 
        {
            "index": 447, 
            "rating": "5", 
            "review": "Must Do!. Best experience in Dubai, must do! My family and I got to really live what the culture of the Dubai and the Emirates is really like. Surprisingly the desert is not as hot as the city so we all had an even better time!"
        }, 
        {
            "index": 448, 
            "rating": "3", 
            "review": "Everyone does it so you better not miss it!. The desert safari is good. But I liked the evening program more. Even though it seems a bit touristy, the touch of sand and night air reminds one of the life the desert folks led a century back."
        }, 
        {
            "index": 449, 
            "rating": "3", 
            "review": "If you've never been on something similar then you'll probably enjoy this.. Trouble with doing a lot of journeying and travelling is that the tourist trips become somewhat similar and after 43 countries there is much less need to go out on such escapades. The journey is bumpy so be careful with your backs. It was still nice to sit out and eat but its all a bit of a gimmick with belly dancing etc. Still the group we were in wrre fun"
        }, 
        {
            "index": 450, 
            "rating": "4", 
            "review": "Just a desert. If you love animals and have never seen the sand dunes this might be worth the trip. Wouldn't bother going on an extended trip out there however. Watch out for car sickness on the dunes if you suffer from it."
        }, 
        {
            "index": 451, 
            "rating": "5", 
            "review": "A great experience.. great experience staff were great. Food and drink was laid on and a fantastic night well worth the money."
        }, 
        {
            "index": 452, 
            "rating": "5", 
            "review": "Big fun! Camels and Henna!. Big fun! Camels! Henna! Hookah and darn good food. One of these best adventures. We danced by the fire light and had a great show."
        }, 
        {
            "index": 453, 
            "rating": "5", 
            "review": "Well worth it. Such an amazing experience, from pick up at our hotel until drop off, you are well taken care of. Definitely worth the money. It involves falcon display, sunset watch, camel riding, henna tattoos, shish, bbq and belly dance display."
        }, 
        {
            "index": 454, 
            "rating": "5", 
            "review": "Arabian Day to Night. Whatever you do if you come to Dubai don't miss out on the desert safari. Excellent hosts, knowledgeable, skilful all rolled into one evening. The food was good the entertainment great with the belly dancer taking centre stage. Well worth the excursion time. don't forget each picture taken by one of the team adds up at the end of the night you will have difficulty choosing!"
        }, 
        {
            "index": 455, 
            "rating": "5", 
            "review": "Desert of Gulf. After Dune bashing we dropped at for Dinner camp and what a entertainment. Excellent way it is. Only the thing is that it need to be properly managed and cleanliness has to be increased"
        }, 
        {
            "index": 456, 
            "rating": "5", 
            "review": "Desert was delightful. Had a great time in the desert while in Dubai. The driver picked us up from our hotel and then we drove over the other desers where he did some dune bashing. After that, we took photos of the sunset. After we were done taking photos, we rode camels and drove on quad bikes until it was time for dinner. The dinner was huge BBQ with performers, hookah and henna artists. Overall Wonderful! Book with a tour company!"
        }, 
        {
            "index": 457, 
            "rating": "5", 
            "review": "Brilliant day out.. such a brilliant day out here.we went in a jeep crashing over the sand dunes, got henna tattoos, went on camels, ate beautiful food, saw belly dancers.Fantastic day out.well worth every penny."
        }, 
        {
            "index": 458, 
            "rating": "4", 
            "review": "Lovely experience . Something great to experience when visiting Dubai. The desert is beautiful. The cars itself is a thrilling experience, however our driver was not so pleasant. The belly dancing and food in the middle of the desert made our trip, very authentic and tasty food, great chilling atmosphere"
        }, 
        {
            "index": 459, 
            "rating": "5", 
            "review": "Fun fun fun. Dessert safari was one of the unforgettable adventure i had. The Sand dune make you feel like in a roller coaster but in a air conditioned 4x4 ( crazy fun experience) . The sand ski was cool too. All the traditional arabic food was on the buffet while the magician and belly dancer was performing. The camel ride was awesome! You can try the sisha ( hubbly bubbly) and have a henna tattoo. Its a must when you visit dubai!"
        }, 
        {
            "index": 460, 
            "rating": "4", 
            "review": "Sand everywhere!!!. We were here during the Ramadan, so it was an honour to break the fast with our guides. The place to huge, I would get lost. Was great to see the different animals that had made this their home. Was great to see the Bedouin camp and have and amazing meal."
        }, 
        {
            "index": 461, 
            "rating": "5", 
            "review": "Place to go in Dubai Desert. We stayed there a couple of times: the organisation and the planification were amazing. Everything was well organized and there was water everywhere and a lot of food. nice pleasure"
        }, 
        {
            "index": 462, 
            "rating": "3", 
            "review": "the four wheel drive dune safari. I did the alf day tour to the desert and find myself in a traffic jam all SVU's driving all together from all the different travel agencies to the same direction until you are switching to a four wheel drive up to eight pasengers, and yes you do get to drive in convoy of up to ten cars over and over up and down the dunes,all the groups do split into their designated areaand once the fun is over you end up into a camp belonging to you specific travel agent,you are alive to beatdown on the ground to watch a fast presented show while you eat your diner once over you are encouraged to purchase goods and then to svu come to take you back to your hotels..did it but would go back againmost operators are indian and not very friendly. "
        }, 
        {
            "index": 463, 
            "rating": "5", 
            "review": "Awesome experience!. This was a highlight of my visit to Dubai. You start by being driven into the desert in an SUV - called dune bashing (beware if you get motion sickness! It's fast and bumpy! But loads of fun!). Then you are taken to the \"camp\" area where you can do a short camel ride. After that you can go into the campsite where you can browse and/or purchase some stuff - sand art, rugs and clothing, various little souvenirs. There is henna artist and a belly dancer, but for me the most fascinating was the \"skirt dance\". The buffet meal was pretty decent. Overall a unique and fun experience."
        }, 
        {
            "index": 464, 
            "rating": "5", 
            "review": "Nature. Visit Dubai and take a trip to the desert safari in order to appreciate nature, hot in the day and warm in the evening. Good meal, Shisha, camel ride and the most fun part of it all is the desert cruise. Lovely experience..."
        }, 
        {
            "index": 465, 
            "rating": "4", 
            "review": "Exhilarating Drive in a desert. Its around 1-1:30 hr travel from the Dubai city. The drive in the desert is very thrilling beware to wear your seat belts. The whole setup where the actual assembly place for all tourist is in the middle of desert. So the evening sunset with gaze of sand winds is something you should experience. The Belly Dance and Kebabs are unique."
        }, 
        {
            "index": 466, 
            "rating": "5", 
            "review": "A must for dubai. This is a true experience of rustic dubai. The up down jeep drive is entralling. But, for older people and children, it was advised they gently directly hit the camp. At the camp, yo can get a hands on of local souveniers, mehndi - henna art. Watch Belly dancer which is most authentic and tanoura dancer which can be a great surprise. The food and drinks are also good. In thenight, you can watch pure sky with the stars and love gazing !!"
        }, 
        {
            "index": 467, 
            "rating": "3", 
            "review": "Just an average experience. Not far from Dubai centre, but hardly worth it. You see lots of sand dunes, but not wow. Four wheel drive over the dunes is good for first 5 minutes. You see some antelopes, but not much else. The best part of the trip was the small camel farm just outside the centre. Overall we thought the morning was bad value, and we should have gone shopping or stayed around the pool."
        }, 
        {
            "index": 468, 
            "rating": "5", 
            "review": "Adventure. Spectacular and beautiful is the landscape with camel rides and sand duning which is not for the faint hearted."
        }, 
        {
            "index": 469, 
            "rating": "5", 
            "review": "Desert Thrills. This was an amazing experience, being driven through the desert in a jeep! I rode a camel for the first time! Best experience and simply a \"must-do!\""
        }, 
        {
            "index": 470, 
            "rating": "5", 
            "review": "The best attraction of Dubai. I did an excursion Safari to the desert on a 4 x4 pickup. The dunes are amazing! You see nothing but sand around, just it is supposed to be. The sundowner is really beautiful and special. The Safari included a falcon presentation and a dinner with typical food and a dance show in a camp base. It's a very interesting experience. The best of Dubai in my opinion."
        }, 
        {
            "index": 471, 
            "rating": "4", 
            "review": "Experience. It was great experience. Reasonable price, food was great and heat was just not tolarable during teh summer, but during November to March it is best. Enjoyed everytime i went and lat one was the 21st time i visited Dubai so you guessed it right :-)"
        }, 
        {
            "index": 472, 
            "rating": "4", 
            "review": "Great Desert Experience. We first had a welcome coffee at the entrance and afterwards had a beautiful sunset, rode camels, held falcons, enjoyed some drinks at their bars and at the end had an excellent buffet dinner and fantastic shows. All in all an experience you will never forget."
        }, 
        {
            "index": 473, 
            "rating": "5", 
            "review": "Best experience in Dubai. Loved the 4x4 riding in the dunes, great pictures, living in the desert. Made it to the camp, did some off road ATV, camel riding. Saw a great spectacle. Food was ok but who is complaining."
        }, 
        {
            "index": 474, 
            "rating": "5", 
            "review": "Adventure. Really nice \"Desert experience\"!! We saw different species and the sunset is amazing!\nThe reserve is definitely worth seeing!"
        }, 
        {
            "index": 475, 
            "rating": "5", 
            "review": "The one thing you must do!. We travelled out to the conservation park and onto a night desert safari and it was one of the most unique experiences I've had in over 14 countries. My adult and teenage children also really enjoyed it. Pay for a reputable tour company, you get what you pay for in this experience. We watched falcon flying, went 4x4 driving (we are Aussies who own 4x4's back home and go constantly 4x4 driving and still enjoyed this experience), watched the sunset, rode camels and spent time in a absolutely wonderful desert camp. They turned the lights off in camp to see the sky, and coming from Australia we are used to beautiful nighttime star gazing and this was easily equal to that. Loved everything....."
        }, 
        {
            "index": 476, 
            "rating": "5", 
            "review": "So excited!. It's so excited experience for me . Driving at desert was almost like roller coaster! My mother was not good at such kind of activity though, she also enjoyed . I still remember sun set i saw standing smooth sands. Which was i've never felt living in japan. I also tried henna art while staying at that place , I think it will be popular among girls because of its beautification.I wanna visit there again. "
        }, 
        {
            "index": 477, 
            "rating": "4", 
            "review": "Desert trip. Very fun and interesting to make a trip out. Choose one that is not too costly and of course not expect too much for the food. But the sand dune ride was fun, not to be missed, quite a pleasurable experience, must bring along sun glasses else your pictures will not turn out nice"
        }, 
        {
            "index": 478, 
            "rating": "4", 
            "review": "Desert, may spot some wildlife. I enjoyed our visit, we saw some deer which was great. Driving over the sand hills was exciting! I would recommend a visit."
        }, 
        {
            "index": 479, 
            "rating": "5", 
            "review": "A day/night to remember. under the arabian sky with food and wine flowing. Dancer to entertain and the BBQ was amazing. Take a 20 meters walk to the dunes to watch the sunset. no words to describe how majestic it is. Very much a good day out and something to rememeber"
        }, 
        {
            "index": 480, 
            "rating": "4", 
            "review": "Definite Go To Place. Amazing experience. Must try activity in Dubai. Avoid Friday's as you would miss \"Belly Dance\" show. Being a veggie, I loved the dinner which was served at night."
        }, 
        {
            "index": 481, 
            "rating": "5", 
            "review": "wow. i love everything about the Desert Safari, the jeep ride , the dancers, the camel ride was wow. Can't wait till i come dubai and go for safari again."
        }, 
        {
            "index": 482, 
            "rating": "4", 
            "review": "Great place to visit, book with reputable tour operator. Visited the desert conservation, great experience, beautiful pictures and great time!!!!\nWould highly recommend booking with reputable tour operator, used Platinum Heritage, it was incredible.\nGreat time, highly recommend for ALL AGES."
        }, 
        {
            "index": 483, 
            "rating": "4", 
            "review": "Worth seeing. It was a fun night being picked up at hotel and taken to a central point where we were put in jeeps for the desert trip. Dinner in a tent with entertainment was fun. We did not eat the grilled camel but enjoyed riding one! If you go, don't forget to look up at the stars!"
        }, 
        {
            "index": 484, 
            "rating": "5", 
            "review": "Desert Overnight stay. They were very professional and were willing to cater to our needs at short notice. They were excellent with our children (6, 9 & 11) and we felt comfortable at all times. Well worth paying the extra. An experience not to be missed."
        }, 
        {
            "index": 485, 
            "rating": "5", 
            "review": "Amazing. What a truly beautiful place! The dunes were very gently rolling and the whole atmosphere was one of pure serenity."
        }, 
        {
            "index": 486, 
            "rating": "5", 
            "review": "My favorite part of Dubai. We saw the reserve by staying at Al Maha, but you can arrange for tours. The wildlife is very interesting, the birds songs are intoxicating, and the desert landscape is still and beautiful. There are trees that grow slowly and are around 400 years old, with deep root systems. And, if you have time, you can ride a camel or go dune bashing just outside of the reserve. If I could only see one place again in Dubai, it would be the desert. Lovely."
        }, 
        {
            "index": 487, 
            "rating": "5", 
            "review": "Unforgetable experience!!. We had unbelievable, extreme safari with jeep through the desert (Thank you driver)， camel riding, sandboarding, falconry display, banquet, dinner-show involvement and a henna tattoo on my arm. It was worth it."
        }, 
        {
            "index": 488, 
            "rating": "5", 
            "review": "Desert Dune Ride. The desert is incredibly beautiful, and the ride through the dunes was exciting. We saw oryx (one of 4 antelope species native to the Arabian Peninsula) camels, a falconry demonstration and ate dinner under the stars in a Bedouin tent."
        }, 
        {
            "index": 489, 
            "rating": "5", 
            "review": "So awesome to see!. This was my first time in an actual desert and it was beautiful, and so vast!Loved seeing the wild gazelles and oryx, and learning more about how people used to live in the desert. Such an awesome landscape. And the reserve is great because it offers protection to all the wildlife.Definitely something to see when in the area!"
        }, 
        {
            "index": 490, 
            "rating": "5", 
            "review": "Can~t go to Dubai without visiting the desert. The Desert Safari tour is mandatory during your stay in Dubai. It is very well organized and provides beautiful and different scenery. The 4x4 dunes experience is good, as well as the camel riding and dinner at a camp make this tour a very unique and unforgettable experience."
        }, 
        {
            "index": 491, 
            "rating": "5", 
            "review": "Reclamation for consolidation. Engineering application, environmental package and good housekeeping culture. To ensure protection and prevention of desert adversity to human existence. To turn it a world attraction."
        }, 
        {
            "index": 492, 
            "rating": "5", 
            "review": "Funny experience. It was a funny experience riding camels, if you forget the smell of them. But the most breathtaking experience was 4x4 safari with jeep. Dont miss it . The landscape has the color of light orange all around you as far as you can see. Late in the afternoon the tepmerature was low ( during day was 45 and in the desert at night was 20 C) Also included the barbeque by night the food was quite spice , there were dancers in the center of the village."
        }, 
        {
            "index": 493, 
            "rating": "5", 
            "review": "Must see landscape. Go in the morning and enjoy the vast desert, the quiet and the animals. The oryx - white antilopes with parallel long black horns - look amazing. Great photo opportunities."
        }, 
        {
            "index": 494, 
            "rating": "5", 
            "review": "Great fun. Have roller coaster ride on sand dunes. Amazing experience of sunset in desert, riding on sand dunes, night camp, camel ride etc etc"
        }, 
        {
            "index": 495, 
            "rating": "4", 
            "review": "The Ultimate Desert Experience. This was a highlight for me. I loved riding the dunes with a driver who knew exactly how to manoeuvre his vehicle in the desert condition. I can't wait to go again. The meal was good and entertainment at the Oasis was of top qualityA very sad sight was the litter(and a lot of it, widely spread) we found at one of our stops. The thought that the litter problem could grow is a BIG worry for me. No traveller wants to see litter to that extent and especially in such a beautiful spot"
        }, 
        {
            "index": 496, 
            "rating": "5", 
            "review": "Serenity. Our small tour of 6 took us to the Arabian Desert inside Dubai. The beauty of this unique desert and it's natural habitat made for a relaxed and serene retreat from the city. What struck me most was the quiet. Absolutely still. There was desert wild life everywhere, but quickly scattered away when humans approach. We enjoyed a boxed lunch sitting on a Persian rug while our guide explained the desert and culture of it's people. A wonderful experience. Oh yes. There are camels."
        }, 
        {
            "index": 497, 
            "rating": "5", 
            "review": "Unusual rides. This was the experience I wanted when I came to Dubai. The dunes ride was exciting; up and down, dune after dune in a four-by-four, thinking the vehicle would turn over, but the driver was very skilled at this. The highlight was the opportunity to ride a camel. I've never experienced anything like this before, but it was the ride of a lifetime. I REALLY enjoyed this attraction. Having dinner in the desert, watching the whirling dervish, the belly dancer -- it was Fantastic!!!"
        }, 
        {
            "index": 498, 
            "rating": "3", 
            "review": "time pass. though i had heard a lot about the desert safari.. All my hopes were crashed.. the cruiser experience in the desert was just average. The food, the programs, were all just an average performance."
        }, 
        {
            "index": 499, 
            "rating": "5", 
            "review": "Must. Land curiser with desert ride is worth, try buggy ride only if you can spend nothing great, the food at the mid desert gathering is too bad shows are a good try the free hookah around the cornor"
        }, 
        {
            "index": 500, 
            "rating": "3", 
            "review": "Great ride on the dunes.. but bad food!. My husband and I went for the desert safari tour in March - a good month to be in Dubai after all in terma of weather! The ride on the dunes was perhaps the best part of the tour. But be careful do not each much just before heading for the bumpy ride, you could end up in nausea and vomiting (like the other couple who we shared the car with). You can click some amazing photos and enjoy a good evening the arabic style with some awesome dance performances. I give thid tour a 3 rating because : 1. Though its called the desert conservation park, you can see litter around! 2. the food at the camp was horrible with limited veg options 3. Its quite commercialized and touristy place, so if you are looking for a natural experience of the desert or some off-beat things to do in Dubai, you should strike this off."
        }, 
        {
            "index": 501, 
            "rating": "5", 
            "review": "Its a Most!. Great tour, beautiful landscapes, sunset at the desert! Lots of oportunities for great pictures, camel rides and dinner at the dunnes!"
        }, 
        {
            "index": 502, 
            "rating": "5", 
            "review": "Desert Rose. Reminded me so much of Sting's song \"Desert Rose\". Amazing views and Amazing Serenity. You just have to sit back and see the endless sands and dunes!!! Admiration guaranteed"
        }, 
        {
            "index": 503, 
            "rating": "5", 
            "review": "Such a great place!. Highly highly recommend going here. It was so fun and interesting! Get to see wild animals - I got to see a wild owl! I've never seen that before, let alone in the desert."
        }, 
        {
            "index": 504, 
            "rating": "5", 
            "review": "A Tranquil Place in the Desert. A great conservation area. Bird life at all the ponds and a small lake.\nYou can enjoy the site on a bicycle during cool weather from late September till early April. The track runs along the reserve."
        }, 
        {
            "index": 505, 
            "rating": "5", 
            "review": "Wonderful. Well worth the drive. A great conservation area. Bird life at all the ponds and small lake. Stay on the correct roads or I imagine you could get stuck in the sand. We were told you can also camp overnight. Abundant animal tracks leading to and from the watering holes."
        }, 
        {
            "index": 506, 
            "rating": "5", 
            "review": "Dubai Desert Conservation Reserve. We went only for the sunset and was well organized. The dinner was a bit expensive, but worth every money spent.\nIf you there, do not miss this out."
        }, 
        {
            "index": 507, 
            "rating": "5", 
            "review": "Early morning Wildlife Safari and Bedouin Breakfast. Very professional. Collected us on time. Guide had a wealth of knowledge. Very relaxed fun filled morning. Highly recommend it."
        }, 
        {
            "index": 508, 
            "rating": "5", 
            "review": "Nice experience. An experience to drive through the desert by four-wheel drive. Some animals in the area with a photo opportunity - nice."
        }, 
        {
            "index": 509, 
            "rating": "5", 
            "review": "When in Dubai... You have to experience the desert and what better way than a few hours of dune bashing, sandboarding and camel riding! The dune bashing was a thrilling experience, one I have never had the opportunity to do before, the drivers of the land cruisers are super skilled, whizzing their vehicles through the dunes. The camel riding was so much fun, albeit short."
        }, 
        {
            "index": 510, 
            "rating": "3", 
            "review": "Beautiful untouched sands of the dessert. Just the beautiful, visibly untouched rolling sandy dunes of this dessert are worth the visit. The rest is a bit artificial, the onplanted animals for instance. However. This is still one of the most genuin \"attractions\" of Dubai today."
        }, 
        {
            "index": 511, 
            "rating": "5", 
            "review": "Awesome experience in the Dubai desert. We went for 'dune bashing' in 4x4 vehicles which was great and hair raising followed by sand boarding before watching spectacular sunset over the dunes. Ended off with a traditional dinner in the desert with local cuisine and dancing. Great experience which I can highly recommend. Many companies does same sort of excursions."
        }, 
        {
            "index": 512, 
            "rating": "5", 
            "review": "A great place. The place is great, the safari experience is also a very nice experience and one must attempt, not for the faint hearts, but the other motor sports around are equally fascinating."
        }, 
        {
            "index": 513, 
            "rating": "4", 
            "review": "an animal experience. I wanted to see Arabian Oryx and Arabian gazelle which I saw and enjoyed searching over the red sand dunes for them"
        }, 
        {
            "index": 514, 
            "rating": "5", 
            "review": "Loved it!. Once you are in Dubai - Desert Safari is a must experience! Book a car, take ur friends and let them take u for a ride! It's 100% a lovely adventure."
        }, 
        {
            "index": 515, 
            "rating": "5", 
            "review": "Wellkept. I was lucky to get an access here and saw orix and also experiences the sunset.its just great to be there."
        }, 
        {
            "index": 516, 
            "rating": "3", 
            "review": "OK. An ok visit not what we expected a few plants but they would not be there naturally the miles of hoses watering them gives that away interesting but not that interesting"
        }, 
        {
            "index": 517, 
            "rating": "4", 
            "review": "Very cool. You wouldn't expect the desert to be quite so interesting, but there's quite a bit going on out there. And some time away from the malls and city was well worth it."
        }, 
        {
            "index": 518, 
            "rating": "4", 
            "review": "EXCITING PLACE TO VISIT. It is where the 4WD adventures takes place, but the company provides food for the desert dwelling animals (gazelles, birds)\nIt is a peaceful and natural place both for humans and wildlife"
        }, 
        {
            "index": 519, 
            "rating": "5", 
            "review": "Hot and beautiful. Did you know that planting trees in the desert can change the climate and produce some rain? Well, the Dubai desert reserve is just doing that, apart from looking after fauna and flora you wouldn't want to miss out on as a traveller. Treat yourself or your partner/family to something special by staying at the Al Maha resort. We just loved it there."
        }, 
        {
            "index": 520, 
            "rating": "5", 
            "review": "Where life, live is. The reserve is a beauty, a wonderfull experience. Becoming one with nature, sitting down a let the nature taking over."
        }, 
        {
            "index": 521, 
            "rating": "5", 
            "review": "A real Arabian Night Adventure. is a child in all of us that is always in pursuit of an adventure. Somewhere exciting to go and experience something new and fun. Sinbad, Ali Baba and the 40 Thieves, 1001 Arabian Nights are all tales made us dream of our own Arabian Nights adventure. The adventure that most may think of when coming to Arabia is to live like the Bedouins; in the desert and a tent, living with camels, and nights around the campfire telling stories and enriching ourselves with the culture of the people.  When coming to the UAE, there is a chance to live this adventure at the Bassata Desert Village in the vast and pristine desert of Ras al Khaimah. This is a modern luxurious version of the adventure so you’ll be pampered while experiencing the Bedouin lifestyle for the evening.   The experience begins with welcome of snacks and tea and then you are escorted to your tent. You’ll be there with other adventurers and you’ll sit on the floor on pillows and carpets. The tents are made from camel hair and are the same tents used by the Bedouin people for thousands of years. But this facility is not the form or fashion from those years gone by. It is new and modern and a project supported by the Ras Al Khaimah government. The bathrooms and common areas are what you would find in a luxury resort. Around the sides there are various vendors selling crafts, souvenirs, and local items. There is a central facilities area with a fully stocked bar and a serving area for the feast, suitable for a Sultan, that you are about to experience.   In the center of the vast open space is a floor with pillows and table where some of the guest choose to sit. Other’s retreat to the tents on the knoll where there is an unobstructed view of the floor below.   As we settle in, our host checks in on us to see how we are doing and to tell us a bit more about the experience. All the staff are dressed in Bedouin attire and with a friendly smile he bid us marhaba or welcome and asked us where we were from. Most of the staff here are from the Middle East or Northern Africa and such places as Morocco and Egypt.   It is February when we are here and in the desert at night is chilly. Our Bedouin host ask if we have everything we need. He brings a blanket for us that adds a little romance to the evening as we sip wine and cuddle under the covers as the candles flicker on the tables around the tent.   The night we arrived there were families, couples and small groups in attendance. I hear German, Dutch, Russian, Hindu, and Arabic spoken. They venture out to various areas of the camp taking camel rides and there are ladies getting henna on their hands and feet. Some tourists dress up as Arabs to Facebook and instagram their pictures for soon to be jealous friends and family back home. Some people are at the bar enjoying a refreshing libation.   While all the festivities are going on, an army of white-coated cooks and chefs hurry about to prepare the feast. You know that you are in for something special as you see the preparations take place with serving trays and dishes being put in place.   Off to the side there is a massive grill and the flames from the charcoal sizzle the meats and spread the aroma about the camp. The call for dinner goes out and the readied guests make their way to the buffet. This is an Arabic Barbeque and the food is delicious and plentiful with too many choices to name. Beef, lamb, chicken and fish as well as various salads, vegetables side dishes, and desserts are on the menu each night. We take our trays back to our tent and have a thoroughly enjoyable meal chatting with other couples nearby in our tent.   After dinner, just as the inevitable drowsiness from over eating sets in, they raise the tiempo with the entertainment. In the central floor/stage area the spotlights come on and the talent enters the stage. Many of the guests leave the comfort of their tent to move closer at the tables around the stage area for a closer look or to take more jealousy inducing Facebook photos.   First up is the belly dancer. It’s a bit chilly out but she doesn’t not seem to mind as she winds and gyrates around the floor. Her body seems to move without a spine as she moves in every direction. The audience is mesmerized with her shaking and shimmering.   Next up is the Egyptian Tanoura dancer. I cannot understand how he is able to do what he does. Basically he twirls in one direction at a frantic pace for 30 minutes. As he twirls, his costume begins to “fly’ with each twist higher and higher. He begins to juggle various objects and layers of his costume become part of his props as he then lifts over his head. All of this while the music in the back grounds drums and trumpets in a frenzy matching his pace. By now he’s sweating and is moving as intensely as the music. Any other mortal on the planet would have collapsed from dizziness after five minutes. For his finale, the spotlights on him go dark and with a flash, his costume lights up. It looks like a Christmas tree is caught in a tornado as the music intensifies and he twirls even faster. When the tiempo is a peak and he twirling is at a ridiculous pace with a sharp drumbeat he collapses and the music halts. Wow.   After a robust applause from the amazed onlookers, he picks out a guest from the audience. She joins him on stage and he puts his costume on her. She begins to twirl while laughing and talking to her friends in Russian. The costume begins to rise but she then falls and all join her with laugher.   After the entertainment is done, we go back to our tent to relax a bit while talking about the exciting evening that we just experienced. It was a wonderful time. Some of the guest will stay the night and wake to a deluxe breakfast. We decide to call it a night and return home.   There are many companies providing various types of dessert safaris. The Bassata Desert Village has taken the experience and made it a five star evening with their delicious Arabian barbeque, the deluxe facilities, the service, and the entertainment. If you seek to enjoy the Arabian nights adventure you always dreamed of as a child, Bassata Dessert Village in Ras Al Khaimah is the way to do it in style."
        }, 
        {
            "index": 522, 
            "rating": "5", 
            "review": "Wonderful place to experience the dessert. The DDCR is a unique way to experience the dessert. It is literally teaming with gazelle and Arabian Oryx.The environment varies from larger to smaller sand dunes to areas full of vegetation where you'll find many of the animals. Admitedly the areas with higher levels of flora are only possible due to the high level of man made irrigation provided but I guess that's fitting for an attraction near Dubai.The government has devoted 5% of the total land of Dubai to the DDCR and it is a special treat to visit it."
        }, 
        {
            "index": 523, 
            "rating": "5", 
            "review": "Desert safari. We had a great day in the conservation reserve on our desert safari. Lots of animals to see and some dunebashing along the way. Great day out and a must for everyone."
        }, 
        {
            "index": 524, 
            "rating": "5", 
            "review": "Desert safari visit marvellous trip. Camel camel camel riding .my kids r crying with pleasure now I am in daska Pakistan but not I am feeling myself in desert safari v good gathering music buffet dinner .jeep driving such enjoyable .most liked activity in dubai by my kids.evning sunset scenery cool winds .this was the different style of life .the person who danced so much lights was v enjoyable arabic songs."
        }, 
        {
            "index": 525, 
            "rating": "4", 
            "review": "A Great Desert Experience. We booked our tour through one of the many companies online and they picked us up and dropped us off at our hotel. We booked a short morning tour but that was more than enough for us. After a short ride to the reserve we took off across the dunes. We saw some desert wildlife and stopped often for pictures. Refreshments were available for our tour, but others include camel rides, lunch, dinner, and other things. We paid less than 400 AED for our tour for two and had a great time overall. After a late night out the night before the 9 am pickup was not bad but some of the 4x4 action had some effect on our stomachs. The driver slowed down and took things easy as he saw we were having some trouble. Highly recommend as a great trip to escape the city of Dubai."
        }, 
        {
            "index": 526, 
            "rating": "5", 
            "review": "Experiance the desert. The dance of noora was really good and very refreshed performance. which is totally familiar and amazing"
        }, 
        {
            "index": 527, 
            "rating": "4", 
            "review": "A safe experience in the desert. If you want a semi-authentic experience in the desert, without losing any comfort, this is the place for you. You start with a falcon show, the a tour by the dunes on a 4 by 4, with or without emotion (if you get car sick, watch out). The you watch the sunset over the dunes, and finally a camel ride and dinner by the Bedouin fire, with a Belly dance show to entertain.I enjoy it a lot.On a side note, wait for the bathroom at the diner place. Trust me."
        }, 
        {
            "index": 528, 
            "rating": "4", 
            "review": "Amazing. We visited the conservation reserve with Arabian Adventures to go dune bashing and saw a number of deers and oryx during our adventure. Its certainly worth visiting if only to appreciate it the vastness of the desert."
        }, 
        {
            "index": 529, 
            "rating": "4", 
            "review": "visit the desert. it is great ride for all family. kids love it! don´t go if you are motion sickness sensible!! the sun goes out and the fun starts up!. i would never miss it"
        }, 
        {
            "index": 530, 
            "rating": "5", 
            "review": "Bravo. When you drive 38 miles away from Dubai, you begin to realize what existed here before the economic and building boom. The protected desert reserve is home to native wildlife, including gazelles, and it is very special for tourists to see this. Hopefully this on-going effort to protect a vast area of desert will benefit the environment, save the native species, and educate the public about the importance of this conservation project."
        }, 
        {
            "index": 531, 
            "rating": "5", 
            "review": "Dubai's extraordinary desert: A unique experience!. Visiting Dubai's desert was a fantastic and unforgettable experience. You can visit Dubai Desert Conservation Reserve while staying at the fabulous Al Maha Desert Resort & Spa, or by booking the tours offered by authorized agents. The activities organized by Al Maha's rangers are really amazing, allowing travelers to go deep into this oasis of fauna, flora and wildlife preservation. I booked only four activities: 1) Sunset camel ride - ending on the desert dunes, enjoying the sunset, sipping champagne and tasting the fantastic dates of Dubai. Shazzab and Darryn, the camel masters, will help you lose any hard feelings you might have against camels; 2) Early morning falconry - how can one miss this Arabian secular tradition? Brad, the falcon master, will bring falcons to your arm safely and you'll even caress them; 3) 4x4 Desert drive - extreme, intense and memorable, with beautiful dunes and the great desert scenery. Dwayne, a South African ranger, born and raised in the Kalahari Desert, will demonstrate all his skills driving on high dunes - please no eating before the ride and nerves of steel are a must; and 4) Wildlife drive - a quiet and amazing drive within the DDCR - Ranger Lihandra will give you a chance to photograph the rare Omani white oryx and many other desert animals. Enjoy!"
        }, 
        {
            "index": 532, 
            "rating": "5", 
            "review": "Extraordinary Experience in the dessert. It was a extraordinary experience by taking the four wheels drive into the dessert. We stopped at one point to view the sunset in the dessert while appreciate the champaign, it's simply BEAUTIFUL! Even feeling the sand on your feet is an awesome, as it's so soft, tiny and smooth :-)The night ended by indulging in the arabic music with belly dancing perfomance, not forgetting chilling out with friends. It's a lifetime experience."
        }, 
        {
            "index": 533, 
            "rating": "3", 
            "review": "Beautiful landscape not much wildlife. We entered the reserve as part of a desert safari. The landscape is gorgeous but I love the desert too so may be a bit partial. I was a tad bit disappointed that we did not see any antelopes and only saw a couple of gazelles. Maybe just bad timing. It is worth a visit though if just for the landscape. A more accurate rating is \"good\" but the way TA does it 3 = average and 4= very good. It is better than average and verging on very good."
        }, 
        {
            "index": 534, 
            "rating": "5", 
            "review": "Sundowner Dune Dinner/Desert Safari. We did a Sundowner Dune Dinner tour which was fantastic. We did some thrilling dune bashing along with many others in Toyota Landcruisers. We took some wonderful photos of the setting sun and then drove to our Bedouin encampment for camel rides, shisha, henna painting, beautiful food, wine and belly dancing. We also saw a falcon up close and watched the owner training it. We had a very memorable night and purchased some photos of our camel ride."
        }, 
        {
            "index": 535, 
            "rating": "4", 
            "review": "beautiful. This conservation area is beautiful at dusk and sundown. Animals roaming about, beautiful sand dunes, lovely colors come out in the evening."
        }, 
        {
            "index": 536, 
            "rating": "5", 
            "review": "Perfect peace. The best way to get up close and personal with the wildlife, whilst enjoying your very own infinity pool"
        }, 
        {
            "index": 537, 
            "rating": "5", 
            "review": "Spectacular experience!. the landscape is unique the tranquility is superb, then the endemic animals of the area, plus the top quality resorts and cuisine its a simple experience to die for!"
        }, 
        {
            "index": 538, 
            "rating": "5", 
            "review": "Great Fun. The Dubai Desert is beautiful and the desert safari 4x4 drive was excellent. Show after safari and dune biking is great. Food is good and activities are nice. Just that you have to be quick in taking your food."
        }, 
        {
            "index": 539, 
            "rating": "5", 
            "review": "Great fun!!. Modern, air conditioned 4x4 with a knowledgable and safe driver. Dune bashing, sunset watching, photo ops and that's before we get to our beautifully set up camp. Good food, drinks and sheesha. And an optional camel ride I you like."
        }, 
        {
            "index": 540, 
            "rating": "5", 
            "review": "Something different. This was good experienceSand dune in 4x4 funHot to ride buggy in sandFood in dessert was o.k.Weather was good for this in October"
        }, 
        {
            "index": 541, 
            "rating": "4", 
            "review": "good experience. The food and entertainment were good- if you get motion sickness though I wouldn't recommend the sand-dune four wheel driving!!"
        }, 
        {
            "index": 542, 
            "rating": "5", 
            "review": "Desert Safari FUN FUN FUN!. Amazing unique experience if you are traveling to UAE don’t miss it. Especially dune drive it’s a crazy fun."
        }, 
        {
            "index": 543, 
            "rating": "5", 
            "review": "Desert. I like the way they appreciate the idea of recycling the water, yet keeping it so natural. Being in the middle of a desert, water is a very precious commodity, therefore it must be preserved."
        }, 
        {
            "index": 544, 
            "rating": "5", 
            "review": "Amazing. This was one of the highlights of my stay. You get picked up from the hotel and they drive through the desert for a while along with 20 or so other cars. It can be really bumpy so not so great for younger kids. You see the sunset, ride camels and then have lunch under the stars while a belly dancer dances to arabic music. Eventful to say the least!"
        }, 
        {
            "index": 545, 
            "rating": "4", 
            "review": "Arabian nights. The Dubai Desert has really breathtaking sights and scenery such as the peak of a sand dune where the sand is so soft and cooling when we roamed the desert near to evening time. Enjoying the food and drinks under the glittering stars is really romantic as well as being able to experience Arabic traditional arts, like intricate henna tattoos and unusually beautiful sand art creations where customizing the message you would like to carry across to your loved ones."
        }, 
        {
            "index": 546, 
            "rating": "5", 
            "review": "Stunningly beautiful. Well worth a trip. The falcon show is a bit tacky but the sand dune driving is amazing and the dunes at sunset are very very beautiful. The dinner at the camp is great value for money. Recommended"
        }, 
        {
            "index": 547, 
            "rating": "3", 
            "review": "Hot night in the desert. We thought the sand dune part of the trip was great however the dinner was very average. The seating was a cushion on the ground - very difficult to get down to and quite uncomfortable - what do you do with your legs? Hard if you are not young and supple! I didn't like the fact that we were expected to cover shoulders and knees out of respect for the local culture but the entertainment was a belly dancer in typical belly dancer outfit! She was very good but would have been better if there had been 3 or 4 dancers rather than just one. The drive back to our hotel was a nightmare with the driver going 150klm per hour - and I was in the front seat! Obviously he needed to get home in a hurry :-) Tip: wear sandals not sneakers as the sand is very fine and fills your shoes."
        }, 
        {
            "index": 548, 
            "rating": "5", 
            "review": "Desert Safari - must do!. Booked a Desert Safari as a couple - not really knowing what to expect - would do it again! Fantastic experience."
        }, 
        {
            "index": 549, 
            "rating": "5", 
            "review": "A great reserve. Wonderful to see that the authorities were foresighted enough to preserve and restore the desert area with the original animals flora and fauna and maintain it in pristine condition"
        }, 
        {
            "index": 550, 
            "rating": "5", 
            "review": "excellent adventure. its a well plan interesting adventure nice staffs. the dinner was beautiful with all the shows. it was nice watching the sunset from the desert"
        }, 
        {
            "index": 551, 
            "rating": "5", 
            "review": "a great night out. we had a great night at the safari even if we did not do the dunebashing. just the camel ride, photos with the falcon and then the shows, belly dancing, the spinning guy is amazing, the buffet in the desert. a must do even if it is a little touristy. a great sunset and worth the small climb up the hill."
        }, 
        {
            "index": 552, 
            "rating": "5", 
            "review": "worth seeing. Visited here as part of our desert safari. We saw some onyx, gazelles and lizards. Worth a visit as part of a tour."
        }, 
        {
            "index": 553, 
            "rating": "5", 
            "review": "Dune Dinner Safari. Doing tour such as the Dune Dinner Safari is a must, great way to have an Arabic experience. Pick up and drop off at hotels, food was great, included soft drinks and alcohol, shisha smoking, camel rides, henna and belly dancing."
        }, 
        {
            "index": 554, 
            "rating": "5", 
            "review": "high tea. we went there booking for a high tea. we had 3 courses, a tea and a cocktail. we remained astonished by the internal fountain"
        }, 
        {
            "index": 555, 
            "rating": "5", 
            "review": "Loved the desert at night !. I visited as part of a \"dinner safari\" to a \"Bedouin Camp\". The higlight of the trip was not the dune ride, or the dinner, or the touristy entertainment (belly dancer, fortune teller, camel ride, etc) but just being in the desert. We arrived as the sun was setting, and the temperature cooled from about 95 F to maybe in the 70s, and breezy. (wear trousers and sand-proof shoes !) Our dunes were not as dramatic as they are in some parts of the Reserve, but they were beautiful - quiet, mysterious, and fun to walk a ways out to feel what it would have been like to try to navigate. I am so glad that this part of the desert is preserved from development for us all to see."
        }, 
        {
            "index": 556, 
            "rating": "4", 
            "review": "Roller Coster in Desert. I have been there so many times. I love to visit this site more and more. Its fun to visit by seating in Land Cruiser roller coster. If your driver is experienced enough, you will really love this ride."
        }, 
        {
            "index": 557, 
            "rating": "4", 
            "review": "Wild ride. Definitely recommended for those who like wild rides. There are many companies around who offer a desert safari but only a few of them are recognised by the Dubai Desert Conservation Reserve. Visit their website to know what company to go for."
        }, 
        {
            "index": 558, 
            "rating": "5", 
            "review": "dubai dessert. not sure if they do during the morning but was afternoon we went was a great time after been driving round the dessert in jeep we went for some entertainment and drinks after and rides on the cammell a must to try we had great time finished at 8pm"
        }, 
        {
            "index": 559, 
            "rating": "5", 
            "review": "execellent. we booked it from Melbourne cause it dose get booked out really fast and your food and drinks are all for free ..you will love it I hate rides but this was Amazing will do it again ..you can get your hand panted with hena and have a camel ride and take photos a lot to do in about 8hrs ...you will never know if you don't give it ago !!!"
        }, 
        {
            "index": 560, 
            "rating": "4", 
            "review": "An evening of ups, downs and sideways. The ride to the desert reserve was an exciting surprise.We flew over down and around the dunes thinking we were going to turn over. What an adrenalin rush.This was followed by a bar-be cue dinner with a belly dancer.Camel rides were also available for thows who wanted more thills.I had big fun but this was not a good experience for people pron to motion sickness."
        }, 
        {
            "index": 561, 
            "rating": "4", 
            "review": "Desert Trip. Cheesy Touristy Fun!\nIf you get travel sick - take some medicine before doing the dune rides! A one time must do."
        }, 
        {
            "index": 562, 
            "rating": "5", 
            "review": "Desert Safari is an excellent and thrilling experience. I am not sure whether the place that I visited was the Desert Conservation Reserve. As it is organized by the tour, I was transferred from the hotel in the late afternoon to reach the desert. The driver did not speak much and immediately put me into the 4-wheels drive. The dune bashing is starting immediately after the Arabic driver drove into the desert. It is excellent like the playing roller coaster in the desert. You will be able to watch sunset in the desert by climbing to the sand dune. Climb up is difficult to climb down. The sand is too soft.Camel riding and sand boarding are chargeable separately.The BBQ dinner was served but this is really a simple BBQ as only BBQ chicken is served. Other courses are mainly vegetarian.The most impressive and attractive were the Tanoura dance and Belly dance. It is amazing that the Tanoura dancers can spin more than 15 minutes without feeling dizzy.Overall, it is an unforgettable and irregretable trip to the desert. Everyone shall visit desert once upon a time in your life."
        }, 
        {
            "index": 563, 
            "rating": "5", 
            "review": "Breathtaking!. I love the ocean, but this was my first experience in an ocean of sand. The desert is beautiful and serene and I applaud the Conservation Reserve in protecting this incomparable ecosystem."
        }, 
        {
            "index": 564, 
            "rating": "3", 
            "review": "Dune ride was great, but camel ride was short and fast. I was disappointed.. I do agree with others about Dubai. Desert experience took my breath away. I think it was one of the most exciting things in Dubai."
        }, 
        {
            "index": 565, 
            "rating": "5", 
            "review": "Conservation Wonder. Nature lovers will appreciate Dubai Desert Conservation Reserve as they experience its beauty for themselves. The native fauna was amazing as I saw species I never seen or heard of before. The staff were friendly and willing to answer questions which made my adventure a truely memorable one. I would highly recommend people visit the conservation wonder and embrace its secrets for themselves.Caroline B"
        }, 
        {
            "index": 566, 
            "rating": "5", 
            "review": "Very exciting desert safari. The whole period from the time we were picked from our hotel by a comfortable 4X4 safari vehicle at around 4 pm till we were dropped back at 10:30 pm, I and my wife had a lovely time. Once we entered the desert park, It started with a falcon show which followed the real thing. Driving up n down the sand dunes,our vehicle skidding at times, tilting by huge degrees, blasting up sand in the air, it was all very exciting. Driving skills of our driver on the sand were commendable. There were total of 50 vehicles doing the same stuff and it all look exciting. This followed a lovely sun downer experience which meant we watched the sun set behind the sand dunes while it was getting cooler by every moment.Then we were taken to the base camp which was a lovely set up. Food, dance, drinks, camel ride, with dunes in the background made fo a spcial evening."
        }, 
        {
            "index": 567, 
            "rating": "4", 
            "review": "Once in a lifetime!. A Trip to the Middle East without visiting the great Arabian Desert.... what a complete loss!! Yes, the Desert is one attraction that one should never & cannot miss at the cost of other attractions. The Conservation Reserve is a piece of area in the Desert where civilians are permitted to visit and roam freely without any restrictions. This is the same area where all the Desert Safari's are also done i.e. Sand bashing in the 4x4 land cruisers including the night camps.Since it is very difficult to see the desert on your own because of the terrain and permission issues one should book a safari wherein one can really experience the desert first hand. There is sand everywhere and the sunset is a delight to watch overlooking the desert. You can find people from neighboring emirates (Sharjah, Ajman etc) visiting the Dubai Desert over the weekends in their convoy of vehicles to enjoy the desert experience very frequently.Make sure to book with a good tour operator as this is one real experience which is equally thrilling and memorable and should be done with a good experienced driver only.."
        }, 
        {
            "index": 568, 
            "rating": "4", 
            "review": "beautiful desert. i really enjoyed it .. first off road then dinner .. tho it was very cold at night.. nice show but why a blond and western belly dancer in the middle of the desert !!!!"
        }, 
        {
            "index": 569, 
            "rating": "3", 
            "review": "Do it yourself. We did the desert thing but didn't book a trip. Went off in two land rovers and did it independently. Saw a couple of wild camels which was pretty good.But, it's just sand at the end of the day and Dubai is very ho so I wasn't gong to get too excited. We parked up, fried up some bacon n eggs, took some photos, had a look around, got a flat tyre, changed the tyre which made us sweat like we had never sweated before , drove up and down the dunes and then left sweating and dirty and with soaking wet shirts. It's alright. Maybe the trips are more entertaining but I wouldn't know. While in Dubai, it's worth seeing but it can be stupidly hot and it's not amazing."
        }, 
        {
            "index": 570, 
            "rating": "4", 
            "review": "The desert.... Oh, the desert. You have to love it. This is not for the faint hearted adn don't expect much comfort. It's the desert. No air conditioning there. But if you can take a bit of sand and heat, the sheer beauty of it would pay you back a thousand times..."
        }, 
        {
            "index": 571, 
            "rating": "5", 
            "review": "Well Run Conservation Programme. The principles that underpin the reserve are founded on sound ecological practice - the mix of species and levels of habitat management intervention are carefully finessed and great progress is being made in establishing representative habitats of the region. Whilst the open water lake is probably an intervention too far, it does provide an additional ecological niche... An excellent outing and a break from the commercialisms of downtown Dubai."
        }, 
        {
            "index": 572, 
            "rating": "5", 
            "review": "NICE. Had a wonderful Desert Safari with Dune Dinner, very well arranged trip, Driver picked us on time from hotel had a 35 min drive to reach the spot, Beginned with Falcon Watch, and had a wonderful drive in between car will stop for photographs and sunset, after sun set had a wonderful drink and dinner finally show will end with belly dance,"
        }, 
        {
            "index": 573, 
            "rating": "5", 
            "review": "A Must to try in Dubai!. Very good experience! The journey to the desert is about 30~40 min. Along the way, the driver will stop for toilet break. In the desert the 4x4 car bashing through the desert. Very thrilling and entertaining. Looking at the sunset at the desert, taking photos, went to the camp for camel riding and dinner. Overall very good experience! A must when visit Dubai!"
        }, 
        {
            "index": 574, 
            "rating": "5", 
            "review": "Finally the wildlife of this area is being protected. When I first got here in the sixties, wildlife was hunted with helicopters and machine guns. Within a very short space of time, wildlife had almost totally disappeared. Sheiklh Zayed started the ball rolling with trying to save the Arabian Oryx in Al Ain and from then on the conservation of many species as well as large tracts of desert was enforced. Thankfully the hunting of wildlife is now banned and just last weekend I saw two sand gazelles. The first ones I had ever seen."
        }, 
        {
            "index": 575, 
            "rating": "4", 
            "review": "Desert camping under the stars. I recently spent a night camping here as part of my sons cub scouts of America program.We arrived early in the morning(8am), parked at a secure sand car park where our gear was transferred into the DDCR 4x4. A few minutes later we arrived at our location for the next 24 hrs and set up camp. The facilities were not as I expected- a large majlis area with low seating, extensive buffet food offerings, clean (ish) bathrooms.Included in our camping adventure was :A dune bashA visit to Sheik Mohammad's private lake to see lots of animals up close.A talk by a nature specialistFalcon showCamel ridesGenerous and tasty Arabic buffet dinnerStar gazingCooked breakfastOverall,we were there for 24hrs and it was thoroughly enjoyable- even for this five star princess!"
        }, 
        {
            "index": 576, 
            "rating": "5", 
            "review": "Best trip through the desert ever!. Don't miss this, if you think you've seen a desert you haven't seen Dubai Desert. There's some really exotic and yet intoxicating about the desert view. When you go through, don't rush - take your time to absorb the breeze (during October best time to go) and let the sand seep through fingers. You'll also see some wild desert animals - try and spot the white Oryx. Absolutely beautiful!"
        }, 
        {
            "index": 577, 
            "rating": "4", 
            "review": "Desert Safari rocks. It was a summer evening, yet we didn't mind the humidity in the air. That safari ride was just awesome. After some photo shoots in the desert, we went straight to the bedouin camp. We had kebabs, arabian dinner there, then watched some belly dancing and local dances. It was a good cultural experience."
        }, 
        {
            "index": 578, 
            "rating": "5", 
            "review": "Beautiful! Unique! Special!. We loved spending time out in the desert. It was such a unique place for us to be and learn about. Highly recommended!"
        }, 
        {
            "index": 579, 
            "rating": "5", 
            "review": "HUGE fun. Wadi bashing is a blast! And at the end you get supper in a camp in the desert. Sure, it's a bit contrived, but as close as you'll get to the real thing."
        }, 
        {
            "index": 580, 
            "rating": "4", 
            "review": "Ride and slide. If you just want to spend half a day on tour this may be an option. Nice guide, camel riding and sand boarding, if you want to."
        }, 
        {
            "index": 581, 
            "rating": "5", 
            "review": "amazing. well worth the money as the experience is unique and lots of extras such as henna painting, belly dancing, snow boarding, camel rides etc"
        }, 
        {
            "index": 582, 
            "rating": "4", 
            "review": "Great sandy fun. Great fun, even if some got car sick friom driving in the dunes. The drivers were very skilled. We ended with BBQ dinner at a tentsite in the desert where they also had all kinds of activities including an amazing dance show featuring a dancer with many layers of colourful skirts going around and around as well as a skilled bellydancer. Some of us dressed up in Arab costumes, great photo opportunities! Only regret was that we did not have time to ride camels, it was getting dark. This was a typical \"tourist trap\", but still a great way to relax away from meetings and work."
        }, 
        {
            "index": 583, 
            "rating": "4", 
            "review": "Fantasic. However you get there there will be lots of people. Try to get a little way away from the crowds and you can feel like you are on your own. Look for the other wild life bile you are there you will see some."
        }, 
        {
            "index": 584, 
            "rating": "5", 
            "review": "Great night out. We had a terrific time on this adventure. Saw wild life, 4xwheel sand dune drive was fun, Fazel our guide was excellent and camel ride, meal, belly dancer, henna tattooing and star gazing added something special to the night. great fun...."
        }, 
        {
            "index": 585, 
            "rating": "5", 
            "review": "Must do !. I had red a lot about the Dubai desert before I landed. I took this via my tour operator at 65 EUR/person including transportation, dune bashing, great food. It's one of the greatest funs that you could have in Dubai. Enjoy...."
        }, 
        {
            "index": 586, 
            "rating": "4", 
            "review": "Evening in the desert. If you tend to be carsick, ask to ride in the front when they reach the conservation area! Very bumpy - but fun.Restroom/toilet facilities are available...cleanliness about what you should expect out in the desert.Food, excellent. Lots of choice. Well-cooked and nicely presented.belly dancers...typical - what made us chuckle was that the lead dancer was actually Brazilian; the other three dancers were her students, and not one of them was from the UAE!A good touristy night out...fun if you don't focus on the authenticity!"
        }, 
        {
            "index": 587, 
            "rating": "5", 
            "review": "Dinner in the desert. Everything! riding the dunes, watching the sun set over the desert, camel ride, holding a falcon, dinner, fun photos taken it was brillant."
        }, 
        {
            "index": 588, 
            "rating": "3", 
            "review": "a bit of desapoitment. the desert was beautiful experieiced, but the camp was very poorly organised for my taste.i hated to see cans of cola and things one can buy in a western supermarket... i expected a more realistic taste of arabian culture.."
        }, 
        {
            "index": 589, 
            "rating": "4", 
            "review": "Desert Safari. Good to chill out in the evening with the bbq dinner, had hema done on my hand, and the desert was good for sightseeing"
        }, 
        {
            "index": 590, 
            "rating": "5", 
            "review": "Arabian Adventure Dinner and Dune safari. Lots of fun burning over the dunes, but might pay to take a travel sickness pill as after half an hour your tummy may start getting a bit churned up ! They do several stops including one at sunset for photos. You can have a camel ride at the beginning before going over the dunes including a photo but you can also take your own photo - need to be quick though as they move you along quickly probably so you cant take your own photos and they can make money. The setting for the dinner was very authentic with big comfy pillows to sit on and low tables, there are also some higher tables. Food was authentic and lovely too. Camels here for rides also but not so good for photos as it is dark. Be warned it will be very hot, no airconditioning, it was 40 degrees at 6.30 pm when we were there in September. The locals said that December is the best month to visit, but gets cold in the desert at night apparently"
        }, 
        {
            "index": 591, 
            "rating": "4", 
            "review": "Have to try it!. I had never experience driving through a dessert and it was amazing!!! highly recommend it. The tour I took included dinner with belly dancers, buffet style food, hena, camels...and so on....very touristy, which I typically do not enjoy as much but I've learned that tourist entertainment and how activities are put together is also part of the culture...I had a really good time. The food was not good but not bad either..."
        }, 
        {
            "index": 592, 
            "rating": "2", 
            "review": "paying 500 dhirams for a 15 mins drive is not worth it. guys the drive to the safari was too good it was jst awesome expect tht don'nt expect more .......worthless food they make u stand in a line like beggers the food is so bad tht i can'nt even write it down .....belly dance and all is good the place is worth visiting only during dec....."
        }, 
        {
            "index": 593, 
            "rating": "5", 
            "review": "A great get away place from the city of Dubai. Went up and down dune after dune in a four by four, the sand colours and sun set are well worth seeing"
        }, 
        {
            "index": 594, 
            "rating": "4", 
            "review": "Enjoy Desert. Desert safari is a must to do in Dubai trip. It take one entire evening. If you have nusia from ups and down then it is not for you. It gives an experience as in roller caster. The end of trip is full enjoy with belly dance and lots of food."
        }, 
        {
            "index": 595, 
            "rating": "5", 
            "review": "Rocking. Visited the desert through the dune dinner safari. It was an awesome experience. Watched the falcon show and saw a few animals, of which camel. Luckily, it didn't get too hot"
        }, 
        {
            "index": 596, 
            "rating": "5", 
            "review": "An exciting experience. The trip Starts in the evening. Going to desert with a big SUV like Toyota Land cruiser is very exciting. the expert drivers ,driver the SUV like you are in a Fighter Jet! after that you will go to a desert restaurant and can eat and drink and look to Arabic dance and other ceremonies. At the night you will return to your hotel."
        }, 
        {
            "index": 597, 
            "rating": "5", 
            "review": "Most fun. Desert safari made our dubai trip most wonderful and unforgettable experience. It was much adventure activity and enjoyed activity."
        }, 
        {
            "index": 598, 
            "rating": "3", 
            "review": "Bit average really. I found this pretty average really. If you like being in a convoy of 50 4WDs speeding up and down sand dunes. The dinner and dancing was nothing out of the ordinary - the food I tasted was what I've already had at any number of Arabic cafes/eateries in Sydney. And the same with the belly dancing - seen it all before any number of times in Sydney. No doubt that the drivers are very skillful. Over rated in my opinion"
        }, 
        {
            "index": 599, 
            "rating": "5", 
            "review": "A Must do experience. To leave the city and experience the desert and watch the sun go down is simply breathtaking. A ride on a camel is the icing on the cake!"
        }, 
        {
            "index": 600, 
            "rating": "5", 
            "review": "excellent. A very good for value experience-includes a buffet meal in an oasis desert camp along with belly dancing show"
        }, 
        {
            "index": 601, 
            "rating": "4", 
            "review": "Desert Safari. It is a tour that should never be missed. Enjoy the sand dune bashing and camel rides with great barbeque food. With the night performers."
        }, 
        {
            "index": 602, 
            "rating": "5", 
            "review": "Trip of a lifetime. Shopped around but ended up booking with planet via concierge at Hilton hotel. The sand dunes are massive and never expected the cars to travel so fast over them. They do say there is always someone in the group that will be sick!! Thankfully not me. The cars take up to 6 people and the driver and they all travel in convoy expertly driven. You eventually arrive at a commercial Bedouin style camp where you can camel ride, have a fab BBQ help yourself to drinks ( alcohol you pay for tho) and get Henna tattoos watch Egyptian dancers, try Hubble bubble and there is also a gift shop. The trip cost around £40 pp and was money well spent. Didn't want the evening to end and if we go back we would pay extra for the option of camping overnight.. My 3 boys aged 9, 11 & 15 said it was the highlight of the holidays, and believe me we packed loads in!"
        }, 
        {
            "index": 603, 
            "rating": "5", 
            "review": "4WD tour just awesome. I did this tour as part of an educational trip to Dubai in May 2012. Book early, it sells out. Meal was good at the end. I loved the 4WD part on the dunes. Things like that usually scare me a bit but I wished they had gone faster. Book it. Holding a falcon was a highlight. You can smoke shisha if you wish. You sit in the floor on cushions Bedouin style, so be aware of this if you have issues getting up and down and speak to your agent to see if there is any other seating option for you."
        }, 
        {
            "index": 604, 
            "rating": "3", 
            "review": "overhyped. Dubai Desert conservation reserve is a large tract of desert. Some Tour oprerators take you through this after Desert Safari on the way to camp. Does'nt have anything more to see than a few animals."
        }, 
        {
            "index": 605, 
            "rating": "5", 
            "review": "Desert Safari- a Great Experience. The dune bashing was amazing. Drivers are really experts. The capmsite experience was also great. It made our evening very entertaining."
        }, 
        {
            "index": 606, 
            "rating": "5", 
            "review": "our desert advantures. I excited wirth 4x4. we shouted allot. Me and my friend sometime laughed sometime afraid. and made a video with belly dancer. nice barbeque and with tatou henna design was unforgettable."
        }, 
        {
            "index": 607, 
            "rating": "4", 
            "review": "A great experience. Took in the Safari ride and barbeque - very well organised and the barbeque was a great experience. Food was just about acceptable !"
        }, 
        {
            "index": 608, 
            "rating": "5", 
            "review": "Just amazing. We had a great time at the desert, fun off road desert ride. Watching the sunset, camel back ride, belly dancing, hubble-bubble, dinner."
        }, 
        {
            "index": 609, 
            "rating": "4", 
            "review": "Thrilling. Not recommended for the elderly or little kids but the dune bashing is brilliant, had a great time, the food is great too, the only thing is if you book with some tour operators you have to travel with others and at the end you have to wait around for them to get back to the jeep!"
        }, 
        {
            "index": 610, 
            "rating": "5", 
            "review": "If you are visiting Dubai for the first time, This is a MUST!. I have been to dubai but never really had the opportunity to do this. Luckily this time I was in dubai for seven days and with family so we booked this trip. A few family friends that live in dubai also joined in and we booked the whole 4x4 SUV. There are many companies that offer this safari so someone's experience can be different from someone elses! My experience I would say was excellent! They first took us to some quad biking regions. Quad-biking was extra. We then got into our SUVs and all the SUVs from different hotels and locations got together at a meeting point. The fun started after that! They drove around the desert at really high speeds (dune driving)! It's like a roller-coaster ride except for it is real and there are no safety features. There have never been any injuries reported and the drivers are obviously experts. However I would not recommend this trip to people with hypertension or heart disease or anything that might cause them to feel sick due to this. For an average person, this is actually quite intense. We then stopped at a top of the desert to take pics of the perfect sunset. We get to a fort like location where we see and dine. There are many things there such as heena, camel rides, bbq and local and authentic foods, holding of eagles, shisha and and few other things. There is also Belly dancing and another dancer doing tricks. Food is included but alcohol is extra. There are tons of photographers there and unless you want to buy horrible (usually crooked) pictures at really high prices try not to let them take pictures of you. Some get really pissed off if you don't buy their pics. but in overall, it was an outstanding time out in the desert! I haven't met a single person that disliked this trip!"
        }, 
        {
            "index": 611, 
            "rating": "5", 
            "review": "Amazing desert safari. Excellent value for money to see a breath taking environment, meet some camels, eat some typical arabic food and bash some dune's in 4x4's, I would definately recommend to anyone going to Dubai!"
        }, 
        {
            "index": 612, 
            "rating": "5", 
            "review": "A fun Bedoin sampler. On a family vacation, we took the adventure trip to the DDCR. The first event was a falcon demonstration and explanation of the importance of falconry in the Bedoin culture. Next, we ventured on for a \"dune bashing\" adventure. Our guide did explain that it was a little less intense that an actual dune bashing as we were in a Land Cruiser and remained on a path. Plenty exciting, though. One vehicle actually got stuck in a dune. We stopped to watch the sunset over the sand which was very beautiful and great photo op. We then headed to the \"oasis\" for a grilled meal, henna painting, belly dancing, hooka and camel rides. Touristy, I'll grant you, but a very unique experience and it didn't feel like a tourist trap. This was the favorite event of our entire group, which included 4 teens."
        }, 
        {
            "index": 613, 
            "rating": "5", 
            "review": "Desert safari- visit Dubai conservation center!. Desert conservation center is must watch place in Dubai. A bit of sand-dune action in the 4WD followed by a visit to the Camel Farm and watching a stunning sunset. The experience was awesome and thrilling. We had enjoyed a dinner with belly dance and the other dances. All were excellent. It is recommendable to eat less food before going for desert safari as some might vomit during the bumpy ride in the desert."
        }, 
        {
            "index": 614, 
            "rating": "5", 
            "review": "Dune Bashing. No trip to Dubai is complete until u visit the DDCR, dune bashing is an exhilarating experience...apart from that you should try & hire the dune buggies...they are fun, don't forget to bargain prices."
        }, 
        {
            "index": 615, 
            "rating": "5", 
            "review": "Amazing. So much fun! Had a really great time. The leaders were also very pleasant."
        }, 
        {
            "index": 616, 
            "rating": "5", 
            "review": "Unforgettable safari. Spectacular ride through the sand dunes, camel ride and a superb outdoor diner and show."
        }, 
        {
            "index": 617, 
            "rating": "5", 
            "review": "I wish I had known about this!. I really really wish I had known about this before I went! I wanted to see the desert - and booked a desert safari - which was unbelievably tourist trap material. This is actually what I wanted to see!"
        }, 
        {
            "index": 618, 
            "rating": "5", 
            "review": "Dunes wow. Desert of Dubai specialy desert drive is one of the best fun and i will must say amazing fun and a very lovely dessert drive"
        }, 
        {
            "index": 619, 
            "rating": "4", 
            "review": "Amazing. we went to al maha desert resort a real treat just amazing"
        }, 
        {
            "index": 620, 
            "rating": "4", 
            "review": "Interesting. If you happen to have time it is an interesting visit"
        }, 
        {
            "index": 621, 
            "rating": "4", 
            "review": "Good for Thrillseekers. The four wheel ride was awesome, our tour was not well organised had to wait for long time in the bus for our turn. At the campsite it was the same, there was no one to guide us where to sit. The dinner was good, I felt sorry for the familes with children who had to wait for food. There was no system, survival of the fittest. The belly dance and the other dances was very good, including the ride back to the bus in the dark"
        }, 
        {
            "index": 622, 
            "rating": "5", 
            "review": "Thrilling experience. Desert safari is one of the must watch place in dubai. The experience is awesome and thrilling. There was a dinner with belly dance and the other dances. All are excellent. we enjoyed a lot. Eat less food before going for desert safari as some might vomit during the bumpy ride in desert."
        }, 
        {
            "index": 623, 
            "rating": "4", 
            "review": "Great fun. The dune bashing is great fun- you need to be ready for a very bumpy and exciting ride. There is a barbecue offered, henna artist that seems over worked, belly dancing and you can go on quad bikes, ride a camel and sand board."
        }, 
        {
            "index": 624, 
            "rating": "4", 
            "review": "Desert safari a must ... You must go on the Desertsafari ...the 4 wheel drive experience is great ....the camp sites and belly dancing is awesome"
        }, 
        {
            "index": 625, 
            "rating": "5", 
            "review": "amazing trip. The drivers are perfect. It was magic - the golden sands, the camel ride in the middle of the desert with great show and good barbeque dinner."
        }, 
        {
            "index": 626, 
            "rating": "5", 
            "review": "Excellent. Dinner and dances. we had camel rides and the safari rides in the desert. i hope to be there again some day."
        }, 
        {
            "index": 627, 
            "rating": "5", 
            "review": "Must be done. Personally I don't think Dubai is an interesting destination therefore a trip to the Desert is a must to admire one of nature's wonders."
        }, 
        {
            "index": 628, 
            "rating": "5", 
            "review": "sand bashing is cool!. sorry i don';t know what this \"conservation reserve\" is but i went to the desert safari trip, which wasn't listed here. the trip started at 3.30pm and ended at 9pm. i had a 4x4 driving crazy on the desert plus belly dance performance and riding a camel in a tourism village in the middle of the desert. like my friend said: this is a most valuable 50 dollars i ever spent!"
        }, 
        {
            "index": 629, 
            "rating": "5", 
            "review": "Wonderful Horrible desert riding But very nice Trip. Desert safari on Land Rover is amazing experience,i recommend it *****"
        }, 
        {
            "index": 630, 
            "rating": "5", 
            "review": "Not for the faint hearted. Dune bashing in 4/4 the drivers are very skilled - they make it look easy. My friends loved it but I was scared and held on for life. Once I relaxed it was good. Great to watch a sunset. Had a camel ride and the evening meal and entertainment was really really good. A must really. It's a chance to experience some real culture and wear traditional costume."
        }, 
        {
            "index": 631, 
            "rating": "5", 
            "review": "Terrific, dont do it if you have back or neck problem. The whole safari was great, great show at the end in the evening and the food was excellent given the mass production nature. We really enjoyed it. But please be aware that for an hour you are DUNE BUSTING, this basically involves a 4x4 (mainly Toyota Landcruiser) with 4 to 6 of you in it and a well trained driver attacking the dunes, we didnt roll, but we certainly slid sideways down a few, we didnt get air time as we smashed into them but we nearly did and yes the cruiser in front of us lost its bumper which apparently is common whilst another cruiser needed a shove to get it out of a sand trap. When asked the driver explained that these vehicles are generally dead after two years service, to be honest I am surprised they survive that long!"
        }, 
        {
            "index": 632, 
            "rating": "4", 
            "review": "Nice evening. A great place, well organised, spent a nice night with a group of friends. The food was well served, lots of intertainments and fun."
        }, 
        {
            "index": 633, 
            "rating": "5", 
            "review": "Excellent Desert Safari. The original fantastic safari desert. There is nothing like it. The camels and the interesting Falcon show was brilliant."
        }, 
        {
            "index": 634, 
            "rating": "5", 
            "review": "Desert safari. Would like to comment on trip to Desert Safari. What an adventure!! Although with small kids & ladies with spondy problem, we opted for easier ride but even that was musch fun. The camp stay of two hours with Bar-be-que dinner with Arabic dance show was just great."
        }, 
        {
            "index": 635, 
            "rating": "4", 
            "review": "Good if you like sand. Excellent if you like sand, lots of sand! Very little wildlife to see either 4 legged or flying variety. The bst bit was you got to see the dessert \"sensibly\" with some off road fun, without being thrown about and scared witless on the main off road desert trips."
        }, 
        {
            "index": 636, 
            "rating": "4", 
            "review": "beautiful animals and a very good place too. The animals are well kept in here......orynx is a very beautiful animal too, it is just like a deer......other creatures which are here can only be found in Dubai i guess. overall it was quite beautiful experience"
        }, 
        {
            "index": 637, 
            "rating": "5", 
            "review": "Desert Beauty. The Dubai Desert Conservation Reserve is, like everything else in Dubai, not quite real, but nonetheless a marvel. The Reserve was formerly the location of camel farmers whose animals stripped the desert of the little vegetation it had. Rescuers and conservationists chose to protect a small portion of the natural desert and planted and continue to water some 6,500 plants/trees/shrubs (thus not real) in order to sustain the introduction of herds of gazelle and the precious oryx (al maha) - once a native animal, then extinct in the wild, and now restored to its former lands. The desert portion and the surrounding dunes are wonderful in their natural state. While dune bashing is a huge tourist attraction, from my purist's standpoint it is an unwelcome addition to desert activities."
        }, 
        {
            "index": 638, 
            "rating": "4", 
            "review": "Great experience but somewhat cold. Beautifull part of the dessert. We camped during one of the coldest nights it seemed later ( around zero degrees).But what a stars on the not polluted by city lights sky"
        }, 
        {
            "index": 639, 
            "rating": "5", 
            "review": "Amazing Desert experience. Good ride on the SUV. Dune bashing, Thrilling ride. Then saw the camel farms, Belly dancing and Quad biking. The desert in the night is pretty cold and perfect. I would certainly do it again, over and over again."
        }, 
        {
            "index": 640, 
            "rating": "5", 
            "review": "just as one would imagine. wonderful to see the sun going down and enjoying the quitness and peace that excudes from being in such a wonderful place."
        }, 
        {
            "index": 641, 
            "rating": "5", 
            "review": "holiday. watching the sun go down and camel riding wow and lovely meal in evening unforgettable"
        }, 
        {
            "index": 642, 
            "rating": "5", 
            "review": "Desert Safari. Romance with sands. experience of 4X4 drive with sand dune bashing, romantic sunset and dine in desert with folk arabic dancers."
        }, 
        {
            "index": 643, 
            "rating": "5", 
            "review": "Wildlife in Desert.. It is indeed an unbelievable thing to prserve wildlife in this desert. Got the opportunity to see some black bucks. It is truely a marvellous endevour to maintain these wild life inside the desert.\nPeople are employed only to take care of them. Really outstanding."
        }, 
        {
            "index": 644, 
            "rating": "5", 
            "review": "Serene. A desert on your doorstep and too such a beautiful one with wild animals and exotic plants, the drift and ripples in the snad dunes are out of 'Lawrence of Arabia'"
        }, 
        {
            "index": 645, 
            "rating": "5", 
            "review": "Thrilling. Excellent safari with relaxing meal and shisha. Our driver Khalid provided an excellent service."
        }, 
        {
            "index": 646, 
            "rating": "5", 
            "review": "GREAT MOMENT IN THE DESERT. iT WAS BRILLIANT EVEN WITH OUR 2 LITTLE GIRLS 2.5 and 4,5 years old we all had a great racing moment in the dune, saw the red sands of the desert , ride camels, had some music, very nice meal in the middle of nowhere in the desert, and a nice dancing show and belly dancing. not to miss in Dubai PLEASE !!"
        }, 
        {
            "index": 647, 
            "rating": "4", 
            "review": "Great experience. Desert safari is one of the most famous attraction in dubai. Can book a day in advance. Food is a bit problem for vegeterians as very less options are there. They have few stalls put up and belly dance show."
        }, 
        {
            "index": 648, 
            "rating": "5", 
            "review": "Breathtaking sand dunes. You need this if you just seen the skyscrapers in Dubai Marina. Such a different experience. The Oryxes, the small gazelles and the beautiful sand dunes. We had a perfect guide in Omar from Arabian Adventures."
        }
    ]
}