{
    "category": "Dubai", 
    "entity": "Gurunanak-Darbar-Sikh-Temple", 
    "avg_rating_stars": 4.782608695652174, 
    "review_count": 391, 
    "rating_stats": {
        "poor": 2, 
        "average": 6, 
        "terrible": 2, 
        "very_good": 59, 
        "excellent": 322
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "1", 
            "review": "No principles of Sikhism. Whilst on my honeymoon, myself and my wife decided to take time out and visit this gurdwara. It is such a beautiful gurdwara inside and out and we understand why so many people want to visit this place of worship.Unfortunately soon as we walked in a security guard came running up and told me I was dressed inappropriately as my knee length shorts were not long enough and would have to wear a pair of trousers which he provided; given I was in a place of worship I didn't want to argue the fact that Singhs wear long shorts with their Bana (religious clothing) but hey I was here to pray and not argue so I accepted the trousers and made my way upstairs.We sat in the darbar hall and there was just Kirtan being played over the PA system. We sat there for a short while meditating and doing our own personal prayers. Once we got up we seen a few boards outside the darbar hall with information on therefore we started reading these and the more and more we read it seemed like this gurdwara was being treated like a tourist attraction rather than a place of worship, it seemed as if the committee members were more concerned about impressing public figures rather than practicing the core values of Sikhism.As we waited for the taxi driver to finish eating langar we noticed a large school bus arrive with a handful of children. They took a few pictures against a poster and then the children, their teachers and the gurdwara staff (security guard and committee members) formed a line from the school bus which was outside the front door, up the front steps and to a room next to the front doors. They were passing parcels which were hand wrapped with wrapping paper and looked like gifts. Only problem is the school kids and teachers were passing these gifts with care to each other, however once it reached the security guard inside the front door and out of view of the children and teachers they were being tossed to the next committee members who was throwing them onto the floor in a room.As I looked on with utter shock and frustration they continued with this practice for some time. I decided to do the right thing and approach the security guard and asked who are these gifts from, to which he replied from the school and their kids. I then expressed my concerns that these school kids have spent time and effort hand wrapping these gifts and they are just being tossed with no regard into a room, the security guard replied that I need not worry as they will need to open up everything to see what's inside. They laughed off my concerns and continued therefore i decided to film their actions as proof (sadly it doesn't allow me to upload videos on TripAdvisor). Later I discovered there was food inside the boxes which really made my stomach turn, this was known to everyone and yet they were throwing these on the floor. This food would then be distributed to other people, the members of this gurdwara really have no principles of Sikhism and again proved they are only doing this for the public eye.If that wasn't enough, as I looked above where I was sat there was a poster about their trip advisor rating, again validating my views. I am really disappointed with what I witnessed on my visit, only positive thing during this whole experience was the taxi driver who seemed like a genuine kind hearted person. I really hope the committee members embed the principles of Sikhism as if a non-Sikh witnessed what I did, it would leave a very sour taste in their mouth about Sikhi and would paint us all with the same brush.This is a very beautiful gurdwara inside and out, I just hope the people who run it also have a beautiful heart and treat this as a place of worship rather than for their own gain. My rating is based on what I witnessed on my visit from members of the gurdwara rather than the building itself."
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "Beautiful.. We wanted to go and see the gurdwara in all its glory and it's just beautiful. there is security on the front door and inside it's so peaceful, almost forget we're on holiday and felt like we're at home. A great job of building this gurdwara. It's beautiful."
        }, 
        {
            "index": 3, 
            "rating": "4", 
            "review": "Nice place for worship and contemplation. The Gurunanak Darbar Gurudwara is of relatively recent origin, which was constructed to address the requirement of the Sikh community of Dubai for a larger place of worhip than the existing one in Bur Dubai. This gurudwara is a short taxi or bus ride from the Ibn Battuta Mall and metro station.The gurudwara has a large prayer hall, with ardaas (devotional music) taking place regularly. One needs to cover one's head prior to entering. The congregation area downstairs, where langar was served, was extremely clean. The food too was tasty and filling. Do combine it with a visit to the aforementioned mall."
        }, 
        {
            "index": 4, 
            "rating": "5", 
            "review": "blessed. a place u can stop during ur trip in dubai to relax ur mind and feel God´s blessings and warm your heart"
        }, 
        {
            "index": 5, 
            "rating": "5", 
            "review": "Beautiful temple ! . It is a beautiful Sikh temple Very quite and peaceful Langar is very good Parking is very easily available A must place to visit."
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "serene and peaceful. once you reach here you feel inner peace and very nice. I usually do not rate temples and religious places but this one is exception it gives inner peace"
        }, 
        {
            "index": 7, 
            "rating": "5", 
            "review": "so good to see a Sikh temple in an Arab country. I'm Sikh, and I have visited many Gudwaras (Sikh Temples).This is a beautiful purpose built temple, however the outside does not have the traditional domed roof or the \"Nishaan Sahib\" (flag pole bearing the Sikh Flag), i'm assuming this is in line with local regulations... nevertheless it is still a fully functioning temple and serves as the pulsating heart of the Sikh and wider community.I have never seen such a well planned temple, right down to the seating for the ones who cannot sit on the floor, to the bespoke carpets and the circular ceiling.Friday is the weekend and the temple tends to be packed.*GETTING THERE AND BACK: you can take a taxi, or from the Ibn Battuta Metro station, the temple volunteers run a free minibus shuttle service to the temple and back on FRIDAYS ( this is very helpful, they mostly speak Punjabi, however you can always find an English speaker)"
        }, 
        {
            "index": 8, 
            "rating": "5", 
            "review": "Beautiful. Beautiful peaceful place. Awesome Langar! must visit in Dubai, the meeting place of cultures.Feels like u are in punjab."
        }, 
        {
            "index": 9, 
            "rating": "5", 
            "review": "Stunning . This is a very beautiful Gurdwara and definitely worth a visit. A little further out so it might be worth asking your cab driver to wait for you."
        }, 
        {
            "index": 10, 
            "rating": "4", 
            "review": "Spiritual trip. This temple is situated at Jebel Ali. You can get there easily by Metro. Get down at Ibn Battutta Mall metro station and catch a cab or there is shuttle service. Apart from spiritual touch and beautiful interior decor,, what impressed me the most is their team work. The temple is open 24 hours serving unlimited free food to all. It is very crowded during weekends but still the place is well maintained, very neat and calm."
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "Wage guru!. Beautiful peaceful place. Awesome Langar! Loved the atmosphere and Gurbani. A must visit in Dubai, the meeting place of cultures"
        }, 
        {
            "index": 12, 
            "rating": "5", 
            "review": "Visit. Easy way to get there is by the metro. You can get off at the energy station and wait for the car service provided by the Gurdwara sahib to be picked up and dropped back. Must visit when you are in Dubai."
        }, 
        {
            "index": 13, 
            "rating": "5", 
            "review": "Visit to the Gurunanak temple. the temple is far from Dubai. there is no sign board to locate the temple.But once your are there, you feel you are in one of the temple in India"
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "peaceful and serenity. located around half an hour to forty minutes away from the main hussle and bussle of Dubai.\nMy wife's sister had a Sikh destination wedding in Dubai back in Feb 2016. The wedding ceremony was conducted at this Gurdwara and could not believe how calm and peaceful the ceremony was. I believe this was down to the surroundings."
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "Stunning. A beautiful experience and temple with such friendly people. The langar was exquisite, and the meditation was beautiful too.. Highly recommend to visit on a Friday where the prayer is continuous."
        }, 
        {
            "index": 16, 
            "rating": "5", 
            "review": "Great and Holy Place. Went there on a Saturday and was really charmed by the beauty of the exterior as well as the interior. It is a marvellous piece of architecture and we are very thankful to the Sheikh of Dubai to have made its construction possible.The Gurudwara is very close to several churches and gives a classic example of peaceful co-existance of the various religions."
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "Stunning. Absolutely stunning, peaceful and divine... We have visited the gudwara every time we have been to Dubai. It's beautiful and a must visit!"
        }, 
        {
            "index": 18, 
            "rating": "5", 
            "review": "Great experience . I knew nothing about Sikh religion entering the temple. I knew quite a bit leaving it. Everyone is welcome and everyone is welcome to ask questions that would be answered. This land was given to Sikhs for free to build this temple, as several other churches / places of worship in the area. Everyone was very pleasant and hospitable, answering our questions and helping us to get our heads around the religion and the place.We were kindly offered a ride twice when leaving. The place has a free kitchen where you can eat anytime from morning till late. They are open every day.Very open, very helpful and hospitable. Thank you!!!"
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "Beautiful, Grand and atmospheric. A Sikh temple is a place that welcomes one and all. It literally has 4 entrances to reinforce that all are welcome. It is a place for peace and reflection and calm. The location is about 30 mins from Dubai centre and not connected to the Metro so would recommend a Taxi. The langar was lovely and people seemed very friendly. There is information on the boards and a nice screen show in the entrance."
        }, 
        {
            "index": 20, 
            "rating": "5", 
            "review": "Undoubtedly the best place in Dubai.. You might have visited every attraction in Dubai, but your tour is incomplete without visit to Gurunanak Darbar Sikh Temple. A divine experience. Although everyone says that finding the transportation is difficult, but my travel agent (bookingsquad) arranged that for free."
        }, 
        {
            "index": 21, 
            "rating": "4", 
            "review": "GURUDWARA. A well built centrally airconditioned Sikh Gurudwara is a new attraction for Hindus. It is recently built and opened for worship papers. The langer is good and taken by thousand everyday and goes to 5000 on occasions. The Sikhs gives kar sewa . Enough parking place. Published c transport is difficult. The nearby metro is Jabeel Ali"
        }, 
        {
            "index": 22, 
            "rating": "4", 
            "review": "a blessing.. you may have visited many Sikh temples all over the world .However this one is very special cause it is in UAE. SUPERB AMBIENCE lovely decor and instant spiritual connect. A must visit for people in and around UAE and ofcourse for tourists"
        }, 
        {
            "index": 23, 
            "rating": "5", 
            "review": "Darbar at Dubai. Newly built Sikh temple. Great place to visit. It is in skirts. Getting conveyance is difficult. Little isolated and very few visitors."
        }, 
        {
            "index": 24, 
            "rating": "4", 
            "review": "Beautiful. Came here for a blessing as I went to Dubai for honeymoon.\nWas quite hard to find, taxi man was even baffled when we asked him to take us there.\nNot very busy.\nBeautifully built but wish it was easier to get to instead of going down all the side streets."
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "Jo bole so nihal sat sri akal.. One of the best Gurdawara in the world. If you want to have peace and Blessings. just visit again and again."
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "Religious Retreat. This Gurudwara has been open since January 2012 and a big relief for Temple visitors in Dubai. Although it is a bit away from the Metro station, there are feeder buses to take you here, though infrequent. There is sufficient parking for cars.The place is very clean and there is a feeling of serenity as soon as one enters the Gurudwara.Listen to the Kiran or just sit in solitude and concentrate on the Almighty."
        }, 
        {
            "index": 27, 
            "rating": "5", 
            "review": "Moving experience . Great to see a development allowed for by the ruler of UAE.Folks remember trousers or 3/4 shorts for men.Also unlike UK gurdwaras you take your socks of alongside your shoes.Really calm feeling Gurdwara."
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "Feel great in Dubai. You will feel amazing and lot of peace . it is open for all and you will feel lot of peace and find sprituality in your self as you been to that place."
        }, 
        {
            "index": 29, 
            "rating": "5", 
            "review": "Divine experience. Away from Dubai's hustle-bustle, the Gurunanak Darbar is a divine and spiritual experience. Surely a must-see for people who believe in the religion."
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Best place to visit in dubai.. One of the most serene places to visit while in dubai. The enrichment of the place is sure to get you attracted to this place and sikh community is anyways the most helping and courteous communities of the world.Make sure to visit this place. It has a beautiful structure too."
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "Such a peaceful. Was at this place when it was still under construction and was nice to return now all complete was really amazed with the architecture, looks so amazing such a peaceful place to gather your thoughts anyone wishing to visit regardless of your faith or religion all are welcomed with truly amazing people."
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "nice place. Worth to go this place... If you want to feel existence of your soul.. please go here in UAE. Also nice langar"
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "a true gem. It has beautiful vibes, and a lovely interior. There is a divine feeling when you step right in! It is open to people of all faiths and they offer meals to everyone that visits"
        }, 
        {
            "index": 34, 
            "rating": "5", 
            "review": "THIS IS A SIKH PLACE OF WORSHIP ! IT'S NOT A TOURIST ATTRACTION AND SHOULD NOT BE COMPARED TO ONE EITHER. I am dissapointed to see the poor reviews of ignorant people who think this Sikh Gurdwara is a tourist attraction. It is not, it is a holy place of worship for Sikhs . It's a beautiful serene gurdwara that is open to ALL . Its beautifully set out and the sewadars and security guard were so pleasent. We asked about why there is no Nishaan Sahib and were told it was not allowed by the Sheikh. I guess that is fair enough as Dubai is an ISLAMIC state. It is a way out to get there but its worth it it's truly beautiful."
        }, 
        {
            "index": 35, 
            "rating": "5", 
            "review": "Eternal Bliss!. A beautiful place of divinity and eternal bliss! Gurunanakji Darbar has its doors open always for all religions, caste and communities. The exteriors are done well , I liked the small step water fountains extended to the main door. As you enter, you are asked to remove shoes and cover your head as per the morals and beliefs of Sikhism. The staircase leads to the Guru Darbar on first floor where you are touched with serenity and peace. Your step on the soft lavender carpet spread meters wide leads you to the worship place that is well aired and lit with natural day light. Soft hymns sung live or recorded brings solace to your soul.Langar (vegan meal) is served during all times of day on ground floor, worshipers have their meals and even contribute their service for distributing Langar. Place is clean, hygienic and very systematically organized. Dining table is set in corners for those who find it difficult to sit on ground. Even though it’s located in JebelAli, I always find a reason to revisit it frequently. Everyone must go!"
        }, 
        {
            "index": 36, 
            "rating": "5", 
            "review": "You could be in India. I was very pleasantly surprised to see this beautiful temple, tranquil during the week but very busy at weekends. The setting is peaceful and tranquil. Brought tears to our eyes being in a gurdwara in Dubai, truly lovely experience"
        }, 
        {
            "index": 37, 
            "rating": "5", 
            "review": "Peace & calm. Visiting the darbar is so soothing and a peaceful experience. Though located in Jebel Ali, far away from heart of Dubai is a place to visit. Can get crowded on public holidays, but the crowds are in no way unpleasant."
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "Peace Calm Love Friendliness Spiritual Vibrations. I have been to the Darbar on many occasions and on each occasion I found the volunteers very helpful, humble and friendly.The atmosphere is very soothing and full of spiritual vibrations. The spiritual meal that is distributed is very healthy, nutritious and tasty. Overall, a place where one is pulled to go back again and again."
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "Beautiful. The place is really peaceful & beautiful .Langar is served which is surprisingly great .its a must visit for sure"
        }, 
        {
            "index": 40, 
            "rating": "4", 
            "review": "Spiritual Meditation. Beautiful architecture with quiet surroundings leaves you at peace when you visit the temple. It's the perfect place to meditate and pray. You can also view the spirit of service when you head down to have your meal which is prepared for thousands of people in the temple.The location is in Jebal Ali and can be reached by taxi from the Jebal Ali Metro Station."
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "Lovely architecture and peace place of worship. The gurunanak Sikh temple was mesmerising and has great architecteture. It's actually really nice and although it is placed a little away from public transport, taxis can take your there.My first attempt to visit was not successful as we really could not locate, so we went back to Dubai and the mission was to visit this temple. The best thing to do is either get the metro to IBN Buttatta mall and then ask a taxi driver to take you or a taxi from your hotel. I'd recommend the metro route as a lot to f drivers still do not kno about the template.The other main problem is there are not any cabs near by so it's best to ask the driver to wait for you, I have heard that on Fridays the temple is busier than usual and cabs are more frequent but transportation is also provided.You really couldn't walk here from IB but having said that regardless of the missions I did to visit, I'd definitely go again. Oh, and for those of you who haven't been to a Sikh temple, there is always langur provided' a blessed meal and i''d highly recommend having this. The people here were also very friendly and made us feel right at home."
        }, 
        {
            "index": 42, 
            "rating": "4", 
            "review": "Peaceful place. Visited Gurunanak Darbar Sikh Temple several times and without fail every time its a soothing and peaceful experience. spirit of service and piety pervades everywhere. Great relief from the stress of Dubai life"
        }, 
        {
            "index": 43, 
            "rating": "4", 
            "review": "Such a relaxing welcoming place. We walked into the temple and we were immediately welcomed by members of the community and told to walk around freely and have a look, they provide head scarfs for both genders and are so welcoming. A few people came up and asked if we were OK and has any questions as we probably did look a little lost on there! Such a calming atmosphere in the temple, we were offered food and drinks. As a resident of Dubai for almost 10years I had no idea it existed, I will visit again"
        }, 
        {
            "index": 44, 
            "rating": "4", 
            "review": "Culture trip in Dubai. Really nice building, great little tour and nice food too. Worth the trip out. Prayer room is wonderfully day lit and the side rooms with scriptures being used was nice to have the explanation of what and why from one of the helpers. The scriptures in the main room and it surround is stunning."
        }, 
        {
            "index": 45, 
            "rating": "5", 
            "review": "Mesmerizing, exquisite, amazing!. You can spend every weekend here, with the calming sounds in and around the Gurudwara. I love the display of lyrics of the soothing songs to the almighty and the Guru. A treat to the eyes would be to watch the GuruGranth Saheb being put to bed. Very welcoming for Sikhs and non Sikhs alike, I also love the food as it is like no other!"
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "A must visit. I think this place is definitely a must to visit. Very we'll maintained, it is an excellent religious place which is also a touristic place. Beautiful decor. Serene atmosphere. Excellent n very tasty langer (food) is served in a very hygienic way."
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "Spiritual & Peach of place. I have never visit gurudwara in India but now visited often in dubai, best thing that just not for Sikhs but open to anyone of any religion..what a beautiful place to visit.Very welcoming atmosphere. And the Langar was amazing.Highly recommend the visit"
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "Begining of our new year with darshan. We visited the temple to begin our year with the blessings of waheguru on the very 1st of January. its a recently built gurudwara little on outskirts of Dubai (I think)... its huge and beautiful. it was very well lit up and we also had langar in their big langar hall. there were buses with people visiting the gurudwara as its no less then a monument"
        }, 
        {
            "index": 49, 
            "rating": "5", 
            "review": "Gurunanank Darbar Gurdwara/ Sikh Temple. Place of worship for all regardless as instructed by divine teachings of Guru Nanak, Founder.Beautiful, peaceful and charming to the eyes. Following worship, enjoy food [Langer]together as one family. Great decision Dubai to grant permission Thanks. x"
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "Amazing . We have travelled to the UAE many times but didn't even know about the sikh temple....Not just for Sikhs but open to anyone of any religion..what a beautiful place to visit.Very welcoming atmosphere. And the Langar was amazing (vegetarian meal). Highly recommend the visit"
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "The Most modern Gurudwara. Thanks to the Sheikh of Dubai upon request of the Sikh Communities who live in Dubai and from around the world The Gurunanak Darbar Sikh Tample became an iconic pilgrimage destination for all Sikhs. The architect is one of the most beautiful. A must visit place for all Dubai visitors."
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "Peace of mind. This is prestigious site just like golden temple in Amritsar.we r proud tht in Muslim country our rulers hv allowed us to built such beautiful worship place.we r thankful to ur rulers."
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "Peace . Excellent ambience, service always the best, place of calm and peace! We go back almost every month and it's a must visit!"
        }, 
        {
            "index": 54, 
            "rating": "5", 
            "review": "Very Spiritual. I am not a Sikh but we had heard such a lot about the new Gurdwara that our entire family went for a visit. It is accessible by bus and metro and close to the Ibn Batuta Mall. Away from home its a tranquil haven for connecting with the almighty and spending some time away from the hectic work life. Commendable job done by the committee members and the Local Sikh community to maintain the grandeur of the place and the langar and seva offered.You must have the Langar there. A visit surely inculcates humility and care and compassion for fellow human beings. ."
        }, 
        {
            "index": 55, 
            "rating": "5", 
            "review": "Relaxing. Beautiful place. Calm and relaxing specially during the day.Can sit for hours an relax. Don't miss Langar prasad."
        }, 
        {
            "index": 56, 
            "rating": "5", 
            "review": "Calming experience !. It was so nice to visit a Gurudwara in Dubai, never really imagined going to one until my aunt took us there. The fragrance of the flowers in the streets leading up to the stairs for the Gurudwara and to the soothing chants playing inside, the whole experience was so calming. Though I regret not being there for the early morning prayer due to an early flight. We went at around 9 - ish in the night and even at that time there were so many people in there and there is also a small Shiv temple on the floor below the Gurudwara. It was like I was back in India !"
        }, 
        {
            "index": 57, 
            "rating": "5", 
            "review": "Totally amazing!!. This made our holiday to Dubai very memorable. Amazing Gardwara, very clean, and very helpful staff. We felt at peace, a truly amazing experience."
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "Peaceful and serene. Peaceful and serene. Take the Metro to Energy Station. There is shuttle on Friday evenings from the metro station to Guru Nanak Darbar Sahib. or take the Metro to IBN Batuta, take bus number 44. It is about 10 minutes walk from the bus stop to Guru Nanak Darbar."
        }, 
        {
            "index": 59, 
            "rating": "5", 
            "review": "A must visit for all sikhs visiting Dubai. This is the only gurdwara in Dubai so take a visit. Use the metro system and take a taxi from there for a couple of pounds."
        }, 
        {
            "index": 60, 
            "rating": "5", 
            "review": "Must Visit. The Gurunanak Darbar- Sikh temple is about 40 min away from Dubai . You can connect on the Metro and than use the feeder bus or if a group of people please call the Gurudwara and they will arrange the free pick up shuttle. Its a unique Sikh temple with a big dome which is made without pillars. Langar is served thru out the day for the devotees, Its open to all religion nationalities, dress up appropriately while visiting , else you can borrow when you reach the temple ."
        }, 
        {
            "index": 61, 
            "rating": "5", 
            "review": "Religiously peaceful. Too good temple to have some nice, calm, silent and peaceful time. construction is huge and amazing considering low sikh population there, but still its a 10 out of 10 attraction."
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "Serenity..... Gurudwara is kept so neat and clean. It is like a blessing to be there and feel eternal peace. Everyone there is so down to earth and ready to serve with a smile at lungar. Morning and evening Gurbani is so peaceful and heart touching."
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "Best Gurudwara in Dubai. Visited twice felt that i am in heaven.very clean we eat lunger also which was so tasty visit there again"
        }, 
        {
            "index": 64, 
            "rating": "5", 
            "review": "Amazing place . Best place to visit and find peace. Very friendly people. Busiest times are Friday's and Saturday's.\nLove coming here every time I come to Dubai!"
        }, 
        {
            "index": 65, 
            "rating": "5", 
            "review": "An really clam and tranquil place. Great to see different religions that are represented in this country.\nThe sikh temple is a beautiful place."
        }, 
        {
            "index": 66, 
            "rating": "5", 
            "review": "Peaceful . I am not Sikh. However, I do like to visit different religious buildings when I am in other countries. I think it is to see how they express love and respect for their religions but also because they tend to be some the most beautiful in the country. It was spacious and peaceful. Parking was easy as it was just across the road. Although it was a very windy day and so we were being pelted with sand as it was a little off the beaten path. Then we entered and all that stuff outside was a thing of the past. There was white marble, purple carpets and drapes, geometric patterns in the ceiling of the pray hall and so on. If you like to visit religious buildings in your spare time then give it a try. The people that met us were friendly and hospitable."
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "Wahe Guru ji da khalsa. This is a religious place for Sikh community however Gurudwara is open for everyone for darshan, satsang and prasad. If you are a Indian in Dubai, this is a must visit for your internal peace. Please note that your head should be covered all time when you are in premises, picture not allowed.Opening time: Plz refer their websiteParking: AvailablePrasad: For everyone"
        }, 
        {
            "index": 68, 
            "rating": "5", 
            "review": "ONE WORD - BEAUTIFUL. Peace is what you will get here apart from seeing the lovely architecture and variety of Prasads. The area near the Gurdwara might be barren but it is a must visit if you are in Dubai."
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "Peaceful place to visit. Although this Sikh Temple (Gurdwara) is outside of the main city area of Dubai it is definitely worth visiting. We took a cab out to the location on a Friday evening and we were fortunate to find a free shuttle back to our hotel, but it can be tricky in finding taxis in the area. The Gurdwara is absolutely stunning and is very tranquil, and don't leave without eating some prashaad! Hope you all enjoy your visit too! :)"
        }, 
        {
            "index": 70, 
            "rating": "5", 
            "review": "Amazing. Always have a calming, wonderful experience! Best to go in weekdays. Quiet and very calming place to pray and meditate. Food is offered free during meal time. Ample parking space is available around the Darbar. People are very courteous and guide you well when to cover your heads and enter or where to drop your shoes. "
        }, 
        {
            "index": 71, 
            "rating": "5", 
            "review": "Arena Of Peace and tranquility. We visited the temple on an early Friday morning while the Asa Di Var was being recited, The congregation at the Gurdwara recited the Gurbani along with the help of two large screens. The place is well designed with ample space for devotees for the prayers, langar, community services and the car park.The surrounding area is quite developed since my last visit in 2015.Definitely in the itenary for every visit to the UAE,"
        }, 
        {
            "index": 72, 
            "rating": "4", 
            "review": "Grace and peace, amidst the city of towering heights. I've been a Gurdwara girl since childhood, so entering the Darbar in Jebel Ali was going back to the centre for me. But even for non-hindus, if you're open to a view of the Sikh gurus and the experience of a langar, do walk in. It's a large beautiful space. Meditate in a corner, or just listen to the kirtan (devotional singing). And don't leave without eating- if not the langar (food from the communal free kitchen), then do have prasad. There's a purity in this food that comes from a dollop of devotion and love when cooking."
        }, 
        {
            "index": 73, 
            "rating": "5", 
            "review": "Do Not Walk From The Energy Metro Station!. Do Not Walk From the Metro Station because it is a walk through a barren desert. Our experience at the Sikh temple was much different than I expected but it was still amazing. We are visiting from the USA and I expected an ornate temple but it was more simple than I expected especially after seeing the Grand Mosque in Abu Dhabi. What was really cool is the people there were actually participating in their religion and you had the chance to see it in action. The director saw us confused and explained to us what was going on. They also have a free buffet style meal for everyone who comes in. No questions asked! Definitely an amazing cultural experience if you love learning."
        }, 
        {
            "index": 74, 
            "rating": "5", 
            "review": "Very nice Sikh temple. All religious places are good though. This one is also one of the best built and should be visited frequently."
        }, 
        {
            "index": 75, 
            "rating": "4", 
            "review": "Good temple for Hindus. Good temple to visit for hindus.Good location of templeGood variety of prasad available at templeGood place to visit with family"
        }, 
        {
            "index": 76, 
            "rating": "5", 
            "review": "Amazing Building. Long way from Downtown but an amazing new building which is very clean and modern. The area around needs sorting out as it is quite barren"
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "A must Visit. A must visit in Dubai ! Very peaceful and beautiful ! Great architecture, and strongly recommended !"
        }, 
        {
            "index": 78, 
            "rating": "5", 
            "review": "Beautiful Gurdwara ... must Visit !. If you are in Dubai you must visit this beautiful place of worship located near Ibn Battuta mall.You truly feel the peace in your mind when you reach this place.Always filled with devotees from morning till 8:30pm .There are 2 projectors that display / translate the mantras in different languages.Make sure to have langer which is served to all devotees throughout day till 9:00pm. Two levels of parking available at the basement of Gurudwara.If you're going by red line of Dubai metro get off at Ibn Battuta mall and take a taxi. Gurudwara has a Bus Shuttle Service to the nearest Metro Station too.I would highly recommend a visit to this Gurudwara except Fridays as its very crowded throughout that day."
        }, 
        {
            "index": 79, 
            "rating": "5", 
            "review": "Beautiful Sikh Temple. We took a cab from Atlantis hotel to the Jebel Ali area to visit this Gurdwara (Sikh temple). My dad has visited a few times so he was already aware that taxi's are difficult to find for the return journey so we asked the taxi driver to wait for us which he kindly did. Of course the meter was still running but this was not an issue for us and the cost was really not big. The journey from my hotel to Jebel Ali and a 30 minute running meter was around 50 something dirhams, obviously this doesn't include the return journey to hotel.The Gurdwara itself is beautiful and peaceful, your head must be covered and shoes removed and placed in the area provided. The main prayer hall is upstairs and a lift is available if required.You must not leave without trying the 'Prashad' this is like a sacred pudding and is always delicious!!"
        }, 
        {
            "index": 80, 
            "rating": "5", 
            "review": "Definitely worth a visit. Great architecture, providing a peaceful, spiritual sanctuary. I'd strongly recommend to Sikhs and non-Sikhs alike. Ask someone local to tell you the best days to visit. If you want to really learn and get to better understand Sikhism, this is a great place to do so. Very peaceful, very spiritual and welcoming to all visitors. Non-Sikhs, to make the most of your visit, please ask someone about dress code ahead of visiting."
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "Justifably up there with the things to do!. This Sikh Temple in the middle of nowhere is awe inspiring. The people are very friendly. It's best to go between 6-8 pm to enjoy some of the music. We had issues finding a taxi back but the security guards made sure one of the locals would drop us off to the nearest station - a warm community feel about the place. tip: be sure to have some 'langar' - food for the public, open to everyone as a symbol of the sikh relioin."
        }, 
        {
            "index": 82, 
            "rating": "4", 
            "review": "Very interesting. Beautiful decor inside the building. Mostly very busy. Free meals offered and is a must try (I feel) to complete the experience.Loved sitting inside the upper floor and listening to \"Chanting, singing and drumbeats\", felt very calm and spiritual.Be modestly dressed and respectful when visiting."
        }, 
        {
            "index": 83, 
            "rating": "5", 
            "review": "Wow amazing . Gurdwara in Dubai is so beautiful. Me and my wife went on a Friday. I would recommend if travelling to gurdwara make sure your driver waits around for you as there are no taxi nearby. The experience was amazing."
        }, 
        {
            "index": 84, 
            "rating": "5", 
            "review": "wahe guru ji ki jai. Beautiful temple in middle east country located in dubai jebel ali area. nice and clam place for all hindu."
        }, 
        {
            "index": 85, 
            "rating": "4", 
            "review": "Great !. If you want to see great gurdawara in Middle East - this is the place to visit. As you will get free vegetarian meal with chai- Indian tea latte style and you can meditate there as well. If you are taking metro-train, it is about 20 min walk from station to gurdawara. The good part is that they have complimentary shuttle service to and from train station. We didn't take the shuttle and walked with the kids which was an adventure itself."
        }, 
        {
            "index": 86, 
            "rating": "5", 
            "review": "Tranquility in a city of madness. my second visit to this fantastic Gurdwara. Great hospitality and still kept up in good condition.. well done to all."
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "Lovely Sikh temple. Outside it looks like a normal building but inside it is very beaautiful. Please be respectful. Men and women need to cover their heads and leave shoes outside but they have scarves available to wear in case you didn't have one. They serve lunch during langar. They accept donations."
        }, 
        {
            "index": 88, 
            "rating": "5", 
            "review": "Beautiful. A must visit.. On our 19th visit to this beautiful country, we had still not gone to mathadekho at the gurudwara. It was in a rather remote place, but such as hidden gem. Parking was great, very close vicinity to the metro station, and with a spectacular architecture. Our family and i had been meaning to go to this gurudwara for ages, and we regret having discover"
        }, 
        {
            "index": 89, 
            "rating": "5", 
            "review": "Amazing temple. It has to be one of the best temples I have visited. From the outside the building looks pretty normal, but once you step inside you instantly know you're in a Sikh temple. Very clean and organised. I am sure I will go there again."
        }, 
        {
            "index": 90, 
            "rating": "5", 
            "review": "worth a visit. took a day out from our 3 visit to abu dhabi to visit the gurdwara. so glad that we didtruly peaceful and inspiring visit."
        }, 
        {
            "index": 91, 
            "rating": "5", 
            "review": "So glad I visited!. I'm so glad I visited the gurdwara during our stay in Dubai. Friends and family had said to visit the gurdwara during our trip. We had to ask 3 different taxi drivers to take us there as no one knew where it was located! Finally our 3rd taxi driver knew where it was...its a 30mins taxi ride from Dubai mall...past Dubai marina as if you're travelling south and out of Dubai. It's located in a residential area. We spent a couple of hours at the gurdwara and like I mentioned - I'm so glad we came. The feeling of visiting any gurdwara is always spiritual and a blessing. We did have a problem with flagging down a taxi to return to our hotel. The security guard at the gurdwara arranged for someone to drop us off to the nearest taxi point. Yes I felt awkward however it took me back to the days where people did things out of the goodness of their hearts. The person who dropped us off ended up being from the same city as my parents back in Punjab anyway! Definitely worth a visit!"
        }, 
        {
            "index": 92, 
            "rating": "5", 
            "review": "The Finest Gurudwara. This is by far one of the best Gurudwara in terms of architecture, it really is as grand as Dubai, truly a bliss, dont miss the Langar"
        }, 
        {
            "index": 93, 
            "rating": "5", 
            "review": "Peaceful. A very peaceful and inspiring visit. We visited the Gurudwara on Saturday afternoon. After visiting the main praying hall, we were served a simple tasty meal in the hall downstairs. This meal is called langar and is served free of any cost. There is a box in case we want to make a donation towards the cost but nothing compulsory. Only requirement is to dress up decently, fully covered. Heads have to be covered with a scarf as a mark of respect."
        }, 
        {
            "index": 94, 
            "rating": "5", 
            "review": "Breath taking. Very nice Gurudhwra. Close to Ibn Al Batuta mall. Very well designed. Langar is also served regularly."
        }, 
        {
            "index": 95, 
            "rating": "5", 
            "review": "lovely. Cultural, even if you are not a sikh well worth a visit it looksa faboulous and it is...... But cover your head!"
        }, 
        {
            "index": 96, 
            "rating": "5", 
            "review": "Peaceful & Sewa oriented. The Gurudwara is like any other I have been to peaceful, sewa oriented & fulfilling. The place is a lil distance away from the metro stations & the cabbies a reluctant to go to & take you back to metro stations from this place as they get stuck in traffic. But gurudwara committee found a solution for this by starting a shuttle between Energy metro station & temple. Once inside you are take over by the beauty of this place. The Darshan & prayer offerings is very peaceful and there is no rush. All the devotees pay respect to each other. After the prayer the Karah prasad is offered and is as tasty as always & so is the langar that everyone accepts as prasad. They also have arrangements of tea & snacks post lunch for anyone who wants to have some. Alteast when we went they offered us. There is an BOB ATM for the convenience of the visitors as well. Overall the sewa ki bhawna that is the main focus in any Gurudwara is very evident at this place.Felt blessed."
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "just a short ride from Dubai Airport.... a wonderful Gurudwara .. Dhan, Dhan, Sri Guru Nanak Dev Ji. If you are flying over to India... a stop in at this new Gurudwara is a must.... we spend a day year... and l come to know of it when it was being build... and my wish was to visit it... a big thank you to the Sheikh of Dubai... cuts all ties of what people think of Muslims cuts all barriers .... what a lovely sikh community that lives in Dubai....."
        }, 
        {
            "index": 98, 
            "rating": "5", 
            "review": "Heaven on Earth. This peaceful Gurudwara is located in Jebal Ali. It is huge and has difference prayer rooms. It is so peaceful and serene. There is food being served all day here for people who come to visit."
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "Inner Peace. No Words can Describe the Feeling once inside the Gurudwaara...As a Relegious Place, Every Shrine in the World has Some Kind of Positive Energy or Inner Peace within it, The Secoond Gurudwaara in Dubai UAE after the old one in Dubai Abra, To Every Traveler in Dubai its a Must Visit to the Gurudwaara...Located Near Jabal Ali...Taxi Available from Ibn Batuta Metro Station on the Red Line of Dubai Metro...As Its far and on a remote place...commuters usually have a private car or a tourist bus...Taxis Can be Called for Returning from the Place to the Nearest Metro Station the Gurudwaara has a Bus Shutte Service to the Nearest Metrro Station Station in the Evenings..Prayers start from Early in the Morning according to the timings of Shri Harmandir Saheb also known as the Golden Temple,,,afer the prayers have been offered they serve langar known as food with Dal Roti Rice and a Sabzi Depends on the Timings...The Darbar on the First Floor has the Shrine with the HOLY BOOK known as GRANTHSAHIB...Whch is Being Read by the Sikh Priests Always..Along with a Special Place for the GRANTHSAHIB to be Kept every Day...U Can Also Do Sewa or Volunteer for the Food in Serving or Distributin...All Facilities as Services Available There Except Wifi...Seatings for Senior Citizens Etc....No More words to Express About any Religious Place Its Just One Thing GO VISIT YOURSELF and From the Begening to the End '' JOH BOLE SOHNI HAAL - SAT SRI AKAL''"
        }, 
        {
            "index": 100, 
            "rating": "4", 
            "review": "Simply Beautiful. The only gudwara in Dubai. Its really beautiful, very well maintained. Its really huge and remarkable. The feeling in the gudwara is simply awesome..."
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "Oasis of peace. There are no words that can describe the feeling you get when you are there... go around 7.30 in the evening for the evening prayers.. They will definitely take your breath away.. the \"keertan\" or the songs that they sing are so melodious that your entire day's tiredness would just vanish..."
        }, 
        {
            "index": 102, 
            "rating": "4", 
            "review": "Only Gurudwara in Dubai. This only Gurudwara in Dubai. It was just 3-4 km away from our Hotel in Dubai Marina. Visited this holy place between 10.30 a.m. to 12.00 p.m., heard Guruvani and then participate in Lungar.. The menu was so ice and hygienic. There was a a marriage function also at our visit time. There are limited option for temples and gurudwara in Dubai. You can visit this one if you have faith and spare time. However this place is inside from road and whole area is some lonely with various religion places including churches. So you have to wait for taxi or come out on main road."
        }, 
        {
            "index": 103, 
            "rating": "5", 
            "review": "Holy place - a source of inspiration for many. I have made a point to visit this holy place whenever I am in dubai. Accordingly i went there and noticed there is no change. Everything is same. The place has very encouraging environment , very neat and clean rather it is now visited by many more visitors, well disciplined and with devotion. Every one enjoys Prasad at lunger. Many people volunteered for services in good section preparing and serving devotees even many offer karseva by polishing shoes at this holy place.its very encouraging and motivating place giving assurance and consolation to devotees. It's a must and worth a visit"
        }, 
        {
            "index": 104, 
            "rating": "4", 
            "review": "Fabulous temple. Special temple, worth taking a trip to see, it is beautiful surroundings, you can feel the serene atmosphere this has and the beauty of the temple."
        }, 
        {
            "index": 105, 
            "rating": "5", 
            "review": "As a Sikh its nice 2 feel at home in the middle east. Everyone is welcome & help yourself 2 a nice warm cup of India tea. Lovely building and everyone is welcome to go in for a nice cup of warm indian tea! Nice holy place for all believers in God to visit :-)"
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "A beautiful Gurudwara, one of the best after the Golden Temple. The Gurunanak Darbar Dubai opened in Dubai in early 2012 and is a beautiful Gurudwara welcoming all worshipers. It opends at 4.30 am and is open till 9.30pm daily without closure during the day. When you enter there is a small hall where you can keep your footwear and right next to it there are wash basins to wash your hands. On the right is the hall where langar is served all day- Langar is food that is offered to all worshipers free of charge. This food is considered as God's offering to us. On the first floor is the prayer room which is huge and has separate sitting areas for men, women and families. The usual practice one follows when visiting is first you remove your shoes, wash your hands, cover your head with a safa or scarf and then head to the first floor to offer prayers. On exiting the prayer room you are offered prasad/ halwa after which you come down to the ground floor for langar. It is an extremely peaceful place and one gets peace of mind when visiting this pious place."
        }, 
        {
            "index": 107, 
            "rating": "5", 
            "review": "\"A Holy Place in Dubai\". Gurunanak Darbar Sikh Temple is a peaceful and beautiful place in Dubai. This is a great meditation place. A holy place for prayer. Devotee also served with Langaar. This place is ISO certified and really a must visit place."
        }, 
        {
            "index": 108, 
            "rating": "5", 
            "review": "Superb Sikh Temple. Visited this Sikh temple for the first time. Quite an amazing place.Very majestic architecture. On fridays over 10,000 throng this Temple. 'Langar' free lunch is served to all devotees who sit on the ground without any separation from caste , creed or social status and is considered a divine food from the Gods.All funding is through charitable voluntary donations.A must visit to people of all religions.You will feel blessed."
        }, 
        {
            "index": 109, 
            "rating": "5", 
            "review": "Peaceful. This was my first visit to a Gurudwara and I really enjoyed it. Went on a weekday and it was very pleasant. Heard it gets very busy on weekends."
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "Amazing Place, Get Peace of soul. Dear Friends,Must go to this place, I am not sure but what I have heared that king of Dubai & UAE Believe land of UAE belong to muslims no other religions will get land to make mandir, gurudwara, crurch, only muslims mosque are made on Earth. Even you visit Burdubai Madir olders mandir ( Single Mandir ) in UAE but it was made on first floor, gurdwara above it on second floor.So once you visit this place, you will feel you are in india, Hard to get public conveyence Close to Energy Metro station/Iban Batuta Metro station, But its worth than any place in Dubai.Langer is going on whole day..."
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "Beautiful Gurudwara. We visited this beautiful Gurudwara in dec 2015 while we were in Dubai for our vacations. Gurudwara is far from city and if you go by taxi it will cost you a lot, but when you reach there it is worth spending the buck."
        }, 
        {
            "index": 112, 
            "rating": "5", 
            "review": "Excellent environment in the mid of dessert. Its amazing to visit this Gurudwara specially at night and the LUNGER is amazingly yummy must visit place if you are travelling from India."
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "Wonderful Temple. The best Sikh temple I have ever seen. 1000 times better than Golden Temple. Beautifully built, certified by intertek to many international standards. We were awed by its quality in every way. A must see place."
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "Peaceful. I love going to the Gurudwara and just sitting there and listening to the Kirtans - its very peaceful, and the interiors of the Gurudwara are beautiful!"
        }, 
        {
            "index": 115, 
            "rating": "5", 
            "review": "Peaceful . What a difference in noise levels from the city centre.\nYou could hear a pin drop.\nSo peaceful and tranquil I felt an air of calmness around me.\nSuch a wonderful place to visit and a chance to view and respect other cultures."
        }, 
        {
            "index": 116, 
            "rating": "5", 
            "review": "Very tranquil and beautiful. It was a lovely experience, the Gurudwara was very beautiful, tranquil and clean. The Guru's Kirtans were on throughout the day. The langar was also served practically all day.\nIt was a special for us to visit the Gurudwara during our trip. Definitely a highlight of our trip... specially if you enjoy the holy Granth Sab."
        }, 
        {
            "index": 117, 
            "rating": "5", 
            "review": "Tranquillity and contentment. It is truly amazing to see the Gurunanak temple in Dubai and experience the serenity that it offers. After removing footwear and washing the feet, devotees are offered cloth to cover their heads and enter the prayer hall which is quite majestic and immediately provides a feeling of calmness.After offering prayers, devotees are offered nutritious food for free and it is truly moving to see the dedication and service of the people providing delicious food. From what we heard, the food is prepared and served voluntarily by devotees.This is one of the places that wont be featured in a tourist guide, but after a long day of sightseeing, it provides the perfect relaxation for both body and mind"
        }, 
        {
            "index": 118, 
            "rating": "4", 
            "review": "Spiritual & Pious. This is a very sacred and holy place known for its sanctity.They also serve food for free during prayer time and believe in total humanity."
        }, 
        {
            "index": 119, 
            "rating": "5", 
            "review": "Beautiful Gurudarbar. Loved the atmosphere, It was so soothing and nice to be at this place. Its far from city but devotees should visit this place"
        }, 
        {
            "index": 120, 
            "rating": "4", 
            "review": "The only Gurdwara in Middle East. This is primarily a place of worship for Sikhs, the only Gurudwara in the middle-east. If you are an Indian and/or a Sikh you must visit this Gurudwara just for the significance of the place and for the fact that it has come up as a symbol of intra-faith co-existence which is rare in other parts of the Arab world. Many Sikhs would be surprised that the Sikh symbolic flag - Nishan Sahib - does not flutter outside the building as is the norm elsewhere in the world. The place is serene and quite, a rare place of quiet in fast and noisy Dubai. Also, the central hall is magnificent and beautiful. Worth a visit."
        }, 
        {
            "index": 121, 
            "rating": "4", 
            "review": "Very peaceful like all Gurudarbars. Well maintained and well managed. Peaceful place like all darbars. Parking is an issue on holidays but you can find it within the area."
        }, 
        {
            "index": 122, 
            "rating": "5", 
            "review": "Awesome !!. Touching place and awesome feeling after visiting darbar sahib @ Dubai...Not enough words..wahe guru !!"
        }, 
        {
            "index": 123, 
            "rating": "5", 
            "review": "One of the best Gurudwaras. Every Gurudwara is good, but this one has some uniqueness, not only the way it is designed but also how it is operated. Very impressed, on how professionally it is managed and operated. ISO certified. Way to go. Striving to set higher standards."
        }, 
        {
            "index": 124, 
            "rating": "5", 
            "review": "Superb. Unbelievable! I happened to visit this temple at December 15 at Dubai. Amazing, such a beautiful temple is built in Dubai. It is the outskirts of Dubai. If you at Dubai and finished visiting out important and main attractions, you can surely make some time to visit this place. Worth the effort. They serve food also at the temple."
        }, 
        {
            "index": 125, 
            "rating": "5", 
            "review": "Among World Bigest Gurudwaras. Very good place .Visited on 25.12.2015 Friday, Enjoyed Weekly special kirtan programme & get langer(Free Kitchen)."
        }, 
        {
            "index": 126, 
            "rating": "5", 
            "review": "Waheguru. A beautiful, tranquil, peaceful and welcoming Sikh Temple. Like all Sikh temples, very welcoming offer guru ka langar (food), all fresh and hot. A small exhibition of ornaments given to the darbar sahib."
        }, 
        {
            "index": 127, 
            "rating": "5", 
            "review": "Serene and calm place...... away from the hustle and bustle of the city....... A true reflection of the cultural and religious heritage of UAE, where all religions are treated equal..... the place is beautifully made and gives the serene and peaceful feeling one longs for......watching the people serve selflessly and their ever welcoming nature while serving \"langar\" is humbling..... It brings you back everytime..... again and again......however, it is best to visit if you have own transportation, since it is a bit away from the main road."
        }, 
        {
            "index": 128, 
            "rating": "5", 
            "review": "Worth visiting. Peaceful place to offer prayers or just meditate. Walkable from the metro or you can take a bus (not very frequent and you still have to walk a bit) or taxi (not easily available). Friendly staff and they serve langar (food) too. Need to cover your head before you enter the prayer hall."
        }, 
        {
            "index": 129, 
            "rating": "5", 
            "review": "A Memorable Place to Visit. It was a memorable visit to the worlds ISO certified Gurudwara, Gurunank Darbar Dubai and a great experience having Langar there."
        }, 
        {
            "index": 130, 
            "rating": "3", 
            "review": "Ok but a few points to note before you go. Nice temple but note:- Awkward remote location, can get a taxi there but no taxis around when leaving.. Either note the local taxi company phone number to order a taxi, Uber one or walk down the road and take a left for the nearest train station which is called Energy and around a 15 min walk.- Cant help in the kitchens etc which is one of the things I like about Sikh Temples so that was a little disappointing but the food was delicious and the people are lovely and very generous.- We were told off a little bit for sitting at the tables and chairs and told to sit on the floor despite being with my inlaws who are in their 60's... Not sure how old you have tolook to qualify for the seating which was empty..- Was quiet when we arrived at 11am and busy at lunch so keep in mind. Would go again but not the best temple I've been to."
        }, 
        {
            "index": 131, 
            "rating": "4", 
            "review": "VERY SERENE & TRANQUIL DEVOTIONAL PLACE. As the title suggests, this GuruDwara in Jebel Ali, Dubai brings peace to the mind and soul... Soft humming in Gurumukhi resonating in the high ceiling creates a very peaceful atmosphere. As mandatory for all gurudwaras, this religious place offers FREE food to all devotees who enter the temple.\nThe architecture of the place is distinctive and impressive."
        }, 
        {
            "index": 132, 
            "rating": "5", 
            "review": "excellent place. if you are in Dubai must visit there. Amazing place and surely you feel relax once you enter in this holy place."
        }, 
        {
            "index": 133, 
            "rating": "5", 
            "review": "Visit to Guru Nanak Darbar. Brilliant experience, people working there were all volunteers, very friendly and very knowledgable."
        }, 
        {
            "index": 134, 
            "rating": "5", 
            "review": "Purely Spiritual. With the kind donation of land from the King of Dubai to the Sikh community, they have been able to build a beautiful Gurudwara - Gurunanak Darbar Sikh Temple.The utmost respect and equality this temple demands on all faiths is very humbling.The temple is purely beautiful, you stop in your tracks when entering the darbar sahib where the guru granth sahib is beautifully placed. There is a friendly atmosphere within the congregation (of all faiths) and lungar is served for those who visit.Friday is the main day of worship and you'll find 10,000 worshipers enter the temple and have lungar before they leave. If you are using the metro to visit the Gurudwara on a Friday, I recommend you get off at station 'Energy', outside the station the Gurudwara staff offer free transportation to and from the Gurdwara until 9pm. Any other day I recommend you get off at station IBN Batutta and get a taxi from outside the station. Definitely recommend you visit."
        }, 
        {
            "index": 135, 
            "rating": "5", 
            "review": "Beautiful place beautiful people. Peaceful and friendly atmosphere. It is a place of worship so please be respectful. They have homely langar and prasad. Sikhs are as always very welcoming here."
        }, 
        {
            "index": 136, 
            "rating": "4", 
            "review": "Spiritual Temple. After the visit to the Golden temple in Amritsar we were interested to revsit the Sikh temple (Gurudwala) in Dubai. Situated just after IBN Battuta mall, the temple is a nice place to resource oneself spiritually. After listening to a nice chanting prayer we went to bow to the Gurusahib- the Sacred book and then went to the main hall for the Langar- Typical Indian meal.All was very nice. On the way back stop over to IBN Battuta Mall which depicts the adventure and exploration of a valliant Sailor. Different Themes of the Mall- Andalousia,Tunisia, Egypt(the Astronomy themes),Persia,China(photo with the wrecked ship), India(photo with the Elephant). Nice combination of shopping, Culture and food."
        }, 
        {
            "index": 137, 
            "rating": "5", 
            "review": "The moment of Convergence of Divinity and eating together with Humans. The place is a divine Confluence of the Non religious Divinity spell bound with some sort of aura thats hitting directly to ones soul when converging with the divine sight and sounds of the atmosphere that prevails within this building.One of the simplistic toursist destination open to all relgions, all caste and enlightening in ones soul the spirit of one human one god one soul and no barriers.The sight of people worshipping the universe. the worshipping each other by serving food to masses is a sight f care compassion and love unconditional.the best part is food as HOT and FRESH is served vegetarian to the masses where all sit togetherin 200 - 500 at a time being served unlimited to satiate hunger and as well as to remark a sign of all are equal in eyes of lord. Thats the divine prasad or divine food.the only olace where yu see rich and pooor confluence together. the caste and castelss confluence to gether. all have a same meal. all sit together eat pray and rejoice. one of the places sure to visit and pay ones tribute to the humanity and respect to the Humanity in form of Unconditional unbiased Love."
        }, 
        {
            "index": 138, 
            "rating": "5", 
            "review": "Good to visit. Beatiful temple with easy access in jabel ali area.Ample parking space and easy to locate this temple.Like in India professional guidance inside temple.You must sit and offer prayer of choice of your time.Free food also served for devotees in a big hall"
        }, 
        {
            "index": 139, 
            "rating": "5", 
            "review": "Peaceful. I feel very peaceful in my every visit. Big hall and prayers all the time.Service is excellent with 7 stars.Food is offered all the time to the visitors with no limits.I was touched looking at the volunteers at the shoe rack stand, they will take your shoes, they will clean it and will return them with their hands. Applause !!!"
        }, 
        {
            "index": 140, 
            "rating": "5", 
            "review": "Peace.....just peace. had a lovely time visiting the Gurudwara. Was filled with immense peace and joy. THe place is amazing. Do spend quality time here and pray for your loved ones. THe prasad is amazing. they have 24 hour round the click langar seva. All seekers are blessed and served hot food with tea. Many visitors choose not to come here, but that's a mistake they make. Travel by metro to Iben Batuta and tale a taxi to gurudwara. DO VISITBe blessedCheersSandeep Jain"
        }, 
        {
            "index": 141, 
            "rating": "5", 
            "review": "Amazing experience!. Beautiful temple, well maintained and clean. They offer very nice Langar on fridays to all. Was a beautiful experience. People"
        }, 
        {
            "index": 142, 
            "rating": "5", 
            "review": "Magnificient Gurdwara in Dubai. We visited the Gurudwara on a Friday. The place is maintained very well and extremely disciplined and organised. The main shrine is so peaceful. Langaar is served for those who wish to partake in it."
        }, 
        {
            "index": 143, 
            "rating": "4", 
            "review": "peaceful. thanks to the Government of UAE for allowing Indian expatriates to built a temple in Dubai. very well made and maintained by the community here in Dubai."
        }, 
        {
            "index": 144, 
            "rating": "5", 
            "review": "Clean and Peaceful.. This place of worship is so clean.It is ideal for worship and focus.You can eat from the kitchen downstairs and know the food is prepared with love.It is simple food but tasty.I spent 1.5hrs there,it was worth it!"
        }, 
        {
            "index": 145, 
            "rating": "5", 
            "review": "Mesmerizing place. A beautiful gurudwara on way to Abu Dabhi in Jebel Ali village, a little far from the main town but a must visit"
        }, 
        {
            "index": 146, 
            "rating": "5", 
            "review": "So Beautiful and Calm. Its about 2km from Ibn Battuta Gate Mall. A taxi ride would cost you about 10aed... you might want to ask ur taxi to wait for you as not easy to flag down a taxi.. however we were lucky... walking down to road less than 5mins we had a cab coming.. :) The Gurdwara is big with a spacious darbar sahib and langar hall.. its simply beautiful.. i love it. the langgar (free food) is available for anyone and everyone... A must visit when you are in Dubai..."
        }, 
        {
            "index": 147, 
            "rating": "5", 
            "review": "Awesome Gurudwara in the Outskirts of Dubai. One of the finest Gurudwara I have seen in my International travel.A big / iconic Gurudwara in Arabian world with ample parking space, langar hall at the entrance and Prayer room at the first floor.Prayer room is attached with the meditation room and a finest relaxing place with the vibes of Guru Granth Sahib.SATNAM SHRI WAHEGURU JI !!Note : Does have a metro station nearby 1 km."
        }, 
        {
            "index": 148, 
            "rating": "4", 
            "review": "Lovely, but no taxi's!. We went to see the gurdwara and got a taxi from dubai marina. It took 15-20 minutes to get there, and we were warned before hand to keep hold of our taxi as there are no taxi's in the area. And we're glad we did.....as not sure where or how we would have got back! Lovely prayer hall inside, seen it on TV previously, a must visit for the Sikh community. Top tip: Ask your cab driver to wait!!"
        }, 
        {
            "index": 149, 
            "rating": "5", 
            "review": "Absolutely Beautiful!. I visit this Sikh Temple at least once every year I visit Dubai and it is well worth the visit. The architecture is amazing and the people here are very open and friendly to people of all faiths. I'm a Sikh, but brought along an African American friend on my visit and she enjoyed visiting the temple as well."
        }, 
        {
            "index": 150, 
            "rating": "5", 
            "review": "Stunning, Peaceful and a must visit for all when in Dubai. What a beautiful and serene place. You walk through the doors and the volunteers welcome is the start of the excellent visit. You do not have to be a Sikh to visit, all are welcome. Upon entering remove shoes and cover head (provided for all). Walk upstairs to the main temple hall, sit, relax and take in the peaceful energy of the service. We were in a rush so could not stay for communal langar (free meal) served to all that visit. They have a website which you can see the times the temple is open. Suggest you arrange for taxi to wait for you or arrange transport prior to pick you up. As you will need to walk to main road to flag a taxi. Not to easy in evening when your with young children and it's hot outside :-). As I said, this is a gem of a place and a definitely must for all to visit when in Dubai."
        }, 
        {
            "index": 151, 
            "rating": "5", 
            "review": "Beautiful. About 10 mins from the Marina area (in Jebel Ali), this is a lovely Gurdwara with an interesting internal layout. If you take a taxi to get there then I would suggest asking the driver to hang around if you do not intend to stay too long. There not much else in the vicinity so catching a taxi may prove difficult."
        }, 
        {
            "index": 152, 
            "rating": "5", 
            "review": "Beautiful!. A must see, beautiful architecture and such a peaceful place of worship. People from all walks of life toured the Sikh Temple but just make sure you have something to cover your head when you go. It's a bit of a way out of Dubai, but very close to Jabel Ali metro station which can be a more comfortable and faster trip! It's gorgeous and definitely worth the trip, it will be part of my regular visits in the future. ps: As goes with any place of worship, it would only help to do a quick wiki search on the religion so as to be respectful once going in."
        }, 
        {
            "index": 153, 
            "rating": "5", 
            "review": "Lovely.. So amazing and beautiful inside. Only issue i had was getting a Taxi after the visit. Couldnt find a Taxi anywhere so i we had to walk around to the main road for 15mins. As far as i was told, Not many taxi come to collect passengers in this area. I would advised booking a private taxi."
        }, 
        {
            "index": 154, 
            "rating": "5", 
            "review": "One of the Best Gurudwara outside India. Very Beautiful, clean , Hygienic & Peaceful place to worship. Kirtan and the Langar just increase the value by a million times to this eternal place."
        }, 
        {
            "index": 155, 
            "rating": "5", 
            "review": "An Excellant Devotional Place. if you are a Hindu/Sikh don't forget to visit Gurunanak Darbar at Jebel Ai Village. Very good community service and a very peaceful area. I am not sure whether Public transport is available for this place or not, but visitors can take metro till ibn batuta mall and from there they can hire a cab. Getting Cab is not diffficult at all. Visitors can also take Prasad, the temple is open from early morning till 9 late evening."
        }, 
        {
            "index": 156, 
            "rating": "5", 
            "review": "Vahe Guru. An awesome place that lightens your mind, body and soul. Great place to visit. Excellently done prayer hall. The Guru Granth Sahib and rendering of Kirtans are the main attractions.Of course, the biggest and best Langaar.Vahe Guru"
        }, 
        {
            "index": 157, 
            "rating": "5", 
            "review": "India Pakistan Bhai Bhai. Very near to Dubai Musiam Masjid where we can see and realise Bhai Bhai. Very calm religious Gurudwara."
        }, 
        {
            "index": 158, 
            "rating": "5", 
            "review": "Gurudwara in Dubai. The Giridwara is newly constructed Gurunanak Darbar. The Sikh Temple is in land side of the Red Metro line in Jebel Ali. The place is well maintained inspire of the crowd in weekends."
        }, 
        {
            "index": 159, 
            "rating": "5", 
            "review": "Very good peaceful place. its a nice place to visit, make you feel away from the hustle and bustle of busy Dubai. a quiet place to meditate on the Lord"
        }, 
        {
            "index": 160, 
            "rating": "5", 
            "review": "\"Peace of mind\". A very newly opend Gurunanak Darbar Sikh Temple in Jabel Ali is truly gives me a Peace of mind. Connection through Soul to God. The best feel here."
        }, 
        {
            "index": 161, 
            "rating": "5", 
            "review": "Waheguru Waheguru. Being hindu it was so great religious feeling when i had been inside the Nanak Saheb Temple. Superbly maintain."
        }, 
        {
            "index": 162, 
            "rating": "5", 
            "review": "Visit to Jabel Ali Gurudwara. Visited with my family. Very nice neat and clean Gurudwara. You feel the divine presence there. Langar was really very good"
        }, 
        {
            "index": 163, 
            "rating": "5", 
            "review": "Beautiful, peaceful temple.. Me and my husband went to visit this temple, we were based in Jumeriah Beach so this temple is a bit far out. We asked the hotel to get the taxi person to take us to the temple and wait for us and bring us back as this is a bit far out if you don't have a car. It was beautiful from the outside and from the inside it was so peaceful. make sure you are dressed appropriately. We recommend people to go this temple and experience the beauty."
        }, 
        {
            "index": 164, 
            "rating": "5", 
            "review": "Beautiful Gurdwara. Beautiful gurdwara in dubai. Need to get taxi to get here. It is near the Ibn Battuta Mall.20 mins walk to the mall."
        }, 
        {
            "index": 165, 
            "rating": "5", 
            "review": "A peaceful place..... A beautiful , peaceful place. A perfect place to meditate for visitors after a tiring day out in the sun."
        }, 
        {
            "index": 166, 
            "rating": "5", 
            "review": "A must visit... Excellent, a must visit, and ensure your dressed appropriately (no shorts). Its around 30 mins drive from Dubai city"
        }, 
        {
            "index": 167, 
            "rating": "4", 
            "review": "Gurdhwara in Dubai. Visited with friends from the UK. Had not known that it was so close to where I live. The only thing is that is high percentage of men that go due the Indian workforce in Dubai. Will go again with visitors."
        }, 
        {
            "index": 168, 
            "rating": "5", 
            "review": "Thank you. Nice, peaceful and beautiful building. I love this place. We meditated there. And we received good meal there...."
        }, 
        {
            "index": 169, 
            "rating": "4", 
            "review": "Lovely and peaceful. Its a place of worship but very well maintained. Clean and well organised the Gurunanak Darbar Sikh Temple is a great visit for Non Sikhs too. Peaceful atmosphere and soothing Singing of the \"sabads\"from the Guru Granth Sahib is lovely to listen. Langar is free for all and tasty too. Must experience."
        }, 
        {
            "index": 170, 
            "rating": "4", 
            "review": "Gurdwara in Dubai!. Visited during the wedding of a close friend. Well worth a visit for all visitors to Dubai. The decor is something to see."
        }, 
        {
            "index": 171, 
            "rating": "5", 
            "review": "Divine Place for spiritual experience. Divine Experience, must visit Gurudwara of Dubai and the world, with all required Amenities for a spiritual experience. Wahe Guru Ji Ka Khalsa Wahe Guru Ji Ki Fateh"
        }, 
        {
            "index": 172, 
            "rating": "5", 
            "review": "DO not miss it. Had a very peaceful experience in the gurudwara. The bhajans in the prayer room was out of this world."
        }, 
        {
            "index": 173, 
            "rating": "5", 
            "review": "Peace. Peaceful worship place...feels calm. Langar is served all day..service done with love..easily accessible from Sheikh Zayed, plenty of parking."
        }, 
        {
            "index": 174, 
            "rating": "5", 
            "review": "Dont miss it.. Very beautiful and such a lovely experience since I wasn't familar with the Sikh faith. The architecture is totally amazing."
        }, 
        {
            "index": 175, 
            "rating": "5", 
            "review": "must visit for all indians. gods own place..reminds me of back home when i come here.selfless serving and amazing ambience. peace rules"
        }, 
        {
            "index": 176, 
            "rating": "5", 
            "review": "Mann ki Shanti. A very peaceful and divine atmosphere awaits you within the big temple complex. Be sure to have traditional Langar in the premises which is served with utmost Seva Bhav."
        }, 
        {
            "index": 177, 
            "rating": "5", 
            "review": "Very peaceful. Very clean, peaceful and serene. Lifts available and head scarfs for for both men and women. Plenty of parking available."
        }, 
        {
            "index": 178, 
            "rating": "4", 
            "review": "A very good way to start your excursion trip having it as the first destination.. Close to Jebel Ali port, the temple is well constructed inside and out. Went during the day time. The langar was very tasty. Not that we were in for that :). Langar for all who are not familiar with the word is what is served as food as god blessings for people who visit the temple and sit for it. It's not a compulsion however to sit for it. Langar is served on the ground floor and the darbaar in on the first floor. The darbaar sitting area was huge and fully carpeted. It was very well maintained and neat and clean. The colours used are very soothing and apt for the meditative experience. A very good experience to start the day off."
        }, 
        {
            "index": 179, 
            "rating": "5", 
            "review": "Beautiful gurdwara, but ensure travel is pre-arranged. The Guru Nanak Darbar is beautiful, and peaceful Gurdwara. Recommended for anyone visiting Dubai.Word of warning... The temple is off the main roads, in a somewhat remote location. If you are visiting ensure you have return travel pre-arranged. My wife and I took a taxi to the temple, but if it wasn't for a kind individual, who dropped us to the closest taxi rank, would have been stuck there for some time. Apparently the temple do some form of mini bus shuttle service, but must be pre-arranged with the temple directly."
        }, 
        {
            "index": 180, 
            "rating": "5", 
            "review": "A Haven for Tranquillity and Peace. The Gurunanak Darbar happens to be one of the few places where you can go and find inner peace. The lovely Main darbar offers tranquil shabad all throughout the day and then there are inner rooms where you can meditate in peace or read spiritual text.For those who seek inner peace and tranquillity there is no better place and what's best is that people from any religion, nationality and cast can freely come by and will be welcomed.Must visit in case you really want to experience the Multi Cultural side of Dubai at its best."
        }, 
        {
            "index": 181, 
            "rating": "5", 
            "review": "Guru Nanak darbar\" peaceful and serene. Dubai is really a blend of cultures from across the world .The Gurunanak darbar in Jebel Ali is a beautiful Sikh temple, very peaceful and serene."
        }, 
        {
            "index": 182, 
            "rating": "5", 
            "review": "Sat Shri Akal ji. Sat Shriakal...... Peaceful, Graceful, and the best place in Dubai along with the Temple in Bur Dubai + Jebel Ali to relax and unwind your mind n heart in the company of Wahe Guruji and Shri Sai Baba, Shri Ram and Shree Hanuman :)"
        }, 
        {
            "index": 183, 
            "rating": "4", 
            "review": "Get some time off for some solitude time.. It's always nice to visit Gurudwaras abroad. Slightly hard to find but well worth a visit.Brings inner peace, serenity and spiritual understanding."
        }, 
        {
            "index": 184, 
            "rating": "5", 
            "review": "Beautiful and very well maintained sacred place. This Gurudwara entertains people from all region and if you are true believer in Guru nanak ji, then you must visit this place when in Dubai. The langar here is so refreshing and the purity of this place makes u love it."
        }, 
        {
            "index": 185, 
            "rating": "5", 
            "review": "Very Peaceful. Amazing Architecture. Very Peaceful. The management is also fantastic. Its very busy on the weekends (friday and saturday)"
        }, 
        {
            "index": 186, 
            "rating": "5", 
            "review": "Peace. Visit anytime and you will find peace.. the setup is vibrant and there is a positive vibe.. they serve food or snacks depending on the time of visit.. the food is pure and filling.. the kanav prasad which is a delicacy of Sikh temples is out of this world. The experience is so pure and peaceful.. My husband and I try to visit every month atleast.. They except donations in terms of food supplies..and feed anyone who visits them.. a very good place and a very good cause."
        }, 
        {
            "index": 187, 
            "rating": "5", 
            "review": "Religius. I was surprised to hear that Sikh temple in dubai first time when i heard thane make plan to go thare . it was great please whare people remember even they are in another country . Specially thanks to Dubai government for permitiing Sikh temple."
        }, 
        {
            "index": 188, 
            "rating": "5", 
            "review": "Gurunanak Darbar Sikh Temple Superb. jo bole so nihal sat sri akal a must to check out how superbly this temple is been built in Dubai UAE first of it's kind allowed"
        }, 
        {
            "index": 189, 
            "rating": "5", 
            "review": "Beautiful. Of course this is still being built but what a beautiful building. Peaceful and the interior has elements of arabic and indian design. It is located on the outskirts and we got a taxi and it is next to other places of worship."
        }, 
        {
            "index": 190, 
            "rating": "5", 
            "review": "Do not consider your travel to Dubai as complete without offering prayers here. Guru Nanak Sahib Mandir at Jebel Ali, Dubai :It is difficult to describe your feelings when you gaze at this magnificent religious structure in a desert area outside the city and enter its hallowed precincts . The atmosphere is so ethereal, so awesome , like nothing that I have ever experienced before. The stained glasses, the exquisite woodwork , the superb chandeliers and above all spotlessly clean premises take your breath away. In pics : a) The entrance to the Gurudwara b) the free \" langar\" for all visitors; c) the vegetarian meal, comprising of salads, chapatties, sweet rice, aloo gobhi and masoor ki dal, with kheer, served on a clean disposable plate by \" sewadars\" .Jo bole so Nihal, Sat Sri Akal . I will make sure that I visit this place again, before returning to my home country ."
        }, 
        {
            "index": 191, 
            "rating": "5", 
            "review": "Beautiful Gurudwara, must see.. Beautiful Gurudwara. Probably the best one outside of India. Amazing structure, and absolutely huge inside. Amazing."
        }, 
        {
            "index": 192, 
            "rating": "5", 
            "review": "Spiritual Serenity. Being at the Gurunanak Darbar Sikh Temple, brings a certain inner peace, serenity and spiritual understanding. The most hygienic food areas are found here where everyone voluntarily does their parts. Listening to the hymns and prayers brings that harmony and solace to the confused mind. Many answers to problems found here by just being there both physically and mentally. It takes a person to a very high spiritual level altogether."
        }, 
        {
            "index": 193, 
            "rating": "5", 
            "review": "An oasis of peace in the hectic city. Such a tranquil place - open to all.Please see this youtube channel to find out more about the Sikh way of life and enhance your understanding when you visit: https://www.youtube.com/user/basicsofsikhi"
        }, 
        {
            "index": 194, 
            "rating": "5", 
            "review": "Worth a Visit. As a Sikh, it's always nice to visit Gurudwaras abroad. Slightly hard to find but well worth a visit."
        }, 
        {
            "index": 195, 
            "rating": "5", 
            "review": "Religious place. This is a beautiful religious building in Jebel Ali..A few minutes walk or bus ride from IBN Batuta Metro Station.... This place gets crowded on sunday though so plan your visit accordingly."
        }, 
        {
            "index": 196, 
            "rating": "5", 
            "review": "Amazing-. We visited on a recent visit. Absolutely fantasticA lot thought, effort and money has gone into this and is a credit to the community for doing so- Thanks to the Sheik for allowing this in Dubai"
        }, 
        {
            "index": 197, 
            "rating": "5", 
            "review": "Amazing!!!. Visit mainly on a Friday and it's usually quite busy. Beautiful gurdwara and amazing architecture. Highly recommend."
        }, 
        {
            "index": 198, 
            "rating": "2", 
            "review": "Tourist tat!. It's a tourist trap, a shopping centre. Nothing special and it's all modern and false. Full of overpriced tourist tat."
        }, 
        {
            "index": 199, 
            "rating": "5", 
            "review": "Gurudwara Sahab Visit. We go there every month at least. Such a divine feeling. Evening Kirtan is so soulful. Feels like home there."
        }, 
        {
            "index": 200, 
            "rating": "5", 
            "review": "Devotion in Dubai. Very nicely built Gurunanak Darbar Sahib at Dubai. It gives a look of modern architecture, Different from Sikh temples in india. Once you get in you feel like you are Back in India. Full of Devotion. This is located at a common place where you will find hindu temple, church as well."
        }, 
        {
            "index": 201, 
            "rating": "5", 
            "review": "Divine . Very divine peaceful. Well maintained. Langar was plentiful. It's in jabeel Ali which and near lbn mall."
        }, 
        {
            "index": 202, 
            "rating": "5", 
            "review": "Very generous kitchen - Sikh worship temple. i have not been there, maybe cos of my religion beliefs. but read a lot and people tell me.. its a big and beautiful temple.. by the big and wealthy Sikh community in Dubai. the kitchens are always open and free food for all people is being served. very tasty and delicious indian food and sweets. a must see"
        }, 
        {
            "index": 203, 
            "rating": "5", 
            "review": "Beautiful Sikh Gurdwara. Spent my 40th birthday here, such a special place. A lovely place to visit......the design is beautiful."
        }, 
        {
            "index": 204, 
            "rating": "5", 
            "review": "Gurunanak Darbar temple- dubai. Very happy to see Gurunanak Darbar temple in dubai. its open for all communities, excellent hospitality , great ambiance , feel like seating for long , kids will be doing seva is presents a cultures. must visit place fro a hindu you will feel like you are back to home our India or feel like blessings is with you in Dubai"
        }, 
        {
            "index": 205, 
            "rating": "5", 
            "review": "very pretty. I did not see it as a tourist attraction but loved.A very relaxing visit. Superbly designed and constructed by the local sikh community. Excellent hospitality."
        }, 
        {
            "index": 206, 
            "rating": "5", 
            "review": "Humbling . A warm welcome is extended to all. Providing you are dressed appropriately and act respectively you are allowed to enter this religious site.It's beautiful inside and out. You cannot help but get a feeling of peace. I felt, in a silly way, purified.Well worth a visit no matter what your religious persuasion may be"
        }, 
        {
            "index": 207, 
            "rating": "5", 
            "review": "Peace is spread. Open for all communities, excellent hospitality , Peaceful ambiance , Once entered feel like seating for long , kids will be doing seva is presents a cultures."
        }, 
        {
            "index": 208, 
            "rating": "4", 
            "review": "Gurnanak. Very nice hospitality with great humanity. Very humbled visiting this great Gurunanl Darbar Sikh Temple....."
        }, 
        {
            "index": 209, 
            "rating": "4", 
            "review": "Nice Gurdwara, not sure it is a tourist site though.. This is a practicing Gurdwara with many local devotees attending. As a sikh family on holiday in Dubai we made a visit as we were saying close by. The directions on their web site were good but could be improved as our taxi driver still got losr when close by. I would not describe this as a general tourist attraction unless you of a religious persuasion. The Gurdwara was was very welcoming, with spotting that we were obvious visitors and pointing us in the right direction. We stayed for a couple of couple of hours and really enjoyed the langar. There is nothings else close by, although there was the jebel ali mall which we did not visit."
        }, 
        {
            "index": 210, 
            "rating": "4", 
            "review": "Peace!!. What a beautiful place of worship. You are totally at peace if you just close your eyes and sit here for a while. Definitely worth a visit."
        }, 
        {
            "index": 211, 
            "rating": "5", 
            "review": "GURUNANEK SIKH TEMPLE - DUBAI. One of the moost peaceful sikh temples i have visited and prayed in and been blessed in. A must for the traveller with a discerning eye for architecture. The delicious food is served on a daily basis and to over 3000 people on auspicious days. a must on the next visit to Dubai."
        }, 
        {
            "index": 212, 
            "rating": "5", 
            "review": "Excellent . A very relaxing visit. Superbly designed and constructed by the local sikh community. Excellent hospitality."
        }, 
        {
            "index": 213, 
            "rating": "5", 
            "review": "Worth a Visit. I along with my family visited this religious place and felt very delighted to see this Gurudwara Saheb at Dubai. Very well maintained."
        }, 
        {
            "index": 214, 
            "rating": "4", 
            "review": "peace !. wow! this was something amazing! a beautiful temple in dubai! u must visit here for peace ! also try the food"
        }, 
        {
            "index": 215, 
            "rating": "5", 
            "review": "...WOW....... The Gurdwara is an architectural masterpiece. The whole ambience of the place was amazing... We paid our respects and listened to Kirtan and had parshad.... Overall a truly wonderful experience...... WAHEGURU JI KI FATEH WAHEGURU JI KA KHALSA....."
        }, 
        {
            "index": 216, 
            "rating": "4", 
            "review": "Amazing peaceful holy place. Was totally amazed to see this gurudwara in Dubai. Its a huge place. With langar. worship place on top. Its so good to see something like this being away from home. well kept. and you really feel the peace and harmony when you are there. you must visit."
        }, 
        {
            "index": 217, 
            "rating": "5", 
            "review": "Gurudwara visit. I had langar at the Gurudwara.Excellent cleanliness and upkeep ,serene and peaceful.Amazing experience"
        }, 
        {
            "index": 218, 
            "rating": "5", 
            "review": "Goddest Temple. Growth of Dubai · Economy of Dubai · Sikhs in Dubai · SIKHISM · Origin of Sikhism · Intro of sikh ... GURUNANAK DARBAR\nIts mind Blowing Look of Sikh Temple Wd lot of peaceful Place one Ever visited Awesome Like iT"
        }, 
        {
            "index": 219, 
            "rating": "4", 
            "review": "Peaceful. Nice & peaceful place to visit. Something different in Dubai & great to see there. You can see it from the metro line. If you're going by metro get off at Ibn Batutta, not energy even though it's a bit nearer, because you then need to get a taxi. It's too far to walk when it's very hot and you can get a taxi from Ibn Batutta metro station. On the way back we were lucky to leave at the same time a minibus was leaving the gurdwara so they gave us a free ride to the metro :) My partner is Arab but people kept thinking he was Indian and speaking to him in Punjabi....it was quite funny, he didn't understand a thing. We didn't have time to stay & eat there, but would have if we had the time. And hopefully been able to speak to more people there. This is a little far out from the centre of Dubai so if you're a tourist I'd recommended visiting Ibn Batutta Mall at the same time."
        }, 
        {
            "index": 220, 
            "rating": "5", 
            "review": "Chardikala. Overwhelmed by the architecture and sewa provided by sikh friends at this holy temple - no words to express, being in UAE and follwing our religious prayers everyday"
        }, 
        {
            "index": 221, 
            "rating": "5", 
            "review": "Best Gurdwara ever seen. Plan, Architecture, Discipline, Arrangements etc. everything was excellent. Location was inconvenient. No taxi on return. Problem solved as transport provided by Gurdwara people."
        }, 
        {
            "index": 222, 
            "rating": "5", 
            "review": "Singh is king. Awsume place.. to visit .the place where induan can feel the feeling of own country...waheguru ji ka khalsa waheguru ji fateh"
        }, 
        {
            "index": 223, 
            "rating": "5", 
            "review": "A special place to visit in Dubai. When you tired from shopping malls and luxury hotels this is the best place to see as a special place to visit in Dubai"
        }, 
        {
            "index": 224, 
            "rating": "3", 
            "review": "Have Some Peace.. Got surprised by looking it , after long time staying in Dubai i came to know there is a big gurudwara situated in jebel ali."
        }, 
        {
            "index": 225, 
            "rating": "5", 
            "review": "Great experience - although make sure you book a return taxi. We really enjoyed our visit to Guru Nanak Darbar - beautiful place and a very enriching experience. We also had the langar (gurudwara meal) which was delicious. The only trouble we faced was related to the commute. The Gurudwara is located far away and we took a cab to reach there. We asked the same guy to pick us up after a while but when we came out he wasn't there. We had to wait 20-30 mins before another taxi arrived. It might just have been a particular day but I would advise arranging your transport prior to visiting."
        }, 
        {
            "index": 226, 
            "rating": "5", 
            "review": "Absolutely stunning. The entire Gurdwara / Sikh Temple is beautiful on the inside and out. It's quite a distance away from the metro station so better to get a bus/taxi. However metro services stop on Friday afternoons for prayer & fridays are the days at which the gurdwara is most busy. I recommend going on a Friday to sit and relax listening to gurbani/Kirtan/katha with the sangat."
        }, 
        {
            "index": 227, 
            "rating": "4", 
            "review": "An Oasis of Calm!. It is at about 20 mins walk from the Energy Metro Station. There is a bus that drops you off near the Gurudwara too. The place is simple but beautiful! Do visit if you have some time!"
        }, 
        {
            "index": 228, 
            "rating": "5", 
            "review": "Halwa. Peace and tranquility! Must try halwa and langar. They pack it also. Please try to give sewa or dan."
        }, 
        {
            "index": 229, 
            "rating": "5", 
            "review": "Peace of mind. The Sikh Gurudwara temple is the place where all faith believers are welcome with open arms The Sikh community serves all who visit the place at all times the LANGAR food which is vegetarian and delicious. On weekend five thousand devotees visit here.On first floor is the SATSANG and POOJA where poetry and prayers in memory of GURU and praise of AL MIGHTY is done.All you get is peace of mind.Reminds you of love and care one can get in SECULAR DUBAII love Dubai"
        }, 
        {
            "index": 230, 
            "rating": "5", 
            "review": "The oly temple in Middle east. Great place. Peaceful ambiance. We can see Lord Shiva Bhagvan, Sai Baba, Gura Nanak over here. Gift for Hindus who stay around in UAE.. Thanks to Great Ruler of UAE.."
        }, 
        {
            "index": 231, 
            "rating": "5", 
            "review": "SatSriAkal. A must visit place not only for Hindus but for anyone looking for peace n tranquility. Sri darbar sahib, the shabds in the background and the atmosphere of the place is so peaceful that we don't feel like coming back from there."
        }, 
        {
            "index": 232, 
            "rating": "5", 
            "review": "Religious place. Great place for praying ....Good Prasad .. Atta Halwa was very nice . Great for Sikhs to pray . It's location is very nice"
        }, 
        {
            "index": 233, 
            "rating": "5", 
            "review": "Peace and Tranquility from all the Hustle and Bustle. SatSriAkal to all my readers. I had visited Dubai for work last week. My Manager in Dubai said we must go to this Gurudwara for some time in between all the meetings we had. This is an amazing architectural building and I have not seen such an organized and well managed clean place of worship in my life. The main prayer hall is huge and they have bhajans at times. I had the privilege to be a part of one session. The langar or the free meal is a delight to have and hats off to the entire community to do this for all humans. Really heart warming and pleasing people too. Please maintain the decorum when there and also wear appropriate clothing if not they will provide the head gear to cover up the head alone. Ample parking as well. 10 on 10 for this place of worship and I will truly visit again when in Dubai."
        }, 
        {
            "index": 234, 
            "rating": "5", 
            "review": "Temple. If you are seeking somewhere spiritual other than a mosque you can find peace in Dubai. Fridays can get very busy must avoid"
        }, 
        {
            "index": 235, 
            "rating": "5", 
            "review": "Great. The Ruler of Dubai,Vice President and Prime Minister of UAE, has given a permission to built a Hindu Temple is a really shows the kind heart. Like other places, the UAE has a cultural understanding and respecting other believes. Great Leader in this Century ."
        }, 
        {
            "index": 236, 
            "rating": "4", 
            "review": "Sikh Holy Temple. This is perhaps the only Sikh Temple in Dubai. As this is a Sikh Temple, it has a religious significance to them. Most of them will go to the temple on their day off or on special occasions. Exactly what Sikh's do in a Sikh Temple is exactly what other people do when they visit their respective religious institutions, mosques or churches or synagogues etc. However, one thing which is unique about Sikh Temples is that there is always a communal meal available to anyone at appropriate meal times at a Sikh Temple. This communal meal is called \"Langer\" and is taken while seated on the floor. Everybody sits together as an equal, and shares the same food. There is no distinction of any class or status. The food is all prepared by volunteers from the community, and anyone can participate. Food items are also donated by the community, in whatever quantity you please. There is absolutely no compulsion, but only that no alcohol and meat is to be brought in. The whole operation of preparing the food, serving, and cleaning etc is all carried by volunteers with no compulsion."
        }, 
        {
            "index": 237, 
            "rating": "5", 
            "review": "Satnam Waheguru. The feeling cannot be described in words. The Gurunanak Darbar is an architectural distinctive structure located in the 25,400 square feet plot in Jebel Ali, Dubai, along Sheikh Zayed road connecting Dubai. one must visit and seek the blessings of waheguru ji."
        }, 
        {
            "index": 238, 
            "rating": "5", 
            "review": "Beautiful. It's a wee bit far from the city centre, but totally worth the trip. Beautiful to look at, wonderfully maintained and the langar (free meals) are quite tasty as well. My parents were supremely pleased that we visited this Gurudwara."
        }, 
        {
            "index": 239, 
            "rating": "5", 
            "review": "Guru Nanak Darbar Sikh Temple. This Sikh Worshipping Place in the Middle East is a HEAVEN to visit. The building in itself is very serene and godly. The religious place holds free kitchen with vegetarian meals any time for any visitors. There is a lovely arrangement for everything in a peaceful and calm manner. one must wear covered sleeves and legs outfit to maintain the respect and covering head is must.There are long scarves and head covers available at the entrance if you dont have one.the main hall in itself with the Holy Book to which the Sikhs call and respect as a living Guru.It is a must visit.xx"
        }, 
        {
            "index": 240, 
            "rating": "5", 
            "review": "So Serene. So peaceful, so serene...and the 'langaar food' (especially the daal and the masala chai) is literally to die for. And if you forgotten to cover head, you can borrow as dupatta or scarf at the reception, just make sure to return it."
        }, 
        {
            "index": 241, 
            "rating": "5", 
            "review": "Ek Onkar. First of all I would like to thank the Dubai government for allowing this Beautiful Gurdwara to be built in their city.\nour visit was on Friday and to my amazement it was packed with the sangat which was pleasing to see. we were please that we had the opportunity to visit this Waheguru Ji house"
        }, 
        {
            "index": 242, 
            "rating": "5", 
            "review": "Religious place in sikh. its very peace full place to visit it has been the temple of sikh religion guru nanak guru gobind singh and this temple is one of the biggest temple in dubai and they offer Langar ..which means prasad of god and this langar goes on continuously and every one must eat the langar if possible as this is auspicious very peacefull"
        }, 
        {
            "index": 243, 
            "rating": "5", 
            "review": "Was waiting to post a fantastic review. Very well maintained. Very peaceful and clean. Overall a very nice place to worship for the Punjabi's and Non-Punjabi's like me also .... Prayers have no obstacles and no boundaries"
        }, 
        {
            "index": 244, 
            "rating": "5", 
            "review": "Sikhs worship place. The gurudwara sahib or you can say the sikhs worship place is soooo beautiful.. It interiors and exteriors are both beautifully designed.. Thanks to the government of dubai for letting sikhs to build a worship place of there own.. Gurudwara sahib is the only place which welcome people of all caste class creed and have a common kitchen which we call langar hall provides meals whole day to everyone.. The gurudwara provide shuttle service to nearest metro station that is ibn batuta as its little far from the city so taxis are difficult to get so they provide shuttle services to the visitors..its so peaceful and indeed beautiful and a must visit place"
        }, 
        {
            "index": 245, 
            "rating": "4", 
            "review": "temple. It was surprising to find such a holy place in Dubai and that is quiite nearby the hotel at walking distance. Spending evening there and have a prasad is worth"
        }, 
        {
            "index": 246, 
            "rating": "5", 
            "review": "good for indian. good place for indian to viset n holday long langar is on so u get chhola bhatura to dat as parsadi n ceen n nice place but it is very far from city it is at IBN BATTUTA matro station so u can go by merto pl indian definatly visit once if u r in dubai tour"
        }, 
        {
            "index": 247, 
            "rating": "5", 
            "review": "Amazing Experience.. Loved this Place totally.A treat to your Mind & Soul.The Gurudwara is Huge, Excellent Interiors. You would feel Relaxed once you enter this Place.They do serve langar throughout."
        }, 
        {
            "index": 248, 
            "rating": "5", 
            "review": "Unforgettable visit !!!!!!!!!. Was surprised to see a Gurunanak Darbar in Dubai. Darbar is so impressive as the religion. We are happy to see Dubai thinking towards different religion. The atmosphere is so beautiful. Best time of visit would b between 6-7 (during prayer). People of all religion are allowed."
        }, 
        {
            "index": 249, 
            "rating": "5", 
            "review": "AMAZING. an absolute must... well worth seeing.. amazing gurdwara (cost approx £20 return trip in cab from JBR with driver waiting)"
        }, 
        {
            "index": 250, 
            "rating": "5", 
            "review": "Peaceful. A nice peaceful Darbar, with lot of positive vibrations. A good replication of the Sikh Darbar, Langar is served through out the day."
        }, 
        {
            "index": 251, 
            "rating": "5", 
            "review": "plesent piece of religion. Was surprised to see a Gurunanak Darbar in Dubai. The building is as impressive as the religion. I am happy to see Dubai liberal thinking towards different religion. The building & atmosphere is beautiful. Best time of visit would b between 6-7 (during prayer). People of all religion are allowed."
        }, 
        {
            "index": 252, 
            "rating": "5", 
            "review": "Great . It's good to see religious diversity. It very well constructed and it was good for me to visit this place. Since I visited few more religious place in my recent trip so it was good to see construction wonder in Dubai. So check this place once too be it due to religion or overall diversity."
        }, 
        {
            "index": 253, 
            "rating": "5", 
            "review": "Wonderful experience. Gurdwara is near Jebali district, not near Dubai city centre, so be prepared for 30 min travel. Langar is served in disposables. The Kerman was performed by two great jathas in evening."
        }, 
        {
            "index": 254, 
            "rating": "5", 
            "review": "Very Beautiful!!. Its a very large Gurudwara and is beautifully crafted and constructed. Its a must see for Sikh followers. Its located quite far from the City."
        }, 
        {
            "index": 255, 
            "rating": "5", 
            "review": "Holy visit. Doesn't look like a Gurdwara from the outside.Plain simple new structure but inside its really nice well organised.Walk up first floor..remove your footwear nice washrooms next to it.Enter the main Dunbar hall. High ceilings chill air conditioning...sit down for a few minutes shut eyes & feel the peaceful calm. Go next hall to eat a really tasty free Langar or Prasad. Served by volunteers everything is neat & hygienic. Don't forget to drop some donation in the box. Happy I went."
        }, 
        {
            "index": 256, 
            "rating": "5", 
            "review": "Beautiful, welcoming Oasis in the Dubai Heat. Beautiful building, easily accessible and people inside were inviting. It was peaceful in the main prayer hall, air-conditioned and sheltering blinds draw down when the sun is beating down. The langar (community meal) was fulfilling. We've signed up for their up-dates and will be visiting on our return to Dubai. "
        }, 
        {
            "index": 257, 
            "rating": "5", 
            "review": "Mental Peace. After so much chaotic & hectic tours of dubai, must visit there for eternal peace near to ibn batuta metro station & mall. Got taxi easily from metro station but while coming back need to wait for 15- 20 minutes for taxi as it is 20 minutes of wall but I have gone in @ 11 a.m & it was too hot to walk.SATNAAM WAHEGURU"
        }, 
        {
            "index": 258, 
            "rating": "5", 
            "review": "Satnaam wahe Guru. If you are an Indian or follower of Sikh religion and in Dubai, you must visit this place for inner peace.This Gurudwara is in Jebel Ali, I recommend to use GPS other you will get confuse.Parking: Ample parking availablePrasad: Don't forget to do seva and also take prasad. I also heard they serve prasad (widely known as langar)"
        }, 
        {
            "index": 259, 
            "rating": "5", 
            "review": "Peaceful ...... Wonderful place, calm your senses and increase bonding to almighty. Likes devine music and eat at Langar... Worth to visit.."
        }, 
        {
            "index": 260, 
            "rating": "5", 
            "review": "Guru Nanak Darbar Gurdwara. Ive visited this place during Nov, 2014 and really impressed by the architect/design & state of the art building. The land for this Gurdwara was donated by the local Sheikh of Dubai but it was not that easy. Local sikhs made v good efforts to translate the Guru Granth Sahib ji to him. After that he was convinced that Sikhism is for all not just sikh community and also they made him understood that it talks about only ONE Supreme GOD.This place was opened in Jan,2012. Nearest Metro : Energy Metro station (2kms walk to Gurdwara )It is located in Jebel Ali, near highway which connects Dubai to Abu Dhabi.While driving on Shekih Zayed Road, take Exit 25/Interchange No.6, R/A right, at Dead end left, First right behind Jebel Ali Hospital, First right again, straight on the left is the Gurudwara.FREE KITCHEN for all visitors as usual in all Gurdwaras globally."
        }, 
        {
            "index": 261, 
            "rating": "5", 
            "review": "holy god. been to this temple An amazing calmness a peacefull feeling my family and me were speechless during the hyms sung by the priests , had a lovely food which is catered every day 4 times to uncountable people every day very good spititual feeling, i rate this visit above all in dubai"
        }, 
        {
            "index": 262, 
            "rating": "5", 
            "review": "Heaven on Earth. We went to this Gurudwara in Jan 2015 and it was such a nice experience as it was situated 14 kms from Marina area but was so beautiful.We had Langar Parshad also and felt like we were near to India again.Gurudwara has a big parking below it and other facilities.One who visits Dubai should surely go to the Gurudwara.Thank you all"
        }, 
        {
            "index": 263, 
            "rating": "5", 
            "review": "Home of Serenity. This has been one of the most enrich experience in Dubai. I have never been to any Sikh Temple before, but this place felt like a Sanctuary. It is very beautiful and full of courteous and helpful people.You must experience this at least once to feel the grandeur of Peace."
        }, 
        {
            "index": 264, 
            "rating": "5", 
            "review": "wow. it was just wow a so so so beautiful gurudwara in dubai, it was awesome, the langar was very goood. must have some better transport connectivity"
        }, 
        {
            "index": 265, 
            "rating": "5", 
            "review": "Peace and serenity. Visit this wonderful temple for a spiritual and peaceful experience. In a city full of activity this wonderful temple is a place of peace and relaxation."
        }, 
        {
            "index": 266, 
            "rating": "5", 
            "review": "Amazing architecture, Awesome langar :). This sikh religious temple or Gurudwara as its called, welcomes one and all. Its architecture is amazing where the main hall is made without any support of pillars. All the function details etc can be found on their site : http://gurudwaradubai.com/ Just see this video ull kno more abt gurudwara. https://www.youtube.com/watch?v=isjf71j1-Xg"
        }, 
        {
            "index": 267, 
            "rating": "5", 
            "review": "Peace & senerenity. Gurudwaras give you that sense of peace & this is no exception. Kudos to the people behind managing this place so well and the wonderful langaar that everyone across religions are served through...definitely a must visit"
        }, 
        {
            "index": 268, 
            "rating": "4", 
            "review": "sikh temple in Dubai. Gurunanak darbar in Bur Dubai maintained by sikhs of Dubai this is the first time i have gone to any sikh Darbar and i feel blessed for being there please ensure keep a cloth on your head before entering the darbar after having the darshan you are given puri chole as prasad"
        }, 
        {
            "index": 269, 
            "rating": "5", 
            "review": "Well Planned and developed with customs and modern needs. I visited the gurudwara on a friday morning, and being a holidaym there were many visitors and to did not make me feel I am away from the country and seemed like a gurudwara in Punjab.There is Langar seva done for every visitor which is very good and recommened if your a religious person looking for some classic example of keeping your religious customs in mind while designing it in a modern way."
        }, 
        {
            "index": 270, 
            "rating": "5", 
            "review": "No simple words can explain the feeling. the words are too small to explain the feeling you get when you visit a place like this. It is one of those moments when you forget all your worries and problems as it is so calm and warm in there. The place is buzzing still you can not hear any noise as you are so immersed in the feeling of a warm hug.The best place for us when we are feeling happy or sad."
        }, 
        {
            "index": 271, 
            "rating": "5", 
            "review": "SIMPLY OUTSTANDING. This is the best Gurudwara/temple that I have ever visited.As soon as you enter this holy place there's an overflowing amount of peace bliss and serenity that overcomes you..Besides the temple being housed in a very very beautiful building the bhajans(holy songs) and the prayers inside are so beautifully done that one really experiences a high in calmness,peace and tranquility.Excellent vegetarian meals are offered free by helpers in such a humble and loving manner that it really touches your heart! 10/10 marks to this outstanding Gurudwara and to the people who run it."
        }, 
        {
            "index": 272, 
            "rating": "5", 
            "review": "beautiful experience. The temple itself was so clean in and out. The priests and local people wear disposable gloves when serving food and the prayer room is decorated beautifully."
        }, 
        {
            "index": 273, 
            "rating": "5", 
            "review": "Beautiful Sikhi Oasis. We visited on Vasisakhi 2015. It is a lovely, newly built building but it is very much on the outskirts of Dubai. It is pretty much on an estate next door to the church and the mandir. They run a sewa bus to collect/drop visitors to the nearest Metro station which is otherwise a 10-15 mins walk which I hard work in the heat"
        }, 
        {
            "index": 274, 
            "rating": "5", 
            "review": "WKWF. A must go place for Sikh tourist, though it welcomes every one equally.. Firstly a thank you to HH Sheikh Mohammed for making possible a place for Sikh devotees to meditate and practice our faith. A thank you to all members of the Dubai / UAE Sikh community towards their efforts and hard work to build a Gurudwara of world class standards. And above all thank you to all the members who indulge in selfless service (sewa)This place is mesmerizing from the moment you enter, its oara will just make you forget all your worries and get you indulged in to a different level of meditation, you will experience the courtesy, equality & self less service of the community first hand. A must go place....."
        }, 
        {
            "index": 275, 
            "rating": "5", 
            "review": "A blessful moment. we are frequent goers of this place and moment you put the foot inside the temple you get the eternal blissful feeling. your mind is at peace and is totally calm, cant forget the enchantment of the gurbani. They have nearly eight to ten Ardaas chambers where a family can do Ardaas for their loved one at peace. The langar is continuous and it is best well maintained temple I have ever seen. For the people who do not know Punjabi, the literal meaning of slokhs of gurbani is translated in Hindi and English is displayed on big screen. Lastly, I would appreciate the karmyogi's for their devotion and keep this place such a serene......."
        }, 
        {
            "index": 276, 
            "rating": "5", 
            "review": "amazing. We stumbled upon this by mistake as we was actually going to the hospital at the time but after the hospital went to the Gurudwara amazing to see such a welcoming community and clean and organised Gurudwara in the UAE i think its the only one in the whole of the UAE but im not sure but if you ever get the chance you should try and visit.A credit the Sheik of Dubai for this."
        }, 
        {
            "index": 277, 
            "rating": "5", 
            "review": "Excellent Place to workship. => Situated in the heart of bur dubai along with a temple=> In the afternoons they offer langars=> Its amazing to see gurdwara in the Middle East Countries=> Kindly visit gurudwara in the evening as you might be able to attend the paath."
        }, 
        {
            "index": 278, 
            "rating": "4", 
            "review": "peaceful. It is a peaceful place to pray. Love it for the ambiance and culture.Visited by alot of people. Sometime you'll find crowd but not always."
        }, 
        {
            "index": 279, 
            "rating": "4", 
            "review": "A Beautiful Gurudwara. We had gone for a wedding there and i noticed that all the ceremonies were kept very simple. This was good. It has been well maintained and is very clean."
        }, 
        {
            "index": 280, 
            "rating": "4", 
            "review": "it is nice. it is in bur dubai there is a temple down lots of busses go over there bus no 44 ,42 i like the temple it is in the market whereu can buy cloths food"
        }, 
        {
            "index": 281, 
            "rating": "4", 
            "review": "Serene. Gurudwara is quite a few minutes walk from \"Energy\" metro station and as luck would have it, the public bus broken down as well, but it took us 20-25 minutes walking there.\nAs with every Gurudwara, it's a calm and serene place to meditate and as always, as prasad they have langars. Do visit."
        }, 
        {
            "index": 282, 
            "rating": "4", 
            "review": "Well Maintained gurudwar in Dubai. Very Spacious and well maintained. amazing food they serve for free. liked the place for spending some quiet time in the house of God."
        }, 
        {
            "index": 283, 
            "rating": "5", 
            "review": "dhan dhan shri waheguruji. A very artistically and beautifully built gurudwara sahib in dubai\nexcellent architecture , a very spacious darbar hall and also a langar hall lcated near ibn batuta mall A must see (both)"
        }, 
        {
            "index": 284, 
            "rating": "3", 
            "review": "Holiday at dubai. Was dissappointed...the pics given on the net was too good, but when we went to see the actual Gurudwara, it was dissappointing. Our friends also felt the same."
        }, 
        {
            "index": 285, 
            "rating": "3", 
            "review": "Calm and Serene. I liked serenity of the temple, not a must visit in Dubai but if you have time then you should try to give at least a visit to this place."
        }, 
        {
            "index": 286, 
            "rating": "1", 
            "review": "temple. very narrow streets but very vibriant and livels steep stairs not very disabled friendly so i stayed put on my scooter"
        }, 
        {
            "index": 287, 
            "rating": "5", 
            "review": "Soothing Visit. When i was visited there , there was a wedding happening at the temple and i loved it. they were offering langar food to everyone. the gurudwara had a Indian Bank ATM too."
        }, 
        {
            "index": 288, 
            "rating": "5", 
            "review": "Perfection for a Sunday. We had to visit the Gudwara after hearing so many good things and it was well worth the visit.\nAbsolutely beautiful place, you just have to see it to experience it.\nWould definitely come back again when I next visit Dubai!"
        }, 
        {
            "index": 289, 
            "rating": "5", 
            "review": "Serenity!!!. Always brings peace and tranquility the Gurudwara!!! Fond memories for the Langar food!!! Just love the taste there!!! Above all sitting there in peace is just....non definable!!!"
        }, 
        {
            "index": 290, 
            "rating": "5", 
            "review": "A Serene Destination. When I read that the Gurunanak Darbar Gurudwara was a popular tourist destination, I was initially surprised. It was well worth the visit. Spotlessly clean (like all other gurdwaras) this one is off the beaten track and not well connected by public transport. I guess you'll have to take a cab or have a friend drive you there. It is a serene place where once you step into the main hall you feel peace descend on you. There is no activity as such. You can eat at the free langar (community kitchen) and relish the prasad."
        }, 
        {
            "index": 291, 
            "rating": "3", 
            "review": "actually a sikh gurudwara well built ! not a tourist place. For indians this is a nice place to visit as a gurudwara is sikh temple we usually also visit in own country ! its well built compare to indian gurdwaras as the rich of dubai have spent a lot so as an indian you go here is well and good but for other tourists this cant be called a tourist place which they may enjoy ! it has great value for indian sikhs and some indians but for others its not a tourist place really worth going ! so the stars are 3 and not 4 or 5 , since in dubai and nearby many great built mosques etc steal the show !!"
        }, 
        {
            "index": 292, 
            "rating": "5", 
            "review": "Amazing atmosphere. This place will uplift your spirits and is amazing for meditation even if you're not Sikh like me. I took my children there as I thought the world could do with much mire religious tolerance. It's a beautiful place and food is served free with amazing generosity by volunteers."
        }, 
        {
            "index": 293, 
            "rating": "5", 
            "review": "Jo bole so nihaal.... If we cannot open our minds to be accepting of other peoples' faiths, we do not leave a world of hope or a future for our children.When I become the ruler of the world, this will be my first decree: that our children learn something of other people's faiths. With love and respect. They can start here, at the Sikh gurudwara (translates to 'the door of the Guru,' meaning the Creator).This Sikh temple is usually on my list for visitors to Dubai. It is worthwhile to show our guests the enormous area in Jebel Ali that has been granted by the Rulers to people of different faiths, so that they can practise their faiths in peace.The Sikhs are people of the Book, they believe in One God, and do not practise idolatry. Each person that visits the Sikh temple is equal - man and woman - and is welcome to join in prayer, in partaking of the food at the Community kitchen, the langar, or even in serving the community. The food is simple, vegetarian fare. Most of the people serving the food, or cleaning up are volunteers.What do you need to do as a visitor? cover your head with a scarf or a large, clean handkerchief. There are fresh scarves available at all levels, in baskets. There is a neat, assigned place for footwear, for which you will get a token in return - no payment involved.The Guru Granth Sahib is the holy book of the Sikhs and they bow to the book, or more importantly, to the Word carried in the book. Spend a few moments in reflection or prayer. You can ask one of the officials to say a prayer for you or answer any questions about the faith. They will be happy to oblige.There is no mandatory payment but the decent thing would be to place a small amount as an offertory that would cover the expense of the meal that you partake of. The entire kitchen works only on donations, and the doors are open to all peoples."
        }, 
        {
            "index": 294, 
            "rating": "5", 
            "review": "Great Place, working Sikh Temple. This is a beautiful place and a great place to see a live working Sikh temple. Word of caution to tourists, there are not any tourist destination spots here like a visitor center so be prepared to respectfully observe those who have come here to worship."
        }, 
        {
            "index": 295, 
            "rating": "5", 
            "review": "Best Modern Gurudwara. I attended an Anand Karaj here and spent a good 4 hours here as a result. The place is made amazingly well and seems like a five star hotel but with sense of peace and tranquil only a Gurudwara can offer. All the Guru readings are displayed on the two projectors which makes following very easy. Truly amazing experience."
        }, 
        {
            "index": 296, 
            "rating": "4", 
            "review": "Peaceful. Nice to see a Sikh Gurdwara in Dubai. It's bit far from the city, but is peaceful and is worth a visit."
        }, 
        {
            "index": 297, 
            "rating": "5", 
            "review": "Satnam - place of worship, good food and courteous people. It may not be on your tourist list, but if you want to visit a true Sikh temple and have not done so in India or elsewhere, please pay a visit. The place is clean and well organised, the ragis (singers who sing the gurbani or the devotional songs) have wonderful soulful voice and music and if you are keen on sitting on the floor and eat free food, called Langer, you would be surprised with such simple but tasty food. Those whoa re interested could offer their service in serving fellow diners."
        }, 
        {
            "index": 298, 
            "rating": "5", 
            "review": "Sikh Temple. This is a must for all sikhs to visit as well as non sikhs. it is on outskirts. The architecture is beautiful inside and outside. The water feature around the Temple is nice."
        }, 
        {
            "index": 299, 
            "rating": "5", 
            "review": "Heavenly Experience !!!!. Awesome place. The way it is currently being maintained by Sangat is brilliant. A must visit place if you are in and around dubai ..."
        }, 
        {
            "index": 300, 
            "rating": "5", 
            "review": "A sacred place to visit in dubai. A very calm and quite sacred place. From outside it looks massive. one looking for a quite and solace can visit the temple and will never be dissapointed.It is very cliean and well organised, the members are very polite and helpful.A big prayer hall which can gather a huge mass of devotees gives a very pleasnt experience."
        }, 
        {
            "index": 301, 
            "rating": "5", 
            "review": "Its huge and gives a sense of Peace!!. Made very well.....just gives you a great feeling once your in there! Crowded on Weekends but rest of the week is fine."
        }, 
        {
            "index": 302, 
            "rating": "5", 
            "review": "Nice Sikh Temple. For the devout kisks this is a nice accessible Gurudwara and make and i believe lot of crowds on ocassions. Definitely worth a visit."
        }, 
        {
            "index": 303, 
            "rating": "5", 
            "review": "Worth visiting. Very clean and well maintained Gurdwara . The location is somewhat interior have to take taxi from Ibn Batuta metro station."
        }, 
        {
            "index": 304, 
            "rating": "5", 
            "review": "It is a divine place.. Says a home away from home. This is the most beautiful I have ever see before, does't matter which religion you're from or which country."
        }, 
        {
            "index": 305, 
            "rating": "5", 
            "review": "pleasant. Had visit with family. had pleasant atmosphere. make sure that you have enough time to sit and feel good."
        }, 
        {
            "index": 306, 
            "rating": "5", 
            "review": "Spiritual and Divine. Does't matter which religion you're from or which country, if you want to be in a place where you can see a remarkable convergence of all religions, spirituality and seek peace, this place is a must go.\nThe community has done a great work in establishing the Gurudwara here and its a life changing experience for sure."
        }, 
        {
            "index": 307, 
            "rating": "5", 
            "review": "Holy. It is a divine place. You don't feel like you are in Dubai, absolutely serene. People there are always helpful and caring.\nLangar (free food for all) as a prasad is all time tasty & filling. Lovely ambience & peaceful atmosphere makes this place out of the city."
        }, 
        {
            "index": 308, 
            "rating": "3", 
            "review": "Peace full place. This is a peace full and good place ....and amazingly its in Dubai - Middle East ....every day in afternoon / evening you get food ....simple and delicious which is so called LANGAR....by the devotees"
        }, 
        {
            "index": 309, 
            "rating": "4", 
            "review": "Unity in Diversity. It was a pleasant surprise for me to see a Gurudwadra and Hindu Temple in a purely Muslim gulf country. It greatness of Dubai Ruler to allow other religions to worship as per their belief."
        }, 
        {
            "index": 310, 
            "rating": "4", 
            "review": "Peace. Well what can you say, you go to Dubai and can take the opportunity to visit a Sikh temple that does refresh you, just take your time and let the temple do its thing, beautiful place"
        }, 
        {
            "index": 311, 
            "rating": "5", 
            "review": "great food. always a pleasure to visit this place. bliss, harmony, tranquility and the most simple yet tasty food."
        }, 
        {
            "index": 312, 
            "rating": "5", 
            "review": "Religious. This sikh temple has an extra ordinary building, very artistically made. Such a poise place, very calm. Langar is very tasty with nice sitting arrangements."
        }, 
        {
            "index": 313, 
            "rating": "5", 
            "review": "gurunanak darbar sikh. It is the only heaven in the earth which the dubai government allows to buit the gurudwara where a person can go and fells the refresh."
        }, 
        {
            "index": 314, 
            "rating": "5", 
            "review": "Must visit for people from all religion. Beautiful, serene, quiet place to spent some quality time. A must visit if you are with parents, especially North Indian :-)\nAnd the Langar is awesome, as usual."
        }, 
        {
            "index": 315, 
            "rating": "5", 
            "review": "Excellent!. This is a supremely calm place to go spend a couple of hours. Visited with my family - just sat down in the peaceful hall and walked around the complex. Worth a visit!"
        }, 
        {
            "index": 316, 
            "rating": "5", 
            "review": "A serene place. Calm, Serene and peace of mind. Just the perfect place of worship. Even with a extremely large crowd on the New Year Friday it was perfectly handled by the volunteers.\nSpend some time and also partake the langar."
        }, 
        {
            "index": 317, 
            "rating": "5", 
            "review": "Heartwarming. Such a calm atmosphere, so soothing to mind, body & soul. Just go there and recharge yourself. Whenever I visit the Darbar, I feel thankful to HH Sheikh Mohammed bin Rashid Al Makhtoum for his cosmoplitan views and openness for other cultures. This is what it makes Dubai, one of the best cities in the world to live in."
        }, 
        {
            "index": 318, 
            "rating": "5", 
            "review": "Wicked place. This is my second time to the temple and I loved it better this time. As a UK Sikh I had to visit here and take my family here to see how great a place it is. The sewadar were great and we got to see the kitchen which is normally restricted. I want to thank Sheikh Makatoum for his donation and allowing the sikh population to have such a home in UAE."
        }, 
        {
            "index": 319, 
            "rating": "5", 
            "review": "Very Nice!. Located far away from the bustling and fast moving Dubai. This is a calm/serene place to go spend a couple of hours!"
        }, 
        {
            "index": 320, 
            "rating": "2", 
            "review": "bit disappointed. While it was classified as the number 1 attraction of Dubai, we were really determined to go there. And it proved to be a chalenge to come there. Even with a privat car with local driver it was not easy. We were brought to an officer who gave us a little tour. He told us some interesting things about Sikhreligion and the temple. Although it was a nice place to visit, I have no idea why it is classified as nummer 1 attraction, there was not very much to see. In my opiom it can' t compare to many other attractions in Dubai."
        }, 
        {
            "index": 321, 
            "rating": "5", 
            "review": "Authentic and Atmospheric. In a city of artificiality, this temple is wildly atmospheric. The devotees are fascination to watch (do so discreetly). You won't find many colorful experiences like this in Dubai."
        }, 
        {
            "index": 322, 
            "rating": "5", 
            "review": "Serenity in Dubai. Absolutely peaceful. The sevadars are doing a great job too. Its great how the management has maintained the Gurudwara so well and have paid attention to every detail."
        }, 
        {
            "index": 323, 
            "rating": "5", 
            "review": "Nice. Its Better and getting Best Now.\nLocated Near Ibn Battuta Mall, Free Quality Food(Langar)\nWell Maintained, Hospitable People.\nOnly Problem We took taxi There but on return we had to walk."
        }, 
        {
            "index": 324, 
            "rating": "5", 
            "review": "Osum Place. Never seen a gurudwara like this and it is made beutifuly will all facility . It is in outskirts of Dubai with huge space and langar being served at all times. During weekend we have programs due to which there is huge rush. It is at 1 number in most attractive places in Dubai"
        }, 
        {
            "index": 325, 
            "rating": "5", 
            "review": "Amazing..... Very peaceful, great kirtan & langer (free food). Definitely worth visiting. Was told Fridays are the busiest days to meet sangat (congregation). Only 17 dirhams (£3) from JBR."
        }, 
        {
            "index": 326, 
            "rating": "4", 
            "review": "it's nice but long trip. well if you don't have a car or get a cab it will be kind of a long trip for you to go there.\nIt is beautiful temple and u can learn about sikhism from the guru there.\njust make sure you get a ride"
        }, 
        {
            "index": 327, 
            "rating": "5", 
            "review": "Heaven for Sikhs in Dubai. A beautiful sikh temple in Jebel Ali built more than 2 years ago is one of the best outside India which has a very large prayer hall and 3 storey basement parking. The only minus point is that the access gravel road is sometimes not so comfortable specially on holidays due to large number of visitors."
        }, 
        {
            "index": 328, 
            "rating": "5", 
            "review": "Peaceful. A place away from crowd, can spend hours listening to Kirtan and finding inner peace!\nAlso the Langar is special and take you back to memories of Punjab. A must visit if you are in Dubai!"
        }, 
        {
            "index": 329, 
            "rating": "5", 
            "review": "Serenity Amidst The Chaos. A beautifully tranquil holy place, built with the same level of awe as the rest of Dubai..except here serenity reigns, amongst the hustle and bustle that is Dubai. The Sikh people are extremely hospitable, experience first hand their hospitality; with free food being served to all that come (not just Sikhs), as well as a spiritually welcoming invitation into the World of Sikhism. Well done to the architects and those that manage the Gurdwara Sahib today; may Siri Guru Granth Sahib Ji continue to shower you with Their blessings..."
        }, 
        {
            "index": 330, 
            "rating": "5", 
            "review": "Holy Sikh Temple. This is the 2nd Sikh temple I've seen. This place is clean enough & maintained very maintained. Sikhs are very welcoming & hospitalitable. There's a free food available,we were given kheer (as parsad). Do visit if you happen to be in Dubai."
        }, 
        {
            "index": 331, 
            "rating": "5", 
            "review": "you will get real peace here. Very well built, spacious & very well maintained Gurudwara. It's slightly offsite (in Jebel Ali ), however worth visiting many / many times. In the vicinity, there are churches also (we did not visit). Ample parking space. There is langar arrangements on all days"
        }, 
        {
            "index": 332, 
            "rating": "4", 
            "review": "Holy place for prayers. Though this place little away from the main Dubai activity.Its location is excellent at a calm and peaceful surrounding. If somebody really need a peace please visit this place. Its well maintained, neat and clean and Prasadam is very much enjoyable with lunger khana"
        }, 
        {
            "index": 333, 
            "rating": "5", 
            "review": "An outstanding Culture Centre across Religions. Truly a melting pot for religions, run with great dedication by the management, and a must visit for every visitor to Dubai. One of the most amazing wonders created in the Middle east and run by the Kandhari family whose selfless hard work and service will be lauded for generations."
        }, 
        {
            "index": 334, 
            "rating": "5", 
            "review": "A Touch of Heaven in Dubai. One of most beautiful, serene places you'll ever go to in Dubai. You'll want to spend at least 30 minutes in the main hall upstairs, and it's equally special at both day or night. Absolutely breath-taking in the way it welcomes and attracts people from all walks of life in Dubai. During the busiest days of the year, it can take an hour to get across SZR to get here, but if you do get a chance to visit and pay your respects then, it'll have been worth for just experiencing the sheer collective force of devotion! Once you have your experience with a little prayer, don't forget to partake of some of the blessed Prasad from the sevadars. Afterwards, you can also enjoy a free vegetarian meal at the Langar Hall downstairs, which is a wonderful experience. Definitely an experience you'll never forget!"
        }, 
        {
            "index": 335, 
            "rating": "5", 
            "review": "Very peaceful. The darbar was very clean and peaceful, the wash rooms were clean, very well maintained. Felt very peaceful"
        }, 
        {
            "index": 336, 
            "rating": "5", 
            "review": "Cant get better... Very peaceful and holy place to visit. Nicely built, spacious gurudwara offering langar everyday. A must visit for every Indian."
        }, 
        {
            "index": 337, 
            "rating": "5", 
            "review": "One of the most peaceful place in Dubai. This is indeed one of the most peaceful place I have ever visited in Dubai. Will keep going there again and again."
        }, 
        {
            "index": 338, 
            "rating": "5", 
            "review": "Elegant modern decor. This Sikh temple has a modern look, from outside as well as inside, elegant & different than the traditional look.Huge praying hall and langar (meal) service throughout.very much at peace inside the praying hall."
        }, 
        {
            "index": 339, 
            "rating": "5", 
            "review": "No Comparison. Once in Dubai , one must visit the Darbar Saheb. The Darshan is very nice and the Langar ( Food ) has no comparison."
        }, 
        {
            "index": 340, 
            "rating": "4", 
            "review": "Hi Sir first trip to Dubai on 17/2/2015 -21/2/15. Me and my daughter want to go to Sikh Temple, Burj Khalifa n etc.. Hi I heard the temple is beautiful from my friends n also Dubai is lively. Must visit Burn Khalifa n places too. I hope you can arrange for the entrance tickets for 2. Hope to hear from you. Happy Weekend. Excellent Base on the pictures and friends."
        }, 
        {
            "index": 341, 
            "rating": "5", 
            "review": "Just WOW!. The place is a bit far and to travel by taxi can cost quite a bit. I would suggest to take the Metro to Energy station and there would be a van that picks up guests from there although there are no particular timings. If you have the cash, take the cab. And just spend a few hours there with some really peaceful surroundings. Inside the temple is mighty beautiful and the food that was prepared was simply amazing."
        }, 
        {
            "index": 342, 
            "rating": "5", 
            "review": "It shows how to preserve your culture. A must visit for all Sikhs, Punjabis and Hindus....... Being Punjabi.....though I am little sad that Hindus have not been able to manage and maintain temple very well here which is in Bur Dubai....But on other side.....though Sikhs very less in number in Dubai have shown the world how united are they when it comes to their culture and religion....... So any Hindu, Punjabi SIkh...who wants to stay connected with his religion and feels that Dubai may not have any such place to offer.....please do visit, Gurunanak Darbar Sikh Temple....in Jebel Ali and you will be delighted to experience the same....."
        }, 
        {
            "index": 343, 
            "rating": "5", 
            "review": "Must visit. The Gurudwara is very close to the Ibn Batuta area. Very pure and extremely good vibes. Babbajis house in full grandeur. Must visit"
        }, 
        {
            "index": 344, 
            "rating": "5", 
            "review": "One of the best place in Dubai. Guru Nanak Darbar Credit goes to HH Sheikh Mohammed Bin Rashid Al Makhtoum for giving permission.You need peace and serenity advisible to go during weekdays morning... If you need company of ' Sangat' Weekends or holiday is best time to visit.People of faith are wecome here. ' Langar'- Meals or snacks are served throughout the day. Fully Air conditioned, the colour combinaiton used in Guru Nanal Darbar and provides immediate peace to mind.Must visit.Everyone will love this."
        }, 
        {
            "index": 345, 
            "rating": "5", 
            "review": "Peace. Temples and anything religious in Dubai are difficult to come by and the Gurunanak Darbar welcomes everyone with open arms... the vast prayer hall instills a sense of peace and reinforcement while the kirtan in the background elevate our mental status to merge with the higher energies in the temple... a must visit for any Indian..."
        }, 
        {
            "index": 346, 
            "rating": "5", 
            "review": "Peaceful and quite . We visited the gurudwara in the evening and.it was really peaceful. We had a good visit if.the holy book and sat there for.sometime. The place is a must visit and they have buses every 10 mins to and from the metro station."
        }, 
        {
            "index": 347, 
            "rating": "4", 
            "review": "Culturally interesting. My first visit to a sikh temple. Headscarves are provided free of charge to visitors. I was glad my cousin and his family were there to show me what to do. Found it relaxing to sit on the carpeted floor and listen to the live music. Ate some shira (sweet semolina based pudding) there too. You can eat other food that is made as offerings to the Gods - all is free but it can get very busy."
        }, 
        {
            "index": 348, 
            "rating": "5", 
            "review": "Gurunanak Darbar. Very pious and peaceful atmosphere in and around Gurudwara. Kept very clean-as per tradition of Gurudwaras."
        }, 
        {
            "index": 349, 
            "rating": "5", 
            "review": "Beautiful. My husband and I went to this beautiful Gudwara which is easy to get to. It is very peaceful and everyone was so welcoming. You don't have to be Sikh to go and experience this lovely temple."
        }, 
        {
            "index": 350, 
            "rating": "4", 
            "review": "Sikh wedding ceremony. The venue was ideal for the actual wedding ceremony. Though it was a little far from the Marriott Marquis hotel."
        }, 
        {
            "index": 351, 
            "rating": "5", 
            "review": "Peace and serenity. Credit goes to HH Sheikh Mohammed Bin Rashid Al Makhtoum for giving permission.You need peace and serenity advisible to go during weekdays morning... If you need company of ' Sangat' Weekends or holiday is best time to visit.People of faith are wecome here. ' Langar'- Meals or snacks are served throughout the day. Fully Air conditioned, the colour combinaiton used in Guru Nanal Darbar and provides immediate peace to mind.Must visit."
        }, 
        {
            "index": 352, 
            "rating": "4", 
            "review": "Peaceful place. Like any holy places, Gurunank Darbar is a a perfect place to find peace within.Don't miss out on the Langar Prasad!"
        }, 
        {
            "index": 353, 
            "rating": "5", 
            "review": "Amazing . An amazing experience- such a feeling of tranquility in Dubai... A must for all spiritual lovers!i would recommend to all faiths to visit as I am Hindu and felt most at home even though not my own faith."
        }, 
        {
            "index": 354, 
            "rating": "5", 
            "review": "Just awesome... Every indian's pride..this place of worship is one of its kind..Cant thank enough to UAE's spirit which respects every religion..Langar is available daily between 12 to 2pm..Facility for wedding ceremonies also available.."
        }, 
        {
            "index": 355, 
            "rating": "4", 
            "review": "A good experience. Its a nice place for the families to visit. Near to many other main tourist attractions. Preferably try to visit during evening."
        }, 
        {
            "index": 356, 
            "rating": "5", 
            "review": "One of the most spiritually uplifting places in Dubai. Whether you want to introspect, reach out to others or just feel a spiritual rejuvenation, visit this place. Just love going to this temple."
        }, 
        {
            "index": 357, 
            "rating": "5", 
            "review": "Salute to Dubai king for this wonderful temple. This is the best gurudwara I have seen in UAE. Thanks to Dubai king generosity for allowing this place of worship . Langar ( free food ) is served on Friday and Saturday . Must for all punjabis and Indians visiting Dubai . Transport can be be of issue"
        }, 
        {
            "index": 358, 
            "rating": "5", 
            "review": "Peace for the Soul. If you are looking for Peace for the Soul, this is a place where you can visit and spend some time to connect with yourself."
        }, 
        {
            "index": 359, 
            "rating": "5", 
            "review": "Peace at its best. Out of the city with no noise, get some peace at the Temple! The temple is built with a perfect mix of Sikh architecture inside a middle eastern building. Have the 'langar' there if not, dont leave without the 'chai' or 'kheer'"
        }, 
        {
            "index": 360, 
            "rating": "5", 
            "review": "Go there, with some advice on how to get there. This is the third Sikh Temple I have visited, after Amritsar and Delhi, and while it is not as spectacular as those sites ti is very much worth a visit. As I have found elsewhere, the Sikhs are very welcoming, with greetings, with offers of food and a willingness to share their place of worship. Unlike Delhi and Amritsar there is no vast \"tank\" of water, just a small stretch out front. But inside you are guided upstairs to a large airy hall of workship, with an ornate altar at one end and thick carpets throughoutWhile I was there, three musicians were singing and playing harmonium and drums, and unlike Delhi, their amplifiation was perfect and the music incredibly hypnotic and engaging. I sat on the carpet for almost an hour soaking in the spirituality. I really enjoyed my visit.On a more practical level, the temple is a bit south of the towers of Dubai. I was staying close to the airport up north and did not want to pay for the taxi to go that far, nor did I trust I could get a taxi back from the temple. So I decided to go by the Metro, Google Maps showing about a twenty minute walk from the Energy Metro station and I know I walk faster than Google Maps suggests.The Dubai Metro is very easy to navigate, with signs and announcements in both Arabic and English. It is a long ride south to \"Energy\" but the Metro is clean and air conditioned and much of the ride is above ground and there are plenty of interesting towers to admire.But the arrival at \"Energy\" was something of a shock. The station name derives, I guess, from the refineries west of the train line. The temple is to the east, but the Google Maps route starts you on a paved road with no sidewalk (just the shoulder) and then guides you onto a dirt road that had me trudging through the sand. Mainly though, the pathway was completely deserted -- no people, no cars, no buildings, no nothing. I thought about turning back but the ability to see there was no one anywhere near made it seem safe, so I trudged. Most of the way to the temple the only other thing moving besides me was a truck that kept going back and forth spraying water on a section of the dirt road, turning it to mud. There may have been a reason for that but none I could discern.I was unsure about my return trip. Should I walk back through the open desert plain to \"Energy\" or try a tiwice-as-long walk, though a more built up area to \"Ibn Battura\" -- the next Metro stop north back to town. As I contemplated, a taxi pulled up and I had him drive to \"Energy\". If you are following Google Maps and you don't turn right ton the dirt road but continue to the next right you will have a longer walk but it is all paved.A car is good way to get there; there is plenty of parking. Walking from Energy to the temple took maybe ten minutes; if I had not been alone I probably would not have minded it. The visit, completely worthwhile.One more thing, Trip Advisor always asks if there is food available for purchase. The answer is no, because there is food available, but it is free."
        }, 
        {
            "index": 361, 
            "rating": "5", 
            "review": "Desert Serenity. Blessed to have got an opportunity to visit this beautiful Gurudwara in Dubai! The place is quite far from the city - but if you are going to Ibn Batuta Mall, then it's just 5 minutes from there! Location can be tricky if you don't have your own car or a taxi - as finding a taxi is next to impossible. However people visiting the temple are kind to drop you to the nearest Metro Station! The Gurudwara is huge, full of calmness and serenity. An absolute visit if you are a follower and want some peaceful time away from the craziness of Dubai city!"
        }, 
        {
            "index": 362, 
            "rating": "5", 
            "review": "Place to worship. Have been staying for more than 2 years in dubai and i never knew you can get so much peace of mind at Gurunanak darbar, Was blessed on visiting the temple with family and more there are many people who help not only in the kitchen but also serve each and every people post your prayers for food. Worship and service to mankind."
        }, 
        {
            "index": 363, 
            "rating": "5", 
            "review": "Best Place.Peaceful,Amazing Langar & Seva. Away from the busy life and hustle bustle of UAE, this place is a must visit for anybody and everybody. Beautiful decor and well maintained.The scared Gurbani ,Quiet atmosphere,amazing langar and commendable seva offered by all devotees."
        }, 
        {
            "index": 364, 
            "rating": "4", 
            "review": "Dubai Gurudwara. This is newly built and not to be confused with the existing on in city area (Bur Dubai.The old one is congested and in a small area along with a temple)Excellent place to visit though far away from City centre.Close to Ibn Battuta Mall. One can take a metro and get down at Ibn Battuta station and from there a cab ( shouldn't be more thatn 15 AED from there by metre)Beautiful building and interiors and very peacefulLarge inside carpeted sitting area to meditate and listen to Gurubani/KirtansThe temple keeps inviting prominent Raagis ( devotional singers) from India off and onThe area also has a church nearbyFridays can be a rush due to church and gurudwara weekend activitiesExcellent basic food ( Langar ) served -breakfast and lunch/teaMany volunteers participate in the work Many non Indians and non Sikhs/hindus also visit to savour the community meals it serves everydayDue to Dubai rules cooked food by visiting people is not allowed to be donated or distributedRather food items in packed / raw conditions are accepted like Flour, sugar, Ghee Cannisters etcMust place to visit"
        }, 
        {
            "index": 365, 
            "rating": "5", 
            "review": "True peace. Visited the gurudwara on a Friday. They have langar during lunch hours on Friday. Was amazed to see the gold takht of babaji made of 1300kg gold & with TV screens translating the sermons."
        }, 
        {
            "index": 366, 
            "rating": "4", 
            "review": "Beautiful. The temple is so well made and it feels like you are in India. The architecture is beautiful and its very peaceful even though its situated in the busy Bur dubai area."
        }, 
        {
            "index": 367, 
            "rating": "5", 
            "review": "Heaven in desert . This has been the best gurudwara I have been in foreign lands. It's so beautiful and nicely made , thanks to the king and dubai government, it's a must visit place no matter to whichever religion u belong , fridays and Saturdays u can have langer also."
        }, 
        {
            "index": 368, 
            "rating": "5", 
            "review": "Peace and faith. This is the only official Gurudwara (Sikh Temple) in middle east and kudos to Sikhs living in the Dubai who made this dream come true by the blessings of almighty Waheguru. Gurudwara is in the industrial area along with several other churches. You can take a metro till Emirate mall and then you have to hire a taxi to reach Gurudwara. Make sure that you have taxi toll free to call a taxi as it's not a crowded place where you can find a taxi easily.You can offer your prayers and eat food in langar (community kitchen). Also, you can give donations if you want ..."
        }, 
        {
            "index": 369, 
            "rating": "5", 
            "review": "God's blessings in Desert. We were amazed to see the Temple in the Desert as temple is actually bit of outskirt of the city but inside it felt no different to any other temple in India or abroad. We found it very peaceful and calming to the soul and Langar at the end reminded of our local temple. It's worth a visit."
        }, 
        {
            "index": 370, 
            "rating": "5", 
            "review": "Virtually a GOLDEN TEMPLE in the Desert. My & I arrived in the afternoon in Dubai. That evening we went to Gurunanak Darbar Sahib Gurudwara. I was really awe struck at the beauty & the the construction of this great place of Worship. The only in the Arab world - I guess.Attented the Kirtan - it was so soothing and serene. The Ragees (Singers) had melodious voice. the praise for the LORd was sung from the heart.We had 'Lunger' at night. The food was well prepared, considering that there were hundreds eating. The service by the volunteers was excellent.We donated money for the 'Lunger'.It was a very satisfying experience"
        }, 
        {
            "index": 371, 
            "rating": "5", 
            "review": "Peace!!. Just Being there!!! the chanting around you fills your heart..\nI paid a visit on one of the occasions and it was amazing. I also ate at the lunger and they treat everyone like brothers and sisters and feed you with lot of love."
        }, 
        {
            "index": 372, 
            "rating": "4", 
            "review": "Good place. Its good that we can see a hindu / sikh temple / gurudwara in gulf.\nWell maintained, disciplined.\nBut it is in a very congested and crowded area."
        }, 
        {
            "index": 373, 
            "rating": "5", 
            "review": "Heaven in Dubai. The most peaceful place in Dubai. Peaceful, Powerful and Positive place in Dubai. Any wish here comes true....to the best of my experience. People treat you with so much love and affection...and it is so beautiful to spend time here."
        }, 
        {
            "index": 374, 
            "rating": "5", 
            "review": "tranquil, divine and welcoming. You are greeted by a smiling security guard who guides you to the entrance. As covering your head in a Sikh Gurdwara is mandatory, there are containers with suitable head scarves for both men and women and lockers to keep your footwear in. The place is much bigger inside than you initially think. It is spotlessly clean and neat with comfortable carpeting across the room for seating the faithful. While religious scriptures are read the faithful sit and listen. A feeling of calmness and peace pervades the place as the gathered faithful sit and listen. All visitors visiting at meal times can have a vegetarian meal cooked completely in-house in the Gurdwara's own kitchen. Do make it a point to visit this Gurdwara when you are in the new Dubai area. You will be pleased you didn't miss the chance."
        }, 
        {
            "index": 375, 
            "rating": "5", 
            "review": "Excellent religious temple. I visited this temple a couple of time. Extremely peaceful place. Perfect place for you if you are a religion believer."
        }, 
        {
            "index": 376, 
            "rating": "5", 
            "review": "Amazingly peaceful & built with so much love, detail & effort. Visited this Gurdwara on a Saturaday evening 13/9, was so impressed with structure of building, the kirtan darbar session, the Palki sahib, the aura, devotion n love of the sangat. Every evening the gurdwara even sends their buses to pick sangat who work in nearby areas - and the dedication n devotion is really touching. Recommend on your visit to stay till the end of program to see how much of love & respect is given to Guru Granth Sahib after kirtan sohila to Sach Khand. If u go by taxi, hold the taxi as it's a little out of the way but about 20mts fm city."
        }, 
        {
            "index": 377, 
            "rating": "5", 
            "review": "So peaceful. Went here on a roasting hot Tuesday afternoon. It is a bit of distance from the metro station BN Battuata. This place is so peaceful as you would expect and very grand. Glad I took time out to visit"
        }, 
        {
            "index": 378, 
            "rating": "5", 
            "review": "Well worth a visit. We visited the Gurdwara several times during our stay, on different days and at different times of the day.It's about a 5-10 minute drive from the Battutta Mall. Each time the taxi driver knew it's location and charged 10 AEDs. On a Friday and Saturday, there were plenty of taxis available there to bring us back or you can get the security guard to call one. Alternatively, turned right along the road, left and left again, where the hospital is (Lifeline hospital, formally, Jebel Ali hospital) and then flag one down on the main road. even as a woman alone, I was OK with this.It's very well organised, with people directing you to where shoes can be left, wash basins and the Langar Hall. There are head scarves available to cover your heads.Worshippers sit on the steps leading to the prayer hall, outside and in rows in the hall.There is a serene atmosphere to the Gurdwara, which leaves you feeling grateful to be a part of. Our children commented on it before we did. The architecture is amazing. The dome, obviously, especially when lit up is simply beautiful. It's worth walking around the building to see it from different angles. It looks polished almost from outside.Lovely, friendly people who will welcome you in and break bread with you."
        }, 
        {
            "index": 379, 
            "rating": "5", 
            "review": "A Stunning place of worship!. First views of the Gurdwara are fabulous and inspiring! One is struck by the immaculate design, when set against the desert surroundings and the deep blue sky! The grounds are immaculate. One does not need to be a follower of Sikhism to appreciate the beauty and tranquility of this lovely building. In fact, whether you have faith or not, you cannot fail to be moved by its splendour. All visitors are required to cover their heads and modest attire is expected. The management committee take great pride in what they have achieved and are more than happy to provide a guided tour if you so wish.Take a taxi to Jebel Ali and tell the driver that the Gurdwara is near the Hospital. The peace and quiet is in nice contrast to the fast pace of Dubai. This really is a must do!"
        }, 
        {
            "index": 380, 
            "rating": "5", 
            "review": "Amazing!. I am so glad to see a Gurdwara in dubai :) Very well built and amazing. It will be almost impossible to get a taxi back from here, so make sure you get a taxi from your hotel and tell them to wait for you. Advise the doorman of your hotel regarding this and they will tell the taxis driver for you."
        }, 
        {
            "index": 381, 
            "rating": "5", 
            "review": "Gurudwara in Dubai. A very good initiative taken by Dubai government.. an amazing place to visit and provides place to conduct all rituals for sikh community.. you can reach here by metro and then taxi.. do try langar and parsad, if u have time.."
        }, 
        {
            "index": 382, 
            "rating": "5", 
            "review": "Peaceful. Beautiful gudwara, must see for all...be respectful\nAnd cover up and you would going to any gudwara!! we had a taxi there and asked cab driver to wait as heard would be difficult to get one back...however secruity will also order you a cab"
        }, 
        {
            "index": 383, 
            "rating": "5", 
            "review": "Blessing. I Visited in 2013 stunning as the only work I can use to describe it. I am going back in 2014 and cant wait to go again. I think if you have the time go and visit as you will really enjoy."
        }, 
        {
            "index": 384, 
            "rating": "5", 
            "review": "Proud of sikhism. as a sikh you really feel proud to be place away from roots & following the same tradition which we see back india...Dont miss it @ Dubai Trip...Best way to reach here is to take metro & drop to ibn batuta metro station, from there take a cab for 10 mins drive and you have to pay minimum cab charges because it very near but still you have to pay minimum cab hiring chargesOn Friday & saturday you can have Langar also ,"
        }, 
        {
            "index": 385, 
            "rating": "5", 
            "review": "Amazing!!. An amazing and serene experience visiting the most wonderful Gurdwara (Sikh Temple) in the Middle East. Well worth a visit!"
        }, 
        {
            "index": 386, 
            "rating": "5", 
            "review": "Very Serene and Peaceful!. It's a great place to visit for anyone in Dubai….best way to see community service in action….doors are open to people of all faiths and religions…..very beautiful, peaceful and serene atmosphere."
        }, 
        {
            "index": 387, 
            "rating": "5", 
            "review": "Amazing. Real experience!! The kids and we all enjoyed it and got to know more about the religion. Amazing people who showed us around and we will definitely come back again :)"
        }, 
        {
            "index": 388, 
            "rating": "5", 
            "review": "Glad that we visited the Gurudwara. We visited Dubai to attend a wedding and someone had recommended this Gurudwara.It turned out that the Gurudwara was a little far from where we were staying i.e, bur dubai, but worth visiting. Nevermind you beliefs,This is a place to visit!"
        }, 
        {
            "index": 389, 
            "rating": "4", 
            "review": "Proud to see a gurdwara with such prestige in UAE. Family of 6 we visited the much talked about \"The Dubai Gurdwara\". Let me explain it is not too far out best thing take Dubai metro to IBN Buttata Mall, walk to taxi rank and ask taxi driver you want to go to gurdwara near the churches, most of them know, passed the Jebeh Ali Primary school literally 5 mins in taxi paying no more than 10 DHR. The building itself is surrounded by all other places of worship, our Gurdwara stands out for its architecture, since you arrive in it is that welcome feeling you have in any gurdwara. The office were very hospitable and gave all info about the building, they will phone for a taxi for you to return to the mall or your return. We also just missed a wedding."
        }, 
        {
            "index": 390, 
            "rating": "4", 
            "review": "nice. hard to get to, as no cab driver wants to drive you to the gudwara or even acknowledges there is one in Dubai. i asked the bus driver and he just stared at me. had i asked for a mosque, i am sure he would have had a big smile on his face and given me directions a passenger very kindly on the bus had to give me directions to the temple. people in Dubai are no doubt very ignorant to other people faith but there own. very sad and disgusting to see."
        }, 
        {
            "index": 391, 
            "rating": "4", 
            "review": "Great. The gurdwara is amazing and looks beautiful. IMust say it is made and constructed with the best quality products and material. It provides you the space and fescilities of a 5 star.\nIt has many sp3cial services for the elderly people."
        }
    ]
}