{
    "category": "Hanoi", 
    "entity": "Hanoi-Police-Museum", 
    "avg_rating_stars": 4.551724137931035, 
    "review_count": 116, 
    "rating_stats": {
        "poor": 2, 
        "average": 7, 
        "terrible": 0, 
        "very_good": 32, 
        "excellent": 75
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "Surprising Place. Stumbled upon this museum whilst visiting the jail just 100 metres up the road. Really interesting to see the move from early policing within the city to its present day. Great guide assisted our visit."
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "A great find. Saw other reviews and was quite close to our hotel so we decided to check it out. Lots of history and plenty to see - excellent modern building and fully aircon'd too, great on a hot day."
        }, 
        {
            "index": 3, 
            "rating": "4", 
            "review": "Great museum, small but very interesting . Really enjoyed going here, museum is free with free guided tour, staff are lovely and very informative. Was nice to interact with them and ask questions"
        }, 
        {
            "index": 4, 
            "rating": "5", 
            "review": "Interesting Insight. I stumbled across this building wondering through a less tourist-orientated side of Ha Noi. It is opposite the infamous Hoa Lo prison, not far from the train station and south of Hoan Kiem lake. I was greeted and persuaded to take a (free) tour (with the friendly Kim/Phuong Anh - thanks!). I thought it was a museum about just the local emergency service, however I learnt that the Hanoi Police force serve to protect the Revolution/ maintain the status quo and have significant political power and high prominence. Their department includes ranks from traffic police to armed crowd control and counterintelligence and even the fire service. Photos of arrested suspects, paraded for publicity, made me feel uneasy. What I enjoyed best was the selection of seized (mainly Western-branded) counterfeit goods and bladed weapons."
        }, 
        {
            "index": 5, 
            "rating": "4", 
            "review": "Free museum. Entrance is free to the museum they even offer free guided tours in English, it take about 30 minutes to get around the museum as there is very little descriptions."
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "Interesting insight into Hanoi history from an inside perspective - Very funny and interesting tour guide. We walked by the museum and spontaneously decided to check it out for just a couple of minutes (it's free). That plan turned into almost 45 minutes because of the very nice and funny tour guide. We had a lot of questions about Vietnam and the war and she answered all of them with a lot of insight and humour. One of our highlights of our Vietnam trip, mostly because of the guide!"
        }, 
        {
            "index": 7, 
            "rating": "2", 
            "review": "Waste of time in my view. The locals promote this attraction but it wasn't for us.. a waste of good money and not worth the effort to attend"
        }, 
        {
            "index": 8, 
            "rating": "5", 
            "review": "Give it a go!. We figured the museum was worth a visit after going to the 'Hanoi Hilton', as they're only a couple of minutes away from each other. As soon as we arrived, we were asked if we'd like a tour guide. Why not? Vân was absolutely lovely and knowledgable, despite only having worked there for two months. She's an absolute credit to the museum, as were all the other staff the day we visited. Thanks, Vân!"
        }, 
        {
            "index": 9, 
            "rating": "4", 
            "review": "all about the police force. it is new to the Hao Lo prison. entrance is free and you get a guided tour of the whole complex. it give you an insight of the police force of the former and the current. it is modern museum and well maintained."
        }, 
        {
            "index": 10, 
            "rating": "5", 
            "review": "A modern museum that's worth a visit. Spend 30 minutes in this new modern A/C museum to understand the history of the Hanoi Police force. The staff are so friendly, one trainee police office asked if he could practice his English and show me around the museum which gave me good knowledge of the history of the force and Vietnam from his perspective. They is no admission charge so spend in the gift shop to support a museum that is a bit different."
        }, 
        {
            "index": 11, 
            "rating": "4", 
            "review": "Nice modern museum, visit after Hoa Lo Prison. . This is a modern museum giving some background on the Police of Hanoi and what the different uniforms also mean. It also has a breakdown of the many different ranks in the police. You will have seen lots of different police around Hanoi and now you can find out exactly what they are! It's a nice modern museum to visit after Hoa Lo Prison which is literally a minute round the corner. It won't take you long to see all the exhibits, 30-40 minutes and it's free entry. We didn't see any guides around during our visit on a Saturday early afternoon as there was only a girl at reception. Still, it's quite interesting and worth a look as you will no doubt be in the nearby prison."
        }, 
        {
            "index": 12, 
            "rating": "5", 
            "review": "Excellent place. Excellent place you should go.It's free! My tour guide Linh was very kindly and attractive girl.Her guide is easy to understand.I was really interested in history of Hanoi police."
        }, 
        {
            "index": 13, 
            "rating": "5", 
            "review": "Great Museum; Free; History of Hanoi highlighted in this museum. Great museum! Cong was our tour guide. He was extremely knowledgeable and an excellent communicator. He was able to explain all of the exhibits to us and answer all of our questions."
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "Excellent guided tour. Very new museum near the 'Hanoi Hilton'. Excellent well presented exhibits in a modern display space. The guided tour is quite worthwhile & the museum shop is quite unusual for a Hanoi museum as it actually has some items that relate to the museum & not the usual touristy junk."
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "Interesting and free. Stumbled upon this place while walking down the street. Admission was free and got a guided tour which was also free. Our guide was great, he was very nice gave us a really interested history lesson of Vietnam and it's police force."
        }, 
        {
            "index": 16, 
            "rating": "5", 
            "review": "\"Best guide ever\". This is a very nice museum where has a lot of amazing thing. i walked pass the police museum and was greeted by a pretty girl. She invited me to have a tour of the police museum since i'm there. Then she walked us through each room summarizing the main historical events and achievements of Hanoi police, gave us time to read the information and look at the exhibits before moving on. The information about the French and CIA spies was very interesting as were some of the little side stories and the collection of knives, home gun and other seized goods. All exhibits are explained clearly in Vietnamese, English and French. We were accompanied by Ki (or key - Someone in the museum called her by that name), who was most helpful and friendly. Highly recommended."
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "Great guide and hospitable staff. The police museum is just next to the prison museum, less than a five minute walk. The museum is very new, just a year old. Got a great tour from Linh, with lots of interesting information. She speaks excellent English, and made the whole tour not only informative but also fun. I learned a lot about Vietnamese history. The best part of this visit happened at the end of the tour. It was raining a lot, and the staff invited me to join them for lunch (they were celebrating the museum's first birthday, and had a great lunch prepared.) Later on, three more tourists were invited to join (due to the heavy rain it was not very busy). All over, one of my best experiences in Hanoi, and I am really grateful to Linh and the whole museum team for their hospitality, which made these few hours very memorable."
        }, 
        {
            "index": 18, 
            "rating": "5", 
            "review": "A good place to visit.. Last month I visited the Hanoi police museum. Free entry and guided tour by a well informed charming young lady.The museum charts the history of the Hanoi police department dating back half a century to it's first beginnings. If you are in the area visiting the Hoa Lo prison complex ( Hanoi Hilton prison) then it is well worth a visit across the road to the Hanoi police museum."
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "Very interesting - good service. First of all, this is a free attraction which is a great start.Secondly, I was greeted by Van who took me around the museum and told me lots of interesting things. She was lovely. It's not necessary to be guided around but it was nice to talk with someone as I went around.I highly recommend this attraction to anyone who is interested in policing. Also, it's very close to Hoa Lo Prison, and it is a good place to visit after the prison."
        }, 
        {
            "index": 20, 
            "rating": "5", 
            "review": "Great museum and fantastic guide!. After reading the great reviews on the museum we decided to visit it and we were not disappointed!The museum is brand new, very modern and air-conditioned. As soon as we walked in we were greeted by staff and Phuong Anh was our personal guide, she was very enthusiastic, polite and a wealth of knowledge. The museum was fantastic and Phuong Anh made it even better.Another bonus was the museum has free entry, making it a must do when in Hanoi!"
        }, 
        {
            "index": 21, 
            "rating": "5", 
            "review": "Awesome Informative Visit. We didn't intend to visit this museum but was walking by so decided to take a look. We were not disappointed. The museum is a great source of political and police history of Vietnam - covering a long period with informative and English language friendly exhibits. We were lucky to have a guide from the museum accompany us which just added to the experience, but even without the guide it would have been just as good to visit. I strongly recommend visiting this museum - it is not a big museum so an hour will easily cover everything, but well worth the investment. Five stars!"
        }, 
        {
            "index": 22, 
            "rating": "4", 
            "review": "Giving knowledge about police history but need guide for understanding. We met this place by accidental, one staff went out to persuade us inside. All staffs are very friendly and it is free for entrance. A guide try to explain the museum which is very good because the explanation card on showed things almost nothing.They also help us to seek a motorbike for rent, they supported us by riding to drop us in city center. Very good experience with Vietnamese services."
        }, 
        {
            "index": 23, 
            "rating": "3", 
            "review": "Shiny New Temple of Police Veneration. This museum is a PR project more interesting for its design than for its contents (which are pretty much as insipidly pro-police as you would expect). But the museum is obviously very well funded, and has undergone a recent facelift, so it all looks great: the colorful poster-style graphics on the outer doors and windows, a sleek modern interior layout, visitor-friendly exhibits adorned with English captions. They’re clearly very eager for visitors -- the museum is overstaffed with friendly young employees who can’t tell you enough about the achievements of the Vietnamese police in keeping the country free from foreign infiltrators and domestic agitators. There are some confiscated counterfeit goods on display too. And it’s free. Bottom line: this is a nice enough place to stop in for an air-conditioned break from the heat and noise of the city, but don’t expect much real insight."
        }, 
        {
            "index": 24, 
            "rating": "5", 
            "review": "Worth the visit. We visited the police museum on the advise of a tour guide we had used for a tour of Hanoi. When we arrived, we were welcomed and then offered the services of a guide to take us around the museum. There is no charge for this and they do not expect to be tipped, what they do is give you an informative history lesson on policing in Hanoi through the centuries. The police museum has only been open for 12months, we spent about 2hrs here and then went across the road to the jail. If you are planning on visiting the jail, add this to your day."
        }, 
        {
            "index": 25, 
            "rating": "4", 
            "review": "Very interesting, especially to those with police friends or family.. Complementary to the Hoa Lo prisonThe tour guide and staff are all extremely friendly and the museum shop well furnished with original articles.Entrance is free so we decided to make a small donation to say thank you for the visit!"
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "WELL- APPOINTED MUSEUM to help you know more about Hanoi police. Generally speaking, the museum is awesome. The very first thing that awed me is the state-of-the-art design that i can tell from even the outside appearance. Inside, modern technology in the world was applied to bring about a novel display, specifically the water-proof floor, the look-alike mirror ceiling and the LED light bulbs that do not emit any heat when turned on. All items, objects, and documents on display are organized into distinct topics, like Hanoi police's uniforms throughout history, police's activities throughout different periods, from wartime to peace... Another super-awesome feature is the museum staffs. They will show you around the museum and explain the meaning of the objects/ pictures to you - JUST ASK THEM as soon as you step inside. On that day, I went with other friends (in my club) and was particularly impressed by Mr.Cong, as he is very enthusiastic, open-minded and knowledgeable.The best of all is that the museum is totally free. no entrance fee needed means that you can save some of your travelling budget. The museum opens daily from 8 to 5. Check-in there if you want to know more about the history and development of Hanoi police and find the answer why Vietnam- such a small and seemingly powerless country could defeat powers in world. Overall, highly recommended!!!"
        }, 
        {
            "index": 27, 
            "rating": "5", 
            "review": "Great tour. We've just visited the police museum. The building is newly renovated and is just around the corner from the prison the entry is free and we also had a free tour. The guild was great with fantastic English (sorry I forgot his name) he's knowledge about the police force was vast and we really enjoyed our visit. Thank you. Craig & Hannah (England)"
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "A \"must do\"in Hanoi. Normally I am not big on museums but this one has changed my mind. Previously this place was only accessible to police members as part of their training but twelve months ago it was opened up to the public. The museum is open every day and admission is free. We were guided through the exhibits by Cong who is a most knowledgable and friendly guide. Cong was able to describe the evolution of the Hanoi Police through all the political and military struggles that have gon on in Vietnam. If you are ever in Hanoi give yourself a couple of hours to take in what this museum has to offer."
        }, 
        {
            "index": 29, 
            "rating": "5", 
            "review": "Best guide ever!. I went there because some of my friends told me that this is very interesting. And they were right! The museum retrace all the Hanoi police history since the war until now, this is free and you have a guide. My guide made my day! She was very interesting and very nice! I really appreciated this visit! Thanks!"
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Wonderful friendly staff, full of information. What a little gem. We had our own personal guide and she was full of knowledge (she is a police officer). English was good and everything was translated. While we were in the gift shop 10 Police arrived in uniform and we're just as friendly. They introduced themselves and I had a photo with one. Clean displays and well laid out. Just around the corner from the prison. Were happy to wrap a breakable for us to keep it safe."
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "New, small, and child-friendly. The staff were so nice and told us more than I knew to ask about the different security and police forces in Hanoi and around Vietnam, including at the border and during the wars. My 5yo also got to enjoy wearing a uniform while my 8yo got to try on riot gear."
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "Wonderful mini museum. We arrived just as they were closing but the director, Giang, opened the doors and called the English speaking tour guide to give us a tour. It's tiny but on the second floor is a history of Hanoi through the eyes of the police. There are different rooms dedicated to specific historical eras. The maps are great - so is the English signage ! The gift shop has police related items for the brother-in-law (pun intended) who has everything."
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "A great way to learn something of the city's history.. Less than 100 meters from Hoa Loa Prison is the recently opened Hanoi Police Museum. The museum’s exhibits are very impressive, particularly when compared to others in Southeast Asia. A visit here is a great way to learn about the history of the city and escape the heat as it is well air conditioned. As if museum entrance fees in Vietnam weren’t already a bargain; admission to this one is free."
        }, 
        {
            "index": 34, 
            "rating": "4", 
            "review": "A refurbished facility opened to the public. This is a great bit of history about the Police in Vietnam which is one of the few places free to the general public. The exhibits are housed on two floors with a gift shop and the staff are friendly. The displays are easy to follow the specific periods of changes within Vietnam and the issues the Police have had to face.Its a good place to spend 45minutes with Hoa Lo Prison just around the corner."
        }, 
        {
            "index": 35, 
            "rating": "3", 
            "review": "Free and Air Conditioned. This attraction is around the corner from the Hoa Lo Prison (aka the Hanoi Hilton) and worth a thirty minute visit. A gift shop is available although rather expensive."
        }, 
        {
            "index": 36, 
            "rating": "5", 
            "review": "Newly opened museum that is Freeee! . A very newly opened museum sharing insights about the history of policing in Vietnam. Espionage and criminal past popular cases are listed here. Great place to spend an hour after visiting Hoa Lo prison. Just a short walk adjacent from the prison."
        }, 
        {
            "index": 37, 
            "rating": "4", 
            "review": "A little gem, great perspective on Hanoi. We stumbled across this place by accident, it looked quite small from outside. We decided to visit as it was free admission. You need to take stairs for the main galleries - these are ordered by various years, 1940s, 1960s, 1970s roughly. Graphics provide information re current challenges for the police force. The historic photos of Hanoi in themselves are interesting. There is a display of uniforms and more contemporary displays. Some of the displays would be of interest to young children - perhaps not for long. Staff are friendly and there's a souvenir shop. Worth a visit."
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "Great Museum. Small museum, but with a lot to see! The staff is so kind. We got a private tour. And best of all, it's totally free!"
        }, 
        {
            "index": 39, 
            "rating": "3", 
            "review": "Not too much exciting things but you should try one. You will know the history of Vietnam police, especially there are many pictures of Uncle Ho with Ha Noi Police Ministry and Ha Noi people before and after 1945. My child likes the \"fake\" polices inside the museum. I saw many children (in kindergarten) came with the teachers and acted as policeman. They teached children about rules of traffic. That was so interesting."
        }, 
        {
            "index": 40, 
            "rating": "4", 
            "review": "The official history . Great presentation, well worth a stop. Displays tell the story of the struggle for an independent Vietnam with significant people and events."
        }, 
        {
            "index": 41, 
            "rating": "4", 
            "review": "Nice place to visit. There was no one in when we visited, don't know why because this is a good place to see. It is free and the layout is well thought out. Not very large so 30 to 45 minutes is long enough but I would rocommend a stop. New building, spotless and well thought out.\nDefinitely worth a visit"
        }, 
        {
            "index": 42, 
            "rating": "2", 
            "review": "Boring. Not much to expect in this museum. The only reason you should visit this museum is when you are a police man and want to study/know about Vietnam Police."
        }, 
        {
            "index": 43, 
            "rating": "4", 
            "review": "Fascinating glimpse into the history of the Police. The museum is brand new with a light modern airy design.The morning I went there sadly there were no local police guides which was a shame as I know that previously trainee police have shown visitors round. Perhaps that was something that was done when the Museum first opened.I think the people who would be more fascinated by the museum are the Vietnamese history lovers who really want to know more about Vietnam and the society and history. There is a big focus on past police history. And for someone who loves Vietnam and Hanoi I would have liked additional detail and information. But then again too much information doesn’t appeal to everyone so I think the balance is right. It is enough to wet one's appetite for finding out more information. Perhaps it would be good to also have an audio guide that can give more information for those who want to learn more.Overall, an excellent and fascinating half hour/short visit around and element of Vietnamese society which may not always be top of one's list. Great glimpse into the Vietnamese police authority which importantly helps keep Vietnam a safe destination.And its free."
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "Hanoi police museum beautiful. One of the nicest Museum in Hanoi, the information in helpful and detail clearly. The staffs are nice and friendly. Open is free from 8:00 to 17:00 everyday."
        }, 
        {
            "index": 45, 
            "rating": "3", 
            "review": "Free, and nice to get out of the hot sun!. My son spotted this museum and so we popped in. Quite small, but he enjoyed it very much. And it was cool, which was a bonus!"
        }, 
        {
            "index": 46, 
            "rating": "4", 
            "review": "quite enjoyable. we came across this when walking to another attraction. quite interesting for half an hour. clean loos."
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "Modern Museum with Plenty of Exhibits. Surprised to see what a modern looking and very clean museum. The best so far in Hanoi. The entire history of the police force has been showcased into 4 separate sections. From the formation days to the catching of spies during war time and current state where more effort has been put into catching drug lords, preventing counterfeit medicines, solving kidnapping cases and stopping cyber crimes. All exhibits are explained clearly in Vietnamese, English and French."
        }, 
        {
            "index": 48, 
            "rating": "4", 
            "review": "Very good place to go!. Yes, this is very good place to go, specially with the friends. The best to learn about the history Vietnam. Nice place"
        }, 
        {
            "index": 49, 
            "rating": "4", 
            "review": "Free and informative. I could not find this museum on most tourist maps of Hanoi. I came to know the existence of this museum while browsing through Trip advisor on attractions in Hanoi. As a Police Officer myself, I was keen to know how this museum differs from my Police museum in Singapore and what useful information it has in store for me. I took sometime to hunt for the museum. I asked few locals I met along the way but surprisingly the locals looked at me ignorantly and seem not to know the location of this museum. After a `thorough search' I managed to find the museum at 67 Ly Thuong Kiet and is strategically centered in an area with embassies and government buildings. Several uniformed Police protective unit officers stood on guard or patrolled outside the VIP premises. The museum is located within a building that resembled the British colonial architectural building of the Singapore Traffic Police Headquarters at Maxwell Road during those old days. The impressive 2-storey building of this museum in Hanoi appears well maintained and newly painted with erected signboard standing at the entrance displaying the opening hours of the museum from 8 am to 5 pm and admission is free. I was greeted with a welcome smile from the counter staff on duty. I introduced myself and the female staff was enthusiastic to show me around the museum. We started with a showroom of Vietnamese Police uniform since the early years and I found the new green and grey attire more in line with the civil defense forces of the world. Surprisingly, the fire and civil defense services fall under the jurisdiction of the Police Force. I later found out from the exhibition in the subsequent room that a lot of emphasis had been placed on `people protection' in the years of the Vietnam War during intense American bombardment. Civil Defense had since then evolved into an integral part of Police priorities and operations. I also observed that much credit were given to Intelligence Officers who worked undercover against CIA espionage and sabotage activities during the wartimes; against `counter-revolutionaries' and against infiltration by `subversive forces' sent by the `enemy forces'. Equal recognition were also awarded to the Protection Unit whose duties were to protect the main elite team members and officials of the revolutionary Communist Party from assassination and shootings. Whatever it is the past is the past. I found the great achievement of the modern Vietnamese Police Force in their ability to suppress crimes - drug proliferation, gang fight, cybercrime and crime syndicates and ensure that society is safe for the ordinary folk and the streets safe for tourists to visit the country. The museum also showcases many conventional equipment and modern instruments used by the Police during the old and modern days. The tour was informative. Before I left, the staff also presented me with few booklets of information on the museum and a tourist map of Hanoi. I really appreciate that courteous staff for such a warm welcome and her painstaking effort in explaining those exhibition material to me making my tour of the museum an informative and memorable one."
        }, 
        {
            "index": 50, 
            "rating": "4", 
            "review": "Very interesting way to spend an hour or so. I liked this museum, had police memorabilia from the war onwards. There was also a display of drugs and weapons they had confiscated and a story about them"
        }, 
        {
            "index": 51, 
            "rating": "4", 
            "review": "Interesting and informative. . Chanced upon this gem. Free to visit and great sanctuary from the rain 😄\nInteresting to learn how the police force evolved to present.\nVery keen and pleasant guide.\nQuiet but worth a visit."
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "Well worth a visit. Really interesting visit to this small museum, if you are lucky as we were, one of the curators will escort you round and fill in history for you"
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "Do not pass this open door. Not so long ago the Police Museum was only open for police officials. Now a new wind blows here: the police opens the doors to demonstrate where they were and are about. In two floors one gets an interesting overview on police history since 1945. The police played a role in the confrontation with the French and later the Americans. They do not hide this part of history. This modern museum also informs about the present tasks, including the fight against organized crime, drugs, and even cybercrime. On the ground floor one can find part of the collection, a meeting room with pictures of all commanders of the police force and a small shop. It is certainly worth a visit. One advise if you want to use the toilet; in Vietnam it is wise to carry some toilet paper to prevent possible unpleasant situations.."
        }, 
        {
            "index": 54, 
            "rating": "4", 
            "review": "Worth the stop to visit. We were walking by and decided to give this museum a quick look. It is free. The museum explains the history of the Vietnam police since independence. We had a young man from the museum give us a guided tour. He was very thorough, and added personal knowledge which enhanced our experience."
        }, 
        {
            "index": 55, 
            "rating": "5", 
            "review": "Historical site. Fellow Americans might be upset by some information displayed. Remember when overseas its an away game for you. Not a home game"
        }, 
        {
            "index": 56, 
            "rating": "5", 
            "review": "A hidden gem. My husband and I found this museum by accident after visiting the nearby prison. We hadn't seen it on any maps or in online guides, yet it was certainly one of the most modern, professionally done museums in Hanoi. I'm not usually very interested in military or police but they did a great job! They outlined the different sorts of crimes that occur and had lots of police equipment for us to look at. Overall a great job. Plus, it's free!"
        }, 
        {
            "index": 57, 
            "rating": "5", 
            "review": "Guided tour. Quite close to our hotel party of 6 , we were warmly welcomed and given a free guided tour, maps etc and our police trainee guide was excellent explaining both questions related to the museum and Vietnamese history and culture etc.Well worth a visit new and well presented."
        }, 
        {
            "index": 58, 
            "rating": "4", 
            "review": "Interesting free museum. This newly refurbished museum is close to the \"hanoi hilton\" prison. Come out of the prison turn right - walk to the end of the road and look across to the far side and its the white building.Interesting history and displays, in vietnamese , french and english.Top tip nice clean free toilets.Girls on front desk very helpful gave us a free Hoian guide when we left."
        }, 
        {
            "index": 59, 
            "rating": "5", 
            "review": "Good. Free museum, no far from hanoi prison. Excellent display and the staff are excelent too. Don't miss this place ^^"
        }, 
        {
            "index": 60, 
            "rating": "5", 
            "review": "5 Star Surprise . We happened upon the place quite by accident and we're delighted by what we saw. It gives a historic perspective from the police point of view- they see themselves as protecting the people - mostly without weapons The exhibits are very clear and universally interesting. Admission is free and our guide was extremely helpful and knowledgeable An undiscovered treasure"
        }, 
        {
            "index": 61, 
            "rating": "3", 
            "review": "Could give it a miss. If you have not seen police museums around the world elsewhere, this could be a good experience from one city/country. For law and crime enthusiasts, it can be interesting with all the facts and trivia. There are exhibits of seized counterfeit goods and fake medicines on display with photographs. The role of Hanoi's police in keeping the city safe is explained. If you are map lover, there are 4 huge displays of how Hanoi grew from 1945-54, 1954-75, 1975-86 and so on till present day. In summary, if you do not visit this, you won't miss much."
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "Great museum!. Free museum right near Hanoi Prison. Excellent displays with great English translations. Very clean and the staff are excellent. Police are closely tied in with the military history so lots to learn here."
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "Very interesting museum. You should visit this place after Prison Hoa Lo (in the same area), if you want to know more about Vietnam's police in Hanoi from 1945 at now.A lot of things to see, and you will have a very nice and interesting guide. Everything for free. For me, one of my favorite museum in Hanoi!"
        }, 
        {
            "index": 64, 
            "rating": "5", 
            "review": "Great!. Go and visit this place... a lot of history there. Got there by accident, as I walked in, I was welcomed by smiley people and was given a private tour around the museum. I do not remember the gentleman's name who showed me around, but he was very good, and told a lot of interesting stories about the history of Vietnams police."
        }, 
        {
            "index": 65, 
            "rating": "5", 
            "review": "Great little museum. We walked pass and popped in for a visit. It's free and we had a private guided tour around the museum. Had a little history lesson and learnt a bit about their stories. It's very interesting and well worth a visit."
        }, 
        {
            "index": 66, 
            "rating": "4", 
            "review": "stumbled across the museum of the day. we were on our way to Hoa Lo prison (5 mins away) when we stumbled across this museum, it was completely empty but the staff welcomed us immediately and began an automatic free tour. The museum is brand new and it shows, the exhibitions are shiny, attractive and thought out down to the colour bias and symbolism in each room. The guide was extremely informative and open to questions, and asked nothing of us but to write a review...(but naturally we gave a donation to the museum). We were pleasantly surprised by how big the exhibits were and although at times the museum presents a one sided story, its their story worth hearing and they tell it well."
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "New interesting police museum. We were pleasant surprised about this new Police museum. Museum divided in some interesting zones and retell not only about police but also about different wars in Vietnam. And of course nice that it's for FREE!"
        }, 
        {
            "index": 68, 
            "rating": "5", 
            "review": "Best museum and guides in hanoi. This place was fantastic!!! Our guide was so informative and loved to talk about vietnams history in general! Best museum in Hanoi!!! :D"
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "Excellent. We had a very nice time here. The staff were very friendly and knowledgeable about the museum and answered all questions very well. I would recommend this museum to anyone who is interested in learning more about Vietnamese history and culture, the police are an important part of Vietnamese society and this museum shows how respected and important they are. Thank you again, we had fun."
        }, 
        {
            "index": 70, 
            "rating": "5", 
            "review": "Very interestiing museum. This is a new museum, very nice, clean, modern, and attractive. The history and progression of the Hanoi police is exemplified by historic items and clear, precise explanations. It's very interesting and I think it's a must-see when in Hanoi...and it's free! The staff is very friendly and helpful, answering any and all questions and explaining everything in detail We were accompanied by Trang, who was most helpful and friendly. Highly recommended."
        }, 
        {
            "index": 71, 
            "rating": "5", 
            "review": "Nice museum. Really nice, organizd and modern!in the center of Hanoi! Including a free Tour guide and without entrance fee!"
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "Nice museum. A very enjoyable and educational experience. The museum is well layed out and tell a complete story from the war to moderm day."
        }, 
        {
            "index": 73, 
            "rating": "4", 
            "review": "Interesting small museum. The Vietnamese police force is celebrating their 60th anniversary this year. All entry is free. It is around the corner from Hoa Lu Prison. The exhibits showcases uniforms worn since 1955 to modern times as well as the equipment used then. Very informative. The tour guide, Henk, was very friendly, answering all my questions. She is fluent in many languages, French, English and Vietnamese."
        }, 
        {
            "index": 74, 
            "rating": "4", 
            "review": "Police Museum. Interesting and informative place, worth the visit while in Hanoi. I enjoyed the history lesson during my visit."
        }, 
        {
            "index": 75, 
            "rating": "5", 
            "review": "Hanoi Police Museum. My intention was to visit Hao Lo Prison and it happens that I walked pass The Police Museum and was greeted by a nice gentleman by the name \" Cong \". Hopefully I get it right. He invited me to have a tour of the Police Museum since I am there. He lead me thru all the museum artifacts about the past and present Police lifestyles and happenings. It was an eye opener for me to have an insight of the Vietnamese Police. Mr Cong, who is my guide throughout really enlightened me with my questions. This is one of the museums that should not be missed when visiting Hanoi."
        }, 
        {
            "index": 76, 
            "rating": "5", 
            "review": "Arrive then leave and come back!!. This is a very nice museum where has a lot of amazing thing. Firstly , You can learn more about history and customs. Secondly , there u can have a change to meet someone....You should try to go there once time in your life. :3"
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "Great free museum . We really liked the museum. It was very quiet when we went and we had a very nice tour guide show us around. We weren't expecting a guide and it was a welcome surprise. It is really well put together and has a lot of information and interesting stories. Would visit again."
        }, 
        {
            "index": 78, 
            "rating": "4", 
            "review": "Very interesting but not much about the police. This museum, like almost everything in Hanoi, is about the war...or wars that were fought over the history of Vietnam. There is a little bit about the role of the police but it's mostly modern day stuff with most of the museum talking about the wars. Still, very interesting and it's free. Plus, when you visit, a police cadet will take you around and talk about the various exhibits. Oh, and it's air conditioned with modern clean bathrooms which just makes it even more enticing!"
        }, 
        {
            "index": 79, 
            "rating": "4", 
            "review": "Went here with the Hanoikids. it was interesting ,atmospheric,well presented .We enjoyed our visit which was enhanced by having two of the team from the Hanoikids who were able to explain in detail the history of the prison I am not sure how balanced a view is presented by the museum particularly in respect of the American prisoners Overall interesting"
        }, 
        {
            "index": 80, 
            "rating": "5", 
            "review": "Very nice . We stopped in here while in Hanoi. It had only been open for a few months and everything is still super new.Staff were really helpful and informative. One lovely lady walked us through most of the place. She was able to provide extra info on the displays. This was a really interesting place but like the war muesems the versions of the stories told were very one sided. Not sure if its just because it's new but entry was free which was really nice!Also when we visited, from outside the building looked like it was closed, so if it looks shut it might be worth trying the door anyway ☺"
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "A hidden gem!. We stumbled upon this place on our way back from the Women's Museum. It has only been open for 3 months so staff were keen to show us around. Phuong Anh, our guide walked us through each room summarizing the main historical events and achievements of the Hanoi police. She gave us time to read the information and look at the exhibits before moving on. We would recommend visiting this museum if you are in the area."
        }, 
        {
            "index": 82, 
            "rating": "3", 
            "review": "Beautiful Modern Building with Interesting Displays - Strong Propagandist Message. It's worth the 30-45 minutes it should take to visit this museum. Our guide would happily have taken longer to show us around. We considered it a good rainy day activity (also a good way to get out of the heat.)The displays are interesting and very well constructed. The message is a bit heavy on the happy-go-lucky everything is sweetness and light message. I can't think of any police departments with much history that could realistically be shown without blemish, but this is just too extremely one-sided to be taken at face value.Our guide was very charming and really seemed to relish the opportunity to show us around.It's amazing that it's completely free for the public to visit."
        }, 
        {
            "index": 83, 
            "rating": "5", 
            "review": "Excellent Museum. Big thanks to Cong, our guide at the museum, for making the visit enjoyable and informative. The museum is filled with information ranging back from the French era of Vietnam to present day. The museum is free and the guide toured us around explaining everything and answering any questions. The museum has only been open 2 months and thus is very modern, bright and clean. Definitely worth a visit if in Hanoi. It is only 2 minutes away from the Prison, so I suggest doing both in the same day."
        }, 
        {
            "index": 84, 
            "rating": "4", 
            "review": "New Hanoi Police Museum. I walked past this place by luck and stopped by to have a look. A guide takes you around to explain the displays but gives you time to read the exhibits at your leisure. Really well laid out and interesting display. Free entry, but there is a little gift shop. Glad I popped in!"
        }, 
        {
            "index": 85, 
            "rating": "5", 
            "review": "Interesting incite into Vietnam . Stumbled across this place on our way home. The guide was very knowledgeable and told us all about the history of Vietnam, would recommend this place if visiting Hanoi"
        }, 
        {
            "index": 86, 
            "rating": "4", 
            "review": "A pleasant surprise and free. We were drawn to the museum due to its very modern appearance, our guide informed us it had been designed by a French architect. We were welcomed a soon as we walked in by a very helpful young guide who showed us around and tol us about the exhibits, this wasn't entirely necessary as everything was well labelled in English.The museum goes through the history of the police force and ends with a shop so you can buy Hanoi Police souvenirs! Well worth 30 minutes of anyone's time and just round the corner from the prison."
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "Modern museum with insightful displays. We visited this museum by chance, having spotted it nearby having visited Hoa Lo Prison Museum. The Police museum provides a good extension to the prison museum so worth doing both together. A tour guide, one of the young police recruits by the looks of it, will take you around. This is a bonus as the cheery and knowledgeable guides help provide context to the exhibits and answer questions with a good level of English.Apparently the head of the police (\"Duc Chung\") had the idea of creating the museum having visited the Police Museum in Munich - this shows, as it comes across as the most, for want of a better word, \"westernised\" museums we've seen in Vietnam. Good layout, bright, air conditioned, fairly good English signage and best of all FREE. An expected pro-communism bias but well worth visiting. A tour takes about 1 hour or so."
        }, 
        {
            "index": 88, 
            "rating": "4", 
            "review": "Wonderful museum.... I was traveling from Australia to Vietnam in Oct 2015. This is the last place where I went to Vietnam, I was surprised because Police Museum is designed with modern style, very beautiful and a lot of useful information about Police history. I got more information about Hanoi police, understood the difficulties of police and soldiers to keep peace for country. I really thank all the staff in Police museum and especially to the guider (I can't remember exactly her name: Tran or Trang) who helped and introduced me during the visit.I will recommend my friend about this museum."
        }, 
        {
            "index": 89, 
            "rating": "5", 
            "review": "Pretty museum. Friendly guides who also show you the Hanoi history after the Americans left Vietnam. Museum looks wonderful and is brand newDo recommend."
        }, 
        {
            "index": 90, 
            "rating": "5", 
            "review": "CSI: Hanoi. This new museum is bloody brilliant. They've laid it out chronologically, and you're taken on a journey from the time of the formation of the precursor to what is now the Hanoi police force, to the role they played in the American war, all the way to today, when their fundamental role in theory has not changed much, but the day-to-day operations have changed dramatically.This is a great rainy day activity and there are plenty of cafés and restaurants nearby. It also stands out on the street because its quite new and clean and almost entirely white. And don't forget, its free.What to expect:- An honest an blunt history of the police force- Accounts of individuals who made the force what it is today- A good look at wartime artefacts including fake documents, weaponry, small vehicles, clothing, and police equipment- Very friendly advice and information from the staff who are quite enthusiastic and speak fairly good EnglishIt should take quick museum goers about 45 minutes to do the whole thing but a keen learner might take up to 2 hours."
        }, 
        {
            "index": 91, 
            "rating": "4", 
            "review": "Very informative, great new museum and its FREE. We were actually lost and looking for the prison museum when a friendly young vietnamese woman convinced us to come inside. Very informative and a great new museum all in all. She gave us our own personal tour and took us through all the decades. Well worth a visit!"
        }, 
        {
            "index": 92, 
            "rating": "5", 
            "review": "Great new museum!. First: it's free! Do go in. ;-)We were passing by, when we came across this new building. A young friendly gentleman approached us and invited us in. He was a Police officer. He toured us the whole way inside. Very nice exhibition. Also useful for a fast glance on Vietnam recent history. We highly recomend. It's just in front of Hoa Lo Prison. Can't miss it. ;-)"
        }, 
        {
            "index": 93, 
            "rating": "5", 
            "review": "Friendly, interesting Museum. Like most reviews we discovered this walking past on our way to the Pagoda when a friendly member of staff persuaded us to go in. What a lovely small museum. Brand new so well laid out, cool and displayed in a way that is easy to follow the history of the force and how it shaped Hanoi. The member of staff stayed with us throughout explaining the exhibits and answering all my questions. Having just left the Ho Lao prison (it's just around the corner) this was actually a great place to visit as the stories are interconnected. The information about the French and CIA spies was very interesting as were some of the little side stories and the collection of knives, home made gun and other seized goods."
        }, 
        {
            "index": 94, 
            "rating": "4", 
            "review": "New attraction in Hanoi. Stumbled across the police museum while out walking one afternoon and really enjoyed the museum. Lots of exhibits outlining the history of the police force in Vietnam. While there, many police officers were also taking the tour. Guides and staff were very friendly and helpful to explain the exhibits."
        }, 
        {
            "index": 95, 
            "rating": "4", 
            "review": "Great little museum. Saw this as we passed by from dinner one night. We popped in the next day, great, friendly staff in an informative museum about Hanoi Police and their history. Worth visiting if in the area."
        }, 
        {
            "index": 96, 
            "rating": "5", 
            "review": "Hanoi police museum beautiful. One of the nicest Museum in Hanoi, the information in helpful and detail clearly. The staffs are nice and friendly. Open is free from 8:00 to 17:00 everyday."
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "Highly recommend. Also known as Hanoi PM or Båo Tàng Công An Hà Nôi, on way to another museum when I happened upon this museum by chance, could not have been more impressed with the museum itself and I cannot recall ever being so well looked after by staff. It is not a big museum and suggest you make the time to enjoy this treasure, I am certain you will not regret it. Congratulations to all involved."
        }, 
        {
            "index": 98, 
            "rating": "5", 
            "review": "Unexpected wonderfull museum. We was going to Vietnam Woman Museum, spot a beautiful looking museum on the road side. Founding out the museum is free for entry, decided have a look inside.Full story of Vietnam police history displayed on the wall with words and picture got my interest. Even better, there is a guide who is an academy walk us through, explaining all the facts.When we finish the visit, we are given a badge for souviner.This is a must visit museum for me."
        }, 
        {
            "index": 99, 
            "rating": "4", 
            "review": "Interesting . Fairly small museum but friendly and enthusiastic staff that explain it all to you. Insight into Hanoi and Vietnam's history and how the police have adapted."
        }, 
        {
            "index": 100, 
            "rating": "5", 
            "review": "Very kind stuff and cool design. The stuff was very nice, she explained everything and we could ask questions. The mueseum is very well desined, as she said by a france designer."
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "Wonderful new Museum in Hanoi!. This is a brand new Museum in Hanoi and looks it - bright, clean and airy - where visitors are welcomed by at the door by cheerful, friendly and gracious staff who could communicate in English. A young keen Museum guide took us through the whole Museum for no charge. The Museum is well-laid out with exhibit captions clearly written in 3 languages- Vietnamese, English and French. The lay-out is by historical period, and a free small glossy leaflet brochure is available summarizing these periods and their key exhibits. Most of the exhibits are on the second floor, accessed by stairs, with the ground (1st) floor mainly give over to a display area, and guest lounge and a small museum shop. The highlight for me was the exhibits detailing the 1945 - 1954 historical period - the beginning of the police force. There was information there I have never come across before, such as the \"metal bowls\" group (12 to 16 year olds, acting like Baker Street Irregulars for fans of Sherlock Holmes) and the A13 Team. Absolutely fascinating!"
        }, 
        {
            "index": 102, 
            "rating": "5", 
            "review": "Amazing museum!!!!!!. We came inside because it look very nice from the outside. It was amazing. It is very informative and nicely put together. We had a privat tour guide. She was very nice, it was interesting. She very kind and helpful and interessted"
        }, 
        {
            "index": 103, 
            "rating": "5", 
            "review": "Let's experience!!!!!. When I came Vietnam, I visited an interesting Hanoi Police museum in Hanoi. A large number of impressive collections paint a comprehensive picture of the police. Moreover, detail informationof police's items will be brought to visitors by friendly & enthusiastic guide. It couldn't be better for a museum. Let's experience!"
        }, 
        {
            "index": 104, 
            "rating": "5", 
            "review": "An interesting place!. The Hanoi Police museum is one of the most amazing museums in Hanoi. Come to research the heroic historical of the Vietnam's capital police force."
        }, 
        {
            "index": 105, 
            "rating": "5", 
            "review": "Thank you very much. The hanoi police museum,was very interesting, i learned alot about vietnam and what the police force does to keep vietnam.A save country. I was very impressed with the young lady who showed me around, she was very enthusiastic and knew alot."
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "Hanoi Police Museum beautiful. Very friendly informative. Would be greab if the childs uniforms were for sale - would love one for my daughter. Thank you for your service."
        }, 
        {
            "index": 107, 
            "rating": "5", 
            "review": "Very interesting tour into the world of Hanoi Police. A great place to go with the family or on your own, kids can dress up as policemen an police women, there is also lots to see for them. On the other hand it is also very interesting, especially because all text is in English, French and Vietnamese. The lady who give me the tour spoke good English and did her up most best to keep telling me interesting new facts. It does give you a deeper insight of what the police has done in history and its current position in society. And they have great buttons for the kids. Worth visiting."
        }, 
        {
            "index": 108, 
            "rating": "4", 
            "review": "Well presented. Unlike other musuems I have visited in vietnam, this museum has both good and relevant artifacts as well as clear and well presented information. It gives a lot of information about the role of the police force through the various wars,which is of course, a little one sided but still informative. The building is designed in such a way that you are incouraged to follow the rooms in order, which works well with exhibits that are arraged by time period. If you like the police or interested in the society of hanoi from 1945 to the present day then this is a must but for the rest us, this is a nice museum to pop in to if you happen to be near by."
        }, 
        {
            "index": 109, 
            "rating": "5", 
            "review": "Museum is very beautiful. . The Hanoi Police museum is very interesting, , i learned a lot about Vietnam and what the police force does to keep Vietnam a safe country. I enjoyed my time here! "
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "Interesting Museum. The police museum is very infomative and nicely put together. The staff is skind too. I would recommend this for other tourists á well!"
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "Hanoi Police Museum. Very modern museum and nice tour with our guide through the museum. New information. Free entriee. We like Museum."
        }, 
        {
            "index": 112, 
            "rating": "3", 
            "review": "Worth a brief diversion. Nice distraction for a few minutes - figurines with different cop uniforms and a decent selection of propaganda posters!"
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "Really enjoyed this museum as staff very helpful. We wandered in to this new museum after being in the Hanoi Hilton just across the road. The staff actually did a guided tour for us, glad to practice their English, and they certainly had a good knowledge of what was on view. We were the only visitors at the time. I particularly found the documents signed by Ho Chi Minh on show to be good to see, and photographs of the city during the Vietnam War when residents were evacuated. This would be great for a rainy day if you have children as it has enough to keep them interested, with everything from guns to police vehicles."
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "Very organized. I like how the museum was organized. Each section comprehensively tells about the police history of Vietnam. It was free during our visit & the tour guide was free too. His name was Cong and he was very accommodating. He speaks english. I am not sure though if the visits to this museum will remain free. The museum still smells new during our visit so I'm thinking the free visit was a sort of \"opening deal\". We were even given a free pin as a souvenir. The other staffs were friendly too. We enjoyed the picture-taking with them."
        }, 
        {
            "index": 115, 
            "rating": "5", 
            "review": "Hanoi Police Museum - new must-see venue in Hanoi. The museum was recently opened (August 2015) so everything is new and well-kept. It is better laid out and has better lighting than most other Hanoi museums and have a good range of materials. Stepping into the museum, we were welcomed by the friendly staff who gave us little badges as souvenirs. The museum covers the history of the Hanoi police force and Vietnamese police force from the early 20th century. we spent about an hour and a half looking at exhibits. The museum shop has fun little key rings and coasters which are good for gifts. Entrance is free."
        }, 
        {
            "index": 116, 
            "rating": "4", 
            "review": "Interesting angle on Vietnamese life. A slightly quirky museum, I couldn't find another review on Tripadvisor and we were the only visitors. A history of the Hanoi police from the the end of colonialism to the present day. There are heroes and villains and the same human interest stories - police delivering babies - popular everywhere.There is lots of information in Vietnamese, English and French and the commentary gives and interesting view on the struggle for independence and the meaning of law and order in a communist state.Not a destination museum, but look in if you are in the area. It's in the French District a stones throw from the prison museum and you can cool down with the air con while getting this extra view of the justice system."
        }
    ]
}