{
    "category": "Hanoi", 
    "entity": "Fine-Arts-Museum", 
    "avg_rating_stars": 4.240143369175628, 
    "review_count": 558, 
    "rating_stats": {
        "poor": 10, 
        "average": 73, 
        "terrible": 3, 
        "very_good": 236, 
        "excellent": 236
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "Hiddent gem. This is a hidden gem. The antique bhuda statues are superb. You can see it up close. Much better than many bhuda statues you can find in China."
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "What a wonderful place. A quiet and highly recommended escape in the noisy Hanoi. Beautiful expositions ranging from laqueurs to painting made on silk. Also well preserved stone and wooden engravings. Very happy we came here. Was quite impressed the art is not infused with revolutionary or war themes one would expect. Only one hall dedicated to that. Most of the art depicts people and nature. The whole tour on three floors will take you no more than 1.5 hours. If you manage to cross the street try the orange labelled coffee shop called Chat&Date."
        }, 
        {
            "index": 3, 
            "rating": "4", 
            "review": "Contemporary fused with history. The fine arts museum rapidly shifts from extremely historic pieces of dynasty art in Vietnam to contemporary fine art gallery displays. A great exhibit that is only let down by the somewhat state of disrepair of the museum itself."
        }, 
        {
            "index": 4, 
            "rating": "4", 
            "review": "A great place. If you like art. Really isn't my cup of tea, however the wife liked it a lot. Lots of interesting sculptures, paintings etc. If you are into art, this is a must see!!"
        }, 
        {
            "index": 5, 
            "rating": "4", 
            "review": "worth the visit. it is well displayed and you can take your time to understand the history of vietnam. it takes you from the current times to way back in history. you need to spend quite sometime to really appreciate the beauty of this place. worth every dong paid to go in."
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "Historic and modern. Really cool that the museum takes you through a journey of Vietnam history from ancient times to modern day. Easy to negotiate your way around."
        }, 
        {
            "index": 7, 
            "rating": "4", 
            "review": "Fine Arts Museum. Located in the system of national museums in Vietnam, under the Ministry of Culture, Sports and Tourism, the Vietnam Fine Arts Museum is considered one of the museum with the most important position in the retention and development promote the cultural heritage of the community arts Vietnam peoples. Founded in June 1966, the mission of the Museum is to study, collecting, exhibiting, preserving the heritage and art of the country to the public at home and abroad."
        }, 
        {
            "index": 8, 
            "rating": "5", 
            "review": "Go there: it's a delight!. Delightful place to spend a morning. In part, it illustrates how European techniques and concepts impacted on traditional Vietnamese art.VND300K to get in. And it's air-conditioned :)"
        }, 
        {
            "index": 9, 
            "rating": "4", 
            "review": "Allow 2 hours+ plus here. A wonderful display that must have taken years to acquire. Many rooms full of Vietnam's incredible history."
        }, 
        {
            "index": 10, 
            "rating": "4", 
            "review": "A gem. This is our third trip to Vietnam and I don't know how we missed this gem of a museum. The museum is quiet large 4 floors and 2 separate buildings. It is a little hard to navigate but otherwise it is great. It is well lit, the explanations are in English, French and Vietnamese, and it is air conditioned. It encompasses several hundred years of art. It has a very interesting lacquer painting exhibition with good explanations. A little too much war paintings for my taste but then they have had many years of war."
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "Nice Window Into Vietnam's History and Culture . Stopped by on the way from Temple of Literature to the Citadel. In the modern day section I expected to be hit with lots of propaganda, but found much more than that. I had a glimpse into how the artists held on to their sense of what is beautiful through their nation's decades of struggle against outsiders. The one that especially drew me in is a work called \"Lantern Festival\" dated 1965 if I am not mistaken. I encourage you to see for yourself."
        }, 
        {
            "index": 12, 
            "rating": "5", 
            "review": "Excellent museum. Great place to visit, the artworks on display are well presented and vary greatly in style & subject matter.If I recall correctly there is kitchenware & art shop in the front courtyard that is also worth visiting."
        }, 
        {
            "index": 13, 
            "rating": "4", 
            "review": "Viva la revolucion!. As you'd expect, the vast majority of pieces here are from the last century, although there is a good collection of ancient artifacts as well. The aircon doesn't work very well, but the place is clean, typical of a Vietnamese museum. We thought it was well worth the visit, and it's close by Uncle Ho's mausoleum, so you can do it the same day. Recommended."
        }, 
        {
            "index": 14, 
            "rating": "4", 
            "review": "Gift shop - Beware when buying art. I spent 2 hours at the museum, it was incredible and I highly recommend it to art lovers. I then spent another hour in the museum shop and after much consideration decided to purchase a painting. The amount was agreed on and we discussed the additional cost of postage to Australia. Come time to pay the sales woman suddenly increased the price considerably. I was with my two adult children who witnessed this and were involved in the cost discussions. Sadly I didn't buy the painting and left feeling annoyed. I understand this is a common cultural experience when buying in Asia, however I did not expect this in such a setting and when the price was already considerable."
        }, 
        {
            "index": 15, 
            "rating": "4", 
            "review": "A neglected gem. This small but interesting collection of Vietnamese art is housed in a beautiful period villa. The collection includes a variety of works from very early eras to quite recent. I enjoyed the sculptures particularly. During my visit I only saw two other visitors! The gallery is airconditioned and was a pleasant respite on a sweltering day. One gets the impression that displays are quite static, but nevertheless I would probably make a return on my next visit to Hanoi."
        }, 
        {
            "index": 16, 
            "rating": "4", 
            "review": "Spirit and History. Some beautiful and moving sculptures and paintings. An emotional ride through Vietnam's spiritual and historical past."
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "Amazing Art. If you want to have a look inside the creative/artistic minds of art from Vietnam over the years, you have to visit this gallery. Various art styles throughout the gallery and for such a cheap entrance fee at that! Only $1.30 Canadian!!! The day I toured the galleries, very few tourists were there and I could savour each gallery quietly on my own. No rush to transition from gallery to gallery."
        }, 
        {
            "index": 18, 
            "rating": "5", 
            "review": "LOVELY COLLECTION OF CONTEMPORARY PAINTINGS. Amazing Vietnamese painters very reminiscent of the French impressionists. Cute still lives with local fruits. There is more old art in the history museum."
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "Very nice museum & gallery. This excellent Fine Arts Museum is housed in two buildings that were once the French Ministry of Information. Treasures abound, including ancient Champa stone carvings and some astonishing effigies of Guan Yin, the thousand-eyed, thousand-armed goddess of compassion. Look out for the lacquered statues of Buddhist monks from the Tay Son dynasty and the substantial collection of contemporary art and folk-naive paintings. Guided tours are available for 150,000d."
        }, 
        {
            "index": 20, 
            "rating": "4", 
            "review": "impressive. various fine arts on exhibition. nice place for those who appreciate and possibly find some ideas of creation"
        }, 
        {
            "index": 21, 
            "rating": "4", 
            "review": "Better than other museums in Hanoi!. The building itself has a lot of character, and it is interesting to see the history of Vietnam through the evolution of their art."
        }, 
        {
            "index": 22, 
            "rating": "3", 
            "review": "my wife liked it, but not as good as similar museum in saigon. Lovely building, we went on a hot day and the place did not sell drinks, so our stay was not as long as it probably should have been. Admittance very cheap"
        }, 
        {
            "index": 23, 
            "rating": "3", 
            "review": "Not much to see. A brief overview of Vietnam's art from antiquity to the 20th century. Not very informative- the artworks were not described or explained in any way."
        }, 
        {
            "index": 24, 
            "rating": "3", 
            "review": "fine arts in real terms. located in hanoi vietnam,its a museum showcasing fine arts of vietnam from a range of historic periods..."
        }, 
        {
            "index": 25, 
            "rating": "4", 
            "review": "Moving pieces from the past. Very interesting to see Viet Nam's history through the eyes of artists. There are some very moving bronzes and stirring pictures here."
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "For Art lover or anyone who likes art and a bit of history.. We had a great time wondering here. There are 3 floors of Art, silk painted, sculpture, wood works both very old and contemporary and much more. We have learnt so much about Vietnam History and really admired it. The only let down was the flow of each room was a bit inconsistent, as if it needed a major renovation of the whole building and so able to rearrange the art works.Tickets can be purchased at the front gate for a small amount of money. It is also good in a rainy or super hot day."
        }, 
        {
            "index": 27, 
            "rating": "4", 
            "review": "Silent place with different stages pictures of Vietnam. Various stages of Vietnam and it is air-conditioned though it is not strong enough. But a nice place to know vietnam more."
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "Top museum in Vietnam. First, it's a very cool place to spend an afternoon on a hot day (which describes every day of my entire two week trip to the area). Most rooms in the museum are air conditioned, though bathrooms, stairwells, and one or two other areas aren't.Second, the price is right. Entry was 30,000 VND, which was less than $1.50, and I easily spent two hours there and would have enjoyed being able to spend an hour more. I rushed through the top floor and the second building, but if I had taken my time about it, I think it could have been a very pleasant 3 hour visit.Third, the art was pretty fantastic. The ground floor, in particular, with all the ancient art, was really interesting. The middle floor had some older work and some newer work- it's a little odd, but they seem to have organized the displays almost entirely by the type of medium instead of thematically or chronologically. For instance, there's one room of works on paper, and one gallery of work using laquer, and one room with works on silk. In a given room, there may quite a range of art. I think it would be a hard place to find a particular piece, but to wander around in, it was very pleasant.Some of the signage isn't translated very well, but there is at least some English signage just about everywhere, and you get the general idea.The ground floor of the main building was mostly older art, with many religious-themed items and quite a bit of sculpture. Upstairs one level from there is mostly paintings, a few sculptural pieces but much more emphasis on 2D artwork. There was a room or two on the middle level which I would characterize as Vietnam War propaganda art, and certainly the more contemporary art on the top floor had many pieces that were clearly influenced by the war or war propaganda- the victorious or courageous soldier portrait being a common theme.Don't neglect the second building, which is off to the left of the ticket office (the main building being straight ahead). It has a basement with ceramic art and a floor of household items, including clothing and decorated or traditional objects, which was all very interesting and I would have liked to have more time to explore.There weren't very many visitors there, though I was there on a weekday morning, so maybe weekends are busier. I had the feeling the guards outnumbered us, but it was nice not to feel crowded or rushed. The place was fairly quiet. In a way, it's too bad- people are missing out!I saw several museums in Vietnam, and this was definitely the best. Great art, English signs, air conditioning, for a tiny entry price."
        }, 
        {
            "index": 29, 
            "rating": "4", 
            "review": "A welcome respite from temples and pagodas. As much as I loved visiting Ho Chi Minh's Mausoleum, Museum and grounds where he lived I loved viewing the great art diversity in one museum from modern to classic. Well worth the visit and it showed Vietnamese history in a different way. The building was well worth a visit in its own right, value again at 30,000VND a person"
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Cool off and enjoy the art. We visited this lovely museum on a hot hot day in a Hanoi, when we were all exhausted from the heat. It's quiet, cool, and the collection of sculptures and paintings through the ages just right for an hour's visit. We left feeling refreshed and ready to cope with Hanoi's busy streets again."
        }, 
        {
            "index": 31, 
            "rating": "4", 
            "review": "Don't miss for the price. At 30,000 Dong it is worth a visit to this gallery/museum, make sure you don't miss the contemporary art room hidden on the second floor. Although much of the art is very much the same throughout it is interesting to see the development of art styles as Europe's influence shapes the pallets and details. Then further how things change once the French are pushed out and Vietnam tries to find its own artistic identity."
        }, 
        {
            "index": 32, 
            "rating": "4", 
            "review": "Interesting. There wasn't a great deal of art there but what was there was well worth the visit. The ceramic display was amazing and in the coolest part of the building"
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "A must see in Vietnam. For anyone who loves a bit of history and some great artwork this is a good place to start. Housed on three levels there is an array of etchings, statutes and paintings highlighting some of the great history of this country."
        }, 
        {
            "index": 34, 
            "rating": "4", 
            "review": "Recommended for a rainy day. I didnt have so much of expectation but it was nice enough to spend 2-3 hrs inside, especially the temporary exhibition was very nice . 2nd floor was definitely nicer than the first floor so dont give up too soon!"
        }, 
        {
            "index": 35, 
            "rating": "3", 
            "review": "Not bad. The art is very big but I saw it quite small museum and may be can not show Vietnamese art it is foreign art in Viet Nam"
        }, 
        {
            "index": 36, 
            "rating": "5", 
            "review": "History through artistic forms. Such a varied and well curated gallery. Some really impressive stone carvings and paintings - sculptures are thought provoking depicting more recent times. It seems the conflicts have shaped the VN psyche but also provided artistic expression. Cool oasis for reflection."
        }, 
        {
            "index": 37, 
            "rating": "4", 
            "review": "Very nice on a rainy day. This museum shows Vietnamese art through its centuries. I found it being very interesting as I didn't know much about it before we came. It's easy to see influences from other countries like Japan and China. The museum is bigger than I thought and it took us approx 2,5 hours, but we didn't rush it through so you can definitely go through it in 1 hour. But it was time well spent on a rainy day."
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "Art through the centuries well presented. We were so impressed with this museum as we were able to see the art of all of Vietnam as throughout the various periods and up to the present."
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "Gem of a museum in Hanoi. I had some spare hours before my flight, on Mondays many museums seem to be closed and we had already visited some of the main sights. I loved this, it was calm and peaceful. I saw some interesting unique art at my pace. I would recommend thoroughly. A visit to the gift shop resulted in some lovely souvenirs. I ended wishing I had more time !"
        }, 
        {
            "index": 40, 
            "rating": "3", 
            "review": "Overrated. I was looking forward to coming her, but was disappointed. There are some interesting pieces, and there are some great bits of pottery towards the end. However, there is a lack of variety in the collection and a lack of developed explanations about movements and artists."
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "The museum of Nation!. I visited several of art museums in every country I traveled. Here is only museum where you can feel strong, rustic and groomy asmophere. I guess that's how here express their people."
        }, 
        {
            "index": 42, 
            "rating": "4", 
            "review": "An overlooked cultural surprize. After 4 trips to Vietnam over 10 years we finally made our way to this museum. We never realised it was just across the road from the Temple of Literature as it's not overly hyped. This is probably the reason we only saw a few other visitors during our hour and a half explore. The museum houses quiet a large collection: paintings, sculpture, textiles and ceramics. There could be better direction given, we did get a floor plan but tended to meander all over the place. There are lots of interesting art works, especially lacquer paintings and I really wanted to understand the lacquer painting process but info was scarce. The modern art section was small but interesting with a couple of pieces interesting enough to get me onto the internet back at our hotel to find out more. If you have plenty of time in Hanoi or are visiting the Temple of Literature you could add this one to your day and finish with lunch at the wonderful KOTO (Know one, teach one) restaurant, all within easy walking distance of each other."
        }, 
        {
            "index": 43, 
            "rating": "4", 
            "review": "A pleasant collection of contemporary artwork. The gallery is very peaceful and pleasant to visit. We were surprised that there wasn't more visitors! The collections inside are curated very well and demonstrate artwork from the early 20th century, traditional techniques and a small gallery of modern art. There were some excellent examples of war paintings and a lot of varieties of techniques such as engraving, wood cut prints, statues and oil paintings. There are captions relating to each room to give you a brief description of each collection. We really enjoyed seeing the modern/contemporary artworks and only wished there were more! I would recommend a couple of hours to see the gallery in full as there is a great deal of work."
        }, 
        {
            "index": 44, 
            "rating": "4", 
            "review": "You don't have to be arty to appreciate this. Several stories of galleries across two buildings. An excellent attraction to combine with the Temple of Literature.Wide ranging collection of art, with something that will appeal to all. We easily spent about an hour and a half here.Maybe not a must-see in Hanoi, but definitely worth a visit."
        }, 
        {
            "index": 45, 
            "rating": "5", 
            "review": "Loved this. I am an art fanatic and it was so good to see the works of many Vietnamese Masters.The tour will take up at least 2 hours including the ceramic display.Absolutely loved it."
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "Excellent Museum. Interesting collection of Vietnamese pieces, there is a significant collection of post 19th Century paintings that show the crossover East and West. Allow a couple of hours in this fine building"
        }, 
        {
            "index": 47, 
            "rating": "4", 
            "review": "Very good for art lovers, add some modern galleries to your itinerary for a contemporary view. The Fine Art Museum has three levels with a good variety of work, from carvings, laquer paintings, to silk paintings and a small bit of more contemporary work. There are lots of interesting Buddas. The gift shop has some beautiful work too. On the whole there is a sentimental feel to alot of the more recent work, so I suggest adding in some contemporary gallery visits to your day to get an authentic voice from modern artists (e.g. Nguyen Art Gallery)."
        }, 
        {
            "index": 48, 
            "rating": "4", 
            "review": "Worth visiting. Excellent collection of ancient and modern art and history. There are two main buildings make sure you visit both."
        }, 
        {
            "index": 49, 
            "rating": "1", 
            "review": "Waste of time. We have been address to this museum from the lonely planet. I believe there is nothing special in it! Nothing at all! You will be better off saving your time and do something else. Irrelevant!!"
        }, 
        {
            "index": 50, 
            "rating": "4", 
            "review": "Great surprise!. while not planned, I decided to visit this museum passing by (and looking for a little bit of freshness). What a surprise to discover amazing paintings and laques. Art from 30's-40's particularly pleased me. I did not know very well laque work but they are really amazing there, as well as wood carving. The evolution or mix of technics between Asian ones and Western ones is also very interesting. And G/F with sculpture and statue also woth it. Just did not like the silk art. There is also 2 levels dedicated to decorative arts in VN daily life. I hardly recommand this visit."
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "Amazing. This is a secret highlight with 20 th century arts that are stellar. And you can take photos. A bargain and gem and much of it air conditioned."
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "Well worth a visit . The museum is in a very fine French colonial period building, just north of the Temple of Literature.\nThere are some fantastic Buddhist and Hindu works on the ground floor, and interesting lacquer works and socialist realist art from the modern period upstairs.\nItems are well labelled in English."
        }, 
        {
            "index": 53, 
            "rating": "4", 
            "review": "Good mixture of the old and new. We had a lovely couple of hours here. There is a real mix of the ancient and the new. There is plenty of space for the exhibits and they have sufficient information. The newer collections reflects the country recent history with a high degree of propaganda running through, which is a nice antidote to the \"hollywood\" version of events. Only slight issue was the lack of a coffee shop. I would also recommend getting a taxi as its a little difficult to find and further out of the centre than the maps suggest."
        }, 
        {
            "index": 54, 
            "rating": "4", 
            "review": "Get a glimpse of Vietnam art. I was not expecting much but this museum is worth checking out. The art is unique to Hanoi. There is quite a large collection of art."
        }, 
        {
            "index": 55, 
            "rating": "3", 
            "review": "Curation a bit messy. You need some time to see all the artworks here. They aren't really organised in time as you walk up amd sround the floors, so it's not so easy to follow a timeline in the evolution of art. Interesting pieces, however, and you can see the change. Smells of humidity in most rooms."
        }, 
        {
            "index": 56, 
            "rating": "4", 
            "review": "Impressive collection of Vietnam fine art. This is a huge museum and needs to be visited in about at least 2,5 hours. Art collection of Vietnam from the Stone Age to contemporary art as well as Vietnamese traditional art. This is a good place for art lovers. Remember there are two exhibiting buildings and you should not miss the ceramic collection in the basement."
        }, 
        {
            "index": 57, 
            "rating": "4", 
            "review": "Nice museum.. This is Vietnam's primary art museum, showcasing fine arts from all different periods. It is worth a visit when you are in Hanoi. It also has a nice gift shop."
        }, 
        {
            "index": 58, 
            "rating": "4", 
            "review": "Very impressive. The ground floor introduction to the museum I found the most surprising. Some great stone carvings depicting people, deities and animals dating back to the 5th century display a love of art and storytelling. Most surprising was the early Hindu works before buddism arrived in Vietnam.The paintings works were mostly Somber works which is mostly from the French and American occupations so is understandable."
        }, 
        {
            "index": 59, 
            "rating": "4", 
            "review": "Nice curation over three floors covering over 2500 years of art history. We had just a few hours before we left for the airport. The Fine Arts museum was the perfect destination and a great way to end our trip to Vietnam. We spend a little over an hour and felt very good about our time there."
        }, 
        {
            "index": 60, 
            "rating": "4", 
            "review": "arts museum. great place to visit , allow yourself a few hours to see everything .So many great stories and fine arts to see"
        }, 
        {
            "index": 61, 
            "rating": "5", 
            "review": "Beautiful Wood Sculpture.. Vietnamese wood sculpture is very beautiful. It is meticulous art work. I am glad that i went to fine arts museum (Bao Tang My Thuat)."
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "Fantastic Museum. Brilliant laquer works and the mid 20th century paintings are superb depicting life during the French and USA periods. I would recommend this museum to anyone with a morning or afternoon to spare whilst in Hanoi."
        }, 
        {
            "index": 63, 
            "rating": "4", 
            "review": "Local art gallery. A spacious well ventilated, architecturally splendid building with displays on 3 floors of local art, ceramics and tribal customs. Entry fee VD30,000 which includes a free guide map to exhibits. There is a clear explanation to all items in Vietnamese, French and English. The historic periods cover prehistoric times to modern day. There is a gift shop on site but no eating or drinking facilities ."
        }, 
        {
            "index": 64, 
            "rating": "4", 
            "review": "I had no idea abut Vietnames art, now I have. After the 80s, Vietnamese artists developed partly epigonist, but there are also very many surprising works (and a different use of the laquer technique)"
        }, 
        {
            "index": 65, 
            "rating": "4", 
            "review": "Worth a visit, nice paintings collection... I enjoyed the beautiful collection of silk paintings and lacquer paintings for only 30 000 dengs. The museum has 3 levels dedicated to paintings and sculptures and there's quite a lot to see. There are also another small section in another building which exposed ancient ceramics, clothes and artifacts as well as midern temporary exhibition. The only issue is the limited explanation and only the year and the name of the object are mentioned. Also some of the exhibition rooms are not air conditioned and it can get hot. But a visit is still worthy."
        }, 
        {
            "index": 66, 
            "rating": "5", 
            "review": "Stunning. My favourite attraction in Hanoi. This museum has stunning collections of art throughout Vietnamese history, including some powerful war sculptures. Really enjoyed the lacquered wood, a beautiful influence from French art amongst others"
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "Beautiful, and surprising. I was amazed and delighted by the art displayed here. It truly gives you a sense of Vietnam through the eyes of artists. There are some wonderful art works on display and it's worth visiting."
        }, 
        {
            "index": 68, 
            "rating": "4", 
            "review": "Very interesting and good expositions of works. We were here for about 1,5 hours and it was really very interesting. Good overview of the works. Good explication in both French and english"
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "Vietnamese Art. We wandered in here on a whim and were really surprised by how much we enjoyed it. It is cool and calm inside which is an immediate relief from the city outside and there are several floors of paintings and sculptures on display. It showcases the diversity of local art and we found it quite fascinating. We were the only people there for the entire time we spent there."
        }, 
        {
            "index": 70, 
            "rating": "5", 
            "review": "An unexpected delight. This was not on our Hanoi 'to do' list, but we were on our way back to our hotel and were passing by when the gardens caught our attention. So we thought we would go in - and were so very glad that we did.This compares very well to good European museums in layout, lighting and information provided. It is not huge, but is probably larger than you first think it will be and if you have an hour or so it is a fantastic place to visit. It is well laid out with your visit going through the ages.Some (many) of the pieces are just superb and have an emotional impact to them and their history. Do not miss the separate wing after the (good) gift shop, this has astonishing clothing and other pieces. If you enjoy a bit of art/sculpture (historical and modern) this is highly recommended!"
        }, 
        {
            "index": 71, 
            "rating": "5", 
            "review": "Exceptional!. Considering so much was destroyed by ongoing wars, this houses an impressive showcase of Vietnamese art from the 20th & 21st centuries."
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "Great for people who love the history. It is a good place to learn about the Vietnamese history through its historical masterpieces from past to present.\n30.000 VND/person"
        }, 
        {
            "index": 73, 
            "rating": "5", 
            "review": "very nice visit.. Lovely, A maze of rooms full of a variety of art works. Continue > signs guiding you through. A very nice visit."
        }, 
        {
            "index": 74, 
            "rating": "5", 
            "review": "MIX OF OLD AND NEW PAINTINGS. Enjoyed this place a lot. Very mixed displays of Vietnamese art, statues and artifacts. Layout meant it was easy to gt around. Not very busy so I presume it is rather overlooked, which is a shame"
        }, 
        {
            "index": 75, 
            "rating": "5", 
            "review": "A comprehensive collection of Vietnam's art and sculpture. An interesting collection of Vietnamese art and sculpture through time. A well-appointed gallery by Asian standards."
        }, 
        {
            "index": 76, 
            "rating": "3", 
            "review": "Acquired taste. If you are into old and modern paintings then this is for you. If you are into more interactive museums then skip this. Lots of statues and paintings with explanations. We found it a bit boring and wish we had spent our money on the Hao Lo Prison instead. Fee is 30 000D pp, like most other tourist attractions in Hanoi. The saving grace for me was the smaller exhibit on historical artifacts and ethnic clothing. The wooden armoires inlaid with mother-of-pearl were exquisite."
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "Excellent and often neglected museum. Other museums receive more attention, but this museum in the embassy district within easy walk of the old quarters should not be neglected. The collection of ceramics in the basement floor is superb, and the paintings, textiles and other objets d`art are excellent. The entire museum demonstrates that Vietnam is more than ideology and recent military history. Take some time because the museum is larger than it appears. It is well laid out and most of the explanatory texts are in English as well as Vietnamese."
        }, 
        {
            "index": 78, 
            "rating": "5", 
            "review": "Great Collection of different times. Unexpectedly interesting. No guide required as the description were pretty detailed. It is a 20 minutes walk from old quarters. Closes at 4.30pm."
        }, 
        {
            "index": 79, 
            "rating": "4", 
            "review": "Excellent overview of Vietnamese modern art. Many touristic itineraries leave this excellent museum aside. It would, though, be a pity not to visit it, as one gets a complete picture of Vietnamese art in the last two centuries. Most of the paintings (mostly lacquer, but also oil, watercolour, silk) refer to the independence war, but there are a few contemporary paintings depicting daily life. One shouldn't miss the museum's souvenir shop, as one can find there several items of excellent quality at very reasonable prices."
        }, 
        {
            "index": 80, 
            "rating": "4", 
            "review": "Surprisingly Good Collection. Good place to spend a few hours to escape the rain or heat of Hanoi. They had a surprisingly nice collection of paintings and some very good buddhist and cham statues."
        }, 
        {
            "index": 81, 
            "rating": "4", 
            "review": "Great collection and great store!. Interesting collection covering many eras - not least an interesting contemporary collection. Also, make sure you visit the art sale room upstairs (one of two or three small stores there) which sells original works of art by living Vietnamese artists. Look and buy!!"
        }, 
        {
            "index": 82, 
            "rating": "3", 
            "review": "Good for a rainy day. We attended with small children so it was difficult to keep their attention, they did enjoy the first floor statues, some beautiful works."
        }, 
        {
            "index": 83, 
            "rating": "5", 
            "review": "Beautiful collection and historical perspectives.. We enjoyed a lovely afternoon at this museum An amazing collection highlighting the rich history of Viet Nam."
        }, 
        {
            "index": 84, 
            "rating": "4", 
            "review": "Art works. Amazing. Works from many eras.\nSome fantastic mediums. Sculptures of monks very special.\nShop sells local artists works for fair prices for original works. Bought marble box made up of 3 sections.Much dear in Old Quarter"
        }, 
        {
            "index": 85, 
            "rating": "4", 
            "review": "good exhibit of modern art. the collection is quite interesting - almost french paintings - but with a lot of \"war items\" in the pictures and scultures\nmuseum shop with good collection of books"
        }, 
        {
            "index": 86, 
            "rating": "5", 
            "review": "Great variety of art. A great mix of art, well displayed on three levels. Perfect for a rainy day in Hanoi. Beware of replicas on some of the artifacts on the first floor."
        }, 
        {
            "index": 87, 
            "rating": "4", 
            "review": "Interesting Vietnamese Arts Museum. A small museum exhibiting some excellent vietnamese cultural works.\nNice artwork and paintings by Nguyen Van Ty and Huynh Van Gam (Miss Lien Painting) and statutes of Ms Vo Thi Sau by Diep Minh Chau and Nguyen Hai.\nWorth a visit for the art works depicting the revolution from 1956 into the 1960s."
        }, 
        {
            "index": 88, 
            "rating": "4", 
            "review": "Worth popping by... At a mere 30.000 dong per person, it is a relatively cheap place to pop by. The only con I could think of, is that there are not many signs as to where you can see what. This is only a minor thing, and really, you can walk all over the place in the order you see fit :) we started from below, and worked our way up, in each of the two buildings. The different paintings are interesting, and especially the clothing and artifacts in the top floor of the secondary building was something I particularly enjoyed.The basement has a ceramic display, and then it is primarily is sculptures and paintings for the remainder. Really good place for a rainy day, or if you just need to spend a couple of hours on something different. "
        }, 
        {
            "index": 89, 
            "rating": "3", 
            "review": "Nice small museum. A nice small museum with vietnamese art, near the temple of literature. Go if you have time. Cheap ticket."
        }, 
        {
            "index": 90, 
            "rating": "4", 
            "review": "Good place for a rainy day. If youre into art and history this is a great wee place. Both old and modern works.Spend around 1.5hours here.If youre walking from the old quarter to here, there are many really cool cafes along the way"
        }, 
        {
            "index": 91, 
            "rating": "5", 
            "review": "Amazing place. Not sure why this place is not so popular among locals and tourists. I think this museum is one of the best museums I've ever been to. Very well-organized and nicely displayed. A lot of valuable piece of art was represented there. You can understand more about Vietnam art and how it changes from the old time to now. I love the modern art displayed there, they are colorful and eye-catchy. Worth my time!"
        }, 
        {
            "index": 92, 
            "rating": "5", 
            "review": "Fine arts are always a must see!. A varied and interesting selection of Vietnam s artifacts, paintings, sculpture and many other works of art. On the second floor, the exhibition contains some of the county s best lacquer paintings and on the third floor there are many watercolor and oil works."
        }, 
        {
            "index": 93, 
            "rating": "4", 
            "review": "Beautiful setting for an interesting collection. We visited here 14 years ago and were dismayed to see so many of the art works open to the elements....but not now! The buildings have been refurbished beautifully, the galleries are well displayed and they have really excelled in their efforts to become a world class gallery."
        }, 
        {
            "index": 94, 
            "rating": "4", 
            "review": "An excellent collection of artwork.. Great presentation from all periods and media but perhaps the most impressive is the contemporary. It made us question why we Westerners still view this country as a \"developing nation\"."
        }, 
        {
            "index": 95, 
            "rating": "4", 
            "review": "Very good museum. It's also huge - you could spend hours in here, and it comes as welcome relief from the heat and humidity outside. Strangely, perhaps because it's slightly out the way, there was virtually no-one here though."
        }, 
        {
            "index": 96, 
            "rating": "5", 
            "review": "The most important Fine Arts Museum in Vietnam. A small but stunning collection of fine arts arranged chronologically from the bronze age to the present. Do not miss the gorgeous rooms of 18th century larger-than-life lacquered wood sculptures of monks. There are English labels throughout. The small shop has some well curated books and gifts for sale. This visit really enhanced our understanding and appreciation of Vietnam's rich cultural history."
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "one of best museums of Hanoi. the biggest art museum in Hanoi where you can find different kinds of paintings from classic ones to quite contemporary."
        }, 
        {
            "index": 98, 
            "rating": "5", 
            "review": "Excellent Art Museum. With world-class collections, this fine art museum of Vietnam, located in Hanoi, is well worth a visit. Plan on spending at least two hours here to tour the many floors of art. Generally speaking the higher you go up in the museum, the more recent the art. My favorite pieces were on the top two floors, although each floor had many items worth visiting. This museum also boasts two very fine gift shops, from which we purchased many small paintings, prints, and lacquer ware at very reasonable prices for top quality work. I would strongly recommend visiting these gift shops for your souvenirs."
        }, 
        {
            "index": 99, 
            "rating": "4", 
            "review": "Interesting. Even Vietnamese find it interesting! Painting collections are quite interesting to me. However the museum does not display many prehistoric objects."
        }, 
        {
            "index": 100, 
            "rating": "5", 
            "review": "The best in Vietnam !. I've been to Art Museums in every city I've visited in Vietnam and this is by far the best! A wide variety of beautiful pieces which are all in excellent condition. They all have information tags and there are signs with history and influences (unlike other galleries). A very enjoyable experienceEntrance 40,000"
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "Surprisingly good!. I just walked in this museum after visiting the Temple of Liturature but it turned out so great that I spent nearly 2 hours there. Very quite and academic museum with plentiful of art collections from the war time to modern life. I was attracted to the picture of Vietnamese women, I could feel the life and even imagine the story behind. The pottery display in the basement also a high-light of the museum. I want to recommend this place to all travellers who love arts and lacquer pieces. Well worth a visit!"
        }, 
        {
            "index": 102, 
            "rating": "4", 
            "review": "Fine arts. Really nice gallery, with plenty of interesting exhibitions showing the history of Vietnamese art. Doesn't take too long to see it all either."
        }, 
        {
            "index": 103, 
            "rating": "4", 
            "review": "best of its kind in Vietnam. Hanoi fine art museum is the best of its kind in Vietnam. With the selection of pictures and statues, the Museum offer the visitors to learn about the development of Vietnam art since thousand years before until now. The museum also very easy to reach, if you visit the Temple of Literature, the Museum is just walking distance from this famous point."
        }, 
        {
            "index": 104, 
            "rating": "4", 
            "review": "An Interesting Art History Museum. A mostly chronological series of exhibitions, roughly divided into periods from the ancient to the contemporary, with some sectioning for specific genres (such as religious sculpture). Nicely curated, mostly interesting (though this varies, it was a little too heavy on the quasi-European late 19th/early 20th Century 'influenced' work, and not enough on the contemporary period for me), spacious, with a nice ambience. The gift shop is surprisingly good too. Get there early before all the hideous tour groups swarm the place out incessantly taking photos and talking loudly."
        }, 
        {
            "index": 105, 
            "rating": "5", 
            "review": "Pleasant surprise at the Fine Arts museum. After the craziness of the Temple of Literature across the street during Tet, we had a very pleasant surprise at the calm and quiet and excellent collection in this museum. It's all Vietnamese from works BC to present day. All well presented and very interesting. Don't miss the basement collection of pottery."
        }, 
        {
            "index": 106, 
            "rating": "3", 
            "review": "Visit FA Museum before buying street kitch. It was good to visit the museum before purchasing any of the street art on display. The museum offered a good appreciation for traditional art, as well as a better understanding of rate development of art in Vietnam in the 20thC."
        }, 
        {
            "index": 107, 
            "rating": "5", 
            "review": "Fine Arts Museum. Museum contained purely Vietnamese art from BC through to present day. Really interesting - showing sculptures, art reflecting the war in Vietnam as well as some more contemporary things."
        }, 
        {
            "index": 108, 
            "rating": "5", 
            "review": "Lots to see!. There is a lot of various artwork here that will keep your interest if you're into art or museums in general. The artwork is organized well and is pretty good. A lot of the woodwork is amazing. The gallery shows the development of Vietnamese art over time during different periods that affected Vietnamese life. If you can spare an hour and 40,000 VND, then I recommend that you give this place a visit."
        }, 
        {
            "index": 109, 
            "rating": "3", 
            "review": "Interesting Paintings. This museum is for art enthusiasts and historians. It is not particularly well maintained and the museum does not hold the best pieces master artists. Worth while to just visit for a sense of the cultural and artistic depth of the very good and creative paintings that Hanoi is known for."
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "Fine Art for a Foul Day. Today I visited the Hanoi Fine Arts Museum on a cold wet winter’s day in Northern Vietnam. A fair-sized building in the middle if town, it has three floors, all connected by stairs at either end of the spacious building. At each side of the impressive edifice there are both genders of toilets located helpfully just by the stairways. Each of the floors has multiple fair-sized rooms connected by various walkways linking the various different parts of the adequate structure. The floor surfaces continuously unite various different parts of the exhibits wrapping around in a meandering sense.Following an eight-year absence from the onset of the great recession, I returned recently to travel throughout Vietnam and Cambodia. These Third World countries, to use the vernacular of the outdated “Three Worlds” model, seem to have come a long way. For a Communist dictatorship, Vietnam sure has a lot of Prada: Welcome to the Bourgeois revolution! Cambodia’s present-day open market system and regime stability has led to increased investment all around; for example, Siem Reap used to be a sleepy little hovel with some awesome nearby temples, and now its streets are lined with 5-star hotels. In terms of Gross Domestic Product (GDP), both Vietnam and Cambodia are currently among the world’s fastest-growing, pushing 7%, led by India at 8%, while the large Chinese tortoise plods at around 6%. While this is driven mainly by global integration, I would say to you now, come visit these places while they still retain a palpable measure of uniquely identifiable ancestry. See more at journeymanblog.com"
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "Beautiful art collections. If you are at all interested in Vietnamese art, and not just the tourist pictures of girls in ao dai then a visit to the Fine Arts Museum is a must. There are some amazing sculptures from temples and collections of paintings that show the development of different styles of Vietnamese painting. Don't buy art in Hanoi until you have been to the Fine Art Museum, as the Museum Shop has a huge range on offer."
        }, 
        {
            "index": 112, 
            "rating": "5", 
            "review": "Great cultural overview. Very impressed with the depth of material at Fine Arts Museum from historical artifacts to contemporary exhibit."
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "if you are a fan of Fine Arts. if you are a fan of Fine Arts, this place must be in your list while being in Ha Noi. At first, there you can see pictures of modern images of Vietnam and at the same time old ones."
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "Lovely museum. We visited today on a cold rainy day. The museum was not heated at all and very cold inside. But what treasures inside! A lovely collection from the ancient to the 20th century. Much more well-cared for than the Fine Arts Museum in Ho Chi Minh City. A great way to spend a rainy morning."
        }, 
        {
            "index": 115, 
            "rating": "5", 
            "review": "very cool museum. museum is well curated and covers ancient to contemporary work from what is modern day Vietnam. the lacquer rooms were especially cool.takes about 90 minutes to see everything"
        }, 
        {
            "index": 116, 
            "rating": "5", 
            "review": "Small collection with very interesting works. I would sincerely recommend this museum. They have a very nice, small collection of artworks that are rarely found in Vietnam!"
        }, 
        {
            "index": 117, 
            "rating": "4", 
            "review": "Really cool art!. Follow a little history as you travel through the many, many floors and rooms of art. Cool sculptures, carvings, engravings, and paintings of traditional and modern methods! Very interesting art :)"
        }, 
        {
            "index": 118, 
            "rating": "5", 
            "review": "An excellent reflection of history - even the kids enjoyed it. I did not expect this to be a highlight, especially with children aged 11 and 13. But I wanted to see it so I made them go. They actually really enjoyed it, as did I.As I said to the kids, art can tell you a lot about the culture and history of a place. Often it is only through artwork that we know some parts of history. In this case the more modern artwork was heavily influenced by the various conflicts, especially with the French and the Americans. My favourite pieces were the lacquer engravings, where they started with a black surface and the cut in the design and added colour."
        }, 
        {
            "index": 119, 
            "rating": "4", 
            "review": "Worth a visit.. A very good museum/gallery with exhibits spaced over three floors. The first floor has examples of early Vietnamese art from the 11th to 19th centuries, the second floor is for art of the first half of the twentieth century and it is worth pausing over depictions of the hostilities against both the French and Americans some of which looks to be naïve art and very striking. On the top floor there is a contemporary exhibition which is good in parts with some examples of socialist realism art."
        }, 
        {
            "index": 120, 
            "rating": "5", 
            "review": "Good collection. The French colonial building that houses the gallery is beautiful. The Gallery has a good collection of Vietnamese art overlast couple of centuries"
        }, 
        {
            "index": 121, 
            "rating": "4", 
            "review": "Pleasantly Surprised. Often I don't like Asian art (particularly styles like Japanese paintings). This museum had a really good range of paintings and statues etc that kept us occupied for about an hour. If you have the time an are in the area, I would recommend stopping in. Many of the paintings from the last century depicted the war in Vietnam in many ways which was really interesting."
        }, 
        {
            "index": 122, 
            "rating": "1", 
            "review": "Are you a Psychologist or an Academic?. I was so looking forward to this visit. I just recently made my second visit to MOCA in Bangkok which is such a spectacular showcase for (Thai) homegrown art. So after choosing to visit the Fine Arts Museum in Hanoi, I arrived with great expectations which were shattered as soon as I walked in. This museum is testimony to the repression, intellectual and artistic, that was endured during the Communist regime. It might be recommended for psychologists and academics. Not to the general public.Art galleries in various cities in Vietnam exhibit pictures by a generation of talented, creative and inspired artists. None of this energy is found in the Fine Arts Museum. I have read very favorable comments by previous reviewers, so what do I know?!! I'm just Joe Shmoe from Kokomo"
        }, 
        {
            "index": 123, 
            "rating": "3", 
            "review": "Another censored tourist attraction. About 95% of the works in this museum would not normally see the light of day in any self-respecting gallery in the Western World. Having said that, consideration must be given to the challenges facing artists in a communist society. There are some early art works that indicate that there might be more fine art works hiding in the vaults in the basement. The remainder tends to be about the struggle for independence with some very \"Dark\" exhibits in colour and themes. Censorship has demonstrated here what suppression can do to aspiring artists."
        }, 
        {
            "index": 124, 
            "rating": "4", 
            "review": "Fascinating but underappreciated. I’ve always like this museum, but I appreciate it more for its quirks than for its instructional qualities. The exhibits are arranged chronologically, beginning on the ground floor with the requisite nod to the Dong Son civilization and continuing on to more recent works on the upper floor. There’s also an adjacent building with textiles and ceramics. The wall texts are largely limited to dates, locations, and media. There isn’t much interpretive material provided in any language, and what has been translated into English can be incomprehensible. Despite that, visitors can still get a sense of major trends in the history of Vietnamese art. Visitors familiar with modern Western art will recognize the influence of Chagall, Picasso, and others in some paintings. The combination of European techniques and traditional materials, such as silk and lacquer, is striking. The museum lacks contemporary art, which can be found elsewhere in Hanoi at nonprofit and commercial galleries.Our taxi driver couldn’t find the museum at first. It’s across the street from the park containing the Temple of Literature (Van Mieu), which locals are more likely to know."
        }, 
        {
            "index": 125, 
            "rating": "5", 
            "review": "Peaceful environment with striking pieces . I was thoroughly pleased with my visit. Not only were there no crowds to navigate, the calibre of art was outstanding. I found myself taking pictures of piece after piece. Definitely not to be missed if you are in Hanoi. Make sure to check out the pottery in the basement too!"
        }, 
        {
            "index": 126, 
            "rating": "5", 
            "review": "Pleasantly surprised--also includes traditional textiles and clothes. Well presented, larger than expected, included textiles and traditional woven clothes. The museum in a beautiful colonial building, and the upstairs hallways themselves present great lighting in the afternoon for good photography. The gift shop sold original works from Vietnamese artists (such as local university Art Professors) for prices starting at 3 USD!"
        }, 
        {
            "index": 127, 
            "rating": "4", 
            "review": "Peaceful Environment. Near the frenetic activity of the streets of Saigon is this fine facility. It is a good place for some peace and quiet after the frenzy of the streets outside. Various periods of art are represented which give a good appreciation of Vietnamese art, such as lacquer art."
        }, 
        {
            "index": 128, 
            "rating": "5", 
            "review": "Interesting to see Vietnamese art develop through the centuries. After so many years of war, Vietnam is finding its way to make its own artistic expression in modern times--from the political art, to some that reflects the \"masters\" (impressionists, dada), it is interesting to find how artists are finding their voice appropriate to their own culture in modern times."
        }, 
        {
            "index": 129, 
            "rating": "5", 
            "review": "Outstanding. This museum and gallery is a combination of The V&A, British Museum and National Gallery in miniature. It has some excellent exhibits. It's collection of war period paintings is particularly strong. The signage is good. It is a modest 30k dong (less than £1) to get in. It is near The Temple of Literature, so great to \"do\" as a combo."
        }, 
        {
            "index": 130, 
            "rating": "3", 
            "review": "Large museum great for rainy days. Very lovely museum with a lot to see. Several floors. Check out the modern exhibitions first if you can."
        }, 
        {
            "index": 131, 
            "rating": "4", 
            "review": "Hard to find but worth the trouble. 68 NGUYEN THAI HOC STREET, HanoiNot an easy place to find. It’s in and about the diplomatic quarter in Hanoi. We wiggled and winded our way around until we kind or looked up and saw it. I am sure a taxi or hotel concierge would be helpful but we were already out on a self directed walking tour and wanted to meander anyway. The rotating exhibit was in progress/installation so we did not see that but the permanent exhibitions were a delight to see and the buildings were just brilliant to walk through. Well restored/preserved so to speak & nice staff. I had not seen lacquer painting before, at least not as a legit art genre, didn’t even knew they existed as such and was I ever impressed with the technical skills and composition and colors/textures, use of eggs shell of that style/medium. I was so impressed with the medium that I sought a gallery in Hoi An and bought a lacquer painting from an artist. Cost for the VNFAM is 30 VND. Clean toilets inside."
        }, 
        {
            "index": 132, 
            "rating": "5", 
            "review": "Wonderful Museum. I actually spent far more time here than I had planned. Some of the dislYs were so well done, and so interesting."
        }, 
        {
            "index": 133, 
            "rating": "5", 
            "review": "Worth a visit.. Very interesting insight into Vietnam's history and culture that is definitely worth a visit. Very quiet when we were there with few people."
        }, 
        {
            "index": 134, 
            "rating": "5", 
            "review": "Art about and by Vietnamese. Though on the small size, this well laid out museum is a gem. Ancient artifacts are on the first floor and then ending with modern times on the third. The influence of the prevailing style (ie. Cubism) makes an appearance and images of war find a place on the walls."
        }, 
        {
            "index": 135, 
            "rating": "4", 
            "review": "Wonderful. If you like art, if you are interested in revolutionary art, if you like ceramics - you are going to love this museum. It was on our list of things to do but, to be honest, I wasn't expecting too much. The first day we went it was closed due to there being 'no electricity' oh well... We went back today, paid our 40,000 Dong and boy! I'm glad we did. The collection of paintings and sculptures alone make it worth visiting. Three floors of beautiful oils, engraved lacquer and gouache works (mostly inspired by Vietnam's struggles), a few sketches and quite a few sculpted figures make this museum a must see. There is also a wing of ceramics which is worth a view. The souvenir shop Is nice but a little expensive and the restaurant, (shown on the site map) closed a year ago. Much, much better than I had anticipated. I would visit it again if we were staying longer.See it!"
        }, 
        {
            "index": 136, 
            "rating": "3", 
            "review": "Good collection, but.... It is a very classic museum, in the sense that is a collector museum with almost not interaction with the visitors.  Here you can enjoy a cultural heritage, where struggling, working, and honor of Vietnam are the key subjects, as well as landscapes, and habitat,  The sad spot in this museum is the art preservation. I felt that they don't really care about conservation-restoration of this fabulous cultural heritage. Paintings look like they are full of adherent surface deposits, the colors of the lacquer paintings are faded and many of them have lost their gloss, and you can see moisture stains in many of the works on paper. Maybe there is no enough budget to preserve and treat the artwork. It is really heartbreaking."
        }, 
        {
            "index": 137, 
            "rating": "5", 
            "review": "I go here every now and then. I have seen the regular exhibition many times with various people. Ina a sense, it is not very impressive. However, it does impress me. Having studied Russian socialist realism in the States, it was interesting to see a new view of this that is, indeed, culturally different from the former Soviet Union. Yes, the themes are the same; however, lacquered painting is both difficult as well as a true technique requiring great skill. You see a lot of this here. Look at the characters. Sense their fears, hopes and dreams. We are not much different, really. If there is a special exhibition there, do see it. You will see Vietnamese modern art and where it is going today. So many of the modern art shows are for commercial sales. Here, you see the real stuff and no salesmen! You get the time to become familiar with each piece, to relish it and to walk away with some very good feelings."
        }, 
        {
            "index": 138, 
            "rating": "5", 
            "review": "nice. nice place! nice collection! the building is nice too! you can see different type of local art so it's really interesting"
        }, 
        {
            "index": 139, 
            "rating": "4", 
            "review": "Make time in your schedule for this. This is an amazing exhibition.I'm not the experiences museum person, but I likes spending a few hours in this museum.There was such a diversity that you're bound to stop at some places because you like what you see.I lived the sculptures and some of the paintings were quite amazing to see.Some of the photo exhibition pieces were pleasant to spend some time on.Time : take at least 2 to 3 hours to go through all (could be more)"
        }, 
        {
            "index": 140, 
            "rating": "5", 
            "review": "Give yourself time to explore this collection. I only had an hour to enjoy this beautiful collection. I knew nothing about Vietnamese art entering but was blown away by the range and depth of the collection I found the modern lacquer paintings stunning. Given the country's history there are unsurprisingly many war paintings. Give yourself two hours at least in this calm oasis in busy Hanoi"
        }, 
        {
            "index": 141, 
            "rating": "5", 
            "review": "Excellent collection. Excellent collection of abstract paintings as well as pictures. Worth a visit if you have inclination towards arts. The modern art basically depicts the culture of the locals apart from abstract concepts."
        }, 
        {
            "index": 142, 
            "rating": "5", 
            "review": "A Gem!. This museum is set in the former home of a wealthy Hanoi resident. The collection is somewhat eclectic, but interesting just the same. There are a few artists' galleries located on the compound. Worth a look-see!"
        }, 
        {
            "index": 143, 
            "rating": "5", 
            "review": "Good museum. A great place to know about Vietnam fine art history, all the famous painters and theirs works. What a pity Vietnam doesn't have a real art market nowadays"
        }, 
        {
            "index": 144, 
            "rating": "5", 
            "review": "Back Again. I took my group of 10 for a very enjoyable day out to this part of town. Combined with Craftlink, KOTO and the Temple of Literature - all close by, makes for a superb day. The museum is not the greatest in the world but it has many fine exhibits and is well worth a visit particularly as it is so close to other (the above) attractions. The museum shop is also worth going to. They have some lovely prints etc at very good prices. Look for the signs on the left side - it's not very easy to find."
        }, 
        {
            "index": 145, 
            "rating": "4", 
            "review": "A find !. We were not planning to visit but on passing we were curious .Thank goodness for curiosity ! Beautiful building with a diverse collection of art works ."
        }, 
        {
            "index": 146, 
            "rating": "5", 
            "review": "No need to rush. I have now been twice to the Fine Arts Museum. The first time with a friend was a bit rushed, so a few years later by myself, the second visit was slower. I enjoyed the cultural experience. I purchased a painting at the gift shop by an artist from the Fine arts Museum, it was very reasonably priced. I was lucky to be able to buy another by the same artist on my second visit for my daughter. Include a visit to the Temple of Literature a short walk away. I did not know it was so close and missed out both times. From the Old Quarter, we took a taxi the first time and I went on the back of a motor bike the second time. The bike was a lot more fun."
        }, 
        {
            "index": 147, 
            "rating": "4", 
            "review": "Good historical overview - and great art.. The museum has a more or less chronological exhibition of Vietnamese art with different themes and techniques going back to pre-history until present. I enjoyed the different techniques like lacquer painting and lacquered wooden sculptures. We also saw an exhibition about Japanese photography in the second building, that also has a ceramics section in the basement that is easily missed, as is also the shop just outside the 2nd floor of the main building."
        }, 
        {
            "index": 148, 
            "rating": "4", 
            "review": "A good overview of vitnamese art. This pristine gallery has very few visitors, which is a pity. Though it is presented in a politically correct, revisionist postwar way, one can see through that to the real quality of the work, especially of the early 20th century. And the Buddhas are fun. Colours are dark and nonwestern, odd at first to our eyes but they grow on you."
        }, 
        {
            "index": 149, 
            "rating": "4", 
            "review": "Different to the West. The Vietnamese defenition of Fine Arts is very different from the West. Mainly paintings from the middle of the last century up to today. It is probable that paintings have been carefully selected (vetted) to follow a strict historical interpretation so what is on show look like politically motivated, nationalistic images. This does not detract from the quality of the works many of which are exceptional using different media and artistic techniques. However, this museum is well worth a visit. We would like to see more publications on what is exhibited. There is also a gallery where you can buy contemporary art works but take care to ensure these works are originals."
        }, 
        {
            "index": 150, 
            "rating": "3", 
            "review": "paintings mostly depict changes in 1960. worth a visit if one is around old quarters and wants to walk around the city to come and come here for a short stroll."
        }, 
        {
            "index": 151, 
            "rating": "5", 
            "review": "Fantastic collection of paintings, ceramics and textiles. A great experience moving through 30 rooms of Vietnamese art from 'caveman' days through to the 21st Century. Particularly impressive collection of 20th Century art from across Vietnam. Highly recommended."
        }, 
        {
            "index": 152, 
            "rating": "5", 
            "review": "Excellent Museum! . I was so impressed by my visit here. Stunning work on all 3 levels, starting with ancient artefacts on the lower level going up to beautiful lacquer paintings, touching and disturbing war time paintings alongside world class impressionist style portraits and landscapes. There are also some masterful sculptures. Worth a look for anyone but an art enthusiast could spend many, many hours here. Lovely clean building with good toilets and air conditioning. Only 40k dong entry fee. Make sure you visit when in Hanoi. (Also be sure the visit the separate building on the left of the museum to see the collection of ceramics and a temporary exhibition space)"
        }, 
        {
            "index": 153, 
            "rating": "5", 
            "review": "Best overview of Vietnamese art. The sections on Buddhist statuary, paintings in lacquerware and ceramic pottery should not be missed. There is a (too small) section on contemporary painting and also a good exhibit of ethnic minorities’ crafts. A no-brainer on a rainy day, but highly recommended even on a sunny day. Conveniently close to the Temple of Literature."
        }, 
        {
            "index": 154, 
            "rating": "5", 
            "review": "Very interesting Vietnamese art. It's quite a trek to the fine art Museum, and those who are organised it will combine it with a trip to the Temple of Literature. We walked here from the French Quarter, so were hot and sweaty on arrival. Once inside it was a cool haven of tranquility.All of the art is Vietnamese. It covers both ancient and modern. Much of the modern focuses on the wars, but it is very beautiful - including prints, lacquer, oils and watercolours. There's a good shop too."
        }, 
        {
            "index": 155, 
            "rating": "5", 
            "review": "Amazing Glimpse of VN Culture. The Fine Arts Museum is 3 floors of vietnamese history and culture. The ground floor is the oldest art, and it gets more contemporary the higher you go. They have quite a nice gift shop with pictures and reprints you can take home for not too much money."
        }, 
        {
            "index": 156, 
            "rating": "5", 
            "review": "See the evolution of art in Vietnam. The artwork at this museum runs in a chronological order, giving you an idea of the evolution of Vietnamese art from neolithic times through Chinese domination, French colonisation, and finally communist rule.The \"modern\" art in the museum are technically excellent, but the subject matter can be rather typical and sterile *cough*propaganda*cough*, so the temporary exhibit of the art by Nguyen Ngoc Dan was a refreshing change to me.The museum is near the Temple of Literature so you can combine the two sites in a single visit."
        }, 
        {
            "index": 157, 
            "rating": "4", 
            "review": "Communist art. The museum is basically filled with old Buddha statues and communist arts (e.g. from the war). A nice way to get away from the chaos for 1-2 hours, it is quite hot inside though."
        }, 
        {
            "index": 158, 
            "rating": "5", 
            "review": "Another Perfect Place to Learn About Vietnam. Affordable entrance fee. Interesting exhibits. It was my first time going to an art museum like this and I did not expect I would enjoy my one-hour visit there. Perhaps the artwork could be displayed in a more specific order or something but this museum is still worth the visit. Highly recommended. I am happy I squeezed in a visit to this museum during my short stay in Hanoi. Through the exhibits, I learned more about Hanoi or Vietnam - imagining how it may have looked like many years ago, admiring the paintings/sculptures, and not a second of my time was wasted in vain :)"
        }, 
        {
            "index": 159, 
            "rating": "4", 
            "review": "INTERESTING COLLECTION OF LOCAL ART. Being an Asian art lover I was interested in seeing this museum.A lovely collection from early Vietnam up through the Vietnam of today.Quite interesting to see how the subject matter has changed through the years."
        }, 
        {
            "index": 160, 
            "rating": "4", 
            "review": "Shameful museology. The ancient pieces are very interesting, but displayed in quite a random order and in a manner that doesn't do justice to the objects. The modern paintings are chosen with a lot of biases, with too many political pieces and not enough leading artists (maybe a question of budget?) The best part is the religious section, with some rare representations of the pre-Nirvana Buddha. That alone makes the visit worthwhile."
        }, 
        {
            "index": 161, 
            "rating": "3", 
            "review": "I wouldn't go out of my way. A caveat: In general, I'm not that interested in older artifacts.\nOverall the prevention of the older artifacts and and newer art needs a refresh. They aren't well lit and need maintenance.\nIf you're in the neighborhood it's worth checking out for the lacquer paintings, if nothing else, but there wasn't anything I considered a \"must see\""
        }, 
        {
            "index": 162, 
            "rating": "4", 
            "review": "Well worth the visit. This place is certainly worth visiting, and I spend an interesting 90 minutes looking around. All exhibits have an explanation in Vietnamese, French and English.\nIt was very quiet when I was there (I purposely picked lunch time for this reason), so I had most of the place to myself.\n30,000 dong well spent."
        }, 
        {
            "index": 163, 
            "rating": "3", 
            "review": "a super collection. a nice place to visit; the museology is a bit out of date, but its only a matter of time before it catches up to the standard of the other leading museums in ha noi. And the collection is amazing."
        }, 
        {
            "index": 164, 
            "rating": "5", 
            "review": "Fine Arts Museum. An interesting mixture of old and more modern,with lots of bronze sculptures. It was a good way to fill a rainy morning."
        }, 
        {
            "index": 165, 
            "rating": "5", 
            "review": "A surprisingly Great Museum. This museum was by far the best I've been to in Asia. Set in a big old house and was a great relief from the scorching heat. All of the rooms were air conditioned, virtually empty so it was quite relaxing. If they ever make another night at the museum I hope they do it here. A great range of art, no docent to follow you around telling you not to take pictures. Overall a very wonderful visit and I can't wait to go back."
        }, 
        {
            "index": 166, 
            "rating": "3", 
            "review": "Shop Worn & Provincial. Although much of the art in this museum is beautiful, it is all Vietnamese and much of it is in need of some TLC. The museum is only air conditioned in some spots and the beautiful artwork is at the mercy of the oppressive heat and the bright lights."
        }, 
        {
            "index": 167, 
            "rating": "5", 
            "review": "Such a great place to visit.. It took us several hours to go round. Very interesting place with good info in English in the rooms. Covers a range of eras and styles. We really enjoyed it. There are more rooms out the side on the second floor I think it was from the door that goes to the gift shop."
        }, 
        {
            "index": 168, 
            "rating": "3", 
            "review": "A fine experience, nothing spectacular. Don't go expecting a comparative experience to a major metropolitan fine arts museum. The ancient art was very interesting, but the modern section wasn't the greatest. Very small, but worth the trip at $1.5 US"
        }, 
        {
            "index": 169, 
            "rating": "4", 
            "review": "A major surprise in Hanoi. The work is fascinating, though the building is musty and in disrepair. There is a clear preference for traditional Asian media and methods, yet there's also a clear connection with Western artists of the time. Work that demonstrates the public mood of the war is particularly intriguing."
        }, 
        {
            "index": 170, 
            "rating": "5", 
            "review": "Art for arts sake.. Loved this museum. Only 30,000 Dong and you spend a couple of hours. Really gave me a good perspective of the History of Buddhism, culture and artistic excellence."
        }, 
        {
            "index": 171, 
            "rating": "4", 
            "review": "Fine arts Museum, Fine.. Just fine... For you art lovers, artists, and travellers who are into history and artistic local culture thing, this place is a must. It's a fancy museum which has a lot of fine arts inside. They were really nice.... I love the ambience.. So fancy.. And hence the name is fine, so it is fine.."
        }, 
        {
            "index": 172, 
            "rating": "5", 
            "review": "Excellent!. Of all the places I explored in Hanoi, this was by far among my favourites! Such an incredible and diverse collection of all things artistic (I'm talking statues to paintings to jewellery boxes to quilling pieces and everything in between) that well represented Vietnam's unique and beautiful culture."
        }, 
        {
            "index": 173, 
            "rating": "4", 
            "review": "Ceramics and applied arts at the Fine Arts Museum. We had to rush through the Museum but could have spent 2-3 hours - especially in the airconditioned rooms. The very large collection of lacquer paintings were interesting, but the applied arts section showing the different handicrafts, embroidery, etc. used on articles was really wonderful. Downstairs in the area closest to the road was a wonderful ceramic display so make sure you go to both sections of the museum"
        }, 
        {
            "index": 174, 
            "rating": "3", 
            "review": "Arts museum. Entry was free due to national holiday on 2/9 but worth a visit anyway. We went through in an hour or so. Would have been nice to see more contemporary art, because the lite they had was amazing."
        }, 
        {
            "index": 175, 
            "rating": "4", 
            "review": "More travellers should know about this Fine Arts museum. This museum displays a fine selection of sculptures, propoganda, paintings from early to modern times. Don't miss the ceramic exhitition down in the basement of the left buiding, this section is often easily missed. When I visited, there were only 3-4 other tourists on each floor. It seems like people are not paying a proper amount of attention to this gem. On the bright side, it is very quite and we can really focus on comtemplating the arts."
        }, 
        {
            "index": 176, 
            "rating": "3", 
            "review": "Propaganda arts. If you look for propaganda arts, this is a place for you. The layout is a bit confusing though.It looks like the museum is working on adding more \"free thinking\" arts. This shows went you go to the \"folklore\" section. In comparison to the value of Soviet propaganda arts in recent years, I believe that some of the paintings in this museum can be very pricey in near future."
        }, 
        {
            "index": 177, 
            "rating": "4", 
            "review": "INTERESTING LOCATION. Hi Guys, Just finnished my short trip on 2 hours in The Fine Art Musseum. I have some ideas as: - Tranquarity indoor and wide area outdoor.- Friendly Staffs- Clean- Diversity of Vietnam information about History.ư- Location is so near from French old quater area.Beside:Air Conditioner was be stopped. Out of electric is reasonable explaintation from some ladies there.There are alot of common and same subject with other musseum i have ever seen in Hanoi."
        }, 
        {
            "index": 178, 
            "rating": "4", 
            "review": "Better than I expected. A pretty decent collection of local art. Three floors of old sculptures and paintings from nearly a thousand years ago until the early 2000s."
        }, 
        {
            "index": 179, 
            "rating": "3", 
            "review": "Fine museum. Fine overview of art from the 70-ies, a Vietnamese perspective on the war, on oppression, much propaganda art of limited artistic value.Also some ancient sculptures, great examples of lacquer painting. A bit tiring to visit room after room lined up along long corridors."
        }, 
        {
            "index": 180, 
            "rating": "3", 
            "review": "Decent museum.. Way better than its HCM counterpart. Forgettable first floor with copies and reproductions. Second and third floors, a few good pieces but whoever curated made a terrible job, Everything scattered around with little sense beside a (vague) chronological order. Two small and very surprising rooms with some pieces from the vietnamese contemporary scene. This part should be expanded. Blows out of the water the national art museum in Saigon."
        }, 
        {
            "index": 181, 
            "rating": "5", 
            "review": "Amazing art.. This is a great place to spend a few hours looking at the various styles of Vietnamese art, and the motivations and influences that have shaped it."
        }, 
        {
            "index": 182, 
            "rating": "4", 
            "review": "Pretty good. Visit the Viet Nam Fine-arts Museum (Bao Tang My thuật) to see modern and ancient fine art. Its very close to the Temple of Literature meaning you can probably spend a day doing both sites and in between you can eat at Koto training restaurant which is also very close by. Crossing the street between the two places can be fun as its a very busy area. Although they have ceiling fans the fine arts museum it can get pretty hot if the weather is warm. The secondary building (to your left as you enter the gates) has aircon yipee so pop in and see the folk art and ceramics collections as well as textiles."
        }, 
        {
            "index": 183, 
            "rating": "4", 
            "review": "Great collection of art. This is a must-see. Lots of great artwork. My favorite were the contemporary arts. The historic artworks are very interesting too but too many of the same things."
        }, 
        {
            "index": 184, 
            "rating": "4", 
            "review": "Decent museum. Depending on how much you like your art you could spend 3+ hours here. The main building is mostly revolutionary paintings besides the bottom floor of ancient sculpture. There's also a small section of modern art here. Make sure to visit the secondary building (to your left as you first enter the gates) which for me was much more interesting, it has the folk art and ceramics collection as well as textiles. There's also better a/c in this building!Everything is signed in English/French/Viet and it feels like a proper museum."
        }, 
        {
            "index": 185, 
            "rating": "5", 
            "review": "Worth a visit. Great museum, much better than expected. Definitely worth a tour if you're around. Our daughters also very much enjoyed it."
        }, 
        {
            "index": 186, 
            "rating": "4", 
            "review": "Great examples of imaginative Vietnamese contemporary art. Great collection of Vietnamese fine art from traditional prints and folk art to impressive contemporary laquer paintings and sculptures - also air-conditioned so a great way to spend a hot afternoon."
        }, 
        {
            "index": 187, 
            "rating": "4", 
            "review": "Quiet beauty, sometimes cool. In the middle of the day, when many Hanoians are resting (including a few of the gallery monitors) we found this a welcome respite from the bustle of the streets and our schedule. We opted to visit from the top down, taking our tour backwards in history. The upper galleries were nicely done, and we particularly enjoyed the silk paintings and some of the modern works of sculpture and art. Although the galleries are air-conditioned, several of the AC units apparently were not working, so we paused not at all in the lacquers and early 20th Century paintings. The influences of East and West, traditions, history and socialism make for a fascinating study in this museum. While we could have stayed much longer, and will certainly return we felt it the ideal place for an afternoon wander through the soul and heart of Vietnam as seen by its artists."
        }, 
        {
            "index": 188, 
            "rating": "4", 
            "review": "Excellent art works particularly the revolutionary struggle pictures. Found this museum very rewarding some of the artwork covering the revolutionary period were evocative and really revealing. The museum is calm and well laid out, I was really glad I visited"
        }, 
        {
            "index": 189, 
            "rating": "3", 
            "review": "This is a good art museum BUT. This museum is set in an old mansion. It is surprisingly well set up. The art is well spaced out. And there is some air conditioning. The museum has a fabulous selection of modern and contemporary art. HOWEVER, the art is not the most well preserved or maintained. If you have been to Europe or some of the world's top museum, this will bother you. The mats on the frames are dirty and stained. The glass on the frames are smudged with fingerprints and dirt.But if you can get past this lack of upkeep, the museum is a good way to spend an hour or two."
        }, 
        {
            "index": 190, 
            "rating": "4", 
            "review": "Neat art museum, from ancient to modern. A little hokey at times.. Starting with some brilliant old stone and wood sculptures, moving on to European influences, propaganda paintings, and 21st century wildness, this museum has a bit of everything. I did find the war era stuff a little corny for my tastes.What I found strange, is that the gift shop has tons of original art for sale, much of it more interesting than some of the stuff in the main building. I'd love to see that hanging in someone's house, but I couldn't get a straight answer on the prices. If you like ceramics, textiles, folk art etc don't forget to check out the smaller building on the side- it has two separate entrances.It's also air conditioned, so you can take a break from the heat while you absorb some culture and history!"
        }, 
        {
            "index": 191, 
            "rating": "4", 
            "review": "Nice collection. Museum is worth to visit if You are interested of local art. Its very different from this, what European eyes are used to see. Museum is quite spacious and AC is very good inside so You can enjoy art in good atmosphere"
        }, 
        {
            "index": 192, 
            "rating": "5", 
            "review": "Don't miss this spot!. I almost took this spot off the itinerary but thank god I didn't. We spent 2 hours here and it was of our favorite attractions in Hanoi. Incredible ancient art and 15th and 16th century carvings plus a stunning folk arts collection. Check out the gift shops for great gifts to bring home to your people,"
        }, 
        {
            "index": 193, 
            "rating": "4", 
            "review": "Some incredibly pieces of art and a real \"close-up\" experience. There are some amazing pieces of art in the collection. We had limited time and rushed our walk through the museum to be able to take everything in. Leave a full morning/afternoon if possible. We loved seeing the unique pieces and given most pieces aren't behind class and you can literally walk right up to them. They allow photography (disappointingly even flash photography) of all exhibits. It's an experience you won't get in most national museums. On the negative side, they've not taken many (any?) precautions to protect the art pieces (some areas weren't even air-conditioned) and you could see the toll the humidity and touching is taking."
        }, 
        {
            "index": 194, 
            "rating": "4", 
            "review": "beautiful collection. There is a little bit of something for everyone here who appreciates art. Nice Colonial building, with items nicely spaced out in different rooms & levels. I particularly enjoyed the artwork. Well worth a visit."
        }, 
        {
            "index": 195, 
            "rating": "5", 
            "review": "Very informative and attractive museum!. It is about 10 minutes by taxi from the First Hotel or you can walk (about 20 minutes).It is located in the embassy area with French designed buldings.The museum presents various paintings of the Vietnamese authors in the past and at present. You will be thrilled with collections."
        }, 
        {
            "index": 196, 
            "rating": "4", 
            "review": "Beautiful fine arts museum. The first floor in the main building has a fascinating display of antique artefacts dating back up to a thousand + years, gorgeous and awe inspiring art. the second floor is mainly \"propaganda & war\" art which is an insight into this dark period of Vietnam's recent history which reflects the turmoil in the country during so much of last century. The 3rd floor has an enthralling display of Silk painting and modern art. A separate building houses non-permanent displays. We where enthralled by the displays and anyone with an interest in art 7/or history shouldn't miss this museum"
        }, 
        {
            "index": 197, 
            "rating": "5", 
            "review": "Fine arts museum tour. Comprehensive and a collection of both modern and classical pieces here. I really enjoyed it despite being a relative fine arts bogan!"
        }, 
        {
            "index": 198, 
            "rating": "4", 
            "review": "If you like art visit the fine arts museum. The fine arts museum offers a good historical perspective of Vietnamese art as well as a small contemporary exhibit. We found that the pieces were in various conditions from those that were exquisite to some which were showing signs of wear. There are extensive examples of sculpture, lacquer work, and silk painting. Our favorite exhibit were the thought provoking paintings by the contemporary artists. Note that the air conditioning was inconsistent throughout the museum. There were very few people there when we visited, and relative to other museums this one is quite understated, but if you are interested in art put this on your to do list."
        }, 
        {
            "index": 199, 
            "rating": "5", 
            "review": "A museum with an open mind.. Everytime I'm in Ha Noi I visit this museum and often several times. Partly because of what they show, but also because of the people who work in the museum. During the years they did become friends and I always feel proud when they show me the new things they did develop, especiallt for children."
        }, 
        {
            "index": 200, 
            "rating": "4", 
            "review": "Wonderful Museum. The Museum of Fine Arts in Hanoi was well worth a visit. It is accessible and nicely divided into three stories. Fine Arts from the 11th - 19th century on the ground floor; Paintings and contemporary sculptures and Folk art on the first floor and silk, and oil paintings as well as a creative space for children on the third floor.The layout facilitated a calm and relaxing visit to this wonderful museum. I would highly recommend a visit, especially on a hot day, to this lovely museum. You will not be disappointed."
        }, 
        {
            "index": 201, 
            "rating": "5", 
            "review": "Walked from our Hotel. We walked to this museum from our hotel even though we were advised to get a taxi - we love to look around a city and it wasn't really that far - it was very hot though. It was worth the walk - I loved it - there are displays over 2 buildings. I always think you can get to know a country by it's art and this is very true here. A lot of Vietnam's history is reflected in the art. Some of the bronze sculptors are fantastic and I especially loved the ceramic displays."
        }, 
        {
            "index": 202, 
            "rating": "5", 
            "review": "The musee d'orsay of Hanoi!. Yes that's a gross exaggeration but there is a ton of impressionistic art here that is beautiful and captivating. And they have AC. The ceramics in the basement are skippable, the 2nd floor is the highlight."
        }, 
        {
            "index": 203, 
            "rating": "5", 
            "review": "Great experience. Both the building and the historical and cultural content Vietnam fascinates us the beauty and elegance. A beautiful museum to be visited by us Westerners in contact with the oriental culture."
        }, 
        {
            "index": 204, 
            "rating": "4", 
            "review": "A bit far, though interesting art. The best pieces are the lacquered work, traditional art form of Vietnam. The Buddhist wooden statues from the 1700s are also quite magnificent. I wasn't particularly interested in the art, and the descriptions of the pieces are lacking, but this is a good place for a stroll on a rainy day. There are three floors of exhibitions. Make sure you don't miss the wing at the back of the museum, behind the stairs. It's quite far from Old Town by foot. Fee is VND30000."
        }, 
        {
            "index": 205, 
            "rating": "5", 
            "review": "A Must Visit Stop in Hanoi. This museum is highly recommended for arts lovers. The 3-floor building houses hundreds of Vietnamese paints and sculptures. The contemporary section is my favorite."
        }, 
        {
            "index": 206, 
            "rating": "4", 
            "review": "Interesting. Good collection and some of the Vietnamese stuff is really worth looking at. A bit sombre at times, but that's not bad when escaping the sweltering heat."
        }, 
        {
            "index": 207, 
            "rating": "4", 
            "review": "Worth a visit. An interesting collection of artifacts and art. Most very well displayed and good translations. Some wonderful old pieces. It was interesting seeing the change in art styles and subjects from colonial to communist to more liberal periods today. A very large collection and one the city should be proud of. We didnt see everything as the heat/humidity and sore feet defeated us. If youve got time and are interested in society and art its worth a visit."
        }, 
        {
            "index": 208, 
            "rating": "4", 
            "review": "good place to explore in rainy day. This place is suitable for all ages. The museum is well-maintained and serene with a fine collection of art from throughout the centuries. We all enjoyed our afternoon there. Highly recommended!"
        }, 
        {
            "index": 209, 
            "rating": "4", 
            "review": "comprehensive collection. great overview of vietnames art and well worth a visit. some rooms were cool and some were very hot. wish the gift shops would stock items which reflect the displays."
        }, 
        {
            "index": 210, 
            "rating": "5", 
            "review": "Oh my gosh. This was an outstanding museum. As I mentioned a bit ago in my comments re the Vietnamese Women's Museum, I wish I'd know that the way to walk thru the exhibits was from left to right (from old to new). But regardless, it was fabulous. And the gift shop had original art from many current artists as well as special representative pieces of Vietnamese art. FINE museum."
        }, 
        {
            "index": 211, 
            "rating": "4", 
            "review": "meaningful place to visit. We enjoyed this art museum. They have really beautiful art pieces and various types, from painting to sculptures. We would highly recommend seeing this museum!"
        }, 
        {
            "index": 212, 
            "rating": "4", 
            "review": "Nice historical review of art in Vietnam. This is a good place to spend an hour or so exploring the art history of Vietnam.\nI found the pre 20'th century the most interesting; the more recent exhibits are a little biased (understandably I guess).\nAll in all a worthwhile place to visit"
        }, 
        {
            "index": 213, 
            "rating": "5", 
            "review": "Wonderful art in a cool setting on a sweltering day. With a heat index between 106-110 degrees, I designed a day to be inside. If you are looking for a cool, quiet, uncrowded spot to see wonderful art, this is the place. In the main galleries, there were only 5 other people and no one in the side wing where applied arts and ceramics are location. The museum shop sells are but they were so rude that I decided not to buy."
        }, 
        {
            "index": 214, 
            "rating": "5", 
            "review": "Worth the visit for all types!. You don't have to be an art enthusiast to enjoy the very diverse collection here. Items span the length of Vietnamese history, ranging from old relics to some impressive and striking full-sized Buddhas and monks, as well as plenty of great paintings of both secular and political themes. A great selection of modern art rounds out the trip. Make sure to follow the signs to get your historical pathway right. Budget two hours."
        }, 
        {
            "index": 215, 
            "rating": "5", 
            "review": "Wonderful!. This museum was, for us, one of the highlights of our visit to Hanoi. There are some exquisite ancient sculptures, and a range of pieces from over the years right up into modern times. However, the section that most fascinated us is the large collection of enamel art. The Vietnamese have developed techniques for using this medium to create richly coloured paintings unlike anything we have seen in other countries. Well worth spending an hour or two here!"
        }, 
        {
            "index": 216, 
            "rating": "4", 
            "review": "Fine Arts History. This is an interesting history of Fine Arts in Vietnam from early to modern times. A good mix of art and sculpture, together with some furniture, pottery and clothing. The collections are small but appear to be well curated. I would recommend visiting if you have the interest and time - when we were there some of the exhibits were off \"travelling\" so didn't see them all - and they were changing over exhibitions. The clothing/furniture exhibits from the ethnic minorities were really interesting."
        }, 
        {
            "index": 217, 
            "rating": "3", 
            "review": "If you've got the time. I wouldn't consider this a top priority of Hanoi sights but it's nice if you have the time. There are some interesting sculptures but the art left a bit to be desired."
        }, 
        {
            "index": 218, 
            "rating": "4", 
            "review": "For a change of pace. Pop in here after visiting the Temple of Literature for historic, modern and contemporary art. The carved wood doors and gates featuring scenes from everyday life was enchanting."
        }, 
        {
            "index": 219, 
            "rating": "4", 
            "review": "well worth a look for art and history lovers. Lovely place - particularly interesting was the ancient art, I found the newer contemporary works great but a bit repetitive in their subject. Best thing was we found a great bar in an old Art Deco mansion called Bar Better (Betta?) around the corner - good priced drinks (free beer wed and sunday!!) great rooftop"
        }, 
        {
            "index": 220, 
            "rating": "5", 
            "review": "Preserving and presenting a glimps of Vietnams visual arts.. Provides the visitor with a comprehensive picture of the visual art works of Vietnam. Includes a couple of little gift shops."
        }, 
        {
            "index": 221, 
            "rating": "5", 
            "review": "Art and History in style. Well laid out in an impressive French Colonial building, the Fine Arts Museum houses a spectacular and thorough display of Vietnam's rich artistic history from ancient times until now. A must see for anyone interested in history or any form of art."
        }, 
        {
            "index": 222, 
            "rating": "4", 
            "review": "Historically yours !. The Fine Arts Museum in Hanoi is a chronicle of the history of Vietnam narrated through its art . More than the paintings of the Modern period , I preferred the antiquities on the ground floor .If you are a history buff , you will probably enjoy the exhibits here . The paintings on exhibit are technically outstanding but I'd love to see a section where the contemporary artists take off from where the modernists left ."
        }, 
        {
            "index": 223, 
            "rating": "5", 
            "review": "A bit of Everything .... Not massive art fans but daughter is so we went. Really enjoyed the wide variety from ancient to modern; stone carvings to lacquered-wood statues and the 'ugly' Buddhist monk figures with odd shapes and faces. Nice cool place to spend some time."
        }, 
        {
            "index": 224, 
            "rating": "4", 
            "review": "Awesome museum. This was a great ,useful to visit to get an understand of what fine art means im Vietnam. We saw some really beautiful pieces."
        }, 
        {
            "index": 225, 
            "rating": "5", 
            "review": "Well set out Museum with excellent examples of artworks over the centuries.. The Fine Arts Museum is a wonderful old building housing a wide range of paintings, drawings and sculptures , ancient and contemporary. It is well set out and you follow the history of art in Vietnam as you progress through the galleries on 3 floor levels. The gallery is also a quiet, peaceful and cool spot to visit, to take a breather from the busy world outside. The early works are vary from large sculptures and bas reliefs, to small artefacts. Then you progress through the gorgeous display of lacquer artworks. There is also an excellent section of artwork depicting the struggle for independence. My favourite section was the contemporary artwork. You can view excellent works which show French influence from the impressionist period. There are also works which show surrealist and abstractionist influences. The contemporary artworks of the 21 st century are varied . There are some excellent photo realism paintings and some wonderful works depicting modern Hanoi. The gift shop also has some great signed and numbered linocut and wood block prints for sale, by young Vietnamese artists at very reasonable prices. Thoroughly enjoyed this Museum. Definitely recommend a visit."
        }, 
        {
            "index": 226, 
            "rating": "5", 
            "review": "Great overview of Fine Arts. Lovely old building displays an excellent collection which draws from centuries of art including ancient sculptures, silk and lacquer painting, ceramics as well as modern works."
        }, 
        {
            "index": 227, 
            "rating": "5", 
            "review": "Great works of Art. I spent 2 hours here just in awe. Three Levels of great art over history. Each floor was unique and took you through a journey in vietnamese art through time."
        }, 
        {
            "index": 228, 
            "rating": "4", 
            "review": "Surprising treasures; good variety. We were pleasantly surprised at the extensive nature of the collections and how well things were labeled. A great glimpse into Vietnam culture and history, especially if you are a visual person. There are some incredibly unique pieces well worth seeing. A few things were the thousand armed boddhisatva statue, the lacquered statues from late 1700s, war-themed paintings from 40s to 70s. Museum is located right next to the Temple of Literature; it's definitely worth going while you are there. Entrance cost less than 2 dollars. There are few visitors so it's like having a museum to yourself. Will probably go back again when in Hanoi."
        }, 
        {
            "index": 229, 
            "rating": "5", 
            "review": "Outstanding cultural facility. Visiting the Vietnam Fine Arts Museum - just across the road from where we were yesterday - The Temple of Literature and National University - seemed like a good idea. Reflecting on the antiquity of some of the collection is sobering - a thousand and more years old. We will return as we only covered about a third of the collection in this extensive 1930s, French-built facility. The French outstayed their welcome but certainly left behind them some fine architecture.Employing media from carving and sculpture, through bronze, stone and lacquered wood to more modern materials of silk and oil painting - drawn from the French though adhering to Vietnamese and Cham expressions and styles - the collection covers influences from the early Confucian up to and beyond the Communist, patriotic depictions of the 1930s to the 1970s.Modern Westerners like us, imbued with Greek, Roman and European media and styles, will be inspired. Linking Vietnamese art to those periods viewers will see immediately the developments in thought and philosophy were often in advance of our own. Thanks Confucious and the early emperors of Vietnam.The English labels were occasionally amusing and often bemusing. I would love to get my editor's hands on them - with no disrespect. We will be going back quite soon."
        }, 
        {
            "index": 230, 
            "rating": "5", 
            "review": "Great, well worth checking out. We loved this Museum, it had a wide range of art across all periods. I was very impressed by the art collection and the quality of the art."
        }, 
        {
            "index": 231, 
            "rating": "3", 
            "review": "Quite good. Was not expecting to see replicas in a museum but overall it was interesting and isn't so large that it is daunting."
        }, 
        {
            "index": 232, 
            "rating": "5", 
            "review": "Don't miss this great art museum! A fantastic and fascinating introduction to art in Vietnam. My friends and I visited this museum after a visit to the Temple of Literature. We only had about an hour and a half, so we didn't get to see the side wing or the temporary exhibition of watercolors. Like the other reviewers, I had never really considered fine art in Vietnam before, and was truly fascinated by the museum as an introduction. It was well curated and presented. I only regret that we didn't have enough time to see/consider all of it, though I ran back on my last morning to buy a book from their small bookstore."
        }, 
        {
            "index": 233, 
            "rating": "4", 
            "review": "Very small but interesting. Contains artefacts from the stone age to modern times in just three rooms. But its the post 1945 art thyat s definately worth seeing both for its craftmanship and content."
        }, 
        {
            "index": 234, 
            "rating": "4", 
            "review": "Worth a visit !. The museum has a main fine arts building and a wing for more traditional arts and a room of temporary contemporary exhibits. . One floor of the fine arts building has the art organized by era, and the other by medium, i.e. silk painting, lacquer painting, oils, etc. There are many pieces which deal with subjects from the Vietnam (American) war, some absolutely beautiful, others very powerful statements. Some sculpture and ceramics though that is not the main focus. There is a nice museum gift shop. The café in the courtyard did not appear to be open. It is worth a visit if you have time or are interested in how the war was illustrated through fine art. Fee is minimal"
        }, 
        {
            "index": 235, 
            "rating": "5", 
            "review": "blew my mind. I just never considered Vietnamese fine art. Aside from actual antiquities on the first floor which were very cool, there were lots of paintings from around 1940s to 1990s which while they had obvious French influence were also wildly original and that includes materials and techniques. I had never seen lacquer paintings. There was also a melding of traditional and modern style which is hard to describe. A small amount of straight up impressionist stuff which matched any westerners. I was enthralled. It matched my entire impression of the country as a place of originality and industriousness."
        }, 
        {
            "index": 236, 
            "rating": "5", 
            "review": "Fine art-fine building. There is some superb art in this museum.The paintings are well worth the visit, as is the sculpture.There is so much tourist 'tat' in the shops, badly done paintings, but the quality of the work here is superb.The day I went was also very quiet, far from the madding crowd!The buildings don't appear to have air conditioning or any sort of climate control.The American ambassador should take steps to to rectify this immediately, to preserve these beautiful works for future generations to enjoy."
        }, 
        {
            "index": 237, 
            "rating": "1", 
            "review": "uninspiring. This museum, while the artwork was amazing - everything is dark and there is not enough signage to help you get around. We left after just 15 minutes quite unimpressed."
        }, 
        {
            "index": 238, 
            "rating": "5", 
            "review": "Well worth a visit. We visited the Fine Arts Museum in Hanoi and were quite impressed with the displays. Well worth a visit."
        }, 
        {
            "index": 239, 
            "rating": "3", 
            "review": "Some Good, Some Average. My husband and I went to this museum last weekend. There are extensive exhibit spaces, but the \"path\" through the maze is not well marked, and the staff don't speak enough English to help guide you. There are some beautiful carvings and relief art. My husband and I especially enjoyed the ceramics exhibit which displayed several hundred years of vases and tea pots, and explaining the defining decorative characteristics of each dynasty."
        }, 
        {
            "index": 240, 
            "rating": "4", 
            "review": "Fine Arts Museum. Massive building, full of art. Some of the artwork is in a different building and would be easy to miss, so watch out for that. Good selection of art although a limited amount of contemporary pieces. The museum shop is not great - no prices and the quality of some of the items didn't seem very good."
        }, 
        {
            "index": 241, 
            "rating": "5", 
            "review": "Best museum. This is the best museum in Hanoi. They are two buildings, the first building is for Ceramic and clothes and the second one in about paintings, drawings, and sculpture. Interesting and good place to take picture. Not many people venture to the second building because they do not know how to access it. Look for the door close to the souvenirs shop and go downstairs to start."
        }, 
        {
            "index": 242, 
            "rating": "5", 
            "review": "Comprehensive and fascinating displays. Especially impressed with the wood carvings showing ordinary people fishing, playing musical instruments, laughing. I learned a lot of history.The contemporary art exhibit showed an understandable shift from figurative art to political art in the 1930s. Very moving."
        }, 
        {
            "index": 243, 
            "rating": "4", 
            "review": "Old style museum.. We chose to visit this museum because it is close to Literature temple. Displays are on two nice colonial buildings. Unfortunately the collections are exhibited in a casual way, without considering light, dust, and other crucial factor. Most important, the museum is poorly serviced by the staff, and you might touch statues and paintings without any problem (guides tend to do it while explaining to groups...!)"
        }, 
        {
            "index": 244, 
            "rating": "4", 
            "review": "Some lovely pieces. We didn't have much time at the Museum, so concentrated on the third floor galleries with twentieth century Vietnamese paintings and drawings. Some of these were lovely - highly skilled pieces presenting a fascinating insight in to Vietnamese life. Some pieces were related to the struggles of the Vietnamese people during a series of wars, but others showed a much more domestic picture. We were very favourably impressed and wished that we had more time available."
        }, 
        {
            "index": 245, 
            "rating": "3", 
            "review": "Quiet and quite nice. There are some statues to look at, some paintings to gaze at, and so on. The usual for an art museum. It's not very large, and there are some pretty works, but unless you're an art enthusiast, I would recommend not going."
        }, 
        {
            "index": 246, 
            "rating": "4", 
            "review": "Definitely Worth A Visit. The museum is arranged chronologically, which means the first exhibit is more like archeology than fine arts. Which is fine: the selections are interesting throughout. You follow the arrows, which are clearly marked, to different galleries. Each gallery has an introduction in Vietnamese, English and French that is well-written and informative. Each piece of art is also labelled in English, which is very helpful. Many pieces of fine art from the 1930's, when French influence was strong, is truly beautiful but, alas, in need of conservation. Some paintings are fading, or the paint is flaking off. But the art shines through. Vietnam had been at war from 1945 through the 1970's, first with the French and then the Americans. So, much of the art is nationalistic in tone, some of it heavy handed, other pieces technically very good. The painting atop of this category is Hanoi Youth preparing to meet the American aggressors.\" Ok, but it's their reality. There are also very abstract and modern images, the further removed from war, the more human-centered the art."
        }, 
        {
            "index": 247, 
            "rating": "4", 
            "review": "hard to get to but worth it. We took a cab from the old quarter because the city (like every other cosmopolitan area of Vietnam) is not particularly walkable for longer distances. When we got there, surprised at the quality and scope of works. They have very ancient stonework/masonry and wood work from centuries ago to more modern/present-day artist. Empty except for a few expats like ourselves, which was actually nice to enjoy everything in peace but also a little sad the Vietnamese don't visit themselves. definlety some real gem of paintings there. There were 3 or 4 rooms with a lot of propaganda-insured work that were not tiresome but otherwise plenty of other interesting things to see. The museum was 3 or 4 levels, each with 4 rooms. There is a nominal price for admission."
        }, 
        {
            "index": 248, 
            "rating": "4", 
            "review": "A surprise. It isn't Musee D'orsay nor the Guggenheim but is was very enjoyable and worth a visit. It is not expensive and there were many pieces of art that were original in concept and execution and were also enjoyable. As well there were obvious pieces that reflected some well known art such as the piece \"Sunflowers\" by Van Gogh. I was not sure if this was deliberate or a send up. If you like art and wish to see local talent both ancient and modern please take the time as it will be well spent but don't expect the wow factor that you will get in European or most western galleries when you are suddenly confronted by well known Expressionists art."
        }, 
        {
            "index": 249, 
            "rating": "5", 
            "review": "A beautiful collection . If you love art this is worth some time. There are some truly exquisite pieces of art here. And it offers a perspective on the Vietnamese people, their history and their formative experience. If you like art this is worth some time. If you're not into art, you'll be bored."
        }, 
        {
            "index": 250, 
            "rating": "4", 
            "review": "Well worth a visit. As with the Fine Arts museum in HCM city this is a rewarding experience. Quite diverse but my highlight were the lacquer paintings which took me by surprise with their quality, depth and warmth."
        }, 
        {
            "index": 251, 
            "rating": "5", 
            "review": "Really well done, a Hanoi highlight. I'm not an art or museum buff, but I really enjoyed this museum. I spent about 2 hours wandering through the displays which is longer than I would typically spend at a museum. There's a great mix of arts from across the eras, including some really impressive modern Vietnamese art. The giant (maybe 2 metre tall) Buddhist monks and the goddess with many arms were highlights. It's the type of museum where you can just wander and stop and read about the things that catch your eye. You don't have to concentrate too hard or worry about the narrative, just enjoy the really impressive artworks."
        }, 
        {
            "index": 252, 
            "rating": "5", 
            "review": "A relaxing location for photography.. My initial expectation was that this is another museum since the original was badly damaged during the war. This location contracted expectation as the restored buildings and locale was used by locals as a photographic backdrop. Excellent floral decor was groomed in its respective places.This place is suitable for all ages."
        }, 
        {
            "index": 253, 
            "rating": "5", 
            "review": "Excellent. Well worth a visit. As artists, my partner and I thoroughly enjoyed this art museum. Very well kept, varied, interesting and original styles. Fantastic."
        }, 
        {
            "index": 254, 
            "rating": "4", 
            "review": "Definitely worth a visit. The museum is well-maintained and serene (somehow, despite the blaring horns outside), with a fine collection of art from throughout the centuries. The older works and the silk paintings are not to be missed, and save some time and energy for the extensive collections in the second building. You won't find everything to your liking, but it's a great place to wander and pause as you see fit."
        }, 
        {
            "index": 255, 
            "rating": "5", 
            "review": "Very enjoyable. This Museum is very well kept, clean and very nice presentation. I have to say that it is a bit difficult to find your way round so better signage or numbering of rooms would be very helpful. Having said this the artwork on show is just stunning. The layout also great and it is kept very clean. We came in the morning and it was not busy so plenty of time to enjoy the artwork in peace. Highly recommend a visit to this museum and you need 2 to 3 hours."
        }, 
        {
            "index": 256, 
            "rating": "5", 
            "review": "Brilliant.. Very well run. Great sellection of historical objects including sculptures, ceramics, ethnic items as well as great collection of ancient and modern art. Unlike some museums this one is well laid out it is clean and obviously cared for. A great place to see ancient Chinese, Hindu and other relics. This place helped to complete the picture of Vietnam for me. There is a great sellection of lacquer paintings as well as some very nice silk paintings. Great place. Much more than museum, much more than a gallery."
        }, 
        {
            "index": 257, 
            "rating": "5", 
            "review": "Art from all ages. My only criticism is that a) rooms could be numbered because you can get confused on where you've been & what's next, and b) it would make sense for the layout to have you do all the ancient stuff first so you get a sense of progression. That aside, if you like looking at beautiful things then this is a visual feast in particular for seeing how a regional art form like lacquer gets adapted to more modern subjects and how styles bridge continents, when you see echoes of Van Gogh or perhaps what inspired the Dutch master. A truly enjoyable afternoon spent out of the chill, mist & drizzle."
        }, 
        {
            "index": 258, 
            "rating": "4", 
            "review": "Sad to see the on grounds restaurantis closed. Very well set out museum with fantastic collection of historically important art works. I used to love coming here wander around the gallery for a couple of hours then having lunch in the on grounds restaurant sadly now closed down i hope it reopens soon!!"
        }, 
        {
            "index": 259, 
            "rating": "5", 
            "review": "Nice collection of Vietnamese artwork, from ancient to modern. The Fine Arts Museum is well worth a visit, to view their excellent collection of artwork that spans much of the history of Viet Nam... Three floors with many rooms featuring works done in a variety of media (stone, wood, bronze, silk, oils, etc.) were enjoyable to view, all housed in a well-preserved building (French architecture). There is also a nice gift shop/bookstore off to the side, where you can purchase a book that covers the exhibits for 50K vnd. All in all, a nice spot to spend a couple of hours in Ha Noi and to learn more about the heritage and culture of Viet Nam -- enjoy :))"
        }, 
        {
            "index": 260, 
            "rating": "5", 
            "review": "View of Viet Nam in art. the most interesting in this museum is understanding about Viet Nam's china. Besides, the art from the ancient time is also a great picture with bronze Drum."
        }, 
        {
            "index": 261, 
            "rating": "2", 
            "review": "Bit boring and just a few really good pieces. We were disappointed after our visit. The museum has a few levels but all in all we didn't saw many artpieces that we found really interesting, well made or intriguing. There isn't much, mostly non at all, information accompanied with the pieces but that seems to be the standard in the Asian museums. Also in comparison with the modern arts museum in Ho Chi Minh this wasn't one we would go back to or recommand."
        }, 
        {
            "index": 262, 
            "rating": "5", 
            "review": "Surprisingly excellent. An oasis of tranquility opposite the hectic temple of literature. Beautiful artifacts on the first floor, but more interesting 20th century paintings on the second. Currently hosting a beautiful exhibit of propaganda posters small entrance fee and well worth it."
        }, 
        {
            "index": 263, 
            "rating": "4", 
            "review": "An artists buffet of delights. Wonderful selection of art. Especially of interest the works from around the time of the war with America. Wonderful ancient examples of the culture also. Cheap entry. Quiet and just near the temple of literature so well worth locating."
        }, 
        {
            "index": 264, 
            "rating": "4", 
            "review": "Hanoi late 20th century artists on show. As well as late 20th century art and some modern artists from 40s thought 80s they have sculptures and ceramics from 11th century. Normally they will have a guest artist on show for extended period in one of the wings. Old colonial building is very interesting and the ceramic exhibition is down in the basement. I felt this building would make a fantastic hotel but suits use as museum."
        }, 
        {
            "index": 265, 
            "rating": "4", 
            "review": "awsome!!!. The Vietnam Fine Arts Museum, a museum in the system of Vietnam's national museums, is considered as a museum that occupies the most important position in maintaining and promoting the treasures of Vietnamese cultural and artistic heritage. Visiting the Museum i can understand the entire history of Vietnamese fine arts through the collections and exhibitions on display. The presentation of our permanent collections of important works of Vietnamese art offer the public unique insights into the culture and history of the Vietnam's ethnic communities."
        }, 
        {
            "index": 266, 
            "rating": "5", 
            "review": "Even made return visit!. Fabulous combination of museum and fine art gallery, a thorough emersion in Vietnamese material and visual culture. Initial visit with a group wasn't enough, so returned for a more leisurely perusal. Would go back a third time if ever in Hanoi!"
        }, 
        {
            "index": 267, 
            "rating": "5", 
            "review": "Amazing. I could have spent many more hours there Bought some beautiful art works and I was amazed at the range of artworks on display Stunning work"
        }, 
        {
            "index": 268, 
            "rating": "3", 
            "review": "Nice, small museum - No contemporary art. Although the museum is small, what they have is generally good. Everything in the collection, plus a lot more can be seen in the histroy museum, so it really isn't worth the extra trip!"
        }, 
        {
            "index": 269, 
            "rating": "4", 
            "review": "Time well spent. There are 2 buildings on the property of this museum. Don't spend too much time in the first one (as you enter, on your left). The second building hosts a far more appealing and significant collection of local paintings and statues."
        }, 
        {
            "index": 270, 
            "rating": "3", 
            "review": "Average. I visit fine art museums wherever I go, but the art museums in Vietnam (Hanoi and HMC) are not overwhelming, the exhibitions could be presented better. It is still worth a visit, as locetd in a colonial building and you get an overview about art troughout the centuries."
        }, 
        {
            "index": 271, 
            "rating": "2", 
            "review": "Not Impressive. It has some nice pieces, but overall there is nothing truly magnificent about the works here, most of which come from around 1960."
        }, 
        {
            "index": 272, 
            "rating": "5", 
            "review": "Its Art. I'm not overly interested in Art, but for a dollar AUSD entry we thought we would check it out. The art is amazing and some of the techniques used are way beyond anything I've seen in any other museum"
        }, 
        {
            "index": 273, 
            "rating": "4", 
            "review": "From old to current art. We enjoyed this art museum. The ground floor starts off with Vietnams pre history. The first objects you are looking at are bronze and stone artefacts. The giant Buddhas and Gods are amazing. As you move through to the second and third floors, you are viewing oil paintings and Lino prints. These contemporary works give insight into the recent past as well as the traditional lifestyle of the people of Vietnam. Spend some time here if you love art museums. The bookstore was also a lovely place to visit and see contemporary artists work for sale."
        }, 
        {
            "index": 274, 
            "rating": "4", 
            "review": "Good place to see something interesting. Very well-known in Hanoi and attractive with variuos of arts for us to see.It was good experience for us because we got all information from our tour guide.High recommendation for this place."
        }, 
        {
            "index": 275, 
            "rating": "5", 
            "review": "An outstanding collection which is not to be missed!. I confess that I do like museums. So spending nearly three hours here may seem excessive to some but there is just SO much to see! The museum is located at the far end of The Temple of Literature, which attracts lots of visitors. So I am not sure why we were two of perhaps only a dozen visitors.The entrance fee is just 30,000 dong - a little under £1. There is a room with lockers to leave bags. Sadly, there is no floor plan and no brochure was given to us which could lead you to the museum's highlights. But there are so many!Although billed as a fine arts museum, it actually embraces the decorative and applied arts, too. The displays are very well signed, with an explanation to each room. The curators have tried to take the visitor through a history of Vietnam in chronological order (which is why the floor plan would have been helpful as we sometimes went out of sequence). There is a collection of prehistoric artefacts, an amazing collection of carvings from over 1000 years ago, textiles, ceramics and paintings in a variety of formats and styles, eg on silk to contemporary art. So for those from London, it is like a mini Tate, National Gallery, V&A and British Museum rolled into one.There is a good quality art/book/gift shop, although it is hidden away for some reason. There were no catering facilities. The museum is over three floors and in two buildings. I did not see any lifts, so those with mobility issues may need to check access arrangements. Do go, though. You won't be disappointed!"
        }, 
        {
            "index": 276, 
            "rating": "4", 
            "review": "Beautiful Art Pieces. They have really beautiful art pieces and various types, from painting to sculptures. Nice to spend the afternoon visiting the museum."
        }, 
        {
            "index": 277, 
            "rating": "5", 
            "review": "Lots of Art Regarding War. Very good depictions of life during wartime. Powerful sculptures. We would highly recommend seeing this museum!"
        }, 
        {
            "index": 278, 
            "rating": "4", 
            "review": "Some interesting art.. Not a big art buff but do like a good piece of art. There were some really interesting pieces in here and descriptions in French and English. If you're really into art it's definitely worth a visit. Would have been made better by some further background information about the painters and art periods - there's a little but not much."
        }, 
        {
            "index": 279, 
            "rating": "4", 
            "review": "Enjoyable afternoon. Housed in two adjoining French colonial buildings. Large number of varying types of ceramics on the lower level of the left hand building. Graphic arts and applied arts on the second level. in the other building, I particularly liked the lacquered art as well as silk art. There are a large number of very well done middle 20th century paintings mainly portraying war themes. Also, many Buddhas and other statues. Definitely worth a visit."
        }, 
        {
            "index": 280, 
            "rating": "3", 
            "review": "Only for those who really love the arts. We found this museum rather tedious as the art work was not very appealing to us as Westerners. I generally enjoy art galleries but this one didn't appeal, it was dull and tedious."
        }, 
        {
            "index": 281, 
            "rating": "4", 
            "review": "Fantastic Art, Buddhas and Ceramics.. Really worth a visit. Great respite from the crazy streets of Hanoi. Also across the road from the Temple of Literature. Great quality displays which were a lot cleaner than 5 years ago. Gives you a great insight into Viet culture and history. Stunning Buddhas and interesting ceramics display. Nice shop too which is a little tucked away but worth checking out for good presents, cards etc."
        }, 
        {
            "index": 282, 
            "rating": "5", 
            "review": "Art n Art. If you enjoy arts, depending on many factors, you will definately enjoy or dislike this museum. At the time if my visit, nothing major was happening except for my encounter with an awesome Japanese artist promoting his art, plus it was rainy outside. Great experiene for me !"
        }, 
        {
            "index": 283, 
            "rating": "5", 
            "review": "Some memorable surprises here. Whether you are into Art and Architecture or not, this site is a thoroughly enjoyable ornament in a delightful city. If you are staying near the Old Quarter it is within comfortable walking distance of the Hang Bong Road and the walk takes you through some of the most open and interesting areas of Hanoi. There are parks with beautiful gardens and some intriguing statues on the way to the Museum. If you get lost- highly unlikely - there are plenty of officials in a bewildering variety of uniforms only too pleased to help you find your destination. The art work includes reference to village life, traditional culture, revolutionary struggle and resistance to colonialism. There are surprising signs of influence by European painters such as Picasso and this helps to connect the Museum experience with the Ho Chi Minh Mausoleum site's art exhibition. The larger than life sculptures are stunning and because you will encounter them early in your visit they set the tone for what is to come. The various rooms are often quite small and accessible by a broad staircase in this wonderful colonial style buidling."
        }, 
        {
            "index": 284, 
            "rating": "4", 
            "review": "Vietnam's Premiere Fine Arts Museum. This review is quite late. The Fine Arts Museum (Bao Tang My Thuat) in Hanoi is housed in a beautiful building with a typical Vietnamese architectural style. It is the premiere fine arts museum being larger than the Fine Arts Museum in Ho Chi Minh City. There are interesting art works delving into varied themes: war and defense, love for country, and martyrdom, among others. There is a small section displaying modern art from contemporary local artists. I was only able to take photos of the exterior building since photography inside the museum is forbidden."
        }, 
        {
            "index": 285, 
            "rating": "5", 
            "review": "Don't Miss This Gem!. The Fine Arts Museum in Hanoi is housed in a beautiful Colonial Style French building with outstanding art and exhibitions. It is beautifully curated with paintings and sculptures dating from the 11th century to the 21st century. It is laid out chronologically so the visitor understands the evolution of Vietnamese art and artists. We even found one painting by an artist who painting we bought 15 years ago! It requires at least 1.5 hrs. Truly a gem."
        }, 
        {
            "index": 286, 
            "rating": "5", 
            "review": "Shows the reality of communism. I love art - including this art- such a reflection of the time of the recent past- artist's continued to have a personal style and appease the powers in charge. It was (and really still is) always a risk to show truths in this area of the world- art transcends where it can.Do not look for a slick French/American set up but one very much worth seeing."
        }, 
        {
            "index": 287, 
            "rating": "5", 
            "review": "Traditonal and contemporary. Forget the fine art, this is a museum of some of the best art in Viet Nam, presented with care and aesthetically pleasing. A must if you want to explore art in all its forms from this part of the world."
        }, 
        {
            "index": 288, 
            "rating": "4", 
            "review": "Arts & Artits. If you enjoy arts, depending on many factors, you will definately enjoy or dislike this museum. At the time if my visit, nothing major was happening except for my encounter with an awesome Japanese artist promoting his art, plus it was rainy outside. Great experiene for me !"
        }, 
        {
            "index": 289, 
            "rating": "4", 
            "review": "Probably the Best Collection of Vietnamese Art Anywhere. If you are expecting something akin to the Louvre or to see works by artists you know, you will be disappointed. But if you are interested in art and history as presented by artists, this museum is a must see. With an admission price of about a dollar and a half, there is no reason to miss this interesting and sometimes fascinating collection of Vietnamese art."
        }, 
        {
            "index": 290, 
            "rating": "5", 
            "review": "Great Vietnamese. Wonderful collection of all periods of Vietnamese art history. My favourites are the pieces of To Ngoc Van and Tran Van Can, also the works from the \"communist\" are very interesting. The museum (which is beautiful too) has a nice collection than the museum in Saigon. Worth visiting."
        }, 
        {
            "index": 291, 
            "rating": "5", 
            "review": "You will need a whole day here.. We spent the whole day here, my husband is an artist, and He was delighted for find such an amazing display"
        }, 
        {
            "index": 292, 
            "rating": "3", 
            "review": "Interesting but tiresome. They have a great exhibition of ancient art, but a looooot of communist war propaganda!! I am not anti-communist or anything, but after a while you become fed up with all the heroic soldiers and brave peasants.... It was refreshing to see paintings of Vietnamese girls from ethnic minorities once in a while. Go and check it out - it is cheap and Vietnamese school children go there with their schools - so the images there are part of the world they grow up seeing, and therefore great to see."
        }, 
        {
            "index": 293, 
            "rating": "5", 
            "review": "Splendid. Wonderful collection of all periods of Vietnamese art history.My favourites are the pieces of To Ngoc Van and Tran Van Can, also the works from the \"communist\" are very interesting.The museum (which is beautiful too) has a nice collection than the museum in Saigon.Worth visiting. It is just behind the Van Mieu (Literature Temple).(When oh when do Vietnamese museums start with audio guides, like in European museums :) )"
        }, 
        {
            "index": 294, 
            "rating": "4", 
            "review": "Nice collection in beautiful old building.. Enjoyed the architectural features of the building as much as the collection. Especially enjoyed the fine examples of lacquer paintings. Quiet and air conditioned. Perfect for hot afternoon. Very short cab ride from Hoan Kiem Lake. Admission charge for 2 adults less than $2."
        }, 
        {
            "index": 295, 
            "rating": "5", 
            "review": "Fine Arts. Better for showing history and culture than any museum in Ho Chi Minh City. Shows Hanoi as the cultural city of Vietnam. Wonderful French colonial architecture."
        }, 
        {
            "index": 296, 
            "rating": "5", 
            "review": "Superb. The art we saw was outstanding yet we were almost the only people in the Museum. Not the easiest place to find but well worth a visit."
        }, 
        {
            "index": 297, 
            "rating": "5", 
            "review": "Very worthwhile to visit. Housed in a French designed building, this museum is packed full of beautiful artwork from Vietnam's history from sculptures to silk paintings to oil works and wood paintings. There are lots of stairs so wear comfy shoes!"
        }, 
        {
            "index": 298, 
            "rating": "4", 
            "review": "A must-see for ones who are interested in art. I used to visit this museum many times but still want to come back if having free time. The museum showcases a lot of Vietnam's cultural and artistic heritages which are arranged in chronological order.A visit to this museum will provide you an insight into Vietnamese history and understand Vietnamese spirit through different time, under talented hands and eyes of artists. With those who do not specialize in the arts, the museum is still a good place to see interesting things includes wide range of pictures, statues, sculpture, decorative art in temples, pagodas, tombs, houses and royal palaces. Remember to take your camera with full battery - you will feel like to take photos of so many beautiful artifacts there :)With a very little money for entrance fee, you can have a great time there I'm sure :)"
        }, 
        {
            "index": 299, 
            "rating": "5", 
            "review": "Worthwhile. The facility is older, with confusing layout. Only some of it is air conditioned. But...the collection is really outstanding. From the historical and tribal artifacts to the beautiful lacquer paintings to the fascinating contemporary items, the museum was a wonderful surprise. Unfortunately, most Vietnam tours concentrate on historic, if not ancient sites, ignoring the contemporary efforts of a developing nation. My suggestion is to find some time for this gem."
        }, 
        {
            "index": 300, 
            "rating": "4", 
            "review": "Don't miss the temporary exhibition space. The lacquer and silk paintings are always a pleasure to visit here, but don't miss the new ceramics wing and especially the temporary exhibition space which often shows contemporary artists and can be visited for free."
        }, 
        {
            "index": 301, 
            "rating": "4", 
            "review": "History of art. A particularly interesting insight into to history of art and artists of Vietnam .Sculptures and Buddhas landscapes ,silk painting ,beautiful lacquer work.The artists paid by the state ,the art reflects the moods of the country from propaganda inspired pieces to modern sculpture.Great for a rainy day."
        }, 
        {
            "index": 302, 
            "rating": "5", 
            "review": "Unexpected treasures in Hanoi. Wasn't sure what to expect, but this was great and stood comparison with any art museum in the West (and for my money better than the equivalent in HCMC). Well displayed and labelled, good clear layout. Some excellent early sculpture. But the real highlights for me a room of remarkably realistic eighteenth-century lacquer Buddhist figures; lacquer paintings, something I'd not seen before; and some scorchingly powerful paintings of the revolution and war period. The shop somewhat bizarrely placed in the centre of the museum is well worth a visit."
        }, 
        {
            "index": 303, 
            "rating": "5", 
            "review": "Great art museum. We have been to some of the world's finest museums in Madrid and all over Italy and I can truly say that this museum was a pleasant surprise. We had no expectations and the art was of exceptional quality. I would recommend it to anyone that loves art."
        }, 
        {
            "index": 304, 
            "rating": "3", 
            "review": "Oke, but not a must. Ground floor is Buddhist history dating back centuries, the other floors are us Vietnam war art, nice but explicit sometimes."
        }, 
        {
            "index": 305, 
            "rating": "5", 
            "review": "Beautiful collection of Vietnamese arts. We spent a morning wandering about this Museum. There is a broad range of Vietnamese arts on display from ceramics, paintings, embroidered silk, furniture and sculptures. Some of the pieces on display are amazing. The museum is across the road from the Temple of Literature, also worth a visit."
        }, 
        {
            "index": 306, 
            "rating": "4", 
            "review": "first visit 2011. This museum is near the Temple of Literature and well worth a visit. There are some impressive Viet sculptures and many paintings and ceramic work by noted Viet artists. The museum has 3 floors and if I remember rightly, it's free. There is an interesting gift shop run by the wife of a famous Viet potter and she speaks English so can give you added interesting info."
        }, 
        {
            "index": 307, 
            "rating": "4", 
            "review": "Good place to start to delve into Vietnam traditional fine arts and modern art. I liked almost everything except some wrong translations in english and in french. Very quiet place given the disdain of locals for fine arts (during my 3 hours visit, I only 3 local visitors)"
        }, 
        {
            "index": 308, 
            "rating": "3", 
            "review": "A solid afternoon out. I love art and we've visited many art exhibitions and museums on our travels, so my husband and I were looking forward to this.It's not too far to walk from old town, about 20 minutes. The entrance fee was 30K each, which was reasonable considering how much there is to see.We did enjoy it, but there are some criticisms - they don't provide a printed guide/map (even one sheet would be enough) to show you what each room contains. There is a map outside on a board, but this 1930s building has A LOT of rooms and at times was difficult to navigate - or, rather, it didn't have a good flow - and we were worried that we'd miss something.It's generally well lit (not all rooms) and some parts have air conditioning - after negotiating all those stairs it felt like a bit of a workout.The staff weren't unfriendly, but they weren't helpful either - some were doing each other's hair, and one was sleeping in the gallery! Nobody acknowledged us as we walked around, which was a shame. Might be nice if they had staff who could point you in the right direction/explain about the more important works.It took us around 2.5 hours to get round everything, but we were skipping things at the end - we almost felt like there were too many similar items on the walls.We wanted to stop at the adjoining café afterwards for lunch, around 13:00, but it looked closed and had no vibe at all so we went elsewhere (Moment café about 10 mins walk from museum, which was excellent). Overall a good way to spend a couple of hours, but not an enthralling experience."
        }, 
        {
            "index": 309, 
            "rating": "5", 
            "review": "Very well done!. Do not miss the amazing Vietnamese art here. The lacquer paintings are beautiful and unique and so are the silk paintings. The contemporary art is also very good and telling of the country;s history. This is an impressive collection and please do NOT overlook the ceramics in the lower most level!!!"
        }, 
        {
            "index": 310, 
            "rating": "4", 
            "review": "Fine Arts Museum. A huge display of art housed in a lovely old building. Numerous rooms to get lost in. The sculptures were great. They ranged from ancient to modern. Many of the modern ones are war focused. The art work is very varied from ancient to modern and we thoroughly enjoyed the different mediums used. We have taken a large selection of photos of the various pieces on display"
        }, 
        {
            "index": 311, 
            "rating": "4", 
            "review": "Not up to what I hoped, buit still good.. I was thrilled to see some of the art I had previously seen only in photos, especially the Impressionist and ethnic art. I was surprised that some of the “revolutionary” (propaganda) art was quite good. I cannot help but feel that Vietnam has even more to offer, but, I suppose that is in Saigon. I am also not all that knowledgeable about art. It was very easy to get to and leave via taxi."
        }, 
        {
            "index": 312, 
            "rating": "5", 
            "review": "The best visit in Hanoi. The museum is in a beautiful building and is packed with fascinating artefacts. Fine Nguyen dynasty sculpture and paintings, beautiful woodblock prints from the mountain peoples, and amazing contemporary works are all on display. I really enjoyed looking around, the art on display is breath taking."
        }, 
        {
            "index": 313, 
            "rating": "3", 
            "review": "good.. it was interesting to see, however a bit repetitive. although we are not arty people so others may enjoy it more."
        }, 
        {
            "index": 314, 
            "rating": "4", 
            "review": "An entire range of art under one roof, several floors, and great shop for purchases. When you get your ticket stamped, pick up a map. Situated in this old French colonial mansion with its wings, you will find art ranging from the early era of Vietnam's history, Cham art, religious art, an excellent display of ceramics and traditional tribal arts. There is a large selection of contemporary art. I would recommend reading up on the arts of Vietnam before coming to the gallery OR stopping in at the first gallery shop that sells original prints (approximately $200 much better than other galleries in the city), oils, some other items, and some excellent art books at incredible prices (about $25). Study them if you are interested and come back. You will not be sorry. It is a great place to learn about Vietnam and its art. The fee to get in is 30,000 dong. There is a nice little cafe on the property."
        }, 
        {
            "index": 315, 
            "rating": "3", 
            "review": "Difficult to find Fine Arts in this museum. One of my friends is an artist so she wanted to visit an Arts Museum. It's close to Van Mieu, a popular tourist attraction. Therefore instead of visiting an Art Gallery, we went to visit this museum after going to Van Mieu. The building outside looked okay. However, you couldn't find any good quality Arts exhibits there. The exhibition hall was old, not well maintained. The exhibits were crowded together. And the way they classified the exhibits were quite strange to me. I think this museum is once for a lifetime. That means, I should just visit it once in my lifetime, not again. It is not a loss if you go without it at all."
        }, 
        {
            "index": 316, 
            "rating": "5", 
            "review": "Fantastic. This museum is very well laid out with a great range of arts and crafts for all to enjoy. Of particular interest are the wonderful displays of clothing, utensils, crafts etc from the very diverse ethnic tribes of Vietnam. There's a lovely coffee shop on the grounds as well."
        }, 
        {
            "index": 317, 
            "rating": "3", 
            "review": "Mediocre Museum. This was a one block walk from the Temple of Literature, which we loved. The first floor has artifacts dating back 2000 years so that was interesting. The 2nd and 3rd floors had contemporary paintings and statues that we skimmed through, although we did pause to take pictures of the unique monks' statues on the 2nd floor. There was hardly anyone else there."
        }, 
        {
            "index": 318, 
            "rating": "5", 
            "review": "Interesting for lovers' painting. We just visited Fine Arts Museum to update our guide book to travelers. Interesting museum where you find paintings exhibited by themes: wars, reconstruction of Vietnam after wars, scenic landscapes in Vietnam etc...We Cosmos Travel Vietnam Co., Ltd believe that travelers loving painting and fine arts should visit this museum before looking at galleries in Hanoi or Saigon"
        }, 
        {
            "index": 319, 
            "rating": "3", 
            "review": "Interesting art pieces. There are some interesting art pieces there including large sculptures of well known buddhist monks, however when it came to the paintings, it was slightly disappointing, not because of the subject which trended towards popular communist themes, but because the general execution of the pieces (and maintenance) seems to be of a lower standard than some of the galleries we visited nearby!"
        }, 
        {
            "index": 320, 
            "rating": "3", 
            "review": "Notional but not world treasure. As one expects a lot of art works with propaganda flavour. However this doesn't mean that they are better or worse. Most of the works are quite similiar in the terms of style. A lot of painfull realism and not so many art-works that would fit into frames of other art movements."
        }, 
        {
            "index": 321, 
            "rating": "4", 
            "review": "A Great Tour Guide. Our tour guide Nguyen Duc Dien from Indo China tours was so informative, and an excellent guide. He looked after us so well and answered all our questions. We also visited the old Quarter, The Temple of Literature, Lake Of The Restored Sword and Ho Chi Minh's Mausoleum which was closed because of celebrations for his birthday. We had been there in 2007, and saw him lying in state. Dien made sure we were checked onto our next flight before he left us. "
        }, 
        {
            "index": 322, 
            "rating": "3", 
            "review": "Good place to keep dry or cool off. A short walk from the Temple Of Literature and worth it, particularly if the weather is wet or very humid. There's 3 floors of well displayed exhibits including some VERY good modern work. Could do with more seating so that you can rest and take in the bigger exhibits. There's a coffee shop in the grounds"
        }, 
        {
            "index": 323, 
            "rating": "3", 
            "review": "Fine works displayed. A beautiful display of fine art works and artefacts, worth spending an afternoon to enjoy the pictures and sculptures."
        }, 
        {
            "index": 324, 
            "rating": "4", 
            "review": "Interesting perspectives on Vietnamese culture. The Museum has a good collection that provides a visitor to Vietnam with very interesting perspectives on the development of Vietnamese society and culture over many hundreds of years, although with greater emphasis on the last 100 years. The collection includes a range of art forms - paintings and prints, sculpture, ceramics, etc. It also has a large space devoted to temporary exhibitions, which was occupied by a quite lovely collection of recent paintings on the day of our visit. There is a very small entry fee. The gift/souvenir shop is a good one. Worth a visit even if you are not an art buff."
        }, 
        {
            "index": 325, 
            "rating": "4", 
            "review": "Some excellent art works. I went to this museum twice, it was far bigger than I expected. There is a mix of war-type art and contemporary, both enjoyable though overall I preferred the contemporary. If you like seeing a mix of different work by various artists, you can find this here. Recommended.I bought a couple of pendants from the gift shop, 60,000 VND, attractive, small gifts."
        }, 
        {
            "index": 326, 
            "rating": "5", 
            "review": "Wonderful variety of art. Perhaps the most absorbing few hours I have spent in any museum. I loved the variety of this place, with so many different styles and materials on display, covering ancient to modern periods.There is a lot to see, and if you don't follow the numerical sequence of rooms (as shown on the printed guide you pick up on entry), it would be easy to miss some interesting exhibits.Some exhibits are amusing, some very moving, some thought-provoking, and some simply stunning in their content/beauty. My particular favorites were The 1,000 Eye and 1,000 Arm Guan Yin, Four Smiles, the lacquered Buddhanandi, Playing as Little Soldiers, Uncle Ho Plays with Children, the bronze Commemoration, the oil Central Vietnam, and the one with the tag \"When you are eating the fruit, think of the person who planted the tree\".A fine must-visit museum, housed in a beautiful French Colonial building."
        }, 
        {
            "index": 327, 
            "rating": "5", 
            "review": "Bronze and lacquer sculptures. Some war bronzes were strong and patriotic. They were the originals of those in museums in the south. Anyone who likes Buddha sculptures will be impressed by the fine lacquer work and the realistic faces on the Buddha images. Excellent lacquer paintings and silk paintings filled two large rooms. Definitely worth the time to see and think about the art Vietnam has produced."
        }, 
        {
            "index": 328, 
            "rating": "5", 
            "review": "Vietnam's Best Art Museum. Hanoi's Fine Arts Museum is likely the country's best museum to see Vietnamese art: both centuries old religious sculptures, textiles, and art, to rotating contemporary exhibits. Housed in a beautifully restored French colonial building, you could easily spend over two hours here (art buffs, that is). Navigating the museum is easy -- signs guide you through the exhibits. One building is dedicated to ceramic, pottery, and metalwork, while the main building has ancient to contemporary works of art. Each room has a plaque that describes the era and type of work -- you know what you're looking at in this museum.Personally, I found the pieces from the past century the most impressive. They detail Vietnam's past, its daily life, victories, tragedies, and everything in between. Entrance is 40,000VND, and you're free to take pictures throughout the museum. You can't bring bags in however: purses and backpacks are placed in lockers near the entrance."
        }, 
        {
            "index": 329, 
            "rating": "5", 
            "review": "Beautiful art pieces. Loved this beautiful museum with its wonderful pieces. The building is worth seeing itself. It's interesting to see the history of the country. Be warned that is is very warm."
        }, 
        {
            "index": 330, 
            "rating": "4", 
            "review": "Overview of Vietnamese Art. Good overview on evolution of visual arts (mostly paintings) in Vietnam. Nice visit for those inclined."
        }, 
        {
            "index": 331, 
            "rating": "4", 
            "review": "Intersting place. I'm basically interested in art museum. This museum secretly shows the history of Vietnam. Almost half of the pictures demonstrated the lifes during the Wars, women and childrens' life, men's life and the connection between soilder and people..Other pictures show Vietnamese daily life in past, cultures, religiousbut those were described in Veitnam, not English. Just only the name written in English, vietnamese , and FrenchThe staffs there rarely speak english.i spend about 3 hrs there. There was a small coffee shop near by. It's very nice ;)"
        }, 
        {
            "index": 332, 
            "rating": "4", 
            "review": "Pleasantly surprised..... After many trips to Hanoi I eventually visited the Fine Arts Museum. Perhaps it was my disappointment in the Art Museum in HCMC that led me to ignore it for so long. I was pleasantly surprised. The ground floor contains the oldest works of stone and bronze and wood, and works from Ly and Tran Dynasty periods. with some being replicas. There are some fine lacquered wooden statues of royalty. The quality of the more modern art on the upper floors is mixed but nonetheless interesting. The adoption of Western painting styles is evident but so is the persistence of Vietnamese techniques and motifs. There are some beautiful, intricate, etched lacquer works. Scattered through the galleries is some very nice bronze sculptures.A separate wing houses applied and decorative art works. Best of this is a newly refurbished ceramics gallery in the basement. It is definitely worth a visit, maybe after the Temple of Literature. It was not crowded, photography is allowed and there is a nice coffee shop to relax at afterwards,"
        }, 
        {
            "index": 333, 
            "rating": "4", 
            "review": "Worth a visit. Very nice art work from Vietnamese artists from different generation. Have some historical items in this museum as well."
        }, 
        {
            "index": 334, 
            "rating": "5", 
            "review": "Outstanding world class museum. We were blown away with the depth and quality of art in this museum. Housed in a stunning building, allow at least 3 hours to fully appreciate the works. Of particular note is the extensive collection of Vietnam war art, amongst the most moving I have seen.Just go. You are sure to find something of interest."
        }, 
        {
            "index": 335, 
            "rating": "4", 
            "review": "Good look at Vietnamese art. It's a good exposure to Vietnamese art. I learned about lacquered wood and etched lacquer. This developed because of the materials that are available locally."
        }, 
        {
            "index": 336, 
            "rating": "4", 
            "review": "Not a bad little museum. This museum shows off the pride of Vietnamese Fine Arts. You need to take it for what it is. There are some pieces that definitely made me pause and admire."
        }, 
        {
            "index": 337, 
            "rating": "5", 
            "review": "great. if you have read my review in bangkok, you will realise that i like art and music. this is also my favourite place."
        }, 
        {
            "index": 338, 
            "rating": "4", 
            "review": "Definitely worth a visit if you enjoy art. We went to visit this museum on one of our first days in Hanoi and were pleasantly surprised by the beautiful displays. We especially enjoyed the Vietnamese art from the 20th century as well as the room filled with statues of famous monks (lacquered wood). The part of the museum with the applied arts and ceramics were less interesting. All in all, a very nice museum for a place that is rather unassuming from the outside."
        }, 
        {
            "index": 339, 
            "rating": "2", 
            "review": "If this is the best that Vietnam's artists can produce, I am sorry.. I am an avid art lover, and I was so excited for this portion of our itinerary in Hanoi. However, I came out of the museum in a slump because I had been so disappointed by the exhibitions. I hope that the collections will become more varied in style and age in the future."
        }, 
        {
            "index": 340, 
            "rating": "5", 
            "review": "Excellent museum which shouldn't be missed. Many wonderful paintings -- oil, watercolor, silk along with beautiful sculptures (many bronze) throughout the museum. Stroll at your leisure to enjoy."
        }, 
        {
            "index": 341, 
            "rating": "4", 
            "review": "Worth a visit. It is not the greatest art museum in the world, far from it, but it is good to acquaint yourself with local art. Due to the country's recent history expect to see war themes predominate but do visit even if you don't like the subject."
        }, 
        {
            "index": 342, 
            "rating": "5", 
            "review": "Interesting insight into Vietnamese art. I learned a lot about lacquer painting here and hadn't realised it was still so popular. A traditional technique has been adapted to western iconography from Impressionism to social realism. Interesting"
        }, 
        {
            "index": 343, 
            "rating": "3", 
            "review": "some good and some bad. The museum is close to the Temple of Literature so worth visiting at the same time. The ground floor galleries and the separate gallery (joining building - to find it you need to follow the \"exi-museum shop signs that will take you through it) are the most interesting, the first floor of the main building is a bit of a let down with fairly modern paintings which I personally did not particularly appreciate, the quality is nowhere close to the value fo the antiquities shown downstairs"
        }, 
        {
            "index": 344, 
            "rating": "4", 
            "review": "Different. Is housed in a colonial building. The artworks are all Vietnamese. The first floor has a large number of ancient sculptures of great quality. The other floors have mostly paintings. Many, understandably have the theme of war in Vietnam and the government of Ho Chi Min. In fact there are pictures of great quality as well as some sculptures. I really liked"
        }, 
        {
            "index": 345, 
            "rating": "3", 
            "review": "Good craft and very average art. The collection of art could be reacher, and the explanations contain less of factual errors and lacks. I enjoyed visiting the crafts collections though. The ceramics room was closed."
        }, 
        {
            "index": 346, 
            "rating": "4", 
            "review": "Worth a visit to see North Vietnam artist perspective. A short stroll from the Temple of Literature, we truly enjoyed our visit to this repository for a small range of interesting art and artifacts housed in a former colonial residence. Room after room are filled with Vietnamese treasures from the bronze-age right up to the contemporary, with an especially rewarding series of lacquer paintings detailing the Vietnam War from a North Vietnamese perspective. The work is not in any kind of climate-controlled environment, so we are glad we went when the weather was cool. Some definite hits like the 1000 eye and arm Quan Lin statue, some excellent Champa era sculpture, and the delicate paintings of Than Van Can and exquisite lacquer paintings of Nguyen Van Binh"
        }, 
        {
            "index": 347, 
            "rating": "5", 
            "review": "Inspiering. Really beautiful, espacialy for western art lovers it really nice to see all art styles you know but than with a vietnamies touch to it. It's a great place to forget about busy hanoi for a while and enyoj art."
        }, 
        {
            "index": 348, 
            "rating": "5", 
            "review": "Loved this place. We spent a couple of ours here. I really loved all of the artwork here. Many lovely Buddhist statues, lots of old artefacts and some interesting paintings. The building it is housed in is a really lovely old French Colonial building. There is also a lovely café in the grounds were we enjoyed a lovely lunch."
        }, 
        {
            "index": 349, 
            "rating": "4", 
            "review": "Larger than I thought it would be. This museum is quite large and has a good variety of works to see. You need at least an hour and a half to go through the museum."
        }, 
        {
            "index": 350, 
            "rating": "4", 
            "review": "Well worth a visit. This is something a bit different from the focus elsewhere in Hanoi. It gives a great insight into a lot of Vietnamese history with some very good exhibits.An oasis of tranquility if you feel the need to get away from the hubbub of the main tourist attractions."
        }, 
        {
            "index": 351, 
            "rating": "4", 
            "review": "Beautiful Building. Loved the building the museum was housed in. Lots to see here with a great range of ancient statues and many contemporary pieces as well."
        }, 
        {
            "index": 352, 
            "rating": "4", 
            "review": "Good overview of Vietnam's fine arts tradition. The museum contains a few prehistoric pieces and some Buddhist statuary of note. Bit it focuses primarily on 20th century art that resulted after the establishment of the first fine arts school under French colonialism. There are many gorgeous lacquer paintings and paintings on silk, very much in a Vietnamese style. The topics of the modern pieces are village life or the fight for independence; there is next to no abstraction or unique innovation in the works, but the museum does a good job in presenting its holdings."
        }, 
        {
            "index": 353, 
            "rating": "5", 
            "review": "Nice art. The museum is located quite near to the temple of literature and some nice restaurants so you can make a nice day of it in this part of Hanoi. The museum features ancient as well as modern Vietnamese art and it's quite a treat to see the two! I particularly enjoyed the modern paintings, depicting the war and daily life in Vietnam. The paintings are not abstract, they all tell an obvious story and I find that refreshing in 20th century art. It's just $1 entry, so go have a wander for a few hours!"
        }, 
        {
            "index": 354, 
            "rating": "4", 
            "review": "LOCAL art history...worth the time to realize the context and content. We usually avoid anything called \"fine arts\" but this was worth the visit because it was truly Vietnamese. It was fascinating to see how the usual European vogues were translated -- more or less successfully -- into the local context. There is a LOT here, because the good collection of the historic carvings and statues to rooms and rooms of painting, silk painting, lacquer works etc. Yes, some of the standard revolutionary approaches and hymns to independence, but that's what the country is about and it is important to recognize the passion behind the positions. Not strong on explanation, but just amble and ramble and you will absorb a lot. Bracket it with the ethnography/history museums and a visit to contemporary galleries (such as Suzanne Lecht) and you will have a good grasp of the artistic whole."
        }, 
        {
            "index": 355, 
            "rating": "3", 
            "review": "story tellers. the museum to me told a story of the struggles that the vietnamese people have been through from colonialism, revolution, war. What a resilient people"
        }, 
        {
            "index": 356, 
            "rating": "4", 
            "review": "Museum with beautiful paintings. Visitors find some beautiful original painting in this museum. It is in Old Quarter not very far from the Temple of Literature and walking distance from most of the hotels. This is a very interesting place for the lovers of Vietnamese paintings and for those keen to know about Vietnam and its people. A good place to spend a couple of hours."
        }, 
        {
            "index": 357, 
            "rating": "5", 
            "review": "Impressive. We were in the main building and saw arts from ancient time up to today. The paintings were the most interesting and it was a lot of history in them. It was also many beautiful silk paintings."
        }, 
        {
            "index": 358, 
            "rating": "3", 
            "review": "Small and limited selection. Unfortunately this lovely building had some historical works but not many contemporary art.The gift shops offered some original works and yet, nothing of young/up and coming artists.The neighborhood is filled with various galleries and art shops with bright and beautiful selections.For the low admission price, it was ok, but it could use more splashes of bright and bold colors one sees in some the Vietnamese celebrations."
        }, 
        {
            "index": 359, 
            "rating": "5", 
            "review": "Fascinating insight into culutral adaptation. The works from the twentieth century have a very strong influence of French modernist styles. Clearly viewable a implicit and explicit styling of Impressionism, Cubism, Fauves, Van Gogh, Gauguin, et al.But each work was transformed subtly (and not so subtly) by Asian aesthetics , content and media (such and lacquer painting).An absolute must for students of art history."
        }, 
        {
            "index": 360, 
            "rating": "5", 
            "review": "Spent the whole day. We loved this museum. Spent the hold day exploring it from to to almost bottom. Start on top floor and work down to see water colors, lacquers, silk paintings and oils reflecting Vietnam culture and past through art. I really enjoyed it. At the end we discovered the wing where we were pretty much alone. One floor was all adornment from hill cultures - clothes, weaving a baskets and more. Then we discovered to our delight that they were setting up for a show of contemporary artists and we were invited in. What an opportunity; met some of them too. From Malaysia, America, Vietnam, and maybe someplace else. Great show. We breezed through the ancient stuff having finally run out of steam. Took a break midway at their cafe - the matchbox. Highly recommend the black sticky rice with yogurt. Yum!"
        }, 
        {
            "index": 361, 
            "rating": "4", 
            "review": "If you are art lovers. Not a big one (comparing to European museums) , but worth visiting to get to know contemporary (mainly 20th century) Vietnamese artists. Great gift shop (prints, posters, books etc)"
        }, 
        {
            "index": 362, 
            "rating": "4", 
            "review": "Some modern and history. Worth a stop to see the modern art. bit of a focus on the conflicts that they had. Well laid out and a nice café on the grounds"
        }, 
        {
            "index": 363, 
            "rating": "3", 
            "review": "First floor is the best. There are some very nice examples of ancient Vietnamese sculpture on the first floor, but you can work very quickly through the newer stuff on the second and third floors without missing value. There is also a very nice café on the grounds."
        }, 
        {
            "index": 364, 
            "rating": "5", 
            "review": "There was no one here!!. A short walk or cyclo trip from the inner city will bring to the museum of fine art. The museum is a three story building which houses, in chronological order - first floor to third floor - , fine Vietnamese art. It is worth a visit if you are interested in the art of Vietnam."
        }, 
        {
            "index": 365, 
            "rating": "5", 
            "review": "Noteworthy.. Allow plenty of time to walk through this wonderful museum with its extensive collection of Vietnamese art from ancient times through modern times. Beautiful galleries with helpful curatorial notes. Many of the war era paintings displayed beauty and originality, suggesting a tolerance and appreciation of artistic expression."
        }, 
        {
            "index": 366, 
            "rating": "3", 
            "review": "For art lovers. The museum is spread over a number of floors with a souvenir shop that is well stocked and reasonably priced. The bronze sculptures were among my favourites. Art works from centuries ago are showing their age but interesting nonetheless."
        }, 
        {
            "index": 367, 
            "rating": "5", 
            "review": "Great Museum. This museum covers Cambodian art over the last 1500 years, with an emphasis on the Angkor Wat and 20th century periods. It also features the best gift shop I have ever seen in a museum. Lots of original art (from small prints to large oil paintings) along with the typical souvenirs and trinkets."
        }, 
        {
            "index": 368, 
            "rating": "4", 
            "review": "Learn a little about Vietnamese Art. I spent a few hours at the museum. Lots of interesting paintings reflecting upon Vietnamese history and culture. Many of the paintings heavily influenced by French artistic movements. On the grounds are a number of large sculptures, some of which are quite good."
        }, 
        {
            "index": 369, 
            "rating": "4", 
            "review": "Pleasantly surprised. The museum is a pleasant way to spend a few hours. It is small but well-curated, and housed in a lovely old building. There are clean bathrooms on most (if not every) floor, a decent cafe and 2 souvenir shops, one of which has a nice selection of original artwork."
        }, 
        {
            "index": 370, 
            "rating": "4", 
            "review": "Worth a trip. Has a great range of art and offers a different perspective on life in Vietnam, it worth a 2 hour visit and won't take you more"
        }, 
        {
            "index": 371, 
            "rating": "5", 
            "review": "Great Art. Brilliant art in fantastic quiet colonial building. Beautiful sculptures and very moving work representing the war. Peace and quiet in the midst of chaos. A must for any art lover."
        }, 
        {
            "index": 372, 
            "rating": "4", 
            "review": "Well worth a visit. A museum well worth visiting when you're in Vietnam. As well as taking in more traditional art forms, the Fine Arts Museum also has a well-presented selection of later, and post cultural reformation art and sculpture. The museum is well laid out and curated with clear, multi-lingual signage throughout."
        }, 
        {
            "index": 373, 
            "rating": "5", 
            "review": "Beautiful!. I thought this was one of the best museums in the area! Very clean and well laid out. Signs were in English so I was able to understand what I was looking at. Beautiful museum."
        }, 
        {
            "index": 374, 
            "rating": "3", 
            "review": "Okay but.... This museum has some beautiful pieces in it especially in there lacquer collection (and toilets everywhere!)The real disappointment is the lack of much information for foreign visitors. Just some basic very dated placards introducing each room. A shame as I really wanted to know extra detail and would have got much more out of my visit if it were there."
        }, 
        {
            "index": 375, 
            "rating": "4", 
            "review": "great art. We love fine arts and this museum/art gallery is fanatic I would recommend to all art lovers. Spread over 3 or 4 floors there is plenty to view. I really liked the war images. There were interesting sculptures and very good use of lighting."
        }, 
        {
            "index": 376, 
            "rating": "5", 
            "review": "Always Interesting. This was my 4th visit to Hanoi in 7 years and each time I have visited this Museum. It's in a rambling old French villa and has lots of fine exhibits. The museum shop which is a little hard to find is well worth looking for/buying at. At $1 (20KDong) this is a bargain and being very close to Craftlink, KOTO and the Temple of Literature all in Van Mieu makes a lovely day out."
        }, 
        {
            "index": 377, 
            "rating": "4", 
            "review": "Surprising museum. Quite a surprise to find such a good fine arts museum. Well worth a visit, and close to the Opera House."
        }, 
        {
            "index": 378, 
            "rating": "3", 
            "review": "Second half was much better (in my opinion). I loved the second part of the gallery with the painting and carvings made from different materials. It was unique and the gallery was in an attractive building. The first part didn't really interest me, more contemporary.Is it worth a visit?.... Yes, but not if time is limited."
        }, 
        {
            "index": 379, 
            "rating": "4", 
            "review": "Great Art Museum. A very comprehensive collection of Vietnamese art, from ancient to present times. Many different media are represented - painting, sculpture, posters, etc. The Fine Arts Museum is across from Van Mieu (Temple of Literature) and the two can be combined, although that would make for a tiring day. Or, save this for an impossibly hot or rainy day. If you're visiting in the summer you'll have your pick of both!"
        }, 
        {
            "index": 380, 
            "rating": "5", 
            "review": "must-see if you're in Hanoi and you love art. I really enjoyed visiting this museum. There was so much amazing art in there across the entire span of Vietnam's history. I was really impressed, not only by how gorgeous much of the art was, but also how unusual and unique to Vietnam. There were many images combining imagery of both war and nature. A few soldiers crossing a small footbridge in a huge steamy green jungle, for example. Another popular theme was the inclusion of modern elements in what seems at first to be a very traditional painting. Village scenes scattered with communist flags. Fishermen casting nets with freighters and smokestacks in the background. I especially loved the lacquer engraving and lacquer painting in the main building. The use of color and composition by Vietnamese artists is spectacular. It reminded me a lot of Klee, one of my favorite artists.I would have to agree with some of the reviewers who commented on what a shame it was that the building itself is probably not very kind to the art. It didn't appear to be very well climate- or humidity-controlled. Also, the official policy is no photos at all, without the museum director's express consent. I really wish they at least allowed photos without flash. There was so much art I loved and would like to remember. They didn't seem to be enforcing the policy very strongly though, so if you have a camera with a discreet setting, you should be able to quietly sneak in a few shots.There is a cafe on the premises, but I didn't get a chance to check it out. Also free lockers next to the ticket window. Tickets 20,000 dong. Quite a bargain! I might go back to check out their applied art exhibit since I didn't have time to view that. Which reminds me...they started kicking people out as early as 4:45pm, even though closing time is supposed to be 5pm."
        }, 
        {
            "index": 381, 
            "rating": "4", 
            "review": "People through art. Art there was remarkable. Not only history of it but the present. It takes you through more than 2000 years. Amazing glimpse into the nations roots and greatest achievements."
        }, 
        {
            "index": 382, 
            "rating": "5", 
            "review": "Amazing collection. Basically had the museum to myself for this visit. An amazing collection of fine arts from many time periods. Not to be missed!"
        }, 
        {
            "index": 383, 
            "rating": "4", 
            "review": "Rich collection. This is a rich collection of pictures, lacquered wooden carvings, statues and other artefacts starting in medieval times and coming right up to date. Some of the pictures are as interesting for the subject matter as for the art, eg the picture of primary school kids practising evacuation during the Vietnam war. So the museum gives a good flavour of the history of Vietnm as well as being full of beautiful things."
        }, 
        {
            "index": 384, 
            "rating": "4", 
            "review": "Cultural Historic Treasure. The Fine Art Museum is set up in three floors of chronological order with the oldest on the ground floor. Creative masters and their metamorphosing through time and life's experiences."
        }, 
        {
            "index": 385, 
            "rating": "3", 
            "review": "an absolute treasure in need of TLC. It is difficult not to judge. The Museum is clearly a treasure. I have been a couple of times, although I usually leave feeling a bit of pique. Once, during an exhibition by modern artist Hoang Dinh, I was rewarded with a once-in-a-lifetime opportunity, both rare and humbling, to meet the artist and his beautiful wife. I am still in awe. Not only of their gentle hospitality, but of the work itself - breathtakingly beautiful explosions of color and meaning with a very Vietnamese soul. But, I am very sorry to say, the Museum otherwise is a ramshackle. The light bulbs that aren't blown are sputtering and on the brink of extinction. Excruciatingly rare and beautiful national treasures are crumbling from exposure. There is precious little in the way of explanatory notes in English or other languages to identify epic pieces - although what narrative is provided is excellent. I admit I am spoiled by Museums in the West, like the Smithsonian. I can understand the enormous pride that must lie behind such an exquisite collection but I feel only sad at what is wasting away from neglect. I wouldn't complain except I think that maybe an outcry from the public might shake the government to provide the necessary resources to do this institution some justice. Both times I visited the air conditioning was on the fritz (no worry for me, only the art work), the exhibition rooms were filled with the cigarette smoke of bored security guards, and staff spoke loudly on cell phones, oblivious to the hallowed nature of what was on offer. For all that - I will go again. I will take visitors. I urge other visitors to go to. It is an important place. It just needs some help."
        }, 
        {
            "index": 386, 
            "rating": "4", 
            "review": "Insights into Hanoi's history through art. I thoroughly enjoyed visiting this art museum, more than other sites I visited in Hanoi. I had no expectations, as I have no background in East Asian or Vietnamese art, so everything came as a surprise and delight. The art on display shows a variety of traditional techniques as well as recent forays into more European styles, and gives a rapid overview of several important periods in the nation's history. For a North American visitor, the paintings and sketches from the war period are particularly intriguing, offering a chance to see the war through the other side's eyes. There is a nice shop where you can purchase prints and small originals, and you are left at peace to explore the piles of works on sale."
        }, 
        {
            "index": 387, 
            "rating": "5", 
            "review": "A wide ranging and enjoyable collection with some real beauties. The Fine Arts Museum contains some truly beautiful artifacts and paintings. There are some particularly striking sculptures and carvings. The painting styles and subjects are wide ranging and engaging. An enjoyable morning spent."
        }, 
        {
            "index": 388, 
            "rating": "5", 
            "review": "Best museum in hanoi. This museum has the best collection of vietnamese art. It also gives a sense of the nation history. The work done before 1945 was romantic. I love the painting of a young girl sitting next to lily flowers. Then come the paintings of the war period during which it is very propaganda.The museum is next to temple of literature and make it covenient to have smt planned for half a day"
        }, 
        {
            "index": 389, 
            "rating": "3", 
            "review": "Good insight into historical art. We stumbled across this place accidentally but it was a good find...if you are into art. It was a great insight into styles of Vietnamese art over time as well as seeing their history documented. Some fantastic Buddha sculptures"
        }, 
        {
            "index": 390, 
            "rating": "5", 
            "review": "Stunning works of art here. We found ourselves here after we needed shelter from a downpour.We were amazed at the enormity of the centre and the diversity of the collection.Well worth the visit, and allow at least a couple of hours!!"
        }, 
        {
            "index": 391, 
            "rating": "4", 
            "review": "Art museum. we were alittle rushed as we arrived late , but the art and themed rooms were great to see. The American war was such a sad time in Vietnamese history and portrayed in lots of art here - understandably."
        }, 
        {
            "index": 392, 
            "rating": "4", 
            "review": "Great place to spend a couple of hours. An old French chateau style building holding a range of old and modern art. Some of the 2,000 year old bronze axes and tools are intricately carved and make fascinating exhibits. We saw strong Indian and Viking reflections in some of the stone carvings. The modern pictures were more disappointing but provided an interesting contrast to the older and more detailed works.It's opposite the Temple of Literature so combining this museum with the TOL gardens makes a good trip. The gift shop has some nice if pricy items."
        }, 
        {
            "index": 393, 
            "rating": "5", 
            "review": "Prepare to Spend a Couple Hours. This museum is deceptively large. There is limited variety of art in Vietnam compared to what we might be accustomed to from the West. What is here is worth the visit, however. You will see the history of Vietnam expressed in art. The museum was much larger than I expected, so prepare to spend a couple of leisure hours wandering through the many floors and sections."
        }, 
        {
            "index": 394, 
            "rating": "4", 
            "review": "Well worth a visit. This is just across the road from the Temple of Literature, and a lovely old building, so we went in to see what was on offer. It gives a good insight into the various art forms in Vietnamese history, but we especially liked the paintings, which reflect the turbulent history of the country but in a beautiful and creative way. A very worthwhile visit."
        }, 
        {
            "index": 395, 
            "rating": "3", 
            "review": "Average. I want to see more big paintings and sculpture, but I love some of the paintings, Please ask for the direction before going there, we get lost when we get there since they don't have big signs on the outside"
        }, 
        {
            "index": 396, 
            "rating": "5", 
            "review": "Well worth the visit. saw some amazing art and really appreciated the culture of Vietnam. The place is extremely well run and the staff most helpful. A must for when we comeback"
        }, 
        {
            "index": 397, 
            "rating": "3", 
            "review": "Overwhelming due to the amount of artwork. Was interesting but for each different style there was a large amount of artwork which made it overwhelming. Could have been a lot more concise."
        }, 
        {
            "index": 398, 
            "rating": "5", 
            "review": "Fantastic and amazing. We roamed around the museum and it was amazing. It was stated there about the life of people in the past and also about the good deeds of Mr. Ho."
        }, 
        {
            "index": 399, 
            "rating": "5", 
            "review": "Well worth the visit. This was a great museum - the artwork and sculptures are excellent. There is a range of painting styles and the exhibitions are housed in a beautiful building which is worth visiting for the architecture."
        }, 
        {
            "index": 400, 
            "rating": "5", 
            "review": "great for rainy days.. I think one needs to have a special interest to fully benefit.Generally, not disappointing from a casual point of view. We spent a rainy afternoon there, Quite interesting."
        }, 
        {
            "index": 401, 
            "rating": "5", 
            "review": "FIne Arts Museum. We spent hours here. It is beautifully laid out and the artworks really tell the story of Vietnam. Highly recommended."
        }, 
        {
            "index": 402, 
            "rating": "4", 
            "review": "Nice Way to escape the Heat. I went to the Fine Arts Museum one afternoon after a day of sightseeing. It is a 3 story museum with lots of rooms, the museum is a bit outdated but there was a great collection of Vietnamese art. A lot of it referencing the Vietnam War. I really enjoyed the special exhibit which was impressionist art."
        }, 
        {
            "index": 403, 
            "rating": "4", 
            "review": "Enjoyed it!. We really liked this museum! \"The museum is housed in a 1930s French colonial structure, which originally housed the daughters of the French colonial elite who came from all over Indochina to Hanoi to study.\" Of course, air-conditioned & very peaceful. A bargain at 20,000 VND!"
        }, 
        {
            "index": 404, 
            "rating": "5", 
            "review": "I'm really like Fine Arts Museum. I'm visited the Fine Arts Museum a few day ago. It offers a fascinating spectrum of Vietnamese art, from ancient to very modern. This is a collection of sculptures, ceramics, silk paintings, lacquer paintings and a few oil paintings... I'm really like Fine Arts Museum"
        }, 
        {
            "index": 405, 
            "rating": "4", 
            "review": "A collection of Art!. This is the place to go for all artistic people or perhaps those who enjoy gazing and staring at a piece of art, I enjoyed the sculpture section but the rest of it isn't what fascinate me.However this place is indeed highly recommendable for tourists. VND20,000 for entering."
        }, 
        {
            "index": 406, 
            "rating": "5", 
            "review": "Unique insight into the fine arts of Vietnam. Great building holding a well curated and high quality selection of paintings, prints, and sculpture .Serene, beautiful and we enjoyed it without any guides or other patrons. 10m people in Hanoi region and we had it all to ourselves!Do yourself a big favour and enjoy this treasure and be humbled by the depth and breadth of the artistic culture of Vietnam"
        }, 
        {
            "index": 407, 
            "rating": "4", 
            "review": "A gem. Therecare some very good exhibits in this amazingly peaceful french collonial building. Leave plenty of time is this is what you like. I stayed for over two hours walking the three floors. In the courtyard is also a nice little restaurant where you can refresh. Located close to the Temple of litterature, its worth the effort to make time for this one."
        }, 
        {
            "index": 408, 
            "rating": "4", 
            "review": "Fine Arts Museum. The fine arts museum was quite interesting! It was virtually a ghost town which made wandering through the exhibits very relaxing and enjoyable (not to mention that the AC was divine after a morning spent touring the Temple of Literature). The museum itself is under renovation, but still worth the visit."
        }, 
        {
            "index": 409, 
            "rating": "4", 
            "review": "Fine Arts Museum. The collection of artworks is very interesting, especially the pieces produced after French colonisation and the lacquered works. It was a nice way to spend a steamy afternoon."
        }, 
        {
            "index": 410, 
            "rating": "5", 
            "review": "very nice art pieces. If you want to visit a quite nice museum : there you are ! very nice peices of local art. Nobody around. the restaurant on the ground floor is excellent."
        }, 
        {
            "index": 411, 
            "rating": "4", 
            "review": "Undergoing renovations but fascinating nonetheless. The Fine Arts Museum consists of two buildings, one directly across from the main gates and one to the right. The one to the right was mostly textiles and pottery, although the pottery display in the basement was closed due to renovations. The textile displays were moderately interesting.The main building, opposite the gates, had some excellent displays of ancient artifacts, definitely well worth a visit. Also some modern paintings and sculptures.The front gate asks that you leave your knapsacks in a locker in the front gatehouse. We did that initially but after seeing many people carrying their packs and waterbottles around, retrieved our stuff. There was supposed to be an attendant in the locker-room but no one was staffing it."
        }, 
        {
            "index": 412, 
            "rating": "4", 
            "review": "Another Perspective on Vietnam. Ordinarily I am not into this sort of thing. But the artwork was impressive and varying. It could have done with a few more desciptive palques to give you a greater feel in certain contexts. But I was pleasantly surprised - a welcome way to escape the heat and humidity."
        }, 
        {
            "index": 413, 
            "rating": "5", 
            "review": "Art and culture. interesting to see what was on display you can see a lot of the red flag in the art work, some beautiful works on display, some of the traditional work is amazing"
        }, 
        {
            "index": 414, 
            "rating": "4", 
            "review": "Very interesting. We were supposed to go to museum of ethnology but it was closed (note most public buildings are closed on Monday's) so went here instead. Lots of interesting art pieces dating back many years, we had a guide who was able to explain in depth about the country's long history"
        }, 
        {
            "index": 415, 
            "rating": "4", 
            "review": "Well worth a visit great contemporary art section. Beautiful building and great location. Only a few dollars for entry makes this a great choice.Lots of rooms to explore. Sure to find something of interest. I enjoyed contemporary gallery.Gift shop is different - piles of pictures and you can meet the artists!"
        }, 
        {
            "index": 416, 
            "rating": "4", 
            "review": "Classic View of Vietnam. Surprisingly un-modern art where the impressions of the American War are naive and simple, but incredibly realistic, depicting the struggle and the committment of the VIet. The historical exhibits belie the modern beliefs, but point back to a more romantic and spiritual time before the conflicts."
        }, 
        {
            "index": 417, 
            "rating": "4", 
            "review": "Nice place. Probably not a place of must see in Hanoi, but do drop by if you have time or want to find a place to take a respite from the summer heat.The art work and paintings on display are most pleasant if you appreciate the arts. The air con rooms on the ground floor are very cosy and overall I think a very pleasant place to spend an hour or two and learn a bit about Vietnam's history of fine arts.Recommended"
        }, 
        {
            "index": 418, 
            "rating": "5", 
            "review": "If you're interested in art...... if you're interested in ART this is a must see in Hanoi with examples of work from the 11th Century right through to contemporary artists.I loved it and you can get a small book in the shop to remind you of some of the best pieces for 50,000 dong ($2.50)...you can't go wrong.In my Guide book it said there was an entrance fee but on the day I visited I did not have to pay."
        }, 
        {
            "index": 419, 
            "rating": "4", 
            "review": "Decent Art Museum. Admission was about a $1 USD. The layout was a bit haphazard with signs leading you to the next area. Lighting could have been better, but nice selection or pieces dating back to the 11th century and some modern pieces. One room had short videos as art exhibits. One video showed a drawing on what seemed to be a white board. The artist would throw a rock in the water and the splash of water would dissolve the drawing.Gift shop at the end with a no pressure attendant. Entire place is air-conditioned as was a nice retrieve from the 38 degrees (100 F) outside."
        }, 
        {
            "index": 420, 
            "rating": "4", 
            "review": "Skip the first floor. Unless you are looking for a historical museum as well skip the first floor, filled with artifacts and all other things I personally found hard to associate with fine arts.The rest of the building provides a decent selection of fine art works, nothing extremely spectacular in my opinion yet worth a visit if you appreciate arts. Do avoid the afternoon in full sun as the a/c units and fans cannot beat the 34 / 38 degrees Celsius in summer."
        }, 
        {
            "index": 421, 
            "rating": "4", 
            "review": "Great Museum - lots of variety. My husband and I visited this museum in March and had a great experience. We had started our morning with a visit to the Temple of Literature across the street, which was crowded and less impressive than we expected. We decided to try this museum afterwards as an afterthought, but were glad that we did!Given how large the museum is - it covers two buildings with at least three floors each - it felt very manageable. We walked through the whole museum from start to finish and didn't get bored at all. The information cards in English are very informative and helpful in enhancing appreciation of the art and artifacts. The galleries are arranged chronologically, which we found really helpful for grasping the history of fine arts in Veitnam. Definitely recommended."
        }, 
        {
            "index": 422, 
            "rating": "5", 
            "review": "Great Museum, \"World Class\" enjoyed it and went back a 2nd time. The art depicted 1000 years of the countries fine arts, and Vietnam has some seriously incredible art. The lacquer medium was demonstrated over a centuries old tradition. The statuary over 300 years old and it's lacquer (all natural form local trees, barks, 23K gold, silver, pigments only found in nature, layered on in over 8 layers, sanded and relaid) was worth the trip alone. A real education. As Le E'cole de Beaux Arts the Parisian University 350+ years old (see: Henri Matisse, etc) has a division in Hanoi for over 90 years now, the museum has Post-impressionism and many other fine paintings the styles of which you will be familiar with. Truly on the top 3 things to do in Hanoi group."
        }, 
        {
            "index": 423, 
            "rating": "5", 
            "review": "Amazing art work. We walked here from the Temple of Literature as it's not far and we had time to spare and were blown away by the quality of the art work here. Many pieces depicting the time during the war, the most amazing life sized Buddha sculptures...the list goes on. Not a place to be missed - even if, like us, you aren't really into art galleries. The buildings themselves were also amazing."
        }, 
        {
            "index": 424, 
            "rating": "3", 
            "review": "just a first floor is worth to see. The first floor is really great with the old sculptures and etc,.. the another floors are not a big thing... but I can recommend for everybody visiting the museum."
        }, 
        {
            "index": 425, 
            "rating": "3", 
            "review": "Fine arts museum. The art work spread out over so much space was interesting, I found some of it repetitive- the frames were gorgeous, and the old building is a treasure."
        }, 
        {
            "index": 426, 
            "rating": "4", 
            "review": "Worth a look. Good display of pieces from around the War, as well as some things from the 1400s, 1600s. You can get a sense of what the official preference is as far as subject matter and style. Notably missing are any more modern, abstract or avante garde pieces, which, in itself is an interesting statement. Walkable to other sites: Our complete day started with a bus from Hoan Kiem Lake to Ho Chi Minh's Mausoleum, then walked to Fine Arts, then the Temple of Literature, (Quan An Ngon for lunch), then past Hoa Loa prison to The Vietnamese Women's museum, then a stroll along Hoan Kiem Lake for an early evening Water Puppet show. A full day but a good itinerary for 1 day in Hanoi if you're pressed for time."
        }, 
        {
            "index": 427, 
            "rating": "5", 
            "review": "Worth a look. Had a wide range of artworks to look at and set out beautifully. It is a pretty big space so we didn't see all of the museum but what we did see was interesting."
        }, 
        {
            "index": 428, 
            "rating": "4", 
            "review": "Well worth a visit. I was pleasantly surprised by the range of works in the Museum - buddhist sculptures, artifacts, lacquer paintings, silk paintings, folk art, woodblocks. Entrance fee: 20,000 VND ($1). Close by is Temple of Literature also worth a visit. Need a drink or some great food visit KOTO opposite Temple of Literature in Van Meiu Street."
        }, 
        {
            "index": 429, 
            "rating": "4", 
            "review": "Great panorama of vietnamese art. Although a little bit old and confused (the place has two buildings and the exhibition continues from one to another) I liked very much this museum. They have a comprehensive collection of Vietnamese art from different periods until today and it was good to see that. That's exactly what I expect from a fine arts museum."
        }, 
        {
            "index": 430, 
            "rating": "4", 
            "review": "Interesting collection. I enjoyed this museum very much. The guide had a great appreciation for the Cham and Buddhist art and added to the experience. A good look at the culture over the years."
        }, 
        {
            "index": 431, 
            "rating": "3", 
            "review": "Quite interesting. If you are going to visit this attraction go with a good guide who can put the art into historical context."
        }, 
        {
            "index": 432, 
            "rating": "4", 
            "review": "A great introduction to Vietnamese painting. A great collection of both traditional and contemporary Vietnamese art (with emphasis on paintings). Good explanations in Vietnamese and English. Internal signposting is a little confusing but otherwise a very interesting visit. Not too many visitors when I was there, so very quiet and unrushed. In the front courtyard there is a little restaurant (The Match Box) serving Vietnamese and Western snacks and drinks – all very relaxed and good quality."
        }, 
        {
            "index": 433, 
            "rating": "5", 
            "review": "Fine Arts Museum. Not on the usual tourist list. A Gem of a gallery and a must see. Our hotel told us about this, so we took their advice."
        }, 
        {
            "index": 434, 
            "rating": "5", 
            "review": "Small museum with great collection and bookshop/gallery. The first impression is of a rather small and darkish place, and after paying for a ticket (about 60 Euro cent!) one perhaps doens't expect all that much. Some of the exhibits on the ground floor where one starts are also not too well labelled, giving the impression that this is a typical third-world museum that's poorly maintained. Not true, though.It quickly gets better, and the museum has a rather impressive collection. Some nice sculptures from the last 2000 or so years, and followed by a comprehensive collection of paintings. There are some very distinct schools: traditional/pre-war, many paintings and installations dating from or after the 1960/70 Vietnam war, strongly socialist-inspired work, and more recent/contemporary art. Overall not a huge, but well selected set of works that oen can see in about an hour. Well worth it.There is also a bookshop wiht a well-chosen collection of books on art, with a focus on Vietnamese art. The manager is the wife of an artist herself, and very knowledgeable herself (with pretty good English). There is also a lot of original art on sale - teh best collection I was able to find in Hanoi, where \"copy shops\" abound, and where finding original work is very hard. Prices are moderate to a bit high, starting at 100 US$ for smaller pieces, and with larger oil- or laquer works going for 500+ $. Not cheap, but then they are original pieces.Overall, a defintie recommendation for anyone who likes fine art, or is interested in purchasing a painting or drawing."
        }, 
        {
            "index": 435, 
            "rating": "4", 
            "review": "Romantic. The modern Vietnamese art in this museum is romantic--in both the traditional and revolutionary senses. Lots of positive images of soldiers, peasants, fishers, women, etc."
        }, 
        {
            "index": 436, 
            "rating": "4", 
            "review": "Better than ok. I enjoyed my trip to the fine arts museum but compared with my visit to the Hanoi womens museum it wasnt that great. Thay said, its worth the 20000 entry fee and it has some interesting artworks using a range of different mediums. A nice way to spend a few spare hours if you have the time!"
        }, 
        {
            "index": 437, 
            "rating": "3", 
            "review": "Interesting - although didn't see much modern art. We missioned all the way here one morning from our hotel. We'd seen a piece of art in a gallery that we were thinking of buying and the gallery owner told us other works by this artist were in the museum. Entry fee was not too bad (can't recall exactly) and the main part of the museum is interesting with lots of ancient and older art in it. They allow you to take photos which is quite cool. After a while though, we got bored and were hoping to see more modern art. I don't know if it's just not there or if it doesn't exist as one floor was closed for renovation. This probably represents about 1/8th of the whole gallery, so we didn't see as much modern art as we would have liked. If you're really into art, you'll probably enjoy it. If you have a more mild interest, then maybe it's worth skipping if there are other attractions you want to fit in. Might rather be worth hitting some of the fancier galleries for more modern art."
        }, 
        {
            "index": 438, 
            "rating": "5", 
            "review": "After the puppet show. Make sure you see the rich culture that is Hanoi. Next time I plan to go to Saigon with my family. There is more than just the fine arts but the deep culture too. Vietnam was under the French for a long time...and it shows!"
        }, 
        {
            "index": 439, 
            "rating": "4", 
            "review": "Good collection, sad conditions.. The collection had 200-300 year old paintings as well as fantastic sculptures and staruary. The more contemporary pieces were interesting especially the politically motivated pieces of the 1970's. I enjoyed seeing another perspective on the \"Vietnam\" war. What saddened me was that they didn't have the money to aircondition the entiee collection of artworks. I could see the old painti gs were deteriorarinf. there was no climate control. There was air conditioning on the top floor for the newer works. Hope they get funded for more aircon. I'd spend 1 1/2 - to 2 hours there. There is a restaurant on the grounds. That is convenient and they sell drawings and paintings as well as prints. Nice!"
        }, 
        {
            "index": 440, 
            "rating": "5", 
            "review": "A hidden gem. We were not expecting too much from this place but were surprised to find a well laid out series of spaces with an interesting collection of older and modern Vietnamese art. Also good wine bar on the premises for a drink when you've finished!"
        }, 
        {
            "index": 441, 
            "rating": "4", 
            "review": "Different art. A good display of Vietnamese art. all labelled in English, Vietnamese and French.\nMostly 20th Century, but the style is more classical then most European art of this era.\nLook out for the 'lacquer' art, this is perhaps unique to Vietnam"
        }, 
        {
            "index": 442, 
            "rating": "4", 
            "review": "Cool stop in every way. I agree with all the positive reviews on this site. Spent a very pleasant hour in this museum. Like art but am not an art buff but found plenty to enjoy and interest me here. Day was very hot and had already toured the prison and the Temple of Literature so feeling a bit wilted when arrived but this lovely cool building with its interesting collection which very gently guides through the ages of Vietnamese art was a joy. Found it predictable but sad how many of the pieces depicted war and amusing for them to admit there was no real push to develop Vietnamese modern art until the free market arrived. Well worth a visit and best of all it is very near kotos which is not to be missed"
        }, 
        {
            "index": 443, 
            "rating": "4", 
            "review": "Before buying Vietnamese art. Important to visit if you are serious about buying Vietnamese art. This museum (one of the few that are open on a Monday) displays various art pieces from different generations. Very interesting indeed, need about 90 minutes max."
        }, 
        {
            "index": 444, 
            "rating": "5", 
            "review": "Fine Arts Museum. We spent a very enjoyable time in this museum, which features art works from the ancient to the modern. Cham sculptures, Buddhist statues, impressive lacquer works, modern paintings, all were impressive. Some of the works in the \"folk-art\" section would find a happy home in any fine arts museum in the world. Lovely French-Colonial governmental building, adapted to museum use. A handy restaurant/cafe in the forecourt, where we had lunch."
        }, 
        {
            "index": 445, 
            "rating": "4", 
            "review": "I love this museum the most in Hanoi. As you walk thru the different section, you get a glimpse of Vietnam history, the unofficial version that you won't see by visiting history museum. A favorite place to take my kid as well."
        }, 
        {
            "index": 446, 
            "rating": "5", 
            "review": "stunning. This was one of my favorite stops in Hanoi. I am a design/textile junkie who loves history and art. Not to mention the museum is air conditioned and a quiet retreat from the crazy Hanoi streets. As you wander thru the museum you wander thru time dating back to the 15th century and before working your way up to modern day Vietnam. The history of Laquer painting is also quiet remarkable."
        }, 
        {
            "index": 447, 
            "rating": "4", 
            "review": "Revealing experience. It offers a fascinating spectrum of Vietnamese art, from ancient to very modern. A very satisfying and revealing experience. There is not much of contemporary artists on show. A visit to the museum can easily combined with a trip to the Temple of Literature"
        }, 
        {
            "index": 448, 
            "rating": "3", 
            "review": "Worth a visit if you have the time. Spent about an hour here checking out the local art. There wasn't many people around and the pathway through the gallery is a little confusing but there are plenty of art works to view.There is certainly a major emphasis on revolutionary art and Vietnamese propaganda but it doesn't necessarily detract from the enjoyment of seeing some nice works.The gallery is a little away from the city centre but if you enjoy art and have the time you will appreciate a visit"
        }, 
        {
            "index": 449, 
            "rating": "4", 
            "review": "Interesting museum. Definitely worth visiting. Older art was interesting although nothing especially remarkable. However, we were impressed by the contemporary art."
        }, 
        {
            "index": 450, 
            "rating": "3", 
            "review": "Good museum but... Some great pictures but will be spoiled because they are not looked after. Staff sit together and chat rather than ensure the art collection is safe. Flash photography is allowed which will eventually ruin some of the exhibits. If you are in the area worth a visit but don't make a special journey. They shop was shut with no explanation either."
        }, 
        {
            "index": 451, 
            "rating": "2", 
            "review": "a bit of a bore. Several floors were closed, there is no plan to carry around and the staff seemed more intent on knitting than directing one. Loads of toilets/ dear gift shop(s) which appear to be run by comercial groups not museum. Very near to Museum of Literature so go there instead unless you are really into Communist war propaganda and socialist art asian style"
        }, 
        {
            "index": 452, 
            "rating": "3", 
            "review": "Fine arts. Interesting -not well frequented by travellers Picture vietnamese art focussed more on recent times The war is a constant theme"
        }, 
        {
            "index": 453, 
            "rating": "5", 
            "review": "Pleasantly surprised. I honestly was not expecting much (and was expecting a lot of French/European art) but was pleasantly surprised at the great collection of Vietnames fine art. The talent is quite high and it is housed in a charming old building. Was great in connection with lunch at KOTO teaching restaurant which is a 5 minute walk away."
        }, 
        {
            "index": 454, 
            "rating": "4", 
            "review": "Very interesting if you are into art.. Interesting to see the art from hundreds of years ago, which is very different to European art. Western influences only appear in more recent times. You can see the influence of caricatures throughout the centuries is still prevalent today on Vietnamese art."
        }, 
        {
            "index": 455, 
            "rating": "5", 
            "review": "Brilliant. Gorgeous building. I could have sat outside and just stared at the building and architecture all day ...The displays are incredible and very well marked. In particular, we enjoyed the bronze work and statues. HIGHLY recommend this as part of your itinerary."
        }, 
        {
            "index": 456, 
            "rating": "4", 
            "review": "Beautiful Exhibits. My husband and I really liked the exhibits, and the how much was on exhibition. However, we found the way the staff sat round in the galleries in groups talking very loudly rather unprofessional. It distracts visitors from the artwork, and I found myself rushing through just to get away. This happened on two or three levels on the building."
        }, 
        {
            "index": 457, 
            "rating": "3", 
            "review": "Very National, indeed. Previous reviewers have not always emphasized that this is really the National Fine Arts Museum of Hanoi, and that only Vietnamese Art is on display. The upper floor is largely devoted to ancient art, mainly in the form of statues of Buddha and other Buddhist themes, as well as some impressively colorful silk tapestries.The ground floor holds a large collection of paintings, drawings and photographs, as well as a number of relatively modern sculptures in stone and wood that reveal commendable technical skill and occasional artistic vision. The most interesting rooms exhibit paintings and drawings from the time of the Vietnam War to the present. Initially, one is struck but not surprised that they start off as pure propaganda vilifying the Americans and glorifying the communist state in a grotesque imagery borrowed from Stalinist and Fascist Art. Whatever colors the artist may have used, everything comes across metaphorically as black or white. The art of the post-war period is more lyrical and even poetic at times; the subject matter is ordinary people going about their business of restoring normality to the battered country, or conventional landscapes of the countryside. But since the beginning of the new Millenium, propaganda and social realism have taken a back seat. The influence of cubism and abstract expressionism shows in many of the best works, and it would be hard to recognize their provenance. This suggests that \" Bourgeois Formalism\", the biggest sin an artist could commit in the Eastern Europe of the 1950s to '80s, doesn't trouble the current Vietnamese Communist Party, and that control of ideological thought and expression has regressed from that of Orwell's 1984 back to a more normal liberal framework. You could say that on the time frame of the avant gard chronometer, Hanoi has reached about 1960 Greenwich Village Time. There will still be a few decades before their artists try to pass off elephant dung and dirty beds as works of creative art."
        }, 
        {
            "index": 458, 
            "rating": "5", 
            "review": "An amazing collection and very fine building - not to be missed. One of my real Hanoi favourites - this is a superb Fine Arts Museum, full of stunning paintings and a rich array of very fine classical sculpture. Located near the Temple of Literature (Van Mieu), so easy to combine with the usual city high-point visits. Vietnamese oils from the 1920s to the later 20th century are a revelation, and the collection of ancient sculpture is also very fine. The moving works of 20th century war art are particularly compelling. It's quite a go-ahead place with a children's activity centre and periodic exhibitions: I do strongly recommend a visit."
        }, 
        {
            "index": 459, 
            "rating": "5", 
            "review": "A fine tradition. The Museum contains many works of art spanning the history of Vietnam. I was unaware of the great tradition of Vietnamese art until i visited this Museum and the fine arts museum in Ho Chi Minh City. Particularly beautiful are the lacquer on wood paintings. There is also a great collection of sculptures and ceramics."
        }, 
        {
            "index": 460, 
            "rating": "4", 
            "review": "Excellent view of Vietnamese art. Although many of the older paintings in this museum are badly in need of restoration, the contemporary work is really terrific. Skip the dreadful social realism rooms, but don't miss the decorative arts wing. The building itself is a fine example of French colonial architecture."
        }, 
        {
            "index": 461, 
            "rating": "4", 
            "review": "Truely something to experience if you are interested in art. Experiencing the history and seeing how the Vietnamese artists project their history and culture in their art work was a real enriching experience. Never have I visited an art museum where the culture and history of a nation is projected and reflected in their visual art as at this place. A truely enriching experience"
        }, 
        {
            "index": 462, 
            "rating": "4", 
            "review": "broad collection. we enjoyed the layout of this gallery- 2 buildings, 1 with ancient vietnamese ceramics and the other with more contemporary art. It was interesting seeing the development of artistic styles. The \"American\" war is heavily featured and very thought provoking."
        }, 
        {
            "index": 463, 
            "rating": "2", 
            "review": "Not special. Nice to see some old stuff but not really worth a visit. Thr museum is very old and old fashioned. I did see things i have seen in ethnic, war or other musea as well"
        }, 
        {
            "index": 464, 
            "rating": "5", 
            "review": "Culturally relevant. Loved seeing Vietnamese art prior to the twentieth century. Well recommended with the Vietnamese Museum of Ethnology."
        }, 
        {
            "index": 465, 
            "rating": "4", 
            "review": "Fine Arts Museum. I enjoyed this museum that contains a collection of ancient works from VietNam as well as an ample collection of Twentieth Century paintings and sculptures. The works offer a glimpse into the struggles and sufferings of the Vietnames peoples during the last 70 years of liberation struggles."
        }, 
        {
            "index": 466, 
            "rating": "4", 
            "review": "Worth a visit but lower your expectations on presentation. This museum in my opinion is a must. Vietnamese art is pretty amazing and you will see a lot of it on display here. From painting on silk, to lacquer work to statues etc. Gives you an interesting idea into the development of the country, however the artworks are not explained and there is very little information. I was excited too about the museum shop as I wanted to buy some art to find a sultry employee who spoke no European language and could not explain any of the artworks.However I would still visit the museum again."
        }, 
        {
            "index": 467, 
            "rating": "4", 
            "review": "One stop center for historical artifacts and artwork. For a minimal entrance fee, we enjoyed the displays which encompassed art, sculptures and old ceramics and traditional wares. It would be nicer if more details were in English."
        }, 
        {
            "index": 468, 
            "rating": "4", 
            "review": "An interesting place. A big museum with a lot of diferents arts inside. It's not my hobbie but it was a good moment for me, and not too much tourist, so perfect!Just one thing the translation in French is not really good but better than nothing."
        }, 
        {
            "index": 469, 
            "rating": "2", 
            "review": "Freshen it up. Poor presentation. Neglected, badly lit and not enough fine arts represented. Older historical section on sculpture, Buddhas etc, was the most interesting. Needs to be freshened up."
        }, 
        {
            "index": 470, 
            "rating": "3", 
            "review": "worthwhile. not much on the contemporary side; lots of war-influenced art; some great expressive sculptures of buddhist figures"
        }, 
        {
            "index": 471, 
            "rating": "5", 
            "review": "Amazing art, fantastic museum. The pieces displayed here range from antique items to contemporary artworks. Lots of stuff to see, you can't get bored in this museum. If you're not an art fan, I suggest you try a different kind of museum, but for an art enthusiast, this place is a must-see. Great for watching as art progressed from early centuries to modern times. You can also buy different souvenirs and artworks when you visit, and the fee for gaining access is insignificant. Costumes, sculpture, paintings, there are many different aspects of art put on displayed there, and the museum is well organized in sections. Very nice!"
        }, 
        {
            "index": 472, 
            "rating": "4", 
            "review": "lovely. Some of the work was quite beautiful and the displays were lovely. A German tourist moved a sign asking visitors not to take flash photography so that he could snap away taking half a dozen or more flash photographs ; weird.Take a coffee in the shaded cafe area"
        }, 
        {
            "index": 473, 
            "rating": "5", 
            "review": "Much more impressive than expected. This is a very comprehensive museum, covering a couple of thousand years of artworks, including fabrics, clothing and ceramics as well as sculpture and paintings. There's so much to see, it's worth taking a break in the shady coffee shop, as it can be quite warm inside. Do give yourslef enough time to see everything - we went late in the day and had to rush some of the exhibits. Don't miss the powerfully striking bronze 'Memorial' by Nguyen Phu Cuong."
        }, 
        {
            "index": 474, 
            "rating": "5", 
            "review": "Really well done. great museum. covers all aspects of Vietnamese art. very well organized. we spent 3 hours there, but are really interested in art"
        }, 
        {
            "index": 475, 
            "rating": "5", 
            "review": "Lovely suprise. I really wanted to see Vietnamese art as I really have not recognized any in Australia before. I must say I really love what I saw. beautiful paintings on silk and I dont mean scarves , landscapes portraits fine but delicate. I certainly bought certain colours back with me that really represent Vietnam for me."
        }, 
        {
            "index": 476, 
            "rating": "4", 
            "review": "Amazing lacquer work. The museum was very diverse and I especially liked the lacquerwork, it was amazing. The propaganda posters were very poignant."
        }, 
        {
            "index": 477, 
            "rating": "4", 
            "review": "Well worth a trip.. Highly recommend a walk around this museum and the contemporary art is a real highlight. Lacquer work and wood cuts"
        }, 
        {
            "index": 478, 
            "rating": "5", 
            "review": "A look at history through art. the building was nice and the presentations had a nice flow to it. To me the contemporary war art was what I liked best. The use of art to spread propaganda was one of the highlights. Great cafe in which we had a good lunch in the grounds."
        }, 
        {
            "index": 479, 
            "rating": "4", 
            "review": "Good experience -tracing history and art of Vietnamese. This was a little empty of people when we went for some reason, but we really enjoyed going round it. Each room was laid out in a chronological order so you got a really good progression of art, culture and history of the Vietnamese. I really enjoyed it. I hope people don't miss this out on their itinerary!"
        }, 
        {
            "index": 480, 
            "rating": "3", 
            "review": "Fine Arts Museum. It was interesting to see the art but there was a surprising amount of pictures about the wars in Vietnam. I liked the room with differnt cultural dress over time anf the models of differnt houses."
        }, 
        {
            "index": 481, 
            "rating": "5", 
            "review": "Contemporary and traditional art. I liked this museum because it traced the history of Vietnam's art through the ages, ending with a very worthwhile contemporary art exhibition. The curio shop also had some nice trinkets to take back home."
        }, 
        {
            "index": 482, 
            "rating": "5", 
            "review": "pleasant surprise filled with emotional art. We had no idea what we would find. The paintings, on the 2nd floor especially, were amazing. So nice to see the subjects of art not be from the West. Interesting blending of Asian and European styles. Lots of images of war that hit home given Vietnam's 20th century strife. Worth the visit."
        }, 
        {
            "index": 483, 
            "rating": "4", 
            "review": "An address you shouldnt miss it in Hanoi. It's very well display. There are many nice master pieces to see and beautiful sculptures and painting. It will take at least one hour to see all painting on 3 floors at the museum."
        }, 
        {
            "index": 484, 
            "rating": "5", 
            "review": "Nice overview of Vietnamese art and culture.. This museum of fine art is definitely worth going to if you are at all interested in art. It chronicles the art of the country from antiquity to modern times sequentially and is housed in an old colonial building."
        }, 
        {
            "index": 485, 
            "rating": "5", 
            "review": "A MUST SEE!. This is a great collection of art. You can trace Vietnam's history from floor to floor as you enjoy the museum. Put this on your itinerary."
        }, 
        {
            "index": 486, 
            "rating": "5", 
            "review": "Lovely way to while away a couple of hours. My husband and I enjoyed wondering though the Art Museum and seeing the world from a very different perspective. I'm glad we didn't take our teenagers, as this meant we had a more peaceful time and could linger.\nThe on site restaurant is very good quality, worth a trip."
        }, 
        {
            "index": 487, 
            "rating": "4", 
            "review": "Very enjoyable.. Really interesting, not crowded, and full of treasures and laquerwork. I particularly liked the ancient sculptures. (try Matchbox restaurant in the grounds too!)"
        }, 
        {
            "index": 488, 
            "rating": "4", 
            "review": "Early Budhist art. Lovely place to come, esp if its wet. Tour groups do not seem to come here so you can appreciate the art in peace and quiet. a great range of art from 11th century-20c"
        }, 
        {
            "index": 489, 
            "rating": "3", 
            "review": "Unbelievable Carved Lacquer Paintings. For less than USD1 you can gain entry into the Fine Arts Museum and spend an hour or 2 wandering about the beautiful (if chaotically curated) pieces. As other reviewers have mentioned, the signages are very confusing, and you’ll find yourself backtracking as you navigate the rooms. Their rules about photography are also confusing, we were told at the entrance that we could take pictures and then minutes later admonished by another security guard and told no pictures. You can stash your camera and belongings in the free luggage lockers at the entrance. Do look out for the Buddha statues on the ground floor and the stunning carved lacquer work paintings on the 2nd floor"
        }, 
        {
            "index": 490, 
            "rating": "3", 
            "review": "nice but expected more. I have been there with full expectation like other museum.The palce is nice nice and there are some amazing paiting.But personaly I was expected more about."
        }, 
        {
            "index": 491, 
            "rating": "4", 
            "review": "Beautiful And Eccectic Works of Art. The museum, located in two French Colonial buildings, is confusing to navigate and lacks sufficient signage. I first had to figure out where to pay the admission fee, and how to enter the building. The rooms are chopped up and there was no English guides material that I could see. That being said, many beautiful pieces are displayed, including lacquerer ware, paintings, folk art, sculpture etc. i most enjoyed the beautiful collection of buddhist monks, realistic and haunting. Do find them you will be amazed."
        }, 
        {
            "index": 492, 
            "rating": "4", 
            "review": "Made an impression. It really made me realize the depth of Vietnamese art history and scene. Unlike other Asian art, European influence is visible and very interesting. I wish there were more signs and informational material on the art pieces throughout the museum though. It was a bit difficult because there is such little explanation."
        }, 
        {
            "index": 493, 
            "rating": "4", 
            "review": "Interesting stuff. This is the best art gallery we have been to for a while, well worth a visit - and nice and cold inside too"
        }, 
        {
            "index": 494, 
            "rating": "5", 
            "review": "Some beautiful works. If you feel like an art museum, this is definitely worth a look. Lots of beautiful works and of course some interesting communist influences."
        }, 
        {
            "index": 495, 
            "rating": "4", 
            "review": "Interesting museum for art lovers. If you like art or are experienced in Vietnam History this is a great museum, otherwise bring a good guide as the museography is not that great. You'll see interesting pieces of art, and it is a good break from Hanoi's heat"
        }, 
        {
            "index": 496, 
            "rating": "3", 
            "review": "Decent collection across several centuries. The pieces of art are presented in chronological order allowing one to get a sense for the historical development. But they are focused mainly on the colonial history, the Vietnam war and to a smaller extent on traditional Vietnamese life. After a while, each piece seems to meld into another and not much stands out. If you have been to art museums in Europe and at expecting something of that caliber, you will be disappointed. But if you are wanting to get some idea of evolution of Vietnamese art over the centuries, you may find this a reasonable way to spend a few hours."
        }, 
        {
            "index": 497, 
            "rating": "4", 
            "review": "Worth a visit. Once you've paid your 20,000d (bargain) to the miserable cashier (she's so grumpy and rude it's actually hilarious) there are two buildings to explore. Personally I was less interested in the old relics and bits of champa pottery but it's useful context to fine art in Vietnam. Some good thought provoking pieces on the upper floors of the main building.Unfortunatley two floors of the second building were being reinstalled (no discount!?) when we visited but we still poked about a bit and think that both floors will be impressive once completed."
        }, 
        {
            "index": 498, 
            "rating": "5", 
            "review": "Vietnamese Art at its best. The museum has a great collection of Vietnamese art. Although English is limited, the collection on display is wonderful. One of the art dealers in an adjacent building in the second floor has a great collection of art for sale."
        }, 
        {
            "index": 499, 
            "rating": "5", 
            "review": "Endless stairs and small rooms. but they show a wide range of Vietnamese art, and especially the dark side. Would have liked better English descriptions but read up a little to gain better insight. Fabulous old wooden statues/"
        }, 
        {
            "index": 500, 
            "rating": "4", 
            "review": "Worth a look. The only disapointment was the lack of information about some of the displays. Well displayed easy to follow and interesting."
        }, 
        {
            "index": 501, 
            "rating": "3", 
            "review": "I want to take 5 days and rectify the translations all over the Museum.. While in Vietnam I came across an article that discussed that \"Art in Vietnam is not on decline for it had to have reached a peak. It is in its infancy.\"\nWorth the visit for your own verdict."
        }, 
        {
            "index": 502, 
            "rating": "5", 
            "review": "Much better than I expected. Today we went with HanoiKids to the Museum of Fine Arts in Hanoi. And even though I did not have high expectations from such a museum in Vietnam, I was very surprised to find such beautiful paintings and statues. The building itself was a dormitory during the french period and is not conceived as a museum, and thus the rooms are not always connecting. Downstairs are the antiques. Upstairs wooden laquered statues and paintings from the early 20th century, with modern times paintings on the 3rd floor. Lots of really beautiful paintings all by Vietnamese artists. The museum is also a quiet place where you can spend an hour away from the hectic city."
        }, 
        {
            "index": 503, 
            "rating": "3", 
            "review": "Good place to kill a couple of hours. Just like other historical monuments in Hanoi, the Vietnam Fine Arts Museum is worth the trip to kill time and be surrounded by wonderful paintings strongly influenced by its culture and history. The modern paintings at the third and fourth floor are worth the visual trip."
        }, 
        {
            "index": 504, 
            "rating": "5", 
            "review": "Great museum. I found this very interesting and you can quite clearly see the influence of the great painters in some of the styles of the Vietnamese painters."
        }, 
        {
            "index": 505, 
            "rating": "4", 
            "review": "Very big!. Very interesting and various. Clean and quiet. The building is nice, too. But the organisation is a little messy and it is quite big. From antiquity to contemporary times, you will find every kind of things you could find in a museum. If you like paintings, go directly upstairs, there are plenty of them and you would save a lot of energy!20000 VND in June 2012"
        }, 
        {
            "index": 506, 
            "rating": "4", 
            "review": "War and culture. A visit to this museum really brings home the effect of previous wars on the people and culture of Vietnam in a contemplative atmosphere. Easily reached when combined with a visit to the Temple of Literature and not very busy."
        }, 
        {
            "index": 507, 
            "rating": "4", 
            "review": "interesting socialist art. Art gives a context to a countrys history, and you can see it here. there was also a temporary contemporary art show on here from other asian artists which was fascinating in April."
        }, 
        {
            "index": 508, 
            "rating": "5", 
            "review": ".. Big and organized collection, a little bit of everything (contemporary art and ethnic clothes as well).Really enjoyed sculpture collection"
        }, 
        {
            "index": 509, 
            "rating": "4", 
            "review": "Splendid array of the old and new.. Artworks ranging from the ancient (few thousand years old) to the new (20th century) was a delight to see. Ancient sculptures of dragons, lions, buddhas, and wonderfully decorated ancient doors were nice to see on the first level. Then the more recent artworks on silk, oil painting, wood-lacquering was brilliant."
        }, 
        {
            "index": 510, 
            "rating": "5", 
            "review": "OMG - World class art. Was blown away by the moving and technically brilliant art in this gallery. Rooms and rooms of great lacquer work paintings (unique to Vietnam I think) glows with mood and mystery, this gallery just HAS to be seen, on a par with European museums featuring far more well known masters. Worth a visit!"
        }, 
        {
            "index": 511, 
            "rating": "5", 
            "review": "History lesson. The fine arts museum has an extensive history of Vietnam through art works. To walk through each stage totally inmerses you in this rich and complex history story. It also contains more contemporary works and exhibitions of Vietnamese artists. There's also a shop with great art works at affordable prices, great souvenirs and reminders of Vietnam's rich culture."
        }, 
        {
            "index": 512, 
            "rating": "5", 
            "review": "You should not miss it once you are in Hanoi.. The hanoi art museum is one of the best place to visit. In this place, you are fascinated by the evolution of vietnamese art, from traditional art like Dong Ho art, Hang Trong Art ( a kind of wood engraving on Do paper), to lacquer paintings - very special vietnamese artwork, and of course modern art. Nowadays, there is an other kind of painting made from the very popular class of people, the embroidery painting. This is not only a place you can find the works of almost all the famous painter of Vietnam, but you can also understand and across the evolution of the society and the daily life of vietnamese people, through art and age of picture. A meaningful trip across the culture of the country.Nice visit!"
        }, 
        {
            "index": 513, 
            "rating": "2", 
            "review": "Probably better when all floors open. Two floors, the one's we were most interested in, were closed while undergoing display upgrades. What we did see was a bit ordinary."
        }, 
        {
            "index": 514, 
            "rating": "5", 
            "review": "wonderful. Did not have enough time for all of this one so it is on my list for the next trip for sure. It has some beautiful things in the place and art is what makes things go around go and enjoy the sights!"
        }, 
        {
            "index": 515, 
            "rating": "5", 
            "review": "Beautiful Artwork. The museum is in two buildings that offer two different flavors of art. The main building offers some amazing contemporary pieces mixed with historical paintings. I gained a greater understanding of the mood from each period. The other building contained modern art installations with some interactive exhibits. The basement of this building contained antiquities."
        }, 
        {
            "index": 516, 
            "rating": "5", 
            "review": "Excellent Collection.. We walked from our hotel in the Old Quarter - so very accessible.The 'standing' collection is excellent, particularly the collection relating to Buddhism stretching back into antiquity.The Exhibition on 'River Life' showing when we were there was challenging - very 'modern' and gave us cause to think."
        }, 
        {
            "index": 517, 
            "rating": "5", 
            "review": "this is a great museum in Hanoi. wow, it is a must do in Hanoi, one of the best MUST DO in Hanoi and it is just empty since no hanoians are interested."
        }, 
        {
            "index": 518, 
            "rating": "5", 
            "review": "Excellent. Lovely building - loads to see from prehistoric to modern day art. Particularly loved the Buddha statues"
        }, 
        {
            "index": 519, 
            "rating": "4", 
            "review": "Nice displays. Some very nice displays of ancient, contemporary and political artwork in a quiet building in this loud and busy city."
        }, 
        {
            "index": 520, 
            "rating": "4", 
            "review": "Beauty of Art. I like this Museum very much, it show me a lot of beautiful art."
        }, 
        {
            "index": 521, 
            "rating": "5", 
            "review": "Needs more respect. A great museum in Hanoi, but it is concerning that you can touch the exhibits easily, showing a lack of respect for the exhibits, some of which are thousands of years old.\nWell worth a visit."
        }, 
        {
            "index": 522, 
            "rating": "4", 
            "review": "Combine with your trip to the Temple of Literature. Just across the road from the back end of the Temple of Literature. Some good art by Vietnmese artists including some good painting from the French and war periods and some very good sculpture - look out for the different depictions of the Buddha."
        }, 
        {
            "index": 523, 
            "rating": "4", 
            "review": "Art history lesson. See Vietnamese art history and how it has developed over the centuries.Sadly it is underfunded and this is demonstrated by the poor framing"
        }, 
        {
            "index": 524, 
            "rating": "3", 
            "review": "Mediocre - rather unloved. We were almost the only visitors to this large Art gallery. Some very nice pieces but a rather neglected and unloved feel to the place, Too much propoganda art."
        }, 
        {
            "index": 525, 
            "rating": "4", 
            "review": "Very nice collection. This is a very interesting collection of works. Gives insight into the war years as well as other more accessible art pieces. There is a tremendous gift shop selling original works too."
        }, 
        {
            "index": 526, 
            "rating": "5", 
            "review": "Look down. Just walking around looking at the tiled floor was a joy!"
        }, 
        {
            "index": 527, 
            "rating": "5", 
            "review": "a great collection of Vietnamese art. This was a real surprise. I enjoyed the historical/antique sculptures and statues the best. Paintings were good too, though. This is well worth spending 1-2 hours wandering around."
        }, 
        {
            "index": 528, 
            "rating": "5", 
            "review": "A small museum with some astonishing pieces. I have been here before and last time I appeciated the paintings a great deal. This time it was the extraordinary lacquer work. Both times the few stone staues they have really make me smile. An easy museum to go through and enjoy."
        }, 
        {
            "index": 529, 
            "rating": "5", 
            "review": "Lovely. You'll see the evolution of art in Vietnam over the years. They showcase a lot of lovely traditional to contemporary pieces. You'll see sculptures, remnants of old pagodas and different paintings (silk, lacquer, oil, wood, and mixed media ). It was a very interesting visit!"
        }, 
        {
            "index": 530, 
            "rating": "4", 
            "review": "Worth a Visit...Surprised by Breadth of Artwork. We enjoyed seeing the breadth of the collections of paintings, sculptures and other artwork at this museum. It sprawls over three plus floors and basement in the other wing. Our favorites were the hand carved lacquer paintings from the 1960's. In some of the rooms, there was a large focus on war related material that may or may not be to your liking. For us, we tended to go faster through these rooms and enjoyed the buddhas and other historical pieces. It's worth a visit and is a nice place to relax from the busy Hanoi streets.TIP: This is very close to the Temple of Literature so we visited both when on that side of town. In between them is KOTO restaurant (worth a stop for lunch) and a NGO selling Handicrafts (also worth a stop)."
        }, 
        {
            "index": 531, 
            "rating": "4", 
            "review": "lovely, underrated museum. my friend and I both enjoyed our peaceful walk around the exhibits here - strange it seems so neglected. Also nice shop with work by local artists and a great little cafe and wine bar for lunch."
        }, 
        {
            "index": 532, 
            "rating": "5", 
            "review": "Great. Great art museum. they always show great paintings"
        }, 
        {
            "index": 533, 
            "rating": "4", 
            "review": "Another view into Vietnam , a charming museum. This well maintained museum, housed in an impressive but charming building shows at one hand some nice pieces from their huge collection objects from the past and ethnics. The room with the wooden statues of monks is very expressive.The most interesting part consists of the rooms with all vietnamese paintings of the last two centuries that show how western art rules were translated into vietnamese and show at the same time very nice scenes out of daily life. Surprising is the abundant presence of battle scenes and related.It is very close to the Temple of lLiterature and Restaurant Koto, so it is difficult to find out a reason not to go"
        }, 
        {
            "index": 534, 
            "rating": "5", 
            "review": "Interesting View Into Vietnamese Art. The Museum has three floors in the main building. The first floor is antiquities and the second and third floor are paintings, prints and sculpture. In the second building the third floor has a large beautiful ethnology display, not to miss, and the first two floors houses traveling exhibits and the basement has ceramics. Since the museum was started in the 1960’s the bulk of the newer work is from the 60’s and 70’s. The museum has created a visual adventure into early art of Vietnam, and a look into in to the changes of the country in the 1960’s and 70’s. My greatest disappointment is the lack of Vietnamese art of the 1800’s and early 1900’s and they seem not to be collecting, at present, the wonderful contemporary art of the country. There are so many wonderful artists in Vietnam; they need to be shown in their museum. With all that said, I strongly recommend a visit to this unique art museum."
        }, 
        {
            "index": 535, 
            "rating": "5", 
            "review": "Beautiful Art. The varied exhibits were colourful in many ways and gave us a very interesting introduction to Hanoi."
        }, 
        {
            "index": 536, 
            "rating": "5", 
            "review": "great to see. heaps to see here can spend a lot of time in here our quide was very good here ,showing us around"
        }, 
        {
            "index": 537, 
            "rating": "2", 
            "review": "Too focused on army theme. Although I enjoyed the visit, I guess I expected something else. It seems too much of the exhibits are concentrated on art with army themes... I am not personally into that."
        }, 
        {
            "index": 538, 
            "rating": "5", 
            "review": "Fascinating and beautiful. All mediums of art and organic craftExtremely memorable and well worth a visit !!"
        }, 
        {
            "index": 539, 
            "rating": "3", 
            "review": "A clear slant.. The curators of this museum have a clear slant - much of the art work celebrates soldiers and their fight against the \"American Aggressors\" but still, it is an interesting visit."
        }, 
        {
            "index": 540, 
            "rating": "3", 
            "review": "Mildly diverting. Floors are arranged chronologically from bottom to top. Building is noteworthy, perhaps needing some TLC. I mostly enjoyed the contemporary pieces, some were quite memorable. It was very quiet which is an attraction in itself, an escape from the hurley burley of motorbike mayhem. There is a nice cafe by a shady tree in the grounds. A pleasant place to chill out and allow the visual attractions to be absorbed."
        }, 
        {
            "index": 541, 
            "rating": "5", 
            "review": "Excellent. Not one to visit this type of museum but this one is well worth it. Fabulous artifacts"
        }, 
        {
            "index": 542, 
            "rating": "4", 
            "review": "A surprise. Old and new art was easily viewed, very few attendees, some wonderful modern art too. . .the crafts people and artisans in Vietnam are incredibly skilled"
        }, 
        {
            "index": 543, 
            "rating": "4", 
            "review": "You should go if you're interested. It's actually an OK Museum considering that most of the VN museums are terrible."
        }, 
        {
            "index": 544, 
            "rating": "5", 
            "review": "lovely 20th century paintings of rural vietnam and historical. We thoroughly enjoyed this art gallery with some amazing pictures ant other sculptures definitely worth a vist if you like any form of art"
        }, 
        {
            "index": 545, 
            "rating": "5", 
            "review": "Defininetly worth a visit for the art and the gift shop as well.. This is a museum not only about art but also a window into Vietnamese culture and the impact of centuries of war. There are some wonderful exhibits - the Buddhist statues are fascinating, particularly those of the Buddha himself which show him as emaciated rather than fat and jolly. As I looked at these statues I felt like this must have been how Buddha actually looked; and many of the other figures looked individual as well. The lighting is poor and the building shabby but there are still artworks that would hold up in any museum. Also fascinating were how many of the paintings and sculptures referred to war. This is a country that has been invaded many times, by many different armies, over many different time periods. A lovely statue with a classical feel is holding a rifle...this juxtaposition is seen in many works. And if you like to shop, the small store of the museum has some of the best things to buy that we saw on our tour of the country. Many folks told us, 'if you see something, buy it.\" you may not see it again and we were glad we listened to that advice. The museum is definitely worth a visit as much for its window on the culture as anything else."
        }, 
        {
            "index": 546, 
            "rating": "5", 
            "review": "Really Vietnam. Capitals have art museums and most have the European, Japanese, American masters. This museum just across the street from the popular Temple of Literature, is really local. The beautiful French era building is full of relics, not all well-preserved, from the pre-colonial, 20th century colonial and revolutionary times. IT's a lovely building and a great window on their culture.The garden area is a welcome respite from the noisy street."
        }, 
        {
            "index": 547, 
            "rating": "5", 
            "review": "The buddha sculptures alone are worth a visit. Well worth a visit. Things we liked included an exhibition of modern work by contemporary artists, the textiles floor showcasing hill-tribe costumes that inspired us to go to Sapa and some great rice-paper prints which we later saw being sold in the Old Quarter's Ancient House."
        }, 
        {
            "index": 548, 
            "rating": "4", 
            "review": "Interesting collection. From ancient to contemporary, folk arts and domestic art, this collection is spread across two buildings and three floors. I was a bit \"museumed out\" by the time I got here and still enjoyed it. I also enjoyed the quiet - a respite from the noise of the city!"
        }, 
        {
            "index": 549, 
            "rating": "4", 
            "review": "Thoughtfully displayed, suprisingly deep collection. We were pleasantly surprised at this museum, which is far better than equivalent institutions in Delhi and Beijing in providing consistently attractive displays and detailed, English-language explanations of the works on display. The ground-floor galleries are a must-visit, with encyclopedic coverage of Vietnam's cultural history and its distinct regional identities. Several major wood carvings were a real joy, and merited far more time than the hour or so we had before the building closed. The middle floor also had some treasures in store, particularly the lacquer paintings from the early 20th century. One monumental set of screens is truly memorable, unexpectedly rich not only in color but in design and artistic insight. But it's also on the second floor that the propaganda starts to seep in, not unexpectedly given Vietnam's 20th-century experience. On the third floor it becomes relentless. Brilliant technique is no help to an aesthetic language that ranges from the bombastic (the inevitable shot-down planes) to the insipid (Norman Rockwell-in-Hanoi images for the Jane Fonda set at their most witless). Our big regret is that we were not able to get to the adjoining building housing craft exhibits, or to see any contemporary galleries, which I hope would show the arts growing past their Uncle Ho-era stridency. But the bottom line: highly recommended, with managed expectations."
        }, 
        {
            "index": 550, 
            "rating": "5", 
            "review": "the national museum with living artists. I used to work around the corner so I visited this place quite a lot......all of the major schools of art in the last 150 years are represented here....except.....they are dated probably 50years after the schools came into existence...for example impressionism (1870's/1880's) but the school of impressionism in Vietnam seems to be dated 1920/30........also, this is probably one of the few national galleries where you have a chance of accidentally bumping into somebody outside in the coffee-shop who has work hanging on the walls inside the gallery..........if you can get over the obvious propagandist/nationalist role of these artworks and appreciate them (even if some of the schools of art arose in Vietnam sometime later than they appeared in Europe or America)....the artworks are interesting and beautiful...........they also give an interesting insight into developments in Vietnamese history.....there is also an interesting collection of carved Buddhas saved and preserved for posterity from temples all over Vietnam.....also for the aficionados, the collection of lacquer wares and painted silks is beautiful and worth the visit......the museum has a very active conservation unit and there are constantly different exhibitions of new art-works throughout the year.........a visit to the museum can easily combined with a trip to the Temple of Literature and makes a good cultural day out in Hanoi."
        }, 
        {
            "index": 551, 
            "rating": "2", 
            "review": "could be better.. I took my class here as a field trip, so I am keeping that in mind. I get that the Viet are working with what they have, and it is nice that they place the museum inside an old french villa, but that leaves certain design flaws. The museum is a bit tricky to navigate, and unfortunately after awhile, it becomes pretty mundane. Because of the gov't here, the arts doesn't get the best funding, and the art that has survived from the past is slightly...narrowly focused on said gov't. So once you get to the section about Modern Vietnam it become all propaganda and boring. There is some amazing art there, don't get me wrong, and I wasn't expecting for it to rival The Tate, but I was quite let down."
        }, 
        {
            "index": 552, 
            "rating": "5", 
            "review": "If you are interested in art this is a must!. A chronological trip through vietnamese art - just enough info in each room (in VN, French and English), well labelled pieces, very well lit and displayed. We spent four hours following the arrows round and may well go back. There are beautiful ancient sculptures, fascinating late C18th pieces, and the C20th galleries were extremely interesting, tracing the development of outside influences, and particularly of course showing the effects of the war(s) on the artistic sensibility. We really were dead impressed by this place! (And the museum shop was just fine, as was the elegant cafe outside!)"
        }, 
        {
            "index": 553, 
            "rating": "4", 
            "review": "Definitely worth a visit. This museum is close to the Temple of Literature (Van Mieu) and so easy to reach. The rather dated presentation of the museum and lack of information up front does not diminish from the outstanding collection of both historic and modern (late 19th-20th century ) Vietnamese art, if you can get them to provide a room plan which gives you the chronological sequence for a visit (start ground floor on the right). A very satisfying and revealing experience. There is not much of contemporary artists on show, and the gallery of art for sale is a serious anticlimax."
        }, 
        {
            "index": 554, 
            "rating": "3", 
            "review": "Average art museum. This is a collection of sculptures, ceramics, silk paintings, lacquer paintings and a few oil paintings. None of the exhibits really struck me as anything special, but it is a fair diversion for a couple of hours."
        }, 
        {
            "index": 555, 
            "rating": "2", 
            "review": "Not essential. Located in a remarkable 1930ies building, the Fine Arts Museum has three floors. Ground floor offers a limited number of interesting sculptures from 10th to 19th centuries as well as a small collection of archeological artifacts. Particularly impressive are Buddhist deities such as the huge \"One Thousand Eye, One Thousand Arm Guan Yin\" statue. However some of the lacquered statues seem to have been so poorly \"restored\" - maybe with acrylic paint (you can even spot dried paint drops on faces) - that it spoils the pleasure of admiring them. The first and second floors display modern and contemporary paintings and a few sculptures. At least every second one represents armed soldiers or military tanks. I agree that \"fine arts\" is a matter of subjectivity, but honestly some artworks in these two floors are of questionable artistic value and appear out of place in a museum of fine arts. They would better be placed in the nearby Army Museum. In summary, if you are used to visiting fine arts museums around the world, the Fine Arts Museum of Hanoi might disappoint you, even when the admission fee is almost symbolic (20'000 dongs or 1 US$) . Has restrooms. Restaurant on premisses."
        }, 
        {
            "index": 556, 
            "rating": "5", 
            "review": "An excellent museum. We visited the Fine Arts Museum a few years ago. In my travel log, I wrote that the couple of hours we'd spent there hadn't been enough, so next trip we're planning to spend an entire morning or afternoon. It offers a fascinating spectrum of Vietnamese art, from ancient to very modern. In many parts, the displays and lighting are on a par with modern western galleries and museums. Probably not suitable if you're only going to Vietnam for cheap beer, Ha Long Bay and cheap Ts :-)"
        }, 
        {
            "index": 557, 
            "rating": "3", 
            "review": "Pleasant but empty. Seemed to be the only tourists in the place. Interesting sculptures and textiles, but if your home city has a world-class museum, it would be okay to skip. Gift shop has things that you can find elsewhere in Hanoi. Pretty building, but certainly not a must-see."
        }, 
        {
            "index": 558, 
            "rating": "4", 
            "review": "Interesting Sculpture, Paintings and Folk Art. I really enjoyed my visit to this Museum, it was quiet and cool and the art an interesting mixture of sculpture and painting. Definately recommended."
        }
    ]
}