{
    "category": "Istanbul", 
    "entity": "Eyup-Sultan-Mosque", 
    "avg_rating_stars": 4.672191528545119, 
    "review_count": 543, 
    "rating_stats": {
        "poor": 1, 
        "average": 31, 
        "terrible": 0, 
        "very_good": 113, 
        "excellent": 398
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "Tranquil place - a must for all the Ummah. Turkey has done a superb job in restoring the Mazar's of all Sahaba and build mosques around them.\nVery well kept and very clean, its a must for all the Muslims.\nAdjacent to the mosque is the Mazar of Hazat Ayub Ansari - a prominent companion of our Prophet Sallallahu Alaihi Wasallam"
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "Shrine and Masjid of Hazrat Abu Ayub Ansari (RA). It was the place my mother recommended before my departure. I went directly there after reaching at hotel and got fresh up. My hotel was at Beyazit area and I walked to Eminonue squre. From there bought a bus card and asked the number from a window. Then sat in the bus and after 15 minutes reached at the complex. After visiting went to the Piarlote park situated behind. Sat there and had Turkish tea."
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "Spitual experience!. Eyup Sultan was Holy prophet's companion. A very emotional experience for me. Must go there at prayer time. Superb experience! Will visit again on my next trip."
        }, 
        {
            "index": 4, 
            "rating": "5", 
            "review": "Go And see before teleferik. Go see beautiful free mosque and if your muslim, i guess ull enjoy praying there, surrounded by a small local market, a must go before you go up the hill by teleferik to the MUST GO CAFE up the hill, the teleferik ride is small and disappointing but the view from the cafe is more than breathtaking and the drinks and food is simple but more than awesome"
        }, 
        {
            "index": 5, 
            "rating": "4", 
            "review": "Beautiful. Super crowded but beautiful shrine of historical significance. It was hard to look through the crowds but worth the trip"
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "Spiritual . Hazrat Eyub Sultan blessed to have been, went 3-times in 10 days, beautiful atmosphere, bazaar nearby too for gifts etc. Take the tram from Sultanahmet and get off at Eminiou, cross over to bus station catch 99A and get off and Eyub mosque. Don't forget to get a travel pass and you can use it on buses/trams and ferries."
        }, 
        {
            "index": 7, 
            "rating": "5", 
            "review": "A must visit in Istanbul. Venerated by locals and muslims in general, this is definitively a place to visit. A great place for contemplation and nice local culture flavour. Not many tourists go there and there are plenty of cats roaming around."
        }, 
        {
            "index": 8, 
            "rating": "5", 
            "review": "Busy yet peaceful. For Muslims, this is a place of religious importance, as the complex contains the tomb of an important companion of the Holy Prophet. You'll see newly married couples coming for blessings, little boys dressed extravagantly (awaiting their circumcision!) and pilgrims from around Turkey. Its in a residential district and you'll see a lot more skull caps and headscarves than you'll ever see in SultanAhmet or Taksim. Visit to get a sense of religious Turkey. Its an easy bus ride from the Eminonu bus station - just ask anyone how to get to Eyup and ask the bus conductor to let you know when you're there. Shouldn't take more than 15 minutes."
        }, 
        {
            "index": 9, 
            "rating": "4", 
            "review": "Very traditional neighbourhood. A very traditional neighbourhood... wooden houses...outdoor restaurants, big public square with a fountain... the mosque itself is very interesting and of course the cable ride up to Pierre Loti Cafe is worth the travel."
        }, 
        {
            "index": 10, 
            "rating": "5", 
            "review": "Spiritual Expereince. It was a great experience for me to go there. As a Muslim it is a site of great religious importance for me as it is the tomb of the disciple of our holy Prophet."
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "a real pilgramage place. A real sense of people on a holy pilgramage to here and an important place for believers but they are happy to have tourists looking over their shoulders. Does not take long to pass through but a proper sense of the real Islam and the peace that goes with it can be felt here."
        }, 
        {
            "index": 12, 
            "rating": "4", 
            "review": "Great day visit. . A visit to Eyup is essential for both Muslims and non Muslims alike. For Muslims it is believed that the tomb of Ayyub al Ansari, a companion of the Prophet Muhammad, is located there. Historians believe it was discovered by Mehmet the Conquerer prior to the conquest of Constantinople. Though the Blue Mosque is considered as the flagship mosque of Istanbul the holiest mosque is the Eyup Sultan Mosque. The ambience of the surrounding area with the food and gift shops is great. It is also located close to the cable car which accesses the Pierre Loti restaurant with fabulous views over looking the Golden Horn. It is well worth the visit but the queues can be fairly long. Alternatively there is a pathway access to the top. We decided to take the Cable car up and path back down and the kids loved the walk. From Sultanahmet Eyup is easily accessed by ferry which only cost 4 TL which is added bonus with great views of Istanbul from the Golden Horn. From SultanAhmet catch the tram to Eminonu. A short distance is a ferry port Eminönü Haliç İskelesi where you can catch a ferry to Eyup. The mosque complex is only 5 minute walk from the port. We went with a view of spending half a day but ended up spending most of the day there. All in all it is great day trip if you include ferry ride, cable car and the visit to Pierre Loti."
        }, 
        {
            "index": 13, 
            "rating": "4", 
            "review": "People and nature in a peacefully landscape. This view of Istanbul is certainly surrounded by specials feelings. Not only because there is an important cemetery based on Sultan Eyup tomb, but for the incredible landscape you see from the hill and an incredible layout of tombs and parks that makes you forget where you are, or even better, it makes you understand than life and death are the two faces of our coins."
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "Holy place in Istanbul. This is the most holiest place in istanbul, the tomb of Hazrat Abu Ayub Ansari (a companion of our Prophet PBUH). Just opposite the tomb is the Ayub ansari masjid which is reflecting traditional architecture with dombs & pencil minaret. The adjoining graveyard is reserved for burying sultans & high rank officials (even of todays era)."
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "very interesting to visit. the area is full of traditional and religious activities in the mosque and near around , the kids loved playing around the fountain , and with the pigeons , many cheap shops there , and the food is so delicious , you can eat the turkish traditional food for a very good price , we enjoyed it"
        }, 
        {
            "index": 16, 
            "rating": "5", 
            "review": "Beautiful and serene!. A bit off the beaten path, but very worthwhile visiting. Not a real touristy place, more suitable for a pilgrimage to a holy site. This is a good place to observe an authentic Turkish environment, away from the camera click-click of busloads of clueless tourists. One of the older cemeteries is just up the hill. Venture in and lose yourself in the eternity of those at rest. There are many markers with words of wisdom set in the walls that line the path to the cafe, which offers the best view of Istanbul."
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "Eyup Sultan Mosqu. Eyup Sultan history should be googled before visiting this spiritual cite to thourghly enjoy the visit.. Head scarf should be worn when visiting the mosque. The walkway leads to cable cart with stunning views, its a mininal cost but worth the visit."
        }, 
        {
            "index": 18, 
            "rating": "5", 
            "review": "Spiritual Place. This a spiritual place. One can easily reach it by bus from Eminounu 99 and 99A. Is a little walk from the Bus stop. The Masoleum of Hazrat Abu Ayub Ansari is in the courtyard of the Mosque. Great Experience."
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "Combine this and Pierre Loti. Another great mosque with great surroundings. When you have finished this visit, take the funicular up to Pierre Loti at the top and enjoy a drink and a beautiful panoramic view."
        }, 
        {
            "index": 20, 
            "rating": "5", 
            "review": "beautiful. I love to visit moskeés because they bring out a feeling of aw and wonder because of its history and the fact that its still has its use left in this very modern world."
        }, 
        {
            "index": 21, 
            "rating": "4", 
            "review": "Peaceful mosque. So much respect for our beloved prophet's companion, the district and mosque named after Hazrat Abu Ayoob ansari.\nThe chosen host of our prophet on his arrival in Madina, ge us laid to rest here during the conquest of Constantinople.\nA spiritual and place."
        }, 
        {
            "index": 22, 
            "rating": "5", 
            "review": "Beautiful spiritual place. This place had a beautiful sense of spiritualness attached to it people from all over were visiting. We took a ferry over rather than other transport. It was very busy an takes around 30 mins, once you get off follow the hustle bustle of people through the market stalls until you reach a square. There we prayed Asar salah and then went to the mezar to offer our respects and make dua for all. Stunning mosque inside the mens section attached to the mezar. Not far is the telephonic (something like that) cable cars that take you up to a view point. Nice views but ques can be very long. Theres only 4 cable cars each seats 8 people. We waited for ages and missed our last ferry back, but worth a visit if you fancy it. Enjoy."
        }, 
        {
            "index": 23, 
            "rating": "5", 
            "review": "Recommend to visit in Sabah time . The Sultan Ahmed mosque is special place to pray Sabah / Fajr sale time. Many people came to the mosque like to juma. I was very impressed by this."
        }, 
        {
            "index": 24, 
            "rating": "5", 
            "review": "Eyup Sultan Mosque. I have enjoyed wondering around this area so much. It is very classic lovely area. The people are superb and the coffee shops, restaurants and shops are so fabulous. The complete mood was so peaceful at this beautiful area."
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "Remember our great people. Visited Eyup mosque. Very big with many visitors. Nice washing area - Wodoo - and drinking water in many taps. People do visit the mosque for pray then the tomb to read Al Fatiha."
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "Awesome history . WOW what a place to visit. So beautiful and peaceful. The tomb is a must. Unbelievable piece of history. Easy to get to from Eminomu by ferry. Although there are no signs in English still very easy to find. Set in a lovely location within walking distance of everything u need. Walk to the cable car for amazing views of the golden horn from Pierre Loti cafe."
        }, 
        {
            "index": 27, 
            "rating": "4", 
            "review": "Loved it. This is a great place especially for muslims. Its clean, organized and fun if you are the type that enjoys the basic life style of sitting opposite to the fountain on the steps & eating your corn or ice-creams.Lots of cafes & restaurants around which we didn't try. Simit Saray is a good one though. We prayed in the mosque, very clean and well maintained. An interesting experience for muslim tourists."
        }, 
        {
            "index": 28, 
            "rating": "4", 
            "review": "Wonderful Mosque!. Take the ferry from Eminonu and see the tomb as well as the mosque which holds one of the richest Muslim history in Istanbul. It is definitely one of the most crowded mosques of the city which is normally packed with hundreds, maybe thousands,of worshipers every day. The environment is awesome and you really feel privileged to have visited this place."
        }, 
        {
            "index": 29, 
            "rating": "5", 
            "review": "A Important historical site. An interesting historical tomb to visit. A little hard to travel to as we took a bus then had to walk up to the tomb.The site was busy with locals. No guided tour and very little signage around in engish to help ascertain what various monuments were. Guidebooks said very little about the site so maybe a tour guide who had knowledge of the history here would really help."
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "An amazing place. We took the ferry from Eminomu without thinking that this was lunchtime on the last Friday of Ramazan. As a result we couldn't see the tomb and only spent 2 minutes in the mosque before being shushed out (not because we weren't Muslims but because it was getting too crowded). The whole area was packed with thousands of pilgrims, the Imam was preaching, ice-cream and juice sellers were doing a roaring trade. In fact the atmosphere was totally electric, thrilling and very welcoming - possibly the highspot of our entire visit. But we must return at a quieter time to see the mosque properly!"
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "very good. The place is big. Mosque is very authentic. Location is very good. You can go this mosque by car, bus or ship from the sea side."
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "great and free. One of the places where people hear the spiritual tranquility of the lovely month of Ramadan in the crowd of people how to live such a wonderful place to experience a super nice feeling\nless"
        }, 
        {
            "index": 33, 
            "rating": "4", 
            "review": "Beautiful small mosque away from the main tourist trail. Well worth catching a ferry to see Eyup mosque and then walk up through the the cemetery to Pierre Loti cafe for great views.\nThe tile work on the mosque interior of beaufitul."
        }, 
        {
            "index": 34, 
            "rating": "5", 
            "review": "Every nice mosque and surrounding shopping centres. The history of this mosque mesmerised me as a Muslim and the peace and tranquility is just out of this world. As soon as you step outside there is a good shopping area and lively feeling and very vibrant"
        }, 
        {
            "index": 35, 
            "rating": "5", 
            "review": "Steeped in Awe. Everything about this place is jaw-dropping.You don't need to be religious to visit, it is a known and well visited tourist hot spot. I visited with my ex-mother in law and with her being very religious I was treated to a full hour of prayer with her and the other ladies. I found it to be a very humbling place and after prayer was over we had the full tour. The architecture and mosaic tiling was breathtaking. It is free to enter and you must take off your shoes and add a hijab (hair covering scarf) before you enter."
        }, 
        {
            "index": 36, 
            "rating": "5", 
            "review": "A spiritual experience - Eyup Mosque. I would recommend going during the Ramadan time or maybe just before or after the prayer time. It's bustling with locals. You can even catch the start or end of the prayer time. It really adds to the experience. Also, it's an architectural beauty. I would say that the Eyup mosque is more beautiful than the Blue Mosque. Also, you can get a more authentic feeling of a Mosque than the Blue Mosque. The latter is far too touristy."
        }, 
        {
            "index": 37, 
            "rating": "4", 
            "review": "Must go for Friday Prayer. I went to Eyup Sultan Mosque to offer my Friday prayer. The mosque was so crowded that first I wasn't able to find a place to sit but when I got a place it was so difficult to pray. My suggestion would be that go there early to secure a convenient place. After the prayer people start lining up for the Eyup Sultan Mausoleum, good part of it is that no one was jumping the line and pushing. Before going inside the mausoleum, plastic bags were given to the visitors to keep their shoes in it while inside the place. The line was moving and everyone got a good view."
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "Very nice. Big space, nice location and a good atmosphere with shops all around We went there by ferry and enjoyed our time, specially going up the hill where the café is"
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "Epic Mosque. This mosque is a little bit out of the way from the central areas of Istanbul - but easily connected to by bus. It's an epic Mosque, with a rich history and unique design. It also houses a shrine of the Sultan. There's also good places to eat right outside!"
        }, 
        {
            "index": 40, 
            "rating": "5", 
            "review": "cultural. Very intestine experience. Folks wear respectful clothing long sleeves and trousers and a pazhmina or shawl for hair."
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "Very Spiritual Peaceful Place. A Surreal experience, very peaceful found a lot of contentent within the courtyard of the mosque and the actual tomb where one of the Companions of the Prophet Muhammad (peace be upon him) was laid to rest. You will find a variety of shops where there is alot of buzz and hype. Locals are friendly and welcoming Be sure to visit"
        }, 
        {
            "index": 42, 
            "rating": "5", 
            "review": "Beautiful. This mosque is like every other mosques in Turkey. Well designed and full of history signs. Also the grave of Ayub the Sahabi is here you can see it and if you're muslim you can make Duaa.Loved it"
        }, 
        {
            "index": 43, 
            "rating": "5", 
            "review": "The Host of the Holy Prophet's tomb & the mosque. Most of the Muslims feel it their responsibility to pray at the tomb of Hazrat AbuAyub Ansari Raziallahanha, who is popularly known as the host of the holy prophet may peace be upon him. The Holy Prophet sallallahualaihe wasallam stayed at his home for the initial period of about six months at Hazrat AbuAyub Ansari's home. He was later sent as a Governor to Turkey & lived along life & was martyred himself fighting. His grave is here, which has been recently renovated. The tomb also has some of the things belonging to the Holy Prophet. There are also graves of some more companions in the nearby graveyard. The mosque has been built to accommodate a large number of people who come to say prayers specially on Friday. You will regret to miss, if you don't visit this place while in Istanbul."
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "A Spiritual Experience Coming from a Muslim. This place a different league of tourists. Mostly Muslims who come to pay tribute to Abu Ayyub Al-Ansari - a close companion of Prophet Muhammad (PBUH). He was named after the biblical Job. Abu Ayyub was one among the Ansar meaning aiders, helpers or patrons, of early Muslim history or those who supported the Prophet after the migration to Medina in 622 (wikipedia). This is a spiritual journey, we were able to visit the mosque because it was my mother's wish. Took a cab from Basileus Hotel and arrived here in about 20-30 mins. The area has more serious, spiritual, typical muslim overtones with majority of the locals coming in from different parts of Turkey to pay their respects. There are prayer beads, prayer caps and prayer mats being sold everywhere. Someone or the other is always offering people sweetmeats because a child is born, or a child has passed exams or something similar. As a Muslim I always say yes and take a bite, why? I don't know. Tasty treats are being sold outside the mosque, corn cobs, fried potato chips. The mosque has an air of a certain type of calm. There is a huge, old tree in the middle having some significance but as the writings were all in Turkish and no available literature, we did not get to know the tree personally. Highly Recommended for both the religious or the not so religious."
        }, 
        {
            "index": 45, 
            "rating": "4", 
            "review": "Amazing architecture . Same as all fabulous mosques in turkey this one is amazing with its brilliant paintings on the walls and ceiling... A must visit, they also have a really nice market in the area with loads of stuff"
        }, 
        {
            "index": 46, 
            "rating": "4", 
            "review": "Interesting History and Relics. It's best to take the tram to Kabatas and then the ferry to Eyup (and back). We took a taxi there (due to shortage of time) and almost got scammed big-time. Then took the ferry back to Kabatas after the cable car trip to and from Pierre Loti. It's a bit of a walk from the ferry stop to the mosque/cemetery and cable car station, but you pass some interesting shops on the way."
        }, 
        {
            "index": 47, 
            "rating": "4", 
            "review": "Important for Muslims, not so much for tourists. If you are traveling Istanbul as a non-Muslim tourist, this is a pleasant place to visit, but nothing that really stands out among the great mosques of the area. Good place to people-watch."
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "Beautiful mosque at the top of the Golden Horn. This is a beautiful smaller mosque at the top of the Golden Horn -- it's usually rather busy as it's also an important shrine for Moslems, but very well worth the trip, especially if you get there by using the ferry service up the Golden Horn from Eminonu."
        }, 
        {
            "index": 49, 
            "rating": "5", 
            "review": "Rich history and not as crowded as other tourist haunts.. Eyüp Sultan Mosque (“Camii”) is situated in the Eyüp district of Istanbul, outside the city walls near the Golden Horn (“Halic”). Ayub al-Ansari (Ayub = Eyup in Turkish), a companion and standard bearer of prophet Mohammed is buried in a tomb within the mosque grounds. The tomb was constructed five years after the Ottoman conquest of Constantinople in 1453. It was almost 800 years earlier when Eyüp Sultan died during the first siege of Constantinople in the 670s AD.Eyup Sultan Mosque, considered as the fourth most sacred mosque in the world after the mosques in Mecca, Medina and Jerusalem. Many tourists visit this site.Historically it has been Istanbul’s holiest site and was at one time the traditional site for the coronation ceremony of Ottoman Sultans, where new sultans were girded with the sword of Osman (Uthman) one of the Prophet's companions and the third caliph of Islam."
        }, 
        {
            "index": 50, 
            "rating": "4", 
            "review": "spiritual, religious place. A beautiful mosque with a great place all white just in front. The courtyard of the mosque is worth seeing as much as the inside of the building."
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "Beautiful mosque. The tomb of Abu Ayyub al-Ansarim, a close companion of Prophet Muhammad. I would highly recommended it for Muslims"
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "Place of Serenity, Revival of Faith, Holy shrine of Muslim Ummah. It was a place of ultimate serenity. I'll suggest it to every Muslim visiting Istanbul. You'll catch the bus easily from Eminuno station. Pray for whole Muslim Ummah."
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "Spiritual journey. I came here as part of a family holiday in December 2015 - we came to pay our respects to Hazrat Ayub el Ansari (RA).\nThe mosque is beautiful and very well maintained, the resting place of Hazrat Ayub el Ansari was very busy with people flowing through constantly. The experience was amazing."
        }, 
        {
            "index": 54, 
            "rating": "5", 
            "review": "Excellent Trip. it was excellent trip to Istanbul with my family ,the weather was very nice and food excellent we visited a lot of places in Istanbul"
        }, 
        {
            "index": 55, 
            "rating": "5", 
            "review": "A must visit for Muslims. The tomb of Hazrat Ayoub Ansari is a place not to be missed if you are in Istanbul. A special place for Muslims because Ayoub Ansari (RA) was a friend and companion of the Prophet Muhammad (SAW). Here i found it to be peaceful and spiritual. We visited on Fri morning and found many muslims in the tomb quietly reading Quranic verses. Such a lovely peaceful atmosphere."
        }, 
        {
            "index": 56, 
            "rating": "5", 
            "review": "Old beautiful Mosque. I loved this place as I went to Hill top with teleferic and then walked back to this mosque. Nice and beautiful place."
        }, 
        {
            "index": 57, 
            "rating": "5", 
            "review": "Spring Break Istanbul 2016. Eyup Mosque is a historical and religious site at the same time. Many Turkish locals regard it as holy ground. As a tourist you can see the high regard Muslims have for Ayub Ansar (RA). He is one of the original companions of he Prophet Mohammed (SA) buried outside of Middle East. It is good to read up on the history of his life and how they grave was found. You might see some types of worship that are questionable but as a visitor you have to respect the practices. Highly recommend taking a cab to this site as there is no tram that goes this far. It's a bit of a hike, but a must see for all Muslims and history lovers. There is a bazaar in the area and they sell all types of Muslim religious things. It can get crowded, plan your day accordingly."
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "Hazrat Eyup Ansari - host of Prophet SAW. Hazrat Abu Eyup (real name Khalid) Ansari R.A was the honorable citizen of Medinah and one of the earliest Medinese to accept Islam. When Prophet Muhammad ﷺ migrated to Medinah, he stayed at his house for few months. He had the honour of hosting Prophet ﷺ and was a prominent Sahaba (companion) of the Holy Prophet ﷺ . During the reign of Hazrat Muawiya he was part of the first expedition to Constantinople (although he was very old at that time). He felt ill during the course of the battle and left his will to the leader of Muslim army that he should be buried as close as possible to the walls of the city. The mosque and complex is the oldest in Istanbul. Sultan Mehmet Fatih ordered this after he conquered Constantinople and his sheikh (spritual leader) Ak Shamsuddin discovered the grave of Abu Eyup R.A. We planned to take ferry from Eminonu along the Golden Horn but when we reached Eminonu the last ferry had already left and the next one was in 50 mins time so we decided to catch bus 99A and it was quicker. Even before you have entered the actual mosque there is an amazing sense of tranquillity. The mosque architecture is impressive considering it was the first imperial mosque built by Ottomans. The tomb of Hazrat Abu Eyup is on one side from the main mosque. We went inside just before zuhur (mid day prayers) and paid our respect and salam to the great companion."
        }, 
        {
            "index": 59, 
            "rating": "5", 
            "review": "The Tomb of Abu Ayub Ansari. Eyup Sultan Mosque is built to next to the tomb of one of the companions of Prophet Mohammed, Abu Ayub Ansasi and who was a member of the first army sent by Amir Moayia under the leadership of Yarid to conquer Istanbul. Although this expedition was not successful, on his death, he was buried here as per his will. The site is worth a visit."
        }, 
        {
            "index": 60, 
            "rating": "5", 
            "review": "Beautiful mosque with excellent recitation. This mosque was by far my favourite in istanbul because it was busy with peaceful locals. The recitation during Maghrib prayer was so soothing that honestly gave me goosebumps Unfortunately it was a little far from the grand bazaar but it was well worth the travel. I wish I could visit this place again one day God willing"
        }, 
        {
            "index": 61, 
            "rating": "4", 
            "review": "Place for muslim relegious people. Place and view is good. Since Eyup is muslim hero so this place is much better for them.\nYou can go to uphill by cable car and have coffee.\nThere is cheap market to buy regular stuff as well"
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "Respect for the Companion of Prophet (saw). This is the first place we visited in Istanbul. Gave me feels of Madina (Saudi Arabia) thinking about the Abu Ayub Al Ansari.\nMashaAllah very beautiful Masjid from inside and outside.The Ladies section was so calm and peaceful."
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "The tomb of Abu Ayub Al-Ansari. We visited this mosque for the sole reason of praying for the renowned disciple Abu Ayub Ansari. For getting here take bus no. 99/99A from Eminou towards Eyup Sultan, after ca. 15 minutes you'll arrive at your bus station. From here you can ask anyone about this mosque or use TripAdvisor map."
        }, 
        {
            "index": 64, 
            "rating": "5", 
            "review": "this beautiful site revisited . After our visit to pier loti we walked to the eyup sultan jamii. It is as grand as always. The squares and shops around it are lively and full of people.\nThere is a small shop thete specialised in maming hot sahlep drink, worth trying."
        }, 
        {
            "index": 65, 
            "rating": "5", 
            "review": "The tiles of mausoleum. The tiles of the wall of mausoleum is so beautiful and I was really glad to come here. There are many people visiting here, and there are many shops and cafe around the mosque. I just intended to drop by the mosque, but I looked around the shopping areas and had lunch at the cafe, so it was a half day trip from Sutalnahmet! Anyway, I cannot forget the beautiful spring day of Eyup."
        }, 
        {
            "index": 66, 
            "rating": "4", 
            "review": "Beautiful area, lovely place. The whole area with its mosque, square, graveyard, and the hill has a cozy relaxing feeling. This is the place where one of Prophet Muhammad's companions is buried. He accompanied the Muslim army in its quest to open Constantinople despite his old age(90's). He had asked to be buried at the place of his death, and was so.Highly recommended.9/10"
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "Amazing Place. This is a very holy and special place for Muslim people. Eyup is the name of the Sultan which accommodated the prophet Mohammed in his own house.It's a great area with a beautiful mosque and much to see. The area has great restaurants and shops located around the mosque. "
        }, 
        {
            "index": 68, 
            "rating": "5", 
            "review": "Family Trip. Must visit for all Muslims, tomb of Hazrat Abu Ayub Insari RA, very calm place compare to hassle and bustle of Istanbul main city, Non Muslim visitors should avoid prayer time, best time to visit is in morning upto 1pm, Very clean area massive bazaar as well, Good Shops to buy Islamic Books, Holy Quran, and souvenirs ... Bus ride is Long (40-50mins) from Sultanahmet area use tram T1 to Eminonu and use Ferry service (Goes every 30 min) you can use your Metro Card (will cost you 2.6 lira with card or 4 lira without) take ferry going from halic up to Eyup ... also another interesting thing around area is a cable car going up the hill, good views"
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "The whole place has a special atmosphere. It's a very interesting part of Istambul, with the cemetary with interesting tombstones (it's fenced around) andt the Camii is interesting, the square with fountains and palms, and nearby old wooden houses and the Pierre Loti Cable Car. We loved the place."
        }, 
        {
            "index": 70, 
            "rating": "5", 
            "review": "Spiritual and Different. It's a beautiful mosque, but the real sight to see is the shine and Mohamed's footprint. To see these, you must join a queue starting on the outside part of the mosque. Remember to take off your shoes! People were dead silent inside - some of the greatest respect I've ever seen at a religious site. This place gets very crowded on the weekends, particularly on Fridays, so a weekday would be a better time to visit. The location is not easy to get to. There is no easy metro or tram access, though if you don't mind walking about 30-40min, the metro can get you there. You can also walk along the river from Eminonu, but this will take at least an hour."
        }, 
        {
            "index": 71, 
            "rating": "5", 
            "review": "A Spiritual Visit and Great Area (Eyup). We paid our respects at the shrine of Abu Ayyub Al-Ansari who was a companion of our beloved prophet Muhammed (Peace Be Upon him).The mosque is very similar to the rest of the mosques in Istanbul in sense of the arcitecture etc; however the ambience is very heartly due to the blessed shrine on the grounds and the purpose of others visits.Despite Eyup being about 10 minutes out of the toursit filled Sultanahmet area it seemed as though we had entered another city as we got a true feel of the Turkish culture in this area.The people had been much more down to earth and even the shop keepers let you browse without the hassle.The prices of souvenirs, food etc are a fraction of what you pay in the Sultanahmet area and the prices quoted seem the initial genuine price as it would be for the locals.Whether you have a religious intent or not I would recommend a visit to Eyup Sultan Mosque and even the area around it to compare the difference between the rif raf of Sultanahmet."
        }, 
        {
            "index": 72, 
            "rating": "4", 
            "review": "Visit under the rain. Holly place due to one of profit Mohammad followers live and died there.The place is historic and tradition. We visited it during a beautiful rainy day"
        }, 
        {
            "index": 73, 
            "rating": "4", 
            "review": "A place to visit for Muslim. A lot of Muslim come to visit The tomb of Prophet Muhammad's friend,Abu Ayyub Al-Ansari.I took bus 99A from Eminonu to this mosque.The mosque is very beautiful. you could also take a cable car nearby to Pierre Lotti Hill by using IstanbulKart or by walking.You could also do some shopping around the mosque and the price is very reasonable."
        }, 
        {
            "index": 74, 
            "rating": "5", 
            "review": "during the trip to perlotti resto. the spectacular detailed architecture of this mosque makes is unique. i had a visit to this place during a rainy day targetting perlotti cafe. unfortunately the cable cars were stopped due to weather conditions. there is a good market nearby the mosque where your can shop and enjoy the traditional turkish cuisine as well."
        }, 
        {
            "index": 75, 
            "rating": "5", 
            "review": "visit turkey. very beautiful place to see,we came from America, market shopping is good. but be careful for price ,need to negotiate, 100 liras ask for 50 or 60,no fix price"
        }, 
        {
            "index": 76, 
            "rating": "5", 
            "review": "Most Sacred place in Istanbul. Shrine of the companion of last Prophet (P.B.U.H) is indeed the best place to visit, you can reach there by a 35 minutes Ferry ride of golden horn from Eminonu, or the bus from Eminonu."
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "A must-see and peaceful place to visit. A very beautiful mosque and the surrounding area ws very peacefull. This is also the place where the tomb of Hazrat Ayub Ansara (the Companion of the Prophet Muhammad PBUH) is loacted.We took a ferry from Eminonu to Eyub - you get off the fifth stop and as you get out of the Eyup ferry terminal just cross the road and you will see everyone walking towards the mosque.It was not that busy when we visted in December 2015 and you can spend as much time as you wish.Outside, the Eyup area is also very peaceful and you can buy things that are cheaper than other places.A really great place to visit."
        }, 
        {
            "index": 78, 
            "rating": "5", 
            "review": "Holiest Place. It looks like another mosque, but this is a special one. Very few tourists were there when I went - it was mostly locals. There are tombs in the area that you can visit as well, but check the hours/days of opening beforehand. There's a stand in front of the mosque selling sahlep which was yummy."
        }, 
        {
            "index": 79, 
            "rating": "5", 
            "review": "Very close to Pierre Loti. if you are going to visit Pierre Loti hill you may visit this historical very important mosque too..in the garden of this mosque there is a very big tree. if you like architecture you would like to visit there."
        }, 
        {
            "index": 80, 
            "rating": "3", 
            "review": "Average Place. Not a place to go \"Specially\". It is a mosque adjacent to tomb of Hazrat Abu Ayub Ansari, Companion of Holy Prophet Mohammad (PBUH). This i guess is only unique selling preposition of this mosque. Otherwise you may find many such mosques in Istanbul. However if you are visiting Piere Lottie, then it is just near to Chairlift point and one should visit it. There is a small market adjacent to it where you may find Turkish souvenirs."
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "sanctuary of istanbul. A Muslim tourist would find this mosque a must, a close companion of the Rasulullah was buried here. The man whose house was where he Prophet's camel stop at during his hijrah from Mecca to Madinah. His tomb is located behind the mosque.We took a boat from The Golden Horn ( 2liras one way) for a short ride across. Just follow the crowd.Shops ( food and other stuff) along the way. Many old tombs on the sides. Pigeons to feed. It can be crowded on weekends esp the morning prayers,so best go during weekday, during the regular prayer time to join the congregation. A bit of history revision may be beneficial.The historic mosque is beautiful and very peaceful.It was very quiet inside when we went there, despite the crowd at the tomb. A good place to rest and contemplate after one's journey.( Abu Ayub came to Turkey in those days already an old man) Ladies can go upstairs for solat/namaz. This mosque was specifically recommended by our host's boss, he was absolutely right."
        }, 
        {
            "index": 82, 
            "rating": "5", 
            "review": "So much peace and tranquility!. Come here early in the morning and have a breakfast at the top (pierre loti cafe), accessible by cable car and taxi.What a nice thing to do to start your day perfectly."
        }, 
        {
            "index": 83, 
            "rating": "5", 
            "review": "incredibly old. for a religion tourism, this mosque is one of the basic part of the tour. The story of it is very impressive and mosque is very old. It is very crowded especially at some important time of religion. must visit."
        }, 
        {
            "index": 84, 
            "rating": "5", 
            "review": "Mid Week Break. The Eyup area is full of history and historic buildings well worth hoping off the Big Red Bus here for a good look around you will be amazed at the sights."
        }, 
        {
            "index": 85, 
            "rating": "3", 
            "review": "Much cheaper than Taksim. Hey people, the bazaar beside the mosque is wonderful. you can find anything with prices cheaper than Taksim - even you can find the same products there. For shopping it is a must go."
        }, 
        {
            "index": 86, 
            "rating": "5", 
            "review": "EYUP EXCELLENT. Worth making the trek to see this particular attraction. ITs away from the touristy bits and is much more austere. The buildings and graveyards around it are fascinating. Take a bus from Eminonu."
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "Must visit this place. This is the tomb of one of Prophet Muhammad (may peace and blessings be upon him) companions Ayub Ansari RA.From Blue Mosque we paid 40 Lire to the Mosque/Tomb. Its quite an experience , try to go at night time or after sunset and enjoy the food there. There are atleast 6 open air restaurants with very nice turkish food."
        }, 
        {
            "index": 88, 
            "rating": "5", 
            "review": "A special, reverential holy site. Eyup Sultan Mosque is one of the four or five most holy sites in Islam depending on which source you research. It is a powerful and moving experience with Muslim pilgrims from all over the world in attendance and at prayer. Don't miss it if you can as it is a breathtaking experience."
        }, 
        {
            "index": 89, 
            "rating": "5", 
            "review": "Historic, istanbul. Quite the most spiritual, beautiful mosque that I have had the pleasure of visiting.lots of Moslems praying, very few tourists (I suppose it was out of season). My friend and I were so impressed that we visited it again a couple of days later. As is the Islam religion to give, we had many sweet meats and sugar lumps given to us - I went up to the women's praying section and again I was given a sweet - I'm sure it gave my diabetes no good at all!! It is just impolite to refuse.This complex also has a soup kitchen."
        }, 
        {
            "index": 90, 
            "rating": "3", 
            "review": "Nothing much to see, other than tombs. Did not enjoy the visit, only tombs of dead people. But the area has many restaurants and shops to buy souvenirs."
        }, 
        {
            "index": 91, 
            "rating": "5", 
            "review": "THE TOMB OF A GREAT SAHABI. The place is located at a considerable distance from Golden Horn, but I had ample time to walk over to the Great Man's tomb. It took me about and hour plus to reach the site. The tomb has its reverence, a great site links you back to the Muslim History. The man ABU AYUB ANSARI, whose house became the mainstay of our beloved Prophet Sallallao Alaiyeh e wassalam. The air is purely shrouded with respect. The will of the Sahabi be done as per his wish, and linked to this place today sleep in their deep eternal slumber are the graves of many which cover the mountain top which can be approached by foot or cable cars. May he stay among the blessed"
        }, 
        {
            "index": 92, 
            "rating": "5", 
            "review": "Must visit for those interested in Islamic religious tours!. Beautiful mosque which also resides the tomb of one of the dearest sahaba companion of the Holy Prophet (SAW) - so you will many pilgrims visiting his tomb which is greatly venerated.There are shops nearby with good choice of tourist items (usually cheaper than the SultanAhmet area)."
        }, 
        {
            "index": 93, 
            "rating": "5", 
            "review": "Must Visit . It is a great place. One of the shabah( companion of the Holy Prophet(PBUH) is buried there. A must visit. Apart from that the shops around the area are about 40% less costly than the Sultanhemet area."
        }, 
        {
            "index": 94, 
            "rating": "5", 
            "review": "Favourite Mosque in Istanbul. Personally, this is my favourite mosque in Istanbul. It is sooo beautiful and peaceful. The whole Eyub Sultan area is a peaceful retreat from hectic Sultanahmet area. So bright and vibrant, full of local people. The tomb of the Prophet Pbuh's companion, Abu Ayub al Ansari is so special, tranquil and a memory I'll hold close to my heart forever. There is also an alcove in the wall of the tomb containing items belonging to Prophet Muhammed Pbuh. Very special. A must see when in Istanbul!"
        }, 
        {
            "index": 95, 
            "rating": "4", 
            "review": "Great Mosque. Is a visit to this mosque a must? No, not really, BUT, I personally enjoyed it, as there were no tourist, which gave me the opportunity to sit and enjoy this masterpiece.@instabuilt"
        }, 
        {
            "index": 96, 
            "rating": "4", 
            "review": "Eyup Sultan Area. This is so nice and beautiful place which you will enjoy the coffee shops and the restaurants around you. Get the telefric to the top of Eyup place to enjoy the turkish coffee as well as to get a nice view of istanbul from the top. also Eyup mosque is a beautiful deserve to visit it and the fountain at the front of the mosque its so nice i prefer to go in the morning."
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "Great Spiritual Place. The Eyup Sultan place was very special to me. It is very lovely and beautiful. It has the flavor of Old Istanbul. As for the mosque, the atmosphere is very peaceful. There is something so attractive about this place. I highly recommend a visit. You are going to fall in love with it. I did :)"
        }, 
        {
            "index": 98, 
            "rating": "5", 
            "review": "Amazing spiritual place with a quaint flavour of old Istanbul. This is a revered Muslim site of spiritual significance. The Mosque is lined by market stalls, tea gardens, home-style restaurants, bakeries, sweet shops and nurseries. I highly recommend a visit."
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "Great. Excellent bus ride from Sultan Ahmed area .About 15 min .Lovely fountains in adjoining area.The mosque was great and the tomb of one of the companions of the Holy Prophet (pbuh) was peaceful and atmosphere was tranquil.A must visit for every devout a Muslim."
        }, 
        {
            "index": 100, 
            "rating": "5", 
            "review": "Cemetery and Pierre Loti. I love to take a walk in Eyup cemetery. Both the views of Istanbul it affords and the cemetery itself are very special to me. As is the boat ride to Eyup, all the way up the Golden Horn. A well spent couple of hours. Eyup Sultan Mosque was erected over Prophet Mohammad's companion resting place."
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "Nice place. , Amazing historic place to visit , reflect the real Turkish life style I liked the Bazar nearby, I liked the simple restaurants also there"
        }, 
        {
            "index": 102, 
            "rating": "5", 
            "review": "The Heart of Locals. If tou want to see the real Turkish locals pay a visit to Eyüp Sultan camii, I would highly recommend taking a ferry from Eminönö through the golden horn kiosk, you would love the experience, the mosque in about 2 minutes walk for the port, have a round at this religious neighbourhood then enter the camii, its so peaceful and nice i went with my friend we both enjoyed it so much."
        }, 
        {
            "index": 103, 
            "rating": "5", 
            "review": "One of the oldest mosques. A great mosque where it is said that lies the tomb of Eyup, a friend of the Prophet who fell in battle outside the walls of Constantinople. Moreover, the mosque was the place where used to take place the coronation ceremony for the Ottoman princes. A place of great significance for the Muslims."
        }, 
        {
            "index": 104, 
            "rating": "3", 
            "review": "Great place for Friday prayers. Great atmosphere for prayers, and to view the tomb of Eyup Ansari, supposedly one of the companions of Prophet Mohammed, PBUH."
        }, 
        {
            "index": 105, 
            "rating": "4", 
            "review": "spiritual place for Muslims. spiritual place for Muslims , I loved the place enjoyed the Mosque environment and the Holy Quran reading at the time after prayers ."
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "Traditional and authentic. One of the traditional mosque with authentic ambiance. Rustic yet comfortable. Sharing boundary with the bazaar."
        }, 
        {
            "index": 107, 
            "rating": "4", 
            "review": "Watch Istanbul from above. SO beautiful district so holy mosque and grave of Eyub the friend of prophet Mohamad. Cheap shopping around.Then you walk to the amazing Pierre lotti Cafe."
        }, 
        {
            "index": 108, 
            "rating": "4", 
            "review": "Old historical building. Amazing.. We went there in April 2014. No words can describe how beautiful and authentic this old mosque"
        }, 
        {
            "index": 109, 
            "rating": "5", 
            "review": "Wonderfull and very special. One os the most sacred sites of Istanbul. it has wonderful tile clawing and very accessible by public transportation and ferries. It is also a stepson to the Pierre Loti Hill and Coffee shop via Telefric."
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "The Standard-bearer and Friend of Islamic Prophet Muhammad Buried Here.. The Eyup Sultan Mosque is located just outside the city walls of Istanbul, near the Golden Horn. Eyüp (Job) al-Ansari, the standard-bearer and friend of the Islamic prophet Muhammad, is said to have been buried here. Eyüp Sultan's tomb is greatly venerated by Muslims, attracting many pilgrims from all over the world every year. The tomb is well worth a visit while you are visiting the mosque. It has some very beautiful cool tiles on the wall too so don't miss it. Here's how to find the tomb: The mausoleum is on the north side of a courtyard opposite the main entrance to the prayer hall of the mosque."
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "Aashiq-eRasool(saw). Been wishing to ziyaarat this place after watching Islamic documentry on TV. Subhanallah,\nI wish to pay my visit again & again"
        }, 
        {
            "index": 112, 
            "rating": "5", 
            "review": "Go on a Friday. Best time to go is Friday when the whole Muslim world of Istanbul congregate. As a foreigner go earlier on your way back from the Pierre Loti cafe. There are lots of interesting trinket shops and bonets (headdress) to buy even for non Muslims. A bit like Tinos or Lourdes for religious 'souvenirs' priced for 'the people' not for the tourists! Separate entrances for men and women. Highly recommended. Quite an experience. Take your camera."
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "A very spiritual experience. We visited tomb of Ayub Al Ansari. He was standard bearer to Prophet Muhammad pbuh. When the Prophet and his companions were expelled from Mecca and went to Madina many locals invited him to stay with them. So not to offend anyone the Prophet said that he would stay at the house where is camel would stop. The camel stopped at the house of Ayub Al Ansari. He showed great hospitality and insisted that who ever came to visit the prophet could not leave without taking food and drink. He was a brave warrior and was the first to volunteer when he was needed. On the campaign to defeat the Byzantine Empire by this time he was an old man He fell ill, It was his dying wish that he be buried under the walls of Constantinople. So this is very holy site for Muslims. The area is now known as Eyup Sultan. There is a lovely mosque and nice restaurants and some good souvenir shops also they are cheaper than the touristy parts."
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "Amazing area. Loved the place and the area around it. the market is much cheaper that other areas in istanbul, like Sultanahmet and others.. and the ride to Pierre Lotti and the time spent there was well wroth the trip :)"
        }, 
        {
            "index": 115, 
            "rating": "4", 
            "review": "Stunning History, but sometimes very crowded. This Camii (or Mosque) is sometimes referred to as the fourth most holy site for Muslims and it is an amazing cultural experience as well.Located outside of the history city walls, this location is the site of the remains of Eyup who was a flag bearer for the Prophet Mohammed. Because of this history, it draws many people throughout the Islamic world to come and visit. There is a beautiful plaza with lots of outdoor treats like Majun (lolipops, but the experience is cool), Popcorn and Cotton Candy. There will often be events hosted in the beautiful little neighborhood that is set apart from the rest of Istanbul, and if you are a history buff, there are plenty of sites around this location that you can see.If you are around here during Ramadan, Eyup boasts one of the greatest places to hold Iftar, a large grassy square off of the main road where hundreds of families gather to break their fast. Pull up a blanket and prepare some food (store bought or home made) and you are sure to make a lot of friends."
        }, 
        {
            "index": 116, 
            "rating": "5", 
            "review": "Eyup Sultan. The Mosque of Eyup Sultan is one of the holiest Islamic Shrines as Eyup was the standard bearer of the Holy Prophet Mohammed."
        }, 
        {
            "index": 117, 
            "rating": "5", 
            "review": "Wow!!! . Me and my husband visited eyup sultan mosque after going on the cable cars. This mosque is beautiful the architecture is just amazing and if ur a cat lover its like kitty galore round here loved it. Its such a peaceful place to be just relax and enjoy the moment. This mosque has 2 floors the woman pray upstairs and the men downstairs. The spiral stairs going up was just beautiful love the old kinda historic staircases just bricks. But i couldnt go back down them im guessing for safety reasons as it was very narrow and steep. Theres lots of shops out side the mosque me and my hubby even got yummy ice creams for 1 turkish lira cant go wrong. A great place to visit. They also have the graves of the sahabas their. I loved this place."
        }, 
        {
            "index": 118, 
            "rating": "5", 
            "review": "Worth a visit. So impressive to discover such a splendor. The mosque opens up to the mausoleum where the Prophet Mohamed companion Abi Ayub Al Ansari is buried"
        }, 
        {
            "index": 119, 
            "rating": "4", 
            "review": "If your in town for a few days,this is a must. After the main attractions of the town this is good trip. the fourth most holy mosque in the world it sits at the very end of the golden horn and is best reached by the excellent public water bus service (2tl per person) the mosque and burial grounds are the main attraction but there are lots of shops(serving mostly Turkish tourists) and a cable car up to a cafe with great views back down the golden horn to the city) (must be the cheapest cable car in the world at 2 tl (20p UK) ) A good tip is to use this trip to stop of a couple of stops before Eyup to visit the fantastic industrial museum you will see from the boat of the right side of the horn)"
        }, 
        {
            "index": 120, 
            "rating": "5", 
            "review": "beautiful view of the city istanbul and water. we got there by teleferik ( can be found in subway map). beautiful view of the city istanbul and water."
        }, 
        {
            "index": 121, 
            "rating": "3", 
            "review": "Good for peopleewatching & the scene, mosque not for tourists. Not a destination for non-Muslim tourists, but lots of local pilgrims. Good people watching. Well off the tourist path. Return to Old City via ferry for a fun 30 minute view of Istanbul from the water."
        }, 
        {
            "index": 122, 
            "rating": "4", 
            "review": "So crowded but worth to see.. Because of its importance in religion history, we wanted to visit it too. The only negative thing about this mosque, muslims who visited the place they were little bit lack of understanding and agressive. But the place was peaceful and it worth to go and see."
        }, 
        {
            "index": 123, 
            "rating": "5", 
            "review": "Most underrated site in Istanbul. Go on a Friday and plan your trip to have lunch on the second floor of one of the delicious Turkish restaurants surrounding the Mosque- they are all very cheap and excellent quality. Watching the prayers was one of the most special experiences that we had in Istanbul. You can spend the early morning at the Chora Church and then walk down to the Ferry and take a boat to this area. It was a special day."
        }, 
        {
            "index": 124, 
            "rating": "5", 
            "review": "Eyup Sultan. a must see place, the eyup sultan grave he was buried here and many of his students as well, there is shops restaurants and souvenirs for tourist all around the mosque, toilets is for extra charge"
        }, 
        {
            "index": 125, 
            "rating": "5", 
            "review": "One of the holiest sites in Istanbul. Easily accessed by bus from Eminonu bus station, this mosque is the last resting place of one of the Prophet's key lieutenants and also contains a stone that bears the imprint of one of the Prophet's feet as well as some very early calligraphy.The tomb of Eyup Ensari is the main focus of interest and although it is always crowded by pilgrims we were made very welcome there and through them we discovered the significance of the artefacts and the piece of marble. The silver railings that conceal the tomb were very beautiful but although we love Iznik tiles there were so many in this small crowded place that it was almost overwhelming.After the tomb the mosque itself is quite a contrast but also very beautiful in its own way as is the surrounding area"
        }, 
        {
            "index": 126, 
            "rating": "3", 
            "review": "Amazing vies. We took a taxi from the church of ChoraWe could not find the graves of the Sultans but views are amazing We took the cable car down"
        }, 
        {
            "index": 127, 
            "rating": "5", 
            "review": "A holy place. This is a place where the great companion of the Prophet is buried. Place full of spirituality and faith. Here you may see many locals visit the place to receive blessings."
        }, 
        {
            "index": 128, 
            "rating": "5", 
            "review": "Most holy mosque in Istanbul. Eyup is a historical district in Istanbul. The mosque is maybe not grand as Blue mosque, Suleymaniye or Saint Sophia neverthless it is considered the most holy mosque among Muslims. After visiting the mosque, you can take the telecabin and have a break at Pierre Loti."
        }, 
        {
            "index": 129, 
            "rating": "5", 
            "review": "Serene. Amazing architecture and wonderful details. Organized, clean and calm. Lively area with many shops and food places around the mosque itself and easily reached by bus."
        }, 
        {
            "index": 130, 
            "rating": "5", 
            "review": "View the complex as a whole - not just the mosque.. This mosque, and particularly the surrounding complex is certainly worth a visit, and seemed to be visited mostly by what looked like pilgrims - not many westerners seemed to make the very worthwhile effort. The complex is also very convenient if you want to go up Pierre Loti hill on the cable car - very close by. And Eyup jetty is there for a pleasant boat trip back to the main areas of the old city."
        }, 
        {
            "index": 131, 
            "rating": "5", 
            "review": "Place of Islamic importance. Apparently the first mosque in Istanbul by no other than Ayub Ansari ra. It is an untouched gem, which is well used by locals and is surrounded by other sites to warrant a day visit I.e. local market stalls, Pierre Lotti Cafe, a funfair by the water, telegraphic cars and of course the tomb of Ayub Ansari. Tombs of other sahabas are also nearby. We wanted to go on a Islamic tour with Harun from Meriva Travel, but didn't have time unfortunately. Maybe next time!"
        }, 
        {
            "index": 132, 
            "rating": "5", 
            "review": "a very holy place of peace. a place of worship for the people that understand the true significance of the religion of Islam and to visit the grave of one of the Prophet Muhamed closest friends."
        }, 
        {
            "index": 133, 
            "rating": "5", 
            "review": "Spiritual place. Beautiful mosque. Good for food. I had dinner there and it was hard for me to choose as there are so many restaurant there. Foods seems to me the same but the restaurant I chose was an open air restaurant close the main fountain was a bit pricey. But otherwise really beautiful location. Do not forget to pay tribute to Abu-Ayub Ansari (RA) shrine."
        }, 
        {
            "index": 134, 
            "rating": "5", 
            "review": "Interesting and plenty of locals around. Nice mosque and very interesting area, especially if you want to see more local or Turkish people and less tourists. It is highly recommended to go to the Eyup cementery and then go down by foot. Go back to Sultanhammet or Galata by ferry,you'll enjoy it!"
        }, 
        {
            "index": 135, 
            "rating": "5", 
            "review": "A must for those who are interested.. Not necessarily one on the tourist trial but important to those trying to get under the surface of the Ottoman history. For those of the religious persuasion a chance to visit the grave and final resting place of a companion of the Prophet Muhammad, saws."
        }, 
        {
            "index": 136, 
            "rating": "5", 
            "review": "Wonderful Islamic History. For Muslims, a spiritual place where they can pay their respect to one of Prophet Mohammad's SAW companions, whose tomb lies here. A short ferry hop from the main tourist area, then cross the road and it is a two minute walk. You can also buy some wonderful potato fritters on a stick outside the entrance. How they make those is impressive."
        }, 
        {
            "index": 137, 
            "rating": "4", 
            "review": "An authentic sacred place for the Muslims. The mosque and the sorrounding complex is very crowded by pilgrims, and you feel like in a living sacred place, not a tourist attraction. So as a tourist you are not encouraged to go around. The place is a bit dirty and suffocating, still it is fashinating and \"real\"."
        }, 
        {
            "index": 138, 
            "rating": "5", 
            "review": "A place must be visited. Went there with my family, initially we had no idea that one of the close companions of prophet Muhammad (P.B.U.H) was buried here, before the day of arrival we read up the details which filled our hearts with joy. we we reached the tomb, the atmosphere was so exhilarating and took us back in time. I realised that there were many other companions of prophet Muhammad (P.B.U.H) also buried there who came to conquer Istanbul during the first campaign. the square round the place is buzzing with activity and one can find many shops to taste local savouries and delights. must not miss the fresh orange juice from the corner cart, feeding the pegions and having the turkish tea."
        }, 
        {
            "index": 139, 
            "rating": "5", 
            "review": "Peaceful & touching . My mum had been to Istanbul 6 months before I went, so she told us to not miss the opportunity to visit this beautiful Mosque.We took a taxi from our hotel in Sultanahmet. The taxi cost us only 20liras, which was good because the cabby was to meet us after sometime to take us to our next destination.It was a very spiritual day with a lot to take in.It is a very peaceful place and a must see while in Istanbul."
        }, 
        {
            "index": 140, 
            "rating": "5", 
            "review": "Charming mosque. A bautiful octagonal structure, situated further away in Eyup, with interesting tile work in the interior."
        }, 
        {
            "index": 141, 
            "rating": "4", 
            "review": "Ancient Mosque and mausoleum. Another historical mosque of many in turkey. This mosque is also a very spiritual place for alot of people as well as locals. Situated are here are graves of important islamic figure most of them is hazrat Ayub, One of the companions of Prophet Muhammad (peace be upon him)"
        }, 
        {
            "index": 142, 
            "rating": "5", 
            "review": "Superb. I like it to the max very peaceful and relaxing place\nWe took the bus from eminunu station bus A99\nthere's many restaurants nearby and some traditional shops.\nAt least there's no queue we can enter directly"
        }, 
        {
            "index": 143, 
            "rating": "5", 
            "review": "The most important mosque in Istanbul for Muslims. There is very little mentioned about this mosque in the West because the mosque is not as grand as other mosques in the city but this mosque is a gem. Its atmosphere is amazing because it contains the grave of the Companion of Prophet Muhammad (SAW) - Ayub Ansari RA in the complex and hence its the most important and busiest mosque in Istanbul for Muslims. Make sure you come here for Friday prayers if you are muslim as the atmosphere is amazing. The outside of the mosque gets laid out with mats because there is not enough space within the mosque to accommodate everybody."
        }, 
        {
            "index": 144, 
            "rating": "5", 
            "review": "Beautiful Eyub Sultan Cami. Beautiful mosque,rich in history. The main attraction was the Mausoleum of Abu Ayyub Al-Ansari, he was a companion of Prophet Muhammad who passed away In Istanbul.Great place to visit for those who appreciate history and architecture "
        }, 
        {
            "index": 145, 
            "rating": "4", 
            "review": "EYUP SULTAN MOSQUE. A wow at every sight, very good architecture a delight of history from the ottoman empire days. this place is a must to visit whilst travelling around istanbul. cant wait to visit again."
        }, 
        {
            "index": 146, 
            "rating": "4", 
            "review": "Eyup Sultan Mosque. you will surprise if you know that Eyup Sultan was not real Sultan just a very respective man from Islamic history"
        }, 
        {
            "index": 147, 
            "rating": "4", 
            "review": "Definitely worth a visit.. Eyup itself is brilliant. We took a boat from Istanbul for 3L and found the area to be really interesting (and much cheaper than Istanbul) The Mosque is great to look at architecturally although we couldn't find much information around us and were glad of hang done our research beforehand to really get the most out of it."
        }, 
        {
            "index": 148, 
            "rating": "5", 
            "review": "Muslims spiritual . This is the place of one of great prohfet mohammad (PBUH ) Abu ayub Ansari tomb it's sacred place to Muslims and especially the turkish the mosque and tomb located walking distance from pierrerloti cafe in the golden horn easily reached by bus, ferry from eminonu you need half day visit to start at euyp have spiritual feeling and wonder in one of most classical ottoman design and learn more about Muslim you finish your visit by having a turkish cafe at pierrerloti and enjoying the stunning view of the golden horn. Must visit Mahmoud Yamani"
        }, 
        {
            "index": 149, 
            "rating": "5", 
            "review": "Breathtaking. Amazing area with amazing architecture from Ottoman Empire times of İstanbul. Never say I'm done in this city. In each district, you will see some amazing stuff for sure."
        }, 
        {
            "index": 150, 
            "rating": "5", 
            "review": "An inspirational shrine. Mosque adjoins tomb (shrine) of the Companion of Prophet Muhammad (pbuh) Hazrat Abu Ayub Ansari (ra). An inspirational place for Muslims with a great sense of calmness and serene. Take a bus No. 99A from Eminanu to Ayup Sultan and you will be there in 20 minutes."
        }, 
        {
            "index": 151, 
            "rating": "5", 
            "review": "nice to see the local daily life. The place is very sacred to the locals, and usually you don't see tourist around. The mosque is nice and it has the grave of Ayub AlAnsari. If you would like to live like a local in Istanbul I strongly recommend you visit the area, where you will have chance also to taste from the local bakeries and buy local grocery and the best place to take the cable car to Pierri Lotte which is high peak overlooking the Golden Horn, one of the best view in Istanbul and have a cup of Turkish tea or coffee there."
        }, 
        {
            "index": 152, 
            "rating": "4", 
            "review": "A peaceful atmosphere and beautiful mosque. The Eyup Sultan Mosque is a very sacred place to Muslims, so dress respectfully and try not to act too touristy. It's a beautiful mosque, and you feel the reverent atmosphere more so than other mosques in Istanbul. The square outside is paved with marble. It is also conveniently near the cable cars that take you up to Pierre Loti."
        }, 
        {
            "index": 153, 
            "rating": "5", 
            "review": "AMAZING SPIRITUAL PLACE TO VISIT. Definitely a highlight and a MUST visit for MUSLIM families and visitors. Simply beautiful and very welcoming to all - a must visit. Great architectural features and amazing to witness prayers there. Very lively local area with many shops and restaurants also. MUST visit A.Y.S. TATLICILIK about a 10 minute walk , small dessert shop - the MOST AMAZING turksih dessert called TIRLECE in Turkish (three milk dessert)."
        }, 
        {
            "index": 154, 
            "rating": "4", 
            "review": "Holy Site. A very holy site for Muslims who go there to pay homage to Ayub Ansari who lies buried there. Ayub was a companion of the Holy Prophet. A public bus or ferry from Eminino will transport you to this site. After walking through the bazaar area you come to a beautiful fountain from where you enter the holy complex. There is a mosque but most visitors focus and the tomb of Ayub which is situated in the courtyard adjacent to the mosque. It has a serene atphosphere and is usually crowded with pilgrims. You are not allowed inside the Dargah but restricted to the lattice and glass window from where you can deliver your prayers or as some believe that it is the place where wishes and prayers made will come true. When leaving you may see young boys dressed as little sultans, some even mounted on horses. These youngsters are initiates by virtue of circumcision. For those interested the place is surrounded by several other tombs of holy personages."
        }, 
        {
            "index": 155, 
            "rating": "4", 
            "review": "Nice Neighboorhood with Golden Horn View. Eyup area is really crowded during weekend, however every weekend there are various exhibition in the Halic that you can simply go for free. Then, take an additional visit to Pierre Loti using cable car (Teleferik) to view the fascinating Golden Horn Area"
        }, 
        {
            "index": 156, 
            "rating": "5", 
            "review": "Must visit. The resting place of the companion ayub ansari. If you are in Istanbul visiting Eyup is a must. If you have time take a ship to eyup from eminuni"
        }, 
        {
            "index": 157, 
            "rating": "5", 
            "review": "respect. this is not an avg tourist place. its a very sacred place. i was a little turned off because ppl were treating it like a amusement park of sorts.please when you visit such places turn off the tourist mode and have the respect mode on. say you salam, pray and leave quietly. you will have plenty of other picturesque places for selfies!"
        }, 
        {
            "index": 158, 
            "rating": "5", 
            "review": "A must visit for its history. We visit the grave of Eyup Al-ansar a sahabat of Rasulullah s.a.w and its a great opportunity that we glad to take as it has an extensive Islamic history. It is an emotional visit for us."
        }, 
        {
            "index": 159, 
            "rating": "5", 
            "review": "its one of the best for muslims but also for tourists. on our way to the famous hill and cafe ...https://en.wikipedia.org/wiki/Seven_hills_of_Istanbulwe passed by the mosque and went inside..it was the praying moment and the tourists cant enter inside.but we had a look in surrounding area and mosque."
        }, 
        {
            "index": 160, 
            "rating": "5", 
            "review": "Amazing place. You have to go here just to see the Shrine of Abu Ayyub Al Ansari. It was totally amazing when we went. We went on Eid and there were 1000s of Turks there and in the bazaars surrounding it. If you are in Istanbul, you have to visit this place, even if you are non muslim.The mosque was full of sufis at prayer time, and even though there were so many people, it was a very spiritual visit. You may see children all dressed in white which is their way of celebrating they have been circumcised.The fastest way to get there is to take the 99a bus from Eminonu. If you are not sure just asked the driver 'Sultan Eyup?' and you should get a response.If you are you, you have to go up to Pierre Loti which is on the other side of the complex. There is a 5 minutes cable care (telefrik) that gets you there....and it is high up. The views are amazing.Buy the IstanbulKart which will cover all your public transportation expenses and then some. One card can be used for many people. Just top it up and go.....its very cheap....taxis can be expensive.Enjoy!!"
        }, 
        {
            "index": 161, 
            "rating": "5", 
            "review": "A lot of history. This place has islamic history, go on a sunday and you will see young boys dressed up. nice restaurants around the mosque to eat."
        }, 
        {
            "index": 162, 
            "rating": "4", 
            "review": "Peaceful and Spiritual Visit. The Eyüp Sultan Mosque (masjid) is in the Eyüp district in Istanbul, I went easily by Bus 55T from Taxim Square.It was the first Mosque constructed by the Ottoman Turks in Istanbul in 1458 and was the traditional site for the coronation ceremony of the Ottoman Sultans, where the new sultan was girded with the sword of Osman. The mosque had been re-built after destroyed by an earthquake. The mosque includes a mausoleum where Eyüp al-Ansari, one of Sahabah (bearer and companion) of the Islamic prophet Muhammad (Peace be upon him), is said to be buried (it was under restoration, closed). A grave yard lie in the proximity of Ayyub al Ansar’s Tomb where it was also a very honorable situation to be buried there. You feel peace and safety once you enter the mosque. it's wonderful architecture appear in the pillars, mehrab and domes with amazing colors and light reflections. the mosque is surrounded by many bazaars selling Turkish products and restaurants ... You must visit it .... make it in the morning to avoid crowed."
        }, 
        {
            "index": 163, 
            "rating": "5", 
            "review": "Gem if istanbul. If you intend to go to Pierre Loti, you should stop at Eyup sultan mosque. Named after companion of prophet Muhammed,mosque is frequently visited by worshipers. For morning prayer it has thousands of people. It is surrounded with cemetary that include graves of greatest military leaders of Ottoman empire. You can walk up thru the cemeteries to rhe Pierre Lotti. It takes 10 minutes (once you are above mosque just keep left on the paths)"
        }, 
        {
            "index": 164, 
            "rating": "5", 
            "review": "Authentic place specially on sunday. Is one of the areas that we liked most. We arrive by ferry and the atmosphere was spectacular. Full of small children dressed as sultans with families. An area full of life away from the tourist crowds ."
        }, 
        {
            "index": 165, 
            "rating": "5", 
            "review": "Well worth a visit. We caught a ferry from Eminonu, just past the bus staion. The ferry took apporx 20mins during which time you coauld have tea/coffee etc served. The ferrry on it's own was a nice experience, the ticket seller at the pier came out of his office to dry the seats for us to wait for the boat, I couldn't see this happening at home. We walked from the ferry port at Eyup to the mosque browsing at various stalls selling prayer beads, towels and various different items. The mosque sits behind a beautiful fountain, it is one of the nicest mosques to visit and a lot less touristy than the Blue mosque. I would recommend bringing sunglasses as the the glare from the marble in front of the mosque is sore on the eyes.We spent the day in the area around the mosque eating, shopping and admiring the fruit trees in a local garden centre. All in all one of the best days in Istanbul"
        }, 
        {
            "index": 166, 
            "rating": "5", 
            "review": "A moving experience. From the perspective of being a muslim, this was a moving experience to visit the mosque and the mausoleum of this great companion of the Prophet Muhammed (PBUH).This place is located just within walking distance of the \"Telephonic\" (cable care the goes from the Eyup Sultan area up to Pierreluti). One can offer fatihah at the resting place. There was quran being recited in the background, which was moving.There are many place around this area where one can eat as well."
        }, 
        {
            "index": 167, 
            "rating": "5", 
            "review": "Eyup Sultan Parc during Ramadan. Me and my girlfriend got a tip to visit This Area in Istanbul during Ramadan.It was one of the best sights in Istanbul!!!We were instructed people start eating around 20.50 so we arrived at 19.00 at this area.There were thousands of people, families, Couples, Young and old...well a great variety of people.There are a lot of traditional restaurants, and in the parc area thera are many stablishment that offers fixed dinners.Most people bring food and drinks and spend hours on blankets in the grass. It was a great feeling of friendship and tranquility in the parc which was crowded for many hours.We left at eleven and were told people stayed until 03-0500 in th morning to eat more before sunrise.A really great experience!!!"
        }, 
        {
            "index": 168, 
            "rating": "4", 
            "review": "Conservative area, beautiful marble. We saw the Mosque as we walked the area. A very beautiful area and Mosque. This seems to be a more conservative area- more a tourist site for Muslims- did not see many Americans. We decided to not go inside- we were headed to the Loti cafe and also not sure we were dressed correctly."
        }, 
        {
            "index": 169, 
            "rating": "5", 
            "review": "Go on Sunday. It is a very especial place . Go before to the Pierre Loti Café and reach the Mosque through the cemetery.If you go on Sunday, you will see the boys wearing ceremony suits."
        }, 
        {
            "index": 170, 
            "rating": "5", 
            "review": "make it your first place to visit. This place holds the grave of Abu Eyup Al Ansari. The grave and the mosque are very beautiful and worth multiple visits. The area is surrounded by markets that offers cheaper prices than other places in Istanbul."
        }, 
        {
            "index": 171, 
            "rating": "5", 
            "review": "Spiritual Must visit for Muslims. A sure must visit site for Muslims. The tomb of Hazrat Ayub Ansari R.A. is placed here. You get a lot of mental peace and perspective."
        }, 
        {
            "index": 172, 
            "rating": "5", 
            "review": "My first mosque visited in Istanbul . This one struck me better than what a rustompasha did..or a blue mosque despite its beauty over this. Maybe coz.this was my first structure visited and created it's impact. Traveller here through the golden horn bosphorus cruise ride..what made it more enjoyable was the walk to iy..with several souvenir kiosks on one side. .a Pierre loti cablecar ride before it..the Graves in pretty trellises...a lovely shopping street with several things to discover and a square to rest by and watch the world go by..not to forget the bosphorus right opposite the street.Plus the blue tiles inside and views through its trellised laced walls was charming..got many beautiful photos. .Must stop and discover all of this. ."
        }, 
        {
            "index": 173, 
            "rating": "5", 
            "review": "Beautiful and spiritual. The visit to the Eyup Sultan Mosque was truly an amazing experience, it's a great place for the whole family (keep in mind that it is also a religious place so respect to the venue and the people there is of the utmost importance), it also houses the tomb of Eyüp al-Ansari (standard bearer and friend of Mohammed PBUH) so it's a there will be a lot of devotees. The place is also at foot of the Pierre Lotti Cemetry and garden where one can enjoy the spectacular view of the Golden Horn and Bosphorus while having a cup of cay and a curly fried potato. the place has an abundance of cafeterias and restaurants and is a 5 minutes walk away from an expo center which frequently hosts cultural and artistic fairs from all parts of Turkey. So visit the place, don't rush things (let yourself absorb the beauty and peace of the location) and you'll be in for a great day."
        }, 
        {
            "index": 174, 
            "rating": "3", 
            "review": "if you are interested with religious side of turkish people. the district is not close to the historic center..you have to go outside the roman walls.but if you would like to see lots of turkish or arabic or muslim people praying , showing respect to the dead people , this is really an authentic place..especially during the midday praying each friday.after visiting the mosque , pls do not forget to take the funicular to go uphill and get one of the best views of the town.and feel close to the house and spirit of Pierre Loti(Julien Viaud)..famous french writer who fell in love with the ottoman girl aziyade and stayed there/here..."
        }, 
        {
            "index": 175, 
            "rating": "5", 
            "review": "Unique beauty. LOCATION OF THE MOSQUEEyup Mosque is located in Eyup quarter of Istanbul. Orhan Pamuk, the famous writer, wrote about this quarter as a little and a perfect village located at the end of the Golden Horn, that does not look realistic, but it always seems as semblance. HOW TO GET TO THE MOSQUEIf you take taxi drive from the Sultan Ahmet square /the Old Town/ or Taksim to Eyup quarter, it will cost about 30-40 TUR LIR or 10-12 EUR. Make a deal with a driver in advance. THE MOSQUE ITSELFThe ground plan is a rectangle. The dome sits on a cylinder which rests on eight semi-domes. The domed hall is surrounded by tree-sided balcony. The biggest attraction of the mosque represents the tiles that decorated the inner and outer walls of the mosque. They are the most beautiful examples of Iznik ceramics (16th-19th century). As an art lover, I could not take my eyes off these so beautiful tiles and I took many great photos of them. Next to the mosque, there is a fabulous fountain, that is one more spot for photo-stop. Only rule is: cover your hair /for women/ and cover your shoulders and knees /for everybody/ when you go in the mosque. RECOMMENDATIONThe beautiful decoration of the mosque deserves your attention and admiration. After visit of the mosque, take a walk along Eyup quarter's cobblestone that recalls some past centuries. You will feel as if you are taken to some other centuries and captured in the charm of old times. You will find both artistic beauty of the Eyup mosque and old charm of Eyup quarter. Warm recommendation!"
        }, 
        {
            "index": 176, 
            "rating": "5", 
            "review": "Very historical. Wonderful place to visit. Very interesting place and lots of history. Great place to capture some really nice pictures."
        }, 
        {
            "index": 177, 
            "rating": "5", 
            "review": "impressive. All historic sights in Istanbul are well taken care of and accessible to easily to international visitors. Make sure you are modestly dressed and you are ready to go."
        }, 
        {
            "index": 178, 
            "rating": "5", 
            "review": "Sacred place. This is my first visit to the mosque and the area. The mosque (Camii) is renewed and has a tomb for Abu Ayoub AL-Ansari, friend of prophet Mohamed (PUH). A must visit place. The area is a touristic area with many restaurants and shops."
        }, 
        {
            "index": 179, 
            "rating": "3", 
            "review": "is where you can find a cable telefrik. is a beautiful place and it has got a historical background and it a place where so many tourist visit and also have a place where you can drink turkish coffee and cay"
        }, 
        {
            "index": 180, 
            "rating": "5", 
            "review": "Holy and heavenly. This mosque is the most holy in Istanbul and it is also most heavenly. Eyup is resplendent in white marble, with fountains to cool the soul, and the chance for restful reflection inside this simple mosque. You reach Eyup by a restful ferry trip up the Halic (the Golden Horn) with hourly departures from Eminou at 10 minutes before the hour or from Karakoy about 15 minutes earlier. (Be warned that the ferry for Eyup is hard to find).Or you can catch the 55T bus from Taksim Square."
        }, 
        {
            "index": 181, 
            "rating": "5", 
            "review": "Beautiful place. We did not go in the mosque but the marble square was beautiful. I recommend walking down to this area from Pierre Lotti. Yes, it is through a cemetery but it may be the most beautiful cemetery you'll ever see; The Golden Horn is the backdrop. Then just walk along the waterfront to the tram back to Sultanahmet."
        }, 
        {
            "index": 182, 
            "rating": "5", 
            "review": "Fantastisch!. Take the bus from Eminonu to get here. Its a lovely place with almost no tourists! Its very crowded on friday for the afternoon prayer. Make sure you bring scarfs or something else to cover your head, shoulders and legs because the locals will really come to you to ask yourself to cover up. People are really friendly and love the interest of tourists in their religion. Really a must see!!"
        }, 
        {
            "index": 183, 
            "rating": "5", 
            "review": "Worth going there. Far from touristic roads. For people who want to know more about Istanbul and Ottoman history. Very beautiful white marble square neare the moscque."
        }, 
        {
            "index": 184, 
            "rating": "5", 
            "review": "A very very Holly place for Moslems. I would like to reccomend it to everybody, because its a very holly pleace for moslems. On Fridays its full with people who like to pray at a holly place, other side new honeymoon couple are also coming to pray here.From This mosc you have the option visiting Piere Loti cafe on the top of Eyüp, dont missit."
        }, 
        {
            "index": 185, 
            "rating": "5", 
            "review": "Hazrat Ayoub Al Ansari (Companion of Nabi Paak pbuh an standard bearer). Hazrat Ayoub Al Ansari Masjid an Tomb. A must see. A beautiful an peaceful ziaraat.We took taxi from SultanAhmet for 30TL. The Tomb is located inside the Masjid complex. Morning time is less crowed. Take ur time here an pray Fatiha an make Dua. Remember to take tabarak for Dua an share amongst the pilgrims (we forgot). Pierre Loti cable cars are close by. Take the pathway behind the Masjid walking past stalls on left an graveyard an Tombs on right.Short taxi drive away is Miniaturk."
        }, 
        {
            "index": 186, 
            "rating": "5", 
            "review": "Eyup Sultan Mosque, Istanbul. This mosque is considered the 3rd holiest place of Islambecause is was built over the burial place of the Prophet Mohammed's friend and standard-bearer.This mosque is beautifully decorated and has nice courtyards with fountains . Worshippers are queuing before entering to show their respects. Around the mosque is a huge cemetery with very old and also recent graves;At the base of the mosque you can wander up a steep hill surrounded by this peacefull graveyard. On top of the hill you can take a break in the famous \"Pierre Loti\"-café."
        }, 
        {
            "index": 187, 
            "rating": "5", 
            "review": "Istanbul. Highly recommend to visit this mosque,conquerer of Istanbuls tomb is there,it is believed for Turks to go pray there before they get married,if yu want to be outside of the touristic zone and see Turkish culture more,then recommend you to visit this mosque"
        }, 
        {
            "index": 188, 
            "rating": "5", 
            "review": "A must stop place when youre in Istanbul. I went to this place the first time unplanned in 2011 as me and my parents have never heard of this place before, thanks to a local who informed us that there is a tomb of one of the Prophet's (pbuh) companion, we went there to pray at the mosque (which is peaceful and beautiful, no doubt! and there were cats sleeping at the praying area and they looked peaceful too) and also walk around the areas and bazaar surrounding the mosque. It is a peaceful place with good restaurants and food stalls as well as souvenirs shop. Its not touristic so it wasnt crowded. but the most important thing is to be mindful of the people doing religious activities there as it is a sacred place for muslims.Parking was not a problem as there are many open parking with affordable rates. there are buses too. not far from the walls of eyup sultan and cemetery is the cable car to pier loti, also a very nice place to have a cup of turkish coffee or tea and a good place to get a very nice view of the golden horn.I made sure that my friends visited here when we came for our study trip and they loved it as well. If i have the chance to visit Istanbul i will make sure to come here again."
        }, 
        {
            "index": 189, 
            "rating": "5", 
            "review": "Eyup Sultan Mosque is a quiet gem most tourists miss. The Ottoman Baroque style Eyup Sultan Mosque is a quiet pilgrimage site for many muslims and is not frequented by hoards of tourists. Opposite the lovely marble mosque, you will see the tomb of Eyup Ensari who was allegedly killed during the seige of Constantinople in the 7th century. Admire the spectacular tiles, but be respectful of the people praying at the tomb."
        }, 
        {
            "index": 190, 
            "rating": "5", 
            "review": "super. Eyup sultan is the burial location of abu ayyub al ansari (R) the neighbour and friend of the Prophet Muhammad (peace be upon him.) As such he is a legendary figure in early Islam and was part of the first Muslim legions sent to conquer Constantinople. When he was dying, he asked that his friends but his body on a horse and attack as far as they could and bury him deep within enemy territory. This they did and centuries later, the army of Mehmet Faith (the conqueror of Constantinople) found his grave and built the mausoleum and mosque at the site."
        }, 
        {
            "index": 191, 
            "rating": "5", 
            "review": "Worth The Effort. We got there from Eminu by the 8:45 hourly ferry, far western end of the ferries. Very impressive and non touristy - and a wonderful coffee break at the Pierre Lotti cafe where we met some locals.From there it was an easy cab ride to the Chora Church"
        }, 
        {
            "index": 192, 
            "rating": "5", 
            "review": "Must visit. You must visit this mosque at least once in your life time\nWe recommend that if visit Istanbul you should also add this very historical mosque"
        }, 
        {
            "index": 193, 
            "rating": "5", 
            "review": "Istanbul's spiritual point. It's a must visit place specially for Muslims because Sahabi of Prophet Muhammad(peace be upon him) is burried along the mosque and mosque is on his name. Abu Ayub Ansari R.A is must to visit being at Istanbul. Mosque is surrounded by a very beautiful block to shop to explore and eat,its with Pierre Lottie hill which can be climb by a chair lift and all area has a very beauty which makes it enjoyable also"
        }, 
        {
            "index": 194, 
            "rating": "3", 
            "review": "small and crowded. While we actually missed the mosque itself, we did take the funicular up to the Pierre Loti cafe. Great views, but very crowded and the entire hilltop is jammed with shops and kiosks. No real park to speak of. Go only if you have time to spare."
        }, 
        {
            "index": 195, 
            "rating": "5", 
            "review": "genuine moque experience. Not so touristy, the 4th most holy place in the Islam world, the tomb of Muhamed's friend is there. A place of pilgrimage for muslims, an amazing oasis and genuine experience of muslim life for tourist. Hundreds of great and cheap restaurants and cafes arround, as well as shops. Great atmosphere. No division for tourist, you can walk arround the mosque freely, but with respect of course."
        }, 
        {
            "index": 196, 
            "rating": "5", 
            "review": "... Blessed! Amazing Mosque, Blessed personality, kind people, lots of cats! beautiful mosque, cheaper shopping than grabd bazaar!"
        }, 
        {
            "index": 197, 
            "rating": "4", 
            "review": "Serenity. We took a bus from Eminonu to reach Eyup Sultan. We went there to visit the mosque and the place where one of the companion of the prophet Muhammad, Abu Ayyub Al-Ansari have been buried. There's a nice fountain outside the mosque and lots of pigeons. Just behind the mosque is a street heading to the teleferic station if you want to ride it to reach Pierre Lotti Hill. There's lots of shops that sell abayas, long skirts, blouse and scarves near the mosque with quite a good price.."
        }, 
        {
            "index": 198, 
            "rating": "5", 
            "review": "A must visit - Pilgrimage. this is the grave and mausoleum of hazrat abu ayub ansari , the blessed companion of prophet (s) and hazrat Ali Ra. you can pray recite quran and make dua at this blessed place ."
        }, 
        {
            "index": 199, 
            "rating": "5", 
            "review": "very quiet spiritual area. This is my 4th visit to istanbul with my family and surprisely discovered this area which is very quiet and spiritual full with many shops and resturants ....You feel something very attractive ...mosque of sultan ayub is magnificent building..."
        }, 
        {
            "index": 200, 
            "rating": "5", 
            "review": "Beautiful mosque . We visited this mosque coz of hazrat Eyup ensari tomb and am glad we did very nice interior and surrounding area was nice too ."
        }, 
        {
            "index": 201, 
            "rating": "5", 
            "review": "Worth a Visit. This is a beautiful Mosque in a lovely area, and well worth the trip from the centre of Istanbul.There is a great square outside the Mosque where you can sit and people watch. It is much quieter than the centre of Istanbul which is very appealing. To get there take a ferry from west of the Galata bridge to Eyup .it is the fith stop, and goes once an hour. The ferry takes about 35 mins"
        }, 
        {
            "index": 202, 
            "rating": "4", 
            "review": "Beautiful mosque...and take a nearby cable car ride to more stunning views!. the mosque is not that big but has a very beautiful interior. I noticed that there are cats everywhere around the mosque compound. Walk 5mins a bit further up north (if not mistaken), and you can also take a cable car up Pierre Loti hill for only 4 TL (of 2.15 TL on Istanbulkart) and enjoy a very nice view of istanbul."
        }, 
        {
            "index": 203, 
            "rating": "4", 
            "review": "Major attraction. As a Muslim, a visit to this site is like a devotion due to a companion of our prophet buried here. It is located west of Istanbul at around 30 min drive under congested conditions. Taxi drivers can be real extortionists if there's a traffic jam. The area around the mosque has changed a lot since my last visit in 2010 with a lot of commercial activity with tourism focus as compared to a few shops previously catering to religious goods. It was a Sunday and very busy. The mosque itself is very beautiful, similar to the others of the ottoman era. Try the ice cream which has a yoghurt flavour to it. The ice cream man will do a few tricks on your kids, worth a laugh."
        }, 
        {
            "index": 204, 
            "rating": "4", 
            "review": "Out of the Way but worth it if going to Pierre Loti. We ventured out to Eyup thinking there'd be a day's worth of stuff to do but other than the Mosque (which is very beautiful and glad we saw it) there's not much to do unless you include a quick cablecar ride up to Pierre Loti Hill. There is an indoor and outdoor cafe (Pierre Loti Cafe) which is nice for a bite or drink overlooking the Golden Horn. "
        }, 
        {
            "index": 205, 
            "rating": "5", 
            "review": "The Islamic spiritual center of Istanbul. Eyup Sultan Mosque ,Sahaba Eba Eyyub Al Ansari- one of the companions of prophet Mohammed (peace be upon him ) has been the Islamic spirutal center of Istanbul for centuries. Eyyub Ansari joined to Arabic army to conquer Constantinople in 7th century AD but he was matryed in front of the city walls during the siege. When Constantinople was conquered by Mehmet II in 1453, the name was turned into Islambol-the city of the muslims- and Sultan's teacher called Aksemseddin found his tomb later. Sultan ordered to build a monumental shrine on the former toms place with a beautiful mosque. Ottoman sultans paid a great respect to Eyyub Ansari's shrine and most of them were crowned in Eyup Sultan. Visiting the shrine and praying in the mosque became a tradition not only by the Royal family and the inhabitants of Istanbul visited both places in religous festivals, pregnant ladies came here to have a healthy babies, young girls visited his shrine to find their future husbands, little boys were circunsized here and so on for thousands of years. Therefore the district was protected by the Ottoman government for a long time. On the other hand, both members of Ottoman dynasty & high officials and ordinary citizens wanted to be buried near Eyyup Sultan shrine as to be forgiven by Allah on behalf of prophet's companion. Therefore a big cemetery has been formed for centuries. Eyup discrict is a big open air cemetery museum containing with thousands of gravestones, shrines and tombs from 1453 to 1990. Ottoman history can be searched by looking at the beautiful written inscriptions in Eyup and it is a real \" open air gravestone museum \" today. The shrine and the mosque are always crowded and he makes a great contibution to the city's economy even today. It is a good example for \" sacred & holy tourism industry \" for Muslim world."
        }, 
        {
            "index": 206, 
            "rating": "4", 
            "review": "A beautiful madjid.. Eyup sultan jamii as they call it in Turkey is a mosque complex hosting the tomb of Prophet Mohammed's Apostle (Abu Eyup AlAnsari).That's why it is a very popular place in Turkey that receives thousands of worshippers all year round.Beside it is an old shopping area full of restaurants and shops.The place is buzzing with life but also has a tranquil aura to it.A beautiful experience not to be missed by any Istanbul visitor."
        }, 
        {
            "index": 207, 
            "rating": "3", 
            "review": "It's beautiful enough. Most importantly, this is free! It has beautiful architecture but smaller than Blue Mosque so you can imagine how crowded this mosque is. Yet, it is still worth to visit cos you can walk around the area which is beautiful."
        }, 
        {
            "index": 208, 
            "rating": "4", 
            "review": "The Most Sacred Mosque in Istanbul. I visited this mosque twice in different trips to Istanbul. I really recommend visiting both the area, and the mosque, which is considered the most sacred mosque in Istanbul. It's the first mosque that was built by Ottomans, and has the tomb of (Abu Ayub Al-Ansari), one of the Prophet Muhammad's companions, who was buried there after his participation in the first siege of Constantinople by Muslims.At the area, you'll find many locals walking around, less tourists than Sultanahmet area, of course. Try to walk around and try the small shops nearby for cheaper souvenirs. Don't miss taking the cable car (Telefrik) from Eyup area to Pieri Lotti Cafe, with its sensational panoramic view on the Golden Horn."
        }, 
        {
            "index": 209, 
            "rating": "5", 
            "review": "A gorgeous Mosque and lovely area. We spent a wonderful morning at the Mosque and the surrounding area. The Architecture of this Mosque is different to the other Mosques in Istanbul and also very Beautiful. It is definitely worth a visit.The area around the Mosque is lovely and the cable car across the grave yard, although a little creepy(considering it is a graveyard) is a nice experience because you have a beautiful view of the Golden Horn and Istanbul from the top. We decided to walk back down and enjoyed the scenic walk."
        }, 
        {
            "index": 210, 
            "rating": "5", 
            "review": "The very special place for Muslim people and must be very interesting to everybody.. In Feb. 2015 I had a chance to visit the famous and respectable Eyup Sultan Mosque. The Mosque and the district have the religious spirit and the oriental atmosphere. It’s the 4th place in the world for Muslims after Mecca, Medina and Jerusalem. There is a tomb of Eyup el-Ensary there and the grounds considered sacred. He was the companion of the Prophet Mohammed. In the VIIth century Eyup died during the siege of Constantinople by Arabs. The mosque was built by 1458 by the order of Sultan Mehmed II Fatih after he had conquered Constantinople from the Byzantine Empire in 1453. Later on in the Middle Ages, Eyup Sultan Mosque became a very important point for all the sultans of the Ottoman Empire-they have passed there the procedure of the Osman Sword girding-a ritual a bit similar to the coronation of the European kings-after which the sultan received the full power. After all, it’s simply another Istanbul! The charm of this outstanding spot has the long history and conserved well till our times. The ancient cemeteries surrounding the mosque add the Medieval air to this old and well established district. Numerous pilgrims and tourists come to this area, full of peace and beauty of the past. Moreover, you can also get to the famous and romantic Pierre Loti Café on the top of the hill, close to the Eyup Sultan Mosque. The panorama of Istanbul which opens from there is just breathtaking! Recommended!!!"
        }, 
        {
            "index": 211, 
            "rating": "3", 
            "review": "A Holy Place for Muslims, not a lot for anyone else. If you're a Muslim, you will probably want to visit this mosque. Within the mosque's courtyard is the tomb of Eyüp Ensari (Abu Ayyub al-Ansari) the standard bearer of Muhammad, making it the holiest place in Turkey. Because of this, it became a popular burial place for Sultans, and also the place where the Sultans were invested in the ceremony of putting on the sword. For non-Muslims, the tombs are interesting but not particularly special and the mosque itself is pleasant but not exceptional."
        }, 
        {
            "index": 212, 
            "rating": "5", 
            "review": "eyüp. very antik and betufl mosk meedel of the semetery and antik Wall defnetly recomendebel you shud vizit overthere ı will go there agein soon"
        }, 
        {
            "index": 213, 
            "rating": "5", 
            "review": "Less touristy than other mosques. This stunning little mosque is worth an excursion. If you visit, walk up the hill around the back through the cemetery. The views of the city are excellent."
        }, 
        {
            "index": 214, 
            "rating": "3", 
            "review": "nice mosque but too religious. nice mosque (not superb), but a very religious place, not close too the center, you need to be very respectful with people & photographs"
        }, 
        {
            "index": 215, 
            "rating": "5", 
            "review": "Go here!. This is one for the research books because it will give you a glimpse into the investment that has been made to honor the historical importance of this site in Islam and Istanbul, as a city. I am sure it is an inspiration to the surrounding community. The amount of marble used to encircle the mosque and the care that is clearly given to maintain the surround park and neighborhood is impressive."
        }, 
        {
            "index": 216, 
            "rating": "5", 
            "review": "Behind the scenes!. This mosque is much well known among the locals and muslims. Not known to international visitor at all, but this is where Muslims want to go, not the Blue Mosque.I was particularly impressed in observing devote muslims in their routine."
        }, 
        {
            "index": 217, 
            "rating": "5", 
            "review": "Must Seen. The Eyup Mosque is nice visit. The area is quite and peaceful. There are many shops around the mosque. If you are there, go to teleferik (Cable car) to see wonder view of golden horn. You may also plan to visit Miniatürk which is a nice attraction nearby (opposite side of golden horn)."
        }, 
        {
            "index": 218, 
            "rating": "4", 
            "review": "Most Holy place. We came here as part of a Golden Horn, Eyup, Pierre Lotti trip. Speaking as a non-Muslim I can see the excitement and happiness people had to be here at this mosque as they were going in to pray. I did think that there were quite of lot of shops and souvenir places around it though, this took away some of the atmosphere."
        }, 
        {
            "index": 219, 
            "rating": "5", 
            "review": "Eyup Sultan Mosque Visit. Alhamdulillah it was also a very nice experience of our trip where we found the excellent work of art and traditional Quranic Verses Writing and beauty of Mosque."
        }, 
        {
            "index": 220, 
            "rating": "5", 
            "review": "Silence and Peace. Another most seen place. You will feel the peace in every time. But especially go to the place during the morning pray. Hz. Eyup is quite important person and he hosted Hz Muhammed in his home in Medina for 7 months. One of the spiritual place that I am happy to be"
        }, 
        {
            "index": 221, 
            "rating": "5", 
            "review": "Peaceful atmosphere. The Mosque is situated in the district of Eyüp on the European side of Istanbul, near the Golden Horn. It was the first mosque constructed by the Ottoman Turks following the conquest of Constantinople.Eyüp Sultan a companion of prophet Muhammed (SAW) is buried alongside the mosque. His tomb attracts many devout worshippers. We visited at a quieter time in the morning when it was very peaceful. If you have time take tram up to the Pierre Loti cafe to enjoy panoramic views of Istanbul."
        }, 
        {
            "index": 222, 
            "rating": "5", 
            "review": "very special atmosphere. The mosk is beautiful; the cemetary arround it is very serene and picturesque. You can be a bit of a vouaeur, observing local people visiting what is believed to be the holiest shrine in Istanbul. I am not a spiritual person myself, but still, the atmosphere there is very special. Even though we were obviously tourtists we were not harassed or reprimanded there. I think, people, who go there, are too deep in their own spiritual experience to mind a very few tourists wandering into Eyup - and this makes this place very special too."
        }, 
        {
            "index": 223, 
            "rating": "5", 
            "review": "Beautiful. Very nice, but of course if you are women you have to cover your hair the architecture its awesome, its also close to the Gran Bazaar what its very convenient."
        }, 
        {
            "index": 224, 
            "rating": "5", 
            "review": "Such a beautiful and bustling place.. Eyup Sultan Mosque is not to be missed. The area is a little less touristy than Sultanahmet, and Abu Ayub al-Ansari (whom the Mosque is named after) is SUCH an important person in Islamic history that you must come to Eyup Sultan Mosque when in istanbul. I also really enjoyed the little shops directly in from of the Mosque."
        }, 
        {
            "index": 225, 
            "rating": "3", 
            "review": "Maybe no.... I have visited Eyup Sultan because it's been described as the holiest part of the city. But I was little dissappointed after seeing all those sellersman around the mosque. For such a place where thousands of people are going for just praying god, an army of salesman creates disharmony."
        }, 
        {
            "index": 226, 
            "rating": "5", 
            "review": "WILLHOUSE. The structure and the posture of people visiting there is really like in stories. You can see how people pray for Allah and the holly man who had a graveyard there. They are willing to get true of their wishes and wills. They believe that they need to pray like these holly persons grave yards. May be it is true or placebo. But if you want to experience the different religion and culture and also rituels: GO THERE... :)"
        }, 
        {
            "index": 227, 
            "rating": "5", 
            "review": "Home of the famous Sahabi r.a.. The baroque Masjid is yet another masterpiece, but the love of Hazrat Ayub Al-ansari is what brings the people flocking to this place everyday. He died here during the first Arab siege of the city during the 7th century. Say your prayers, show your respects and if time allows, enjoy a cable car ride ( behind the Masjid ) taking you into the hills going over an old Ottoman cemetery !"
        }, 
        {
            "index": 228, 
            "rating": "5", 
            "review": "The locals are here FYI.. If you wanna see the real side of Istanbul, where I only managed to see only 2 tourists there, this is the place that you want to be. Just take a walk near the mosque and you will find extremely cheap souvenirs and cheap street foods. The place is so local that you will have trouble finding people who speaks English. The tombs were in construction when I was there but I still managed to see it from far away. Just... come here please it's lovely."
        }, 
        {
            "index": 229, 
            "rating": "5", 
            "review": "Historical site. This site is very significant to muslims and their islamic history. The mosques are generally mangificient in Istanbul and this is no exception. We took a ferry ride from Eminono to Eyup (government boat) costs us 2.15TL each on our Insatnbul Cart, best way to travel cheaply and get the best views"
        }, 
        {
            "index": 230, 
            "rating": "4", 
            "review": "We stumbled by mistake and loved the place.. We were lost as we were driven along the foreshore .The taxi driver did not understand us and dropped us there by mistake .When we realised this we decided to investigate the site.There is so much to see in one place and so much history we enjoyed it.We loved feeding the pigeon hundreds of them.When a child comes running in the middle of the flock, they take off /fly of the ground together so much wind we felt like blown away by gust of wind they create.there is a small lane of stores that sells a wide range of souvenirs reasonably priced..If you have time in Istanbul I recommend to visit this site.It is free to visity"
        }, 
        {
            "index": 231, 
            "rating": "4", 
            "review": "Good to Visit. Good To Visit we like it but it was under seome repair so we can't tell you more about it but location is very good and near to telephrek and Miniturk"
        }, 
        {
            "index": 232, 
            "rating": "5", 
            "review": "An important historic place to visit. This mosque in the Eyup district is named for the bearer of the Prophet's standard-bearer, whose tomb is in a mausoleum outside the mosque and is a venerated place for muslims. It is a smaller mosque but beautiful and the first built by the ottoman turks after the conquest."
        }, 
        {
            "index": 233, 
            "rating": "5", 
            "review": "Heart of history. This is my favourite area in Istanbul. Any time I return to the city I visit this part. This is a quiet peaceful island in the busy rustling megapolis. When you go there you feel you are in another planet. You will be filled with peace and pleasure. However you will find crowds of people mostly pilgrims who visit this holy place. You get in the heart of history. You can meditate and imagine the age of Eyup whose mosque and tomb is a must to visit here. But you can also find a lot of famous military and religious leaders' tombs as well. As you walk in Eyup everywhere where you look you see historical graveyards. It is magnificent. Also it is a great experience to see the pilgrims and the small boys wearing special dresses. When you are in Eyup it is essential to go up to Pierre Loti cafe. When you go up on the special teleferique you can see the cemetary under yourself. Wow! A unique sight. Upstairs there are special viewpoints to the city. The most beautiful view on Istanbul. You cant miss this. And if you are there see the house of Pierre Loti who was a lover of this place not surprisingly. And in the top of all you can sit in the cafe and while drinking something just relax and look at the city under your feet! You will love this. ☕✌"
        }, 
        {
            "index": 234, 
            "rating": "4", 
            "review": "Dates back to 1500's!. This mosque was commissioned by Sultan Bayezid Veli and erected between the years of 1501 and 1506. The are many rumors as to the identity of the architect, yet no one knows for certain. Facing Bayezid Square, it has been witness to countless political and social events throughout it's history. It is situated near the grand bazaar."
        }, 
        {
            "index": 235, 
            "rating": "5", 
            "review": "This area is so beautiful especially if u will take tillfric to Pierre loti tepesi. U can go by taxi to Eyup mosque and u walk little bitt and u find another direction to tillfric and up is so beautiful view .Do not use tourist package as they will charge u a way too much ."
        }, 
        {
            "index": 236, 
            "rating": "5", 
            "review": "madat. may peace be upon companion of the holy one, very blessed place, will always go back every time so peace full and felt very attached to the place"
        }, 
        {
            "index": 237, 
            "rating": "4", 
            "review": "nice hidden area of istanbul. very beautiful nice area of istanbul far from tourist routes with a lot of mosques and a little bazaar .also eyup square is a very nice square with a fountain in it and a lot of restaurants and cafes.if you have extra time to spend in the city, it is recommended to go there ."
        }, 
        {
            "index": 238, 
            "rating": "5", 
            "review": "Spiritual. The mosque is beautiful but for Muslims visitors would have a special spiritual significance. Next to the mosque Hzrat Ayyub (Eyup) Ansari, a companion of the Prophet Mohammad is buried. Non Muslims can visit the mosque, which is as beautiful inside as outside. Only everyone has to take off their shoes. The atmospher is pleasantly liberal. My wife Jennifer are I enjoyed the visit. A lovely Young woman and her grandmother offered us the Turkish Delight at the entrance."
        }, 
        {
            "index": 239, 
            "rating": "5", 
            "review": "A most important shrine to all muslims. Eyup is a nice place to visit almost at the top of the Golden Horn and the Sultan Mosque dominates all. It is a most important place of worship and also of solace for other faiths. It is always thronging with pilgrims"
        }, 
        {
            "index": 240, 
            "rating": "5", 
            "review": "spiritual haven. the first thing here is a sense of calm, peace and spirituality.The mouselem of Ayup Ansari is visited by people of all religions and faiths and the surrounding beautiful graves with very interesting gravestones dating back centuries makes it a place to must visit"
        }, 
        {
            "index": 241, 
            "rating": "5", 
            "review": "great spiritual place. you have to lean the story of EYUP sultan and you will be mesmerized. the place is pretty old and hold serious importance for religious people, it is a peaceful corner."
        }, 
        {
            "index": 242, 
            "rating": "4", 
            "review": "See the tomb of the Prophet's flag-bearer. I enjoyed the tranquil atmosphere in this mosque between prayer times. Men and women are not segregated and children scamper quietly. Take some time to sit quietly and reflect.\nThe tomb is well-attended, and the shady courtyard with drinking fountain is a nice spot to sit and rest your tired feet."
        }, 
        {
            "index": 243, 
            "rating": "5", 
            "review": "A very special place. I first visited Eyup SUltan Mosque in September 2013. They were filming a historic drama at the time so did not stay for long before going on to Pierre Loti Cafe. There was an elderly gentleman sitting outside the mosque with a small box of assorted perfume oils and he was perfuming the right hand of every person entering the mosque. (he did not accept any payment and was doing this as an act of devotion). I visited again in October 2014 just after the Eid and the place was full of pilgrims. I stayed for longer this time and enjoyed the definate 'spiritually special' atmosphere of this holy place. People were giving gifts to visitors as acts of charity and I was presented with a pair of socks by a young woman as I sat in the mosque courtyard which I accepted although I have yet to wear them! This tradition is observed usually when a person has had a prayer answered or it is done in memory of a loved one.Eyup Sultan Mosque now certainly occupies a special place in my heart and I just have to recollect my visit to again experience the calm serenity of the place despite it being very busy. The old man with the perfume was not there this time and I missed him, perhaps he will be there the next time I visit."
        }, 
        {
            "index": 244, 
            "rating": "4", 
            "review": "Nice surprise. We took the ferry from Eminönü. It was a nice trip along the Golden Horn. Eyup Sultan Mosque is right outside the walls of historic Constantinopol. The mausoleum of Hazrat Abu Ayub Ansari (Prophet Muhammad's companion) makes this mosque a site of pilgrimage for Muslims. If you want to experience a true Muslim Istanbul, then this is the place to go.The surrounding area is beatiful and more real. And things are much cheaper here. Near the mosque is also tomb (türbe) of Sokollu Mehmed Pasha, Grand Vizir and de facto ruler of the Ottoman Empire under three sultans – Suleiman the Magnificent, his son Selim the Sod and Murad III."
        }, 
        {
            "index": 245, 
            "rating": "5", 
            "review": "A very Scred Place in Istanbul. Eyup Sultan Mosque is just beside the Mazar of Hazrat Abu Ayub Ansari (RA). You feel Spiritually blessed after visiting this area."
        }, 
        {
            "index": 246, 
            "rating": "4", 
            "review": "Very peaceful and historic !. It was a fascinating to experience history by just visiting this cami. We were lucky as there was a was a historic procession in the outer courtyard with all of them dressed in traditional Ottoman attire. This was a Friday, after prayers, hence I think its important to plan the visit to this mosque on the right day and time. The people were extremely welcoming and friendly. Helpful to read about its historic significance before visit for maximum benefit ! Loved it"
        }, 
        {
            "index": 247, 
            "rating": "3", 
            "review": "Brief visit during your trip to Pierre Loti viewpoint. If you visit Pierre Loti viewpoint than a brief visit to Eyup Sultan Mosque is a must. Amazing that this mosque is the most sacred place in Istanbul for muslims, more than Sulemaniye Mosque, more than the Blue Mosque or the New Mosque ; considered as the fourth important mosque of islam (after the mosque of Jeruzalem, Mecca and Medina). From Eyup pier walk 400m."
        }, 
        {
            "index": 248, 
            "rating": "5", 
            "review": "fantastic. The ayup square is a busy pleasant place to explore. the mosque is another jewel in the collection of historical mosques of Istanbul, the style is slightly different because it contains grave of abu ayubb al-ansary , which makes it a unique place to visit."
        }, 
        {
            "index": 249, 
            "rating": "5", 
            "review": "Intense devotion. North of the Golden corn, in this mosquee you can really feel an intense and popular devotion for the holy Eyüp. You'll find a lot of tombs of Holy man, vizir and pacha, and a crowd of muslims, especially,,women, praying and crying. Take the boat from downtown goin' north to Eyüp."
        }, 
        {
            "index": 250, 
            "rating": "5", 
            "review": "A unique mosque in Istanbul. The mosques in Istanbul are all quite picturesque and tranquil, but there's something very unique and special about the masjid at Eyup... Not only the burial place of the great companion Abu Ayyub al-Ansari, ra, but there's a different level of spirituality to be found here. And the views to be found at the top of the nearby cable cars, make Eyup a place you really should visit! Very easy to get to on the boats."
        }, 
        {
            "index": 251, 
            "rating": "4", 
            "review": "Historical Place for Muslims. Not a grand masjid but plays a significant part in the history of Islam as it is believed that the companion of Prophet Muhammad (peace & blessings be upon him)was buried here."
        }, 
        {
            "index": 252, 
            "rating": "5", 
            "review": "Sultan quarters. Amazing architecture is the basics, for this place,\nAttention to detail as you can imagine, plus beautiful tulips gardens"
        }, 
        {
            "index": 253, 
            "rating": "5", 
            "review": "A must when in Istanbul. This is my second visit to Eyup Sultan Mosque and the surrounding area. Very nice historic place. I like shopping for souvineres where they are much cheaper. We prayed at the mosque, went by the cable car up (Pier Lotti Cafe with awasome views). Then, we had lunch in one of the restaurants facing the mosque. Very nice day."
        }, 
        {
            "index": 254, 
            "rating": "4", 
            "review": "Visit during Eid el Adha. This is a very local mosque and busy as our visit was during Eid el Adha. It is a site of pilgrimage for Muslims and contrasted well with the more well known mosques."
        }, 
        {
            "index": 255, 
            "rating": "5", 
            "review": "A beautiful place with welcoming people. As a Muslim, it was an honour to visit the grave of Abu Ayyub al-Ansari (R.A). I found the whole place very special, and spiritually very enlightening. The surrounding area is good for shopping for Islamic items, including Quran's and Islamic attire."
        }, 
        {
            "index": 256, 
            "rating": "4", 
            "review": "other mistic station. I have to be honest my expectation was very high because I have been to Saint SOPHIA (Ayasofya) , Eyüp Sultan of course beautiful but I like Saint Sopahia more .\nAlso Eyüp Sultan was very very crowded ."
        }, 
        {
            "index": 257, 
            "rating": "5", 
            "review": "Great Mosque in a great area. Very interesting mosque , it is a little bit far from the city center , but situated in a nice environement on the golden horn"
        }, 
        {
            "index": 258, 
            "rating": "4", 
            "review": "Good area. It is a nice area to be around. but personally I didnt like the grave visiting thingie. but we enjoyed shopping n having a meal there. Walking is my favorite thing to do, we did a long walk from there."
        }, 
        {
            "index": 259, 
            "rating": "3", 
            "review": "Busy Busy Busy. I went on the day of Arafat, it was so busy women were sitting on top of one another at the time of prayer, Nice friendly place once we actually found Ayup"
        }, 
        {
            "index": 260, 
            "rating": "5", 
            "review": "The real orient (almost) in the midst of Istanbul. A must for anyone visiting Istanbul who wants to get a feeling for the city's Ottoman and Islamic history. The mosque is interesting as one of the rare examples of oriental baroque - o.k., not 100% oriental, but that must have been always the charme of this glorious city. People here are much friendlier towards non-Muslim visitors than in the arch-conservative Fatih district. Go there on a Friday and you will meet Turks from anywhere coming to pray at this special place - and even then you should find your table in one of the nice coffeehouses."
        }, 
        {
            "index": 261, 
            "rating": "5", 
            "review": "Old beautiful mosque. An amazing experience visiting the Abu Ayub Al Ansari mosque. Not only the beauty of achitect but also by the overwhelming feeling of peace and serenity. A blessed place indeed. The people there too, seemed calm and reflective. Felt honoured being here. Will hope to visit here again son."
        }, 
        {
            "index": 262, 
            "rating": "4", 
            "review": "An authentic place to visit in Istanbul. Eyup is not a typical tourist location. On the contrary with its mosque as basic atraction is aplace for religious muslims. You can visit the place after taking the ship of Halic from Eminonu. This is a pleasant mini cruise of Istanbul's 'golden Horn\"."
        }, 
        {
            "index": 263, 
            "rating": "5", 
            "review": "Interesting mosque. There weren't many tourists when we arrived, only locals or pilgrims. We thought the religious service was done when we entered it and realized that was still in session. We had to go to the upper level, reserved for women, through a narrow staircase. It was interesting to see."
        }, 
        {
            "index": 264, 
            "rating": "4", 
            "review": "Cannot be missed. Eyup is such a great place to visit, there where you can have an amazing view up from the top of the hill and then through the large tomb which you cross till you reach down where the sultan's mosque is locatedA wonder place to visit and that cannot be missed as I mentioned before.Thank for your time to read my review."
        }, 
        {
            "index": 265, 
            "rating": "5", 
            "review": "Not to be missed. Not only does Hazrat Ayub Ansari have a significant status in Islam but the Sultans of Turkey have built a beautiful mosque too where he is buried It's hard to reach and it's pronounced as Eyup rather than Ayub To reach there I took bus 99 near galata bridge near spice bazar ( which Is 10 minutes Walk from Grand Bazaar ) And I guess it's about 6 or 7th stop from there and about 10 minutes ride"
        }, 
        {
            "index": 266, 
            "rating": "4", 
            "review": "Eyup. This is not a typical destination for non-Turkish tourists, but that made it all the more intriguing. I've been twice, the first time we hired a small boat and cruised up the Golden Horn to the mosque. As we walked along the grounds it seemed deserted on that day, but once we reached the mosque we were the only obvious foreign faces in the crowd.It is a place of pilgrimage for Turkish Muslims. They come to pray and are instructed not to pray to objects (relics, tombs, etc), but only to Allah.There are nice restaurants in the area, as well. My first trip was in July, 2012, and my second was by tour bus in September of the same year. The tour was organized by our language school."
        }, 
        {
            "index": 267, 
            "rating": "5", 
            "review": "historical. The area was well preserved. The people are friendly we enjoyed visiting the Camii. It is a short cab ride from sultanahmed."
        }, 
        {
            "index": 268, 
            "rating": "4", 
            "review": "far from sultanahmet but superb!. it's really far from the main touristic attractions but it is worth visiting this mosque and its complex.I even saw a 8years old child whitedressed as if he were a prince: it was his day of circumcision. If you have enough time visit it."
        }, 
        {
            "index": 269, 
            "rating": "5", 
            "review": "Spiritual Place. One of my favorite place in Istanbul... to run from tourist places, to have peaceful moments with your own soul... praying inside the mosque... asking the Sultan on behalf of us to Allah.. sharing with others these moments... listen to Quran & Athan as well... I think it's a spiritual place for anyone muslim or non muslim..."
        }, 
        {
            "index": 270, 
            "rating": "3", 
            "review": "View from the hill was great. Far away , not easy to reach this location, we where not go inside as our intention is to go to pier loti by cable car near by this mosque, from out side looks beautiful, that time was crowded as is on prayer time"
        }, 
        {
            "index": 271, 
            "rating": "5", 
            "review": "Amazing view from eyup and telfrek. Good place and there u can feel how much the turkish people like the islam and the men's of profet mohamad ( el sah )like this sahaba abu eyub el ansari who die there...when u pray there u remmber the masjed el aqsa and el qaaba in maka...alot of people there spucial women...the eria vrey clean and many shops and resturant there in cheep price...from there u can go walking to telfrek to see one of the best few to istanbul spicial in the evning..the telfrek ugually is full and u will lose alot of time wsiting for telfrek...so better walking bz there is eady way for walking 10 muntes..."
        }, 
        {
            "index": 272, 
            "rating": "5", 
            "review": "History with connections to past individuals and the locals today. Quite a way out and on the other side of the river/inlet (The Golden Horn) from the big mosque attractions in Sutanahmet but we were with an organised 3-day tour and all the hard work was done for us; on your own this visit would be quite difficult but – the taxis are cheap. We arrived just after a thunderstorm and the place was alive with locals going about their worship, there was a bride arriving for her wedding and little boys done up in their white suits in preparation for the circumcision ceremonies; it was the only insight we had of a functioning mosque rather than a museum during our whole 3 days and a lot of visits to ‘museum mosques’. The service was over and the Imam was talking to his flock and there was absolutely no problem with us going in and we were even encouraged to take photographs – you got a real sense of Muslims being proud of their heritage and yet being respectful of yours and being welcoming towards you – a shame that is not able to be present in the larger and more touristic places. The inside is gorgeous, that almost goes without saying. The extensive graveyards are enthralling and, just like ours here in the West, some are severely neglected and overgrown. There is the tomb of one of the Prophet’s (Peace be on him) nearest military collaborators and everything is set in a working space for the inhabitants of this part of the city with fountains (we saw, relatively, so few during or visit), eateries, shops and everything the population needs for its everyday life and all with the mosque at its centre serving the community. A real insight into the life of a city-dwelling Muslim"
        }, 
        {
            "index": 273, 
            "rating": "5", 
            "review": "The spiritual place where you can get peace of mind and heart. This place is always busy with people coming alone and with families. Asking the sultan to pray on behalf of them to God. A place for men to perform their ablution is inside the main entrance. The mosque is huge but is absolutely packed on Fridays. Amazing spiritual place and very holy. Truly a place where when you pray, the heart and mind feels peace."
        }, 
        {
            "index": 274, 
            "rating": "5", 
            "review": "One of the most beautiful mosques in Istanbul. well this was my last mosque to visit in my trip to Istanbul, It holds a vast space, there are shops that has Islamic theme (you know they sell scarfs, hijabs and praying hats for men etc) there were restaurants and cafes near by.many people where there, I saw more people than at the blue mosque, the interior of the mosque is not that different than most of the mosques in turkey, the decorations and paintings on the wall almost similar to all other mosques. it was great to visit it and pray Duhur in this mosque, on our way out they gave us free cold water to drink !! :D"
        }, 
        {
            "index": 275, 
            "rating": "4", 
            "review": "Special place for Muslims. This is a mosque where one of the \"Sahaba) prophet Mohammed was buried , Abu Eyub El-Ansari. If you visit the Pierre Loti by cable car you also visit the mosque. There are some shops in the area with good price."
        }, 
        {
            "index": 276, 
            "rating": "3", 
            "review": "Nice peaceful retreat. Unless you are a muslim or someone interested in Islamic and Arabic history you will not find the place interesting. However, if you are around the cable car of pierre lotto then you must visit this mosque. The mosque houses the tomb of Abu-Ayub Al Anasri one of the companions of prophet Muhammed. The mosque is in the middle of the most famous graveyard in Istanbul which is surrounded by some nice gardens and shops."
        }, 
        {
            "index": 277, 
            "rating": "4", 
            "review": "The cemeteries are amazing. This may not be the most touristic site but the mosque and the huge cemeteries surrounding it are fascinating. The town itself is a real change from the tourist areas of Istanbul and make taking the Golden Horn ferry worthwhile."
        }, 
        {
            "index": 278, 
            "rating": "5", 
            "review": "At the far end of the Golden Horn, and thus requiring a journey. The Mosque is impressive in itself, and doubly interesting because it is where young boys are brought at the time of their cirumcision (7 or 8 years). Above the mosque, and easily reached by a path, is a charming café, once frequented by Pierre Loti, with a wonderful view."
        }, 
        {
            "index": 279, 
            "rating": "5", 
            "review": "Spiritually uplifting experience.. An amazing experience visiting the Abu Ayub Al Ansari mosque. Not only the beauty of achitect but also by the overwhelming feeling of peace and serenity. A blessed place indeed. The people there too, seemed calm and reflective. Felt honoured being here. Will hope to visit here again soon."
        }, 
        {
            "index": 280, 
            "rating": "5", 
            "review": "A very spiritual experience. Took a taxi from Grand Bazar - paid 40 TL to get to Eyup Sultan Mosque. Alternate to taking the taxi is a ferry ride from eminonu and you can also experience the golden horn water way this way( I found this out later) .There is a bus going to Eyup Sultan as well but judging from the taxi ride , it will quite a long bus-ride.We arrived around 9 PM and the place was busy with locals visiting Hazrat Ayub Ansari's tomb (called Eyup Sultan by locals) . There are four excellent restaurants nearby (side by side) and a burger king and many other eatries. Its a great place to be. Besides Ayub Ansari's RA tomb there are few other tombs as well. Make sure you do your home work before you go there as there arent any guides to take you around."
        }, 
        {
            "index": 281, 
            "rating": "5", 
            "review": "Old beautiful mosque. I love the mosque with the old othmani design.\nThere is beautiful ceremony on Friday after prayer\nSmall shops near by"
        }, 
        {
            "index": 282, 
            "rating": "5", 
            "review": "Eyup Sultan Mosque. We visit it in our previous visit in 2012'now again we go for zirat ,we find it very peaceful we offered our two prayers their and feel blessed again I want to go their,as Hazrat Ayup ANsari is the companion of Harat Muhmmad Mustafa May peace be upon him.we met a very nice person their who is our tour operate who take care of us like a family member ,my sister is on wheelchair he push her wheel chair by himself which was always push by me,but he did it himself and not allow me to do it,it's very kind of him ."
        }, 
        {
            "index": 283, 
            "rating": "5", 
            "review": "Historical Mosque to visit. This mosque is the final resting place of Abu Ayub Ansari, one of the very close companion of the last Prophet (PBUH). It was his home where Prophet stayed when travelled to Madina. So for Muslims specially it carries a lot respect and importance. It also has very old graves of important people."
        }, 
        {
            "index": 284, 
            "rating": "4", 
            "review": "time of serenity. If you have a chance to be in İstanbul in Ramadan, you should definitely see Eyüp Sultan Mosque and feel the air with the crowd. In order to discover the charms, do not abstain from playing around the mosque towards call to evening prayer."
        }, 
        {
            "index": 285, 
            "rating": "4", 
            "review": "The Holy Site. Eyup is home to the holy site for Muslims. The mausoleum of Hazrat Abu Ayub Ansari, who was Prophet Muhammad's companion is here. Hazrat Ayub was killed here during the first Muslim siege at Constantinople. We came here by bus 99 from the Eminonu Bus Station as we had just missed the ferry and didn't want to wait another hour. It was about 5pm and it was the rush hour. On the way we saw the the old City Walls and other areas. After getting off the bus, there is a square and a little ahead is the mosque and the mausoleum. Maybe for other tourists its not a great attraction but for the Muslims it holds a lot of sanctity. Many a prayers are heard and accepted here. Its very peaceful There is a graveyard too. Some souvenir shops are along the way. We bought some small silver trays with a tomb like cover for 5TL. The Muslims must visit the Mausoleum."
        }, 
        {
            "index": 286, 
            "rating": "5", 
            "review": "Tomb raiders' must (kidding). Ayup Sultan's tomb and the mosque along with it, is one of the must see places you need to see if you want to complete a tour of old Istanbul. The Bazaar, food market and parks around it are also beautiful."
        }, 
        {
            "index": 287, 
            "rating": "5", 
            "review": "Great! Authentic Turky. HAzrat Ayub Ansaari was a Sahaba of the Prophet Mohammed sallalla hu alaihi wassalam. It was in his house that the beloved prophet stayed after entering Madina (Yathrib). The square looks a little like Madina square. It has the same peaceful feeling. Good and cheap restaurants in the area. There are a lot of other Sahaba in the area."
        }, 
        {
            "index": 288, 
            "rating": "5", 
            "review": "Historic sites. From ancient historical places that remind you of the past and ancient history and place contagious easy way to get with the presence of services and popular markets, restaurants and cafes Site is worth a visit"
        }, 
        {
            "index": 289, 
            "rating": "3", 
            "review": "Nice location but .... Your friend or a place where the Prophet would recommend you to go.However, women in the courtyard of the mosque to pray I did not like."
        }, 
        {
            "index": 290, 
            "rating": "5", 
            "review": "Eyup Sultan Camii. Very spiritual place , significant in Islamic history for the resting place of one of the Prophet's companions. Beautiful internal features of the mosque, with upper balcony for ladies."
        }, 
        {
            "index": 291, 
            "rating": "5", 
            "review": "Mosque and Cable Car Visit a \"must do\". We got there by bus from Eminonou past Galata bridge which cost us about 1.25TL each on the Istanbulcart, , alternatively you can go by taxi which is about 25TL or by ferry from the same location . After visiting the shrine , praying for deceased and doing Salah in the Masjid you can look around in the bazaar area(or do this before the shrine) , but if you are pressed for time or not there for religious reasons get in the queue for the cable car which costs about 2 TL on your Istanbulcart..the views during the ascent are amazing . At the top after a photo shoot , tea or ice cream you can walk down through a very interesting cemetery or catch the car down for which the queue was relatively short .Overall a wonderful experience."
        }, 
        {
            "index": 292, 
            "rating": "5", 
            "review": "Not to be missed. If you want to see a typical Islamic Pilgrimage site and a great market. Don't miss this site. You can reach it by car, bus or my favorite way by Ferry.Visit the Mosque and please, dress appropriately, it is a Holly Site. No shorts, no short sleeves, and a scarf to cover your head. You might follow my advice, being a Turk, living in the USA and taking along a lot of friends to see Istanbul, I advise them to put a T-shirt and carry ALL THE TIME, in their bags, a light weight long sleeve cardigan and a scarf. This way you are always ready to visit a mosque if you so wish, and there are so many! And please, NO shorts.Then visit the tomb of the Saint, he is known to accomplish all your prayers and wishes. He was the Banner Bearer of our Prophet Muhammed (pbuh).Then go to the market. Best place to buy Rose Oil or Jasmine Oil. And beautiful Head Scarves with OYA (hand made by crochet of flowers or other lovely decorations). I always buy dozens and bring it back to the US as gifts and everyone loves them. They go for about $ 5 each and you get a baker's discount for buying many!DO eat the ice cream there, it is scrumptious, especially the KAYMAK (Turkish Speciality made with milk, sugar and Pine Tree gum) and the VISNE (Sour Cherry) even better than Italian Gelatos!From there proceed to the Funicular and go to Pierre Loti Cafe. Or if you have good legs walk the path up. You will see amazing old tombs and lovely vistas. There is also a beautiful Nakshbandhi Tekke (Sufi Monastery of the Naksbandhi Order), a must stop and see site. The Gate Keeper Dervish will be happy to answer all your questions.You will eventually reach the little cafe, this was the favorite place of the French Writer who wrote a lot of books on Istanbul. Once there you will understand why, the view of the Golden Horn is amazing. Don't forget your camera!Above, short walk from the Anatole France Cafe, there is a great restaurant with excellent food and view.Don't forget to stop and pray at the tomb of a Sufi Saint just before the entrance of the Restaurant.There you can also enjoy a Narguile (Turkish Water Pipe), don't leave Istanbul without trying at least one!!!"
        }, 
        {
            "index": 293, 
            "rating": "5", 
            "review": "Great place for photography. you can get into this lovely town by boat. very attractive and clean town indeed. The mosque is in the heart of heart of the town, you can't it miss it. Take the cable car to the top for unforgettable view of Istanbul. The cafe at the top is a bit pricey so buy your drink and sandwich before you ride the cable car."
        }, 
        {
            "index": 294, 
            "rating": "5", 
            "review": "Make the Pierlotti+Eyup Sultan in one day. My advice: go to Pierlotti area which is located on a small hill, use the telefric to go up (4 lira per person, and you can use the bus/tram/subway card), visit the Pierlotti area, then descend to sultan eyup on foot, the scenery is wonderful and the steep road is shaded by trees, until you reach the mosque, visit then have lunch in any of the many restaurants down there."
        }, 
        {
            "index": 295, 
            "rating": "4", 
            "review": "surrounded area is very good. too many tourest too many restourant too many shops, mosque it self is old but great i like this place"
        }, 
        {
            "index": 296, 
            "rating": "5", 
            "review": "A totally local experience. This mosque is not usually listed as one of the must-see mosques; however, if you are interested in seeing a more local and much revered place of worship, this is it. Eyub Sultan; also known as Eyub Ensari (Ayub Ansari) was the companion of the Prophet Mohammad, in whose home the Prophet had stayed when he left Mecca for Medina. According to some this is the 4th most sacred site for Muslims after Mecca, Medina, and Jerusalem. Hazrat Eyub's tomb is in front of the mosque. One hardly sees tourists here but its an interesting place to people-watch."
        }, 
        {
            "index": 297, 
            "rating": "5", 
            "review": "Local place. This mosque maybe more popular than Blue Mosque for the local people. We saw many people waiting for visiting Saint Eyup's tomb in the inner court."
        }, 
        {
            "index": 298, 
            "rating": "5", 
            "review": "A nice a quiet place. Eyup Mosque is near Pierre Lotti caffe. We arrived by ferry from Eminonu. The mosque is near the ferry doc. The place itself is very impressive. We couldn't visit the mosque inside due to some renovations that were going on. We have visited Eyup sultan turbesi, where the people were waiting on line to pray. I think that at the time we were the only non Muslim people. It was very nice that they have dresses so women can enter and visit the tomb.I know that this Mosque is one of the holiest place for Muslims and everything showed and felt like, this. I hope that next time to visit the mosque inside."
        }, 
        {
            "index": 299, 
            "rating": "5", 
            "review": "Stunning. I loved to visit these mosques and this was on my list, another amazing space, don't forget there is more to the complex than just a mosque, the whole concept is amazing..."
        }, 
        {
            "index": 300, 
            "rating": "3", 
            "review": "Busy busy. We went on a what must've been a religious bank holiday as it was teeming with locals in carnival mood. The boat trip to get there was pleasant and good to be out in the air away from the city. We didn't bother with the cable car up the hill but walked a back way seeing more of the town,which was unremarkable in truth. Mind you on our way down again saw the size of the queue for it we were glad we had walked. Lovely views of the Golden Horn & beyond from Pierre Loti,although trying to get a tea & a table was a struggle. The mosque itself was less exquisite than others we had been to but good to see so many pilgrims enjoying clearly what was an important day for them."
        }, 
        {
            "index": 301, 
            "rating": "4", 
            "review": "Avoid end of the day. The mosque itself is not very special, but the historical importance is worth the visit. Tombs of the most important ottomani heroes can be found there.\nThe tombs close at 5pm so watch the time of the visit. It was also extremely crowded around end of the day with religious pilgrims and people waiting for the iftar time."
        }, 
        {
            "index": 302, 
            "rating": "4", 
            "review": "very crowded and close to pier loti. This is one of a historical mosque in Istanbul and also there are some graveyards of masters. You should think twice before visit in Ramadan. Eyup is very popular place for being in Ramadan. Especially after 5pm, people go to Eyup.Pier Loti is attractive place. You should go to see there if you are in Eyup Sultan Mosque. Don't need to wait queue for cable car. It takes less than 10 min by walking. When you get Pier Loti if you want to sit a little for a cup of tea, don't be shy to get a table. Tea garden is crowded too and people are racing for table."
        }, 
        {
            "index": 303, 
            "rating": "5", 
            "review": "Excellent Mosque and its complex. Nothing more to add to the comments indicated here,for any moslem,this is one of the musts in İstanbul.As Fridays will be very very crowded,pls make yr planning accordingly.İt is about 30 minutes boat ride fm Karaköy and Eminönü by Şehirhatları and easy to locate this complex.We strongly recommend this place."
        }, 
        {
            "index": 304, 
            "rating": "5", 
            "review": "A living history. The tomb goes back to 1400 years ago but its being revived every day. with children dressed in special uniform coming to visit and offer prayers . It a chapter of European hisotry one should know while in Istanbul. Dont miss!"
        }, 
        {
            "index": 305, 
            "rating": "5", 
            "review": "Different Mosque Experience. Everything here was free, unless you buy some food or cheap souvenirs or shell out the 1 TL for the public restroom. The mosque and surrounding areas were packed with praying muslims, many obviously travellers on some kind of pilgrimage. Tents were set up in the nearby squares with Imams giving sermons, and the park benches were filled with old men chatting and playing cards. The tomb/viewing area of Eyup El Ensari was open, filled with the devout praying, so we got just a short view before moving on. The mosque itself was also packed with more praying muslims, and there were only a small handful of discreet tourists like us lurking about. We stayed in the back as there was a call to prayer going on, with the singer in the raised seat next to one of the columns speaking into a microphone. It was a great chance to see real muslim worshippers in action, not just the tourist-packed throngs of the more famous mosques. The men were in the bottom center area, the women were confined to the sides and the upper gallery. The only downside was that the mosque was so packed, even next to the door the smell of shoeless feet was overpowering. Like bigger mosques, they have clothes and scarves to help you cover up before going in. You can walk through an Islamic cemetery or take a cable car up the hill to the Pierre Loti Cafe for the view at a public viewing station, but actually patronizing the touristy and overpriced cafe is optional."
        }, 
        {
            "index": 306, 
            "rating": "4", 
            "review": "Tranquil and Spiritual. Away from all the touristy hustle and bustle, this mosque was quite special and tranquil. Sadly the tomb area of Eyup (Ayyub) al Ansari was being renovated, and were allowed no access in. Nevertheless, the mosque is worth visiting! (According to security: renovations will last a year!) We spent hours taking in the peaceful surroundings and enjoying local friendly banter. Make your way to Pierre Loti from here to enjoy the spectacular views and a good cuppa apple tea!"
        }, 
        {
            "index": 307, 
            "rating": "5", 
            "review": "a must see. a nice mosque within a small shopping are with nice restaurants and a must see as it is not that busy with tourists thus good for viewing"
        }, 
        {
            "index": 308, 
            "rating": "5", 
            "review": "The Mosque and Mausoleum of Eyüp Sultan. The Mosque and Mausoleum of Eyüp Sultan, located outside the corner where the land walls meet the walls along the Golden Horn, is considered a sacred site for Moslems. Eyüp-el-Ensari was a standard-bearer of Mohammed and he died-here during an Arabic siege of the city in the 7th century. His grave was discovered at the conquest and later the mausoleum and the first mosque in Istanbul were built on this site. The original mosque was destroyed in an earthquake and the present one was constructed in its place in 1800. On Fridays, holy days for Islam, throngs of the faithful visit the mausoleum. The old trees, flocks of pigeons, the praying believers and the visiting crowds create a mystical and colorful atmosphere around the mosque and the mausoleum. The walls of the mausoleum in the courtyard are covered with tiles from different periods. Historical sources indicate that in Byzantine times this district was also a holy site where people came to visit the grave of a saint and to pray for rain during times of drought. The sultans succeeding Mehmet the Conqueror completed their coronation and sword-bearing ceremonies with a visit to the Eyup Sultan Mausoleum. The vicinity of the mosque and the neighboring hills are occupied by cemeteries. The famous Pierre Loti Cafe is also in this district. The well-known poet and author Loti was enraptured by Istanbul and he came here often to watch the beauties of the Golden Horn of those days. The view from this small cafe and the terrace, particularly during full moon, leaves long-lasting impressions on the visitors."
        }, 
        {
            "index": 309, 
            "rating": "4", 
            "review": "Great area. We arrived here on using the government ferry Sehir Halic which cost 3tl one way/person.Boat ride was nice and only took 30min on a scenic route. The mosque and main area is only walking distance from the ferry terminal.The mosque has a very spiritual feeling as unlike other attractions doesn't have tourists posing for photos.This mosque has the resting place of the famous companion of the prophet saw called Auyb Al Ansari.Many Muslims come here to pray for this companion. A must visit for Muslims.The area is nice and lively and has fountains, food places and a many shops. The items here are much cheaper than sultanhamet so you can come here on your last day to get some fresh backlava.Whilst here take the sky ride to Pierre Lotti and get the most magnificent view of the golden horn.Sky ride is only 3lira one way."
        }, 
        {
            "index": 310, 
            "rating": "5", 
            "review": "Crowded but beautiful!. We came to Eyup by ferry one afternoon since we were staying in Sultanahmet. The ferry was a little hard to find (it's on the extreme end past the new mosque).It's a nice scenic ride, about 25 minutes I think. The area is a heavily populated \"overtly\" muslim area. It seems like a safe, family friendly place. The mosque is pretty easy to find, and only a few minute walk from the ferry terminal. Despite some strange call to prayer (not the typical one--not sure what else they've added?!) the mosque itself was very crowded. I'm not sure if they're sufi here, or what denomination, but definitely some practices that are not in accordance with the teachings of the Prophet.Anyhow, definitely beautiful and well worth a trip here and Eyup in general. Pierre loti is a MUST DO. Stop for some tea and enjoy the view ;)"
        }, 
        {
            "index": 311, 
            "rating": "5", 
            "review": "Spiritually Fantastic. Eyup Sultan Mosque has a very spiritual feel to it, those who would like to see the Islamic Way of life , head down you won't be disappointed. You can definatly tell that there is a Sahabi of the Prophet (SAW) laying there."
        }, 
        {
            "index": 312, 
            "rating": "5", 
            "review": "One of the great places I have visited. Although the place is undergoing renovation, but we were able to enjoy every corner of it. The place is very peaceful, full of birds and pigeons, you may wish to feed (pigeon food 1TL for a cup of corn or rice I guess). Muslim tourists may have a chance to pray inside the mosque and make a duaa for the prophet's companion Abu Ayub Al Ansari. Our visit was without a guide, we really missed lots of information about tombs and other parts of the place. We tried to ask locals but none of them were able to answer even those who speaks english.You can see locals bringing their kids who recently underwent circumcision, wearing very pleasant and traditional ottoman cloths. Good chance to have some nice shots of them or with them, people are very happy their and always welcoming to help.There are outer spaces with lots of fountains, that did not start until around 12 noon. So keep that in mind if you wish to have a good shot. I recommend to visit this place anytime of the week except on fridays because of the friday prayer and the place will be full, even the outer space of the mosque, no place for any tourist to visit.The place is full of souvenir shops, scarfs, antiques, food, and sweets. Mado is the best for sweets, located on the main streets on the main way to the mosque. I recommend you buy sahlep, some kind of sweets, very tasty full of cinnamon flavor and good during cold time. For narjila fans, who would like to smoke, you may find some restaurants offering it close to Mado. It is a very nice place to spend a couple of hours there.Keep in mind, no rest rooms in the restaurants, there is a public WC, it is ok, not bad, you should pay 1TL to get in. Merchants there are hardly negotiable, but do not give up, keep pushing them for discount, so you even end up kicked out of the shop or win the bargain."
        }, 
        {
            "index": 313, 
            "rating": "3", 
            "review": "Was in our tour itinerary. Being in a Muslim tour, we were taken there one morning. Unfortunately, the tomb of Ayyub al-Ansari was under restoration and we could only peer at it through a window. Best perhaps to combine the mosque with a visit to the top of the adjacent hill for the views / Pierre Loti cafe but we didn't have the time."
        }, 
        {
            "index": 314, 
            "rating": "5", 
            "review": "A real mosque. I visited Eyup mosque as the first place of my 19-day-Turkey tour.Tourists were rare,so I laterrealized that it was the real mosque.There were many people,most of them were muslims.It wasnot so large as the Hagia Sophia Museum nor Blue Mosque,but the atmosphere was reallypious.So if you want to see a real mosque,be sure to go there.And it is near the Golden Horn,walls of Constantinople."
        }, 
        {
            "index": 315, 
            "rating": "5", 
            "review": "Serenity. So old and so simple. The interior is absolutely beautiful and feels full of faith. (I'm not a believer, by the way!). You can walk up through the cemetery along a tree-lined path to Pierre Loti's teahouse at the top for a very reasonable apple tea with an amazing view."
        }, 
        {
            "index": 316, 
            "rating": "4", 
            "review": "Peaceful place. We spent an hour in this mosque, very spiritual place . We loved the mosque and the whole area. There are few tourists there . The place gives you fantastic feeling , you are far of everything and enjoying the peaceful place . I think it is a must visit place for muslims"
        }, 
        {
            "index": 317, 
            "rating": "5", 
            "review": "Praying. The most spiritual place in Istanbul is the resting place of Abu Ayyub al-Ansari, known as Epu Eyyüp. If you're a Muslim, I urge you to pray fajr here in congregation; sublime."
        }, 
        {
            "index": 318, 
            "rating": "5", 
            "review": "Peaceful and Spiritual. A must for Muslim visitors. The mosque is beautiful. It's not filled with tourists but with locals. I loved serenity of the place. As of 19, May 2014 the tomb is closed for restoration. There are local bazzar behind the mosque, definitely worth checking out. I took the train from Sultanhmet to Eminonu (3TL) and then taxi to mosque (12TL). One the way back, tax to Eminonu cost (20TL) due to driver had go up 2K to make a U-turn."
        }, 
        {
            "index": 319, 
            "rating": "5", 
            "review": "peaceful. we visited Eyup Sultan Mosque as it has religious significance, it is in a quiet area, and around the mosque is a beautiful local area which is not filled with tourists . It was so nice to spend time in this beautiful location.."
        }, 
        {
            "index": 320, 
            "rating": "5", 
            "review": "Serene atmosphere. This is a religiously significant site for muslims as it is the resting place for one of the prophet's senior companions.The area has a tranquil beauty and although the site is undergoing restoration currently it is worth a visit.One can combine it with a visit to the Pierre Lotti cafe, which is just up the hill from here."
        }, 
        {
            "index": 321, 
            "rating": "5", 
            "review": "Spiritual center of Istanbul. Eyup Sultan Mosque offers a mini taste of Medinah with its spritual atmosphere. There are many nice local resturants nearby. A must for muslim visitor and a gem for orientalists. You can get there with a nice walk from Eminönü or using the Golden Horn boat ride or taxi."
        }, 
        {
            "index": 322, 
            "rating": "3", 
            "review": "A nice trip up the Golden Horn. We took the ferry up the Golden Horn to visit this mosque and then the cable car up the hill to the café, which was quite exciting, with excellent views at the top. We then walked down and caught a bus back."
        }, 
        {
            "index": 323, 
            "rating": "4", 
            "review": "Well worth a visit. If you are collecting mosque visits this is one that you shouldn't miss. Set well away from the main sights of Istanbul in a conservative Muslim area it has more atmosphere and authentic appeal than its more famous blue cousin. The area round about is packed with atmosphere and with locals. And you can reach it with a very pleasant sail up the Golden Horn on the Eyup ferry."
        }, 
        {
            "index": 324, 
            "rating": "5", 
            "review": "Go out of town and visit. Personally I think that this mosque is far more beautiful than Sultanahmet. It is a \"local\" mosque as well as attracting people from all over the city. But it has that \"non-tourist\" feel that is now lacking in the Blue Mosque. Eyüp itself is a calm and welcoming place and this can also be combined with a trip to Pierre Loti via the funicular for one of the best views in Istanbul"
        }, 
        {
            "index": 325, 
            "rating": "5", 
            "review": "History amidst natural beauty. We took the ferry to the mosque and enjoyed an excellent view of Istanbul along the way. The mosque itself is in a green, hilly area outside the serious traffic of the city so the neighborhood is worth a trip in itself. The mosque is both gorgeous and holy; plus, even though it is still a working mosque, it is welcoming to respectful visitors. The adjoining cemetery is a must-see as well. Walk up and have a coffee at the top. It's a good hike, but there is also a cable car up. You could have lunch up there or down below in the mosque neighborhood, which has excellent restaurants—we are at Sadabat Kebap and enjoyed the usual amazing Turkish food. All in all, a wonderful day."
        }, 
        {
            "index": 326, 
            "rating": "5", 
            "review": "religious site. If you're muslim then this site is holy due to the person buried here. great atmosphere. lots of reverence. there is a tradition that before young boys are circumcised they are brought here all dressed up in finery to received blessings. If you're not muslim then you probably wont see the significance. we are muslim therefore we stayed there a long time."
        }, 
        {
            "index": 327, 
            "rating": "5", 
            "review": "Not touristic. I heard Eyup Sultan Mosque is one of the most important mosques for Muslimans. There were so many visitors but most of them were local people."
        }, 
        {
            "index": 328, 
            "rating": "4", 
            "review": "Historical value. A pretty little mosque located off an attractive plaza. It's more interesting for its historical significance (on the the Prophet's companions is buried there) than for its artistic merit."
        }, 
        {
            "index": 329, 
            "rating": "4", 
            "review": "Peaceful Place. Away from the crowded site of Sultanahmet area, this is a nice getaway.But, I would appreciate if the information in the mosque be written also in English..The bazaar around the small town were worth looking at!!"
        }, 
        {
            "index": 330, 
            "rating": "5", 
            "review": "Second Great Camii. We we're there twice and very nice Camii not so big but very old historical Camii everyone has to go there visit that Camii..."
        }, 
        {
            "index": 331, 
            "rating": "3", 
            "review": "Religious shrine. This is a revered place of pilgrimage for Muslims at the foot of the cemetery leading down from the Pierre Loti viewpoint."
        }, 
        {
            "index": 332, 
            "rating": "5", 
            "review": "Don't miss the mosque nieghborhood. One of the mosques I would have regretted not being to ... very nice from inside and ouside, not as decorated as the other mosques in the Istanbul but still has got it's unique feel. Spend some time walking into the streets next to the mosque for an unbeatable experience."
        }, 
        {
            "index": 333, 
            "rating": "5", 
            "review": "The most sacred place in Istanbul. The mosque was built to honor Eyup, the Islamic conqueror of Istanbul. His tomb and some other companions are buried in the mosque complex. Compared to other mosques, there seem to be more worshippers seen inside."
        }, 
        {
            "index": 334, 
            "rating": "5", 
            "review": "quiet and wonderful. you can visit this place by taxi as no available metro , nice and wonderful , you will also visit the nice shops and bazaar around then go to pierre loti cafe"
        }, 
        {
            "index": 335, 
            "rating": "4", 
            "review": "Tomb under resortation when visited. The Eyüp Sultan Mosque is sacred place as it holds the remains of Abu Ayyub al-Ansari, the companion and standard bearer of the Prophet Muhammad. As part of the Arab Army during the first attempt of the conquest to capture Constantinople he was killed during the action and was buried here. You will not find all that many tourist visiting even though it is close to the center of Istanbul. Unfortunately on my visit on the 13th March, the tomb area and outside wall was undergoing restoration. You can see the tomb through a glass window and the facade of the tomb which is covered in Iznik tiles was all covered up. The main mosque is still open for pray and visitors.There is public transport to Eyup from Eminonu including ferry or bus. We opted to go via taxi and it was only 12TL."
        }, 
        {
            "index": 336, 
            "rating": "5", 
            "review": "The mosque is located next to Pierre Lotti Hill. Pierre Loti was a French writer, who was called a \"Turkholic\", according to story he was in love with a Turkish girl living near this area, and therefore he used to visit this cafe every so often, that's why Turkish people called this hill after him.The mosque is located at the utmost upper corner of Eyup District and Golden Horn, one can take great shots from this point."
        }, 
        {
            "index": 337, 
            "rating": "4", 
            "review": "A moving experience. Hazrat Abu Ayyub Al Ansari (RA) also known as Eyup Sultan in Turkey was a very impotant companion of Prophet Muhammad (PBUH) and also my ancestor. Visiting his mazar to recite fatiha and see the masjid was a very moving experience. This is also the place the Sultans used to come for their coronation. A must go for the spiritual tourists."
        }, 
        {
            "index": 338, 
            "rating": "4", 
            "review": "Cute. I just went out of necessity but it was not really one of the more exciting places. I wouldn't call it a must-see but when in Istanbul you may as well."
        }, 
        {
            "index": 339, 
            "rating": "4", 
            "review": "Spiritual site with wonderful ambience. This is one of the holiest sites for Muslims from this part of this world. The mosque and its surrounding neighbourhood is a hive of activity with a lot of local flavour. There was no busload of tourists and you get to observe rituals and activities associated to the holiness of the site. Many Muslim pilgrims came to pay respect to Eyup Al-Ansari's tomb. The praying area was full and we did not get the chance to see the interior. We met a smiling boy who was dressed up as a young Sultan as part of his circumcision ritual. Have a walk around the bazaar outside the mosque and take in the sights and sounds of day to day Istanbul. Don't forget to try a Turkish beverage, popular during winter, called Boza (fermented wheat served with cinnamon and roasted chickpeas)"
        }, 
        {
            "index": 340, 
            "rating": "5", 
            "review": "spiritual old mosque. We went to this spiritual old mosque with family.I liked it too much for its old architecture and lovely atmosphere.Many muslim people go there as pilgrims.There are many shops around."
        }, 
        {
            "index": 341, 
            "rating": "5", 
            "review": "so great place. we went to it using boat from eminunou to the mosque then telefrique to perlotti coffee really the location is so nice and I would like to stay long time in it and around the mosque down from telefrique there is shops with nice prices"
        }, 
        {
            "index": 342, 
            "rating": "5", 
            "review": "very historical place. Loved the whole atmosphere there, very peaceful loving. Many of the locals love visiting this place. Tourists try to avoid Fridays/Saturdays, very busy place. Taxi ride from Old Town (Sultan Ahmet) took approx. 20 minutes."
        }, 
        {
            "index": 343, 
            "rating": "5", 
            "review": "very spiritual. there are works going on the at the moment. the mosque and surrounding areas are worth a visit. make sure you have few hours to spare to explore the area."
        }, 
        {
            "index": 344, 
            "rating": "5", 
            "review": "The best one. This my favourite mosque in Istanbul, take a walk and enjoy.\nIt is also great at night...but we got lost when we where going to other site because there is almost non city light in little streets around."
        }, 
        {
            "index": 345, 
            "rating": "5", 
            "review": "Beat of the best. What to say about this no word.Best nice little far aweay from the centar but take a bas and go to see a mosqe its unike no word to say."
        }, 
        {
            "index": 346, 
            "rating": "4", 
            "review": "go to the pierre lotti hill for the view, the mosque for the history. tips: go to pierre lotti hill to enjoy panoramic views of istanbul. u can even see hagia sophia on a clear day. walk down by the cemetery to eyup sultan mosqueeyup sultan is probably the holiest mosque in turkey. contains the tomb of one of the Prophet's Companions. the tomb itself is under renovation but its to be in the presence of an important person in Islam. the mosque is very historical as this is where the sultans conducted their version of a coronation. the mosques is beautiful. simple interioirs with arabesque and flowery designs on the dome. the mosques feels transparents due to many windows there. u can reach here from the pierre lotti hill (great view and pastry) and walk past a cemetery when people where buried as old as the 1600s to just last year."
        }, 
        {
            "index": 347, 
            "rating": "5", 
            "review": "Eyup Sultan Camii. Another great place to visit if you like to see another \"face\" of Istanbul: a face that is more traditional, a place where all women are covered and alcohol is not allowed at the nearby restaurants. When we visited this neighbourhood, we also covered our heads out of respect for the religious feelings of the locals. We had the great chance to see two little boys wearing their costumes after their circumcision. We had lunch at a nearby kebap-house that was full of turkish families enjoying their food."
        }, 
        {
            "index": 348, 
            "rating": "4", 
            "review": "Spiritual Visit. The mosque was modest but very spiritual. Visitors silently said prayers at the tomb of prophet's companion Saidina Ayub r.a. The surrounding area was full of shops. We cut short our visit because there were many beggars around."
        }, 
        {
            "index": 349, 
            "rating": "5", 
            "review": "Outstanding trip. This mosque is well worth the hassle of travelling away from the main tourist drags in Istanbul, as much for its surroundings as the building itself. Because the mosque has historic connections with a companion of Muhammad, it is a site of pilgrimage and is visited predominantly by locals and devotees. Just outside, is a lovely marble square with places to sit, eat and drink, and it has a very traditional feel to it. The interior is plain and lacks outstanding sights, but has a feeling of calm and spirituality difficult to find in the bigger mosques frequented by tourists. The easiest and most enjoyable way to get there is by the hourly ferry from Eminönü or Karaköy, as the mosque is only 5-10 minutes walk from the terminal."
        }, 
        {
            "index": 350, 
            "rating": "5", 
            "review": "Excellent experience. We passed by this mosque spontaneous after visiting Pierre Lotti. Really interesting visit with very few tourists. Explore a bit the alleys outside the mosque, there's a place that sells sheep."
        }, 
        {
            "index": 351, 
            "rating": "5", 
            "review": "A holy treat. Oppurtunity to pay tributes to one of the Companions of the Holy Prophet (Sallallahu Alayhe Wasallam) is a spiritual experience. The complex is small yet nicely maintained by the Turkish government."
        }, 
        {
            "index": 352, 
            "rating": "5", 
            "review": "a must see!. The Eyüp Sultan Mosque is the holiest site in Istanbul and one of the most sacred places in the Islamic world."
        }, 
        {
            "index": 353, 
            "rating": "5", 
            "review": "Holy and Brilliant. The tomb of the renowned Companion of Prophet Muhammad (PBUH) Hazrat Ayub Ansari, at whose place the Holy Prophet (PBUH) first stayed when arriving in Medina. You can say prayer at the mosque and at the outside wall of the grave and the tomb. no collection of sand or nudging on the walls etc is allowed.. Only silent prayers of peace."
        }, 
        {
            "index": 354, 
            "rating": "5", 
            "review": "Beautiful Indeed!. Another mosque that is definitely worth making the trip to see. This is one of the oldest mosques and sits at the hills of the Golden Horns Cable Cars.I would also suggest that you take the ride up the cable cars and then walk the streets of Eyup. You'll be very pleased."
        }, 
        {
            "index": 355, 
            "rating": "5", 
            "review": "highly recommended. this is a v very important place for Muslims and those exploring history and religion. The grave of the companion of the Prophet Mohammed [PBUH] is probably the holiest shrine in Istanbul. There is little English writing around this site so do your research prior to the visit."
        }, 
        {
            "index": 356, 
            "rating": "5", 
            "review": "OUT OF THE WAY - BUT KEY. Go here to understand Eyup Ensari's part in Islam, assuming you have a good guild. Great example of Iznik tiles. Cemetery surrounding filled with great stories. Yup, depends on guide. Take the walk up to Pierre Loti Cafe. Uphill all the way, but worth the view."
        }, 
        {
            "index": 357, 
            "rating": "5", 
            "review": "Great Quite Corner. If you like to spend time relaxing without noise like Taksim, I highly recommend to go to Eyup Dis. its so quite with nice gardens and fountains, great place for Shisha"
        }, 
        {
            "index": 358, 
            "rating": "5", 
            "review": "A great Sahabi (R.A). The mosque is besides the tomb of Hazrat Ayub Ansari (R.A) a great Sahabi. The camel of Prophet Muhammad (PBUH) stooped in front of the house of this Sahabi when the Prophet Muhammad (PBUH) migrated from Makkah to Madinah. The Prophet Muhammad (PBUH) stayed at his place then.The bazar and sitting area besides the mosque and tomb is very nicely kept by the management and is very good for sitting and enjoying the place. It also offers a quite a few restaurants for nice traditional food."
        }, 
        {
            "index": 359, 
            "rating": "5", 
            "review": "Atmoshere excellent,people friendly. The moque is wonderful.However the area here is just excellent.Spent an evening here.The shops in the area around here are cheaper than sultanahmed and people are very friendly.We took the cable car up to Pierr Lotte and the view from there is stunning.P.S The tram does not stop here,so we went to main bus station in Eminunu and took a bus to get here."
        }, 
        {
            "index": 360, 
            "rating": "3", 
            "review": "is not the greatest sight. is not the greatest sight , but has a lot of great shopping to do on the main street , and yeah there is a Very nice View on the top of the hill at the restaurant ,,,,,, But cost a lot of cash to drink and eat...."
        }, 
        {
            "index": 361, 
            "rating": "5", 
            "review": "More than a mosque. Best way to reach here is to first visit Miniaturk in the morning. Spend 2-3 hours there. Walk into the nearby waterfront. Hire a 3-4 seater power boat to Eyup Sultan. These boats go only there and nowhere else. This short ride is very enjoyable.We were guided to this by Aaamir, manager of Divalis Hotel, for which we are thankful to him.The place is named after Ayub Ansari, a companion of Prophet Mohammed(pbuh), who is buried here and a huge mosque attracts lots of visitors. There is a cable car station nearby to take you uphill for a enjoyable sight of the great city from mountain top. One side of the mountain is a grave yard with neatly built grave stones with names engraved. Cable car is very popular with tourists hence be prepared to que up for an hour or two to get your turn."
        }, 
        {
            "index": 362, 
            "rating": "5", 
            "review": "HONORED BY ALMIGHTY ALLAH. It was a honor given to me and my wife by the Almighty Allah to recite Fateha and spent whole day at the Tomb and Mosque .Probably one of the most spiritual places in istanbul where the eyup sultan mosque is adjoined with the tomb of the great companion of the prophet is buried. A once in a lifetime opportunity to do pay respects and do Fatihah at the tomb. Unfortunately the tomb itself Is currently closed due to renovations so can't wait to come back once complete. The surrounding Area is buzzing with locals and shopping for Islamic art is much cheaper here. We got a taxi (40 L) from the President Hotel, Beyzit which dropped us right outside the mosque. Taxi Drivers r like taxi drivers all over the world so what to comment .May Allah gives us againa chance to be at the tomb . there is a peace for me .Ameen"
        }, 
        {
            "index": 363, 
            "rating": "5", 
            "review": "Great spiritual experience. Visiting the tomb and cami of Ayub al ansari was a truly spritual experience. the view from pierre lote via canle car is awesome . Experienced a truly turkish way of life at the cami"
        }, 
        {
            "index": 364, 
            "rating": "5", 
            "review": "amazing spirituality. buried here is the host of Prophet Muhammad, enjoy the spirituality of this mosque and also number of shops to purchase islamic gifts, also in the vicinity are graves of other famous companions of prophet Muhammad"
        }, 
        {
            "index": 365, 
            "rating": "5", 
            "review": "Amazing, spiritual, a taste of authentic istanbul!. Probably one of the most spiritual places in istanbul where the eyup sultan mosque is adjoined with the tomb of the great companion of the prophet is buried. A once in a lifetime opportunity to do pay respects and do fatihah at the tomb. Unfortunately the tomb itself Is currently closed due to renovations so can't wait to come back once complete. The surrounding Area is buzzing with locals and shopping for Islamic artefacts is much cheaper here.We got a bus (3l each) from the station at emoinou (galata bridge) which dropped us right outside the mosque. Got the bus back as we'll....takes 25mins only.....make sure you get a local to pay for your bus fare on their swipe card as the bus won't take cash although our driver let us on."
        }, 
        {
            "index": 366, 
            "rating": "5", 
            "review": "splendid view from the cafe. Nice place with a fantastic view over the Golden Horn. You can take the cable car up and the walk down through the cemetary."
        }, 
        {
            "index": 367, 
            "rating": "5", 
            "review": "must see!. Lots of history behind this mosque. Very old building and the architecture is stunning. Very near Golden Horn, so 2 sights for the price of 1 taxi ride!"
        }, 
        {
            "index": 368, 
            "rating": "4", 
            "review": "Second Most Favourite Spot in Istanbul. I've been in Istanbul for about two months now and this is my second favourite spot I've visited so far. It's a very relevant, beautiful spot that's quieter than other tourist sites. Situated at the end of Golden Horn, it's a nice ferry ride to get there, once you arrive at the Eyüp Dock just follow the crowd across the street and you'll find it, gleaming white and somewhat magical!"
        }, 
        {
            "index": 369, 
            "rating": "4", 
            "review": "Important site. Very important mosque to be ,in fact it is considered one of the most important spot for Muslim visitors who are coming to Turkey from all over the world visited then have a cup of authentic turkish tea at pierre lotti cafe on top of the hill to get a magnificent view of the golden horn at sunsetA must visit"
        }, 
        {
            "index": 370, 
            "rating": "5", 
            "review": "Peaceful.. Very historical place for Muslims.Plenty of places to eat and lots of shops nearby selling all sorts."
        }, 
        {
            "index": 371, 
            "rating": "5", 
            "review": "Eyup Cami. Great place to explore the cultural costumes. We went there on a Friday and saw people celebrating and praying. The location is beautiful viewing the golden horn. We were luck to watch a turkish band playing old turkish songs free to the public."
        }, 
        {
            "index": 372, 
            "rating": "5", 
            "review": "very pleasant experience. like the place, the buildings, thearrangements & areas around\ndislike accessibility via public transport is not easy"
        }, 
        {
            "index": 373, 
            "rating": "5", 
            "review": "Excellent. I loved it in here. It takes time to come here but the visit is entirely worth it. Lovely feeling there. So spiritual, such an important place in Islamic history."
        }, 
        {
            "index": 374, 
            "rating": "4", 
            "review": "Eyup, The Telefrik ascent and a Meal. Eyup's magnificient location is an attraction that most tourists miss.The high location gives an opportunity to see a breathtaking view of the golden horn.Go up using the Telefrik, and down walking to catch the pleasure of walking a semi-jungle.Have a meal in the restaurant up the heights, the food is OK.If you are lucky, you can see the two engine 8 seat biplane which has been taking passengers to Bursa for decades, just skidding and taking off. Another suggestion for a trip to Bursa, but that's another story.walid"
        }, 
        {
            "index": 375, 
            "rating": "5", 
            "review": "most revered mosque... at this most historic mosque lies buried, in its precints, perhaps the most revered and historical Islamic personality, Hazrat Ayub al Anmsari whom the Beloved Prophet Muhammad, peace be upon him spent seven months withTherer is a huge clamour to see the grave of this most Noble Perssonality but a trip there especially to make duaa (lieft hands in prayer) is a must!!!"
        }, 
        {
            "index": 376, 
            "rating": "5", 
            "review": "Historical site of the grave of Abu Ayub Al-Ansari. The mosque was built later but the location originally serves as the grave of Abu Ayub Al-Ansari. This is a place to visit simply to give salam and pray for the soul of a companion of the Prophet Mohammed (Peace be upon him). The mosque is of course lovely to see and the area outside the mosque which is enclosed by the mosque on one side and the bazaar on the other side is very nice."
        }, 
        {
            "index": 377, 
            "rating": "5", 
            "review": "Eyup to get to Pierre Lotti. I went to Eyup Mosque from Eminonu by the ferry which takes about 40 min to get to the famous cafe Pierre Lotti, as soon I got from the ferry I crossed the road to the Eyup Mosque square it has a few stalls which sells souvenirs and some local gifts. The easy way to get to the cafe is the stairs behind the cemetery and the views are really outstanding when you get to the top."
        }, 
        {
            "index": 378, 
            "rating": "5", 
            "review": "the best way to get there. From Eminonu tram station walk toward the Calata bridge pass all the boat fish hotel then pass the bus stand keep on the shore of the golden horn and you reach the Sehir Haltari Koshk it coast around TL2 on your Istanbul Kart by ferry check their timings, the Mosque is the forth holiest place for Muslim Turks after Mecca , Medina and Jerusalem..very peaceful and spiritual site, You may in counter some little boys dressed in white like a sultans on their way for circumcision or a newly married couple in their wedding outfits , or newly born babies to get blessed..must to see, then 3 min walk and catch the chairlift to Pierre Loti Café other TL2 on your Istanbul Kert and see Istanbul from the top hill and enjoy tea in its cafe.."
        }, 
        {
            "index": 379, 
            "rating": "4", 
            "review": "Small and busy. This place was crowded. The tomb of the sahaba is at this mosque, but was being restored while we visited so there wasn't much to see. My husband enjoyed the prayer that he attended there and the surrounding neighborhood was nice to walk through."
        }, 
        {
            "index": 380, 
            "rating": "5", 
            "review": "Sultan Mosque. Was lost for words at the beauty they had that many centuries ago. It is amazing the intricate patterns and mosiac tiles coloura are mind blowing a must see."
        }, 
        {
            "index": 381, 
            "rating": "5", 
            "review": "Dawn Prayers - beautiful at this mosque. Espescially beautiful if you can be ther for dawn prayers - all the birds join in with a dawn chorus"
        }, 
        {
            "index": 382, 
            "rating": "5", 
            "review": "Nice history. This place really contain historical value very much. Besides for the sightseeing place, this is the place for pilgrimage."
        }, 
        {
            "index": 383, 
            "rating": "4", 
            "review": "Pretty mosque, some construction now (July 2013). This is a pretty mosque which is easily included in a trip to see Chora. I'd pop by on the way to the Pierre Lotfi cafe."
        }, 
        {
            "index": 384, 
            "rating": "3", 
            "review": "A Golden Horn ferry trip to Eyup. We caught the local ferry and sailed up the Golden Horn to Eyup and the Sultan Mosque. The day we travelled there it appeared to be a local festival or day of religious importance. It was very busy with local people and a service was taking place when we were there. We were therefore unable to enter the Mosque and withdrew so that we did not disturb the celebrations. The exterior is in keeping with other Mosques. Eyup is a district different from the historical centre of the city. It has a 'holiday' feeling about it and the area is obviously by the inhabitants of Istanbul. It is well worth the (very cheap) ferry trip which we paid for using our Istanbulcard."
        }, 
        {
            "index": 385, 
            "rating": "5", 
            "review": "Inspiring. Went to the Eyup Mosque during Ramadan. It was crowded but just lovely. You can peek into one of the windows and see the tomb of Eyüp Sultan. It's a must see in my opinion. You can then walk up to Pierre Loti for a tea and enjoy the beautiful view overlooking Istanbul."
        }, 
        {
            "index": 386, 
            "rating": "5", 
            "review": "Worth the travel out of the \"city\" and the price is right. This was our first Mosque and loved that is wasn't one of the tourist ones - it was free! This active Mosque has a very interesting cemetery and Ottoman-style streets nearby. There was a religious celebration for young boys while we were there that was informative. There is a cable-car also that affords a most beautiful view of the city and takes you up to a cafe where you can get in the shade and enjoy a cup of tea."
        }, 
        {
            "index": 387, 
            "rating": "5", 
            "review": "so far. it's so far from old city and crowded on friday. after your visit to mosque take a turkish tea at pierre loti coffee house. it's just above the mosque with a beautiful scenery. also don't forget to hop on cable car for more beautiful view."
        }, 
        {
            "index": 388, 
            "rating": "4", 
            "review": "To observe the religiosoty life in Istambul. Not only for the Eyüp mosque but for the neighbouthood named the same, the visit of Eyüp mosque is maybe one of the most realistic visit in Istambul area as this neighbourhood is very populous. The mosque is entirely used by the Istambul people as the sacred place it is and for that reason you will not find tourist annoying with their fault of respect or taking pictures anywere. You can see the families celebrating the Sünet ceremony and the just married brides sharing sugar with the people. This corner of Istanbul is undoubtedly the most religious emanating place. for those who like to go out of the massified circuits."
        }, 
        {
            "index": 389, 
            "rating": "4", 
            "review": "The most preserved mosque in Istanbul. This is the mosque where the burial of Sultan Eyup is locate., It's a small mosque with wonderful Islamic design and I think this is the mosque that had the mark of the Prophet's footprints here but when we went there it was closed. Very close by is Pierre Lotti Cable Rides which is 3 minutes walk from this mosque. On the downside, I feel the place hasn't been looked after properly or not properly maintained but still it is worth a visit for sure."
        }, 
        {
            "index": 390, 
            "rating": "3", 
            "review": "Pierre lotti Cafe in Eyup was amazing. A picturesque spot where u can enjoy a historical small cafe & enjoy the view of both sides of istanbul"
        }, 
        {
            "index": 391, 
            "rating": "5", 
            "review": "A well attended camii.. This is one of the camii's that is always full. This area is the resting place of Hz Ayub Ansari...a prominent Sahaba and the flag bearer of the prophet Mohammed (SAW). It was amazing to see people come here from all over. Especially seeing an endless stream of newly weds coming for a blessing. Everyone including the local stores were very friendly and welcoming. I spent an evening there with the family and thoroughly enjoyed it. Well worth the visit."
        }, 
        {
            "index": 392, 
            "rating": "5", 
            "review": "A special and unique mosque. In contrast to the jingoism of Fatih mosque (the \"conqueror's\" mosque), this is a place for happy occasions (circumscisions, weddings) and for those with a need, the sick. All sorts of people come here, and there's a bit of a festive atmosphere outside. Inside, because people with all sorts of needs come here, people are especially helpful and accomodating, even if you're not religious."
        }, 
        {
            "index": 393, 
            "rating": "4", 
            "review": "Must visit. The mosque is a beautiful place to visit. It's is one of the most amazing buildings in Istanbul. Before you enter buy some seeds to feed the doves. Kids will absolutely love it!! After you finish your tour I recommend going on a telepherique to the Pierre Loti cafe which offers panoramic views over the Golden Horn.. Really nice."
        }, 
        {
            "index": 394, 
            "rating": "5", 
            "review": "Beautiful place to visit. A must to visit because of its history. Eyup Sultan Mosque, is where a companion of the Prophet Muhammad (pbuh) is buried, around 1400 years ago. It holds amazing value and esteem and should be visited"
        }, 
        {
            "index": 395, 
            "rating": "5", 
            "review": "Get off the beaten path.. Enjoy the ferry ride up to Eyup and visit the small town which is a magnet for pilgrims. The people watching is fantastic, as is the tram ride up to an coffee stop with a magnificent view."
        }, 
        {
            "index": 396, 
            "rating": "5", 
            "review": "Fantastic. Highly recommended to take the Golden Horn Ferry to Eyup and then visit this shrine as well as take the cable car to the top of the hill (it's then best to return to the mosque by walking back down through the very interesting cemetery as opposed to dealing with the long return lines for the cable car). The shrine itself was our favorite mosque in Istanbul and the surrounding market stalls offer better prices than elsewhere in Istanbul."
        }, 
        {
            "index": 397, 
            "rating": "4", 
            "review": "Very important place for devout Muslims. It is very important Camii and a burial place of Sultan Eyup who was a standard barrier and Prophet's companion in early Islamic wars. This Camii has been recently restored to its early glory."
        }, 
        {
            "index": 398, 
            "rating": "3", 
            "review": "A very normal mosque. You can visit this mosque when you are going to \"Pier Loti\" hill. The mosque itself has nothing interesting for a normal visitor unless you didn't see Blue mosque, Suleymanih mosque or Fatih mosque. but the area around the mosque is very nice for eating, drinking and more than that buying some gifts for your family and friends. Prices are more fare in this area.So, after coming down from the Pier Loti hill it worth to take a look at old Bazar in front of Eyup sultan mosque."
        }, 
        {
            "index": 399, 
            "rating": "5", 
            "review": "very peaceful. we went at night and people were praying and were giving people some suits celebrating the first days of receb . there were lot of restaurants and shops near by we spent a nice time exploring that nice area"
        }, 
        {
            "index": 400, 
            "rating": "4", 
            "review": "Missing hints. Every time I visit that osque and pray in I find carpets smellyThe second point is the staff advising ladies to cover their heads and do not care their bodies , arms and legs are naked.The right thing is to show them the proper dress by pictures and do not allow violations as we do in Opera ( formal dress only). When you are ready you are welcome and if not you can only enjoy from outside ...."
        }, 
        {
            "index": 401, 
            "rating": "5", 
            "review": "Very nice Mosque/Art. The plan of the building is basically that of an octagon inscribed in a rectangle. The main dome rests on four semi-domes; not on the axes but in the diagonals of the building. The arches of the dome spring from four octagonal pillars— two on the north, two on the south— and from piers projecting from the east and west...\n\n\nMore  "
        }, 
        {
            "index": 402, 
            "rating": "4", 
            "review": "Abu Ayoub Al ansari Mosque. A mosque and a tomb of the Abo Ayoup Al ansari where burred. The cable car is near and take you up the mountain to a good prize restaurant with a wonderful view to the golden Horn"
        }, 
        {
            "index": 403, 
            "rating": "5", 
            "review": "A nice excursion. Take the local ferry out to Eyup from Eminönu and walk over to the mosque. It is not a touristy place but an important place of pilgrimage to Moslems and was beautiful inside. It was well worth the short journey away from Istanbul city centre and the town itself is interesting as a local area with very few tourists."
        }, 
        {
            "index": 404, 
            "rating": "5", 
            "review": "A very holy place. My Algerian husband explained that this Mosque, the burial place of one of the prophet Mohammed's companions, is considered the fourth holiest place in Islam. It is a much simpler style mosque than the Blue Mosque but still very beautiful. There were stricter rules in place as far as covering shoulders, legs and of course heads but that is to...\n\n\nMore  "
        }, 
        {
            "index": 405, 
            "rating": "5", 
            "review": "Very beautiful and in one of the last traditional neighborhoods. I visited the Eyup Sultan Mosque one afternoon and was encouraged by Turkish women to climb the stairs to their section above the main room. I had a scarf with me so there was no problem and I removed my Tevas. It was one of the best experiences I've had in Turkey and matched my friend's description of the beautiful...\n\n\nMore  "
        }, 
        {
            "index": 406, 
            "rating": "4", 
            "review": "Nice Mosque. the design and the architecture of this mosque is really wonderful..it is not a very big mosque but worthy to visit."
        }, 
        {
            "index": 407, 
            "rating": "5", 
            "review": "quite beautiful mosque. This is the one of my favorite mosque in Istanbul. the location is a little faraway from Sultanahmet area, I went to there by bus, it takes about 10min by bus. and I returned by ship. Many women visited there, more than another mosque. very quite, and very cozy place."
        }, 
        {
            "index": 408, 
            "rating": "5", 
            "review": "Don't miss it. This mosque is one of the most important for Muslims. The place is very popular because it was raised close to the place where the standard-bearer of the Prophet was buried. His name was Abu Ayyub al-Ansari, but his Turkish name is Eyup Sultan.\nThis mosque is a pilgrimage place, so you will see many people and many of them...\n\n\nMore  "
        }, 
        {
            "index": 409, 
            "rating": "5", 
            "review": "Is a mosque - have proper clothes. No bathing dress..\nThey might ask you to leave and come back In between prayer times. So go for a snack, plan a second thing to do instead of visiting a mosque. The sultans palace f e will easily take you several hours because there is so much to see not only the harem :-)"
        }, 
        {
            "index": 410, 
            "rating": "5", 
            "review": "Amazing peace. Went there with few friends to offer Fateha.\nSmall, clean ....not crowded but soooooo peaceful.\nA few renovations were going on but trust me you can feel the energy from that place.\nI wanted to just stay there but had to catch up with my other friends.\nI don't know why but I had goose bumps while I was there....\n\n\nMore  "
        }, 
        {
            "index": 411, 
            "rating": "5", 
            "review": "Go on a Sunday if you can. We were disappointed that the renovation work meant that some of the mosque was closed. But it is really worth going to. Visit some of the cemeteries that surround it. And do go on a Sunday, when the place is teeming with little boys dressed up in amazing costumes and visiting with their families before going to be circumcised."
        }, 
        {
            "index": 412, 
            "rating": "5", 
            "review": "Must Pay A visit. For muslims if you r going to istanbul you must pray Fatiha at Hazrat Ayyub R.A grave who was the companion of Hazrat Muhammad S.A.W.W."
        }, 
        {
            "index": 413, 
            "rating": "5", 
            "review": "Under Construction. The facilities are undergoing refurbishment. The construction does not seem to bother the locals who continue to flood the Mosque. The grave is visible through a window and the mosque remains open."
        }, 
        {
            "index": 414, 
            "rating": "5", 
            "review": "A fantastic alternative to the Blue Mosque. Whilst in Istanbul we visited several Masjid (mosque) to attend the daily prayers. What I loved about this particular Masjid was the friendly family atmosphere that surrounded the whole place. For those that don't know, this Masjid acquires its name from one the companions of the Prophet Mohammed (peace be upon him) Eyup Sultan lived in Medina at the time when the Prophet entered the city and he rested at his house. Eyup Sultan's burial place sits across the courtyard and although currently undergoing renovation the whole area was teaming with local visitors paying their respect.If you can try and visit at Sunday lunchtime when unlike other Masjid's at prayer times this place is full with the courtyard being utilised as well .There are also the resting places of other companions within a short walking distance which we also visited. All in all a fantastic afternoon for delving into some Islamic history."
        }, 
        {
            "index": 415, 
            "rating": "5", 
            "review": "space of a MIRACLES. Have you ever felt a smell of a miracle?if not, go to the Eyup Sultan Mosk. it's in the air, everyone is in mood of meeting miracle..."
        }, 
        {
            "index": 416, 
            "rating": "5", 
            "review": "Must see!. A holy place indeed...Calm & soothing. The shops around have good traditional stuff with reasonable prices. Good restaurants, not expensive either. Just go to Iminuno station & take the Sultan Eyup autobus.. you will love it I promise :)"
        }, 
        {
            "index": 417, 
            "rating": "5", 
            "review": "Beautiful mosque. After a while, the gorgeous mosques in Istanbul run together, but this is definitely a lovely one, and Eyup is a pretty little village/suburb, not hard to get to by bus. If you like history, read Roger Crowley's book on the final siege of Constantinople and you'll learn who Eyup was!"
        }, 
        {
            "index": 418, 
            "rating": "5", 
            "review": "Beautiful. We went to Eyup to visit this mosque, it was so beautiful! There is a lot of history surrounding this, I just wish that some of the history was actually in english - nevertheless we still managed to get a translation of what was written. After the mosque we took a cable car ride to a pretty cafe called Pierre Loti - the views from the cafe was simly breath taking!! I would defo recommend a visit to the cafe after the mosque"
        }, 
        {
            "index": 419, 
            "rating": "4", 
            "review": "Must see for Muslims. If your not Muslim I'd stick to the other mosques unless you want to see a less touristy area which this seems to be, there's a small bazar area near by as well. If your Muslim its a must see it is said that auyub RA is buried here (for those who need a refresher (I did) he's the one who when the prophet sws arrived to Medina and everyone wanted him to stay with them and he let his camel decide well this his the sahabah who's home he stayed at. It is very emotional and overwhelming to think a sahaba was actually there. They have actually erected a tomb here and ppl go make dua there (I found it a bit strange but I also don't know the culture/traditions, our tour guide told us some ppl \"pray through him\" which seems shirky and others seem to just be praying for him and paying their respects)."
        }, 
        {
            "index": 420, 
            "rating": "5", 
            "review": "ok. more turkish the the other ones, really muslim atmosphere,not touristic, don't miss Pierre Loti cafè upstairs and the muslim cemetery"
        }, 
        {
            "index": 421, 
            "rating": "4", 
            "review": "A different atmosphere.... Lots of foreign muslims come here for prayer, this is where Eyup Sultan is burried. This is very different from other parts of Istanbul, a must see !"
        }, 
        {
            "index": 422, 
            "rating": "5", 
            "review": "Away from the city centre. 20 minute drive from the main Sultanahmet square. Once you reach there feels like you have come to an entirely different country. Perhaps because here is the real Istanbul. No one could utter a word of English here. Visited early morning so not much of a crowd. Restoration works were going on at the time around the grave of the companion of the Prophet. Mosque is small and pretty. Loved the fancy fountain outside the mosque. Place most definitely has a mystical air about it. There are hills of graves behind the area, looks pretty and spooky at the same time. There is also a lift here just before you enter the Eyup area which takes you up the hill. Please catch the bus back to Istanbul city centre as it costs only few liras as the taxi is extremely expensive."
        }, 
        {
            "index": 423, 
            "rating": "4", 
            "review": "Eyup Sultan Mosque. I hopped in the bus no. 99A at Eminonu port bus station, cost TL1.50 - all the way to Eyup.The mosque complex is big and inside the mosque ground is the turbesi (tomb) of Abu Ayyub al-Ansari (Eyup Sultan) - the standard bearer of the Islamic prophet Muhammad. His tomb is greatly venerated by Muslims, with a lot of visiting pilgrims. People enter and offer prayers inside the blue tiled turbesi. It is constructed in 1458 by Fatih Sultan Mehmet, along with the mausoleum. The present mosque is constructed under the supervision of Huseyin Efendi in 1800. This mosque is the holiest mosque in Istanbul and one of the Islam's sacred place. Popular story tells that while serving as commander of the Arab forces during the siege of 668 to 669, Eyup was killed and buried on the outskirts of the city. The burial site was discovered during Mehmet the Conqueror’s siege on the city, although the tomb is mentioned in written accounts as early as the 12th century."
        }, 
        {
            "index": 424, 
            "rating": "5", 
            "review": "a very peaceful spot in Istanbul. This is a very peaceful place; They say there are angels and saints watching over it, and it sure felt like it. Within walking distance is a tram to travel up the hillsite for a spectacaulr view and a glass of tea. You can use your metro card for the tram"
        }, 
        {
            "index": 425, 
            "rating": "5", 
            "review": "Special Mosque. This is a special mosque for Muslims because one of the Prophet's companion is buried there. It has a very local feel to it and not that many tourists- and if there are any, it's usually Muslim tourists. It gets really crowded inside the mosque and outside in the veranda where the companion is buried. I'd recommend going up the hill, you'll be walking alongside cemeteries, and once you reach the top, there's a little cafe and a beautiful view of the city."
        }, 
        {
            "index": 426, 
            "rating": "5", 
            "review": "great mosque. the old design of the mosque is fabulous. also it has the abo ayoub alansari radi allah 3anho kaber."
        }, 
        {
            "index": 427, 
            "rating": "5", 
            "review": "very holly place. All Muslim shoud visit this place.... amazing.. The real name of this sahabe Ebu Eyyub Al-Ensari who was the first accomdator of Prophet Mohammed S:A:V."
        }, 
        {
            "index": 428, 
            "rating": "5", 
            "review": "Beautiful holy place. Worth a visit. A holy place for muslims. Up on the hill it is a huge cemetry. Also, there is a coffe shop named pierre loti, with a wonderful view over the city and bosforus. To get there, from Eminonu you can take a bus or a ship, for a whole golden horn tour. For entering the mosque you must be decently dress and women should wear a scarf over the head. Avoid visiting on Fridays around 12 oclock, it gets crowdy because of the prayers"
        }, 
        {
            "index": 429, 
            "rating": "5", 
            "review": "Great area. It felt less holy than I expected because of kids running through the nave and the thick scent of tom cat spray, but it truly was serene, quiet and worthy of a trip. The people in the surrounds were tickled to meet Americans and we had delicious desserts and a fabulous dinner at Nearby Eyup Sultan Konagi. The cemetery and cable cars up to Pierre Lotti offered great views and a nice walk down at sunset with the muezzins call to prayer."
        }, 
        {
            "index": 430, 
            "rating": "5", 
            "review": "An absolute must. this place is one of the highlights of the city ! the village itself is nice and the mosque with its pilgrims is very impressive .You shouldn't miss the Muslim cemetery nearby on your way to the famous ( but crowded ) Pierre Loti Café.What a view from up there to the Golden Horn- unique !"
        }, 
        {
            "index": 431, 
            "rating": "3", 
            "review": "Important, but not so special.. Located near the \"muslim district\", there is plenty to enjoy outside the mosque. The mosque itself is said to be the 4th most important in the world, but for a non-muslim, and in a city with so many hundreds of mosques, hardly a required stop."
        }, 
        {
            "index": 432, 
            "rating": "5", 
            "review": "Great day trip. The mosque is filled with locals, not tourists. It feels and is 'local. Tke the Golden horn ferry that cross crosses to Horn to Eyup for 3TL,, see the mosque, then walk up the hill through the cemetery to the cafe at the top and enjoy the view. Take the funicular down. It's a great half day trip.The square has a great pomegranate jjuice guy (for 2 TL not the 8 you pay near Aya Sofia)."
        }, 
        {
            "index": 433, 
            "rating": "5", 
            "review": "quite mystic atmosphere. My friend took me to the morning prayer. I wasn't expecting that much of crowed in this early morning before the sunrise. People from all over the country were there to be blessed by one of the companions of the prophet, I was told. The lovely breakfast we had after the prayer was also a good memory."
        }, 
        {
            "index": 434, 
            "rating": "5", 
            "review": "Beautiful mosque. Take the ferry from near the Galata bridge up the Golden Horn and visit this beautiful mosque complex with astonishing tombs, enormous hillside graveyard and beautiful interior of the mosque itself. Spend time sitting in the lovely square outside watching the flow of people called to prayer come and go and sit on the upper floor of one of the restaurants overlooking the square while you enjoy a traditional lunch and refreshing tea."
        }, 
        {
            "index": 435, 
            "rating": "5", 
            "review": "More than amazing .... I don't know why this places not listed as a highly recommended place .. it's not Pierre loti and teleferik !! U must visit Ayüp sultan mosque and an area around it including small bazaar and many shops near to the mosque square which almost more than 1km on both sides ... the atmosphere there really different than the other Istanbul touristIch places which u can see the real Islamic type of Istanbul ... next to the mosque from the car road area there's beautiful sightseeing with long walking area which u can see some fisherman and beautiful green park .. in an end take the bus to eminou which more easier and faster than ferry ..."
        }, 
        {
            "index": 436, 
            "rating": "4", 
            "review": "Traditional mosque. This is a traditional mosque. Visit here if you would like to see the grave of one of the follwers of Prophet Mohammed. He guarded him and defended him. Muslims can pray here. Quite a few cats around but they are harmless. This is a brief taxi ride away from the Kariye Museum"
        }, 
        {
            "index": 437, 
            "rating": "4", 
            "review": "Eyup Sultan Mosque. The mosque was a good visit less tourists here and more locals. We went to Pierre Lotti on top of the hill, a tea garden and then wlaked through an amazing cemetary downhill towards Eyup Sultan. There were fire flies around us which almost made the experience magical. Eyüp Sultan is a very conservative part of the Istanbul."
        }, 
        {
            "index": 438, 
            "rating": "5", 
            "review": "Jump !!!. when you firstly visit the place you will jump back in history, to attend may be the ceremony of a new Sultan inauguration or the funeral of an Ottoman noble. Then you will jump back to the present for the feeling of not being a tourist surrounded by Turkish locals came to pray in the mosque and visit the shrine for blessings. It's a very lovely peaceful place with the gardens and small markets around."
        }, 
        {
            "index": 439, 
            "rating": "5", 
            "review": "Full of interesting history. the walk uphill took us through a different part of the city. The mosque was beautiful as was the surrounding gardens and cemetery."
        }, 
        {
            "index": 440, 
            "rating": "4", 
            "review": "Nice mosque, but needs some renovation. Eyup sultan was a very close companion of Prophet Mohammad.peace be upon him. I visited his tomb as well."
        }, 
        {
            "index": 441, 
            "rating": "5", 
            "review": "Great place to visit,,,,. İf you like to visit outside of the old town area ı highly recomend you visit this great Mosque and Pierloti Cafe. Great area and you see more locals..."
        }, 
        {
            "index": 442, 
            "rating": "5", 
            "review": "To See The Real Istanbul. Eyup Sultan is a place you should visit in order to see and understand what the real Istanbul is. It is the most popular place that you can see the Islamic part of the country. Beside all the modern experiences you can have in Taksim or Beyoğu, Eyüp Sultan shows you the very conservative part of the Istanbul. Eyup Sultan is the tomb of a Islamic saint who has died at the siege of Istanbul by Muslims first time. The actual corpse of the Eyüp Sultan is still missing. But the Sultan Mehmet (the conqurer of the Istanbul) saw the place of tomb in his dreams twice and ordered an mosque and tomb to be built at the place he saw in his dream, in the name of Eyup Sultan. Around the mosque there are many tombs which belong to the important persons who served Ottoman Empire. You can feel the mystic atmosphere around Eyup Sultan and have a walk to Pier Loti for a magnificent view of Golden Horn."
        }, 
        {
            "index": 443, 
            "rating": "5", 
            "review": "Out of the way. Mashallah Eyup Sultan was a spirutually enlightening place but still very busy even though away from the hussle and bussle of main centre of Istanbul. It is kept immacutley clean and best to visit early morning so to avoid rush. Has a huge graveyard on a hill behind it. Pierre Loti cable car is literally next door almost. I got a taxi from blue mosque and it should cost around 20 tl. Spectacular place and highly recommended even if you arent religious. See it for its design and a nice fountain too. Lovely atmosphere esp when couples are married as they give everyone free sweets. ?"
        }, 
        {
            "index": 444, 
            "rating": "5", 
            "review": "Full of interesting history. My wife and I visited the mosque just a few days back. She being very religious was overwhelmed with emotions. We were on a guided tour and the guide was so very patient to explain about the history behind, we could literally visualise what might have taken place all those centuries back. It was very satisfying to do a short prayer there. The mosque is quite beautiful, but it was the good feelings that we experienced while visiting is something we will always remember."
        }, 
        {
            "index": 445, 
            "rating": "5", 
            "review": "Must for all Muslims. Must see this site for all muslims. Pilgrims attending are all so nice and friendly they also share sweets with children. If you are going with family please also visit Pierre Loti Cafe and the tourist hill accessible through a sky kart."
        }, 
        {
            "index": 446, 
            "rating": "5", 
            "review": "Top tips for visiting Eyup Sultan Mosque (Eyup Sultan Camii). Why is this town not listed as a must-visit place in Istanbul? Although the Eyup mosque is highly reccommended place to visit but nobody ever reviewed about the town on tripadvisor.There are so much more Eyup can offer than just visiting the mosque. This town probably has not been explored much by the tourists except the cemetery part, Pierre Loti cafe and the mosque. We accidentally chanced upon this town just a few kilometres away from Sultanahmet and Taksim square. I am going to give you a few good insights and tips about visiting the town as well as the mosque. Tip 1: how to get there? Take a local bus number 99 from Eminonu. It cost 2 - 3 Tl (lira) per person. The ride is about 20 minutes and make sure you stop a few stops after you past the second bridge. You will need to gauge it yourself unless you have a smart phone. Don't bother taking the ferry, taking a bus is so much easier and faster. Tip 2: if you want to see the mosque, get there in the morning because the crowd seems build up in the afternoon. We went there on a sunday. Tip 3: there are also a lot of old sultans' tombs along the way to the mosque and you are allowed to enter for free but make sure you take off your shoes to enter the shrine. Tip 4: start the cemetery walking trail near the mosque where shops were selling muslim robes and holy books. Tip 5: Since this is a place that attracts pilgrimage, there is of course a shopping street too. Do not miss out on the famous savoury pastry, Turkish Borek, that is sold in the shops (See picture). Out of so many Borek shops, we chanced upon this quaint little small borek shop which sells Borek for 1.25 TL per 100 gram if i am not wrong. You cannot miss it! Tip 6: while we were walking around the cemetery area, we also found out there is a huge local market at the hilly side of the town. It is very difficult to find but if you found it, you will not regret it. You can see the everyday life of the locals here especialy the hustles and bustles. If i could give you an exact location, then it would be near the Pierre Loti cafe. See picture. Also you can find the cheapest kebab here for only 2 Tl to 4 Tl. Tip 7: you can forget about going to the Pierre Loti cafe because if you did the cemetery walking trail, you can literally see the Golden Horn from the cemetery. Tip 8: just so you know, the traffic from Eyup to town (sultanahmet or taksim) will be quite bad because the turkish seemed to come out after 3pm during the day. make sure you plan your time ahead if you are heading to the airport. If you think my reviews have been helpful to you, please click 'Yes' for 'Was this review helpful?'"
        }, 
        {
            "index": 447, 
            "rating": "5", 
            "review": "worth the trip uphill. the walk uphill took us through a different part of the city. The mosque was beautiful as was the surrounding gardens and cemetery."
        }, 
        {
            "index": 448, 
            "rating": "4", 
            "review": "a place for a prayer. After having visited the most \"touristic\" ( it means those most visited) mosques in Istanbul, this place is a real surprise. It's a holy place for muslims, built by a friend of the prophet. This mosque it's a mystic place, an island in the caotic traffic of Istanbul. It doesn't matter what is your religion...you can simply stay there in a calm and comfortable atmosphere. No tourists around.Very nice the walk up to the hill where you can enjoy a turkish tea or whatever you prefer in the Pierre Loti cafè. The view is great!"
        }, 
        {
            "index": 449, 
            "rating": "5", 
            "review": "Well worth the effort. I took the ferry from eminimu. Lovely ride up the golden horn. The mosque, one of Islam's most holy pilgrimage sites, is peaceful and open. For me, the best part of the visit was a walk uphill though the cemetery, rewarded with a tea at Pierre Poti Cafe and it's views of the Golden Horn and all of Istanbul. There's a funicular, to ease your way up or down."
        }, 
        {
            "index": 450, 
            "rating": "4", 
            "review": "Spiritual Place. We visited with a Tours by Locals Guide who gave us a great insight into this mosque. It is the holiest of Istanbuls mosques and was full of people praying to Mohommed's Standard Bearer. During Ottoman times it was where the Sultan's were crowned. A different experience from the Blue Mosque"
        }, 
        {
            "index": 451, 
            "rating": "5", 
            "review": "nice and unusual. it's a typical islamic pilgrimage spot. What to say have a look. Thake the bus 55b from taksim and stop at eyup sultan"
        }, 
        {
            "index": 452, 
            "rating": "5", 
            "review": "feel like Ottoman Mosgue. We found this mosque Advise our reception , You should give a visit! very nice mosgue in where you can smell history"
        }, 
        {
            "index": 453, 
            "rating": "5", 
            "review": "Pierre Lotti to boot. If you ever go to Eyup Sultan Camii, make sure to visit the famous Pierre Lotti Park at the peak of the mountain. You can get there by a cable car. He was a French writer in the 1800's who fell in love with a girl from the Harem and stayed on for the rest of his life."
        }, 
        {
            "index": 454, 
            "rating": "5", 
            "review": "Tomb of a Companion.. A place of religious significance. This is one of the about 28 known tombs of Prophet Muhammad's (PBUH) companions in Istanbul. Great view from the top. Great cafés and bazars nearby."
        }, 
        {
            "index": 455, 
            "rating": "4", 
            "review": "Different than other Mosques.. The area is full with worshippers. Make sure you go by cable car to Pierre Loti cafe to see a magnificient view of the Golden Horn. Make sure you visit the room in Pierre Loti cafe."
        }, 
        {
            "index": 456, 
            "rating": "5", 
            "review": "worth visiting. I liked the mosque. The is a very nice fountain outside. Oriental shopping area nearby. I went there bu Public transport; frequent buses"
        }, 
        {
            "index": 457, 
            "rating": "5", 
            "review": "islamic beliefs associated to chamanic rites at eyup mosque. This mosque contains the tomb of \"Eyup\" a companion of the Prophet Mohammed. It is very visited by Turkish people who come to pray at the tomb but also perpetuate shamanic rites before Islam around a tree.boys are brought there dressed in little prince before circumcision"
        }, 
        {
            "index": 458, 
            "rating": "5", 
            "review": "eyup sultan telephrek-indispensable tour. eyup sultan district is located beyond kostantenia old walls but it is easy to reach it from any where in istanbul. eyup sultan contains elegant old mosque of eyup anssary,several elegant old tombs,shopping centre & resturants. the resturants are highly recommended & cheaper you should take doner kepap, yemek , sutlatche or others in there.the road to the telephrek is really marvellous with concentrated smell of turkish atmosphere. the line to the telephrek is short, it takes just 10 minutes to take your roll, not like galata tower line it takes more than 60 minutes to take your roll. in eyup sultan telephrek you will see marvellous high view of istanbul.even if you stay in istanbul short time you should put this tour in your program"
        }, 
        {
            "index": 459, 
            "rating": "5", 
            "review": "a sacred site well worth visiting even if not a muslim. This is a working mosque with many visitors, it was so crowded I couldn't enter the ladies section from the worshippers inside. However, we enjoyed the outside and surrounding areas very much, not as commercial as the Sultanahmet area, definitely worth a visit. Take in the Pierre Loti cafe at the same visit."
        }, 
        {
            "index": 460, 
            "rating": "5", 
            "review": "Original , holy , traditional. This was different from the other mosques, not treated as a museum, u can tell its taken seriously by worshipers, it has a safe feeling. The area around is well kept, cemetry is actually beautiful."
        }, 
        {
            "index": 461, 
            "rating": "5", 
            "review": "Friend of the beloved prophet(pbuh). A must visit place. Prophet Eyup Sultan's tomb is near the pier loti hill. This hill is also the most expensive cemetery of istanbul as every Muslim wants to be buried near the great sahabi."
        }, 
        {
            "index": 462, 
            "rating": "4", 
            "review": "an authentic sacred site. Easy to get to by Golden Horn ferry (worth the trip in itself), this mosque is not a tourist site but rather a truly holy place for Muslims. Walking around the cemeteries and the mosque you feel as though you are experiencing something very different and more authentic than being in Sultanahmet, seeing very different people than at the major sites. Be sure to take the cable car up to the Pierre Loti cafes for the view."
        }, 
        {
            "index": 463, 
            "rating": "4", 
            "review": "Worth going. First of all if you will go there by bus you will see how big is Istanbul. It's 20 minutes by bus form Taksim Square. Mosque is beautiful outside, inside and the area around it are also interesting."
        }, 
        {
            "index": 464, 
            "rating": "5", 
            "review": "Great to see !. Great to see. An important mosque of Istanbul. Then take a walking trip to the Cable car near by and go up the hill and enjoy the view of Istanbul city while drinking a cup of Turkish coffee !"
        }, 
        {
            "index": 465, 
            "rating": "5", 
            "review": "THE WARRIOR. The companion of the beloved Prophet MUHAMMAD peace and blessings be upon him and his entire family is resting in this historical Eyup Sultan Mosque, Millions of people across the world come here and show their respect and love for the Sahaba! cant explain in words how lucky and fortunate i was to pay my respects."
        }, 
        {
            "index": 466, 
            "rating": "5", 
            "review": "Beautiful Mosque located near the Golden Horn. A historical mosque next to the burial site of where it is claimed Mohammed's standard bearer is burried. It is said that that Abu Ayyup Al Ansari died during the Arab assault on Constantinople and his tomb is venerated by Muslim pilgrims."
        }, 
        {
            "index": 467, 
            "rating": "5", 
            "review": "Host of the Prophet . Its the tomb of Abu Ayyub Ansari, who was the fortunate host of the holy Prophet when he migrated Makka and entered Madina. The tomb and Masjid is regarded and respected in Islamic history,so its worth seeing place in Istanbul."
        }, 
        {
            "index": 468, 
            "rating": "5", 
            "review": "One famous place. Buzzing with activity as a very famous place for locals as well...not so easy to get there as the Eyup ferry terminal is closed, so we took a taxi, about 30 Liras from Aksaray tram stop... The tomb of Hazrat Abu Ayyub Ansari (R.A.) a companion of Prophet (S.A.W.) is the reason to visit this place. The mosque itself is beautiful just like each and every mosque of Istanbul!"
        }, 
        {
            "index": 469, 
            "rating": "5", 
            "review": "Eyup Sultan Camii, one of my favorites. The thombe of Abu Ayyub al-Ansari (companion and colour sergant of Mohammed) is visited by many people as second important pilgrim site in the Muslim world. The courtyard is colorful, not the mosque itself. I like this place very much. All those little guys with their circumcision outfits with their families, all those different people; from the shady terrace you can see them walk up and down the large square. Maybe you can start with tea at Pierre Loti's place up the hill (Take the cable car - only 3 coins) to enjoy the view on the Golden Horn and walk down the cemetery to the Eyup Square. During Ramadan, after sundown, the square is full of people and full of the smell of tasty food!!"
        }, 
        {
            "index": 470, 
            "rating": "5", 
            "review": "Beautiful. We truly enjoyed our visit to this beautiful mosque, it also provides you an opportunity to experience different part of Istanbul."
        }, 
        {
            "index": 471, 
            "rating": "4", 
            "review": "Go to Eyup!. Eyup is worth a visit. Start with visiting the mosque and then go by foot or take the teleferik up to Pierre Lotti's cafe up the hill."
        }, 
        {
            "index": 472, 
            "rating": "5", 
            "review": "a beautiful spiritual place. I like this place a lot , around the mosque there are any many shops that sells everything souvenirs, clothes, ... U can have better price for souvenirs than in Grand bazar or Istiklal street . I bought also lot of women accessories they are cheap & wiz very good quality"
        }, 
        {
            "index": 473, 
            "rating": "5", 
            "review": "Another Great Mosque. If you did not see any mosques or did not have enough of seeing mosques in Turkey, then go and spend sometime by the Eyup Sultan Mosque and its surrounding area. There is a major cemetry and nice little shops and restaurants by the mosque. It is the most important mosque for turkish people because the name Eyup is one of the companion of the prophet Mohamed his name is Abu Eyup Al-Ansari who they believed lived and died in Istanbul. The mosque gets over crowded on Fridays and around major Islamic Holidays and the area can get very crowded.There is a Slauter House for sheeps and cows near by that can make the area smells bad, although it is covered and somewhat clean."
        }, 
        {
            "index": 474, 
            "rating": "3", 
            "review": "Not interesting .... Not one of my favorite places ... Although it my third time there but we only went the first time ... They recommended but not woooooow ... The view is not bad but if you don't have time don't goooo"
        }, 
        {
            "index": 475, 
            "rating": "5", 
            "review": "Few places like this for Muslims. It is very popular among Muslims so it is better avoid it for jews and people who don't like Islam. Wear long pans and shirt."
        }, 
        {
            "index": 476, 
            "rating": "5", 
            "review": "A spiritual place. Don't go wearing singlet and shorts. This is a sacred spot where Istanbullus come to honour their dead and to give thanks.You will also see loads of gorgeous little boys dressed up in their 'sunnet' outfits. Have a coffee at Pierre Loti Cafe - it's made properly in the smouldering ash."
        }, 
        {
            "index": 477, 
            "rating": "5", 
            "review": "tomb of the sahaba that have met the prophet Muhammad. very interesting and a must see. this is a place to visit and do prayers. feel and see with how much love the muslim do they respect to a great muslim"
        }, 
        {
            "index": 478, 
            "rating": "5", 
            "review": "mystical experience. the area is one of the most mystical districts of Istanbul. This is due the fact that many historically important figures were interred with confines of Eyup Sultan Mosque, Tomp of Eyup Sultan. The tomb is named after Ebu Eyyup al-Ensari, who was visited by Mohammed the Prophet during his first vist to Medina. Eyup sultan Moswue will attract you with its distinct atmosphere. Do not forget visi the souvenior shops after you visiting mosque and tomb."
        }, 
        {
            "index": 479, 
            "rating": "5", 
            "review": "great surroundings. I especially like the ambience around this famous mosque. It still is very original and you will not find many Tourists there but Turkish muslims love this mosque.You will find lots of ice cream shops and from here you can start your stroll throught the old cemeterey up to Pierre Lotti hill with an amazing view.."
        }, 
        {
            "index": 480, 
            "rating": "5", 
            "review": "Golden horn.. Imagine yourself sitting on top of a shady hill, sipping tasty charcoal boiled Turkish coffee under the fig trees, watching the magical sunrise glittering 'gold' over the Bosphorus waterway. And fish are jumpin' in distance in front of your eyes in Halic (the Golden Horn). Heaven on earth..."
        }, 
        {
            "index": 481, 
            "rating": "4", 
            "review": "religious place indeed !. the architecture is very interesting but the whole atmosphere of the area is very religious, there was a funeral and a circumcision party at the same time, which seemed a bit weird ! its worth visiting but dress appropriately"
        }, 
        {
            "index": 482, 
            "rating": "5", 
            "review": "Place of pilgrimage. In a quieter part of Istanbul this is special to Muslims and lots come here to pray.It is also a pilgrimage site for many Muslims"
        }, 
        {
            "index": 483, 
            "rating": "5", 
            "review": "Worth a visit, and in a beautiful area.. Off the beaten track, a lot of Turks don't even know where this is. The area is really pretty, real old Istanbul. There are two tombs of Companions of the Prophet (PBUH) nearby too."
        }, 
        {
            "index": 484, 
            "rating": "4", 
            "review": "Great place for Muslims to visit. Very spiritual place. You get the feel for Islamic Istanbul.\nAlso the shopping areas around there are much cheaper than rest of Istanbul"
        }, 
        {
            "index": 485, 
            "rating": "5", 
            "review": "Lovely. We really enjoyed visiting the mosque. It also give you an opportunity to see differnet part of the city. It was under renovation when we visited. I'm sure it will be even more enjoyable if the near future."
        }, 
        {
            "index": 486, 
            "rating": "5", 
            "review": "Excellent if you want more than a superficial look at tourist sites. The Eyup Sultan Camii is considered by Muslims to be the most holy place in Istanbul. It is the site of the tomb of one of the companions of the Prophet Muhammad. This mosque is worth a visit for those who want to see more of \"real\" life in Istanbul than just Sultanahmet Square. Because of the tomb, it is a site of pilgrimage for Muslims, and you will find both Istanbullus and people from other areas going to pay their respects. Within the mosque itself you can respectfully sit at the back (women upstairs) while people pray. The mosque has one of the largest women's sections of any mosque in Istanbul, with overflow areas when the crowds are too big for the balcony above the main section of the mosque, so for women it is easier to find an \"out of the way\" place to observe than at most other mosques. Because families come to the mosque together, there are usually mothers with young children in the women's area, and as a result, it's an interesting place to see how families manage their religious observance with their kids.The tomb is located across the courtyard from the main entrance to the indoor section of the mosque. When it is not under renovation, the tomb is open for visitors, and there are generally a lot of people inside praying. The veneration of Eyup Sultan is not technically orthodox in Islam, and as a result the sharp observer can see some of the differences between orthodoxy and \"folk\" or \"popular\" practices in Islam. Every religion has these, but they are often hidden to outside observers. This mosque is a good place to go to see the juxtaposition of orthodox and popular Islam.The mosque can generally be reached by bus or by ferry. The Eyup ferry terminal has been closed for repairs, and it's not clear how long these will take, so at this time the bus is the best option. It's worth checking the schedule, though, to see when the ferry terminal opens again, because the ride up the Golden Horn from the Eminonu terminal (just past the bus terminal and labeled Halıç) is very pleasant and inexpensive.Note that the mosque and tomb are likely to be packed during Ramadan."
        }, 
        {
            "index": 487, 
            "rating": "5", 
            "review": "Very nice!. Not a priority if you are short of time but a nice pleasant setting. If I remember correctly the pieces of the black stone were in this mosque."
        }, 
        {
            "index": 488, 
            "rating": "4", 
            "review": "On a nice hill. Eyup Sultan is one of the first Muslems who came to preach Islam during Prophet Mohammed's time. His tomb is on the northern part of European Istanbul. Going up the hill after the visit to Eyup Sultan gives you a beautiful view of both sides of Istanbul"
        }, 
        {
            "index": 489, 
            "rating": "5", 
            "review": "great people watching. This mosque felt less touristy than others in the city. It was packed with families with small children. The boys were dressed in their masallah costumes in preparation for their circumcision ceremonies. Children were playing in the mosque and parents were taking lots of photos. We also walked through the cemetery to Pierre Loti. We would recommend that as well."
        }, 
        {
            "index": 490, 
            "rating": "4", 
            "review": "so pieceful mosque. periphery is not so well but the mosque itself is so relieving and pieceful."
        }, 
        {
            "index": 491, 
            "rating": "5", 
            "review": "Islam's fourth holiest site. Eyup Sultan Mosque is a place that should be on every travellers itinerary & is away from the tourists.You could take a boat trip along the Golden Horn (Halic in Turkish) - which is a smaller stretch of water than the Bosporus & less known to travellers - Golden Horn ferries leave Eminonu quay every hour during the day. You will be able to see a very different & more intimate side to Istanbul here. The boat passes the district of Fener - it's the old home to the city's Greek population with its sprinkling of Christian churches - & the boat makes its final stop close to the Eyup Sultan Mosque - Islam's fourth holiest site. The trip takes around 35 minutes."
        }, 
        {
            "index": 492, 
            "rating": "5", 
            "review": "Sublime. The architecture & beauty of the mosques in startling. View as many of the Sinan designed mosques as possible"
        }, 
        {
            "index": 493, 
            "rating": "5", 
            "review": "A Rare Jewel. You don't have to get a taxi to visit this place. Just get bus 166A from Eminonu station and after 20 minutes you will start notincing familiar minarets of turkish mosques. When you get off ask directions of mosques from anybody and you will find it. On your way back get on bus 166 from opposite side of the road you came and you will go back to Eminonu station."
        }, 
        {
            "index": 494, 
            "rating": "4", 
            "review": "Beautiful, but busy. Combine a vist to the Eyup Sultan with a visit to Pierre Loti.Eyup Sultan and Pierre Loti are located at the end of the Golden Horn.The Mosque is small and very well frequented by Turkish visitors.I read that this area is a favourite spot for Turkish visitors, and this was evident durig my visit.Too crowded for my liking, I prefer the Rustem or New Mosque.Never the less, the mosque is beautiful. Be sure to peek at the remnants of the old monastery which is on the same site. When one leaves the Mosque, walk down the road (100m) and use the cable car (TL2) to the top of Pierre Loti hill. Pierre Loti is a cemetary on the hill outside the city walls. Have a glass of Cay (Tea) at the Pierre Loti Cafe and walk down the hill throught the lovely (strange I know) cemetary."
        }, 
        {
            "index": 495, 
            "rating": "5", 
            "review": "Must visit Mosque. Abu Ayub Alansari (radiya ALLAH 3anhu) is one of Prophet Mohammad's (PBUH) companions. The prophet stayed in his house when he first arrived to Medina. When you are there by the grave, say \" Asslamu Alaykum \" and then make du3aa. Do not forget to pray inside the mosque."
        }, 
        {
            "index": 496, 
            "rating": "5", 
            "review": "Very Moving.. To get here we had to catch a ferry up The Golden Horn which was very enjoyable. This is a pilgrimage place so very moving. Wonderful Mosque."
        }, 
        {
            "index": 497, 
            "rating": "5", 
            "review": "A very nice place to visit. I haven't heard about his Camii until my Turkish friend took me there.. It's an old place but worth seeing for sure."
        }, 
        {
            "index": 498, 
            "rating": "5", 
            "review": "super. Quiet and authentic area. Well worth a visit. Number 99 bus from the port area. Buy an Istanbul travelcard and travel freely on all transport including ferries and cable cars."
        }, 
        {
            "index": 499, 
            "rating": "5", 
            "review": "Beautiful. This is lovely place ensure to visit the mosque, it has fascinating history and a great ruler graves. Than make your way up the stair along the grave to get the best view in istanbul, there is lovely cafe in the top of the mountain. Once your up at the top use the cable car to go down (teleferik), marveleous view."
        }, 
        {
            "index": 500, 
            "rating": "4", 
            "review": "a holy place. the place is beautiful and has a great historical value for islam.it is located at Eyup which is a very nice district where you can spend hours walking and sightseeing."
        }, 
        {
            "index": 501, 
            "rating": "5", 
            "review": "Eyup Sultan will make your prayers happen. If you're desperate on things that ruin your life, calm down, visit Eyup Sultan, listen to your instincs, inner voice and pray to God."
        }, 
        {
            "index": 502, 
            "rating": "3", 
            "review": "Snack amongst the graves. This is not on a par with the Blue (Sultanahmet) or Suleymaniye mosques, but you can ride the cable-car up the hill for a few minutes (it takes the same token as the trams, and the Istanbulkart is also accepted) and wander down through the extensive cemetery back to the mosque. You might think it strange to go for a wander through the graves, but it seems a common enough thing to do, and there's even a \"boutique\" hotel complex, restaurants and cafes at the top."
        }, 
        {
            "index": 503, 
            "rating": "5", 
            "review": "A Very Special Holy Place to Visit. It is far up along the Golden Horn and I found out how far from walking from the Topkapi Place one afternoon. However, it was well worth my journey. You can of course take a ferry or bus to reach the tomb.This is the holiest Muslim pilgrimage site in Istanbul. It is the burial place of Eyup Ensari, who was the standard bearer to the Prophet Mohammed. I found the area to be a beautiful and peaceful place. It was nice just to sit on one of the benches outside of the mosque and relax.Many important people are buried in the cemetery that goes up along the very steep path to the Pierre Loti cafe. I suggest that you take the cable car to get back down. This is a very different experience from the noisy crowded area around the Blue Mosque. Certainly worth a trip for those who want to see a little more of Istanbul."
        }, 
        {
            "index": 504, 
            "rating": "5", 
            "review": "Nice place to vist. i liked the area but beware of thiefs there. don't forget to use the cable car"
        }, 
        {
            "index": 505, 
            "rating": "5", 
            "review": "Out of the beaten track. Just take a bus at Eminönu and let you transport trough the Golden Horn to the mausoleum of Mohammed best friend. Cheap and tasty restaurants around. A real turkish feeling."
        }, 
        {
            "index": 506, 
            "rating": "5", 
            "review": "A great place for followers of Sufism. Serene and a very soothing environment! This is the shrine of Hazrat Abu Ayyub Al Ansari (RA), the companion of our Holy Prophet (PBUH) and it was his house where the Holy Prophet (PBUH) stayed when He came to Medina.Just ask any cab driver to take you to Eyup Sultan Mosque, they would know."
        }, 
        {
            "index": 507, 
            "rating": "4", 
            "review": "One of the most important mosques in Turkey. Eyup is a great place for a visit. It is the burial place of one of the companions of the Prophet Mohammed and as such an important place of pilgrimage. Because of its religious significance, many people want to be buried near there, and huge graveyards have been built up around the hills. There is a funikular (lift) that has been built going up the hills, and at the top there are several cafes with beautiful views of the Golden Horn. The walk back down the hill through the graveyards is shady and peaceful."
        }, 
        {
            "index": 508, 
            "rating": "5", 
            "review": "A Spiritual retreat!. This was an amazing place. My husband and I visited the Eyup Sultan Mosque and fell in love with the place. Eyup Sultan arae and the mosque are so tranquil and some where were anyone would feel at peace."
        }, 
        {
            "index": 509, 
            "rating": "5", 
            "review": "excellent resturants and coffee shops with great views of the golden horn and people are very frindly and welcoming. its a wonderful time there , i liked every thing about that area , you can smell history there"
        }, 
        {
            "index": 510, 
            "rating": "5", 
            "review": "Eyup Sultan. A great mosque and a holy place for Muslims. Ebu Eyyub Ensari was prophet Muhammed(s.a.v) friend and banner bearer of the Muslim army which came to siege Constantinople in the 674-678 and died here. There many graves of well known Muslim figures. It has a Beautiful surrounding. You must take the cable railway to visit Pierre Loti, a hill named after a famous poet and writer."
        }, 
        {
            "index": 511, 
            "rating": "5", 
            "review": "Nice and wonderful. No cover charge and it is full off history....... Nice and wonderful. No cover charge and it is full off history......"
        }, 
        {
            "index": 512, 
            "rating": "5", 
            "review": "off the beaten track -an excellent place to go. A mosque in a very nice surroundings,this place is mostly crowded by the locals especially on weekends,a nice place to relax and their are about two more mosques in this area which is worth visiting,plenty of shops and resturants nearby makes it very attractive place to spend 3 hours.Easily acessible from sultanahmet and Taksim.Because its a mosque so their is no fee to pay."
        }, 
        {
            "index": 513, 
            "rating": "2", 
            "review": "An old mosque with arabic tradition. The mosque was named after a muslim warrior who died during the siege of Constantinopolis. It is a well known mosque but it does not have much originality except the name it represents. It has a big inner garden like many Middle Eastern arabic influenced mosques. It is regarded as a kind of holy place for musulmans."
        }, 
        {
            "index": 514, 
            "rating": "3", 
            "review": "It was ok. The guide told me this is a mosque where usually used by turkish to get married. So dont be surprise if you come across a couple of bride and groom. During my visit, there some construction and restoration, so we did not see much. The inside is a bit simpler compare to blue mosque and sulaimaniye. Less color and smaller. My suggestion is to visit this when you have long period stay"
        }, 
        {
            "index": 515, 
            "rating": "5", 
            "review": "Holy ground. Quiet and authentic area. Well worth a visit. Number 99 bus from the port area. Buy an Istanbul travelcard and travel freely on all transport including ferries and cable cars.ç. verb"
        }, 
        {
            "index": 516, 
            "rating": "5", 
            "review": "top of he city,many turkish shops and food. there where many turkish shops for tourest,the resturant there is good prize,you can walk for around 1 km whith the shops around you"
        }, 
        {
            "index": 517, 
            "rating": "4", 
            "review": "eyup. The mosque is being renovated so a lot covered up but still worth a visit. It is a very holy site and provides an interesting insight into Islam.The walk upthe hill throughthe cemetary gives a great view of the river"
        }, 
        {
            "index": 518, 
            "rating": "5", 
            "review": "Holy site. Eyuo Sultan Mosque is very popular among muslims. That is why crowd is always in the mosque's yard. It is believed that you can make a wish in this yard and it will come true. Around the mosque there is a big old cemetry. If you come through it you will find the funiculer which can bring you to Pierre Lotti cafe. From its terrace you will see the view which is worth seeing. Great view on Istanbul and Golden Horn bay."
        }, 
        {
            "index": 519, 
            "rating": "5", 
            "review": "Must See if you are Muslim. There is a tomb of Halid bin Zeyd Ebu Eyyûb on the terretory of the Mosque. Very sacred place."
        }, 
        {
            "index": 520, 
            "rating": "5", 
            "review": "ONE OF THE MOST HOLY PLACE IN ISTANBUL FOR ALL THE MUSLIMS.. We feel relax after spending some time around eyup sultan mosque."
        }, 
        {
            "index": 521, 
            "rating": "5", 
            "review": "Another Mosque. Another Mosque, but not the same experience. Each one has its own merits - we were just so fortunate to be there."
        }, 
        {
            "index": 522, 
            "rating": "5", 
            "review": "This historic mosques. has a mausoleum which is one of the most fantastic placed in IStanbul. A must to visit, a very holy place for muslims"
        }, 
        {
            "index": 523, 
            "rating": "5", 
            "review": "Fascinating mosque, area and cemetery leading to it. we had not planned to go to the Eyup mosque but went to it after a visit to the Chora Church/Muzei and tea at the Pierre Loti Cafe. It turned out to be a real unexpected pleasure.The service at the cafe was atrocious, but the view from the scenic overlook outside the cafe is amazing. Equally fascinating was the walk from the Cafe down to Eyup through the Eyup cemetery - beautiful, sun-filled, easy walking path, filled with absolutely fascinating Ottoman grave markers (a Turkish friend translated many of the markers and some were quite intentionally humorous). Just lovely and interesting. Strangely, it was one of one of the favorite things we saw.We appreciated the Eyup mosque and the area around it, quite different from what you feel in Sultanahmet. There were fewer tourists in this area. the fountain and square outside of the mosque was filled with families and little boys dressed in prince outfits preparing to celebrate their circumcisions."
        }, 
        {
            "index": 524, 
            "rating": "4", 
            "review": "Tranquility. The mosque can be reached easily by taxi from Taksim Square , the mosque is from the oldest mosques in Istanbul , it contains the Tomb of Sultan Abu Eyup ElAnsari and many of the companions of Prophet Muhammad (PBUH) You can see the amazing walls and the roof , it's amazing and you feel the holiness inside it. also it's 10 minutes walk to Pierre Loti Hill"
        }, 
        {
            "index": 525, 
            "rating": "5", 
            "review": "Truly amazing. I am not religious at all but found the visit to this Mosque to be a very moving experience. Away from the usual tourist route to see the locals in their everyday activities made you feel very welcome and accepted as long as you show the due respect and cover up when inside the Mosque. Great restaurants all around the area. Well worth the visit."
        }, 
        {
            "index": 526, 
            "rating": "3", 
            "review": "Nice mosque with beautiful fountain. To be honest we were not planning to go to Eyup Sultan mosque but it was in our way to visit the Pierr Lotte cafe. It was a nice mosque with the fountain in front of it and we had our lunch in a restaurant near it."
        }, 
        {
            "index": 527, 
            "rating": "5", 
            "review": "Holy site. We walked from Pierre Lotti down to Eyup Mosque. It is a holy site with many \"pilgrims\" making their way there to view Mohammed's standard bearer's tomb."
        }, 
        {
            "index": 528, 
            "rating": "4", 
            "review": "A little gem outside Istanbul. We took the local bus service there, pretty easy to get to and not too far away. The area is small - we visited a mosque and mausoleum. Both beautiful, worth a short trip."
        }, 
        {
            "index": 529, 
            "rating": "5", 
            "review": "excellent and authentic. Quiet and authentic area. Well worth a visit. Number 99 bus from the port area. Buy an Istanbul travelcard and travel freely on all transport including ferries and cable cars."
        }, 
        {
            "index": 530, 
            "rating": "5", 
            "review": "Interesting place and nice surrounding. Eyuo Sultan Mosque is very popular among muslims. That is why crowd is always in the mosque's yard. It is believed that you can make a wish in this yard and it will come true. Around the mosque there is a big old cemetry. If you come through it you will find the funiculer which can bring you to Pierre Lotti cafe. From its terrace you will see the view which is worth seeing. Great view on Istanbul and Golden Horn bay."
        }, 
        {
            "index": 531, 
            "rating": "5", 
            "review": "It is worth crossing the city to have the truest experience in a Mosque.. This Mosque, farther away from the tourist part of the city, was the most real experience we had in all the Islamic holy sites in Istanbul. Because it is less touristy and predominantly attended by more orthodox Muslims (apparently), we experienced the Islamic faith in a different way from that experienced in the mosques of the Sultanahmet area (for example). As if it was not enough, this gorgeous sanctuary has beautiful colors in shades of blue and a light incidental music making a very unique atmosphere of the place (despite the crowd of local religious that go there to pray and visit the Eyup Sultan´s mausoleum)."
        }, 
        {
            "index": 532, 
            "rating": "5", 
            "review": "REAL MOSGUE FOR PRAY. Eyyp Sultan Mosque stands in Eyyup on the south end of the Golden Horn. The mosque is named in memory of Eyyup El-Ensari who was the flag man of Holy Mohammed. The complex which includes the mosque comprises a madrasah, an alms house, a soupkitchen and a bath. The grave of Eyyp El-Ensari which has been converted into a tomb is situated here as well."
        }, 
        {
            "index": 533, 
            "rating": "4", 
            "review": "Significant site for Muslims. After Jerusalem, Mecca & Medina, this is probably the most important mosque. One unmissable sight - loads of boys dressed fancy-shmancy like little sultans...it means it's their day of circumcision...they're paraded in their neighbourhood like this, and they get gifts etc...little do the know what awaits them!after going through the wishing window, and looking at the cemetery, make your way to the cable car which takes you up the pierre lotti hill...it'll be worth the queuing!"
        }, 
        {
            "index": 534, 
            "rating": "5", 
            "review": "Peaceful and spiritual. Being a muslim I was very eager to visit the Eyup Sultan Mosque and the tomb of Hazrat Ayub Ansari (ra). We visited on a sunday and found it very busy because of the locals visiting, but this gave the us opportunity to mingle with them.The visit for me was very spiritual and the mosque very peaceful. I would definitely recommend a visit, however it may not be much different to a normal mosque for a non muslim.We hopped off here while touring Istanbul as the tour bus stops a few mins walk from the mosque and hopped back on after 3 hours which gave us enough time to pray and look around."
        }, 
        {
            "index": 535, 
            "rating": "5", 
            "review": "3rd visit to Eyup mosque. The renovation work has completed and I have to say the place look better than before. As for the mosque, the quiet calm is still there and the friendliness of people around the area is evident. Traveling with a 2 year old was a cinch as in the mosques around istanbul she was able to explore and run around without any care. In fact, there were many times that she was given sweets by the visitors which is quite typical."
        }, 
        {
            "index": 536, 
            "rating": "5", 
            "review": "Discover Istanbul with the locals. A visit to the Eyup Mosque is an amazing experience and you will really discover the spirit of the people of Istanbul as there is very few tourist. The Mosque and its courtyard is beautiful and there is a special section where you can walk through and offer prayers or just experience the peacefull atmosphere.When you visit the mosque consider a visit to the Pierre Loti cafe which can be reached by cable car and you will get a wonderful view of the Golden Horn with your cup of tea. Afterwards you can meander down the hill through the old cemetery to the mosque. The best way to get there is to take the ferry from the Galata Bridge to the Eyup stop . The ferry departs from the left hand side of the bridge as you stood facing the Galata Tower. This is really a lovely day outing to discover a different part of Istanbul."
        }, 
        {
            "index": 537, 
            "rating": "4", 
            "review": "Off the beaten track, a calm (and very holy) mosque. Well worth the taxi ride or (better) the boat ride from Eminonu (mind the schedule - one trip every hour), the Eyup Sultan Mosque is a calm refuge away from the hectic Istanbul tourist scene. (and of course this place is holy, but nevertheless inside the mosque a \"professor of theology\" still managed to pitch a \"free\" lecture and demand some contribution for some bogus cause - if you can't help looking like a tourist, go with the flow)"
        }, 
        {
            "index": 538, 
            "rating": "5", 
            "review": "What A Place. feel the spirit of Sahaba, feel the inside comfort, visit, prey & see the grave."
        }, 
        {
            "index": 539, 
            "rating": "5", 
            "review": "This is my second visit to Eyup masjid.... This is my second visit to Eyup masjid. The serenity of the masjid overwhelms you once you step into the prayer area. If it is not for the architecture, one should visit this site because of it's character and tranquility. I suggest this is done before they complete all the constructions of squares and shopping that are in progress and before it becomes too touristy."
        }, 
        {
            "index": 540, 
            "rating": "4", 
            "review": "4th Most Important Shrine of Islam. This mosque, situated in a district called Eyüp which is almost an ancient and holy necropolis of Ottoman times, is considered the number 4 shrine of Islamic communities after Mecca, Medina and Jerusalem. Built in 1458, just 5 years after the conquest of Istanbul by the Ottomans, it also supposedly hosts the tomb of Ebu Eyyub Halid bin Zeyd el Ensari (one of the first supporters of Prophet Mohammad) who had joined Ummayads when they tried to conquest Constantinople in 7th century and this is what makes it that holy in religious meaning. Of course, the mosque itself has been renovated many times since its establishment but its simplicity has been preserved throughout the years. It's usually a very crowded area and especiallt last Sunday of every month, a very ancient Quoran is displayed here and those days, it's almost impossible to move around let along walk around. So it's better not to go there those Sundays."
        }, 
        {
            "index": 541, 
            "rating": "5", 
            "review": "Impressive, Beautiful, Holy and Real. I admit I was a complete tourist in Istanbul, but I'm always interested in getting away from touristy places to experience places and opportunities that are more a real part of any city that I visit. The Eyup Sultan Mosque is probably the most holy mosque in Turkey, and it is built right next to the memorial tomb of Eyup Sultan, with a small courtyard in the middle. This is definitely not a tourist place, or perhaps to be more precise, it isn't much of a tourist site for non-Muslim tourists. It is filled with people who are in contemplative prayer (male and female), and clearly it is a destination point for Muslims from many different cultures and countries. There are scarves available for women visitors, and plastic bags to carry shoes. The interior of the mosque is quite beautiful with a number of lovely windows looking into a very very old graveyard (with the most unique and interesting tombstones I have ever seen). Between the mosque and the highly-decorated tomb of Eyup Sultan is a lovely courtyard with a HUGE old tree that is hundreds of years old (the top has been lopped off but it is still very much alive, and very impressive). The tomb is very decorated, with beautiful tiles. It is small and packed with visitors. The actual burial memorial is roped off and in its own separate viewing room (it is very ornate and quite a sight to see). There were a number of women who were showing respect, and it felt wrong to jostle to the front to see better. In the back of the room, there is a small space that is roped off, with a line. In the wall is a case with a piece of marble. The marble is where Mohamed stepped at one time, and it's called the footprint of Mohamed, and it's quite popular to see. I really felt the power of this holy place, although I am not Muslim. I thought it was well worth a visit, and for tourists who want to see something that isn't really touristy, it was a pretty great destination. It was interesting and historic, and it was clearly a very important place for Muslims from all over the world. If you have free time, and the inclination to get off the tourist path, then I highly recommend going to see the Eyup Sultan Mosque."
        }, 
        {
            "index": 542, 
            "rating": "5", 
            "review": "Historic & Magnificient - a must place for muslims !!. Our hotel was in the Sultanhamet District but a 15min taxi ride (20TL) was well worth it. This is the resting place of abu ayyub al ansari (R), a very famous companion of the beloved prophet Muhammed (PBUH). The tomb can be very bust but wont take more than 15/20mins to get in - I dont recomend visitng it during Friday prayers. In the tomb is also a footprint of the Prophet Muhammed and alongside is the Eyup mosque.Outside of the Eyup Mosque are some bazaars which most of the locals use which i found alot cheaper and alot less stressful then the traditional Spice & Grand Bazaars. The bazaar immediately next to the mosque sells Islamic items such as scarfs, qurans, pictures and other Islamic items.Once you finish here i do recommend jumping onto the Cable Car to Pierre Lotti Cafe which has some amazing views of Istanbul for some refreshments. Its so easy and is all sign posted from Eyup Mosque and costs 2TL - from the Cable Car you also get a view of the ancient graveyard on the hill side."
        }, 
        {
            "index": 543, 
            "rating": "5", 
            "review": "Holy ground. Eyup sultan is one of the most conservative sections of Istanbul but a place that should be on every travellers itinerary. Away from the tourists, you get to see Istanbul as it must have been like for hundreds of years before Ataturk tried to turn it into a poor mans paris.Eyup sultan is the burial location of abu ayyub al ansari (R) the neighbour and friend of the Prophet Muhammad (peace be upon him.) As such he is a legendary figure in early Islam and was part of the first Muslim legions sent to conquer Constantinople. When he was dying, he asked that his friends but his body on a horse and attack as far as they could and bury him deep within enemy territory. This they did and centuries later, the army of Mehmet Faith (the conqueror of Constantinople) found his grave and built the mausoleum and mosque at the site.Rich with history and charm Eyup Sultan was the location where the Sultan and Caliph were given the sword of Othman confirming them as ruler and the most holy place in all of Turkey."
        }
    ]
}