{
    "category": "Istanbul", 
    "entity": "Kucuk-Ayasofya-Camii", 
    "avg_rating_stars": 4.552777777777778, 
    "review_count": 360, 
    "rating_stats": {
        "poor": 3, 
        "average": 28, 
        "terrible": 0, 
        "very_good": 96, 
        "excellent": 233
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "Hidden gem. Far from tourists and giant busses, if you come to this mosque, complete silence will fall upon you. Small and historical, it is quite great I felt great for coming there."
        }, 
        {
            "index": 2, 
            "rating": "4", 
            "review": "A small historical mosque. This is a small historical church that was converted into a mosque after the conquest of Constantinople. A good place to visit."
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "Amazing Place . Really amazing and awesome and shows the greatest history of Islam. Lovers of arts they will like this place a lot"
        }, 
        {
            "index": 4, 
            "rating": "4", 
            "review": "Exquisite . This 'small but perfectly formed' ex-church and now mosque was empty when we arrived and it was an extremely peaceful time that we had examining and enjoying the beauty of it - well worth a visit."
        }, 
        {
            "index": 5, 
            "rating": "5", 
            "review": "Very nice church. vey close to arasta bazar. The former church - now tzami- is very nice in the interior. Simple but elegant. With big but delicate marble stylus- called kionokrana. The outside of the church reminds so much Agia Sofia. Very well preserved. After visiting the church walk around to the neighborhood. Old but very beautiful buildings. Aroma of another era."
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "islamic architecture and Christians architectury come together.. I love this place because it was a church that changed to a mosque. The paintings that was belongs to byzantine was great."
        }, 
        {
            "index": 7, 
            "rating": "4", 
            "review": "Small Ayia Sophia. I believe that is the name on the map. It is worth the visit if you have some extra time. Few visitors there so not crowded. You might get the (payed and unplanned) tour by an old man speaking pretty good english and quite knowledgable of the history of the church and not only."
        }, 
        {
            "index": 8, 
            "rating": "5", 
            "review": "Tranquil hidden gem. Had fantastic days going to little hidden site which is older than the Ayasofya. Not many tourist know about it so there was no hussle or bussle, beautiful set and mantained excellent tranquil place to visit."
        }, 
        {
            "index": 9, 
            "rating": "5", 
            "review": "Beautiful building and peaceful area.. I stayed quite near tho this place. Almost each prayer time, i came here to pray. It used to be a church before converted to mosque. The people who come here to pray i guess they stay nearby. The imam and the jemaah were very nice and welcoming. Love the interior wall decoration."
        }, 
        {
            "index": 10, 
            "rating": "4", 
            "review": "BEAUTIFULL ARCHITECTURE. The place is great to visit, and shows a lot of mixture between CHRISTIAN and ISLAMIC architecture. you need to buy your ticket to enter and wait in along row of visitors ."
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "Amazing. This is like a small replica of Saint Sophia. However, I was told that it was build before the Great Saint Sophia. This beautiful structure recently renovated dates back to Byzantine era as an Orthodox church, only after the Ottoman era it was converted to a mosque. A must see when you are in Sultanahmet district."
        }, 
        {
            "index": 12, 
            "rating": "3", 
            "review": "Small Ayasofya . Almost same to Ayasofya. Nice architectural mosque which was believed to be a church. The area is very simple and less visitors."
        }, 
        {
            "index": 13, 
            "rating": "4", 
            "review": "Old and beautiful former church . Very beautiful mosque with a long history as an orthodox church. Some traces all still found from 6th century from the relieves of pillars. There were kind man who told as about this church history and also times after Ottoman Empire."
        }, 
        {
            "index": 14, 
            "rating": "4", 
            "review": "Somewhat hidden historical church, now mosque. We used to know Hagia Sophia. Not many people know about Kucuk Aia Sophia, or Small Hagia Sophia. The former church is located down from Sultanahmet towards the seashore. It is not so glorious as the Hagia Sophia, but it is interesting to see its interior and trace remainings of the original church."
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "Little gem of a place. We visited this lovely little Mosque. Very beautiful. We met a man who showed us round as an informal guide. We realized he would expect payment, but he was interesting and answered our questions. Just be aware you might inadvertently start a conversation that leads to paying for a guide you didn't plan for. The also was a church before it became a mosque and is very beautiful. As it is a functioning Mosque there is no fee, but a donation box."
        }, 
        {
            "index": 16, 
            "rating": "5", 
            "review": "Always a highlight. Little Hagia Sophia (SS Sergius and Bacchus) was always an atmospheric place but is even better since the recent restoration. Great to combine with a visit to (the thousand years younger) Sokullu Mehmet Pasha Mosque, both only 5 minutes walk from the Hippodrome."
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "Oasis of calm. Even with the painters at work on the interior nothing could dispel the serene atmosphere of this delightful and very old building in a traditional part of Sultanahmet, a few minutes walk from the Blue Mosque toward the Sea of Marmara."
        }, 
        {
            "index": 18, 
            "rating": "5", 
            "review": "Peaceful and Beautiful Respite from Busy Istanbul. Tucked away off the major tourist center of Sultanahmet, the Kucuk Ayasofya Camii (Little Ayasofya Mosque) is about a 7-8 minute walk from the main square. Built by Justinian in the 6th century, it is said to be the prototype for the much-larger Aya Sofia in Sultanahmet Square.The 7-8 minute walk will take you along well-traveled streets lined with a mix of shops and restaurants catering to both tourists and locals, and a few hotels.It was converted (as the Aya Sofia was) to a mosque after Constantinople fell to Mehmet the Conquerer in 1453. Kucuk Ayasofya is a working mosque; women are required to dress appropriately with headscarves; shoes are removed in the little alcove just inside the entrance - there's a convenient cubby-hole system along one wall to place your shoes until you are ready to leave. You'll see an older ablution fountain with a (non-working) hand pump on the inside - the current washing fountains are outside the structure in the courtyard.Elements of when the Greeks held the city are evident in the 'Greek key' architectural details, and you can climb the short flight of stairs to a platform and overlook the interior. Not many tourists, therefore very peaceful inside. Shades of cream and blue abound, and the interior design work of carvings, tiles, and paintings are not as overwhelming as some of the larger mosques. The cream and blue colors reminded us of Greece; as this was a Greek church for centuries, perhaps this is color scheme was an intentional choice.We can't say for certain if there was an entrance fee - we were so taken in by how lovely the mosque is - we recall leaving a 10 TL each donation (as of June 2016, ~$3.42), but due to our limited understanding of Turkish were not sure if that was an entrance fee or not.In many ways, we found Kucuk Ayasofya more beautiful than the better-known Aya Sofia because it is smaller, much less crowded, and it you can get much closer to see the beautiful tilework and architectural details. And, as long as there are no prayer services, you can sit as long as you like and enjoy the serenity."
        }, 
        {
            "index": 19, 
            "rating": "4", 
            "review": "Beautiful Byzantine Church now a Mosque again.. This is so like a small version of Aya Sofya, it was an obvious name to adopt ('kucuk' meaning small) and obvious that a story would develop that it was a model for the actual Aya Sofya. It is a beautiful example of a 6th century church, dedicated to 2 Christian Roman soldiers, although all the Byzantine mosaics and frescos were removed in the 16th century when it was converted into an Ottoman mosque. But the beautiful pillars and their intricately carved capitals, and the Greek friezes above them were left undamaged, either by the Ottomans or the more recent renovations. Although technically a museum since the Republic was formed in 1922, it seems to have again become a mosque after renovation, meaning ladies must now cover up and making viewing tricky on a Friday But definitely worth a visit. Make sure you go upstairs (but be careful on worn steps)."
        }, 
        {
            "index": 20, 
            "rating": "5", 
            "review": "Underrated. It's not far from the Blue Mosque, and you get to wander around Sultanahmet on the way there. Originally a Greek Orthodox Church and also known as Little Hagia Sophia, it has the exterior architecture and some interior details of a church, but it's currently a Mosque and has Ottoman designs inside. As well as being beautiful, it's very peaceful and quiet"
        }, 
        {
            "index": 21, 
            "rating": "5", 
            "review": "A gem that shouldn't be missed. If you are interested in Byzantine churches and architecture, make time to see this 6th-century church. You can walk to it from Hagia Sophia. Originally dedicated to Saints Sergius and Bacchus, it was built by Justinian before Hagia Sophia. It has many beautiful details. Be sure to climb the stairs to the gallery and look at the Greek inscriptions."
        }, 
        {
            "index": 22, 
            "rating": "5", 
            "review": "Visit this place ... Amazing place and amazing atmosphere .. Get the chance to sit beside one of the oldest spots in istanbul and also enjoy the service ;)"
        }, 
        {
            "index": 23, 
            "rating": "5", 
            "review": "Don't Miss This when you leave Topkapi Palace. Little Hagia Sophia is stripped to the bone but because of that you see more. The dome, the balcony, the pulpit all seem to make the place appear more real that Hagia Sopia."
        }, 
        {
            "index": 24, 
            "rating": "5", 
            "review": "Not too many visitors. This is a transformed mosque, from an orginally in 6.th century built church. It is not on the main tourist routes, so if you get in there are not too many tourist. The original architecture is still to be seen. The locals call it \"Little Aya Sofia\"."
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "A fine example of Byzantine-meets-Ottoman. We began our explorations today at the Kȕçȕk Ayasofya Mosque, built in the Sixth Century by the Byzantine Emperor Justinian as a church honoring Saints Sergius and Bacchus, the Fourth Century Roman Christian martyrs who appeared to the emperor in a dream. Because the “Little Hagia Sophia,” as it is known, retains the architectural features of the original church, it struck us as an example of the Ottoman practice of re-purposing Christian religious structures, often whitewashing over mosaics and frescoes, rather than tearing churches down to build mosques. Whether this practice demonstrated tolerance or frugality, it was a treat to see the surviving examples of Byzantine art."
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "Astonishing marble work. We were alone in this wonderful building on a holiday weekend in May. It is not more than 20 minutes walk from the crowded areas of Aya Sofia and The Blue Mosque but seems virtually unvisited. Anyone with any interest in architecture and history would be well advised to visit. The detailed marble work is of astonishing quality and in marvellous condition for its great age. I urge you to take the trouble to find it."
        }, 
        {
            "index": 27, 
            "rating": "4", 
            "review": "Another hidden gem. As with many architectural gems of Istanbul, the Kucuk Ayasofya (or small Hagia Sophia) is located out of the way. I wouldnt have known about its existence if not for an impromptu decision to join a tour to Topkapi Palace which includes a detour to the Kucuk Ayasofya.This mosque was a church built as a mock up for the real stuff hence some similarities in terms of architecture with the Hagia Sophia."
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "nice. nice place and important things its free :) if you near there also you can go visit.... nice to be there..."
        }, 
        {
            "index": 29, 
            "rating": "5", 
            "review": "Old \"Little Sophia\". This ancient Church is now a mosque, but the beautiful greek words of holy Scripture (Bible ) are still carved in the facade inside. It is small and down by the shore of the Sea of Marmara, but it is really beautiful and peaceful. It is worth seeing and spending the time to walk there. From the tramline it is an 8 minute walk downhill."
        }, 
        {
            "index": 30, 
            "rating": "4", 
            "review": "Little Ayasofya. This Byzantine era church, built in the 6th century, like most other churches here was converted into a mosque.The single minaret mosque now stands just beyond the railway line along Kennedy Caddesi. I had to figure out a way to get to it on my morning walk because I found myself on the wrong side of the railway line. Nice church in typical Byzantine style architecture."
        }, 
        {
            "index": 31, 
            "rating": "3", 
            "review": "Away from the crowds. Little Aya Sofya (formerly SS Sergius and Bacchus church), is out of the tourist area (sorry not in Topkapi Palace area, that was a mistake). It was built at the same time as its big sister, and provides an interesting comparison for architecture buffs."
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "A miniature Ayasofya. A little church built by Justinian and Theodora just before they built the much grander Aya Sofya. After Constantinople was overrun by the Ottomans this small church was turned into a mosque. It is still a working mosque so it is still a matter of shoes off and dress modestly. We were fortunate to be there when the caretaker was vacuuming the carpets and he showed us a few things that we would have missed ourselves. The church is just down the hill from the Blue Mosque."
        }, 
        {
            "index": 33, 
            "rating": "4", 
            "review": "Small yet nice. The Kucuk hagia sophia was walking from our Sofia apartments. there is nothing much to see though. All the mosques in Istanbul look the same and are beautiful."
        }, 
        {
            "index": 34, 
            "rating": "5", 
            "review": "Excellent. Huge giant church which was converted to mosque and now converted it into museum. Neat and clean Area."
        }, 
        {
            "index": 35, 
            "rating": "4", 
            "review": "a place to visit after blue mosque visit , nice interiors for good photos and memories for ever. he detailed workmanship and great beauty are impressive plus we ended up with our own personal guide who had visited in the past and was more than happy to point out hidden treasures."
        }, 
        {
            "index": 36, 
            "rating": "3", 
            "review": "ayasofya. ayasofya ,a place to visit after blue mosque visit , nice interiors for good photos and memories for ever"
        }, 
        {
            "index": 37, 
            "rating": "5", 
            "review": "Beautiful old church. A must see when you are in Istanbul. The detailed workmanship and great beauty are impressive plus we ended up with our own personal guide who had visited in the past and was more than happy to point out hidden treasures."
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "A Little Gem of a former Church now a Mosque. This little Church was one of the first churches built by Justinian around the early 500's AD. It also shows the the emergence of the new and distinctive Orthodox style of Architecture. (Also its is very near President Kennedy road which I found amusing for some reason.) Its dome for some reason was very hypnotic to me. I am glad that I know of it."
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "A small but very nice place. We were the only visitors on a Saturday morning. It is a small but very quiet place and it is worth a visit if you are in the neighborhood. We stayed about 10-15 minutes.It is free but we were asked to make a donation."
        }, 
        {
            "index": 40, 
            "rating": "5", 
            "review": "Magical!. I went on a Sunday morning early-ish (10h30) and had the mosque all by myself! It was truly magical! It's small and intimate and absolutely stunning. Highly recommend."
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "beautiful little mosque. these little mosques are just great masterpieces. Is just like when you walk into Rome and find smal unknown churches that are so nice and breathtaking"
        }, 
        {
            "index": 42, 
            "rating": "5", 
            "review": "A small but magnificent building. Not the typical tourist attraction in Istanbul but it is just as incredible as others. It is very beautiful inside out. It is not crowded so you can a peaceful time appreciating this 1600 year old mosque"
        }, 
        {
            "index": 43, 
            "rating": "5", 
            "review": "Great!. We visited this mosque with our group and guide. Perfect place, absolute silence and peace. No mosaics inside but you can see the columns and cross on them. Has a beautiful garden with little shops of old books and ceramics."
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "A charming Church - Mosque. This is another great sample of Byzantine art and architecture. If you have extra time in the Old Town, do visit this one. It is functioning as a mosque today. Be aware of the prayer times before visiting."
        }, 
        {
            "index": 45, 
            "rating": "5", 
            "review": "Must see; way older than Hagia Sofia and no lines!. This is a lovely little mosque that is much much older than the \"Big\" Hagia Sofia. It, too, as also a church that was converted to a mosque. However, the \"little\" Hagia Sofia is still a functioning mosque. It is set back away from all the major sites and has no line. It is quite small but pretty and has a lot of history. A lot of the original artwork/decoration was covered when it became a mosque. As with most mosques in Istanbul, you will be asked to cover your head/shoulders with a scarf (if you are a woman) and possibly you legs if they are bare (men and women) and to remove your shoes, all before you can enter the mosque. There was no entrance charge."
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "a church older than present st.sophia. it s just 10 minutes away from sultanahmet mosque on the sea shore direction and its one of the most important church in the city from early Byzantiun period.it s still being used as a mosque .you must use your imagination in order to recapture the the beautiful original conditions of the walls that were once revetted with marbles and mosaics.Beautiful marble columns and their capitals sculptured like lace work is trult amazing.its one of the must see places in istanbul."
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "Beautiful Byzantine Architecture. Due to a poor map, we had a hard time finding this mosque. But the former church stands only about a 10-minute walk from Aya Sofya. I think it is worth going out of one's way to visit because of the Byzantine architecture and the building's history. The red-brick structure features an imposing dome and an irregular octagon shape. Inside, big columns remain from the building's days as a church. Justinian and his wife, Theodora, built the little church at some point between 527 and 536, just before Justinian's massive Aya Sofya went up. The minaret and madrasah, now used for other purposes, date from the church's conversion to a mosque in 1500.The mosque proved to be extremely quiet. Only one other person joined us inside. We took about 10 minutes to look around and then left for the small tea room that occupies part of the former madrasah. The tea was good; the WC proved to be in deplorable condition."
        }, 
        {
            "index": 48, 
            "rating": "4", 
            "review": "Kucuk Ayasofya Camii (Little Hagia Mosque). Marvelous architecture, peace & calm atmosphere. Located in Kucuk Ayasofya Dist., very much close to Meydan Arkasi, st.# 15, Sultanahmet, Istanbul-34122, Turkey."
        }, 
        {
            "index": 49, 
            "rating": "3", 
            "review": "Small old church converted into mosque. Unless you got time to spare after you visited the major sites, this ex-church converted to mosque is nice to visit for as a peaceful alternative to other historical sites. Nice courtyard and a ultra-friendly cat awaits you there."
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "Church and mosque. Originally The Church of Sergios and Bachos. converted into mosque but you can see the traces of the church! It's really clear to see the Byzantine columns and the inscription all above the columns."
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "Amazing place!. Outstanding architecture, the size of everything inside, ranging from pillars, domes, candelabra is surprising and incredible. Very busy though. Try to be there well before 10am and preferably on a weekday."
        }, 
        {
            "index": 52, 
            "rating": "4", 
            "review": "The little Hagia Sofia. When you see this mosque it has similar architecture remeniscent of Hagia Sofia . The architect who did this is the same architect who designed Hagia Sofia"
        }, 
        {
            "index": 53, 
            "rating": "4", 
            "review": "Hagia Sophia in miniature.. This small wonder of church architecture from the Byzantine period is certainly worth a visit. Is easy to find with the city map. Visit it every time I am in Istanbul."
        }, 
        {
            "index": 54, 
            "rating": "5", 
            "review": "Little Haghia Sophia. Kucuk Ayasofya Camii is a small mosque close to the Blue Mosque in Sultanahmet. Beautiful inside and well worth a visit. Open daily."
        }, 
        {
            "index": 55, 
            "rating": "4", 
            "review": "Small Hagia Sofia. already the walk from big Hagia Sofia is worth the trip. cute little mosque with nice decoration and beautiful carpet"
        }, 
        {
            "index": 56, 
            "rating": "5", 
            "review": "Little Aya Sofia Mosque... A Little Gem near the Blue Mosque. This was a 2 minute walk from our hotel so we visited it a couple of times. Though opening hours state 9:30 onwards, when we got there around 10:00, there was no one there to open the mosque though the garden/cafe area was open.We made another visit a day or so later and were invited in. Small mosque but beautifully decorated. We were allowed to go upstairs where usually the muezzin (the person who makes the call to prayer) stands and take a few photographs from different angles.Usually very quiet as we didn't see many tourists there, so very different from the Blue Mosque in that way!If you're visiting the Blue Mosque, make your way here after (about a 5 minute walk) - it's worth it!"
        }, 
        {
            "index": 57, 
            "rating": "5", 
            "review": "Worth a detour to visit. A nice little attraction tucked away from the main tourist trail of Istanbul. It is now a mosque, but was once a church. The neighbourhood around is also nice"
        }, 
        {
            "index": 58, 
            "rating": "4", 
            "review": "Little Hagia Sophia. Close to the ruins of Great Palace and Sphendon, former Byzantine Orthodox church. Very cosy part of the city. Now is serving as a mosque. still you can see the columns and ornamentations."
        }, 
        {
            "index": 59, 
            "rating": "5", 
            "review": "A church turn Mosque turn museum. If you want to see where the Emperors of Rome were crowned..then you must visit this site. You will also see beautiful Christian motives super imposed by Islamic writings"
        }, 
        {
            "index": 60, 
            "rating": "5", 
            "review": "Beautiful sight. if time to visit only one mosque in Istanbul, this is the one. The architecture, the mix of Catholic architecture and Islam is superb. The old wall mosaics are worth the visit."
        }, 
        {
            "index": 61, 
            "rating": "5", 
            "review": "One of the best places in Istanbul. Just 5 minutes downhill from the Hippodromes, this astonishing building, formerly a Byzantine church and now a mosque is breath-taking. The classical Justinian Byzantine Architecture may be admired here and if you can read Greek you may still read the inscription around the internal walls. Visit in the afternoon and take some time to also drink a cup of coffee or tea in the nearby places and admire the building. Ask the keeper to lift the carpet as you enter the main hall and see the original floor."
        }, 
        {
            "index": 62, 
            "rating": "4", 
            "review": "Delightful. \"Little Hagia Sophia\" was built in 527AD although constructed some five years before Hagia Sophia, the church earned its nickname because of its resemblance to the Great Church. The buildings are similar in design but each has their own individuality. The church has an irregular plan.Four octagonal pillars, around the top of which are inscriptions that honour Justinian, his wife Theodora and St Sergius, support the vaulted central dome. The gallery above affords an excellent view of the interior which was decorated with coloured marble facings and lavishly decorative golden mosaics. The church was converted to a mosque shortly after Mehmet's conquest of the city.The mosque is located beyond the southern end of the Arasta Bazaar, along Ayasofya Cadd. It can also be accessed from the sea front, past the Bucoleon Palace, via a tunnel under the railway line. "
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "Stroll down the street and meet a gem. The Kücük Ayasofya Camii (als known as SS Sergus and Bacchus) is known as a precursor to the big Hagia Sophia.It is a building from around AD 530. The interior is sheer magic!"
        }, 
        {
            "index": 64, 
            "rating": "5", 
            "review": "A hidden gem!. You may have a little bit of difficulty in finding this gem, but when you do, you will truly enjoy the structure and the serenity of its grounds. As a builder, I truly appreciate the imperfections of the structure i.e. the mezzanine construction. @instabuilt"
        }, 
        {
            "index": 65, 
            "rating": "4", 
            "review": "Wonderful hidden mosque. You need to look for it, but once you find it is really worth, full of bizantine details in capitels and signs"
        }, 
        {
            "index": 66, 
            "rating": "3", 
            "review": "Great. While you are in ayasofya many interesting points needs to be stop at in details reading the history and learning many things"
        }, 
        {
            "index": 67, 
            "rating": "4", 
            "review": "A quick trip. It is a great place to visit but very limited in appeal. You can really take your time and still cover it in just 30 mins max."
        }, 
        {
            "index": 68, 
            "rating": "4", 
            "review": "A former orthodox church. The church was dedicated to the Saints Sergius and Bacchus,but turned into a camii at the Ottoman Empire. It is a small but lovely church, which although is not so famous to the tourists, however it is worth visiting."
        }, 
        {
            "index": 69, 
            "rating": "4", 
            "review": "Combination of Islamic and Christianity Architecture. Combination of Islamic and Christianity Architecture.nice and great. don't go there without tour guider. you ought to know alot of history story about it."
        }, 
        {
            "index": 70, 
            "rating": "5", 
            "review": "Great History of two faiths.. This was originally a church in Constantinople that they changed to a Mosk after the Otoman empire took it over. It still has some original church markings as well as Muslim Mosk markings. A must see."
        }, 
        {
            "index": 71, 
            "rating": "4", 
            "review": "A peaceful working mosque monument. Don't miss this small yet working mosque with beautiful neighbourhoods while you do the big ticket items in Istanbul. The carpet and decor is beautiful as is the mosque peaceful."
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "smaller agia sophia but just as beautiful!. after seeing the extrodinary agia sofia....walk further down straight pass the blue mosque on a bit of a down hill ask around and they will tell you!... its totally free and its beautiful and i think its older than the agia sofia its self...it was peaceful and absolutley beautiful....around the area there are a lot of little restaurants and good eats!..."
        }, 
        {
            "index": 73, 
            "rating": "5", 
            "review": "Loved it - Baby Aya of Sophia. This is a good example of a mini Aya of Sophia - Built in the Byzantine period, older than Sophia, relatively close to the bigger Sophia, its free, and a short walk through the Arasta Bazaar then keep going a few more blocks. Very peaceful. When I was there, I was all alone and no other tourists. No food at the site, but around the site there are lots of cute places to eat."
        }, 
        {
            "index": 74, 
            "rating": "5", 
            "review": "good a place. great a place and free if you near there you must see this place when you going to istanbul we went to there many times great a place...."
        }, 
        {
            "index": 75, 
            "rating": "3", 
            "review": "Keep time for this one. Smaller but older n tucked away so no crowds n line n big ticket enterance!!! Anf just the walk there will show u other stuff"
        }, 
        {
            "index": 76, 
            "rating": "5", 
            "review": "Peaceful place. Fantastic place with a lot of history.Built during the byzantine period, Occupied by the ottomans who kept Christian paintings and mosaic intact."
        }, 
        {
            "index": 77, 
            "rating": "4", 
            "review": "A place to see for all Aya Sofya fans. Our guide informed us that this building was constructed as a sort of trial run for Hagia Sophia and you can really see it when you visit. As the others said, this is a mosque, so wear appropriate clothing and avoid prayer times."
        }, 
        {
            "index": 78, 
            "rating": "5", 
            "review": "A quiet peaceful visit.. A quiet visit to a beautiful, decorated mosque. It is worth seeking this place out as it is devoid of the crowds elsewhere. The small artisans' quarter nearby is interesting too. You can also get a glass of tea here too."
        }, 
        {
            "index": 79, 
            "rating": "5", 
            "review": "Nice and free. Nice camii and free we love it this place down küçük Ayasofya and beautiful place if you near there you must go see this place and free :) very good a place..."
        }, 
        {
            "index": 80, 
            "rating": "5", 
            "review": "Wonderful Opportunity . This is an active mosque so be sure to check prayer times ahead of schedule and ensure appropriate clothing - safest with long trousers and a loose fitting top (for females), a scarf to cover your hair is also required (again, for the ladies). There are scarfs and cloaks available to borrow inside. Expect to remove your shoes too, I left mine outside with no issue.It was my first trip to a mosque and I was a little unsure (worried to ignorantly offend if I'm honest), but it is a quiet area away from the hustle and the 'process' for visiting is clearly marked out on helpful signs to allow you to get on with it respectfully.It's a beautiful building and quite old - I specifically visited in order to see the Byzantine frieze that runs beneath the gallery inside. Amazing.It was also a great education.There is no charge for visiting active mosques, but donations are welcome - there is a box for this just after the cloakroom."
        }, 
        {
            "index": 81, 
            "rating": "3", 
            "review": "Not a \"must-go\" place. Kuchuk Aya Sofya mosque is just nearby Ottoman Hotel Park that we stayed. Nice mosque but nothing to compare to Aya Soyfa in Sultan Ahmet square"
        }, 
        {
            "index": 82, 
            "rating": "5", 
            "review": "Absolutely worth a visit - and it is FREE. Absolutely worth a visit. Entrance is free. You have a feeling that you are in a sanctuary. Clothes are provided for tourist for appropriate entry."
        }, 
        {
            "index": 83, 
            "rating": "5", 
            "review": "Hidden gem. Another hidden object from organize tourism, but if you want to see one of Istanbul gem - please visit it, small but very nice. Near is very good restourant"
        }, 
        {
            "index": 84, 
            "rating": "5", 
            "review": "Ayasofya Mosque and church.. Where peace and love are present between the religions. Not to be missed a visit to such a beautiful peace of art."
        }, 
        {
            "index": 85, 
            "rating": "5", 
            "review": "Nice place conveniently located close to the Blue Mosque. This so-called \"small Saint Sophia\" is located at the southern border of Sultanahmet, close to the Marmara Sea, not far from the Blue Mosque. It is much less crowded than more central attractions, and it is really worth a visit: it's quiet and well kept, with a nice inside and an external colonnade."
        }, 
        {
            "index": 86, 
            "rating": "5", 
            "review": "Amazing architecture. This temple is a real human miracle. I think this is a place that everyone has to visit in Konstantinopolis."
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "Ancient \"Church \"Mosque. Behind the Blue Mosque and through the Arasta Bazaar you will come into KucukAyaSophia Caddessi. At the end of this road you will find a The small Ayah sophia Mosque which was originally a church. The design is based on the big Ayahsophia. The interior is as spectacular - white marble and beautiful artistry and architecture. Do go up the stairs for views from the top. even though the interior has been restored upstairs but covered with protective glass you can see parts of the original brick wall structure. Note the peculiar water pump and spout inside at the bottom of the stairs. Great architectural and historical significance. please spare the time to go and see this structure. you will not be disappointed. If you have more time to spare and then take a walk to Yenikapi fishing harbour not far."
        }, 
        {
            "index": 88, 
            "rating": "4", 
            "review": "A peaceful haven and a beautiful mosque. For a real spiritual feeling, visit this mosque that served as a model, they say, for the Aya Sophia. Once a church, it has been better converted to a mosque than many others. Not crowded and beautiful architecture."
        }, 
        {
            "index": 89, 
            "rating": "4", 
            "review": "A must to see before visiting. Sergios Bachos Church or Küçük Ayasofya Camii. Has the basic plans of Main Hygia Sophia and Many other cathedrals in Europe as well. I guess it is too far from its originality but is worth so see before visiting the main Wonderful One. If you have time ask Giritli Restaurant which is not too far and have a taste the plenty of mezes."
        }, 
        {
            "index": 90, 
            "rating": "4", 
            "review": "Eclectic interior.. Bright little mosque that offers eclectic interior. Some of the columns are particularly interesting as they date from Byzantine time."
        }, 
        {
            "index": 91, 
            "rating": "4", 
            "review": "Easy to Miss. We found this former church while searching for a recommended restaurant. It may lack the majesty and grandeur of its more famous sister and does not have any mosaic frescoes, most of the Christian symbols having been obliterated, but it still impresses with its original marble column and interior sereneness. Headscarves are mandatory but available on loan. Be sure to have a glass of tea in the courtyard which seems to be a bubble of calm, perhaps the legacy of centuries of faith & prayer."
        }, 
        {
            "index": 92, 
            "rating": "5", 
            "review": "I want to go there again. One of the main reasons i visited Istanbul was to visit Ayasofya, very beautiful indeed. I was unlucky the place was under maintenance, i have to go there again"
        }, 
        {
            "index": 93, 
            "rating": "5", 
            "review": "Little gem of a mosque. I love this little mosque. I always go to it when I am in Istanbul, as it is a happy little building, light and bright with it's blue and white colors that make it look like delft blue and white pottery. There is a little tea garden in it's front yard, and several artists have set up their shops there. The art in the tea garden is exquisite, and you will not find such high quality pictures and jewelry in the bazaar."
        }, 
        {
            "index": 94, 
            "rating": "4", 
            "review": "An oasis of calm.. A hidden gem, near enough to the centre and yet uncrowded and peaceful. Helpful staff. Must go back again to this small but perfectly formed haven."
        }, 
        {
            "index": 95, 
            "rating": "5", 
            "review": "Lovely. A bit further from the big Aya Sofia and far from the crowd, the little sofya is one of the loveliest mosque to visit. It used to be formerly a christian church, superbly redecorated. One of our most touching visits in Istanbul."
        }, 
        {
            "index": 96, 
            "rating": "5", 
            "review": "Not to be missed. This mosque/church is not be missed when you travel to Istanbul. Also the site is beautiful at night if you go have a drink on the Four Seasons roof top."
        }, 
        {
            "index": 97, 
            "rating": "3", 
            "review": "thr most important building of the world. Its a little bad that is not quit finished restauration,considering that is one of the most important building of the world.Dont forget thats created in the V-th century,(with 1000 years older than Blue Mosque,another capodopera) and ist a litlle bad also the religional revendications,....that building is creeated from the bysantines,.....not ortodoxes or not muslims...."
        }, 
        {
            "index": 98, 
            "rating": "5", 
            "review": "Best Kept Secret. Visited on 3 July 2015 and saw the evidence of coversion of the church into a mosque:-i.e. the prayer mat and the side walls were slanting. Normally a typical mosque will have side walls aligned to the \"kiblat\" - direction of Mecca."
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "if you have time please make the effort. not far from Blue Mosque and no crowds when we visited. A lovely building with a lot of history (a very different experience to the madness of Hagia Sophia and Blue Mosque). If you can afford it, please leave a donation to upkeep this historic building."
        }, 
        {
            "index": 100, 
            "rating": "5", 
            "review": "Hmm, probably my favorite moscque. it is gorgeous but understated instead of the usual clash of patterns and colors. And it was less crowded too."
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "Multiple layers of history. One suggestion: take a guide. Make him take you to the second floor as well. There is so much history in this place that you need someone to guide you. Alternatively you could use the audio-guides available at the entrance."
        }, 
        {
            "index": 102, 
            "rating": "4", 
            "review": "Beautiful mosque. I very much like this tiny mosque however it looks very simple and quiet but has a lot to present. There are different type of architectures in this building."
        }, 
        {
            "index": 103, 
            "rating": "4", 
            "review": "Rich in History and still standing through the millenia.. Glad we hired a guide as she was able to circumvent the long lines. a lot of the interior was under scaffold annoying but necessary to make sure great buildings do not deteriorate. The size and history from Christian to Moslem to Museum make this a worthwhile visit."
        }, 
        {
            "index": 104, 
            "rating": "5", 
            "review": "The draft for Aya Sofiya. Before the building of Hagia Sofiya/Aya Sofiya the Byzantine emperor built this much smaller church to test the novel ways that had been worked out to support the dome. The Turkish name means \"Little Aya Sofiya mosque.\" The church is still used as a mosque, but has been lovingly maintained and restored. A \"must see.\""
        }, 
        {
            "index": 105, 
            "rating": "5", 
            "review": "Great place to visit!. Amazing place with a very rich history! Some renovation is taking place though so some areas are closed but you could still enjoy the visit. Beautiful collection in the upper floor with a chance to purchase some items at a higher price. The outside court is amazing where you could buy corn and bread and feed the birds or just sit and enjoy the scene."
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "THE CHURCH. The church of the Saints first disciples of Jesus Christ and the place where first Christians were called, and the land where they still have the house of Mary mother of Jesus Christ. Just by stepping inside the church you feel the presence of Jesus and something goes through your veins when you see how the Ottoman empire changed everything about that church and changed the history of that place."
        }, 
        {
            "index": 107, 
            "rating": "5", 
            "review": "You can't not visit. This is probably one of the oldest monuments signifying the ever crossing paths of Christianity and Islam.. The two storey building is in much need of careful restoration and renovation but yet captures you with awe and reverence at both the architecture and the historical significance. Loved every bit of the history that we could hear from the Audio Guides. We only had Ayasofya, Blue Mosque and Topkapi in our list -but in case you are interested in more historical monuments there is a 1 or 3 days pass that you can obtain for entry tickets - which would be worthwhile considering."
        }, 
        {
            "index": 108, 
            "rating": "5", 
            "review": "Amazing Small Byzantine Church - Now Mosque. Visited this Church/Mosque in April, 2015. It was a little difficult to find but it was well worth the trouble. Built by Justinian in the 6th century. It is a two-story building and one can get a better view of the interior from the second floor. The tops of the columns (capitals) are intricately carved and are some of the most beautiful I have ever seen. It was a really nasty day so we were the only ones in the mosque and could really take our time to look around. This is the only Mosque in the world with Latin inscriptions inside (owing to its earlier Church history.) The next time I'm in Turkey I plan on going to this Church again to spend more time on the exterior of the building because as I said it was a really nasty day."
        }, 
        {
            "index": 109, 
            "rating": "5", 
            "review": "A small mosque with no tourists. If you want to really see a Mosque - go here. They keep the lights on and there are no thronging masses of tourists. You really get an idea of how a mosque looks and can fully understand how those of the Islam belief can focus on their daily prayers. Only a short walk from the Dersaaset."
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "wonderful. you will be amazed watching this mosque,just 5 minutes walking distance from blue mosque,after that you can walk to arrest bazaar to do some shopping,recommended"
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "Exquisite little mosque. Simple and elegant, this little mosque is a place you can sit and soak up the atmosphere, so peaceful. It is beautifully decorated, and off the beaten track, so you aren't fighting the crowds. Well worth the visit."
        }, 
        {
            "index": 112, 
            "rating": "5", 
            "review": "Little Gem!. I loved it here. Tucked out of the way, it really does resemble the Aya Sofya! Have a Turkish Tea/Coffee in the grounds outside and then go and explore the area around. Fabulous examples of old ottoman homes in this area too! Photograph opportunities everywhere."
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "Nice experience from my travel here. The place is really crowded, and it was told before that it has a huge history of the cami. I have seen by myself it's wonder"
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "The Best Attaction. assuming this is the Aya Sofia I am reviewing!This is a must do. It looks a bit run-down from the outside but the interior was VERY impressive, the height of the central dome particularly so, as well as the sheer monumentality of the structureI was here on 22 May 15 and there was quite a large part of the inside was taken over by scaffolding, but don't let that put you off"
        }, 
        {
            "index": 115, 
            "rating": "5", 
            "review": "Lovely. It is the ruin of a Bizantine church and has the same name of Had his Sophia. Now it's a mosque. Itself and the neighbor are very lovely. Nice to wal around."
        }, 
        {
            "index": 116, 
            "rating": "4", 
            "review": "Impressive but not on a saturday with 3 large cruise ships in the port.. Alltough the Ayasofya is a monument in Christian and Islam history it was hard to see the beauty of it due to 2 reasons:An incredable amount of visitors, mainly caused by 3 enormous cruise ships in Istanbul cruise terminal unloading maybe 14.000 passengers, andthe building is still under construction.I will go back there on a rainy day."
        }, 
        {
            "index": 117, 
            "rating": "5", 
            "review": "A non touristy great monument. You can go upstairs and relax and contamplate.They provide scarfs for visitors.There is a good collection of tomb stones at the back.You can see them from the left back of upstairs."
        }, 
        {
            "index": 118, 
            "rating": "5", 
            "review": "Totally amazing!!!!. This is an amazing place and should not be missed. I have seen many very impressive historical sites over the years and this rates up towards the top of my \"most impressive\" list with the best of them. DO NOT miss this magnificent place when in Istanbul."
        }, 
        {
            "index": 119, 
            "rating": "4", 
            "review": "Serene, Peaceful and Tiny. Unlike the other cramped historic building this small mosque (used to be a byzantine church) have a very different fell. Only handful of visitors were present during my visit and you can actually enjoy the serenity of the building. Sitting on the carpeted floor while enjoying the unique interior was a refreshing feeling after a long walk in istanbul. Nice place to visit but can be skipped if your schedule is tight."
        }, 
        {
            "index": 120, 
            "rating": "5", 
            "review": "do not miss. As understood from the same it is miniature of Hagia Sophia and as spectacular as it. Daily city tours do not put the monument in their itinerary. There is small tea house inside garden of the mosque so after visit take a realx under trees and listen the history you inside check also small handycraft shops and quality thing that you can find there also not touristic prices"
        }, 
        {
            "index": 121, 
            "rating": "5", 
            "review": "Just beautiful. This is a beautiful building in a great area. Ita an ancient mosque now used as a museum. It also has some lovely outside areas to get a real feel of old Turkey"
        }, 
        {
            "index": 122, 
            "rating": "5", 
            "review": "historical place, presenting architectural art & culture. this place, i have visited two times, is one of the best historical places of Turkey, showing the process of religion & culture in Ottoman emperor with wonderful architecture."
        }, 
        {
            "index": 123, 
            "rating": "4", 
            "review": "Small, lovely . . . and not crowded. On our second visit to Istanbul, we happened into this little gem on the advice of a guide we had hired. No, it is not as spectacular as the Blue Mosque or the Hagia Sophia. But, it is not crowded and, therefore, offers a rare opportunity to experience a site without jostling or being jostled by the hoards. For that alone, it is a worth a visit."
        }, 
        {
            "index": 124, 
            "rating": "4", 
            "review": "Nice mosque. Küçük Ayasofya Mosque is located in Edirnekapı district of Eminönü area on European side of İstanbul.İt was originally constructed as a church.After the conquest of the city,then it was converted into the mosque.This mosque is off the touristic route,so if you are in and around Edirnekapı area and have some extra time,then recommended to pay a visit."
        }, 
        {
            "index": 125, 
            "rating": "4", 
            "review": "Feel the peacefull atmosphere of a beautifull mosque dating Justinian's age. A former orthodox church converted into a mosque. Original building buildt at time of Justinian emperor before Ayasofia. Transformed into Mosque. No mosaic here but a very beautifull mosque with nice paintings, nice marble columns, relatively small, walking distance from the Blue mosque, no tourist crowd. To me , it was one of the most beautifull we saw. First floor reachable. photos allowed and benefiting of the shorter distance."
        }, 
        {
            "index": 126, 
            "rating": "5", 
            "review": "Marvelous piece of art. The architecture is speechless, especially when you see a wide ceiling and dome with pillars far away on its sides. Much of the paintings are still intact.Ayasofya was under some repair works, so, the metal framework spoilt much of the good view... so sad.."
        }, 
        {
            "index": 127, 
            "rating": "3", 
            "review": "Ayasofya Mosque. Personally, I can't find many significant distinctions between Mosques in Istanbul because they are pretty much all the same, especially from the inside. Ayasofya is a bit more special because of it's historical background, once being a church and a great location just in between of Topkapi palace and Blue Mosque. I didn't have a chance to go inside, but it's a great place to take a photo."
        }, 
        {
            "index": 128, 
            "rating": "4", 
            "review": "Beautiful little mosque. Like Ayasofyia, this was first a Byzantine church which was converted to a mosque during Ottoman times. It's small and lovely."
        }, 
        {
            "index": 129, 
            "rating": "4", 
            "review": "Little Hagia Sophia. It is close by the sultanahmet district and its adjacent attraction right in the old part of the city. It is locally known as the “ Little Hagia Sophia” being reflection of the same architecture and history. This used to be a church once but now it is an active mosque and one should be aware of the same while visiting and be cautious of what they are wearing. Visiting is not allowed during the service hours. Though the architecture and details are impressive, there are not very information that could tell you more about the place which snatches away the fun a bit."
        }, 
        {
            "index": 130, 
            "rating": "5", 
            "review": "Small Hagia Sophia Mosque. Small Hagia Sophia Mosque is the excellent sight to visit in Kadırga district. The sight is very close to Sultanahmet square in walking distance and it is a must place to visit. The mosque has beautiful architecture with excellent columns and wonderful atmosphere. The courtyard also has endengared Ottoman gravestones with splendid headgears. The headgears are classified accordiing to Ottoman professions, symbols expressing the feelings. The male gravestones have their sects on headgears while the female have the ephitaphs & symbols with floral patterns."
        }, 
        {
            "index": 131, 
            "rating": "5", 
            "review": "\"Little Hagia Sophia\". This is a very nice mosque in the old part of Istanbul. It is close to lots of other stuff in that part of town and well worth a visit. You may need some help findng it, but it is worth the effort. I believe it was built before the Hagia Sophia."
        }, 
        {
            "index": 132, 
            "rating": "5", 
            "review": "A very charming little mosque not far from the Blue Mosque.. This little charmimg mosque is situated in the backyards of Sultanahmet at the side of Kadirga area. The visit of this nice place is good to combine with seeing the great Sokollu Mehmet Pasha Mosque, staying on the way to this mosque. Little Hagia Sophia has long history and was built mainly in VIth century-at the times of the Roman Emperor Justinian, who lived as they say, just nearby and loved it very much. The imam of the mosque kindly allowed me to walk up the stairs to see the hall from there and the view was really nice! The interiors are fine and the atmosphere of this little place is just amazing!"
        }, 
        {
            "index": 133, 
            "rating": "5", 
            "review": "Nice mosque, great for history buffs. This is an extremely old church-turned-mosque. It's a beautiful little building with a unique appearance given its history. There is a small area for women to borrow scarves if you have not brought your own to cover your head (however, it's good to have one on hand wherever you go!).What's interesting about this building is its architectural design is like a mini-Hagia Sophia, as the name suggests. If you have been to San Vitale in Ravenna, Italy, the design is nearly the same. If you have an interest in Byzantine architecture, this is a must-see!"
        }, 
        {
            "index": 134, 
            "rating": "3", 
            "review": "An Architectural Marvel. This is one of the oldest churches in Istanbul, now a mosque. Its Turkish name means 'Little Hagia Sophia', because like the real Hagia Sophia, it is built around a big central space. In this case it is based on an octagon, with eight arches supporting the dome. The original Byzantine marbles and mosaics that adorned the church are long gone and it is now rather plainly decorated - you wouldn't visit it for the decoration, just for the architectural details."
        }, 
        {
            "index": 135, 
            "rating": "4", 
            "review": "Originally a church - now a mosque. Small mosque with bazaar outside which funds the mosque. Inside a light and well maintained building - for me an opportunity to see inside a mosque and appreciate it's architecture."
        }, 
        {
            "index": 136, 
            "rating": "3", 
            "review": "This was a Byzantine church, please, write about this for the visitors!. Except for the name (Kucuk Aya Sofia) which echoes the great Aya Sofia Museum, it was shocking to me that NO information is given about the history and the architecture of the building, a very ancient Byzantine church.Now, it is a mosk, and the only information that the visitor gets is a leaflet available in many languages about Islam. I went there after prayer time, and I was urged to go inside and take a leaflet, that is, to get informed about islam, not at all about why the place was so beautiful and built this way. This is not only a restoration, although we can still admire the beautiful architecture, but an ignorant denial of the past and a way to propagandize Islam."
        }, 
        {
            "index": 137, 
            "rating": "5", 
            "review": "excelente. ayasof ya for mr it is one of the 7 wunders of the World and must be for evry one ı think no posible to expline this beatuful muze you shud try to go in defnetly recomendecion"
        }, 
        {
            "index": 138, 
            "rating": "5", 
            "review": "A monument not to miss visiting!. History of 1700 years in a temple! So much faith in God is depicted on the magnificence of the monument. Admire the exhibitions of faith and outmost art!"
        }, 
        {
            "index": 139, 
            "rating": "3", 
            "review": "Historic value. It's a beautiful and nice mosque, it has historical values as it is well maintained from 1500. It's worth a visit here!"
        }, 
        {
            "index": 140, 
            "rating": "5", 
            "review": "Awsome. Huge and magnificent. Stayed a couple of hours and would have been longer but at that time of year it was quite chilly. The scale of the building is magnificent. Not a lot more to see but a place for contemplating the amazing skills of the builders. A place of peace."
        }, 
        {
            "index": 141, 
            "rating": "5", 
            "review": "Do not miss this historic treasure. While most visitors are familiar with Ayasofya and the Blue Mosque, Little Hagia Sophia is often neglected or passed by. True, there are externally grander mosques and churches in this Queen of Cities, but the Church of Saints Sergius and Bacchus, recently beautifully restored, takes the visitor back to the early days of the Byzantine Emperors and their once private chapel which pre dates Hagia Sophia. There are hardly any crowds here and the visitor is free to wander around, reflect, pray or simply imagine the immense history of this building. The grounds include a number of craft shops and a cafe."
        }, 
        {
            "index": 142, 
            "rating": "5", 
            "review": "Beautiful. It is called the little Hagia Sophia because it resemples the Hagia Sophia church! Is very beautiful and in a nice area !! It's better to have a guide with you to inform you about the details !!"
        }, 
        {
            "index": 143, 
            "rating": "5", 
            "review": "angels. i liked all the history that our tour guide Yals, told us. specially the face of one of the angels has been shown the face and made it a public dominion."
        }, 
        {
            "index": 144, 
            "rating": "5", 
            "review": "If you loved the architecture of Hagia Sophia. If the architecture of Hagia Sophia swept you off your feet, go to Little Aya Sofia and see the architecture of the dome evolving to the point where Hagia Sophia became possible. It is a perfectly beautiful building.It is a pity that architecture buffs are not allowed to walk to the center of the building to admire the dome and vaulting. Muslims can, non-Muslims not permitted to walk to the center. Even though the building appears not to be in regular use as a mosque. But go anyway, it's beautiful."
        }, 
        {
            "index": 145, 
            "rating": "5", 
            "review": "Treasure. A small mosque a bit away from the touristic pathways, but not really far away. Nice paintings, I liked it even more than the sultan ahmet mosque (Blue Mosque). Quiete noone hassle you with anything. Some nice and good restaurants in the attaced streets."
        }, 
        {
            "index": 146, 
            "rating": "5", 
            "review": "Not to be missed. Off the beaten track but only a 10 minute walk from the Sultanahmet mosque, the Kucyk Aysofya was built a few years before it's more famous namesake up the hill. It's said that the design was to test the general engineering possibilities of the greater Ayasofya. The mosque has been restored (a few years ago it was in danger of collapse from neglect and from the vibrations of the adjacent railroad) and is now a quiet and interesting detour from the customary hectic tourist spots. Ask the imam if you can climb the very well-worn steps up to the balcony--but be sure to leave some coins for the upkeep of the mosque if you do."
        }, 
        {
            "index": 147, 
            "rating": "4", 
            "review": "small yet lovely. it is one of the smallest sites in Sultanahmet area, yet its location and building is a good site to see, you will need about 15 minutes there, but it provides a safe have for a rest from the people who want to sell you things all the time"
        }, 
        {
            "index": 148, 
            "rating": "5", 
            "review": "old and quiet. quiet place to visit and start your journey, near by is the bazaar and the mosaic museum where you can get your museum pass with no big rows ....also try to avoid the 11 o'clock prayer when it is closed for visitors. There are great souvenir and art shops inside as well as great Turkish tea."
        }, 
        {
            "index": 149, 
            "rating": "4", 
            "review": "fun to visit, a bit off the beaten track. If you are shopping at the Arasta Bazaar, you can arrive at this mosque (previously a Byzantine Church) but simply walking out of the bazaar and following the Kucuk Ayasofya Street to the end. The building was built roughly around the same time as Hagia Sophia, but is much smaller, and it has Latin inscriptions in the marble entablatures. There is an octagonal baptistery next to it together with an Islamic cemetery."
        }, 
        {
            "index": 150, 
            "rating": "5", 
            "review": "Little Hagia Sophia. Lovely little mosque, known as the Little Hagia Sophia - not very busy - it is tucked down a side road - we had a rabbit and a cat sit with us outside which made it even more quaint. Lovely place to visit"
        }, 
        {
            "index": 151, 
            "rating": "4", 
            "review": "Impressive Mosque. Well worth visiting and known as the Little Hagia Sophia. Perhaps , not so popular as many other such buildings as you have to descend down to it from the Sultanahmet. However, for only a short visit needed to appreciate its splendour, well worth the effort."
        }, 
        {
            "index": 152, 
            "rating": "3", 
            "review": "Smaller replica of Hagia Sofia. Its a much smaller replica of Hagia Sofia. Same story with its much bigger sister this mosque was originally a church but was converted into a mosque and it still is to this day. When visiting remember to wear decent clothes and for the girls, same like any other mosque, head-scarves are required. There is a small wishing well in the corner of the church. Its nice n beautiful and if you're staying in the old city area and have some free time you can drop by for a visit (its free). Just need to be quiet and no flashy photography if someone is praying inside. Not really a must see though."
        }, 
        {
            "index": 153, 
            "rating": "4", 
            "review": "Nice Mosque. This mosque was a church once upon a time. It has a nice ambiance. Little, sweet. If you have enough time visit it."
        }, 
        {
            "index": 154, 
            "rating": "5", 
            "review": "Ayasofya a marvel. It dates back to the 6th Century. It was a church built by the Romans. The integrity of the stone construction is still in tact. The dome is the central part and it is the most beautiful segment. The architecture is marvelous and gives one a feeling of peace.There is a structure of the church and also a mosque which was added later.There is a gate which shows the direction to MECCA."
        }, 
        {
            "index": 155, 
            "rating": "5", 
            "review": "Curious combination of Christian and Islamic styles. In some ways this building epitomizes that history of Istanbul since one can so easily imagine the Byzantine period and subsequent conversion to Islam. The place,net of the mIhrab in the aspe angled to the side to face Mecca rather than Jerusalem captures the complexity of the city's past."
        }, 
        {
            "index": 156, 
            "rating": "4", 
            "review": "A little delight. A much smaller version of the Blue Mosque but without all the tourists and officials. All the key elements of a mosque to see in a quiet and peaceful setting. Well worth a visit and only a short walk down from the main attractions."
        }, 
        {
            "index": 157, 
            "rating": "5", 
            "review": "Worth seeking out. Built as a trail for Hagia Sophia to see how the dome could work, the result is a splendid church/mosque in its own right."
        }, 
        {
            "index": 158, 
            "rating": "4", 
            "review": "Do visit this delightful small mosque. Located behind the Blue Mosque [south-west] about a 10 minute walk downhill along the Kucuk Ayasofya Camii Sokak. You can see the roof from the Blue Mosque when looking towards the bay. There are likely to be worshippers here, so respect is needed but it all adds to the experience. However the architecture is delightful. When you have visited, adjacent is a veranda garden with gifts etc and, more so, tasty tea at 1TL /glass which you will enjoy. The general Kumkapi residential neighbourhood is also interesting to wander around."
        }, 
        {
            "index": 159, 
            "rating": "4", 
            "review": "A nice surprise !. This small jewel was located close to our hotel and we were lucky to find it while trying to learn our way around ! It is not well known and it is not on the normal tourist path , in fact it is a good 20 minutes from the blue Mosque and Hagia Sofia ( the Big one ) . If you have time and you do not mind walking , it is worth the detour but do not expect to be amazed !!!"
        }, 
        {
            "index": 160, 
            "rating": "5", 
            "review": "Beautiful. Beautiful, peaceful, quiet, not many tourists at all, and no huge chandeliers hung down to ten feet above the ground with a million cables ruining one's view, as in so many of the Istanbul mosques. Loved this building."
        }, 
        {
            "index": 161, 
            "rating": "5", 
            "review": "where the religion meet peace. I am going back i hand't enough of that place,a church that is now a mosque you can still see all the pianting christian paintig catclic,so beautiful,they do have a small restaurant out side and toilets....bring your camera with you,and be ready to be amazed ;-)"
        }, 
        {
            "index": 162, 
            "rating": "5", 
            "review": "Marvellous church, situated close to Byzantine Hoppodrome!. It was built by Justinian and Theodora. The building's dome is amazing and it's plan, an irregular octagon, unusual.Beautiful columns made from green and red marble. It has also a nice tea garden."
        }, 
        {
            "index": 163, 
            "rating": "4", 
            "review": "Kucuk Ayasofya. Close to Bestwestern Antea Palace Hotel . Quaiet place , a small park and traditional turkish place with tea serving is in front of the church . Nice place for relaxing .\nKucuk Aiasofya has a special air , should be visited just for your info ."
        }, 
        {
            "index": 164, 
            "rating": "5", 
            "review": "A treasure. mercifully not crowded like the major attractions. Near our hotel in the lower western reaches of the Sultanahmet and just a few more yards past our favourite fish restaurant during our stay and an example of a smaller converted Byzantine church – everything was going for it. We were not disappointed. This beautifully proportioned space is decorated minimally compared to the bigger and more visited attractions and is all the more appealing (and more refreshing) for that. The many fewer visitors allow the reasonable chance of photos without the intrusion of the human figure and the possibility to roam all over the building, to the gallery, to the top of the added enclosure etc which allows many viewpoints such that you start to notice things like the edges of vertical surfaces that are sculpted and decorated to look like drawn-back curtains and the fact that the building is not quite true on its axis. The intimacy of the smaller space and the more restrained decoration soon made us warm to this building; maybe we felt it as a bit more European than Eastern, a bit more retaining of its Christian heritage despite its conversion to a mosque? Outside there is almost a cloisters containing the ablutions station with retail outlets offering ceramics, glassware, literature, refreshments etc. and in the nearby streets are some interesting local artists working away in their studios and selling their art. After the hectic confusion and bustle of the larger monuments, this quiet and serene tucked-away jewel of a building is a tonic for wearying sight-seers"
        }, 
        {
            "index": 165, 
            "rating": "5", 
            "review": "Little Jewel. This was a little hard to find, but worth the effort. While the mosque needs some work, it is still in good shape and is a little jewel - they're taking donations for the upkeep and have a container. There was hardly anyone there when I went, which was very nice after visiting the crowded more well-known sites."
        }, 
        {
            "index": 166, 
            "rating": "3", 
            "review": "Interesting Story - Myth or History. Not much to see. Since we are not familiar with mosques, it was a good education for us.Great story and part of Istanbul's/Sutans' history."
        }, 
        {
            "index": 167, 
            "rating": "5", 
            "review": "A must visit site. It is astonishing how few tourists visit this jewel of an early byzantine church and now used as a mosque.This is our second visit to Istanbul and we regularly visit (our hotel is just across the street) as it is beautiful as well as a significant historic landmark in Istanbul.It seems to be open to visitors for most of the day. There is a quiet courtyard opposite where you can get some refreshment after your visit."
        }, 
        {
            "index": 168, 
            "rating": "5", 
            "review": "Small but great. Hidden in the backstreets of the Sultanahmet, this church turned mosque is worth looking for. It is much smaller and calmer than the other mosques you can visit, yet has a wonderful history and sense of atmosphere."
        }, 
        {
            "index": 169, 
            "rating": "5", 
            "review": "Out of the way but worth it. This mosque is away from the tourists and is definitely worth the visit. Inside it is very beautiful, and outside you can see local kids playing soccer instead of tourists waiting in line."
        }, 
        {
            "index": 170, 
            "rating": "4", 
            "review": "Hidden and beautiful. If you like to walk among the near streets of Istanbul and you're looking for extra important historical sightseeing, you shouldn't miss the so-called Small Aya Sofia. It's situated in a peaceful part of Istanbul, away from crowded spaces and hords of tourists. You'll be given a chance to visit a significant historical place, an ex-church, converted to a mosque. Why do I say that the 'chance is given'? It's because it's completely opened to tourists, even though the Kucuk Ayasofya is still a regular mosque. The exterior and interior of the mosque are really interesting and amazing, so you won't regret visiting this place. Also, at the entrance of the mosque there are free prospects which are related to Islam (written in different languages). At the end of the Kucuk Ayasofya tour, you can take a pause and rest a bit in the shades of trees surrounding the mosque."
        }, 
        {
            "index": 171, 
            "rating": "4", 
            "review": "Peaceful place to visit. This place was bluer than the Blue Mosque and much more peaceful without the throngs of tourist roaming around. We were glad that we stumbled upon it."
        }, 
        {
            "index": 172, 
            "rating": "5", 
            "review": "Loved this little Mosque. . This building was a church for hundreds of years before conversion to a mosque.Its just as interesting as the larger ayasofya, as size isn't everything in my opinion.... ;-) but there are three things that make it more interesting:1. It's still being used for worship to this day.2. It's less crowded.3. It's free!My advice for this building and all the buildings of this amazing city:Join in... don't be shy.Wash you feet under the taps on the building opposite the main door outside to save the carpet. (Feet can get very swetty in istanbul. It won't kill you and it's actually really refreshing.)Go inside, forget tourism, put your camera in your pocket, then quietly sit on the carpet and contemplate your existence.You may take home something really special and get far more from your visit to Istanbul than just photos.That's has after all been the real purpose of all these beautiful buildings in Istanbul for thousands of years...."
        }, 
        {
            "index": 173, 
            "rating": "5", 
            "review": "small and beautiful. This is like Ayasofya but rather small, We walked for a few minutes to this place from Arasta Market under Blue Mosque. The local Turkish citizens are living around. So, it is quiet. I think it was a very charming place."
        }, 
        {
            "index": 174, 
            "rating": "5", 
            "review": "Do not miss to visit it!.... This small but very good Mosque is located in a quiet neighbourhood of the touristic center,so easy to locate it.With its single minaret,it looks very exciting specially during the night with the illumination.Pls do arrange a visit to this one and do not miss it as it is worth to see it.Recommended."
        }, 
        {
            "index": 175, 
            "rating": "5", 
            "review": "sweet little mosque. If you don't like crowds do visit this one. I liked the interior and exterior. It's not far from main attractions so it's not even inconvenient to visit"
        }, 
        {
            "index": 176, 
            "rating": "4", 
            "review": "Beautifull & peaceful!. This was the first place we visited on our day tour of the Old City & it was the only place that was quiet & where one could gaze at the beauty of the architecture without crowds of people. This little church was built just before Aya Sophia & was originally covered with gold mosaics, like its big cousin! These were removed by the Ottomans but the graceful lines of the dome & marble columns still make it a place of great beauty. Well worth a visit & a chance to relax far from the madding crowd in the garden."
        }, 
        {
            "index": 177, 
            "rating": "5", 
            "review": "Small but priceless. Any travel book will tell you about Aya Sofia, the huge byzantine church that was converted to a mosque and is now a museum. Good travel books will probably drop a few lines about the existence of this much smaller church from the same period that now operates as a mosque. Little Ayasofia (küçük ayasofia) is a much smaller temple but its interior is better conserved - you can look at the inscriptions in Greek. The church has an octogonal plan with beautiful columns and wall paintings, and a gallery that provides a great view from a different angle.It is interesting to see how the mirhab (the central piece where the faithful offer their prayers) had been built. Since the church was built without Mecca in mind and the mirhab has to be oriented towards Mecca, the solution was to place it off center.Little Ayasofia (küçük ayasofia) is located in the Sultanahmed region but removed from the main attractions around its larger sister. No tour buses seem to stop there so you can enjoy a quiet visit. The blocks around the church are a nice place to walk and relax, away from the stressful movement of tourists and street vendors elsewhere."
        }, 
        {
            "index": 178, 
            "rating": "5", 
            "review": "Little Ayasofya is a Little Gem!. We just stumbled upon this as it was quite close to our hotel and it really is a little gem. Just like the last reviewer, I agree a very calm place and hardly any other tourists. You can really take your time, it is fantastic!Then, just outside is a little courtyard with a few shops. We loved the hand printing shop - but right next door is a very special jewellery shop. It has the most unusual beautiful handmade jewellery and is not expensive. I bought the most precious ring there and everybody I have shown it to says it the most beautiful ring they have ever seen. I wish I had bought gifts for everyone there. He hand cuts and makes items out of mother of pearl shells - you have to go there and see. But even if you dont go see all the little shops, Little Ayasofya is a real gem!"
        }, 
        {
            "index": 179, 
            "rating": "4", 
            "review": "Very calm place. Küçük Ayasofya (or Little Ayasofya) is a place that tourists should not miss. Although it has the same name as the original Ayasofya but it is different. The place is calm with cafe's at its side. The locals there are friendly, and they have a small park where they sit in. We have some nice shots of the mosque from outside and the inside is amazing. There is no fee for entering, at least I did not pay, I just wanted to pray.It is worth going especially during sunset time if you just want to enjoy some time chatting with your companion during sipping a hot cup of tea of coffee as you enjoy the scene. The lights of the cafe's there are really amazing, the whole setting was tranquil and warm."
        }, 
        {
            "index": 180, 
            "rating": "4", 
            "review": "A must for lovers of the Byzantine. A walk further down and to the left of Sokullu Mehmet Paşa, this is a pretty church - now quite active mosque - and graveyard with a painted interior."
        }, 
        {
            "index": 181, 
            "rating": "5", 
            "review": "Recent visit to Little Hagia Sophia. This beatiful little fifth century gem is frequently overlooked by most travelers. It was the \"pre-study\" for its big brother, the Hagia Sophia, about a fifteen minute walk away and up the hill. A marvellous piece of Byzantine archtecture - and without the crowds. At times I have been the only person there."
        }, 
        {
            "index": 182, 
            "rating": "5", 
            "review": "Charming space. Küçük Ayasofya (\"Little Ayasofya\") is a charming spot in Istanbul. For the ones who go to Istanbul and stay around Sultanahmet, you may take a walk and visit this spot as well. It's a small, human space, always quiet and peaceful. On the several occasions I visited it, there was always someone in a quiet corner reading, or simply sitting, thinking. It's a beautiful and elegant space.Outside, there's a small tea house in the courtyard."
        }, 
        {
            "index": 183, 
            "rating": "4", 
            "review": "Not touristy at all. Its a nice mosque without all the hordes of tourists. It is a beautiful place not far from the main attractions and should be visited"
        }, 
        {
            "index": 184, 
            "rating": "5", 
            "review": "Church !!. once it was a christian church and then it turned to a mosque finally it become a museum one of the best historical places i visited very big they provide you with a electronic guide that have many language it was good and worth money i loved it"
        }, 
        {
            "index": 185, 
            "rating": "4", 
            "review": "A mini replica of Aya Sofia!. Worth a visit to see the early design of mosques under the Ottoman Empire at the foot of the hill, even allowing for the uphill climb back. The domes, arches and the support beams are painted and etched exquisitely. A single minaret anchors the base."
        }, 
        {
            "index": 186, 
            "rating": "4", 
            "review": "Lovely Little mosque. This is interesting as it was built by Justinian and Theodora and show the architecture of this type of design quite clearly. You can also go upstairs and get a different perspective on the building. Unfortunately none of the mosaics have survived, but it is still quite a little jewel."
        }, 
        {
            "index": 187, 
            "rating": "5", 
            "review": "A quiet haven in gorgeous blue and white. In the hustle and bustle of the Blue Mosque and Hagia Sophia, one rarely gets the chance to appreciate the structures for their true purpose - as a spiritual haven for quiet contemplation. That is not the case with Little Aya Sofya - there's barely anyone in there and the decorations inside the mosque in blue and white are some of the most impressive that I have ever seen. It was breathtaking. Well worth the visit if you're wandering around the area."
        }, 
        {
            "index": 188, 
            "rating": "4", 
            "review": "Out of the way but interesting. Known to many as the Little Haggia Sofia only because it is a former church converted into a mosque. Attractive but not so stunning that it merits a lot of effort to find it -- and it is a bit away from the centre of the Sultanahmet area."
        }, 
        {
            "index": 189, 
            "rating": "4", 
            "review": "Not what I expected. Truly little Hagia Sophia. The building is a converted mosque and worth the visit. I had expected it to still be a church (for whatever reason) so the fact that it is a functioning mosque surprised me. It's also not covered in tourists, not doubt due to the fact that it is down some winding streets and closer to the old walls. A beautiful space if a little less awesome than I had imagined."
        }, 
        {
            "index": 190, 
            "rating": "5", 
            "review": "Hidden Gem!. We had a bit of a treasure hunt to find the \"Little Haghia Sophia \", Turkish friends had suggested we visit, we were not disappointed, built in 527, a beautiful mosque that was originally a church has been restored into a pint sized version of the surrounding larger mosques. It is filled with light & colour."
        }, 
        {
            "index": 191, 
            "rating": "5", 
            "review": "The best. This is something out of this world. i have never seen anywhere in the world such a monumental construction dating back to the VI century. Its really amazing.\nDo not miss it for nothing, its awesome"
        }, 
        {
            "index": 192, 
            "rating": "4", 
            "review": "Well worth a Visit. This little mosque (formerly a Byzantine church) was built by the same two guys who designed and built Hagia Sophia. They apparently used some of their construction ideas on this church as a prototype before embarking on the huge Hagia Sophia project, so its worth seeing for that reason. It dates back to the 600 AD era, but is very well restored and is a fully functioning Mosque, so no traces of its early Christian heritage remain, unless you look closely at some of the carved lettering along the balcony edge, which are in Latin and Greek. Some bright spark had the idea of building a railway line in 1870 some two metres form the structure and the resulting vibrations almost destroyed it. But its all been strenghened and shored up and should survive another 1400 years."
        }, 
        {
            "index": 193, 
            "rating": "5", 
            "review": "wrong name. Ayasofya is not cami aka mosque, it used to be a church and now it is a museum, but some mosque elements are added. All Christians must visit it"
        }, 
        {
            "index": 194, 
            "rating": "4", 
            "review": "A historical place well worth a visit. This church was 1 minute walk away from our hotel (Basileus) and it is a miniature of the big Hagia Sofia.Leave your shoes on the outside and look at all the detail inside, specially upstairs. The details in the original stonework is just amazingly beautiful.Also the \"garden\" in front of the church/mosque is interesting and looks like a small museum with all it's details."
        }, 
        {
            "index": 195, 
            "rating": "5", 
            "review": "A fine restoration. When I was last here the ceiling was showing sign of leaks with water damage of the dome particularly. The paintwork has been restored carefully and the carpets replaced. It is a good restoration as it is probable that it would have suffered if the damage had been allowed to continue. The charming old imam who showed us around then has passed on and it was busier but looks like it is being used more than it was. It is worth a visit from the Byzantine studies point of view and it has some special details like the frieze in Greek around the interior and the Justinian monogram on the capitals. The collection of Ottoman headgear on the tombs is worth a visit too. The existing tombs are good and there is a wall of recovered 'heads' on one of the side walls."
        }, 
        {
            "index": 196, 
            "rating": "5", 
            "review": "Slow down. This is certainly not as spectacular as the big attractions, but we loved the atmosphere in and around the mosque - almost village-like. The mosque is in beautiful shape and definitely worth a visit if you have time to slow down.We stayed in the courtyard for a tea and visited the craft shops, which took us all in all about 2 hours."
        }, 
        {
            "index": 197, 
            "rating": "5", 
            "review": "A spiritual journey.... I didn’t have Kucuk Ayasofya Camii on my list of sightseeing during my visit. I stumbled on it on a helpless afternoon trying to fight off jet lag. From the moment I stepped foot inside, I felt a very peaceful vibe wash over me. I felt compelled to spend nearly 3 hours just sitting in a corner. It was very quiet and peaceful. I heard a call for prayer and it seeped deep within me. It was really beautiful. Not sure it on any tourist’s list but I’d recommend visiting it only because it’s secluded from the hustle and bustle of the other tourist locations."
        }, 
        {
            "index": 198, 
            "rating": "4", 
            "review": "Serene and compact. A very pretty building that has been a place of worship for over 1500 years, first as a church and now as a mosque. No crowds, just the odd tourist and local worshippers. There's a nice little cafe over the road which has tables on the grass for a restorative tea."
        }, 
        {
            "index": 199, 
            "rating": "5", 
            "review": "quilet atmosphere. it s good place to visit a little disapointment maybe for christians cos there s not more items for christianity but shape of chrose and baptising area you can see but anyway nice place to visot and it s free"
        }, 
        {
            "index": 200, 
            "rating": "3", 
            "review": "Charming. Actually the construction seems a replica of the original Santa Sofia but not so richly decorated and spectacular. Nice and hidden."
        }, 
        {
            "index": 201, 
            "rating": "4", 
            "review": "A quiet haven. We arrived during prayer time and some how this added to the tranquility of this beautiful mosque. Take the steep steps up to the gallery for beautiful views down."
        }, 
        {
            "index": 202, 
            "rating": "5", 
            "review": "Lovely little mosque. Really nice intimate mosque after visiting the larger ones. Very few visitors here and quite peaceful. Go up the stairs into the gallery."
        }, 
        {
            "index": 203, 
            "rating": "4", 
            "review": "Beautiful mosque. Sweet little church near the sea. We liked it very much. We found it by accident when we got lost in Faith district :)"
        }, 
        {
            "index": 204, 
            "rating": "3", 
            "review": "Nice but not amazing. Maybe we had already seen too many beautiful interiors of churches and mosques but this one just failed to amaze me. Certainly it's nice inside and much quieter than the Ayasofya itself but I wouldn't call it a must-see attraction."
        }, 
        {
            "index": 205, 
            "rating": "5", 
            "review": "Our favourite. This is tremendous - mainly due to the guardian who shows you round. He points out all sorts of little features you'd otherwise miss. The Christian & Islamic features make this so interesting. Make sure you see under the rug!"
        }, 
        {
            "index": 206, 
            "rating": "5", 
            "review": "Back in history. For a Greek this church in the old town means a lot.Natives will call it the little Ayasofia and it is easy to find!"
        }, 
        {
            "index": 207, 
            "rating": "2", 
            "review": "Just a mosque, not much of a church remains. The shape and outside etc or the church remain at least little if I have right information but nowadays the building is just a mosque, and sad to say, white-washed and ugly one from the inside. Nothing heart-pounding from the outside either.Ps. Some reviewer has downloaded pictures from Hagia Sofia into this places review. I say: THERE ARE NO MOSAICS IN THIS MOSQUE/CHURCH !!!"
        }, 
        {
            "index": 208, 
            "rating": "5", 
            "review": "Kucuk Ayasofya Camii. A hidden gem in a small and quite neighborhood. It's far from the ordes of tourists and you can enjoy the peace of the interior as well as the minimal decoration."
        }, 
        {
            "index": 209, 
            "rating": "4", 
            "review": "oldest ex-church. It is an impressive thought, that this church was built in 435 AD and turned into a mosque after Mehmet conquered Istanbul in the 15th c. It breathes history."
        }, 
        {
            "index": 210, 
            "rating": "5", 
            "review": "Small AYASOFYA. You have to visit this small and very nice Byzantine church! it;s worth your time! It's in Sultanachmet area and no difficult to find it.Nowdays is working as a mosque"
        }, 
        {
            "index": 211, 
            "rating": "5", 
            "review": "So big church. This Church is the biggest one I've ever seen, and the most beautiful. There are still mosaics frescoes from the Byzantine, and they are so beautiful."
        }, 
        {
            "index": 212, 
            "rating": "3", 
            "review": "Just a nice church. Hard to find, but at the end you see a church turned into a mosque. Not bad, but not very special.there is other sightseiing to be done much more beautiful and important."
        }, 
        {
            "index": 213, 
            "rating": "4", 
            "review": "Very nice little church.. A small and well maintained Byzantine church that today is an active mosque. A place to visit if you are in the neighborhood."
        }, 
        {
            "index": 214, 
            "rating": "5", 
            "review": "Not to be missed when in Istanbul.. One of the rare site on Earth where it was once a church AND a mosque. Now a magnificent heritage museum, a monument of religious tolerance."
        }, 
        {
            "index": 215, 
            "rating": "4", 
            "review": "Amazing place. Very attractive place to be visited in Istanbul, if you are there dont return back to your country with out entering to Ayasofya... it is a place with a lot of history, Christian and Islamic one, but it is prefered to be in group to get the entrance tickets easier and get the headset to listen to the guide explanation."
        }, 
        {
            "index": 216, 
            "rating": "5", 
            "review": "Sergius and Bacchus church is a marvel. This little church is now a working mosque. A gem of early Byzantine architecture that we would never have explored without the help of Bitinya Tours guide, Ugur."
        }, 
        {
            "index": 217, 
            "rating": "5", 
            "review": "Worth the walk down the hill. WIthin a few blocks of my hotel, I wandered down the hill to the small Camii, I saw on the map. Nice little park, a few shops and galleries nearby. Sat in the park waiting for prayer to end and watched the vendors (simit, juice) gather. There are coffee shops nearby."
        }, 
        {
            "index": 218, 
            "rating": "5", 
            "review": "very old little church. Restored very simply. An exquisite church. Make sure you go up to the gallery to get a full appreciation for the space and light."
        }, 
        {
            "index": 219, 
            "rating": "2", 
            "review": "don't go!. I did not like this place at all! it was very crowded, very hot and didn't really catch my interest overall. I will not go there if I ever go back to istanbul."
        }, 
        {
            "index": 220, 
            "rating": "5", 
            "review": "A little gem. Exquisite interior, one of the gems of Istanbul, but often overlooked because of its proximity to other, grander mosques. Worth making time to visit. It's lovely"
        }, 
        {
            "index": 221, 
            "rating": "2", 
            "review": "25 Liras to see a roof. People not interested in history (like me) should not imitate most of the travelers & visit Aya Sofya museum. It has just one roof. The ticket price is extremely expensive (at least for those having weak currencies like India).Agreed that Istanbul is historic cities but it has so many other things to offer. So go & explore them rather wasting your money on roofs which don't make sense!"
        }, 
        {
            "index": 222, 
            "rating": "5", 
            "review": "Justinian & Theodora's church. The first of the churches built by Justinian in the city, before Hagia Sophia, now a mosque. A beautiful little building with an interesting dome, deeply carved tops to the capitals, and a frieze in Greek running above them. The former medrese is now converted into little workshops for artists, with rabbits and ducks in the courtyard, and there is a pleasant little cafe outside the entrance. Recommended. You can carry on to look at Constantine's sea walls, or find the equally charming Sokulu Mehmet Pasa mosque and relax on a bench in the small public park in Kadirga Liman Caddesi, which has a namazgah (open place of prayer), the only one in the city. We found all these thanks to \"Strolling through Istanbul\" by Freely & Sumner-Boyd, which was an excellent guide."
        }, 
        {
            "index": 223, 
            "rating": "5", 
            "review": "Beautiful example of early Byzantine architecture. While not comparable to the real Aya Sophia, the architecture and some of the decorations are still worth a visit. It's a short walk from the hustle and bustle of Sultanahmet, and next to the old city/sea walls of Constantinople. Entrance is free, although it's still a functioning mosque, so you will have to dress accordingly and take off your shoes."
        }, 
        {
            "index": 224, 
            "rating": "4", 
            "review": "Take a look. This little place is so quite and peaceful, there was a school attached to the building and a small graveyard on the other side.It might not be a must-see but you better take a look and combine it with nearby sites."
        }, 
        {
            "index": 225, 
            "rating": "5", 
            "review": "Much smaller and quiet than the other spots in Istanbul. For a quieter experience, and just as beautiful as the other big sites(Ayasofya and the Blue Mosque) I would come here - its simple and peaceful. Ladies: as with all mosques - you'll need a scarf to cover your head - long sleeves and no shorts! They have wraps you can borrow, but most people prefer to bring their own. Recommend."
        }, 
        {
            "index": 226, 
            "rating": "4", 
            "review": "Very interesting. It’s fantastic to see what the Byzantines built more than 1500 years ago. There’s not *much* to see in terms of details, but it’s worth the visit."
        }, 
        {
            "index": 227, 
            "rating": "5", 
            "review": "Don't miss this gem!. What a beautiful, peaceful place. Our hotel was across the street from this small mosque and I could see it from my balcony. Built in the 6th century, it is beautifully preserved just inside the old city walls. In the cloister area outside is the station where worshipers wash themselves before entering the mosque and a small cemetery. The inside of the mosque is tranquil and peaceful with beautiful windows and painted ceilings. The Imam was there to show people around and he insisted that we go upstairs to get a better look. The mosque is carpeted, but under the carpet you can feel the uneven stones that have been worn down over the centuries. After the crowds at other mosques and churches I had visited, this was a pleasant And meaningful interlude. There is no admission, but you will probably want to leave a donation to help with preservation. I highly recommend a visit!"
        }, 
        {
            "index": 228, 
            "rating": "5", 
            "review": "Do not Forget to Visit. Ayasofya is a symbol of rich turkish culture. It depicts how Turkish society progressed to become so tolerant. Very well kept historical building"
        }, 
        {
            "index": 229, 
            "rating": "5", 
            "review": "527. It is very easy to enter this building, once you have found it, look around and think it pleasant enough. Just pause to reflect that it was built in 527AD and think what was being built in England at that time. Delight at its calm and much-loved interior and hope that something you do might be remembered in 1,486 years time!"
        }, 
        {
            "index": 230, 
            "rating": "5", 
            "review": "Worth the cruise!. I've actually done this cruise twice! its the best way to start your vacation in Istanbul... the guided tours give a nice and detailed history of the surrounding sites... there is a much cheaper way to view this by taking a regular ferry."
        }, 
        {
            "index": 231, 
            "rating": "5", 
            "review": "You can actually go up!. Once you have visited a lot of mosuqes in Istanbul you normally start to wonder how the mosque will look if viewed from the gallery but alas, no way up for the tourist.This small hidden gem is wroth the while going up and down (it is close to the water but only 10 min walk from the blue mosque) if only for that reason alone. The stairs up are sometimes broken and the handrail is best irgnored but you can have a totally different perspective on a mosque from the gallery. Since it is a bit off the beaten track, it is not that rushed and you can enjoy the architecture and the beautiful silence more or less alone without the hundreds of (noisy) tourists at the big mosque. It is also situated in a small nice park so a good idea to get some peace of mind back in busy Istanbul.Of course, proper dress code is required."
        }, 
        {
            "index": 232, 
            "rating": "5", 
            "review": "Worth the effort. I had no expectations, and I found it incredible. The history, art works, different levels it made it a fascinating few hours."
        }, 
        {
            "index": 233, 
            "rating": "5", 
            "review": "Beautiful. This was one of the more beautiful mosques I visited in Istanbul. Simple and light, but still magnificent inside. Very authentic area and always interesting to see the church/mosque transitions (like Hagia Sophia and Chora). It is a quick walk from the Hippodrome (maybe 10 minutes or so) and worth checking out."
        }, 
        {
            "index": 234, 
            "rating": "5", 
            "review": "a little jewel for certain. The recently restored building and grounds is well worth the visit. The interior contains numerous inscriptions and the sheer beauty of the space is charming. The power of God is on display in this wonderful Byzantine monument."
        }, 
        {
            "index": 235, 
            "rating": "5", 
            "review": "Byzantine splendor in miniature. This little church is an absolutely wonderful example of the Byzantine architecture at its best. Built around the time of Haghia Sophia I actually think the church has areas better preserved. Not so well touristed and a must see while in Istanbul."
        }, 
        {
            "index": 236, 
            "rating": "5", 
            "review": "Little Ayasfya. This a wonderful church very well looked after and in good condition we had a very peaceful afternoon there not many people when we where there. Its beautiful you can wonder round and no one bothers you.When you have done go out in to the garden and have an apple tea enjoy we did"
        }, 
        {
            "index": 237, 
            "rating": "5", 
            "review": "Awesome. The tiles and frescos were incredible. The story of Mary was beautiful much more than I learned in 10 years of Catholic School"
        }, 
        {
            "index": 238, 
            "rating": "5", 
            "review": "Fascinating Former Church. I loved this place the last time I went, which was before the restoration, necessary because of earthquake damage. It was one of the few mosques left in Istanbul which still was floored with individual carpets instead of the wall-to-wall that is in most of the major mosques today. The only thing that bothers me about the \"restorations\" of mosques in Istanbul is that rather than maintaining the historic feel, they tend to repaint in a way that makes the interior look like it's fresh out of the box and a look at the pictures tells me it's happened here too.There's not an official fee but it's good to make a donation.The small madrassah across the way is a lovely quite place to have tea, enjoy the flowers and talk with people who practice and teach traditioal Ottoman crafts."
        }, 
        {
            "index": 239, 
            "rating": "5", 
            "review": "Very pretty. Loved this little Aya Sofia! Small, simple and beautiful. We were there late in the afternoon so it was really quiet which was nice for a change. Definitely go there it is worth it!"
        }, 
        {
            "index": 240, 
            "rating": "5", 
            "review": "Easy to overlook -- don't miss it. Just down the hill toward the Marmara from the Blue Mosque, this early Byzantine Church is unique and shouldn't be missed. It dates from before Haghia Sophia with an unusual octagonal dome and marble pillars. It is small, not overrun by tourists, with a friendly minder and nice grounds. A very meditative spot."
        }, 
        {
            "index": 241, 
            "rating": "5", 
            "review": "Ancient churches and ancient mosques. The opportunity to see so many of the founding churches of Christianity and their incarnations as mosques after the Ottoman conquest--fascinating."
        }, 
        {
            "index": 242, 
            "rating": "5", 
            "review": "Hidden Gem. Well, not really hidden, but definitely a gem. Small and tucked into a quiet neighborhood(and a block from our hotel), the Kucuk Ayasofya (the Little Hafia Sofia) was the last and, I think, the best of all the sites we saw in Istanbul. I'm ever amazed at how something so old can still be so well taken care of and accessible. It's free and beautiful, so don't miss it!"
        }, 
        {
            "index": 243, 
            "rating": "4", 
            "review": "Church of the Saints Sergius. Lovely 6th century Byzantine church, the building is a mosque now. Great place and well preserved awesome interior. Well worth a visit"
        }, 
        {
            "index": 244, 
            "rating": "3", 
            "review": "It was a nice place. we went there by taking metro and tranva and buy ticket in 25 lira and visit mostly places in side as well as we visit one musemum that collect from different messenger few things like theeth , hair and so on ,"
        }, 
        {
            "index": 245, 
            "rating": "5", 
            "review": "The 'other' Ayasofya. This place is beautiful - a 6th century Byzantine church (built by Justinian prior to the construction of the grand Ayasofya) that is now a mosque. There seem to be few visitors, so you can enter and roam pretty freely. It is an oasis of quiet in the craziness of the old city."
        }, 
        {
            "index": 246, 
            "rating": "5", 
            "review": "A charming architectural treasure!. This is a fascinating building, quietly tucked away from all hustle and bustle of the main historical sites. It was late in the afternoon and it was only me in the building. A very polite man, who was obviously looking after the mosque, invited me to get inside as I was not sure whether I was allowed to. I only had to take my shoes off (I was not asked to cover my head) and then to step inside. I was charmed by what I saw: it was an impressive mixture of two religious cultures. The building is a mosque now but the original architecture has survived remarkably well, not like the original interior decoration. It must have been a beautiful church – with the elegant two-storey colonnade and walls covered in golden mosaics (like those that survived from this period in Ravenna) and probably frescoes as well. The capitals of the marble columns are splendid and still bear the monograms of Justinian and Theodora. It was interesting to learn that this edifice is even older that one of the present museum Haghia Sophia. It was begun by Justinian and his Empress Theodora in 527, five years before the commencement of the building of Haghia Sofia itself. Likely, the Sains Sergius and Bacchus was a model for St Sophia. Today, it is also known as the Little Haghia Sophia because of its resemblance to the Great Church.SS. Sergius and Bacchus served as a church for nearly 1,000 years after its founding, but then in the first decade of the sixteenth century it was converted into a mosque. SS. Sergius and Bacchus were two Roman soldiers martyred for their espousal of Christianity. The saints were especially dear to Justinian because they saved his life some years before he came to the throne. It was my last day of our five days break in Istanbul and was really glad that I didn’t miss seeing this church. It is just less than a 10 minutes’ walk from the Hippodrome and 5 minutes from our Dara Hotel. The area, where the church is located, is residential and it’s pretty nice to see how people live there. To me this church-mosque is one of the most charming architectural treasures in Istanbul."
        }, 
        {
            "index": 247, 
            "rating": "5", 
            "review": "Another main attraction. Great museum and love the preservation they have done. Goes without saying that you need a good camera and wide angle lenses."
        }, 
        {
            "index": 248, 
            "rating": "5", 
            "review": "A little gem. Hagia Sofia and Sultanahamet get all the glory as the two large and imposing mosques located the heart of historic Istanbul. However, you would be doing yourself a disfavour if you didn't take ten minutes to walk down to what is know as Little Hagia Sofia mosque. It is often said it is a miniature version of Hagia Sofia and you do see the semblance. What I loved about it was the lack of tourists and the peace and quiet of the setting. You can walk to the upstairs galleries for a completely different perspective. A small group of young students who were studying the Koran in a corner added a real authenticity. Make time to visit here."
        }, 
        {
            "index": 249, 
            "rating": "5", 
            "review": "stunning. It was under repair (the ceiling) when I visited but, anyways, enjoyed the visit. It's magnificent, every detail is perfection."
        }, 
        {
            "index": 250, 
            "rating": "4", 
            "review": "Wonderful Building. My second time here, still such an awesome interior. The various mosaics are amazing. Well worth a visit."
        }, 
        {
            "index": 251, 
            "rating": "4", 
            "review": "Tucked away. A little off the beaten track this camii gives its name to the neighbourhood in which it is situated. You may find you can only get into it at prayer time but not a problem is you stay discreetly at the back"
        }, 
        {
            "index": 252, 
            "rating": "5", 
            "review": "A wonderful place. I found my way to this mosque on my second day in Istanbul after a very unpleasant time at the hotel. I was amazed by the peace and tranquility of this ancient building. Even the railway line which almost clipped the corner did not detract from it. I realise that it must have been like a jewel box in the Byzantine period but it is now very plain and peaceful. The charming and polite elderly man (perhaps the Imam) who stood by the door tried to point out various features of th building. It was wonderful that there were no \"guides\" and nothing was for sale"
        }, 
        {
            "index": 253, 
            "rating": "5", 
            "review": "Though small very nice to get introduced to islam. I recommend it. You will not see small mosques as complete as this one. The neighborhood is calm, nice and tourist friendly. You can walk back to the Blue Mosque area in 5 minutes."
        }, 
        {
            "index": 254, 
            "rating": "4", 
            "review": "Small and lovely. Kucuk Ayasofya was right outside our hotel and therefore was the very first spot we visited.Its relatively small and would at best take 20-30 minutes but is surrounded by a small mini market of trinket shops and cafes...Its a functioning mosque so be mindful in terms of etiquette and dressing modestly. The building is well preserved and has a cemetery behind it which has its historical importance.If you are around the sultanahmet area then its a 5-10 minute walk down hill from the hippodrome area."
        }, 
        {
            "index": 255, 
            "rating": "3", 
            "review": "cant compare to ayasofya. also called the small aya sofya, this place is in sultanahmet area. no entry ticket to pay just avoid when people are parying on friday cos it can be very crowded but above all u have to respect some strict time of visit"
        }, 
        {
            "index": 256, 
            "rating": "5", 
            "review": "a wonderful surprise. Once a church, but later converted into a mosque, Little Ayasofia is a smaller and older version of its bigger sister: this means that its beauty is much more immediate and one can more easily appreciate the architecture and decoration because it is so much closer. Of note is the completed restoration work and the excellence of the Moslem decoration."
        }, 
        {
            "index": 257, 
            "rating": "5", 
            "review": "Little Hagia Sophia. While visiting Topkapi Palace a Turkish man told me about the Little Hagia Sophia (Kucuk Ayasofya) which is located near the Blue Mosque. It is a smaller version of the magnificent Hagia Sophia but is used as a mosque. The icons and Byzantine paintings and designs have been removed. Another reason to visit is the traditional and lively neighborhood around the mosque."
        }, 
        {
            "index": 258, 
            "rating": "5", 
            "review": "Beautiful Mixture of Church and Mosque. This building was constructed at the order of the Emperor Justinian in 527 as a church dedicated to Saint Sergius and Saint Bacchus. These saints were Roman soldiers who converted to Christianity and later were martyred for their faith. Justinian credited the intercession of these saints for saving his life when he was falsely accused of treason before he became emperor. A thousand years later, after the Ottoman conquest of Constantinople, the church was converted into a mosque. The original architectural designs and structures have survived. The original mosaics and frescoes are gone, but the Islamic decorative designs and colors are striking. Kucuk Ayasofya (Little Hagia Sofia) is located very close to the Blue Mosque and Hagia Sofia. It will add to your understanding and appreciation of both buildings."
        }, 
        {
            "index": 259, 
            "rating": "4", 
            "review": "Pop in for a quick look at Hagia Sophia's predecessor, then enjoy tea in the pretty courtyard. An off the beaten track attraction, it's not a must see on a short visit but it's worth popping in for the classic sixth century architecture. Unlike in a lot of other mosques visitors can walk around the upper galleries, affording a good view of the whole building. Some unrestored areas are covered with plexiglas so you can see the what remains of the original design. Try to spot Justininan & Theodora's monogram on some of the carved column capitals.The courtyard is lovely and has a covered tea garden which is a good place to sit for an inexpensive early evening glass of tea. There are also some cute ducks who seem completely unperturbed by the local cats."
        }, 
        {
            "index": 260, 
            "rating": "4", 
            "review": "First time I saw the second floor. If you are interested in buildings you must see this mosque. Here was the only place which I could get to the top floor and had a top view of the mosque. Also, they kept some part of the real wall behind a glass on the second floor and you may find there interesting too.Another good thing about this place is its location, not too far from the other touristic sites, just near the sea and also have a Cafe just inside the mosque garden."
        }, 
        {
            "index": 261, 
            "rating": "4", 
            "review": "Worth a look. We came upon this converted mosque by chance as it was close to our hotel. We couldn't be bothered with the queues and crowds of the big brother version but here was cool, calm and relaxed. We borrowed a headscarf and wandered around going upstairs and on the balcony too. When you come out there's a pretty courtyard with a tea room and crafts to buy.An unexpected delight."
        }, 
        {
            "index": 262, 
            "rating": "5", 
            "review": "In between prayer times. They might ask you to leave and come back In between prayer times. So go for a snack, plan a second thing to do instead of visiting a mosque. The sultans palace f e will easily take you several hours because there is so much to see not only the harem :-)"
        }, 
        {
            "index": 263, 
            "rating": "5", 
            "review": "Worth seeing it!. This little church converted to mosque is a real jewel. The carved friezes atop the colonnades, the intimate feel to it and its historic importance make it a real must. The courtyard also houses a nice tearoom."
        }, 
        {
            "index": 264, 
            "rating": "4", 
            "review": "interesting. Make sure you read about its history to really appreciate the beauty of this small church-mosque. It was also our first look at a islamic .cimetary"
        }, 
        {
            "index": 265, 
            "rating": "4", 
            "review": "off the beaten track. This little mosque is a bit out of sultanahmet, but well worth a visit. I came upon it when I went exploring outside the busy touristy areas."
        }, 
        {
            "index": 266, 
            "rating": "5", 
            "review": "Appropriate clothing. A beautiful charming and very peaceful mosque .Please remember that this is a place of prayer and dress appropriately . Do not sit on the walls wearing short skirts etc ( which people do ) as this offends the locals."
        }, 
        {
            "index": 267, 
            "rating": "5", 
            "review": "Beautifully restored - a complete delight. The mosque retains the shape of the original Justinian church and there is an octagonal baptistery beside it, although the interior orientation has been changed a bit to align with the mihrab (the niche indicating the direction of Mecca) and the minbar (pulpit) where the iman delivers the Friday sermon. The interior is a total aesthetic delight, with every detail harmonising perfectly, and visitors are encouraged to go up to the gallery for more wonderful views and photo opportunities. Although there is no charge, a modest donation of a Lira or two to the mosque via its guardian would be appropriate.Dress code rules applying in smaller mosques. While the larger ones have more detailed information boards and issue plastic bags to carry your shoes around in, smaller mosques are more problematical. From my own observations 1) a woman trying to enter wearing a hat will be turned back – a shawl or scarf is expected 2) shoes should be taken off before standing on the carpet at the entrance to the mosque – I saw visitors told off for not doing this. They had reasonably assumed that they only needed to be shoeless once past the door and the prohibition is not made explicitly clear in the mosques with less tourist traffic 3) taking off your shoes and carrying them in your hands is frowned upon (while carrying them in the plastic bags provided in the larger mosques is fine)."
        }, 
        {
            "index": 268, 
            "rating": "5", 
            "review": "Better than its bigger neighbour. It is beautiful inside and you can go onto the balcony up some steps that are know carpet covered but you need to be careful.Leave a donation when you have finished and the visit the court yard were there are many craftsmen working, whose prices are quite reasonableThis mosque/church was one of the best we visited"
        }, 
        {
            "index": 269, 
            "rating": "5", 
            "review": "very good. it was very nice i took photos insude and the instruments was wonderful i really like very much also the ways which is narrow up to the second floor"
        }, 
        {
            "index": 270, 
            "rating": "4", 
            "review": "Pretty Mosque with Interesting Grounds. \"Little Ayasofya\" is beautiful on the inside and you can go upstairs as well, which is unusual. Be careful coming down the stairs! They are well worn and carpeted, so socks will be slippery. There is an interesting cemetery on the grounds as well as a courtyard filled with artists' studios. The caretaker will ask for a donation so be sure to have a lira or two on hand."
        }, 
        {
            "index": 271, 
            "rating": "5", 
            "review": "Worth visiting this small and exquisite historic church/mosque. We walked down from Sultanhamet to visit this small, historic Small Sophia. It was worth the short walk.The small mosque has a perfectly decorated interior, with features from its early Christian history, such as a stone frieze in Greek script as well as later islamic wall art with arabic script and geometric designs. After the crush of the big sites, this is a more human and peaceful experience.A recommended detour from the main tourist route, although the site is on the Longely Planet walking tour of Sultanhamet."
        }, 
        {
            "index": 272, 
            "rating": "5", 
            "review": "Worth a visit. Beautiful church, we went in the morning (around 10:30) and we were pretty much alone. Maybe the absence of crowds helped, but we enjoyed Little Hagia Sophia even more than the Blue Mosque and other top sights. Absolutely worth the visit."
        }, 
        {
            "index": 273, 
            "rating": "4", 
            "review": "Worth to See. If you have seen Hagia Sofia, you must also see the first built one. It is smaller yer worth to see."
        }, 
        {
            "index": 274, 
            "rating": "5", 
            "review": "Wonderful gem. A beautiful, spiritual and historic building.. a little gem compared with some of the larger mosques. Pity about the proximity of the railway."
        }, 
        {
            "index": 275, 
            "rating": "5", 
            "review": "Beautiful and peaceful mosque. This small mosque was just as beautiful as the blue mosque but far more peaceful due to lack of tourists. The local imam was very welcoming and showed us around. Very interesting graveyard surrounding the mosque."
        }, 
        {
            "index": 276, 
            "rating": "5", 
            "review": "Simply a beautiful gem. Worth the walk down the steep streets from the Blue Mosque. It's the same age as the larger version on top of the hill, but still a functioning, living mosque. Slightly renovated and decorated but classical proportions and an spiritual ambiance missing in some of the larger mosques."
        }, 
        {
            "index": 277, 
            "rating": "5", 
            "review": "A well preserved Byzantine church. Although it was converted into a mosque, the church is intact and well worth the search. Nearby is also the back remnants of the Hippodrome so you can see something interesting that normally isnt on view. The grounds make a nice break from the urban intensity of Istanbul. All round something a little different and off the beaten track."
        }, 
        {
            "index": 278, 
            "rating": "5", 
            "review": "Mystic place. Ayasofya is a precious thing, here traditions and religions, races and people are mixed together like the pieces of mosaics I saw there, creating a unique rainbow of colours and feelings."
        }, 
        {
            "index": 279, 
            "rating": "5", 
            "review": "My favourite mosque- small and beautiful. It is one of the o,dest buildings in the Old City, dating back to the V crntury AD. I went back again this time with my entire family and they also fell in love eith it. Nice artisan shops in the tea garden opoosite and the area is known as the artist's quarter"
        }, 
        {
            "index": 280, 
            "rating": "3", 
            "review": "Small but uncrowded. We decided to visit the \"Little Hagia Sophia\" (so called because it was also built by Justinian, along similar lines to the Hagia Sophia) before visiting some of the larger and more famous buildings. It is certainly less spectacular than the Hagia Sophia, but it has something to offer for people who are interested in older buildings. Do not expect original Byzantine architecture, however, as it has been heavily modified over the centuries, most recently to brace it against the vibrations from the railroad which runs right next to the building.For one thing, it is far less crowded, and you can take your time examining the paintings which decorate the upper galleries without feeling pushed or rushed. Although we did not have a language in common, the caretaker ensured that we saw all public parts of the building, by inviting us to climb to the gallery when we otherwise wouldn't have done so.As with all active mosques, you need to take off your shoes before entering, and women are asked to wear a headscarf. There were headscarfs you could borrow just inside the door. There is no charge to visit."
        }, 
        {
            "index": 281, 
            "rating": "5", 
            "review": "Nice little moschee. Well, everybody knows its bigger relative, the Ayasofya moschee, but this very little moschee is like a small juwel. The small garden with teahouse in front of it, with people playing cards and backgammon, the nice architecture and the peaceful atmosphere really make it a stop worth."
        }, 
        {
            "index": 282, 
            "rating": "5", 
            "review": "So beautiful!. I can't believe I've been here so many times and didn't go visit this gem. It is a working mosque, so be sure to cover up ladies. This small mosque is so beautiful and serene inside. I went just before prayer time, so only one many was inside praying. Very peaceful with fantastic architectural features."
        }, 
        {
            "index": 283, 
            "rating": "3", 
            "review": "Interesting church. Unlike the big Saint Sophia, this smaller church is located on the streets close to the sea of Marmara. It's not that big or shiny, and its not a museum but a church. It's worth a visit if you are in the area."
        }, 
        {
            "index": 284, 
            "rating": "5", 
            "review": "the kucuk ayasofya mosque was very near. only half minute.. ı likes sultanahmet area alot. especially blue mosque and ayasofya. dont foget to visit kucuk ayasofya cami whice just in front of the king palace hotel"
        }, 
        {
            "index": 285, 
            "rating": "4", 
            "review": "A real gem. Too often missed due to the 'big hits' elsewhere in the area, this church pre-dates Ayia Sophia. It is well worth seeking it out."
        }, 
        {
            "index": 286, 
            "rating": "5", 
            "review": "Feel to be in ancient times. It's really a good palce for people who love history.It is a very big place.It has lots of stony steps to go up and see the whole mosque from the top of that.When you are walking up the steps your feeling will be unique and special that you are walking where in the past many historical and critical occasions happend.You can visit some pictures from famous people the made out of cplourful stones.Also If you do not want to go up you can stay and enjoy fist floor."
        }, 
        {
            "index": 287, 
            "rating": "4", 
            "review": "Easy walk from the Blue Mosque area. This was built as an experiment for the Ayasofia. Located down the hill from the Blue Mosque. Be sure to visit the small bizarre and the huka cafe. No admission fee, just a donation. This church is a working mosque so there are no mosaics. A good place to get your tourist feet wet."
        }, 
        {
            "index": 288, 
            "rating": "5", 
            "review": "A hidden gem. Stay nearby such a Saruhan and take in a quiet and simple beauty. The courtyard next to it has great artisans. A guide will show you some of the ancient church work and ask for well earned donation."
        }, 
        {
            "index": 289, 
            "rating": "5", 
            "review": "Little Ayasofya. Tastefully restored, the subtle charm of this mosque presents a once great church built by Justinian's wife Theodora. Such a pleasure after the frenzy of the Blue Mosque and worth the effort to find it for the craft stalls and calm tea booths in the garden alone."
        }, 
        {
            "index": 290, 
            "rating": "5", 
            "review": "Gem!. liked - newly renovated, very clean, able to walk up steps over the minbar, amazing columns with latin inscription preserveddisliked - evil resident rabbit that peed on me."
        }, 
        {
            "index": 291, 
            "rating": "5", 
            "review": "seems lonely. while the Hagia Sophia and the Blue Mosque get all the attractions this lovely place seems a bit lonely, you should give a visit!"
        }, 
        {
            "index": 292, 
            "rating": "5", 
            "review": "Kacuk Ayasofya Camii. This is one of the greatest treats that the city of Istanbul can offer...It's a quiet, loving, accepting place surrounded by coffee houses and artists' studios. It's the kind of site that allows for a special level of devotion and/or \"special pleading\"--like Gobekli Tepe in Mesopotamia, the Frick Museum in NYC, Santiago De Compostela, and Cerveceria Catalana (for the best tapas in the world) or Sta. Maria Del Mar in Barcelona.\"Kacuk Ayasofya\" was the church of St. Sergius and Bacchus, the Patron Saints of the Military (the Orthodox tradition) for over 1000 years and it is still a place of pilgrimage for Christians, Sufis, poets, and secular humanists--straight and gay--as well as a fully functioning mosque. To accommodate the change from church to mosque, the orientation of the minbar and qibla were shifted off-axis and the altar removed, but this does nothing to detract from the sanctity--or balancing energy--of the place.I should also not that down the street (on a side street, 5 minutes away) is a masterpiece from the great Sinan: the Sokollu Mehmet Pasa Camii, making this a one-two punch of sacred architecture in what is my favorite city in the world: first Hagia Sophia and the Blue Mosque (5 minutes up the hill), then lunch (at \"Cesme\" down the street) and the aforementioned duo of Sokollu Mehmet and Kacuk Ayasoya...followed by \"chai\" in the garden next door. There's a day with a taste of Heaven...It's one of my favorite places in the world. True to Rumi's motto, it is a place to \"Come--whoever you are, Come!\". For any tour of Istanbul, it should be a \"must see\" (and don't forget there's an upstairs area which is perfect for reading and reflection). Enjoy--it still has a great deal to teach us...PS: One of the reviewers below mistakenly suggests that there is a cover charge--there is for the Great Hagia Sophia up the hill (now a museum), but not for this lovely shrine--it is still a place of worship. This little wonder was begun 5 years before its better known neighbor. John Romer pays homage to this \"Camii\" in his wonderful 4-part documentary, BYZANTIUM: THE LOST EMPIRE. Watching that excellent series (on dvd) would give you more than enough information with which to visit this site without a guide and enhance your appreciate of the city as a whole."
        }, 
        {
            "index": 293, 
            "rating": "4", 
            "review": "Nice and Calm, Especially Compared to the Giant Mosques. We found this mosque in our travel book, and although it didn't sound terribly interesting, it was indeed nice. It was also much less crowded than the blue mosque, so that was also a plus. We did a long walking day, and this place was a nice break from a lot of movement, heat, and noise. The interior is also well-maintained, but nothing amazing compared to other mosques in the area. Another reviewer seemed to indicate that he/she paid 25 lira, but that wasn't our experience. We just went in, and left a few lira with the attendant when we left, which is what most everyone else was doing."
        }, 
        {
            "index": 294, 
            "rating": "5", 
            "review": "transcendent. This iis a wonderful mosque first built as a church prior to construction of the Hagia Sophia. All of the things that make Hagia Sophia great were first attempted here."
        }, 
        {
            "index": 295, 
            "rating": "4", 
            "review": "fantastic place. very nice place in where you can smell history in it but you have to pay 25 turkish lira to enter i think its expensive"
        }, 
        {
            "index": 296, 
            "rating": "4", 
            "review": "Very nice. Little well decorated mosq not so well known but worthwhile. I also gives you the opportunity to get out of the crowd."
        }, 
        {
            "index": 297, 
            "rating": "5", 
            "review": "A lovely Mosque. This is a lovely, small mosque, which we liked better than all the others. A gem not to be missed. Within easy walking distance of others in Sultanamet"
        }, 
        {
            "index": 298, 
            "rating": "4", 
            "review": "Hard to Find but Worth it. This mosque had an aura of peace and serenity which makes it special. Tucked away in a warren of streets, we got lost looking for it but that may be a comment on my map-reading skills. The former church of Saints Sergius and Bacchus was built before Aya Sofya and it is on a much more manageable scale to appreciate. You feel a palpable sense of history and a connection to the Byzantine past. Don't miss the lovely courtyard opposite with the craft stalls and workshops, and a trio of noisy ducks who sheparded us off the premises!"
        }, 
        {
            "index": 299, 
            "rating": "5", 
            "review": "Hidden Gem. You probably will not see the crowds that go to the Blue Mosque so you can go any time during the day. Very serene and quite beautiful."
        }, 
        {
            "index": 300, 
            "rating": "5", 
            "review": "Little Aya Sofya. We saw this before the Big one! It is very beautiful inside and out. We loved the garden adjacent to it with cafe. A lovely cool garden setting to sit and reflect."
        }, 
        {
            "index": 301, 
            "rating": "5", 
            "review": "Very special. This is a very special place a few blocks from the Hippodrome. A Byzantine church built before Hagia Sophia, it is now restored and glorious to visit."
        }, 
        {
            "index": 302, 
            "rating": "4", 
            "review": "good but Dark. Historic place which was church before changing to mosque , The only weakness was darkness in thin place and you would have some problems to take a photo"
        }, 
        {
            "index": 303, 
            "rating": "5", 
            "review": "another great church. it is just outside of Sultanahmet area, close to the see side. it is a great little church that was build probably same times as the Hagia Sophia, now it is a mosque and it is free to visit, dont miss it."
        }, 
        {
            "index": 304, 
            "rating": "5", 
            "review": "Timless Space Suspended in Mid-Air. This building is attributed to the Byantine physician and architect Anthemius, one of the favorite architects of the Emperor Theodosius. The church is traditionally said to have been dedicated to the memory of Sergius and Bacchus, two Byzantine soldiers martyred in battle and the patron saints of the Byzantine Arym. It is now a mosque and is in active use as such by local residents. Upon entering one is struck by the symmetry and beauty of the space. The style of building, using a sort of cornice as a belt or twist tie aroung the base of the dome, i a stunning example fo the early evolutions of what became the Byzantine style of architecture later manifested in Hgia Sophia and other great buildings of the Empire. Just enter, let the space wash over you and take it all in...and please leave a few coins in the offering box of the mosque on your way out..."
        }, 
        {
            "index": 305, 
            "rating": "5", 
            "review": "If you liked the Hagia Sophia can not miss this one. This mosque is located in Sultanahmet, and you can walk to it through Kennedy walks. The mosque possesses a pleasant atmosphere."
        }, 
        {
            "index": 306, 
            "rating": "5", 
            "review": "fantastic second mosque. we love little ayasofya mosque.It is smaller than blue mosque but nice.turkish people is very luccky.."
        }, 
        {
            "index": 307, 
            "rating": "5", 
            "review": "hidden place to find. I especially love the café withits bookshops and peaceful ambience - just beside the mosque. Not many people passing by even in high season."
        }, 
        {
            "index": 308, 
            "rating": "5", 
            "review": "Very chill, take 1TL tea across the church and enjoy. Sweet neighborhood, there's a tea house with shisha across the Church, the neighborhood is very quaint and the tea house is in this small garden square that sells used books all around. You should try and stop by. Prince Charles said this was one of his favorite churches."
        }, 
        {
            "index": 309, 
            "rating": "5", 
            "review": "Little Hagia Sophia...a hidden gem. Just down the hill from the famous Hagia Sophia Mosque, near the shores of the Sea of Marmara, stands Istanbul's oldest surviving Byzantine monument. We literally stumbled upon Little Hagia Sophia at the end of a dead-end street, thought it was closed due to heavy drapings over its doors and were about to turn and leave the grounds when several people emerged from inside and around the door covering...so we entered. From its intricately-designed dome to the two-story marble colonnades, what an awesome sight! The mosque was entirely open to access, so we were able to climb the stairs to the galleries to fully appreciate the interior. We later found out from friends who live in Istanbul that Little Hagia Sophia is frequently not open to visitors, so we were indeed fortunate. A must see if possible."
        }, 
        {
            "index": 310, 
            "rating": "3", 
            "review": "No reason for taking off shoes and comming inside the temple.. I have not seen mosaics and frescoes. Temple turned to the current mosque."
        }, 
        {
            "index": 311, 
            "rating": "5", 
            "review": "Ancient church. We was curious to see this ancient church built in 527 (before the Hagia Sophia). We found it somewhat difficult to locate but our journey there by foot took us through some interesting residental areas. Some original features in this ancient building still remain and we found the visit well worthwhile"
        }, 
        {
            "index": 312, 
            "rating": "5", 
            "review": "Worth seeing. Interesting example of the Bysantine church transformation into the mosque. Not so crowded as Haghia Sophia"
        }, 
        {
            "index": 313, 
            "rating": "5", 
            "review": "Wonderful experience!. Enjoyed a concert of traditional Ottoman music. Highly recommend it! Not impressed with the Boeing banner as you walk into the church but I guess that is how they receive a lot of restoration funds."
        }, 
        {
            "index": 314, 
            "rating": "5", 
            "review": "Off the tracks. Beside the mosk which is lovely and peaceful, it is actually the whole of the area that is worth a tour. It is somehow off the beatten tracks of tourists marathon and allows you to get a fling of Stambouliote's life in the historic district. People actually live there!!! The area is not disneyland like and actually quite decayed (I guess it's not a very rich neighbourhood...) but traditionnal woodeen ottoman houses still stand all over and people do tchitt-chatt on their doorstep. That's how I pictured Istambul..."
        }, 
        {
            "index": 315, 
            "rating": "3", 
            "review": "Magnificent and very historical. This is one of the oldest among several mosques in Istanbul, the architecture is marvelous even it was a century back"
        }, 
        {
            "index": 316, 
            "rating": "5", 
            "review": "Well worth seeking out. This was a highlight of my time in Istanbul - the mosque itself is so graceful and the courtyard is an oasis of calm and peace - with ducks!I went before I visited the bigger sites (Blue Mosque) and feel that this building is far more interesting and also far more serene than the others."
        }, 
        {
            "index": 317, 
            "rating": "5", 
            "review": "The hidden tresor. Most of travelers will only visit Hagia Sophia not paying attention to the original one, Kucuk Hagia Sophia"
        }, 
        {
            "index": 318, 
            "rating": "4", 
            "review": "Lovely old church. Strangely on the side of the railway, but easily accessed and very lovely. Peaceful in a hectic environment"
        }, 
        {
            "index": 319, 
            "rating": "5", 
            "review": "A lovely spot. So glad I visited this place. It was a lot quieter than the other mosques and very elegant and simple."
        }, 
        {
            "index": 320, 
            "rating": "5", 
            "review": "Small but a must. Definitely worth seeing even if it is off the main area. Mosaics were colorful and very descriptive. The first I have seen showing the death bed of the Virgin Mary,"
        }, 
        {
            "index": 321, 
            "rating": "3", 
            "review": "Very little mosque. There's not a great deal to see - it's close to all the other sights and is worth a visit. You go through nice streets to get to it and it's and interesting neighbourhood. Very old. But the mosque itself has a very new feel to it (although it is very very old) as it's been newly refurbished."
        }, 
        {
            "index": 322, 
            "rating": "4", 
            "review": "Tucked away but worth finding. Our room at the Amira actually overlooked the 'Little Hagia Sophia' and we walked down to have a look. It was well worth it. A smallish mosque, still in Sultanahmet - this used to be the Church of Saint Sergius and Saint Baccus - it is a site with a very long history. Interesting interior with two levels."
        }, 
        {
            "index": 323, 
            "rating": "5", 
            "review": "unique byzantine church and ottoman medresse. Küçükayasofya ıs a truly beautıful churchç unıque example of Canstantınople relıgıous archıtectureö recently restoredç Around ıt ıs a tradıtıonal Ottoman era medresse devoted to tradıtıonal Turkısh artforms, ebru, calligraphy, textiles, painting, music, as well as demonstrations of traditional Sema, the turning ceremony begun by Rumi, the famous poet. the church demonstrates the importance of the congregational inclusion centered on worship, the main purpose of the Orthodox Christian dome, creating a common space under a common sky like roof or dome. the space becomes more horizontal than vertical. the floor plan based on a four armed cross with the dome creating the central common area. the structure creates a 'floating' illusion, emphasized by the horizontality of the windows. there is a lightness and airiness very different from Rome's Pantheon but a real sense of inclusion and unity unlike the Partenon or Egyptian temples based on a holy of holies. Greek Othodox churches of this period are a kind of holy space as a whole. wholeness as apposed to apartness."
        }, 
        {
            "index": 324, 
            "rating": "5", 
            "review": "Cute and worth exploring. One of my favorite spots in Istanbul. Never crowded, interesting history - thought to be a prototype for the Aya Sofya. In the medrassa area there are now little shops selling crafts and usually with the tradesmen in the shops. Opposite there is a calligraphy bazaar. It is all on a small scale so a nice change from huge monuments and crowds."
        }, 
        {
            "index": 325, 
            "rating": "3", 
            "review": "Good if you have extra time. As there are no good views to take photo, keep it for the extra days. there is a great painting art shop there, i bought a painting of istanbul from there. it is unique, however very little discount i got."
        }, 
        {
            "index": 326, 
            "rating": "5", 
            "review": "Small but good. This mosque is not as busy as the Blue Mosque and is much smaller; it has a small market of artisans around it to buy personalized Turkish art."
        }, 
        {
            "index": 327, 
            "rating": "4", 
            "review": "A hidden gem in Sultanahmet. I stayed right near this old converted church -- it is very beautiful and peaceful, and a local crafts group is located in an adjacent lot. It really DOES look like a minature Hagia Sophia from the outside!"
        }, 
        {
            "index": 328, 
            "rating": "3", 
            "review": "History erased?. Average because of a renovation that has almost wiped out all the signs of its history. Inside it looks almost brand new, not 1500 years old. This building is in fact older than Hagia Sophia. It made me slightly sad, the sterile way they have worked on the interior, no matter how beautiful the interior is though. It just clashes with all that history.It is a peaceful place though, I was all alone when I visited and afterwards I enjoyed sitting on the benches outside, watching kids playing football. There are also some beatiful Ottoman grave stones around the building."
        }, 
        {
            "index": 329, 
            "rating": "4", 
            "review": "Our closest site. This former church, the \"Little Hagia Sofia\", was very close to our hotel (The Amira, excellent) and is distinguished by its lovely red and green marble columns and remains of Greek-script relief work. The surrounding areas and little park are currently undergoing extensive restoration work. By the time you get there this may all be perfect. A gem: also make sure to see the Sokullu Mosque nearby ... fantastic!"
        }, 
        {
            "index": 330, 
            "rating": "5", 
            "review": "Little Agia Sofia. Also nearly 1500 years old, beautiful, uncrowded. Downhill by the Marmara Sea."
        }, 
        {
            "index": 331, 
            "rating": "3", 
            "review": "Historical significance aside, there is not much to see. Weary from two weeks of traveling Greece and Turkey, we came here as one of our very last stops on holiday. As such, you can't blame us for feeling a bit underwhelmed. Constructed in the era of Justinian and nicknamed \"the little Hagia Sofia\", it's a pretty little church-turned-mosque for sure. I understand that it's quite old and has survived many centuries, but it's not a major highlight. Thus, it could be easily missed."
        }, 
        {
            "index": 332, 
            "rating": "5", 
            "review": "Very beautiful and peaceful place. Pretty close to Blue Mosque (just go through Arasta bazar and you will see it, about 10 minutes walk down street). Great place to go to when you want time for yourself, far from usual noise and crowd of Sultanahmet."
        }, 
        {
            "index": 333, 
            "rating": "5", 
            "review": "Oasis of peace in the heart of Istanbul. This beautiful little mosque was originally a Byzantine church built in the 6th Century. It is one of the most beautiful buildings you will see in Istanbul. It has a little courtyard attached to it which has small workshops (handmade jewellry) and second hand stalls that are little gems - and not at all tourist traps."
        }, 
        {
            "index": 334, 
            "rating": "4", 
            "review": "A little quiet gem. I fell upon the former Church of the SS Serguis and Bacchus while I was wandering around Istanbul. The former church was dedicated to two Roman soldiers martyred for their faith. The Camii dates from 536. I walked inside and found this place to be a peaceful respite from the outside world. I was all alone and climbed up the very steep stairs to the balcony to get a better view of the interior. There I could see the lovely red and green marble columns. An intricate frieze which is over 1400 years carved in Greek mentions The founders of the church. Outside the mosque is a small cemetery and various shops of artisans where you can buy small articles. There is also a place to stop for tea underneath the trees.A little different than the Blue Mosque, but special in its own way."
        }, 
        {
            "index": 335, 
            "rating": "5", 
            "review": "Peaceful. A peaceful and silent place. Love to go there. Hope to be there more"
        }, 
        {
            "index": 336, 
            "rating": "5", 
            "review": "Worth the descent. Just 10 minutes down of the Blue Mosque you can find this jewel, not far from another must: the Sokollu Mehmet Pasha Mosque. Take a look on the graveyards around."
        }, 
        {
            "index": 337, 
            "rating": "5", 
            "review": "Down the Hill But Worth it. Down behind Ayasofia and Sultanahmet,the little precursor of Justinian's church sits beside an old courtyard of shops. Not many tourists or anybody else between you and the great reach of time and events since this dome was raised. Beneath the buildings all around you the ruins of Byzantium's vast palace are buried."
        }, 
        {
            "index": 338, 
            "rating": "5", 
            "review": "another added bonus. this is a beautiful location with a frieze comemorating Justinian"
        }, 
        {
            "index": 339, 
            "rating": "5", 
            "review": "lovely littile place. hidden in a little corner,actually a walking distance from Blue mosque,probably not more then 10 minutes walk.I like the pillars inside this mosque and the tile work obviously.Nice little cafe outside too to sit and relax."
        }, 
        {
            "index": 340, 
            "rating": "3", 
            "review": "Small and poorly decorated. We had a hard time finding the place. It is of a significant importance as a historical building but not much to see from an artistic point of view. If you are around, look for it, but don't worry if you miss it..."
        }, 
        {
            "index": 341, 
            "rating": "4", 
            "review": "I loved it. mybe because it was a rainy day and it seemed a place far from the touristic sites (... even if it's just in the old town...). Quiet and spiritual, few people ... I loved it but maybe it doesn't match feeling of common tourists."
        }, 
        {
            "index": 342, 
            "rating": "4", 
            "review": "Genuine atmosphere away from the crowds. Not as known as Ayasofya, this one is more mystique. What I liked most was the cemetary at the back, with the traditionad tombs (fesi topped for men - flower topped for women)."
        }, 
        {
            "index": 343, 
            "rating": "5", 
            "review": "try to find it. it is difficult to find any place in this district but you should try. interesting architecture, more interesting story."
        }, 
        {
            "index": 344, 
            "rating": "5", 
            "review": "Mini Aya Sophia. A very old church converted to a mosque, has been very well taken care of and maintained. The structure and interior gives a little glance of the advancement the early civilisations had. Nicely built and well preserved."
        }, 
        {
            "index": 345, 
            "rating": "5", 
            "review": "Small Gem. A wonderful small gem of byzantine architecture!\nDon't miss the galleries!\n(Beware of the local guides, they appear just helpful, but always want money)."
        }, 
        {
            "index": 346, 
            "rating": "4", 
            "review": "Little Hagia Sophia. Imagine a smaller, but better preserved Hagia Sophia. Free entrance, nice courtyard with cay bahcesi( you can drink cay, or kahve and try nargileh)."
        }, 
        {
            "index": 347, 
            "rating": "5", 
            "review": "Not as famous as most. Unexpectedly welcoming and charming. If you happen to be in the area, it is worth a stop"
        }, 
        {
            "index": 348, 
            "rating": "5", 
            "review": "Stunning and amazing from the inside. The Hagia Sophia is a must see for any visitor to Turkey. Oddly enough, the building does not look that impressive from the outside; certainly not as balanced as the Blue Mosque does. However, the inside is stunning and has great beauty and elegance from the stained glass windows to the mosaics and wall decorations. Byzantine mosaics come together with Islamic decorations, a testament to the interesting history that has unfolded in Istanbul over the centuries."
        }, 
        {
            "index": 349, 
            "rating": "5", 
            "review": "It was a admiration palac. A place Wth good mangement. I losed the pocket of my camera there and they find it and sent to my hotel."
        }, 
        {
            "index": 350, 
            "rating": "5", 
            "review": "Do not miss this place!. Fantastic tea courtyard across the mosque...and some storytelling if you're lucky"
        }, 
        {
            "index": 351, 
            "rating": "4", 
            "review": "A lovely little church-mosque.. A beautiful little church, once converted into a mosque, but now a museum. One of its secrets is a small square opposite its main entrance which is surrounded by small coffee shops and other arts and crafts shops. Still though, a very tranquil place to rest for a while."
        }, 
        {
            "index": 352, 
            "rating": "4", 
            "review": "Gorgeous!. Unlike its big sister, when we visited there was almost no-one there. This is a very beautiful building, quiet and calm and worth the short walk from Sultanahmet."
        }, 
        {
            "index": 353, 
            "rating": "5", 
            "review": "There is nothing like this. No other place I have visited has such a place like this one"
        }, 
        {
            "index": 354, 
            "rating": "5", 
            "review": "See it. Make the effort.. Because it's not on the main drag not many tourists make it a destination but they should. It really isn't too far down the hill from the far end of the Hippodrome. It is very well preserved - even to the original Greek lettering around the ceiling. It has the original gardens in tact. An opportunity to see a Byzantine church turned mosque which can be appreciated without a million tourists in front of you. Bring a guide book though or you will miss a lot of the details."
        }, 
        {
            "index": 355, 
            "rating": "4", 
            "review": "Worth a visit if you have a spare hour-- different vibe than Blue Mosque. Agree with other reviewers that finding this one if the fun part and worth it just for that reason alone. We enjoyed that the mosque felt a bit more special with so many fewer people around."
        }, 
        {
            "index": 356, 
            "rating": "5", 
            "review": "definitely worth visiting. Not easy to find but getting lost in the neighborhood was a great experience! I really felt like I was in the real life of Istanbul. This mosque is very beautiful, and adjacent former madrasa has some real nice shops with authentic merchandise. I bought there a small plate that is absolutely gorgeous and the ceramic teacher who made it was there and we had a chat for a few minutes. The garden is lovely and quiet, a nice place to rest for a while after all the touristy places just 5 minutes away."
        }, 
        {
            "index": 357, 
            "rating": "5", 
            "review": "Worthy of the Risk of Getting Lost. This edifice indeed was the main church before Ayasofya was built in Byzantine times and naturally, it still preserves its grandeur. After the conquest of Istanbul, it was converted into a mosque and today it still serves as a mosque. It's quite hard to find and is definitely (and unfortunately) not a main touristic destination today but it really worths the effort to find and visit. The architecture is visibly that of a church but combined with Islamic additions after the conversion to a mosque, it's quite mystical in terms of atmosphere. Don't miss this beautiful edifice once you are in Istanbul...."
        }, 
        {
            "index": 358, 
            "rating": "5", 
            "review": "A gem of a discovery. This ancient church, today a mosque, has recently been restored. The layout of the old church of Sts Sergius and Bacchus is clear and if you have been to Ravenna, it seems awfully familiar. The cleaned brickwork and attractive light make it a fine destination. The lack of many visitors is a dream after the bustle of the usual tourist sights. An upper gallery from its Christian era (today for female worshippers) gives excellent views down on to the main area of the mosque. Take a tripod to capture the best pictures of the inside. The caretaker is very proud of his building and will happily talk for hours, especially if you can chat to him in Turkish."
        }, 
        {
            "index": 359, 
            "rating": "4", 
            "review": "Interesting experience. This odd little church/mosque is located in a working-class part of town, somewhat off the beaten path--bring a map or you may very well get lost, although the building itself is hard to miss. The elderly imam/caretaker doesn't speak a word of English but that didn't stop him from talking to us for a good 5 minutes anyway. The building is beautifully restored and interesting to stroll through. All in all we found it worth taking the time to find and look at. Also, the ruin of Bucoleon Palace is close by, but it too is rather hard to find."
        }, 
        {
            "index": 360, 
            "rating": "5", 
            "review": "a jewel. This little jewel is hidden away, and takes some finding, but your efforts are well rewarded.Bult by Emperor Justinian before the Aya Sofia and dedicated to Saints Sergius and Bachus, it was converted to a mosque after the conquest. Recently renovated and recarpeted, the interior is stunning in its harmony and simplicity. Unlike the Aya Sofia which is dark inside, this is flooded by natural light. The garrulous old caretaker demanded baksheesh, but his performance made it worth the cost.We were the only visitors there and enjoyed the serenity which infused this sacred space."
        }
    ]
}