{
    "category": "Istanbul", 
    "entity": "Rahmi-M-Koc-Museum", 
    "avg_rating_stars": 4.722748815165877, 
    "review_count": 422, 
    "rating_stats": {
        "poor": 2, 
        "average": 17, 
        "terrible": 0, 
        "very_good": 77, 
        "excellent": 326
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "One of the best in the world... Koç family, particularly Mr. Rahmi Koç is the greatest philantrophist in Turkey. Besides many cultural activities, museums and foundations they have created this ecclectic museum that encomposses industrial and manufacturing history with unique and priceless examples.From naval ships to submarines, old tailor signs to classic cars and many more.It is a once in a lifetime experience which you should spare at least one full day.It is also a shining monument to Turkish Museum inventory many to the world's..Karaca B.from Constantinople."
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "industrial history museum. items on show range from typewriter to navy submarine. interested in mechanics, this museum is a must to see."
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "Very good Experience. the museum having different section as you can see the old cars and old boats old airplanes old ships and there is section for kids they can enjoy playing and drawing with colors."
        }, 
        {
            "index": 4, 
            "rating": "5", 
            "review": "Don t miss. It s a very good idea to take your family to Rahmi museum,there s has a lot to c there,.. toys,cars boats ,cars etc,you can spend their easily 3 to 4 hours,I recommend you to go on weekend day ,to have the opportunity to have a short golden horn trip (35min), by using the old boat (Rosali),and on the same time to use the old train in a short trip."
        }, 
        {
            "index": 5, 
            "rating": "5", 
            "review": "great. Great museum, can spend whole day there. The best part is visiting of real u-boat (for additional fee)."
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "Excellent and well organised. I extremely recommend this museum for old cars lovers. For all other people of different agess this place is full of history and entertainments.My wife, small child and I have enjoyed it so much."
        }, 
        {
            "index": 7, 
            "rating": "5", 
            "review": "Best Industrial Museum in Turkey. It is the best museum I have ever visited. 27.000 square meters need a full day. I definitely recommend below:1. The submarine experience- you need to buy an additional ticket from the desk. 2. Historical tram trip on the coast of golden horn- you need to get a voucher from the desk- free of charge. Both submarine and tram are scheduled tours so you need to check the hours so you experience both of them. 3. Dc-3 airplane that you can visit interior as well. 4.Cars like ford t, trabi,etc. 5. The original telegram patented by Edison. On top of everything, you have the option of parking free of charge."
        }, 
        {
            "index": 8, 
            "rating": "4", 
            "review": "An industrial museum. This is a museum full of cars, machinery, scientific developments and even a submarine. It is near the seaside. Easy to go and spend relaxed time, especially if you are interested in technology. This is also a favorite destination for school trips. Te museum has facilities that you can organize business events like reseller meetings and has got the catering facilities."
        }, 
        {
            "index": 9, 
            "rating": "5", 
            "review": "An interesting museum . Very interesting museum full of beautiful cars planes trains boats and a submarine with a full historic review of each one of them A must see if you are in Istanbul"
        }, 
        {
            "index": 10, 
            "rating": "5", 
            "review": "A must see in İstanbul. The exceptional collection of the Koç family has been well displayed and is an amazing array of things to see. Highly recommended especially alot of fun for kids. My grandsons had a marvelous time and would like to go back again."
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "a personal collection became an incredible museum. I have been here three times and each time I discovered different things. one day is never enough to go into details. you will see a great collection of things from various parts of the world."
        }, 
        {
            "index": 12, 
            "rating": "4", 
            "review": "A nice collection of historical craft. As you wind your way up the Golden Horn, the Rahmi m> Koc Museum is a good place to spend an hour or so. The collection includes a Turkish submarine, locomotives, historical boats of the Bosporus, and much more. The cafe on the Halic is also a pleasant place to grab a drink before continuing on your journey. Worth the stop."
        }, 
        {
            "index": 13, 
            "rating": "5", 
            "review": "Prepare for a long, joyful and informative day. Rahmi Koç Museum is a very joyful and informative place for both children and adults. Don't miss to book the free of charge train in the information desk. You should visit the submarine. Master Captain Mr.Oğuz İşleyenel guided us and gave a certificate as a souvenir which kids liked the most. They wished he was their teacher at school. Thank you :)"
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "Nice. Very interesting place o to visit both for adults and kids. You must spend almost all day to see all the museum offers"
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "Koc Museum one of the best places to visit in Istanbul.. The Koc museum is a technology museum full of, historical mechanical, electronics parts, cars, bicycles, boats, ship models, even a submarine and a classical Istanbul city ship. Is has a nice part for kids where they can see/experience some scientific games/experiments. Nice cafes inside. You can combine your visit with Miniaturk which is very close."
        }, 
        {
            "index": 16, 
            "rating": "5", 
            "review": "Incredible, amazing!!. I knew about the Koc museum from reports by members of family and I was looking forward to visiting it. I had already seen part of it from the water. And it didn't disappoint me at all. It is incredible what a person's generosity can do when we follow our dreams and passions and share them with other people. It's really overwhelming the number of things you can see, admire, learn from ...there. And it's so well taken care of!! Highly recommended."
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "Fascinating . Visiting Rahmi m. Koç museum both in Ankara and Istanbul was a bold part of my trip in turkey. I think it would be a nice experience for any one interested in technology history and Models. There are many nice and unique still models, working models and real pieces of technology and design. The museum in Istanbul have a bigger collection of unique cars, boats, ships and also a nice submarine which served at 2nd world war.... don't miss it. You can spend a full day on this."
        }, 
        {
            "index": 18, 
            "rating": "5", 
            "review": "One of the Best Museums anywhere. A private museum of Rahmi Koç, celebrated Turkish industrialist. The museum features many personal items of Rahmi Koç and also other items collected or loaned to the museum.Collections include a very large number of cars, motorcycles, horse-drawn carriages along with trains, boats & ships, models, a submarine and 4 aircraft to name but a few.I visit this museum often both alone & with friends who visit my family. I never tire of visiting as its such a nice museum & very interesting. It's possible to spend full days there.Discount available for Istanbulkart, but nothing to worry about. It's great value.Highly Recommended visit when in Istanbul."
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "for families. This is a very special place for the families .You can stay there long time with the children they will like very much."
        }, 
        {
            "index": 20, 
            "rating": "5", 
            "review": "Very big private musem. The museum has a real sub-marine, a big ship, a plane, lost of trains and very old cars. They have a good collection of cars. Also there are near history technological stuff."
        }, 
        {
            "index": 21, 
            "rating": "5", 
            "review": "One of the best science/ industry museums. Having been to science/car/ rail/ ship and industry museums from Santiago to Sydney, have to say this is one of the worlds best. Huge car, bike, train, tram, plane etc collection, and across the road in the old building, amazing museum of everything from cinema to household appliances. Catch the ferry up to the door."
        }, 
        {
            "index": 22, 
            "rating": "5", 
            "review": "What a great museum.. After reading about this museum we took the local bus from Eminonu. The Rahmi M. Koc Museum is a must for lovers of anything with wheels. Vintage and classic cars, motorbikes, trains, boats, toys etc etc. A fantastic collection that is well set out and beautifully displayed. Be prepared for a long visit."
        }, 
        {
            "index": 23, 
            "rating": "5", 
            "review": "Must visit kids destination. kids like all sections very much specially the IQ games section.wonderful atmosphere , i liked the cozy cafe at old cars section very much."
        }, 
        {
            "index": 24, 
            "rating": "4", 
            "review": "Beautiful!. It was a very short visit, a prize ceremony and concert, and a cocktail beforehand. But it is a nice place, beware of the traffic while going there."
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "Best car,boat,and train museum ever!. Great way to spend a rainy day in Istanbul. More cars, boats, and trains then I have ever seen in one museums. There is a motor demo teaching how cars work. There were brides and grooms everywhere getting pictures made by red sport cars. My husband was climbing up and down very happily. Lots of kids having fun. Spacious and clean. Don' miss it."
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "Different kind of museum. This one was really cool for the kids! Mr. Rahmi Koc was quite a collector and this museum has everything from cars, bikes, boats, aircrafts, horse drawn carriages, baby cribs, ........ the list goes on and on and on!!! Must Visit!"
        }, 
        {
            "index": 27, 
            "rating": "4", 
            "review": "NIce...... Nice museum with a lot of stuff to see.....We loved the classic cars and boats.... A nice place for history lovers"
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "Lots to like and easy to get to. Truly a must see museum to break up the tedium of the usual stuff. This is a conglomeration of classic cars, planes, a submarine, and classic boats with a plethora of other things like engine cutaways, models of boats. The museum is easily reached by ferry and the ferry drops on right at its door.We had lunch just across the street a half block down the side street facing the front of the museum) at Lale Locantasi. Lale is a homey non-tourist place that has a cafeteria style selection so pointing and getting is easy. quit reasonable and very good food. When we told the waiter we were too full to have dessert, he came back with a crumb cake and ice cream dessert gratis. Nice."
        }, 
        {
            "index": 29, 
            "rating": "5", 
            "review": "it was a big surprise. i didnt know that turkey had industries, well at least the way we call them in the west...but its a good family outing for the day."
        }, 
        {
            "index": 30, 
            "rating": "2", 
            "review": "Private museums?. Similar to Sabanci Museum.Like a trophy wife...Google their permanent collection, findings willeither convince you to visit this museum or skip it..."
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "Amazing. The Koç Family has an amazing collection which also can be considered as history and development of turkey. You can see machines, how they work, the big authentic car collection and memories of family members. A must see."
        }, 
        {
            "index": 32, 
            "rating": "4", 
            "review": "The kids love it!!. It was a very educational trip because my children learn a lot about the history of transportation in Turkey and the world in general.They have a VERY good range of transport collection and information.The design of the museum is also pretty.. they also have a section on how machines we use work in our daily life (car, dishwasher, oven, vacuum cleaner washingmachine, car and lots more) which was interactive by pushing the button. Interesting!!They also have one corner display about planets.we love the museum!"
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "children's delight. we went on a ferry that goes along the Golden Horn. It's a museum of wonders, technology, industry and lots of fun.. good food,too."
        }, 
        {
            "index": 34, 
            "rating": "5", 
            "review": "Must go. I am an engineer so definitely it is of much interest for me. This is a very nice place for people to see history of mechanized world. Here you get opportunity to see how mechanical machines are working. Submarine tour is a must who did nt have before"
        }, 
        {
            "index": 35, 
            "rating": "5", 
            "review": "Nice collection worth seeing. If you are interested in cars, do not miss it! This is a one impressive collection. There is also a nice restaurant on site by the seaside if you need nourishment - a bit on the posh side."
        }, 
        {
            "index": 36, 
            "rating": "5", 
            "review": "Extraordinary. This is an interesting collection of everything realised by one of the top industrialist in Turkey.Ranging from,vintage cars,aircraft,submarine,machines,railway cars,you name it.Very well preserved and kept in the right environment.It also has a fantastic restaurant by the Golden Horn waters."
        }, 
        {
            "index": 37, 
            "rating": "5", 
            "review": "Terrific collections of cars, trolleys, boats, technology. Interesting to read about Koc on internet since museum tells very little. Had friendly, helpful staff and restaurant on the water was nice. The collection of cars and boats and trolleys was impressive as was the interactive displays for kids. Museum can be seen in 2 hours comfortably. The collections were well displayed with good information in Turkish and English on most. Having been to the most popular attractions in Istanbul previously, it was a real gem on a trip with limited leisure time."
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "Interesting g. Really interesting couple of hours spent here was good knowledgeable staff would recommend a visit you won't be disappointed"
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "Wonderful!!. I was so glad we scheduled visiting this museum on a day when we didn't have any other planned activities to do since I wanted to spend as much time as I can here. I place is big, consisting of 2 buildings and a huge outdoors space. It consists of model for mainly transportation methods (cars, trains, buses, planes, ships...) but also contains other subjects such as the 'How it Works' and 'Old Shops' sections. The place also has a submarine which can be toured (with a separate ticket). The place is really informative and would be perfect for young children and adults alike."
        }, 
        {
            "index": 40, 
            "rating": "5", 
            "review": "Excellent. Love to see all the structures based in turkey. Can see whole turkey in one place that too very closely."
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "Brilliant place. I only heard about this place via a guide book and since I was at a loose end over a weekend on one of my many business trips to Istanbul I thought I would give it a go. My, how I was surprised. First of all I was amazed now inexpensive it was @ 15TL, the submarine was an additional 7TLSecond it is big covering a large area of ground on two sides of a road, some indoors and some outside.Third it has many sections, if you are not interested in one subject just move on to the next. If you are interested in anything mechanical there is bound to be an area to impress you.I spent about 5 absorbing hours looking at the extensive exhibitions of transportation, cars, motorcycles, farm machinery, model trains, horse carriages, boats, planes, toys, engines, reconstructed shops, models, model ships, the list goes on.I would say most items are from the 19th to 21st century and collected by the museum's namesake for their mechanical and historical significance.  The submarine trip was Ok but only in Turkish. I was given an English schematic and the official at the back of the tour did try his best to explain what things were, fortunately I have been round many WW2 subs and knew what to expect and roughly what I was looking at. At the price of less than a cup of coffee in the UK it was worth it.The place is good for children as well, having both a purpose built area exploring mathematical principles with colourful hands on experiments, and a number of interactive displays around the place. Even a small, realistic ships bridge with real controls where you could play with all the levers, wheels and buttons but that was tucked away in an area of masses of models of past ships which is a shame since that is probably not a section you would think of going with children. Signage is good in Turkish and English throughout.There is a snack bar on an old ferry , the food is homemeade, quite reasonable quality and dirt cheap at 4TL (= 1 GBP) for a baguette and some tea. The narrow guage railway trip wasnt really worth the effort , since it only went a few hundred yard in a park area beside the golden horn and back but it was free, so no compaints. The location was not easy to get to. Most people appeared to be locals who arrived by car. I actually walked the 5 miles each way from my Taksim hotel but not an easy walk. I presume taxis are are an option but I didnt see any nearby when I returned. If I could read Turkish there may be public transport options I missed.A really fascinating day out and glad I didnt miss it."
        }, 
        {
            "index": 42, 
            "rating": "3", 
            "review": "Nice but could be better. Definitely worth a visit if you love cars, don't bother about the 3d movie, it's all in Turkish, I regret getting on the submarine as again the tour is all in Turkish..."
        }, 
        {
            "index": 43, 
            "rating": "5", 
            "review": "Amazing Collection of Boats and cars. Don't ever miss this museum while in Istanbul. I would like to start with the educational and historical trip they have through the galaxy, creation, computer evolution, car motors and home appliance working in a perfect demo mode. Don't miss the submarine."
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "Amazing family day out. The Rahmi Koc museum is a paradise for lovers of old technology from tram cars to boats - and even features a real American WW2 submarine and a decommissioned Istanbul ferry! great restaurant also and lovely location on the Golden Horn."
        }, 
        {
            "index": 45, 
            "rating": "5", 
            "review": "For mechanic and technology lovers. This is one of the newest museums in Istanbul, almost 30 years old, the automotive and naval departments are very interesting. The museum area with various open/closed areas also hosts catering events, including weddings."
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "Very interesting museum. I want to thank the owner of this museum Mr. Koc!It is interesting to look at the different type of exponates: cars, trains, air planes, even real submarine!We had a nice and pleasant time when visited the museum despite nasty and cold weather! Recomment it!"
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "Great!. Great collection of artefacts, big and small. Loved the dollhouse collection, the boats and the trains"
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "Off the Tourist Route. This detour is worth your while. An unbelievable collection of cars, boats, planes, trains, buses...all kinds of memorabilia....even a ferry boat and submarine docked on the Golden Horn. Give yourself half a day here."
        }, 
        {
            "index": 49, 
            "rating": "5", 
            "review": "Amazing museum. Full of interesting pieces and the attention to detail is wonderful. You need a good couple of hours to walk through the entire place. Very glad we found this museum (quite by accident)."
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "Technoly museum park. A fantastic tour in a beautiful site. Very interesting collection of different technolgies pieces. A pleasant way to pass half of a day outside the busy center and enjoying the Bosforos view. We had a light lunch in the local restaurant which was also ok. Try to reach it by the local boats."
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "Best places for old cars and dioramas. A very big museum that offers old cars, trains, planes and even a submarine. Beautiful examples of dioramas can be seen. It is just by the Golden Horn, with the lovely view of mosques you complete your visit in 2 hours."
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "A veritable gem. We didn't know about this museum beforehand just saw the boats as we went past on the ferry. It is excellent, based on one man's personal collection it still has that snse of personal involvment you often don't get in large state or municipal collections. The stuff that's there is there because it fascinated Mr Koc, his spirit is in the collection. Must-see? the beautifully restored Fiat railcar. Don't forget there's another building across the road with a wonderful collection of ship, loco and plane models as well as an excellent recreation of a ship's bridge. Do allow yourself at least three hours for both sites, they are well worth it."
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "Amazing Museum. A visit to this museum complex is really an amazing experience and try to give yourself a lot of time to visit. This museum is over a huge area and some parts are outdoors. It is dedicated to the history of transport , industry and communication and there is something for everybody. The displays are beautifully done and you will find items from miniatures to full sized boats and planes. There is various places to stop for something to eat or drink in different price ranges. I think for children this will be an exciting place to visit as they can partake in much of the exhibits. From Eminonu take bus 47, 47E or 47N and get off at the Kirmizi Minare stop or Ferry from Besiktas or the Big Bus Blue Route sightseeing tour. I can highly recommend this museum."
        }, 
        {
            "index": 54, 
            "rating": "5", 
            "review": "Sunday tour. What a wonderful place if your in interested in all modes of transportation. cars,carriages,boats,ships,aircraft were all present. the is one of the best transportation museums i been to offering something for every person. Bridal couples of Istanbul love to use this site for their weddings photographs. This must be on your agenda when visiting istanbul. this place is easily access using the hop-on hop-off red bus service"
        }, 
        {
            "index": 55, 
            "rating": "4", 
            "review": "A MUST SEE. This Museum was an added bonus when we were just filling in the day before leaving Istanbul. It satisfies the motoring enthusiast, train enthusiast, Doll house enthusiast and every one in between. We only had an hour to spare but could have spent the whole day."
        }, 
        {
            "index": 56, 
            "rating": "5", 
            "review": "Great place. Whenever I go to istanbul this is the place I go every single time... Great place espacially for young children and for every age... The trains, cars, undersea part, dolls and much more... Just go and see and you will always remember as a good memory"
        }, 
        {
            "index": 57, 
            "rating": "5", 
            "review": "must see!. heaven for children and even adults! Thanks to Koc family for this museum; every time we visit it's a new journey!"
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "Highly recommended!. Awesome place to visit. Lots of things to be seen. It is well organized! I love the way the historic and modern transports being displayed. Toys are also included. It's a big place. It has been divided into few section based on type of transportation. At least we need to spent the whole day at the musuem. Its worth it. Dont miss the submarine session. You dont get any kind of chance to be in the submarine.Overall, dont miss this place whenever you visit Istanbul."
        }, 
        {
            "index": 59, 
            "rating": "5", 
            "review": "Not to be missed. You might think \"I'm from Chicago, or New York or Boston, what could they possibly show me at a Technology Museum in Istanbul? This was one of the best I've ever visited. They have a wide variety of excellent exhibits from Automobiles, to Olive Oil processing equipment. Visit the submarine, the man who escorts you is great, knowledgeable and fun. Not to be missed, especially early in the morning when they open, and on rainy days."
        }, 
        {
            "index": 60, 
            "rating": "5", 
            "review": "Hard to find, but do not miss this vestige of a summer palace.. Take a taxi, and listen to the guide explain the history of the place. Worth the visit to see the intimacy of a domestic retreat as the Sultan promoted the work at the adjoining shipyard."
        }, 
        {
            "index": 61, 
            "rating": "5", 
            "review": "Fantastic place - something for everyone. Discovered this place by accident whilst on a ferry - you can easily spend all day here (I'd suggest bring your own lunch) - the museum is huge and eclectic (private collector).It's an easy ride on the ferry from the centre of Istanbul and be prepared to be amazed and visually exhausted by the end of day ! (in a good way) - You might have to drag the children away (I saw several crying on leaving !)It's not just for boys toys, there are lots of interesting exhibits, done in an immaculate fashion to an incredibly high standard. Strangely exhilirating place and very unusual.Highly recommended (and I'm not a trainspotter)...."
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "Must see for everyone. the most under rated attraction of istanbul, the tour of the submarine and the dc 3 dakota is a must"
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "Super interestig visit to the many technical attractions of this <museum. You can find in this Museum almost everything old : cars, trains, boats, plants,a plane, and even a real submarine !"
        }, 
        {
            "index": 64, 
            "rating": "5", 
            "review": "A must for boys between 3 & 100 years old!!. This is the most amazing place I have visited in many years. Theis museum has it all, boats, cars, aircraft, machines. Many in working condition- from old steam to wood cutting, it is all there. This is a must, an absolute must and I am surprised that there is so little promotion done for this venue. The venue is accessable by either ferry or bus. It is a huge complex and needs many hours to visit. There is a little of everything and I mean - everything- from coaches, bicycles, baby prams, old military XRay trucks with huge batteries and and and. Go and see, view where what we take for granted today has come from."
        }, 
        {
            "index": 65, 
            "rating": "5", 
            "review": "Fantastic museum. The museum is easy accesible and the tickets cost almost nothing. We were a group of foreign student and they accepted our student id-s. The museum is awesome, there are large collections of cars, trains, boats, motorbikes and even planes and a submarine. You can step in many of the vehicles and take pictures everywhere you want. This is definitely a hidden tresure of istanbul and may be te best part of our week spent there."
        }, 
        {
            "index": 66, 
            "rating": "5", 
            "review": "fantastic museum of transport & technology. Amazing place, i saw it as i went past on the Big Bus Tour one evening, and went back the next morning. the bus stops right outside,and we went to the model village just before. Its a huge place with trains boats, submarines, cars, trams. also there are dolls houses, toys, and another section across the road that I did not have time to visit."
        }, 
        {
            "index": 67, 
            "rating": "3", 
            "review": "If you are interested .. go !. If you are seriously interested in following the development of the transportation facilities, visit this museum .. otherwise, don't waste your valuable time.The museum has a big number of different kind of vehcles, bikes, ....etc but lined up in such a way they are very close to each other.The easier way to reach the museum is by taxi."
        }, 
        {
            "index": 68, 
            "rating": "5", 
            "review": "Nice museum. Great museum at the center of Istanbul.Suggest to try the indian restaurants around the place.Nice sun reflection."
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "Don't miss this!. One of the very best transport museums anywhere - stuffed with cars, boats, aeroplanes and even traction engines. Easy to get to from the Galata ferry stop and great value for money. Even if you only have a passing interest in transport, do not miss this museum."
        }, 
        {
            "index": 70, 
            "rating": "4", 
            "review": "An October Sunday afternoon in Rami Koc Museum. The museum is in the shores of Halic. You can visit it easily with a taxi. in case of rain you can visit the interior part with the cars. This is a very interesting collection with cars from the past like Ford T to modern luxurious ones. There are also carriages, boats, airplanes and even a submarine. This is a world war II submarine used then by the Turkish navy. I dont recommend a visit to this to very tall persons or people who suffer from cleistophobia. The visitors can take photos in all exhibits of the museum, but not in the submarine. The visit its worth only if you have seen already all the principal sights of interest of Istanbul."
        }, 
        {
            "index": 71, 
            "rating": "4", 
            "review": "You will like it. Istanbul has enormous number of museums. Depending on your intereststhis is a nice one. You will like it for sure."
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "Top quality museum good restaurant. Very interesting items from all around the world are put together in this industrial museum. A good collection of antique cars, bikes, boats and various other items are very interesting for kids and adults. The restaurant is very pleasnt with a superb service."
        }, 
        {
            "index": 73, 
            "rating": "5", 
            "review": "excellent. A really nice surprise, lot and lots of old cars, trains, trolleys, planes, and on and on. Really surpassed my expectations. Accessible by slow local bus but I would recommend taking a taxi for about 3 USD from Beyoglu."
        }, 
        {
            "index": 74, 
            "rating": "3", 
            "review": "Rahmi Koc Museum: interesting. If you're interested in one of the early industrialists of Turkey, go. It contained a personal history -- not much of a history of industrialization in Turkey as such. Good place to visit if you're interested in this guy's life.If I am not mistaken, there was a train outside that might appeal to toddlers. That was one of the highlights for my five year old niece!"
        }, 
        {
            "index": 75, 
            "rating": "5", 
            "review": "Nice Place. We went there after Golden Horn tour. It was really amazing. When you to Old Town you must visit museum."
        }, 
        {
            "index": 76, 
            "rating": "5", 
            "review": "Beyoglu - A must after visiting Taksim.. Beyoglu is a very vibrant and exciting area.The walking street offers many goods and services and the vintage trams which are called funiculars run right through the street."
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "Very Nice. I loved the Rami Koc museum because of its original art. I loved the design on the top of the dome and appreciate my girlfriend to have recommend this museum for me. I visited blue mosque and suleymaniye and want to say that this is also a must see museum in my opinion."
        }, 
        {
            "index": 78, 
            "rating": "4", 
            "review": "Peculiarly Good!. A feast of information and transport! Eclectic, interesting and well signed in English, there's a little bit of everything here, plus excellent places to snack or dine. Allow several hours!"
        }, 
        {
            "index": 79, 
            "rating": "5", 
            "review": "Great place!!!. Great place to visit, many interesting thins to do here.Very well maintained also!The submarine visit was the best part, unfortunately the guide was only in turkish language."
        }, 
        {
            "index": 80, 
            "rating": "5", 
            "review": "Fun museum for all.. At the moment there is a special exhibition on doll houses. I particularly liked the little scene of a Turkish drawing room complete with nargile pipes and coffee. Regular exhibition includes boats, trains, aircraft and brightly painted and restored cars. Kids will like it as much as adults."
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "Are you a sailoror boating enthusiast ? This place had you in mind.. Very well done. Preserving best of Istanbul in a well organized modern structure. If you were there 30 years a go you will not be disappointed. If you are there for the first time, you will appreciate the wonderful life Istanbul use to have while enjoying modern cosmopolitan city."
        }, 
        {
            "index": 82, 
            "rating": "5", 
            "review": "The most underrated and best kept secret in town,a must visit. perhaps the best kept secret in Istanbul. A huge mueseum with something for everyone(my wife loved it after not really looking forward to it) It must have 20 aircraft,50 cars 12 boats ,plus steam engines. Also the largest collection of dolls houses you will ever see and,oh yes,not to forget a massive submarine you can tour from end to end for just an extra 5tl !"
        }, 
        {
            "index": 83, 
            "rating": "5", 
            "review": "amazing collection. Gorgeous museum easy to reach with very low entry fees. It has lots old-style cars, models. We really enjoyed it. amazing collection"
        }, 
        {
            "index": 84, 
            "rating": "5", 
            "review": "Excellent place to spend a day or two. Gorgeous museum with plenty of working mechanisms, old-style cars, boats, models. Great place for take your curious children to."
        }, 
        {
            "index": 85, 
            "rating": "5", 
            "review": "fantastic ..just go and visit it. amazing place ... fantastic its indeed a mirror of the industrial legacy....there u find old cars ships metros motorcycles airplanes ect ......"
        }, 
        {
            "index": 86, 
            "rating": "3", 
            "review": "industry revolution age. Interesting museum, especially for middle ages, you can see a lot of historical equipments, also in the museum there is cafe, and there is car park area too."
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "Great place to visit with children. The museum is very easy to reach, cost of entry is almost nothing, and the collection is amazing. My son had a great time."
        }, 
        {
            "index": 88, 
            "rating": "3", 
            "review": "Visit it when you have enough time .... go with family. If you have enough time in your plan for Istanbul trip , you can add it in your schedule , especially if you are addicted to old cars .You have to ask about the public transport to reach there ."
        }, 
        {
            "index": 89, 
            "rating": "5", 
            "review": "Kids will be amazed. Interactive history and science museum. Kids love it. On the Golden Horn. Wheel-chair friendly. Follow their site for novelties."
        }, 
        {
            "index": 90, 
            "rating": "4", 
            "review": "Surprising and very enjoyable.... I visited the museum several times in the last 15 years. Every time I went, I found sth. new. A museum is continuously improving itself. Wonderful Golden Horn view. If you have children do not miss this place..."
        }, 
        {
            "index": 91, 
            "rating": "5", 
            "review": "One of Turkey's Most Interesting Museums. They even have a submarine tour!If you are interested how the machines at your house such as tv, dish washer , etc. works, and love to see old model cars, airplanes, even trains you have visit Rahmi Koç Museum."
        }, 
        {
            "index": 92, 
            "rating": "5", 
            "review": "Excellent Transport and Technology Museum. Superb array of vintage cars and buses.Beautiful locomotives, stylish railway carriages, and old trams.Well-maintained ferry and motorboat exhibits.Aircraft from the golden age of aviation.Old toys of all shapes and sizes.Model classic ships and locomotives.Tribute to Turkish cinema.Vintage Coca Cola memorabilia.Football signed by Pele.Vintage cameras, phonographs, tape recorders, typewriters, telescopes.Steamboat and miniature British steam train rides available.Waterside cafe and restaurant.And, you can go inside a World War II American submarine!Why wouldn't you go there?Best way to go there? Take a ferry from Karakoy, Eminonu or Kasimpasa pier, on the Halic Hatti Line and get off when you see the submarine i.e. at Haskoy. Ferries take 20 minutes (timing from Eminonu) and run hourly so check the timetable online.The museum has its Technology annex across the road, so don't forget to do that bit. Great trip for families or anyone interested in pretty much anything.You can literally spend hours there without getting bored, and the admission charge is very reasonableGive yourself a whole day and include riding the ferry on up the Halic (also known as the Golden Horn) to Eyup, a fascinating place with an historic mosque and loads of restaurants. Ferry fare is the same as an Istanbul bus fare! It makes a nice, tranquil change from the hectic tourist sites of Istanbul. Just go there...."
        }, 
        {
            "index": 93, 
            "rating": "5", 
            "review": "Beautiful collection, very modern, well kept museum. Far from being a boring museum about the principles of physics or something similar, this is an exhibition of a collection of artifacts from a prominent Turkish businessman, whose legacy is still standing.For my experience, this is one of the best managed and best maintained attractions in Istanbul.The exhibition is very rich, with cars (really a beautiful collection, very well-kept), boats, trains, planes and even a submarine, plus pieces of machinery, reconstructed workshops and models, and lots of other things.Among some (many) rare pieces, a fully restored Italian \"Littorina\" locomotive, a railway car belonging to a Sultan and what remains of an American B24 Liberator having fought in the Ploesti Raid.For the committed person this museum can easily take 3 hours to visit, but even for a fast review plan 1.5 hours expecially with children.Unfortunately, this is not located close to any tramway stop, but it can be easily reached by boat (the stop is just besides the museum) or by the usual taxi.Don't miss it!"
        }, 
        {
            "index": 94, 
            "rating": "4", 
            "review": "Nice cars. Free parking. Inexpensive cafe on site.. Nice cars, airplanes, submarine and trains. Cars are the best though. When we went there, museum was running a maintenance of some of the models and took them out for a ride first. Quite impressive to see models from 60-s up and running."
        }, 
        {
            "index": 95, 
            "rating": "5", 
            "review": "Best technical museum ever visited. Large museum with a lot of differend cars, planes, boats, trains and much more. Especialy the condition of the pieces is very good. Cars are shining like they came from the showroom a day before.If you hurry, you will see it in a day. So much too see."
        }, 
        {
            "index": 96, 
            "rating": "3", 
            "review": "Read the book in the Hotel and didnt go.. It was on the 'list' but it is more of a personal collection that a historic museum to learn about Turkey's heritage. Nevertheless it may be the only chance you have of visiting a submarine or London bus."
        }, 
        {
            "index": 97, 
            "rating": "4", 
            "review": "recommended to visit specially for kids. recommended to visit specially for kids very nice experience they will learn and see I personally love this museum"
        }, 
        {
            "index": 98, 
            "rating": "5", 
            "review": "A great day out for kids. I spent 1/2 day with my son (11) who especially enjoyed the submarine tour (small extra cost-but well worth it!). The museum I is very clean and well organised, with several places to get cold drinks and ice creams, and a/c in the main buildings (it was about 33 degrees the day we visited). There are clean well-kept public parks either side of the museum, and we caught the ferry back to Istanbul (was only every 30 minutes, as it was a holiday,) but the journey down the Horn was great. We took a metered taxi here, which was reasonably priced."
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "Absolutely amazing!. Harry Potter's car, some old cars and ancient engines. Everything for the old vehicle lovers. Cadilacs, Citroens, Fiats.. Every brand you can imagine with their original conditions..."
        }, 
        {
            "index": 100, 
            "rating": "5", 
            "review": "interesting place to see. It was great place to see here, we have spent 4 hours to visit and will see many edges of rahmi. highly recommend."
        }, 
        {
            "index": 101, 
            "rating": "4", 
            "review": "Amazing history. Dont get fooled by the name and pictures. It has a lot of educational and interesting artifacts from dignitaries from all over the world.\nTrains, cars, doll houses for kids, letters and gifts to Mr. Koc from Kennedy to coke, airline companies.\nA must see museum"
        }, 
        {
            "index": 102, 
            "rating": "5", 
            "review": "Impressive Museum. I am not a car buff but was very impressed w this museum. Koc (or his staff) put careful attention to details. Guess being one if the richest men in Turkey means he has to look out for his name. The American classics (Chevys, Fords) looked better than ones I've seen in America. The restaurant had good food and service. There is a snack bar inside where one can sit to have coffee AND gaze at the cars! There are boat collections as well as a canoe-kayak collection.The fantastic boat ride (sbout 30? minutes) around the bay was included in admission price. My son, friend and I had a great time here!"
        }, 
        {
            "index": 103, 
            "rating": "5", 
            "review": "U shouldnt skip it for you and your kids... We went there with my wife just for one hour;but we stayed almost 5 hrs...Museum is another planet which brings you beginnig of tecnology till present days...Also it is very nostalgic...It is amazing museum..I m a tourist guide in Istanbul ;I never seen this much well orginised museum ;it is because of the sponsor of the museum is most rich person of Turkey Mr .Rahmi Koç....There are thousands of amazing items...Also there is a beautifull cafe an old ferry which is so cheap...Also you can take a Golden Horn trip with a 170 yo ship with runs by heat of the coln..."
        }, 
        {
            "index": 104, 
            "rating": "5", 
            "review": "Best technical museum I've seen. Impressive collection (5000+ pcs) of bikes, motors, cars, engines, tractors, ships, trains, planes and a real submarine from ww2 to visit! Very interactive (you can enter inside trains, planes, boats and the submarine) and full of stuff to see! Also contains real size replicas of living history shops (pharmacy, toy store, ship chandler, watchmaker, blacksmith, cobbler, chemist), a sawmill and an olive oil factory. Way better than the marine museum and the Islamic science and technology. Must see in Istanbul! Also a kids heaven! (hundreds of toys, cars, ships, train and plane models). Entrance is 14 TL + 6TL for the (real) submarine. Planetarium is 2TL but is only about Saturn exploration and in Turkish."
        }, 
        {
            "index": 105, 
            "rating": "5", 
            "review": "Great museum. If you want to get away from the tourist thing, this place is definitely worth it. Great fun, great collection. Take a half day at least. Warning: if entering the submarine bear in mind that the tour is in Turkish. At some point they are going to set off the (crazy loud!) dive alarm and you may get a heart attack! Beware if you are claustrophobic. Don't forget the second building across the street. Take the ferry up the golden horn"
        }, 
        {
            "index": 106, 
            "rating": "4", 
            "review": "Thanks to Koç Group. Rahmi M.Koç Müzesi is one of the best private museums in Istanbul,located at the seaside in Haliç area.Very easy to come here by public transportation bus service and several boats from Üsküdar,Karaköy and Eminönü piers.Recommended to visit this very well arranged and maintained Museum as you will find out many interesting and exciting venues to see."
        }, 
        {
            "index": 107, 
            "rating": "5", 
            "review": "A lot to see a lot to do. There is soo much to see in this museum, different boats, cars and so much more. I loved it the only downside was that there wasn't that much information in english"
        }, 
        {
            "index": 108, 
            "rating": "4", 
            "review": "truly amazing experience if you are into tech stuff. you can find from your childhood toys to a real battle submarine :) just visit and enjoy with no rush. Truly a good experience as well as a perfect location by the seaside. Worth visit and digest!"
        }, 
        {
            "index": 109, 
            "rating": "5", 
            "review": "Worth to see. It is a private science museum. I think it is the best science museum in Turkey since there is not state offered science museum."
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "Fantastic. Nice museum mix between old and new transportation equipment starting from horses till planes passing by cars , trains , motorcycles and ships."
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "excellent. This was very interesting and there was absolutely nothing negative about the visit to the museum. Learned quite a lot there."
        }, 
        {
            "index": 112, 
            "rating": "5", 
            "review": "More than expected. Visited by chance. But I may add, a great surprise. Would definitely recommend. But take your time, and a camera, you ll have things to do around here. Not only see, experience, but also learn."
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "Wow eye opening for Western educated people. This is the museum of Islamic Science and Technology and it tells the story of science and technology that has not been taught in Western education institutions, and gives full credit to the Islamic and Asian scientists and all the great achivements."
        }, 
        {
            "index": 114, 
            "rating": "4", 
            "review": "surprisingly good. very nice small museum with lots of interesting and well described cars, steam engines, buggies, - a few boats and planes"
        }, 
        {
            "index": 115, 
            "rating": "5", 
            "review": "Amazing place. This was a technology and transport museum and a real gem! Situated in a beautifully renovated space on the Golden Horn, it is easy to access by ferry from Eminonu (catch the ferry to Eyup and get off at Haskoy). Clean, well-labelled in English and with an amazing variety of technology and vehicles. Admission is very cheap compared to some of the other sights of Istanbul. For a small extra charge, you can join a tour of the submarine located in the water just outside the museum. This is a real submarine, decommissioned from the Turkish Navy, and is completely authentic. It was the highlight of my sons' visit to the museum. Great place to take the children."
        }, 
        {
            "index": 116, 
            "rating": "5", 
            "review": "Amazing Museum. It has everything from boats, planes, cars and memorabilia, even a submarine in a beautifully maintained setting"
        }, 
        {
            "index": 117, 
            "rating": "5", 
            "review": "From Doll houses to airplanes !. Fantastic, grand exhibition of an era, from submarines to gorgeous Riva runabouts to cars and doll houses, train toys, and everything in between. By the water. Nice views of an arm of the Bosphorus.Not to be missed !"
        }, 
        {
            "index": 118, 
            "rating": "4", 
            "review": "perfect museum. the museum was perfect. everything is awesome. everybody who s been istanbul should see this museum."
        }, 
        {
            "index": 119, 
            "rating": "5", 
            "review": "Cars, trains, trams, submarine. Good research tour for pupils. But it is concept of a dozen personal collections. So conceptually it is far from Museum."
        }, 
        {
            "index": 120, 
            "rating": "5", 
            "review": "Automobiles. One of the best museum in Europe. You can set the historical review of oldu automobiles and many historical old art things such as pictures , materials and sea Equipments."
        }, 
        {
            "index": 121, 
            "rating": "5", 
            "review": "A great museum with something to interest everyone.. Having a transport mad husband I have been to numerous museums all over the place and visiting another on a very hot day was not one I was thrilled about. How wrong could I have been, this museum was absolutely fantastic, beautifully looked after and had something for everyone - even the Doll's House museum - see if you can spot the labrador in a kennel!! The vast collection includes planes, trains, bikes, motorcycles, fantastic cars - including one to delight Harry Potter fans, engines of all kinds, steam engines, boats, and a WW2 American submarine that saw action in the Pacific and later sold to Turkish Navy. Take my hat off to those brave men who served in her - it was an unforgettable experience. Nice little gift shop, smiling and helpful staff, plenty of loos and a nice cafe. If you want a nice lunch there is also a waterfront restaurant (not part of museum) that was lovely. Take a little ferry from the harbour - not where the bigger boats are, walk further on, under the underpass and go past the bus terminal to a small ferry (your Istanbul travel pass works) and get off at the 2nd stop. Ferrries are on the hour. This was in the end a lovely day and well worth it!"
        }, 
        {
            "index": 122, 
            "rating": "5", 
            "review": "Car buffs and engineers will really enjoy this wonderfully fun museum. What an artful and clear depiction of man's achievements with machinery. Great displays, some active! The submarine was an extra charge, paid for when purchasing a museum ticket. The restaurant was nice although nothing special."
        }, 
        {
            "index": 123, 
            "rating": "5", 
            "review": "Amazing Collections. Wow,it was one of the best.I liked the cars and old machines,especially the one for making olive oil.We had fun.It is also located by the Golden Horn so that we could go there by boat from Eyüp easily.I recommend every Turkish Citizens and the tourist to go there if they ever find a chance."
        }, 
        {
            "index": 124, 
            "rating": "5", 
            "review": "Treasure trove. Its a wonderful museum - rare to find so much variety : air, water, road transport. A lot of history here.Cafetaria by the water was very nice. The submarine is also an added attraction."
        }, 
        {
            "index": 125, 
            "rating": "5", 
            "review": "For Classic Car Lovers and everyone. If you love classic cars, old boats, plane, trains this is a place you should go. Your children also will love it.What I love most is after you finish the museum visit, go the museum restaurant. Either eat something or just have a drink near the water and breath the history inside of you. Fantastic location every minute worth spending. Also you can rent some areas of the museum for special occasions and events. Definitely an unforgettable experience."
        }, 
        {
            "index": 126, 
            "rating": "5", 
            "review": "Awesome collection of classic cars!. This museum is definitely worth seeing. Lots of cool classic cars, old boats and trains, and a cool science area for kids. The cafe inside is quite cheap - and it's easy to get to from Sultanahmet by taxi or Uber."
        }, 
        {
            "index": 127, 
            "rating": "5", 
            "review": "Absolutely must if visiting with children. The name of this museum kept popping up whenever I searched for things to do with children in Istanbul and our visit there made it clear why. It is an absolute gem of a museum that will delight and fascinate children and adults alike. Its essentially a transport museum with a little bit of history of Kemal Ataturk thrown in as well. But the Transportation Museum is beyond amazing with something for everyone. With an immense collection of all types of transports that include vintage cars and two wheelers, boats, small ships, trains, trams, planes and to top it all an actual submarine, this place is a veritable treasure house. My kids and I must say me and my husband loved every minute that we spent there. I would suggest you go have a look even if not travelling with kids as its a wonderful experience for adults as well.Getting there is easy by taxi or bus (starting from Eminonu with the bus stop right at the gate of the museum). But do make it a part of your Istanbul itinerary, you won't regret it!"
        }, 
        {
            "index": 128, 
            "rating": "5", 
            "review": "Interesting museum. This is a museum with very interesting collections of old cars, boats, old computers and even very early washing machines. As part of Koc group we go there for a New Year's dinner party and I always love to stroll inside this lovely museum. I suggest all tourists to pay a visit here."
        }, 
        {
            "index": 129, 
            "rating": "5", 
            "review": "Amazing. Incredible. And beautifully presented.. We passed this on the ferry en route to Miniaturk, and my husband insisted that we try to get back to it another day. We did - and I'm so glad we made the effort!It's easy to get to by ferry from Eminonu: jump off at Haskoy and it's just a couple of minutes walk round the corner. There's a 12tl fee to get in to the museum - but we spent 3 hours there and didn't get to see half of the exhibits, so it is a full day out and well worth the money.The museum is so much more than just historical and educational. We started with the Rahmi M Koc and the Ataturk rooms, which were absolutely full of memorabilia. So many pieces from so many amazing places and events - it makes you wonder where Mrs Koc kept them all before the museum was built! Then there's a special exhibition room: when we went there were beautiful dolls houses on display. There are rooms and rooms of cars, boats, trains, steam vehicles, engines, planes, bikes, motorbikes, dolls prams, horse drawn carriages... There are model shops, a model sawmill, and a model olive oil factory. There's a display of toys old and new. There are machines that work when you press a button. There are interactive displays. There are trams and cars, ferries and planes you can climb into. There are videos, hands-on activities, things to touch and things to play with.Each and every exhibit is in stunning condition, with a story or an explanation or a piece of history for you to read. There is a map that will guide you round (though we thoroughly enjoyed wandering). We met groups of school children, groups of teenagers, adults, inquisitive toddlers... every age group seemed to find something that fascinated them. There are a number of food & drink areas, with a range of styles and a range of prices.There is, across the road, a second site with what looked like a gorgeous café. We just didn't have any time to go and explore it. We didn't have time to do a guided tour of the submarine either (you need to buy a separate ticket for this). Which means we have a great excuse for going back another time!"
        }, 
        {
            "index": 130, 
            "rating": "5", 
            "review": "Interesting place. Rahmi Koc Museum is like small version of the science museum. You will find a great collection of classic cars which I was fascinated by."
        }, 
        {
            "index": 131, 
            "rating": "5", 
            "review": "Fantastic and Educational Visit. This historical and educational Transport Museum is well worth a visit.My husband and I visited and certainly had a fantastic time. We were most impressed by all the exhibits, the vintage cars, aeroplanes, boats and many more, evendolls houses.The museum is extremely well laid out and informative. It has much to offer to both adults and children. In addition to the exhibits there is also a train, steam boat and a submarine. These can be enjoyed for little extra cost. It was fun to be on the train with all the happy children enjoying their day out The cruise on the \"Rosalie\" around the Golden Horn was an extra treat.It was a unique experience for both of us to have a voyage on an 1873steam boat. Our tour around the submarine, TCG Ulucalireis, was alsomost interesting.We spent well over four hours at the museum and still there was a lotmore to see. We will certainly visit next time we are in Istanbul andwill be recommending our friends to visit."
        }, 
        {
            "index": 132, 
            "rating": "5", 
            "review": "If you like the Henry Ford Museum in Michigan . It's a mini version of the Henry Ford museum and if you liked that place, you will like this as well. Especially if you like anything with a motor as I do. This place has it all. It's going to cost you a cab ride there and back on top of admission as it's not really near public transportation. I went on a Saturday and it was nearly empty. Three times as many employees then visitors. Have no idea how this place stays open financially and I would be surprised if it's still around in 10 years. If you have the time it's a great place to visit."
        }, 
        {
            "index": 133, 
            "rating": "5", 
            "review": "One of a kind. One of the greatest places which I have been to.Enjoyed every moment discovering historical industries.Amazing cars trains airplanes machines and a lot more"
        }, 
        {
            "index": 134, 
            "rating": "5", 
            "review": "Very informative and lovely museum. Me and my husband went to this after my husband insist me. After going there I was thankful to him for bringing me there. As Istanbul is full of museums and historical places u may think it's also of same type bt it was totally different vast explanation of all the transport ways, working of some electronic things which work on ur command(push button),collection of different cars specially vintage ones and lot more. It was huge museum so you should have plenty of time. There is one submarine also Bt you have to buy its ticket separately one person will explain all the section of submarine and also give u certificate . Also there is one more section opposite to road which has planetarium, cafe and some more stuff. I was really surprised by looking the size of museum. And my favorite section was Doll houses don't miss it"
        }, 
        {
            "index": 135, 
            "rating": "3", 
            "review": "Maybe interesting for the locals, but not for a tourist. I did not come 8,000 miles to see old industrial, shipping, or other artifacts. But lots of school kids were there. Just not for international tourists"
        }, 
        {
            "index": 136, 
            "rating": "5", 
            "review": "Great place to visit for adults and children. This museum houses an interesting collection of ancient cars and mechanical equipment (including old washing machines, etc.) It is situated in a beautiful corner of Istanbul by the sea. It is really worth seeing."
        }, 
        {
            "index": 137, 
            "rating": "5", 
            "review": "Visiting this Very interesting Museum is a must. this Museum has Very beautiful collections of objects reflecting the technological development of the 19th century to date, meanwhile, you can visit the inside of a submarine of American origin bought by Turkey. so all these interesting explanations could be in Turkish, English, French or German. the Museum entrance fee is 12.5 lire / person. worth it/"
        }, 
        {
            "index": 138, 
            "rating": "5", 
            "review": "Great place for pretty much anyone.. This museum has a terrific collection of cars on display, as well as boats, planes, trains and a pretty good educational section for kids and science buffs. You can tour through an ex-navy submarine at certain times of the day which is very interesting. It's not expensive and there should be plenty of interest for pretty much any visitor."
        }, 
        {
            "index": 139, 
            "rating": "5", 
            "review": "A must do amongst everything else. Save a day for this amazing place. It is truely impressive. From Cars to planes. Doll houses to saws. Bicycles to submarines. Its got it all."
        }, 
        {
            "index": 140, 
            "rating": "4", 
            "review": "very nice.... Its very nice but far from the old city,need to take a taxi or use public transportation to go there,you will see the modern art of Turkey and ottoman empire,very beautiful calligraphic as well,recommended..."
        }, 
        {
            "index": 141, 
            "rating": "5", 
            "review": "well decorated. good , impressed welldone exhibitions decoreted by profession dont be hurry just enjoy the time especially at your second hall you will be fly"
        }, 
        {
            "index": 142, 
            "rating": "5", 
            "review": "Amazing Place. Everything is fantastic there...I could spend hours and hours checking every details of the items exposed..."
        }, 
        {
            "index": 143, 
            "rating": "5", 
            "review": "Beyond expectations!. I couldn't even imagine how huge the collection of this museum is! If you are in Istanbul and have any interest in technology then don't miss. If you come with kids - don't miss either, they'll enjoy it more than anything in the city. Cars, planes, ships, trains, submarine, working models of engines, full-size model of olive oil factory - this is just a small part of what they have in Rahmi Koc Museum. You can easily spend an entire day without getting bored. We went on a weekday and there were very few people on this big territory so we virtually had the whole exposition to ourselves. All items have detailed descriptions in English. The price was around 12 TL for adults and 8 TL for students which is more than reasonable. One of the best museums I've visited in my life!"
        }, 
        {
            "index": 144, 
            "rating": "4", 
            "review": "Great. Planes, trains, cars, boats, submarines, bycycles, motorcycles, different types of engines, even an olive oil factory are displayed along with first industrial professions and tools. A short ride with an old train is part of the entrance fee, however, submarine tour is subject to additional payment. Inside the boat, there is also an exhibition on model boats. A part of the museum is dedicated to items collected during the world tour Rahmi Koç made couple of years ago with his boat. Indeed, majority of the artifacts displayed at the museum are from his personel collections."
        }, 
        {
            "index": 145, 
            "rating": "5", 
            "review": "Excellent museum. A treat for every one, young and old, an eclectic collection of transport related items, including a DC-3 and a submarine, but also a superb collection of dolls houses."
        }, 
        {
            "index": 146, 
            "rating": "5", 
            "review": "very interesting industrial museum. I really liked all. Because It is possible to see all developments in the history of industry. Boats, cars, trains, planes, ships, all kind of electric and electronic equipments etc. You must go and see . You will like it."
        }, 
        {
            "index": 147, 
            "rating": "5", 
            "review": "Great views. One of the best maintained and richest museums in Istanbul that mainly focuses on Industry and industrial history. There are many historical pieces such as an old passenger plane, a submarine, many trains and an incredible car collection. The transportaition is easy and the price is acceptable. Recommended for families especially."
        }, 
        {
            "index": 148, 
            "rating": "4", 
            "review": "Museum with a difference. This is more of a collection than a museum as such - it has beautiful collections of a wide variety of items (eg cars, boats, bicycles, prams, household equipment etc) There are working models, as well as a ride on mini-train. Definitely well worth a visit. The collection is vast and well set out."
        }, 
        {
            "index": 149, 
            "rating": "5", 
            "review": "A gem, maybe the most fun place in Istanbul!. After spending quite some time in Istanbul and visiting almost everything that should be visited, I have to say that in Rahmi Koc Museum we had the most fun! It needs at least 3-4 hours - there is a very interesting and informative section about Ataturk which should not be missed. But the biggest fun is the huge (huge!!) collection of rare and expensive classic cars and boats, also there is a submarine, coaches, trams, (one can enter them), and many other extremely interesting exhibits.Very conveniently there is also a nice restaurant overlooking the Golden Horn - great place to have an early dinner with a bottle of chilled local white wine while watching the sunset!"
        }, 
        {
            "index": 150, 
            "rating": "5", 
            "review": "Great museum. Where to start? Very informative first section on Kemal Ataturk with interesting newspaper clippings from the 1920s, Time Magazine covers, and some of his clothing and other personal items. Some great photos, too. Then, on a different note, there are rooms of the most magnificently restored cars. There are areas with old tramway cars and buses, rooms full of seagoing vessels and associated paraphernalia ... We spent three hours here, but that wasn't nearly enough time, and if we are lucky enough to return to Istanbul, we will come back here to finish our visit. Oh, and we had a lovely lunch here at the restaurant overlooking the water. Pricy, but great food. Almost forgot to mention two special exhibitions on currently, one of dolls houses, the other a photographic exhibition of veterans from Turkey and Aus. and NZ, of the Gallipoli campaign. Very moving."
        }, 
        {
            "index": 151, 
            "rating": "5", 
            "review": "Excellent Place. well, this was the one the awesome place. the museum had great facilities. Me and my friends had great experience\nWould visit again...soon"
        }, 
        {
            "index": 152, 
            "rating": "5", 
            "review": "Brilliant hidden gem. A friend tipped is off about this museum and it's well worth a visit. Lots of old cars, ships, a sub, doll houses. An eclectic but fun mix. We got the ferry there and back - there is one an hour and we were lucky with timing.Well worth a few hours of your day. You get the boat down from the main ferry terminal and past the bus station. They're often a bit late which can work to your advantage. A cab to the museum shouldn't be too much either but the boat is a great way to travel. "
        }, 
        {
            "index": 153, 
            "rating": "4", 
            "review": "An out of the way Museum Gem. My son and I visited this museum only because a bus tour passed by it early in our stay and it looked interesting. There isn't much promotion of the display... it's a little off the tourist beaten track. A 2TL/10 min ferry ride from the south side of the Golden Horn and a 200 metre walk from the ferry got us to the front door. There are many early transport and other generational displays to interest the whole family. Amongst many other catergories, on display...... horse and carriage through to the evolution of the motor vehicle,,,,,,motor bikes from the early 1900's onwards.....sizeable doll houses...... memorabilia from Turkish and Australian armies (WW1).......trams..... planes....and so on. A bit of a gem if you are looking for comparisons between generations."
        }, 
        {
            "index": 154, 
            "rating": "4", 
            "review": "Neat museum. Really random and cool museum we found while taking the Halic ferry. It's worth a visit for sure to see these kind of objects. Definitely good for families."
        }, 
        {
            "index": 155, 
            "rating": "5", 
            "review": "Great Museum amazing collections. This is a private museum. It has probably the largest collection of vitage cars that one can see under one roof. Not just cars it has collection of vehicles of all modes of transport right from steam engines to ships and aircraft. All the items (vehicles) on display are in superb condition and a treat to watch. If you are in Istanbul and taking Bosporus tour; look for a tour that includes \"Rahmi M. Koc Museum\"."
        }, 
        {
            "index": 156, 
            "rating": "5", 
            "review": "Make the effort!. Terrific museum for families if you are interested in planes trains automobiles submarines dolls houses trams you will be blown away by this museum. Great resteraunts esp the one right near the entrance. Catch the bus from Istanbul bus stops right outside. Fantastic room upstairs opens after 3 pm with great maths concepts to explore. Teenagers and kids will enjoy."
        }, 
        {
            "index": 157, 
            "rating": "5", 
            "review": "Rahmi M. Koc Museum a must with kids. Fab museum collection of vintage cars, airplanes, trains and even a submarine. So much more too.... Local kids were having class in a train carriage! My 10 year old absolutely loved this"
        }, 
        {
            "index": 158, 
            "rating": "5", 
            "review": "So Very Glad We Visited. Koc, pronounced Coach. A wonderful Transport Museum.As we love seeing the world through the kids eyes. We LOVED this museum as much as our 10 and 8 year old BUT we found ourselves taking photo after photo for other adults at home that we wanted to share this experience with as we know they would have loved it too. From cross-sections of household appliances \"I always wondered what happens in a dishwasher\" Miss H said, olden day cars of all shapes and sizes, and boats and trains and planes. Planes to go inside of too. Private jet \"oooohhh, this would be cool\" and another \"ooooohh this is like the plane from the Madagascar movie\". The remnants of a fighter plane from wartime and all the history to go with all these things if we so desired to stand and read. Then there was the display of dollhouses and miniature scenes from Turkey. If you love attention to detail. The intricacy in these displays is worth a visit alone. There were the life size models of blacksmith stores and old shops.And then there was the submarine. It was an additional cost to do this and even though the guide only spoke Turkish. It was still worth.We paid 25TL each way by taxi from the Sultanahmet to Rahmi M. Koc and we're very glad we did. We would definitely visit again."
        }, 
        {
            "index": 159, 
            "rating": "5", 
            "review": "A Lot to See. Located on the eastern shore of the Golden Horn, this large museum concentrates on different modes of transportation and motive technology. You will find broad collections of automobiles, steam engines, trains/cars and boats. There is even a diesel submarine (extra cost with designated tour time). Also included is an excellent diorama section (not really the \"doll houses\" written on the sign), an old wood working shop, some airplanes, and some full-scale replicas of different sorts of shops common at the beginning of the industrial revolution. A ferry from the Eminönü terminal (north of the others past the big bus terminal) has a stop adjacent to the museum.While I especially recommend this museum if you are touring with school-age children it is also very interesting for adults. A fair number of interactive exhibits are included. I especially enjoyed walking through a wonderfully restored Italian train car (a powered one-car passenger train) from the 1930s."
        }, 
        {
            "index": 160, 
            "rating": "5", 
            "review": "Great Museum. Lots to see here, if you like transport related things. Some really nice cars and motor bikes here and they even have a dispal of the oldest metiorite that has been found. The Museum is big so you will need a bit of time to look round it and the ferries only go every hour. The cafe was ok and reasonably priced but the restraunts are expensive so if you are a big familly and on a budget take a packed lunch."
        }, 
        {
            "index": 161, 
            "rating": "5", 
            "review": "Great Museum. We walked here from the Galata Tower (not a fun walk, take a taxi or the water taxi/ferry, get off on the Eminonu stop on the light rail, walk past the Galata Bridge to the ferries).The museum is really quite nice, tons of classic/interesting cars, boats, miniature houses, airplanes, train cars and industrial equipment (ever seen a steamroller from the 1910s? You will here). It is a very well kept museum, and they have a nice little cafe adjacent to the main car show room. The submarine tour was great as well, so I recommend spending a couple of bucks to get that add-on. Just an FYI, the train ride is essentially an activity for small kids, as the train goes back and forth on a little track, fine, but as an adult you aren't missing much. If you are tight for time in Istanbul, yeah, you might not see this, but my wife and I really enjoyed it, worth the trip over, really neat way to spend 2-3 hours, so I would highly recommend the museum."
        }, 
        {
            "index": 162, 
            "rating": "5", 
            "review": "Excellent for kids - and grown-ups!. Bringing our son to Istanbul, we tried to find some attractions he would like as well. The Rahmi Koc museum was absolutely marvellous. In fact, we were so fascinated by this museum that we spent more than five hours here. And our son still didn't want to leave! Old cars, motorcycles, engines, how computers work, submarines, trains, planes and many other items of interest presented in a very neat way and pedagogical. We have been at museums like London's Science museum. The Rahmi Koc matches this museum. Not necessarily along the same lines of content, but at least through its quality. This is a very complete collection of vehicles of various sorts.At the top shelf was the visit in the submarine. Here you met volunteers, which previously served in the turkish navy. The officer who guided us were a former machine engineer in the submarine, and could tell us lots of details.There is an entrance fee, but it is nevertheless cheap."
        }, 
        {
            "index": 163, 
            "rating": "4", 
            "review": "Interesting. A last moment addition to the itinerary, this proved to be a great fun than anticipated. The collections are definitely vast and impressive and seem to have something for every age group but frankly I feel that it would be the kids that would enjoy the museum much more. Ample things to see and learn. It can be a bit time consuming so prepare your visit accordingly. There are lots of transportation collectibles around and that too in various forms."
        }, 
        {
            "index": 164, 
            "rating": "5", 
            "review": "One Of The Best. The Koç Museum is one of the best museums I've visited anywhere in the world. Interesting and vast exhibitions for visitors of all ages, but especially entertaining for those intrigued by technology and mechanics; a separate section about hands-on physics and mechanical learning will keep children entertained, as well. Excellent translations and information in English. Highly recommend a visit for a few hours!"
        }, 
        {
            "index": 165, 
            "rating": "5", 
            "review": "We have to go again... and again, and again!. Great place. Went with my 8 year old boy - just fabulous! Only trouble is it is so big. So we went again when he was 9 and we will have to go again because we still haven't ogled at everything. So many bikes and planes and ships and cars. And so cheap too! Love the place."
        }, 
        {
            "index": 166, 
            "rating": "5", 
            "review": "Absolutely must see if you are with children. This museum was the one which our 6 year old son liked the most. Collection is very large and quite interesting. A lot of working presentations to show how things built and work could entertain you for quite a time. Unfortunately, we had not enough time to visit all collection but definitely we'll be back here on our next trip."
        }, 
        {
            "index": 167, 
            "rating": "5", 
            "review": "Definitely not to miss when you return in Istanbul. First seen in a previous visit in Istanbul from the touristic bus, the museum offers a lot of interesting stuff. By far, the most interesting is the visit in an old submarine used by Americans in the Second World War in Pacific, then later modernized and sent to Turkish Army. In addition to this, you can see also a large range of means of transport from various times"
        }, 
        {
            "index": 168, 
            "rating": "5", 
            "review": "Much more than we expected to see. Our guide took us to this museum as part of our Golden Horn Tour. We took a ferry from Eminent and was at the museum in 20 minutes. It's a great approach right on the water with a submarine, Dakota air-plane, many small vintage boats. These are all toys of a famous businessman!"
        }, 
        {
            "index": 169, 
            "rating": "5", 
            "review": "Perfect museum by the sea. Not very close to city center.We took a taxi from Sultanahmet area.Good to visit with kids.It is very large and have lots of things to see so be sure to have enough time."
        }, 
        {
            "index": 170, 
            "rating": "5", 
            "review": "Cool collection of technical stuff. Reall big collection of cars, trains, trams, planes, ships, boats and steam engines. Worth seeing even not only for kids."
        }, 
        {
            "index": 171, 
            "rating": "5", 
            "review": "Rahmi Koc Museum need to be visited. I visited this museum after 15 years again with my family. I really loved it and happy that it made a wonderful progress. Location is excellent, Rahmi Koc is a great collection-er of classical cars, trains, planes and lots of other vehicles and so many other things.\nSurrounding buildings and coffee shops are excellent also, Really, worth seeing this museum."
        }, 
        {
            "index": 172, 
            "rating": "5", 
            "review": "Simply the best. This is the best museum I have ever visited all over the world. The diamond among Istanbul's attractions, absolutely unexpected in such kind of old historical city. Somewhere It is called a technological museum, but in reality it gives much much more than just a review of a history of technologies.You can see, you can touch, you can try& learn, you can play... I wish one day I could come back and bring my kids here The only man who really loved the things could create such amazing and friendly museum."
        }, 
        {
            "index": 173, 
            "rating": "4", 
            "review": "enjoyable place and full of info. Nice museum. Bring there your children , I am sure they will enjot it so much. Location is easy to find and full of information about Turkish past industrial development"
        }, 
        {
            "index": 174, 
            "rating": "5", 
            "review": "You have to go there minimum one time. Very good place to go with your family. Spent your weekend in there food, park and sea side. Old Istanbul beyon on your feet.Your children will ove it too much. You can go there very easy. Public tranport also take you there easily."
        }, 
        {
            "index": 175, 
            "rating": "5", 
            "review": "Good collection of machinery. A nice technology museum, an excellent collection of cars, motorcycles, various engines. There are also a couple of restaurants with excellent atmosphere and kind people."
        }, 
        {
            "index": 176, 
            "rating": "4", 
            "review": "nice. very old arts nice old planes nice antiques everything was wonderful like all day you can stay and see"
        }, 
        {
            "index": 177, 
            "rating": "5", 
            "review": "Exciting. This was a place that consisted many things i've never seen before. So exciting and good place for kids."
        }, 
        {
            "index": 178, 
            "rating": "5", 
            "review": "Amazing.... It is quite worth to see . Not just ınly classic cars , many things to see . Specially baby dolls houses were amazing . Took almost 5 hours to travel ."
        }, 
        {
            "index": 179, 
            "rating": "5", 
            "review": "Travel with kids. If you are travelling with kids you should take them to this attracting museum. Kids can have fun between trains, old cars, even planes and submarine. Also the Restaurant named Halat in the garden of the museum offers good meal and service"
        }, 
        {
            "index": 180, 
            "rating": "4", 
            "review": "Antiques. A very large museum with various antiques. Has a place for everything, from old classic cars to dollhouses. Also has an old submarine that you can go onboard but book your tour as you get your ticket because it's a bit difficult to find ticket. For those that like old stuff."
        }, 
        {
            "index": 181, 
            "rating": "5", 
            "review": "Very good. This Museum is one of the pioneers of the Richard'da family Museums. Itil is Near to Golden horn.\nEspecially the vehicles are worth to see."
        }, 
        {
            "index": 182, 
            "rating": "5", 
            "review": "Must visit, be a couple or a family. Where can I start ? There are antique cars, vessels like trains- numerous types of planes, a typical Bosphorus ferry, a mini toy museum, a ship, a submarine and more at that museum. It's a very good spot for everyone to visit including children and couples. There are 2 restaurants you can eat or drink at if you get tired. I highly recommend paying extra for the submarine visit."
        }, 
        {
            "index": 183, 
            "rating": "4", 
            "review": "Good for families and Children. If you have children into machines, cars, and other gadgets I suppose this is a primary destination to visit.There is a real plane and a submarine you can enter in, oh and a ferry you can play around."
        }, 
        {
            "index": 184, 
            "rating": "5", 
            "review": "Great. This building really great. Very historical atmosphere and good location i was hear this building from my friends and now i saw here and really like it."
        }, 
        {
            "index": 185, 
            "rating": "5", 
            "review": "Learn and Enjoj. If you go there, you are going to enjoy very much. This is a very huge place. There are a lot of interesting things in the museum. For example there are old and new cars, old bicycles, wooden toys. trains and a wonderful airplane.Morever, children will love the museum. The museum has got magnificent parts for them. I am amazed for doll's houses. You must see them. They are very pretty. You can play games with your partner or your child. Do you want to learn and enjoy ? Okey, then you must go Rahmi Koc Museum. Do not miss out this opportunity !"
        }, 
        {
            "index": 186, 
            "rating": "5", 
            "review": "The Best Thing To Do With Your Kid. Are you bored of going to shopping malls on each weekend, taking kids to loud play grounds or buying toys or clothes all time? Do you want to share good time with your kid? Would you like to visit an old train, a submarine, a ship and a plain in a day? Do you like cars? How about doll's house and a planetarium? I visited Koc museum with my 6 year old son and his friend and they become so excited. I felt so good to be able to experience this world class museum with them. Please spend all day in Koc Museum. Hope to visit other museums soon :)"
        }, 
        {
            "index": 187, 
            "rating": "5", 
            "review": "Nice to photograph. Nicely organized, and nice to photograph. Photographer will definitely enjoy themselves. The old American cars are nice to see."
        }, 
        {
            "index": 188, 
            "rating": "5", 
            "review": "Very nice. This is a very huge place with so many things on displays. The vintage collection is vast and there's even a room at the second floor to test our knowledge and skills. There's even a mini train ride outside. Kids will love the place.We didn't get to tour the submarine but spend a good few hours walking around."
        }, 
        {
            "index": 189, 
            "rating": "4", 
            "review": "Museum by the Sea. A fantastic place for young and older kids alike, this museum is down by the Golden Horn. There's a planetarium, a submarine, a nostalgic railway, and a host of other things to see. The museum is open everyday from 10 am except Mondays, and prices are very good value, although you will have to pay for the submarine and the planetarium. Temporary exhibitions at the moment include Hector of Troy and a dollshouse collection - there really is something for everyone here. If you're taking a bus, get off at the Kırımzı Minare, but the metrobus stop at Halicioglu is only 10 minutes walk, and ferries from Uskudar stop at Eyup. Wheelchair and stroller access is very good and there's a rather charming little cafe on site for food and drinks."
        }, 
        {
            "index": 190, 
            "rating": "5", 
            "review": "Just perfect!. If you like Science Museum in London, you will like it in Rahmi Koc Museum. And I believe you will like it more as it is in on the seaside with beautiful view. It is amazing definitely. A whole set of old cars, toys, science equipment and many more old devices. The museum is very large so make sure to have at least 4-5 hours. There are aircraft, trains, older vehicles, and even a submarine in front of the museum which you can visit with a guided tour. I really enjoyed it. If you have children, it could be fun for them as well :) By the way, there are also packages with Bosphorus cruises. In my opinion, the entrance fee is for low the value they offer :)"
        }, 
        {
            "index": 191, 
            "rating": "5", 
            "review": "Excellent Place to Visit with Kids in Istanbul. Although i put the title of my review as \"Excellent Place to Visit with Kids in Istanbul\", I have to emphasize that it is also a great place to visit for adults? As a person, who has visited several museums in Europe and North America, I can assure you that this is an excellent and unique industrial museum with large selection of new and old cars, motor bikes, boats, ships, trains, airplanes, interactive science experiments, and demonstrations of industrial processes to enjoy. I and my son have visited this place several times and it has been never boring. It will be a great experience for you and your kids. You can easily spend the whole day in the museum. Even if you are short in time, you should consider spending at least your whole afternoon. For quick and inexpensive lunch, you can grab something from the sandwich bar in the ship parked on the Golden Horn (there is a small souvenir shop near the sandwich bar selling toys and a few inexpensive items that you and your kids may enjoy) or enjoy an upscale lunch/dinner (excellent food, but expensive) at the restaurant looking at the Golden Horn. Finally, there is a short, but nice train ride in the museum that you should consider buying tickets for you kids."
        }, 
        {
            "index": 192, 
            "rating": "5", 
            "review": "Wonderful museum. Highly recommend to visit this museum. Most of all I liked a nice collection of old and rare car models."
        }, 
        {
            "index": 193, 
            "rating": "4", 
            "review": "Good for children. The staff of the hotel we stayed recommended this local museum of vehicles. It is easy to access from even the Old City. Our children enjoyed."
        }, 
        {
            "index": 194, 
            "rating": "4", 
            "review": "Far but interesting. There is something for everyone at this museum, it is such a cornucopia of cool stuff, do pay a visit. We took a taxi to and from Galata tower, it was about 15 TL each way."
        }, 
        {
            "index": 195, 
            "rating": "4", 
            "review": "Leave Ottoman behind and meet Turkey. When you travel to Istanbul, you can find your self in the path of Ottoman, but wait this country is not called Ottoman anymere, here is Turkey. So if you want to see something about Turkey, the path where this country has come from, Koc Museum is the place to go.You can find many details of Turkish civilisation after Ottomans and understand how a new culture tried to be created after an empire has fallen down.A must seen I belive."
        }, 
        {
            "index": 196, 
            "rating": "5", 
            "review": "Very interesting place. A museum like this you will not find often. There you can plenty of vehicles, divided in separate halls, such as automobiles, motorcycles, locomotives and wagons, airplanes, helicopters, a tank and a real submarine - all dating from a wide period of time.There is a hall with the main domestic appliances, given in a transparent cross section, showing how they work when you press the START button. Other sections exhibit various equipment, such as communications, measuring, scientific devices, etc. There are explanations both in Turkish and English. There is a number of cafes with reasonable prices in the area.The tour in the submarine is very interesting and you will be given a diploma at the end. By the way - children below 8 years of age are not allowed due to safety reasons, and you will have to pay extra fee for the submarine. The easiest way to get there is to take the bus 47, 47E, 47C form Eminonu bus station, close to the ferries and to hop off at Kırmızı Minare Durağı bus stop. I can say it from personal experience, as the first time I visited the museum, I took a taxi but the driver got lost while searching for it.I highly recommend that you visit the museum, especially the kids will have a lot of fun."
        }, 
        {
            "index": 197, 
            "rating": "5", 
            "review": "Excellent museum. Great display of historical cars , marine life, educational subjects for all ages. You can spend an entire day in exploring the rich historical sections."
        }, 
        {
            "index": 198, 
            "rating": "5", 
            "review": "Fun for teenage boys of all ages and both genders. This museum is not a transport museum, it's not a technology museum and it's not a science museum. Neither is it a comprehensive display of historically-important artefacts. It is, broadly speaking, the gigantic private collection of a rich individual who liked cool techie stuff. Thus, you will see steam engines of all types - most of them with buttons to make the pistons go up and down. You will see a large collection of classic cars, e.g. The Model 'T' Ford, Cadillacs, Jaguars. You will see Harley Davidson motorbikes, a large collection of old Apple computers, and countless diving helmets. There is movie-making equipment, a semi-working olive oil factory, a huge collection of speed boats (and a dugout canoe), countless steam trains, tanks, light aircraft... And even (drum roll) a US submarine that you can tour around, which is moored in the Golden Horn (you have to pay extra).If that description makes you go 'ooh, cool!', you are the target audience of this museum... We went on Boxing Day (26 Dec) when the place was almost empty except for a wedding reception, and we were the only two people touring the submarine in the last spot of the day. We toured with a former Turkish submarine engineer of twenty-five years standing who could speak enough English to make it interesting. All the exhibits are in English and Turkish.We had lunch in the Cafe au Levant, which is a perfectly nice French bistro on the site. There is also a coffee shop and a sit-down restaurant (or possibly two sit-down restaurants). The only downer was getting to/from the museum without private transport (as a British tourist). We walked, having been to Chora in the morning. The route back to Galata Bridge/Sultanahmet was through an industrial estate with poor pavements in the rain."
        }, 
        {
            "index": 199, 
            "rating": "5", 
            "review": "World Class. This is among the best industrial museums I have ever visited. The displays are beautiful and creative, the buildings are also part of the attraction. The wide ranging exhibits are impeccably maintained. There are many places to comfortably sit and enjoy the surroundings, as well as a couple of places for coffee and snacks. And there is a beautiful restaurant. The only short coming is that is not easy to get to unless you're adventuresome and don't mind finding your way on busses and the metro. Do not take a taxi in Istanbul. You WILL be cheated. I had read the many warnings posted in Trip Advisor and I ignored that advice and was cheated out of over 50tl - and had a trip ruining screaming match at the side of the road with the driver. Forget filing a complaint with the police. Each of three police stations referred us to another one, so we gave up."
        }, 
        {
            "index": 200, 
            "rating": "5", 
            "review": "absolute must to visit!. you can easily send two days there.Our whole family was absolutely excited with every santimeter of this museum! the top experience was the REAL submarine! 30 min inside doesnt happen every day. Plus, retro cars, beautiful old boats, trains, planes. tasty restautants on the side of Golden Horn. and we still have the second part of a musum to visit on the other side of the road."
        }, 
        {
            "index": 201, 
            "rating": "5", 
            "review": "Excellent. It is really a remarkable place which is maintained well. I can also recommend Cafe du Levant, the upscale restaurant within the museum. It is pricey though."
        }, 
        {
            "index": 202, 
            "rating": "5", 
            "review": "Kids will love this. If you are planning a trip to Istanbul with kids, this is a must see. An Individual collector's collection(amazing, that!) of cars, trains, boats, planes, bikes, gadgets, and submarine(!) all beautifully and aesthetically presented. My 3 yr old absolutely loved the interactive, transparent household appliances (dishwasher, washing machine, vacuum cleaner, etc) that showed her the inner workings of everyday gadgets. The display of the workings of car engines, bikes and cycles were also superb. Do note that the planetarium is only open on weekends(so we missed it), and that the submarine tour, though interesting, was entirely in Turkish. We did get a leaflet explaining the submarine's main features in English, but as the tour was given in the reverse order to the directions, by the time we sorted things, we'd missed quite a bit. But was a lovely experience overall, and we spent three and a half hours there and were'nt done! If you are automobile, or science buffs, plan to spend a while!"
        }, 
        {
            "index": 203, 
            "rating": "4", 
            "review": "A surprisingly well-designed and enjoyable museum in Istanbul. The Rahmi M. Koc Museum carries the name of its benefactor, the (former) chairman of the board for one of the largest conglomerates in Turkey, the Koc Holdings. It is hard to categorize this museum - it is not really a science museum, it is not a history museum, it is not a transportation museum, it is not a technology museum, it is not a toy museum, but rather it is a bit of everything. Perhaps it is a museum that tells the story of industrialization in Istanbul starting from the latter years of the Ottoman Empire (mid 1880s) to today's modern Turkey. The above description may imply that the museum has a mishmash of items, and that may turn off a potential visitor. It should not! You may think that you have little or no interest in such a museum. You should not!The museum is surprisingly well-designed and enjoyable. Everything is described both in Turkish and English. The museum has a large collection of antique cars, boats, train cars / locomotives and planes as well as a large ferry and a full size submarine. Also included in the museum grounds are an impressive collection of model ships, telecommunications equipment, toys, measurement equipment and standards, all displayed in a series of buildings and courtyards along the Golden Horn.If you are visiting with kids, this is a particularly good choice, as kids will find tons of things to do. In addition to those collections listed above, there are math and science games for kids, as well as a planetarium that shows a variety of shows.If located in any other city, this would have been a five star attraction. Perhaps the only reason why I am giving this a four star is because Istanbul has so many five star attractions that this one just quite does rise to the level of those (such as Hagia Sophia, Blue Mosque, Grand Bazaar, Rustem Pasa Mosque, Suleymaniye Mosque, Chora Museum, Bosporus Tour, Underground Cistern, Topkapi Palace, Istanbul Museum of Archeology, view from Camlica Hill, etc.) But if you have done all of those, and/or you have kids (including teens), you will enjoy this museum. Set aside at least 3 hours to visit. The museum has a nice restaurant and a cafe (inside the refurbished ferry), and the prices are very very reasonable.Finally, while the setting for this museum (along the Golden Horn) is spectacular, getting there is a bit of a challenge. Easiest way: Get to Karakoy (or Eminonu) and then take a taxi. It should only be about 12-15 Liras ($6-8 as of November 2014)."
        }, 
        {
            "index": 204, 
            "rating": "5", 
            "review": "One of the top Istanbul places to go. At the heart of the historic golden horn, pleasant ambience with music, view, seating, service, food quality. Unique."
        }, 
        {
            "index": 205, 
            "rating": "5", 
            "review": "fabulous. this place has amazing things and i really can not believe it. great helpful people very welcoming, i happy i went when had the chance to"
        }, 
        {
            "index": 206, 
            "rating": "4", 
            "review": "nice hidden museum. this museum is not on the route of public transport of istanbul,but it is not far from them.so it will cost you just 10 to 15 dollars to reach it by taxi depending on where you hire the taxi from beyoglu are or sultan ahmet area.it takes only 15 miuntes to reach it by taxi. we went in the morning and got the main ticket and extra ticket for the submarine.I like all of the exhibits that the museum has to offer. the classic cars and planes are the best along with the submarine.fantastic museum"
        }, 
        {
            "index": 207, 
            "rating": "4", 
            "review": "Gizmos, Gadgets, & Good Stuff. Boy, it must be fun to be filthy rich and to buy all the toys you want. But it must be even more fun to build a groovy museum around all your loot and to share it with the world, as the Koc family has done."
        }, 
        {
            "index": 208, 
            "rating": "5", 
            "review": "Well worth the visit. Small private museum that is definitely worth your visit. The collection and breadth of it are spectacular. Don't mind the walking, and either have some information or guide to assist you as you go around."
        }, 
        {
            "index": 209, 
            "rating": "4", 
            "review": "The biggest individual museum in Turkey. The owner of the museum is stil alive and he is one of shareholders of biggest group in Turkey called Koc Holding. Koc Holding first invested to automotive industry in Turkey and most of the parts of museum are related to automotive, machines, mechanics.The location of the museum is perfectly selected. Enjoy with yoru visit."
        }, 
        {
            "index": 210, 
            "rating": "4", 
            "review": "A good day out. We were expecting a quick look at some old types of transport previously used around Istanbul - how wrong can you be!? We could have easily spent the entire day working our way around the displays of every transport type you would expect and the additional displays of private and personal memorabilia from a very full lifetime. Very much worth a visit if you can spare the time."
        }, 
        {
            "index": 211, 
            "rating": "3", 
            "review": "İnteresting. Reaching to the Museum is very easy. Area is an historical place .\nİnside very peaceful. You can find there what you expect in every sense.\nI liked that historical Submarine,it is very interesting."
        }, 
        {
            "index": 212, 
            "rating": "5", 
            "review": "One of the best I have ever been to. This is a private family museum - do not miss it. The collection is extraordinary, especially the very old ceramics on the fourth floor. Exquisite jewelry - not to be missed. Worth the trip."
        }, 
        {
            "index": 213, 
            "rating": "5", 
            "review": "fantastic to visit. easy to get around with many exhibits you will not see elsewhere. the layout is well organised with exhibits from dolls houses to full size submarines and tug boats"
        }, 
        {
            "index": 214, 
            "rating": "5", 
            "review": "Get off the bus tour and visit this place. Luckily, I had read about this place before we set off on the hop on hop off bus tour, so we made a point of getting off at this stop. I am not particularly a transport enthusiast but I found the Museum very impressive. There is quite a lot to see and the quality of the exhibits and the presentation is outstanding. It was not at all busy and it was a really lovely way to spend a few hours away from the hustle and bustle of the city. Well worth a visit."
        }, 
        {
            "index": 215, 
            "rating": "5", 
            "review": "Excellent Museum. If you like any kind of transportation, cars, boats, planes, tractors, wagons, motorcycles, you will we wowed by the collection in this private museum.This a Museum which is a must for all transport enthusiasts. Located in a former shipyard in the Golden Horn near Hasköy area.I can enthusiastically recommend this museum to any visitor. Children will love the 'hands on' elements. And if, unlike me, you are enough of a transport enthusiast to wish to study each exhibit individually, you could be here for a few days!"
        }, 
        {
            "index": 216, 
            "rating": "5", 
            "review": "A submarine, a planetarium, planes, trains, automobiles and more.... This is a fantastic place for all ages to spend a whole day in. There is a submarine tour ( a veteran retired submarine leased from the navy, definitely worth the extra few pounds) as well as a planetarium at extra cost but the rest of the museum is excellent value given the wealth of collections here: classic cars, boats, war planes with human stories behind them, displays of cross-sections of cars, home appliances encased in transparent material for the inner workings to be visible while in operation accompanied by screens displaying child friendly animations in Turkish and English, a very hands-on mathematics section, a small historic toy collection, a world war I battle field ambulance, a model olive oil factory, ancient fire engines, horse and train carriages including replicas of those that belonged to sultans , maritime cranes and equipment, 1 excellent restaurant and 3 little cafes one of which is housed in a disused but renovated passenger ferry boat. At the time of our visit a new gallery was being arranged for model houses exhibition. This visit ended up being a fascinating range of industrial experiences from moving between submarine chambers by squeezing through the hatches between them to viewing the inside of a dishwasher while it is being operated! My little boy was mesmerised by many of the exhibits and loved the hands-on mathematics section where there were about a dozen interactive stations.Regardless of which city in the world this museum is located in, it would be a great shame to leave it out of one’s travel itinerary but in a city renowned for its palaces, hamams, mosques and bazaars, visiting it would add a pleasantly surprising variety to your time. I can not recommend it enough."
        }, 
        {
            "index": 217, 
            "rating": "5", 
            "review": "Really is a must see. A museum 'dedicated to the history of transportation, industry and communication'. I was surprised that such a dry description was attached to an attraction rated so highly on Trip Advisor's list of things to see and do in Istanbul. Still, I trusted the reviews and went along and was very glad I did, as were the rest of my family, ranging from 6 to 70.While Sultanahmet should, of course, be your first priority in Istanbul, I would put this a strong second. Funded by one of Turkey's wealthiest families this museum has clearly been assembled out of love rather than any drive to make money. There is a truly fantastic, and fascinating, collection of classic cars, ships, trains and planes that have to be seen to be believed. In addition, hands on mathematics section that (even) kids will love and a planetarium (at extra cost). The crowning glory is the opportunity to tour an ex-military, 100 metre submarine (an inexpensive extra), floating in the Golden Horn - something truly unique.I guess I should mention that food and refreshment is available on site and you do not need a good weather day to make the most of this.In summary, I really can't recommend this enough. Definitely deserves 5 stars."
        }, 
        {
            "index": 218, 
            "rating": "4", 
            "review": "Science education. Agree with other reviews that you find a fascinating collection of diverse objects of transport, industry and communication. It has a Turkish focus such as the Anadolu car experiment and the Turgut Alp Sea Crane! In addition it offers an explicit education component (touch and learn). It would be difficult to walk away without having learned something new! well worth on a rainy day in Istanbul!"
        }, 
        {
            "index": 219, 
            "rating": "5", 
            "review": "Brilliant, you must spend a whole day here. Really a wonderful museum to visit, no queues, very inexpensive and so many fantastic things to see. Cars, planes, trains, boats, a submarine, toys, Turkish life, all very well presented with English and Turkish captions, very interactive, excellent for children. Lots of eating options from delicious restaurant to cafés. Don't underestimate the time you will want to spend here. Mr Koc, the patron and collector of this museum is a genius to have put this together and it is a delight. The site is on the golden horn by the water, lovely views across the city. I want to go back as did not have time to see it all. Excellent all round"
        }, 
        {
            "index": 220, 
            "rating": "5", 
            "review": "do NOT miss this. I have never been to a more amazing 'real-life' museum. Ranges from a floating submarine, fighter jets on pedestals, 200/300 cars of all vintages - including an example of a very early Ford Mustang - all in excellent condition. And lots and lots of different machinery, ranging from fire trucks to internal combustion engines to old ferry boats to a 1939 ship's engine (all 4 stories of it, standing under cover on the quay, having been rescued from a cargo ship that was scrapped some years ago). If you a wife reading this, and you want your husband to be totally distracted for a whole day while you pursue your shopping etc., this is the place. And then there is a seriously good restuarant right on the water where you can meet up at lunch time or in the evening (not cheap, but totally 5 star). This museum was put together by one man with unbridled taste and money, and it shows."
        }, 
        {
            "index": 221, 
            "rating": "5", 
            "review": "More than planes, trains & automobiles. . Take the Goldern Horn ferry and get off at Haskoy. Make sure you see both sides of the museum. The non-waterside section is housed in an old foundry.When you buy the additional submarine ticket you are given an allocated guided tour time.There is a small cafe inside the museum serving tea/coffee and sandwiches/snacks with seating. Or a more expensive restaurant located on the waters edge.Allocate at least 2-3 hours. HIGHTLIGHTSinclude the flying car from Harry Potter, and Top Gear Top 41 car. A must for children."
        }, 
        {
            "index": 222, 
            "rating": "5", 
            "review": "Not your actual mosque!. When you've seen the mosques and you're feeling bazaar'd out, do not overlook the Rhami Koch Industrial Museum. This is a gem of a site with a dazzling display of classic cars, toys, an outstanding maritime and aviation museum, an array of railway memorabilia and, to cap it all, a tour round a WW2 submarine. It is reached by a water taxi ride to Haskoy, two stops up the Golden Horn from Eminonu.There is also the exquisite Cafe du Levant on site where even the loos are photo worthy.A great trip for kids of all ages especially on a wet day. Oh, and did I mention the planetarium?Don't miss it."
        }, 
        {
            "index": 223, 
            "rating": "5", 
            "review": "Transportations Museum. You must put this in the Must-to-Do List. Includes most of transportation machine, vehicles, vessels, planes, ... etc"
        }, 
        {
            "index": 224, 
            "rating": "5", 
            "review": "Very interesting especially for kids. Kids will enjoy it very much and will learn a lot, it mixes fun and education, if you have kids you must visit Rahmi Koç Museum when you visit Istanbul"
        }, 
        {
            "index": 225, 
            "rating": "5", 
            "review": "How the Turkey sees the West. Turkey has always been a pendulum between the East and West. Ataturk, the Father of Turkey, firmly believed its future must be Western creating a secular state. However Turkey is now perceived by many as swinging back to the East. This museum is an attempt by one of Turkey's greatest (and wealthiest) businessman to both give something back to the Turkish people and stem the swing to the East. If you are a Western tourist this museum is worth visiting because it will give you an understanding of how the West was so successful based on technological leadership. It will also give you an understanding of how the West is perceived."
        }, 
        {
            "index": 226, 
            "rating": "5", 
            "review": "My husband was enthralled. My husband spent hours here, and couldn't get over the quality of the exhibits and the collections. He loved the miniature steam engines, was gushed about the restored Fiat railcar, was amazed at the recovered Hadleys Harem B24 that was shelled during WW II, etc. He kept talking about the car collection, and the dioramas. On and on....We spent extra on touring the submarine with a former crew member who served on the sub with the Turkish Navy. Easy to get to via the Haliç-Hatti Ferry off Eminönü."
        }, 
        {
            "index": 227, 
            "rating": "5", 
            "review": "could never imagine. I could never imagine I would find a museum like that in Istanbul. But, after some reconsideration, it seems that a boy grew his fascination with auto, air, train, boat models into a full size accomplishment."
        }, 
        {
            "index": 228, 
            "rating": "5", 
            "review": "Great!. This is a great museum - we went with the kids and the parents, and really enjoyed it. There are lots of different attractions, many to do with transport. e.g.SubmarineDC10 planeGreat number of model railway displaysLots of classic carsCutaway engines from cars, tractors, and a cutaway washing machine, for seeing how they work.Some big engineering items - ships' engines etc....and more.You could spend a half-day here, or a whole day if you wanted to see more of the things there. It's also near Miniaturk."
        }, 
        {
            "index": 229, 
            "rating": "5", 
            "review": "Top 5 places for kids (and car lovers) in Istanbul. If you or your kids are into planes, trains, or automobiles (or boats), this is place! An amazing collection of classic cars, plus plenty of trains, trolleys, planes that you can board, boats, motorcycles, and a train that you can ride on weekends. Definitely recommend going on a weekend when the train is operating. It's also a beautiful location on the Golden Horn, and there is a playground next door too. The only sad part is that many of the Istanbul locals don't know about this place, so it is usually empty! We've been many times and my 3 year old son can't get enough. You can go for an hour, or spend most of the day if you're interested. It's also not too far from most of the touristy areas. With no traffic, it's a 10 minute taxi from Taksim or 15 from the the Old City. With traffic maybe 30 minutes."
        }, 
        {
            "index": 230, 
            "rating": "5", 
            "review": "a fantastic afternoon. this is a wonderful museum for all ages, from toys to submarines taking in all sorts of transport it is a quirky but coherent collections. It is laid out extremely well and is exceptionally well maintained it also features cafe's and restaurants for all people and all pockets you do not have to be a transport fanatic to enjoy this, it gives a unique insight into industrial and social historywe had a great afternoontake a taxi to get there and leave before the rush hour"
        }, 
        {
            "index": 231, 
            "rating": "3", 
            "review": "Rahmi M. Koc Museum. It is off the main tourist drag and out of the main part of Beyoglu, overall it is somewhat interesting and has many fascinating accounts and objects on display. But it is an overly large collection. My advice is only go there if you are willing to spend all day looking at a mass collection of vehicles, boats, models, and just various possessions of the museums namesake, who very well could be the man implied in the Dos Equis ads [ the most interesting man in the world ]."
        }, 
        {
            "index": 232, 
            "rating": "4", 
            "review": "Not for everyone, but quite interesting!. I loved the restored cars and displays in this museum! The Koc family sure has some big bucks to own all of this!"
        }, 
        {
            "index": 233, 
            "rating": "5", 
            "review": "Very nice museum... The exhibition is very wide, interesting and impressively modern. A must-see in Istanbul. Unfortunately, its position is hard to reach by foot.. and the public transport is limited. I reached the Rahmi Koc Museum using the Big Bus Tour, blue line.. However, it deserves being visited despite the effort the reach it. I liked very much the fact that the museum is very interactive.. and also the exbition quite mix international history of transport with the Turkish history of transport.."
        }, 
        {
            "index": 234, 
            "rating": "5", 
            "review": "Excellent collection. What a wonderful museum. Just big enough to give a wonderful glimpse of modern history. Every car, train, boat was beautifully restored. This is an outstanding collection of one man's Transportation Fascination. Set in a restored warehouse on the Golden Horn waterway, this is a great place to visit and learn and get a bit outside of busy Istanbul."
        }, 
        {
            "index": 235, 
            "rating": "5", 
            "review": "a fantastic museum. this is an absolutely fantastic museum, well worth combining with miniaturk as along the same road.a little hard to get to and from,but a real gem when you get there.it covers all aspects from trains, planes and automobiles (a plane to go in) and is very detailed, you need hours here and there is a sub you can tour for a few extra lira which is also well worth it.it`s totally different to everything else in istanbul and well worth the break from mosques etc.there is definitely something for everyone in here.with miniaturk these day take a whole day.there is a boat from kabatas that stops here if you don`t fancy a taxi or many buses, all seem to go back to the centre of istanbul.if here for 5 days well worth one of the days here, should be next on list after mosques, bazaars, cistern, hagia sophia, hareems etc.."
        }, 
        {
            "index": 236, 
            "rating": "5", 
            "review": "Beats anything in the UK. Weve been to quite a few museums and this has got to be the best and it captivated us for a whole 5 hours. Very interactive. All in english and turkish. A fantastic insight of one little boys passion for mechanical things. Love love love the place. Great value for money."
        }, 
        {
            "index": 237, 
            "rating": "5", 
            "review": "Great place to spend a day.. For a family with kids or toddlers, this is a great place to spend a day or two. Has multiple restaurants, and activities to keep kids busy and entertained. When leaving, we had to promise our daughter to bring her back."
        }, 
        {
            "index": 238, 
            "rating": "5", 
            "review": "Not FORD museum, but.... It is a very compact and filled with everything. You can find cars, trucks, boats, painting, sculpture and more.Nice, neat museum. Sometimes they have special exhibitions which is really cool."
        }, 
        {
            "index": 239, 
            "rating": "5", 
            "review": "Best Museum a have ever seen. First time in my life I have spent 3 hours in a museum and it was a quick tour. If you spend all day there you never get bored. There are dozens wonders all around museum, from cuntury old cars to personal belonging of owner, from Real historical train station to cozy restaurants and cafas with magnificant views off city or museum's wonders."
        }, 
        {
            "index": 240, 
            "rating": "4", 
            "review": "Quirky, eccentric and great. Go by ferry to this attraction using your Istanbul card. A really quirky history of all things mechanical. Not complete and not really in-depth, but nice anyway."
        }, 
        {
            "index": 241, 
            "rating": "5", 
            "review": "Literally a travel machine!. I call Rahmi M. Koc Museum a time machine traveler! The place steps you back in time and future! Pity we only discovered it towards the end of our trip. After our visit to Istanbul's \"must seen sights\" we needed to see that \"extra\" thing...and Rahmi Museum was beyond than a good choice.We were a bit worried whether our young daughter (3 years and half) would be entertained but to my surpise she's still asking for the retro red car and the nostalgic train ride!We reached the place via a taxi (costed us 25TL from Blue Mosque) and returned back via public bus ( using our IstanbulKart). We decided to visit the museum during the harsh hours of day , so wondering around with public transportation on a hot day with a baby trolley was not a goood idea. Thus we picked taxi and chose to return back via bus (which to my surprise was very easy handling it with a baby's trolley!!! Bus stop is excatly outside of the entrance. Last stop of it at Eminonu).Two thumps up to ithe museum managment and personel for the effort to discover and maintain so well soooo many exhibits ! I really enjoyed the section with the trains. Literally last thing I was expecting was me sitting and \"feeling\" the vintage aura of an italian retro 1st class wagon!! Fenerbache Boat and the submarine tour is a must! While entrance is not allowed for toddlers at the Submarine (kids under 8 years old are not allowed), I really enjoyed the exhibition hosted on the boat of vintage toys. I was thrilled to see some old toys that used to be my fav passtime play! Treat yourself with a hot cupt of tea after ther submarine tour and do take it on the boat's deck even if it's a bit humid and hot. The view of the Golden Horn and the seaguls' sounds will defenitely pay you off!Museum has a vast exhibits. Steam cars, retro firecars, shiny boats, penny farthing type bycicles jump into your eyes all over !!The place is enormous, be prepared to spend half day if you want to see all exhibits. I have to admit that we've skipped a couple of them due to to time pressure! If you understand turkish language do go to the planetarium (unfortunately the videos there, are in turkish).If you feel tired take advantage of the small coffe shops in the museum: treat yourself with a typical glass of tea or coffee either on the Fenerbache Boat, or at the cute and cozy coffee shop at the entrance of the antique automobiles or enjoy lunch outdoors at one of the restuarants of the museum.Highlights of the visit:a) Hasköy – Sütlüce Railway( don't get the idea that you will go around the city with a retro wagon... :) but those 20 minitues ride in a retro wagon will give you the taste of how things worked back in time. So nostalgic!b) spend a few more minutes in the Living History section. Smell the essence of cinamon of the old pharmacy, observe the old guy trying to fix a clock, make or hear the sound of the shoe maker.... c) get on the Douglas DC-3 'Dakota'!!! Seat on the chairs and travel back in time!d) when visting the navigation department, go to the fishing types boats and at the end of the corridor you will come across an exhibit that pictures an old fisherman with a kid (articificial models) fixing their fishing nets while the radio is tuned to nice melodies. This images takes literally there!e) if you into science, definetly visit the collection of scientific devices as well as the section of Science and Technology Workshop. After the visit you 'll definetly know how on earth your home devices work (besides the basic : put the plug on and switch on the outlet! )f) if you have Museum Pass Card Advantage you will benefit %20 discount on the entrance and %10 discount in the shop. The gift shop has really gifts at good prices!Overall: I will definetly return back to catch up to all the exhibits I left behind and to have again my tea on the Fenerbache Ferry's deck! Worthed every single lira we paid for it!"
        }, 
        {
            "index": 242, 
            "rating": "5", 
            "review": "Great place....must visit if u want ur kids to live a different experience. Went there with my 6 and 8 years old kids and had a wonderful time....we spent 5 hours and the kids didn't get enough !!Submarine visit takes u back in history to WWII..must do if u r here"
        }, 
        {
            "index": 243, 
            "rating": "5", 
            "review": "Thank you tripadvisor!. Man, traveling to Turkey with a six-year-old boy in the middle of the summer is not a picnic. I was starting to think that maybe we were crazy for choosing this city...in this 90 + degree heat. But this is the one attraction where TripAdvisor did not lead me astray....we got here later in the afternoon late July and there wasn't a line for tickets, we took our time going through the rooms...and the whole family really loved it. There are trains and boats outside where it's still a little steamy, but there is a cafe to cool off and grab a Coke and it's right on the water. He was a little disappointed that he was too young to go on the submarine, but it was definitely worth the trip!!"
        }, 
        {
            "index": 244, 
            "rating": "5", 
            "review": "A living museum. Well curated museum and while I have no young children, as a museum professional, I was pleased to see the museum children-friendly and encouraging learning activities. Staff helpful and pleasant, refreshments easily available and well priced. Object labelling is clear, accurate and in two languages (Turkish and English). Full marks for working exhibits! The collection scores well on both the breadth and depth of the collection."
        }, 
        {
            "index": 245, 
            "rating": "3", 
            "review": "Crowded with school kids. Seems like this is an easy place for teachers to take kids on field trips, so it was packed with school groups. All the old cars were interesting -- but they were American and I can see those in museums at home. In fact, a lot of the stuff was American. Not much Turkish."
        }, 
        {
            "index": 246, 
            "rating": "5", 
            "review": "Superb experience. Great museum! Our 6 year old boy enjoyed as much as we did. Everything is there: from impressive old timer collection to challenging tasks for adults and kids."
        }, 
        {
            "index": 247, 
            "rating": "5", 
            "review": "My favorit... This is my favorit museum in Istanbul. It is a huge area to visit. You can see the amazing collection of Koc family. It is very interesting for kids and adults as well. Sub marine and plane are my favorit equipments to see. Dont miss"
        }, 
        {
            "index": 248, 
            "rating": "5", 
            "review": "Very interesting. One of the most interesting places you can visit in Istanbul. I loved the classic cars trains and boats. I found the submarine cool. The place is great if you have kids they will enjoy it. It has different parts and in all it is quite a nice hang out .will definitely enjoy going there again."
        }, 
        {
            "index": 249, 
            "rating": "5", 
            "review": "Loved this museum. This museum has beautiful collection of classic cars, trams, trains. It has a ferryboat, a plane and a submarine. Also, there are some very interesting collections of toys from all times and baby trolleys."
        }, 
        {
            "index": 250, 
            "rating": "5", 
            "review": "When five stars is just not enough. This is simply an amazing find. We have been to Istanbul six times and we thought we had seen and experienced everything. Well, we were wrong. We went to this museum on the strength of TripAdvisor traveler recommendations. We allowed an hour for this attraction. Four hours into it, our legs gave out and we quit even though there was still much to see. This is probably one of the finest attractions we have ever seen anywhere on anything, a huge collection of perfectly restored old and antique cars, a huge boat and navigational artifacts, a remarkable collection of street cars starting with horse drawn trams, old train cars, the original steam powered cable car up to Galata hill from 1875, an excellent aviation collection, etc. You get the idea, if it moves they have it. All the exhibits are well described and documented in both English an Turkish. Must see to believe how well done this is.For a break you can stop for drinks and snacks at the adjacent Halat cafe/restaurant. A beautiful and elegant setting. We are coming back for dinner at this most incredible spot right on the Bosphorus with the historic Istanbul in the background. Best to take a taxi. Not easily accessible on foot without serious knowledge of public transportation."
        }, 
        {
            "index": 251, 
            "rating": "5", 
            "review": "Such a cool museum!. Private museum. Had cars, trains, planes, boats...thinking it was just for the boys,,,I was readily dismissing. But boy oh boy, was I surprised!!! I lOVED it! Such an amazing repository of moving vehicles and a small section dedicated to Ataturk and a nicely tucked away Maths museum for children (the bubble machine was a real hit with my girl!). They had my Ford Mustang and the Thunderbird there and I fell in love!! Oh my, my dream cars!! Do not miss this place! Well worth the visit."
        }, 
        {
            "index": 252, 
            "rating": "5", 
            "review": "Great surprise in Istanbul!. We didn't know much about Rahmi Koc museum but went there on a whim along with our visit to Miniaturk. Koc museum is fantastic! The best collection of classic cars I've ever seen in the world, along with fascinating displays of engines and other industrial equipment, plus airplanes. We paid the extra charge for the submarine tour, which was very worth it. Excellent!"
        }, 
        {
            "index": 253, 
            "rating": "5", 
            "review": "Just the most wonderful museum I have been to!. This museum is a true gem, we travel there by boat up the golden horn to Haskoy pier, the collection of cars, planes, trains, boats, bikes etc... is vast and all in unbelievably good condition. There is plenty for children to interact with and heaps to keep them and adults interested and stimulated! There is also a fantastic restaurant right out by the water with great food and wine."
        }, 
        {
            "index": 254, 
            "rating": "5", 
            "review": "Fascinating place to visit. Mr Koq has the money to indulge his interests and the restoration of the buildings and the items on display are all very tasteful and must have cost a small fortune. He should be very proud of this museum.You could easily spend an entire day here if you wanted but a few hours is probably enough for most. As the info booklet states, \"the first major museum in Turkey dedicated to the history of transportation, industry and communication\" and it certainly lives up to the description.As others have said, it has a bit of everything and it is all in beautiful condition. We paid the extra YTL7 for the submarine tour which runs at regular times. You get a certificate at the end of the tour!It is actually quite a fun and interesting place to visit and everything is in pristine condition with staff polishing and dusting the exhibits to keep them looking that way.Husband particularly enjoyed going inside the DC3, but we both enjoyed so many of the exhibits in this inside/outside museum it is much too difficult to describe them all.When you need to rest for a short time there are a couple of cafes where you can buy snacks and drinks, and restrooms in various buildings.It was quite busy when we were there as there were several school groups visiting.We took the ferry to the Haskoy dock. It docks next to some of the outdoor exhibits but you cannot enter from here. You need to walk straight ahead through the park, turn left at the road and walk 2 or 3 minutes to reach the entrance.If you want something completely different in Istanbul give this a try. After the museum, if you continue a few minutes further on the ferry from Haskoy to Eyup and take the cable car up for the fabulous views you will have enjoyed a great day out on the Golden Horn."
        }, 
        {
            "index": 255, 
            "rating": "5", 
            "review": "Don't Miss This Gem!. The most pleasant way to arrive to this museum devoted to transportation is by the Golden Horn Ferry. I would rank this as one of my favorite museums in Istanbul and if you are traveling with kids, plan to spend the whole day. You'll see classic cars, climb up into early airliners, explore a submarine, eat on a restored ferry, peer into the insides of boats etc etc. It's history that is very easy for an American to identify with and so much fun to explore!"
        }, 
        {
            "index": 256, 
            "rating": "5", 
            "review": "Amazing. This place is brilliant,if ur traveling with kids or car, plane enthusiasts do not miss it!! Our son ,9 years his dad 42 and grand dad 69 all loved it !!"
        }, 
        {
            "index": 257, 
            "rating": "5", 
            "review": "Excellent Museum!. We found a short write - up on Rahmim Koc and rode the Big Bus to the museum. It is well laid out, informative, children friendly (even the stairs have children level handrails) and extensive without being boring. Entry is TL 12.50 - very reasonable. Definitely worth a visit."
        }, 
        {
            "index": 258, 
            "rating": "4", 
            "review": "You must see this museum. rahmi koç museum is the unique place. Absolutely see this museum in İstanbul. I think everyone likes this museum."
        }, 
        {
            "index": 259, 
            "rating": "4", 
            "review": "Good for the non traditional museum pieces. Koc is one the richest Turkish business tycoons. The museum has many memorabilia rarely found together in any world museum. Not to be missed. Nice building and presentation."
        }, 
        {
            "index": 260, 
            "rating": "3", 
            "review": "Doesn't break any new ground. This museum appealed to me, so I took a ferry up the Golden Horn to check it out one afternoon.A nicely laid out museum, not a busy place. Nice display of some road/air/sea transportation but certainly nothing hugely memorable. Was it worth the trip? For me, no. I have seen better before, but I found it mildly interesting and a break from the bustle of this great city."
        }, 
        {
            "index": 261, 
            "rating": "4", 
            "review": "Very interesting, not only for kids. The museum might not be as big as in Munich but also fascinating. Old trains and old model trains collection is very nice. You can sit in old trams and see what it was like. The section showing how home appliances work is very interesting. There is also a big collection of old cadillacs and motorcycles. You can also see different shops like they were in old times. A commercial plane from 50-60's is worth climbing to. It's just in front of submarine."
        }, 
        {
            "index": 262, 
            "rating": "5", 
            "review": "the best museum in turkey. the best and numerous collection can be seen as old trains , old model cars, toys , two building seperated with narrow road , both has to be visited and it takes 1 full day"
        }, 
        {
            "index": 263, 
            "rating": "5", 
            "review": "Torpedoes away!. Loved going around the submarine with ex-crew member who was a brilliant guide! Lots of interesting airplanes too in this fascinating museum. A good half day out."
        }, 
        {
            "index": 264, 
            "rating": "5", 
            "review": "Sub-lime. Best way to get there is the Eyup ferry leaving from next to Galata bridge, drops you right next to museum. Great place full of big boys' toys but the highlight is the submarine. It requires a special ticket but it is worth every cent. The sub tour is conducted by a former crewman and he knows the boat from stem to stern and has plenty of interesting stories. My wife particularly loved the sub visit.The rest of the museum is full of trains, planes and automobiles, including the Harry Potter Ford Anglia and pink Cadillac.I can see why this place rates so highly on the TripAdvisor scale. Bravo, Mr Koc."
        }, 
        {
            "index": 265, 
            "rating": "4", 
            "review": "One of a kind in Istanbul!. It is not always easy to find a location with interesting things for kids, good lunch and historical sites. Rahmi Koç Museum offers it all. Lovely collection of old cars, trains and submarine. Go thee by Golden Horn boat. Do not miss to visit Miniaturk nearby."
        }, 
        {
            "index": 266, 
            "rating": "5", 
            "review": "Fascinating. What a fantastic museum - particularly if you're travelling with children/teens and you want a break from cultural sights. Very clean, loads of exhibits ranging from the type of thing you would expect in a science museum to collections of cars, trains and planes - even a submarine. There are also some good places to eat."
        }, 
        {
            "index": 267, 
            "rating": "5", 
            "review": "Excellent Museum near the Gold Horn. This is an important industrial Museum, but even the kids will enjoy this Museum. There are old vehicles suc has a tram, cars, train etc. It is just by the Golden Horn. You can also visit Miniaturk which is close and enjoy an excellent lunch or dinner in Halat Restaurant near-by. Must visit."
        }, 
        {
            "index": 268, 
            "rating": "5", 
            "review": "Best contemporary museum along the Golden Horn. If you visit or are planning to visit Istanbul and looking for a good alternative day out of Old Peninsula, you should try the Rahmi Koc Museum along the Golden Horn for an unforgettable experience, both cultural and natural attractions...You can enjoy the cafe by the water after your visit...Highly recommended for all"
        }, 
        {
            "index": 269, 
            "rating": "5", 
            "review": "Great esp with kids. Great event for a rainy day in Istanbul. Make sure to also visit the playroom for children with many great logical challenges. Besides there are great historic cars trains and airplanes. Don't forget to visit the historic submarine and the planetarium."
        }, 
        {
            "index": 270, 
            "rating": "4", 
            "review": "well thought museum. it's one of those museums that wants to protect the family name so here you can see that. They have invested some considerable amount of money."
        }, 
        {
            "index": 271, 
            "rating": "4", 
            "review": "Nice alternative to cultural sights. Visitors to this museum are probably self-selected nerds, which probably explains the high ranking from relatively few reviewers! It's a fun place, essentially an oversize collection of planes, trains and automobiles, and the sub. The working train was booked out when we got there, so it's popular (and there is a tugboat ride, which looks great, for the summer). Great for kids, there's an interactive puzzle room, and lots to see. There were many brides when we visited, I don't know if there was a wedding show, or if it's simply popular for wedding photos. Take the Halic ferry from Eminou, 3rd stop I think, in Haskoy. When facing the water, the ferry leaves from the left side of the Galata bridge, across a car park, and a bit of a distance from the main Bosphorous ferry cruises. It leaves from right beside the TurYol pier (which does 1.5 hour Bosphorous cruises for 12 TL). Two hours will be plenty for most, unless you visit the sub or planetarium. Nice coffee shop (and restaurant in high season). Pretty park with kid's playground at ferry stop. Great place to calm down from the chaos of Istanbul."
        }, 
        {
            "index": 272, 
            "rating": "3", 
            "review": "Retro & Small. It seems that the Rahmi M. Koc Museum is there more to celebrate the founder than the technology. Having visited the Technical Museum in Munich, I had higher expectations, because the newest exhibits in this museum are at least 15 years old, and we are talking about technology. Even the regular car engine models are old - with carburetor and spark plugs. There are some individual exhibits like vintage cars, rail vehicles, steam machines that are valuable. Also, there are 1 or two sets which are interesting such as the olive oil mill. But the collection as a whole fails to be comprehensive and educational."
        }, 
        {
            "index": 273, 
            "rating": "5", 
            "review": "For boys who love toys. We wanted something different for our last day in Istanbul and were not disappointed. This place is great for boys who love their toys. The collection of cars and trains and boats and planes is impressive. Highly recommend this as an alternative to the usual mosque and bizarres."
        }, 
        {
            "index": 274, 
            "rating": "4", 
            "review": "different face of Istanbul. enjoyable time you can have at Rahmi M. Koç Museum. Perfect view of Golden Horn, fantastic objects at museum (visit the web site of the museum), good cafe and restraurant especially at summer night."
        }, 
        {
            "index": 275, 
            "rating": "4", 
            "review": "Nice surprise. Nice museum with loads of donations. If you have time, visit the submarine and listen to one of the men who actually worked on it. Very interesting and nice change from the usual tourist trail."
        }, 
        {
            "index": 276, 
            "rating": "5", 
            "review": "Humongous. Private museum that has everything from history of electronics to different modes of transport. Real bicycles, motorcycles, cars, trains, planes, helicopters, ships and even a submarine are on display and most of them can be interacted with."
        }, 
        {
            "index": 277, 
            "rating": "4", 
            "review": "kids attraction. My kids 12 and 8 years old enjoyed a lot the visit to this museum.it takes more than 3 hours to visit all departments"
        }, 
        {
            "index": 278, 
            "rating": "5", 
            "review": "Another Taste of Istanbul. After seeing so many mosques You may want to see something different. Koc Museum was a must see. With that amazing vehicles and all the stuffs I was in my childhood again. But You need save more than few hours. Place is huge"
        }, 
        {
            "index": 279, 
            "rating": "5", 
            "review": "Quite amazing. Being 'mosqued out' for the moment I fancied something different and found just that at this truly remarkable museum. Firstly, a warning - don't go here expecting to be in and out in a couple of hours as you really need a whole day to do it justice. The collections are almost extravagant in their breadth - a fabulous huge array of vintage cars, planes, boats, trains (model and life size), militaria, engines small to gigantic, Mr Köc's private collection, an Attaturk display ad infinitum and all splendidly displayed. Hordes of rather noisy schoolchildren were rather a distraction but they soon went and, after all, it is their country and history! Some nice cafés and an excellent (more pricey) restaurant on the waterfront. Oh, and of course a submarine! Well worth a visit."
        }, 
        {
            "index": 280, 
            "rating": "4", 
            "review": "very nice museum. it is museum with some collected items true history of machines and lots of details and very nice leisure area in front of the golden horn.. Take a tour and breath the golden horn in the cafe restaurant or inside of a retired ferry's deck."
        }, 
        {
            "index": 281, 
            "rating": "5", 
            "review": "Wow . It was a visit to my childhood. Great place to visit with kids, but the grown ups will also be very pleased with this museum. One of the most interesting places I have visited in my life."
        }, 
        {
            "index": 282, 
            "rating": "5", 
            "review": "We are geeks, but non-geeks will like it too.. What a great museum! We took the ferry to this museum. It's a short walk from the ferry dock. It had so much on display! There's something there for everyone. We were there with about 200 schoolchildren who were very wild, but they didn't stay very long. (As a schoolteacher, I suggest when you take your classes on a field trip, you give them specific things to look for and study, not just run wild, touching the exhibits, and screaming.) Everything was perfectly maintained and there were explanations in English. There was so much to see. The olive press was very interesting, as well as the mobile x-ray machine on a truck. There were cars we'd never heard of, like Cinderella's Coffin. The deconstructed technology items were very interesting. There were so many boats, trains, and machines; it was just a great experience."
        }, 
        {
            "index": 283, 
            "rating": "5", 
            "review": "More than museum. One of the must-see museums in Istanbul. Amazing vehicles from past to today. And very cheap compared to all the palaces.The Museum is located along the Golden Horn . The museum contains items from gramophone needles to full size ships, submarine and aircraft. You can spend a lot of time looking at the exhibits. You can see many classic cars.The cars are most interesting, I always loved old/antique cars. There are also some old shops, production ateliers, submarine and an airplane.Very highly recomend!"
        }, 
        {
            "index": 284, 
            "rating": "5", 
            "review": "Not just a museum for engineer-geeks. Okay, so we are into boats and cars but this museum is a delightful way to spend time in Istanbul. It seemed to showcase Turkish pride in all things engineering but the museum told a story of so much more. There were such snapshots of world history, a Romanov horse carriage, a bomber from WWII, a Sultan's train carriage and more. We used our Istanbul travel card to get there via bus and wish we had taken the ferry, it stops right there."
        }, 
        {
            "index": 285, 
            "rating": "5", 
            "review": "Never miss that opportunity. Please just be there.. enjoy your time and every tiny/huge piece in there.. a great experience in Istanbul !!!"
        }, 
        {
            "index": 286, 
            "rating": "5", 
            "review": "Might just be the best museum on the planet . We spent over 5 hours there with the kids. This is not really an Istanbul story but I have not been to anything like it and it's totally worth seeing. If you have gone to the HS, the blue mosque and the bazaars, this should be the next stop. Even if you don't have kids. Remember Richard scarrys \"cars and trucks and things that go\"? This it it in real life! "
        }, 
        {
            "index": 287, 
            "rating": "5", 
            "review": "Industry museum with nostalgic moments. The Koc museum is a Industry Museum where you get nostalgic moments, since there a lot of cars and computer used in the 70s and 80s. For example I found my first Apple computer and the most popular washmaschines. It is located on the Golden Horn, however it's not easy to each. There is a amazing restaurant directly on the seaside, where the submarine lays. This definitely worth the visit."
        }, 
        {
            "index": 288, 
            "rating": "5", 
            "review": "don't miss. close to sultanahmet but have to take a cab. I strongly recommend, interesting and high quality place"
        }, 
        {
            "index": 289, 
            "rating": "4", 
            "review": "Enjoyed by all 59 of us. Rahmi M, Koc museum was our first stop after arrival. The students in our group (50 students aged 11 - 15) loved it. There was enough to keep all of them occupied for an hour nd a half minimum."
        }, 
        {
            "index": 290, 
            "rating": "5", 
            "review": "Perhaps the best non-art museum I have ever been to.. Rahmi M. Koc is a famous Turkish industrialist bajillionaire. He basically bought a pier on the Bosphorus and built himself hangars for his collection of steam locomotives, automobiles, planes, submarines and a thousand other things he ran out of room for in his man cave. If it moves, he has one, or ten, and you will find one here. We found this place PURELY by accident. We didn't see a thing about it anywhere and had we not been looking for things to do locally (I broke my ankle the day we got to Istanbul so our four days in town turned into two weeks) we would never have found it. I dream about this museum. It's new, clean, huge, easily navigated, chock full of cool stuff and is absolutely devoid of crowds. I would have spent another entire day there if we had had a chance to get back there. Run, do not walk. PS--we don't have kids. Kids would LOVE it here."
        }, 
        {
            "index": 291, 
            "rating": "5", 
            "review": "Wonderful Museum.. Found this museum by accident, had not seen it advertised at all. All the displays were professionally presented and interesting. Everything mechanical is here, even a submarine. Easy to get to by 47 or 47e bus from the bus station next to the Galat bridge or by municipal ferry from the bottom of the lane that runs down the lh side of the bus station, only costs two lira on municipal Kart card for both methods."
        }, 
        {
            "index": 292, 
            "rating": "5", 
            "review": "A children's paradise. You will enjoy. An industrialist passion and hobby created a very entertaining venue for children if all age"
        }, 
        {
            "index": 293, 
            "rating": "5", 
            "review": "Great Museum. Found this museum while looking for things to do while in Istanbul and it was well worth the visit. Beautiful collection of classic cars, boats, airplanes and much more. I think men and kids will really appreciate this visit. It was hard to find so I recommend taking a taxi which is inexpensive."
        }, 
        {
            "index": 294, 
            "rating": "5", 
            "review": "great Museum. Great museum to visit if you have a spare few hours to kill or a rainy cold day. My children aged 9 and 13 loved this!!!Its mainly a museum of transport but there are other things on show. Definetly worth a look especially if you have children and want a break form all the historical sites!"
        }, 
        {
            "index": 295, 
            "rating": "5", 
            "review": "Awesome find. Well worth visiting - the Rahmi M Koc Museum was recommended to us by some Turkish friends and I'm so pleased we made the effort to take a taxi out there. Mr Koc is obviously an obsessive collector and we whiled away several happy hours perusing his incredible collection of cars, boats, motorbikes, aeroplanes, hovercraft and even a submarine!There's also a wonderful collection of ephemera which he has been given during his philanthropic works which we found fascinating, and two restaurants on site should you need to stop and rest your weary feet. Well worth a visit!"
        }, 
        {
            "index": 296, 
            "rating": "4", 
            "review": "Huge place!!. I was very surprised at the size of this museum - three buildings, an outdoor section, port and railway line. You can ride the old steam train with your museum ticket.Boys and kids are sure to love it. Cars, trams, boats, all sorts of transport. Technology and experiments for kids. Mock-ups of sawmills and other workshops complete with noises and working machinery. Computers through time.Great way to spend the afternoon.Labelled in English."
        }, 
        {
            "index": 297, 
            "rating": "5", 
            "review": "Fantastic museum. This museum is a hidden wonder of Istanbul. Once you have finished the obligatory visit to the marvels of Sultanahmet and its attractions, consider a visit to this wonderful museum. It has a huge assortment of vintage cars, buses, trains, trams and planes. The assortment of cars is the best I have ever seen. The model T-ford is on view with many other vintage cars and trucks. Vintage motor cycles, bicycles, prams, boats and just about aything industrial is on show. There is also an exhibition relating to Ataturk which is worth a look. For a little extra you can visit the inside of a de-commissioned WW2 American submarine which was ultimately a part of the Turkish navy. Kids will love it. A handy hint - It is easy to spend a day there with time passing quickly. For a linch break, don't eat at the museum. Keep your museum ticket and visit the nearby Lale Lokantasi cafe/restaurant. As you exit the museum turn right and walk 20 or 30 metres. Lok to your left and there is a small street. You should be able to see the restaurant. It is clean, cheap and serves Turkish food at a very reaonable price. Once finished, go back to the museum and show your ticket, and you can re-enter. It is easy to get to. Either a bus (47E) from Eminonu or a ferry from Eminonu. For variety, go back by bus if you arrived there by ferry at first. Both take the Istanbulcarte. Enjoy this not well publicised attraction. There is no other like it."
        }, 
        {
            "index": 298, 
            "rating": "5", 
            "review": "Not Your Usual Transport Museum. Following a tip from a colleague who was based in Turkey we went here. What a wonderfully eclectic mix this collection is. Planes, trains, automobiles, a submarine, boats, motorbikes, prams and a cobra helicopter as well as an eclectic mix of memorabilia from Mr Koc as well as some Ataturk bits. Somehow, our quick visit became the whole day. The best way to get here is to take the Golden Horn ferry from Eminonu or Kadikoy to Haskoy up and back using your Istanbulkart."
        }, 
        {
            "index": 299, 
            "rating": "5", 
            "review": "Top Attraction and a real gem. Not quite the Henry Ford in Dearborn but certainly in the same league. A fantastic collection of transport, engineering, models and miniatures, Not forgetting a novel Orient Express Cafe and collection of astronomical instruments, radios and other paraphernalia opposite. Loved the DC3 and sitting aboard. Steam railway great for kids, I could spend a week there"
        }, 
        {
            "index": 300, 
            "rating": "5", 
            "review": "A BIG surprise. I thought this would be a tacky rich guy's collection but I was very wrong. Koc was inspired by the Henry Fored Museum and Green field Village and I was stunned by the quality of the transportation collection. This could easily be an all-day visit to something other than a mosque or a palace! If you have kids traveling with you and they are bored, this is the place. It was filled with school groups and the kids sounded like they were having an incredible time. Nice cafe on the old ferry, looks like the restaurant was quite nice as well. Really a good time."
        }, 
        {
            "index": 301, 
            "rating": "5", 
            "review": "Excellent....for men mostly. Incredible collection of cars, train, submarine, bikes, boats etc. A \"must-visit\" museum in Istanbul.\nThere is also nice restaurant in the area with good view (probabaly a bit expensive one)"
        }, 
        {
            "index": 302, 
            "rating": "5", 
            "review": "Superb. Thank you Rahmi Koc and his family. I visited photogrqph exhibition about istanbul bridges. It was great other things to see. I really enjoyed whole experience. Visit cost around 12.5 turkish lira. It is about 4 pounds or 5 dolars. It is worth it. I then visited pierre loti hill. And it was great view of golden horn."
        }, 
        {
            "index": 303, 
            "rating": "5", 
            "review": "Fabulous day out. An unbelieveable trip through history in science,travel and communications. This is unlike the traditional 'Istanbul' tourist attractions ie Blue Mosque, Grand Bazaar however this was recommended to us but seemed a little out of the way and not really being sure what to expect off we trekked. We were not disappointed and have to agree with other comments on here that to really appreciated all that is on display you easily need 3 - 4 hours. Include the tour of the submarine, it is amazing to see how 84 crew lived in such small confined spaces. The staff polite and friendly, the premises were spotless (as were the loo's) and although we only stopped for drinks at the cafes they were very reasonably priced i.e. 0.75kr for a small water."
        }, 
        {
            "index": 304, 
            "rating": "5", 
            "review": "Amazing museum, adults also admitted:-). Very nice collection of trains, planes and automobiles, and etc.Beautifully set out and presented. Have a break on the Feherbahce, an old ferryboat with views on the Golden Horn.The extra ticket for the submarine is worth the extra money."
        }, 
        {
            "index": 305, 
            "rating": "5", 
            "review": "THE best museum I've been to. Our kids, 2 and 4 yr old, already love to go to this museum. There are many real boats, aeroplanes, cars, trains, fire engines,... And you can touch and go into many of them. There are buttons to push to make things work and there is a real train that you can ride in. For adults it is a place to admire so many beautiful transport machines. They are kept in excellent condition. Food and drink at the museum are available and very cheap. Car park available and free at the museum. We keep on coming back!"
        }, 
        {
            "index": 306, 
            "rating": "5", 
            "review": "Not just for kids. If you like any kind of transportation, cars, boats, planes, tractors, wagons, motorcycles, etc., you will we wowed by the collection in this private museum. To know that this is the dream of one individual makes it all the more special. Every thing on display is in perfect working order--and you can touch it! You can also have a full lunch at the waterfront restaurant."
        }, 
        {
            "index": 307, 
            "rating": "4", 
            "review": "Combination of Islamic and Christian interiors. this was a unique visit for me to experience the influence religious wars have over places of worship. the area is quite nice too with some cute cafe's and souvenir shops."
        }, 
        {
            "index": 308, 
            "rating": "5", 
            "review": "Best Place if you have kids !. If you are visiting Istanbul with your kids, don't mis this place, they will really enjoy it .My kids love the history of all Transportations.and if your kids are. above 9 they can take a tour into real submarine"
        }, 
        {
            "index": 309, 
            "rating": "5", 
            "review": "An outstanding museum by international standards. This a Museum which is a must for all transport enthusiasts. Located in a former shipyard in the Golden Horn near Haskoy pier, it is easily accessible by the ferry from Karakoy or Eminonu going up the Golden Horn to Eyup. The floating exhibits include the Denny-built Bosphorus ferry Fenerbahce."
        }, 
        {
            "index": 310, 
            "rating": "5", 
            "review": "One of the best museum in Istanbul. One of the must-see museums in Istanbul. Amazing vehicles from past to today. Besides all kind of cars there are also computers, mp3 players, planes, boats etc. Don't leave Istanbuyl before visiting this wonderful museum!"
        }, 
        {
            "index": 311, 
            "rating": "5", 
            "review": "fantastic, one of the best transportation museums we've visited. We love transportation museums. Many vehicles are not just historic they are works of art. This museum delivers on all fronts from the informative information to the quality of the collection. You get every mode of transportation for land, water and air. They even have a submarine.We've been to transportation museums all over Europe and this is the most memorable. We even had a nice quick bite in the café which is conveniently located in one of the car rooms so you can see the cars while eating. Allow 4 hours to do it justice. 2 hours might get you a quick pass through but you'll be rushed"
        }, 
        {
            "index": 312, 
            "rating": "4", 
            "review": "Little known gem .... After hours of patient shopping, museum visiting etc. treat the man in your life to a day of non stop ogling at this fascinating Transport/Industry Museum with everything from a Fighter Jet to Corgi toy collection. Good restaurant on the premises and great views across the water."
        }, 
        {
            "index": 313, 
            "rating": "4", 
            "review": "Transportation Plus. I was not too happy about spending time in this Museum as part of an Istanbul City Tour, but after the hour was up I would gladly have extended it. The concept behind it is crazy, but it works. Approaching the waterside area where it exists, the first thing you notice is the array of airplanes around the main entrance. By the water you will find a collection of interesting boats, and sheds in the courtyard display ancient steam engines, tramcars, and other railway artefacts ----- including the Sultan's personal carriage containing a dummy of the great man himself. Most of our time was, however, spent in the Langerhane building, because of the inclement weather at the time. The collection of automobiles ranging between 1930 and 1970 was fascinating, and included the 1960 Ford Anglia, the first car I ever owned. Many had their insides exposed, or reflected into view by mirrors under the floor. Explanations in Turkish and English were well done. Then there were the 2-wheel modes of transportation: bicycles, mopeds, scooters and fully-fledged motor bikes. Again, the guts and mode of operation were revealed, and they could be started at the press of a button. This theme was continued with common household appliances such as clothes washers and dryers, dish washers and many others: push a button and they start; by encasing them in transparent plastic, the moving parts were in full view during operation. As one last of many other possible examples, I will mention electronics. This series of exhibits included computers, TV and Radio equipment, CD players and Video recorders where removal of the casing revealed the secrets of how they did what you paid for them to do. Add in very clean washrooms and cafeteria facilities and you have the basis for a very enjoyable and informative half-day. But of course, it has nothing whatever to do with Turkey as such."
        }, 
        {
            "index": 314, 
            "rating": "5", 
            "review": "An unexpected joy!. There are some museums that are so beautifully concieved; laid out and presented with such imagination that the subject-matter is almost irrelevant. This is one of those.I am neither a particular enthusiast of transport, nor a person who lingers overlong in museums. However, I knew a trip to Rahmi M.Koc Museum would begin with a pleasant ferry trip on the Bosphorus and, in any case, my guidebook reviewed it so enthusiastically that I thought it worth at least a quick look. In the event, I spent four happy hours wandering the vast collection and marvelling at what can be done with a museum to capture the interest.Room after room of attractively arranged vehicles were interspersed with points of interest such as a 3D cinema, planes who's cockpit you could visit, a No.52 routemaster bus from Mill Hill to Hyde Park Corner (looking very out of place!), working machinery, trams you could walk through, videos and much more. A series of boats were moored at the side of the museum, including a WW2 American submarine, of which I was thrilled to take a brief tour.I can enthusiastically recommend this museum to any visitor. Children will love the 'hands on' elements. And if, unlike me, you are enough of a transport enthusiast to wish to study each exhibit individually, you could be here for a few days!"
        }, 
        {
            "index": 315, 
            "rating": "4", 
            "review": "Interesting place to visit!. I liked the great collection of machinery in this museum. Really loved the classical car collection, it was amazing! It was great to see the full sized airplanes and the steam engines. I felt like I was into a new world of machinery! I had gone there with my family and since I have a six year old kid, it was very good to see the kids section. The boat stop just close to the museum made our travel more convenient."
        }, 
        {
            "index": 316, 
            "rating": "5", 
            "review": "My daughter loves it, so do I. It's a very well organized muzeum by the Golden Horn with lots of antique cars, trains, planes and ships. You can also visit an old submarine and a planatorium inside. My favorites are 2 Turkish sailing yacths who travelled around the world. Legendary KISMET and tiny UZAKLAR."
        }, 
        {
            "index": 317, 
            "rating": "5", 
            "review": "Good. Good educational place to visit especially if accompanied by kids they will enjoy the cars section ,informative and nice need at least 3 hours tour"
        }, 
        {
            "index": 318, 
            "rating": "5", 
            "review": "INTERESTING - HALF OPEN AIR MUSEUM. This museum is at the northern shore of the historical Golden Horn of Istanbul and the vast area it covers spreads over a historical shipyard from the Ottoman period, the whole settlement lies on 3 main seperate parts of around 27.000 square kilometres, the historical buildings used now as a museum were once the anchor house and the dockyard ruins. With its open air museum part, you never feel how the time spent at this museum : there are so many things to see around; an old submarine-into which you may have a small tour, an old train trail-on which you can still travel for 5-10 minutes, an old Bosphorus ship-onboard you can have some tea and traditional Turkish simit, fishing boat-you can have a tour of Golden Horn, and so many more interesting machinery... old cars, planes, printing machines, a planetarium... This is the place for everyone : children, old and young people, students, teachers, families, parents...All can enjoy and have great time there. At the end of the day, there are many choices to rest at : cafe, restaurant, bar either on mainland or onboard of a ship."
        }, 
        {
            "index": 319, 
            "rating": "4", 
            "review": "Nice museum. We had a really good time at this museum. The trip on the ferry to get there is nice and the museum is really fun too. Our boys really liked it. Seeing the insideof an old plane, or an old submarine, all the vintage cars, theships, it is really worth a visit. When you buy tickets, you can also buy supplements for a tour on the submarine (really nice) and the planetarium (not worth it)."
        }, 
        {
            "index": 320, 
            "rating": "5", 
            "review": "Much to see!. Very interesting place and very much to see. And very cheap compared to all the palaces. I very much recommend ths place. We were very nicely surprised by it."
        }, 
        {
            "index": 321, 
            "rating": "5", 
            "review": "nıce and clean unblıeveble. just vısıt there wıth the famıly before want to see thıs place before .staff werry frıendly and they wıll love to help you thats so nıce .it made us more than well come .you can see so many dıfferent thıngs ın here"
        }, 
        {
            "index": 322, 
            "rating": "5", 
            "review": "Nice place to be. As a private museum this is one of the best, so modern, rich content etc. i live in istanbul and have been there 3 times. Everytime there is something new to see and explore"
        }, 
        {
            "index": 323, 
            "rating": "5", 
            "review": "Kids will love it!. You must absolutely visit this museum if you are planning to stay more than 2-3 days in Istanbul. Especially kids will love it. You have the opportunity to enter and have a guided tour(unfortunately only in Turkish)inside a real submarine! Fans of old cars, motorcycles, planes, trains, boats, etc will also love it. Keep at least three hours for a visit and go there(and return) through the Golden Horn ferries from Karakoy Halic Iskelesi, or Eminonu Halic Iskelesi."
        }, 
        {
            "index": 324, 
            "rating": "5", 
            "review": "Planes, trains and automobiles. Brilliant - the private transportation collection (amongst too much else to mention), of the premier industrial family of Turkey. Maintained to perfection, and fascinating for the kids - best to get a taxi, and easy flag another when you're done."
        }, 
        {
            "index": 325, 
            "rating": "5", 
            "review": "Amazing Museum. The Rahmi Koç Museum is located along the Golden Horn . The museum contains items from gramophone needles to full size ships, submarine and aircraft. You can spend a lot of time looking at the exhibits. You can see many classic cars.I recommend to the families and technical people and interested people in this field. Please ask a map of the museum very helpful."
        }, 
        {
            "index": 326, 
            "rating": "4", 
            "review": "A good museum to visit.... The cars are most interesting, I always loved old/antique cars. There are also some old shops, production ateliers, submarine and an airplane.For the more scientific there are parts about how some machines work etc. The environment is good."
        }, 
        {
            "index": 327, 
            "rating": "4", 
            "review": "Interesting collection of modern artifacts. It is large and has an interest array or machinery and models of them from the industrial revolution. It maybe very interesting for children. I suggest to combine with a visit to the Aynalikavak Pavillion, the remaining part of a sultan's summer palace."
        }, 
        {
            "index": 328, 
            "rating": "4", 
            "review": "Not only an Industrial museum it is time machine. I like all the objects are on display.. Machines, cars, submarine, plane, and even running train,, with nice cafe, nice setting , you may spend a day , with family or without.."
        }, 
        {
            "index": 329, 
            "rating": "4", 
            "review": "Was nice and nicer now. After four or five years I visited the museum again and it was bigger and better. It is one of the best museums in İstanbul. Each old car presented in the museum is a work of art. The submarine is a very interesting part of the museum. You will feel the historic atmosphere looking at the little old shops in the museum."
        }, 
        {
            "index": 330, 
            "rating": "5", 
            "review": "The best museum ever!. After having visited the rahmi m koc museum in Anakra. I couldn't wait to go to this one in Istanbul!We decided that we should go after the chora church, as the pier was right next to the museum. Walking from chora church from the pier took a long time as we just got a bit lost in the old streets of Fatih. And also, we walked past one of the pier stations by mistake, as the ferry stations look just like small disused huts! We overshot by two ferry stops but hey, it was a good walk. We arrived in Haskoy ferry station and the museum is right next to it! This museum has everything- such an interesting museum, I think it will be amazing for kids. It has cars, trains, mills, carriages, bicycles, ships, any other mechanically working objects! So nicely curated, also quiet as not many people were there at that time! They also have nice few restaurants on site, a nice posh quiet one looking over to the sea was tempting. It is slightly difficult to get to if you are staying in other places, but I definitely recommend this place to visit. ( Suppose from eminou, it will be direct ferry transfer.) You get 20% off if you have istanbul museum card."
        }, 
        {
            "index": 331, 
            "rating": "4", 
            "review": "Fun alternative choice for kids. This was a nice surprise after visiting all the usual sites with our 9-year-old child in Istanbul—cars, boats, planes, buses, and even a submarine tour. A fun break for our child and a lovely spot to have lunch for parents. The museum restaurant was pricey but very good quality and nice views. There are also cafes scattered throughout the museum, but all seem to offer the same cheese sandwiche and chips so the restaurant is a better choice. We reached the museum via the Golden Horn ferry (dock on the Eminönü side past the bus lot). While you wait for your return ferry there is also a large playground outside the ferry quay to let off steam."
        }, 
        {
            "index": 332, 
            "rating": "5", 
            "review": "Excellent place for kids 4 up to teens. Even as an adult living in Istanbul I enjoy going there. Highly recommend.. The entrance fee is less 10USD. So if you have a lot of kids different ages this is the best you can do as a useful learning time spending in Istanbul. Your photos from that trip will be exceptionally good because the museum design is 'photogenic'."
        }, 
        {
            "index": 333, 
            "rating": "5", 
            "review": "Splendid technology museum. Large technology museum with an enormous collection of different means of transportation and machinery. Very impressive. Bear in mind that you have to pay seperately for a tour of the submarine. You will need more than four hours to see everything. If you feel hungry, you can eat on the premises, or just cross the street and enjoy a very good meal in de Lale Lokantasi. You can easily get to the museum by the Halic (Golden Horn) ferry, which docks next to it."
        }, 
        {
            "index": 334, 
            "rating": "5", 
            "review": "Great if you want to travel through Turkish Republic's history.... Old cars, planes, an old ship and the most exciting one is a real \"sub-marine\" ... Children of any age older then 5 would enjoy it a lot. Also a great place to watch \"golden horn\" while drinking a cup of \"Turkish tea\""
        }, 
        {
            "index": 335, 
            "rating": "4", 
            "review": "eccentric gem. An eccentric collection of everything! Well worth a visit. Took the ferry to and from it, very easy to get to. Not crowded and lots to look at."
        }, 
        {
            "index": 336, 
            "rating": "5", 
            "review": "Nice Museum. Museum is located in Haliç shore, in Golden Horn. There, you can visit a submarine, a plane, or a ferry in the sea/garden . There is a classical car collection inside the museum. Besides there are different kind of collections exhibited on different times of the year, so you can check the museum web site to see what is on site. Moreover, there are workshops for the kids in the museum. There is a restaurant in museum next to the sea, which is very nice to have some time, strongly recommended."
        }, 
        {
            "index": 337, 
            "rating": "5", 
            "review": "So much stuff to see spend plenty of time there. Great for kids too. Every thing mechanical there from clock pumps steam engines to full size aeroplanes buts and even a submarine"
        }, 
        {
            "index": 338, 
            "rating": "5", 
            "review": "Excellent, perfect for kids. Very well laid out, interesting variety of exhibits. The hands-on science/maths section for kids was a real hit. Handy boat stop just around the corner for travel to/from centre of Istanbul."
        }, 
        {
            "index": 339, 
            "rating": "5", 
            "review": "Best museum of Istanbul. If I decide to go somewhere for the second time in Istanbul here is definitely my choice. A very big museum about Vehicles, Ships, Boats, Bikes, Planes, Engines, Cameras, Trains, Submarines, Measuring tools and anything related to them. Must go!Fees:Main section - 12.5 TLSubmarine - 7 TLPlanetarium - 2 TLSome hints:- If you buy all tickets you will be rewarded with a free ticket for your second visit.- At least drink a cup of tea in the ship-teria.- The museum is very big! follow signs and do not miss any part. Also keep in mind that another part of the museum is on the other side of the street.- The movie in planetarium is in Turkish and without subtitle!- You must take the submarine visit and do not forget to book your visit at ticket office.- BRING YOUR CHILDREN! They will enjoy the museum more than you."
        }, 
        {
            "index": 340, 
            "rating": "5", 
            "review": "Have to Go..... When you decide to visit Istanbul.. You have add Rahmi koç Museum to your Daily plan..After here you can go to Miniaturk to see mini turkey :)"
        }, 
        {
            "index": 341, 
            "rating": "5", 
            "review": "it is not just a museum.... even just for this museum u can visit istanbul.amazing museum.ı dont want to give extra info about museum.u can check it via google.i wanna say how to reach it.from eminönü and uskudar u can get there by boat easly.find the halic ferry port-pier.it is just 100 meters away from galata bridge.it is a small port.and at haskoy port u can get off for museum.-journey 15 20 mınutes.from haskoy port ıt ıs just 3 -4 mınutes by walk."
        }, 
        {
            "index": 342, 
            "rating": "5", 
            "review": "Excellent in every aspect!. This is a museum about industry, transportation and communication. Very well executed, appointed and displayed. You can see from model trains and can even ride in a real one. Model ships to a real ferry and a submarine are side by side.Ditto for the planes. Situated on the Golden Horn with a wonderful sea-side view. Includes one of the finest restaurants in Europe along with a super cafe. Very much informative and also entertaining. While in Istanbul it is a \"must-see\"! Nicely and effficiently managed."
        }, 
        {
            "index": 343, 
            "rating": "5", 
            "review": "If you like old cars, boats, and planes. This museum is a must for people who likes technical stuff, like old cars, trains, airplanes and ships. All cars in the museum can actually drive and you can spend a lot time looking at the exhibits.It is not situated in the areas where tourists normally go, when visiting Istanbul but you can get there by bus or taxi."
        }, 
        {
            "index": 344, 
            "rating": "4", 
            "review": "Enjoy the day with your family. This is a very well organied museum. You can vsit here for a couple of hours all a half day with your kids. You can see old cars, trains, a submarine, a plane (DC9) and you can get on a train for a small trip on the bank of Golden Horn. If you want you can visit the nice restaurant on the docks inside the museum, it is a little bit expencsive but the meat they serve there is almost perfect. They have special meat ball menu for the kids and it is also very delicious."
        }, 
        {
            "index": 345, 
            "rating": "5", 
            "review": "Wonderful View with a wonderful experince. If you want to experince a wonderful expence of a historical city of Istanbul more than 2000 years old this is one the most exiting place. You can not only have the opportunity of wonderful collection of old cars, boats and trains also just by sitting near the Golden Horn with the view of Ecumenical Patriarchate of Constantinople, Suleymaniye Mosque and the ancient walls of Istanbul.You may also enyoy your meal delicious meal while watching rowing teams. If you want to have a sight seeing on the historical Golden Horn then you may have the chance to take a tour with a historic steam engine boat. It is also possible to experince to take a tour with a steam engine train by the Golden Horn.Comparing to many other musuems around the world the not only the enterance fee but all other facilities are very cheap.It is also very close to everywhere so you can easly reach this place and your trip to Istanbul will not be completed without visiting this place."
        }, 
        {
            "index": 346, 
            "rating": "5", 
            "review": "Worth a Whole Day. We only found this museum by accident as we saw it from a ferry ride. It is just amazing from prams to trains boats and planes they have it all. Beautifully displayed on the waterfront, plenty of restaurants and loads to keep the whole family occupied."
        }, 
        {
            "index": 347, 
            "rating": "4", 
            "review": "Fun for kids. My husband and I usually stick to art museums and cathedrals, but if you're traveling with kids, this would be great fun. There are lots of \"how things work\" displays, eg home appliances with the inner workings revealed. There's a great collection of old cars from all over the world, from old to fairly modern."
        }, 
        {
            "index": 348, 
            "rating": "4", 
            "review": "great space, huge collection. kind of like a turkish version of the Ford museum in Michigan. Lots of cars, boats, models of cars and boats etc. If you have kids -this would shut them up for a few hours. Great restaurant on the water as well."
        }, 
        {
            "index": 349, 
            "rating": "4", 
            "review": "if have time and if trying to entertain kids. all sorts of cars, boats, wagons, planes and a few interactive exhibits. If just adults, can probably pass unless you really into this stuff."
        }, 
        {
            "index": 350, 
            "rating": "5", 
            "review": "Amazing. Very less spoken about in Istanbul but this museum is a must watch. Vintage cars and locomotives will put u in awe! Nice place for the kids as well. They have a real submarine and u can experience a guides tour inside . It was a woe experience . Tickets costs are separate for the submarine but worth every penny"
        }, 
        {
            "index": 351, 
            "rating": "5", 
            "review": "Nostalgic. This Museum located at the Golden Horn as known industrial museum is more a nostalgic museum where you see the cars, ferries even asbmarine.\nvery interesting to see how we changed to modern items and how we\ndo miss our old days.\nwell organized\neasy to visit"
        }, 
        {
            "index": 352, 
            "rating": "5", 
            "review": "Live the history. Rahmi Koc Museum is just a fantastic place. You can see hundreds of classic cars (even Harry Potters flying car), trains, planes, yatchs, phaetons and SUBMARINE! Its possible to take a little tour inside of submarine, plane, london city bus and trains. These stuff equipped with interactive parts that let you feel them they are working."
        }, 
        {
            "index": 353, 
            "rating": "5", 
            "review": "Kids will love it. This is a huge museum with lots of interactive displays for the kids - we spent an entire day with kids (3 & 4). They have a few restaurants on site. The one we ate at had a french theme. It was ok - and the prices were reasonable."
        }, 
        {
            "index": 354, 
            "rating": "5", 
            "review": "Not to be missed!. Absolutely amazing! How often can you be in a submarine and a dc 3 in the same day! Suitable for all ages too. Make sure you get your submarine ticket at the main reception when you buy your museum ticket as you will be assigned a time. I had over an hour to wait. The website has details on how to get their. Allow four hours minimum."
        }, 
        {
            "index": 355, 
            "rating": "5", 
            "review": "gabriel p. brilliant-- the best museum for lovers of transport and all types of gagets--planes trains and automobiles even a submarine"
        }, 
        {
            "index": 356, 
            "rating": "5", 
            "review": "Suuuuuuuperrrr!. Although my trip to Istanbul was not so long as usually, but i planned to visit this museum.Good, my hotel was not so far from Haskoy,so i took taxi and price was only 8TL. I am not good expert at technique, but everything i saw at museum, made me excited!Especially those old cars! Woooooooow, they looks perfect!I took some pictures of them, you can see. I was falled in love of yellow Cadillac :-)))))....Also i liked expositions of old ships and old aircrafts. Sometimes i felt myself as child,i wanted to penetrate inside cockpits of all planes :-)))"
        }, 
        {
            "index": 357, 
            "rating": "5", 
            "review": "Had a fun time. The museum takes a long time to go through, but I guess it's because we were all excited at everything. Had fun like little kids at the interactive areas."
        }, 
        {
            "index": 358, 
            "rating": "4", 
            "review": "Cool playground for grownups in Istanbul. It is not a spectacle, but very good value for money, spending few hours checking Mr. Koc's collection!Possibility to get in to old DC3 airplane was the highlight of the visit. Too bad it took some additional procedure to see the submarine from the inside. Anyhow, warm recomendation!"
        }, 
        {
            "index": 359, 
            "rating": "5", 
            "review": "An incredible find for the historically or mechanically inclined. I'm a mechanical engineer and love technology museums, so this was an amazing place for me to visit. (My family showed interest and remarkable patience, but was ready to go before I was.) Still, there is a lot here for almost everyone - cars, trains, household items, boats, aircraft, and more - all combined with a unique look at how Turkey has progressed into the modern era over the past 100 years. Many of the exhibits allow you to actually climb into or aboard them, and all let you get far closer and touch more things than you would in a more well-known museum. There were very few people there when we went, so it was a relaxing break from an otherwise busy day.Getting there is a longish but fairly cheap taxi ride from the Eminonu tram stop. I'm not aware of a better public transit option, but the cab driver knew right where it was and dropped us right near the front entrance.If you go, I recommend taking a break midway through, getting a snack (very inexpensive) aboard the museum's restored ferry and sitting at the tables on the front deck while watching the boats on the Golden Horn."
        }, 
        {
            "index": 360, 
            "rating": "5", 
            "review": "Rahmi M Koc Muzesi roooocks!. We were not disappointed at all, oh yes and the kids had a great time - and yes it is very much a hands on museum. I have to admit even for us the big kids we could not hide our joy and pleasure of all the old memories flooding back... Where should i start ...the classic cars were very sweet looking, the train sets collections were sooo amazing, the boat collection one word - classy. The aka 'mechanics display' got the kids going and from there we could not keep up with their hanger to want to see more of what was on display. The whole place was mind blowing for both small and big kids alike. I have to also mention the museum can get very busy with local school groups and such but the place is kept very clean and I mean everywhere."
        }, 
        {
            "index": 361, 
            "rating": "5", 
            "review": "Interesting!!. Everything exposed was so interesting!!We saw old cars old bycicles, olive oil productions, and a lot of fascinating items"
        }, 
        {
            "index": 362, 
            "rating": "5", 
            "review": "Very Unique Museum. This museum is somewhat the eccentric collection of one of Turkey's wealthiest businessman Rahmi Koç. There isn't a consistent theme but it is pretty cool. If you are interested in old cars, technological artifacts, scientific antiques and such, this museum is a must see. Also the location is very scenic, it is right on the historic Golden Horn(an inlet of the Bosphorus)."
        }, 
        {
            "index": 363, 
            "rating": "5", 
            "review": "BRINGS BACKMEMORIES. Visiting this museum brings back a lot of memories of yester years. The museum has every thing from motor vehicles, trains, motorcycles, boats, planes, photography, model steam, electric and mechanical working models and even a wedding photo shoot. If you are into live steam models, then this is the place to go and see them. The restaurants have a variety of food and drinks, with the gift shop well appointed with gifts."
        }, 
        {
            "index": 364, 
            "rating": "5", 
            "review": "One & Only in Turkey. The most interesting museum I have ever been in Turkey, This is the only place you can see a reel and used submarine, so many old industrial items, very well organised staff, located in the Naval docks area. We saw a wonderfull Coca Cola fast food buffet, however, they dont know how to serve Hot Dog, I am not joking, a regular Hot Dog !!! They use a standary bread (pressed in toaster), it is a big shame to do that in a such wonderfull museum and a curse to that wonderfully designed Coca Cola buffet."
        }, 
        {
            "index": 365, 
            "rating": "3", 
            "review": "Interesting.. Tried to get here, but - unannounced - it was closed! A number of exhibits are easily viewed from outside the fences. Makes for a nice trip down the Golden Horn, though, through the old shipyards area of istanbul."
        }, 
        {
            "index": 366, 
            "rating": "4", 
            "review": "Great Museum for Vintage Automobiles lovers. I was impressed with a jet plane that was near to the entrance ,welcoming you to the Rahimi Koc Museum. Once you are inside the main building, you need to pay the entrance fee. Grab hold of the map of the museum. Every part of the building, they have different sections dedicated to the transportation vehicles like vintage cars,motorbikes, boats , trains and horse carriages. I love the trains section, they were just beautiful. Outside on the courtyard, there is an used airplane perched on the roof, you can climb up and get to see inside the cockpit. There is also the 1st steamer which has stopped it's operation, decked near to the submarine.Inside the steamer, there are pictures of Mustafa Kemal Ataturk. If you want to explore the submarine, you need to get your bookings earlier..it comes with a guided tour. I truly enjoyed visiting this museum with my kids and for sure that we will come back again for another exploration...:))"
        }, 
        {
            "index": 367, 
            "rating": "5", 
            "review": "Try to visit if you're with the kids.. Very big and nice collection of cars and machinery.Kids will enjoy it.Trains,cars,plane and submarine,they'll sure like to be there."
        }, 
        {
            "index": 368, 
            "rating": "4", 
            "review": "Nice museum. My family liked this museum. Lots of old cars, trains , planes, etc.. Kids loved being able to get on some of the trains and a plane. There is a section that shows the inner workings of some machines- like a vacuum , motorbike- nice for kids who are interested in that kind of thing. My girls liked seeing old dollhouses and the furniture. We spent about 2 hours here, but could have spent more. If you have done all the tourist attractions in Istanbul and have extra time, bring your kids here. I noticed that they do a lot of school programs here and there were plenty of local kids enjoying the museum. There is a planetarium that only opens on weekends."
        }, 
        {
            "index": 369, 
            "rating": "4", 
            "review": "Great museum for kids.. Nice collection of cars and industrial machinery presented in a very professional format. It's a great place to visit if you have kids."
        }, 
        {
            "index": 370, 
            "rating": "4", 
            "review": "nice. very interesting private museum. But if you have limited time in Istanbul, then you don't have go there."
        }, 
        {
            "index": 371, 
            "rating": "5", 
            "review": "Just WOW!!!. It was a great experience to visit this museum. It is educational and interesting. What ever transportation idea you think of through history it is found there. Adults and kids really had fun. You nedd at least five hours to see the whole museum. Transportation is easy from Taksim take bus number 54HT and from eminonu take bus number 47 and hop off haskoy ."
        }, 
        {
            "index": 372, 
            "rating": "5", 
            "review": "Unexpected pleasure. I am interested in all things maritime, and Istanbul is an essentially maritime city. The Naval Museum is dour, although it is in the midst of a renovation that may change that situation. The Koc Museum, however, is execellent -- a vast collection of cars, trains, planes, ships and small craft, and marine art and artifacts house in a renovated anchor foundry on the Golden Horn. It is a bit out of the way, but easily reached by the regular Golden Horn ferry. Every object or environment in the museum has been perfectly restored. The labels, in Turkish and English, are excellent. The museum restaurant is a perfect place for lunch, quiet, very good food, and right on the water. Recommended for transportation and marine enthusiasts without hesitation."
        }, 
        {
            "index": 373, 
            "rating": "5", 
            "review": "A fun museum. Big. well thought-out, not over-busy.Fun to get to by ferry or bus.Interesting historic stuff. I liked the railway carriagemade for the Sultan in the 1800's."
        }, 
        {
            "index": 374, 
            "rating": "5", 
            "review": "Mr trebor. Great place, exhibitions of a very high standard. Could spend a whole day there if you can find the time."
        }, 
        {
            "index": 375, 
            "rating": "5", 
            "review": "A must see in Istanbul. Great museum that must be seen by all ages, belongs to the no 1 industrialist family in Istanbul, we loved"
        }, 
        {
            "index": 376, 
            "rating": "5", 
            "review": "should be promoted more. Very informative history musium about cars,trains,plains,ships and machines..etc vintage to modern exibits. Worth the trip which should be combined with miniturk 3-5 hours total."
        }, 
        {
            "index": 377, 
            "rating": "5", 
            "review": "Superbly different and eclectic collection. This is a museum with a BIG difference, as it represents a quite unique collection of objects, both mechanical and familiar, mixed in with art and memorabilia, all put together by one of Turkey's wealthiest Industrialists, on a scale quite beyond what ordinary mortals might imagine. Apart from the cars and the submarine, there is a superb selection of horse-drawn carriages, together with prams and children's objects. There is also a very detailed set of booths detailing many and varied facets of the Owner's sailing trip around the world.You should note this is the private collection of no ordinary citizen, but of the man who welcomed Prince Charles and Diana, the Princess of Wales, to Turkey, after their wedding. The collection includes many fascinating memorabilia, gathered from encounters with visiting Heads of State.Be sure to take a superb lunch, in the sunshine, at one of the two restaurants serving good food & wine by the side of the Golden Horn. Suitable for parents, perhaps whilst their children race radio-controled model tugboats, or go for a rowing boat ride! Visited in June 2010."
        }, 
        {
            "index": 378, 
            "rating": "5", 
            "review": "Have fun like kids!. A wonderland for people for all kind of ages. Old cars, trains, planes, a ancient submarine trip, a trip on the golden horn with an old boat... An interactive museum that is a must see for Istanbul lovers."
        }, 
        {
            "index": 379, 
            "rating": "3", 
            "review": "nice car collection, enjoyed the sub. went with my 14 year old. We liked the sub and the car collection, but the rest was less interesting, and a fair bit boring in some places. Probably better with pre-teens. Recommend the energy museum (SantralIstanbul) instead if you have limited time."
        }, 
        {
            "index": 380, 
            "rating": "4", 
            "review": "Beautiful museum with a huge car collection. There is something for every age here, antique toys, computers, cars, boats, even a real military submarine, jets, airplanes, very clean and air conditioned."
        }, 
        {
            "index": 381, 
            "rating": "4", 
            "review": "Interesting engineering items. A little off the beaten path but worth it if you are in the Halicarnassus congress area, good for kids too"
        }, 
        {
            "index": 382, 
            "rating": "4", 
            "review": "A must see in Istanbul. Great museum that must be seen by all ages, belongs to the no.1 industrialist family in Turkey."
        }, 
        {
            "index": 383, 
            "rating": "3", 
            "review": "Have a nice walk in this place...You will not regret... To learn and see the real things from the past....It is really good experience...."
        }, 
        {
            "index": 384, 
            "rating": "5", 
            "review": "Istanbul Transport Museum. Not everyone's cup of tea but if you like transport of all descriptions then this one is for you - two buildings across the road from each other but after seeing one building (3hours+) we gave up on the second one! Well worth the entry fee and easily reached by local bus."
        }, 
        {
            "index": 385, 
            "rating": "5", 
            "review": "Great. I visited the museum with my 9 years son, he loves it very much...what not to love about it...there are something of everything....it is extreamly nice....we went almost to everything inside....I highly recoment visiting the Planetarium while you are thereI do not recommend the Submarine, it is very small, the captine who takes you in a toure inside the submarine doesn't speak very good english so there will be things that he can't explain besides it is very and narrow inside and if you ever visited the submarine in Norfolk VA then this will be nothing compared to it. We spent 5 hours and it wasn't really enough. I highly recommend visiting the Rahmi museum"
        }, 
        {
            "index": 386, 
            "rating": "4", 
            "review": "Good place to visit when the weather is not as nice!. The Rahmi Koc Museum is a privately owned industrial museum, located in Hasköy on the north shore of the Golden Horn. It was founded by the retired owner of Koc, one of the richest family dynasties in Turkey.You can see old cars, ships, airplanes and trains and there is a possibility to make a small trip on a historical train every hour. If you visit this museum on a Sunday, you can see lots of newly married couples as the museum is a favourite place to take wedding pictures."
        }, 
        {
            "index": 387, 
            "rating": "5", 
            "review": "Great for all ages. Wonderful and fits to all ages. We usually viist there with my boy at the age of 7 and always had fun. They organize special workshops for childern. While your child is having great time you can taste good food at Halat restaurant in side the museum."
        }, 
        {
            "index": 388, 
            "rating": "3", 
            "review": "Quirky. An ecentric collection. Great for kids and car and boat collectors"
        }, 
        {
            "index": 389, 
            "rating": "5", 
            "review": "Great place, another aspect of Istanbul - away from the historical sights. We visited Rahmi Koc museum on our last day and it is a simply wonderful place - we spent three-four hours that day and couldn't do justice to it. Especially great are the displays explaining how appliances in our daily lives work - and being able to see too! They have real live working machines with a cross-section cut away and/or transparent bodies so we can see all the workings.The vintage cars, trams, planes, ships are great fun too, as is the train ride along the Golden Horn. The museum restaurant across the road was a fancy French style place where they actually don't charge for water! Great food and atmosphere. A must visit if you have 3-4 days in Istanbul"
        }, 
        {
            "index": 390, 
            "rating": "5", 
            "review": "Wonderful location, good restaurant. The museum is well organized, especially the kids love it. Visitors go back in time with technology. Halat restaurant is one of the best in the area."
        }, 
        {
            "index": 391, 
            "rating": "5", 
            "review": "Excellent. This museum is a pleasant ferry trip up the Golden Horn. You can see trains, mint condition classic vehicles, motorcycles, a tank, a submarine, a fighter jet,model trains, cars and toys. It was a nice change from visiting mosques and other ancient sights. The area around the museum has waterfront parks where local families picnic."
        }, 
        {
            "index": 392, 
            "rating": "5", 
            "review": "Great museum for all generations. Museum worth visiting no matter how old are you. My husband and I spent about three hours there, but it was raining hardly, so we coudn't see all atractions. Don't miss the submarine, it's really interesting experience (for only additonal 7 TL per person)."
        }, 
        {
            "index": 393, 
            "rating": "5", 
            "review": "Variety of things to see. Since there is quite a lot to see at the museum, I would suggest to take your time for to see all interesting goods."
        }, 
        {
            "index": 394, 
            "rating": "5", 
            "review": "Technology Museum. In this museum you can see old cars, bikes, air crafts etc. vehicles and old plants equipment."
        }, 
        {
            "index": 395, 
            "rating": "5", 
            "review": "Great place to take the kids. The preschool I work for takes our students there annually and it is always a highlight of the year. Many boats, cars, and airplanes to enjoy."
        }, 
        {
            "index": 396, 
            "rating": "5", 
            "review": "Awesome for Kids and Adults. Great collection of ecclectic items. Kids will love it and so will adults. Best place for kids on a rainy day or even not. It has nothing much to do with Turkey, but if you need a break and have kids, this is the place."
        }, 
        {
            "index": 397, 
            "rating": "4", 
            "review": "Interesting. If you are interested with art you should definitely visit this place. Rahmi Koç was one of the richest person in Turkiye, he’s mansion next to Bosporus was later tuned to a museum by his children. The surrounding and location is amazing. Each time they are new exhibits to visit, so before going there try to get information over the net."
        }, 
        {
            "index": 398, 
            "rating": "5", 
            "review": "Simply a Wonderland of Trains, Boats, Airplanes and Cars. This museum certainly wowed me with their fantastic collection of boats, trains, and early transportation vehicles to modern day automobiles. They had the little car that was in a Harry Potter film!. I loved the small wooden boats including one that came from Italy, with turquoise colored leather seats. They also had real locomotives and Trams. Especially fun was to walk along \"The Living History Shops\", Among them Ship Chandler where you could peek into the windows and see the various instruments that sailors used. Right next store was the watchmaker shop, filled with all sorts, of brass clocks and watches, and a mannequin so real looking that I almost started to ask him questions. The boat maker shop was filled with ropes, small motors, and various tools used to repair boats.After, I took a break to go outside and climbed up into a real DC3 airplane, DC-3. You can walk right up to see the cockpit and the instrument panel. I made a picture using my mechanical Nikon f2 in black & white film. It seemed so small compared to today's big jets, the museum worker gestured for me to sit down in one of the seats. He pressed a control switch and I could hear a recording of a live take off and landing and listen to the pilot talking to the control tower. This was a lot of fun, after there was more info on the DC3 . They said that they have a few of these planes now working in Australian for short trips. Docked along the Golden Horn you can see various fishing boats, tug boats and even a Submarine (sorry I did not go inside) There is also a lovely wooden ferry boat, where you can have tea, or coffee and sit in the original leather and wood chairs inside.Across the street, they have maritime models, and printing machines. The museum was almost closing so I had to rush thru this part unfortunately.Being a great fan of mechanical devices and machinery it was a great experience. I was sorry that I could not ride on their narrow train that goes along the Golden Horn it runs only on the weekends I was told. If you like mechanical things you will certainly love spending a day inside and outside this museum. They do have a lovely gift shop that has model cars, and airplanes. A pub, a restaurant and the cafe on the ferry boat. I think both kids and adults will have a great time."
        }, 
        {
            "index": 399, 
            "rating": "2", 
            "review": "Poor museum of a very rich man's real life toys. Rahmi Koc opened this museum of owned items probably for profit. First of all It is too expensive for this kind of museum. There is an old submarine, it is not very special but if you want to get on a submarine you can check it out. Its entrance fee is seperate from the museum entrance fee.The museum includes classical cars and some grown up toys. You would probably be bored after an hour or so.You can see the entrance fees at:http://www.rmk-museum.org.tr/english/visiting/index.html"
        }, 
        {
            "index": 400, 
            "rating": "5", 
            "review": "nice place. it is a pity that we did not enter the Museum,bec when we arrive there,it is too late.however,we looked something through the gate.next time,if more chance,surely i will come there"
        }, 
        {
            "index": 401, 
            "rating": "5", 
            "review": "Perfect Industiral museum with a lot of Classical Cars.. The museum is well famous with the industrial equipment from shipyards with steam machines It has also contents of great Classic car museum that you can find Bentleys , Rolls Royces , Harleys , Bugattis etc. You should have visit the submarine and the  trains and wagons form the Ottoman Times. The Museum has a Halat restaurant which is famous with its seafood."
        }, 
        {
            "index": 402, 
            "rating": "5", 
            "review": "Magnificent museum!. we were pleasantly surprised by this wonderful museum. As the Michelin Guide would say \"worth the trip\".Beautiful collection and very informative proposed. A must for anyone visiting IstanbulOnly a bit difficult to reach by public transport, but a taxi ride from Sirkeci train station to there was barely 16 lira."
        }, 
        {
            "index": 403, 
            "rating": "5", 
            "review": "Great place for kids!. This museum is a must for families with young children: there are many active displays for them, as well as old cars, an airplane they can go inside, and a train to ride."
        }, 
        {
            "index": 404, 
            "rating": "5", 
            "review": "museum of istanbul. istanbul is museum city. you can go to museum everwhere in istanbul and rahmi m. koc museum is really nice ."
        }, 
        {
            "index": 405, 
            "rating": "5", 
            "review": "GREAT FOR KIDS DON'T MISS. If you are travelling with kids this is the place all the family will enjoy a lot. You can take the boat from Eminönu to Haliç, enjoy the boat trip, get off at Haskoy to visit the museum which is one of a kind, you can then go on to Eyup to visit the famous holly mosque there."
        }, 
        {
            "index": 406, 
            "rating": "5", 
            "review": "car museum. You can see an extensive collection of old automobiles. You can take a ferry to go to there."
        }, 
        {
            "index": 407, 
            "rating": "5", 
            "review": "Totally Amazing. This museum would be a world-class facility in any city in the world. If you enjoy looking at anything with moving parts, this is the museum for you. It is very much a hands on experience. I think I finally figured out how an internal combustion engine works thanks to the displays and explanations in the museum.My husband loves the extensive collection of old automobiles, all beautifully restored. We also enjoyed the airplane and submarine displays.This is an excellent place for children to learn interesting information in a pleasant manner. When we first visited we allowed only one-half of a day. Now we know better and plan to spend all day when we visit. Although we have been there several times, there are places we have not explored and many things we want to visit again.This is a \"must do\" for us when we visit Istanbul."
        }, 
        {
            "index": 408, 
            "rating": "5", 
            "review": "Unmissable Attraction in Istanbul especially if with children. We planned our holiday in Turkey but were concerned that there were no obvious places the kids (two boys) would really enjoy (not too interested in mosques) so it was a relief to read about the Rahmi Koc Museum. It was definitely not a let down - the museum is awesome, not just for kids, the amount of exhibits on display is incredible and you can easily spend the whole day and not see everything. The exhibits include an actual post WWII submarine which is worth the trip by itself but also cut-out engines, appliances, vintage cars and airplanes for the mechanically minded and exquisite models for the more aesthetically inclined. Perhaps the only down side was that some exhibits, like the tug boat were closed presumably for the season, a big advantage was the very reasonably priced items in the various charming kiosks around the museum - our favorite was the one on the ferry boat moored by the museum and exhibit in itself. If you're staying in the Old City or close by, an interesting way to get to the museum is by the ferry that leaves from close to the Galata Bridge - its a great boat ride and absolutely charming."
        }, 
        {
            "index": 409, 
            "rating": "5", 
            "review": "Surprise surprise. What a shining museum!. As we were \"doing\" Istanbul on our Brompton folding bicylcles, we happend to bike along. Never seen such a mindboggling collection of vintage cars and vehicles and all kinds of other technical equipment. And all so well kept and shining. A must for boys from 5 to 75!!"
        }, 
        {
            "index": 410, 
            "rating": "5", 
            "review": "excellent techinical museum.. Located by the Golden Horn (bus 47 from Eminönü) this houses a broad exhibition of technical innovations. Has an excellent restaurant. You can go to Eyüp with boat from here."
        }, 
        {
            "index": 411, 
            "rating": "5", 
            "review": "Thanks to Koc Family. If you are planning to see Istanbul please put this very special museum in your agenda. All the things that you will see is unbelivable..."
        }, 
        {
            "index": 412, 
            "rating": "5", 
            "review": "RECOMMENDED FOR ALL AGES IN GOOD WEATHER. great collection of cars and industrial machinery presented in a very professional format"
        }, 
        {
            "index": 413, 
            "rating": "5", 
            "review": "A masive collection in a quiet setting. Wonderful collection of vehicles. Best reached by ferry from Uskadar or Eminonou. Alight at Haskoy."
        }, 
        {
            "index": 414, 
            "rating": "5", 
            "review": "Worth the effort to get here-spend all day. My husband and I (no children) spent five hours going through the two buildings and the outdoor collections. We were blown away by the scope and depth of the collection. There are several places to eat on site and also a tea parlor (if you're there as long as we were, you'll need to refuel). We could have stayed longer, but they were closing."
        }, 
        {
            "index": 415, 
            "rating": "5", 
            "review": "Worth the trip for the B24 & Levant Restaurant. We took a boat to Rahmi Koc so my husband could see the B24 bomber, which was beautifully displayed with the touching story of its resurrection from the sea. We were charmed by the variety of machinery and the obvious love Koc has for the Industrial Age and ended up appreciating the loving care with which the objects were displayed.The museum was uncrowded and finding the Levant Restaurant, where we sat on the patio overlooking the water and had a splended meal [pastas with seafood] which watching the boats was a unexpected extra."
        }, 
        {
            "index": 416, 
            "rating": "5", 
            "review": "An interesting diversion. The museum sits on the bank of the Haliç (Golden Horn) and is easily accessible by public transport, being only 10 minutes from Taksim and also from Eminonu. We visited during a public holiday and were pleased to find it pleasantly quiet. The Golden Horn has undergone a transformation over the last few years and is now a sadly overlooked part of the city that visitors really should get to.The grounds and buildings are pristine, beautifully decorated and maintained as are other Koç buildings for the public. The museum focuses on transport and technology and has a good selection of vintage cars as well as sections devoted to industrial processes and maritime, printing, the cinema etc. Nearly all the information is in both Turkish and in English and there are staff who can help.The restaurant cafe (Halat) on the water's edge has super views of Balat and the mosques and has a good choice of meals as well as sandwiches at average prices. It is licensed and stays open until 10 at night so would be a perfect place to enjoy an Istanbul sunset.There are daily boat trips along the Golden Horn, either by an old Black sea fishing boat or by a cute tugboat. Cruises leave at 10 and 5 weekdays and 10 and 8 p.m. weekends. You can also visit a submarine and the planetarium for a small extra fee. We really enjoyed the museum and the lovely atmosphere and wished we had visited a long time ago. It is well worth the 12.50TL admission.Closed on Mondays.Rahmi M. Koç Müzesi Kumbarhane Cad. No: 2 Hasköy - Sütlüce / İSTANBULhttp://www.rmk-museum.org.tr/english/select.html"
        }, 
        {
            "index": 417, 
            "rating": "5", 
            "review": "A must for young children. We went to the Rahmi Koc museum as part of a 21 day tour of eastern Europe, the four hours we spent at the museum was the highlight of the whole tour for our four year old. The only disappointment was that he was not allowed on the submarine (over eights only for some reason) but they had a mock up of the control room outside which he just loved. A really well presented meseum with LOADS of buttons for your litten to press. A sure hit for any young family."
        }, 
        {
            "index": 418, 
            "rating": "5", 
            "review": "A collection of things I haven't seen before. I just want to share my impression for this so well-done museum! You can see as original antiques from Ottoman times (there is a real plane, tank, a copy of an olive-oil manufactory), also some turkish people donated their collections of porcelain figures, model cars...till examples of European culture, like UK and US REAL cars :) I took photos from my visit there, I can share!"
        }, 
        {
            "index": 419, 
            "rating": "5", 
            "review": "Extremely well done museum for both kids and adults. I agree with aeronuat, this museum deserves more attention. I was looking for a place that would be enjoyable for my four year old son, but in the end I don't know who liked it more, him or me. I found myself wishing that they had something like this in my hometown, I would go all the time. The exhibits were well-presented, educational, and interesting, not dry and boring like I expected a museum like this to be. I learned quite a bit about mechanics while my son enjoyed exploring the various types of transportation and seeing how things worked (we especially liked the room that showed an olive factory). For children (or adults) who are enthralled with model trains, be aware that across the street is another part of the museum that has (among a lot of other exhibits) two model train layouts on the basement floor, my son could have spent all his time there. If you're not in the Taksim area, I might suggest taking a taxi for convenience, it was about 14 TL from the Galata Tower and took about 15-20 minutes. It was an easy bus ride back to the Eminonu area."
        }, 
        {
            "index": 420, 
            "rating": "5", 
            "review": "For the young and young at heart. This FAB museum deserves more attention than it gets. I hope the Hopon hopoff bus one day chooses to make their route pass Miniaturk and Rahmi M Koc museums.Both places are worth seeing indeed.Word on Taxidrivers in Istanbul: Avoid the taxis- their only goal is to rip you off- and even with their meters they will cheat you anyway. First of all, when trying to arrange the price for a tour, they will tell you that it is on meter- just keep a good eye on the meter while driving- they can make the price go up by pushing the buttons. WARNING: A classic is to change the 50TRY bill into a 5TRY bill and make you think you gave them the wrong note- DONT ACCEPT IT!!! You will experience this if you use the taxis. If the taxidriver insists that you fall for this scam- just tell them to take you to policestation (Touristpolice has a yellow building by St. Sofya Museum- they speak english)- always remember to take a pic of numberplate or write it down on paper- then go to police and tell them. This scam will not stop if you dont help to do so. So NEVER give drivers a 50TRY note- and dont accept this scam!!! Normal fare taksim square to museum is TRY10-15.If you go from the Taksim Square you can easily take the BUS 54HT & 36T (Hasköy direction)- departs just opposite MacD restaurant. Price is TRY1,5- you pay to the guy in booth on your left when you enter. You will not receive a ticket. The bus stops right outside the museum- you can not miss it. To make bus stop the \"stop button\" are just above the 2 rear doors.The museum is situated on a former shipyard- has a large collection of vintage cars, ships, u boat, airplanes which you can visit. Small train to drive in, visit replicas of old shops, collection of watches, cameras, trains, tecnical maschines.- miniature trains etc etc. When in need of a pitstop you will find small cafees all over the museum...Its a working museum and very hands on- and indeed very informative. Visit to uboat and sailing on Halic are conducted for a fee.Istanbul has so much history and historical places to see- if you need a break and want to experience something else- take to tour to Rahmi M Koc and The Miniaturk museum. And why not combine it with a visit to Eyup Sultan area, opposite side of Halic- take the teleferik to Pierre Lotti cafe for a simit and tea- and enjoy the view of the Golden Horn.Enjoy Istanbul- Istanbul Cok Güsel!"
        }, 
        {
            "index": 421, 
            "rating": "4", 
            "review": "hotel and submarine from rahmi koc is superb but..... the guide[old man] from submarine very nervous. dond ask many questions about that old submarine [ww2] because that guide can make you problems [in his mind]...rest in peace.!!! but the museum is very nice and young staff is helpfull."
        }, 
        {
            "index": 422, 
            "rating": "3", 
            "review": "Hobbies Turned into a Museum. This private museum is named, owned and managed by the Turkish tycoon Rahmi Koç. On the shores of Golden Horn, it's a modern complex displaying a permanent exhibition on Turkish history of transportation, industry and communication. Planes, trains, cars, boats, submarines, bycycles, motorcycles, different types of engines, even an olive oil factory are displayed along with first industrial professions and tools. A short ride with an old train is part of the entrance fee, however, submarine tour is subject to additional payment. Inside the boat, there is also an exhibition on model boats. A part of the museum is dedicated to items collected during the world tour Rahmi Koç made couple of years ago with his boat. Indeed, majority of the artifacts displayed at the museum are from his personel collections. Therefore, it would not be wrong to state that his personal hobbies that lasted for years just led to this museum. The museum visit would be best for children and those who are interested in industrial topics. Its 4 different restaurants, 1 big terrace with a wonderful view of Golden Horn and 1 big meeting room are also available for other pruposes like business meetings, coktails and similar special events. Though the museum is quite impressive, when ranked among the other attractions in Istanbul, it can not be defined as a must. It would be interesting to visit only if all other major museums are visited and there is not much else left to do, except if the industrial history is very appealing to you."
        }
    ]
}