{
    "category": "Kathmandu", 
    "entity": "Kumari-Chowk", 
    "avg_rating_stars": 4.111111111111111, 
    "review_count": 216, 
    "rating_stats": {
        "poor": 6, 
        "average": 46, 
        "terrible": 5, 
        "very_good": 62, 
        "excellent": 97
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "3", 
            "review": "Interesting history, not much to see. Kumari Chowk is part of the Durbar Square complex and houses the living goddess that Kathmandu is known for. The Kumari is one of the most fascinating aspects of Newari culture and religion to learn about, but her home doesn't really offer too much to see. Catch a glimpse if you can but don't stress if you don't."
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "Facinating. Very facinating to hear the culture and customs behind the Kumari. Didnt get to see here but the little place building is nice."
        }, 
        {
            "index": 3, 
            "rating": "4", 
            "review": "A view of the Kumari. The Kumari is held in high reverence by the locals. They go for her 'darshan' or to see her. It is considered very lucky if you get a glimpse of her."
        }, 
        {
            "index": 4, 
            "rating": "4", 
            "review": "Xavier spirtual journey . Fascinating go with A run from Nepal sanctuary treks\nAmazing knowledge and\npassion,brings things to life."
        }, 
        {
            "index": 5, 
            "rating": "5", 
            "review": "Try your luck to get a glimpse of the kumari.. Foreigners may not get the opportunity to see the Kumari. On regular days, just wait out at the chowk for about 1 hour to see if she pops her head out. The day I went was a huge festival for the kumari. I managed to get in to the palace to get a glimpse of the Kumari, probably because I looked like a local and am a Hindu. Foreigners are not allowed to enter the chowk."
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "Visit the Kumari. The living goddess. The temple is where the Kumari and her family live. No photographs allowed. It is interesting to see the history and people working. We were able to see her when she looked out the window. Only allowed to tour the outer portion."
        }, 
        {
            "index": 7, 
            "rating": "5", 
            "review": "Home of Living goddesses. Beautiful world heritage site, artitecturally built, recommended to visit during Dashain festival or indra jatra festival for added attractions."
        }, 
        {
            "index": 8, 
            "rating": "4", 
            "review": "spiritual kumari. Kumari, or Kumari Devi, or Living Goddess – Nepal is the tradition of worshiping young pre-pubescent girls as manifestations of the divine female energy or devi in Hindu religious traditions. The word Kumari is derived from the Sanskrit Kaumarya, meaning \"princess\"."
        }, 
        {
            "index": 9, 
            "rating": "4", 
            "review": "Himalayan Extravagance. This the home of the living goddess.She is a young girl who lives in the building and is revered as a living goddess.At puberty she will be replaced by another equally virtuous young lady.she comes out on the balcony most days for a short period."
        }, 
        {
            "index": 10, 
            "rating": "5", 
            "review": "Nice. In kathmandu darbar square you may able to see live god call Kumari this thing you may able to see only in Nepal not in other country."
        }, 
        {
            "index": 11, 
            "rating": "3", 
            "review": "History & Tradition. It is a fascinating tradition, and the house architecture is very intricate. Managed to see the Living Goddess Kumari, who appeared at the balcony for less than a minute just before 4pm.She did not say anything nor really looked at anyone, and no special ritual but in the local tradition, it is considered a blessing to even see the kumari in person.Worth a drop-in if you are at the durbar square."
        }, 
        {
            "index": 12, 
            "rating": "4", 
            "review": "Unfortunately I didn't see the Kumari but the building is very nice. I missed the time slot when this leaving goddess is available for visiting so I was a bit disappointed nevertheless the building and the history around this figure still worth the visit"
        }, 
        {
            "index": 13, 
            "rating": "4", 
            "review": "Worth a visit.. It is considered very good luck, and a blessing if you are able to see the Kumari (Living Goddess) on one of her short little stops at the window. If you don't have a guide to explain some background and information to you, try and read up beforehand as it will be all the more meaningful. We were lucky enough to see her, but part of me couldn't help feel sorry for the little girl inside. Make this part of your itinerary!"
        }, 
        {
            "index": 14, 
            "rating": "4", 
            "review": "Fascinating. The Kumari have a fascinating history and we were lucky to get an audience with her - very surreal experience and highly recommended."
        }, 
        {
            "index": 15, 
            "rating": "4", 
            "review": "What a life!. We entered the square and were told to store our camera's because otherwise the Kumari would not show herself.Her servant checked from the window and when everyone was without a camera she showed herself for 1 minute. What a sad face!Would she enjoy this show? I wonder!"
        }, 
        {
            "index": 16, 
            "rating": "1", 
            "review": "Interesting, but terribly sad. Wasn't sure what to expect when our guide told us about the living goddess and the tradition it encompasses. We were intrigued and kind of expected of her to be princess-like. She came to the window for a brief ten seconds, looking so miserable that we both left feeling heartbroken for her. It's interesting that this is a tradition that still continues. The tradition itself is very interesting, but I think it's wrong. I don't see how this is enjoyable for anyone."
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "My Devi experience. My daughter and I were so lucky to see the DEVI KUMARI. She is so serine and has mesmerizing face and white soft skin. Felt blessed."
        }, 
        {
            "index": 18, 
            "rating": "5", 
            "review": "was lucky to see the living goddess live.. Was with some guests from bangladesh and finally we were lucky enough that was the perfect time to visit the premises and finally we were blessed by the living goddess live."
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "Spiritually Connected Chowk. One of the Temple where kumasi come outta windows for just a few mins and disappear. Its like you will be so lucky to have her seen by your own eyes. It was about Nepal Traditional way how to choose to Kumari when she was 4 years old. Local people visit here often to just have darshan of kumari. Should visit if you really wanna see something very touching things."
        }, 
        {
            "index": 20, 
            "rating": "5", 
            "review": "Living Goddess. I am blessed from living goddess, KumariKumari means never married.There the kumari be selected from Shakya family, the baby girl after many examinations making sure that the girl is perfect for worship as living goddess, who is able get protection power from god to protect the world from harm. You can see her once a year in public at short before Dashain, The greatest festival of Nepalese."
        }, 
        {
            "index": 21, 
            "rating": "4", 
            "review": "Intersting place. Very interesting place and worth reading into the traditions and history of the Kumari before visiting. Entrance fee of NPR1000 or USD$10."
        }, 
        {
            "index": 22, 
            "rating": "3", 
            "review": "Good. I was lucky enough to capture a glimpse of the living goddess on my day in Durbur Square. There was something really arresting about her stare."
        }, 
        {
            "index": 23, 
            "rating": "3", 
            "review": "Child goddess in concrete block room. I may be bringing my cultural bias here, but I found this disturbing. This young girl sits silently all day in a small concrete block room at the side of a square where there is a temple. She is not allowed to talk or smile. You can take pictures and leave a blessing. It is an odd experience."
        }, 
        {
            "index": 24, 
            "rating": "5", 
            "review": "highlight. we were lucky to be there near the time she appears , had to wait 20 mins to see her. the history of her existence should be read, if not see her will mean nothing to you.she was only in the window for about 2 mins."
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "living God. the Kumari is chosen by the monks after a long selection process, she was 4 years old when she became Kumari, now 10, she makes rare showings at the temple window for about 1 minute, we were lucky and saw her, its a strange spectacle but taken very seriously and totally spiritual"
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "Virtually untouched . When the earthquake struck last April, or so the story goes, the Kumari, Kathmandu's Living Goddess, urged those attending her to remain calm \"Nothing will happen here,\" she is reported to have said. And nothing serious did, even as temples crumbled and buildings lost their facades all around.Her gorgeous medieval temple, with its interior courtyard where the goddess can sometimes be glimpsed, even by tourists, is well worth a visit."
        }, 
        {
            "index": 27, 
            "rating": "4", 
            "review": "Amazing tradition. Visited the palace where the Kumasi resides. A fascinating piece of Kathmandu culture, that our guide explained wonderfully. I bought a book written by an ex Kumasi called from goddess to mortal - it was very interesting."
        }, 
        {
            "index": 28, 
            "rating": "4", 
            "review": "Interesting architecture and culture. I havent' visited to see the Kumari, but it's a significant story to hear…things are changing, still there is something fascinating about how this tradition came to be."
        }, 
        {
            "index": 29, 
            "rating": "4", 
            "review": "Live goddess here.. This temple is situated in kathmandu durbar square area.Nepali people worships a girl , considered a live goddess.Photography is prohibited here.Good temple to see.But earthquake ruins the some beauty of here."
        }, 
        {
            "index": 30, 
            "rating": "4", 
            "review": "The lure of glimpsing the Kumari remains.. I won't tell you the story, but seeing the Kumari is a little odd....but should certainly be part of your sightseeing agenda for the Durbar."
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "This was odd AF. Seriously, if you're there when the Kumari is potentially going to appear, it's worthwhile sitting around for a few moments to catch a glimpse. Hollywood has nothing on this, this is real and both beautiful and interesting. Find a guide and ask about the history, there's plenty of people who will share it. Well worth it."
        }, 
        {
            "index": 32, 
            "rating": "4", 
            "review": "The goddess?. This is a nice building and the history is great but to actually catch a glimpse of her might be a little hard. The hours that the child goddess is available does not necessarily mean she will make an appearance... but then again if I was locked up in a building and being gawked at all the time I probably wouldn't spend a lot of time at my window either. Your going to see it if you are in Durbar Square anyway..."
        }, 
        {
            "index": 33, 
            "rating": "4", 
            "review": "A very interesting culture!. I stumbled upon this place entirely by accident while only intending to visit the Durbar Square. I am very glad I did as I have a very interesting experience. I got to see the living goddess Kumari for a minute as she stood in the window. It's a very odd culture to me and guests are reminded not to take photos or laugh/giggle during her appearance. Go with an open mind and be willing to learn about this interesting culture. You can donate for the upkeep of the temple. There are guides around the temple who will talk more about the history of the goddess and the temple. Again while you did not request for their presence, they will insist on talking to you and later ask for a tip."
        }, 
        {
            "index": 34, 
            "rating": "3", 
            "review": "A strange experience. Personally I find the concept of of a young ‘living goddess’ somewhat odd but you have to respect local beliefs when you visit places such as Nepal. The temple itself is quite ornate with lovely carved woodwork leading into a central open courtyard. Our guide knew how to request the goddess to show herself and once her minder had confirmed no one had a camera she appeared, looking, to be honest, quite lonely and sad. It was an interesting if strange experience."
        }, 
        {
            "index": 35, 
            "rating": "2", 
            "review": "Not worth it !. I personally thought that this attraction wasn't worth the money we paid. You go inside the temple and Kumari will make an appearance and that is about it. The story behind it is somehow nice."
        }, 
        {
            "index": 36, 
            "rating": "5", 
            "review": "nepali niwaris culture. knowing the niwari in nepal's culture, we were excited to meet the niwari kumari( goddess) that live in this building and live her daily living life here as a goddest. we were allowed in this building only once,we take turns to go in by group and no cameras are allowed. The kumari will open her window only few times in an hour start from 4 pm if im not mistaken to reveal herseld so those who are luckly, would be able to see this beautiful creation of God. the building tat she is staying in are beautiful, very classic looking but its shakened a little bit in view of the the earthquake that happened in 2015. if u are culture lover, this is one of the place that u would love to visit before u leave kathmandu but its always better to know the history of the culture prior visiting this place:)"
        }, 
        {
            "index": 37, 
            "rating": "4", 
            "review": "A very evocative space.. This beautiful little courtyard, with all its Newari woodwork features is in the home of the Kumari, the living goddess. Knowing the story of her life of isolation, being plucked from her family for a life of duty and ritual, makes this a rather sad venue and evokes mixed emotions. At certain times she can be seen at the balcony and her beautiful, doll like features seem to accentuate her loneliness."
        }, 
        {
            "index": 38, 
            "rating": "3", 
            "review": "Small building, interesting history. The most fascinating thing about this building is not the place itself, which is very small, but the fact that a \"living goddess\" resides here, hidden from the world outside. The 'goddess' is chosen from hundreds of applicants as a 2 or 3 year old, and lives in the building, almost never leaving, until her first menstruation when she is cast out and another toddler is chosen in her place. I cannot imagine being kept in such a place for so many years - it all seems so alien, but is very real. The intricate wooden carvings on the doors and in the walls are worth close inspection."
        }, 
        {
            "index": 39, 
            "rating": "3", 
            "review": "Blessed by Living goddess!. Its a tradition worshiping young pre-pubescent girls as manifestations of the divine female energy or devi. It appears to have taken hold in Nepal in the 6th century. Intresting is the history one can dwell about!Its been 3 times I have visited Nepal and fortunate enough to get Darshan of living goddess of Nepal each time. Kumari Temple is based out of Durbar Sqaure. A small girl of age around 10-12 is regarded as goddess in Nepal, whose blessing is not only persued by common people, but also by kings and politicians of nepal. It was said that before going anywhere and before doing anything good, king used to pray before Kumari.It is an exemplary specimen of ancient Nepalese architecture, but is now destroyed by the recent earthquake. It been just supported by long wood logs. I wonder about the threat of life to Kumari and her disciples living in there.Anyways, feeling lucky as each time I have visited Nepal I got blessed by her."
        }, 
        {
            "index": 40, 
            "rating": "4", 
            "review": "Living goddess. The Nepalese believe that Kumari is a living goddess. She resides in Kumari chowkcourtyard with traditional carving with big attractions. Non-hindus can see her at balcony from courtyard when she does an \"audience\". No photos are allowed."
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "An eye opening experience. We visited Durbar Square without the knowledge that Kumari was there but when the guide ushered us in and in time for Kumari's appearance, boy was we surprised. I ended up buying a book on Kumari and learning more about the culture after that!"
        }, 
        {
            "index": 42, 
            "rating": "5", 
            "review": "250 Years Old Tradition.... One small girl is selected and considered as divine... The selection process is very similar of Dalai Lama... Only hindus are allowed to enter the House..."
        }, 
        {
            "index": 43, 
            "rating": "3", 
            "review": "Timing is everything here. . We didn't see her. You get to hang around in a small court yard full of overhead pigeons ready to white wash you. Above are a few small windows where if you are there at the right time you may gain a glimpse if you are lucky. No photos are allowed of her. The building has been damaged by the quake and props are all around making your safety and hers questionable if another quake occurs."
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "Seeing the Kumari. Got a quick look at th Kumari who came and stood at the window of her house for a minute at the ceremonial window. Strictly no pictures allowed. She only is on display at certain times, usually in mornings"
        }, 
        {
            "index": 45, 
            "rating": "3", 
            "review": "Part of Durbar Square.. You pay 1000 NPR. AU$12 to enter. There are many temples within the Square along with this one. Does not look like the photo. A lot of destruction there from the earthquake."
        }, 
        {
            "index": 46, 
            "rating": "4", 
            "review": "See if you're lucky. If you arrive at the right time you may get a glimpse of the \"living goddess\". We were there around 10:20. She did look rather sad. No photos allowed. On a previous occasion with a different goddess we were allowed to go inside and take photos. Take time to look around the buildings, there are some wonderful carvings."
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "Get blessed by the living goddess. Kumari is a living goddess who's between 6-13 years old & lives in a temple near Patan Durbar. It's amazing to go see her & get blessed by her. She won't smile or talk to you, but her 13-year old sister will answer any questions you have. I highly recommend this if you're in the area. Leave her a tip on the plate at her feet."
        }, 
        {
            "index": 48, 
            "rating": "3", 
            "review": "Interesting tradition. Such an interesting tradition of having a \"living goddess\" that you can actually go and visit! We tried to see her but were rushed away by our tour guide when she didn't show."
        }, 
        {
            "index": 49, 
            "rating": "5", 
            "review": "don't get late. Just hire a car and guide from Nepal Cultural Travel and Adventure and visit Kumari Chowk and other places of interest in kathmandu Durbar Square."
        }, 
        {
            "index": 50, 
            "rating": "4", 
            "review": "Awesome history but she looked so sad. We visited multiple times and saw her a few times. Everytime we saw her she looked so sad. The story and history behind the Kumari, The Living Goddess, is beautiful but I guess reality is a whole nother thing. Seeing her was the only must-do my girlfriend had on her list in Kathmandu."
        }, 
        {
            "index": 51, 
            "rating": "4", 
            "review": "Goddess in human. . Kumari mean virgin, goddess that dwell in human being to protect from evil spirits. Long history behind the living goddess Kumari , she is worship by the people Nepal and keep her in the special house near to ancient palace of kathmandu. Kumari chowk is beautiful courtyard with traditional carving with big attractions. Only hindus are allowed to enter in the house, but none hindus can see her at balcony from courtyard. No photos are allowed, photos are allowed when she take a tour out side of the house. Once travelers visit Durbar square of kathmandu they can easily visit beautiful kumari chowk...."
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "Nice experience to see living goddess \" Kumari\". During my first visit in 2013, i have had see kumari in durbar at her house but this time in 2016 i didn't see her. An earthquake made this place very bad. hope Nepalese will rise soon again with this and other historical places. temple and places is very nice and interesting to visit always."
        }, 
        {
            "index": 53, 
            "rating": "3", 
            "review": "Good to visit not much to see. Visited when I was near durbar square. It was inside a small quadrangle didn't see her but saw some side rooms were there were people sleeping. There was not much damage from the earthquake. Interesting story about the living goddess and how they choose them and what happens afterwards. Worth a look if you are near by."
        }, 
        {
            "index": 54, 
            "rating": "5", 
            "review": "A must see!. The living goddess was truly memorable, I am so glad we saw her, there is nothing like this at home!"
        }, 
        {
            "index": 55, 
            "rating": "3", 
            "review": "Not convinced. Having tried to leave my western child protection hat firmly at the door I still felt uneasy as the guide told me all about the initiation of these girls at age 3 or 4 - including watching the slaughter of 100 animals and then having to stay in a darkened room all night with the severed heads to see if she was \"brave\"! However, when in Kathmandu and all that so I agreed to go into the enclosure to \"see\" the living goddess only to hang around 45 minutes to then be shouted at from in upstairs window that she was busy!From what I understand this child comes to an upstairs window on a few occasions a day, looks out and goes away again.Didn't miss much then?Don't know, but the architecture surrounding her home is well worth seeing even if she doesn't come out."
        }, 
        {
            "index": 56, 
            "rating": "3", 
            "review": "Glimpse of Kumari. This is in old town square in Kathmandu, where the only living Godess recites. There is a certain caste of people there who believe that Kumari is their Godess and they have made a special home for her where she is raised until the age of 12 and then is replaced by her successor. You may visit it during noon and get to see her glimpse while she comes to wave at the public for 2 minutes."
        }, 
        {
            "index": 57, 
            "rating": "5", 
            "review": "Amazing. We stumbled into the courtyard of the Kumari Goddess only to be told that she was coming to the window shortly. Kumari then appeared for a few minutes looking down at us. She was absolutely stunning to look at. I had not expected a young girl to be the Kumari. I was lucky then, a guide to another group explained her existence. Apparently she only appears once or twice a day. A donation is expected and photographs of the Kumari cannot be taken."
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "Awesome. We are fortunate that Iconic Nepal arranged a tour guide that narrated the story of Kumari the Goddess. We really got to know more of the culture. We didn't get the chance to catch a glimpse but we admired the architecture of the building which, is so intricate."
        }, 
        {
            "index": 59, 
            "rating": "4", 
            "review": "Go with a guide. Try to go there with a tour guide who can explain you well about the place. We were lucky to get one who arranged by the hotel Crown Plaza."
        }, 
        {
            "index": 60, 
            "rating": "5", 
            "review": "Try and get a glimpse of her. We were fortunate to get a glimpse of the Kumari- the energy here is very powerful and the architecture of her home is beautiful."
        }, 
        {
            "index": 61, 
            "rating": "4", 
            "review": "Cultural experience. I'd read about the kumari girls before I went and so was excited to see her. We went with a guide who was able to tell us even more and answer our questions, which I'd recommend, as there really isn't any info on site. If you'd like to actually catch a glimpse of the kumari at the window you need to let someone know (our guide did this) and then put some money in the offering box (our guide suggested 10-15 rupees/person). You also cannot take photos of the kumari (although you can of the courtyard, etc)."
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "I was tour guide.... Kumari living goddess n it was built in 17 century. This Kumari festival - Indra Jatra, every year on September according full moon."
        }, 
        {
            "index": 63, 
            "rating": "3", 
            "review": "Interesting story. Our guide took us to the house of the Kumari, or Hindu living goddess. She is 9 years old and has been living a sheltered life since she was little. Interesting piece of information about this ancient culture. You have to forget your western ideas when visiting other countries whose daily lives are lived through their religion and customs. My first thought was how stringent our child protective laws are in the United States. But have endeavored to learn more about this ancient practice of raising a living goddess. Our guide tried to persuade her caregivers to allow her to come to the window, but she never did. He said she might if there were more people. Foreigners are not allowed inside the house. Then I noticed the donation box. Maybe money would have brought her into view. I had never heard of this Kumari and left with an interest in learning more."
        }, 
        {
            "index": 64, 
            "rating": "4", 
            "review": "Read about her First. If you don't know who or what the kumari is, find out before you go. Then wait to see her. We got lucky and stumbled in to see her at the window. But she only appears for a few seconds twice a day (AT MOST)."
        }, 
        {
            "index": 65, 
            "rating": "5", 
            "review": "very interesting story. The house isn't much to see but if you are lucky enough to see the Kumari then you are really lucky. Google the Kumari to read about the Living Goddess."
        }, 
        {
            "index": 66, 
            "rating": "5", 
            "review": "great square. it was the best place what i visited , i don't know what stay after earthquake, but definitely worth to visit it"
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "Kumari Che. Kumari, a living Goddess, is unique for Nepal. I don't think similar exists in other countries. If there are many tourists Kumari shows herself, sitting on a balcony for several minutes, but she did not look down. It is not allowed to take pictures of Kathmandu Kumari in her private time, so to say (not during her appearance in public at festivals)"
        }, 
        {
            "index": 68, 
            "rating": "5", 
            "review": "Worth visiting. its the place of the Kumari or the young girl who is worshipped as a Goddessrarely will anyone get to see her but its told she gives her appearance on auspicious days.after the mishap in Nepal got to know that though most of Nepal was devasted this Kumar Chowk suffered minor tracks.."
        }, 
        {
            "index": 69, 
            "rating": "3", 
            "review": "It's a quiet scene. I walked into the courtyard at a time when nothing was going on. The woodwork above the doorways is worth a good look. There were a number of people milling around doing just what I was doing. It's a quiet scene. I'm not sure what it's like when the Kumari emerges."
        }, 
        {
            "index": 70, 
            "rating": "5", 
            "review": "HISTORY AND HEART BREAKING. This my 2nd trip to Durbar square and this Kumari Chowk is situated inside the durbar square but now its has fallen aprt due to the earthquake but this Ghar is not badly effected. When I was there in 2013 it was beautiful ancient building and we were told that the \"Kumari\" Child Goddess were sleeping so we did not see her. I tried to zoom my camera lenses to her room but i could only see a mickey mouse doll hanging on the window of her room. Kumari Devi is a living goddess in Nepal and its a tradition of worshipping young pre-pubescent girls as a female energy. This Kumari stays in \"Kumari Ghar\". A tradition and filled with HISTORIES of NEPAL. Dont miss this place."
        }, 
        {
            "index": 71, 
            "rating": "5", 
            "review": "Little gem in Durbar square area. You have a chance to see Kumari. I'll tell you when. I have been here twice during my short stay. Architecture is so eye-catching that this is also one of the musts for all visitors. Place is pretty small and thank's to G-d it wasn't destroyed during the earthquake, but it looks a bit fragile now as it has a lot of wooden supports all around. If you are lucky enough (or blessed in Nepali's jargon) you will have a chance to see Kumari in one of three windows. She has only one public appearance in a year, BUT... if there are a lot tourist, she shows up for a minute or two in the morning or afternoon - depends on the season (if it's not too dark, too cold, and other factors). If you are about to visit this place during the winter - around December - it's worth to go there around 4pm and wait. If there are more tourists (more than 10-15 I would say), her chamberlain will check the situation from one of the windows and once he says that you are not allowed to use your camera, you are lucky enough, as Kumari will show up for a while then. But don't forget to turn off your camera as it's forbidden. And make a small donation then - You saw a living G-d!!! :)"
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "Classis and gorgeous Newari architecture. Whether or not the Kumari appears during your visit, plan to spend some time examining the details of the carvings surrounding the temple courtyard. The best time to go is early in the morning before the other tourists and the postcard sellers and potential tour guides crown the place. The mythological and political stories of how the Kumari came to be, and the current political implications are well worth exploring as well, and will make more sense once one has seen the actual temple."
        }, 
        {
            "index": 73, 
            "rating": "3", 
            "review": "This is just weird. For a westerner, this is just weird. Supposedly, they choose a little girl and declare her a living God (Goddess?) until she reaches puberty. You can meet her and donate. She will \"bless\" you which is just more weird. Still, if you want a weird experience, maybe this is a good one. ;-)"
        }, 
        {
            "index": 74, 
            "rating": "4", 
            "review": "Worth to visit. Definitely worth to visit, so much history, but unfortunately a lot of ruins. They are in the process to renovate at least some of the temples."
        }, 
        {
            "index": 75, 
            "rating": "5", 
            "review": "always a pleasure. sometimes you are lucky, sometimes not. lots more touts hanging around when i was last there but still a place to visit."
        }, 
        {
            "index": 76, 
            "rating": "4", 
            "review": "Amazing. The Living Goddess and her building escaped the earthquake, but needs supports to hold it up. Well worth a visit to see the Living Goddess appear at the window"
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "Busiest Place. Walk in the area and enjoy the culture, handicrafts and the woodwork in old wood houses.Good for a winter afternoon walk"
        }, 
        {
            "index": 78, 
            "rating": "3", 
            "review": "We saw her at the window. We had a guide who walked us there and told us the story of the Kumari a girl who is take from here parents at a young age to become he living goddess, she lives in this place secluded from her family and other kids here age and comes out once a year to be paraded around town for everyone to see. (that really simplifies it), I thought our guide was talking about something that happened 1,000 years ago, but she came to the window and we saw here. Our guide said that he has been a guide and taking people there for 15+ years and had never seen her there and i was a good omen that we saw her."
        }, 
        {
            "index": 79, 
            "rating": "3", 
            "review": "Hard to understand for a westerner. A little girl locked away in a house until she starts her periods,idolized and separated from her family,displayed only on certain holidays,not my sort of \"sight\"wish that little girl the best"
        }, 
        {
            "index": 80, 
            "rating": "4", 
            "review": "Small temple. Interesting architecture. The area is damaged by the April 2015 earthquake but it is still well worth a visit. We did not see the Kumari."
        }, 
        {
            "index": 81, 
            "rating": "3", 
            "review": "She wasn't there when we were there.. I suppose it's amazing when she comes out. We only saw the building, so it wasn't that exciting. Make sure you plan ahead, we just did out own walking tour and didn't plan it well."
        }, 
        {
            "index": 82, 
            "rating": "5", 
            "review": "warm feeling?. We had the luck to see the kumari. And beleave it or not... i had a warm feeling when i saw her at the window."
        }, 
        {
            "index": 83, 
            "rating": "5", 
            "review": "Unique Architecture. The little square was cute and wonderful to photograph. The architecture and art work here is very unique. Certainly recommend this"
        }, 
        {
            "index": 84, 
            "rating": "5", 
            "review": "Very cute Kumari. When we visit Kumari Chowk, Kumari had just peeked from the windows. I guess about 45 seconds. I watched Kumari and caught her eyes as well, which I think means good luck. We were very lucky to see her just like that!"
        }, 
        {
            "index": 85, 
            "rating": "4", 
            "review": "Meet the living goddess. Went into the kumari temple and had the chance to see her for less than a minute. Photos of her were not allowed. We had to make a small donation after seeing her. Its a very small temple with beautiful architectural interior."
        }, 
        {
            "index": 86, 
            "rating": "5", 
            "review": "Kumaris and the concept make you think hard. No visit to Durbar Square is complete without a visit to the Kumaro Chowk. Read up on the Kumari concept and how it has evolved in Nepal and the debate on both sides of the issues thrown up. Some excellent books are available on the subject."
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "Living Goddess. I've been to Nepal 8 times, this is the first time I've seen the Living Goddess. Our guide took us into the court yard and knew what time she appears. An interesting aspect of the culture."
        }, 
        {
            "index": 88, 
            "rating": "2", 
            "review": "BEAUTIFUL WOODEN TEMPLE, IN SPITE OF THE EARTHQUAKE. \"Kumari Ghar\", as it is called, is in Durbar Square in center of Kathmandu. It is a very intricately carved wooden structure of two stories. It has traditional Indian sub continental architectural plan of two square areas with open space at the center and building on all sides. The entrance door has a wooden frame, incarnated with sculptures of human skulls. All around, many other motiffs adorn wooden carvings.Inside, we were told, a young maiden girl stays who can be seen by visitors once a day at designated timings. She is the holy virgin or \"Kumari\" and is worshipped as a human form of a goddess.The house is UNESCO World Heritage monument."
        }, 
        {
            "index": 89, 
            "rating": "4", 
            "review": "The Kumari goddess. Had been to the Kumari temple with a guide on a Sunday. Around noon actually the Kumari goddess, a young girl chosen, showed herself for 1-2 minutes at an open window in the temple. Taking photos not allowed.The relatively small temple itself may not be entered but you may get inside the inner court."
        }, 
        {
            "index": 90, 
            "rating": "4", 
            "review": "Hectic experience. very noisy and hectic. You have to get there early for a good vantage point.It was well organised. Avery colourfull occasion"
        }, 
        {
            "index": 91, 
            "rating": "5", 
            "review": "Good visit... A must to visit while in Kathmandu, Patan and Bhaktapur...If you are lucky, you have the opportunity to view Kumari Chowk !"
        }, 
        {
            "index": 92, 
            "rating": "5", 
            "review": "ancient ritual of a living goddess. Interesting story about a young girl living in an anciant palace until puberty when she resumes her normal life to be replaced by another \"new\" lving goddess"
        }, 
        {
            "index": 93, 
            "rating": "5", 
            "review": "The \"Living Goddess\" of Kathmandu!. The \"Kumari\" or the \"Living Goddess\" lives in a three storey palace at Kathmandu's Durbar Square. This palace, built in 1757, is known commonly as \"Kumari-Ghar\", with awesome wood carvings and traditional Nepalese architecture. The \"Kumari\" is a young girl - aged around 7 to 8 years old, believed to be an incarnation of Goddess Taleju. Visiting \"Kumari-Ghar\" is a must while in Kathmandu and the \"Living Goddess\" makes daily appearances around 4PM. She appears at a small balcony on the third floor of the inner patio. She won't smile or talk. Pictures are strictly forbidden (her pictures are sold at the palace's entrance). As soon as she appears, she leaves. Remember: she is only a small girl and probably tired of tourists. The young \"Kumari\" will lose her deity after her first period. According to Nepalese legends, former \"Kumaris\" find it rather difficult to marry afterwards, as husbands would \"die\" shortly after marriage. Probably just a legend for tourists like us. I visited Kathmandu on February 2015, nearly two and a half months before the terrible earthquake that devastated Nepal. Recent reviews by important newspapers state that, fortunately, \"Kumari Chowk\" or \"Kumari -Ghar\" remains unharmed at Durbar Square (a tow of Rs 750.00 is charged to all visitors to enter Hanuman-Dhoka Durbar Square). Enjoy!"
        }, 
        {
            "index": 94, 
            "rating": "5", 
            "review": "The Wood Carving. I have not see some thing like this,, the wood carving just took my breath away, I have travel to Europa and latin destinations but this was very new, very diferent, the bulding desing it was just diferent a must see."
        }, 
        {
            "index": 95, 
            "rating": "4", 
            "review": "Different. It is a building off Durbar Square. Kumari is a young girl picked to stay here up till pubirty. She lives here and has caretakers here. She makes an appearance at the window a couple of times a day and has a very serious look. She is not allowed to smile but it is auspicious if you do get to see her. No photographs are allowed."
        }, 
        {
            "index": 96, 
            "rating": "5", 
            "review": "Kumari Ghar. This is the place where the 'Living Gioddess' lives. A wonderful old building with avery traditional and intricately decorated inner courtyard. collusive Newari architecture. I was told it was not damaged in the big earthquake. really worth to see and you might just catch a glimpse of the Living Goddess!!"
        }, 
        {
            "index": 97, 
            "rating": "4", 
            "review": "A part of culture & tradition that needs to be preserved.. There is something different in this place , in its feel & the overall impression it leaves. It's as if time has something to convey that cannot be explained in rational terms. The respect earned by the KUMARI'S is legendary & has stood the test of time , even today . Sadly , the KUMARI house could be better maintained since the institution is old & needs to be preserved. Even modern Nepal , after the abolition of monarchy has retained its place for the KUMARI tradition. I was there approx 2 years ago & I believe that the KUMARI house has withstood the fury of the recent devastating earthquake....perhaps an example of its divine powers as all believers would say !!Besides visiting the place, its definitely worth reading about the KUMARIs & its traditions."
        }, 
        {
            "index": 98, 
            "rating": "4", 
            "review": "Fascinating history. A very interesting attraction and must visit if you are in Kathmandu. The entire square is full of history and culture. Even though it is a religious place, as a non-Hindu you will still comfortable to appreciate the history and intrigue of Kumari Chowk. The story behind the Kumari is fascinating. I had the pleasure of meeting Kumari during my visit and that made the visit extra special."
        }, 
        {
            "index": 99, 
            "rating": "3", 
            "review": "Interesting but also quite sad at the same time.... I was lucky enough to see Kumari Chowk when I visited Kathmandu, however the story behind the chosing of a Kumari is both fascinating and sad. Once a girl has been selected and shows the '32 perfections' of a godess she must endure futher tests one being spending a night alone in a room whilst buffalo are slaughtered. The girl is then kept in isolation and is never allowed for her feet to touch the floor, she has helpers that do most things for her. As soon as the Kumari reaches puberty, she is considered impure.The Kumari is then dethroned and returned to her family whoms she last saw when she was very young. Whilst I think it is incredible that a living goddess is in existence, I felt incredilby sad at the same time, that one day this young girl will have her privileges removed and will somehow have to try and live a 'normal' life. Despite all this if you do want to have a chance of seeing the Kumari a good time to visit is around midday."
        }, 
        {
            "index": 100, 
            "rating": "5", 
            "review": "The Home of the Living Goddess. the home of living goddess in the durbar square premises. Glad to see the living goddess looking through the window inside the kumari chowk. But sad about it was I couldn't take a photo because taking a photo is not allowed."
        }, 
        {
            "index": 101, 
            "rating": "4", 
            "review": "Chance to see a living goddess in the flesh.. Unless you know this is here you might well mistake it for just another house around the square. But ducking inside the low door and into a small courtyard beyond you might just catch a glimpse of something out of the ordinary - a real, actual living goddess. The Kumari is a young pre-pubescent girl who has not spilled a drop of blood, chosen as the protector of the city then incarcerated in this Chowk until such time as any blood.. well you get the drift! Time it right, usually just before lunch and after homework she appears at the window to gaze down on onlookers. Unfortunately no photography is allowed but enterprising locals will flog you postcards outside! Have to say she did look a bit nonplussed that most of the crowd beneath her that day were tourists rather than worshippers."
        }, 
        {
            "index": 102, 
            "rating": "4", 
            "review": "Fascinating visit. It is fascinating to know that in Nepal, young girls who have not attained puberty are worshipped as Godesses. Especially, a Kumari is chosen as the living deity. She lives in Kumari Ghar, almost at the end of Durbar Square. Photography is strictly prohibited."
        }, 
        {
            "index": 103, 
            "rating": "5", 
            "review": "Residence of the Kumari. This is a small and interesting courtyard in the Kathmandu Durbar Square which is home to the Kumari of Kathmandu. Kumari is a pre-pubescent girl who is selected to be worshiped as a living goddess. When she reaches puberty she goes back to an ordinary existence.The courtyard is surrounded by superbly carved wooden balconies and windows. Perhaps this is one of the most beautiful courtyards in Kathmandu.If you take a guide (or ask around), you may catch a glimpse of the Kumari as she peeps through a window (she comes to the window at a specific time of the day). We were unable to wait there and see her due to paucity of time."
        }, 
        {
            "index": 104, 
            "rating": "4", 
            "review": "Calm and well maintenance wood carving. It's small courtyard that calm and decorated with detailed wood carving. Luckily that after the earthquake this place doesn't take much damage compare to other. At least all is not loss."
        }, 
        {
            "index": 105, 
            "rating": "4", 
            "review": "The living Godess of Kumari. Visited the Kumari Chowk , on 2 January 2015 as a part of Kathmandu city tour.Interesting history about the sacred living Godess of Kumari , were told by our guide Mr.Prasant , appointed by Outshine Adventures.The home of Godess Kumari , is the red-brick, three-storey building, located is home to the Kumari, at the junction of Durbar and Basantapur Square.Kumari is a girl who is selected to be the town’s living goddess until she reaches puberty and reverts to being a normal mortal.Inside the building , is Kumari Chowk , a three-storey courtyard. It is enclosed by magnificently carved wooden balconies and windows, making it quite possibly the most beautiful courtyard in Nepal.Our guide knew the exact time for the appearance of the Kumari , efficient time management.The Kumari generally shows her face between 9am and 11am and 4 pm to 6 pm.Photo taking is allowed on the premises , but prohibited during Kumari appearance.Only the Hindu people could enter the building, to seek blessing from Godess Kumari.A very interesting visit and history of the Godess Kumari should not be missed.Heard that a part (or whole ?) structure was damaged because of the Gorkha earthquake and aftershocks ,we don't know for sure.Hopefully if it suffered from damage it could be restored to its original state.Worth a visit !"
        }, 
        {
            "index": 106, 
            "rating": "3", 
            "review": "Nice architecture, but don't overthink the concept of the living goddess. The Kumari's house is just off Kathmandu Durbar Square. This is where the living incarnation of the child goddess ices while she is in office. Do some reading first about who and what she is and find out about the abuse that some of these girls had to endure in times past. A quirk of Nepali Hinduism, there is also a kumari in Patan - though Kathmandu's is easier to see at the allotted public audience times (4-6pm) - no photography is permitted."
        }, 
        {
            "index": 107, 
            "rating": "5", 
            "review": "it gives you a different feeling altogether. this place doesnt permit foreigners and also photography. this is the place where the living goddess of Nepal resides. the place is so tranquil and must visit to see the intricate newari architecture"
        }, 
        {
            "index": 108, 
            "rating": "3", 
            "review": "Courtyard unfit for a Kumari. The Kumari Ghar or the house of the Living Goddess Kumari is undoubtedly an obliged visit by anyone to Kathamndu. The house of Kumari is besides centrally located.The inner courtyard however with it's once exquisite Regresando a los pueblos donde hay internetTodo bien faltan 3 días más de caminata, ha sido un ret architectural motives are rather stained and compromised by the pigeons droppings. Several of the ground floor doors as well are in a rather deplorable state.As if this were not bad enough, on entering on the right side there are empty soda bottle crates, an old aluminum soda display stand plastic chairs etcetera as if it were a warehouse for some street vendor venture.We were however lucky that one of the local guides solicited the presence of Kumari from her middle third floor window. Whereupon a woman looked out to first be sure that we all put away our cameras before. Kumari looked out the window in her regal attire showing her beauty but un seemingly inexpressive of those of us who looked at her from below.Be sure to visit the Kumari Ghar but take into account that what goes so much as for her outer palace courtyard it certainly seems unfit for such a divine manifestation. (Obviously my personal perception. Should you see it otherwise that is fine."
        }, 
        {
            "index": 109, 
            "rating": "1", 
            "review": "Child abuse. They randomly pick a 4yo, take her away from her parents, call her kumari and declare her a goddess.As a such she is locked inn a temple, not allowed to see other children, only priests.Her feet may not touch the ground.Then she has her first menstruation, is no more a goddess and is kicked out into normal life.Impressive culture.Child abuse institutionalized"
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "A Stare Like No Other. Many who do not understand this tradition would often feel sorry for the little girl and what not. You should know that you're in Kathmandu and a strange tradition such as this is what lures you over in the first place anyway.The child's body is just a host to the spirit of the goddess Kumari, much like the statues in religious temples worldwide. Say in Bali. Only that I find it amusing that the people here would find a living and breathing body of a girl as a substitute to a common stone idol. Pretty neat.We went into her royal abode without any hope of seeing her at all. Suddenly there was a commotion in the little courtyard and we had a hunch that she was about to appear.There she was at the window wearing a shiny yellow dress with a knot in her hair and traditional facial makeup. The only word for me was 'gutted' as the air was knocked out of my stomache and out it all went through my nose. It was a godly stare indeed and I felt small and somewhat pathetic in her presence.Then off she went after granting us some 5 seconds or so of her godly graces and the briefness of it all made it all the more special. Personally, I've never been in the presence of any god. So this must be what it feels like.God to me shall remain unseen but just for a fleeting moment of grandiose lowliness, you should try visiting the Kumari Chowk. She just might appear.Only one tip. You'll never know if you don't go."
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "The living Goddess. Kumari is the living Goddess who is worshipped in Nepal and the Kumari Ghar at the Kumari Chowk is the home of the Goddess. If you are lucky can catch the glimpse of the Goddess who comes on the balcony. Only Nepalese citizens can meet the Goddess by visiting her at the top floor. The Kumari Ghar has some amazing carvings out of wood, making it a must visit place within the Durbaar Square."
        }, 
        {
            "index": 112, 
            "rating": "5", 
            "review": "Learn the one unique cultural feature only found in Nepal.. Worshiping Kumari is a fascinating tradition which I am glad Nepal has managed to maintain for centuries on end despite their political instability throughout decades. If you are lucky, you'll get to have a glance of Kumari in person when you visit this chowk (house in Nepali). They say normally, at around 4 pm is the best chance to see her. The house itself is nothing special compared to Kumari stories. However, this place was built in the past especially for the worshiping of Kumari. Those who want to do puja (Hindu religious rituals) with Kumari can actually book an appointment. Until this day, the president of Nepal visits Kumari from time to time for her blessings. I would advise you to find and read a book called From Goddess to Moral, told by a former Kumari and written by a British journalist. It's very easy to find this book in bookstores around Thamel."
        }, 
        {
            "index": 113, 
            "rating": "4", 
            "review": "Fascinating surviving cultural story. The history and cultural traditions of the Kumari are fascinating. Lots of different views and judgment of the practice of selecting, secluding and worshiping the Kumari, but no matter your view of it all, it's fascinating to see. Can usually get quick glimpse of the Kumari if you visit respectfully."
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "The living Goddess. This is in Durbar Square. This is the Priest House/or the living quarters of the Kumari or the Living Goddess."
        }, 
        {
            "index": 115, 
            "rating": "5", 
            "review": "Worth the wait. The residence of Kumari-the Living Goddess of Nepal who is the manifestation of Goddess Taleju-the patron of the rulers of Nepal. On request, the goddess gives a quick audience from her window. You are not allowed to take pictures and if you try she disappears in a blink."
        }, 
        {
            "index": 116, 
            "rating": "5", 
            "review": "Seek her blessings. Defined timings for darshan. Go and see a living goddess. Lucky are those who get blessed by her. Time spent in waiting for her to peek from the jharokha is well spent"
        }, 
        {
            "index": 117, 
            "rating": "3", 
            "review": "Little God. This is one of the most important place to visit. Since I have concerns on girls education, and not accepting the traditional harmful practices/norms; I will leave you to judge on this place and the religious norms. But this is one of the popular place among the tourists, Hindus."
        }, 
        {
            "index": 118, 
            "rating": "5", 
            "review": "Kumari. Thrilling to see this living goddess appear at the window to answer your unasked prayers, but It is not allowed to take photos of this beautiful young girl."
        }, 
        {
            "index": 119, 
            "rating": "5", 
            "review": "Home of Living Godess!. Was here more than 20 years ago -- there have been many goddesses since that time! But if you are patient (and lucky) when visiting the Durber Margh, you may see the heavily made up, apparently sad child godessr peering out of an upper story window. Once she menstruates, it's out with the old and In with the new."
        }, 
        {
            "index": 120, 
            "rating": "5", 
            "review": "Thrilling to See the Kumari. The Kumari Bahal is just off Durbar Square in Kathmandu, and, when there, you must try to see her. The Kumari is a young girl who is the reincarnation of Taleju, the living goddess. She was discovered when she was about four years old after passing many tests. She could not show fear from the severed head of a water buffalo; she had to select items that belonged to the last incarnation of the Kumari from many objects; and more. She lives in a house that serves as a monastic enclosure from the time she is four until she reaches puberty - at which time another Kumari is selected. It is great good fortune to see the Kumari, but no photos may be taken of her. We entered the Kumari Bahal past two splendid ritual lions that were brightly painted. We were ushered into a courtyard and told that we should quietly wait. She didn't always show herself. After less than ten minutes, the Kumari came to an upper window. She was beautifully made up with heavy eye makeup and was wearing a plain pink angora sweater. She stood quietly and gazed at us without reacting to our namatses. And, as quickly as she showed her face, she was gone again. I felt very fortunate to have seen her and felt that it was a great blessing for me. As I walked away, I wondered at her happiness. She looked so pensive and unresponsive. I bought three portrait postcards of her and think about her since I saw her."
        }, 
        {
            "index": 121, 
            "rating": "4", 
            "review": "I saw the goddess twice in 20 minutes.. I wander in the the kumari chowk. Hang around for awhile and then, a large western tourist came in. The guide explained to the tourists the inside out of the house. And then, he called out the name of a person and a middle aged man came out. I don't know who he was. He could be the Kumari's father. And then the guide told the tourists , \"No Picture. She will come out for 30 secs\". After making sure no one is taking picture, he signaled to the middle aged man, and Kumari came out looking at us for ahwile from the window. All of us greeted her \"Namatse !!\". I was happy seeing her - the living goddess. I thought to myself I must be lucky from now on. I went out. I hang around. I saw another big tourist group went in. I followed them. I asked myself would she came out again. Again, the tourist guide called out the middle aged man. After making sure no one is trying to take any picture, Kumari came out. I was like. \"huh, is Kumari the mascot ? \" Maybe, I was being lucky. Ok, no disrespect here. She is a living goddess. Life must be tough for a kid when everyone make her as one. But I am happy going back home seeing Kumari twice."
        }, 
        {
            "index": 122, 
            "rating": "3", 
            "review": "Just OK. Since this is right next to Durbar Square we visited it. We waited a while for the Kumari to appear but guess she was busy. It is a interesting story but just an ok place."
        }, 
        {
            "index": 123, 
            "rating": "4", 
            "review": "Kumari - living goddess. According to our guide the Kumari is chosen from the Nepali caste group of priests at an age of around 4 years. She can only become Kumari if she passes the test of being in a dark room with the severed head of a water buffalo without being frightened. If she passes the test, she will serve in the house until she reaches puberty (12-13 yrs). While in the house she will only leave maybe once per month and is always carried. While in the house she has a caretaker who takes care of her. The Kumari's family may visit. When the Kumari reaches puberty she then goes back to live with her family."
        }, 
        {
            "index": 124, 
            "rating": "3", 
            "review": "Kumari Chowk. Listen to your guide. There are some rules applied here. Not all are lucky to see her. I was not lucky as the timing was not right."
        }, 
        {
            "index": 125, 
            "rating": "4", 
            "review": "controvential custom, interesting for western culture. there is a litlle household/ temple netx to complex of main Dunbar Square in Kathamndu( every region in Nepal has the same story so there are more goddies ) ....Goddess named Kumari. She is chosen ( as far as I understand) from very young girls beloning to the higher cast to be a reancarnation of the goddess when she is about to be 3/4 yo. Than she lives with monks one year till she will be ready to prove that she is a goddess. There is a carnival at the Dunbar Square and lacal people kill as far as I remember 18 water buffalos and some goats by beheading them.Then belivers show the heads of animals soaking in blood to the chosen goddess/ little girl. If she would be sacred it means that she is not reincarnation of goddess but if she would be fine then she will spend the rest of her childhood and teenage at the tample, not allowed to have contact with others only the monks, she would be not able to walk on the ground. She will serve her duty till she will become a women then....she is off....and another one is chosen...I asked my guid what will hapan to this young women after???? she wil get a good eduaction....but nowone could tell me wich kind of and how can you be a normal person in such complicated situation when you are away from society for such a long time You can not take a picture of Kumari while you are visiting her palace but I took a pic of her bedroom appartmet window....look ...there is a doll in the window and maybe you can not see but there is a doll house there...poor kid who has to play games with herseslf among monks...well it was interesting experience for me to see such a different society...like almost fro middle agas....but still exist!!!"
        }, 
        {
            "index": 126, 
            "rating": "5", 
            "review": "The Kumari. You have to go and see the Kumari for sure in Durbar Square.Be aware of the timings.You cannot see her after half 5 in the evening.Morning hours are best anfd she comes out briefly for a few seconds so U will have to b patient and waitup.Its a legend and a mustdo.Shes so young and pretty.Was totally worth it!!!"
        }, 
        {
            "index": 127, 
            "rating": "3", 
            "review": "Very interesting, especially right off the plane. Groggy from my plane flight i hired a driver (really Cheap) and I did the Kathmandu touristy stuff for the day. i Did actually see the Living Goddess, my guide for an hour showed me the rest of the square and had a little knowledge about some of the temples. It was hot, crowded and touristy, but I didn't mind. One thing I have to mention, is these guides that appear out of know where and start talking to you. Be careful, if you commit with out a price you may pay allot of money.Pay what you want but 1/2 of what they want is more than enough."
        }, 
        {
            "index": 128, 
            "rating": "5", 
            "review": "Kumari - the living Goddess. The chance to see the Kumari proved futile as could not get a glimpse of her. The young girl dedicate to the Kingdom lives by herself amidst the crowded palaces and other buildings"
        }, 
        {
            "index": 129, 
            "rating": "4", 
            "review": "living Goddess. go when a tourist group is there. the Living Goddess usually comes out when enough people are there."
        }, 
        {
            "index": 130, 
            "rating": "5", 
            "review": "Lovely place and nice story. In the middle of Kathmandu, Just few minutes walk from Thamel it was amazing and really amazinghistory about Kumari. Kumari means virginity and not married people.and more extra then othernormal people.As far as i know Kumari is the living god. Bless for it............................"
        }, 
        {
            "index": 131, 
            "rating": "4", 
            "review": "We were Blessed. At the junction of Durbar and Basantapur Squares, a red brick, three-storey building is home to the Kumari, the virgin girl who is selected to be the town’s living goddess until she reaches puberty and reverts to being a normal mortal. We were lucky in early July to be there at the spot when the current Kumari rewarded us with a fleeting blink-and-miss appearance from her central window."
        }, 
        {
            "index": 132, 
            "rating": "5", 
            "review": "Saw the Kumari on my first day here!. It was very cool to see the Kumari Devi appear at the window in the afternoon. No photos of her are allowed, but it is considered good luck to see her. Definitely worth it!"
        }, 
        {
            "index": 133, 
            "rating": "5", 
            "review": "Interesting Experience. Seeing the Kumari was one of the most fascinating parts of my trip to Nepal. Our guide explained her role and how she is chosen. I was intrigued enough to buy a book on it- \"From Goddess to Mortal\" written by a formal Kumari."
        }, 
        {
            "index": 134, 
            "rating": "5", 
            "review": "Kumari Darshan. The urge to see the virgin Goddess was the motive to spend half a day at Kumari Chowk. And we are gratified as she appeared for few minutes at a window on the second floor. They prohibited us taking her photo. Else the whole surrounding with the replica of the England's Queen's Palace and the Old carved building and museum was interesting."
        }, 
        {
            "index": 135, 
            "rating": "4", 
            "review": "Interesting. There is a story behind this. Every time, from a specific tribe, a girl is chosen to be the Goddess. She must reside here and is revered till she gets her first period. If you are lucky enough, you will get to see her."
        }, 
        {
            "index": 136, 
            "rating": "2", 
            "review": "Disappointed... Didn't see her.. Apparently there are certain viewing times.. and she only comes out during certain celebrations, so check it out before making trip"
        }, 
        {
            "index": 137, 
            "rating": "3", 
            "review": "Kumari-The Living Goddess. Went to the Kumari Ghar with my 15 yr old son, the Kumari appears around 4 pm everyday - we waited for a long time, me and my son taking pictures of the exquisite wood carvings of the three storeyed building that houses the Living Goddess. There is a courtyard with plenty of greenery against the mohagany backdrop of the palace.After a long wait, the Kumari appeared and a hushed silence fell on the crowd. Though we knew she was a young girl, but it was surprising to see her small dainty frame- sadness washed over me to see such a small girl taken away from her family,being alone in the palace and worshipped as a Goddess."
        }, 
        {
            "index": 138, 
            "rating": "1", 
            "review": "A bit freaky!. although i have a wide experience and knowledge in the culture of Nepal now, but this would be the only thing i disagree with from a humanitarian perspective!Worth to see and have your own experience!"
        }, 
        {
            "index": 139, 
            "rating": "3", 
            "review": "Slightly eerie. A tradition in Nepal is that a young girl is considered as a living Goddess and is made to live alone in a tower, ala Rapunzel. Its a bit strange that a child is made to live all alone and treated like a god and once she grows up isn't worthy of it anymore."
        }, 
        {
            "index": 140, 
            "rating": "3", 
            "review": "More interesting to walk by, and to read abou, than to make a trip out to see this. So, this is a very interesting Nepali custom. However, walking by, you're unlikely to see very much. But, given that I've never even heard of a living goddess, I was fascinated to read about her, and see where she lived. But, it's not worth the trip just to see the building. You are not likely to see the girl."
        }, 
        {
            "index": 141, 
            "rating": "3", 
            "review": "Kumari mata temple.. I visited this Kumarimata temple. The girl is worshiped as a living Goddess .She gives darshan from the window for just a few minutes.It was really dirty. Peageons hovering over& shitting."
        }, 
        {
            "index": 142, 
            "rating": "1", 
            "review": "Set the 'Goddess' free.. I can't understand why a girl ( and that's what she is) can be locked away with no family,friends,education ect to support her.She's known as Kumari! a aliving Goddess and yet as soon as she reaches puberty,she's cast aside because she is then thought of as impure too old to be a Goddess. she's just a child and she can't do anything.There was a man looking out of the window when we visited the ''theme park'' The rest of Durbar square is very beautiful what with it's Jimmy Hendricks Temple and all.Not worth the visit."
        }, 
        {
            "index": 143, 
            "rating": "3", 
            "review": "Kumari. If you want to know more about Kumari read 'From Goddess to Mortal' by Rashmila Shakya, an ex Kumari. Kumari are now educated, they do have children of their own age to play with, they are not subjected to an intimate body inspection and do not have to spend a night with 108 severed animal heads.I visited the Kathmandu Kumari house recently but at lunch time Kumari does not appear. this meant I was able to take photos of the house. I was so intrigued that I bought this book. An easy read and fascinating."
        }, 
        {
            "index": 144, 
            "rating": "4", 
            "review": "small but interesting. we couldnt go inside the main house, but small area below the main house had great architecture, we even got the glimpse of the living goddess and she was really pretty. amazing experience it was"
        }, 
        {
            "index": 145, 
            "rating": "5", 
            "review": "We saw the current Kumari. The Kumari is a young Goddess who lives in a temple in Durbar Square. It is auspicious to witness her in her window where she appears on a daily basis."
        }, 
        {
            "index": 146, 
            "rating": "3", 
            "review": "Interesting but sad.... Kumari is a girl selected by the community (there are only 2 or 3 of them in Kathmandu I guess..she is left at this place at an age of 3-4 and lives there until puberty. She is not exposed to an outside world. She is assumed to be a goddess.she just looks outside from a window of a temple several times a day for a few seconds and people stare at her. It is sad that she isolated from children her age, a proper education. It is sad to watch her..And our guide told us that no one wants to marry her as she is considered a goddess."
        }, 
        {
            "index": 147, 
            "rating": "3", 
            "review": "Quick glimpse of the Kumari. We got to see the Kumari twice in a matter of 10 minutes- the first time she came and abruptly left, and then returned again 5 minutes later for just about a minute. Its a nice experience getting to see the Kumari through the window- she seemed to make eye contact with almost everyone present there There isnt much else that happens within that space at that point - go there if you are already around Durbar Square."
        }, 
        {
            "index": 148, 
            "rating": "5", 
            "review": "Beautiful. Amazing house, with a weird yet enchanting story behind it. Really nice! All the woodwork is so intricate I could spend all day just studying it. Was there during a festival... Do that if you can. People get insane over a site of Kumari!"
        }, 
        {
            "index": 149, 
            "rating": "5", 
            "review": "There at the right time!. This was a very timely visit to the home of the Kumari. My guide and I were there for just a few minutes and she appeared It was pretty surreal because she is truly a child living in this very protected space. She appeared unexpectedly with beautiful make up and beautiful hair, but she was chewing away on gum. It was sad for me to read how this very young child would lead a life of luxury, but also a life of loneliness. If you are in the area, it would be worth the experience if you could catch a glimpse of this Kumar."
        }, 
        {
            "index": 150, 
            "rating": "3", 
            "review": "Young Girl is Living Goddess. My first day in Kathmandu I ended up walking over to Durbar Square and was approached by two \"guides\" who took me over to see the Kumari. We all gathered in a small garden area for the priest to announce she would come to the window. When she appeared in the window she was beautifully dressed but, amusingly, seemed very antsy like any other 8 year old girl who wants to be doing something else. When she appeared, all the Nepalis immediately put their hands in namaste position and bowed their heads. I asked the guides how they choose her and it is dependent upon her caste, her horoscope, etc. When she gets her period, however, she will be replaced by a new living goddess. I would not wait around for hours to see her, but if you are Kathmandu's Durbar Square and the timing is right, make sure to go to where she appears."
        }, 
        {
            "index": 151, 
            "rating": "5", 
            "review": "8 year old girl worshipped as a living goddess. We were fortunate to see her within 15 minutes of waiting in the court yard. 2 hours later, we went back again for a second visit. The living goddess appeared for a brief second and left in anger suddenly. It seemed some one in the crowd has snapped a photo of her. Therefore, be warned not to take any photograph as instructed by the authorities. Enough respect must be shown to the local culture and religion."
        }, 
        {
            "index": 152, 
            "rating": "5", 
            "review": "Fascinating to see the Kumari. Small house off Durbar square you can take photos of the building but not the Kumari. Went with a guide which made it better with some understanding of the place and history."
        }, 
        {
            "index": 153, 
            "rating": "3", 
            "review": "Nice Architecture and History. Kumari Garh where the goddess live is a very nice building built in Nepali architecture style. The history behind Kumari can checked in wikipedia, its quite interesting. We did had a chance to see her around 4 PM in the evening. Someone told us she comes out to see the people once in morning and evening. We waited from 3.45 pm, she came out around 4.05 pm just for less than a minute."
        }, 
        {
            "index": 154, 
            "rating": "5", 
            "review": "Historic Heaven. Head here to see the absolute best in Newari-style architecture and historical building. If you are around in October, try and attend the Kumari festival when the locals celebrate this Goddess of Virginity and Purity. Amazing spectacle that takes place all around her home in the Chowk."
        }, 
        {
            "index": 155, 
            "rating": "5", 
            "review": "visit to kumari garh. each country has its own culture and traditions and we have to respect them.a girl selected as goddess is stationed in this house till she attains puberty.believed as GODDESS.luckily on the day of our visit it was a festival day and we got an opportunity to climb upstairs to have a darshan of KUMARI who happened to be a 7 to 8 year old cute looking girl happily eating chocolates given by a visiting 5 year old,a very different experience one must not miss"
        }, 
        {
            "index": 156, 
            "rating": "2", 
            "review": "Sad but true. With all respect to any religion, I find this \"attraction\" very unhuman. Many other travelers explained it in their reviews, so I don't want to waste the space here.The only plus is a very beautiful building and nice wooden carvings inside a nice little courtyard where she is \"living\".To make the impression worse, she went out on the window, we saw her, and after that the local guide advised to leave some donation."
        }, 
        {
            "index": 157, 
            "rating": "4", 
            "review": "Mythological. Fantasy-like place full of tradition and myth. To think it houses a human deity, a little female (a Kumari) who is revered and respected as an embodiment of innocent & gracious qualities that we should recognise in all little girls and see them as benevolent forces of Nature."
        }, 
        {
            "index": 158, 
            "rating": "3", 
            "review": "Interesting, at a minimum. Went in to see the princess and she did show herself for a minute or so. Strange history and culture but unique, for sure! Read up on the princess before you go. One last thing - watch out for the pigeons!!"
        }, 
        {
            "index": 159, 
            "rating": "3", 
            "review": "Inprisoned?. Everyday at 4pm the Kumari \"living goddess\" comes to a window in the chowk to show her unemotional face (a required trait) to onlookers below. More hype than reward."
        }, 
        {
            "index": 160, 
            "rating": "3", 
            "review": "Strangle. As everyone has already mentioned this practice is quite strange. The building inside actually differs a lot from the surrounding shrines etc. There was a small Aladdin poster in one of the small windows which goes to show , goddess aside there is a small little girl there still"
        }, 
        {
            "index": 161, 
            "rating": "2", 
            "review": "we haven't see here. luckily we haven't see her because we didn't like that a child stay for all her youth closed inside four walls.\nwe know that we have different traditions and culturs but this is inhuman."
        }, 
        {
            "index": 162, 
            "rating": "5", 
            "review": "splendid. this small palace is a jewel of newari architecture,with magnificent carvings and well preserved.here lives the Kumari ,the legendary Living Goddess,who is venerated as one of the manifestation of Durga.her holy feeth cannot touch the ground,so she is always carried when she goes out,twice in a year,and is paraded through the town on her high chariot ,pulled by devotees.a real must to see during Indra Jatra festival."
        }, 
        {
            "index": 163, 
            "rating": "4", 
            "review": "Strange but I've to respect.. It's something traditional I had to respect although I felt a bit strange about how come this little cute young girl became a living goddess. Anyway, I did like my guide said that I had to say namaste when she came out from the window and no camera, I could understand that anyway.I heard that she was told not to smile to anybody while she's at the window, that might be difficult for her in any way. But after I read a book about Kumari, I felt better about her life that's not like normal people. It's good to know that nowadays she has to study like other children, that'll make her life easier when she's not a goddess anymore.Kumari Chowk was also a beautiful old place, I like it."
        }, 
        {
            "index": 164, 
            "rating": "3", 
            "review": "A little strange. It is quite strange to sit there and wait for the 'goddess'. There were strict orders about no cameras--so how did someone get this photo for it??--and people walking around ensuring no one dared. She came to the window and people were astonished. She didn't look happy or enjoy being there. There is a deep culture so there is a need to appreciate their customs but awkward seeing a young girl that seems unhappy."
        }, 
        {
            "index": 165, 
            "rating": "1", 
            "review": "No! please stop it!. I can understand traditions and different culture but please stop with Kumari! she's just a child and she can't do anything: she can't study, she can't talk to anybody, she can't walk (!!!!), she can't smile (!!!) she lives without her family (!!!), she can't go outside, she has no future! only because they think she's a goddes...c'mon it's 2013! middle age is finished! this is not an attraction, this is torture to a child! please stop it and give her a future!"
        }, 
        {
            "index": 166, 
            "rating": "5", 
            "review": "Exciting. Must visit Lumari Bahal on Kumari chowk to experience the sight of living Goddess. This is a unique experience in itself that Goddess is preached in living form. All in all very impressed with the concept. Do take time to read about how the selection process of Kumari is done. A sight of Kumari will surely leave you highly impressed. If you are lucky, you will catch a glimpse of the goddess. A young girl is chosen to become the goddess. Living godess. Dressed up once a day round 5.30 in evening and show her face at the window. No foto."
        }, 
        {
            "index": 167, 
            "rating": "5", 
            "review": "Wonderful!. Make sure you know all the background about the Kumari before you go. Be prepared to wait to see her, but I was lucky and saw her within minutes."
        }, 
        {
            "index": 168, 
            "rating": "4", 
            "review": "A goddess to see. If you are lucky, you will catch a glimpse of the goddess. A young girl is chosen to become the goddess. It is not a common thing to see her, but if you time it right, you might get a peak."
        }, 
        {
            "index": 169, 
            "rating": "2", 
            "review": "Sad story. Living godess. Dressed up once a day round 5.30 in evening and show her face at the window. No foto. Read the book about kumari. Choosen at the age of 3. Till she got her menstruation she had to live in what they called palace. Not walking with her feet outside on the ground. No men wants to have her after this , a spoiled princess who cant cook. In Europe we call it childabuse. But everthing for tradition. Its Nepal."
        }, 
        {
            "index": 170, 
            "rating": "4", 
            "review": "Living Goddess.... I found the story of the Living Goddess absolutely fascinating. We did get to see her in the window, but, of course you cannot photograph her, which makes for a thriving post card business! The palace is beautiful and the square was a great place for photographs. I enjoyed it, but be sure to discover the story behind the living goddess, makes it so much more interesting."
        }, 
        {
            "index": 171, 
            "rating": "3", 
            "review": "Extremely perfect. Kathmandu is an unique experience. It looks like very few things changed since lasta century. I higly recommend a trip and a visit to Kathmandu and his surraundings"
        }, 
        {
            "index": 172, 
            "rating": "3", 
            "review": "not seen the godness. In Durbar square, the palace of Kumari can be visited, but few chance to see the \"Kumari\". Many persons sell postcards of the young girl."
        }, 
        {
            "index": 173, 
            "rating": "5", 
            "review": "The living Goddeess. We were lucky to have darshan of the living Goddess. We waited for one hour to have darshan. We were asked to shutdown our cameras and videos including mobile phones."
        }, 
        {
            "index": 174, 
            "rating": "4", 
            "review": "Kathmandu - Kumari Chowk - Interesting story but little chance of seeing the living young goddess. This is located just on the side of Durbar Square and is a very attractive temple built around a central courtyard area and which houses the young living real virgin goddess. The story of selection is really interesting and the building is beautifully laid out, and should you be lucky you will just catch a glimpse of the young goddess as she walks past one of the window openings. However, you really need to be lucky or hang around for a while to see her. Great piece of tradition which is a must visit if just to hear the story."
        }, 
        {
            "index": 175, 
            "rating": "5", 
            "review": "interesting tradition. located in durbar square, the kumari devi has an interesting traditional tale.... if you are lucky you will see her pass in the balcony....."
        }, 
        {
            "index": 176, 
            "rating": "5", 
            "review": "Excellent place. Must visit Lumari Bahal on Kumari chowk to experience the sight of living Goddess. This is a unique experience in itself that Goddess is preached in living form. All in all very impressed with the concept. Do take time to read about how the selection process of Kumari is done. A sight of Kumari will surely leave you highly impressed."
        }, 
        {
            "index": 177, 
            "rating": "5", 
            "review": "Exciting to see her come out. We went to see her come to the window. She indeed looked miserable and uninterested! Bit under whelmed to be honest at the visit. However it was nice to see her out as it was new year. She looked bit happier!"
        }, 
        {
            "index": 178, 
            "rating": "3", 
            "review": "Not much but why not as part of square visit. late Feb-Mar 2013 Kumari Chowk house is located in the area as well. Apparently, a donation of NPR200- and a shout of \"ma-ma\" (if I recall correctly) will be enable an audience with her in the out-of-norm time. The norm time is in the morning and evening hours.The place has lots of birds so beware of droppings and wet ones on the floor."
        }, 
        {
            "index": 179, 
            "rating": "4", 
            "review": "Interesting to actually see the living goddess. Liked the building for photos. Dislike too crowded sometimes. Remember that one is not suppose to see Kumari more than once and should not take her photo."
        }, 
        {
            "index": 180, 
            "rating": "4", 
            "review": "kumari. it is very nice place to visit Kumari for your a day sight seeing, this is historical palace, kumari house, old museum, shiva and bishnu temples, to see the kumari you have to be here before 2 pm, after 2 Pm she doesn't come out because of her study time and pray times, Himal,"
        }, 
        {
            "index": 181, 
            "rating": "5", 
            "review": "We got blessed by the girl god. Interesting building--very oriental with a courtyard. We were there just as the kumari (the living goddess) appeared on the balcony and blessed us. Quite an interesting religious practice where they take a young girl and make her a goddess until she reaches puberty."
        }, 
        {
            "index": 182, 
            "rating": "5", 
            "review": "Poor Girl!. Kumari made her very brief daily visit to the window where she simply looked at the crowd below and then departed. The poor thing leads a very lonely life, not of her own choice, but by the demands of her culture."
        }, 
        {
            "index": 183, 
            "rating": "5", 
            "review": "Pay for the guide. We visited here twice, did NOT get to see the Kumari but the coolness of the inner sanctum was lovely. first time was on our own, second time we had a guide for an hour. think we paid a few hundred - absolutely worth it. Lots of markets nearby but prices should be around 60% of starting price, stand firm, they will sell."
        }, 
        {
            "index": 184, 
            "rating": "4", 
            "review": "Busy market place v.important. Good for purchasing souveniers trinkets bit crowded famous for gurmar tea for diabetics and rudraksha beads"
        }, 
        {
            "index": 185, 
            "rating": "4", 
            "review": "She ignored us!. My group and I spent a long time under Kumari's window hoping to catch a glimpse of her but in vain... Maybe next time..."
        }, 
        {
            "index": 186, 
            "rating": "5", 
            "review": "NIce and Stunning moment wit Kumari. I don't think that I could meet Kumari as I don't know whether she would be busy studying inside or I might arrive the Kumari bahal for the wrong time. However, Kumari appears at 4.30 pm. though it was onlt a couple minutes of her existence. But it is long enough for you to be stunning and spiritually nurtured :)"
        }, 
        {
            "index": 187, 
            "rating": "4", 
            "review": "didn't see her. We stood hoping for a glimpse of the Kumari but unfortunately we were there at the wrong time...no photos are allowed anyway so we bought some postcards. Apparently she only comes to the window at certain times of the day and the only people allowed to visit her are Hindu. It would have been nice to see her though!"
        }, 
        {
            "index": 188, 
            "rating": "4", 
            "review": "Kumari. Make sure to time your visit when the Kumari comes out on her balcony, and if possible, hire a guide. Kumari Goddesses are very much a part of the history of Durbar Square and there is a certain magic about the story, even if it is difficult for westerners to understand how a young child can be locked away and worshipped as a Goddess. An excellent book to read after your visit is 'From Goddess to Mortal'"
        }, 
        {
            "index": 189, 
            "rating": "5", 
            "review": "The Place of the Living Goddess.. We were in awe of this place. The home of a living goddess. We marvelled at the carved woodwork in the courtyard. Well worth visiting."
        }, 
        {
            "index": 190, 
            "rating": "5", 
            "review": "amazing tradition. We didn't get to see the living goddess but were given lots of information regarding her by our guide. I was impressed with the intricate carving on the windows and doorways."
        }, 
        {
            "index": 191, 
            "rating": "5", 
            "review": "The Living Goddess. The little goddess stood in the window of her third floor room. Someone pulled out a camera and she disappeared. Photos of her are a non-no. We stood in a court yard just inside the gate. You should leave some money for the goddess to begin her new life when she completes her term as the Kumari"
        }, 
        {
            "index": 192, 
            "rating": "4", 
            "review": "A living Goddess!. When I first heard that, i was like you have got to be kidding me! But it was true! The travelling part to this destination is a tedious task as the roads are narrow and the traffic is narrow roads would obviously be an annoying sight! We did miss seeing the Goddess but the very thought of a Living Goddess blew my mind away! This is a must see!!"
        }, 
        {
            "index": 193, 
            "rating": "5", 
            "review": "Mind refreshment trip before the commencement of exams.. Exams was 3 months away.. so, I thought to refresh my mind before the start of my studies by going to see the living goddess of Nepal. It was near from my hostel. So, me with my friend went there. It was free to enter. I was Nepalese. In that place, foreign were given more importance than Nepalese. Kumari would appear only when there is significant number of foreign tourists until than we had to wait for a couple of hours. The concerned personnel there said us that we were lucky to see Kumari without waiting for too long period of time. It is believed that wishes comes true when we ask for them when Kumari appears."
        }, 
        {
            "index": 194, 
            "rating": "5", 
            "review": "amazing 1 in the world for Kumari Chowk i use time there for see Kumari. at 16.30 pm at Dubar Square Kathmandu Kumari will show at window for all people wait to see her that so nice time but can't take photo then i just record her in my remember lol and hope i will good luck for all life hehehehe"
        }, 
        {
            "index": 195, 
            "rating": "5", 
            "review": "a must place to visit.. Very close to the Durbar square. The live Goddess does come out to the balcony to bless once a day. Getting to the place is a pain as you need to drive thru the alleys of this dusty city and slums."
        }, 
        {
            "index": 196, 
            "rating": "5", 
            "review": "Beautiful. Hindu's are allowed to go and see the Kumari upstairs.The Kumari is so cute and adorable.Worth the trip to the durbarNo Photography allowed when you are upstairs.Devotee can brings toys for the Kumari."
        }, 
        {
            "index": 197, 
            "rating": "4", 
            "review": "Fascinating story behind this. I just returned from Kathmandu where our group was fortunate to see her. You can't take pictures, as others have noted. It is a fascinating back-story about how this all 'came to be.'"
        }, 
        {
            "index": 198, 
            "rating": "3", 
            "review": "Ok. Interesting, but struggled to separate religious/traditionalism from modern concern if young girl paraded as object. I understand she gets treated well, but didnt appear much like a childhood"
        }, 
        {
            "index": 199, 
            "rating": "4", 
            "review": "If you want to know a living goddess. It is in the middle of Durbar Square, you will not spend much time but it is quite interesting to learn the story of Kumari Living goddess and the process how they select one. Of course you can see her face(not every hour). No pictures allowed."
        }, 
        {
            "index": 200, 
            "rating": "3", 
            "review": "Average experience, nice architecture though!!. Too crowded and no power back-ups. So if the electricity in out in the evening, you're out of luck to see or do anything there."
        }, 
        {
            "index": 201, 
            "rating": "5", 
            "review": "She appeared!. I'd read about the Kumari and didn't really expect to be lucky enough to catch a glimpse, but my morning guide knew a good time to be there. Those of us in her courtyard were thrilled even if no photos were allowed. There were plenty of postcards for sale right on the street nearby."
        }, 
        {
            "index": 202, 
            "rating": "3", 
            "review": "Interesting. We manage to see Goddess Kumari and very interesting history how she was chosen"
        }, 
        {
            "index": 203, 
            "rating": "5", 
            "review": "Worth going in. If your going to Durber Square you have to go and see the Kumari home you might be lucky and see her, she is the living godess. For more information on the history you should refer to a book called \"Street's of Silver\" which has all the walk's you might want to see in Kathmandu."
        }, 
        {
            "index": 204, 
            "rating": "4", 
            "review": "Worth it for the novelty value. You don't get to see a living goddess every day. I've been twice and both times she appeared.\nApart from that, the palace itself is a nice example of the Nepali style with some great carving."
        }, 
        {
            "index": 205, 
            "rating": "5", 
            "review": "Witnessing a living God. The temple is a little hard to find but by asking around or using a guidebook one should stumble upon it easily enough. The entrance is usually flanked by two women selling postcards.Tourists are only allowed into the central courtyard and pictures are not permitted whatsoever, don't even try.We went over in the late evening and sat on the steps reading our guidebook, when suddenly, the Kumari made an appearance on the balcony, looked at us for a few seconds and walked away. The moment was fleeting but one which I would never forget."
        }, 
        {
            "index": 206, 
            "rating": "5", 
            "review": "2 times at year. its posibility to see living God - girl itds smazing, go on this time, its on Dubaru Sqere"
        }, 
        {
            "index": 207, 
            "rating": "5", 
            "review": "Truly Nepalese.... Went to the Kumari Chowk 02.03.2012, Durbar Square nearby was really busy in the afternoon, this place appeared much quieter. Easily missed if u are not familiar with the place or if u dun come with a local guide. There are a few old ladies sitting by the entrance of the building, selling postcards of the Kumari. Mind your head as u enter, as these ladies will warn u - door entrance is really not very high. Our guide called out to her/ her guardians in Nepalese. We were lucky to see the Kumari for quite a few minutes as she appeared by her window and smiled at us. There's a small wooden donation box at the courtyard. Strictly no photos allowed. This was the highlight of our trip!"
        }, 
        {
            "index": 208, 
            "rating": "3", 
            "review": "typical nepali culture. here you can find total different culture of Nepal."
        }, 
        {
            "index": 209, 
            "rating": "4", 
            "review": "An amazing glimpse into a foreign culture. Was amazing to see a piece of nepalese culture that is so unique. BUt it is slightly sad to think of what the poor girl must feel like, cooped up like a show pony.Remember you can not take photos of the Kumari!"
        }, 
        {
            "index": 210, 
            "rating": "5", 
            "review": "If you are lucky and/or pay a hefty donation.... The fascination of seeing a living goddess is the reason to go to this great little temple in the middle of Durbar Square. Don't be dissapointed if she does not show up... From 7-8 visits I only witnessed her presence at the upper window only twice. Sometimes asking the guard nicely, and visibly putting 500 rupees in the donation box will do the trick. But do not take it for granted. Four to 10 year olds, even goddesses, will be quite fickle."
        }, 
        {
            "index": 211, 
            "rating": "5", 
            "review": "Kumari. Nepal is known as different name such as living goddess Kumari."
        }, 
        {
            "index": 212, 
            "rating": "5", 
            "review": "Kumari, Living Goddess. Learn about the Kumari before you go - it will make seeing the Kumari Chowk so much more meaningful! The current Kumari did make an appearance while we were in the courtyard - absolutely awesome to see her!"
        }, 
        {
            "index": 213, 
            "rating": "4", 
            "review": "Wonderful experience meeting the Royal Kumari. Me and my friend were really lucky in seeing the royal kumari come out for like 15 seconds. We were together with a large Chinese tour group and the guide convinced the kumari to come out. They are very strict about photographs so we couldn't get a photo. I read somewhere that seeing the royal kumari brings you luck so hope 2012 is lucky for me!"
        }, 
        {
            "index": 214, 
            "rating": "5", 
            "review": "most unique experience to view a living Goddess. it was a most unique experience to view a living Goddess . we had a glimpse of her as soon as we reached there , so we waited there for another hour but we could not see her for once again ."
        }, 
        {
            "index": 215, 
            "rating": "4", 
            "review": "Good. I've seen the Kumari, poor girl. She just didm't look happy. But I suppose that's just about being a living goddess. The building was quite interesting"
        }, 
        {
            "index": 216, 
            "rating": "5", 
            "review": "The Kumari Bahal or Kumari Ghar -- the Temple of the Living Goddess. I saw the Kumari during Dasain Festival. She appeared at the window for twenty seconds. Please do NOT try to sneak a photograph. They are very strict about this."
        }
    ]
}