{
    "category": "Kathmandu", 
    "entity": "Kopan-Monastery", 
    "avg_rating_stars": 4.591623036649215, 
    "review_count": 382, 
    "rating_stats": {
        "poor": 5, 
        "average": 24, 
        "terrible": 1, 
        "very_good": 89, 
        "excellent": 263
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "Great place to visit ..... Highly recommend you to visit Kopan Monastery while in Kathmandu... try to attend the chanting and prayers... such a relaxing place for meditation, while you enjoy a good 40 minutes walking to reach the place ...\nHighly recommended to visit ..."
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "The best monastery in nepal. It was my first opportunity to visit Buddhist monastery in kathmandu.\nthe place is situated in north part of kathmandu with mountain wiew as will virgin nature."
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "A little bit of Heven. Kopan is well worth a visit. So beautiful and peaceful. On our arrival we were met by a Monk who spoke English and answered all of our many questions."
        }, 
        {
            "index": 4, 
            "rating": "5", 
            "review": "Introduction to Buddhism Retreat - 10 days. Everyone should do this retreat once in their life - the earlier the better. The teachings are very insightful coupled with an introduction to meditation - just brilliant . Accommodation for the price is fantastic and the vegetarian food delish. Highly, highly recommend."
        }, 
        {
            "index": 5, 
            "rating": "5", 
            "review": "Beautiful and Peace. In the top of the mountain, with a such beautiful garden, it's Kopan. The monks are very kind and the main temple amazing. You have a book store too where you can find nice and cheap souveniers. Spend one day therer, meditating it's such a great experience."
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "My second home. Ever since my first 10-day introductory course here, Kopan has been not only my spiritual sanctuary but my warm second home as well. I long for this place as soon as I come back. Spending at least a few days here is so far one of the best things you can do for yourself. It is considered among the most important monasteries of Mahayana-Gelug tradition of Buddhism where resident monks constantly practice and chant mantras all day. If you are looking for a highly-spiritual, calm, tranquil time and learn what Tibetan Buddhism is from great great teachers, Kopan should be your destination. Om Mani Padme Hum!"
        }, 
        {
            "index": 7, 
            "rating": "5", 
            "review": "Beautiful mountaintop view . Beautiful mountaintop temple view. Great experience. No crowds. I recommend visiting this monastery, especially because it's unlike anywhere else I visited around Kathmandu Valley."
        }, 
        {
            "index": 8, 
            "rating": "5", 
            "review": "Not popular, but truly amazing. You can see the Kathmandu from birds-eye view. That's not a very touristic venue, so when you come to the mess, you experience a real buddist serivice, heart-touching and mind-blowing..."
        }, 
        {
            "index": 9, 
            "rating": "5", 
            "review": "Peaceful. Absolutely loved our trip up here. So peaceful and tranquil. The grounds are well manicured and its a great escape from the city. A newer Stupa compared to the rest, but it was beautiful!"
        }, 
        {
            "index": 10, 
            "rating": "5", 
            "review": "new. one of the letest new morden cultural art monestry is kopan and near of tawn also good management we really like it"
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "7 days Retreat in Kopan Monastery. An amazing inner journey discovering Buddhism & improve in a tremendous way meditation practicing with senior teachers"
        }, 
        {
            "index": 12, 
            "rating": "4", 
            "review": "A must visit. I have seen many monasteries, but this one was just unique and nice and so peaceful the atmosphere.."
        }, 
        {
            "index": 13, 
            "rating": "5", 
            "review": "Retreat course. I took a retreat course for meditation and budhism classes, which tourned out to be really good for having more of the local experience."
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "So peaceful, colorful and huge. Nice site to visit on a day tour. And highly recommended if you love Buddhist way of living, cultures and architectures."
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "One of the best place for retreat classes. Highly recommended place if you would like to learn about buddhism, meditation retreat classes run by the monks to have an understanding about the foundation of buddhism. It is located in a high location commanding a sweeping views of the kathmandu and international airport. The food in the vegetarian restaurant is a tasty choice for the travellers."
        }, 
        {
            "index": 16, 
            "rating": "5", 
            "review": "Located on top of the highest mountain with views over Kathmundu. I took a taxi to Copen, through some very rough roads lined with shops and stalls to the very steep top of the mountain where the monastery holds a beautiful position. Behind is an amazing garden with fountains, statues and many beautiful trees and plants overlooking Kathmundu far below."
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "Nice quiet place to escape the chaotic city. This temple is only a few km out of the city, but feels like the country side. Very quiet place for meditation, reading, hanging out... They offer 3 day intro to Buddhism courses and 10 day retreats. Visitors are welcome to admire the gardens, check out the temple, etc. There is a small cafeteria and an excellent bookstore. A cab from Thamel is approx 500Rs."
        }, 
        {
            "index": 18, 
            "rating": "4", 
            "review": "Peaceful. Visited the monastery in the afternoon. As we had not reserved any teachings, the guard was little unfriendly! Inside was peaceful. Beautiful compound. The lunch was good."
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "Perfection!!. Loved this place, beautiful in so many ways!! Well worth a visit! A bit difficult to find but worth all the effort, most likely will come back to this amazing place!"
        }, 
        {
            "index": 20, 
            "rating": "4", 
            "review": "Great Monastery. Kopan offers lots of courses residential courses in Buddhism - we visited just to spend time in the grounds and met up with some friends. Amazing views of the city too."
        }, 
        {
            "index": 21, 
            "rating": "5", 
            "review": "Oasis with beautiful view . Kopan monastery is beautiful place on the hill with amazing view on the city! Inside is beautiful decorated park, perfect for take a little rest. There is also a library and a small shop.\nThere are many Budists around and the place is very peaceful :)\n#there is NO entrance FEE, however take care Of the working hours."
        }, 
        {
            "index": 22, 
            "rating": "5", 
            "review": "Great. Kopan monastry is realy great manastry in kathmandu realy historically nice and central of tawns inside good invirment and secure must visit"
        }, 
        {
            "index": 23, 
            "rating": "5", 
            "review": "A must visit in Kathmandu. A place away from all the city hassle. Peaceful. Beautifully maintained. The monks are helpful and they encourage visitors. You feel like sitting there for sometime and relax. The view in and from the monastery is stunning.\nIf you are in Kathmandu, you must never miss this place."
        }, 
        {
            "index": 24, 
            "rating": "5", 
            "review": "Blissful place for an amazing experience. I just completed the introduction to Buddhism, 7 day course at Kopan. First of all, Kopan is an absolutely blissful place! It's gorgeous and very peaceful. The course was a great experience. Both teachers (Jimmy and David) showed displayed knowledge, patience and were very helpful in answering all of our questions. It's a once in a lifetime experience that I would recommend to anyone who wants to learn about Buddhism, reflect on their own life and spend time in a very special place. Recommendation!"
        }, 
        {
            "index": 25, 
            "rating": "3", 
            "review": "Beautiful Monastery. Nice place and nice gardens although I found some of the monks quite immature and aggressive with dogmatic views... A beautiful view though..."
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "Kapan Monastery. Great place for mind refreshing. Meditation and nature loving place. We loved it when we went to see lots of Gumbas. After our 3 hours trip we find the Kapan Sekuwa Restaurant and had BBQ and MO MO. Great day out."
        }, 
        {
            "index": 27, 
            "rating": "5", 
            "review": "Buddhist Site. Kapan Monastery is located at north-east part of Kathmandu Valley. the monastery is beautiful with greenery garden."
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "Wonderful to visit. I did a ten day Beginners Buddhism course here and I really enjoyed.I loved the views, the gardens and listening to the beautiful chantings of the monks.The course itself was well planned and quite intense. I really enjoyed learning to meditate and being at the monastry was peaceful and tranquil. I also loved watching the little monks...the kids were so cute and are loved and cherished by the older monks.The food was tasty and helping with the dishes now and again was a small price to pay. Also the shop with books, bags and the necklaces were also very reasonably priced."
        }, 
        {
            "index": 29, 
            "rating": "4", 
            "review": "Very beautiful Monastery at the top of the hill. Very nice and secluded monastery, it is located at the top of a hill so it has great views of the city, the monastery is very well maintained and very beautiful, worth a visit"
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "a great Buddhist athmosphere. Several times I did a 10 day Intro-course Buddhism at Kopan. It's like a magical place. If you stay there for a few days, you feel like it's your home! The monks are very friendly. From the Kopan hill, there is a beautiful view over Kathmandu :-)"
        }, 
        {
            "index": 31, 
            "rating": "4", 
            "review": "Monastery. one of the monastery that is not over crowded its like quite inside of the main kathmandu. like i mean in the street area. Good people around and its good to visit right here. Quite easy to reach here by walk or even if you want you can take public transport from anywhere around."
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "Beautiful Monastry on the top of the hill.. A wlking distance from Boudhanath Stupa, Kopan has great Monastic area with clean and hygienic restaurant, great library and beautiful garden to rejoice."
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "\"Don't cut yourself short\". Give yourself plenty of time when you come to the Kopan Monestary for a visit. This is a visit you can also easily do on your own, you do not need a guide unless you really want one. There is no admission fee, a taxi from the Thamel will probably run you about 500 Rupees each way. This is a fairly new Monestary, so it's not like you need a guide to explain all the history here, it is more of a working Monestary and School. Bring a picnic and eat out in the beautiful gardens. Or better yet, schedule to take one of their classes, that will be my net trip here, definitely worth multiple visits. This place is pretty magical, inspirational, friendly and very scenic. Not just the beauty of the monastery , but the grounds are kept immaculate, beyond anywhere else I have visited, especially in Nepal. They have a restaurant (vegetarian) here, that is very clean and has gorgeous views of the entire Kathmandu valley. Service and food are average, but this obviously helps support the monastery. You can take silent meditation classes here, for a week or ten days if you are strong enough. I believe they also teach basic Dharma classes as-well. This is also a destination for visiting monks from other countries. IN the past they did not allow photographs within the main Monestary, that has changed, and you may now take photos at least when the hall is not in use. My suggestion would be a donation of about 20-50 Rupees per picture, you can just leave it at the base of the Dali Lama's picture. There is a gift shop and bookstore with very reasonable prices, and a very extensive selection of books, mostly in English. Also a Receptionist who can walk you through the various options if you wish to stay here. When you visit, get here in the morning, there is a security guard, and he will have you sign in, and give you a guest pass, there is no charge for visiting. However everything, possibly even the front gate closes between 11:30 and 1:00 or 1:30, so plan that time for your lunch break and wait for the monastery to re-open in the afternoon for further exploration. A truly wonderful place to visit, top 5 probably in the Kathmandu valley, at least for me."
        }, 
        {
            "index": 34, 
            "rating": "5", 
            "review": "Peaceful and Scenic Location Away from the Chaos. I took a taxi to the Kopan Monastery on a whim. I hadn't seen as much about it as other sights in Kathmandu but decided to visit. It's a bit of a trek to get there with some winding roads full of potholes but well worth it. The monastery grounds are beautiful and well manicured and the view overlooking the city is quite stunning. I would definitely recommend a visit."
        }, 
        {
            "index": 35, 
            "rating": "5", 
            "review": "My Fav Place in Kathmandu. This place is hard to get to and proportion of it is off road down back streets and alleys. Local taxi from Thamel should cost no more than 500 R and a lot of it is also up hill.This place undoubtedly has a sense of calm and serenity away from the city. Monks are all friendly and approachable and the garden and it's sculptures are just amazing. I spent an hour in the grounds just relaxing on the grass while there."
        }, 
        {
            "index": 36, 
            "rating": "5", 
            "review": "Peaceful. One of the greatest place we've been. Great and loving people inside.. So quite and peaceful. Go for it, but be respectful with the monks"
        }, 
        {
            "index": 37, 
            "rating": "5", 
            "review": "Stroll Up to Kopan Monastery. A wonderful introductory trek to marvel the rich cultural and religious heritage of Kathmandu. Don't miss the library at the Kopan Monastery !"
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "Peaceful and Beautiful Place. If one is searching for peace of mind, then this is the place to go. I recommend to go there and spend some time."
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "no words to express ... This place has soo much to offer you.. very peaceful, clam.... Best place to understand and study about Tibetian Buddhism .. nice time pass"
        }, 
        {
            "index": 40, 
            "rating": "4", 
            "review": "Beautiful Monastery with a Great View of Kathmandu!. Many lovely features to the monastery--the 360 view of Kathmandu being one of them, plus beautiful stupas, statues, and prayer wheels. Fun to see the younger students. Gift shop is great as well and inexpensive. Coffee shop is a good place to end the visit."
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "Top place in Kathmandu. Of all the places I visited in Kathmandu , this was my favorite, it starts with a taxi ride up a hill, avoiding all the hazards, and then dropped outside a gate, now what to do , walked down the road to a larger monastery , but no entry, came back to the large brown gates, cautiously pulled back the lock and wondered in, the building are lovely as are the shrines, no one talks or hassles you ,and no tourists about, great views, very peaceful and relaxing . It Is a great place, a bit of a hassle to get to, but the advantage of this is less tourist ( like myself) , when you leave, with the gate to the back of you, take the little path to your right down the hill, a lovely walk, get you back to the main roads to get a taxi"
        }, 
        {
            "index": 42, 
            "rating": "5", 
            "review": "Best intro to Bhuddist culture and understanding . I helped coordinate a group tour with Fran at Kopan. Kopan was a little off the beaten path, but well worth the time. The temple grounds are beautiful and offer equally impressive views of Kathmandu. In the morning a the monks debate. It is quite a lively time to be there. Mid morning there is a daily Dharma talk. Ours was given by Monk Tingyal. It was poignant and thought provoking. The group of students enjoyed the talk the most. They have a lovely book store on the premises. They sell a variety of books, CDs, DVDs, pashminas, singing bowls, and various Buddhist materials (prayer flags, door hangings, prayer beads, etc.) The prices are much more reasonable than anywhere else in Kathmandu. They have a lovely area to enjoy lunch. The menu was much more extensive than just dhal bhaat (which surprised me).Truly a wonderful way to spend your morning. I highly recommend starting your day here and going to Bouddha afterwards."
        }, 
        {
            "index": 43, 
            "rating": "4", 
            "review": "Grand. Amazing big and nice!Many people!Buddist monks! Amazing how buddist pray and bring food to offer! Bananas, Apples etcYou feel the difference to EuropeDo not miss it"
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "10 day introductory course. I loved Kopan from the moment I entered. The environment is so calm, happy and peacefull. A friend and I were there for almost two weeks and I was sad to leave. The Monks were kind, our wonderful teachers who spent hours trying to answer our endless questions were amazing, and even the staff working there were terrific. The course was intense but I learnt a lot, wish I was there to be able to practice better. I think one forgets very quickly once away from the monastery.I must mention taxi driver Ganesh who hangs just outside the monastery. His telephone number is+9779803558800. He was reliable, very patient and spent a few days driving us around .Pic includes.By the way anyone shopping for prayer wheels etc, found good stuff and prices at Swayambhunath Temple, including pic of shop."
        }, 
        {
            "index": 45, 
            "rating": "5", 
            "review": "\"Very peaceful &away from crowd \". This place is far away from the city noises and atmosphere. It is at a good height thus allowing you to see a good view of kathmandu too. The monks are friendly, I even managed to make friends with them. Really good place. I myself being a tourist, was really keen on exploring the importance of Buddhist values. Well after that visit I'm more than satisfied."
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "10 day course was very good!. Stayed here for the 10 day course and it was great. Beautiful place and amazing people. The teachings are good and the set up as well. Food is the same everyday, so be prepared for that. I would highly recommend this place!"
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "Stay within a Buddhist monastery. 3 nights in this peaceful environment was soul enriching. The elevated setting above Kathmandu offered good city and mountain views, especially at sunrise and sunset. The gardens are beautiful and the food and accommodation good. I felt welcomed by the monks and was honoured to share their space for a short visit. Visitors are encouraged to experience daily meditation and talks. There is an excellent shop so bring some money to buy quality Buddhist items, including books and DVD's."
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "Outstanding way to spend a week. From the moment you enter the feeling of peacefulness and serenity pervades. The accommodation is comfortable but basic and the food, whilst taking a bit for western tastebuds to acclimatise, is a sensory delight. There is much to be learnt here and if you immerse yourself in the lessons and mediations I guarantee you will emerge better for it. Again, simply outstanding"
        }, 
        {
            "index": 49, 
            "rating": "5", 
            "review": "An Amazing Buddhist Monastery!. I fell in love with this Monastery. IT is so peaceful, enchanting, and spectacular. The Monks are welcoming and answer all your questions. It was beyond my expectations !"
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "Peaceful and without turists. I've walked from Boudha and while taking pictures and not rushing it took me an hour. Walk itself isn't much pleasant due to dirty roads but you can easily spot a day to day life of local people. Monastery itself is very nice, especially the part of Thousand Buddha stupa. I've met only 3 foreigners during my visit but a lot of monks and student monks."
        }, 
        {
            "index": 51, 
            "rating": "2", 
            "review": "Underwhelming, not a priority. This is a monastery whose business it is to host people coming for retreats, as well as the local monks. The architecture really isn't that spectacular and you'll get better views elsewhere, especially when there's smog. If you're really into the religion/culture, it's fun to see the monks debating, but really, it's pretty far away and underwhelming after seeing Patan and Bhaktapur."
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "Hindu Heaven. A very full place with several rotating prayer columns. Turn them clockwise for your prayers to come true! Festively decorated monks, and a lot of different sites."
        }, 
        {
            "index": 53, 
            "rating": "4", 
            "review": "Nice location and view. The monastery is a bit outside of the city center but worth the trip. Unfortunately we were not allowed inside but the view of Kathmandu from the garden was nice and away from pollution. We saw lot of monks on lunch break and they were nice and friendly and chatted with some visitors."
        }, 
        {
            "index": 54, 
            "rating": "5", 
            "review": "Amazing Monastery Life. I stayed 5 nights there. You can forget everything about your daily life in your country. You can meet not only monks who practice dharma but also people from all over the world. Day by day, you will find your own meaning of your life. "
        }, 
        {
            "index": 55, 
            "rating": "5", 
            "review": "Kopan worth a visit when in Kathmandu. Many people wonder whether favourite places such as Kopan Monastery will look the same as before the quakes therefore it was a wonderful to visit Kopan on the weekend and find it looked as splendid as ever with very little damage to see. The main temple looks magnificent and most of the accommodation and other buildings are fine. The gardens and the stupa area look glorious in the spring. Kopan is set high on the hills behind Boudha and you can walk there, take a taxi or local bus. Kopan is a Gelug monastery and runs meditation and Buddhist courses and these have now started again. From Kopan there is a great half hour walk on a well made trail along the ridge to Pullahari Monastery with panoramic views of Kathmandu Valley. A visit to Kopan with the walk to Pullahari takes about 3 hours."
        }, 
        {
            "index": 56, 
            "rating": "4", 
            "review": "Peaceful Retreat. Despite only having a day at Kopan Monastery, I found it to be a peaceful and restorative place to visit. It is situated above Kathmandu and away from the hustle and bustle of the traffic in town. The views are superb and the gardens beautifully laid out. We enjoyed a meal at the cafe before wandering through the gardens and extensive grounds. The library and bookshop were very interesting and we saw many study groups in action around the monastery. I would like to spend more time at Kopan and find out more about what they have to offer. My overwhelming impression was of a welcoming and accepting community where you can find space for reflection and solitude."
        }, 
        {
            "index": 57, 
            "rating": "5", 
            "review": "Must visit . Took a bus from the Old City station near Thamel to Kopan. It will be a pricey taxi ride. Bus ride was about 45 minutes. It drops you off in the village and I was fortunate enough to have a local walk with me to show me the direction to the monastery. Otherwise look up what it looks like beforehand as you can see it on the hills and can also figure your way out that way also. It is quite the steep uphill walk took me probably another 45 minutes from drop off to monastery. You can also catch a cab if you don't want to walk. Do not wear shorts as I saw a girl get rejected at the entrance even though they were to her knees. This place is absolutely a lovely retreat perched atop the city. Lovely views. You cannot enter the actual monastery however. There is a cafe and a library there that has odd hours so it may be closed. A very interesting stupa with tons of relics also. Enjoy the temple grounds here. If you are feeling adventurous like I was I am not sure of the name but there is a huge red temple atop a hill in very clear view from here. You can walk there in 30 minutes on a lovely scenic dirt path. Ask locals the direction of \"Pulahari\" and you will come to a clear blue and red archway that says welcome. Then a steep uphill to get there but I found the monastery itself more impressive than Kopan it was stunning. Another 30 minutes from here is Pulahari a third monastery not as impressive as the other two in my opinion however. A monk informed me these temples used to be open for people to enter but the insides are so damaged now and are being reconstructed. All these temples had lovely views and scenic paths full of prayer flags to each destination."
        }, 
        {
            "index": 58, 
            "rating": "1", 
            "review": "Meditators Trap. The 5 day course of \"how to meditate\" was very misleading and perhaps should have been called Budhism advanced. We were bombarded with very detailed theories and beliefs of the religion and later we were informed that they only talk about the breathing because we think meditation is about breathing. This would have been good if it had a different name that didn't mention meditation."
        }, 
        {
            "index": 59, 
            "rating": "5", 
            "review": "An oasis in busy and dusty Kathmandu. Quiet! Peaceful! Relaxing! A great place to escape from busy Kathmandu and get a glimpse of what monastic life is. If you are interested in Tibetan Buddhism and around in November, don't miss the month-long residential course held there. It is a life-changing experience!Namaste_/\\_"
        }, 
        {
            "index": 60, 
            "rating": "5", 
            "review": "The Introduction to Buddhism course. I spent 12 days here in January 2015. I did the Introduction to Buddhism course there and it was one of the best things I've ever done. Many teachings and group meditations in beautiful surroundings. Joan, (a nun originally from Canada) the course leader was excellent and patient with us.The concepts and ideas we discussed and learned about have stuck with me since then and I continue to pursue the practice."
        }, 
        {
            "index": 61, 
            "rating": "4", 
            "review": "Best place for peace of mind !. Our driver recommended us to visit Kopan Monastery while we were visiting Pashupati Nath Temple and Buddhist Stupa. This was a really nice place , I wish I had time for meditation ....."
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "Peak into the Monastic Life. Kopan Monastery is a wonderful place to visit for anyone interested in Tibetan Buddhism. You can either enjoy the exercise of walking up the hill to Kopan or catch a taxi. Once you're inside the gates at Kopan it is a treat to explore the beautiful grounds, enjoy a bit to eat at the cafe and take in the many gifts available at the book store. (This may be one of the best spots to buy books on Buddhism in Kathmandu.) If you're lucky there will be a puja happening and you can peak into the prayer hall and listen to the enchanting puja."
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "Relaxed place. I stayed there for one week, you can check in there website about retreat, if they won't have it, you can stayed there. It is a relaxed area"
        }, 
        {
            "index": 64, 
            "rating": "4", 
            "review": "A serene gem. The travel up to see this place was as interesting as the place itself as no real road signs- However stunning views over Kathmandu, serenity and beautiful gardens all make this place somewhere worthwhile to visit. The gardens are immaculate - It is also a large Buddhist retreat, hence the peace and quiet which was refreshing coming from the hustle and bustle of Kathmandu. -sadly the book shop closes at lunch time."
        }, 
        {
            "index": 65, 
            "rating": "5", 
            "review": "Brilliant cultural experience. This place is somewhat away from the city noises and atmosphere. It is at a good height thus allowing you to see a good view of KTM too. The monks are friendly, I even managed to add a few on Facebook. Really good place. I myself being Nepali, was really keen on exploring the importance of Buddhist values. Well after that visit I'm more than satisfied."
        }, 
        {
            "index": 66, 
            "rating": "5", 
            "review": "color full monastery. this place is so power full and so color full ..you can doing meditation.. you are in and other place when you stay there.. a small paradise."
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "Peaceful. A very peaceful and relaxing atmosphere to hang out away from the busy capital noise and pollution. A must visit"
        }, 
        {
            "index": 68, 
            "rating": "5", 
            "review": "C h i l l O u t. If you can't feel the vibe here then you must be made of stone.I walked here through lots of very suburban residential areas coming from Budhanilkantha, the pathway leading slowly up the hills, increasing the stunning view of the Katmandu Valley as you rise up and up. Once you arrive at the monastery don't be shy, knock on the door and the security will let you in. Once in relax, walk slowly, take it in, sit down and rest, eat some lunch in the restaurant/cafe. I had Nepali Thali and it was 5 star, the curd was perfect, i mean PERFECT!Check it out."
        }, 
        {
            "index": 69, 
            "rating": "3", 
            "review": "A morning of peace... This is a lovely spot to gather your thoughts and take a time-out from the noise and congestion of the city. Lovely views of the valley as well. The small cafe serves delicious foods too!"
        }, 
        {
            "index": 70, 
            "rating": "5", 
            "review": "A MUST SEE. A great peaceful place with a fantastic bookshop but check the website for opening dates as the monastery closes when private teachings/courses are running."
        }, 
        {
            "index": 71, 
            "rating": "5", 
            "review": "Peaceful. Great place to visit for peace of mind & also wonderful view of Boudhanath & other areas. You can also see hills/mountains on the other side. You can go there for meditation, learning about buddhism or just to relax & have food in their cafe."
        }, 
        {
            "index": 72, 
            "rating": "4", 
            "review": "Perfectly peaceful. I visited Kopan Monastery on a whim, on the recommendation of a fellow traveller who I met while out wandering around Pashupatinath. I caught a taxi out to look around, and was totally drawn in to the beauty and peacefulness of this place. A great place to go to sit and relax, far from the hustle of Thamel!"
        }, 
        {
            "index": 73, 
            "rating": "5", 
            "review": "I feel like family here.... I didn't just visit Kopan I stayed in their guest rooms. I have made fellow traveler friends for a lifetime; but also monk friends who I consider family. They have awesome grounds and facilities. Their library and book shop is outstanding. The cafe for snacks is hands down awesome and inexpensive! I fell in love with honey ginger lemon tea here. I left and came back because even at nice hotel in Kathmandu I wondered why am I not at Kopan? I left again for a short trip to Lumbini and injured myself and had to come back same day - they provided me room and help and care until I recovered. All of this and daily dharma talks and mediation? You can't go wrong."
        }, 
        {
            "index": 74, 
            "rating": "5", 
            "review": "A Stunning Garden. Peaceful and beautiful. Not grand, but worth the trip up the Lazimpat Road. Occasionally the Monastery is closed if there is a retreat. There are many fine and exceptional places to visit in Kathmandu. If want to visit somewhere out the centre and away from the tourist haunts (stunning as they are), make your way here. Maybe take a picnic, sit on the grass, enjoy the detail of the temples and the many tiny figures representing the life of Buddha. You will need transport. To the left of the entrance to the monastery is a row of shops, keep them on your left, go to the right of a set of tall metal doors and take a walk along the path. Further along you get good views of Kathmandu."
        }, 
        {
            "index": 75, 
            "rating": "3", 
            "review": "gud place to meditate. kopan monastery is nice place to meditate, mini buses available from thamel & durbar marg & nearby places for rs.20, usually overcrowded. nevertheless you'll get some place to travel & people usually guide you if u ask. not many people knw english, so asking some college folks or in some restaurants/shops might help you. bus drops u near to kopan, so u'll have to walk & trek a little by asking people.(excuse gps). once u get to monastery you have library cum shoppe of souvenirs & a canteen cum general store for some purchases. rest you can explore."
        }, 
        {
            "index": 76, 
            "rating": "5", 
            "review": "for those who want to learn about Budism. Nice courses about Buddhist meditation, with great teachers and awesome food! Nice view from the city, mainly Boudha Stupa."
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "Amazing. The temple is peaceful, has an amazing view, awesome Buddhas sculptures. Before entering, there are a number of words of wisdoms, which are extremely useful to apply to our daily life."
        }, 
        {
            "index": 78, 
            "rating": "3", 
            "review": "nepal. the monastery is nice but seeing the students painting was inpressive,they are resonablye prices and will bargain,cheaper than in town there,try a cart ride around the town,tell them 15 max,theyll give u a great tour"
        }, 
        {
            "index": 79, 
            "rating": "5", 
            "review": "Beautiful . A great day out from the busy streets of kathmandu, amd it's an adventure getting there. set high on a hill with good views weather permitting, an excellent library, and grounds. there was some restoration going on due to the earthquake which was interesting to watch, and even with the fuel crisis, the cafe made Momo's. Well worth the visit. Make sure you check visiting times"
        }, 
        {
            "index": 80, 
            "rating": "4", 
            "review": "The view from this place is amazing!. When hanging out in Nepal a lot you tend to miss the nature and somewhere to be without the constant noise of traffic. Kopan is a wonderful place to go either for just a day or for a retreat. The atmosphere there is relaxing and it is simply beautiful there. Retreats are a bit pricy though, but heir door is always open even just for a one-day visit."
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "If you visited Namo Buddha - skip this. The monastery it big but the part that is accessible to public is small. If you have time, do go to this. But if you have to choose only one monastery in Nepal, I would recommend you visit Namo Buddha.\nThe monastery by itself, without comparison with others, is very nice."
        }, 
        {
            "index": 82, 
            "rating": "5", 
            "review": "wonderful place. this is a place where of buddist where they will worship god budhha which was is beatiful place and i had visited this place by @Rosha Trek & Expedition P. Ltd."
        }, 
        {
            "index": 83, 
            "rating": "5", 
            "review": "5star. I love being there it is so peaceful and great experience visiting here\nOne must visit here if he really want to explore the peace"
        }, 
        {
            "index": 84, 
            "rating": "4", 
            "review": "Place of peace in busy city. Not far from boudha stupa Kopan monastry is worth a visit both for the views over the city and for the lovely quiet temple and gardens. The cafe is also really nice. Just lower down the road there is also a nunnery- the temple was closed when I visited as the nuns where having lunch outside though they didn't mind me wandering in and offered me lunch. It's a shame it's not as well maintained as the male monastry."
        }, 
        {
            "index": 85, 
            "rating": "5", 
            "review": "Peaceful place. We made it up the hill to give donation for the earthquake victims. Whilst there we took in the sights. There is a bodhi tree and 2 stupas to circumambulate - just beautiful."
        }, 
        {
            "index": 86, 
            "rating": "4", 
            "review": "A lovely place to spend some time. Kopan is a large Buddhist monastery a half hour or so walk north of the Boudhanath stupa in the hills above Katmandu. I took a taxi through some increasingly pleasant towns in the Katmandu valley. The enclave is typically difficult to get into although I didn't know that when I appeared at the entrance and got a lukewarm \"Oh go ahead\" from the guard. I strolled around inside, keeping clear of an area where signs said a retreat was going on and wound up at the highest point in the monastery grounds where there is a wonderfully sculptured park with peaceful sitting areas all around. After capturing some of the beauty with my camera I sat down on a bench and meditated. Someone sat down near me and then more came and I realized I was in the middle of a discussion group from the retreat. They were all glowing and we chatted for a little while before I got out of their way. A lovely place to spend some time and retreat from the chaos of Katmandu even if you don't go on their meditation retreat."
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "Worth the trek. If you have the opportunity to trek up the mountain and visit Kopan Monastery, you should! First the views are impressive. On a clear day, you can see all of Kathmandu below and it is just beautiful. My favorite part was joining the free meditation class they offer in the morning. I was one of the most memorable parts of my trip.From here, I walked down to the Boudhanath Stoupa. It was a 35-40 minute walk. Do not try it on a rainy day, unless you have really good rain boots. Regardless, it was a wonderful experience!"
        }, 
        {
            "index": 88, 
            "rating": "3", 
            "review": "Nice place, cafe and shop but main monastry is closed at the moment . I enjoyed the 7.6km walk from thamel, however it was not clearly notified when I emailed the monastry, that during courses, day vistors can not enter the monastry and the grounds on that level at all, which does limit significantly what you can experience there.Needless to say it was a pleasant time visiting the cafe, library and shop but be warned if you expect more! Courses finish on the 14th December I was told so better to go after."
        }, 
        {
            "index": 89, 
            "rating": "5", 
            "review": "Good place. The monastery lies at the top of hillside, norther of Kathmandu valley. The architecture of the monastery is so great.Can see mountain and valley view from the same place. This place is a good place to relax and meditate"
        }, 
        {
            "index": 90, 
            "rating": "4", 
            "review": "A Nice Hike out of the City.. We hiked here from Boudhanath Stupa in about an hour. The best way to get here, by foot, is to just follow the street that seems to be going in the right direction. The Kopan can be seen on the hilltop from almost anyplace in this side of Kathmandu, so it would be hard to get lost. Occasionally there is a small sign tacked to a pole that states 'Kopan Monastery', with an arrow. But these are few and far between. Once you get close to the structure, there is a little path that winds its way up the hillside to the top of the hill. There are some grand gates here that, for us, were barring entrance - as there was either some very important ceremony going on, or the construction near the gate to repair the earthquake damage was too concerning to allow tourists inside.However, there is a another gate just 30 seconds back down the road, directly behind you as you face the main archway. It is large, and has no signage. You just knock on the door. A guard opens up a small sub door, makes sure you are not wearing any leather and that the girls have their shoulders covered - we you're in.The monastery is wonderful, the grounds are spectacular, and the views of the city are well worth the hike. There is also a little store and cafe next to a small patio that overlooks Kathmandu. It was all very magical, as the clouds boiled up and gave us a wonderfully dramatic sky for our visit. The interior of the monastery is so complex, colorful, and ornate - perfectly Buddhist."
        }, 
        {
            "index": 91, 
            "rating": "5", 
            "review": "beautiful blissful place. a bit far from everywhere, definitely a day trip and just spend time soaking in, being away from polluted thamel and city center."
        }, 
        {
            "index": 92, 
            "rating": "5", 
            "review": "Beautiful Spiritual Place. Well worth the long winding road up to this gorgeous place. We were welcomed and invited to sit and listen to the chanting which was indescribably wonderful and moving. The beauty of the art and the architecture along with the sight of hundreds of maroon clad monks of all ages is something I will long remember even though no photos were allowed inside."
        }, 
        {
            "index": 93, 
            "rating": "4", 
            "review": "incredible experience. They teach you how to live your life ! It s not a theological religion, they just believe in afterlife.They reprogram your brain to eliminate all the negatives taughts It's an experience of a lifetime !"
        }, 
        {
            "index": 94, 
            "rating": "5", 
            "review": "Exquisite detail in the temple. We fronted up to the locked gate of the Khachoe Chakyil Ling Nunnery (known as the Kopan Nunnery) ready to explore only to discover that it was closed for a special religious ceremony. Rajesh was particularly disappointed, as he knew we would love what was behind the gate, but instead we strolled along the narrow hillside path to the Kopan Monastery further up the hill where the new gompa (temple) rises as an impressive beacon to devotees and visitors alike. This is a very new building, completed in the 1990s, and as such is in pristine condition – the cleanest and most magnificent we have seen. A boy monk of about 10 years of age showed us around the facilities, impressive in his knowledge of his faith and the monastery, as well as his maturity and serenity. He patiently waited while we explored, provided explanation when we paused, and cheerfully farewelled us when we headed off. He’s got it all sorted that one."
        }, 
        {
            "index": 95, 
            "rating": "5", 
            "review": "Lovely stroll up to Kopan. Of course, one can hire a taxi but a walk through the busy city makes this visit even more special; a realm radiating peace."
        }, 
        {
            "index": 96, 
            "rating": "5", 
            "review": "Spiritual Bliss !!!. Visitors are allowed only on Saturdays and it will be crowded, one of the most beautiful place to visit and take some photos and videos to cherish for entire lifetime ,10days in house meditation camp is conducted here.When we sit in silence after doing all the formalities we will be absolutely peaceful and feeling relaxed.Thanks a lot for everything,Loving you so much,Peacefully yours,S M Bega Raaj.Happy travelling..."
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "10 day course!. Had a great experience here for a 10 day course. Great teachers, beautiful setting, affordable and clean accommodations. The food is good, though not amazing.Great opportunity to learn and relax."
        }, 
        {
            "index": 98, 
            "rating": "5", 
            "review": "peace of mind. located on the hill top with the great view of valley including bouddhanath stupa and Himalayan range. participated in puja ceremony , i got refreshed. will come back again"
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "If you are a Buddhist, it is a MUST see. The Kopan monastery is famous for its Buddhist studies mostly for foreigners. Also the monastery itself is worth to see. Situated on a hill overlooking Kathmandu. It is a little difficult to go there... long taxi drive."
        }, 
        {
            "index": 100, 
            "rating": "4", 
            "review": "Wonderful monastery with beautiful garden and views. Kopan monastery is a very beautiful and peaceful place to visit. The temple is stunning. And, the views of the surrounding village are expansive. To the right of the temple is a large garden which contains two ornate stupas and a seating area. There is also a display of small statues which illustate key moments in the life of the Buddha nestled in plantings at the entrance to the garden."
        }, 
        {
            "index": 101, 
            "rating": "4", 
            "review": "Kopan Monastery in Kathmandu. A good location for self cultivation on Tibetan Buddhism. Road access are repairing, hopefully to be better and completed soon."
        }, 
        {
            "index": 102, 
            "rating": "5", 
            "review": "Wonderful visit to Kopan Monastery. Big Walk from the hotel where we stayed and once reaching the place, it is just like getting the satisfaction of climbing Stone Mountain in Atlanta. Kopan Monastery is nicely maintained and beautiful pictures to be taken."
        }, 
        {
            "index": 103, 
            "rating": "5", 
            "review": "serene and beautiful. We stayed here 4 nights. Beautiful scenery and nice monks. Food is very simple. It was great to experience a monastery, and learn about meditation. Rooms were clean and good sized."
        }, 
        {
            "index": 104, 
            "rating": "4", 
            "review": "Very nice to see. very unique and should see, its different what u see in yr country, clean and nice whether, bring along yr drinking bottle"
        }, 
        {
            "index": 105, 
            "rating": "4", 
            "review": "good hike. makes for a good hike on a weekend. Though now, roads up to the monastery has been made. The monastery itself is very beautiful and spacious. Also, provides a good view of the surrounding."
        }, 
        {
            "index": 106, 
            "rating": "4", 
            "review": "Loved to visit. Since of thangka lover.... i love every buddhist monastery.. Kopan is one of my best monastery in Nepal"
        }, 
        {
            "index": 107, 
            "rating": "5", 
            "review": "A blissful place. A blissful place . Amazing view of Kathmandu City , Himalayas and surrounding hills . Want to meditate ? Want to learn about Buddhism ? This is the place !"
        }, 
        {
            "index": 108, 
            "rating": "5", 
            "review": "Place of Peace and Spiritual Enhancement. A great place for de-stressing by meditation, attending prayers, listening to the Buddhist monks at prayers. We organized a special Buddhist Marriage for our friends from Ireland and Philippines several years back and it was awesome. The experience is just awesome."
        }, 
        {
            "index": 109, 
            "rating": "5", 
            "review": "Educational relaxation. I visited back in January for the '10 day Beginners' Course,' and it is one of the reasons that I have saved up to head back to Asia. The experience that you experience there never leaves you. With an introduction to Buddhist philosophy and mediation, a library and cafe, gorgeous views, interesting lectures, lovely nuns and monks in conjunction with great company will have one ready to return for the another (longer) course. You don't walk out of those gates the same person. Until the next time, Kopan!"
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "best relaxation ever. wonderful private stay at kopan in late august. simple rooms and food. excellent views, quiet, and interesting people."
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "Great place!. A great sight to see! Highly recomend. The people of Nepal are super friendly and this place is no exception!"
        }, 
        {
            "index": 112, 
            "rating": "5", 
            "review": "Very good for retreat, friendly to non-buddhist balance seekers. I would love to stay here for retreat - it's very friendly to foreigners, the monastery has stunning view over Kathmandu. Come and live here for a while..."
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "Magical place!. What an incredible place to visit! Peaceful, quiet and sums up a huge amount of the Buddhist culture you come across. Although only 15% of the Nepali population are Buddhist, there is an overwhelming Buddhist theme wherever you go. This place explains more then anywhere else! I hear you can stay here. It is apparently a great experience. Well worth the walk up and the wander around. Take time to sit out in the garden to watch the Monastery school children. So delightfully happy."
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "KOPAN Monastery. I attended the Monastery for the yearly Lam Rim Course they open to international people there. The monks were warm and friendly and physically move out of their usual quarters to allow for the visitors."
        }, 
        {
            "index": 115, 
            "rating": "4", 
            "review": "Peaceful and inspiring. It's worth a trip to Kopan which is only a short taxi ride from Boudhanath or a 45 minute walk (that's how long it took me from the Stupa).I enjoyed watching the monks praying and chanting in the main temple, wandering around the very wel kept gardens, browsing in the extensive bookshop, reading in the library and chatting to a monk about the Dharma in the cafe (which has OK food). The views are very good and the air a little cleaner than down in the valley (a welcome respite from the city's pollution).It is worth checking that it is open before heading up there because it can be closed if they have a busy course or retreat - phone the reception."
        }, 
        {
            "index": 116, 
            "rating": "5", 
            "review": "nice view. the view of kathmandu valley was very nice, but our trip there was a bit rocky/shaky maybe because of the earthquake or maybe because the driver didn't know his way and took us on dirt roads :) the garden and the inside of the monastery are nice"
        }, 
        {
            "index": 117, 
            "rating": "4", 
            "review": "the view .. was stunning. the view from the monastery was breathtaking. The sun was up but the not so cold breeze balance the hot temperature. which made our visit was lovely and wonderful."
        }, 
        {
            "index": 118, 
            "rating": "4", 
            "review": "Geluppa dharma center. This monestry is of Buddhist nearby hill if Kathmandu. Where people go, pray and meditate. You can see many Lama(Monks) there and view of valley as well."
        }, 
        {
            "index": 119, 
            "rating": "4", 
            "review": "Buddhist monastery. A bit away from the town this monastery is situated in middle of the Budanilkantha and Boudha Stupha."
        }, 
        {
            "index": 120, 
            "rating": "5", 
            "review": "Perfect respite. Take a taxi, or find somebody who will take you for a walk out there - great cross-country pathways if you can find them. Enjoy the monastery, do a little shopping, have a wonderful lunch and soak in the view of the Himalayas behind you and the Kathmandu Valley in front of you."
        }, 
        {
            "index": 121, 
            "rating": "3", 
            "review": "You can't get in unless you're on a course. Hi. Our taxi driver suggested that we go up there so we agreed but it was not open and the guy on the gate said it was never open. I asked why tour tourists were allowed in and he said it's because they are on a course. So just an FYI"
        }, 
        {
            "index": 122, 
            "rating": "5", 
            "review": "Loved the atmosphere!. We stayed for a 10 days intro to Buddhism session. Under Ani Karen's class. On the first day there were at least 120 students, on the 10th day, a little over 60 remained. The food was delicious, and the chanting was pleasant to listen to. It was a very calming atmosphere. The experience is what you make of it, if you dedicate your time to learning you can get a lot from the course."
        }, 
        {
            "index": 123, 
            "rating": "4", 
            "review": "Great!. My mom and I came for a week, we did a private stay and it was the perfect amount of time. We were not terribly familiar with the Buddhist religion, but were treated very well and all our questions were answered. The library was a great resource to use, there is a cafe, but meals are provided by the monastery too. The convenience store has essentials if you forget anything or want snacks, and the monks are incredibly nice! It was a great, relaxing stay so I would recommend trying it out! Dharma talks are good to attend, and I want to come back for a course, everyone I talked to have them glowing reviews!"
        }, 
        {
            "index": 124, 
            "rating": "5", 
            "review": "Peaceful. Listening to the chanting of the monks early in the morning was such a tranquility. Wish I stayed longer, 5 days were too short."
        }, 
        {
            "index": 125, 
            "rating": "5", 
            "review": "Great place to chill & observe. The Kopan Monastery is a great place to observe the workings of a monastery. We spent ages in the library and spent a lot due to the quality of goods.Stay Strong Nepal & PrayForNepal"
        }, 
        {
            "index": 126, 
            "rating": "5", 
            "review": "A room with a meditative soundtrack. I had the opportunity to do a private stay (between official retreats and programs, the monastery is open to the public for guesthouse bookings). The place inspires a sense of tranquility and rest. I had a room close to two main meditation halls and a courtyard and was thrilled to hear the chanting of monks in the morning and evening. Staying here is quite affordable and is a welcome respite from the dust and business of the city."
        }, 
        {
            "index": 127, 
            "rating": "5", 
            "review": "Magical Place. We were able to go inside the monastery, because we had a friend inside, a monk. Who was so very kind to show us the whole place, the praying center is unbelievable and huge. A truly Buddhist place. If you are interested in studying Buddhism for some months, this could be an ideal pleace."
        }, 
        {
            "index": 128, 
            "rating": "3", 
            "review": "see it. It depends on someone interest to like it or not. You feel calm while you are here. If someone like quite place its fine, otherwise so so....."
        }, 
        {
            "index": 129, 
            "rating": "5", 
            "review": "Peace and meditation. You can not dislike this place. It will provide the best place for meditation and give your mind some peace from hectic life."
        }, 
        {
            "index": 130, 
            "rating": "5", 
            "review": "Peaceful gardens. After hiking to Everest Base Camp we came back down to the madness of Katmandu. Our last day there we decided at the recommendation of our hotel manager to go to Kopan Monastery and I ever glad they did. It is a wonderful quiet get away high above the city. It is a school of sorts where others can come for a week and study the Buddhist lifestyle and take courses. The grounds are amazing full of quiet places to hide away in. The Monastery itself is beautiful much like the others. What makes this one different are the grounds and the children preparing to be monks walking around."
        }, 
        {
            "index": 131, 
            "rating": "5", 
            "review": "Amazing experience!!!. I was very lucky to have the opportunity to stay in this place for 12 days. Magical! The 10 day course is amazing and can be life changing, great insights. This place is very different from the rest of the agitated city: Calm, very clean and full of green. If you can, sleep there and learn about Buddhism, if you can't at least pay a visit. The Gompas are really beautiful. It is not old as the Hindu temples, but it is really magical."
        }, 
        {
            "index": 132, 
            "rating": "4", 
            "review": "Beautiful, serene and views. This fairly newly constructed Buddhist monastery is an example of how rich foreigner funding can create something very special in the middle of Kathmandu. Also, this is on top of a hill, so you can somewhat escape the grime and noise of the city below. Many Americans will be found here doing a 'retreat' so you need to be quiet and respectful. The buildings exteriors and interiors are beautiful and well maintained. The views from on the top of the hill are worth the trip. Security guard at the entrance. Lots of monks, both young and older. Lots of grass areas and a beautiful temple in the middle. We didn't look into what they offered to foreigners, but I am certain many foreigners spend days or weeks there."
        }, 
        {
            "index": 133, 
            "rating": "5", 
            "review": "Wonderful Escape!. Don't miss out on the Kopan experience when in Kathmandu. Stunning property that offers a glimpse of how monks live. Beautiful architecture and views."
        }, 
        {
            "index": 134, 
            "rating": "5", 
            "review": "A must must place to visit. A place that will calm you down - we went their on our last day of stay in Kathmandu and it was the best way to end a very nice trip. Beautiful grounds looking over the sprawling valley, beautiful monastery and very nice and friendly people. Catch the prayer around noon, visit the library (nicely-priced souvenirs for sale, perfect gifts to take home for folks) and eat at the restaurant with windows to the sky. Do visit."
        }, 
        {
            "index": 135, 
            "rating": "5", 
            "review": "If you are interested in meditation. This is the place to be, to take some courses or just spend some days in the monastery and read a lot of books, is amazing how you begin to be with yourself. worthy to try. This place helps you to travel inside yourself, which is very difficult to do."
        }, 
        {
            "index": 136, 
            "rating": "5", 
            "review": "Perfect place for intro to meditation....check out your exit!. I spent the day of my Father's 'death anniversary' here.I wanted to find time for myself and experience meditation with others, have peace, and find whatever I seem to looking for. I got a taxi from The Radisson in Kathmandu- my taxi driver tried so hard to convince me that he should stay and wait for me, but I sent him away (BIG MISTAKE!).Anyway, the monks were in meditation in the big hall, so I sat and meditated, chanted with them........wonderful, except for the number of people who seemed intent on taking pictures/videos rather than being in the moment. I sat for hours, and was included in the water giving and really relaxed and joined in. It was quite simply lovely. I then went for a walk around the gardens, which are amazing, made especially special by the monks, meditating, playing games and just being here, who add to the special feeling.I had a packed lunch with me, so at about 3pm I decided to head off home.....and find a taxi.....none to be seen. The gate man advised me to follow the monks, who were walking down to Bodhnath, but being my own and my first day in Kathmandu I was really nervous. When I asked about the bus (aka lonely planet guide) I was told that would be the next day. I had felt quite relaxed as there were so many 'westerners/tourists' there, but found out they were mainly on organised retreats/longer stay, not day visitors.So, panic set in!I felt a real failure as my only option was to ring the hotel and get them to send a taxi!I went back into the gardens to try to dissipate the panic and 'asked the universe' to get me to Bodhnath. I know this sounds like rubbish.....but after about an hour I went back to the main gates, and there was a taxi bringing back some monks. I reserved it, went back inside and asked if anyone else wanted a lift. There was one other chap (Australian) in the same boat as me, so we went halves and got down to Bodhnath.I am sure now that following the monks would have been an Ok thing to do, just dusty and pretty busy, so even for a now hardened, Kathmandu tourist, not sure I would choose to do it.SO, for the cost, if had my time again, I would ask my taxi man to wait for me! In summary. A WONDERFUL escape from Kathmandu, and if you have your exit planned, you would have a lovely day of meditation in a perfect environment, with lovely monks and superb gardens...and a feeling which is hard to describe.. a peace and connection with the closest I think it is possible to get to Tibetan monks as a tourist with a short time as your disposal.PS: * Food is spasmodic* English speaking Monks not a given* Toilets are squat, bring your own paper* Plan for transport"
        }, 
        {
            "index": 137, 
            "rating": "5", 
            "review": "Little Monks. The most attractive part of this monastery is there are monks of the age of 10-15 years old. Most people throng there to get a snapshot with the young monks.... this is on top and the thrill of climbing 100 steps to monstery"
        }, 
        {
            "index": 138, 
            "rating": "5", 
            "review": "Zen. Had intended to attend the daily dharma talk (mon - fri) but went on a Saturday when no talks were held. One lama gestured that we can stil enter the meditation hall where dharma talks are usually held. Purely sitting in the well kept hall was an amazing experience for me. Such a calm feeling. There are more to see in Kopan monastary such as miniatures in the garden showing stories of Buddha. It would be good to contact the monastary first before visiting the place since it might be closed on major buddhist festivals."
        }, 
        {
            "index": 139, 
            "rating": "4", 
            "review": "Well-managed Monastery. I had visited Kopan Monastery for three years consecutively. I stayed in their guest house which is not the best in Kathmandu but we always named it as Hilton - Kopan. The rate is not cheap but the environment is peaceful and clean. Food is available in the cafe and again the rate is higher that some cafes around. Suggest to visit the New Sadle(New Skill and Developement Learning Experience) It is an NGO providing treatment for leprosy people, beggars, other disable and marginalized people medically and rehabilitate cured social outcast as well as polio and other Disable. You can help them by paying them a visit and buy some of their products."
        }, 
        {
            "index": 140, 
            "rating": "5", 
            "review": "Peace. A beautiful place to stay if you just want to know more about Tibetan Buddhism. You can stay for a course or just for having some rest"
        }, 
        {
            "index": 141, 
            "rating": "4", 
            "review": "nice, bit of a hike. great peaceful atmosphere, but of a hike to get up here. Nice to hang around and soak up the peaceful atmosphere."
        }, 
        {
            "index": 142, 
            "rating": "4", 
            "review": "Amazing out of the city day trip. Kopan Monastery is a nice day trip out of Kathmandu. It's beautiful, provides a great view of the valley.You can watch the monk students do a ritual, as well. They have classes there as well for people to learn about Buddhism, it was created as a monastery for westerners originally.\nBut even just for a trip, it's lovely."
        }, 
        {
            "index": 143, 
            "rating": "5", 
            "review": "Beautiful and quiet temple. The Kopan monastery is especially famous for teaching Buddhism to visiting Western foreigners. Its a quiet and beautiful space on top of the hills of Kathmandu. If your ida of Nepal was to have some kind of peaceful retreat this definitely worths a visit."
        }, 
        {
            "index": 144, 
            "rating": "5", 
            "review": "MONASTERY STILLNESS. I liked stillness.I spent in the Kopan Monastery3 weeks.It was unforgettable being in company all day long with the 250 monks."
        }, 
        {
            "index": 145, 
            "rating": "5", 
            "review": "Peaceful place for mediation. On top of Kathmandu hill you can find this Thibetian monastery with peaceful area for praying and mediation . Many travelers come to here for retreat with this great atmosphere and sincere teaching"
        }, 
        {
            "index": 146, 
            "rating": "5", 
            "review": "When you leave, you leave with a kinder heart.. An amazing place whether you are Buddhist or not. It is stunningly beautiful with many different levels of accommodation to suit everyone. The food is delicious and the very ground seems to exude peace and tranquility. I will go back as often as can manage."
        }, 
        {
            "index": 147, 
            "rating": "4", 
            "review": "PEACE. Peaceful place, with nice location the sorroundings are clean and looks nice in a way but overall if I say will be a gud to visit and mst visit place in KTM. Lot to learn and earn knowledgewise and one must visit this place."
        }, 
        {
            "index": 148, 
            "rating": "5", 
            "review": "Do visit!. If you want to learn about Buddhism or take some teachings, courses, retreats- it's a perfect place!Located beautifully on top of the hill away from the noise of Kathmandu city.A great place to study Buddhism or to just get away from it all even for few hours( DO CALL them first if you want to visit to make sure they will let you in. If they are helding retreats, they don't let people go in) .They offer 7 days or 10 days retreats every month. A perfect place to study Buddhism. There is a small shop with great books, little vegetarian cafe on side with great view of Kathmandu. Highly recommend!"
        }, 
        {
            "index": 149, 
            "rating": "3", 
            "review": "Far but Good. This Kopan Monastery or Kopan Gumpa is definitely located away from all the other attractions in kathmandu valley. It could be a bit difficult to get here. I went here after going to Boudanath Stupa. Took me an hour to get with a bike. The road is not good (as like everywhere else). But the Monastery itself is not too impressive. so probably you can give it a pass if your schedule is tight."
        }, 
        {
            "index": 150, 
            "rating": "4", 
            "review": "Nice place. Kopan is a beautiful Tibetan monastery on the outskirts of Nepal. It's worth a visit to see the nice compound with all it's statues, stupa and decorations. Or to sit down for a day, relax and read or write. The monastery also has an extensive library and a small shop with a lot of interesting books on Buddhism."
        }, 
        {
            "index": 151, 
            "rating": "5", 
            "review": "professional. good location, still profssional. but monk, nun, views are like a worthful , friendly. i been 2 hours there, taking a tea with nice views"
        }, 
        {
            "index": 152, 
            "rating": "5", 
            "review": "Beautiful. Very beautiful place with nice views all around. There is a shop and a library. Nice relaxing gardens, statues and fountains around."
        }, 
        {
            "index": 153, 
            "rating": "5", 
            "review": "Tranquility & great views of the Valley!. Kopan was on the last day of our itinerary and it was like an excellent parting treat! It was a about 45min drive from our hotel in Durbag Marg. The uphill climb was a bit rocky with poor roads, but it passes by villages and you get a glimpse of the life around. You will see monks going up and down the hill. The guard at the entrance gate was not ready to allow us in and luckily we met a monk entering the monastery. He gladly agreed to take us inside and also explained what to see. We were told that all the monks had gone to Bodhnath Stupa. We were all by ourselves at that time. It was such a peaceful environment. We spent time going around the beautiful garden at the back where you will find a couple of stupas and then the main meditation hall and the souvenir shop.It is nice break from the chaotic Kathmandu. You get nice view of the valley and Bodhnath Stupa. Definitely worth a visit!"
        }, 
        {
            "index": 154, 
            "rating": "4", 
            "review": "Just OK but.... The monastery was great and theres so much history to this place but I didn't find it as nice as others.. but I did enjoy the beautiful walk to this place, the people along the way and that pointed me to the direction of this place was great, so saying that I do recommend this place"
        }, 
        {
            "index": 155, 
            "rating": "5", 
            "review": "The best discovery of Buddhism. This monastery is a place to learn about Buddhism. There are several courses depending on the level of teaching you are searching. The monks and nuns are very open to help you.The rooms are good and clean with hot water! The food is vegetarian and great.I will be returning there and would recommend it to every one."
        }, 
        {
            "index": 156, 
            "rating": "5", 
            "review": "This place stirred something in me. We made the 40min walk from Boudhanath Stupa up, which was quite easy but then we walked straight past the sneaky walkway up. Lucky a couple of young monks found us and led us back. It was supposed to be closed at the time of year we went but the guard happily opened the door to us. And it was magical. The views, the people, the serenity. I plan on returning to stay for a few weeks next time I'm in Nepal."
        }, 
        {
            "index": 157, 
            "rating": "5", 
            "review": "Bliss. It's on the outskirts of Kathmandu and has amazing views of the city. You can stay in their lodges and attend the morning poojas. The guided meditation is very good and it's always so interesting hearing the monks stories. It is cheap accommodation and is a good alternative to staying in the city."
        }, 
        {
            "index": 158, 
            "rating": "4", 
            "review": "Nice peaceful area. But more suited for those interested in buddhism and spirtuality (imo).. As a regular tourist without a more-than-average interest in spirituality and Buddhism it was just an alright place to visit for me. You do have amazing views on the city and can see Boudhanath Stupa from the well maintained and peaceful gardens there, but the monastery and religious side of things didn't interest me that much."
        }, 
        {
            "index": 159, 
            "rating": "5", 
            "review": "Peaceful and Serene. The bumpy ride from Thamel up to Kopan was an enjoyable one as we saw many locals and how they live. Past the monastery gates, however, was a delight. It was very quiet even though we saw some young monks discussing and enjoying themselves in the warm, winter sun. We took lots of photos and ventured around to the garden which beautiful. Most of the trees still had foliage (I think there were a few colourful plastic trees too!)Pleasant to see visitors and locals alike relaxing and doing some yoga on the green above a spiralling brick staircase in the garden.Gift shop was amazing as they had a Bounty bar (of all things on a mountain) and lots of other souvenirs, and cashier was manned by a robed monk which was lovely to see."
        }, 
        {
            "index": 160, 
            "rating": "5", 
            "review": "Love monastries!. I have a fascination for monasteries and they never fail to mesmerise me!Kopan is away from the city, quiet and beautiful!Stop by to meditate for a while in the monastery, speak to the locals, and then to sip a cup of coffee at the coffee shop at the monastery.....!"
        }, 
        {
            "index": 161, 
            "rating": "5", 
            "review": "Spiritual. Very clean place, especially after visiting hindi temples, very peaceful and with great views. Totally recommended"
        }, 
        {
            "index": 162, 
            "rating": "5", 
            "review": "A retreat from the noise. A serene place with a nice view of kathmandu. A little far from the city, but worth it. You won't find taxis from there, so keep the taxi that you brought waiting. It would take about half an hour to roam around."
        }, 
        {
            "index": 163, 
            "rating": "4", 
            "review": "Amazing Experience. Very peaceful, away from the crowd & beautiful place to visit for few hours but I won't rush my visit if I happen to be there next time. The holy places should be taken care very well but found this place unclean which is unfortunate."
        }, 
        {
            "index": 164, 
            "rating": "5", 
            "review": "Must Visit.. Highest point, that allows you views of the city, interaction with some monks, some peace and quiet from the city, and finally a place where there is none of the kathmandu pollution. There is a nice shrine at the back of the monastery."
        }, 
        {
            "index": 165, 
            "rating": "5", 
            "review": "A hidden gem. Most short trips to Kathmandu don't have this monastery in their list of places to visit. However, I found it to be fantastic. A 15-20 minute drive from boudhnath stupa, including a short climb, takes you to the monastery. You get a brilliant view of Kathmandu from here. We requested that we would like to be shown around, and a nice monk promptly obliged. We saw the main building, the school, canteen, gardens etc etc. There is a small shop and a restaurant also inside. We made a small donation at the end. The whole place is very quiet, and you get a lot of information about Buddhism. In addition you can see little kids who will spend some years here in the school. Must visit if you are going to Boudhnath. The entire tour takes only 30 mins, but you will enjoy it."
        }, 
        {
            "index": 166, 
            "rating": "5", 
            "review": "The most tranquil, peaceful setting in Kathmandu. If you have nothing left to do in Kathmandu, just simply visit Kopan and take a breather from the Kathamandu-ness."
        }, 
        {
            "index": 167, 
            "rating": "5", 
            "review": "Wonderful walk up the hill. Very open to westerners, with a cafe and bookstore on site. It makes a nice half day trip to hike up the hill from the Bodha stupa to Kopan monastery."
        }, 
        {
            "index": 168, 
            "rating": "4", 
            "review": "Beautiful air. If you want some fresh air, away from the hustling and bustling of the streets of Kathmandu then well this is the place to be. You will get lost in the various carvings on the temples and its serenity."
        }, 
        {
            "index": 169, 
            "rating": "5", 
            "review": "\"I ll say one of the best place to be in kathmandu!\". Monastery apart the place and sorroundings are very peaceful and feels like you aren't in Kathmandu's crowd rather feels like you are seeing kathmandu from up above the sky !"
        }, 
        {
            "index": 170, 
            "rating": "5", 
            "review": "Peaceful and quiet. Very peaceful and quiet place on a hill. You can get a beautiful view of the valley from the monastery. The temple of 1000 Buddha is mind blowing."
        }, 
        {
            "index": 171, 
            "rating": "4", 
            "review": "Where the Mystic Meets the Soulful. Ah! Kopan! What a place of serenity and spirituality! The Kopan (Tibetan, Buddhist) Monastery lies in the outskirts of Kathmandu (a 45 minute drive), atop a hill that rises over the valley. I'd imagine it's not the easiest place to find in Kathmandu. Entry is free and certain courtesies, expected. A Muslim and mostly ignorant when it comes to Buddhism, I can only comment on the aesthetics. Kopan is a complex of monasteries, shrines (?), a nunnery, cafeteria and I guess what could be called 'retreats'. The shrines are a shimmering Golden and adorned with intricate designs. The hilltop offers a great view of the Kathmandu valley. There are shade-trees for a quick read, or gazebos for quiet meditation. The 'retreats' are restricted area for tourists since they're likely to disturb the peace of monks and trainees. A lot of Europeans / Westerners come here for spiritual guidance and peace of mind and can often be seen with their cleaning-buckets, mops or gardening tools - working tirelessly and happy as clams.Great place to visit for 2/3 hours of quiet. A chat with a local monk makes it even more special."
        }, 
        {
            "index": 172, 
            "rating": "3", 
            "review": "Not worth a short trip. This may well be a great place to enjoy a Buddhism course (I don't know) and the location is peaceful enough, but too far from the city to warrant a couple of hours visit."
        }, 
        {
            "index": 173, 
            "rating": "5", 
            "review": "Peaceful place, best place to spend several days. I have attended 10 day discover Buddhism course in Kopan monastery. Peaceful quiet and comfortable place to spend time here, get new experience, learn meditation and stay with yourself. Gompa is new but very nice. Excellent views. Quiet place in Kathmandu valley."
        }, 
        {
            "index": 174, 
            "rating": "3", 
            "review": "Someway away from Kathmandu. A modern complex but perhaps not worth the trouble? I liked the foreign visitors doing meditation stays."
        }, 
        {
            "index": 175, 
            "rating": "5", 
            "review": "Blissful to aquire wisdom and to find yourself. I went there in May this year for a ten days retreat and to learn about buddhism..I was not disappointed. My stay was a memorable one. The monks and the nuns were so serene and helpful. The place in itself is so serene and peaceful. There are many corner areas where you.can sit and.meditate. My retreat was to learn about buddhism and learn meditation. I came out with a hand full of.wisdom and plenty of books. The canteen food is good. The rooms k chose were 5.star ;) the bookstore was awesome. U can spend a whole day there. And meditation were divine. Pure bliss to be there. Very close to Bodhnath area. From Bodhnath one way.up is NPR 150 app but more expensive from Thamel or Kathmandu. The views are just amazing. What a peaceful place to find yourself. There are specific time and days the monastery is open for visitors. You may even consider staying there at a cost..No hesitations. Just go."
        }, 
        {
            "index": 176, 
            "rating": "4", 
            "review": "A peaceful Buddhist site. Kopan Monastery consists of two monasteries on top of two adjacent hills, and is free to enter, though one of the monasteries was off-limits the time I visited due to a \"Pooja.\" The one monastery was enough to visit though. I found the place by bicycle and by asking locals at every turn in the road.Though perched atop a hill, the views of Kathmandu are never great due to the smog. The site has a number of well preserved buildings used for Buddhist prayers and rituals. Lots of Buddhists on site shuffling around in their traditional red garb. Of particular interest for tourists is the large prayer wheel, and the garden with the two large Buddhist shrines, very colourful and intricately carved. A few restaurants are available."
        }, 
        {
            "index": 177, 
            "rating": "5", 
            "review": "Peaceful Place.... The Drive their was a task through the Kathmandu city itself...Situated on the hill had great views..The Monastery had great vibrations, lovely place to meditate...the gardens are very well kept and tell some history about Lord Buddha ..."
        }, 
        {
            "index": 178, 
            "rating": "3", 
            "review": "Easy to see. Hard to find.. I could see it but had no idea where to go. No signs at all. No clear path. Monks smiled but did not help. Never got therePretty views. Take a taxi."
        }, 
        {
            "index": 179, 
            "rating": "5", 
            "review": "Oasis of peace. A beautiful monastery set in the Kopan hill of Kathmandu. A few new blocks have been built to accommodate retreatants who wish to attend its Buddhism or meditation courses. The rooms in the new blocks are clean and nicely furnished. For its price, it is very decent and value for money and one should not compare with those of 4 or 5 star hotel. It's in a monastery after all. It has both a canteen, which is a simple cookhouse that offers free meal, and also a cafe, that serves a decent spread for a small price. Visit the garden at the back of the monastery and view the two beautifully decorated stupas which are built to commemorate two of the monastery great lamas who have passed on."
        }, 
        {
            "index": 180, 
            "rating": "5", 
            "review": "kopan. great views, great gardens, very well stocked and very fairly priced goods in shop. Good range of courses, simple but nice cafe"
        }, 
        {
            "index": 181, 
            "rating": "5", 
            "review": "quiet. Kopan is one of the most beautifull places. It is so clean and quiet and parcipating in the meditation calsses is absolutly unforgetable"
        }, 
        {
            "index": 182, 
            "rating": "4", 
            "review": "Completed a course at Kopan. A truly amazing experience. The teachings and the meditation are life changing. The only downside was the basic facilities and cleanliness, which unfortunately made it difficult for me to focus on the course."
        }, 
        {
            "index": 183, 
            "rating": "4", 
            "review": "Far but worth it. This quite far from kathmandu but worth a visit for your discovery of life of the monks.An interesting culture."
        }, 
        {
            "index": 184, 
            "rating": "5", 
            "review": "Wonderful place.. Kopan is my favourite place to visit, it's so peaceful, get there in time to enjoy a great breakfast or lunch in the café. A taxi will take you there from Thamel and wait an hour or so for around 1300 rupees (less than £10)"
        }, 
        {
            "index": 185, 
            "rating": "5", 
            "review": "Kopan Peace. a wonderful monastery outside of the city! its a oasis of tibetan buddhism and set on lovely landscape!\ngreat combining with a visit to boudhha stupa!"
        }, 
        {
            "index": 186, 
            "rating": "4", 
            "review": "Unwelcoming... The place is a steep climb from kathmandu ...we went there on a motorcycle.... upon reached there we are being interrogated and looked upon suspiciously ....as if it holds a lot of hidden and illegal stuffs.The security checked our citizenship proof and then are allowed in...where as westerner's are being welcomed with open arms....that means they are only attracted and greedy towards the foreign currency which they get from them by showing the hocus-pocus....come on....Buddha didn't taught any discretion. Apart from these the view from there was nice..The monastery hall remain open from 8am to 12pm and from 1pm to 5 pm"
        }, 
        {
            "index": 187, 
            "rating": "3", 
            "review": "Average. New, made from concrete, rather ugly buildings set in a beautiful garden with splendid views on Kathmandu and Shivapuri. Two colourful and marvellous stupas. Seems to be a typical trap for naive Westerners in search for \"oriental wisdom\". Has strange and unpleasant atmosphere of \"religious business centre\". Shop and restaurant quite costly. Can be visited if there is nothing more interesting to do. Note that the monastery main (not very interesting) hall is closed to visitors from 11.30 a.m. to 2 p.m. (subject to change)"
        }, 
        {
            "index": 188, 
            "rating": "5", 
            "review": "peaceful place. A very peaceful place, with a beautiful temple in the centre where everybody enters freely but barefooted. Worth visiting! Astonishing gardens at the back of the temple, help you relax. At the end of your visit, you can enjoy a cup of coffee at a small cafe shop located next to main gate, run by young monks!"
        }, 
        {
            "index": 189, 
            "rating": "5", 
            "review": "I felt right at home. I felt at home as soon as I walked in the gate. People are friendly, you can talk with others staying there, and they have lunch time educational talks. This is the most beautiful place in kathmandu if you like peace and quiet. They have an Internet cafe with good food and drinks. If you like to relax and enjoy scenery you could make this a whole day trip as I did."
        }, 
        {
            "index": 190, 
            "rating": "5", 
            "review": "a magical place. Visited here and totally fell in love. The scenery is breathtakingly beautiful. The book store was mystical and comprehensive. The gift shop was where I bought all of my precious gifts. A must visit."
        }, 
        {
            "index": 191, 
            "rating": "5", 
            "review": "om mani padme hum. I spent 2 weeks at the monastery itself. A great way to learn about Buddhism, a great place to take a rest and think for a while. Highly recommended if you are into spirituality."
        }, 
        {
            "index": 192, 
            "rating": "5", 
            "review": "beautiful. Kopan might be the most beautiful place around Kathmandu in my mind.\nIt is possible to join meditation courses. I can recommend that but also just go there stay for a night or two or just go there for a visit"
        }, 
        {
            "index": 193, 
            "rating": "5", 
            "review": "Nice to see this great shrine!. Located on a hilltop on the outskirt of Kathmandu, this is a great shrine to visit. It is open only a day in a week."
        }, 
        {
            "index": 194, 
            "rating": "5", 
            "review": "Best gompa in Kathmandu. My experience with this place is priceless. Words cannot describe my new found love and respect for this place. My week of private stay here turns out to be one of my best memory in Nepal.I was not expecting to stay at this place, but thanks to the turn of events, I found this special gompa.The monastery is very peaceful and beautiful. Beautiful sunrise and sunset. You can listen to the monks chanting in the morning and the evening. The scenery is spectacular. Don't forget to walk around the monastery, there's some other nice places to go as well, such as the nunnery and their insense shop.It's a great place to learn about Tibetan Buddhism, there's classes on Buddhism everyday at 10am besides Saturday. You must visit the bookstore and library! Fair prices, wide range of products and many good books on Tibetan Buddhism. The monks And staffs are very nice and helpful! Plus, most people you encounter in the monastery are great :) it's nice to be surrounded by nice people. Also, the rooms with share bathroom are clean and spacious. A good night sleep guaranteed! The bathrooms are clean as well.You have to stay here if you can! You will not be disappointed!"
        }, 
        {
            "index": 195, 
            "rating": "4", 
            "review": "Step back in time. this is an essential when visiting Kathmandu, I walked to the monastery over a breathtaking ridge on a gloriously sunny and for once clear day. Don't rush your visit. I would like to do a retreat here when I next visit Nepal"
        }, 
        {
            "index": 196, 
            "rating": "5", 
            "review": "Serene. The Buddhism course that I took at Kopan Monastery was amazing. The 12 days retreat was informative and relazing"
        }, 
        {
            "index": 197, 
            "rating": "4", 
            "review": "Calm . Its on hike. And very calm place. Good panorama. As we visited in rainy season, there was a very good view of another monastery nearby disappearing in clouds."
        }, 
        {
            "index": 198, 
            "rating": "5", 
            "review": "Heaven inside Kathmandu. Having tried the 10 days meditation retreat is a must for everybody who try to seek the earliest introduction to Tibetan Buddhism. The space give its vibes of peace which are a little bit out of bustling Kathmandu."
        }, 
        {
            "index": 199, 
            "rating": "4", 
            "review": "A far drive, but worth it. At the top of a hill, this monastery was as welcoming as the monk I had met at the airport. Spectacular views - lovely stupas - and nice grounds for just walking around.One does not need to be Buddhist to appreciate this spot."
        }, 
        {
            "index": 200, 
            "rating": "3", 
            "review": "Colourful. Beautiful stupas surrounding the main Monastery set in well-manicured gardens with a thriving monk and nun population with retreaters alike.\\Lovely inside and has a coffee shop adjacent."
        }, 
        {
            "index": 201, 
            "rating": "5", 
            "review": "10 Days Retreet. Interested in Buddhism, 10 dayes retreet will be the most amazing journey you will ever take. Not interested you will still enjy the garden at the view."
        }, 
        {
            "index": 202, 
            "rating": "5", 
            "review": "Remarkable Monastery. A must see attraction for those who are spending some days in Kathmandu. Unfortunately I didm`t have so much time available in the city, because I was just passing by but Im very happy that I was able to visit Kopans."
        }, 
        {
            "index": 203, 
            "rating": "5", 
            "review": "Nice place revealing Buddha Religion. I found Kopan monastery a nice place with almost everything related to Buddha and Buddhism showcased in the area. When I went, the place was filled with people so couldn't find much peace. That may be because it's opened for public only on Saturdays. Nevertheless, it was good to see the artwork there."
        }, 
        {
            "index": 204, 
            "rating": "5", 
            "review": "Concrete structure with soft spoken inmates. Though the structure was made of concrete and had big gates the inmates were so soft spoken and religious. The young monks added to the charm."
        }, 
        {
            "index": 205, 
            "rating": "2", 
            "review": ". . . well . . .. There are better and worse places to visit. It's not a rich dynamic cultural experience - but then it depends what you want. If you know someone there it is probably more interesting than if you do not."
        }, 
        {
            "index": 206, 
            "rating": "4", 
            "review": "Kapan Gumba. if you are interested in Tibetan Buddhism and want to get away from chaotic kathmandu, visit Kopan. You can go for a day visit or even stay for a few days if they don't have a course going on and have rooms available. You get to see and feel their daily life, talk to the monks, and watch the little ones playing around. The gompa is beautiful as well as the gardens. Sit for a while and you'll feel their compassion and peace all over. If possible call before, sometimes entrance is not allowed, so you don't go all the way to find out you can't get in"
        }, 
        {
            "index": 207, 
            "rating": "5", 
            "review": "Wonderful!!. Not easy to reach (3 different buses) but it worth it!- Free entrance- Quiet, peaceful- Wonderful panoramic view- A lot of monks- Wonderful gardens- Not a lot of tourists"
        }, 
        {
            "index": 208, 
            "rating": "5", 
            "review": "Haven of tranquillity. Going up to Kopan in a vehicle you pass saffron and maroon robed men and women monks going up or downhill. They are the residents of Kopan, supposedly Nepal's largest monastery and nunnery. Kopan is where many foreigners go to stay for a few days in its silent and peaceful surrounds, to learn and practice meditation. It is beautifully landscaped and abounds with fengshui."
        }, 
        {
            "index": 209, 
            "rating": "5", 
            "review": "Superb Place to Visit. If you are looking for peace place to chill out in kathamndu thenKopan Monastery will be the best place to visit. Very quit placecomparison to other places. We chill out there more then an hours.Its very nice and remarkable for me....."
        }, 
        {
            "index": 210, 
            "rating": "5", 
            "review": "Peace Oasis. If your tired of the noise and air pollution of Thamel, Kopan monastry is the place to go. There's just this unexplainable sense of peacefulness once you step into the grounds. You could just spend hours, roaming the grounds, eating at the cafe, visiting the library and maybe even making purchases at the store, which sells a large range of really good and affordable books related to Tibetan Buddhism.*The Monastery is opened when no courses are going on, you can check their website for the date of the courses or you could give them a call to check too."
        }, 
        {
            "index": 211, 
            "rating": "5", 
            "review": "Nery Nice. I really like this place because of meditation\nI stay there 2 days for mediation.It is little for from Kathmandu do very quite and so fantastic place"
        }, 
        {
            "index": 212, 
            "rating": "3", 
            "review": "Serene. The Monastery was a place of serenity and quiet in an otherwise noisey and dusty city. It's only open to visitors on Saturdays so plan accordingly."
        }, 
        {
            "index": 213, 
            "rating": "5", 
            "review": "Kopan Monastery. Famous for many years. It belongs to the purest sect of Buddhism - the Yellow Caps or Gelukpa (order of the virtuous) which is the sect from which the Dalai Lama himself stems. In early years life was very simple there - three people in a small room sleeping on the floor and only one ice cold 'shower' for everyone. No all is modern, very clean, with good restaurant and modern commodities (even cybercafe). The garden around is amazing and the view is 360 degrees over the Valley. Smoking, drinking and sex are prohibited as well as lying, stealing, harming living beings, and personal internet, and it is an excellent place for retreat, deep thinking, reading in the high class library and meditation. Deep courses are regularly given. You find yourself between hundreds of boy-monks received modern and traditional Buddhist education."
        }, 
        {
            "index": 214, 
            "rating": "5", 
            "review": "Drive to Kopan. The best part of this trip is the drive to and from. My sister and I went on a Sunday and saw cows strolling through town and a wedding celebration. This drive takes you into the valley and is a nice break from the city. Ask your cabbie to take you to the top and wait for you. Make sure you walk along the side of the monastery to see the beautiful stupas in the garden."
        }, 
        {
            "index": 215, 
            "rating": "5", 
            "review": "Take the ten-day program. The Ten-day program is very challenging, and so worth it. I loved it. The curriculum is thorough, the monks and nuns are wonderful, and the views are spectacular. You will not be disappointed."
        }, 
        {
            "index": 216, 
            "rating": "4", 
            "review": "Serene and Silent. I needed to spend some time in sheer silence. They say meditation gives the mind energy to think better and act faster and so I made my way to the Kopan Monastery. It was definitely a serene yet quite spot high up in the mountain away from the hustle and bustle of the city down below in Kathmandu. As I reached there, I went towards the Garden of Silence which had beautiful Pagodas built and was highly taken aback by the craftsmanship in the monuments that were built. It is a beautiful garden which is extremely quiet and the fresh green atmosphere gave me an opportunity to spend some time in silence and prayer. The only unfortunate part was that I could not spend too much time inside the Temple as there was some maintenance work that was about to start. But if you are really looking for a spot to relax your mind and body then the Kopan Monastery is definitely a place to go and visit and spend a few hours there as well."
        }, 
        {
            "index": 217, 
            "rating": "5", 
            "review": "Paradise of Kathmandu. Very nice, tidy,with great views of Kathmandu from above! An oasis in Kathmandu! The sunset time at Stupa is wonderful! Nice restaurant and also nice library and shop !"
        }, 
        {
            "index": 218, 
            "rating": "5", 
            "review": "Serene. Kopan Monastery is one of the most beautiful and serene places I visited in Nepal. I started the 10 day meditation course, which I found to be excellent, but ended up leaving before it was over to explore more of the country in the short time that I had to visit. I hope to go back someday and finish that course!"
        }, 
        {
            "index": 219, 
            "rating": "5", 
            "review": "Great experience. Quiet retreat away from Kathmandu. Be careful to go on a day when there's no private meditation retreat, or they will not let you in (at least in theory - we asked really nicely, and got let in anyways!). You can go for a nice walk around it as well, and a taxi from Kathmandu isn't expensive (600-800 rps max).All in all, it was a lovely place to stay! Be sure to stop somewhere outside to get a cold drink. The views are awesome!"
        }, 
        {
            "index": 220, 
            "rating": "5", 
            "review": "A must Visit. its beautiful must go is u are interested in to be at some place quite and beautiful away frm city and try the canteen food its gr8"
        }, 
        {
            "index": 221, 
            "rating": "5", 
            "review": "Breathless.. It took my breath away. Especially the garden area.\nI wish I had spent more time here. It is so peaceful and quiet and view of the mountains and hills around you are visible from every angle. So silent you could here a pin drop. If you want to escape from the world this is perfect!"
        }, 
        {
            "index": 222, 
            "rating": "4", 
            "review": "Peaceful. If you are searching for guidance, peace, a new path in life or whatever it might be Kopan is a great place to visit whether for a few hours or a course. My experience was a 10day Tibet Buddhist Meditation retreat with 130 other travellers. It is an introduction course and will certainly give most people something to reflect on or possibly remind them how to truly live life. It has beautiful gardens to chill in, cheeky monkeys, the odd friendly snake and some well behaved dogs. There are even some monks wandering about. Funny that ;)"
        }, 
        {
            "index": 223, 
            "rating": "5", 
            "review": "Peaceful and beautiful. The monastery and the whole location and the valley in which the monastery is set in, takes your breath away. There is a peaceful air around the place and definitely calms you as you step into the place. The interior of the monastery is a visual delight with lots of color and prayer flags and the beautiful statue of Buddha all creating a divine aura for the place. Make sure you visit it on the day open for the public and you will be blown away with the charisma of the place."
        }, 
        {
            "index": 224, 
            "rating": "2", 
            "review": "Good place to visit but terrible to study bouddhism. This monastry is a big peaceful complex where courses of bouddisme are given. İn reality, I was terribly dissopointed, they talk about hell, suffering, lower birth if we don't believe in dharma quiet a lot, and they are giving no psychological insight what other bouddhist studies likes vipassana seems to give. With a closer look, they function like missonaries. İf you are not looking for a practicise based on blind faith, this place should be avoided."
        }, 
        {
            "index": 225, 
            "rating": "4", 
            "review": "Nice and relaxing. Nice and relaxing place to visit, the garden is a beautiful place for meditating and enjoying the silence. The inside of the temple worth the view, it's impressive. Or you can just enjoy the nice view of Kathmandu. Be aware that the monastery is only open to visitors on a specific schedule."
        }, 
        {
            "index": 226, 
            "rating": "3", 
            "review": "Kopan Monastery. Just a helpful note: Kopan Monastery is only pen to the public on Saturdays, so was quite disappointed that we drove all the way there only for a tiny glimpse from the road. Looks gorgeous though!"
        }, 
        {
            "index": 227, 
            "rating": "5", 
            "review": "A place to relax. Best place around Kathmandu valley for relaxation & healing. You can feel that you are out from stress & agony. You will be back to normal life"
        }, 
        {
            "index": 228, 
            "rating": "5", 
            "review": "Lovely Kopan. First time to Kopan after 39 years traveling to the Valley. Stop and smell the roses, eh? A blessed relief from the madness before, if only for a Saturday afternoon. Truly inspired me to work on more meaningful aspects of this lifetime. Om"
        }, 
        {
            "index": 229, 
            "rating": "4", 
            "review": "Discover Buddhism at Kopan. Kopan offers a peacful environment for meditation. I recommend the 10 day introductory courses. Its nice to unplug and just find silcene"
        }, 
        {
            "index": 230, 
            "rating": "5", 
            "review": "Peaceful!. This place is a bit far away from the main city, but thats probably why monasteries are away from the hustle and bustle of the cities... this place truly has a lot of tranquility.. and from this place you can see a lot of the valley. A must Visit.."
        }, 
        {
            "index": 231, 
            "rating": "4", 
            "review": "Didn't get inside but still liked it. We walked for around an hour to get to the Kopan Monastery and when we arrived it was closed as they were performing some ceremonies that were not open to the public. This was a shame as the Monastery looked beautiful from outside, as did the surrounding gardens. The walk was still great through passing through the small villages to get there was interesting and from the top of the hill you can still see beautiful views of Kathmandu."
        }, 
        {
            "index": 232, 
            "rating": "5", 
            "review": "Peace in the middle of mayhem. The ride up to the monastery is bumpy and dusty, but the welcoming presence of the monastery makes it all go away.As soon as you walk through the gates you see the beautiful designs on the ground and know that you have entered some place different. There is a faint chanting in the background and then unexpectedly there is an explosion of monks of all shapes, sizes and genders. We had arrived in time for a special gathering that to this day we don't know the origin off or reason for. There were monks and locals everywhere. We had about twenty minutes of peaceful strolling through the gardens before the amount of locals and monks let us know that there was something big going on. So we followed the stream of monks from the gardens and lo and behold in the courtyard in front of the main temple there they all sat. Facing a small stage that was occupied by senior monks wearing fabulous yellow head dresses armed with mics and ruling on what seemed to be mock complaints from other monks. There was hand slapping, shoving, pushing, raised voices and laughing. You cannot miss the monastery. Even on a busy day it was still peaceful...and free too. There is a small cafe type shop that you can get drinks and snacks from. It was packed so we didnt go in, but we have heard that it is okay."
        }, 
        {
            "index": 233, 
            "rating": "5", 
            "review": "Excellent Experience. We came here with Tauck Tours and they arranged a session with a monk. He explained the meditation with some breathing and posture exercises and we were able to practice it a bit.Afterwards we were able to interact and take photos with the young nuns. Hope that you can do the same - it was certainly worth it and I actually use some of the suggestions to relax."
        }, 
        {
            "index": 234, 
            "rating": "4", 
            "review": "Peaceful and Good place to visit. This is my second visit and I was very happy with the environment which is serene and peaceful. The garden with two special stupas for the great teachers who had left us. The rooms are still in good condition with free meals. Recommend for Buddhists to stay in Kopan Monastery"
        }, 
        {
            "index": 235, 
            "rating": "5", 
            "review": "Getting peace near Kathmandu. Kopan Monastery is must to visit in Kathmandu. You can organise couple of hours visit, or to stay there for different courses, or just to stay there for peace and meditation. I was taking meditation classes in Jun 2013, and have visited Kopan Monastery many times before and after. It is one of the best places not far from downtown where you can found your peace, and in the same time with amazing view on the city, to mediate, or simply to walk around."
        }, 
        {
            "index": 236, 
            "rating": "5", 
            "review": "Good place to visit.. Visit at least once to see the biggest buddhist monastry of kathmandu as you could see thausand of monks would be praying and medetating there."
        }, 
        {
            "index": 237, 
            "rating": "5", 
            "review": "Serene Retreat. Far from the busy activity, where you can relax and have a conversation within. Excellent yummy food at the cafe to nourish your body, holy shrine to nourish your spirit."
        }, 
        {
            "index": 238, 
            "rating": "4", 
            "review": "Peace, Real Peace. A peace zone with beautiful monastery and great view of the valley. You can enjoy warm sun on the top garden of the monastery. You can buy lovely handmade ayurvedic soaps there. Classes on buddhism with accommodation available (Paid)."
        }, 
        {
            "index": 239, 
            "rating": "5", 
            "review": "Resham Firiri Tour 2014. An Amazing site of Kathmandu Valley I was delighted to spend some time at Kopan, discover with Exploring Nepal my friends the stories of Kopan visit along the monastery. A Tibetan Soup and of we go... Beautiful Paintings and Stuppa a must while in Kathmandu"
        }, 
        {
            "index": 240, 
            "rating": "4", 
            "review": "Peace at Kopan. Spent a peaceful time at this Monastery. Beautiful grounds---bring a book to sit and read. Incredible views of the Katmandu valley below. If you are there when the Monks are in the temple chanting you are in for an very special treat. Don't forget to visit the Bookstore/gift shop for some very nice, inexpensive items, many made at the monastery. Kopan is located on top of a hill---recommend a taxi ride up."
        }, 
        {
            "index": 241, 
            "rating": "5", 
            "review": "A lovely experience!!. I attended the 1 week Intro course in Buddhism here and what a beautiful experience it was. The place is situated on a hill with 360 degrees view of the greenery all around. It radiates so much positivity. The rooms are nice and comfortable and the food is just delicious. The course gives you a basic idea about Buddhism and meditation. Very well taught by the western nuns and Tibetan monks. The whole course was structured very well, combining meditation sessions and teachings with breaks in between. Would definitely recommend this course to everybody."
        }, 
        {
            "index": 242, 
            "rating": "5", 
            "review": "Majestic place to visit or stay. Took a tour through Nepal and India, spent our first week based here. Hard to describe how peaceful, kind and awesome this please was ...views where fantastic, rooms where basic and the the food was whole-sum just a lovely place to unwind and a great place to bed down after the hustle and bustle of Kathmandu ..will be back"
        }, 
        {
            "index": 243, 
            "rating": "5", 
            "review": "Beautiful place, lots to learn there. I took a week long introductory Buddhism course at Kopan. The facilities are lovely, beautiful views, lots of cool birds, pretty sculptures, delicious food. The course was also very well taught and interesting, though a lot more conservative and religious than I expected. In the end I think it was good for me to get an overview of Tibetan Buddhism as a religion and I can now integrate the pieces that are valuable for me into my philosophy. I would recommend others to take this course but to be prepared that they really present the whole Buddhist worldview as entirely literal, and it doesn't always fit with a western scientific worldview. It was really interesting though and I enjoyed discussions with the other course participants."
        }, 
        {
            "index": 244, 
            "rating": "4", 
            "review": "Came to try. We came (friends) for staying here for a while. Yes, it's nice. Good library, as well. Shanti place to spend some days)"
        }, 
        {
            "index": 245, 
            "rating": "5", 
            "review": "Most beautiful experience of my life!!!. I went for the 7 day intro to buddhism course which is offered several times a year, and had no idea what to expect. As soon as I reached there, there was such a peaceful, calm and positive atmosphere, that I knew this place was something special. The course itself gives a clear overview of all the major concepts in buddhist philosophy.The other participants in the group were amazing. We had people from 20 different countries representing all 6 continents. The sheer diversity made the course so much more rich.The rooms were better than that in the Hilton! We stayed in the Tsongyi house which had a lavish bedroom, bathroom, hall cum kitchen. So clean and so nice. The food there is to die for! So yummmy! They had everything - pizza, pastas, chinese, tibetan, american, burgers. sandwiches, all indian items. And it's so cheap too! Can go there just to eat again haha.The 4 teachers teaching the course were all amazing. I thank them from all my heart for the teahcing and fun we had during the teachings. The tibetan lama especially made the learning so much fun. He would laugh and laugh and make us all laugh during the course.The entire community of monks who live there are so nice. There are monks of all ages - from 2 year olds to 70 year olds. They are so kind and have such a good humour. The library is amazing! Has soo many books and the librarian is the most kind one you'll ever meet. The views from the monastery are breathtaking. It's on top of a hill and you can see the valley below 360 degrees. The best part - the monastry has 5 dogs who are the most peaceful loving and cute dogs ive met (they never bark and never bite so don't worry about that) and one of the dogs would keep coming into our gompa (the place where we would study), sit on of the cushions right in the middle of all of us and listen to the entire teachings and meditiations!!! Imagine that! Everytime the teaching sessions would start he would come in and take a seat! Wow so amazing!If you want to change your life or need a 'mind spa' or want to refresh your soul or just want to get away and find yourself again there is no better place than this. Needless to say I will be going back there many times again!"
        }, 
        {
            "index": 246, 
            "rating": "4", 
            "review": "Buddhist Institution. The monastery is a Buddhist teaching center and also offers the course of meditation. If you want to receive the course of Buddhist teaching then you attain. As far i know it is the only one offer the such course."
        }, 
        {
            "index": 247, 
            "rating": "4", 
            "review": "Calm haven, stunning views. We took a taxi up to Kopan from Thamel - inexpensive and an interesting drive with some 'goat track' roads up the mountain - and the driver was happy to wait while we did our visit. The Monastery and the surrounding compound are beautiful and well worth a visit - there are lovely walks around well kept gardens and the atmosphere is one of calm and serenity. The monastery offers Budddhist retreats and programs, a bookshop, a cafeteria. You must stay away from the areas where people are on retreat. There is a local restaurant nearby as well. The views from the Monastery compound are stunning and beautiful - 360 views. I'd love to come and stay here for a retreat sometime. Driving back you can make a stop at Kopan Nunnery - this is also a great spot where Buddhist nuns are schooled and trained from as young as 6 years. The compound and temples here are lovely and the nuns hand-make incense from Himalayan flowers for purchase. They keep the big gate of the nunnery shut - so you may think it's closed, but just knock on the side door and you will be welcomed in (they open the gates for your taxi driver to park). Lots to look at, experience and learn at Kopan"
        }, 
        {
            "index": 248, 
            "rating": "5", 
            "review": "Piece!!!!!. Stayed in Kopan not just for a visit but as a guest for a couple of days. For a Monastery, accommodation is quite fair. Beautiful views of Kathmandu and an Oasis out of city's dust and noise. Follow the monks routine and get plenty of time to reflect about life's meanings."
        }, 
        {
            "index": 249, 
            "rating": "3", 
            "review": "Beautiful gardens in a serene setting. Some interesting and colourful paintings on the front of some of the buildings, but the treat lies at the back with the lovely gardens and a few incredibly ornate stupas. Also, an interesting rock garden with miniature bronze figures depicting the key points in the life of the Buddha. A pleasant enough walk away from Bodnath. Come here first and then head to Bodnath for early late afternoon(4pm). Could also be combined with a visit beforehand to Gokarna Mahadev Temple."
        }, 
        {
            "index": 250, 
            "rating": "5", 
            "review": "A great place for a retreat. It is very organized and comfortable. You can receive Tibetan Buddhism' teachings and do meditations. It is clean, the food is plentiful and vegetarian, the water is filtered and boiled"
        }, 
        {
            "index": 251, 
            "rating": "4", 
            "review": "great view. interesting trip up to Kopan, very steep road,unfortunately the monastry was closed due to classes when i was there, but it was still worth the trip,as there really is a great view"
        }, 
        {
            "index": 252, 
            "rating": "5", 
            "review": "Beautiful, serene place. So happy I made it there. Got there in time to see the monks having their debate. It is not a big place but worth visiting, with lovely views"
        }, 
        {
            "index": 253, 
            "rating": "5", 
            "review": "Very nice. Kopan is very nice monastery. this is little bit far from kathmandu. I wll take Taxi and visit lot of monks"
        }, 
        {
            "index": 254, 
            "rating": "5", 
            "review": "Awesome. Kopan Monastery had its beginnings in the Solu-khumbu region of the Himalayan mountains. In 1971 Lama Zopa Rinpoche, the reincarnation of the Lawudo Lama, a yogi of the tiny hamlet of Lawudo, fulfilled the promise of the previous Lawudo Lama to start a monastic school for the local children. The school was called called it Mount Everest Center. Twenty five monks moved down from the mountain to Kopan in 1971 - prompted by the harsh climate at an altitude of 4000 am, which made study barely possible in winter.Now Kopan is a thriving monastery of 360 monks, mainly from Nepal and Tibet, and a spiritual oasis for hundreds of visitors yearly from around the world. Nearby is Khachoe Ghakyil Ling Nunnery, home to 380 nuns. Both the monastery and the nunnery are under the spiritual guidance of Lama Zopa Rinpoche, and the care of the abbot, Khen Rinpoche Geshe Lhundrup Rigsel. And it is the wellspring of the FPMT, a network of some 140 centers and activities world-wide, themselves expressions of the Buddha activity of Lama Thubten Yeshe and Lama Zopa Rinpoche"
        }, 
        {
            "index": 255, 
            "rating": "5", 
            "review": "Just be sure it is open to the public. This is a gorgeous spot on a high spot in KTM. Just check ahead to be certain they are accepting day visitors. When a program is in session they may turn visitors away at the gate. If you need some cleaner air, this is a good idea. If you are Buddhist, it's excellent because you'll feel right at home with all the statues and meditation practices."
        }, 
        {
            "index": 256, 
            "rating": "5", 
            "review": "beautiful. Beautiful atmosphere, set high on the hill overlooking Bouddanath Kathmandu, with a great view of the Stupa (the oldest in Nepal, truly a sight you don't want to miss. Peaceful obviously but also entertaining as the monks are lovely to spend time with in the small cafe.Lots of opportunities for courses and retreats for all levels.Lama Zopa Rinpoche has recently had a new stupa erected in memory of the great Lama Llundrup, again beautiful."
        }, 
        {
            "index": 257, 
            "rating": "4", 
            "review": "Lovely. I enjoyed the peace and quiet here away from the bustle of KTM. Its a lovely monastery set in the hills. The garden around it is beautiful. A quiet place to sit and contemplate life"
        }, 
        {
            "index": 258, 
            "rating": "5", 
            "review": "Good view of the valley. The road up to the monastery is worth all the bumps and swerves when you get there. The day we went there was a ceremony in progress with the main monk being a woman. Not sure what it was all about but there were lots of bowls of food on a table which other monks were handing to her, could have been a blessing for the harvest. I will never know. The monastery is right on top of a hill with a lovely view over the Kathmandu valley, The gardens are lovely and there are two stupas which are decorated and colourful. People can go there to a retreat so there are places you cannot go but it was great to witness a working monastery and hear the young monks chanting prior to their having lunch. Missed out on going to the bookshop though as the whole place closes for lunch. If you get a chance to go, make sure you do it."
        }, 
        {
            "index": 259, 
            "rating": "5", 
            "review": "peaceful and beautiful. if you are interested in tibetan buddhism and want to get away from chaotic kathmandu, visit Kopan. You can go for a day visit or even stay for a few days if they don't have a course going on and have rooms available . You get to see and feel their daily life, talk to the monks, watch the little ones playing around. The gompa is beautiful as well as the gardens. Sit for a while and you'll feel their compassion and peace all over. If possible call before, sometimes entrance is not allowed , so you don't go all the way to find out you can't get in"
        }, 
        {
            "index": 260, 
            "rating": "5", 
            "review": "A very peace full place.. Decorated with the tibetan artistic monasteries, this place is very silent and very peaceful. this place is not far from the boudhanath stupa. i should say this place is a must go place."
        }, 
        {
            "index": 261, 
            "rating": "5", 
            "review": "Oasis of beauty. One of the most pleasant visit we did in Kathmandu was the Kopan Monastery, with its breathtaking and well maintained gardens.This Tibetan Monastery offers yummy vegetarians meals and the friendly staff makes the visit even more agreeable. It is the best getaway from the busy and polluted Kathmandu.Don't miss the spectacular views from the top of the hill, where the Monastery is placed, over the Kathmandu Valley. Only for this is worth the visit."
        }, 
        {
            "index": 262, 
            "rating": "5", 
            "review": "Like an Oasis. In the midst of the hubbub of Kathmandu.. Kopan is a wonderful break from the cars and motorcycles and pollution. Like stepping a world away! Beautiful grounds, nice people.. would love to do an extended visit here!"
        }, 
        {
            "index": 263, 
            "rating": "5", 
            "review": "Fascinating. The Kopan Monestary is at the northern end of the city on top of a hill. It is an oasis of beauty and contemplation and is very tourist friendly. In addition to the magnificent temples and their treasures there is a lovely garden and a cafeteria. If you walk further up the hill from the Kopan Monestary there is a new monestary atop the next hill that is quite magnificent and also very friendly. They are in the process of recruiting monks so it is fairly emplty. I had a great discussion with the administrator and was invited for lunch which was a basic and tasty Nepalese vegetarian meal. Well worth the visit."
        }, 
        {
            "index": 264, 
            "rating": "5", 
            "review": "A slice of heaven. This monastery is located on top of a hill and is beautiful and peaceful and above the city pollution. Highly recommend the meditation courses"
        }, 
        {
            "index": 265, 
            "rating": "4", 
            "review": "Away from the crowd, peaceful !!. Kapan is a bit away from Kathmandu valley but its good to spend some time at such a peaceful monastery. it feels really got blessed from monks and the statues of Buddha around. Quite and peace calms heart there."
        }, 
        {
            "index": 266, 
            "rating": "4", 
            "review": "A Pleasant Visit. Kopan monastery did not want to let us in, but my tour guide spoke to the guards, then the monks, and they let us in. They had people on a retreat and did not want us to bother them. Nevertheless, they allowed us in to visit the grounds and gardens. A pleasant visit if you can get in."
        }, 
        {
            "index": 267, 
            "rating": "5", 
            "review": "a short break in heaven. Everything is just peaceful and calm. It is a great place to relax and find inner peace.They have a huge library where you can learn more about buddhism"
        }, 
        {
            "index": 268, 
            "rating": "3", 
            "review": "nice hike. if you are for a bit of walking the city, its a lovely afternoon tour. if you are lucky at 4 or 5 you can join prayers"
        }, 
        {
            "index": 269, 
            "rating": "5", 
            "review": "Monastery in the Hills. Kopan is fabulous. We visited for the inauguration of the new Stupa. It seems that at Kopan they are experts at making Stupas - each one is more detailed and more beautiful than the last. Lama Zopa Rinpoche was also there so that was a great blessing."
        }, 
        {
            "index": 270, 
            "rating": "4", 
            "review": "Amazing !. Peaceful, breathtaking, clean - well kept - just amazing! I've been to Kopan twice with friends to worship and to see the place that I had heard so much about. It is a huge monastery, steeped in history. Apparently, one can book and come for meditation retreats - it is just a lovely place on top of a hill - I loved it!"
        }, 
        {
            "index": 271, 
            "rating": "3", 
            "review": "My suggestion: do not bother visiting the place – there is a high chance they will not let you in.. Took us about an hour to walk there.When we knocked on the door we were told “no visitors”. When we were almost leaving we saw same guy letting other people in.After some negotiating we also got in.My suggestion: do not bother visiting the place – there is a high chance they will not let you in.Leave the place to monks and people attending the retreats/courses."
        }, 
        {
            "index": 272, 
            "rating": "5", 
            "review": "courses meditations etc. my friend went here and highly recommended it! I did same course in india at thushita but this is the place 2 be.Lots of surrounding temples and monestarys and defo worth a walk up."
        }, 
        {
            "index": 273, 
            "rating": "4", 
            "review": "Simple, serene, and healthy!. Kopan Monastary is quiet and serene. I came with a large group and we enjoyed a set menu of Salad, Dalbat, and a tasty lemon pie. The staff was friendly! After eating there I made a reservation to stay there a few weeks later as I was so impressed by the serenity/atmosphere in contrast with the sometimes-hectic Kathmandu. Thank you!"
        }, 
        {
            "index": 274, 
            "rating": "4", 
            "review": "Go for the clean air if nothing else.... No idea what it's like on most days, but we saw hundreds of nuns and monks all looking splendid in their saffron robes. Not really much to see or do - it's more a place to observe."
        }, 
        {
            "index": 275, 
            "rating": "5", 
            "review": "Escape for a while. A super place to escape the noise and bustle of the city. Beautifully maintained gardens and a magical atmosphere. Monks manning reception and shop spoke very big standard of English. Shop a nice place to browse without getting hassled. Quite hard to find so might be worth taking a taxi there the first time. I walked and it took three attempts to find it!! Also quite a longish walk there from Boudha so if you've got dodgy knees etc a taxi would be the best way forward"
        }, 
        {
            "index": 276, 
            "rating": "5", 
            "review": "Support Kopan!. amazing to visit, so wonderful to see Tibetan culture in full bloom in Nepal. The new buildings are sensational make sure you tour the new gompa"
        }, 
        {
            "index": 277, 
            "rating": "4", 
            "review": "nice lil get away from Kathmandu's turmoil. it could be a half day trip to get away from Kathmandu's turmoil or you can even stay there and take a simple room and learn about meditation and Buddhism. It offers a view into Monastery life style and also good views down to Kathmandu (if the smog allows) its beautifully located on a Hilltop just outside of Kathmandu.It has a lil souvenir shop and a simple restaurant that offers typical Nepali and Tibetan dishes for almost no money. Its in walking distance from Boudha (Tibetan Quarter) maybe about 30-40min"
        }, 
        {
            "index": 278, 
            "rating": "5", 
            "review": "Karma-rama!. Completed 3 courses here and would go back at the drop of a Karmic seed.......Everyone who has made Kopan what it is today should be congratulated."
        }, 
        {
            "index": 279, 
            "rating": "3", 
            "review": "Bit disappointed as was shut and wouldn't let us in despite walking with kids...;. Check the website to opening times and special closures. They wouldn't let us in despite walking up a massive hill with kids as young as 5 years. However they did let the expensive western tourists who had parked their tourism bus at the gate and the driver was waiting for them!"
        }, 
        {
            "index": 280, 
            "rating": "5", 
            "review": "Beautiful hilltop monastery. Gorgeous Tibetan Buddhist monastery on top of a hill. Excellent cafe and an extensive bookstore that sells anything and everything buddhist related at very very reasonable prices. The monk who was in the till was extra helpful too. Wonderful views too."
        }, 
        {
            "index": 281, 
            "rating": "5", 
            "review": "Kopan Monastery: a great place to be introduced to Tibetan Buddhism. I took a week long meditation course at Kopan. My experience was wonderful, comfortable accomodation, English language instruction, good food, and insights into the nature of things. I highly recommend this experience to everyone..."
        }, 
        {
            "index": 282, 
            "rating": "4", 
            "review": "Buddhist Monastery. Go and listen to the monks chanting in the evening about 6.30pm. The garden in the monastery is also very beautiful."
        }, 
        {
            "index": 283, 
            "rating": "5", 
            "review": "Stunning place. I stayed at Kopan already twice for ca. 7 weeks in total and just loved it. It's a perfect place for mediation and soul searching ad cor meeting ineresting people from all over the world. The setting on the hill with the view overlooking the Kathmandu valley is breathtaking. It's very unique experience to stay with the monks and attend the pujas or just watch them discussing. The vegetarian food is fantastic, I got totally addicted to the home made peanut butter. I very much recommend this place and I hope I can be back there very soon."
        }, 
        {
            "index": 284, 
            "rating": "5", 
            "review": "Tranquil oasis. A beautiful peaceful place to take a break from busy Kathmandu, stroll the grounds, enjoy the beautiful clean surroundings and meditate. Foreigners are welcome by the Tibetan Buddhist monks."
        }, 
        {
            "index": 285, 
            "rating": "5", 
            "review": "bliss. Having an opportunity to spend time with the monks of Kopan Monastery is an experience not to be missed while in Kathmandu."
        }, 
        {
            "index": 286, 
            "rating": "2", 
            "review": "Disappointing. Originally planned to stay at Kopan, but was cancelled in favour of a larger group booking.Went by taxi anyway and found it closed.Tip ... Difficult to get taxi back to centre, so maybe ask taxi to wait"
        }, 
        {
            "index": 287, 
            "rating": "5", 
            "review": "Not to be missed!. A peaceful retreat set in the most wonderful of backdrops. See how this monastry works day to day whilst taking in the panoramic veiws of Kathmandu!"
        }, 
        {
            "index": 288, 
            "rating": "5", 
            "review": "Good Place for retreat. Clean rooms at reasonable price. Good place for any visitors who wish to have a better understanding in Buddhism"
        }, 
        {
            "index": 289, 
            "rating": "5", 
            "review": "Tibetan Buddhist Monastery in the Gelug tradition. Kopan is on a hill overlooking the Kathmandu Valley. It is a working monastery, meaning the monks there are either being taught or are teaching Tibetan Buddhism. It is also a learning center for westerners and every November there is a month long course that has become very popular. There are also other programs thru out the year. A short walk down the hill from Kopan , is the nunnery that is also a part of Kopan. At the moment the nunnery is building a much needed larger Gompa and new housing for the nuns. I have attended 5 Nov. courses in the past 10 years and can recommend them highly if you are interested in deepening your understanding of Tibetan Buddhism from the Gelug perspective."
        }, 
        {
            "index": 290, 
            "rating": "4", 
            "review": "monestery should visit. it is nice place to see and good place to learn about Buddhism and recommended to visit-the area is peace and the monks are friendly and always happy to share the things around-"
        }, 
        {
            "index": 291, 
            "rating": "3", 
            "review": "Looks Gud. Had heard many things but, had average experience. We hiked down to top. was good from outside but couldn't enter as they were having some rituals."
        }, 
        {
            "index": 292, 
            "rating": "4", 
            "review": "A quiet oasis. Kopan is a working monastery. 400 young monks live and study here. Guest rooms are available for occasional visitors, but this isn't a tourist sight. The monks are friendly and kind; food is tasty and plentiful; accommodations are more than adequate, but certainly not luxurious. If you are looking for a bit of quiet and a chance to observe or participate in the life of a Buddhist monastery, this is your place."
        }, 
        {
            "index": 293, 
            "rating": "5", 
            "review": "Dumb to review this but.... How do you review a monastery? But suffice to say, the experience there is wonderful, seemingly even for the trekkers who ambled in more for inexpensive food and lodging than the monastic sensibility. For those interested in Buddhist life, there it is, open and non-judgemental."
        }, 
        {
            "index": 294, 
            "rating": "4", 
            "review": "Nice walk from Bouddha Stupa. Well worth to go and have a look around, then also walk from there around to Pullahari Gompa, which is maybe 30 mins.It is a nice walk from the Stupa out to the hills, and you will get some good views of the Kathmandu Valley, and see some of the villagers along the way. It is a bit easy to get lost the first time though.Once at the monastery, there is a ncie ambience, and lovely grounds, all very peaceful, with great views. There is an excellent Buddhist Bookstore, with a huge range of dharma books. The cafe is quite nice too, with good views and reasonably priced food. Walking out here and then around to Pullahari Gompa, and back to the Stupa would be a very lovely way to spend a day if the weather is nice."
        }, 
        {
            "index": 295, 
            "rating": "5", 
            "review": "best place of Nepal. This meditation centre offers courses on Buddhism and quiet places for personal retreat. They have a web site where one can check the times of the retreats. It takes around 1 hour to get there from Bodha, if you like to walk."
        }, 
        {
            "index": 296, 
            "rating": "5", 
            "review": "Not the last time!. I was participating the 1-month course last year and it was truly a worthwhile experience! If you have the chance to take a course, go for it!"
        }, 
        {
            "index": 297, 
            "rating": "5", 
            "review": "Great visit. This meditation centre offers courses on Buddhism and quiet places for personal retreat. They have a web site where one can check the times of the retreats. It takes around 1 hour to get there from Bodha, if you like to walk."
        }, 
        {
            "index": 298, 
            "rating": "4", 
            "review": "Kopan Monastery is a Tibetan Buddhist monastery near Boudhanath.. Kopan Monastery is a Tibetan Buddhist monastery near Boudhanath.Kopan has become especially famous for teaching Buddhism to visiting Western foreigners.In recent days, Kopan Monastery has also established itself as a popular recreational destination for Kathmandu residents and local tourists as well. The weekend holiday of Saturday receives quite a visit from hundreds of families and individuals to the beautifully decorated hillock and its gardens. The monastery is not open to public on other days."
        }, 
        {
            "index": 299, 
            "rating": "2", 
            "review": "disappointed. closed for meditation course... only found out when we tried to visit. The man at the gate told us he could not speak English and could only say no entrance... as a buddhist it was disappointing"
        }, 
        {
            "index": 300, 
            "rating": "5", 
            "review": "heaven in the mountains. this is truly a peaceful, blissful place. they have courses on Buddhist meditation and such - if that's not your cup of tea (yet), at least do go up there and enjoy the amazingly spiritual environment. the spiritual energy that emanate from every corner of this amazing monastery seem to take away your worries and leave you with a sense of happiness. this truly is a respite from the maddening environment of Kathmandu. Oh do pop by the cafeteria - food's fantastic and extremely affordable!"
        }, 
        {
            "index": 301, 
            "rating": "5", 
            "review": "Buddist monks knows places for meditation. This is wonderful place for meditation, studing, listening and seen around. Beautiul statues and temple gompa, fresks on walls...and feeling something like freedom"
        }, 
        {
            "index": 302, 
            "rating": "3", 
            "review": "not sure.... this is a monastery, a place where people live and study... it felt intrusive to be there, just the entrance is closed enough to second guess if we should even go... yes the view was amazing from the gompa, but i think there are numerous other more adequate places for tourists to see before this one, and leave the monks alone."
        }, 
        {
            "index": 303, 
            "rating": "4", 
            "review": "Kopan is Peace. After enjoying the serenity if Kopan take the walk downhill to Bodnath Stupa. Its a pleasant way to spend time between sighs."
        }, 
        {
            "index": 304, 
            "rating": "4", 
            "review": "Good exercise walking up there and a beautiful setting. The views are fab, it's peaceful and well-maintained. If you're fed up with the overly-touristy attractions in town, get along here."
        }, 
        {
            "index": 305, 
            "rating": "5", 
            "review": "My beautiful spiritual home. Stayed 14 days in October 2012. 10 days included my participation in Meditation & Retreat Course. Kopan is superb value and a stunningly beautiful and serene spot on the planet. Situated on a small mountain top just outside Kathmandu with views of the city, the valley and the mountains, its not difficult to be taken in by its beauty and fall in love with Kopan, I found. The calm and beauty of early morning sun rises is life long lasting memories. The unfolding buddhist life from the hundreds of monks is ever present. My board was in single room with shared bathroom fascilities. Sparse but clean and nothing was I missing. Three generous and surprisingly good meals per day plus tea and fresh, drinkable water. The Course was nothing short of world class with teachers knowing their stuff, schedules kept with punctuality on start & finish, good study material and a fantastic library. All monks in shops, reception, library speak very impressive English. In total I paid USD 137.00 all inclusive for my 14 days at Kopan - the best money I have spend in 35 years of travelling in more than 100 countries. I have promised myself to return within one year and I will do my best to keep that promise. Kopan is heaven down here."
        }, 
        {
            "index": 306, 
            "rating": "5", 
            "review": "Retreat from the chaos of Kathmabndu. Great place to visit, and to sit in the quiet temple and meditate. The grounds are on a hill, overlooking Kathmandu Valley, and young monks may be playing. Inside We appreciated the quiet beauty of the temple, and the best change in days to enjoy the quiet within."
        }, 
        {
            "index": 307, 
            "rating": "5", 
            "review": "Fantastic!. so spiritual, so beautiful! but it's too different to the rest of the country: so rich, so clean...another world"
        }, 
        {
            "index": 308, 
            "rating": "5", 
            "review": "peaceful break from kathmandu. A great place to go to at the end of your trip as it is calm and peaceful and a great way encapture the end of your trip. great views of Kathmandu as well."
        }, 
        {
            "index": 309, 
            "rating": "5", 
            "review": "Serene and peaceful. Its convenient and saves time when you visit Pashupatinath temple, Bodhnath and then Kopan. Its on the same route. Kopan is on a hillock, like other buddhist monastry but very spacious, quiet, clean and has a divine feel. Must see for people who loves quiet and divine places. Further the view of Kathmandu from the top is breath taking."
        }, 
        {
            "index": 310, 
            "rating": "5", 
            "review": "Kopan. Just love this place - Peace quiet divinely inspiring A beautiful place to meditate and relax Do yourself a favour VISIT "
        }, 
        {
            "index": 311, 
            "rating": "5", 
            "review": "mostly for Buddhists. if you are looking for a mediation course etc this is the place. also very nice to visit for a day out on Saturday. there is a scenic back way to get here by motorbike from Ganesh chowk near Hattigauda. it takes around 30 mins on a bike."
        }, 
        {
            "index": 312, 
            "rating": "5", 
            "review": "When we will go there then we don't like to come out. I don't have any dislike .But i have many like things because this monastery is totally related to like heaven"
        }, 
        {
            "index": 313, 
            "rating": "5", 
            "review": "Peace from the noise of the city. I went to Kopan with my little daughter to get some peace from the noise and the dirt of the city. I had heard from many people that had visited meditation courses offered at Kopan about the beauty of the place. The actual main monastery hall is impressive with a giant golden buddha figure inside it. Even more impressive I found the well kept garden behind the main building. It is very well kept and a perfect place to relax with your children. The air is fresh and the view over the Kathmandu valley is beautiful!There is a restaurant which offers average food and a small shop for snacks."
        }, 
        {
            "index": 314, 
            "rating": "5", 
            "review": "breath taking view. top of Kathmandu over looking the whole city , you can see a lot of monkeys who would steal your drink so watch out :) but have fun its so nice"
        }, 
        {
            "index": 315, 
            "rating": "5", 
            "review": "Nice relaxing place to get nice views of the valley. There is a flat grassy spot to sit and look out over the valley behind the main gompa. They also have a nice gift shop and library you can visit. The beginner buddhism courses offered in the spring/summer are very popular."
        }, 
        {
            "index": 316, 
            "rating": "5", 
            "review": "Very interesting experience. If you go there, be sure to have a guide who can explain you the depth of Tibetan Buddhism and its very interesting symbolism. We were there for a short visit and join a meditation hour, it was very interesting experience."
        }, 
        {
            "index": 317, 
            "rating": "5", 
            "review": "An amazing place to heal your soul. I stayed at Kopan for three of their buddhist courses and I loved it. The people there are very special, you can feel the peace that surrounds the whole monastery.There are guesthouses for every budget, from dormitory to very nice double shared rooms with private bath and shower.The monks and nuns at Kopan are very friendly and are very happy to help you with any problem you may encounter.The food served at Kopan is vegetarian."
        }, 
        {
            "index": 318, 
            "rating": "4", 
            "review": "UMMMMMMMM!. Get there early about 10.00am as to not miss the meditation. My group did but the scenery of the gardens and monastery was certainly worth the trip. Watch out for the cool young monks!"
        }, 
        {
            "index": 319, 
            "rating": "4", 
            "review": "Very interesting, lovely people. I visited the Monastery while I visited Nepal with World Challenge, a youth expedition group, and it was the essence of serene. I didn't go in Peak season, so it could be a lot busier then, but visiting the Buddhist culture was an exceptional experience and I will always remember it. I do prompt people to go and visit because it is worth it, if not only just to meet the monks and see their ways of life but, for the panoramic views of the Kathmandu Valley. Oh and I recommend that you make a donation, purely out of respect."
        }, 
        {
            "index": 320, 
            "rating": "5", 
            "review": "Peaceful and relaxing.. After quite a hike you come to Kopan Monastery and its well worth the effort. A beautiful gated community with lovely grounds. Great book /gift shop. (it closes at lunchtime). Cafe - fine. The Monastery is beautiful, peaceful and of course very spiritual.Not to be missed.NB there is probably a bus up there if trekking up hill is not your thing."
        }, 
        {
            "index": 321, 
            "rating": "5", 
            "review": "peace... peaceful place.. anyone welcome and u can enjoy the view from the monastery as well. beautiful monastery and the interior is also very amazing.."
        }, 
        {
            "index": 322, 
            "rating": "4", 
            "review": "Very beautiful and peaceful place!. When you are in Kathmandu, give a try to this place to give peace and rest to your mind. It's no doubt one of the best sites to visit in Kathmandu. It's truly natural, peaceful, beautiful place and a visit to this place will never disappoint you. If Buddhist values makes you interested to then you are more likely to love this place!Enjoy!"
        }, 
        {
            "index": 323, 
            "rating": "5", 
            "review": "Truly out of the fray. Its beautiful, serene, free, and no one bothers you. It is a gem in Kathmandu - hope they can keep it this way with the constant encroachment of houses! Not on most people's visit schedule, but go if you can, you will NOT be disappointed."
        }, 
        {
            "index": 324, 
            "rating": "5", 
            "review": "A special place where wishes come true =)). I was in pain and aggravation over loss of loved one when I came to Nepal to be a nun having studied Tibetan Buddhism under the guidance of Geshe Dakpa Topgyal in Charleston, SC. When I came to the monastery I was taken in by the environment, the prayers and the chanting, the silent meditation, the opening of my third eye and heart chakra. It all came together when a few days into my retreat I met my twin soul who became and inspiration and object of passionate and overwhelming love, as well as suffering. It is ironic and it made me paint, and author two books of my encounter, named Spiritual Book of the Year 2011, The Soul Trek and the follow-up, The Soul Trek II. I salute to Kopan....and Ani Jen :)) Tashi Targiye. Djana Fahryevawww.thesoultrek.com"
        }, 
        {
            "index": 325, 
            "rating": "5", 
            "review": "It is very nice location and management of monastery is very good.. I like it because of the clean and quit, The monks chanting in morning and pooja ceremony in the evening and teaching about Buddhism to peace and love, re-incarnation is imaging."
        }, 
        {
            "index": 326, 
            "rating": "5", 
            "review": "Kopan is a must. Visiting Kopan monastery is a must for any traveler passing through Kathmandu. The gompa, statues, prayer wheels, stupas and views from the monastary walls are excellent. If you're interested in Buddhism, they have a great bookstore and a host of courses appealing to beginners and experienced practitioners. Before you leave grab some icecream at the cafe. Supposedly it's the best in KTM!"
        }, 
        {
            "index": 327, 
            "rating": "4", 
            "review": "A great Monastry. Kopan is a thriving monastery of 360 monks, mainly from Nepal and Tibet, and a spiritual oasis for hundreds of visitors yearly from around the world. Nearby is Khachoe Ghakyil Ling Nunnery, home to 380 nuns. Both the monastery and the nunnery are under the spiritual guidance of Lama Zopa Rinpoche, and the care of the abbot, Khen Rinpoche Geshe Lhundrup Rigsel. And it is the wellspring of the FPMT, a network of some 140 centers and activities world-wide, themselves expressions of the Buddha activity of Lama Thubten Yeshe and Lama Zopa Rinpoche."
        }, 
        {
            "index": 328, 
            "rating": "3", 
            "review": "Boring. A bit far out of the way. And nothing much to see. I am not into religious stuff, at least the stupa had people around giving it some life. Here i felt kind of silly walking around. The cafe there was good though."
        }, 
        {
            "index": 329, 
            "rating": "5", 
            "review": "A paradise on earthe. If you are believe on a philosophy of Buddhist then there is no any other place you will find in this planet other than Kopan Monastery. This monastery is located about 20 minutes drive from Tribhuban international airport and 40 minutes drive from Touristy hub Thamel. In this monastery you can do lots of thing like meditation, yoga, learning way of life etc. Compare to other hotel in Bauddha or Thamel this could be the best for you to stay for unlimited time with a fair price."
        }, 
        {
            "index": 330, 
            "rating": "5", 
            "review": "best place in Nepal. having been so many times at Kopan and every time enjoying the special energy, the beautiful place, the nice people. would be so good to have more places like this all over the world - there would be more peace and harmony!"
        }, 
        {
            "index": 331, 
            "rating": "5", 
            "review": "The best religious site in Kathmandu. As long as you have the legs to manage the stairs, then this is the best place to visit in Kathmandu. You are unlikely to be hastled by locals wanting to guide you, its very scenic and you get a view of the whole city.Not to mention that you will be entertained watching monkeys steal icecreams off the tourists. Just dont buy the icecream yourself."
        }, 
        {
            "index": 332, 
            "rating": "5", 
            "review": "great experience !. I took the 10 days introduction course in 2010. and came visit there on 2011 as well.the place is beautiful, the staff and monks are very welcoming, and its a great experience to do even if you dont wish to do a whole course there. (you could also stay for few days only)the course itself was fascinating and influanced my life a lot. its less strict than vipasana or Tushita in India, for those of you who fear the \"silence\".and their food is incredible ! really challange you to practice the buddhist way of \"not getting attached\"."
        }, 
        {
            "index": 333, 
            "rating": "3", 
            "review": "No Nepalis allowed. I loved everything about this monastery - an obvious spiritual powerhouse, friendly people, fantastic views, much to see, most amazing collection of Buddhist books for sale I have seen anywhere in the world is the Kopan bookstore. Beautiful stupa and the Gumba itself is very pretty and filled with peace.Except one thing. It really bothered me that the security guard at the door will not allow Nepalis to enter. It is strictly for foreigners. Nepalis living abroad are OK, just not Nepalis living in Nepal. He said that is the official policy. We were stopped because I was with an American of Indian descent (who therefore, from appearance, could be Nepali). Upon proving foreign status we were let in. I thought he was just checking ID for everyone at this time, but on our way out, we saw that he did not ask the white tourists to prove ID, and also turned back a Nepali guy. That's when I questioned him and found out about the policy. I asked for the reason and he said that Nepalis can make the place dirty. It pains me to write this about this amazing place, but I hope they can work out a better policy after seeing this review. The current policy is not moral, IMO. The toilets could also be cleaner, but that's nothing compared to the point raised above."
        }, 
        {
            "index": 334, 
            "rating": "5", 
            "review": "I just love tibetan buddhist monks!. The monastery is very a very peaceful oasis surrounded by the crazy frenetic energy of Kathmandu. I was so happy that a very nice monk was patient enough with me in the bookstore to reccomend to me some important reading that will I hope help me to become a better buddhist! No matter what you belief system is though, I think you will enjoy the monastery!"
        }, 
        {
            "index": 335, 
            "rating": "4", 
            "review": "Highly recommend the 10 day course. I have just finished a 10 day course at Kopan and it was an incredible experience. The schedule was pretty packed - from 6am to 9pm most days, with a break in the middle of the day, but I didn't find it was too much. The teachings were so interesting and really helped me to understand the nature of the mind, attachment and suffering. The daily group discussions were also a highlight as you get to hear the way others perceive things which really makes you think about your own perceptions. The grounds at Kopan are beautiful and it's so nice to hear the monks' chanting in the mornings and evenings. The library is really well stocked and there are so many interesting texts to read. I found the morning and evening practice of silence really calming, although unfortunately some people in the group couldn't stick to it. The food at Kopan was so much better than I expected and was different almost every day. The accommodation I had wasn't great...I was in a very hot shared room at the back of the property next to the animals with hundreds of mosquitos (which you have to take a vow not to kill) and barking dogs, so make sure you take ear plugs. To be fair though, I signed up really late to the course so I was in the most basic of the accommodation. People who signed up early were in really nice rooms with private bathrooms and even had air-con which I had to try every day not to be envious of! The only bit of constructive criticism I'd give is that since it was a beginner's course, I would have liked the teachings to be more practical and explain how to incorporate them into my daily life and thought processes. I felt it was a little too focused on achieving enlightenment, which, to people who are just learning, seems like a lofty, far off goal. Other than that, the experience was so positive I am now considering doing the one month course in November."
        }, 
        {
            "index": 336, 
            "rating": "4", 
            "review": "Great Place. Its was my first time because my mind was disturbing that way i dicided to go this place for meditation for ten days course. I really enjoy with their lovely service with minimum charge for my course many thanks i will visit this place in my next holiday in nepal."
        }, 
        {
            "index": 337, 
            "rating": "4", 
            "review": "Kopan. Amazingly beautiful... lots of walking and prayer flags everywhere. Lots to see and the landscape like most of the area can be a little rocky and steep!"
        }, 
        {
            "index": 338, 
            "rating": "5", 
            "review": "Tranquil. A lovely place of tranquillity with a beautiful Temple,gardens,cafe,shop and library.The shop is VERY cheap.The views from Kopan are breathtaking on a clear day."
        }, 
        {
            "index": 339, 
            "rating": "5", 
            "review": "the best shop in Kathmandu :). i visited Kopan just for seeing not making meditation and nothing connet with Buddism. I walk there from pasupatinath temple it's about 30minutes nice walk from there. In Kopan there's very nice garden with small stupa and what i enjoy the most ... there is very good shop with books about buddism, Nepal and most of souvenirs that you can buy on Thamel but in very reasonable prices (all products has the price on it). You can buy some CD, smell sticks and many other things. There are also about 2 shops with soft drinks, and chips and like that.There i svery nice view from there."
        }, 
        {
            "index": 340, 
            "rating": "5", 
            "review": "Beautiful peaceful monastery with great views. Kopan monastery is well worth a visit when you are around the Bodhanat stupa area. This welcoming working monastery is also used for retreats and courses on Buddhism catered to westerners. The big praying wheel is inside a room with colorful paintings. There is stupa surrounded by greenery that is an excellent place to sit down and relax. There are also extraordinary views of another monastery up in the mountain and the Bodhanat area in the valley.I recommend to take a taxi up and then walk your way down to Bodhanat (about 45 minutes walk). On the way down pay a visit to the Kopan Khachoe Ghakyil Nunnery. It houses more than 200 nuns mostly from Tibet. The nuns are very welcoming and they will offer a tour of the monastery.Always remember the donation box in the monasteries. Whatever you can spare will surely be appreciated and you will be helping a good cause."
        }, 
        {
            "index": 341, 
            "rating": "5", 
            "review": "nice hike up. Very nice and quiet monastery. Nice hike up the hill and good restaurant for a reward for your efforts."
        }, 
        {
            "index": 342, 
            "rating": "5", 
            "review": "Old and interesting Monastery. Also interesting Monastery where you can easily walk around, and spent time to walk around"
        }, 
        {
            "index": 343, 
            "rating": "5", 
            "review": "Heaven. Only around 20mins drive from central KTM but feels like a million miles away. An amazing retreat when you need a break from the hustle and bustle of Thamel. The gardens and the stupas are absolutely stunning. Never many people around, so extremely peaceful. I loved watching the novice monks chant at sunset. Holds monthly meditation retreats."
        }, 
        {
            "index": 344, 
            "rating": "3", 
            "review": "Strange archetecture. This place is strange looking but overcrowded with leper beggers."
        }, 
        {
            "index": 345, 
            "rating": "5", 
            "review": "Kogan monastery. A beautiful location overlooking the Kathmandu Valley, escape from the pollution and see the monks relaxing in the sun at lunchtime. Take a taxi up to the monastery or a long hike"
        }, 
        {
            "index": 346, 
            "rating": "5", 
            "review": "Home. I took a 10 day meditation course at Kopan Monastery, which was an excellent experience. Kopan was built for westerners who are interested in Buddhism. The monastery itself is a beautiful place with a large garden, a stupa and gompas."
        }, 
        {
            "index": 347, 
            "rating": "5", 
            "review": "Foremost place in Kathmandu for discovering buddhism. It a very beautiful and calm place out of the noisy town of Kathmandu. It is a perfect monastery for westerner to learn more about Buddhism (10-day course for beginner monthly, one month course once a year). For those who are only interested in meditation and not particularly in Buddhism, it is not the optimal place as only a minor part of the teachings is dedicated to meditation per se.Very enjoyable and blessed stay. Thank you"
        }, 
        {
            "index": 348, 
            "rating": "5", 
            "review": "such a beautiful place. i was so surprised when i reach there, big buddha stupa inside the building and was really beautiful, the people over there use to say that the monastery develop that place. a lot of buddhist use to go there."
        }, 
        {
            "index": 349, 
            "rating": "4", 
            "review": "Spirit and view. Beside the spiritual importance of the place, can have some interesting contact with monks and a nice view on the landscape"
        }, 
        {
            "index": 350, 
            "rating": "5", 
            "review": "Don't miss it!. A bit far and out of the city but worths visiting! There is a very nice library-shop that you can find so many books in english, cd's, souvenirs etc but in good quality and good prices but open on certain hours. You can also spend the night there and there is a mini market too. The temple is very beautiful with amazing colours and the gardens so well taken care of. It's better if you keep your taxi waiting for you as you can't find another one there."
        }, 
        {
            "index": 351, 
            "rating": "5", 
            "review": "An authentic Buddhist Monastery Life experience. I stayed in Kopan about 5 years ago for the famous one month Buddhist course in November. I had really an amazing experience and perhaps one day I'll go back to do the same course. I can definitely recommend this Monastery and the course to anybody who is interested in Buddhism, regardless of the level of experience with Tibetan Buddhism. There were several people that were doing the course for the second or third time.The location is magical and the energy is just marvellous. Following the course with many other foreigners interested in learning Buddhist Meditation was very inspiring and be surrounded by Buddhist monks doing their practices was just awesome. One of the highlights of my stay was to visit the Gompa early in the morning where the monks where reciting the sutras and just sit there and enjoy the vibrations. I felt like being trance.You can find more info about Kopan, pictures and videos in this link:http://path2yoga.blogspot.com/2010/04/one-month-meditation-course-in-nepal.html"
        }, 
        {
            "index": 352, 
            "rating": "4", 
            "review": "Beautiful place, hard to get in. Call ahead and figure out if you can get in on a particular day. Once you get in, it's a surreal, beautiful place. Recommended !"
        }, 
        {
            "index": 353, 
            "rating": "5", 
            "review": "Buddhist Meditation. If you are looking for into learning about buddhism and meditation this is the place located in a hilltop. Samsara Travels and Tours can include this in your itinerary."
        }, 
        {
            "index": 354, 
            "rating": "5", 
            "review": "Truly beautiful. A late afternoon stroll around Kopan Monastery brings a feeling of peace at the end of the day. A retreat for residents of Kathmandu and visitors alike, Kopan offers spaces for contemplation along with views out over the busy city that seems far away."
        }, 
        {
            "index": 355, 
            "rating": "4", 
            "review": "Nice place. Nice place with commanding views of the city with peacefull gardenBut mainly famous for its Buddist seminars and classesDis advantage can be limited to the concrete new buildings and slightly cold feeling in the main prayer hall"
        }, 
        {
            "index": 356, 
            "rating": "5", 
            "review": "My spiritual journey to Kopan Monastery. Hi! I am Cathy aged 52 from Dublin but live in Liverpool. I have just come home from a weeks retreat at Kopan Monastery. Februray 2012. Before I went I was a bit anxious about going on a retreat! It was my first one! Well I loved it so much, Kopan is the most calming peaceful place I have ever been too. And I have travelled a lot! There was 100 people on my Transforming your mind course from all around the world! Amazing! We all bonded so easy and after the first day or so we were like a family! If you want or need to heal yourself or just need to calm your mind! Well please just go to Kopan. The food is good home veggie cooking and plentyful. There is a coffee shop and a shop there too. Wear loose comfy clothing and they will do your washing for you too. The monks are amazing and the kids in the monastery are great. I took donations to them from my family and friends and they were so humble. After a week I spent a few dats sightseeing and had an amazing life changing experience! I will return one day and I want to take family and friends there too. I made lots friends and had a fablous spiritual journey that has made me think about life!!! Its the best thing I have ever done! All those fears and worries about going was a waste of energy! But I know that now! All i can say is go and find YOU! Enjoy and say a pray for me there! Blessings Love Cathy McCauley XXX"
        }, 
        {
            "index": 357, 
            "rating": "5", 
            "review": "Great view!. Very amazing, interesting and peaceful place. Great view!"
        }, 
        {
            "index": 358, 
            "rating": "5", 
            "review": "beautifull and peacefull place. Its about 10 km from Kathmandu and a little bit up the mountain.The air is fresh there and you can walk around freely and have a look in the beautifull monastery. They also have a small shop where you can buy good natural incense. The movie \" unmistaken child \" is shot here which makes the place special to me."
        }, 
        {
            "index": 359, 
            "rating": "5", 
            "review": "Great!. Lovely place! There is also a guest house here and meditation classes."
        }, 
        {
            "index": 360, 
            "rating": "5", 
            "review": "Tranquil. Iv been here twice for different courses and its a really wonderful place to either do a course or just relax and totally unwind and take time out."
        }, 
        {
            "index": 361, 
            "rating": "4", 
            "review": "Kopan is best place.. Peace and nice Place. it is better to go away from the city for relax."
        }, 
        {
            "index": 362, 
            "rating": "5", 
            "review": "Peace and Perspective. Kopan Monastery was introduced to me by a friend and I'm so thankful that it was! This is literally a sanctuary amid the chaos of Kathmandu. While I am not a practicing Buddhist, everyone is welcome here. I go to Kopan when I need to find peace and perspective."
        }, 
        {
            "index": 363, 
            "rating": "5", 
            "review": "Best Yoga!. Peaceful heaven for body and soul. This is the most famous monastry for yoga and Buddhist mantra. Great feel for your sprituel mind..."
        }, 
        {
            "index": 364, 
            "rating": "5", 
            "review": "Monastery. This place it,s very interesting and amaizing I love it, If I come back again, I going to visit one more time."
        }, 
        {
            "index": 365, 
            "rating": "4", 
            "review": "centre of peace. Close to KTm a good place to view the Kathmandu. A good place for the study of Buddhist concept."
        }, 
        {
            "index": 366, 
            "rating": "4", 
            "review": "Lama Zopa's Monastery. Great to visit, and even better if you have a venue there. Lovely view too"
        }, 
        {
            "index": 367, 
            "rating": "5", 
            "review": "Can't really describe in words how much I loved Kopan. Stayed at Kopan doing an introduction to Buddhism and Meditation course. Up there with the best times of my life. Met some amazing/inspiring people in totally beautiful and peaceful surroundings. A must."
        }, 
        {
            "index": 368, 
            "rating": "5", 
            "review": "must go. it was just awesome. so quiet felt like i was in different world."
        }, 
        {
            "index": 369, 
            "rating": "5", 
            "review": "Breathtakingly Beautiful. I wonderedup here from a friends house in the flatlands below. Visiting the monastery is like stepping into an oasis of peace and harmony. I was lucky enough to visit on a day during monsoon that was misty and drizzly but it gave the monastery a feel of another world.\nI would highly recommend visiting this wonderful landmark"
        }, 
        {
            "index": 370, 
            "rating": "4", 
            "review": "Stay for the best experience. A short visit is not enough. It is best to stay and participate in the meditations routines."
        }, 
        {
            "index": 371, 
            "rating": "4", 
            "review": "A place at a hight and with cool blowing air........ Yeah! this place is so cool........It's peaceful and pleasant.."
        }, 
        {
            "index": 372, 
            "rating": "5", 
            "review": "Go for meditation!. They do not allow you to stay less than two nights in this monastery but it was excellent stay for us. You love to be in peace and doing meditation. !"
        }, 
        {
            "index": 373, 
            "rating": "5", 
            "review": "A Special Treat To Visit. It's a little out of the normal track for tourists (but not to say you won't see some when you're there.) As well, you can walk from many places in town to get there- which is great fun (seeing parts of town that most tourists don't see, neighborhoods for instance.)Everyone there is so friendly and thoughtful. They enjoy you coming to visit, seeing the monastery where the monks are taught. It's a pretty place too, good for photos.Kind of set on the side of a hill, a little off the beaten path.Pleasant change from the Margs."
        }, 
        {
            "index": 374, 
            "rating": "5", 
            "review": "november course. Certainly one of the best expericences ever, november course also called Lam Rim Introduces westerners intensively tibetan bouddhism. The experience is surrounded by a magical athmosphere with monks practicing and learning. You can also visit the site without taking courses and can do your own retreat by renting rooms."
        }, 
        {
            "index": 375, 
            "rating": "5", 
            "review": "buddhist monastery. Lovely monastery,peaceful atmosphere and tibetan influence"
        }, 
        {
            "index": 376, 
            "rating": "5", 
            "review": "worth the very short walk. yet another unmissable place if you are in Kathmandu.All the sights are fantastic. Well kept. Easy to get to."
        }, 
        {
            "index": 377, 
            "rating": "4", 
            "review": "simply peaceful. I went to Kopan for a 10 days meditation course....and it was really impressive! the people I met.....the lectures I listened to.....the guidance for meditations...it all came to be such a precious experience. i am really grateful and glad I took few days off to understand buddhist culture a little bit more; had a chance to talk to the monks too and realize what great and simple people they are. I truly recommend taking a course over there.....spending some peaceful days far away from tourist attractions and the noise.j."
        }, 
        {
            "index": 378, 
            "rating": "4", 
            "review": "Serene. Awesome views, interesting to walk around the grounds. Serene, for sure, but then, it is a Buddhist Monastery!"
        }, 
        {
            "index": 379, 
            "rating": "5", 
            "review": "Beautiful Monastary. Great views and a must see. Was taken by a local and had a private tour. Check to see visiting hours."
        }, 
        {
            "index": 380, 
            "rating": "5", 
            "review": "The most beautiful gompa I have ever seen. I was at Kopan for one day to attend the enthronement of the new Abbott, Khen Rinpoche. The monastery is a fabulous burst of color, and you feel the energy and spirit so strongly when you approach the gompa. A must visit, if they are not closed for their courses."
        }, 
        {
            "index": 381, 
            "rating": "5", 
            "review": "amazing night. I went there with my friend Choying Drolma, they were ready for a ceremony to celebrate and bless the new year. Many local tibetans there, you can feel the culture strongly."
        }, 
        {
            "index": 382, 
            "rating": "5", 
            "review": "A place to visit and medit. On a hill somewhere in Kathmandu. Nice place to overlook the city, beautifull gardens to walk around, take your time, medit. Book shop, good restaurant and really inexpensive."
        }
    ]
}