{
    "category": "Kathmandu", 
    "entity": "Hanuman-Dhoka", 
    "avg_rating_stars": 4.412955465587045, 
    "review_count": 247, 
    "rating_stats": {
        "poor": 1, 
        "average": 26, 
        "terrible": 4, 
        "very_good": 74, 
        "excellent": 142
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "Durbar Square. Hanuman Dhoka is a palace of Malla Kings and the Shah dynasty. The name is given after the stone sculpture of the Hanuman. Hanuman is a hindu monkey god which sits near the entrance of the palace. The museum inside the Hanuman Dhoka exhibits the ornaments, furnitures, coins collections, weapons, armors etc in the display of the museum."
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "the historical Dokha. it is a historical dokha which included a lot of temple amazing architecture and beautiful location, it just loved it"
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "Nice Place to visit. Nice Place to visit during Kathmandu tour. Symbol of Rich Culture and Heritage. Little Crowdy area , but still loved this place."
        }, 
        {
            "index": 4, 
            "rating": "5", 
            "review": "old tempal. hanuman dhoka temple is one of the old durbar ans nice and old cultural carvin but little damage fram big disaster"
        }, 
        {
            "index": 5, 
            "rating": "4", 
            "review": "Lots of history. Loved this place which is the Kathmandu´s royal palace. Lots of history going back all the way to Licchavi Period around the 4th to 8th Centuries. Unfortunately alot of damage has been done due to the Earthquake of 2015. Loved the courtyards and the surrounds and the museum. Well worth a visit when you go to Kathmandu."
        }, 
        {
            "index": 6, 
            "rating": "3", 
            "review": "Still quaint. Damages is done during the earthquake, Nasal chawk and Lohan chawk are still open, but not the museums."
        }, 
        {
            "index": 7, 
            "rating": "5", 
            "review": "Great World Heritage Site left unbuilt after earthquake :(. It was one of the most famous attraction in Kathmandu valley at center of the city with palaces, museums and courtyards which was severly damaged by Gorkha earthquake. The rebuilding process is so slow or not at all. Very sad to see this beautiful site like this."
        }, 
        {
            "index": 8, 
            "rating": "5", 
            "review": "great. hanuman dhoka is one of the oldest heritage tourist tawn near in side durbar squere little damace fram big dissaster"
        }, 
        {
            "index": 9, 
            "rating": "4", 
            "review": "After quake work in progress but still a must see. As most durbar squares in the valley of Kathmandu also this one is a huge restoration work in progress after the quake of 2015. What survived and what's been restored is stunningly beautiful and you really should not miss it."
        }, 
        {
            "index": 10, 
            "rating": "4", 
            "review": "Could have been better. Been one year yet many outstanding restructuring to do. I guess if funds are managed and manpower is organized, the city will stand up again as its a beautiful history behind this place."
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "Beautiful Architecture.    It has a history hidden in it. Although, last year's earthquake did a terrible loss to whole Nepal. So was this  place also affected. But still you can go and feel the place. The Kumari  temple is a beautiful example of Nevari art. This place has a small shopping area as well. If you are not a local then you need to pay some fee to enter here. Worth a visit!"
        }, 
        {
            "index": 12, 
            "rating": "5", 
            "review": "Beautiful place to hang out. Hanuman Doka   Its a must visit place. It has a history hidden in it. Although, last year's earthquake did a terrible loss to whole Nepal. So was this  place also affected. But still you can go and feel the place. The Kumari  temple is a beautiful example of Nevari art. I would suggest that before going to this place try to search it in internet so that you get the actual idea of the place. This place has a small shopping area as well. There is a entry fee for everybody except the locals. Worth a visit!"
        }, 
        {
            "index": 13, 
            "rating": "5", 
            "review": "Visit once!!!. The most exciting point of Hanuman Dhoka is The Sexy Temple. Don't Miss this one. Also Live God Kumari. Central of Kathmandu and easy to rich there."
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "Nice place to hang out and know the Brief history of the Shah Monarchism.. If you would like to know the brief history of Nepal then this is the best place you can get knowledge. i cannot ignore the fact that it has been effected by the quake 2015 but i was happy to know practically that only some portion has been effected."
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "Damaged, but worth the visit.. Although seriously damaged by the earthquake I would recommend visiting to see the scale of damage and to put money into restoring it. Entrance fee of NPR1000 or USD$10. The rest of the site is also worth a look."
        }, 
        {
            "index": 16, 
            "rating": "4", 
            "review": "In ruins now.. It's a sad sight now to see this temple in ruins. Hard even to imagine what it was like before. Look up some photos before you go."
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "even post -quake worth a visit. Hanuman Dhoka has long been Kathmandu's gem and crowning glory. Many of the buildings and temples were destroyed or seriously damaged by the earthquake of April 25, 2015, and it will be a while before rebuilding is completed. Nonetheless visitors should still go see what is left, and get a sense of the whole area. The Kumari Temple is a beautiful example of classical Newar art and hasn't been damaged significantly. Neither the magnificent Black Bhairab nor the screened in White Bhairab were damaged and are still quite literally awesome. Plus, it is just the general atmosphere of the place that has always been, and still is, magical. If you don''t have time for anything else in Kathmandu, definitely visit Hanuman Dhoka. Mush better than Thamel!"
        }, 
        {
            "index": 18, 
            "rating": "5", 
            "review": "history is here. there is so much to see, learn, taste, hear, smell .. this is the place to spend a long morning walk-around."
        }, 
        {
            "index": 19, 
            "rating": "4", 
            "review": "Hanuman Dhoka. As with all of Durbar Square, the area is well worth visiting and the people are incredible. There are shops and local artisans everywhere. Just know that the buildings have been severely damaged and are in the process of being rebuilt right now."
        }, 
        {
            "index": 20, 
            "rating": "4", 
            "review": "Good food. It was nice to enjoy brunch at the place which we preferred to have typical Asian food. We enjoyed the vegetable curry and rice, the country made pickle was greatly enjoyed. Had great time"
        }, 
        {
            "index": 21, 
            "rating": "5", 
            "review": "The heart of Kathmandu. Beautiful architecture.. The most important Kathmandu square with many important buildings, temples and local life. Buddhism and Hinduisim. Some building were destroyed after devasting earthquake and another ones are collapsed Durbar square is so beautiful with many important buildings to see and to enjoy."
        }, 
        {
            "index": 22, 
            "rating": "3", 
            "review": "Laid waste by the earthquake. The complex, as per tourist literature, was built between the 12th and 18th century. The place is the where kings of Nepal are coronated. Important ministers of the royal court had added temples in honour of various deities over time. The place is also home to the Living Goddess Kumari. However, much of this UNESCO World Heritage site was destroyed during the earthquake of Apr 2015. As on date there remains a lot to be done to restore the precinct. Many of the remaining structures have been shored up for support."
        }, 
        {
            "index": 23, 
            "rating": "3", 
            "review": "Badly damaged.. Badly damaged and surrounded by many similarly damaged or precarious buildings, which detracts from the experience."
        }, 
        {
            "index": 24, 
            "rating": "4", 
            "review": "Heavily Damaged - But don't let that stop you going. I did read a number of reviews before writing this and visited end of April, and somewhat mystified at some comments. The area has definitely been heavily damaged by the earthquake, but that does not stop one gaining an appreciation of what it was at the peak of its grandeur. There is still a significant amount that is undamaged, about the same that has sustained minor damage and clearly more that has been severely damaged. Restoration is slow and perhaps not as \"tourists\" would want, but \"travellers\" understand the difficulties such huge \"force majeure\" brings. The area is still magnificent and taking in the substantive architecture that remains provides amazing snapshot of the past."
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "Staggering. This is one of the must see places in Kathmandu. Make time for it but be aware that a lot has been damaged by the earthquake last year."
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "Stunnning. Visited here right before the earthquake that hit Nepal. It was better to see in person than photos. It was a humbling experience to be able to see Nepal."
        }, 
        {
            "index": 27, 
            "rating": "5", 
            "review": "Leisure Time With Friends. before earthquake and after earthquake it changed in looks but the guest for this area and their love to this area still same city of temple and premises of history really good time i have ever spend herewill go again and again"
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "Very Old Hindu Pilgrimage Site. Located in the heart of Kathmandu... Very Busy.. Always Crowded ... Although severely damaged in last Earth Quake but nice to visit..."
        }, 
        {
            "index": 29, 
            "rating": "5", 
            "review": "Massive loss Heritage. The area was highly hit by the earthquake exactly a year ago. People who have visited before and after earthquake, they can feel the magnitude of the effects. After loosing two temples including Kasthamandap from which the name of the capital - Kathmandu was formed, was also destroyed totally. Many parts were damaged as a result, some areas are still restricted to enter for safety reasons. However the visitors are encouraged to come and visit the area as you can see around both remaining monuments and to feel the vibrations of the earthquake that still remain in the area."
        }, 
        {
            "index": 30, 
            "rating": "3", 
            "review": "In need of repair.. This is part of Durbar Square which you pay 1000 NPR to enter.AU$12. There are a lot of different temples there, desperately in need of repair after earthquake. Lots of touts."
        }, 
        {
            "index": 31, 
            "rating": "1", 
            "review": "Sad, very sad. The site is not worth visiting at the moment.. The earthquake destroyed this area. It is not worth visiting until the Govt of Nepal makes an effort to restore the site. Meanwhile they charge 1000NR to enter.\nBetter off going to Swambhu, Boudha, or Patans Durbar Square which is more intact.\nIt is not even a shadow of its former self. Unfortunate, but true."
        }, 
        {
            "index": 32, 
            "rating": "3", 
            "review": "Fascinating History. This is part of the larger Durbar Square area which once upon a time housed many amazing buildings and monuments. I am lucky to have witnessed the architectural wonder way back in 1997 and again recently in 2015. The detailing in the architecture is superb and you could spend ages walking round examining every inch and still be in awe. The only down side for me though was the street peddlers who don't seem to give you a minute chasing after you selling their wares. Hanuman Dhoka durbar is in Kathmandu durbar square. There used to be several ancient buildings in Kathmandu Durbar square. Hanuman Dhoka got its name from the statue of monkey god Hanuman at the entrance of the palace. Alas all this is now a thing of past. Just within few paces from the Hanuman’s idol near entrance, used to be a stone inscription of king Pratap Malla which was written in 14 languages including Urdu, English and French. There used to be another temple of Shwet Bhairav that remains closed except during Indra Jatra. All that is left now is ruins. Nature has its own way of turning things up and down and I feel sorry for the localities that lost their lives in the massive earthquake."
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "what a terrible the earthquake destroyed everything. what a terrible the earthquake destroyed everything, hope it will be rebuilt soon, not only this place all other historical monuments are collapsed"
        }, 
        {
            "index": 34, 
            "rating": "4", 
            "review": "Secure Entrance .. Hanuman Dhoka, Entrance to palace which is secure by God Hanuman. Lovely place that is surrounded by beautiful temples and golden gate entrance to ancient palace of 14th century of Malla dynasty. Near to the main entrance a huge statue of Hanuman on 6ft stage that statue is covered with red cloth. Every morning many people come here to worship different goddess and god around here. This is a fascinating place for travelers, there is entrance fee for tourist. "
        }, 
        {
            "index": 35, 
            "rating": "3", 
            "review": "Needs major repairs to retain its former glory. Suffered badly in the earthquake. Presumably will be rebuilt.Lots of other things to see and do in the square, though."
        }, 
        {
            "index": 36, 
            "rating": "5", 
            "review": "Wonderful Historical Place.. Even After the Devastating Earthquake, this place is still very beautiful. I reckn everybody to visit this place which is I must say a piece of Heaven on earth."
        }, 
        {
            "index": 37, 
            "rating": "3", 
            "review": "Nice place. This entire campus is very nice with lot of interesting things to see. One major problem is the beggars, many is number and they keep you following"
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "A must visit place in Kathmandu. This World Heritage Site is so interesting, with lots to see and learn. Beautiful architecture with incredible carvings and stone work."
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "must Visit place in Kathmandu Nepal. Pashupatinath Temple is the biggest pilgrimage of Hindus and regarded as the most sacred temple of Hindus in the world. It has astonishing architectural beauty and also stands as a symbol of faith, religion, culture and tradition. Pashupatinath Temple's existence dates back to 400 A.D. It’s also known as 'The Temple of Living Beings'. Thousands of devotees from within and outside the country come to worship to Pashupatinath every day.It’s Beautiful and you can see lots of old architecture, which will make u spellbound. I sawGold-painted images of guardian deities, Chaturmukha (four-faced statue), Chadeshvar, an inscribed Licchavi linga from the 7th century, Brahma Temple, Dharmashila, a stone where sacred oaths are taken, Arya Ghat, Gauri Ghat (holy bath), Pandra Shivalaya (15 shrines), Gorakhnath and Vishwarup Temples, Guhyeshwari (Guhjeshwari) Temple, Kirateshwar Mahadeva Mandir and Surya Ghat. "
        }, 
        {
            "index": 40, 
            "rating": "5", 
            "review": "One of our favorite sights on our trip. We spent quite a bit of time in the square soaking in the atmosphere. Lunch overlooking the temple was amazing. Such a great place. We did have a problem with an especially aggressive beggar, but other than that, it was a splendid stop!"
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "World Heritage Site of Nepal. Kathmandu's royal palace, known as the Hanuman Dhoka, was originally founded during the Licchavi period (4th to 8th centuries AD) but the compound was expanded considerably by King Pratap Malla in the 17th century. Sadly, the sprawling palace was hit hard by the 2015 earthquake and damage was extensive. At the time of research, the palace was closed for reconstruction, but once this work is complete, visitors should again be able to access the beautiful royal courtyards and royal museum.Even from the outside, the palace is impressive. Hanuman’s assistance to the noble Rama during the exciting events of the Ramayana has led to the monkey god’s appearance guarding many important entrances. Here, cloaked in red and sheltered by an umbrella, a Hanuman statue marks the dhoka (entrance) to the Hanuman Dhoka and has even given the palace its name. The statue dates from 1672; the god’s face has long disappeared under a coating of orange vermillion paste applied by generations of devotees."
        }, 
        {
            "index": 42, 
            "rating": "5", 
            "review": "Kathmandu Durbar Square Sightseeing. I have visited Kathmandu Durbar Square Sightseeing after earthquake there is no any problems to sightseeing aroun Hanuman Dhoka area thanks."
        }, 
        {
            "index": 43, 
            "rating": "5", 
            "review": "beautiful temple. One of the beautiful temple in kathmandu. Old and well maintained. At darbar square, a must visit place of kathmandu"
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "renowned beautiful archecture. what can one say it is so different....walk up the 36 or so steep steps and look down at the square which is filled with locals visiting and enjoy by sitting and have a coffee and people watch"
        }, 
        {
            "index": 45, 
            "rating": "5", 
            "review": "wonderful place to visit. this is a ancient place which was is beautiful place and i had visited this place by @Rosha Trek & Expedition P. Ltd."
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "Good One. These are excellent sightseeing activity; All paces of historic importance collectively placed and each one speaks rich about the ancient customs and traditions in Nepal"
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "Fascinating Window into Ancient Kathmandu. The Hanuman Dhoka and the Kathmandu Durbar Square that houses Hanuman Dhoka provides a fascinating and interesting glimpse insights into the history of Kathmandu. Note that Kathmandu used to a kingdom by itself centuries back and thus had its own unique culture and tradition, some of which is visible here through the temples, shrines, architecture and historical structures and monuments. The Durbar Square houses palaces and structures belonging to rules of multiple dynasties that ruled Kathmandu. This place is also popular for all kinds of and all price ranges of Nepali souvenirs - depends on how good of a bargainer you are!There is entrance fee to the region for tourists like USD 10, and personal guides cost around 15-20 USD (again depends on how good of a bargainer you are), but totally worth it and definitely recommended! Make sure the guides are licensed by the government and speak good English - most are and most do. They will be able to provide you with history and hidden significance of each palace, shrine, architecture, or ritual performed there. The guide tour usually lasts an hour and half to two hours or longer if you wish. After the tour is over, just take a stroll exploring the fascinating bazaars and interesting culture, get lost in the crowded alleys and discover more of Kathmandu! Most important thing, it is absolutely safe there, especially for tourists, Kathmandu being the city of people actually practicing good hospitality!"
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "All gone. So sad to visit this place as i have visited 2 years back as it was so proudly standing in pride. Its a museum part of Hanuman Dhoka. The palace got its name from the image of Hanuman. Its still firm standing up there even the surroundings has touch down the ground. The great Hanuman. Its a great place to visit and no one must miss it if you are in nepal. Its so unique by itself no words to express."
        }, 
        {
            "index": 49, 
            "rating": "4", 
            "review": "DEmolished?. Have seen this been demolished by the earthquake. One of the Nepalese prides. The whole place was a paradise for people who are interested in history , architecture and photography. It was a busy place. Even many Nepalese tend to visit here in thousand everyday. But now, no idea?"
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "Impressive. Has suffered a bit of damage from the recent earthquake. Worth visiting. Probably best to have a guide to explain the various structures and the history"
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "Highlight of Durbar Square. The place used to have a grandeur feeling in Durbar square everytime i use to go there. But sadly in the earthquake it has been completely destroyed, hope it is rebuilt to its former glory soon"
        }, 
        {
            "index": 52, 
            "rating": "4", 
            "review": "Old durbar. It's lies on the middle of the Kathmandu city.After 25th April 2015 ,(After earthquake)it's lies only damaged.Now it's under the construction."
        }, 
        {
            "index": 53, 
            "rating": "1", 
            "review": "Gone. There is nothing left of this stupa, just the base. It is not worthwhile paying the entrance to see nothing."
        }, 
        {
            "index": 54, 
            "rating": "5", 
            "review": "Old Nepal. Do take out time and walk in the busy lane. gives a peek a boo in the culture and history. Good for a walk in winter afternooon"
        }, 
        {
            "index": 55, 
            "rating": "3", 
            "review": "Hanuman Dhoka. That place is still in Darbar Square but its almosy destroyed and nothing left anymore. Feel sad about what happened in this heritage site."
        }, 
        {
            "index": 56, 
            "rating": "4", 
            "review": "Beautiful architecture. We visited this during our Nepal trip in December 2010. This is part of the famous Durbar Square in Kathmandu. Hanuman Dhoka is a complex of structures with the Royal Palace of the Malla and Shah dynasty in the Durbar Square. It is spread over five acres. The Hanuman Dhoka Palace gets its name from the stone image of Hanuman, the Hindu monkey god, that sits near the main entryway. 'Dhoka' means door or gate in Nepali.All temples that are situated in this square are best examples of Newari architecture."
        }, 
        {
            "index": 57, 
            "rating": "5", 
            "review": "beautiful structure. when you amble around Durbar Square, you cannot miss this monument. Fragile and being conserved post-earthquake, do not miss looking this up."
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "Heart of Kathmandu. How can one not visit Hanuman Dhoka when in Kathmandu? The seat of Royal power, it transports you to a different world altogether. Entry is expensive though, particularly for foreigners."
        }, 
        {
            "index": 59, 
            "rating": "5", 
            "review": "Architecture @ it's best !!!. If you want to see the Newari Architecture, this is the place you should head to , the whole of Durbar Square is a Architectural Marvel and absolute treat to our eyes, we can take lots and lots of photos and videos to cherish for our entire lifetime, but due to earthquake some parts are damaged which is very very sad, I went to this wonderful Hanuman Dhoka Square on 25th September 2015 and enjoyed a lot.Must visit for all age groups when you are in Kathmandu, 200NPR entrance fees and another 300NPR for Guide, but first guide will ask you 800 - 1000NPR and we have bargain, finally I paid 300NPR which is worth spending.Thanks a lot for everything,Loving you so much,Peacefully yours,S M Bega Raaj.Happy travelling..."
        }, 
        {
            "index": 60, 
            "rating": "5", 
            "review": "The very hearth of Kathmandu. This area is the most fashinating part of Kathandu old city. Visiting it and the maize of street around means to fully be immerged in the very life of Nepal."
        }, 
        {
            "index": 61, 
            "rating": "3", 
            "review": "Nice for pics. This is nice for pics. Although it's closed, you can climb the stairs to the top, which I didn't. There were lots of people, kids, teens, climbing all over the statues though, and just hanging out. Kind of made it a little disappointing."
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "Still a must visit site. Although severely damaged by the earthquake, Hanuman Dhoka and the wider area that encompasses Durbar Square are still the key attractions of Kathmandu and are a must visit site. Please see my review of Durbar Square for full details. Although some shrines and temples have been all but destroyed, the vast majority of the complex is still intact and the breathtaking aura of the place has not been diminished."
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "Historic. Hanuman Dhoka is a Historical Place and must Visit point.Need to visit for three reasons : Art, Culture and Traditional carried."
        }, 
        {
            "index": 64, 
            "rating": "5", 
            "review": "A historical place. it is amazing place. historical fulfilled with arts and culture. tall temples and design will make you fill happy and peaceful. it is located in heart of Kathmandu Please visit whenever you visit to Nepal."
        }, 
        {
            "index": 65, 
            "rating": "5", 
            "review": "History and faith at the heart of ancient Kathmandu!. Th \"Hanuman-Dhoka Durbar Square\", at the very heart of the ancient city of Kathmandu, is known also as \"Durbar Square\" or \"Basantapur Durbar Square\". It was named after Hanuman, the Hindu God depicted in the form of a monkey (an incarnation of God Shiva) and a helper of God Rama (an incarnation of God Vishny). It includes palaces and beautiful temples and shrines, both Hindu and Buddhist. The April 25, 2015 earthquake has severely damaged \"Hanuman-Dhoka Durbar Square\", where many temples and monuments - as \"Kasthamandap\", \"Maju Dega\", \"Chyasin Dega\", \"Trilokya Mohan Narayan\" and others - were completely destroyed. But fortunately, many others like \"Kumari Chowk\", \"Shiva Parvati\", \"Taleju\", \"Jagannath\", \"Basantapur Durbar\", \"Hanuman-Dhoka Palace\" (housing the \"Tribhuvan, Mahendra and Birendra Museums) and the \"Gaddi Baithak Palace\" were partially or slightly damaged. Before the earthquake, the \"Hanuman-Dhoka Durbar Square\" was always full of visitors, souvenir sellers, fake saddhus, pigeons and cows. The square has re-opened for visitors and a fee of Rs.750,00 is charged per person upon entry. If visiting Nepal was on your plans, don't give it up! Support Nepal and its lovely people in their efforts towards the country's reconstruction. Enjoy!"
        }, 
        {
            "index": 66, 
            "rating": "4", 
            "review": "Still badly damaged but worth a visit. It is a sight indeed. It is amazing to see supports and forking branches to keep the building still awaiting further recoveries."
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "Not the same after earthquakes, but still a sight to see.. This square used to be one of the most beautiful places to be while in Kathmandu, but due to the summer 2015 earthquakes in Nepal, most of the historical buildings in this area have collapsed. Though it is not the same as before, you could still find great things in here."
        }, 
        {
            "index": 68, 
            "rating": "5", 
            "review": "Damaged by the earthquakes but still worth a visit. Durbar Square contains so much history but it has been badly damaged by the earthquakes and needs tourists to go there now"
        }, 
        {
            "index": 69, 
            "rating": "4", 
            "review": "Kathmandu Durbar Square. Kathmandu Durbar Square was having badly damaged after the recent earth quake, however, still plenty things to see !"
        }, 
        {
            "index": 70, 
            "rating": "5", 
            "review": "cheeky tourist rates. For a history geek and culture vulture this place is stunning, a bit miffed that there are signs around stating different rates of pay for locals and tourists, it's a little bit cheeky."
        }, 
        {
            "index": 71, 
            "rating": "5", 
            "review": "A unique place. Hanuman Dhoka Square is a unique cultural place which adds a lot of mysticism to the place. The trip changes you as a person."
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "History blend with mysticism and culture.. Though few temples are severely been damaged by the earthquake, the historic smells of Durbar square will never be old. It will always open a path to connect present and past and will offer visitor a surrealist experience. Watch the living kumari goddess temple and check out the square filled with pigeons. Lovely foods around the square. early morning and late afternoon are perfect time to spend at the square."
        }, 
        {
            "index": 73, 
            "rating": "4", 
            "review": "History home. Hanuman Dhoka is one of the three Durbar Squares in Kathmandu and part of the group of World Heritage sites.Even the country has been struch with the earthquack the city still continue the magestic view. i usually visit since my childhood there."
        }, 
        {
            "index": 74, 
            "rating": "5", 
            "review": "Hanuman Durbar Square is finest and uniqueness palace former King of Nepal. Still the place to see many things even though there was deadly earthquake strike on 25 April 2015 and May 12, 2015 in Nepal which cause so many historic monuments are destroyed and ruined."
        }, 
        {
            "index": 75, 
            "rating": "5", 
            "review": "Visit by a Mexican. Even the country has been struch with the earthquack the city still continue the magestic site, the people is very nice, the way they have grow with this situacion, it is evident."
        }, 
        {
            "index": 76, 
            "rating": "5", 
            "review": "nice place. hanuman dhoka is nice palace with old woodcraft. our tour guide explain every thing about it. we recomand to visit this place once"
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "lovely square. Hanuman Dhoka is one of the three Durbar Squares in Kathmandu and part of the group of World Heritage sites there.You will be expected to pay a entry fee to the square but I understand that it has been very badly damaged by the earthquake - I visited in February just prior to it"
        }, 
        {
            "index": 78, 
            "rating": "4", 
            "review": "Nice Plan. Before the earthquake this place has many temple and goddess to see but after the earthquake most are damaged. Most affected heritage site in kathmandu is Kathmandu Durbar square, government have to control that car, bikes, to enter this places too crowed."
        }, 
        {
            "index": 79, 
            "rating": "5", 
            "review": "Superb. Truly historical and such unique architecture. There are erotic sculptures hidden in the architecture if you look closely."
        }, 
        {
            "index": 80, 
            "rating": "4", 
            "review": "A Must See. While there are many temples in Katmandu this is rather a unique on. Lots to see and many people are visiting."
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "Must visit. I am spellbound by the beauty of this place. It seems to have a great story to it. Festivals and Jatras make me want to stay here forever"
        }, 
        {
            "index": 82, 
            "rating": "5", 
            "review": "Quite a bit of history!. A lot of history in this one, excellent temples and the wooden carvings are truly amazing. Unfortunately, very badly damaged in the earthquake - be sure to explore the side alleys and you'll see most of the damage there."
        }, 
        {
            "index": 83, 
            "rating": "1", 
            "review": "Destroyed temple. This temple is completely destroyed after the earthquakes from April 25 and May 12. It's sad to see and I hope the reconstruction works start soon because this is touching the Nepali heart."
        }, 
        {
            "index": 84, 
            "rating": "5", 
            "review": "Excellent day of sight seeing in Kathmandu. We were here on the 3rd April. Lots of history and lovely people. It was one of our last sight seeing trip before flying home."
        }, 
        {
            "index": 85, 
            "rating": "4", 
            "review": "A Palace made of wood. This is the palace where the King and the family used to stay. Now a days, it has been converted in to the museum. It s made of wood. The old things used by King and family is kept for the common people to have a glimpse."
        }, 
        {
            "index": 86, 
            "rating": "5", 
            "review": "Kathmandu Durbar Square. It is like a little piece of time travel. There is damage from the earthquakes so some place have come down. I think and hope they will be rebuilt as this is a unique place that almost defines Nepal."
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "Old historical palace. One of the oldest Kings palace which is located in the middle of Kathmandu. This have different temples and museums and old belongings of the kings."
        }, 
        {
            "index": 88, 
            "rating": "5", 
            "review": "Amazing Place. The Durbar Square, with its old temples and places, epitomizes the religious and cultural life of the people. It is here that Kings of Nepal are crowned and their coronations solemnized. Interesting things to see here are; Taleju Temple built by King Mahendra Malla in 1549 A.D., Kal Bhairav, the God of destruction, Nautalle Durbar, Coronation Nasal Chowk, the Gaddi Baithak, the statue of King Pratap Malla, the Big Bell, Big Drum and the Jagannath Temple. On the right-hand corner, large wooden lattice screen hides an enormous gilded face of SwetBhairav. The screen is removed only during the Indra Jatra festival.There are also Numismatic and Tribhuvan Museum inside the Hanumandhoka Palace building. Photography is prohibited inside the museums. Both the museums remain closed on Tuesday and government holidays. This is the one of the UNESCO cultural heritage sites of Nepal."
        }, 
        {
            "index": 89, 
            "rating": "5", 
            "review": "Hard to describe after the earthquake. The damage to the Durbar square and Hanuman Dhoka is hard to see for those who know the beauty of the ancient sights in Nepal. Nepal needs tourism badly so don't let the ruins scare you away. There is still something fascinating around every corner."
        }, 
        {
            "index": 90, 
            "rating": "3", 
            "review": "Earthquake effect. The old heritage buildings and structures were mostly down, with a lot of rubble and debris scattered all over. A sad sight indeed. Hopefully the buildings and structures would be restored by the government to bring back the magic and magnificence of Hanuman Dhoka all over again."
        }, 
        {
            "index": 91, 
            "rating": "4", 
            "review": "hangout of 70s. One of the world heritage site of Kathmandu valley and one of the three ancient palaces of the valley, once attracted all the baba cools from all over the world. Many singers and artists had beed there in search of Shagri-la back in 1970s. Richly decorated with fine carvings, the temples here are magnificent and stand with pride. Unfortunately this place has been destroyed by devastating earthquake of 25 april 2015 but Nepalese people will surely rebuild it preserving it's original form. Actually the name \"Kathmandu\" was derived from a wooden pavilion of the square called \"Kasthamandap\". Hanuman dhoka square is the place where you can have a glance of the living goddess called \"Kumari\". Mythic and beautiful, this place still offers an experience of medieval Nepal."
        }, 
        {
            "index": 92, 
            "rating": "5", 
            "review": "Beautiful Architecture. We visited in April2015, just 6 days before the earthquake. We were a very big group of 100 over family and friends.It was really beautiful and so unique, something extraordinary. Hanuman is the Hindu Monkey God.Lot of walking and the path has lots of stones, good walking shoes. our guide showed us around the Hanuman area and the palaces in the area. Palace has beautiful stone carved work and a small entrance fee is required. Worth the effort - i just hope most of it is intact. Was thankful we visited this place before the quake. A must visit, once things have gone back to normal."
        }, 
        {
            "index": 93, 
            "rating": "5", 
            "review": "Everything is not destroyed by earthquakes. Hanuman dhoka durbar was affected and destroyed by the earthquake but still it has plenty of thing in condition to look. It is great example of Nepalese architecture."
        }, 
        {
            "index": 94, 
            "rating": "5", 
            "review": "A great example of craftmanship of Newars and other Nepali ethnic groups. The square is vibrant, full of people, not only foreigner tourists but also locals. The architectural view is awesome. But unfortunately three main temples have been completely destroyed by 25th Apr earthquake. The old King's palace is also severely damaged. Still, there are lot to see and observe and help Government of Nepal to rebuild the temples with tourist income."
        }, 
        {
            "index": 95, 
            "rating": "5", 
            "review": "Kathmandu Durbar Square through DT. you will visit Hanuman Dhoka, the old and historic palace of Kathmandu named after monkey God, Hanuman. It is historic seat of royalty. The Kings of Nepal are crowned and their coronations also held inside the court yard here. There is a statue of King Pratap Mall sitting on the stone pillar in the front and temple of Jagannath from mediaeval period .Within the walking distance you will find the tall temple of Taleju from 1549 AD, the large stone statue of Kal Bhairav, the God of destruction. The Big Bell and Big Drum and Hindu Lord Shiva and his consort Parvati peeping from window. Visit the temple of Kumari, the residence of Living Goddess within the vicinity. Kumari means the virgin girl. The girl is selected from Buddhist family. The building has profusely carved wooden balconies and window screen. Next a very interesting temple is Kasthamandap which is believed to be built from a single tree trunk and the name Kathmandu is derived from this temple."
        }, 
        {
            "index": 96, 
            "rating": "5", 
            "review": "Earthquake Damaged this place. This place is virtually destryoed by the earthquake-the temple in the picture is no more ! However, this place is recently opened for public and tourists after earthquake. You can see how the recent earthquake has damaged this world heritage site. A must visit place while you are in kathmandu."
        }, 
        {
            "index": 97, 
            "rating": "3", 
            "review": "Palaces all around. The Hanuman Dhoka square is home to the Royal Palace. One can see a lot of small and big palaces of different kings all around. This attraction has an entry fee. The palace can be seen from within. There is a small museum attached to it as well. The closing time is 5.30 pm."
        }, 
        {
            "index": 98, 
            "rating": "2", 
            "review": "Earthquake ravaged. I only wish I had done my city trip prior to the earthquake. Most of this world heritage site was blocked off because of the dangers of the buildings collapsing. I did get to see some amazing wood carving, and where the buildings used to be. Hopefully it can begin to be rebuilt soon."
        }, 
        {
            "index": 99, 
            "rating": "4", 
            "review": "Beautiful Memory of the Hanuman Dhoka Square. Visited this area on 1 January 2015.Located about 10 minutes by car from Thamel,in the ancient city of Basantapur.Haven't had the time to review this place until now ,and reading previous visitor's review, made me very sad because it said that this beautiful place has already destroyed to rubble.When we visited , all of the historical buildings, gates , temples , were still proudly standing, my pictures,are now just memories of this beautiful place.I still hope that maybe somehow they could restore this historical buildings to its original state.."
        }, 
        {
            "index": 100, 
            "rating": "5", 
            "review": ":(. Yes, it's destroyed to bits, it's impossible to rebuild it back with how the origin is , but what left is the memory, the story and always the nepal people will always keep us reminded of this quake that has happened to them. Let's all together people and visitor all over the world, visit nepal, even more important now then later, to boost their tourism , and most importantly to show them that we care, they are not alone ,never alone, let's together restore the faith in humanity and the pride in what Nepalese believe in . Visit Nepal 2015 people"
        }, 
        {
            "index": 101, 
            "rating": "4", 
            "review": "A must preserved heritage. Lots of historic and artistics buildings, temples, where history comes alive. The highlight is meeting the Kumari Devi. Though it takes hours just to see her, it is indeed a sight to behold. Love the local markets in the durbar."
        }, 
        {
            "index": 102, 
            "rating": "4", 
            "review": "right in the middle of the city. nicely carved stone payment in the central of kathmandu is where you would find the temple,,, best time is early morning with no traffic and the beautiful place coming out with all its glory..pls ensure that you do take your camera"
        }, 
        {
            "index": 103, 
            "rating": "4", 
            "review": "Very crowded. You'll feel very crowded here with so many people just hanging around or got a chat with friends, but still you'll enjoy to see the temples and ancient heritage here. On the street to the square there are also souvenir you can buy."
        }, 
        {
            "index": 104, 
            "rating": "5", 
            "review": "Now in ruins - after the earthquake. Hanuman Dhaka is no more. Earthquakes on April 25 and 26, 2015 demolished the whole area. Only few temples still stand."
        }, 
        {
            "index": 105, 
            "rating": "5", 
            "review": "An Icon of Kathmandu Valley. When I think of Kathmandu, I have a view visual memories-one being Durbar Square. The first time I visited Neap, I remember walking through the streets leading to the historical square-full of people transporting baskets and goods from one place to another. At that time, in 1994, most Nepalese still wore traditional dress. After the tragic earthquake, I hope that Kathmandu and the Nepalese can rebuild this landmark that represents Nepal's rich cultural history. I look forward to visiting Durbar square again sometime soon."
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "Highlights history of Nepal. Visitors get the chance to know about Nepalese history and see the old weapons used by the Kings of Nepal. The places around Hanuman Dhoka Square are also worth visiting."
        }, 
        {
            "index": 107, 
            "rating": "5", 
            "review": "Excellent. A must visit place in Kathmandu. Enlisted in world heritage list as well. It has a got a museum displaying all ancient culture and tradition of Kathmandu valley. Very centrally located in the heart of the city. Truly a marvelous place. An oasis in the midst of chaos and hassle."
        }, 
        {
            "index": 108, 
            "rating": "5", 
            "review": "This will take some time. This is a huge square so prepare to spend at least a couple of hours there. This is also where the living Goddess comes out to wave at 3:30 or so. There is so much to see here. A museum and grounds going on and on. You can climb 6 or 9 stories up giving you a good view of all sides of the city. Lovely place!"
        }, 
        {
            "index": 109, 
            "rating": "4", 
            "review": "Beautiful architecture, history and life. The Hanuman Dhoka is the Hanuman gateway to the old royal palace and the square here has some great temples . If you can be here during a festival it takes on a live of its own and you'll find some statues on display that are hidden the rest of the year. Brilliant photo opportunities and a wonderful place to absorb Nepali culture"
        }, 
        {
            "index": 110, 
            "rating": "4", 
            "review": "Must visit. 'Dhoka' is the Nepali word for 'door'. Kathmandu's Royal Palace is known as Hanuman Dhoka. The stone image of lord Hanuman which is at the corner of the square"
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "Really lucky to visit top temple here. There is a temple at top which opens only one or two days is a year. We were so lucky that we visited the day temple was open.need to stand on line behind 1000 people but feel within one hour we reached to the main temple. There were lots of volunteers who was maintaining n lots of crowd in a nice way. It's a very old temple and one of the world heritage site. Photography is prohibited in main temple area. After coming down from main temple we went to other temple. All others temples were full of buffalo blood as they sacrifice buffalo to the god ..those blood and smell we didn't like though this sacrifice happens only one time in year.Otherwise it was nice experience .must visit place."
        }, 
        {
            "index": 112, 
            "rating": "5", 
            "review": "Must see. The Hanuman Dhoka Durbar in Nepali gets its name from the stone image of Hanuman which is at the corner of the square ( and near the door leading to the courtyard of the old Royal palace of Kathmandu). 'Dhoka' is the Nepali word for 'door'.The royal family lived here before they moved into the Narayanhiti palace.The palace complex houses the Mul Chowk, Nasal Chowk and the Mohan Chowk.Definitely worth a visit."
        }, 
        {
            "index": 113, 
            "rating": "4", 
            "review": "A Nice Tourist Spot.. Kathmandu's Royal Palace is known as Hanuman Dhoka. Present structure was built by king Pratap Malla in 17th Century. This is also an UNESCO World Heritage Site. Out of 35 Chowks now are only 10 Chowks( Courtyards ) after Earthquake of 1934. A worth visit place."
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "Not to be missed. In the heart of the old city of Kathmandu, Hanuman Dhoka has beautiful soaring temples - it looks very similar to photos taken one hundred years ago. Also, teeming with shops, coin sellers, fabric dealers, bangle and bead necklace shops nearby."
        }, 
        {
            "index": 115, 
            "rating": "4", 
            "review": "Interesting. The square is the complex of palaces, courtyards and temples. It is over a large site. A proper guide is must to make sense of complex and its history. It is yet another UNESCO World Heritage site and therefore always worth a visit."
        }, 
        {
            "index": 116, 
            "rating": "5", 
            "review": "Good Tourist Spot. Bustling with lots of tourist with various individual temples. Has a history museum of Nepal monarchy."
        }, 
        {
            "index": 117, 
            "rating": "3", 
            "review": "Interesting, but not \"over the top\". This square is in the center of a very dusty part of the city. It has little to offer except the merchants with their wares. We found some individually carved wooden statues for a very reasonable (cheap) price."
        }, 
        {
            "index": 118, 
            "rating": "4", 
            "review": "Cluster of Temples. One cant see the place without a Proper Guide.There are more than 35 Temples and history with it.Maximum time to cover the place is 60 - 75 mins.Guides can be negotiated for 300 - 400 Nepalese Rs."
        }, 
        {
            "index": 119, 
            "rating": "4", 
            "review": "Crowded, but impressive!. Found this temple when walking around Kathmandu. It is, like most other \"tourist\" sites here, very crowded, but worth the visit. Recommend having a guide here to explain all of the various religious background of the numerous places to visit in Kathmandu."
        }, 
        {
            "index": 120, 
            "rating": "5", 
            "review": "Beautiful and Rich with History. I am an American in Katmandu, Nepal on business. On a day off I took the opportunity to take a tour with a guide. One of the places I visited was Hanuman Dhoka Square. It should go without saying that it was beautiful and rich with history. In my opinion it should be included on any sightseeing tour while in Kathmandu."
        }, 
        {
            "index": 121, 
            "rating": "5", 
            "review": "Worth seeing.. Beautiful architecture, very interesting history, definitely worth checking out for some time. there is a lot to see."
        }, 
        {
            "index": 122, 
            "rating": "5", 
            "review": "The sight is like history, but the must stop the traffic here!. we visited this place 15 years ago. The pagodes and palaces are of course the same. But the surrounding changed. They let cars, taxis and motorbikes cross this historical place. We don not like that. You have to pay 750 nepalese roepee for entrance fee."
        }, 
        {
            "index": 123, 
            "rating": "4", 
            "review": "Great place. The old Kathmandu is amazing. You can feel the history and religion of Nepal there. Must go there if you are in Kathmandu."
        }, 
        {
            "index": 124, 
            "rating": "5", 
            "review": "Beautiful place.. In the heart of Kathmandu lies the Durbaar Square. It is a UNESCO World Heritage site. Stroll through the Durbaar Square to visit the various temples. Do hire a guide who can will explain in detail about each and every temple. Don't forget to collect the map and information booklet along with your etnry ticket which contains a lot of detail."
        }, 
        {
            "index": 125, 
            "rating": "5", 
            "review": "Great Place To Be. When I heard the story of Hanuman Dhoka from my local friend Mr. Surendra Gupta I was overwhelmed to know that God does exist and makes its prescence felt too. People travelling to Kathmandu must visit this place"
        }, 
        {
            "index": 126, 
            "rating": "4", 
            "review": "Nice. This is another world heritage site in Kathmandu, very near from thamel. I loved the nine floor high old royal palace building. it is worth to climb and see around from the top."
        }, 
        {
            "index": 127, 
            "rating": "4", 
            "review": "Old town. This place has an energy that runs across time. It seems like another century and another lifetime. Many people would flock here and sit at the stairs well into night. There are temples and markets around the square, making it a complete experience of a kingdom of the past."
        }, 
        {
            "index": 128, 
            "rating": "4", 
            "review": "Kaleidoscope of local culture!. Hanuman Dhoka is one the three major durbar squares in Kathmandu, the other two are Bhaktapur and Patan and all three are UNESCO heritage sites. I would rate Bhaktapur as the best in terms of temples and architecture but Hanuman Dhoka offers a kaleidoscope of local culture! We visited during the Dasain festival and there was a local market in the morning selling all things from vegetables to live animals for the sacrifice. It was a lively atmosphere but a bit chaotic too.As you enter, there is a large open space where makeshift souvenir shops are setup and then you see the Kumari Ghar on the left. As you move towards right, you get the Royal Palace complex which is guarded by a pair of lions at the entrance. There is a Hanuman statue near the entrance and this place derives its name from this. The palace complex has a 9-storey building. You see the royal guards in uniform.Once you are out, you can enjoy several temples. We saw a few but didnt explore all of them. The place will be much better if general public is kept out to maintain cleanliness.There is an entrance fee and the ticket counter insisted on local currency only. There is no strict checking of tickets as this place kind of blends with local market and other public areas around it. You will get a map along with the ticket which is quite useful.Worth a visit!"
        }, 
        {
            "index": 129, 
            "rating": "5", 
            "review": "square of temples. temples temples temples everywhere - some more exciting than others! the ivory window is also interesting. the 9 floor high building of the old royal palace is also worth the climb. the old palace is worth a walk around. as usual you do get many people trying to sell you many things.. but that's Nepal."
        }, 
        {
            "index": 130, 
            "rating": "4", 
            "review": "Chaotic but still worth it. Hanuman Dhoka is one of the three Durbar Squares in Kathmandu and part of the group of World Heritage sites there.Parking as in most of Kathmandu is difficult.Although there is an entry fee to the attraction for foreigners ,if you have the looks to support, you can get away without paying the fee as the entry is not well regulated and free for Nepalis.The entry from the New Road side is through a Plaza with shops selling souvenirs and eateries(Himalayan Java is a good option).There is a Kumari(small Nepali girls are selected every year to a child goddess) temple inside where if you are lucky and at the right time ,you can see Kumari.There is a museum inside which we did not visit.The place is chaotic and crowded as part of the Square is open to traffic and full of vendors selling all sort of things.You do not know where the Square ends and the chaotic roads of Kathmandu start.Have patience and walk around the sprawling and crowded premises and see lot of statutes of Hindu gods and temples.On festival days you are bound to see elaborate Nepali rituals being performed in the premises watched by a large crowd.If you choose you can depart from another gate into the maddening crowd of Kathmandu .The one world to describe the place quaint but chaotic but that is how most of Kathmandu is."
        }, 
        {
            "index": 131, 
            "rating": "4", 
            "review": "A comparably quiet place in the heart of Kathmandu. Though the Dhoka Dubar is the the best Dubar in the Kathmandu Valley, it is nice option when you want to escape from the crazy, noisy, dusty traffics of Kathmandu! Remember to bring your passport and photo to the site office to make a re-entry permit!"
        }, 
        {
            "index": 132, 
            "rating": "5", 
            "review": "Old city Center !!!. The old city center -- where the Royal palace of the previous Nepal kings is located. The famous Hanuman Temple is also located here. A very busy place for the worshipers and also for tourists."
        }, 
        {
            "index": 133, 
            "rating": "3", 
            "review": "Durbar Square Highlight. I am not sure why this attraction is listed separately from Durbar Square. You can get a better idea about checking this out, by reading the reviews on Durbar Square. Of course, that means that it is a \"must see\" if you are a first time visitor to Kathmandu. And if you are a frequent visitor to Kathmandu, you likely have figured out how to visit the square without paying the fee (if you've connected with local residents).This edifice is among the most prominent structures in Durbar Square, so you are certain to notice it when visiting--you will NOT need a guide to locate this. Be aware in this area, that many locals seek out tourists for money--including a number of fake sadhus, more than willing to pose for photos as long as you give them some rupees."
        }, 
        {
            "index": 134, 
            "rating": "5", 
            "review": "A must!. This is the centre of historic Kathmandu! if you want to save money on the entry fee go at night when the whole area turns into a chaotic market. It was fun to watch the locals there."
        }, 
        {
            "index": 135, 
            "rating": "5", 
            "review": "World heritage site. Also call as Kathmandu Durbar square, a complex of beautiful temples and shrines. Is a world heritage site and monument zone. A fee of Rs 750.00 for entry ticket.Opening hours is 9am - 4pm.It will take whole days as there are many shops and attraction to see."
        }, 
        {
            "index": 136, 
            "rating": "5", 
            "review": "Such an inspiring place. the myriads of people visiting here, the colours all around, the chaos yet you can be here on your own whenever you are here. never miss to visit this place whenever you are in Kathmandu"
        }, 
        {
            "index": 137, 
            "rating": "5", 
            "review": "The Heart of City. Hanuman Dhoka ist he heart of city and also the old Kathmandu...Here are a number of temples all around this place...and also the famous temple of Hanumanji...There is a old Durbar Building now turned to be the museum...There is a small Pashupatinath Temple also in this place..."
        }, 
        {
            "index": 138, 
            "rating": "4", 
            "review": "The historic heart of Kathmandu. We were there during the equivalent of Diwali, during which time it's open to traders, which was very colourful but, unfortunately, it meant there were also loads of the maniacs on motorbikes. This spoilt the atmosphere rather. We did, however, see the \"Living Goddess\" - be aware photos are forbidden when she appears."
        }, 
        {
            "index": 139, 
            "rating": "5", 
            "review": "Amazing area of the city. It thought I was in China, the architecture of the houses was breathtaking. You can walk from the center to this area. Special atmosphere, love the experience."
        }, 
        {
            "index": 140, 
            "rating": "5", 
            "review": "Worth Visit. It a part of Dubar Square hence you can visit both place at a same time. It is worth visit here coz of its old architectural design. Cam loving persons could also make some nice clicks."
        }, 
        {
            "index": 141, 
            "rating": "5", 
            "review": "City of Temples. This is the iconic landmark of Kathmandu and definitely one of the must-do in the city. It is actually a complex of Hindu and Buddhist temple, government offices and even a palace where Nepal was once ruled. This is the historical heart of Kathmandu which has a lot of character. Entrance is 750 rupees, this includes visit of Hanumandhoka Royal Palace museum."
        }, 
        {
            "index": 142, 
            "rating": "5", 
            "review": "Great, crowdy and busy. For 750 Rps, you can see beautiful temples and very interesting (yet quite neglected at times) museum where you can walk through extensive exhibition about the Nepalese monarchy"
        }, 
        {
            "index": 143, 
            "rating": "5", 
            "review": "The hussle and bustle of the market. What can be more exciting for experienced travelers than negotiating outdoor markets. These markets are scattered around the temple complex, so one visit does double duty. Well worth a visit. I suggest you go in the early morning to avoid crowds and heat."
        }, 
        {
            "index": 144, 
            "rating": "5", 
            "review": "The best if Newari architecture. Entering the Hanuman Doka is entering another world. The Gurkha sentries are very handsome and their uniforms very attractive. The main square is used for ceremonial purposes. The carvings all around are the best in Newari art. A must see."
        }, 
        {
            "index": 145, 
            "rating": "5", 
            "review": "Not to be missed. Hanuman-dhoka or Durbar square is a world heritage site monument zone and show the fascinating architecture of the early period. There are about 40 different monuments or temples to be seen and you need to allow yourself time to look around and take it all in.The cost for foreigners is 750 rupees but the money goes towards maintaining the monuments and also towards supporting the living goddess who lives in the Kumari-ghar.Just outside the precinct is the old town and you can wander down the narrow streets with the shops that are filled with local products."
        }, 
        {
            "index": 146, 
            "rating": "3", 
            "review": "Bad Surprise. Yes, it is nice to pay it a quick visit, but if you dont have enought time, dont go.It could be a Wonderful place, but it is so bad mantained that it loses all its beauty. It is a pit!!"
        }, 
        {
            "index": 147, 
            "rating": "4", 
            "review": "It is a nice market place.. It is a nice market place. you can find out some arts of their traditions and many more. its also a way to go to a huge market place like bishal bazaar"
        }, 
        {
            "index": 148, 
            "rating": "5", 
            "review": "Fabulous Architecture. The Kings Place of Stay...great bath places and history...The Museum has the full details of events that happened and followed.."
        }, 
        {
            "index": 149, 
            "rating": "5", 
            "review": "You have to visit it. It is a key site in the visit of the city, is the most typical of their customs. Filled with candles, and buildings built for their gods."
        }, 
        {
            "index": 150, 
            "rating": "5", 
            "review": "Bazzar Palace. A very historical place of the former royal palace ground. Street shops selling nick backs, but all the temples, old houses and palaces around...out of this world!Though would be better with a smaller fee as in centre of town or for free!but take time to check out the various temples around and visit the museum in the former royal palace!"
        }, 
        {
            "index": 151, 
            "rating": "4", 
            "review": "better when it isn't raining. watch out for the local guide brigade. they will show you around, point out the highlights, but ultimately you end up looking at paintings or other merchandise."
        }, 
        {
            "index": 152, 
            "rating": "5", 
            "review": "old temple and squre. 10 minute walking from thamel reached this place.it called hanuman dhoka also.There are many kinds of temple likewise kumari devi,baghawati temple,kastmandap ,musium etc ,"
        }, 
        {
            "index": 153, 
            "rating": "4", 
            "review": "Nice place and lovely architecture. This is an impressive square with lots of old hindu and buddist monuments. Definitely a treasure for photographers. Don't rely on the Kumari's 9 O clock schedule. She often doesn't turn up :("
        }, 
        {
            "index": 154, 
            "rating": "3", 
            "review": "Kumari at Hanuman Dhoka Square. It is an assorted collection of old buildings and is the place where the \"Kumari\" - Living Goddess - lives and people visit Kumari Ghar to have her darshan. There is an image of Hanuman out in the open covered in vermilion and people worship the same. The old buildings are well-maintained and there are a number of small shops in the area where one has to bargain considerably before a purchase!"
        }, 
        {
            "index": 155, 
            "rating": "4", 
            "review": "Interesting place to visit. Hanuman Dhoka Sq. is on all counts very interesting, the downside is the bad restoration work and the slow pace in which it is done. looking at it you would think they had the architectural survey of India doing it by the look of all the bags of sand and cement being used, obviously no control on what you can or can't use to restore ancient buildings. Other negatives are the extortionate foreigner fees that are strictly adhered to in order to enter it, which boils down to nothing more than discrimination. If you don't have a good guide book then go buy one and avoid the bogus tour guides who are more interested in taking you to a healing bowl shop and trying to get you to part with 150 euros. the palace isn't up to much but if you need the exercise climbing up through empty room upon room then go for it, other than that it's really not worth it. Best time to go is at break of dawn where there is virtually no one around to spoil your photos."
        }, 
        {
            "index": 156, 
            "rating": "4", 
            "review": "Durbar Square is one of Three Durbars[Palaces] in Kathmandu. Hanuman Dhoka Square is located in Durbar Square near the Thamel area of Kathamnadu....I like the different styles of the buildings in Nepal...The Courtyard also has a museum. The buildings are beautiful and intricate carvings all over the structure."
        }, 
        {
            "index": 157, 
            "rating": "4", 
            "review": "Impressive structure with intricate carving. The Hanuman Dhoka Palace (Hanuman Dhoka Durbar in Nepali) gets its name from the stone image of Hanuman, that sits near the main entryway. 'Dhoka' means door in Nepali.The Courtyard also has a museum which was closed on the day of our visit. There are beautiful and intricate carvings all over the structure which is very impressive. It also has a small souvenir shop inside. The courtyard itself is a quite, clean and cool area."
        }, 
        {
            "index": 158, 
            "rating": "5", 
            "review": "Impressive constructions. This was one of the first places I visited and still am quite impressed. The amount of detail in the architecture is immense and the history of the site is very interesting as well."
        }, 
        {
            "index": 159, 
            "rating": "5", 
            "review": "Main square. A guide is really needed here, or you stand in danger of missing something, or of not really understanding the contexts. It is also useful in telling you the best time to visit the Kumari Ghar and to get to see the Living Goddess."
        }, 
        {
            "index": 160, 
            "rating": "4", 
            "review": "UNESCO Site. Wow...it was a 350 years site. It is a combination of sooo many tample at one place with a huge area to visit in one whole day."
        }, 
        {
            "index": 161, 
            "rating": "5", 
            "review": "Place to visit before you die. Hanuman Dhoka is a complex of structures with the Royal Palace of the Malla kings and also of the Shah dynasty in the Durbar Square of central Kathmandu, Nepal. It is spread over five acres. The Hanuman Dhoka Palace (Hanuman Dhoka Durbar in Nepali) gets its name from the stone image of Hanuman, the Hindu monkey god, that sits near the main entryway. 'Dhoka' means door in Nepali.Best evening/night hangout place in Kathmandu, NepalForeigners have to pay fee to visit this place."
        }, 
        {
            "index": 162, 
            "rating": "3", 
            "review": "Watch for overpriced tickets. Most of the sites you can just walk around for free. Beware of the ticket booths just outside the grounds that sell passes for 750 rupees to foreigners. One place worth seeing is the old royal palace with many photographs and exhibits where admission is only 30 rupees for foreigner. Beware that photography is not allowed inside the buildings."
        }, 
        {
            "index": 163, 
            "rating": "3", 
            "review": "Accpetable. Not much to say. Lots f people around. Almost got knocked down by a car n a bike. Am not sure why they would allow big vehicles right in the heart f square but thats the way it is. Accpetable visit if u have time 2 burn. Try it out."
        }, 
        {
            "index": 164, 
            "rating": "5", 
            "review": "Beautiful. A wonderful, historical place- love the architecture :) They used to have food/jewellery stalls in the courtyard in the evenings. Last visited in Summer 2012 but tripadvisor doesn't allow me to put that date. There's also a museum in the square."
        }, 
        {
            "index": 165, 
            "rating": "4", 
            "review": "Shop till you drop. What a place... The design is phenomenal.... It is a different world... There are lots of restaurant and shopping options.... The key to shopping is Bargain shamelessly..."
        }, 
        {
            "index": 166, 
            "rating": "4", 
            "review": "Street Shopping. Hanuman Dhoka is best for street shopping where we need to bargain very badly, pls quote 50% less than the actual amount, tourists are taken for a ride when comes to prices...'Kumari Ghar' a beautiful place to hang around..."
        }, 
        {
            "index": 167, 
            "rating": "5", 
            "review": "Central part of the city with amazing wooden architecture!. Must visit if you're in Kathmandu! Amazing wooden temples, great stone statues of gods, Hinduism and Buddhism fused to show the religious diversity in Nepal. Truly unique, go see it!"
        }, 
        {
            "index": 168, 
            "rating": "5", 
            "review": "Knowledge and peace. Hanuman dhoka is very good place to learn in detail about the Shah dynasty. and surely a very peace place to hangout."
        }, 
        {
            "index": 169, 
            "rating": "5", 
            "review": "An Old Royal Place. I like to visit this place every time I am in Kathmandu as this place has everything. From millions of pigeons to old erotic positions of Kama Sutra on the Temples to handmade local merchandise to modern girls. A must visit place."
        }, 
        {
            "index": 170, 
            "rating": "5", 
            "review": "Museum visits. This time had time to visit the museums and learn in detail about the Shah dynasty. The palace and monuments are closely guarded by the Royal Nepal Army (not royal anymore)."
        }, 
        {
            "index": 171, 
            "rating": "5", 
            "review": "A charming place to witness. it seems every little knock has something exciting and fascinating to explore in this city, and Dhoka square is no different. you may think they they all look alike if your interest or passion in this area is not at its fullest, but take the time to research and learn before exploring and you will find a new passion in finding every little temple and exhibition that Kathmandu has to offer."
        }, 
        {
            "index": 172, 
            "rating": "5", 
            "review": "Back in time. You really feel like you have been thrown back in time, what a great place to experience what KTM is all about. Definately a must see, although you could be here for hours! Lots to take in. Recommend bringing lots of water and a spare roll SD card!! You not only take photos but need to take a video to really capture it all"
        }, 
        {
            "index": 173, 
            "rating": "4", 
            "review": "The cultural side of Kathmandu. Some part of the square is under renovation. The best part of this place is the museum. It is interesting and worth visiting. You need to have time to go walk through the palace museum."
        }, 
        {
            "index": 174, 
            "rating": "5", 
            "review": "Palace Temple & Museum. Palace, Temple, Museum & Kathmandu Police head Office. can enjoy with a lot crowd .....A best cultural Hub..............Just can say Beautiful"
        }, 
        {
            "index": 175, 
            "rating": "5", 
            "review": "Whats a Beautiful Place. Monkey door square just tries to convert the convert nepali Name (Hanuman Dhoka Square) into English. This place is very historical place of the kathmandu valley."
        }, 
        {
            "index": 176, 
            "rating": "5", 
            "review": "Must see Cultural and Historical Activity in Kathmandu. A jam packed area, filled with a number of important Nepali historical temples and buildings. A definitely must see when in Kathmandu. A lot of historical, cultural and religious knowledge to be learnt from the area, must use a guide, guide book or research."
        }, 
        {
            "index": 177, 
            "rating": "4", 
            "review": "Nice Museum. It Is One Of The Place Where We Can See Personal Things Of King And Queen.Actually It Is Inside Khatmandu Durbar Square."
        }, 
        {
            "index": 178, 
            "rating": "5", 
            "review": "Great place to know Nepalese culture. The square has amazing architecture of Nepalese culture and one gets to see the diety Lord Hanuman and Lord Narsimha and temple of Lord Shiva. There are artifacts n handicrafts for sale. It is a must visit place in Kathmandu"
        }, 
        {
            "index": 179, 
            "rating": "5", 
            "review": "THOKA in the TELEGU(Indian) dialect means tail (of an animal). The statues and carvings,the HINDU statues and Idols must havebeen a painstaking venture and adventure for the myriad, lowly-paid albeit highly-skilled sculptors."
        }, 
        {
            "index": 180, 
            "rating": "4", 
            "review": "Beautiful architecture and history of Nepal. This is a great landmark of Nepal. Beautiful buildings and temples, with some cafes too! Definitely worth a visit."
        }, 
        {
            "index": 181, 
            "rating": "5", 
            "review": "Great Buildings, not well maintained. It was great to see the architecture however we were disappointed that the buildings had not been well maintained."
        }, 
        {
            "index": 182, 
            "rating": "4", 
            "review": "Historical area with good museum. This is a lovely area to visit in Kathmandu. One learns and sees a lot about what Kathmandu must have been like centuries ago. The architecture is lovely and an audio tour is available to give more information. Most definitely worth the visit!"
        }, 
        {
            "index": 183, 
            "rating": "4", 
            "review": "Great museum. Nice place to get to know the history of Kathmandu as a city n influence of the rulers as kings. Audio tour is quite good."
        }, 
        {
            "index": 184, 
            "rating": "5", 
            "review": "nice place. It was a little crowded, so many locals, especially youngsters passing time sitting in the stairs of temples, it was really nice experience.."
        }, 
        {
            "index": 185, 
            "rating": "4", 
            "review": "one of the most historical spots in KTM. This is the old royal palace and full of historic buildings and a museum. Really gives you a feel for what Kathmandu was in the old days. I visited it twice during my recent visit to Nepal, it's a good place to hang out and watch the activities."
        }, 
        {
            "index": 186, 
            "rating": "5", 
            "review": "Kathmandu Municipality is not taking care as just they are charging . Tea shop situated in the sqaure is worst.. Concerned authorities are sleeping to maintain such a lovely place. They dont know the value of what we have.\nPlease write your view to give pressure to maintain it.\nShould be clean without vehicles."
        }, 
        {
            "index": 187, 
            "rating": "5", 
            "review": "city sightseeing. the historical palace and recognized by World Heritage Site,,you will see ancient temples,,,the temple made by one wood,,the temple of Living Goddess Kumari,,wonderful arts & architecture crafted in wood of temples and palace,,at the centre of city,,easy to travel,,"
        }, 
        {
            "index": 188, 
            "rating": "3", 
            "review": "Frantic and crowded. Like the adjoining Kathmandu Durbar square, a place where human flesh is pressed en masse and you are strongly urged to part with money. But the temples are amazing if you can focus on those"
        }, 
        {
            "index": 189, 
            "rating": "4", 
            "review": "Nice .. loved it!. This place is very historical. I loved it. The area was big and we see local people lifestyle. The big temples and sooo many old cultural buildings to see. we loved it...!!!"
        }, 
        {
            "index": 190, 
            "rating": "5", 
            "review": "Awesome. This lies on one side of the Kathmandu Durbar Square. The entrance lies beside the centuries old idol of Hanuman There is a ticket for this place. You will have to enter the museum first - to me that was a waste of time because the only exhibits are personal effects and pictures of the erstwhile Nepal kings. However, after the museum, you come to the Hanuman Dhoka and that is marvelous. The square is dominated by the nine-storied palace. You can climb to the very top and check out the scenery through the windows. A word of caution - the stairs are quite narrow and dark, so be careful while climbing. The square and the palace are must sees for Newari architecture."
        }, 
        {
            "index": 191, 
            "rating": "4", 
            "review": "Fantastic to film....but tourist hotspot. The buildings were mangnificent. Lots of places to climb to get better angles. Surrounding neighborhoods are really amazing and worth trekking through.\nBut near square is tourist hotspot. So you are bombarded by beggars and merchants."
        }, 
        {
            "index": 192, 
            "rating": "3", 
            "review": "Hang Out Place in Kathmandu. Good place to hang out, though not very clean as it looks in pictures. View from the top of these structures is marvellous. Not much to do but just sit and relax."
        }, 
        {
            "index": 193, 
            "rating": "4", 
            "review": "best place in kathmandu center. the best place to visit in kathmandu city center full of tourists,people and caos! Don't forget to see the living godness...very particular !!!"
        }, 
        {
            "index": 194, 
            "rating": "5", 
            "review": "Fascinating. A place not just for tourists as the locals hang out in the evening and there's also a vegetable market. The view from any of the rooftop bars is amazing."
        }, 
        {
            "index": 195, 
            "rating": "5", 
            "review": "Old Darbar of king. Nice place to hang out in evening. Good place to go with friends. Also have a old white-house of Nepal."
        }, 
        {
            "index": 196, 
            "rating": "4", 
            "review": "Shopping centre. Near to Hanuman Dhoka, you also have many restaurants and shopping area. Must visit one of the roof top restaurants."
        }, 
        {
            "index": 197, 
            "rating": "4", 
            "review": "City of Temple. second day of Kathmandu, we went in around 10 am in Kathmandu durbar square , i feel like i am in heaven , many temple, tall small, beautiful wooden carving , traditional market and We got chance to see living goddess Kumari in Kumari temple . Its beautiful."
        }, 
        {
            "index": 198, 
            "rating": "4", 
            "review": "Temples everywhere. There is a small entrance fee for most of the sight seeing and it seems a lot except 40-50 rupees is only 25p or about 40 cents"
        }, 
        {
            "index": 199, 
            "rating": "5", 
            "review": "cannot miss to see this place. Amazing atmosphere, very ancietn architecture. People everywhere. Nice to observe the culture and religions here. Very special place for Nepalese ppls."
        }, 
        {
            "index": 200, 
            "rating": "4", 
            "review": "History remains. I liked the sense of history in this square - all the wonderfully preserved temples. The crowds were not overwhelming and we weren't hassled by street vendors. Lovely to see locals using the temples. We had lunch on a roof top overlooking the square which should be considered as we enjoyed watching the people - locals and tourists - and enjoyed the very old structures."
        }, 
        {
            "index": 201, 
            "rating": "4", 
            "review": "Historical Place. this is world heritage place has own historical value. but must of the buildings should renovate with its beauty, can be more clean. still attracting tourist, but management part is week ."
        }, 
        {
            "index": 202, 
            "rating": "4", 
            "review": "beautiful but crowded. if you don't mind the crowds and pushy vendors this is worth the visit. some cool architecture and sights."
        }, 
        {
            "index": 203, 
            "rating": "5", 
            "review": "Kathmandu - Hanuman Dhoka Square - Fascinating. This is part of the larger Durbar Square area and has some amazing buildings and monuments. The detailing in the architecture is superb and you could spend ages walking round examining every inch and still be in awe. The only down side for me though was the street peddlars who don't seem to give you a minute chasing after you selling their wares. But if you ignore them then you will be amazed at the whole area. The nine story structure above the museum is a climb to remember with all forms of stairs and details and the view from the top is brilliant. The museum itself offers a wonderful insight into the recent kings of Nepal although I did feel it went on too long and could have been just as impressive if it were cut in half ( time it takes to see it all ). Also watch out for the pigeons in this are as they can be a bit disturbing when they all fly off at once. Great memories of a great place."
        }, 
        {
            "index": 204, 
            "rating": "5", 
            "review": "The Hanuman god and the beautiful square.. Hanuman Dhoka square is really unique in a sense that it has always been able to define its existence through the dazzling arts, crafts and culture that has been prevailing there. It has a beautiful aura that hits us so sublimely. This place is really beautiful and the arts and crafts are definitely beyond words."
        }, 
        {
            "index": 205, 
            "rating": "4", 
            "review": "Morning time bery nice. Its very nice place to visit weather i want to see the architecture, people watch, shop or just relax on the steps of one of the many temples. Make sure to take the square."
        }, 
        {
            "index": 206, 
            "rating": "4", 
            "review": "Evening is best time. I have been here many many times but I love to hang out with my local friends here in evening. Specially during power cut, the place looks astonishingly beautiful. Best thing I like is stone paved road, street food and sitting everywhere. There are no benches or chairs but you make your sitting anywhere you look(not on the road itself of course :))"
        }, 
        {
            "index": 207, 
            "rating": "4", 
            "review": "Very enlightening. late Feb-Mar 2013 (best season)Nice square to visit, lots of history. There is also a building in the middle of square with mixed architecture of Western style and Nepal style, a reminder of the past. We were given a tour in the market area surrounding the square, where shops catered to local needs and livelihood. Butcher, steel-smiths among others. Interesting to have some insights into the livelihood of locals and realising that life is about the same wherever you are. Natural/organic livestock and farm products are getting rare and pricey. Certainly recommended to take a walk unless you are not interested to observing a different way of life."
        }, 
        {
            "index": 208, 
            "rating": "5", 
            "review": "a step back in time. Its an nice place to visit weather you want to see the architecture, people watch, shop or just relax onthe steps of one of the many temples. Make sure to take a walk down freak street just beside the square."
        }, 
        {
            "index": 209, 
            "rating": "4", 
            "review": "Surprisingly good!. We actually thought this would be a quick visit, but the museum located here was much more interesting than we imagined it would be. Perhaps because we knew so little about Nepalise history before we went, but the stories of the last three Kings were genuinely fascinating."
        }, 
        {
            "index": 210, 
            "rating": "3", 
            "review": "It was alrite... Very busy place, mostly young crowd hanging out there, Lots of pigeons, just a short and cheap form of bhakatpur."
        }, 
        {
            "index": 211, 
            "rating": "4", 
            "review": "Walk up one of the buildings for a nice view of the city. This square is similar to me as the other Durbar Squares in and around Kathmandu, but we walked up one of buildings that was nine stories and got a wonderful view of the city and the valley surrounded by it."
        }, 
        {
            "index": 212, 
            "rating": "4", 
            "review": "Stumbled on this while walking, and what a great find!. This square is huge and you can spend hours roaming the alleyways and looking at the hundreds of things for sale. The place is a maze of streets, shops and vendors, not to mention temples and historic heritage attractions.You can venture to the roof tops for a beverage and enjoy the views from a birds eye advantage. Bring two lenses, normal and a zoom. You'll be glad you did."
        }, 
        {
            "index": 213, 
            "rating": "5", 
            "review": "World best place. The Durbar is divided into two courtyards, the outer comprising Kasthamandap, Kumari Ghar, and Shiva-Parvati Temple, and the inner consisting of Hanuman Dhoka and the main palace. It also houses two museums. Important ceremonies, including the coronation of the Nepali monarch, are held in the Kathmandu Darbar Square. Most parts of the palace premise are open for tourists throughout the week during office hours."
        }, 
        {
            "index": 214, 
            "rating": "5", 
            "review": "Interesting Historical Place. The old designs of the buildings were amazing. The place is very old and people everywhere. It is interesting to observe other cutures and their relgions. This place is very specail for the Nepalese people."
        }, 
        {
            "index": 215, 
            "rating": "5", 
            "review": "nice square. Hanuman dhoka is a nice place to visit.There are so many historical arts in this square.Very historical place.I recommed this place to visit."
        }, 
        {
            "index": 216, 
            "rating": "5", 
            "review": "Traditional Nepal of Herge style!. If you have ever read Tintin In Tibet by Herge you will recognise the area around this place! Start off at what is still called Durbar Square. Since I lasst saw it in 2006 it has been tidied up. The hustle and bustle is gone and it is now getting sanitisedI wonder what Captain Haddock would say if he was to return to Kathmandu!"
        }, 
        {
            "index": 217, 
            "rating": "5", 
            "review": "view from Mahadev-Parbati temple around the palace. I really like to see people walk aroound the temple.. Perfect place to visit ! Do not miss to visit Hanuman Dhoka Square. Close to walk from busy Thamel. I prefere to see artsand carving in the temple."
        }, 
        {
            "index": 218, 
            "rating": "3", 
            "review": "Strictly Okay!. I went there with high hopes, but was disappointed. The place needs urgent maintenance and care.If it is restored properly and cleaned well, it can be one of the best places to visit in Kathmandu.Since this is quite close to many other tourist places, I advise to visit here anyways and spend a little time in any case."
        }, 
        {
            "index": 219, 
            "rating": "5", 
            "review": "Tourist destination. As I live in Kathmandu, I visited this places many times but hardly managed to go inside. The area is popularly known as Kathmandu Durbar square and one of great destination for tourits where you can see old, traditional and culturally inherited temples and houses around. The are of on wooden portion of temples are something that you must see. Really crafted nicely. This area is also popular for buying varietis of handicrafts but don't forget to bargain as much as you can do....."
        }, 
        {
            "index": 220, 
            "rating": "5", 
            "review": "Needs Help. I really liked this square and would like to return but...it is in dire need of restoration. Most of the historical sites either need restoring or \"roping\" off to keep the public from destroying it more."
        }, 
        {
            "index": 221, 
            "rating": "3", 
            "review": "it's ok. it's ok but it's very crowd. and the police and Ticket officer it's not nice , I and my friend feel a little disappoint there"
        }, 
        {
            "index": 222, 
            "rating": "5", 
            "review": "Kathmandu's Durbar Square. This is where the city of Kathmandu got started. There are many buildings & temples and lots of activity. We went to the Kumari Bahal, and saw the Kumari, the Living Goddess, who comes to a window once a day, I guess. No photos were allowed but I got a postcard of her. The whole area is an interesting place to visit."
        }, 
        {
            "index": 223, 
            "rating": "5", 
            "review": "magnificent sculpture. The entire place has a wood structure. This is very old and magnificent. its is amazing. This has nine floors. In olden days without any nail how can the structure can be made. The carving done on the wall are excellent. This is really worth to see."
        }, 
        {
            "index": 224, 
            "rating": "3", 
            "review": "Interesting sight within the Durbar Square area. This sight along with it's museum is included in Durbar Square entrance fee, but there are a few areas where photos are not allowed. Worth seeing if you intend on visiting the square, allowing about 30-45 minutes for an extensive visit.(NB: When you get the entrance ticket to Durbar Square - inclusive of an area tourist map, go a get the cheap extensions which are in variable amounts. This allows you for revisiting or just taken your time over a couple of days.)"
        }, 
        {
            "index": 225, 
            "rating": "4", 
            "review": "The old Palace. Hanuman the monkey god, he sit's out side the old palace you will reconise him as he is covered in hundred's of years of vermillion. Some very interesting Temples with their sexualy explicit carvings. You might see some Sadu's but they will not let you take a photo un less you pay them.The palace is a no go area for foreigners but you can look in from the entrance and see some amazing carvings that go back hundred's of years. Refer to your Lonley Planet of Nepal for more information."
        }, 
        {
            "index": 226, 
            "rating": "4", 
            "review": "Great architecture. There are lots of beautiful temples, a public water-collection station, and great people-watching. We enjoyed our time at Dkoka Square, however, I would not put it in the top three sites to see in Kathmandu."
        }, 
        {
            "index": 227, 
            "rating": "4", 
            "review": "very amazing. you will be surrounded wth very beautiful old architectures there. we also visited the museum on different floors which was amazing as well."
        }, 
        {
            "index": 228, 
            "rating": "5", 
            "review": "Great visit. Also another tourist place where they go to take pictures. A place still well preserved from its ancient times."
        }, 
        {
            "index": 229, 
            "rating": "5", 
            "review": "Don't miss the morning. Early morning is the best time to come here if you whant to experience real feel of Nepal"
        }, 
        {
            "index": 230, 
            "rating": "5", 
            "review": "A Must visit in Kathmandu. When in Kathmandu, make sure you visit this old durbar square, the old shah palace museum. Enjoy the hustle bustle of Basantapur. Stroll around the famous Freak Street of the Hippie Era... See the Kumari, the living goddess with your own eyes..."
        }, 
        {
            "index": 231, 
            "rating": "5", 
            "review": "Will always hang out here. Ancient, atmospheric, lots of spaciousiouness and places to sit upon the steps of its temples and dream or spectate after the noisy and usually crowded streets of Kathmandu. This is an abode of the Gods"
        }, 
        {
            "index": 232, 
            "rating": "4", 
            "review": "Good site. It was good site but very crowded during the day."
        }, 
        {
            "index": 233, 
            "rating": "4", 
            "review": "Very crowded!. This area is seems like walkway for the people, the street is full with people walking!"
        }, 
        {
            "index": 234, 
            "rating": "3", 
            "review": "Old is Gold. Kasta Mandap -Known locally as Maru Sattal, this huge, open temple has a long history. Popular legend has it that during King Laxmi Narsingh's time Kalpa Briksha came to see the chariot festival of Machchhendranath, where he was recognized by one of the priest of Machchhendranath, The priest seized him and refused to release him until he promised to give a tree from whose wood a rest house could be built. Kalpa Briksha made the promise, and so he was released. Four days later, a huge sal tree was delivered. With the King's permission, the Kastha Mandap was built from the wood of this single tree; Kathmandu has derived its name from Kastha Mandap.A three-storyed building, Kastha Mandap has an open ground floor, underlining its original purpose as a public building. The decorations and carvings added over the years have greatly enhanced the original design, bringing it closer to the appearance of a shrine. The central image in Kastha Mandap is of Gorakhnath. At each of the four corners is an image of Ganesh, the elephant-headed god.Kumari:The Living Goddess sometimes appears in one of the first-floor windows, especially if her handlers are paid well enough, and is said to answer devotees' questions with the expressions on her face. She is most likely to appear in the morning or late afternoon.Festivals and EventsThe most important festival for the Kumari is Indra Jaatra,a celebration of the harvest held in late August or early September. On the third day of the festival, the Kumari Devi is carried around Durbar Square in a chariot. The chariot is kept next door to the Kumari Ghar and the great wooden yokes from past years are laid out nearby.In a tradition established by King Jaya Prakash Malla(builder of the temple), the Kumari also bestows a tika(mark of blessing) on the forehead of the king who would reign in the coming year. This tradition was used against the king within a year: he was driven into exile on the even of Indra Jaatra in 1768,allowing the conqueror to take the tika and become the rightful king."
        }, 
        {
            "index": 235, 
            "rating": "5", 
            "review": "Historical area.. here you can see the real historical steps at museum , located in Hanuman Dhoka."
        }, 
        {
            "index": 236, 
            "rating": "3", 
            "review": "OK, but not more. The temples in the square are nice and interesting. The square itself is unfortunately chopped up by the large expansion of the formerly royal palace, which makes the square kind of weirdly laid out. However, the principal problem is that the square is filled with guys who want to be your guide, people who want to sell you stuff, and beggars. So many that it's hard to stand still to look at things. Bhaktapur and Patan Durbar squares are both less busy in this sense (not free of these things, but much less all-intrusive), and both squares are architecturally better. Frankly, I would not visit Kathmandu Durbar square again, but I would visit the others again."
        }, 
        {
            "index": 237, 
            "rating": "5", 
            "review": "nice buildings. buildings were very nice and old. all the carvings and handicrafts of those temples and palaces was very very nice. but it should be maintained properly."
        }, 
        {
            "index": 238, 
            "rating": "5", 
            "review": "Excellent Museum !. If anyone interested to know the historical things and history of kings in Nepal you could go to this place. You can lose one day exploring this museum."
        }, 
        {
            "index": 239, 
            "rating": "4", 
            "review": "It seemed impossible for someone to have build such imposing structures more then a thousand years ago.. The laid back lifestyle of the locals,the smile that never faded from their faces & the silently beautiful nature,to give a unique identity of the state,it was a real treat to watch the united excitement & enjoyment of the people the places are worth to visit."
        }, 
        {
            "index": 240, 
            "rating": "1", 
            "review": "Too many street vendors and vehicles in the Durbar Square area. Hanuman Dhaka Square is usually known as Kathmandu Durbar Square, which used to be street vendor and hassler and vehicle free area. But now there are too many street vendors, street hasslers and vehicles are allowed drive in the square area; all of the above makes the Durbar Square experience an unpleasant experience. The streets are narrow and there are no footpaths; so the vehicles drive within few inches to people's feet, a very dangerous situation. We were group of 17 and 18 with city tour guide and were very bothered by all of the above.Our future groups will not visit Kathmandu Durbar Square unless the Kathmandu City administration works to take care of the unwanted issues and activities to keep its Cultural World Heritage status given by the UNESCO."
        }, 
        {
            "index": 241, 
            "rating": "3", 
            "review": "Need some change. I have been many times over there with friends just hang out in the evening place is nice but they need to clean more much much. Because on side there is some garbage looks mess by local people. but one thing is change no more vehicle during the day time."
        }, 
        {
            "index": 242, 
            "rating": "5", 
            "review": "Good. \\It's nice to walk around,viewing the beautiful buildings and looking at all the people"
        }, 
        {
            "index": 243, 
            "rating": "4", 
            "review": "Very impressive. If you like temples - this is the place - quite overwhelming. We saw many different examples and were lucky enough to catch a glimpse of the \"Living Goddess\", she, in my opinion, is not so lucky to live such an isolated existence. Enjoyed the bartering in the market place"
        }, 
        {
            "index": 244, 
            "rating": "4", 
            "review": "Worth seeing. I enjoyed the old palace, realising that until the 1950ies the Nepali kings lived in quite medieval condtions. Very interesting indeed, with a lot of history having happened there. Get a good guide, a professional, maybe recommended by your hotel. Not one of the many pests encroaching you all over Durbar Square."
        }, 
        {
            "index": 245, 
            "rating": "5", 
            "review": "A Must-See Place in Kathmandu. Many pagoda temples and statues, wood-carving etc. early morning misses the tour groups and gives good light for photography. Same for later in the afternoon. The Kumari (living goddess) may appear at her palace window around 11.00 or sometimes around 16.00, but it cannot be guaranteed. Climb the steps of the octagonal Krishna temple for a good photograph of the temples of Hanuman Dhoka below. If you can time your visit for a festival day, so much the better."
        }, 
        {
            "index": 246, 
            "rating": "4", 
            "review": "Cultural Experience. This is in the middle of the larger Dunbar Square (actually i guess it's possible that it's just next to). It was definitely interesting to see the clothed statue of the Hanuman (monkey god)."
        }, 
        {
            "index": 247, 
            "rating": "5", 
            "review": "Hanuman Dhoka: The Palace protected by Hanuman, must visit. Hanuman Dhoka durbar is in Kathmandu durbar square. There are several ancient buildings in Kathmandu Durbar square. Hanuman Dhoka got its name from the statue of monkey god Hanuman at the entrance of the palace (hanuman means the monkey god + dhoka means door in Nepali). The building was a former palace of Malla kings of Kathmandu. Now it is converted as a museum that has huge collections of things related to shah kings Tribhuwan, Mahendra and Birendra. It is divided into three sections, first section is of Tribhuwan second of Mahendra and the third section is of Birendra who was assassinated with his family in 2001. There are so many things of these kings their personal goods, beds, important pics, weapons and even the medals and awards they were honored by other nations. There are two gold royal thrones. One of them was used by the shah kings for their coronation purpose. The coronation of shah kings was held in the inner courtyard of hanuman dhoka palace. Though the palace was built during Malla period but one of the buildings is made by shah king Prithivi Narayan Shah. This palace is known as nine storyed palace of Basantapur. One can go to the top floor of this palace from where you can see beautiful views of Kathmandu valley. No camera is allowed to take along and take pictures, you have to submit your belongings in a locker, however mobiles with camera are allowed but suggested to switch off (most people do not off their mobiles and also take pictures at the top floor of nine storyed palaces.)Army in traditional attire of then capital of Shah Kings still can be seen at hanuman dhoka. These armies are called GURUJU KO PALTAN and these are mostly marched in processions during festivals. There are few other significant temples in the surrounding like Kumari Ghar, Kasthamandap, and Taleju etc. The wooden supports of the roofs of the temples around the Hanuman dhoka are nicely carved with various sexual postures. It was believed that such carvings would protect the temples from thunder and lightening. Such postures are also one of the important aspects of Tantrism.Just within few paces from the Hanuman’s idol near entrance, there is a stone inscription of king Pratap Malla which is written in 14 languages. These languages include Urdu, English and French also. Use of these languages before five hundred years ago is really interesting and amazing.There is another temple of Shwet bhairab that usually remains closed except during Indra Jatra. You can peep in through the doors carvings and see the grand image of Shwet Bhairab.Kumari house is full of beautiful carvings in wood. Kumari can be seen during Indra Jatra festival only when she is taken out of the house on a chariot. However you can get glimpse of her when you are in the courtyard of Kumari house at 4 p.m. everyday. Kumari is the living goddess of Nepal. A girl from Newar community is chosen for Kumari. She undergoes various tests to be the goddess. She is worshiped by all Nepalese as the living goddess. The kings used to go to see kumari to get her blessings. She remained as the goddess till she gets her first menstruation. I highly recommend to visit hanuman Dhoka while in Nepal"
        }
    ]
}