{
    "category": "Kathmandu", 
    "entity": "Spas", 
    "avg_rating_stars": 4.861990950226244, 
    "review_count": 442, 
    "rating_stats": {
        "poor": 4, 
        "average": 2, 
        "terrible": 2, 
        "very_good": 37, 
        "excellent": 397
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "Astounding massage. I was just in for a 90 minute massage with Santosh. I myself am a massage therapist from Canada, so I can be tricky to please. He offered very deep pressure and accurate palpation to find all of my trigger points. All of the therapists at seeing hands receive extensive training in massage therapy (and even some chiropractic training) from the UK. I was surprised to receive an adjustment at the end, but felt safe and adjusted easily after the massage. I wouldn't go anywhere else and will return many times while I visit Nepal. They offered dim lighting, a comfortable massage table and music. The price is great for the quality. It's always nice to leave a little tip if you feel they are deserving for their great work."
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "Sports massage. My husband and I came to Seeing Hands after doing a 2 week trek. My massage therapist was Santos & he was great at being attentive, focusing on the areas of need, & very professional. The staff were all very friendly and efficient. I will come back here when I come back to Kathmandu. My husband really loved his massage as well, he had a guy as well, I think his name was Ganga."
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "WOW !. One of the best massage I had in my Life ... what a wonderful expérience.I found this place from trip adviser.This tiny young woman greets me and when she started I couldn't beleive the streinght she had in her hands.I could feel her lifes strenght and challenge from her hands.I started to cry, I was overwhelm by this unique expérience.This place is fantastic.Her name is Bhima"
        }, 
        {
            "index": 4, 
            "rating": "5", 
            "review": "Thank you Bhima. Thank you to Bhima and her talented little hands... My shoulders are very sour now but Im gonna sleep Well tonight and I am looking forward to come back for a 90min swedish massage to relax the tension a bit more."
        }, 
        {
            "index": 5, 
            "rating": "4", 
            "review": "Wonderful massage!!!. I spent the last day in my two-month trip to Nepal doing massage at Seeing Hands Nepal. After refering to another very expensive massage spa then walking around to find the right location in a quiet corner of bustling Thamel without booking in advance, I was welcomed by the warm hospitality of all staff in Seeing Hands.Same to many of you guy who tried several kinds of massage in different countries, I was surprised at how professional the staffs in the clinic are. My masseuse (Her name is Bhima, I suppose) knew exactly where I got hurt and gave me useful advices. It was amazing when my serious headache reduced much right after the massage. My flight back to homeland was better thanks to her skillful hands. Thank you for such a good experience! It's always worth a try to give support to real social enterprise like Seeing Hands Nepal."
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "Amazing experience!. The therapist were amazing! It was the first time that I had sport massage but my sister who had several times in London said that this was by far the best! Don't hesitate by the look of the reception. Kindly ask the therapist to walk you at the massage rooms, there you will see that it's clean and comfy.There is a music as a background (I read reviews that said there wasn't) but sometimes you get some noise out of the window.. busy Thamel though! You must visit!!!!"
        }, 
        {
            "index": 7, 
            "rating": "5", 
            "review": "Wonderful. Cannot more highly recommend this clinic. My female massage therapist was most accomodating and professional. Lovely and simple facilities. Delightful."
        }, 
        {
            "index": 8, 
            "rating": "5", 
            "review": "BEST MASSAGE EVER (I get a massage once a month) . I am from Canada. I've had massages all over North America and a few in Nepal. This is by far the best massage I have ever had. I tipped my masseuse the price of the massage itself. She found all my trouble spots IMMEDIATELY and got rid of all of them. I had the very popular woman masseuse I think her name was Litska or something like that. It is written in some other reviews here! Either way, the bunch of them are so lovely and amazing. I had a hoot talk to them before my massage. They are very smart! You MUST try this place if you are looking for a massage."
        }, 
        {
            "index": 9, 
            "rating": "5", 
            "review": "An amazing experience!. I am exposed to different massages from different parts of the world and yet, this one left me with a stunning surprise and humble experience. The seeing hands clinic is run by a number of visually challenged fantastic human beings. They are outstanding in feeling your knots and working on them individually until they are sorted. The enthusiasm and positive energy these people bring in you are priceless. This is million dollar experience for anyone. This is an experience of a lifetime and i strongly recommend you don't miss it while in Kathmandu."
        }, 
        {
            "index": 10, 
            "rating": "5", 
            "review": "Wooooooow!. These people are amazing! Massage was above all expectations and they were very kind. They can really \"see\" with their hands! My recommendation to anyone who comes to Kathmandu "
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "Amazing. What an amazing business. Laxmi was my masseuse and I would highly recommend her. Two hour massage for $3400npr."
        }, 
        {
            "index": 12, 
            "rating": "5", 
            "review": "Amazing. A must do, great sports massage needed after a month of intense yoga and pre trek. Highly recommend. Great cause too!"
        }, 
        {
            "index": 13, 
            "rating": "5", 
            "review": "Best Massage in Town. Even if you don't do massages, go here and get one !In KTM you do need one and this is the best place !Very affordable prices and the people there are great.Very friendly and they all studied massaging. Very professional.The place is a two story house and very clean.If you don;t have an appointment, you're probably lucky to get a free slot.One day they even accepted me after it was officially closed !"
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "Excellent experience. Coming back to Kathmandu from the difficult trek , having some problem with my knee we booked 90 minutes massage. Wow. one of the best my experience in Nepal! Staff is very professional and friendly. Room is very clean. I can say their hands brought us back to life!!!!"
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "Fantastic!!. My husband and I made an appointment, but showed up 2 hours before and could be massaged right away. The two boys massaging us were great; perfect pressure, perfect level of chatting, everything nice! Can really recommend this to anyone. It's nice and clean. The price is really good and the people are extremely nice. Must do!"
        }, 
        {
            "index": 16, 
            "rating": "5", 
            "review": "BEST 27 dollars I spent during this trip!!. I was not in the mood for a massage but my girlfriend insisted to go here so we went , it's been the best massage I've had in my life , Santos the guy who was giving me a massage asked if I have any particular pain in my body, so I told him about the issue I had in my left hip that goes down my left leg, so he asked me questions while massaging my hip and legs and doing some tricks , so he diagnosed me for having a SCIATICA , so when I went to see my physiotherapist He said Thats exactly what I have .Now I'm on therapy and I don't have any more pain thanks to him . I never write reviews but these guys really know what they are doing and they are great at it . Pay them a visit. You won't regret it :)"
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "Magic Hands!! Best Massage!! Excellent!!!!!!. Hands down the best massage I have had anywhere in the world!!!!! My massage therapist name was Vhima. Her hands were like magic!She found all my problem spots within the first 30 seconds without me even telling her.I've had back and shoulder problems most of my life and she done the most amazing job of making me feel normal again. She was always asking if I needed more or less pressure. I took the sports deep tissue massage for 90 minutes and it was the best money I've spent on my health. The clinic doesn't look much from the outside but it's very clean and the money goes to a great cause. The massage therapist are professionally trained and you won't regret your decision going here. Enjoy :)"
        }, 
        {
            "index": 18, 
            "rating": "4", 
            "review": "An excellent massage and a very different experience!. I had a wonderful 90 minute massage here in June of 2016. The masseuses were professional and kind, and I was very happy with my experience. It was definitely a different massage experience than I was used to, however- the lights are on, there is no music except the sound of the fan, you can hear the traffic and noise from the city around you, and the masseuses may make conversation with you throughout the massage. Don't let that discourage you though, it is well worth your time! I certainly look forward to going again in the future."
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "amazing massage- would have gone back if it wasn't my last day in town. My boyfriend and I did the 60 minute sports therapy massage. The facilities were super clean and comfortable, and that's saying a lot for Kathmandu. The restroom in reception had toilet paper! This is like spotting an endangered species in Nepal. We were in a room together for our massage. Our two masseuses (sp?) were friendly and super nice. Excellent conversational English. They laughed at my boyfriend's corny jokes. They seemed overall very dedicated and happy to do this work. Ganga was my masseuse. He worked out only about a zillion knots in my back and shoulders in a really short time. It was painful but amazingly rejuvenating. I was making all sorts of wimpy noises throughout, which we were all laughing about. I liked that the atmosphere was relaxed & not stuffy, like some USA spa/massage places can be. Afterwards, when we were paying at reception, some of the other masseuses (sp?) were in the room and all super friendly, asking if we enjoyed ourselves and where we were from. It happened to be our last day in town but had we visited earlier in our trip, I would have no doubt gone back. Ask for Ganga, he murdered my body (in a good way)."
        }, 
        {
            "index": 20, 
            "rating": "5", 
            "review": "Really the best massage I've ever had by Laxmi. I don't usually leave reviews on tripadvisor although I've travelled to many countries. However, I really wanted to leave a quick note about this place. It's a small 2-story establishment in Thamel (be patient, you will find it, it's located at the end of the street and has a big sign) that is run and serviced by the blind. A colleague and I got one massage each and we both agreed that they were the best massages we both have ever experienced. First, we were running a little late due to the really bad traffic in Kathmandu and we also got a little lost on the way. I called and the person who answered the phone (who also did the massage on my colleague) gave instructions to our driver (while being blind!) and him and his wife waited for us to get there. Jaxmi worked on me, and I was a bit hesitant, because I've had lower back and hip issues, however she could tell exactly where all of my issues were without me saying a word. Their sense of touch is absolutely incredible. She said I could probably get rid of most of my issues if I had 2 or 3 more sessions and I think there might be some truth to that because my body felt incredible revived afterwards (and also tired). I will be sure to go back to them the next time I go to Nepal, becuase of the high quality of work that they do. I highly recommend it and hope folks like me will support this establishment because they really do an amazing job, sight or no sight."
        }, 
        {
            "index": 21, 
            "rating": "5", 
            "review": "Great massage by extremely friendly masseuse!. Very friendly staff and excellent massages! Came here with the wife for an hour and left feeling relaxed and revitalized. Highly recommended!"
        }, 
        {
            "index": 22, 
            "rating": "5", 
            "review": "Go visit Seeing Hands!. I had a one hour massage from Laxmi and came away feeling rejuvenated and relaxed. There is a perceptible different in the massages from Seeing Hands and something truly special about the service they offer. The rooms were tidy and clean, there was no distracting \"calming\" music allowing focus on the massage itself. I would highly recommend this experience as a way of relaxing in Kathmandu and giving back to the community."
        }, 
        {
            "index": 23, 
            "rating": "5", 
            "review": "Good massage. Great massage made by blind people. Professional services, clean room and good value for money. A good relax!!!!"
        }, 
        {
            "index": 24, 
            "rating": "5", 
            "review": "Can't get enough!. Great massage! I went twice this week, it is just so good! I got the deep tissue massage from Ramji, and he could feel exactly where my muscles were tense, and he knew how to get the tension out. Definitely recommend this place."
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "Wonderful massage! . My husband and I enjoyed wonderful massages here after a lot of trekking! Ganga gave my husband a foot massage and Bhima worked her magic with a full body sports massage for me! she was able to work out so many knots....really worth a visit. "
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "Excellent massage. Very good 60min massage in Patan branch. Deep and professional work and environment. Highly recommended for a trip in Kathmandu."
        }, 
        {
            "index": 27, 
            "rating": "5", 
            "review": "Great massage. After trying the clinic they have in pokhara and being very impressed I decided to go here on my last day in Kathmandu too. While I had the sports massage in pokhara, I went for the Swedish one here and while considerably less painful it was very relaxing. On top of that, it's a great cause too so I can't recommend either of these clinics enough."
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "Awesome massage once again!. I have had heaps of stress the past week and was so in need of a relaxing massage to unwind my tension so I as I am back in Nepal visiting I made my way to Seeing Hands clinic hoping they had a free slot - they did! Laxmi ironed out all my knots and I left feeling like a new person. The clinic seems like it has gone through a renovation, cleaner and more lively than I last remembered - it has always been friendly but this time it seemed even more relaxed, friendly and welcoming. I am going to make sure I get another massage before I leave Kathmandu ... maybe just before that long plane ride!"
        }, 
        {
            "index": 29, 
            "rating": "5", 
            "review": "Relaxing, enjoyable.. just wow. Seeing Hands Clinic is a place where blind people do massages. Because they are blind they are much more sensitive which makes the massage a lot more intense. Furthermore I find the project good and worth supporting as the possibilities for blind people to find a job in Nepal are not many. You can choose between 3 different massage: Sport Therapy Remedial, Sweedish Relaxing Massage and Foot Massage.Furthermore you can choose between 1h or 1.5h. The cost are respectively $16 and $24.I went for the Sport Therapy Remedial which really cured all of my myalgia and loosened me up quite a lot. I can highly recommend Seeing Hands Clinic. So if you're in Kathmandu, make sure you have time to stop by this clinic, you won't regret it!"
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Best massage I've ever had. Last night I could not sleep due to a terrible back ache and in the morning I was hardly able to get up. At 7.30 am I thus googled “massage Patan” and thanks to the positive reviews I found on trip advisor, I immediately called “Seeing Hands” for an appointment. At 8.30 I had already an appointment with Mr. Ramji. One hour later, thanks to the best massage I've ever had, the pain was miraculously almost completely gone! I am profoundly grateful to Ramje and from now onwards I will certainly have a massage at “Seeing Hands” at least once a week! I strongly recommend “Seeing Hands” to anybody, both to prevent as well as to cure severe back problems! It also needs to be mentioned that “Seeing Hands” is not just a business, but a social enterprise offering valuable training and employment opportunities to blind women and men!Jennifer"
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "From one masseuse to another. I have just had a 60 min massage from laxmi. She was fabulous. I am also a masseuse and therefore highly critical but her massage was top standard.The only criticism I would have is the temperature. I was cold although it didn't spoil my treatment. Also the head cushion could do with being a little more comfortable as I felt I had my head on wood. She spent the whole hour on my back which was fine and it probably needed it. Although I would have kept some of my clothes on had I realised my legs weren't going to be posted. This is positive criticism and something with the right communication can easily be rectified. Thanks again laxmi."
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "Amazing. Ive just had the most amazing deep tissue massage at seeing hands clinic Thamel KTM. After a month of manual labour volunteering in melamchi by body was in desperate need of a massage. I wasnt dissappointed my masseuse was called beema and really knew where to target n dont be put off by her size. She maybe small but she's strong n could adjust the pressure if i wanted it. The only thing i would say that if your looking for a relaxing massage then maybe consider one of the other clinics as you do get the street noise n dogs barking , but then your in the middle of KTM so its to be expected. It didnt bother me tho n didnt affect my experience at all. Il definetely be visiting again before i return home."
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "Santosh is fantastic!. I am a yoga teacher here in Nepal and there is no other place I would go for a massage! I have consistently seen Santosh for a hamstring issue I have and he has worked wonders for me! All of the therapists at Seeing Hands have been trained by physical therapists from the UK and know their stuff! Santosh can always tell me the Latin name of the muscle or band he is working on, and his English is fantastic! I highly recommend a massage from Seeing Hand especially after a trek! Their business has been greatly affected by the drop in tourism since the earthquakes, so please support them by going and getting a massage!"
        }, 
        {
            "index": 34, 
            "rating": "4", 
            "review": "Very good massage. My massage was very good My only complaint was how cold the room was more blankets or I would be willing to pay more to have heat on( I know there is a fuel shortage right now)"
        }, 
        {
            "index": 35, 
            "rating": "5", 
            "review": "Strong and tender. I have had 4 massages in 2 weeks at Seeing Hands. I was impressed with the professional standard of the massage and the cheerfulness of the staff. After trekking for 3 weeks I went for a 1hr sport therapy massage with Ganga. He asked important questions about what I wanted and ensured a good level pressure for my aching muscles. I left feeling light as a cloud. I went back the next day for the relaxing Swedish massage and could feel the difference in my body.I took several friends and had similar experiences. They have both male and female masseuse and took \"great care\" to meet our needs.Highly recommend this venture! Prices are around 20usd."
        }, 
        {
            "index": 36, 
            "rating": "5", 
            "review": "One of the best massage ever!. One of the best massages ever in Nepal. Do get it if you are in Kathmandu! I got Deep tissue massage and it was worth the money."
        }, 
        {
            "index": 37, 
            "rating": "5", 
            "review": "Sensational. These guys are the experts. Well priced, polite, and very skilled. I got a foot massage which included a deep tissue calf massage. Well worth (1800?) Rs."
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "Awesome massage in Lalitpur. My wife and I and a friend visited Seeing Hands in Lalitpur last week. Met these awesome people Ramji and Swastika who massaged us well. I had a back problem plus a chronic knee injury. Ramji seemed to have found the root cause of my backache because until now, the pain has gone away! On the other hand , my knee pain has only improved slight. I believe with a couple more visits, Ramji will be able to solve this problem. Well done Mr Ramji!"
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "Do try it. I had Chiran who has been working with Seeing hands since 2005. Very friendly, great english and highly skilled. He was very good and kept checking to see if the pressure was comfortable for me, he was great at focusing on all the pressure points and working on some knots i had in my shoulder from my work. Went with friends and we would all definitely recommend."
        }, 
        {
            "index": 40, 
            "rating": "5", 
            "review": "Amazing Deep Tissue. After traveling for 2+ weeks, my back was killing me. Try as I might I could not find a chiropractor in Kathmandu. Fortunately, I packed pain killers and muscle relaxers, but they were only temporary fixes. With a day of sightseeing ahead of me, I thought I should start with a massage. Looking on Trip Advisor, Seeing Hands was the most highly recommended. However, that was not the determining factor. The fact that the massage therapists were blind led me to believe that that their other four senses, especially touch, would be particularly heightened, which would only enhance the massage experience. I was not wrong. Seeing Hands has three locations; one, in Patan, was a five minute walk from the Himalaya Hotel where I was staying (Exit the hotel, cross the street and turn left. Go two blocks and turn right. Walk about 300 feet. The Norwegian Embassy is on the right, Seeing Hands is just up ahead on the left.) It also happened to be the newest location and the least expensive of the three. The facilities were immaculate, cleaner than my hotel. I was met at the gate by Ramji, my massage therapist. His English was excellent (plus he was really easy on the eyes :-)). He asked me if I had any surgery , medical issues or pain that he should be aware of. I told him of my back problems, so he spent a lot of time on my back. He sense of touch was intuitive. He completely hit on the 3 pain points on my back, especially the two really sore ones. When I left, I was virtually pain free. Even now, eight hours after my massage, my back does not hurt. Back in the U.S. a 90 minute massage is way out of my price range. Here I can not only afford one, I can afford one every other day. I already made an appoint for Tuesday. I would unequivocally recommend this place for a solid deep tissue massage, especially with Ramji, although I am sure the others are great as well. One thing that I would recommend for Seeing Hands, as a few others have mentioned, is to keep speaking to a minimum and have some soothing meditative music playing. That would elevate the relaxation experience to another level. I can't wait for Tuesday... and Thursday... and Saturday... and even my last day, next Tuesday."
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "Seeing Hands, Patan. I have been goi regularly to the Seeing Hands Clonic in Patan and it has been really helpful and thorough massage. The therapist name is Ranji and he does an excellent job."
        }, 
        {
            "index": 42, 
            "rating": "5", 
            "review": "Wow. Visited the clinic in patan. Best massage of my life. Lovely therapists with big big heart. recommending to everyone! After visiting kathmandu several times, this clinic is definitely a must try even if you are in the city for short stay"
        }, 
        {
            "index": 43, 
            "rating": "5", 
            "review": "Seeing hands literally!!. Its the best massage u can get as far as i am concerned. Its well located at quite peaceful area with nice warm friendly staff. Visually impaired masseur who are highly trained at what they do. Definitely have to check it out once."
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "Best massage in my life. I have been there once for a one-hour full-body massage and it was a great experience. The staff is very friendly and professional.I've had a tense a sore back for a few weeks and decided to get a massage in the hope that those knots could be undone. I have never had a massage where the masseuse pinpointed the sore areas so fast and so well. He was spot on very time.I would go back there any time when I need a massage and I definitively recommend it."
        }, 
        {
            "index": 45, 
            "rating": "5", 
            "review": "Such a good theraputic massage that I went back again the next day!. Laxmi found all the knots in my back.. impressive.. and for a good cause. I got lost, Seeing hands is on a small side road which you turn down between 2 travel agencies. Well worth the visit."
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "Excellent. Excellent place for a massage in Kathmandu! I definately recommend this place for a reasonably priced and very relaxig massage."
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "Wonderful massage. I had read how good this massage clinic is but I could not imagine how wonderful their massages and masseurs are. I was staying at the Himalaya Hotel and I asked for this clinic but instead they sent me to another massage parlour. On my way I got lost and I bumped into the Seeing Hands Clinic, which had been my first choice. I was welcomed by a extremely polite and gentle young man who explained me the procedure and made me feel confortable. The massage was strong - my choice- and very well done. I am usually very critical about masseurs and massage parlours but the massage here was very professional and the feeling was Wonderful."
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "Good massage. Really likable people. . I got the Swedish massage and I cannot remember my therapist by name, but he did an excellent job. Normally, I exclusively request a female message therapist but I knew this guy would know what he was doing, and I am glad I trusted him.My back feels great. I had really come in for a more feel-good massage, but the Swedish is evidently great for working out the tension in your back (albeit, a bit painful). Regardless, he did an excellent job in getting the tension out of the middle & upper parts of my back. This is was the kind of back work where you absolutely need to be able to trust your message therapist, and I'm glad I trusted this establishment. I hadn't really had my back worked on like that before, but I can tell I needed it in retrospect.They have three or four different massages for you to choose from so the nature of the massage is up to you.Nothing but respect and admiration for this place and my message therapist. I also think that if you haven't spent time around people who cannot see, it is well worth your time as I have so much respect for them. They seem like great people. Hope they do well. Look forward to coming back someday. I recommend checking this place out at least once."
        }, 
        {
            "index": 49, 
            "rating": "5", 
            "review": "Great place. I visited twice and it was really good. My therapist was Anmol. He spoke English very well and was very good at massage. "
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "Excellent!. I have had back issues for last 10 years and have tried a lot of things. I practice a light routine of yoga and relaxation but when i discovered Seeing hands and Ramji it was like finding the missing link. I have been a regular visitor and I highly recommend anyone who works as hard as i do to go pamper yourself a bit every once in a while. We spend 1000s on things that are not good for us but very little on things that benefit us."
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "Perfect Massage!. This was one of the best massage experiences i've ever had in my life!\nYou have to try it when you get a chance to visit KTM. The therapists name was Santos and we had a great laugh to!"
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "Wonderful. Really intuitive, friendly, and talented massage therapists here. They will ask you how much pressure you want, but be aware that more pressure is not always better, even if you can handle it. Encourage them to make those decisions based on what's best. We visited after the earthquake and the building was completely fine."
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "Best massage. After arriving back in Kathmandu from trekking to Everest Base Camp, Seeing Hands was the second place I headed to (first being the hotel for a hot shower!). Santos is an absolute wonder when it comes to massage, he knows exactly where your problems are you walk out feeling like a million dollars. Thank you Santos and the Seeing Hands team, looking forward to visiting you again next time I'm in Nepal."
        }, 
        {
            "index": 54, 
            "rating": "5", 
            "review": "Best massage I have had. EVER . I had heard about Seeing Hands on previous trips to Nepal but not managed to check it out until this time and I'm so glad I did. Laxmi my masseuse was amazing, she applied the perfect amount of pressure and found knots and bumps and pain that I didn't even realise I had; and then she fixed them! Absolute bliss! I wasn't sure if I wanted 90 minutes or an hour and retrospectively o wish I had gone for 90 minutes. I can't emphasise how great this massage was and how good I now feel (especially after a long trek in the Himalayas). I'm 100% going back for 90 minutes before I leave Nepal. This is the best thing I have done in Kathmandu and the whole ethos behind the organisation is so positive and something that everyone should support. Very reasonably priced, just fabulous."
        }, 
        {
            "index": 55, 
            "rating": "5", 
            "review": "Excellent Experience. Having done a short trek in the Annapurna range, I had a few sore muscles and was looking for a massage. I came across Seeing Hands and was immediately welcomed in, introduced around and brought in for a massage. The masseuse was incredibly polite, engaging and delivered an excellent massage. I wish I had found them earlier so I could have come back for another massage. Great program, and great experience."
        }, 
        {
            "index": 56, 
            "rating": "5", 
            "review": "just as its namesake. wonderful, went the first day. healing the jet lag and past work stress upon landing. prepping up for my joruney thru nepal! what can say, made the right decision. gaged my first glimpse into nepali life- whilst coming out refreshed! it was even better the next day after a good nights sleep. go to bimal - shes gifted! back knots untied!"
        }, 
        {
            "index": 57, 
            "rating": "5", 
            "review": "An absolute must. Visited today, it was fantastic!! The team are extremely professional and experts at their jobs! Premises were immaculate! Left feeling relaxed, refreshed and rejuvenated!! Hope to return next week!!"
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "5 Star Massage with Great Cause. I was walking by when i saw a tiny board for the Massage place and walked right in and Got myself Great Massage.Ganga Therapist was Extremely professional. Great Value for Money, Professional, Sweet and your money goes long way to help Blind folks."
        }, 
        {
            "index": 59, 
            "rating": "5", 
            "review": "The Miracle Works. Whatever you do whilst you are in Kathmandu, if you have any muscular stiffness or pains, you must visit Chiran at Seeing Hands Clinic. This man is a miracle worker, he has an amazing ability to connect with you on a spiritual level and feel the pain that you feel. Then he gives you the massage of your life and when he has finished you feel as though you have stepped into a brand new body. His talent for knowing EXACTLY where your pain is and how to work on it is uncanny.Chiran remembered me from my last visit in 2013, he recalled where I am from in the UK and all about the muscular problems that I had last time we met and even my daughters name.Chiran is totally blind, but God has given him a divine gift to heal others with his hands, and you should visit his clinic, not just because you are supporting an organisation that gives to work to the many blind and visually impared in Nepal, but because, this man can work miracles on your body.In fact they should rename it \" The Miracle Works \""
        }, 
        {
            "index": 60, 
            "rating": "5", 
            "review": "Good massage.. Great bunch of guys working there. Masseuse knew what he was doing plus had a great chat. Got the sports massage which was painful obviously but body felt good after."
        }, 
        {
            "index": 61, 
            "rating": "5", 
            "review": "The most amazing massage I have ever had. I was recommended this place by a good friend who said that the people here really know how to work magic and give you the best massage. I was told before I booked that there was not a female masseuse available but I was still happy to go ahead. I'm so glad I did as the gentleman who did my massage was incredible, he could tell exactly where my muscles were tense and was able to work them out with a consistent and comfortable pressure. The masseuse was very professional the whole was through and the prices are very reasonable. Without a doubt I would be more than happy to recommend seeing hands to any friends or family looking for a unique and amazing massage experience. Knowing that you are assisting blind people to earn their own living is also a reward in its own. Thank you seeing hands."
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "strong. really nice strong massage, i had a back problem for many monts and whit 2 hours massage it is allmoust gone!!be aware, if you ask for strong it is really strong"
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "Deep sports massage - really great.. Went at the end of three weeks in Nepal - the talented masseuse worked wonders on my aching back and tired legs. Checked frequently whether the pressure was right (very firm took out bunches of knots/tired muscles), clean safe facility, fab value for money (1500 rupees - $15)."
        }, 
        {
            "index": 64, 
            "rating": "5", 
            "review": "Very impressed!. Thank you for an amazing set of three massages I had during my stay in Pokhara. I am also a Sports and Remedial massage therapist and was very impressed at the professional quality of the therapists skills. The friendly and caring environment also ensures you are well taken care of, I'll be recommending Seeing Hands to everyone I know to support this fantastic team!"
        }, 
        {
            "index": 65, 
            "rating": "5", 
            "review": "Very competent, best massage in years. This is the place to go for a quality massage (this is confirmed by expat citizen of Kathmandu). It's a low key, no nonsense type of place. Laxmi (in Thamel clinic) had an amazing way to find all the sore spots and I felt very well taken care of."
        }, 
        {
            "index": 66, 
            "rating": "5", 
            "review": "Highly recommend!. So glad I made time to have a massage at seeing hands whilst in Nepal. My therapist Bibek was friendly and professional. I had the sports massage. It was amazing! Bibek was always checking I was ok and if the pressure was ok. He found all my problem areas. I've never had such a fantastic massage, my back felt so free and relaxed after. Thank you Seeing Hands :)"
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "Fantastic treatment and staff (Bakhundol, Patan branch). My partner and I have had about 10 massages at Seeing Hands in Bakhundol during our few months in Nepal. We started going not long after the branch opened and it has turned into a regular weekend visit. All the staff are very friendly and welcoming. Our masseuses - Ram for me and Lalu for Caroline - have been simply excellent. Their treatments are first class and they are always careful to concentrate on any areas that are troubling us. We have had our treatment in the same room and in separate rooms - they will do whatever is most comfortable for you. The rooms are kept nice and warm (good at this time of year!). The price is a more than reasonable 1500rps (£10) - hard to find a reason not to go for that price and the standard of treatment. We highly recommend them so do yourself a favour and treat yourself."
        }, 
        {
            "index": 68, 
            "rating": "5", 
            "review": "Absolutely smashing time!. My boyfriend and I went for a massage and we were blown away by how amazing it was. Well worth the money and an unforgettable experience. Would do again in a heartbeat."
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "Excellent Massage In Central Patan. I have been going to SeeingHands for about 2 months now regularly to see Ramji. Since being there I have always got first class sports massage in a friendly and professional atmosphere. Ramji has worked hard on a muscle problem I have in my lower back and I can say confidently it is feeling so much better! As a runner getting a regular massage for me has been great for stopping injuries and such a quality massage is hard to find anywhere else in KTM, especially for such a great price. Well done to Ramji and the rest of the team! I will keep coming back!"
        }, 
        {
            "index": 70, 
            "rating": "5", 
            "review": "Just what was needed after mountaineering trip. My wife and I visited a week after summiting Himlung. To say we were a bit frazzled / worn out was an understatement. We'd used Seeing Hands in Phnom Penh several years ago so we looked no further amongst all the venues offering massage in KTM. We originally booked for 60 minutes but...after much work on our backs / shoulders we asked that it be extended to 90 minutes. My wife is a sports therapist, she knows her stuff when it comes to massage. We both rated this very highly and walked out somewhat pummelled and dazed, but in a far better state of tune. Many thanks to Ganga and Laxmi, all the best Jamie and Clare."
        }, 
        {
            "index": 71, 
            "rating": "5", 
            "review": "Wow! Best ever!. I'm both sad and pleased that I only found this place just a few days before I left Kathmandu! Sad as it means I only got two massages, pleased because otherwise it would have cost me a fortune!!I'd just come back from 10 days Vipassana meditation and my shoulders and back really needed some work - REALLY needed it!Laxmi worked her magic hands on all the knots - a deep massage that really helped.Two days later I went back for a relaxing massage before leaving Kathmandu.I really can't recommend enough. All the staff are lovely and friendly, the facilities are clean and the price is good - not the cheapest in town - but you get what you pay for :)"
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "One of best massages I've ever had. I get massages all the time (probably over 200 to date), and this one definitely ranks up in my top five. The therapists are trained to truly be masters. With targeted touch and specific focus, Ramji was able to loosen up tension and reduce knots & pain in my back that very few have done before. Highly, highly recommend. And the added bonus is that it's a great cause, but would recommend even if that was not the case."
        }, 
        {
            "index": 73, 
            "rating": "5", 
            "review": "Best Massage Ever!!!!. I highly recommend getting a massage here before you leave. We all got massages at Seeing Hands after getting off of our flights from the States. I get weekly massages in New York, and this by far trumps anything I've had. Ram was completely intuned with every knot, kink, and swell. He massaged, hit trigger points, and stretched. It is so evident that the therapists are trained in human anatomy/physiology, because his knowledge of muscle skeletal connectivity was exceptional. He was professional, thorough, and spoke perfect English. I will definitely try to return before leaving!!!"
        }, 
        {
            "index": 74, 
            "rating": "5", 
            "review": "Best massage in Patan. I had a one hour body massage after a hard kayaking trip. Ramji, who did the massage, was a competent and very pleasant guy who also taught me some of the basics of a good massage. The price is great (perhaps even a bit too low; I would gladly pay more if it meant higher salaries, too). It's conveniently placed close to Pulhowk Road, right opposite to the Norwegian Embassy, so that it's to get to). Highly recommended.They've just opened up this branch in Patan, so right now it's nice and quiet in a house with a beautiful courtyard."
        }, 
        {
            "index": 75, 
            "rating": "5", 
            "review": "MORE than \"the best of the best\" ;\nLa crème de la crème. Got massaged many times before this one by professional sport massage person. Well , this one is by far the most sharp , and healing. Humbly and highly recommended. Bonus is that the all staff is so nice warm and welcoming. Renald."
        }, 
        {
            "index": 76, 
            "rating": "5", 
            "review": "Best massage ever!. Friends had recommended the seeing hands clinic and we only have one disappointment that we didn't discover it earlier.They are such professionals and I can honestly say it was the best massage myself and my partner have had. In particular the male massage professional identified and worked through my partners back pain talking him through it the whole time.Please go and support these amazing people you won't be disappointed!"
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "Amazing Healing Hands. I was struggling to find proper massage place in Thamel as most of them looks dodgy. Then i searched in the net and found seeing hands clinic. I immediately go there and had 60mins swedish massage. My therapist Laksmi was amazing, she's gentle and friendly and she found all my pain points even without me telling her. I came out of the place fully relaxed and all my back pain from trekking gone! If you are in Nepal and looking for a good massage, please go to seeing hands. Highly recommended!"
        }, 
        {
            "index": 78, 
            "rating": "5", 
            "review": "A great welcome to Kathmandu . The masseuse was freindly. The massage was invigorating yet relaxing. The room was clean. And the cause is a great one. Why wouldn't you go?!"
        }, 
        {
            "index": 79, 
            "rating": "4", 
            "review": "Great post-trek massage. My boyfriend and I got massages here after EBC. We had gotten another massage several weeks before and this one was by far better. I don't get massages so often so I can't speak to the technique, but it just felt good. Aside from that, the people were so nice, spoke excellent English, were friendly and the place was clean."
        }, 
        {
            "index": 80, 
            "rating": "5", 
            "review": "Heavenly relaxation. My wife and I had a 60 min massage in the same room. My therapist, Santos, was able to pinpoint the problematic areas just by feeling the muscles. It was one of the best massages I've had. He also speaks English well."
        }, 
        {
            "index": 81, 
            "rating": "4", 
            "review": "great massage after trekking. visited Seeing Hands in Pokhara after I completed ABC. Blind therapist Govinda was excellent and the massage was great value for money. The room is clean and comfortable."
        }, 
        {
            "index": 82, 
            "rating": "5", 
            "review": "Wonderful experience at end of trek. Was recommended this place by a work colleague & it didn't disappoint, Just around the corner from the Gaia Café & our hotel in Thamel it was easy to find. The masseurs explained the process very well & were always asking if the massage was the correct strength & if everything was ok.Walked out relaxed & very happy with the massage. The people there also seemed to enjoy their work."
        }, 
        {
            "index": 83, 
            "rating": "5", 
            "review": "Great!. I concur with all the other accolades given, this place is awesome! Located conveniently within Thamel, we walked in and were relieved there was availability given there are only 5 therapists working at the Kathmandu branch. The massage was good and professional. We particularly found the room to be more pleasant than the more expensive Tranquillity Spa at Pokhara which was dark and not ventilated. Everyone should give it a try!"
        }, 
        {
            "index": 84, 
            "rating": "5", 
            "review": "Excellent massage. Excellent massage and you feel that you are helping a very worthy cause.We had a sports massage for 60 mins and the cost was only 1800 rupees or about 19 USD. You could also opt for a relaxing Swedish style massage.A ninety minute massage was 2400 rupees."
        }, 
        {
            "index": 85, 
            "rating": "5", 
            "review": "Seeing hands massage. Absolutely excellent massage. The staff are fully trained and professional. The costs was 1,800 rupees for 60 mins. That is about USD 19. The cost for 90 mins was 2,400 rupees.Not only do you get an excellent massage you also feel that you are supporting a good cause."
        }, 
        {
            "index": 86, 
            "rating": "5", 
            "review": "Best massage ever!. Best 90 min massage ever! Not expensive at all.Totally recommend! Close to Thamel main street shops.Please visit if you have a change."
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "Best Massage in Kathmandu!. I visited once again to Seeing Hands clinic and had truly the best massage ever ... Laxmi took care of me this time and her hands were sure and confident and she massaged all the cricks and knots away that had collected from the bumpy roads and excessive walking! I appreciate the quality as I regularly have massages at home, and am quite picky about what is good or not ;-) so I was thankful that once again I received excellent massages (twice this visit!) and the friendly atmosphere of the clinic too ... beautiful!"
        }, 
        {
            "index": 88, 
            "rating": "5", 
            "review": "wellness by seeing hands. Thank you it was an over the top experience:-) We were treated so well and all the tension in neck, shoulder and back were relieved by these fantastic seeing hands. Highly recommend and all the best from Ida and Karin."
        }, 
        {
            "index": 89, 
            "rating": "5", 
            "review": "great massage. my husband and I both had sore necks and backs so we went to this clinic. we walked out an hour later feeling great. thanks"
        }, 
        {
            "index": 90, 
            "rating": "5", 
            "review": "Chiran has done wonders for my back and neck!. I told Chiran about certain issues I have with muscle-strains and he was able to relieve me of very much tension. My therapist realized professional hands had been at work once I had returned home again."
        }, 
        {
            "index": 91, 
            "rating": "5", 
            "review": "Wow!. I really really loved this place for a massage! The massage therapist was fantastic and really hit the right spots. And the staff was so friendly and helpful.The only thing to complain about is that the room was a bit cold and it would've been lovely to take a shower afterwards. Other than that, I can highly recommend this place."
        }, 
        {
            "index": 92, 
            "rating": "5", 
            "review": "Perfect, worth a visit!!. As a masseuse myself all I can say is that I truly loved the massage. Therapists are kind, professional and attentive. Lakshmi was my therapist and she did a great job, always making sure that the pressure was adecuate for me. 60 min that went by so fast!! I truly enjoyed it and will definitely be back when I come back to Nepal!"
        }, 
        {
            "index": 93, 
            "rating": "5", 
            "review": "Amazing. It is the fourth times I visited Nepal in last December and finally managed to find time to enjoy massage in Pokhara. Seeing Hand Clinic is one of which I know of for some time and I visited there on 26/12/2013 and 27/12/2013 (and have 2x of massages). It is really beyond my expectation to receive such skillful massage/therapy as I do not anticipate the therapist (blind) would be able to detect the problems of my back and shoulder without me signalling a word (as I do have very frequent of massage \"tui na\" to solve my backache, sniffing neck and shoulder pain back in my home country). It is really amazing!I would highly recommend Seeing Hands Clinic for massage or therapy if you guys have a chance to visit Pokhara and Kathmandu. The rate offers is very reasonable. Each therapist is well-trained with their certificate display in the reception area. More importantly, lets support them for their surviving skills. Well done!"
        }, 
        {
            "index": 94, 
            "rating": "5", 
            "review": "Great massage. After trekking to Everest Base Camp I was in desperate need of a massage especially my shoulders, neck and back, and calf muscles. I was allocated the masseuse Anmol, and he didn't disappoint. He had firm hands and repeatedly went over the problems areas. The time wasn't enough so I went back agai the second day. Thanks to Anmol, he was incredibly professional and solved my sore shoulder problems. I highly recommend him."
        }, 
        {
            "index": 95, 
            "rating": "5", 
            "review": "Excellent!. I have stay in Thailand for many years, and I go for massage regularly to relieve my shoulders pain. But the problem still there.Just now I went to seeing hand, and I had a great massage by Anmol! He can quickly notice my problem and gave me a Good massage!I recommend seeing hand to everyone who look for the real and excellent massage!Thanks!"
        }, 
        {
            "index": 96, 
            "rating": "5", 
            "review": "Awesome!. Initially went in looking for a good massage and to support a good initiative . My girlfriend and I left after having an amazing massage and supporting what I think is a great initiative :) Definitely recommend this to all visiting Kathmandu. Chances are you will need a massage anyhow ;)"
        }, 
        {
            "index": 97, 
            "rating": "4", 
            "review": "Update to previous review. I previously gave seeing hands 2 stars because I did not receive a full massage. The manager, Chiran, tracked me down through mutual contacts and offered me a complimentary massage to make up for it. Chiran gave me the massage himself and it was great. I am happy they addressed the issue and I am going back again."
        }, 
        {
            "index": 98, 
            "rating": "5", 
            "review": "good massage, great people. I went with my friend (a fysiotherapist) to seeing hands, after he recommended it to me. The people there we most friendly and helpful. Also during the massage my masseuse was very keep on keeping me comfortable, asking me about any fysical problems and my overall well-being. If you want a good and remedial massage, choose this wonderful clinic!"
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "very strong, good knowledge. Got a good, strong massage by Anmol. Got one before, and after my three weeks of trekking and it was just what I needed. At home I work as a physical therapist and we both refreshed our knowledge of the muscle names and locations.Some parts were a little intense for me, for instance the neck and calf muscles, I told the therapist to lower the intensity of the massage a little bit. Can't say that I tried more massage places, because I did't need to. Go to seeing hands for a professional, good massage."
        }, 
        {
            "index": 100, 
            "rating": "5", 
            "review": "Well worth a visit.......... Thanks to Santosh for a wonderful massage in Khatmandu. After 10 days trekking in the Himalayas it was just what was needed. I heartily recommend Seeing Hands to all who visit the city.After your session, pop round the corner to Kilroy's restaurant for a meal you'll remember. Great, diverse menu and good service. For your outdoor clothing or kit go visit Shona's, just across the road from Kilroy's. Good, honest trading."
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "made me want to move there... i had several amazing massages at Seeing Hands, both in Pokhora and Kathmandu. Each masseuse was skilled and friendly. the massage was some of the best i have had and i have had many all over the world. They found all the places that needed massage and made me feel great by the end of the session. If you need special attention on certain areas, just ask and they will happily work out the knots. I seriously miss these massages and for the price i couldnt stay away. other places charge around the same if not more, but none match their quality and cleanliness. please go!"
        }, 
        {
            "index": 102, 
            "rating": "3", 
            "review": "It's ok, all for a good cause. After trying jiva at pokhara, I went to kathmandu the next day. Saw the reviews on TripAdvisor about this place so I gave it a go. I like the idea some of the profit is used to train more blind therapists. The customer service was great. I opted for a swedish massage. My therapist was new (so she said). The room looked nice and clean. But it could have used music to make it more relaxing. Therapist relies on a device to tell her what time it is. I felt she spent too much time massaging my upper back and so the other areas were a bit rushed. ..Overall it's not bad"
        }, 
        {
            "index": 103, 
            "rating": "2", 
            "review": "Not a full massage. I paid for a 90 minute massage and all I received was a back massage with a hurried massage of the back of my legs ONLY. No arms, no front of legs, no head, barely any chest. When I complained they did nothing."
        }, 
        {
            "index": 104, 
            "rating": "5", 
            "review": "Just what the doctor ordered. This is the first time I have ever given a review on trip advisor, usually I just forget to make the time and then just never do it. Strange as I use it every time we are booking a hotel , always researching on trip advisor for all our hotel and activity choices . Well this time Ive decided to join trip advisor and tell the world about how I feel about this \"seeing hands clinic\" ! I was lucky enough to visit 2 times in a month, once before and once after some serious trekking, both times I loved every moment , Laxmi is incredible! She really understands and knows how to read your body , and course to perform an amazing massage . I seriously felt like a new person after each session . I've certainly had my fare share of massages and can confidently say these guys know what they are doing. I have told everybody who will listen to come to the clinic . Amazing place with an amazing price , an absolute pleasure. The staff are all such lovely warm people and the clinic is very comfortable and clean. The experience was perfection !!"
        }, 
        {
            "index": 105, 
            "rating": "4", 
            "review": "A good massage, not too hard to find.. I was treated by Santoss, a 26 year old man with excellent technique, who provided strong pressure as requested, but ensured I wasn't uncomfortable at any time.The facilities are clean, and the staff are cheerful and speak excellent English, as well as a couple of other languages.To find the premises, ask for popular Gaia's Restaurant, (which is off busy Jayatha), and walk around the next corner 15 metres further on.Phone : 01 465 786. Mobile : 98460 39918You won't be disappointed receiving a massage from these sensitive blind people."
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "Brilliant experience!. I was persuaded by my better half to visit Seeing Hands - at 30 years old it was time for my first massage! Ramji was an absolute wizard - he went easy on me and expertly popped all my joints, would recommend this place to anyone! The 60 minute couples massage is great and made very enjoyable by Ramji's capable English and wicked sense of humour!"
        }, 
        {
            "index": 107, 
            "rating": "5", 
            "review": "Fantastic. Best massage ever. I regularly have massages, but the knowledge and attention to each muscle was on another level. My guy was called Santosh."
        }, 
        {
            "index": 108, 
            "rating": "5", 
            "review": "Outstanding Massage!. I visited the Seeing Hands Massage Clinic located in Kathmandu during my trip in September and October of 2013. Ramji provided an outstanding sports therapy massage. He is exceptionally well-trained and spoke outstanding English. My lower back and legs were quite sore from trekking the previous two weeks and Ramji successfully worked out almost all of the tightness and soreness. If you are looking for a relaxing massage to put you to sleep definitely do not go for the sports therapy massage! However, if you want to work out the knots and soreness from your body Seeing Hands is an outstanding option."
        }, 
        {
            "index": 109, 
            "rating": "5", 
            "review": "90 minutes of the best massage ever.. After an action packed 10 days of trekking and safari, a friend recommended that my girlfriend and I try this massage clinic. In fact he'd been singing their praises all week that we had to go. We had 90 minutes of sports massage (on adjacent tables) where Ramji and Laxsmi worked out all our knots and stresses with incredible skill. We really did leave feeling like new people.Incredible value, especially when compared to UK charges and durations. A must for all visiting Kathmandu!"
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "Fantastic massage, amazing all round experience. I went to this clinic after trekking to Everest Base Camp. I had an amazing remedial massage, and a fantastic chat with one of the blind masseurs - Santosh. My back felt much better afterwards, I felt completely safe and at ease during the massage, it was fantastic value for money and I would definitely go back if I find myself in Kathmandu once more. The two other people I was with from my trek had a similar experience."
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "physio therapy clinic. therapists with special tactile.. the blind are naturally talented masseuses. this group is so friendly, warm, and kind. the facility is decorated by one of the best hotels in NEPAL."
        }, 
        {
            "index": 112, 
            "rating": "5", 
            "review": "Excellent massage. My daughter (14) and I, had twice an excellent massage at the Seeing Hands clinic.\nFirst time 1 hour,second time 1 hour 30.\nThe therapists are very friendly people and the ambiance in the clinic is full of joy (with Laxmi's baby Serene passing from hand to hand...)\nA great place for a great cause.\nPatricia&Youli Horovitz.Tel-Aviv Israel"
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "Wish I got 90 mins. After hearing about this organization in Pokhara we decided to visit the Kathmandu location as it was next to our hotel. Back in Canada I see a registered massage therapist once a month and this was just as good if not better. The therapist found all sorts of knots and worked through them. I only wish we had more time so she could do a full body and get my legs! If you have the choice btwn pokhara and kathmandu I might try pokhara only because you might not hear people screaming on the streets. All in all though it was great."
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "It's the real thing!!. I had just finished a trek and chose Seeing hands for a massage. I was amazed by the experience and felt blissful at the end of it. Lalu my therapist was fantastic- she had magic hands and was really friendly as well.I can truly say it was one of he best massages I have ever had. She worked through all the right places to relieve the stress and tension- obviously very well trained The massage room itself is very pleasant and comfortable. So if you have some time,want to have a great massage and help a good cause I would recommend you visit Seeing hands."
        }, 
        {
            "index": 115, 
            "rating": "5", 
            "review": "Awesome Massage and a New Shoulder. We visited the clinic just from walking past and decided it was a worthwhile cause. Little did I know that I would get the best massage I have ever had and get my shoulder fixed at the same time. My massage was done by Chiran and he did a excellent job. I have dislocated my shoulder twice so my shoulder has been an issue for some time. I did four sessions with him and my shoulder feels amazing. It was much better after the second session and he started working on other areas more. The first session was spent purely on my shoulder. There were some times of heavy pain during the treatment as he went deep into the shoulder joint where the issues were, but it was definately worth it. I could not sleep on that shoulder for many years as it would hurt too much. I no longer have that problem and have a new confidence with my shoulder. I was always worried about putting my arm straight up in the air of fear of it dislocating it. That issue is also fixed. I have a new shoulder and will not get surgery on my shoulder which I was considering. Thanks Chiran for all your hard work. Amazing."
        }, 
        {
            "index": 116, 
            "rating": "5", 
            "review": "Amazing massage for a great cause. we went to pokhars and had a fabulous massage at the clinic and have now had a great massage in Kathmandu. I had my back neck and shoulders massaged by Lalu. It was so good my husband and I are going back tonight and tomorrow."
        }, 
        {
            "index": 117, 
            "rating": "5", 
            "review": "Excelent choice. There are many options to get a massage in Kathmandu, but this is one of the best. Not only because you get a great massage in the hands of true professionals and also very friendly, but also because you are helping a good cause, helping people to earn an honest living in a place where job opportunities perhaps are not as good for blind people."
        }, 
        {
            "index": 118, 
            "rating": "5", 
            "review": "For real massage 'Seeing Hands Clinic'. I stayed a month in Kathmandu on the edge of Thamel in this lovely Souvenir Guesthouse of which the owner advised me to visit the Seeing Hands Clinic for the best massage in town. Just passed and behind where restaurant Gaya is located. He was right, I have got the best massage over there which made me so enthusiastic I decided to make a video clip about the clinic. The people who are giving the massage are so pure and radiating positive energy, they are remarkable. They are blind but very skilled and speak very good English. Not to compare to all of the fake massage parlors in Kathmandu where rubbing smelly oil and happy endings is what they are trying to sell in a dirty, terribly filthy setting.Walking for hours in a stinking city which Kathmandu not so charmingly really is, a great massage at Seeing Hands made me new and vibrant again to happily go on another of my walks through this crowded and dirty city where beauty can be found where you least expect it.Willem Rieder"
        }, 
        {
            "index": 119, 
            "rating": "5", 
            "review": "Best Massage of my Life!!!Life changing!. My family and i were in Kathmandu for a few days and i was desperate for a massage after our trekking trip. Our Hotel recommended us a spa near by and i had a very bad massage from untrained staff. I was disappointed. So i looked up on the web and came across \"Seeing hands\" and read up about them onTripadvsior. My sister and i decided to try a massage and visited the \"seeing hands\" clinic. What really got us was the sentence that they receive a 2 year training from Uk doctors. I had a male Massage therapist and i really didn't know what to expect. I never received a massage from a blind person before.I can say that it was hands down the best massage of my life.( i get a lot of massages as i spend a lot of time in asia) It was a very healing experience. He felt my body and the tight spots and worked through it. He was gentle, his english was perfect and he seemed like a very nice young man. One can really feel how sensitive and experienced the massage therapist are at seeing hands. Obviously their condition gives them a higher sensitivity for feeling. We extended while we are being massaged to a 1.5 houer session because it was that amazing. I could have done 4 hours. Seriosuly im already looking forward to come back to Kathmandu just to get this massage again. You are silly not to try it. It will change your life. Enjoy!"
        }, 
        {
            "index": 120, 
            "rating": "5", 
            "review": "Awesome massage, it put me be back to life!. After long days of trekking and motorcycling through Nepal my back and legs were completely destroyed. After the massage I felt completely reborn even though I must admit that it has been painful in certain moments..."
        }, 
        {
            "index": 121, 
            "rating": "5", 
            "review": "Bliss!. After a long flight to Kathmandu and reading all the reviews here on tripadvisor, a visit to Seeing Hands was moved to near the top of my to-do list. I arrived at the centre near closing time, but ended up having the most wonderful massage (from Ramji ). It was so good, that I made a return visit a few days later! The Seeing Hands Centre in Kathmandu is easy to find and its only a five minute walk from the \"Garden of Dreams\". If you are visiting Kathmandu - make time to visit Seeing Hands - you will not regret it!!"
        }, 
        {
            "index": 122, 
            "rating": "5", 
            "review": "Great Massage. I came to Nepal with some body issues and was hoping to find a legitimate massage therapist here. I found Seeing Hands, and have had three massages with them from two different therapists. Without a doubt some of the best massages I've had anywhere in the world. They are professional, knowledgeable and follow directions well. And it's a great cause. I totally recommend it. I only did the therapeutic massage, but imagine they would do a good relaxation massage too."
        }, 
        {
            "index": 123, 
            "rating": "5", 
            "review": "A Great Find. My wife and I were searching for a place to get massages after our trek. We came across the Seeing Hands Clinic on tripadvisor. Which is better, the cause or the massage? I don't know. Both are amazing. I got a 90 minute sports massage from Ramji and my wife received the same from Laxmi. This would be our 3rd massage (first in KTM). To say we were disappointed, would be an understatement. SHC are clearly trained well. There was PNF stretching and really deep work. It was just what we needed."
        }, 
        {
            "index": 124, 
            "rating": "5", 
            "review": "Wow!. The massage I had at Seeing Hands was more than perfect! I had a lot of tension in my little body and right now it's totally gone! I really recommend this to all people who want to have one of the best massages you could have in your life! Love to Seeing Hands <3Bye Ellis"
        }, 
        {
            "index": 125, 
            "rating": "5", 
            "review": "A real massage like I haven't had one in years, a gem of a find.. I went to Seeing Hands for the experience and was rewarded with simply the most professional massage therapy I've had in years. This is the place to go for a real treatment from some of the best trained and most qualified therapists around. In addition, this is a magnificent social enterprise training the next generation of therapists in a demanding 8 month long programme, providing a good livelihood in a country with little support for disabled people."
        }, 
        {
            "index": 126, 
            "rating": "4", 
            "review": "Perfect holiday massage. The masseurs are blind, and so this takes away any embarrassment one might have in being on a massage table! I had a Swedish massage with my sister. We had two masseurs and the tables were side by side. It was great to hear the joy in the voices of the masseurs as they chatted. Whilst my sister can speak Nepali, their English was very good, so I could understand all I needed. The massage was firm, even though my masseur, Raju said he was only using 20% of his strength. I found it very powerful...I don;t think I could handle 100%!! This was well worth the visit."
        }, 
        {
            "index": 127, 
            "rating": "5", 
            "review": "Great guys, very professional. I've been there with a friend. Both of us have had a great healing massage with Ramji and Lalu. The incredible thing is they are really young but very very very well trained. Great job. Great experience and they are very nice guys too. But I repeat myself, the massage was perfect, not one of those unuseful oily spa massages. No frills here, but you will got out with a new back!Go on like that guys!"
        }, 
        {
            "index": 128, 
            "rating": "5", 
            "review": "An amazing massage and a good cause. I received 1h30 massage by Ramsi who was very professional, knowledgeable, attentive and kind. He did a fantastic job on my back as he was able to find all the knots and did his best to make them disappear. I had a fantastic experience which I deeply recommend. Everyone in the clinic was so nice. It felt very special to be there."
        }, 
        {
            "index": 129, 
            "rating": "5", 
            "review": "Memorable and Inspiring. What a wonderful place and wonderful people. I had a bad injury that was basically healed by my now new friends here. They repeatedly turned out opportunities to charge me more - such as when I asked whether a longer massage would help, or whether I should return the next day. They clearly care deeply about helping and healing. It is all the more inspiring that this is serving the visually impaired community. This is by far the best massage I have ever received, and one of the true highlights of my time in Kathmandu. Thank you - I just wish I could spend more time supporting this organization and benefiting from the incredible healing you provide."
        }, 
        {
            "index": 130, 
            "rating": "5", 
            "review": "Hour-long massage on July 28 with Ramji. I had a wonderful experience this past Sunday evening during my massage with Ramji. He was great. I highly recommend \"Seeing Hands.\" I'll definitely go back!"
        }, 
        {
            "index": 131, 
            "rating": "5", 
            "review": "Excellent massage by professional masseur. I had a 90 minute remedial deep tissue massage on 23 July, done by Ramji. He was very polite, friendly, professional and attentive. I left the place feeling great! This is easily the best massage I have ever had."
        }, 
        {
            "index": 132, 
            "rating": "4", 
            "review": "Very pleasent and talented personell. Nice and clean, pleasent and talented personell. Knew what he was doing, and pleasent to talk to. Definetly recomendable!"
        }, 
        {
            "index": 133, 
            "rating": "5", 
            "review": "Best Massage Ever. I went for a deep muscle massage on the 16th of July 2013 and it was fantastic. The masseurs really knew their stuff. They were polite friendly halpful and eager to help.I play a lot of sport and cycle a lot so Ramsi (the masseur) spent an hour on my legs. They feel great now. He found all the knots.I would highly recommend this spa."
        }, 
        {
            "index": 134, 
            "rating": "5", 
            "review": "Best Massage. Excellent massage and half the fees goes back to helping the blind! Highly recommended for all, my masseur knew all the knots from his touch, and cleared all of them for me. Great skills!"
        }, 
        {
            "index": 135, 
            "rating": "5", 
            "review": "Fantastic post-trek massage. My hotel, the excellent Hotel Friends Home (nearby), recommended this place. I'm very glad I asked for their recommendation. I found it easily (near the Hotel Fuji) and was assigned Lalu (Labu?), friendly woman. I know massages very well since I live in Bangkok and I get proper massages all the time from some very good people. And Lalu's massage was up there with the best. In fact, I'd have to say it was the perfect post-trek massage, because she knew all the spots that would be hurting after a trek (calves, quads, back, shoulders etc). Frankly, I'd give just about anything to be back on that table now."
        }, 
        {
            "index": 136, 
            "rating": "5", 
            "review": "Fantastic massage, Western quality!. Had a 1hr Swedish massage by Lalu in KTM. So friendly, repeatedly asked if pressure was ok, found all my trouble spots- was AMAZING! Definitely recommend and would go back. Bring exact change if tipping."
        }, 
        {
            "index": 137, 
            "rating": "5", 
            "review": "Seeing hands,open hearts. myself and my boyfriend attended the clinic this morning for a one hr massage each.after struggling to find the clinic as it is just off the main jayatha street down a very quiet alleyway.we were greeted by name with such a friendly approach as we entered the building.the room was clean and all the towels used were fresh.we were both in the same room which suited us.i have to say Lalu and Santos the people providing the massage were so polite and considerate at all times.always asking if the pressure was ok or If we had any special requirements.the massage lasted an hr and I have yet to receive such a good massage in Ireland.it wAs brilliant and I would recommend it as top of the list of things to do in Thamel or Pokhara.Santos and Lalu were lovely,had a great level of English and a brilliant sense of humour and most of all were excellent at their job"
        }, 
        {
            "index": 138, 
            "rating": "5", 
            "review": "Best massage in ages. I stumbled upon the place the night before I had to leave town, went in the morning just before my flight, and my regret is not having discovered Seeing Hands earlier. The facility is very professional and clean, with high quality massage beds and in hygenic and comfortable rooms. I had a sports massage with Lalu, and she rubbed all the knots out of my back in no time. Admittedly I don't frequently get massages, but I got two in Pokhara, and Seeing Hands (which also operates in Pokhara) is clear and away the best of the lot. Highly recommended!"
        }, 
        {
            "index": 139, 
            "rating": "5", 
            "review": "Excellent facility. I visited Seeing Hands in Kathmandu today for the first time and was thoroughly impressed. I had a hr long sports massage for 1500 rupees with Laxmi and it was one of the best massages I've had. If you are visiting Karhmandu and have a spare hr or two this is a great way of supporting the local blind Nepalise people."
        }, 
        {
            "index": 140, 
            "rating": "5", 
            "review": "Awesome massage. Went twice in my time Kathmandu. Can be a little difficult to find so write down the directions before you leave home because it is well worth it. Thank you seeing hands."
        }, 
        {
            "index": 141, 
            "rating": "5", 
            "review": "excellent massage by Laxmi. The deep tissue massage I had by Laxmi was one of the best I have ever had- she was so skilled! My tight and sore muscles were completely relaxed by the end of the session."
        }, 
        {
            "index": 142, 
            "rating": "5", 
            "review": "Even better than last time!. While in Nepal this March/April 2013 I once again (& friends!) visited to the seeing hands clinic to receive a massage ... in fact two times this visit! One massage by Laxmi and one by Chrion ... and both massage were even better than the last time I wrote a review here ... not only do they give a really good quality massage, the clinic is clean, the atmosphere uplifting, but I also know it really helps this small blind community have their own independence by their social entrepreneur business. Would highly recommend visiting them for a massage if you are in Thamel, Kathmandu, Nepal. Make sure you call them by phone and book first as they are getting busy now during the tourist season."
        }, 
        {
            "index": 143, 
            "rating": "5", 
            "review": "Massage Therapy Seeing Hands. Great Clinic that offers well trained Remedial Massage Therapist who are passionate about their work.As a massage therapist myself I can highly recommend them.Also they are a legitimate massage clinic unlike most of the massage places offering massage around Kathmandu.Santosh was my therapist on 3 occassions and also Laksmi massage my other friend. Not only will you receive a great massage you are helping to support this organisation who are happy to support , train and employ the best massage therapists.in Kathmandu and Pokhara.They do have a room that can accommodate 2 people at a time so its a great way to chill out with friends or a partner. Highly recommend it."
        }, 
        {
            "index": 144, 
            "rating": "5", 
            "review": "Terrific Remedial Massage. Living and working in Asia, I have experienced just about every type of massage you can imagine.Seeing hands is professional and thorough. I had Chiren for my massage. He asked a few questions regarding my general well being and if there were any problem areas. He then quickly got to work targeting problem areas. The massage I had was deep tissue so I expected some discomfort.The relief afterwards was definitely worth any discomfort.Can highly recommend this place."
        }, 
        {
            "index": 145, 
            "rating": "5", 
            "review": "The Worlds Best Remedial Massage. A massage here is a great way of helping some of the 160,00 blind people in Nepal and thats the reason that I personally went there.All the masseurs are blind, both men and women. I arrived in a good deal of pain and unable to walk, so I booked a massage with the proprietor, ' Chiren ', and I am not kidding when I say,\"I bet this man can walk on water !\", after a one hour massage I was able to walk again and had nowhere the amount of pains as when I arrived there. Chiren knows exactly where your pain is and works hard on you to get rid of it. The next day I was a little sore but by the following day all the soreness had gone and I was feeling good, so good in fact, that I went back to him three days later for a second session, I am now back in the UK and still feeling the benefits of his massages. Whilst I cannot say that his massage cured my chronic pain, which after all, is age related, but it did go a long way to releiving it and allowing me some small mobility. Chiren speaks excellent English and has a good sense of humour and a highly professional attitude.Do yourself a BIG favour, if you have any stiffness or nerve pain go to 'Seeing Hands', and get yourself the message to end all massages, it won't cost you a fortune and is worth every Ruppee !"
        }, 
        {
            "index": 146, 
            "rating": "5", 
            "review": "Great Massage. I had a first-class massage with Santiago who was very professional, friendly and was absolutely able to pin point my tight areas and help relieve them. I definitelyely recommend this place."
        }, 
        {
            "index": 147, 
            "rating": "4", 
            "review": "Well done. I enjoy trying out new massage therapists when I travel and especially wanted to support the work behind Seeing Hands after hiking. It wasn’t real easy to find as I couldn’t see any sign on the main street pointing to the right alley. Once I arrived, I was greeted by Santosh, who asked if I preferred a male or female therapist, so there is that option (personally, I don’t care as long as they’re good at it). He took me up to a private room. Unfortunately, he wasn’t able to find a heater for the room so we moved to a table in a room that already had a client on the other table. I was concerned that there would be a lot of conversation between the two therapists as noted in reviews for the Pokhara clinic, but it was kept to a minimum. There was, however, some loud discussion between the other therapist and someone outside the door (I think about gas delivery?); as a massage veteran, I feel the massage room should be a sanctuary without interruption from the outside world.Santosh was a good massage therapist with very firm pressure, to the point of pain on my overworked calf muscles, but he eased up when requested. All in all, it was a good experience and very good value on many levels."
        }, 
        {
            "index": 148, 
            "rating": "5", 
            "review": "Seeing Hands Massage Clinic Kathmandu. Great place for massage by trained blind people. Wonderful after a trek.Great deep tissue massage. I had Chiren and my sister had his wife - both excellent"
        }, 
        {
            "index": 149, 
            "rating": "5", 
            "review": "Unique and must do experience. A bit confronting at first but otherwise an excellent massage. Rooms were basic but clean. Masseurs English was fantastic. Chiran provided a very insightful massage- highly reccommend"
        }, 
        {
            "index": 150, 
            "rating": "5", 
            "review": "Truly hands that see!. The masseuse was very good with the deep tissue massage and truly hit every problem area i had on my shoulders and back. Speaks excellent English, and a good sense of humour. Highly recommend you spend your massage budget here than anywhere else, and go on and help a good cause."
        }, 
        {
            "index": 151, 
            "rating": "5", 
            "review": "best massage in nepal. this is a great place, very friendly, professional and.. human. if you need a real massage in kathmandu or pokhara, this is the place."
        }, 
        {
            "index": 152, 
            "rating": "5", 
            "review": "Better than new!. I had two massages during my stay in Nepal and they did absolute wonders. I've had a few blind massages before but this places takes the cake. My masseuse found knots and areas of needed \"attention\" in places I was completely unaware of. The atmosphere is very friendly and relaxed. They all speak very good English and understand everything said to them so that they can attend to any need you have. I highly highly recommend going to Seeing Hands on your next trip! Great for getting away from the hustle and bustle of Kathmandu while doing something for yourself and a good cause!!"
        }, 
        {
            "index": 153, 
            "rating": "5", 
            "review": "Strength of kings, hands of wizards. Had a massage from Chiran that was amazing, no holding back. He went for it and wasn't afraid to work the cheeks. Highly recommended!"
        }, 
        {
            "index": 154, 
            "rating": "5", 
            "review": "Massage with a purpose. Wonderful massage by highly professional polite staff. My friend found seeing hands through trip advisor and I would highly recommend it to anyone visiting Kathmandu. It was lovely to get away from the hustle and bustle of Thamel for an hour of indulgence. Although I'm a massage novice, my friend said that this rated highly compared to massages back home. As well as being a great massage it was lovely to know the good that this enterprise is doing for the people who run it, especially after living in Kathmandu for two months and seeing how difficult life for people with disabilities, especially female, is there."
        }, 
        {
            "index": 155, 
            "rating": "5", 
            "review": "Great Cause and Great Massage!. I by accident discoverd the seeing hands clinic in Kathmandu. I bookt a massage for 90 minutes. I told the therapist, who spoke fluent englisch, what my problems where and he thoroughly attended to them. He is better than my fisiotherapist and better than my ostheopat. I was also very touched by there extremely polite personality. If you visit Nepal you must visit Seeing hands!!"
        }, 
        {
            "index": 156, 
            "rating": "5", 
            "review": "Excellent massage and a good cause.. We went twice during a short stay in Kathmandu and found Seeing Hands fantastic. I'm a bit of a novice in having massages, but my travel companion Tash is a connoisseur in this space and gave SH several Michelin Stars! Will be back when next in Kathmandu."
        }, 
        {
            "index": 157, 
            "rating": "5", 
            "review": "Good value, enjoyable and worthwhile. It seemed to me that, if I was going to pamper myself with a massage in Kathmandu, it would be preferable to spend the money with a company that tries to create wider benefits for Nepali people. This is a very professional operation and the lady who massaged me was clearly very knowledgeable and experienced. She had the most lovely soothing voice that I've ever heard. I thoroughly enjoyed the massage and it came with an additional feelgood factor of knowing that it was part of a project designed to improve career options for blind people."
        }, 
        {
            "index": 158, 
            "rating": "5", 
            "review": "first-rate service, well-trained staff, excellent value. I was suffering from chronic, lower back pain and wary of notorious \"massage parlors\" in Thamel, Kathmandu, but a friend recommended \"Seeing Hands.\" They were professional, their English was fluent and they impressed me with a very vigorous, deep, sport-medicine-style, thorough massage. My back is on it's way to healing for the first time in a long time. The very personable, young man, from Lumbini, Ramji, treated me, and I would not hesitate to recommend him in particular. Thanks again Ramji!-Brett Johnson, USA"
        }, 
        {
            "index": 159, 
            "rating": "5", 
            "review": "Great Massage. This was listed on trip advisor so we decided to give it a try. We made our reservations by phone from our hotel. No one had ever heard of the place, we had a heck of a time finding it. It seemed a little seedy when we first arrived, but the massage was divine. I recommend the sports massage to get out the kinks from the plane ride."
        }, 
        {
            "index": 160, 
            "rating": "5", 
            "review": "Great value and experience. I can only say I know two things very well - tea and massages. I loved the experience at Seeing Hands. The masseur targeted injured muscles quicker than someone with sight and he solely worked on those muscles. One of the best massages I have ever experienced. Highly recommend."
        }, 
        {
            "index": 161, 
            "rating": "4", 
            "review": "Much needed massage. After my trek I needed a massage so went to the clinic - it was good and lasted an hour. The masseur was good, he had excellent English and chatted freely during the massage. He asked to tell him if he was hurting me and when I told him I did he reduced the pressure. The reception was well organized and the staff very friendly. It was clear from where he concentrated his efforts where he found knots and worked hard to remove them - it was a good experience and I was pleased to support this worthwhile endeavour."
        }, 
        {
            "index": 162, 
            "rating": "5", 
            "review": "Great massage. I had a great massage at Seeing Hands Clinic.My masseur, Ramji, was really good ... Great technique and English.He has been interviewed 3 times before got accepted there.Highly recommended. Wish I can come back for more massage."
        }, 
        {
            "index": 163, 
            "rating": "4", 
            "review": "Interesting experience and quite good. I went for a sports massage having a neck/ shoulder that had gone into spasm. It was a painful massage but did relieve the pain slightly. Unfortunately the problem was too serious to be cured by the massage, but I did realise that when I subsequently went to see a physio, the points that the Seeing Hands masseuse had recognised as problem points, were the correct points which the physio also focused on. It was also an interesting experience so worth a try either for relaxation or therapy."
        }, 
        {
            "index": 164, 
            "rating": "5", 
            "review": "Best massage I ever had. I went to the Seeing Hands massage twice during my stay in Kathmandu and I could have gone every day - Ramji did a wonderful job with his massages! I felt like in heaven afterwards. It's worth every Rupee you have to spare!"
        }, 
        {
            "index": 165, 
            "rating": "5", 
            "review": "Excellent massage. After a visit to the Seeing Hands Clinic in Pokhara, when I got back from Everest, I received a massage from Ramji at the Seeing Hands Clinic in Kathmandu.It was as excellent as excellent as the massage was in Pokhara, I would definitely go again and would highly recommend this place for a good quality, very reasonably priced massage.Enjoy!"
        }, 
        {
            "index": 166, 
            "rating": "5", 
            "review": "Marvelous Massage. My husband and I read the reviews then decided to try Seeing Hands Clinic. We were not disappointed in this small out of the way place, sincere nice staff, very helpful and attentive. We had a massage in the same room, they were knowledgeable and mindful of any injuries and / or request. It really was a marvelous and a really great price (less than most) that contributes to a good cause + you get a great massage...good overall experience."
        }, 
        {
            "index": 167, 
            "rating": "5", 
            "review": "Wonderful !!!!. We LOVED the Seeing Hands Clinic. We went to get a massage before our trek and it was absolutely wonderful..... the clinic was down a quieter alley in Thamel so that was nice and the place was clean. The therapists were just wonderful and did a great job. We liked it so much we tried to find the one in Pokhara (but kept walking the wrong direction so never found it unfortunately)..... but then we returned again to this on in Thamel after our trek. My only minor complaint was that during our massage (my husband and I were in the same room) the 2 therapists talked to each other quite a bit - and I prefer a quieter environment for massage. But the massage quality was excellent and the therapists (I had Ramsey both times - husband had Santoss and ... I forgot the other name) were so nice and personable. They spoke better English too than most people in Thamel! Massages when we went were 1500 rps/60 min and 2100 rps/90 min - so it equates to about $18 USD."
        }, 
        {
            "index": 168, 
            "rating": "5", 
            "review": "The best massage ever. I visited the Kathmandu clinic when returning from my 10 day trek in Annapurna. I got a massage from Ramji and it was just perfect. He has healing hands and always find the spots which need to be worked out. The clinic is very clean and all the staff id professional and friendly. I highly recommend you to stop there after your trek!I was so happy with the 1st massage that I returned for another relaxing one 2 days later just before heading to the airport!"
        }, 
        {
            "index": 169, 
            "rating": "5", 
            "review": "Just what the doctor ordered. Got a sports massage. This guy hit all my pressure points. One of the best massages I have had and I've had quiet a few in Thailand. Well worth a visit"
        }, 
        {
            "index": 170, 
            "rating": "5", 
            "review": "Look for them. You really need to look for the signs as they are easily missed. We visited Seeing Hands in Pokhara and enjoyed the experience so we thought we'd support the Kathmandu branch. I do say enjoyed with tongue in cheek as they find all the knots and problem areas and work them. No pain, no gain. They really are very good at what they do and the cost is well worth it."
        }, 
        {
            "index": 171, 
            "rating": "5", 
            "review": "Best massage I have ever had!!. Worked all the muscles. Very nice strong massage which I like. Listened to what I needed and wanted. Superb!!"
        }, 
        {
            "index": 172, 
            "rating": "5", 
            "review": "Best massage in Kathmandu. If you want a correct massage that addresses your issues and not a holiday rub than this is the place. Its also for a good cause so it's rude not to go."
        }, 
        {
            "index": 173, 
            "rating": "5", 
            "review": "Nice experience. Although our taxi driver took a while to find the place we, my wife and I experienced a very professional and well done massage. The massage therapists continually inquired of us on how to proceed with varying degrees of pressure. We thoroughly enjoyed the experience. Recommend Highly!"
        }, 
        {
            "index": 174, 
            "rating": "5", 
            "review": "Great Swedish Massage in Kathmandu. After trying out the blind massage branch in Pokhara, I also gave the Kathmandu version a try. There is basically the same to say about both places: The different people that gave the massages were all very well trained and highly professional in giving a wonderful western-style massage. It was good fun to support such a great project that gives work to blind people. The people that treated me there were extremely nice and spoke good english - some of them were a little too talkative to really relax - but of course I would probably be same if I couldn't see the world and people around me.I would highly recommend this place for a general well-being massage if you have no acute pains which you want to have treated. For the latter I would rather go to places like Sotai in Kathmandu and Patan where the staff is perfectly trained in curing whatever discomforts you might bring to them.Many of the other \"specialised\" massage places around Thamel are not as professional as they might look like. Many are even brothels rather than massage parlours. A \"foot reflexology\" in many cases is often not at all related to the \"reflex\" points but rather a general lower leg massage. Many of the \"ayurvedic massage\" places are also not upto any standard one might expect. If you want a surely great treatment - in western style though - stick to blind massage. A safe bet! I hope they introduce some Asian or alternative massage techniques there some day!"
        }, 
        {
            "index": 175, 
            "rating": "5", 
            "review": "Absolutely Amazing!. Seeing Hands clinic is a brilliant clinic in Thamel, run by blind masseurs. The guys there were friendly, welcoming and gave me and my friends brilliant massages. We felt really comfortable and they were very attentive. I can't recommend coming to this place enough. And it is non-profit. It was the perfect massage after completing the Everest Base Camp trek too."
        }, 
        {
            "index": 176, 
            "rating": "5", 
            "review": "Not like the other Massage places!. Sadly katmandu has a number of dubious massage places around and even the non dubious are probably not trained. nepal has no real tradition of massage so don't be fooled by any supposed traditional aspects. Seeing hands is new to katmandu but has been established in Pokhara for many years and this is simply an offshoot. Theres usually a westerner to oversee the work as its a charity and the blind practitioners are trained by them. Most seem to be chiropracters etc. Having had a few back problems in my time I was hopeful that they could sort out mine, which they did. Its not what they're there for (its supposed to simply be massage after all) but the level of expertise by these guys (and girls) is impressive. So if you've done your back in on a trek or simply want a relaxing massage then come here, its a great scheme and reasonable prices."
        }, 
        {
            "index": 177, 
            "rating": "5", 
            "review": "Wonderful in every way. I've just had a truly exceptional massage at Seeing Hands. Seriously... go to these guys. Not only will you be supporting a truly wonderful endeavor, but you also will have a top quality professional massage. Seeing Hands should really be supported - they deserve it."
        }, 
        {
            "index": 178, 
            "rating": "5", 
            "review": "Great massage and great service. I visited Seeing Hands twice during my 2 month stay in Kathmandu. The two therapists that I saw (Laxmi and Santosh) had slightly different techniques, but both gave very professional massages, with just the right amount of pressure etc. Perfect for post-trekking or just to relax when the craziness of Kathmandu is getting a bit much for you. During June and July they were not too busy so it was easy to book an appointment. Well worth the extra rupees compared to some of the other massage places around."
        }, 
        {
            "index": 179, 
            "rating": "5", 
            "review": "wonderful message in kathmandu. At the end of our trip, we wanted to go to massage to make our body relax because we depart from Nepal. there are 100s of massage center in thamel but one of our guides took us to Seeing Hands Clinic........ wow ...... it was like....... no words.I booked for 60 minutes massage but at the end I went for 2 hours....... note they have their clinic in Pokahra as well."
        }, 
        {
            "index": 180, 
            "rating": "4", 
            "review": "Warm and welcoming. Relaxing and pleasant experience, made unique by the concept. Bit of a fiddle to locate, but so are most things in Thamel."
        }, 
        {
            "index": 181, 
            "rating": "5", 
            "review": "Excellent massage for a great cause. I had an excellent massage from Lakshmi. She was very kind and had a gentle demeanour but gave a very hard and thorough all over massage. All the masseuses seem to be very well trained and will go as hard or soft as you want. Aside from that, I think what this NGO is doing is excellent in creating a sustainable living for those who work there. Highly recommended!"
        }, 
        {
            "index": 182, 
            "rating": "5", 
            "review": "WOW!. I am very nervous about getting my body out to people, so this was the only time I was gonna get a massage. And I am very glad i did the lady was brilliant at her job!!!My bf also all loved it! we are both really pleased we went :)"
        }, 
        {
            "index": 183, 
            "rating": "5", 
            "review": "BEST MASSAGE EVER!. This is worth every cent!! The clinic is clean and the staff are so friendly. I had a massage off a young guy and as I am not used to getting a massage of a male, i wondered how I would feel about it, but this guy was so amazing and really had a gift of making you feel comfortable and giving a great massage. This was my highlight of kathmandu"
        }, 
        {
            "index": 184, 
            "rating": "2", 
            "review": "very noisy, phone was going off all the time. I went to the one in Thamel, it was not as relaxing as expected as the room was right next to the road and a car was unloading bottles right outside the window. Also the phone of the massagist was going off all the time. It was on silence but I could still hear it, and one time even feel it as it was in her pocket and leaning on my body!"
        }, 
        {
            "index": 185, 
            "rating": "5", 
            "review": "Excellent Massage and good support. I feel more supporting to blind people than using the massage services but i do not means that i did not get good services. It was excellent and porfesional massage. Thank you guys and keep it up!"
        }, 
        {
            "index": 186, 
            "rating": "5", 
            "review": "Great Experience. I had a massage done here, as mentioned by other reviewers the masseuse is a blind person but that actually makes them better at what they do.I took the 60 Minutes massage and it was amazing , I was actually tipsy after it. Loved it and totally reccomend it"
        }, 
        {
            "index": 187, 
            "rating": "1", 
            "review": "Sorry, but worst massage ever. I was really looking forward to my massage here based on the reviews I'd read. Unfortunately, this was the worst massage I have ever had. I could tell as soon as the girl put her hands on me that she had no idea what she was doing and half the time I felt like she was trying to massage my bones. I feel bad about writing a negative review, but I guess the point of tripadvisor is that you're honest, and I don't want others going with high expectations like I did. To be fair, when I left, I noticed in the review book some really great comments, but next to the girl's name that I had, someone else had also written a negative review. I'm guessing I just got the wrong masseur!"
        }, 
        {
            "index": 188, 
            "rating": "5", 
            "review": "best message. the only other message I ever had was in a 400 year old bath house in Istanbul. Therefore, I do not qualify as an expert but if feeling good is a good criteria, the Seeing Hands Clinic was terrific"
        }, 
        {
            "index": 189, 
            "rating": "5", 
            "review": "Excellent. I became interested in Seeing hands after a friend told me about the history behind it being set up by a couple from London to help blind people in Nepal, who had trouble finding jobs, by training them in massage. I booked a 2 hour massage after I came back from trek and I would highly recommend others do to so too, it was well worth it. They had a professional massage table, the rooms were spacious and they had a seperate shower/bathroom for customers to use.I had a female masseur who although was tiny was very stronge and was easily able to work on all of my aches and pains. I would advise to book in advance as they are popular and book up very quickly."
        }, 
        {
            "index": 190, 
            "rating": "5", 
            "review": "Very, very good massage. Honestly, it is first-class! Just go there and feel for yourself. I and all the other reviewers are not lying here."
        }, 
        {
            "index": 191, 
            "rating": "4", 
            "review": "Very Good massage at an Excellent price!. My hotel charged $125 for a one hour massage. After finding this on trip advisor, my wife and I paid a visit. The facilities were very clean and the staff was pleasant. The massage was very good, but not phenomenal. The price is so low that it was almost enough to rate this as excellent. I would definetly visit again. We received two massages with tips included for $30."
        }, 
        {
            "index": 192, 
            "rating": "5", 
            "review": "Believe it!!!. This one is worth the visit. My hit list looks like this: EBC, Pokhara, Last resort, and Seeing Hands Clinic. Well worth the visit. Never had a massage by a man, but Chilan ?spl was professional. He asked where to focus, then began the beat down and torture session. He dug into some old war injuries from high school football, motorcycle crashes, and some random ones I didn't know about. Afterwards I felt mobility in my shoulders and neck that was missing for years. When I hit it big he's got a spot in my entourage!"
        }, 
        {
            "index": 193, 
            "rating": "5", 
            "review": "AMAZING!!!. After reading so many reviews, my girlfriend and I decided to give Seeing Hands a shot... let me tell you, this was one of the best massages I have received. The therapists and staff are all exceptional and friendly, and they know what theyre doing. They gave us the story as to how the clinic opened, and it was quite interesting. During the massage, they actually pay attention to every last detail, and its amazing how well trained they are. Even though the therapists can't see, as they were doing the massage, they could feel exactly where I had knots in my back, and they would focus on those areas.I would HIGHLY suggest for anyone who visits KTM to pass by...."
        }, 
        {
            "index": 194, 
            "rating": "5", 
            "review": "Excellent massage. My mom and I went to the seeing hands clinic in Thamel (just opposite the Gaia cafe), and it was really great. It was so good that we immediately booked another 90 min appointment for 3 days later (when coming back from our trekking). Both my mom and I had a very positive experience, and both the women and the man massaging us did an amazing job, just finding the right spots and working on them.Very clean and comfortable environment as well.NB: prices just went up, but 90 min massage for 24 dollars is still very very cheap."
        }, 
        {
            "index": 195, 
            "rating": "5", 
            "review": "Don't miss it. The massage done by blind people and it's very special. They are professional, the place to… neat and clean and the massage itself is very good. And also you have the chance to support the blind community helping them to make a living trough a healing practice."
        }, 
        {
            "index": 196, 
            "rating": "5", 
            "review": "more than 'seeing hands'. This is a special place to go and have a massage. I went for one before my trek and booked another for when I was back. It is a massage clinic. . . clean and professional. I felt 'new born' after this long non rushed massage that was great value for money. They provide a great service in clean premises. It seems as if there are quite a few massage parlours around which should not be compared with this clinic."
        }, 
        {
            "index": 197, 
            "rating": "4", 
            "review": "Highly recommended. A great massage in clean surroundings. I actually had a thigh muscle problem and I must say after a few visits the problem subsided. A very nice couple run the place."
        }, 
        {
            "index": 198, 
            "rating": "5", 
            "review": "Amazing. Definately the best massage I have ever had . a must do"
        }, 
        {
            "index": 199, 
            "rating": "5", 
            "review": "Great massage. Easy to find. good service and value. went twice it was so good. highly recommended"
        }, 
        {
            "index": 200, 
            "rating": "5", 
            "review": "Best massage ever. We had the best experience. Very good sports massage. We had an hour massage before trekking and one after:) Also very reasonable price."
        }, 
        {
            "index": 201, 
            "rating": "5", 
            "review": "Best Massage Ever!. After a long plane flight half way around the world and then a week of treking, the Seeing Hands Clinic delivered the best massage we have ever had! Was really amazing! Be careful of the other massage places in Thamel, they can be VERY dodge! This was a legitimate massage place that will definitely sort out sore and tired muscles!"
        }, 
        {
            "index": 202, 
            "rating": "5", 
            "review": "Excellent post-trek massage. We visited Seeing Hands after reading the reviews on Trip Advisor and we weren't disappointed. From the moment we arrived the staff were friendly and professional. The facilities were clean and modern and the massages were great value for money. I had the 'relaxation massage' and my partner had the 'sports massage' - both of which can be highly recommended. All in all, a really great experience!"
        }, 
        {
            "index": 203, 
            "rating": "5", 
            "review": "Therapeutic Massage. I haven't actually been to the clinic itself but I did receive a 10 minute sample by one of Seeing Hands massage therapists at their stall during the Barbar Mahal Revisited Night Bazaar. I'll be honest, the massage was quite painful but only because they are well-trained and know what they are doing. This isn't for someone who's looking for a simple relaxation massage during which they will fall asleep. If you are coming back from a trek or generally feel tight from your travels, the therapists at Seeing Hands will address every knot and ache you might have. I knew I was in desperate need of a tune up of the neck and back and in only 10 minutes, though quite painful, I walked away feeling looser, more relaxed and generally pain-free. I will be booking a full massage shortly to get the rest of the kinks worked out! Lastly, I'd like to mention that Seeing Hands is a wonderful organization that is doing a lot for the blind community in Nepal. The organization really is turning what many here believe to be a \"disability\" into a real gift."
        }, 
        {
            "index": 204, 
            "rating": "5", 
            "review": "Best massage ever!. I totally agree with all previous reviews and positive comments. I've visited Seeing Hands Clinic on my last day in Kathmandu and I honestly regret that I didn't go there earlier. Clinic was actually located 3 min from my hotel (Holy Himalaya Hotel).I have registered my visit in the morning and had this amazing massage the same evening after busy day. I've chosen 1h relaxing massage and that was absolutely enough - I wouldn't probably survive sporting or extreme massage. Everything was clean and fresh (really clean even up to European and American standards!) and price for such massage is so low - this is 'must do' when in Kathmandu. I was amazed how professional, calm and strong my massager was - I didn't know that I have so many points on my body which could provide so much pain, but he controlled that and not even once I had to say to stop - he knew exactly how strong he should massage me - absolutely stunning. Next time in Kathmandu I will be booking this massage probably for every single day; it is worth it and helps them as well to have decent job and salary. 5+ as a recommendation."
        }, 
        {
            "index": 205, 
            "rating": "5", 
            "review": "Wonderful Experience. My husband and i visited Seeing hands on the last day of our trip to Kathmandu. It was a wonderful experience. Their massage eased away the aches and pain of all the climbing and walking we did on our trip. A \"must visit\" if you enjoy a good massage and the best part is that a part of the charges goes towards charity!! Felt good ;-)"
        }, 
        {
            "index": 206, 
            "rating": "5", 
            "review": "As good as they say.. Best massage you'll ever get for £10. Friendly and accommadating."
        }, 
        {
            "index": 207, 
            "rating": "5", 
            "review": "Extraordinary experience with highly trained and talented practitioners. During my time in Nepal during October/November 2011, I visited Chiran at the Seeing Hands clinic 3 times - it was that good. In particular, the treatment I received before and after a mountaineering trip in the Everest region was the best remedial treatment I have ever received. After many treatments by many massage and related therapists over the last 15 years, these treatments were extraordinary. As I write this back in Melbourne, I would love to be transported back for a treatment! Whether you are about to climb mountains or battling the Kathmandu traffic, I highly recommend visiting the Seeing Hands Clinic in either Kathmandu or Pokhara - you won't be disappointed."
        }, 
        {
            "index": 208, 
            "rating": "5", 
            "review": "Relaxing massage and friendly professional servive. We had a massage here in November after trekking. The whole experience was enjoyable, with friendly and professional blind massage staff. It's a very worthwhile charity to support, and we definitely recommend that you give them a go."
        }, 
        {
            "index": 209, 
            "rating": "5", 
            "review": "Best massage I've ever had. These guys were amazing, very worldly, friendly and professional!"
        }, 
        {
            "index": 210, 
            "rating": "4", 
            "review": "good job. glad to visit this place before leave kathmandu, had an good time here."
        }, 
        {
            "index": 211, 
            "rating": "3", 
            "review": "Needs a little cleaning. Both mass were fined but it seems the place is a little dirt, and the towels must be changed!!!."
        }, 
        {
            "index": 212, 
            "rating": "5", 
            "review": "Great massage for a great cause. A great massage by the blind masseurs, they can feel the knots and trigger points that others miss. This massage place is set up by a UK charity to provide blind Nepalis with a way of life so you know your sore Trekkers legs aren't the only thing benefiting from the massage."
        }, 
        {
            "index": 213, 
            "rating": "5", 
            "review": "Brilliant place. Great massage, perfect thing to do after a trek. Much prefer giving our money to these people. I cant imagine theres any other opportunities for young blind men & women in Nepal. I'll definitely go back there after my next trek."
        }, 
        {
            "index": 214, 
            "rating": "5", 
            "review": "wow! The best massage I ever had...for only $15!!!. This place is the hidden gem of Kathmandu. The British couple that have set us this massage clinic ought to be congratulated! All the massage therapists are blind and professionally trained. I have had many professional remedial and sports massages in Australia but none come close to the professionalism of this place! The staff are extremely polite, outstandingly versed in English and have the hands of gods!...all for Rs.1200/hr!!! If you're looking for an amazing pre- or post-trek massage, go here. But know this, it's not a dodgy \"massage\" parlour where you will get propositioned for sex - it is strictly professional and will provide possibly the best massage you will ever have!Its a bit tricky to find but head down the alley RIGHT TO THE END and its in the nice looking building/house on your right. I didn't even book, just walked in. I highly recommend this place, plus your money is going to train more blind Nepali massage therapists - a great cause indeed!"
        }, 
        {
            "index": 215, 
            "rating": "5", 
            "review": "Excellent after a walk in the mountains. Very well trained people who provided an excellent service. The massage was great."
        }, 
        {
            "index": 216, 
            "rating": "5", 
            "review": "Great massage and wonderful staff. My boyfriend and I tried the seeing hands massage, and it was a great experience.The staff was very friendly, and they spoke English at a higher level than we have heard any where else in Nepal. They asked us several times if we liked the pressure, if we feld comfortable etc. We had a therapist each and enjoyed our massages in a very clean and nice room. Highly recommendable for couples sinces you can chat away during the massage.We Got 90 minutes and that was not a second too much."
        }, 
        {
            "index": 217, 
            "rating": "4", 
            "review": "Relaxing. Excellent massage. Reasonable price. Professional service."
        }, 
        {
            "index": 218, 
            "rating": "5", 
            "review": "A+. Seeing Hands is a God sent! I had the 60min relaxation massage and will definitely be heading back for another! The whole experience was flawless: the office and massage room are extremely clean and comfortable and the staff are very knowledgable (we even heard them discussing different anatomy units throughout the massage!), 100% professional and very friendly. I thought it was really good value for money as well (12,000rps for 60mins), and knowing that their profits go to such a great cause we ended up making a donation as well (only US$50 covers the scholarship to train a new masseuse).Definitely recommend!"
        }, 
        {
            "index": 219, 
            "rating": "5", 
            "review": "The best massage in the world. I went there in April 2011 and I had a massage with Laxmi (I hope that's the way it is spelled). She was extremely professional, I just can not forget those massages, I went there everyday during my stay in Nepal.Things about the place: Very clean, very welcoming! It's the perfect solution for those who goes there for trekking. Go to have a massage there after.It's a couple that runs the business and they are so friendly.I would recommend Seeing Hands as the best part of Nepal."
        }, 
        {
            "index": 220, 
            "rating": "5", 
            "review": "Great massage. Blind couple giving a massage. Great value for money - take their time and apply great strength! Definitely recommned."
        }, 
        {
            "index": 221, 
            "rating": "4", 
            "review": "interesting experience. I went to the seeing hands clinic in Pokhara and Kathmandu. Both massage were good and strong. I really had the feeling that they know what they were doing. Although it was really tough and they found my week spots. Autsch! :) The clinic is basic and clean. It lays in a quiet street close to the restaurant Gaia. People are nice."
        }, 
        {
            "index": 222, 
            "rating": "5", 
            "review": "Excellent Massage. My masseur was named Shiran and he was such a nice man. His wife was called laxmi and she was nice, too. The whole place was clean and well-managed, with a friendly and helpful receptionist. Needless to say, the massage was one of the best. Very professional. It was obvious that they have been well-trained. Highly recommended and an incredibly important project for the blind people of Nepal. Top marks."
        }, 
        {
            "index": 223, 
            "rating": "5", 
            "review": "Great Massage. I get massages all over the world, and this one was great. Deep tissue massage for 1,200 Rupees for an hour (approx USD $16). A bit more than I pay for in other developing countries, but Chiran is a great masseur and it is a bargain for the amount you pay."
        }, 
        {
            "index": 224, 
            "rating": "5", 
            "review": "Best Massage I have ever had in Nepal!. I am visiting in Nepal twice a year and get massages every time. I heard about 'Seeing Hands' had opened a clinic in Kathmandu so thought to check them out. Wow! Not only was it an excellent quality of deep tissue massage, the whole atmosphere was very welcoming, clean and safe. By far 150% better than the average massage clinic in Kathmandu! Plus the anatomical knowledge of the practitioner was above average. Highly recommend. Especially for solo women, who might have reservations of getting a massage, they have women & male practitioners, but all are 'safe' in my experience so far. I will be back! thanks guys ..."
        }, 
        {
            "index": 225, 
            "rating": "5", 
            "review": "High Quality Massage in Kathmandu. My wife and I have been going to the same masseuse in Sydney for the past 12 years, and whilst travelling it is very difficult to find one of a similar standard. However this was not the case with Chiran at Seeing Hands Massage where we received a great deep tissue sports massage, both before and after our trek in the Himalayas.I would highly recommend the massage to anyone going to Kathmandu, plus it is good to know that you are helping to support such a worthy organisation."
        }, 
        {
            "index": 226, 
            "rating": "5", 
            "review": "Don't miss the chance to get a massage here!. My friend and I went to get a massage here 3 times during a 4 day stay. Enough said. We were originally attracted by the idea that this was a charity clinic, but became repeat clients because of the exceptional skills of the therapists. I get regular massages back home in Canada, and my massages here were among the best I've ever received. The massage therapist manged to find and get out knots in an extremely skillful manner. I was amazed by how good I felt after the massage. I highly recommend this clinic. You will not be disappointed."
        }, 
        {
            "index": 227, 
            "rating": "4", 
            "review": "day at the spa. They give fantastic massages. Also you can do an day at the spa for an excellent price! Will it be exactly like a spa day in America, no but it is totally worth it after a long trek in the mountains! The massages are fantastic! The facial is interesting, so go ahead be adventurous, it doesn't hurt. The mani/pedi is fantastic! 7 hours of pampering = one amazing experience!"
        }, 
        {
            "index": 228, 
            "rating": "5", 
            "review": "One of my best messages. The host was lovely and the massage was so professional! The prices similar to any other place but the service and the treatment really changes the balance! Value for money- yes yes yes. Highly reccomend going there!"
        }, 
        {
            "index": 229, 
            "rating": "5", 
            "review": "Ofuro. I was surprised seeing such a good spa in thamel is a family oriented spa it was really good getting experience in real spa. I usually go to the spa in lajimpat but this is the best spa in Nepal I was amazed.i took my family in every weekends to this spa the only thing that I didn't like is noisy when I went in that spa there were a group and they started arguing each other it makes me little difficult to relax but this is the best spa in thamel."
        }, 
        {
            "index": 230, 
            "rating": "5", 
            "review": "The perfect spa for family. I had 1hour full body massage.it was fantastic,and all the boys here are so friendly n is very clean area.."
        }, 
        {
            "index": 231, 
            "rating": "5", 
            "review": "Great Massage. We took the dry sauna and an hr massage. The massage therapist were really good. We actually lost track of time but we're not charged anything extra. It was a great experience after a long trek!"
        }, 
        {
            "index": 232, 
            "rating": "5", 
            "review": "Best thai massage. I did best thai massage in nepal it was same like thailand the massure was trainewell and he did the best thai massage for me i never forget this real therapy one of thbest massage parlour in thamel. I visit this place again with my friends. Highly recommended.."
        }, 
        {
            "index": 233, 
            "rating": "5", 
            "review": "Lasting hair . I did hair colour and hair straight in real therapy tat colour was too good and they told me to come after 3 days to put hair spa and my hair looks healthy and I satisfied with there service best parlour in thamel."
        }, 
        {
            "index": 234, 
            "rating": "5", 
            "review": "Excellent therapy center in Kathmandu. Before deciding on a spa, find out about the options available at Real Therapy & Beauty Point. After taking the whole body message, sauna and offuro service, I found the best therapy place in Kathmandu. Cheerful staff members with peaceful environment and excellent therapy is the best part of the therapy center."
        }, 
        {
            "index": 235, 
            "rating": "5", 
            "review": "Nice massage. I do regularly massage and steam sauna in this real spa but this time I was not satisfied like before too noisy in upstairs and they stoped construction for 1 hrs then I felt good nice service they see only customer satisfaction at any how."
        }, 
        {
            "index": 236, 
            "rating": "5", 
            "review": "Best Spa in Kathmandu . I came here on my visit to Kathmandu the people were so nice the hospitality was the best the full body massage was the best"
        }, 
        {
            "index": 237, 
            "rating": "5", 
            "review": "Relaxing full body massage. I decided to treat myself after a 9 day Annapurna Base Camp circuit and found Real Therapy on Tripadvisor. I got the one hour nepali full body massage with oil. The masseus was very nice and professional, she made sure the pressure was right at all times. My body felt very relaxed afterwards, I was also able to take a warm shower afterwards.The massage parlour looks like its currently under construction, so the facilities aren't as nice as expected but does the job."
        }, 
        {
            "index": 238, 
            "rating": "5", 
            "review": "Best beauty parlour in thamel. I did hair straight in this real therapy it is very best in my life I did 4 times my hair done I was fully satisfied .I love this place. nice real beauty parlour."
        }, 
        {
            "index": 239, 
            "rating": "5", 
            "review": "Best family spa. There isn't anywhere such place where we can go with family to do massage steam and sauna in thamel. So many people thinks thamel is only for the teenager's but it's wrong real therapy is the best spa in thamel another name of that real therapy is family therapy . I went to do massage and my wife is interested to do hair colour , facial,meni pedi and they made us a package and my two sons did ofuro we enjoyed a lot in that spa."
        }, 
        {
            "index": 240, 
            "rating": "5", 
            "review": "Wow. Real therapy was recommended by our guide for the day \"lotus flower\"…he was spot on! We tried the 45 min foot rub and loved the service so much we went back for a full 60 min massage the next day. The service was professional beyond anything I've had in the US. Maneesh was excellent, and in fact, the best massage I've had in my life! Wow. Give yourself the opportunity to experience this, you will not regret it!"
        }, 
        {
            "index": 241, 
            "rating": "5", 
            "review": "Excellent place!!. Really great massages & customer service. This was one of the best massage places I've ever been to. Going back for a Third time tomorrow!! Highly recommend it!!"
        }, 
        {
            "index": 242, 
            "rating": "5", 
            "review": "Korean gang massage. Am a korean guide and i have 11 korean guest and we al together went to do massage in real therapy everyone are so satisfied i recome d this place very good massage."
        }, 
        {
            "index": 243, 
            "rating": "5", 
            "review": "Day spa. I have big pain in my backbone and I visited this spa to do massage . They recommend me to do nepali massage. The masseur is very professional in nepali massage. After that massage my back pain is relieved and I was shocked I went to many hospital but my backpain was not relived but when I did here it was treatment I visit this place every time."
        }, 
        {
            "index": 244, 
            "rating": "5", 
            "review": "Ofuroo -onsen -. I went so many places to do ofuro but i didnt find anywhere i searched trip advisor and i got ofuro in real therapy it was like in japan then i visit this place every weekend nice place clean and neat place. I recomend this place to everyone."
        }, 
        {
            "index": 245, 
            "rating": "5", 
            "review": "Best massage in thamel. Real therapy is One of the best place in kathmandu. Here massage was very professional all the staffs are well trained. Those staffs hands are same as others is the best spa over the worldwide. They offer steam and sauna complimentary when I did massage is the best place in kathmandu."
        }, 
        {
            "index": 246, 
            "rating": "5", 
            "review": "Best Steam and sauna. Best steam sauna bath in real spa. Steam room is big and there is always open whether there is electricity or not so I always visit this place with my friends to do steam and sauna and they have clean towels . They provide nice soap and shampoo . Everything is good in this place."
        }, 
        {
            "index": 247, 
            "rating": "5", 
            "review": "Gang ofuro. superb ofuroo best place for ofuro highly recommended. neat and nice place. only thing is body wash is too liquidity in cream couldn't clean nicely my body."
        }, 
        {
            "index": 248, 
            "rating": "5", 
            "review": "Unforgettable moment.. It was a great time. We all enjoyed steam ,sauna and ofuro .when I got a service I felt like I'm in heaven. But only thing is that little noisy in sauna room might be there were many customers . But it was a good experience."
        }, 
        {
            "index": 249, 
            "rating": "5", 
            "review": "Real spa. Massage is good. They are very professional. But the water is too hot there isn't anyone to ask. I took shower with that hot water when i finished my shower 1 boy came and asked me could you need any help i told him i need help before not now. So my suggestion is be punctuality be in correct time ."
        }, 
        {
            "index": 250, 
            "rating": "5", 
            "review": "Best spa. Me and my friends went to do massage and they suggested to do 90 mins full body massage and the massage was fabulous and they gave us steam and sauna complimentary . I wish to visit this spa everytime."
        }, 
        {
            "index": 251, 
            "rating": "5", 
            "review": "Best spa in thamel. I am nepali but I stay in Barcelona and I was surprised to see that spa. It looks like 5star level and environment was to good. All staffs are so busy in handling their customer. And 1 boy came and he took me to the changing room and I took shower he guided me everything. Then he took me to the massage room there were flowers in mouth cradle and it smells nice. Then i did massage with oil it was the best massage I ever had. Whenever I come to nepal I visit this place .Nice spa."
        }, 
        {
            "index": 252, 
            "rating": "5", 
            "review": "Best spa. Every weekend I visit this place with my so many friends to do sauna steam and body massage and specially ofuro we sit with our whole friends in that hot spring water and it helps to reduce my fat and nowadays I become more healthier. I suggest to all friends exercise is not only a good idea to loose weight everyone has to do steam sauna and ofuro it helps to reduce weight. I took so many friends in this spa and everyone liked it and enjoyed it. Great place to fit your body. Everyone visit this place once ."
        }, 
        {
            "index": 253, 
            "rating": "5", 
            "review": "Best & Big family Spa . We was in Real Therapy & Beauty Point 3 month ago & we hard hole body massage, sauna bath, steam bath, ofuro bath & my wife also did mehendi. All we was very happy & enjoyed. We are recommended all of u to there & enjoy.............."
        }, 
        {
            "index": 254, 
            "rating": "5", 
            "review": "Good hotstone massage:. This is the first massage that i never had before such a good massage with healing music .The massure was good , professional and did a great job. The space is wide and i enjoyed a lot . Highly recommended."
        }, 
        {
            "index": 255, 
            "rating": "5", 
            "review": "Fantastic bodyscrub with massage ::. I went to trekking and my body tone was changed fully. Then my guide suggested me to go spa and he know the real therapy spa in thamel. He take me there and I did body scrub with massage for two hours and it was so awesome . I felt so relaxed and they gave me steam bath complimentary after the body scrub and my body tone was totally changed into my own colour. Then they offered me a herbal tea it was good. I thanked my guide very much to showing me such a nice place. Highly recommended.."
        }, 
        {
            "index": 256, 
            "rating": "5", 
            "review": "Good ofuro( onsen ). I went with my two children and we enjoyed a lot they put some herbs oil in that onsen and it is very sweet smell. My husband had a big pain in his back bone after doing ofuro he felt so relaxed and my children also enjoyed a lot. So I recommend this place for ofuro service is the best in thamel . Whenever I come to Nepal I visit this place. Thoroughly enjoyed."
        }, 
        {
            "index": 257, 
            "rating": "5", 
            "review": "Best massage I've had!. I felt so relaxed after having a 90 minute rejuvenation massage. My therapist was so obliging and professional. I just can't wait to get back for another treatment. All the staff are kind and welcoming."
        }, 
        {
            "index": 258, 
            "rating": "5", 
            "review": "Great Therapy Place. I viisited real therapy to do heena on hand I was surprised seeing their leaflet they are doing beauty treatments aswell then I changed my mind and I did shenaz facial deluxe menicure and deluxe pedicure then lastly heena. They did 1 hour facial and two of the staffs did my deluxe menicure and deluxe pedicure.i never did such a nice pedicure because after the pedicure my foot looked like baby foot and my face there is a different change in my face I totally changed myself in that place. Highly recommended.See you soon real therapy team"
        }, 
        {
            "index": 259, 
            "rating": "4", 
            "review": "Relaxing and rejuvanating spa. Some friends and I went for the full day beauty and relaxation package which ended up being 7 hours including the long lunch we took. It was such a peaceful place to spend the day. Bhabi , who I believe is the owner , greeted us and explained what the day would entail. He also made us sure to explain to our massage therapist what it was we wanted before we began our treatments.the day started with a much needed body scrub and a 90 mins massage followed by a lunch.the scrub and massage both was fantastic and my massage therapist did a great job. After lunch we continued with meni /pedi and finished with a beautiful facial .the price is resonable for all that it included.thank you too bhabi and his team formaking us feel so welcome and taken care ofduring the visit to real therapy."
        }, 
        {
            "index": 260, 
            "rating": "5", 
            "review": "Good massage . It is the best massage I ever had. Me and my friends visited there and we spended 4 5 hours it is really very awsome and I recommend to all friends and relatives."
        }, 
        {
            "index": 261, 
            "rating": "5", 
            "review": "Overall a great massage place. Went here after 21 days of full annapurna circuit trek and every part of my body was aching as you can imagine. Bought 1 hour massage and am extremely satisfied with their services. I did reserve my time so I didn't wait for my turn. Environment at real therapy was great with great ambience."
        }, 
        {
            "index": 262, 
            "rating": "5", 
            "review": "Best hot spring bath in Kathmandu. We did Oruro in the real therapy spa and really enjoyed that service. That service I was founded only one place in Kathmandu, we will come again..........."
        }, 
        {
            "index": 263, 
            "rating": "5", 
            "review": "Amazed spa in thamel. Went here for the first time the massage was nice and the atmosphere of spa all over was good the staffs are so kind they ask every couple of minutes what we need like coffee, herbal tea, or water. I did one hour massage but they gave me dry sauna and steam sauna complimentary , I thought the price gonna be very high I was afraid totally but lastly I was amazed the price too cheaper than I expected."
        }, 
        {
            "index": 264, 
            "rating": "4", 
            "review": "For the best service. Real therapy is the best spa in kathmandu which provide the best service to thew clients.hospitality service is nice so its the perfect place######"
        }, 
        {
            "index": 265, 
            "rating": "5", 
            "review": "Back pain relief spa. I went alone to do massage cozy I have so much pain on my back part . The masseuse was very professional he did good massage on my back now I want to stay there to do massage everyday is difficult to find like this spa in Thames please visit this place everyone surely like this I will recommend to everyone."
        }, 
        {
            "index": 266, 
            "rating": "5", 
            "review": "Family day spa. me and my family went to do ofuro steam and massage and this is memorable day for us my two sons enjoyed ofuro very much me and my wife enjoyed massage too much I highly recommend this place to everyone to visit one time ,this is good place in Thamel"
        }, 
        {
            "index": 267, 
            "rating": "5", 
            "review": "amazing. This place is one of the nicest in thamel. the staff is very nice and professional and the place is clean. the perfect place to escape the fuzz of thamel and relax for a good price."
        }, 
        {
            "index": 268, 
            "rating": "5", 
            "review": "Tantilizing Invigorating Sensational. I had the most amazing experience here and after being on the road for so long was the perfect alleviation of travel induced stress. I was left exhilarated and recharged after a two hour therapy by the exquisite and very professionally talented Manish - THIS GUY IS AN ABSOLUTE MASTER OF MASSAGE."
        }, 
        {
            "index": 269, 
            "rating": "5", 
            "review": "Best spa in thamel. I had body massage on real therapy ,it's 90 min long ,cost is reasonable and staff are so helpful and clean place. Sauna and steam bath are so refreshing. I will back again"
        }, 
        {
            "index": 270, 
            "rating": "5", 
            "review": "Best spa with wonderful services.... Best services with reasonable price .This is the best spa in i ever been..i did the whole real therapy packages which includes massage ,steam , sauna ,facial n amazing the ofuro(hot herbs water pond...it was so relaxing ::::love this place"
        }, 
        {
            "index": 271, 
            "rating": "5", 
            "review": "Great Thai massage. Professional, friendly staff and well trained in Thai massage. Highly recommended and would definitely come again :)"
        }, 
        {
            "index": 272, 
            "rating": "5", 
            "review": "\"Whole body massage\". Real therapy,I got a best massage place where I found open-minded professional staff to deal with.Location was very good and service was very excellent.When I feel tired and lazy,mostly I used to do so and I found the real therapy a best one.Better experience can feel during massage in real therapy,like it very much."
        }, 
        {
            "index": 273, 
            "rating": "5", 
            "review": "Best spa ever had. I had body massage with my family in this place and we were refreshed and satisfied.The massage done here is very good, even the rooms are clean. Sauna, steam and offuro are always open and are clean. On this service we spent 5 hours. there is provision for hot and cold shower even for the groups. We all enjoyed together and this is best spa in Nepal i had ever had."
        }, 
        {
            "index": 274, 
            "rating": "5", 
            "review": "Great body massage point. After our great trek in himalaya , we looking for massage place and we found real therapy and spa in center of thamel.They have very experienced person and great staff . if youb wish to do please try here ."
        }, 
        {
            "index": 275, 
            "rating": "4", 
            "review": "Full package. Real Therapy and beauty point is really serving very good service. Thanks to Mr Bhabi Sharma and whole team. Wish to see you growing day by day."
        }, 
        {
            "index": 276, 
            "rating": "5", 
            "review": "So relaxing.... We had two foot massages, which were actually a full leg deep tissue massage with some Thai massage included Thai massage as well. I can really recommend Manish (he is 19 years old and very experienced in massage)."
        }, 
        {
            "index": 277, 
            "rating": "5", 
            "review": "Mind Blowing Marvelous experience for the first time of steam bath and hot-water in winter. It was really great meeting at Real Therapy and Beauty Points explores the great shows from its presentation not from loud words, everyone feels unique and quite distinct experiences of hot water pond, dry sauna, steam sauna, whole body massage, relaxing group foot massage, hot stone massage, deep tissue massage and with great hospitality manner. I salute Mr. Bhabi Sharma +0977 9851089169 for introducing the very natural healing service in Nepal specially in Thamel. I would like to recommend to my friends to go once for life time memory and pleasure. i can't forget lemon water when i was inside steam sauna."
        }, 
        {
            "index": 278, 
            "rating": "4", 
            "review": "2 Different Experiences. I had 2 different experiences in this spa: the first was so terrific that I scheduled a repeat massage with the same masseuse 2 days later. Unfortunately, the 2nd time, the spa was packed, which caused problems with scheduling, and a rushed, less-than-great atmosphere.The pros: the spa is very well equipped and professional - it's not a \"joint.\" They have a locker room, showers, sauna and steam room, and the massage rooms are OK. (no music or candles, though, which is a pity). They give you slippers and towels, and there's a waiting area.I had a swedish massage both times.First time was a dream! She really knew what she was doing, and it was as good as any massage I've had anywhere in the world.When I returned 2 days later -- after having scheduled for a specific hour and a specific person - the waiting area was full. My partner and I were then rushed to a room together, and the 2 masseuses chatted between themselves. I asked them to observe the quiet.The shower/locker room was very crowded.Lesson learned: GO EARLY IN THE DAY. The evening becomes too rushed, and affects the experience. When it's good, it's great."
        }, 
        {
            "index": 279, 
            "rating": "5", 
            "review": "Best massage ever!!!!. After trying so many massage places around Kathmandu,we found this one in Thamel.This is the best spa for massage. I had the best massage ever!!! We tried Thailand many times,but this place was the best. If you want to have the best massage ask for Shanta or Srijana."
        }, 
        {
            "index": 280, 
            "rating": "5", 
            "review": "The best Nepali Thai massage. I love Thai massage and had tried a lot all over the world including Thailand of course. This one at Kathmandu was out of this world. I didn't know I could be twisted and bent in that many ways. At one point I was fully elevated from the bed with him under me. Best message ever after a long trek"
        }, 
        {
            "index": 281, 
            "rating": "2", 
            "review": "make sure how long they massage.. I payed for 60 minutes,but a stuff massaged me for 50 minutes.and a clock in the room was 10 minutes faster than exactly.so it made me feel they tried to cut 10 minutes.６０分のマッサージを注文しましたが実際は５０分でした。部屋の中にあった時計は実際と１０分進んでおり、わざとカットされたようにも感じます。マッサージも背中はうまくできたいる方でしたが、ヘッドマッサージはさっぱりでした。もう少し払ってでも、ガイドブックに載っているようなマッサージ店に行く事をおすすめします。"
        }, 
        {
            "index": 282, 
            "rating": "5", 
            "review": "Professional massage in Thamel. After checking a few massage places around, I was very happy to find this Spa centre. The place is very clean and professional. My therapist Pramod was doing a great deep tissue massage, with right amount of pressure and gentle stretches, I even decided to extend the session for another half an hour. There are also sauna and steam bath, you choose one before your treatment to warm up the body. Showers are hot, rooms have air conditioning, lockers, no power cuts.. the whole experience was just great, and I am quite surprised to be the very first one to review this place on tripadvisor, though they have a fb page with pictures and stuff.. https://www.facebook.com/pages/Real-Therapy-Beauty-Point/309665892519494"
        }, 
        {
            "index": 283, 
            "rating": "5", 
            "review": "Wonderful Massage. We came to Kinjjala after trekking for 18 days in the Himalayas. They had a specific trekkers massage that we both got including a gal that came with us from where we were staying. We've never had a 2.5 hour massage but it was incredible! Especially for the price! They even gave us 15% off for having all 3 of us. We all left feeling blissful and considering going back before we leave Kathmandu!"
        }, 
        {
            "index": 284, 
            "rating": "5", 
            "review": "The best spa in Thamel. I had been searching for a good place to have massage after my trekking,and I finally found the best place.the spa is clean,the service is great and the massage outstanding.Will definitely visit every time I come to kathmandu! Kinjjala spa is great."
        }, 
        {
            "index": 285, 
            "rating": "5", 
            "review": "abosolutly amaging . After a month of trekking this was the most enjyable massage.We had 4 hour kinjjala spa package and it was exceptional.especially the sports massage and crystal pedicure.fells like heaven.highly recommended ....."
        }, 
        {
            "index": 286, 
            "rating": "5", 
            "review": "Wonderful massage in a great place. We had one of the best massage ever in our life.we both choose the deep tissue massage which was far beyond our expectations. Highly recommended."
        }, 
        {
            "index": 287, 
            "rating": "5", 
            "review": "Absolutely a Fantastic two hours out of my day!. Wow! I felt like a floating flower coming out of this great two hour treatment. I did the foot and hand and a body massage with a sinus treatment. Very smooth, great pressure , water at the start and hot tea at the finish along with a nice hot shower. I'll be back for surehighly recommend this spavery professional!"
        }, 
        {
            "index": 288, 
            "rating": "5", 
            "review": "Amazing massage and Sirodhara treament. I cannot urge you enough to make time to visit Kinjjala Spa. I have had many massages in my time, however, this was the best. I finished my massage with a Sirodhara treatment - I think I just floated out at the end - highly recommend."
        }, 
        {
            "index": 289, 
            "rating": "5", 
            "review": "what a awesome place in Thamel. ABC 트레킹 후 찾은 곳!타멜 거리에서 마사지샵을 몇 군데 알아봤었는데 제일 깨끗합니다. 사장님이 아주 좋고 트레킹 후 모든 피로가 사라집니다. 최고!I visited after ABC trekking very kind people and owner. all of my fatigue gone!!!"
        }, 
        {
            "index": 290, 
            "rating": "5", 
            "review": "Wow!. There are many spas in Thamel alone and I had visited one before walking into Kinjjala. To be honest the only reason I came here was because a friend gave me a 20% off services card, but little did I know I would be one lucky girl to have received it.As soon as I entered Kinjalla I was warmly greeted with a \"Namaste\" said in unison, hands to heart, by all the present staff. Invited to take a seat, the manager handed me a menu with a large variety of services at surprisingly low prices.After a bit of questioning and honest suggestions/answers from the kind, attentive manager, I was guided through a sliding door where I was met with nothing less than a clean, well maintained, spa. I was truly impressed with the quality of my surroundings.In the first room I received a full leg and underarm waxing where the well trained ladies did their best to remove EVERY hair. It was a lengthy procedure, but nonetheless I was pleased with the finished product.Next, I was taken to a smaller private room for my 60 minute Swedish massage and all I can say is WOW. After given the choice of a male or female masseuse, (female of course), I received the woman who worked on my waxing so I was already comfortable with her presence and touch. I can't speak for all of the workers, but if any of them produce a massage like she does then you can't go wrong! I was so relaxed and her techniques were extremely effective in reaching what felt like every muscle in my body!Lastly, I was pampered like a princess during my duo mani-pedi with exfoliation, lotions, and more massage accompanied, of course, with a hot cup of tea offered by the manager who occasionally checked on me to make sure all was well.To top it all off, upon the completion of my services I was kindly awarded with yet another 25% discount for my next visit AND a complimentary foot massage! Again, the total price was very inexpensive for all the work I received. During my stay I was comfortable and well looked after. Needless to say I left a happy, satisfied customer and will definitely be returning.The only down side I would say was the length of time my beauty services took. If you come to this spa make sure you have the time and be ready to be treated like a queen (or king!)."
        }, 
        {
            "index": 291, 
            "rating": "5", 
            "review": "Amazing relaxing time :). I had been searching for a good, peaceful place to have Ayurvedic massage, and I finally found the best place!! This place is very clean, friendly, and peaceful:)I will definitely go back!! You will have amazing time here:)きれいで落ち着けるアーユルヴェーダのマッサージが受けられる所を探していたところ、このスパを見つけました。タメルにあるにも関わらず、とても静かで、値段も良心的です。スタッフは親切で丁寧です。マッサージ後は体がとても軽くなりました。おすすめのスパです(^-^)"
        }, 
        {
            "index": 292, 
            "rating": "5", 
            "review": "Simply the best. There lots of place to get massage in thamel but Kinjjala spa is the one of my favorite. Massages were great and messeuse consistently made sure the pressure was good .would highly recommend them and would definitely back when after finish my trekking thank you...."
        }, 
        {
            "index": 293, 
            "rating": "5", 
            "review": "The best massage in Kathmandu!. Having spent two months traveling in Nepal I keep coming back to Kathmandu and keep coming back to Kinjjala Spa (Wellness Center). The spa is clean, the service is great and the massage outstanding. The Trekkers massage combines Thai, deep tissue, Nepali and a couple of other types of massage. It is heaven for sore muscles and for restoring calm in the body. My favorite therapist is Saraswoti ... But the others are great two. Will definitely visit every time I come to Kathmandu!"
        }, 
        {
            "index": 294, 
            "rating": "5", 
            "review": "What a gem of a find!. Having been to a few dodgy spa experiences in Kathmandu, this was an amazing find! It's clean, with qualified therapists and top notch service at lower prices than the other so called spas in town. Cannot recommend this place highly enough."
        }, 
        {
            "index": 295, 
            "rating": "5", 
            "review": "Place is amazing, in heart of Thamel peace of paradise and tranquility . My recommendation for everyone to come on this place. Very well trained staff and professional guidance by doctor. Prices including warm welcoming and soon you feel like at home. Body and soul will thank you for this."
        }, 
        {
            "index": 296, 
            "rating": "5", 
            "review": "I'll be back... :). Perfect massage and a lot of options to pick from. Kind and professional staff, pleasant atmosphere and clean space. Great value for money."
        }, 
        {
            "index": 297, 
            "rating": "5", 
            "review": "Perfect after long trek. My friends and I went there based on the recommendations of our friends.we both tried the reflexology and facial after a trek and had an amazing relaxing time.really clean and hygienic.staffs are very friendly after our service they offer us green tea..highly recommended"
        }, 
        {
            "index": 298, 
            "rating": "5", 
            "review": "Best place to rejuvenate . I visited to kinjjala spa to do body massage,i was surprised seeing there menu they are doing beauty treatments as well and i did crystal manicure and pedicure it was awesome.i totally changed myself in that place.highly recommended."
        }, 
        {
            "index": 299, 
            "rating": "5", 
            "review": "The best place in Kathmandu. The atmosphere is very pleasant and tranquil, the manager extremely kind and nice, very good and professional girls involved in the massages. I hope to come back soon"
        }, 
        {
            "index": 300, 
            "rating": "5", 
            "review": "My Favourite Place for relaxation . Easily the best Spa in Kathmandu. Wonderful staff and extremely well trained in massage techniquesAs well its a great place for a wonderful facial. They use high quality products and the facilities are fantastic. Can't speak more highly of this place!!!"
        }, 
        {
            "index": 301, 
            "rating": "5", 
            "review": "\"Best spa experience\". After our tour to remote area we decided to go to kinjjala spa for a couple of massages.They have lots of best therapist. I had a shiatsu and crystal pedicure, service was really awesome The whole team is great."
        }, 
        {
            "index": 302, 
            "rating": "5", 
            "review": "\"Great spa in Thamel\". No word to describe Very good whole body massage place,very nice environment.I had remedial massage 90 min it was really awesome.I can recommend this place to everyone who wants real massage in town ..."
        }, 
        {
            "index": 303, 
            "rating": "5", 
            "review": "\"Best massage I ever had in Kathmandu \". I visited today because I had a lot of stress from travelling so much.I took halfday kinjjala special package.it was awesome,so relaxing.everything was perfect the staff were so friendly during my treatment they offer me juice and coffe it was great .strong hands and a good attitude,would recommend it..."
        }, 
        {
            "index": 304, 
            "rating": "5", 
            "review": "\"One of the best spa in thamel\". I visited kinjjala spa 5 times during my stay in Kathmandu.the spa is very clean and has progressive mind set.after long a long trek I am searching for a good massage place in thamel finally I found kinjjala spa\nStaff were so polite and friendly. Service was exceptional."
        }, 
        {
            "index": 305, 
            "rating": "5", 
            "review": "wonderful massage. We went here 3 times in 4 days. It was a wonderful retreat from the busy streets of Thamel. Massages were great (had both the foot massages and back massage) and the masseuse consistently made sure the pressure was good. And most importantly, it was very clean! Would definitely recommend."
        }, 
        {
            "index": 306, 
            "rating": "5", 
            "review": "Great massage in the heart of Thamel. There's loads of places to get a massage in Thamel but this one has become a personal favourite. Quiet, peaceful, clean, and the staff are lovely and very professional. Been 3 times now for deep tissue and Swedish massages. Love it"
        }, 
        {
            "index": 307, 
            "rating": "5", 
            "review": "Great Service, Reasonable Price. I go to Kinjjala quite frequently – once a week. The place is clean and staffs are friendly and massage is just great. Though many spas have opened in Kathmandu, but I always come here for great service and their price is also very reasonable. It’s actually great value for money. I would highly recommend this place. It is just amazing!!!"
        }, 
        {
            "index": 308, 
            "rating": "5", 
            "review": "Must visit spa in Kathmandu!!!!!!!!. If you need a massage and that too a good one, this is the place to visit in Kathmandu.I travel all over the world and am quite experienced when it comes to good massages and to be honest Kinjjala Spa stands out by far. Right from the time you enter the reception you can expect professionalism. The massage therapist is experienced and knows what your needs are.Very professional services , friendly staffs with high knowledge of hospitality. Would highly recommend them and would definitely visit them again when I am in Nepal. Thank you for your service and looking forward to it again."
        }, 
        {
            "index": 309, 
            "rating": "5", 
            "review": "the best i ever had. this is a best spa shop in Kathmandu.i went to many massage shop but here is best.massagist knows how to know massage."
        }, 
        {
            "index": 310, 
            "rating": "5", 
            "review": "Heaven. I cannot say enough good things about Mandala Studio Yoga and Spa. I had such a wonderful experience there between the yoga class I took and the full spa day package I did. First, the yoga classes are all very nice, with good teachers who each bring their uniqueness to the class. I appreciated that the teachers were so friendly. They offer many different types of yoga classes, so whether you're into yin, Ashtanga, or vinyasa, there is a class here for you.Now...the full day spa package. You must do it if you have time and are looking to treat yourself. At a great price - you get multiple spa treatments, breakfast and lunch, as well as a morning yoga class, and meditation at the end of the day. Also, the massage therapists are so caring and thoughtful. They really take care of you and make sure that you are comfortable and relaxed. It was a perfect way to end my month of travel in the beautiful country of Nepal.Also, the owners are super friendly and welcoming. It's inspiring to know how much the founder has invested into the study of yoga and sharing it with others, as well (you can find his bio on their website).Overall, this was a wonderful experience. Thank you to Mandala Studio for a lovely time!"
        }, 
        {
            "index": 311, 
            "rating": "5", 
            "review": "Great yoga and spa. My partner and i are staying 2.5 monts in nepal and chose to take 10 yoga classes for $60 each. We are complète beginners. The classes are great for all levels. The morning one is very good. 1.5h with full streching, power yoga and meditation. It'located in the only pedestrian street of Thamel is a huge advantage for the. constant horning. finally, We got a free massage on top with we did yesterday after 2 weeks of trekking. Very relaxing. Staff is also very nice."
        }, 
        {
            "index": 312, 
            "rating": "5", 
            "review": "Lovely. Wonderful, invigorating, and peaceful yoga class. This was a perfect way to begin our stay in Nepal."
        }, 
        {
            "index": 313, 
            "rating": "5", 
            "review": "Relaxing place after trekking. Surprised with a silent place for 2 hrs trekkers spa just after hiking. Located in shopping centre & can spend half day relaxing @mandala street."
        }, 
        {
            "index": 314, 
            "rating": "5", 
            "review": "Excellent!. Could not ask for more- lovely people, professional care, and great atmosphere!Highly recommended, both spa and yoga!"
        }, 
        {
            "index": 315, 
            "rating": "5", 
            "review": "Yoga tearcher certificate. I have been teaching yoga in Sooriya yoga, Laximpat for a while. I wanted to upgrade my teaching skills. I found Kritis yoga studio during my visit to thamel. Even though I was reluctant that I would find a good teacher there. Kriti's skill as a Yoga Instructer is above exceptional. I was so impressed with her teaching knowledge and experience that I took a month long teacher training course from her in hatha Yoga. Currently I am doing Vinyasa Yoga teacher training from Kriti. Thank you Kriti and Mandala Yoga studio staff and friends for looking after me, without doubt I will be a lifelong learner at your studio."
        }, 
        {
            "index": 316, 
            "rating": "5", 
            "review": "Yoga and massage. This is the best place for after trekking massage and yoga sessions. Very good spot in a quite and lovely area. There is a nice coffee place nearby for breakfast after morning yoga classes. Highly recommended!"
        }, 
        {
            "index": 317, 
            "rating": "5", 
            "review": "Yoga and massage! . We had past trekking massages there and it was just amazing, 90 minutes of pleasure. Few days after we are back for the morning yoga lessons and it also was very good. "
        }, 
        {
            "index": 318, 
            "rating": "5", 
            "review": "Thai massage. 60 minutes of this massage here were very useful after the 12 days of trekking. Good, proper and clean place! Prices are appropriate."
        }, 
        {
            "index": 319, 
            "rating": "5", 
            "review": "Yoga and massage training. Kriti and Biren the 2 major faces in Mandala studio are 2 of the nicest people you will meet. Biren is the business side and Kriti she is the yoga and massage guru side of the businessI found all of the staff to be warm and friendly very professional and extremely helpfulI did the yoga teacher training which had been busy , very interesting and has pushed me physically and mentally ( in a good way) I have learnt so much not just about yoga and massage but about myself. So good to have been with themThey also helped secure my student visa extension a big bonus which allowed me to stay in the countryWell done Mandala Studio"
        }, 
        {
            "index": 320, 
            "rating": "5", 
            "review": "Super Experience . Highly Recommended post trek!!!!! Nice staff and great massages :-) I did a yoga class and had deep tissue massage"
        }, 
        {
            "index": 321, 
            "rating": "5", 
            "review": "amazing spa experience. I had a traditional nepali massage with body scrub, time in the steam room and a pedicure. It was fantastic. The staff are friendly and professional. The place was clean and had a lovely atmosphere. I would recommend it and am definitely coming back."
        }, 
        {
            "index": 322, 
            "rating": "5", 
            "review": "Amazing place at the heart of Thamel.... Thank you!! Mandala Studio Yoga and Spa for a great experience for having special spa treatment... enjoyed and feel relaxed..!!!"
        }, 
        {
            "index": 323, 
            "rating": "5", 
            "review": "simply amazing . amazing relaxing massage at mandala studio yoga and spa, very friendly and clean located in the heart of Thamel, Mandala Street one of the unique place."
        }, 
        {
            "index": 324, 
            "rating": "5", 
            "review": "fantastic spa. we had 90 minute traditional massage and steam bath before hiking at mandala studio and it was really relaxing. It was so professional , clean and friendly and i will definaty come to have trekkers massage after hiking."
        }, 
        {
            "index": 325, 
            "rating": "5", 
            "review": "Amazing. Mandala studio is amazing. We went to yoga, had massages and a facial here. The place is clean, looks great and the staff are extremely friendly. They went out of their way to arrange an extra yoga class for us and could accommodate our group of 4. This is the best establishment in Thamel for yoga and spa services. I can not recommend this place enough."
        }, 
        {
            "index": 326, 
            "rating": "5", 
            "review": "Great Yoga, Massage and Facials. Came here prior to trekking to Base Camp for yoga, the instructor was excellent and very encouraging to the beginners in our group. We returned for the Trekkers massage and Glow Facials after our trek and were very impressed with the quality of service and friendly staff. The facilities are excellent and we highly recommend Mandala Studio Yoga & Spa."
        }, 
        {
            "index": 327, 
            "rating": "5", 
            "review": "A still, clean harbor of kindness, with an incredibly well qualified staff. I love Nepal! I have traveled to this beautiful country almost a dozen of times by now. And each time I sojourn in KTM, for no reason would I miss out on the opportunity to grant a visit to the Mandala Yoga Studio located in Sagarmatha Bazaar (Mandala Street). I have not (yet) used their yoga facilities per se, but have extensively benefited from numerous sessions of massage there. If like me, you like to \"pamper\" your muscles, joints & even soul after intensive & strenuous physical efforts, then the Mandala Yoga Studio is THE place to recover & deeply relax in Thamel:1) The massage facilities are outstandingly CLEAN (and I have benchmarks, for having visited most of the massage studios in Thamel). They are COZY, with an ELEGANT & NATURAL touch, inviting you purposefully to relaxation & stillness2) The staff is amazingly KIND AND QUALIFIED, being genuinely attentive to bringing the best experience to their customers. I have been very well taken care of during my stays, and can highly recommend in particular 2 incredible women practitioners, Kriti & Sonam. They live their art not just with their \"magic fingers\" but with their entire mind & soul. They are experienced, qualified, knowledgeable, kind & luminous.Go and pay the Mandala Yoga Studio a visit. It is worth it!"
        }, 
        {
            "index": 328, 
            "rating": "5", 
            "review": "the best massage in kathmandu!!!. must to do after you tracking or just for fun!!i did twice without even tracking :)the best massage in kathmandu!!!! great people and great service ;)"
        }, 
        {
            "index": 329, 
            "rating": "4", 
            "review": "Informative and Relaxing. Never been one for yoga but i went with my friends and enjoyed the classes very much the establishment is both clean and safe, the staff friendly and informative and the instructor was helpful and patient with my less then stellar yoga skills, ill be going back for a message so i am hoping that will be wonderful too!"
        }, 
        {
            "index": 330, 
            "rating": "5", 
            "review": "Great massage. I had a 90 minute shiatsu massage in mandala studio it was really great ever had in my life. Staff was really skilled friendly and clean environment and such a recomendable place."
        }, 
        {
            "index": 331, 
            "rating": "5", 
            "review": "Best place to be. After all hiking n treking everybody need peace , rest and free\nThis is the best place i have found in nepal to be .\nAwesome feeling , good massage , yoga ,spa and many more\nThanks for ur kind welcom"
        }, 
        {
            "index": 332, 
            "rating": "5", 
            "review": "Amazing experience. Mandala Studio is one of the best place in Kathmandu which is close to my favourite breakfast place OR2K. I had the trekkers massage and again shiatsu massage, it was really professional and realaxing. I would definitely recommend this place to go and have your choice of massages."
        }, 
        {
            "index": 333, 
            "rating": "5", 
            "review": "Ideal location and professional. Mandala Studio was located in the heart, just above my one of the best coffee place in Thamel. I have a trekkers massage after my one week trekking, it was totally relaxed and re-energetic. The facilities are clean, bright, friendly, very professional and owner was very helpful. Highly recommended anyone for sheer joy relaxation."
        }, 
        {
            "index": 334, 
            "rating": "5", 
            "review": "Mandala day spa special package. I came for an early morning yoga class and stayed for the day. Package included great Hatha class, yummy breakfast and lunch, high quality treatments including facial, oil massage, body scrub, shirodara and reflexology as well as excellent steam room. Treatment practioner was lovely and owner was very helpful. Highly recommended for anyone needing a self care day."
        }, 
        {
            "index": 335, 
            "rating": "4", 
            "review": "Mandala Yoga and Spa is a amazing place. Mandala Yoga and Spa is a amazing place to get relaxed in Kathmandu. Me along with my team of expedition took facilities provided by spa centre after the 15 days trek of Everest Base Camp. we took trekker massage and spa in this centre and found so nice and full of reenergize . Yoga Class/Spa/variety of Massage are the facility of this Spa. I personally recommend to take Yoga class of Kriti Mam. I am impressed with the service provided by host Biren and Kriti. Wish you always be in the heart of client as you are n mine."
        }, 
        {
            "index": 336, 
            "rating": "4", 
            "review": "Professional and ideal location. This is the only yoga class and massage I've received in Nepal, but relative to the quality and professionalism that I experienced in India, Mandala studio shoots them all out of the water. Mandala studio is located just above one of my favorite coffee shops in Thamel in the the middle of town, so there's no going out of your way to get there. Dipendra taught the yoga class and was really passionate about challenging his students and taking his time (he actually gave optional 30 minutes of extra instruction at the end for us to practice various inversions). The massage was lovely (they ask and take into account how much pressure and if you have medical conditions), my masseuse took her time and went above and beyond what I was expecting. The facilities are clean, open, bright, and well decorated."
        }, 
        {
            "index": 337, 
            "rating": "5", 
            "review": "Friendly and Professional. I attended daily yoga classes here at Mandala Studio for several weeks. I found Kriti to be a fantastic teacher and very helpful. I was challenged to better myself every day and have improved physically very much. I was also very impressed with the spa. I had a blissful massage and actually fell asleep I was so relaxed. The prices were also very reasonable and during the low season were happy to help out a little due to my student status. Thanks for everything guys!"
        }, 
        {
            "index": 338, 
            "rating": "5", 
            "review": "Really nice Environment. Its a really nice atmosphere, good staff and very quiet how though it is in the heart of Kathmandu. Definitely worth a massage!"
        }, 
        {
            "index": 339, 
            "rating": "5", 
            "review": "Excellent massage and sauna bath. This is the place for yoga and spa in ktm .which is located as heart of thamel ktm .i have been many times in the studio for Swidish masasge which is one of the best massage for me and perfect sauna bath.For sure it was the best destination for spa."
        }, 
        {
            "index": 340, 
            "rating": "5", 
            "review": "Best massage. Been there many times,well managed ,very friendly people, quality services ,which made it best spa of thamel"
        }, 
        {
            "index": 341, 
            "rating": "5", 
            "review": "Great spa n friendly environment at the heart of thamel. Guys if u r seeking a great massage n yoga class then mandala studio yoga n spa is the best.a peace environment net n clean to relax ur mind n body......"
        }, 
        {
            "index": 342, 
            "rating": "5", 
            "review": "Friendly and professional. I have been attending yoga classes almost everyday and they have made such a huge difference and positive impact on my health and strength. Kriti is highly professional and well studied. I love the proper relaxation and guided meditation at the end of the class. I also had a proper massage from one of the therapists today and felt so good afterwards I decide to write this review. Thank you so much guys! I feel like I'm floating :)"
        }, 
        {
            "index": 343, 
            "rating": "5", 
            "review": "One of the best trekkers massages.. After 16 days of trekking all you want is a damn good massage and Mandala Studio is the only way to go. Great location, great staff, awesome massage, and amazing ambiance."
        }, 
        {
            "index": 344, 
            "rating": "5", 
            "review": "200 Hours Yoga Teacher's Training. I really wanted to study Yoga and i found this fabulous place that provides Certification to become a Yoga Teacher, but my tourist visa was about to expire and i only had a few days left. I was sad because i found this place at the last minute and thought it would be impossible to attain a Student Visa but i wanted to do this course so badly that i decided to walk in and give it a try since they help you through the Visa process. Well, Birendra from Mandala Yoga & Spa pulled a miracle because my student visa was granted within less than a week. It took just a few days and here i am studying and practicing Yoga and Massage Therapy. They're so nice and courteous."
        }, 
        {
            "index": 345, 
            "rating": "5", 
            "review": "Best massage I've received & great yoga classes. I stayed in a hotel right next door and came to this studio every day while staying in Kathmandu. I started my day with morning yoga classes and came back for 2 massages. Staff at the reception was extremely kind and friendly. I really enjoyed my yoga classes and my meditation class (first time, so not sure how good this is). I had Jane and Kriti as my yoga instructors and would highly recommend taking their classes (Beginner Yoga, Vinyasa Flow, Hatha Yoga). They make sure that you get your basic poses right. My highlight was my trekkers' massages here by a petite woman masseuse whose name started with S. (I'm sorry!!). If you can track her down, I'd REALLY recommend her. I've received massages from the U.S., Korea, China, Thailand, Poland and I must say this was probably the best I've had. This studio is located conveniently in a charming courtyard near some of the best cafes and restaurants in town like Himalayan Java Cafe, New Orleans Cafe and OR2K. I highly recommend this studio."
        }, 
        {
            "index": 346, 
            "rating": "5", 
            "review": "Great yoga & massage studio right in the heart of Kathmandu. I visited Mandala Yoga & Spa studio after finishing doing a trek in the Himalayas. We were staying in Kathmandu Resort Hotel just around the corner which is also a lovely place. I did yoga here on Thursday afternoon with Jane and had an amazing massage afterwards, after trekking for 12 days this was well deserved. I liked the place so much I booked in for another yoga session on Friday morning with Kriti and she is a great teacher, well able to read your abilities and alter the class to suit you while also giving various options to more intense poses. I will definitely go back there the next time I'm in Kathmandu."
        }, 
        {
            "index": 347, 
            "rating": "5", 
            "review": "Fantastic place with wonderful owners and staff. I had 3 reiki sessions at Mandala spa and would recommend to everyone. It was my first time having reiki treatments and it did me really good. The owners and staff are friendly and professional. Really nice people. I wish my stay in Kathmandu was longer because I would have booked more treatments. I will definitely come back next time I'm in Kathmandu, and I wish the much success."
        }, 
        {
            "index": 348, 
            "rating": "5", 
            "review": "Fantastic Yoga Studio and Spa in Central Thamel, Kathmandu . I found Mandala Studio and Spa on TripAdvisor after searching for yoga and massage instruction in Thamel, Kathmandu. I took an average from numerous reviews and decided to book ten days of (unlimited) yoga classes and 20 hours of Shiatsu massage instruction. I was a complete beginner in both areas. The cost was very reasonable (under £200 for both ) and I have thoroughly enjoyed the experience. The staff are friendly, professional and welcoming. During my instruction I have made friends of all ages and from all corners of the world. It is a clean, social and peaceful environment and the tuition (in English), is precise and easy to follow. Allowance is made for all levels of ability. I can thoroughly recommend the beauty treatments, massage sessions and healing sessions offered and experienced a Singing Bowl Healing Session for the first time....truly a relaxing experience and one not to be missed! As a lone female in Kathmandu, I felt safe and secure at all times. Generally, a professional, well-run studio and spa to be thoroughly recommended. I will certainly be returning. "
        }, 
        {
            "index": 349, 
            "rating": "5", 
            "review": "Absolute heaven for the body!. I had a 90min massage and it gradually became one of the most magnificent experiences I have had. Definitely the best massage I have ever had. Perfect balance of gentle and firm. Don't miss out, it's incredible.The morning yoga classes I did were also superb. Such a beautiful session.This place is wonderful!"
        }, 
        {
            "index": 350, 
            "rating": "5", 
            "review": "Fantastic massage and great yoga. I received 2 massages and went to 2 yoga classes. The first massage was the best I've ever had, and the second one was a different masseuse, who being small and thin was able to stand on my back and use her feet. A truly remarkable massage experience. The yoga teachers are well trained and experienced. English is not their first language, but they stop what they are doing and show what they want you to do. I've taken yoga classes in several countries, and each has its own style, as does Nepal. At first it may seem different, but it is easy to get used to. Try it."
        }, 
        {
            "index": 351, 
            "rating": "5", 
            "review": "Great yoga experience. Had a few days in Kathmandu, and dropped in for a yoga-class. I had a really good teacher, who was really good at advising. Overall, very recommendable."
        }, 
        {
            "index": 352, 
            "rating": "5", 
            "review": "Amazing Healing Experience. I attended a 90 min Hathaway Yoga class and a 45 min Sound Healing session. The Yoga teacher gave excellent cues and addressed the entire body/mind/spirit. During the ending meditation I had zero thoughts I was so well prepared after the postures. The Singing Bowl session exceeded my expectations. The teacher was authentic, soulFULL, and proficient at his craft. I highly recommend this studio. Received free hot green tea afterward by request. Western Toilet. I would return here again and again."
        }, 
        {
            "index": 353, 
            "rating": "1", 
            "review": "Unprofessional and disappointing. Worst yoga class I have ever taken. Teacher turned up 20mins late with no apology. The company didn't have any change for rs.1000 (class cost rs.700). I was the only person there and the teacher didn't adapt to my capable ability. The whole class was spent stretching. No flows or actual yoga. Another person turned up late because times on the website were wrong. Lots of time spent laying in different positions and teacher kept leaving the studio while we were left doing nothing. Class finished on time even though it was late starting and teacher left the building before we had even put mats away. Both the other girl and I explained our awful experience to the receptionist who accepted the other girl only pay half (rs.350) but he still didn't have change for me. I explained I would have a coffee downstairs and give him an opportunity to get the refunded money he had agreed to. He did come down to where I was having a coffee but not to give me agreed change but demanded I go back up to the studio where he had called back the yoga teacher. By this point I wanted nothing more to do with the studio and didn't return- loosing my money.Very unprofessional and disappointing!"
        }, 
        {
            "index": 354, 
            "rating": "5", 
            "review": "Best meditation and yoga in Kathmandu. My first time doing meditation. Was excellent. The yoga class was the best I had experienced in Kathmandu. Got a great massage and pedicure too. Affordable and friendly."
        }, 
        {
            "index": 355, 
            "rating": "5", 
            "review": "Great yoga. Perfect for all levels, in a smaller room for a better experience (more adjustments and attention from the instructor) and many mirrors so you can assess your practice yourself. Definitely worth 700 rupees for walk in class!"
        }, 
        {
            "index": 356, 
            "rating": "5", 
            "review": "Above all the rest!. Been to multiple spas in Thamel- this one was very clean, professional with friendly staff who were so welcoming. It's definitely a cut above the rest!The whole establishment was catered so well for tourists and made you feel very comfortable. A must visit for all travellers, especially after trekking! Thank you Mandala Studio!"
        }, 
        {
            "index": 357, 
            "rating": "5", 
            "review": "Yoga class is great. I took a yoga class today. There was only my friend and I in the class. It's like a private class and it's only 7usd for 45 minutes. The teacher is really a professional and he did his yoga study in an university in India. He tried to let us remember a few tips and few movement to do everyday at home. I booked massage as well. To test tomorrow. The special package for yoga class 90minutes+Swedish massage 1hour+pedicure is only 3500 rubis. Service charge is excluded but you can bargain not to pay the service fee."
        }, 
        {
            "index": 358, 
            "rating": "5", 
            "review": "Yoga. Taken a couple yoga classes here and always leave feeling better than when I came. It's a laid back environment that tends to spawn good conversation afterwards. If you enjoy yoga check this place out."
        }, 
        {
            "index": 359, 
            "rating": "5", 
            "review": "A must visit!!. I was lucky enough to stumble upon this little gem with a couple of days left in Kathmandu. I had five services over two days and left feeling like a new woman. The services were wonderful and the friendliness of the owner and staff would keep me coming back if I lived there, or visit again. I think my favorite service would have to be the 90 minutes massage. I met friends after and they commented how relaxed I looked. I want to thank everyone at the Mandala Studio Yoga & Spa for making me feel so 'welcome and wanted' in your beautiful Nepal."
        }, 
        {
            "index": 360, 
            "rating": "5", 
            "review": "INCREDIBLE Reiki Course. I took the first level introduction Reiki course with Kriti and it was one of the most incredible, life-changing experiences; Kriti is a wonderful, kind teacher who told me so much about the philosophy behind yoga and Reiki that I had never known before. I am so grateful to her for sharing her knowledge about yoga and Reiki! I would recommend this course to anyone, even if you know nothing about Reiki; it will really change the way you look at yourself and the world."
        }, 
        {
            "index": 361, 
            "rating": "5", 
            "review": "Mandala studio , the best :). HI ,, I had such a good massage, perfect place to relax and feel better, that why i have to recommend this place for anybody ,even for the first time .Go learn GO get Massage the shiatsu is really great Go get better in any way :)"
        }, 
        {
            "index": 362, 
            "rating": "5", 
            "review": "Great Nepali message and vinyasa flow yoga. Did a yoga class follows immediately by a 90 minute Nepali massage. Th yoga class was small, only four of us, and the teacher was great. She was friendly and kept things moving quickly but still took time to help us when we didn't understand or weren't doing it right, without making us feel bad or awkward. The massage after was one of the best I've had. I asked for medium pressure and wish it would've been a bit harder, but still was amazingly relaxing. Thought it was a bit expensive after being in Thailand and Southeast Asia, but it's prices were pretty competitive for the Thamel area (still way cheaper than in the USA) and definitely worth it."
        }, 
        {
            "index": 363, 
            "rating": "5", 
            "review": "Beauty half-day treatment AWESOME!!!!. Strongly recommended. I did 1h30 nepali massage, then body scrubbing, face treatment and sauna. All the staff is really professional, nice and helpful. Go there for yoga classes or massage or beauty treatment is the right present for yourself :)"
        }, 
        {
            "index": 364, 
            "rating": "5", 
            "review": "Simply Amazing. I went for a yoga session, then a second and finally a third before I decided on taking the their Teacher Training Course. I've tried yoga many times back in the U.S., but I never what I've always hoped for out of it. From the first class, I knew I have found my Yoga Home! The staff is very friendly, the studio is beautiful and the location is central. The Mandala Studio strikes an impossible equation of being that oasis of serenity in the middle of the hustle and bustle of Thamel The main teacher/guru, Kriti, is such an amazing talent. She is able to give individual attention without taking away from other students. She always encouraged me to take on challenges that absolutely shocked me when I was able to achieve them. As for the Spa, the facilities are fantastic including a steamroom and sauna while the masseuses are well versed in the different massaging styles, delightful and professional. As I said, I came for a yoga session and stayed to become a yoga teacher - what a life changing experience!"
        }, 
        {
            "index": 365, 
            "rating": "5", 
            "review": "The one place for your wellness of physical, emotion & mental. I’m a regular in yoga so when I had some free time during my travel in Nepal, the thought of joining a yoga session came impromptu. I approached the guest house owner of where I stayed for some recommendations and he introduced me to Mandala Studio. Mr Biren the owner came personally to the guest house to meet me and later took me to the studio for a visit. The first impression was good. It has a decent three-wall mirrored yoga classroom & spa (massage) rooms. I wasn’t too keen on the latter but I returned the same day afternoon for vinyasa flow yoga. All I can say is I love it! The teacher was great, the classroom was clean, the ambience was fantastic, they practised good hygiene and yoga mat was provided. Guess what?! I returned the next morning for another round of Hatha yoga. I had such pleasant experience with Mandala and it’s worth checking out. Location wise it was great too, at Mandala Street a little away from the noise in Thamel."
        }, 
        {
            "index": 366, 
            "rating": "5", 
            "review": "Renée, RN, BSN, yoga teacher. After trying every yoga studio and many spas in Thamel, I recommend Mandala studio, hands down. The staff is so great that I decided to complete my 200 hour Yoga Teacher Training at Mandala. Not only is it the cheapest World Alliance course I have seen in ANY country ($800 USD), the method of teaching and style is authentic. If you are looking to understand yoga and meditation in a deeper way, more than the \"exercise trend\" it had become, this is the place. A nice bonus is that free massages and treatments come with the yoga packages! Mandala has become like my home and its staff my Nepali family. I will greatly miss all, and thank them for the life lessons and skills to improve my health and build my yoga business!!!"
        }, 
        {
            "index": 367, 
            "rating": "4", 
            "review": "very recommendable. I went to Kathmandu due to work and since I practice Yoga I decided to take at least one class. It was different from the classes in my country but very nice.The traditional nepalí massage was excellent! If you go to Kathmandú, you can't miss it!!!"
        }, 
        {
            "index": 368, 
            "rating": "4", 
            "review": "Enjoy the challenge in a beautiful surrounding!. I am participating in the teachers training here, and it was a lot of fun! Very easy going, and yet challanging. Gives me a wonderful deeper inside into the science and pratice of Yoga. Kriti, our teacher, emphasizes a wholesome few on Yoga, not only as a workout session. One of the things I really enjoy is, that I can go further and deepening my knowledge and capacities in Yoga, and yet have a everyday life - not like a training in an ashram, which might be pretty different. The studio is in beautiful Mandala Street, center of Thamel. It has a nice roof top, small and pretty studio room with mirrors to check your postures and give yourself a smile. They also offer massages, steam and sauna - I'm going to check that out soon ;)Just pop by for a Yoga drop-in class and see yourself!"
        }, 
        {
            "index": 369, 
            "rating": "4", 
            "review": "After the trek treat!. After completing the 2 week Manaslu trek, I was very fortunate to find Mandala Studio Yoga & Spa and schedule the 2 hour hot oil Authentic ayurvedic massage. Even though the spa was hit by the typical rolling brown out right when I arrived, they were prepared to heat the oil with a bunson burner! worked great. Ended with the power back on and nice steam bath.The masseuse was very good paying attention to all the aches and pains. Highly recomment whether after a trek, long plane ride, or just pamper yourself."
        }, 
        {
            "index": 370, 
            "rating": "5", 
            "review": "Yoga & Massages @ Mandala, FANTASTIC. I am very happy to have found a new yoga place in Kathmandu, right in the heart of Thamel. The people are great (teachers, therapists, Birendra at the welcome desk) and the place is lovingly made. Classes every day - a great way to start the day in Kathmandu.thank you for all your wonderful offerings at this beautiful Yoga & Spa place!"
        }, 
        {
            "index": 371, 
            "rating": "5", 
            "review": "Excellent Day spa. Great new place run by lovely people. Nice vibe and knowledge off massage/yoga. Give it a go, you won't be dissapointed."
        }, 
        {
            "index": 372, 
            "rating": "5", 
            "review": "Amazing yoga experience. The staff and yoga teachers at the Mandala studio are very welcoming. Both yoga instructors were excellent and it was obvious that they have a wealth of knowledge. As a yoga teacher myself I wanted a more authentic practice and this is what Mandala offers. There are other yoga studios in the area but none come close to the wonderful teaching and friendly atmosphere I experienced at Mandala. I will always chose to practice there when in Kathmandu."
        }, 
        {
            "index": 373, 
            "rating": "5", 
            "review": "Before and after. I was introduced to Mandala by a friend who had attended the the yoga class here. After long hours of flights from the west I signed up for Trekkers massage for $25 I had a 90 minute deep tissue massage. After the hike I came back to attend the yoga class and enjoyed all aspects of teaching especially the dedicated time to meditation. Thank you for a great yoga class."
        }, 
        {
            "index": 374, 
            "rating": "5", 
            "review": "Amazing after trekking. I went here to have a trekking massasje. It was amazing. Very professional lady that massasje me. It was really needed after trekking, and even if you haven't been trekking they have a lot of other types of massasje that can satisfy your needs. Highly recommended!"
        }, 
        {
            "index": 375, 
            "rating": "5", 
            "review": "Must visit place after long walk in Nepal. . I have been going there and get treatment since a few years ago. This is my 12th visit in Nepal.\nIt is such a place that you want to bring your friends with. Very clean facilities, professional massage, and friendly staffs.\nネパールで歩き疲れた際には必ず立ち寄ります。アーユルヴェーダやヨガの知識のあるスタッフがいるので、体調の相談などにものってくれるとても親切なマッサージ屋さんです。\n今回も3週間の滞在で2回目の利用です。気になる箇所をアレンジして時間でやってくれます。\n旅行仲間に紹介したくなること間違い無いほど清潔で本格的なオイルマッサージ。ただ、外が少々騒がしいのはタメルなので仕方がないです。本当にリラックスできます。ありがとうございました。"
        }, 
        {
            "index": 376, 
            "rating": "5", 
            "review": "Very good massage. Very good massage, went for the Ayog. The pressure was just right and the lady very nice and friendly. Recommended."
        }, 
        {
            "index": 377, 
            "rating": "5", 
            "review": "Dont look further, this is the best one!. I've been to 3 other massages in Nepal and this was definitely the best one!Very professional, a really Nice and kind staff and hygenic.I felt really comfortable here and they took their time for me.In the beginning they give you a glass of water if you want and they start when you are ready.de woman who gave the massage was really professional and it felt so good. And the room was on the same level, Really clean and peacefull. At the end of the massage the women cut the nails of my feet and i get a banana smoothie, all for free what a kind service!Thank you roshan pulami"
        }, 
        {
            "index": 378, 
            "rating": "5", 
            "review": "Very enjoyable. Great 90 min massage. After a month of trekking this was a most enjoyable massage. Very relaxing and experienced masseuse. Recommend. Don't forget to tip :)"
        }, 
        {
            "index": 379, 
            "rating": "5", 
            "review": "Amazing. Just had a 3 hour Ananda Path Spa package and it was amazing. Especially the Shirodhara part where warm oil is dripped on the forehead. I fell asleep a few times as this part was at the end of the treatment. Highly recommended"
        }, 
        {
            "index": 380, 
            "rating": "5", 
            "review": "wonderful massage in a peaceful place. We had one of the best massage ever in our 9 months trip through all south east Asia (and we tried many ones!). We both choose the Swedish massage which was far beyond our expectations. The two masseuses were very kind, attentive to the pressure (we felt they adapt their strength depending on the people) and incredibly talented to provide good sensations. Everything was made for us to relax: they put some delightful music, put the light down, the beds are comfortable... All the conditions were reunited for spend a delicious moment. We recommend this place for everyone!"
        }, 
        {
            "index": 381, 
            "rating": "5", 
            "review": "Fantastic massage. I had a 60-minute massage at Ananda and it was really good. The place is clean, quiet and very professional. The masseuse was great and I could feel the stress just leaving my muscles. I would recommend it to anyone in Kathmandu. Well worth it."
        }, 
        {
            "index": 382, 
            "rating": "5", 
            "review": "Best massage. We did nice massage at ananda.. around 90m because of good reviews on tripadvisor staffs looks well trained , clean and deep cool environment ,free wifi avaiable and nice hot shower..would reccummend highly ."
        }, 
        {
            "index": 383, 
            "rating": "4", 
            "review": "No nonsense Spa. Nice clean comfortable. Professional staff. Value for money. Definitely a must go if u want to unwind after a hectic week."
        }, 
        {
            "index": 384, 
            "rating": "5", 
            "review": "Unwinding in Kathmandu. After flying for more than a day and before heading out for an 18 day trek, massage seemed like a good idea and discovering this spa was golden. An excellent 90 minute massage. Very clean and professional. Highly recommended and looking forward to returning after my trek. The 90 minute deep tissue was an excellent value."
        }, 
        {
            "index": 385, 
            "rating": "5", 
            "review": "Amazing Shiatsu Massage by Mina. I went 4 times to this massage place. It's clean, very nice people, and most of all, one of their masseuse - Mina - is just a magician with her fingers. Shiatsu is one of the best massage I've ever had. A minor thing to improve would be the noise from the street in the back room. But still brilliant place to visit !"
        }, 
        {
            "index": 386, 
            "rating": "5", 
            "review": "Totally recommended. 6 friends were there to have a ayurvedic massage our last day in Katmandu and it was explendid..the hands of the employees are amazing! the hospitality and careful to all of us are the reflection of the nepali people one hour of masage, and in the first 1 minute we forgot where we are, and after the hour we felt relaxed 100%if you have the chance to go , please dont hesitate!!!"
        }, 
        {
            "index": 387, 
            "rating": "5", 
            "review": "Massage. Finally a very good massage in Thamel, Kathmandu .Nepal. If you like a good experience go there! El mejor masaje que he recibido en Nepal!!! Lo recomiendo."
        }, 
        {
            "index": 388, 
            "rating": "5", 
            "review": "Best place to get a massage in Kathmandu!!!. We visited several other massage places in Kathmandu in the Thamel area, but this one was by far the best! The staff was really professional and well trained - they really knew how to do massage, customer service was great (it was the only place we could take a shower after the massage) and the prices are much lower then what other places charge. Thus, totally worth a visit!"
        }, 
        {
            "index": 389, 
            "rating": "5", 
            "review": "Perfect. Had a 60min full body massage here today. Absolutely loved it. Felt comfortable as my boyfriend and I could be in the same room- you can choose whether you want a male or female masseuse. The boss was lovely and sat down with us, recommending massages that would suit us to our needs. Complimentary fresh banana juice at the end to top things off!! Will come back"
        }, 
        {
            "index": 390, 
            "rating": "5", 
            "review": "Great massage. Yesterday i had a great shiatzu massage of 60 minutes. Massage therapist had good sensitive skills. I came out relaxed and reborn. Place is clean, peaceful and serene."
        }, 
        {
            "index": 391, 
            "rating": "5", 
            "review": "Cheap and awesome - good western style spa but hard to find. $20 for a 90 minute massage from a super sweet and seemingly trained masseuse. It's clean with sauna and shower if you like - a little tough to find but its a perfect reprieve for a westerner looking to spend more than $10 in downtown Thamel. Enjoy!"
        }, 
        {
            "index": 392, 
            "rating": "5", 
            "review": "Friendly and accomadating. Very friendly service. Recommended a 90min massage and gave me a good deal! Not fancy, but simple and clean. The massage was what I needed. Comfortable and the masseurs didn't rush. Great facilities too. Had good shower rooms for after massage with hot shower and lockers for my stuff.Finally, even offered a fresh banana juice drink specially made after my visit. Truly impressed with the services! Recommended"
        }, 
        {
            "index": 393, 
            "rating": "5", 
            "review": "Trek recovery. Did a trek yesterday. 18km in 6 hours so my body was in need of some TLC. Ananda was able to provide it. Had a trekking oriented massage, concentrating on the legs. The massage was excellent. The place is clean. And they have showers with hot water! Which can be a real treat in Nepal."
        }, 
        {
            "index": 394, 
            "rating": "4", 
            "review": "Clean, safe, non-sketchy. Clean, good (non-sexy), legit massage place in Thamel. Upstairs from a TINY (un-tripadvisor listed) awesome Szechuan restaurant. Eat there after your massage. The girls at Ananda are really nice, the back massage and 5pm massage are great, but the ayurvedic oil massage was not my favorite, too much oil. Ask for Meena, she's awesome. If you stay at Hotel Family Home, you should get a 20% discount....but just tip it to your masseuse, they're lovely."
        }, 
        {
            "index": 395, 
            "rating": "5", 
            "review": "Very good! . We did full body massage 60 minutes and it was very good!!! They want 2000 ropi but you can bargain for less price. מקום מעולה בקטמנדו לעשות בו מסאג'. הם רצו 2000 רופי לעיסוי של שעה אבל הורדנו ל1000 לאדם לעיסוי של שעה בכל הגוף. ממליצה בחום."
        }, 
        {
            "index": 396, 
            "rating": "4", 
            "review": "Had great 90 minutes Swedish massage . Had great 90 minutes Swedish massage in a clean room with proper massage table and nice background music. They also have lockers for storing valuables."
        }, 
        {
            "index": 397, 
            "rating": "5", 
            "review": "Ms. Took a friend that had never experienced an Ayurvedic massage. We were both blown away. The service impeccable and the massage took us both to a place we didn't want to leave. A beautiful experience. I will be returning in 3 weeks for a repeat. Thank you."
        }, 
        {
            "index": 398, 
            "rating": "5", 
            "review": "Wonderful Swedish massage. Decided to come here after reading all the wonderful reviews on tripadvisor - we were not disappointed. Great value for money, wonderful talented masseuses and very relaxing atmosphere. Not that easy to find - it is the next alleyway down from Ramas Momos, and will be on the left. Definitely worth a visit!!!"
        }, 
        {
            "index": 399, 
            "rating": "5", 
            "review": "Excellent massgage . Very good massage,,I have evere done..Nice staffs,well trained and polite. I will visit next time also."
        }, 
        {
            "index": 400, 
            "rating": "5", 
            "review": "Best massage i have ever had.. I visited today because i had a lot of stress from travelling so much. I took 90 minutes of ayurvedic massage and now i feel great. So relaxing. Everything was super clean and nice and the staff were so accomodating. I'm never going to get a massage anywhere else while i am in Nepal! "
        }, 
        {
            "index": 401, 
            "rating": "5", 
            "review": "I found the best message in ktm!. Clean and nice environment. Very polite staff and well trained. Good value for money. I m sure gonna go back!"
        }, 
        {
            "index": 402, 
            "rating": "5", 
            "review": "\"Ananda\" as already mentioned in the name!. Recommendable after a hard day' work. Situated in a quite alley and with friendly smiling staff. Feeling like reborn again."
        }, 
        {
            "index": 403, 
            "rating": "4", 
            "review": "Great experience . A great massage and the staff made every effort to accommodate all of us to get massages at the Same time, even getting in extra staff. "
        }, 
        {
            "index": 404, 
            "rating": "5", 
            "review": "Best Massage. My husband and I travel a lot through Asia and we love our massages. Ananda would have to be our favourite, which is a pretty big call. As they say you get what you pay for, it couldn't be more true here. Yes, you may pay a bit more here, but try it and you will see just how worth it, it is. We tried others in Thamel and Pokhara and they didn't come close. For us hygiene is important and Ananda has clean linen with each client. The aruyvedic is one of our favourites and it's like they know all your sore spots and work on them. Afterwards we feel totally blissed out and relaxed. The therapists here well trained and extremely professional, we can't praise them enough. Thank you, we'll be back"
        }, 
        {
            "index": 405, 
            "rating": "5", 
            "review": "Not much to say... . Simply perfect Very good whole body massage! Very nice atmosphereI can recommend this place to everyone who wants a time out from the trouble in the city. "
        }, 
        {
            "index": 406, 
            "rating": "4", 
            "review": "😃👍Nice and Good whole body massage. In warm sunny room good massage by Monica and Mena. We enjoyed the atmosphere and the quality of the therapists. Also the sirodhare was very relaxing. Price and quality/service is in balance.We have been there already for 5 times. Thank you."
        }, 
        {
            "index": 407, 
            "rating": "5", 
            "review": "Excellent massages. We visited this spa three times and almost made it back a fourth time on our recent journeys through Nepal, Tibet and Kathmandu. The massages were very good - we each had the same masseuse each time we went. We have had a lot of massages all over the world and I have to say these girls were good. Strong hands and a good attitude, Would recommend it."
        }, 
        {
            "index": 408, 
            "rating": "4", 
            "review": "Chilled and Relaxed. My wife and I attended this after a very busy 3 day wedding ceremony.Both my wife and I enjoyed our visit here and found both staff that treated us very good.I would have given 5 stars but found that the massage tables a little uncomfortable as there was no hole where your face is supposed to go. Other than that the quality, price and cleanliness was faultless."
        }, 
        {
            "index": 409, 
            "rating": "5", 
            "review": "Worth the visit!!. After our trek to the base camp we decided to go to Amanda for a couple of massages … they did not disappoint! I had an Ayurvedic massage and acupuncture which I loved. It was not too hard neither too soft. My husband got a facial, back and shoulder massage which he absolutely loved!The team is great and will not be afraid to go over time. They pretty much added 10 min extra on everything!Highly recommend :)"
        }, 
        {
            "index": 410, 
            "rating": "5", 
            "review": "GREAT!. Absolutely beautiful! I went with my friend after a long 24 hours of traveling from India to Nepal and it was exactly what we needed! Such positive energy filled the spa, the all-natural oils used during the massage smelled so good and left our skin feeling so soft and our massage (Deep tissue) was the perfect balance of relaxing and rough."
        }, 
        {
            "index": 411, 
            "rating": "5", 
            "review": "One of best massage !!. I found recommendation about this place and decided to check it, the place is very nice with very good atmosphere, I took the two hours massage and it was one of the best massage I had, for sure I will come again."
        }, 
        {
            "index": 412, 
            "rating": "5", 
            "review": "A step up from the normal Kathmandu \"spa\" experience... Clean and Professional!. Great experience, Amazing prices and 100 times better than the spa in my hotel!!! Very professional and NO HASSLING for anything that I did not ask for. I had a great 2 hour deep tissue massage for $40 that is unheard of in the states. A little tough to find, but a welcome search rewards the client with a wonderful experience and escape from normal Kathmandu insanity. Would go back again and again and again. I only wish I had found it sooner."
        }, 
        {
            "index": 413, 
            "rating": "5", 
            "review": "Happy Ananda Frequent Flier :). My hotel recommended this spa for a massage my first week in Nepal. In the end I had 4 massages from Ananda including foot, head/shoulders, deep tissue, and \"fusion.\" Although you can find cheaper massages in Kathmandu, I've had my share of poor quality \"budget\" massages around the world from inattentive and unskilled \"therapists\" and felt that this was still a great value for what you get--certainly significantly less than I would pay at home but more enjoyable than most massages I get at home as well! I found the facility to be very inviting and comfortable including a locker for your personal belongings, clean massage rooms, relaxing environment, and incredibly friendly staff. I loved my initial masseuse Mina and booked all subsequent massages with her. I loved Mina's strong confident touch but she also is careful to check in frequently to make sure the pressure is what you want. She is attentive to your comfort and uses a variety of techniques that I found very therapeutic for resetting my body after trekking, long travel, or just because it feels good. :) I would recommend Ananda to anyone looking for a good quality massage in Kathmandu in a comfortable environment. Thanks Mina and Ananda!"
        }, 
        {
            "index": 414, 
            "rating": "5", 
            "review": "Clean and professional. This is a western standard spa, clean with standardized practices. The service providers are friendly and very polite. The atmosphere relaxing. The massage is quite good."
        }, 
        {
            "index": 415, 
            "rating": "5", 
            "review": "The best massage ever!. After few weeks in Nepal I knew about this place and I decided to visit it. I had an Ayurvedic Massage. It was the best massage I have ever had.The place is really nice and clean ando people working there were so polite, nice and wellmannered.I recommend everybody to try it!"
        }, 
        {
            "index": 416, 
            "rating": "4", 
            "review": "Relaxing time. So lovely people, quite and respectful. The massage was great I took time to come back home...due to soft mind and body..."
        }, 
        {
            "index": 417, 
            "rating": "5", 
            "review": "Amazing massage, wonderful staff. My wife and I came by after reading through all the impressive TripAdvisor reviews. We were elated to discover that all the good reviews were more than justified. The staff were friendly and helpful, the rooms and spaces were warm and welcoming, and the massages were exceptional (best massage I've ever had, great review from my wife as well). The prices were a pleasant surprise as well - just $20 for an hour long massage.The only hiccup we experienced came when we tried to locate the place. Turns out it's a bit deeper into the side street than we had expected. After asking a resident for directions we quickly realized our mistake.When you're ready to unwind, we highly recommend you give this place a shot. We know we'll be coming back at least once more before we return home."
        }, 
        {
            "index": 418, 
            "rating": "5", 
            "review": "The Best Place I have ever to relax. I was searching for the best place to do massage in Kathmanu. I went few places before going to this place, I personaly found this is the outstanding place for to get relif from rowdy kathmandu street. This brillant spa is one of the best i have done ever in my life. Highly recommend this place.Quality: OutsatandingPeople: Very FriendlyService: OutstandingLocation: Very Good (comparitavely quiet in thamel)Price: Best Price/ compare with service"
        }, 
        {
            "index": 419, 
            "rating": "5", 
            "review": "The best massages in the world!. I have been to Ananda Spa for a back massage twice now, and both times were absolutely amazing! The second time I took my boyfriend for a massage too and he agreed with me... I have had many massages all around the world, but that was by far the best massage I have ever had!!!! I highly recommend the back massage here, you will not be disappointed!"
        }, 
        {
            "index": 420, 
            "rating": "5", 
            "review": "By far the best spa in Thamel, Kathmandu. Ananda Spa is a brilliant place, if you want some peace and relaxation after trekking, or just shopping, this is an oasis of calm and serenity in the middle of the noise and bustle of Thamel. The quality of the accommodation is first class without unnecessary fuss and the range of treatments is wide and varied. Massage is really enjoyable, relaxing both body and mind and all this within a very competitive price range. Everyone at Ananda is friendly and extremely attentive making your time there, however short, enjoyable and rejuvenating. Make time in your schedule in Kathmandu to visit Ananda, it is well worth the effort and will only be the first of the many visits you are likely to make to this little jewel of a spa. Chris"
        }, 
        {
            "index": 421, 
            "rating": "5", 
            "review": "Best Thai massage ever!. I get Thai massages often and the massage here was by far the best. Even better than in Thailand. Some of the yoga stretches applied I have never had done before. I feel amazing.Will definitely come back again."
        }, 
        {
            "index": 422, 
            "rating": "5", 
            "review": "Fantastic spa. Visited Ananda on my final day in Nepal and had a pedicure and a natural signature massage. Both were excellent and great value for money. I asked for hard pressure and that is exactly what I got and felt so invigorated afterwards. Will definitely return on my next visit to Nepal later in the year."
        }, 
        {
            "index": 423, 
            "rating": "5", 
            "review": "Good ayurvedic massage experience. Ananda natural therapy gave me a good experience of ayurvedic massage. Chill, relaxing atmosphere, good service. You feel taken care of after a visit! Worth the money!"
        }, 
        {
            "index": 424, 
            "rating": "5", 
            "review": "Great, healing bodywork. After 2 days of trekking, we stopped in for the Trekker's Massage and felt amazing afterwards. The staff were very friendly and professional, and we even went back the following day for another treatment. Highly recommended."
        }, 
        {
            "index": 425, 
            "rating": "5", 
            "review": "REPEAT EXPERIENCE AND COMMENTS. 3/10/15 marked my first visit of 2015, having spent several wonderful days at this spa in 2014. Nothing has changed; still spotlessly clean, with excellent massage therapists providing a relaxing and calming experience.I am saddened to read a \"poor\" experience noted by: Noesf, San Francisco, Ca. USAA native ofCalifornia myself, his comments lead me to mention, that I feel it is most necessary for all English speaking travelers to make an extra effort to communicate, as most service employees of ThirdWorld Countries do not speak our language! Maybe he and his companion were just having a \"Bad Day\" In addition i would like to note that most of of Ananda's employees are young Nepali women who have been rescued from very poor villages living in dire circumstances.BRAVO to the owners of this spa who seek to improve the lives of WOMEN in NEPAL!"
        }, 
        {
            "index": 426, 
            "rating": "5", 
            "review": "serene and perfect hideaway from otherwise chaotic city center.. I found this hidden gem while looking from a place to unwind myself after a long journey. And yes it was best.Tastefully decorated, helpful staff and music. Where else in thamel you can get a massage while sun is shinning on your back.Warm feet soak and gentle strokes.Yes a place to visit!"
        }, 
        {
            "index": 427, 
            "rating": "5", 
            "review": "Hidden gem in the heart of thamel. I went there with my two of friends on cold and wet sunday in fabruary after back from our tibet tour. The treatment is as authentic as it can gat. We came out feeling very relaxed and super fresh. The masseurs were very friendly and we were made to feel at home straight away and we were forget where we went for the three hours we were in the treatment room."
        }, 
        {
            "index": 428, 
            "rating": "5", 
            "review": "Best massage in thamel. Enjoyed very much with the service I had from this place. It's really clean for nepal standard and staff are very friendly and welcoming. I like it when they offer tea green tea after. Will recommend this place."
        }, 
        {
            "index": 429, 
            "rating": "5", 
            "review": "Well-run spa... the place to go for massages in the heart of Thamel. Let me start by saying that Thamel is literally packed with places that purport to be \"massage centers\" and \"spas\". And many of those places will list prices that are incredibly low and look extremely tempting. When my girlfriend and I settled into our 2 weeks in Thamel, we walked around and visited a lot of those places that looked so attractive online. The truth is that many of those are operations with questionable sanitary practices, run by people who are much more business-person (cut costs to the bare bones, etc) than actually therapy-focused.It was with that background that we felt so lucky when the proprietor of our place (Cafe Mitra... it's a gem!) told us about Ananda. Upon walking in, you can feel that this place is different. All the little touches that really shape the experience (lockers, music, tea, cleanliness, etc) set the stage for what is a really solid massage experience. They offer all different types of massage (Ayurvedic, Swedish, Thai, Shirodhara, etc) and really put an emphasis on meeting their clients where they are. The different masseurs certainly offer different levels of firmness, but all of them are attentive, friendly, and well-trained. (Sidenote: Gita comes highly recommended by both of us for a firm massage)The prices are a bit higher than you'll see online for other fly-by-night companies, but I urge you to think about the reason you're getting a massage in the first place. To relax and take care of your health. This place will help you do that."
        }, 
        {
            "index": 430, 
            "rating": "2", 
            "review": "So so. Mixed bag. My massage was \"passable\" but too light and the therapist seemed like she didn't have too much experience.My friend really didn't like his at all and left early.Positives: + Place is clean+ Centrally located+ Quiet + HeatedBut...- Expensive (about as expensive as it gets in Kathmandu)- Therapist quality at the lower end (from two data points at least)"
        }, 
        {
            "index": 431, 
            "rating": "5", 
            "review": "best massage i ever had in thamel. I got recommodation from my hotel this place and i didnot disappoint at all.Its a best massage and even my pain was gone away after i had message from this place.I strongly recommended and i will go there again for sure."
        }, 
        {
            "index": 432, 
            "rating": "5", 
            "review": "\"Relaxing <assage\". I visited this place few times and had a message here. It was a great message with just the right amount of pressure.The facility is very clean and the staff are nice and friendly.Will go there again and difinitely recommend Ananda."
        }, 
        {
            "index": 433, 
            "rating": "5", 
            "review": "may be the best massage and spa in thamel.. This spa was just truly awesome.Visted this place few times for treatment with massage,All the treatment were done very professional.Ananda spa is super clean and staff extraordinarily well trained and polite.Enjoyed very much and surely will go again. Try it once."
        }, 
        {
            "index": 434, 
            "rating": "4", 
            "review": "Good. My partner and I had each an Ayurvedic massage and a Shirodhara treatment there. They were both very nice and professional. The premises are spacey and very clean also, but what makes it a lovely experience is the staff, both professional and very friendly and nice. 4 stars"
        }, 
        {
            "index": 435, 
            "rating": "5", 
            "review": "Awesome massage!!. We had a great ayrevedic massage and natural facial. A 2 1/2 service $41.00 usd. Roshan and his wife Mina were great! I am a massage therapist. Best massage I have had in a long time!!"
        }, 
        {
            "index": 436, 
            "rating": "5", 
            "review": "An absolute must do!. I've been to the Ananda Natural Therapy and Spa twice now, the first time was a couple of days ago I had an Ayurvedic Massage, today I had a body scrub, fantastic, these girls are brilliant at what they do. IfmI'm ever back in Katmandu I will most definitely be coming back for more of the same!what ever you do dont leave Nepal without popping in and giving yourself a real treat.There is a great selection of treatments to choose from, something for everyonemI'm sure!"
        }, 
        {
            "index": 437, 
            "rating": "5", 
            "review": "Exquisitely beautiful experience. The 90 minute ayurvedic massage should be in your bucket list before you leave this life. Or the next. We had the lovely experience of a steam sauna, followed by the massage at the skilled hands of two masseuses. Although tiny in stature they have fingers of steel, and a thorough musculo skeletal knowledge. At only $25 US, it's an experience not to be missed. Before we leave Kathmandu we'll be going back for a hot stone massage and a few other treats. Highly recommended."
        }, 
        {
            "index": 438, 
            "rating": "5", 
            "review": "The Greatest spa in Thamel. It was great experience here at Ananda Spa.The staff are really kind and the man who treated me had worked as professional therapist for 14 years.The accommodations are inappropriately good for Thamel's conditions.It was really lucky to have such a great massage for just 2000rs"
        }, 
        {
            "index": 439, 
            "rating": "5", 
            "review": "visit to spa april 25, 2014. As a frequent traveler, I can attest that my total experience at Ananda was one on a par with many of the better spas located throughout the world. The entire staff at the spa is trained in a variety of personal care treatments (see website). My afternoon here gave me a feeling of PURE HEAVEN!! The hour Swedish massage was beyond excellent and the 45 minute facial that followed was equally as good. Whether one has just deplaned in Nepal, returned from a trek or in need of pampering and relaxation this is THE SPA in Kathmandu Valley, with easy access in Thamel. (alley next to Vajra Books) If you do not try this spa you are missing a wonderful experience.Christine C."
        }, 
        {
            "index": 440, 
            "rating": "5", 
            "review": "Great place for yoga and massage. This spa is relaxing the second you walk in the door. They are friendly and accommodating. The facilities are clean and comfortable, and they even have a sauna and nice showers. I have taken yoga classes and had a massage, and will come back. It feels like a hidden gem of quiet and calm in the middle of all the Thamel craziness."
        }, 
        {
            "index": 441, 
            "rating": "5", 
            "review": "A relaxing moment in busy Thamel, Kathmandu. I really enjoyed my massage at Ananda Spa. The staff is lovely and friendly. The facilities are very nice and clean. And the massage therapist was fantastic! A perfect place for a relaxing moment!"
        }, 
        {
            "index": 442, 
            "rating": "5", 
            "review": "great facility for yoga and relaxation in Kathmandu!!!. I have attended yoga at Ananda spa and natural therapy center since oct 2013. Highly trained, professional instructors & staff will greet you with a smile and a hot tea in their beautiful, new spa. Prices for a private, personalized yoga program are the same as a group class elsewhere in thamel. After trekking in Annapurna and Everest regions, I got a pkg for sauna, body scrub and massage which was amazing and exactly what I needed after weeks of trekking in the cold! This beautiful, new and clean facility stands out from the rest in Kathmandu!"
        }
    ]
}