{
    "category": "Kathmandu", 
    "entity": "Dakshinkali-Temple", 
    "avg_rating_stars": 4.2727272727272725, 
    "review_count": 110, 
    "rating_stats": {
        "poor": 3, 
        "average": 14, 
        "terrible": 2, 
        "very_good": 35, 
        "excellent": 56
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "Beautiful Temple. I went here to seek blessings from Goddess Kali with my wife. Huge crowd was there when we reached. what puts me off is animal sacrifice to please the goddess."
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "Beautiful Goddess. We went to get the blessings of Mata Dakshin Kali. We took around 1 hour to reach from Kathmandu on our bike. The drive was good. The only thing which I did not like about the place was that people were carrying animals(goats) and hen to sacrifice them."
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "Must See Whatever Your Views on Animal Sacrifice is. We went on a Saturday with the local bus. The trip itself was equally fun. The atmosphere is incredible the ritual is amazing to see its special and private to them so be careful when filming and taking photos not to disturb people. It's one of the best experiences we had in Nepal"
        }, 
        {
            "index": 4, 
            "rating": "4", 
            "review": "goddess dakshinkali. Dakshinkali temple is situated 20km west of kathmandu , Nepal. the temple is famous for goddess kali and will mostly be visited by hindu devotees during the festival like dashain."
        }, 
        {
            "index": 5, 
            "rating": "5", 
            "review": "Most sacred and holy temple of goddess Kali, Dakshinkali. Great pilgrimage site at southern Kathmandu. Take a local bus from Oldbuspark near ratnapark to reserve seat. Temples, trees and small river stream, it was nice expereince. Crowded and large pilgrims visit during Saturdays and Dashain.. More open and peaceful during other days."
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "durga tempal. dakshinkali tempal is one of famush durga temple and this tempal is little far fram kathmandu and central of jungal"
        }, 
        {
            "index": 7, 
            "rating": "5", 
            "review": "Religious Place. Goddess in this temple is known as \"Kali\" which is the Avatar of Goddess \"Parbati\" Wife of Lord Shiva, This place Is soo good to visit for the national and international tourist. In the pick of the upper Hill there is also one goddess who is the mother of Dakshinkali"
        }, 
        {
            "index": 8, 
            "rating": "4", 
            "review": "down to the green mountain. This kali temple is away from Kathmandu, the road to their is too bad but while you are there it is really nice place where the temple is down to the hill and in between of the river."
        }, 
        {
            "index": 9, 
            "rating": "5", 
            "review": "Powerful deity. Like the eastern states of Bengal and Assam the dakshina Kali temple was also awe inspiring. There was a lovely Dakshina kali sthuthi that I decided to memorize."
        }, 
        {
            "index": 10, 
            "rating": "5", 
            "review": "Jai Maa Kali. Recommended for Kali Bhakt's. Must visit if time is not much of a factor as it is located pretty far from the city."
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "Local's Only Treat. This was a beautiful temple and you got to really see the local customs and traditions here at the temple. If you come by on Tuesday or Saturday that is when the ceremonies are held and hundreds of people from Kathmandu valley make the trip here to worship and it's quite the sight! I highly recommend this trip if you want to take a short day trip outside of Kathmandu away from the traffic and dust and enjoy the nature and spirituality Nepal has to offer. I also suggest you book a private guide, because its super hard to get to by yourself. My hostel recommended the company Himkala Adventure and the guide was great!"
        }, 
        {
            "index": 12, 
            "rating": "4", 
            "review": "Jai Kali. Quite famous in local people. Its little far from the central kathmandu. It takes around 1 and half hour to reach here by taxi or any other transportation. Very Nice temple and it was not too much crowded people visit here to wish and pray for their personal things. You should come if you got free time in kathmandu.. Enjoy"
        }, 
        {
            "index": 13, 
            "rating": "5", 
            "review": "Goddess Kali. The place is very beautiful. The temple of goddess Kali whom we people go to worship is very beautiful. It is 20 kms drive from Kathmandu. There was a huge queue. So we took around 3 hours to see the goddess. Outside the temple there is a small market."
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "Beautiful temple.. The temple is very beautiful. There is goddess Kali whom we people go to worship. It is 22 kms drive from Kathmandu. So we took around 1 hour to reach on our own bike. We went on Saturday as it's a holiday so there was a huge queue. So we took around 4 hours to see the goddess. Cleanliness is a concern. Good luck!"
        }, 
        {
            "index": 15, 
            "rating": "4", 
            "review": "A pilgrimage. I went their on pilgrimage. A very nice temple with Godess Kali idol. Not so much of people in que. I got the darshan very easily."
        }, 
        {
            "index": 16, 
            "rating": "4", 
            "review": "holi place and quite spiritual. Dakshinkali temple is almost 1 and and 15 minutes from my hotel Tibet guest House by taxi. actaully i visited the temple on 14th june and the place is nearby pharping outside the valley. and you can reach the temple by taking local buses also. the temple premises is soo attractive from tourists point of view and from nepal also so many peoples comes to visit and worship the kali ma."
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "Famous Lady Gad. After 1 and half hour drive from central kathmandu, we will visit Dakshinkali Temple. It is very famous for Nepali people."
        }, 
        {
            "index": 18, 
            "rating": "4", 
            "review": "A trip to the traditions of Nepal. It is a place that probably will not visit on my first trip to Nepal, especially if I do not have enough time to leave me no other jewelry. But I was delighted to go, not once, but more times in subsequent trips I have made to Nepal."
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "Incredible but not for the faint of heart. One of my favourite temples I visited in my four months in Nepal. Its a bit grizzly but really cool to witness. Make sure you go early in the morning on a Saturday."
        }, 
        {
            "index": 20, 
            "rating": "5", 
            "review": "place to visit. You can reach there by local bus but a bit difficult but I suggest to do because it makes good local experience"
        }, 
        {
            "index": 21, 
            "rating": "3", 
            "review": "Gross but real. You want a real view of Kolkata? This is the place to go. Poverty, hunger, homelessness, and sacrificial blood? It's all here."
        }, 
        {
            "index": 22, 
            "rating": "5", 
            "review": "southern kali temple. located in few km south of Kathmandu and on the bank of two rivers, this temple is best place to visit especially those who are shakta. can even see animal sacrifices."
        }, 
        {
            "index": 23, 
            "rating": "3", 
            "review": "Somewhere different. I was fortunate to visit at a time when tourists and people generally were scarce due to power and fuel issues. It was a little confronting that animal sacrifices were occurring however that is the local culture. It was definitely an eye opener as to how the rituals occur"
        }, 
        {
            "index": 24, 
            "rating": "5", 
            "review": "Blessings you will get Here!!!. Its Temple of Kali Maa and I Have Visited Two times So far With My Friends on Bike to Receive Blessings from Goddess Dakshinkali!! It Was Really great Visit and Have Great time with Friends ."
        }, 
        {
            "index": 25, 
            "rating": "4", 
            "review": "holy place. This temple lies south western corner out of kathmandu valley . It's 22 kms far from kalimati chock.is one of the main temples of Nepal dedicated to the goddess Kali. Animal sacrifices, particularly of cockerels and uncastrated male goats, are the main way that the goddess is worshipped, and this is especially seen during the Dashain festival."
        }, 
        {
            "index": 26, 
            "rating": "3", 
            "review": "not for the squeamish. When I arrived in Kathmandu in the mid-70's Tour Offices near Durbar Square proudly touted the 'thrilling animal sacrifices' that could be seen on Saturdays and Tuesdays at Dakshinkali Temple. Not being interested in seeing innocent creatures put to a cruel death, I never availed myself of the opportunity. Many years later, however, when I was working for a study abroad program here, the orientation weekend was held at the Dakshinkali Resort, located just next door to the temple complex. I have no idea why that particular place was chosen, as it was a decision of my superiors, and it is a lovely and authentic place, quite rustic. It is just the location that is unfortunate. There was no avoiding it, however, so the first morning at dawn, I and about 15 students trooped down the hill to the shrine itself. A ghastly sight and piteous sounds awaited us as the temple priest, in reality no more than a ritual butcher, one by one, and without a trace of grace or sympathy, dispatched the goats, ducks and chickens that were brought to him. The atmosphere, the 'vibe' if you will, was terribly dark and gloomy, as though the pain and suffering of a millennia's worth of sacrificial animals had collected in the narrow valley by the river. Buddhists call this 'killing through ignorance' and consider it no less a non-virtue than any other kind of killing. Not a place to visit unless one is contemplating the suffering of samsara."
        }, 
        {
            "index": 27, 
            "rating": "5", 
            "review": "There are three holy temples in Kathmandu.. There are three holy temples in Kathmandu. One is Swayambhunath Temple and second one is Pashupatinath Temple and third one is this one, Dakshinkali Temple. This is the temple for godness Kali, so if you're going with your family, they might see very uncomfortable scenes, sacrificing lamb and goats. And more over, it's quite hard to go from Thamel area. But, if you want to understand these peoples, this is the one of the place must to visit."
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "Absolutely Blissful !!!. I went to this pleasant temple on 25.08.15 and it took 1.5hours to reach this temple on the mountain, on the way we come across many lovely gompas and monasteries.We can visit 2 temples here , after reaching Shree Dakshinkali temple and doing all formalities , if we climb around 500 steps we reach Kali Maa temple which is a wonderful temple with fabulous views.If we sit in silence in this temple we will be absolutely peaceful and relaxed.Thanks a lot for everything...Loving you so much...Peacefully yours.S M Bega Raaj.Happy travelling ..."
        }, 
        {
            "index": 29, 
            "rating": "4", 
            "review": "Great Hindu Temple escape from Kathmandu's Polluted Air. This is great for serious Hindus, not for the casual tourist. It is an hour's drive outside of the horrible air pollution of Kathmandu. Nice forest setting. Many blood animal sacrifices are offered each Tuesday and Saturday. Only Hindus are welcome in the main temples. Also visit Jal Binayak Temple on the way."
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Simple Temple. It is a simple temple, no fuss, you can just do your own offering to the goddess. Beautiful to climb the hill."
        }, 
        {
            "index": 31, 
            "rating": "4", 
            "review": "The temple located in the south preserves the entire city with bad evils. A river flows in the middle of the temple. Dakshinkali Temple is one of the oldest Temple in the City. Actually the Temple is out of Kathmandu Valley however it is apart of the city. The name it self introduce the Temple. Dakshin meaning South and Kali meaning Goddess Kali (an aggressive incarnate of Goddess) so it is believe that Goddesskali who is located in the south of the Valley is preserving with the bad evils. The place is so peaceful and natural as it is out of the valley. you really enjoy the site if you are a nature lover. A river flows in the middle of the temple that really enhance the superiority."
        }, 
        {
            "index": 32, 
            "rating": "4", 
            "review": "Holy site and also a chance to cycle in nature's lap. It is one of the most holy sites in Kathmandu, but added advantage is you can cycle to the temple and many people do, just be careful of the potholes and rash drivers. The view while you climb is simply amazing and you will not regret taking a bike. Since the hill is steep you can also get a good amount of exercise. There are also many other temples on the way so you can ask the locals there they will guide you. Main attraction of the place apart from the temple is Khuwa(Khoa, you can wiki it, it's like a cheese made by reducing milk by over boiling, that's the best that comes to my mind right now) but you get good Khuwa here so check with the locals and taste before you buy."
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "Dakshin Kali. This is a Holy Place for Hindus and I do not think it is appropriate for western tourists to go there and gawk at people during their religious devotions. That being said, it is a high energy place and very 'tantric feeling'. They have blood sacrifices there and it is not for the squeamish!"
        }, 
        {
            "index": 34, 
            "rating": "5", 
            "review": "bikers gonna love the route.. a beautiful historical temple surrounded with hills and based on the lap of small river. visit it to enjoy."
        }, 
        {
            "index": 35, 
            "rating": "5", 
            "review": "Immensely satisfying experience!. A very nice and beautiful place.... Quite far from Kathmandu, and quite a walk to reach the temple. But the satisfaction you get from worshiping and praying to the Goddess makes up for the tiring walk! On the whole, a peaceful n satisfying experience!"
        }, 
        {
            "index": 36, 
            "rating": "4", 
            "review": "A place to see the sacrifice of animals. This place was interesting where one could see the sacrifice of goats, hen, and even pigeons on most of the days and mostly on Saturdays."
        }, 
        {
            "index": 37, 
            "rating": "5", 
            "review": "Viewing the sacrifice of animals. The famous Hindu temple where the large number of animal sacrifice is made to please goddess Dakshinkali. The scene of sacrificing animals may disturb the feelings of some viewers."
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "where my heart is. Dakshinkali Temple20km (12mi) from Kathmandu, Kathmandu, Nepal is the temple with the facts and the legandary in it.people have so much of faith and belief in this god,which it shows that we religious harmony and liberal country ."
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "the best devi templ. its little drive from Kathmandu its great hindu temple with bank of river and green jungle i like to visit again...."
        }, 
        {
            "index": 40, 
            "rating": "4", 
            "review": "Temple of Goddess Kali. Dakshinkali is a leading Hindu Temple of Nepal.The temple is at a village Pharping which is also known for Picnic and Tracking. Though distance is 20 km away from city but it will take time due to bad roads"
        }, 
        {
            "index": 41, 
            "rating": "4", 
            "review": "Kali temple . This is the one kali temple is kalanki area which is 20 km away from kathmandu. Though distance is 20 km away from city but it will take time due to bad roads. On the way you can see a big pound. Saturday is most crowded as this is the day for kali Maa in Hindu religion. Lots of animal sacrifice you can see here. .overall good to visit."
        }, 
        {
            "index": 42, 
            "rating": "4", 
            "review": "Temple of Goddess Kali. Dakshinkali is a leading Hindu Temple of Nepal.The temple is at a village Pharping which is also known for Picnic and Trecking. Here in temple, Ritual sacrificer are made on Tuesday and Saturday to get blessing from Goddess. A nice visit."
        }, 
        {
            "index": 43, 
            "rating": "5", 
            "review": "Nepali gods. Nepali people pray many gods and all gods have own there believe and thoughts . Dakshinkali is 25 km far from kathmandu down town and most nepali goes there pray early in the morning and they sacrifice male goat and chicken etc so this temple is really different then other temple 11"
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "Must see no matter what your views on sacrifice are. Dakšinkali temple is dedicated to the Hindu goddess Kali. The temple is located about 20 kilometers from Kathmandu-Nepal. We took public transport there which I would advise if you want to experience the real life trip there. It was saturday morning which was one of their main days to go there. As much as I am against animal sacrifice if you want to see their culture and religion it is a beautiful experience to have. There you will see lines of people waiting with their sacrifice and offerings, pigeons eating the rice soaked in blood, chanting and people in trance shouting and crying, loads praying and playing different instruments. No matter what your views on animal sacrifice are seeing this old tradition and one of the most sacred sites is a must. Do hang around and observe the people. Be prepared to be one of the few tourists and get some inquisitive looks as you pry into their ritual."
        }, 
        {
            "index": 45, 
            "rating": "4", 
            "review": "Beautiful hideaway from city. Dakshinkali is just 20KM from Kathmandu (Kalanki). Although the distance is pretty short but the journey can be tiring due to bad and narrow road. During the trip you will pass a beautiful pond - Taudaha where you will find many fishes (weighing more than 5KG each). Dakshinkali is really beautiful and it is considered one of the sacred shrine for Hindu. Saturday is usually very crowded."
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "Country side. Hours long drive, fantastic country side. temple situated the gorges of the hills and long que on saturday because of the more visitors from kathamndu valley. better to side trip if you have one full rest day."
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "An Exciting Dakshinkali Temple. Dakšinkali temple dedicated to the Hindu goddess Kali and is one of the main temples of Nepal. The temple is located in 22 kilometers from the capital city Kathmandu-Nepal, near the village of Parping. Twice a week, there are sacrifices to the goddess. Also in Dakšinkali, in October of each year, the Festival of Dasain, accompanied by sacrifices. Temple of goddess šestirukoj statue with protruding outward and red eyes. From Kathmandu to go no more than 45 minutes by taxi. Along the way you can stop and enjoy the unique natural beauty of Nepal."
        }, 
        {
            "index": 48, 
            "rating": "4", 
            "review": "a bit creepy. it is one of those places one should see - it is a bit creepy though seeing all the animals waiting to be sacrificed and the blood around - but walking down towards the temple it has a lovely market atmosphere with many stalls selling offering to be bought. the drive from Kathmandu to dakshinkali is also very nice"
        }, 
        {
            "index": 49, 
            "rating": "2", 
            "review": "Not worth the trip. We went on a Saturday, we did not see a sacrifice, just loads of people selling anything you can imagine. If you have to visit a hindi temple, visit Ichangu Narayan"
        }, 
        {
            "index": 50, 
            "rating": "3", 
            "review": "Visit to Dakshinkali Temple. They say you must visit this temple. But it seems just OK stuff. I did not find it to be a great place"
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "littel far from city but worth visit. 45 min from the city, lies in the middle of hte forest,, big temple fot hindu people,, always crowded,, best to have a look,,"
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "Worship jaya mata Kali . I want to be there 2 years before but this year I got a chance it's really nice and wishful temple for Hindu jaya mata dashinkali"
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "A place to worship Kali. This is a Hindu site of worship and if you go on Tuesdays or Saturdays you will be witness to animal sacrifices offered to Kali. Don't baulk yet...people offer a chicken or a goat but then they take it home for dinner or barbecue it on the grounds. We buy meat in plastic trays in the supermarket but someone killed the chicken you ate last night..."
        }, 
        {
            "index": 54, 
            "rating": "5", 
            "review": "A holy and sacred place.. It is a holy and sacred place for hindus. their is the temple of lord kali maa. you can go there. its also a important place for hindus."
        }, 
        {
            "index": 55, 
            "rating": "5", 
            "review": "Bloody Saturday. This animal sacrifice temple might not be your cup of tea but it is packing with people, goats, chickens ad other animals on Saturday!"
        }, 
        {
            "index": 56, 
            "rating": "3", 
            "review": "Interesting but felt sorry for Animals. We visited Dakshinkali early in the morning, they sacrifice lots of animals there. I felt so sorry for them. This place is slightly far from Kathmandu, you need to hire private car to reach there. It's situated in the bottom of a small hill, middle of the forest. Interesting place to see how typical hindu people are."
        }, 
        {
            "index": 57, 
            "rating": "4", 
            "review": "Blood!. The bloody side of hinduism is played out here with animal sacrifices daily, specially saturdays, so be careful if u have not seen it before. foreigners only allowed outside of the main temple. could be better n nicer organised but gives a glimpse of the nepali way of life!"
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "sundays and tuesdays. terrifyng experience...do not miss do not lookwait on line but move just before your turnfeel the atrmosphere which is threalling!!!!"
        }, 
        {
            "index": 59, 
            "rating": "3", 
            "review": "contradictions... I expected the sacrifices, the blood and the \"atmosphere\". I found the casual, off-hand attitude of many of those offering sacrifices as they handed over an animal, then cleaned it with blood flowing into the river, surprising. It seemed like an empty ritual to many of them. Stuffed teddy bears sold to keep the kids happy was also at odds with the rest. This should make you think."
        }, 
        {
            "index": 60, 
            "rating": "4", 
            "review": "Southen kali. The journey to this village shows you a completely different side to the Kathmandu area. We visited on one of the festival days, so there were huge numbers of people waiting to go into the temple. The temple is restricted, but as we did not want to see the animal sacrifices that wasn't a problem."
        }, 
        {
            "index": 61, 
            "rating": "5", 
            "review": "Place with amazing energy. You can take a cheap bus from Ratna park. There is morning ceremony and then ceremony in afternoon. Between there is a break, but people still waiting in the row with animals or flowers. Beginning of sacrifice ceremony is very atmospheric. Ringing bells and playing music with instruments. I don’t recommend place to the people who don’t like a blood. The blood as well as smell of blood is everywhere around temple. But. This place has amazing energy. Don’t forget that after sacrifices of animals, their owners take them home and eat them. So it is not only meaningless killing animals. I spend hours there just watching people how they sacrificed animals and make ceremonies connected with it. You can also watch how the dead animals are processed. There is one place under the stairs where you can find a people doing it. If you come by bus, after ceremony is finished, be prepared fight with local people about place in the bus back to Kathmandu."
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "Live sacrifices -not for the faint hearted. The live sacrifices here are not for the weak hearted. Buffaloes, goats, hen, are quite commonly sacrificed here. The fleet of steps down the down leading to this temple was occupied with many worshippers the day I visited. The street side market sold fresh farm produce here."
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "nice and peace place. Dakshinkali Temple is very beautiful place where hindu people sacrifices animal .nice place to see lots of temple.............."
        }, 
        {
            "index": 64, 
            "rating": "5", 
            "review": "Super Shaktipith. As a hindu we visited there and it is one of the shaktipith. Full of nature beauty and a proper destination to spend half day."
        }, 
        {
            "index": 65, 
            "rating": "5", 
            "review": "BLOOD FOR BLOOD Vs Eye for an Eye. This DAKSHINKALI TEMPLE visited, is the one outside the city-animal sacrifices are offered once a week."
        }, 
        {
            "index": 66, 
            "rating": "4", 
            "review": "be blessed. the temple is small,but gets lot of devotees,u have to go down and climb up but these r small inconveniences,lots of temporary shops around,small eateries also mind it is not a tourist spot but a temple,if u have time visit,worship get her blessing"
        }, 
        {
            "index": 67, 
            "rating": "4", 
            "review": "Nice temple outside the city. This temple is a bit outside the city but the drive there is worth it, the views of the valley are really nice. The temple is tucked into a wooded area and it was overall a worthwhile trip."
        }, 
        {
            "index": 68, 
            "rating": "4", 
            "review": "Good!!. Its a little far from the Kathmandu city area, I went in the morning, it was cold.. so many people visiting this temple. well my mom and dad were very happy to visit this place I loved it too but it was too cold!!!"
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "nice location. Dakshinkali temple is at Chobhar. Its in great location. Surrounding is great. Actually the great thing about Dakshinkali temple is the way to Dakshinkali temple from Balkhu to Chobar. Its a scenic beauty"
        }, 
        {
            "index": 70, 
            "rating": "3", 
            "review": "Good Temple and decent view. Visited this temple around noon time, its small and good. But the place itself is not so clean and animals are being sacrificed 2 days a week. There is another temple (Maata temple), path clearly marked from inside this temple. You need climb few steps, but its worth going to top to get some decent views. There are lot of shops and eateries outside the main temple."
        }, 
        {
            "index": 71, 
            "rating": "3", 
            "review": "Quirky Awe. We went there on a Tuesday which is the day of sacrifices but went there at about 4pm upon advise from our guide as the crowds would have been gone by then. The temple is located in the mountainous region and is a long drive up and down a couple of mountains. Outside the temple, there are rows of flower shops and shops selling live chickens for sacrifice. We saw a local couple with a kid buy the chicken and it was squeezed and placed in a plastic bag with just its head sticking out (OMG!). Upon entering the temple, the couple placed the chicken with the plastic bag at the altar and went about doing the puja. A good ten minutes later, the chicken in the plastic bag started trying to move and started clucking. The couple immediately alerted a young man who got out his knife, ushered the couple over and cut the chicken's head off. The chicken stopped clucking. The blood - he splashed against the Kali deity and on the couple. We were not too sure of the emotion that we felt right then but it was something along the lines of quirky awe."
        }, 
        {
            "index": 72, 
            "rating": "2", 
            "review": "Nothing interesting for tourist. There is nothing interesting on this place for tourist. Nepali people brings cocks and billy goats to be sacrificed to godess Kali here. The temple itself is of no interest and the sacrifice is mechanical one after one system. People standy a long queue to let their animal to be sacrificed here. If you really don't like to see this, don't go here."
        }, 
        {
            "index": 73, 
            "rating": "4", 
            "review": "A very interesting site to visit. A long bus ride with a fascinating finish...Dakshinkali is a spot not to be missed. If you are squeamish, you might want to skip going on a slaughter day but then there won't be much to see and experience. I kept a respective distance and enjoyed learning about the rituals and traditions that occur there."
        }, 
        {
            "index": 74, 
            "rating": "5", 
            "review": "One of the best place to visit. Dakshinkali is one of the important places of pilgrimage regarding Hindu goddess, which dates back to immemorial. Pilgrims visit this temple to offer their prayers and animal sacrifices to the goddess. Apart from the religious performance this place has also been developed as a popular picnic spot."
        }, 
        {
            "index": 75, 
            "rating": "3", 
            "review": "Dont go on slaughterday. Nice area to hike. On certain days they slaughter animals. Not my cup if tea but u can make the choise."
        }, 
        {
            "index": 76, 
            "rating": "4", 
            "review": "It's a long way to Dakshinkali. This one's a taxi or hotel car and driver and if you have a guide, then good.Ritual sacrifice days (Tuesday and Saturday) will be BUSY and very in your face, but other days are much quieter. You can look more closely at the Temple and the surrounds. Most of the stalls will be closed on non-sacrifice days, so take something to eat and drink.Our guide took us to the Newari Cultural Museum in Kirtipur for lunch, excellent but watch out for the 'rice wine' it packs a punch and be prepared for spicy food. You can ask them to calm it down and the women do.The Museum is run by the women and you can see a small range of daily activities, such as weaving and rice preparation."
        }, 
        {
            "index": 77, 
            "rating": "4", 
            "review": "A Kali Temple behind the hills. A just bit far from the City, A Kali Temple behind the hills in between of two small streams, one the way you can visit Pharping Monestery. we can see many animal sacrifice for the blood to the Kali Temple."
        }, 
        {
            "index": 78, 
            "rating": "1", 
            "review": "Horrible, this is sick. This is terrible, this is sick. People make a ritual killing animals, this is murder and a disrespect for living life. All of this, as well as the people who likes watching this are sadist."
        }, 
        {
            "index": 79, 
            "rating": "4", 
            "review": "A temple with an energy. Go there if you seek blessing of Goddess Kali. Serene surroundings thought not clean. A bit outside the city but nice drive."
        }, 
        {
            "index": 80, 
            "rating": "1", 
            "review": "Most cruel, horrible experience in my life. How can anyone advice tourists to go see animal slaughters performed in a temple ? How can this be considered as a must-see experience ? For those who talk about spirituality, how can such a cruel act bring them closer to god ? Why give away life ? Gandhi was against this shameful act.For those who condone this practice from the stone age, I would advice you to think truly about the meaning of your doing. Honestly think about it..."
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "Spiritual Experience. The drive to Dakshinkali temple is awesome beautiful. Dark Forest , quiet atmosphere, calm cool air, excellent. Temple place is after climbing down less than 100 stairs. not crowded, One can sit and feel vibrations."
        }, 
        {
            "index": 82, 
            "rating": "4", 
            "review": "Don't go in Hindu festival time. Steep downstairs, through street hawkers, you can right away feel that you have reached a very special shrine. Sound of bells, holy smoke and rush of devotees, the place reflects power. I was on my way to Hetauda and I could not miss the place on the way. But I have heard about too much crowd in festival time. Avoid it."
        }, 
        {
            "index": 83, 
            "rating": "5", 
            "review": "Divine. The road till the temple is quite exciting & u can get some really good views of the Valley. We went in the evening & the shops outside the temple were closing. We knew its really crowded otherwise. The temple is like any Kali temple with traces of sacrifice showing everywhere. We also walked upto the other temple which is supposed to be of the deity's mother. Overall it was a good experience."
        }, 
        {
            "index": 84, 
            "rating": "5", 
            "review": "Jai Dakshinkali. Let the godess know what you what and if have a pure heart and soul, all your wishes be granted. You may visit on days other than Tuesday and Saturday as you may get some rush on those days."
        }, 
        {
            "index": 85, 
            "rating": "3", 
            "review": "A range of experiences here. This place is set down in a kind of ravine - it can be noisy with the pilgrims ringing bells, and choking with the heady incense-filled air. it could also become uncomfortable or confronting of you go on a day where you witness a sacrificial offering - yes, they do this regularly ... chickens, goat, etc - be prepared."
        }, 
        {
            "index": 86, 
            "rating": "2", 
            "review": "animal sacrifice. It was an area of animal sacrifice and the area we walked through was not particularly nice! The devotees who went into the temple were sincere about what they were doing. Some preferred to give flowers and fruit rather than the sacrificial animal."
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "Great hindu temple. Should go early in the morning. otherwise you should be in queue for one or more hours. Although you are in queue, you will have great time after reaching temple."
        }, 
        {
            "index": 88, 
            "rating": "4", 
            "review": "Hindu temple. We seen hindu temple very close. You cold see avery ceremony, but stay outside and make photos. A little bit difficalt to climb to Durga temple on mountain."
        }, 
        {
            "index": 89, 
            "rating": "5", 
            "review": "The power of Shakti!. If you believe in femme fatale, Dakshinkali temple is the place to be! The ultimate place of Women power, or lets say Goddess power. They say, man and woman fulfill each other, If you believe in the virtue of supernatural powers then Dakshinkali temple is the place to be! Jai kali!!"
        }, 
        {
            "index": 90, 
            "rating": "5", 
            "review": "Good place. Very crowded even on a weekday and long queue, prepare to stand two hours to reach or enter the shrine.We couldnt see where the sacrifice of the animals done.Quite a distance from Kathmandu city, about an hour through jungles to reach the place, bad roads.Kali Matha is so beautiful if you can see her."
        }, 
        {
            "index": 91, 
            "rating": "5", 
            "review": "great day out. not sure about public transport / taxi but by motorbike easy to get to and a nice ride. nice park areas for a picnic. on festival days lots going on with palm readers and holy men."
        }, 
        {
            "index": 92, 
            "rating": "5", 
            "review": "Kali Temple. This is one which I like the most. It is not for the People having heart problems. They do Scarification of goat, Hen and other animals to the Holy Kali Goddess. Every Saturday devotee of Goddess Kali cut the head of animals and birds and offers her blood of animals and head of animals. It is really cultural sock for western people."
        }, 
        {
            "index": 93, 
            "rating": "4", 
            "review": "A temple in the countryside!. This temple is another must visit place if you are wishing to see how animals are sacrificed in Nepal. Situated a bit far from the main town of Kathmandu but really worth a visit if you are wishing to see how Nepali Hindu people are religiously devoted and how animals are sacrificed. I liked everything except the cruel sacrifice of those innocent animals. It's truly natural, green and pollution free place."
        }, 
        {
            "index": 94, 
            "rating": "4", 
            "review": "Good place to visit but not don't like scarifying animals. Last visit in Nepal we visited Dakshin Kali temple which was organized by Nature House treks and expedition. The temple site was located middle of forest in a small gorge. Many devotee people on a long queue for waiting their turn to get in to the temple. I saw lots of people were offering flower and fruits to deity but I did no like they were offering goat and chicken at the temple."
        }, 
        {
            "index": 95, 
            "rating": "3", 
            "review": "Temple. It was amazing forty five minutes drive to the temple from hotel lush green route and the clean air it was all so refreshing and lovely. The temple was so full of peace and the people coming wiith so much devotion to offer was an amazing site to be in."
        }, 
        {
            "index": 96, 
            "rating": "5", 
            "review": "Unique and Moving Experience. What starts as morbid curiousity to see a religious practice (animal sacrifice) foreign to the Western mindset becomes something else. Yes, it is strange, exotic...but the overwhelming sense is of devotion. One feels privileged to be a witness to their faith. It is a very spiritually moving experience. A window into another culture."
        }, 
        {
            "index": 97, 
            "rating": "4", 
            "review": "Unique experience to see religious, animal sacrifices. I decided to take a Saturday morning visit to see this unique religious experience which is all dedicated to the goddess Kali. Saturdays and Tuesdays are the most significant day, especially Saturday and the line for sacrifices is rather lengthy, but not so bad for tourists and sightseers as they enter through a different way (plus an entrance fee).To get to the sacrificial area, you first must park in the carpark and then walk about 1 kilometre upwards passing stalls selling all manner of souvenirs, trinkets, animals and vegetables (for sacrifice purposes...even vegetables!!), and drinks etc. Once at the entrance to the temple area, you must descend down stairs (approx 100 or less maybe). At the base you cross a bridge which leads closer to the sacrificial area, with a basic butchering facility to the left. You can see many birds snatching the offal which escapes out the drains on the left hand side of the bridge just below the butchering area. This area is for those who wish to prepare the carcass of the sacrificed animal for eating (BBQ/picnic within the surrounding park areas). To the right of the bridge is a small open area (with small water fountains) and a prayer area (where incense and oils are burnt) with an adjacent pathway leading to sacrificial alters.Tourists and visitors can stand and view from outside of the alter areas, but cannot enter. I managed to get a good vantage point and could experience the entire procedure. However, you don't have to go pass this sacrificial area, as you do have to go out of the way to witness this religious act. If you don't want to see this, you can take the main path up pass the prayer area which then leads behind the alter area - finally returning back to a small footbridge that leads back to the \"tourist\" stairs. (NB: You can still experience a wonderful time without the need to expose yourself to the sacrifices, as this is just a small part of the temple area.)Definitely recommend others to experience this significant temple and the surrounds on a half day tour - or incorporate a nearby town for a full day. For me it was a unique and colourful experience with a pleasant walk to and from the temple. (NB: It was very busy on Saturday, but nothing caused any major/inconvenient delays...in fact it was OK.)"
        }, 
        {
            "index": 98, 
            "rating": "5", 
            "review": "Durga the powerfull. If you are a bit squemish then don't go as this temple is were the people of Nepal go and sacrefice animals to Durga.Not for the faint hearted.But amazing to see."
        }, 
        {
            "index": 99, 
            "rating": "3", 
            "review": "Temple of Goddess Kali.. Situated south of the valley,this temple is dedicated to the most popular goddess Kali, also called Chamunda.She is consider as a protector of the valley from this direction. Every Saturday, a large number of people visit the temple and offer animals sacrifices, an age old practice in Hindu religion which has been given up in India while its is still being followed in Nepal.On the way to the Dakshin kali temple on can visit the famous Chobar Gorge where on can see distinct mark of a part of the hill having been chopped off by the sword of Bodhisattva Manjushri to drain out water from the valley."
        }, 
        {
            "index": 100, 
            "rating": "5", 
            "review": "Temple of Goddess Kali. The Dakshinkali Temple situated in the bank of small stream, inside the deep forest of southern Kathmandu. Its also the place for day hike, picnic spot and dating. This is suitable place for all aged people."
        }, 
        {
            "index": 101, 
            "rating": "4", 
            "review": "like a killing temple. It is very far away from kathmandu city, and to go inside the temple we need to stand in a line for may be 2 or 3 hrs. the people use to kill a lot of chicken and goat. the people say they are giving bog."
        }, 
        {
            "index": 102, 
            "rating": "4", 
            "review": "a small temple in the middle of nowhere - but.... The temple was a long way off south (22 km) through narrow roads and we had to walk a long way, lined with vendors of all types of goods and livestock (for the animal sacrifices) after being dropped off at the entrance. When we got there, the temple was – so small! What?! But it’s supposedly one of the most popular worship places in all of Greater Kathmandu, most crowded during the “holy” days of Tuesdays and Saturdays (this was Monday) when animal sacrifices are offered to the deity. And yet when we were there, there were still so many people. And we actually got to see a goat sacrifice and chickens too. When we first came, we saw a goat body being chopped up. Then when we were near the altar we saw someone holding the goats head. Yikes! The custom is to leave the chicken head or goat head at the altar. Unless you offer to buy the head then they give it back to you. The guy holding the goat head seemed proud. Some others in is his party would occasionally touch the goat head blood and put it on the forehead of someone younger. And they had the usual 100,000 cotton swabs in bowls that were being burned as part of a thanksgiving ritual. As usual, there were people prodding the bowls with sugar cane sticks, then using those sticks to touch a pregnant woman to ensure it was a boy. I quizzed our guide as to why the site was so popular and he said that most wishes were granted so the word of mouth had spread."
        }, 
        {
            "index": 103, 
            "rating": "3", 
            "review": "Sound place .. peaceful place to watch & also famous for Hindu pilgrimage."
        }, 
        {
            "index": 104, 
            "rating": "3", 
            "review": "A very powerful cosmic energy for people who seek.... A energy hub (Shakti Peeth), meant for recharging your cosmic energy... Place for people who understand such things... A very nice drive away from maddenning Kathmandu... Very powerful Hindu Goddess...."
        }, 
        {
            "index": 105, 
            "rating": "4", 
            "review": "Hindu Temple. We saw animal sacrifies in the temple which is far in the jungle site. But really nice walk from below temple to go up to mountain top."
        }, 
        {
            "index": 106, 
            "rating": "4", 
            "review": "Go there on a Saturday.... If you go there on a Saturday, and just walk past the touts trying to sell you stuff, the fascinatingly morbid sacrifice of animals is... fascinating! Families will then have a picnic somewhere eating barbequeing and sharing the animal."
        }, 
        {
            "index": 107, 
            "rating": "5", 
            "review": "A Must See Place To Go. Just mark it down on your list of things to do while you're in the area. It's a beautiful temple.That said, there are some days you may NOT want to go- if you're unaccustomed to the ritual slaughter of animals.Read about Dakshinkali before you go, it will tell you when the best days to go are--- and a little bit about the importance it has in the Hindu world.Some really good handicraft makers exhibit their goods along the walk down to the site itself- good prices too."
        }, 
        {
            "index": 108, 
            "rating": "4", 
            "review": "I insisted on visiting dakhin kali. It was our 2nd time visit to Nepal . So I insisted on visiting dakhin kali as we had skipped it last time due to shortage of time . One thing I have noticed in Nepal that the act of sacrifice is still performed in almost all temples which represent the kali faces of Goddess .i have seen this act in Dakhin kali and Mankamana aswell (Manakamana temple is situated on the way to Pokhara from Kathmandu) . It was quite distubing for me to view such an act of sacrifice . Dakhinkali temple is situated in out skirts of kathmandu about 20 km from the city .the place was amaging , on the way we have been to Choubar gorge and Swayambhunath ."
        }, 
        {
            "index": 109, 
            "rating": "5", 
            "review": "A Dramatic Place, if you don't mind lots of blood.. Tuesday morning and Saturday mornings are the big slaughter days when the steps turn red. Nevertheless it's a considerably better place than the Kathmandu Abatoir, of course, as the animals are calm to the last. after offerance, the family eat the meat, so nothing is wasted."
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "Animals sacraficed to the goddess Kali. One of the most interesting events I have ever seen. If you go to Nepal, hire a guide through the Annapurna Hotel in Kathmandu to take you around the city and surrounding areas. Do not miss going to the Dakshinkali Temple. The sacrifice takes place twice a week. I went on Saturday. The press of the crowd was unbelievable. This is not a spectacle for the weak of heart. Chickens and goats are the sacrificial animals. There is blood everywhere at the sacrificial area.Devotees believe that the goddess will absorb any ill fortune that has befallen them by sacrificing. Interestingly, the animal carcasses, after the sacrifice, are taken to another area, cleaned/plucked and taken home to be consumed. If you really want to see something unusual, then a trip to Dakshinkali Temple is a must."
        }
    ]
}