{
    "category": "Kathmandu", 
    "entity": "The-Crematoria", 
    "avg_rating_stars": 4.263803680981595, 
    "review_count": 489, 
    "rating_stats": {
        "poor": 13, 
        "average": 54, 
        "terrible": 11, 
        "very_good": 169, 
        "excellent": 242
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "A place to take your time at.. Go early in the morning, and check for festival dates, these are the best times to visit. Go with an official guide to explain what is going on. There are many priests there who for a fee will help families to prayer for loved ones with offerings that are placed in the river. They are happy for you to watch at a distance..Always go with an official guide who will explain what is going on, the cremations take place on the temple bank opposite, and may not be for some."
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "A unique cultural experience. We went with a local guide ($15) who did a great job explaining the Hindu tradition of burning their deceased, as well as the various temples on the grounds. There is a $10/person entrance fee, which might seem a bit steep, but was definitely worth it. Stay for the light festival at dusk."
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "A Must See (And I didn't even want to go). Go here See history and Wow you won't forget it ! Wear your dirty shoes here you may want rid of them later"
        }, 
        {
            "index": 4, 
            "rating": "4", 
            "review": "Worth the visit! . Quite an honour to see how the Nepalese send their family off when they die. Make sure you have a guide as they explain it so much better than trying to piece together what is happening."
        }, 
        {
            "index": 5, 
            "rating": "2", 
            "review": "Get in, get out, keep your belongings close.. This came highly recommended and I was looking forward to a respectful place where the dead are sent on to their next life, what we experienced was dirty, drugged out and pushy young men trying to be our tour guide. We were here near the end of Dashain and because of this, perhaps, there was not much activity at the crematoria. The vibe here is creepy, not because bodies are being burned, but because of the people who hang out here. We left quickly. I would highly recommend coming here with a reputable guide. I would return, but only with a real guide. Enter at your own risk."
        }, 
        {
            "index": 6, 
            "rating": "4", 
            "review": "Seeing life and death as it really is. We were grateful to walk through this area.It wasn't confronting, just life as it really is. Saying goodbye and honouring loved ones."
        }, 
        {
            "index": 7, 
            "rating": "5", 
            "review": "Riverside cremations. One of the most interesting sites. Able to view the ceremony without the crowds of Varanasi. The site allowed great photo opportunity."
        }, 
        {
            "index": 8, 
            "rating": "5", 
            "review": "Interesting culture. Get to see the process of cremation clearly. Get a guide to explain the procedure to u as you see it happening just opposite the river."
        }, 
        {
            "index": 9, 
            "rating": "5", 
            "review": "Humbling experience. We sat, across the river, quietly and unobtrusively, observing various families poignant farewell to their loved ones in the traditional Hindu manner. . We regarded this as a most humbling privilege, and experience. I was particularly angered by a European tourist who placed himself immediately beside some of the bodies during the cleansing ceremony, and preparation of the bodies for cremation, and proceeded to film the events. So intrusive, disrespectful and inappropriate. Please visit, but don't intrude on others private grief."
        }, 
        {
            "index": 10, 
            "rating": "5", 
            "review": "Very humbling experience. Not what you would expect to give a 5 star review but the whole experience was very moving and humbling and in my opinion a must visit whilst in Kathmandu. So different to anything you would see in the western world, and thats surely what travel is about right?"
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "This Is Different. Not For Everyone. Actual Hindu Cremations. We found it to be very interesting. Actual Hindu Cremations done in front of us. Cameras allowed. You stand across the Holy River and see the whole process. Please remain respectful."
        }, 
        {
            "index": 12, 
            "rating": "5", 
            "review": "An absolute must. Nepal Tours took my lady and I to witness this most sacred of experiences; families saying goodbye to their loved ones in the traditional manner. Robbie knew exactly where to go to witness this heart-filling ceremony, and did so with the utmost concern for the people involved. His explainations helped us to become part of the ceremony rather than just spectators"
        }, 
        {
            "index": 13, 
            "rating": "4", 
            "review": "What an interesting place to visit. Having only ever seen such palace on television, at the ganges, to visit the real thing and be able to watch was an interesting learning curve in such a place of prayer, and sorrow. the sad part is that now the indian government has forbidden begging at tourist sites in India, these same professional beggars have now appeared in Nepal at the same sites plaguing tourists - not nice.Oh and you will get hammered by hawkers"
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "Never seen like this before. Wow. The temple is very old and one of the most important temple of hindu religions and the river flow near to the temple which look beautiful and feel different."
        }, 
        {
            "index": 15, 
            "rating": "3", 
            "review": "Confronting but fascinating. Whether or not you will \"enjoy\" the riverside crematoria at the Pashupatinath Hindu temple will depend a lot on your sensitivies. Yes, it is fascinating, but also confronting, and the notion of tourists living up to photograph a solemn death ceremony for the locals does fill one with a sensation of voyeurism."
        }, 
        {
            "index": 16, 
            "rating": "2", 
            "review": "Needs a clean up. The area around is a bit suspect - understand the rituals etc. But did not really need to see it. Would not go again"
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "Very impressive to see this local ritual. Impressive to see this local ritual of the cremation. When I was there there were many cremations going on, I have never seen anything like this it was very impressive."
        }, 
        {
            "index": 18, 
            "rating": "5", 
            "review": "Amazing and eye opening, confronting but peaceful. This is religious culture at its most eye opening.. Definately one of the must do attractions in Kathmandu. This can be confronting to see the bodies being cremated in the open but also very calming realising that the Hindu culture views death as the next step to the next life.. its great to get a good guide if you can called Richard at the front entrance, he is a Nepali that lived in London a long time and he is very knowledgable about this site and all its religious and cultural significances. Its fascinating to learn how the cremations take place and where and on what for all the various castes..and see the 400AD temples and Shivalingas and more.. The Sadhus are colorful to see, but be wary they will want money for photos and they prefer international notes! You can spend a good half day at this fascinating site but its memories stay a long time.. emjoy!"
        }, 
        {
            "index": 19, 
            "rating": "4", 
            "review": "Hindu Cremation site. If you haven't been at hindu cremation sites, you've got to go to this one. Is cleaner than the ones at Varanasi, you get better view and pictures are allowed. In Varanasi they are not."
        }, 
        {
            "index": 20, 
            "rating": "5", 
            "review": "Once in a lifetime. It's a little weird/morbid to watch a funeral but it is an once in a lifetime experience. Take a guide to explain the process. If germs and smoke weird you out, bring a scarf or mask to breathe thru (they are burning bodies). This is definitely a glimpse into a cultural much different to rest of the world, so what is shocking to us, is normal and important to others. So enjoy the differences. Something you'll never forget."
        }, 
        {
            "index": 21, 
            "rating": "5", 
            "review": "Must see when visiting Kathmandu. We personally found this one of the cultural highlights in the city. Also, monkey temple is conveniently nearby."
        }, 
        {
            "index": 22, 
            "rating": "3", 
            "review": "Smoky and hot. The creamatoria was an average experience. I feel sad having to witness such events. There was so much smoke and the weather was hot. Not recommended for people who have sensitive nose and eyes."
        }, 
        {
            "index": 23, 
            "rating": "5", 
            "review": "Nice Experience. Was lucky enough to observe the cremation process of a royal family, and a orphan. The royals and riches get their rituals done in front of this building that stands out from the rest (it's beside the bridge). The rest get the rituals done further down from the bridge. Sad to see how the royal funeral spanned about 2 hours long, with so many rituals, while a poor orphan lady had hers done by a couple of strangers in barely 15 minutes. But both burn the same way. The crematoria may be hard to locate. It's on the right after the main entrance."
        }, 
        {
            "index": 24, 
            "rating": "3", 
            "review": "A place where to understand Nepal culture . This is where you can review on the subject of Death, which nobody like to talk about when one is alive. But come on, everyday we are just one step closer to death."
        }, 
        {
            "index": 25, 
            "rating": "4", 
            "review": "Well worth a visit. Visited on an afternoon in a thunderstorm. Number of cremations going on. Fascinating, as a Westerner, to watch the funeral procedures of the Hindu religion. Not ghoulish as you would expect but everybody showed great reverence and respect for the deceased and their families. It's certainly something I will never forget.Disappointing that non Hindus are not allowed into the temple despite being charged NPR1000 ( approx.€8)"
        }, 
        {
            "index": 26, 
            "rating": "4", 
            "review": "Holy Cremation place. the river is considered sacred because it eventually flows into the Ganges River in India, ultimately reaching the holy city of Varanasi. The human body resting on the platform underneath the bright yellow cloth, is burned and the ashes are eventually pushed into the river below, some people found it disturbing especially when you smell the body getting burned."
        }, 
        {
            "index": 27, 
            "rating": "5", 
            "review": "A Reflecting Moment!. When I went to the Crematoria, I did not know what to expect. First, I saw the smoking pyres, and next, the entire funeral ceremony for a body to be cremated. It was more of a reflecting moment for me, full of spiritual thinking and feeling. This was perhaps the most culturally different of all my experiences in Nepal."
        }, 
        {
            "index": 28, 
            "rating": "3", 
            "review": "The holiest cremation site in Nepal. The cremation site is at bank of bagmati river at eastern side of Pashupatinath temple. The view of burning bodies made me think the importance of human life. And didn't liked that they threw all remaining in the river(water pollution). I guess new electric cremation site has been built so lets hope pollution is less."
        }, 
        {
            "index": 29, 
            "rating": "4", 
            "review": "our journey ends here. Pashupatinath is celebrated for its human cremations that take place on the Ghats of the Bagmati River in eastern Kathmandu. The river is considered sacred because it eventually flows into the Ganges River in India, ultimately reaching the holy city of Varanasi.The human body, which is resting on the platform underneath the bright yellow cloth, is burned and the ashes are eventually pushed into the river below."
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Old style. Near the airport and install pashupatinath template compound is that cremation palace you are able to see def burning busy"
        }, 
        {
            "index": 31, 
            "rating": "1", 
            "review": "IF DEATH IS YOUR THING. not sure what the attraction is to watch bereaved family members traditionally burning the bodies of their departed on the banks of a dirt river (however holy it may be) and lots of equally dirty saddhus wandering about smoking weed."
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "Unique site. If you are fascinated with life, living and dying and how others go about it then you must visit this site."
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "Good. This place is near in pasupatinath Temple you may able to see the cremation Hindu trisection way. You may able to see dead burn body in front in your eyes."
        }, 
        {
            "index": 34, 
            "rating": "1", 
            "review": "Leave in Peace. I dont the a crematoria is an attraction. Its a place where people depart from their loved ones and so they must be left in peace."
        }, 
        {
            "index": 35, 
            "rating": "4", 
            "review": "nice. me and my wife been in pashupati nath temal to see shiva temae near temple we been the crematoria this palace is belong to hindus their own traditional to burn ded buddy after ast a away nor to bad palace"
        }, 
        {
            "index": 36, 
            "rating": "5", 
            "review": "Very Interesting.... Seeing the preparations for the cremations, as well as the burning of the bodies was quite an eye-opener. It was an incredible experience, and beautiful in it's own regard. You can stand on the opposite side of the river, or on the bridge.You can also see the Baba's caves, and they are around trying to get you to take photos with them for money. As weird and wonderful as they look, don't fall for it!A must do !!! "
        }, 
        {
            "index": 37, 
            "rating": "5", 
            "review": "Impressive, more beautiful than Varanasi.. When we arrived there were 2 cremations in the make. A bed of orange flowers and cloths were laid out. And then came the deceased. What beautiful rituals and what sadness. It made me almost ashamed to watch."
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "Interesting place with a view of funerals and cremation. One of the most interesting experiences in Kathmandu. Nice area with temples and monkeys. But the best part is the possibility to witness a hindu funeral with all its particular and beautiful activities and traditions. When there we saw parts of three funerals. And it does not feel like you are intruding as you can sit far away and a lot of locals also hang out and watch \"the show\"."
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "Largest Hindu Temple. Explore this large Hindu Temple on your own or with a guide. Be prepared to witness a burial (where a body is burned in the Hindu tradition). Monkeys are everywhere, but DO NOT feed them and watch your purse, backpacks and pockets. These little creatures are fast and mischievous!"
        }, 
        {
            "index": 40, 
            "rating": "4", 
            "review": "Once in a lifetime visit. Great experience. Make sure you are respectful as this is the main active cremation site in Kathmandu. Do not feed the monkeys and be careful of taking pictures with those in costume as they will try to charge you heavily afterwards!"
        }, 
        {
            "index": 41, 
            "rating": "4", 
            "review": "The Crematoria was a strange visit to just what one would call \"normal sight seeing\".. Make sure you understand what you are getting into before going, although I did, it was still hard to fathom. The location is beautiful, and worthy of a National Geographic picture from every angle, however the daily act of cremation here might not be everyone's cup of tea. I think that that says it all...One interesting note, the ashes often are poured into the Bagmati River, right next to those washing their clothes and taking a bathe. Strange combination, but when in Rome..."
        }, 
        {
            "index": 42, 
            "rating": "3", 
            "review": "the smell is beyond discription. I think that it is wonderful to share other cultures and to be part of them. In the west we hide away our dead and in Nepal it is out in the open. I know that different places have different customs and I respect that. I am not very keen on the fact that the refuse of the human burnings go directly into the Bagmati River. Small children wade through the water collecting any and all trinkets from the funerals. I realize that this is a cultural thing, but the pollution bothers me. It is a very holy, very holy site. You can feel the humanity. I will remember this place forever although I am not interested in going back."
        }, 
        {
            "index": 43, 
            "rating": "5", 
            "review": "Educational. Definitely worth a visit --the ceremonies are caste based and many faceted--surrounding area great--do not miss the hermit enclaves at he far end"
        }, 
        {
            "index": 44, 
            "rating": "3", 
            "review": "Attraction for tourist. This is nothing that attracts a local or Hindu who have seen such cremation many times in life or which is not something attractive, rather that part of ritual that one has to fulfil in their life or be part of it when some nears and dears dies. This is next to the famous temple of Pashupatinath and on the bank of Bagmati river. When a person dies, they are brought here for cremation which is done with fire-woods but know there is also few electrical cremation places which is rather quicker. Many foreigners watches this from the opposite side of the river - though one can also go nearby and see such rituals but mind it that non-hindu are not allowed to enter inside the temple (which is something I am against of and hope it will change one day)."
        }, 
        {
            "index": 45, 
            "rating": "4", 
            "review": "Personal but interesting. I feel awkward taking photos and staring at people during a ceremony, but there were a lot of tourists here and my guide was encouraging photos. It's quite moving to see the spiritual side of this ceremony, to know that there is literally a dead body under the smoke.No, you don't smell anything except maybe sandalwood. Definitely have a guide to explain what you are looking at."
        }, 
        {
            "index": 46, 
            "rating": "4", 
            "review": "The Crematoria @ Pashumathinath temple. Very eerie and peaceful place to watch the dead on the last journey. The rites performed and the funeral pyre makes one wonder rich our poor , whatever or race we all are one at death"
        }, 
        {
            "index": 47, 
            "rating": "4", 
            "review": "Interesting Place to Visit. You could get good view about the local place and really heart touching. there for ghat just next to the river and give you quite different feeling of spiritual way. Few bucks for the entry. Worth a visit. Should visit if you're in Kathmandu. Enjoy"
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "Way to heaven. Adjacent to the famous Pashupatinath temple is the crematorium , one of the few places where the wooden pyre is still used to complete the last rites. people say its the way to heaven, getting cremated here frees one from the pain of rebirth and attains moksha."
        }, 
        {
            "index": 49, 
            "rating": "4", 
            "review": "Worth a visit. Although I left before the fire was lit (queasy stomach and all), the visit was interesting. The temple priests were particularly interesting and so were the structures around the crematorium and the stories behind them. I had a good guide who explained all the customs and beliefs about the cremation rituals, and the history of the temple and its inhabitants. Very interesting!"
        }, 
        {
            "index": 50, 
            "rating": "4", 
            "review": "Definitely worth going. Though the visitors are funneled to the opposite side of the river from the ghats you can certainly experience what's happening. It's difficult not to feel intrusive at times. Or that's what I felt anyway."
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "Visit heaven trek. Im very touching when visited this place last week....when i saw ceremony for cremation, the family go around 3 times and kiss the feet of their parents deceased. Really touching. And worth it to visit, that is my first experience can see the cremation. ;)"
        }, 
        {
            "index": 52, 
            "rating": "4", 
            "review": "Bit morbid, yet, interesting.... It seems quite unusual to visit a cremation site... I had mixed feelings on deciding if I should do it or not. But it does give you a unique view of the local rituals. On my visit there were 3 ceremonies happening at the same time, one of them being of a highly reputed doctor of the region with a big crowd coming to it."
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "Very interesting. Very interesting place to see a part of Nepalese culture. The site itself is worth a visit and walk around. Entrance fee of NPR1000 or USD$10."
        }, 
        {
            "index": 54, 
            "rating": "4", 
            "review": "Part of the Pashupatinath complex. The site is the part of the Pashupatinath temple complex, if seeing dead bodies being cremated the Hindu way is your thing then this is the right place for you."
        }, 
        {
            "index": 55, 
            "rating": "5", 
            "review": "Incredible experience . I've found it hard to describe my feelings about this experience. It's very personal, that's certain. I recommend anyone to visit the Pashupati area and educate the mind on the amazing traditions."
        }, 
        {
            "index": 56, 
            "rating": "3", 
            "review": "Be prepared to see bodies burning and children playing the river where the ashes are going. This is an interesting place, but also a bit disturbing. I felt like I was a tourist to a moment in life that should have been more intimate. I couldn't bring myself to take pictures of people setting loved ones on fire - you watch the ritual, but it didn't feel right to do so for me. It is definitely a different culture and I brought my bias, so others may find this special rather than uncomfortable. Just be prepared that you are watching actual funerals from across a small river."
        }, 
        {
            "index": 57, 
            "rating": "4", 
            "review": "Emotional. I was not prepared for the sights we viewed here, and felt like a voyeur on other peoples miseries.I was reassured by our guide that this was not how the locals viewed it but I felt that taking pictures was wrong and disrespectful."
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "A must see in Kathmandu. I am not one to observe the misfortunes of others, but there were two memorable things about being here. First - it is the presence of true Shiva energy. All through India and Nepal you visit many Shiva temples, but here, in the temples, and especially where the older people live nearby, I felt the most true presence of Shiva. Makes sense, right? And, second; I will always treasure the memory of the evening ceremony that takes place on the banks of the river. It's a time when people gather for music and dance, and thank the Spirits for coming to greet the newly departed loved ones. It's organic, it's real, but, not morbid. This experience was really an honoring of Life, death, and family. It's organic, it's real, but, not morbid."
        }, 
        {
            "index": 59, 
            "rating": "4", 
            "review": "Special. A bit weird to look at the cremation of a human beings on one side and others (yes, me too) making pictures at the other side. But with a guide we had for 10 dollar it really make sense to go there and learn about the traditions."
        }, 
        {
            "index": 60, 
            "rating": "4", 
            "review": "I couldn't leave. The reason why I couldn't leave was because of the meaning, philosophy and culture behind this. It was moving and very in your face. The smell and sight drew me to the place and I watched on in fascination...then a wave of sadness smacked me and I was left in a melancholy state for the rest of the day - I couldn't shake the images out of my head and wondered what death means. I said when I was 7 that I wanted to die before my love ones because I can't bear to see them leave....sigh, a moving experience but a sad one"
        }, 
        {
            "index": 61, 
            "rating": "5", 
            "review": "Very moving and fascinating. we saw the cremations in progress, its a little unreal, as it is so different from UK customs, the families and friends all participate and clear the final ashes into the river, en route to the Ganges. sounds a little morbid , but very moving, beware the smell, which can be a little disturbing as it resembles BBQ."
        }, 
        {
            "index": 62, 
            "rating": "4", 
            "review": "An ethereal experience. Watching from the opposite bank, was a moving experience to observe how Nepalese paid their last respects to a family member. We were mesmerised as senior family members oiled, disrobed the corpse and ignited the funeral plinth, very moving and a privilege to observe. Can't believe some tourists had gone o the other bank, walked upo very closely and started photographing and videoing the ceremony...very disrespectful in my opinion."
        }, 
        {
            "index": 63, 
            "rating": "4", 
            "review": "Read the reviews before you go!. This is a moving experience, but some may find it disturbing. This is where those who can afford it have their deceased family members cremated on open pyres next to the river. It is a powerful moment, but I wouldn't bring young children or the faint of heart."
        }, 
        {
            "index": 64, 
            "rating": "5", 
            "review": "Fascinating cultural experience. I would put this towards the top of my list, been here three times, and it is always interesting and I learn a bit more about the traditions and customs of the cremation process every time. I really came away discussed with the American burial and cremation processes. This makes sense to me, and it is definitely not gross in any way."
        }, 
        {
            "index": 65, 
            "rating": "4", 
            "review": "Very interesting. I was pressured into getting a guide but it was probably worth it because I wouldnt have appreciated what was happening as much. Holy men and women were everywhere but they have highish prices for photos. I felt like a bit of a dick being a tourist here while people are burning their loved ones but it was a special experience. I saw one dead body from a distance but otherwise they were enveloped in fire or covered."
        }, 
        {
            "index": 66, 
            "rating": "4", 
            "review": "Special experience . It is something really different than in Europe, you see how the bodies are burned and the family and friends of that person. Several traditions (like shaving of all the hairs from the son when the mother or father dies) all happen in public. Just be aware that it could be a bit shocking, however for me it was a peaceful experience."
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "eye opener. this place is my favourite place, because it really hits home and makes you think about life and the circle of life with your place in it as well"
        }, 
        {
            "index": 68, 
            "rating": "4", 
            "review": "Deep insight into Hindu rituals. Although we turned down numerous offers from tour guides, we managed to find the crematorium to the side of one of the most important Hindu temples in Nepal, possibly the world. Incredibly moving to watch the departed surrounded by friends and family as they are put in place and set alight."
        }, 
        {
            "index": 69, 
            "rating": "3", 
            "review": "Interesting to be and watch. This is a traditional temple for funerals in the old hindu style. Entrance fee is 1.000 Rps. but worth to spend if you want to watch these rituals."
        }, 
        {
            "index": 70, 
            "rating": "4", 
            "review": "Old style cremation next to the new option. There are almost always cremations ongoing at this large site, day and night. On the riverside, up to a dozen may take place at once. The newer incinerator is close by and offers a faster, cheaper alternative to those seeking this service, although traditions die hard.Visitors, I.e. Non-Hindus, can view from the gallery across the river. There are also holy men on site who are willing to pose for photographs for a small fee. Not particularly gory, but the squeamish may not enjoy this."
        }, 
        {
            "index": 71, 
            "rating": "4", 
            "review": "The Crematoria. This was my first visit to a crematoria. The ceremonies were very interesting. I was not able to enter the temple but what I saw looked very impressive."
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "It is much, much more than just a crematoria......... Pashupatinath temple is the most important temple dedicated to lord Shiva in Nepal and one of its most scared Hindu temples. Located on the banks of the holly Bagmati river (which much further down flows into the Ganges) and at about five km from Kathmandu, Pashupathinath is the place where Hindus from both Nepal and India come to die and be cremated, in the belief that dying in Pashupathinath guarantees their rebirth not as a worm, a pig or a dog, but as human, irrespective of the misdeeds in their lives... You can, of course, observe the bodies being brought to the cremation ghats, the oldest son pouring some incents and holly water from the river before lighting the funeral pyre, then ashes being discarded into the holly Baghmati and further down the river kids playing into the water and women doing their laundry. Here, death is not the end but just another step towards Nirvana.... The temple itself (available only to Hindus) is a masterpiece of Hindu architecture and, if you are interested in religions, in other ways of thinking of life and death, then you may not like to miss a visit Pashupatinath.. ."
        }, 
        {
            "index": 73, 
            "rating": "4", 
            "review": "True confluence of life and death. Should experience from Pashupatinath temple itself unless willing to take a bit of filth. Very clearly visible from temple."
        }, 
        {
            "index": 74, 
            "rating": "5", 
            "review": "What a site. Once of the most unique things I saw while on my trip to Nepal. We witnessed multiple cremations attended by hundreds of people."
        }, 
        {
            "index": 75, 
            "rating": "3", 
            "review": "Walk by. The most attraction place for tourist for fooding and night life located at the central of the capital Kathmandu is the best place to hang out. The area touch Indra Chok, Jamal, Lainchour, Dollu, Dalku. My suggestion for the government of Nepal to band the entry of vehicles to Thamel so that the tourist can walk freely and they can shop the soviener.It would be less polluted also and the area would be developed well.."
        }, 
        {
            "index": 76, 
            "rating": "4", 
            "review": "Engaging. This is a strange yet engaging place that seems completely alien to European culture yet means so much to local people. It seems as though there is always a funeral byre ongoing here, sometimes several with the remains being unceremoniously swept into the very murky 'holy' river."
        }, 
        {
            "index": 77, 
            "rating": "4", 
            "review": "Not something I expected to see with my own eyes. When we visited the Crematoria we certainly didn't expect the cremations to be actually happening...though we probably should of! It was not a sad place even with what was happening. When we visited there were six cremations happening along the river......people were casually viewing over lunch or just sitting quietly and watching. One thing to be aware of is unfortunately the smell but dont let that turn you off visiting such a culturally rich place....use a head scarf over your nose as that will get you through. It costs 500NPR per person."
        }, 
        {
            "index": 78, 
            "rating": "5", 
            "review": "Religion of Hindu. when i visited Kathmandu i went to Hindu Crematoria place thats called lord Shiva pashupatinath temple. this is situated Bagmati river it is a huge temple in the world of Hindu religion.it is very old temple and built by wood handicraft statue of many gods.i like that temple to visit in Kathmandu Nepal. so, if you want plan to visit Kathmandu don't miss to visit that place. thanks.."
        }, 
        {
            "index": 79, 
            "rating": "5", 
            "review": "Rich of Historic value. . This is the biggest Crematoria in Kathmandu and has lots of temples surrounding. This is the place dedicated to the birth of life and death. One side is used for the purification of the bodies and across the bridge is the burning or cleansing of the bodies. Men are placed west to east and women are east to west. If you have a weak stomach be prepared to see actual bodies being burnt. When i went there was 2 already burning and 3 booked so I was able to see the whole process. They are monkeys here so keep your bag with you and if you want to take a picture with the holy men they expect a tip of about 250 ruprees each which I though was ridiculous but a tip or donation is not required but they will get upset if you don't tip them. One the far side you can see houses in the mountain where the priests live both Hindu and buddest are burnt here. The white temple you aren't allowed to enter this is where the holy water that purifies the body comes from and is prohibited for foreigners to enter but can see from the rop of the hill in full view. Definitely worth a trip to see and the entry cost is 1000 ruprees for two temples the other temple is about a 25 min walk from the starting point. The building survived the earthquake quite good with only afew small temples beyond repair."
        }, 
        {
            "index": 80, 
            "rating": "5", 
            "review": "Interesting and powerful. To fully understand this site please hire a guide it was work his salary times two!!! This site is a holy place with the river and the rituals that take place."
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "Never seen anything like it.... Wow, this was new experience for me, public cremations, and the stench of the river...for a soft westerner pretty like me mind blowing...certainly a experience one should see and smell...suggest you take a mask...."
        }, 
        {
            "index": 82, 
            "rating": "5", 
            "review": "Hindu culture to the max. When in Kathmandu you must come here.\nThe epicenter of Hindu culture. Its a surreal experience to be walking up one side of the river and photographing someone being cremated on the other."
        }, 
        {
            "index": 83, 
            "rating": "4", 
            "review": "fascinating but sad. We were taken here by our guide, it was something that we'd only ever seen on TV before. It was indeed fascinating but sad to see."
        }, 
        {
            "index": 84, 
            "rating": "3", 
            "review": "Eye opening visit.. Surprised this is open to tourists- it was quite jarring to see the cremations. While interesting, it seems like it should be reserved only to family's in mourning or for religious purposes."
        }, 
        {
            "index": 85, 
            "rating": "4", 
            "review": "Visit May 2016. Very interesting and fascinating - bodies being cremated on the river bank on open fires (similar to Varanasi in India I believe). Also attended the Aarti ceremony which is performed nightly by a selected family - really nice to be up close and personal for such a ceremony"
        }, 
        {
            "index": 86, 
            "rating": "5", 
            "review": "An ancient and timeless ritual. Located at the Pashupatinath Temple in Kathmandu the creamatorum has remained busy since the 2015 earthquake . An important part of Hindu life the funeral fires burn all day and all night.\nThis is a UNESCO World Heritage Site."
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "Part of the adjacent temple complex.. An opportunity to view a different approach to death. Not for the squeamish. You will see dead bodies."
        }, 
        {
            "index": 88, 
            "rating": "5", 
            "review": "A must see. This was my 3rd time there and even so the earthquake has destroyed some of the temple, it was a great experience. This place is very peaceful and the atmosphere is very serene and beautiful. Our guide Subash (+9779851185516) was great."
        }, 
        {
            "index": 89, 
            "rating": "5", 
            "review": "Absolute must do. It is a little over whelming when you first arrive if you are not from a culture that celebrates life/ death in this way. I loved understanding more of the Hindu culture and this sacred place. A very unique experience"
        }, 
        {
            "index": 90, 
            "rating": "5", 
            "review": "Authentic experience. Even though you'll be hard-pressed to avoid the \"guides\", our visit included monkeys, bodies being prepared for cremation, bodies in the process of being burned, and even a bull (with very big horns) wandering the streets."
        }, 
        {
            "index": 91, 
            "rating": "5", 
            "review": "Make sure you stay for a whole ceremony. If you have not seen the Hindu ritual of death and cremation then stop and watch from the moment someone if brought here, to how they are cleaned to moving them to other side of River to how cremation is set up to the actual lighting of the flames. Quieting."
        }, 
        {
            "index": 92, 
            "rating": "5", 
            "review": "Moving but not for the fainthearted. You see actual cremations here so be prepared to acknowledge and respect that. Go with a guide so you can understand the significance and history of the place. Sad to see the river so polluted. Pay the holy men a couple dollars & get a picture of a lifetime with them!"
        }, 
        {
            "index": 93, 
            "rating": "5", 
            "review": "Cultural education. An absolutely intreaging insight into Hindu customs and ceremonies. It was a real privilege to witness"
        }, 
        {
            "index": 94, 
            "rating": "5", 
            "review": "very unique experience of passing and celebration. It's not a normal day out, but to see a beautiful and open celebration of life and death is a cultural must do. Be prepared to pay to come in if you are foreign. At night, there is a cool ceremony just after dusk. Really a beautiful way to celebrate life."
        }, 
        {
            "index": 95, 
            "rating": "5", 
            "review": "Fire. In hindu traditisnal when people past the away thad ded buddy can fire in open place in frent of people their own traditional same people like sam people don,t like about my vision must sev the tradinationnal"
        }, 
        {
            "index": 96, 
            "rating": "4", 
            "review": "Mini Varanasi at a Powerful Place. First thing, this shouldn't showed as a separate view point as this is comes under Holy Pushipatinah temple.I'm not the person who visit crematoria place, etc or it just wasn't my thing, but was so curious to see what exactly happening here after heard about this place in blogs and travel forums and via SM. When i was at this place there were two cremations taking place at the same time and it shows how Hindu rituals taken place after a death. with all the rituals it actually a 3-4 hours process. so i couldn't stay that long and walked away after few minutes. It reminds Varanasi (but here they don't put the body in river). After all, I wouldn't say it's a must see in Pushipatinah temple (temple is a must visit place) but if you are so curious about Hindu cremation, rituals, etc a must visit at your own risk.Mini Varanasi at a Powerful Place"
        }, 
        {
            "index": 97, 
            "rating": "4", 
            "review": "extraordinary. worth visiting for understanding the boundaries between life and death and for understanding hindu culture. Keep face masks with you"
        }, 
        {
            "index": 98, 
            "rating": "5", 
            "review": "A must see in Katmandu. If you only visit one or two places in Kat make sure this is one. Tourist tickets are 1000 rupees and a guide will ask for a matching amount but then settle for 600. It's a good way to give back and get a few insights that might otherwise have been missed. 30 minutes is plenty of time to see the area and you can stay longer to quietly watch the cremations from the visitor area across the river.They were performing a few cremations while I was there and I didn't experience the horrible smells or recoil in horror at the idea of bodies burning. It is a ceremony to move the Hindu deceased on to their next life. Yes there are people grieving and crying but ten minutes after the cremation starts everyone leaves and has had their closure. There are the tourists with the large lenses snapping away... yes annoying but it is 50 yards from the pyres and a given constant backdrop to the cremation ceremony. I snapped a few pictures and that was enough. There are millions of better pictures available... no need for more. Take a few minutes to sit and just be silent during the ceremony. Some people feel a great connection. I just think it is a very peaceful way to say goodbye in my eyes. No invasive embalming and viewings and caskets... just $10000 rupees and ashes to ashes."
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "Grizzly, but engaging too. It's an unusual place to visit. Bodies are usually cremated early in the morning before tourists with cameras descend on the place. You will see piles of ashes, smouldering pyres and wood ready for the next body. You will also be pestered by fake gurus and watch out for the monkeys!"
        }, 
        {
            "index": 100, 
            "rating": "4", 
            "review": "A must . Visit in Kathmandu. A glimpse into how the Hindus say goodbye to the dead. Great photo opportunities if done discretely."
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "A Sobering look at Hindu Culture - A Must See if you enjoy Authenticity !. This is absolutely a must see, although i can't help but thing that it is clearly dark tourism, and felt guilty all the way through watching a cremation. Most visitors will not realize that it is a working facility, and when we visited a cremation had just begun. The family were not concerned the slightest about anyone watching and being able to witness the deeply personal display of cultural grief is something I won't forget."
        }, 
        {
            "index": 102, 
            "rating": "4", 
            "review": "Very special . Besides the ceremonie there are a lot of beautiful temples surrounding it. Sadly there has been some damage due to the earthquake of 2015 but still very beautiful. Sadly I wasn't able to witness a ceremony so I advise to check with your hotel or guide to see when a ceremony will be."
        }, 
        {
            "index": 103, 
            "rating": "5", 
            "review": "Experience the Hindu cremation ritual. Cremations take place next to the Bagmati River on the grounds of the Pashupatinath Temple. There are many cremation ceremonies every day."
        }, 
        {
            "index": 104, 
            "rating": "5", 
            "review": "Flaming cremations. There were three cremations going on when we were there. Next to the fires were buckets of ghee (clarified butter) which is the fuel for the cremation. There are many wild monkeys in the area."
        }, 
        {
            "index": 105, 
            "rating": "4", 
            "review": "A unique and terrifying experience. If you can handle the smell and sight of dead bodies, then go for it, otherwise, you'd better do something else instead. I wouldn't say it's a must see in Kathmandu but if you are curious about Hindu cremation, visit at your own risk."
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "Moving. I was very surprised by how moving this place is. It is more moving than I thought it would be even though knowingly it is a place for mourning before visiting. Came here before sunset to see families mourn for their loved ones. Must see and be sure to give yourself plenty of time to just sit and observe. Try not to take a lot of photos out of respect for the families."
        }, 
        {
            "index": 107, 
            "rating": "5", 
            "review": "This is the same as the Pashupatinath Temple. Don't know why this is showed as a separate item as this is the same as the Pushipatinah temple. A must see if in Kathmandu as it is the most important Hindu temple in Kathmandu. Not for the faint of heart as it is a cremation place."
        }, 
        {
            "index": 108, 
            "rating": "3", 
            "review": "Fascinating, but strange viewing. We visited because we were in the area and thought it would be interesting, but it felt very strange watching people grieve and not knowing the people concerned. We didn't stay too long. The process of preparing the body by the family is very respectful and interesting to see, but it just wasn't my thing. There are market stalls outside selling jewellery, brass ornaments and the usual stuff too, so we enjoyed the walk around afterwards."
        }, 
        {
            "index": 109, 
            "rating": "5", 
            "review": "Unique experience at the Pashupatinath Temple area. Not for children or gawking tourists with cameras. This is a solemn place along the Bagmati River on the grounds of the Pashupatinath Temple. You will likely see a cremation ceremony, especially earlier in the morning. It is a religious ceremony and one should be respectful. There are buildings and small structures that you can take pictures of on the grounds. Avoid the monkeys, and if you want to take pictures of the 'holy men, they will expect a small tip."
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "Behind the Pashupathinath Temple- on river bank of Bhagmathi River- Funeral rituals as Hindhu customs. Most impressive , beautiful scene of funeral rites, on the bank of river Bhagmathi. It looked as if its a celebration - of funeral pyre of several mortal remains of people of Kathmandu."
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "Confronting but fascinating. This was confronting for many in our group but also fascinating. The fact that it is a working crematorium adds to the fascination."
        }, 
        {
            "index": 112, 
            "rating": "3", 
            "review": "Interesting but weird. I still don't know how to feel about this place, it interesting but is a crematorium. If you look past the weirdness, it good to help you understand the Hindu culture and part of the city that is Katmandu"
        }, 
        {
            "index": 113, 
            "rating": "3", 
            "review": "Unique Experience. Well, that was a unique experience as Americans are not accustomed to this. Probably not for the squeamish or young children."
        }, 
        {
            "index": 114, 
            "rating": "4", 
            "review": "Very special Place but not for every one. This place is very unique but if you sensitive for the smells- I don't recommend it.\nThe surrounding area is very dirty and filthy . It is special site but must prepare your soul to the view when hang around the burning platform . It is not an ordinary place to see."
        }, 
        {
            "index": 115, 
            "rating": "5", 
            "review": "Cultural Diversity. Seems like a ghoulish place to visit but the Hindu end of life rituals are very public and it's fascinating to watch and quite peaceful."
        }, 
        {
            "index": 116, 
            "rating": "4", 
            "review": "Smoke.... When they told us we will visit this place i was not sure i want to go there. But in the and i can say it is worthwhile."
        }, 
        {
            "index": 117, 
            "rating": "5", 
            "review": "Expensive, but well worth seeing. 1000 rupees for foreigners, but you have to make a special effort to walk into the booth to pay. I would suggest just trying to walk down the street, I don't think you'd be stopped. Really interesting to see. All the rituals involved in the cremations, which are constant. May not be for the faint hearted, as the cremations nearest the temple you can see dead people's faces."
        }, 
        {
            "index": 118, 
            "rating": "5", 
            "review": "Goos experience. Great experience to see that traditional habit. Something else from what we know and see. Must visit but on the other hand a bit difficult to watch that ceremony."
        }, 
        {
            "index": 119, 
            "rating": "3", 
            "review": "Interesting place to visit. Very interesting place to visit especially if you have a guide to explain everything you see. This is a Hindu area with plenty of souvenir stalls selling all sorts of Nepali things."
        }, 
        {
            "index": 120, 
            "rating": "5", 
            "review": "Loved this place . Entry fees was 1000 rs , you can see how the Hindu religion deal with the dead body after death ,Evening times you can see the dead bodies , u can take pictures , there is a lot of future tellers , hand reader etc. u can buy some nickels hand made , then u can access the main tample you are not allowed to use the camera but it's a nice place to have a look and see other cultures. 5/5"
        }, 
        {
            "index": 121, 
            "rating": "3", 
            "review": "Expensive tourist trap. The Crematoria is meant to be a very humbling spiritual place, however we felt it was being ruined by the hawkers. Foreigners have to pay 1000Rs to enter, and while it was interesting to see the culture and you can see funerals taking place (which is very interesting) there are many \"holy\" men trying to get you to take photos in exchange for money/vendors hassling you to purchase things."
        }, 
        {
            "index": 122, 
            "rating": "3", 
            "review": "It was an interesting cultural experience. It is worth seeing, but I'm not sure I would do it again. It is fascinating to see how they prepare the bodies for cremation."
        }, 
        {
            "index": 123, 
            "rating": "5", 
            "review": "weird place, strange experience but truely mesmerising and divine.. went with my partner and his friend. I was told its a temple and it was. but did not expect to have the first hand experience of seeing the cremation and it was done in the open air. the evening prayer however was very divine and relaxing. the view from the terrace facing the main temple is phenomenal."
        }, 
        {
            "index": 124, 
            "rating": "5", 
            "review": "An amazing place to visit. It seems to be OK to observe a cremation ceremony, be respectful and don't be like a crazy tourist taking lots of photos up close. I met a local guide he took me to the river side cremations and explained the temple. It can be an emotional visit, I saw a whole family say good bye to their mother, the smell of smoke and the crowds of visitors, it was a day I wont forget."
        }, 
        {
            "index": 125, 
            "rating": "4", 
            "review": "An intrusion?. This place is quite and so interesting, but when there is a funeral going on it feels as if the world is intruding on someone else s grief."
        }, 
        {
            "index": 126, 
            "rating": "5", 
            "review": "Strangely Beautiful…. Getting to see and experience the traditional Hindu cremation was quite an experience. It was \"strange\" because it is not something that I am accustomed too, but beautiful, because it is a centuries old tradition."
        }, 
        {
            "index": 127, 
            "rating": "5", 
            "review": "Great cultural experience. Got to go to view this site and experience a creamation via our tour company we booked with. So different how they deal with their death and preparations of the deceased. Reading about different cultures is good but, being there in person is somethings different altogether."
        }, 
        {
            "index": 128, 
            "rating": "4", 
            "review": "A Hindi ceremony.. It costs 1000 NPR to enter. AU$12. The area is quite large. As you walk along the path, you see the cement squares with wood on top. When I was there there was a ceremony for the deceased. It can be quite unsettling, but you have to remember that this is their custom. On one side of the bridge was quite an elaborate ceremony and on the other very basic. There was a total of 5 when I was there. Be aware that you do see the feet and face of the deceased and you do see the fires being lit. Once they do light, the body is covered with wet straw, so there is smoke."
        }, 
        {
            "index": 129, 
            "rating": "4", 
            "review": "The rule of life. I've visited this place several times but the place hasn't been empty once. If you're a scary person or dead bodies disgusts you, I suggest you not to go. However, watching the corpses burn and learning the truth of life was an interesting experience for me."
        }, 
        {
            "index": 130, 
            "rating": "3", 
            "review": "Creepy Place. The Crematoria is where the Hindus burn the bodies. When I was there, I witness bodies burning in front of my eyes; very creepy and morbid. This place is definitely not for family with kids. The only highlight of this place is the colorful persons hanging around the temple.Expect to paid Rs1000 or +/-$10.00 for entry."
        }, 
        {
            "index": 131, 
            "rating": "3", 
            "review": "A little weird for Western culture. Worth a visit as it is interesting to witness different cultures. The actual place is nice and it is worth a look around if you are in the area."
        }, 
        {
            "index": 132, 
            "rating": "5", 
            "review": "Worth the visit. If you have never seen anything like this before, it is well worth the visit to see this interesting cultural custom.\nBring a mask as the air is quite polluted with smoke in the area."
        }, 
        {
            "index": 133, 
            "rating": "5", 
            "review": "A bit weird but a must see. For European standards it is a bit weird to see the Nepalese's burning their dead bodies on the river but also a very interesting experience. There was a bridge over the river which the children used for taking a jump in the river which made the whole scenario a bit unreal but i guess it could be considered as the circle of life. The atmosphere offers both from sad to happy feelings."
        }, 
        {
            "index": 134, 
            "rating": "4", 
            "review": "Seems a little invasive.. Although the experience is interesting one has to wonder if invading the cremation of people's relatives is a little macabre. You will probably see a \"sadu\" or two around. I was told by the guide that these are not real ones but just men trying to earn a few rupees by posing for photos."
        }, 
        {
            "index": 135, 
            "rating": "4", 
            "review": "Quite an eye-opening experience. Our group happened upon a guide (he was selling items and since it wasn't busy, he started telling us what was happening at the riverside) and it really helped explain the procedure. I'm glad that I saw this part of Nepalese culture and I would certainly suggest it to other people. However, it is important to know what you are going to see - and be prepared for it. After saying that, there is much, much more to look at if you choose to 'miss' this area and enjoy the the temples and beauty in the area."
        }, 
        {
            "index": 136, 
            "rating": "3", 
            "review": "Visiting this attraction is a very personal choice. I happened on this site purely by accident.Perhaps a guide would have given me an in depth history and rationale of this Hindu funeral ceremony.Without this historical and religious information I was left with a bit bewildered."
        }, 
        {
            "index": 137, 
            "rating": "5", 
            "review": "This is a part of the Hindu culture.. Listening to a guide reveal the reasons for the funeral fires answers questions I didn 't know how to ask."
        }, 
        {
            "index": 138, 
            "rating": "5", 
            "review": "So Fascinating, But Strange At the Same Time!. This was so bizarre! You can sit and watch grieving families cremate their dead loved ones, which sounds quite sick, but it provides a fascinating insight into Nepalese culture and rituals.You can see the workers building the log platforms, washing the straw (to make it pure) then you see the family doing the final preparations on the body before it's set alight. Bizarre, but fascinating!On a side note, we weren't bothered by many beggars or hawkers here."
        }, 
        {
            "index": 139, 
            "rating": "5", 
            "review": "Impressive Hindu cememony. Watch the family of a recent decedent bring the body down to the river to be cleansed. Typically, the head and feet are washed by the oldest son (or oldest male relative), then the body is taken over to the crematoria. There, the body is wrapped in wood, lit on fire, and burned for approximately three hours. Afterwards, the ashes are shoveled up and tossed into the river."
        }, 
        {
            "index": 140, 
            "rating": "5", 
            "review": "Great. I was told i could go anywhere so I did (except the temple, oh and the army bit) I went and watched a few baby funerals and then a few full size adults,because I'm interested in that and it was fascinating, very.I ended up with a front row seat in fact, at one point all the mourners (there's not actually much mourning going on except by perhaps the main relative) moved themselves around me accidentally whilst they talked business as they moved away from the burning body I was completely in the middle of them all, nobody minded in the slightest.If you're not sure of how to behave at a funeral then i wouldn't recommend going in close but if you have some genuine compassion then go take look.I wonder if people on the other side of the river don't pay if they arrive from that side."
        }, 
        {
            "index": 141, 
            "rating": "4", 
            "review": "Fasanting. Such a weird place to be as a westerner, seeing the sad family saying goodbye to there loved ones. Not for the faint hearted.\nLots of wild life."
        }, 
        {
            "index": 142, 
            "rating": "4", 
            "review": "Interesting to know. I was curious about this place and my local nepali friend explained to me about the history, their culture & the lifestyle of people in nepal..my tip advice: bring small guide book with u, it will be useful to learn more"
        }, 
        {
            "index": 143, 
            "rating": "5", 
            "review": "Truly interesting. It was just so amazing to see what the people on nepal do with their their relatives. A must see. Just so surreal"
        }, 
        {
            "index": 144, 
            "rating": "4", 
            "review": "Dark. I was excited to get to know the place, had heard many stories and knew that would be incredible to see it. Got to know some Nada Saghu Hindu Holyman and be involved, get knowledge about different faiths and beliefs, but while I was there I felt sad, watch the ceremonies that happen there is sad. There was this dark energy around, there was too much fog in the air, especially when I visited (beginning of the year), there had been a lot of rain, the sky was dark, winds were strong, the water in the river is dark, its color is totally black and it just reminded me death."
        }, 
        {
            "index": 145, 
            "rating": "3", 
            "review": "Good with a guide. We went there and my wife was exception some wonderful temple to see. Unfortunately the pretty temple is not allowed for foreigners. The crematory part is interesting, there is quite a lot to know about it but you need a guide (or may be a travel book would do it?).We paid 500 ruppies and got 1H tour."
        }, 
        {
            "index": 146, 
            "rating": "5", 
            "review": "do not miss this. I was not prepared to stumble on this...there were 3 cremations on the go. Fascinating and quite civilized. Would be a great way to disappear someone."
        }, 
        {
            "index": 147, 
            "rating": "5", 
            "review": "Pasupatinath, is worshipped by Hindus all around the world.Hindus believed once life must visit for purity of spirit.. The Crematoria plate interesting story. Nepali Hindus believe, this body to be made of five elements (earth,water,fire,air and sky) However by burning the dead body they believe to send back the respective elements to theirs sources earth-ash,fire-heat, air-smoke,water-water and sky-soul these goes to nature."
        }, 
        {
            "index": 148, 
            "rating": "5", 
            "review": "One the great Kathmandu experiences. I have been here numerous times. Standing in front of a temple to the Karma Sutra you can look right, though an archway, where bodies are being cremated. The intricate ceremony, preparation of the body gives a telling insight into belief. Death as part of life. It can be a puzzling place, intense and deeply cultural. A guide is a good idea. Take a walk over the bridge and up the steps and walk towards the space where you can sit and look out over the whole remarkable site. Worth also visiting the ashram, and the adjacent old people's home. Non Hindus can see into the temple to Lord Shiva by leaving the site. On the left as you walk towards the entrance is a small room where there are physical representations of the first Hindus. Overall is not a disturbing place, although some find it so. More it is a place of contemplation and wonder."
        }, 
        {
            "index": 149, 
            "rating": "3", 
            "review": "Cultural experience. Went to the crematoria as part of a tour and didn't actually realise we were going there until we were there. The tour guide was fair blasé about the bodies being cremated and the funeral in progress while we were there. It's part of life there and it's good not to hide away from the realities of life when you're in a different country/culture."
        }, 
        {
            "index": 150, 
            "rating": "5", 
            "review": "A Must See In Kathmandu. A experience that touches all of your senses. Something you will never forget. No more than an hour is plenty of time to spend."
        }, 
        {
            "index": 151, 
            "rating": "5", 
            "review": "Different Feel from Varanasi. Viewed a cleansing of an older man and preparation for cremation. The people are open to outside viewing which provided an excellent education about the rituals. Very moving!"
        }, 
        {
            "index": 152, 
            "rating": "4", 
            "review": "Cultural experience. Observing how Hindu people are performing their ancient rituals and sending farewells to their loved ones-unforgettable. I was observing quietly and did not want to impose. I have mixed feelings of other 'tourists' taking pictures of the dead ones as they were some kind of tourist attraction..."
        }, 
        {
            "index": 153, 
            "rating": "5", 
            "review": "A fascinating glimpse. This was a really great opportunity to see a Hindu ceremony in process while maintaining a respectful distance. The guide we had was able to explain everything and enhanced the experience."
        }, 
        {
            "index": 154, 
            "rating": "2", 
            "review": "A wonderful sight ruined by being over run with sadus, beggars and hawkers. I have been here before many years ago and then it was a surreal, mystical place, where, being a tourist meant showing respect for those creating their dead and sharing the wonder of the temples so I was very disappointed to find, today it is now a crazy tourist trap where, although those saying goodbye to their loved ones are still there, anyone choosing to visit is likely to be hassled to the point of craziness for money, to buy tat or to have a \"blessing\" from a sadu for cash.I lasted about an hour and then I had had enough. The taxi driver on the way back explained that these sadus are not real ( they are simply Indian people who have come here to dress up as a form of begging) and that nearly all the people selling stuff and begging are Indian too. I must say, I have never come across Nepali people as pushy or intimidating at all, so I have no reason not to believe this is the case. Tourists beware - it is an amazing place but to be avoided if you don't want a constant stream of \" in your face\" begging. What a shame as it is supposed to be holy place and for the local Nepali people who are there to grieve it must be a horrible thing to have to witness."
        }, 
        {
            "index": 155, 
            "rating": "3", 
            "review": "Sad reminder of the cycle of life at Pashupatinath complex. An interesting but sad reminder of our inevitable destiny. Although worth seeing, may not be for the faint-hearted although our teenager had no problem. Walking amongst the grieving families was not pleasant. One just needs to give them some privacy."
        }, 
        {
            "index": 156, 
            "rating": "5", 
            "review": "Where the pyre burns. On the banks of the river, there is a certain chill and also calmness. You see hindu dead bodies being cremated to ashes. Very photogenic place and also surreal."
        }, 
        {
            "index": 157, 
            "rating": "4", 
            "review": "Facinating open air creamatory. Never in my life did I expect to see bodies of the deceased put on stretchers over a roaring fire and burnt until the body disintegrated in flames, but that is exactly what I saw at the Crematoria in Kathmandu. Very interesting to see how the fire is built and straw is washed before adding it to the fire so as to be pure. The cremation that happens before the eyes of loved ones. The final honor; the final exit. You can't help but be affected by the ceremony, next to the river, out in the open. So in tune with how we live our lives."
        }, 
        {
            "index": 158, 
            "rating": "4", 
            "review": "Historical Place to visit when you are in Nepal. Definitely a excited historical place in Kathmandu and one must see its history. Excellent for photography."
        }, 
        {
            "index": 159, 
            "rating": "5", 
            "review": "A very interesting insight into the local culture. It was fascinating to watch the funeral ceremony and the cremation process and to see the different ways different cultures deal with grief."
        }, 
        {
            "index": 160, 
            "rating": "5", 
            "review": "Fascinating. An insight into the Nepalese culture and the ceremony around death. Quite a lot to look at around the complex."
        }, 
        {
            "index": 161, 
            "rating": "2", 
            "review": "Cultural site, but foreigners are out of place. The reason I travel is to see how other people live. I enjoy experiencing the culture, the food, and the people. Even though The Cremotoria is a place where the dead are put to rest, I thought it would be beautiful to see how the Nepalese say goodbye to their lost loves, see what kind of rituals they have, and to witness their views on death but I didn't feel peace when I was there. Watching families cry in pain on the river bank, watching their deceased burn, in the open public felt wrong. It felt as if we were invaded a sacred private moment, the last moment people have to their mothers, fathers, sisters, brothers, cousins, and friends. There is little steps set out into the river bank and there burning stations about every 20 feet, so cremations are going on right next to one another. Aside from the act of the cremations, there is beggars, homeless, hustlers, and creeps.. Everywhere! Every step you take theirs either someone trying to relentlessly sell you something, peeing in public, following you for money, or sleeping on the floor next to you. It felt invasive in the first place to be at funerals uninvited, but the loitering crowd that hangs out around there made us feel uncomfortable, unsafe, and unsettled. If you see pictures of this place I feel like that would be enough for you. But if you really must go experience this for yourself, just be on guard."
        }, 
        {
            "index": 162, 
            "rating": "5", 
            "review": "A solemn and mystical place. We were dropped off here to spend an hour by our driver. We wer approached by a young man who offered his services as a guide. He stated that we could pay him any price depending on his level of service. Now this is not an authorised guide as you get at some locations. He was not only informative but very friendly. He took us places we would not have known about and explained the ceremony and all the buildings in the area and their significance. A little history on the Hindu religion so we could understand some of their ceremonies and figures.I was going to turn him away but I am so glad we did not. Turned out to be a very interesting time in a special place"
        }, 
        {
            "index": 163, 
            "rating": "5", 
            "review": "Deeply moving way to say farewell to your loved ones. This crematorium is a very open affair. You can see the grief and the sombre nature of the whole process as the deceased is prepared and then burnt."
        }, 
        {
            "index": 164, 
            "rating": "4", 
            "review": "Something different to experience if you haven't before. This place shows how life and death are integrated into everyday living. It's something different if you haven't experienced anything like this before, but some people may find it disturbing as the bodies are carried to the fire. It is a very natural place."
        }, 
        {
            "index": 165, 
            "rating": "4", 
            "review": "Good experience . One of good experience to see Nepalis do cremation of the dead bodies. The tradition and religion of the locals, the river where they throw the stuff after procession, stupas after the bridge and walk through garden till the end of the site. Lots of stairs and hilly path. Big area to see by walking. We took taxi to reach this place. Worth to visit in Kathmandu."
        }, 
        {
            "index": 166, 
            "rating": "5", 
            "review": "unerals. on the day that we visited there were 5 funerals.....taking place unlike India you can take photos across the river.....found it a moving experience"
        }, 
        {
            "index": 167, 
            "rating": "5", 
            "review": "Place of Reflection and Cultural Fascination. Like my review of the Pashupatinah Temple, I saw this first on National Geographic's \"Taboo\". The crematorium is a religious area so forgive the smell of cinders and burning sulfur (human remains). Bring a good guide to explain the fundamental details such as what the Bagmati river represents, what the cremation intends to fulfill and the like. Days prior my visit my friend died so this tour offered me the PERFECT opportunity to pray for her soul. I asked a Holy Man to perform the Shradh Ceremony on me on her behalf and we did it at the foot of the river. It was an enlightening, emotional experience. Since the water is polluted with burned human remains it's a biohazard so I had to clean myself up a lot when I got to the hotel but the experience was worth it and I hope the ceremony has served its purpose and brought my friend safely to the afterlife."
        }, 
        {
            "index": 168, 
            "rating": "4", 
            "review": "To remember the dead. It's a religious place to visit. You cans see dead people burning ( cremation). For me to go to this place, make me remember we will dead as human being, so before we die make our life useful."
        }, 
        {
            "index": 169, 
            "rating": "4", 
            "review": "Very special place where hindu people cremate their family. For just a minor fee you get acces to an attraction not seen in the Western world. 24 hours a day, hindu families cremate their deadline love ones on the river bank. Theres constantly a lot activity going on, bringens dead people in and arranging new wood fires for the cremation.The fire has to be started by the oldest son or if no son, the oldest male relative. This person has to shave his hair of and dress in White and touch the river with his feets.You are able to watch the scenary as long as you like, from the riverbank opposite to the cremation area. The Big hindu temple only allows access for hindu people.Great place to visit and absolutely a must see in KTM."
        }, 
        {
            "index": 170, 
            "rating": "5", 
            "review": "Shocking then get to used it.... When ypu see the first time , the smell and view are really shocking and you think it is not real. But after a while, you see people how they have belief and praying , you feel difference. İt is really interesting experience but i strongly recommend you to see different side of nature and humanity..."
        }, 
        {
            "index": 171, 
            "rating": "3", 
            "review": "Smokey, dirty,and kinda sad. Watching folks bringing their loved one and then walking the ritual surrounding a cremation was interesting but it was sad to see so many dead bodies being brought for cremation. It was also sad to see that the dead were burning out in the open each having their own bonfire. Having a mask helped with the smoke and air pollution."
        }, 
        {
            "index": 172, 
            "rating": "5", 
            "review": "Full cultural experience.. Our guide took us to this place as part of the tour. We took baby steps going in. But after the initial emotional response, settled in to watch this ancient ceremony sending the dead to their new beginnings. We become a spectator, showing respect by not talking very much or taking too many photos. Colorful Brahman priests were present. Monkeys were also in attendance. The dead are covered in ceremonial garments and adornments. Logs cover the body while being cremated. There are no views that should disturb anyone who might be sensitive. The feet were visible, during the bathing process, which bothered my friend. The river, where the ashes are sent, was naturally polluted. The man with no legs lying in the road as we left, begging, was more eye opening than the cremations. A visit will add more to the Hindu experience than food or monuments."
        }, 
        {
            "index": 173, 
            "rating": "3", 
            "review": "Odd experience. We walked there from Thamel and got to see some local living, which was nice. The place itself was a little confusing. There were multiple areas we weren't allowed to go as we were not Hindu. These were not always clearly marked so we always felt like we were trespassing. There were a lot of people hanging out there and some of them were fairly disrespectful to the temples and visitors. Other than the crematorium area there are some buildings to look at when you walk around. Not sure if it was worth the money but I guess an interesting cultural experience."
        }, 
        {
            "index": 174, 
            "rating": "4", 
            "review": "Hindu tradition. This was very interesting as our guide was Hindu. He explained the responsibilities of the family during this time and we witnessed the whole process"
        }, 
        {
            "index": 175, 
            "rating": "4", 
            "review": "open crematory !!. next side of main pashupati temple , this crematory situated. most of the hindu people of Kathmandu would like to be cremated when they die. result of this crematory is pollution in the river Bagmati."
        }, 
        {
            "index": 176, 
            "rating": "4", 
            "review": "A must to view Hinduism: temple and the crematoria. Outside of India, the temple and the crematoria is one of the oldest religious sites in Nepal. As long as you are respectful, viewing the cremation is not a problem,. Be sure to walk to the front of the temple on the side of the river. To see the Golden Bull, go the left of the temple."
        }, 
        {
            "index": 177, 
            "rating": "4", 
            "review": "Interesting insight into Nepalese culture. Definitely worth the entry price, and to get a guide to talk you through the tour was great as I was told many things about the history and goings-on that I would otherwise have no idea about. An eye-opening eperience to see beggers sifting through human ashes while fresh bodies are prepared for cremation."
        }, 
        {
            "index": 178, 
            "rating": "4", 
            "review": "Surreal, somber experience.... We spent several hours strolling Pashupatinath. The Crematoria was a huge skew to our cultural norms. We couldn't believe what we were watching. It felt a bit awkward being voyuers to all this grieving, but at the same time, perhaps comforting to to the mourners. There were many pyres being prepared and many funerals in progress. Go see this. Be careful to be respectful."
        }, 
        {
            "index": 179, 
            "rating": "5", 
            "review": "Interesting. It was interesting to observe the ceremony. not for the faint hearted as you do see things and nothing is hidden"
        }, 
        {
            "index": 180, 
            "rating": "5", 
            "review": "high spirits place. a very emotional place , where you feel surrounded by life and death at the ame time, in a simple , spiritual and emotional way. Mourners carrying bodies and visitors watching, sâdhus waiting to see tourists and monkeys playing with ashes in the river."
        }, 
        {
            "index": 181, 
            "rating": "5", 
            "review": "The cremation site. It is a part of Nepalese culture. It is worth visiting. I felt uneasy though, because there were cremation rituals taking place when I was there.Besides, there were lots of locals spending their time there just sitting and watching"
        }, 
        {
            "index": 182, 
            "rating": "5", 
            "review": "A must see to understand culture. Although not typical for a tour, visiting this crematoria with a knowledgeable guide certainly adds character to a cultural experience."
        }, 
        {
            "index": 183, 
            "rating": "5", 
            "review": "Hindu temple, Buddhist Shrine and Cremation site. It is hard to review such a place as excellent. It is first and foremost a place of mourning. The cremation site is used by both Hindus and Buddhists and it is a very sobering sight.The temple complex is large and walking around you can meet Sadhus who do not speak but are happy to pose for you for a few dollars. Buddhist sages have also lived there in the past in a series of small caves along the river. In front of the river, there is also a hospice where dying people are cared for.This is not the sanitized western version of death but it is a very human one. All in all, for me, it is a magical place but it may not be for everyone. When I left Kathmandu last April a few days after the earthquake, my last image was the burning pyres of Pashupatinah. This is why I am going back this fall and will visit this place again."
        }, 
        {
            "index": 184, 
            "rating": "5", 
            "review": "A quick but interesting visit. A very sombre place but when explained is much more spiritual than it would first appear. Lots of smoke but doesn't smell as bad as you would think. An enlightening place"
        }, 
        {
            "index": 185, 
            "rating": "4", 
            "review": "It's a solemn place.. A person, possibly a priest, was preparing a pyre while I was there, complete with festoons of yellow flowers, with straw and wood under a canopy. Then he lit it and helped it spread. Later he stoked it with a bamboo pole. There are a number of onlookers, probably family, but also some curious. It's a solemn place."
        }, 
        {
            "index": 186, 
            "rating": "4", 
            "review": "place to think about life. that's real crematorium, you can see died bodies and how they are burning, to feel this smell. I had feeling of dyrtiness all the time and after visit had feeling that all dress soak up the smell of burned bodies. Atmosphere is like in any crematorium with additions of dogs and monkeys running along burning bodies."
        }, 
        {
            "index": 187, 
            "rating": "4", 
            "review": "Fascinating cultural site. Personally, it was a bit overwhelming to see the whole process so close. There were a few families occupying burning sites, and others that allowed the dead's feet to be submerged in water (so that their souls can travel with the river) before the procedures took place."
        }, 
        {
            "index": 188, 
            "rating": "5", 
            "review": "Fascinating. Very intriguing visit to see live funerals happening right in front of you. Our guide took us through the ins and outs of what happens and why etc etc."
        }, 
        {
            "index": 189, 
            "rating": "4", 
            "review": "Best seen from behind pashupati temple. Although non Hindus are excluded from entering the actual temple, we are able to climb the hill from behind the temple to view the ghats as well as the beautiful pashupati pagoda temple. It is peaceful and a bathroom is available for the public."
        }, 
        {
            "index": 190, 
            "rating": "5", 
            "review": "patshupatinath. Try to visit this place very early morning time, you discover the real life to nepali people and in this early time, not so much tourists,you stay from 6 am to 11 am or more, so many things to see this place is almost the more old place from kathmandu valley"
        }, 
        {
            "index": 191, 
            "rating": "2", 
            "review": "The Burning Ghats at Pashupati Temple. Personally, I have never understood the interest of the casual tourist in the burning ghats at Pashupati Temple complex. The practice of standing across the river from the ghats and photographing the funerals, for that is what the cremations really are, with long distance lenses, I find abhorrent. Would we want people from a foreign country witnessing our grief at the loss of a loved one? These are private moments and should not be used for personal titillation."
        }, 
        {
            "index": 192, 
            "rating": "5", 
            "review": "Worth the trip. Extremely interesting excursion - I would recommend enlisting the services of a local guide (we were able to find someone at the entrance). They often work for tips, so plan accordingly.I was impressed at how many areas were open to the public - it's quite an incredible place and not one to be missed!"
        }, 
        {
            "index": 193, 
            "rating": "4", 
            "review": "An interesting area to visit. The crematoria is at the bottom of Monkey temple and is definitely worth the visit. Despite the sad circumstances (you will see cremations occurring) it is an interesting place to visit and learn about the Hindu faith and what families do and how they cope during death of a loved one. You will see and hear families mourning, see cremations happening, see the young boys who work there. It is not as gruesome as it sounds! And the Monkey temple that it is a part of is beautiful too."
        }, 
        {
            "index": 194, 
            "rating": "4", 
            "review": "Interesting for people of all ages. Went here with our three children, and we all came away moved by the experience. It was fascinating, and yet hard to watch at the same time. We did have a hard time breathing the air there - the smoke was pretty thick in some areas and made a few of us feel sick."
        }, 
        {
            "index": 195, 
            "rating": "4", 
            "review": "Buddhist and Hindu rcremation. A fascinating glimpse of the rituals and traditions which accompany a cremation in Nepal- with the open air ceremony very different to what is experienced in the West"
        }, 
        {
            "index": 196, 
            "rating": "5", 
            "review": "Fascinating place.. I spent a fair amount of time with Bishnu and Kunjan (staff at Hotel Thamel). Three cremations were in progress when I was there, and we saw several more funeral processions during the day. Recommended for the culturally minded. Perhaps too disturbing for small children. But it is an important aspect of Nepalese life. Fascinating, truly."
        }, 
        {
            "index": 197, 
            "rating": "5", 
            "review": "Very interesting. My son and I are always up for something a bit off the beaten path.Cost was 1000. Guides are extra. Of course you don't hire them they just hang out with you and talk and talk. Eventually, they say if you're satisfied you can give some tips. But the price is up to you...sort of. Our guy was ok, but not special...he wanted $40US for a \"tip\". He didn't get it and was quite offended...Still, having a guide is helpful to explain what you're seeing. There are frequent cremations so you'll almost certainly see one. It is quite dis inverting to realize how fresh the grief is that you're seeing...usually the death is less than 24hrs earlier. Still, they charge a fee to enter so you're free to watch and photograph.Most of the hermits which want you to take their ok tyre are fakes...but their dope is not! The real hermits are hidden away, but your guide will show you if you wish. The real ones ignore you and don't care if you take their picture.Our taxi waited for us, cor this service he wanted 200 even though we didn't ask. He didn't get it either. The main road is only ~1km walk so taxis are easy to get."
        }, 
        {
            "index": 198, 
            "rating": "5", 
            "review": "Definitely worth it. Definitely worth a visit to see this rich cultures way of celebrating death, be careful of the monkeys they are not very friendly!"
        }, 
        {
            "index": 199, 
            "rating": "4", 
            "review": "Morbid fascination. Its just interesting to see how othere cultures deal with death. This is all out there in the open andbeing dealt with"
        }, 
        {
            "index": 200, 
            "rating": "4", 
            "review": "Macabre yet interesting. This was en eye opener into Nepalese culture with several pyers burning bodies upon our visit. It felt invasive being able to witness a family's grieving so openly for all to see but was interesting to gain some insight into Nepalese funeral culture."
        }, 
        {
            "index": 201, 
            "rating": "4", 
            "review": "An unforgettable experience. This is the first time I saw the cremation ceremony in Hindu traditions. I believed that I had to visit India for the experience, but I could finally get to it in Nepal. There were English speaking guide, whom would approach you when he identified you were tourists, and actively provide service of explaining the tradition of all kind of ceremonies. And this is not included in the ticket."
        }, 
        {
            "index": 202, 
            "rating": "4", 
            "review": "Very special.... This is where you enter right into the hindu funeral ceremony, their beloved ones are decorated and after that placed on a pile of wood to be burned and ashes thrown into the (somewhat dirty) river below. Lots of monkees jumping around all over the place. It feels kinda \"strange\" to be a spectator."
        }, 
        {
            "index": 203, 
            "rating": "4", 
            "review": "Exploring Mortality. visiting the cremation ghats at Bagmati river close to Pashupathinath temple is an opportunity to reflect on death, dying and mortality. There is also a hospice close to ( actually opens to) the crematoria, were people come to die in the terminal phase of their life"
        }, 
        {
            "index": 204, 
            "rating": "3", 
            "review": "Fascinating. The ceremonial crematoria is a fascinating look at the Hindu culture. A guide helps explain the nuances of what is happening and how the castes are treated."
        }, 
        {
            "index": 205, 
            "rating": "5", 
            "review": "Go beyond checking the box. How a society handles the dead is an integral part of how it lives. Tourists thrust into the crematoria to see how the Hindus dispose mortal remains can make this experience a bit jarring - if you are not accepting of death and live in denial, this may not be the place for you. Picture being taken to cemetries of any other faith and you will see that it is the same experience that you would get. For non-Hindus, this is the closest you get to Pasupatinath Temple. Spend some time contemplating on death and the inevitability of it in human life."
        }, 
        {
            "index": 206, 
            "rating": "4", 
            "review": "Be Ready For This. My wife and I visited during our 25th Anniversary Tour of India and Nepal. Whilst it seems a strange place to visit we wanted to experience all what this culture has to offer. On entering the facility we were filled with apprehension. However after a short time, and the senerity and calmness of everybody we really started to understand. We saw many families saying goodbye to their loved ones by firstly washing the deceased face, then moving them to the cremation. No outpouring of grief was experienced just a calm and loving goodbye. a very dignified ending. Take some time to meet with the 'holy men' in their 'temples' opposite and have great photos taken . We left feeling relaxed about what we had seen. But I guess not for everybody, but dont be concerned about visiting..."
        }, 
        {
            "index": 207, 
            "rating": "5", 
            "review": "After Death Process !!!. Mind Blowing and Thrilling !!!My Spiritual yatra to Mount Kailash was turned in to 10days tour to Nepal from 24.09.15 to 02.10.15 due to non availability of permit from Chinese government, I went to this thrilling crematoria on 25th September 2015 after have Blissful Darshan of Shree Pasupathinath ji, this place is adjacent to Pasupathinath temple and on the banks of Bagmathi river, 11 dead bodies where burning on that day, it was a mind blowing activity.Must visit for all age groups when we are in Kathmandu, please experience this experience for the experience sake.Thanks a lot for everything,Loving you so much,Peacefully yours,S M Bega Raaj.Happy travelling..."
        }, 
        {
            "index": 208, 
            "rating": "3", 
            "review": "Fascinating !!. It was very strange and a bit disturbing seeing the Crematoria. A bit disturbing in that it seems a huge invasion of privacy for the families who have lost love ones , but a fascinating insight into the Hindu culture !!"
        }, 
        {
            "index": 209, 
            "rating": "4", 
            "review": "Interesting to watch. The crematorium is an interesting area. You will see families mourning their family member and then carrying them over to the area to be cremated. They put them on one of the cement slabs by the water, where there can be people in the water fishing for coins that have been thrown in, and they cover them with stalks and start burning them. Afterwards they spread the ashes into the water. It was quite somber, and interesting to watch all at the same time."
        }, 
        {
            "index": 210, 
            "rating": "5", 
            "review": "Fascinating - if a bit macabre.. Different religion - and different rituals. Take it all at face value, and (if you can) have a guide who can tell you what is going on. The buildings are a world heritage site - but everyday life (& mainly death) is transacted there by everyday Nepalis. Look out for the holy men and the monkeys."
        }, 
        {
            "index": 211, 
            "rating": "5", 
            "review": "Like a movie. Once in a lifetime experience that makes you want to become an anthropologist and understand better the ritual processes. DO NOT MISS!"
        }, 
        {
            "index": 212, 
            "rating": "3", 
            "review": "30th Anniversary Trip. We found it interesting and similar to the events in Varanasi. It was a different visual perspective because you look down towards the crematorium. The huge temples surrounding and the bussle of the people had us just sitting for at least an hour people watching.\nGreat thanks,\nMax and Lora Collins"
        }, 
        {
            "index": 213, 
            "rating": "5", 
            "review": "Somber. Not for youngsters, faint of heart, etc. This can be very emotional. Cremation is the customary way of disclosing of the earthly body in Nepal. A friend brought us here. He had arranged for university student studying anthropology to be our guide. Just part of the tourist economics in Nepal. People make their own arrangements. We were fortunate.The site is split by a river. On one side is were the the family of the deceased goes through the ritual process preparing the body for cremation and the actual burning takes place. On the the opposite side are the tourists, monks, holyman and boys, and observers. There are a number of sites along a wharf like restraining wall where each cremation takes place. There a number in process in different stages. Our guide told us that the cremation can take 7-8 hours to complete.After the fire has consumed the remains the ashes are pushed into the river. The site bisected along the axis of the river into the royal and rich section, up stream and the economy section (lower cost). It was an emotional experience, you felt like you were intruding on a private matter and you were. Family members were very emotional and outgoing, oblivious to all of the people watching from the other side of the water.The holy men an boys were pure carnival. Their elaborate makeup, clothing, and antics made for good theater and seemed out of place. They want to be paid for everything. Using my 300mm lens to record a group of these men that appeared to taking a break and talking, seemed innocent until one spotted me and they all started running to close the 100+ feet wanting to be paid. I shook the first ones hand and then showed them a picture of a monkey on a rooftop I had taken earlier. I felt like I scammed the scammers.We thanked our guide and gave him the aged upon gratuity."
        }, 
        {
            "index": 214, 
            "rating": "5", 
            "review": "Educational. We went around with a guide who was a Hindu Indian and was very informative. I would highly recommend paying a guide to explain what was going on, it enhances the experience. Good experience."
        }, 
        {
            "index": 215, 
            "rating": "5", 
            "review": "Most someone take photos on a site like this?. Everytime, like in Varanassi, we ask ourselves the same question. Although the answer always is yes, we do not feel really comfortable. For us it is not necessary to say more."
        }, 
        {
            "index": 216, 
            "rating": "4", 
            "review": "Interesting and thought provoking. As a westerner, it is a very unusual sight to see bodies burning at the side of the river, and I wasn't quite prepared for it.But this is most certainly an experience and I think it's good to understand other cultures and see how they mourn their dead. Very sad to see, but it's something I will remember forever."
        }, 
        {
            "index": 217, 
            "rating": "4", 
            "review": "Very different. For people from our back ground the sight of cremations in public was an interesting sight.It was not our right to judge a religous practice that is centuries old. You will have to judge the specticale for your self!!!"
        }, 
        {
            "index": 218, 
            "rating": "4", 
            "review": "Very sad but beautiful.. I had watched a Documentary on Hinduism and the cremation ceremony not too long before visiting Nepal. However, nothing will prepare you for it. Watching the family of the 3 year old girl, washing her lifeless body and pouring holy milk in to her mouth, was very upsetting yet very humbling. The ideology behind the whole ceremony is truly beautiful."
        }, 
        {
            "index": 219, 
            "rating": "5", 
            "review": "A Unique/Rare Experience. This religious ceremony is very foreign to westerners. It reminds one, how different cultures can be. The loved one's body is wrapped, then carried to the readied-platform and covered in flower garlands. Rituals are performed before the body is covered in straw and lit. After 2 or 3 hours the ashes are washed into the Holy River."
        }, 
        {
            "index": 220, 
            "rating": "4", 
            "review": "Very interesting Hindu temple. This is a very interesting Hindu temple, Pashupatinath. It is considered one of the holiest Hindu temples and is the main temple in Kathmandu.The people are dipped in the Bagmati river, which is extremely polluted, and then cremated. You should dress respectfully. You will see the ceremony from the opposite bank quite clearly. It is the main cremation place for Hindus so there is almost always a creation taking place. Non Hindus do not get access to the temple. Sometimes there is a charge of 1000 Nepali rupees and sometimes not."
        }, 
        {
            "index": 221, 
            "rating": "4", 
            "review": "Local Customs. An intrinsic part of life in this culture - a moving experience, they are building a crematorium nearby the avoid the pollution, but something will be lost when that is in use."
        }, 
        {
            "index": 222, 
            "rating": "2", 
            "review": "Fascinating slice of life. But not foreigner friendly.. Bodies burn while mourning family and brightly clad sadhus watch. Unfortunately there is a charge for tourists, and if your are not from the Indian continent, forget about the main attraction. Pashupati Nath temple is off limits to foreigners, so the tourist fee is wasted. The river is also terribly water polluted, as is the air in all of Katmandu. Better to leave this site to the locals. :-("
        }, 
        {
            "index": 223, 
            "rating": "4", 
            "review": "It is inside Pashupatinath Temple. A good location or a must visit for the Hindus...may not necessaries for none Hindus..May be good to explore more.."
        }, 
        {
            "index": 224, 
            "rating": "5", 
            "review": "Must see and experience. It is privilege to be allowed to see and share in this experience. The grounds are laid out so you see the repetition, the continuing on, and it brings such a meaning to this powerful place."
        }, 
        {
            "index": 225, 
            "rating": "5", 
            "review": "Interesting and unsual. macabre for a westerner but extremely fascinating, a favourite place to visit to fully be engaged in another culture and religion. one tip: please dress respectfully since you will most likely be watching a funeral and the crematoria is open air so do have your clothes washed afterwards because they do end up smelling like the funeral smoke."
        }, 
        {
            "index": 226, 
            "rating": "5", 
            "review": "My favorite place in Kathmandu. Most quite, calm and high energy place which I ever visit. All time when I'm in Nepal I'm going to that temple... Just to think, relax... may be kind of meditate... There two parts which is divide by Bagamati river. One part where is Shiva Temple - if you are not hindu, you anyway can't go inside, and place for cremation... where is very hard to be. And another part with stupas. Bright side. It's like hell and paradise... Full power!I can recommend to go there at night with many reasons: 1. There no people, no tourists, no sellers, no fake-sadhu. Just almost nobody. Dogs, monkeys and may some cremations... You can seat and think about eternally. 2. At night time visit of Pashupatinath is free ))Enjoy!"
        }, 
        {
            "index": 227, 
            "rating": "4", 
            "review": "The mystical and spiritual Hindu cremation site in Kathmandu. On the banks of Bagmati River (a tributary of the Ganges River), at the Pashupatinah Temple (a temple dedicated to a manifestation of Lord Shiva), you will find the holy cremation site of Kathmandu. The temple is barred to non-hindus (as most of them are), but cremation rituals can be seen from the opposite bank. Dress properly and show respect. The cremation rituals are very impressive, offering a unique opportunity of understanding the Hindu faith.I visited Kathmandu on February 2015, nearly two and a half months before the terrible earthquake that devastated Nepal. Recent reviews by fellow travelers state that \"The Crematoria\" operates normally."
        }, 
        {
            "index": 228, 
            "rating": "4", 
            "review": "Local Crematoria. Very Unique how to see the body crematoria, before put into fire they wash it out and clean by Bagmati river as symbol, bring your masker because of the dust."
        }, 
        {
            "index": 229, 
            "rating": "4", 
            "review": "Peaceful and educational. For those who are not familiar with Hindu customs, this is a wonderful place. Not at all what one imagines. Best to have a guide with you."
        }, 
        {
            "index": 230, 
            "rating": "5", 
            "review": "Highlight of the trip.. Wow...You can view the ceremony as it is happening, it's kind dark yet beautiful at the same time. Definitely something worth experiencing"
        }, 
        {
            "index": 231, 
            "rating": "5", 
            "review": "AMAZING SIGHTS. Most westerners have to stay on the opposite bank of the river as the far side is off limits to non Hindus - the views are great even though it can be a little macabre to see bodies being burnt - I put my camera away out of respect and just wanted to remember what I saw"
        }, 
        {
            "index": 232, 
            "rating": "5", 
            "review": "Serene. This is an experience you should indulge. Actually seeing a cremation ceremony. The body will be cremated by the river bank."
        }, 
        {
            "index": 233, 
            "rating": "4", 
            "review": "Cultural shocks!. Excellent cultural introduction for your foreigner friends! This views of cremation of Hindus rituals is life time experiences as they are shockingly different. Some of friends are astonished from the rituals and also some of them very shocked too."
        }, 
        {
            "index": 234, 
            "rating": "5", 
            "review": "Be respectful and if you're non hindu, don't expect to be let in.. Not a place to be taking pixs! Considered one of the holiest places for Hindus, this is where many of them come to die. They are burned here on a pyre and the ashes let into the Bagmati River where it meets the Ganga river in India. Non Hindus are not allowed inside because many of them eat beef, this is by the temple of Lord Shiva. Come and observe but be respectful!"
        }, 
        {
            "index": 235, 
            "rating": "5", 
            "review": "Cremation on the bank of holy river. went yesterday with a friend from USA. It is actually a place where we get knowledge of our life and reality. It might be new for the people from other parts of the world cause dead bodies are cremeted in the bank of river with firewood."
        }, 
        {
            "index": 236, 
            "rating": "5", 
            "review": "The Circle. These are not an attraction and i am not comfortable comparing Pasupatinath on the Bagmati with Benares on the Ganges. Both rivers are considered suitable holy rivers for the ashes of beloved family members to be transmuted into the incorruptible and be born away by the river to the vast Ocean waters from which we came. It is emblematic of the consciousness leaving the physical body and merging with the Super Consciousness which we are told never dies because it was never created. It simply IS, and we are a part. Many cultures and religions use this method of dealing with the human vessel of the consciousness especially in areas where the ground is too hard by sun or ice-.This method gives a sense of completion on many levels. The family is able to give their attention to the deceased,and fulfill the necessary religious rituals.This advances the process of grieving and allows healing of the mind and emotions to commence. I had become ill in Deli and flew to the nearest bathroom.There was a large rat there with the longest yellow teeth I had ever seen. Our eyes met. His were hopeful +gleaming. I got the message. \"So why are you here?\" he was telegraphing \" Get on with it.\". Suddenly i felt better."
        }, 
        {
            "index": 237, 
            "rating": "4", 
            "review": "A bit disturbing but interesting. A bit of a disturbing element of Hindu culture, but worth seeing - you look at the ceremony from a distance, so there's little chance of you seeing something that would turn your stomach upside down. Surprisingly, you can take pictures."
        }, 
        {
            "index": 238, 
            "rating": "5", 
            "review": "Must See. This was an amazing experience to learn more about the Hindu religion and their beautiful rituals after death. Unlike Varanasi, you are able to take photos of the cremation process."
        }, 
        {
            "index": 239, 
            "rating": "5", 
            "review": "Very fascinating, yet emotional!. What a different experience! You can feel quite uncomfortable and emotional being able to openly watch how this culture handles death, yet you cant help but be very intrigued. Being able to see and respect other ways of dealing with death is an eye-opener!"
        }, 
        {
            "index": 240, 
            "rating": "5", 
            "review": "Deep experience. Much rawer than Varanasi, people here much more emotional, and the experience is totally different. Here you are allowed to take pictures, but not get close to the cremations..."
        }, 
        {
            "index": 241, 
            "rating": "5", 
            "review": "Cremation Ghats at Pashupatinat. Fascinating and pretty basic. Health to see the reality of life and death all at a glance. be respectful... it is a Holy place to many people and should be treated as such."
        }, 
        {
            "index": 242, 
            "rating": "4", 
            "review": "Not for the faint hearted. Totally amazing experience, watching a custom so out of my normal boundaries!\nSad, feeling I should not be here, but watching on in sympathy"
        }, 
        {
            "index": 243, 
            "rating": "4", 
            "review": "Emotional. This is a far smaller place than the one on the Ganges in Varanasi but no less moving. It makes you think about your mortality, not only because of the crematorium but also because of the surroundings."
        }, 
        {
            "index": 244, 
            "rating": "4", 
            "review": "closer to life. Some people may say it is inappropriate to 'sight see' during others' time of grief; but in the West we are so removed from the reality of life and death that I found it enlightening to witness the ceremony and ritual of saying goodbye and the continued remembrance. Grief does not disappear in a set time span and in the UK life carries on as normal in outward appearance. We could all learn a lot from Eastern culture that brings family together and remembers traditional rituals that value life. If you have the chance to visit the Crematoria don't dismiss it as macabre or inappropriate."
        }, 
        {
            "index": 245, 
            "rating": "1", 
            "review": "$10 entry fee for foreigners. They charge $10 entry fee for foreigners per person. We didn't go inside. The fee is outrages and it seems that the real purpose of the fee is to keep foreigners away from this place. Well, it worked we didn't go."
        }, 
        {
            "index": 246, 
            "rating": "4", 
            "review": "Moving experience. Difficult to choose a rating - since it should really read \"Extraordinary\"; we were told that the buildings along the river take the elderly and they progress along the river bank from the equivalent of Care Home to Hospice before passing ultimately to the Crematoria. A funeral pyre was alight when we visited and it was the unusual smell which we first noticed, then somewhat horrified suddenly realised that it was a body; after this the remains are tipped into the river, with much venting of emotion by the male members of the family who actually guided it in the river. A different culture and a mixture of shock and compulsive viewing!"
        }, 
        {
            "index": 247, 
            "rating": "5", 
            "review": "A good place to die.. The cremations along this river are a Hindu rite that goes back thousands of years. The remains of the dead body are released on the river after the Atman *soul( is released from the body during cremation. I look at this and feel that this would be a good place to die."
        }, 
        {
            "index": 248, 
            "rating": "3", 
            "review": "Last rites. The last rites of Hindu cremation is observed here. Many foreigners who are not allowed into the temple, gather here to witness some of th rituals that are observed in the precinct."
        }, 
        {
            "index": 249, 
            "rating": "5", 
            "review": "Something to see and ponder. This is the place where all nepali hindus end they journey on earth. It is a sacred place, so respect has to be shown. It is much smaller than the Varanisi crematoria, but it has a more intimate feeling. Spent some time looking quietly from across the river. It will make you reflect on life and death."
        }, 
        {
            "index": 250, 
            "rating": "5", 
            "review": "Burning of the deads. The crematoria can be the newest experience for the tourist. The place where you can see the dead bodies being burnt down and various after death Hindu rituals carried down. Though it is sad thing to see others being burnt but it is a totally new experience for non Hindu tourist. Good thing about this area is that you can take the photographs of the dead. Your Rs 1000 entry for the Pashupatinath area will be worth it. Watching the dead for 2-3 hours until it fully turned into ashes made me know the meaning of life."
        }, 
        {
            "index": 251, 
            "rating": "5", 
            "review": "Must see.... Witnessing the cremation of a family's loved one is a sobering experience, but part of understanding how folk in Kathmandu say goodbye. Visiting this place is definitely not for every tourist, as its quite confronting, makes you feel uncomfortable, and possibly like a callous observer. We had a group guide who explained the significance of each step in the ceremony, so we felt less like we were staring, and more like we were trying to appreciate what was happening. A deceased person is carried on a bier to the steps of the river, laid at an angle so his/her feet touch the water, to make a physical connection to the river. Family say their last goodbyes, then the deceased is taken to the wood pyre. Some stone areas are reserved for royalty. Not taking photos is an essential sign of respect. Visiting theses places adds to your appreciation of the significance of the holy river in religious values."
        }, 
        {
            "index": 252, 
            "rating": "3", 
            "review": "Not a sightseeing spot. The Burning Ghat is the first sight that we are faced with before entering the Pashupatinath Temple complex.The Ghat is on the Baghmati river. Hindus cremate their dead here. It has become a spectacle for visitors and tourists....However, the sight of a dead body being burnt, reminds us about the impermanence of our own body and makes us reflect on the purpose of life. This is certainly not a sightseeing spot."
        }, 
        {
            "index": 253, 
            "rating": "1", 
            "review": "The Crematoria. Please do not think of this as sightseeing. Or an attraction This is a sacred place where. Grief stricken people say goodbye to their loved ones. The services are very dignified with the body being washed and prepared for the funeral pyre. Some tourists are very ghoulish. Please respect the Budhist Hindu traditions. Watch in reverence as you would at a funeral in your own country. A new modern crematorium as we would recognise it is being built. But I think the traditional method will be used for a long time It is a very humbling experience to visit this place and it will remind you of your own mortalityOn a lighter note when I was there ambulances would arrive bringing the dead on litters to take to the funeral pyres from one ambulance came an old man with a long white beard wrapped in white cloth. Poor soul I thought. Making his way to be cremated. All of a sudden he waved a bony hand. my God I thought. He is not dead. Then I was informed that he was being taken to the hospital round the corner. Puts a twist on the old saying. In the midst of death we are in life. Go and watch in reverence. Remember nothing in the universe is permanent. Namaste"
        }, 
        {
            "index": 254, 
            "rating": "3", 
            "review": "strange feeling. tourists have to pay to see the dead people ceremony. interesting to know but for some people can be quite hard to watch the farewell of a family."
        }, 
        {
            "index": 255, 
            "rating": "4", 
            "review": "A sacred crematorium for the Hindu people. We visit the Crematoria , on 2 January 2015 , in part of the historical city tour arranged by Outshine Adventures.The history was told by our knowledgeable Nepali guide ,Mr Prasant.The Crematoria is located beside the Bagmati river, in the Pashupatinath temple complex.This site is a very important for the Nepal and India people ,many people arrive here to find shelter ,wait for the the last several weeks of their lives, to meet death.Bodies of the dead also brought here ,with cleaning and mourning rituals,could be seen.Later they be cremated on the banks of the river and travel their last journey with the waters of the sacred river Bagmati, which later meets the holy river Ganges. This is a place, with special atmosphere of death, death is present in almost every ritual and every sight in here.This place might not a place for everybody.We witnessed the crematory, mourning ,bathing process of the deceased , from the riverbank just opposite the crematoria , and the Pashupatinath main temple.A religious ,cultural and sacred place to be , we feel moved when watching the whole process , in fact , its the 1st open air crematory process we witnessed in our lifetime.Hopefully this magnificent area are spared during the earthquake and the aftershocks."
        }, 
        {
            "index": 256, 
            "rating": "4", 
            "review": "a sight to see. After seeing the one on the Ganges this one is a little smaller but still a sight. it smelled a bit at this location likely due to the garbage on the side upon which we were standing across the river. they perform a sacred ritual and it is a cultural thing that is to be respected."
        }, 
        {
            "index": 257, 
            "rating": "4", 
            "review": "Sobering insite into Hindu culture. To observe the ritual of the cremation of Hindus was very solemn. The ritual of cleaning the body by relatives and then the actual cremation made me reflect on the mortality of us all. I actually felt privileged to watch the ceremonies."
        }, 
        {
            "index": 258, 
            "rating": "5", 
            "review": "World heritage site.. I think this place (Pushupathi) will be working day and night to cope with the number of dead in Kathmandu. We visited before the earthquake and were lucky enough to witness a cremation of an ex-soldier. There was a company of Gurkhas who played the last post and presented arms at the ceremony. I must admit to feeling a little like a gatecrasher intruding on another family's grief but was one of hundreds who had come to watch the spectacle."
        }, 
        {
            "index": 259, 
            "rating": "5", 
            "review": "burning desire to go there! people are dying to go there!!!!!. it was a great place very busy but worth a visit it kind of makes you think about your own demise. smells like a gianl BBQ but a great experience."
        }, 
        {
            "index": 260, 
            "rating": "4", 
            "review": "Disturbing. For better understanding, we, Westeners need to see how \"the other half lives,- and dies\". And this is just the place. The smoke from the funeral pyres can be a bit overwhelming and the fact that all the remains, including offerings etc are thrown into the river, is disturbing. This waterway is nothing more than a floating garbage tip. Maybe other people see it differently."
        }, 
        {
            "index": 261, 
            "rating": "4", 
            "review": "Interesting. Some would probably be horrified but I found this a very interesting place to visit. You could see the bodies being carried to the river (under a blanket) and burned when the family and friends were watching. To be cremated there was clearly a huge honor and our nepali friend who guided us said that ge hoped to be cremated there aswell when his day comes.Also the big golden rooftop is beautiful to look at even if I, a non-hindu, can't go inside the gates."
        }, 
        {
            "index": 262, 
            "rating": "5", 
            "review": "Same as Pashupatinath temple. My review was for Pashupatinath was for this place as well. It is connected. One large area to see the Crematora, the temple, the fertility shrines, the holy men etc...This was the most interesting place I visited."
        }, 
        {
            "index": 263, 
            "rating": "4", 
            "review": "A moment of reflection. Though it is much smaller than the setup in Varanasi, it is just as emotional and moving an experience to witness the many bodies burning and all the rituals involved. The encounter with sadhus willing to have their photos taken for a few rupees brings you right back to earth. Worth the visit on many levels..."
        }, 
        {
            "index": 264, 
            "rating": "5", 
            "review": "From ashes ... To ashes. While cremation has become more common in the Western World it is something that most Westerners have never seen or experienced in a close-up setting. The Crematoria is located at the Pashupatinath temple on the banks of the Bagmati River. As we entered the crematory area the smoke from multiple cremations hung heavy in the air as the scent of the fires and burning bodies filled the air. It's a strange sensation to watch a Hindu cremation ceremony for the first time, but it's also a cultural experience you can't take your eyes off of."
        }, 
        {
            "index": 265, 
            "rating": "5", 
            "review": "One day my body will be also ...... Being a Hindu ,we need to come similar place after death. So this is different experience. You can feel what is life and what is end of life. .was very thoughtful after coming here."
        }, 
        {
            "index": 266, 
            "rating": "5", 
            "review": "An eye opening experience.. If you have ever experienced hindu crematorium, this is a must.They have an ashram for elderly with no family.There are saddu everywhere. Cremation takes place throughout the day.It's a busy place but they do charge foreigners am entrance fee."
        }, 
        {
            "index": 267, 
            "rating": "4", 
            "review": "A very spiritual and moving experience. Such an amazing and moving experience. I felt very privileged to witness the rituals performed by the Hindu people as they prepared the bodies of their loved ones. The strong scent of the burning bodies was quite confronting, but the experience as a whole was one I will never forget. An amazing cultural in-site, that is sure to leave a lasting impression."
        }, 
        {
            "index": 268, 
            "rating": "4", 
            "review": "Witness with respect and gain a little understanding. As In Varanassi on the Ghats I was struck by how differently we deal with death and the proximity of the crematation yet still be able to obseve respectfully .Its such a thought provoking experience and a world away from the shps and bars of Thamel ."
        }, 
        {
            "index": 269, 
            "rating": "5", 
            "review": "Moved. A very moving experience. In the West we are so cut off from death. This is real, and very, very beautiful. Spend time at the Crematoria – it is no place for a quick visit – and allow yourself to be touched by the extraordinary ritual of families ministering to the dead. We have to much to learn here in the West."
        }, 
        {
            "index": 270, 
            "rating": "4", 
            "review": "Respectful. In the Hindu religion, for the funeral, they take the dead bodies to a cremation spot on the river at the holy site to cremate the bodies in public. Watching the cremation process was something that one will always remember."
        }, 
        {
            "index": 271, 
            "rating": "4", 
            "review": "Amazing. Never seen a real cremation and was overwhelmed by the process. Also helped by the guidance and explanations by my excellent guide."
        }, 
        {
            "index": 272, 
            "rating": "5", 
            "review": "Very special...very solemn. We were able to see the full process from bringing in the body, wrapping it in cloth, adorning it with flowers, and then moving it to the place of cremation. I was really moved by this entire process and how it was filled with respect and love for the departed."
        }, 
        {
            "index": 273, 
            "rating": "3", 
            "review": "Expensive entry ticket. It's ok to see what's going on but we basically just did a quick walk around. Don't forget your masks. Don't shoot photos of saddhus unless you want to pay up"
        }, 
        {
            "index": 274, 
            "rating": "5", 
            "review": "You have to see it to believe it!. Part of the death process in Hindu is to burn the body of the deceased family member. In the West this process would be very private and personal...not so in the Hindu religion. They take the bodies to a cremation spot on the river at the holy site (next to the temple) to cremate the bodies in public. There are stands set up to view and photograph this process and the family members are well aware and not offended by the recording of this ceremony. However, I will say it was a bit disturbing watching this in person from Western Eyes. The bodies are cremated 3-48 hrs after death and the eldest son or male in the family conducts the ceremony. The body is prepared and set on a cremation platform and burned until there are only ashes and no recognizable body parts. The family member walks around the body three times with the flame in hand and the fire is started in the mouth. The cremation usually takes about 3 hours for full consumption. After the cremation the ashes (and anything left) is swept into the river. The other seemingly strange thing about this is, there are young men that comb the silt (the river is very shallow and barely moving) beneath the cremation platforms to recover any gold (mostly from dental work) or jewelry not consumed by the fire. There's another set of young men that recover the charred wood from the river and take it to the brick furnaces. The cremation cost 10 dollars on the right side of the bridge and 20 dollars on the left side of the bridge because it's closer to temple. The cremations go on 24hrs a day and there are always bodies waiting to be cremated."
        }, 
        {
            "index": 275, 
            "rating": "4", 
            "review": "Expensive entrance fee. Watching the cremation process was something that we will remember for the rest of our lives. The only downside is the relatively steep 1000 RP entrance fee. Be prepared to pay if you accept the invite of some Brahmin (?) to take pictures based on what I've observed."
        }, 
        {
            "index": 276, 
            "rating": "4", 
            "review": "Reflective. A place to reflect and appreciate. We were hassled by beggars and people wanting to be our guides which took away from the experience"
        }, 
        {
            "index": 277, 
            "rating": "4", 
            "review": "Slightly macabre, but fascinating. Very unique experience, seeing the cremation of people carefully wrapped in shrouds. There are a few phony yogis, but they still are worth the tip for the unique photo. The monkeys are cheeky and the continual smoky smell reminds you of what is going on. WORTH the visit"
        }, 
        {
            "index": 278, 
            "rating": "5", 
            "review": "Not a touristic site . Show respect for the place. It's not just another touristic site. I saw other tourists constantly talking with each other and taking photographs of the ceremony and not being aware that they are just attending someone's funeral and this is where the families grief.It's where the burning of body on Ghats by bagmati river takes place. Be prepared for the smell of burning flesh. Be prepared to see some intense moments of grief, cry and someone's tears."
        }, 
        {
            "index": 279, 
            "rating": "1", 
            "review": "Never again!. This a very personal comment and in no way reflects on the actual practises carried out nor the guide who took us there. I didn't want to go there but it was part of our organised tour. I tried to keep away from the main area but it just isn't posisble - you have to walk along the river, you have to walk past the waiting pyres etc. I left the group and waitied in the temple which is adjacent to the crematorium but even so the sounds and smells are impossible to avoid. A child's cremation took place whilst our group (of 3) was there and everyone was very upset afterwards. I really and truly think this should be an fully optional part of a tour. I am very sensitive on this subject for personal reasons and I would highly recommend tour companies to re-plan their itineraries and give visitors the choice of missing this out entirely."
        }, 
        {
            "index": 280, 
            "rating": "4", 
            "review": "Interesting place. The crematoria is located near the Pashupatinath Temple, on the banks of the Bagmati River. As per Hindu tradition, body is cremated on death. Although it is common for a Indians, the crematoria makes for a interesting visit while you visit the Pashupatinath Temple. Make sure you stay far away from the place and kindly avoid taking photographs as it may be invading privacy especially at the time of grief."
        }, 
        {
            "index": 281, 
            "rating": "5", 
            "review": "A Must See in Kathmandu, Nepal. I am an American in Kathmandu, Nepal on business. I had a day off so I took the opportunity to obtain a guide and tour some of the temples. I visited the Pashupatinath Temple which is near the place where the Hindu people are cremated. I felt like I was intruding on this deeply private type of ceremony, but I was assured by my business associates, who live in Kathmandu, that this was not the case. I did not stay for long because quite frankly it is very depressing watching corpses burn. I do however recommend that you include this on your list of things to see in Kathmandu, Nepal."
        }, 
        {
            "index": 282, 
            "rating": "5", 
            "review": "not pleasant, but very interesting. Take a guide at the entrance to temple complex, be ready to pay, but he will explain you everything about the ceremony. Very unusual for europeans. It's difficult to believe that this is the true life."
        }, 
        {
            "index": 283, 
            "rating": "5", 
            "review": "Interesting and up close. We viewed the Crematoria just across a small stream at the temple complex and were able to witness the whole process of building and decorating the funeral pyres to the processions of families bringing their loved ones to rest."
        }, 
        {
            "index": 284, 
            "rating": "5", 
            "review": "Amazing and spiritual. If you dont want to smell because there is lots of burning bodies, you dont have to go there.But if you have respect for other religions and people you can go and observe how the funeral in Hindu culture looks like.Great place but not for everyone."
        }, 
        {
            "index": 285, 
            "rating": "4", 
            "review": "Crematoria. This is completely different to anything else you will see. The way in which they deal with theie deceased is amazing. But be warned, the is a smell that goes with it"
        }, 
        {
            "index": 286, 
            "rating": "2", 
            "review": "Not for the squeamish. You need to see this soon before the authorities set up their permanent crematorium. This is where the Hindu community say goodbye to their loved ones on the Ghats. Be prepared to see scenes of intense human grief, the wood fire burnings of white cloth wrapped human bodies and the smell of burning flesh. What is amazing is that nobody seems to mind the tourists watching this incredibly personal situation - not even the taking of photographs. I find it deeply intrusive to take photos of such intensely personal things but most tourists don't seem to care - the participants don't mind either.If you go to Kathmandu, you need to see this once- never twice - oh yes- watch out for the monkeys!"
        }, 
        {
            "index": 287, 
            "rating": "5", 
            "review": "Very impressive. It's not every day that you get to see such an impressive ritual. In the western world we are not used to deal with death in such a direct way. So, be prepared to see some shokking images.To see all this you have to pay 1.000 roepies per person. A lot of money to Nepalees standards.As my husband payed the tickets we were appoached by a young man who showed us the site and the temples. Het was very friendly and explained everything. We liked him a lot. We thought he was part of the 'package'. After he showed us everthing, including the old-peopleshome, he demanded 10 dollars. We were stunned. And all of a sudden he was not that nice anymore.This spoiled our visit somewhat."
        }, 
        {
            "index": 288, 
            "rating": "5", 
            "review": "Amazing Visit. Our host took us the the Crematoria after an early morning flight up to Mt. Everest. It made for quite a diverse day of sightseeing in Kathmandu. It was fascinating to hear of the rituals and traditions of how the Hindu funeral process was so tied to the life of the individual."
        }, 
        {
            "index": 289, 
            "rating": "5", 
            "review": "The Sadhus priests are like rock stars here. You are in the 1 of the most holy of places in all of Nepal here. The sacred river flows through Kathmandu here and at least 30 people per day who have died are burned for 4-5 hours and cremated every day. The smoke is thick and be prepared for true grieving for the loss of loved ones. They just are more open about it than we are and more tolerant for curious onlookers. I on the other hand was a participant in this amazing ceremony. I had brought some of my brothers ashes from the USA and my guide and the Sadhus holy men helped me achieve a proper send off on this sacred river. We put some of my brothers ashes in a bowl of grasses with flowers and incense burning. The painted up faces holy men said a prayer for me and my brother. Come here if you are really curious about life and death through Hindu theology. A++++++"
        }, 
        {
            "index": 290, 
            "rating": "5", 
            "review": "Wow wasnt ready for this one. Our guide took us at dusk, it was eerie and amazing. Our guide was so knowledgeable we learned so much, a fascinating place, the monkeys are scary though."
        }, 
        {
            "index": 291, 
            "rating": "3", 
            "review": "Death dealt with in a beautiful way. I find Hindu rituals quite beautiful and appreciate the way death is dealt with in this context (I don't find it shocking or macabre). I also think that Pashupatinath is a beautiful place and well worth the visit (the river itself is a little sad). However, since you have to pay 10 USD to get in, I've only done it once and have very little desire to do it again. But if you have the money and if you're interested in Hindu culture and death rituals, then it's definitely worth seeing. There are lots of \"guides\" available, some more knowledgeable than others and it's up to you to decide whether you're interested in their services or not. If you do decide to \"hire\" one, it might be a good idea to negotiate the price beforehand. You can easily spend a couple of hours here."
        }, 
        {
            "index": 292, 
            "rating": "5", 
            "review": "$10 to see a sight you will NEVER forget. There's more here than just the crematoria. This is a park-like hangout for some of the locals, a Hindu temple, the deer park, and of course the \"crazy-face\" guys. Take your selfie with them for sure! The main attraction is seeing the cremations in progress. Its a somber and moving sight. And when the wind shifts you are going to be \"smoked\". So now you will be able to say that you inhaled a bit of someone's corpse! Bet you can't get that back home."
        }, 
        {
            "index": 293, 
            "rating": "4", 
            "review": "Welcome to reality!. None of us wants to die and when we see a body being taken for its last rites, our minds conveniently tell us that this would not happen with us. Reality strikes only when someone, we love, leaves us forever. This is the time we realise that Death is as real and inevitable; and not so much in our hands as birth.My visit to Crematoria was one of such experience where I brushed with life's most stark truth, i.e. death!I had gone to Pashupatinath temple (earlier also, twice I have been there, but never had this experience) and while going around the temple I saw people gathered around a wall. Everyone was watching something going on below. I couldn't curb my curiosity and I also tried to look down.What I saw filled me with mixed feelings. After a while I realised that my eyes were moist. Some politician's mother had died and the whole family had gathered there. I watched the whole ceremony starting from giving a wash to the departed body and then some religious rituals before the body is put on a pyre, decorated with bright yellow marigold flowers. A person who was loved by many, who had a life, was no more there. There was fire, high flames and a bunch of people who were crying and hugging each other; and a whole lot of onlookers who had gathered around the area to watch the last journey.I came out of the temple feeling humbled, I was quiet, I had witnessed the eternal truth!A visit to Crematoria is worth giving a go if you believe in life and death!"
        }, 
        {
            "index": 294, 
            "rating": "4", 
            "review": "Interesting, but just a little bit creepy.... Watching people say goodbye to their dead and then burning them is just a bit macabre, but it is worth seeing.I would put it on par with the bones in Paris. Worth seeing and understanding another religion, but wouldn't put it as a must do - especially if you are a bit squeamish."
        }, 
        {
            "index": 295, 
            "rating": "4", 
            "review": "Fire for the soul. I originally felt a bit ghoulish about going here but it turned out to be an interesting day. The religious beliefs, cremation rituals and colourful yogis make for an experience you won't get at home. Make sure you respect the space and grief of the people attending for their love ones."
        }, 
        {
            "index": 296, 
            "rating": "4", 
            "review": "Well it's not Everyone's Cup of Tea. This place might not be to everyone's liking, but it really is worth a visit. Mind you I did think the 1000NR entrance fee was somewhat expensive. Do yourself a favour and allow a guide to show you around and explain everything that goes on, costs for us was 20USD. Basically this place is an open air crematorium - you do see bodies being burnt on a pyre then pushed into the river. But for me it really didn't seem macabre. The way everything was explained to us put things into a different prospective. This really is an unusual place to either describe, approve of of disapprove of. Please do visit and make your own opinion."
        }, 
        {
            "index": 297, 
            "rating": "4", 
            "review": "I feel sad. I feel sad when seeing people cry for their love one, you may sit and reflect about life and death, but if you want to take photos, please don't go too close."
        }, 
        {
            "index": 298, 
            "rating": "4", 
            "review": "A worthwhile see. I had wanted to visit here on my last trip esp for the crematoria area - it is not morbid at all, but a beautiful celebration of the circle of life. A very peaceful place and far from intrusive as I thought it might be. Sitting across the river, the whole area feels steeped in history. Where ancient meets modern. Wonderful to see. It is however very expensive for tourists to visit - now 1000, which I felt to be very, very steep :-(. I was glad to see though."
        }, 
        {
            "index": 299, 
            "rating": "5", 
            "review": "A Fascinating Experience. Visiting the crematoria was truly a unique and fascinating experience. It also gave us a great insight into the Nepalese culture and hindu rituals. Hiring a guide is also recommended as they will explain the cremation stages as well as all of the religious aspects."
        }, 
        {
            "index": 300, 
            "rating": "1", 
            "review": "Excuse to rip off tourists. They are ripping off tourists at The Crematory! As soon as I got there to visit the place, I was informed that the entrance fee was 1.000 NPR which correspond more or less to U$10.00. It’s a quite high value for Nepalese standards. According to the banner attached at the counter, this charged value would be used for renovation and maintenance of the Temple and Monuments. I understand it but, I cannot understand why just tourists have to pay this entrance fee. A guide explained to me that local people don’t pay because they do voluntary job there. It became in my mind a perfect excuse to rip off tourists since I’m sure that almost anybody in Kathmandu is working for free there. I refused paying this abuse and came back to my hostel frustrated. If you want to see a Crematory, go to India (Varanasi). A week ago I saw a huge Crematory for free."
        }, 
        {
            "index": 301, 
            "rating": "5", 
            "review": "very moving and atmospheric. We felt very priviledged to witness the funerals taking place and would urge you to go look and learn for yourselves. this is not a morbid experience, we actually found it more uplifting than a traditional western funeral."
        }, 
        {
            "index": 302, 
            "rating": "4", 
            "review": "Emotional scene. Place where traditional cremation takes place. There were kid and an old man being prepared for cremation when we visited. The whole scene was emotional and spiritual.\nA very touching and unusual experience."
        }, 
        {
            "index": 303, 
            "rating": "4", 
            "review": "Sombre and serene. Respect for those grieving is an easy thing to observe at this place. At the same time, the events and setting provide ample reason for reflection on the nature of life and where it ends. The rituals of life are important for all of us even when we are simply observers and not active participants; take some tome at this place to remember what is important"
        }, 
        {
            "index": 304, 
            "rating": "4", 
            "review": "Fire for peace !!!. According to Hinduism or anyother religion life is built up of nature, giving back to nature what you took from it is harmonious and in accord to nature."
        }, 
        {
            "index": 305, 
            "rating": "4", 
            "review": "Hindu education. First.... do not take the first tour guide who rushes up to you and trys to guilt you into paying a lot because the ticket price is high. WAIT.... get the 300 rupee guides further in. With a good guide you will learn a lot. Not for the squeamish. They are burning bodies there daily. A good guide puts it into perspective."
        }, 
        {
            "index": 306, 
            "rating": "5", 
            "review": "One of a kind touristy place.. It might bother some but if you don't mind seeing the dead burn right in front of your eyes then this is one of the unique experience. Is the most scared and holiest place evern though is a cremation place. They will wash the dead in the river then they will sue the river water to wash the head and feet of the one alive."
        }, 
        {
            "index": 307, 
            "rating": "5", 
            "review": "Very surreal!. At the time of my visit there were at least 6 funeral pyres with remains being swept into the river! Initially it was quite daunting but there was a very dignified atmosphere involved! This is a World Heritage site with a significant number of \"attractions\" ranging from the adjacent hospice, hundreds of monkeys,stunning views and \" interesting\" people openly smoking hashish!"
        }, 
        {
            "index": 308, 
            "rating": "3", 
            "review": "Interesting.... It was a good place to visit to get a sense of the culture. This is the most holy place for Hindus to get cremated. However, you literally watch fires burning that you know are bodies and you breath in the smoke, which isn't particularly more rancid than other smoke, except you know you're breathing in human ash. there's an interesting Temple next to the crematorium that was built to honor a phallic shaped stone, so there was a lot of phallus related symbols and statues everywhere. I thought it was funny, but others may be dismayed."
        }, 
        {
            "index": 309, 
            "rating": "4", 
            "review": "Good cultural experience. Overall, it's definitely a must to visit just to take in the religious experience of the hindu culture. You don't need to spend more than a hour there as there isn't much to do other than view from a distance some of the religious ceremonies. It's a bit eerie overall watching families perform ceremonies along the river for their loved ones that have passed away. We had a tour guide that we hired inside the grounds for $10 USD, which we heard was the going rate and was reasonable for a group of 4 of us. It's not needed to have a guide, but we found it useful to learn more of the history behind the religious ceremonies. You could also just follow one of the large tourist groups walking around and listen in on the information provided by their guide which is what we did for the first 30 minutes or so."
        }, 
        {
            "index": 310, 
            "rating": "4", 
            "review": "Interesting to see funerals in other cultures.. The crematoria is a confronting place - dead people are wrapped in gauze blessings given flowers sprinkled over the body then laid on a pyre and lit up - confronting but interesting to see how others do funerals - felt almost voyeuristic watching an intensely private moment of a family but apparently a normal thing in Nepal."
        }, 
        {
            "index": 311, 
            "rating": "4", 
            "review": "Meet the dead. Culturally fascinating, but for westerners the visibility of dead bodies throughout the various ceremonies could be educational or confronting depending on your perspective (especially for young) children. Having a local guide that can explain the customs/ceremonies is valuable."
        }, 
        {
            "index": 312, 
            "rating": "3", 
            "review": "Interesting experience. Katmandu is an interesting city with very narrow streets that are shared with many motorbikes and cars. Good shopping for knitters, silk pashminas and scarves, jewellery. Lots of good eating places, some in courtyards. Went to many temples and the zoo was interesting - very small."
        }, 
        {
            "index": 313, 
            "rating": "5", 
            "review": "A very unique experience. Nothing quite prepares a person who is visiting a cremation site - especially for the first time. Up to 12 priers burning simultaneously, smoke everywhere, monkeys, sacred river, gurus galore...."
        }, 
        {
            "index": 314, 
            "rating": "4", 
            "review": "The person was loved.... The stark reality of this experience was somewhat surreal. Yes death is inevitable, but here it is perceived as the start of a spiritual journey. It was interesting to watch the ceremony from a distance alongside the Bagmati River and in the compound of the great Pashupatinath Temple. I first saw the smoke before I saw the funeral pyre and the straw above the body and the logs beneath it. There was a clear reverence surrounding the site from those present. The person was loved..."
        }, 
        {
            "index": 315, 
            "rating": "5", 
            "review": "May bother some. Yes, it is a public crematoria that may bother some visitors. If it is looked at just another ritual, how other cultures handle death, it is easier to accept. I certainly learned much when I went with my guide. Very informative."
        }, 
        {
            "index": 316, 
            "rating": "4", 
            "review": "Informative view of cultural differences. It was interesting to watch 2 funeral ceremonies and cremations from across the filthy river. The actual fire under the bodies was a startling visual which upset some of our group. The reality of it all was definitely brought home to everyone. This is NOT for everyone, but I am so glad we experienced this. Also, the contrast between what we do and what they do was absolutely stunning."
        }, 
        {
            "index": 317, 
            "rating": "4", 
            "review": "Another vieuw on death.. In Pasupathinath you can see and follow the cremations from Hindu-people from close-by.Iff you heve somebody with you who can explain you all the rituals, it is less scary then you might think. In a matter of fact, the cremation is very interesting to follow.Always remember that this is not the end but just a transformation to a new life.What is left when the soul is gone, is just the body and somehow you have to get rid of that also.Cremation is a good and clean and healthy option to do so. The surrounding buildings are nice and impressive. The Shiva-tempel is not accessable for non-hindu's.The outside of the building and the surrounding area are surtainly worth a visit.Entrancefee is approx.10 euro / 13 USD."
        }, 
        {
            "index": 318, 
            "rating": "5", 
            "review": "May be troubling to some. Although some of our group found this site troubling, I thought it was interesting. Cremations in Nepal are a public affair and this was a chance to experience one (or more)."
        }, 
        {
            "index": 319, 
            "rating": "5", 
            "review": "Eye opener. Watching the cremation at the shores of the Bagmati river is definitely eye opening. Once dead we are just a dead body after all. Going back to ashes which are then dissolved into the river. But during the aarti time at 6:00- 6:30pm it is a lovely experience. You feel the vibes being so close to Lord Shiva."
        }, 
        {
            "index": 320, 
            "rating": "4", 
            "review": "A mixture of the fascinating and the macabre. This is a very large temple complex (there is a fee to visit) but unfortunately the main large hindu temple is only open to hindus! On the up side there is still a lot to visit. On the down side the gurus have become a tourist attraction (you have to pay to take any photos with them!). The cremation ceremonies are round the clock with ash split in the river which has become filthy not just because of the ash but also major amount of rubbish.Still worth a visit!"
        }, 
        {
            "index": 321, 
            "rating": "4", 
            "review": "Great experience. It was such a solemn experience to view how the end of life is met in the traditional Hindu way. There are slight variations depending on where the deceased is from.\nThere are painted holy men sitting above this area that get upset if you take their picture without paying them."
        }, 
        {
            "index": 322, 
            "rating": "5", 
            "review": "Cultural 10/10. For people with a open view on live and death.\nBeautiful yo see how these people handle to passing of a loved one.\nAmazing area, but be careful at the entrance they try to trick you with the entrance fee.\nThis the place to make pictures!"
        }, 
        {
            "index": 323, 
            "rating": "4", 
            "review": "Sad and interesting. Should go. Please respect the people there, stay from a distance if you want to take pictures. This is the most expesive place to visit (around USD 10). If you enter from the exit you don't need to pay anything. They only make tourists pay."
        }, 
        {
            "index": 324, 
            "rating": "5", 
            "review": "END OF D DAY !!. Dis place is located just behind Pashupatinath Temple. It will make you realize about NOTHING WILL LAST FOREVER. You can experience Creation process of Hindu culture."
        }, 
        {
            "index": 325, 
            "rating": "4", 
            "review": "Fascinating.. We visited the temple and the crematoria, as a westerner I felt a little awkward watching someone elses funeral, but that was just me.It's fascinating how they do things here, the cremation should take place within 24 hours, I think there were 8 - 10 platforms and professionals brush the last remains of someone from the platform into the river, the eldest son, or chief mourner then has to spend a period of weeks in isolation and mourning.Whilst we were there the male members of a family arrived with the deceased relative, wrapped in a white shroud, they then were supposed to take the deceased to the river and wash the body, but the family seemed at a loss as to what to do, they were even on mobile phones whilst down by the river.It's a strange experience, but one I'm glad I glimpsed, although we were on the opposite bank, I still felt as though I was intruding, but there were other Nepalis there as well.The Temple next door is a most sacred place for Hindu's and non Hindu's can't enter, but you can seen the Statue of the massive bull through the open doors and if you go up the path at the side, you can get a look at the interior from above.There are all sorts of animals there, from cattle, goats, monkey's to dogs. The area is also a World Heritage Site, with funds being spent on it. It helps to visit with a local guide who will give you all the history and details of the rituals."
        }, 
        {
            "index": 326, 
            "rating": "3", 
            "review": "Did not seem very interesting to me.. I do not know what all the fuss is about. Or maybe I was tired at the end of the day but it was not interesting to me and I just wanted to move on."
        }, 
        {
            "index": 327, 
            "rating": "5", 
            "review": "Interesting place.. We paid our 10000 rps to get in, we were hassled by guides to use their services.. But we went on alone, of course we couldn't go in the temple but the grounds around it. We walked for ten minutes and I felt I needed to know more about this place. So I engaged the services of a young man, 18 years old and very good English. I am glad I did as I learnt a lot about the life and death of people in Nepal. You will see dead bodies here, so be prepared. but I didn't feel we where intruding in the families grief..local young boys dive in looking for any metal brushed into the river off the funeral fire right under the noses of the next family.. you have to visit this place to understand the atmosphere. Beware for the fake holy men! Why would anyone give them money.. We saw a real holy man in mother Therasor's old folks home, he just prays and chants and feels no need to ask for money. And the monkeys are a wee bit aggressive."
        }, 
        {
            "index": 328, 
            "rating": "4", 
            "review": "Strange but worth seeing. Worth seeing and trying to understand. It's certainly strange for one from another culture to see bodies burned and their remains slid into the river. The same river where locals are bathing and who knows what???"
        }, 
        {
            "index": 329, 
            "rating": "5", 
            "review": "A transcultural experience. We appreciated the solemn beauty and the insight into death in other cultures. The setting was incredible. Sounds odd - but we took our kids (9,11) from the opposite bank there is not too much 'detail' and its all very matter of fact - dare I say educational.Usual array of hawkers etc, monkeys everywhere - take a guide, if only just to keep other guides off."
        }, 
        {
            "index": 330, 
            "rating": "5", 
            "review": "Weird and wonderful. A truly unique experience. Difficult to judge how you will feel before you visit. An absolute must to visit. Will give you a great insight into Nepalise culture and rituals."
        }, 
        {
            "index": 331, 
            "rating": "4", 
            "review": "Chance to See Local Customs. The area was unique and offered a glimpse into the Hindu religious practices related to the funerals. We have been to Varanasi in India, and has very similar aspects."
        }, 
        {
            "index": 332, 
            "rating": "5", 
            "review": "Fascinating but confronting. We really enjoyed our trip to the Crematoria. The facility included a Sikhs temple, a crematorium, a fertility temple and an aged care facility. Pay the fee for a guide so you know what's what. (approx AUD$25). The crematorium is open for all to see. It was a confronting experience, as we were there at the actual time of the lighting of the fire. But put this on your to do list"
        }, 
        {
            "index": 333, 
            "rating": "5", 
            "review": "A Cultural Experience. We had a guide who explained the whole Hindu was of cremation i.e taking the body back to where it had come from etc. I found this culturally interesting and not morbid at all. I had to laugh at the Holy men who would not have photo's taken but if you paid them they were okay :-)"
        }, 
        {
            "index": 334, 
            "rating": "4", 
            "review": "Voyeuristic but fascinating. A most peculiar and sobering experience but definitely one to see if in Kathmandu. Watch out for the monkeys. they're big, unafraid and everywhere."
        }, 
        {
            "index": 335, 
            "rating": "4", 
            "review": "Interesting but morbid. The whole experience was a bit weird. If you want to see how the locals deal with their dead, the whole experience was fascinating, but quite morbid. If I was burying(cremating) my loved ones, I would be put off by all the tourists peering and taking pictures. I was also put off by the so called holy men painted up and begging people to take pictures of them for money. One painted up holy man, that was in nothing but a metal jock strap, was especially strange. I am also put off by the government charging a steep fee to enter the area, taking advantage of the people sending off their loved ones for the last time."
        }, 
        {
            "index": 336, 
            "rating": "4", 
            "review": "Surprisingly Fascinating. Watched the comings and goings from a distance and found it very surprisingly interesting, although the river looks anything but sacred."
        }, 
        {
            "index": 337, 
            "rating": "4", 
            "review": "Local Culture. It a must visit place to know a little bit more about nepali culture. It is not a beautiful place, neither has a good smell, but it is something very different from what ocidental culture is used to."
        }, 
        {
            "index": 338, 
            "rating": "5", 
            "review": "Visiting with respect. I am quite reluctant to give rating to it at the place....however, as a visitor to explore others culture, it is necessary to see and to feel together with the local, right? This is why I insist to give a rating. It is not attraction, but it is a place to understand more about local's culture. Visited 1994."
        }, 
        {
            "index": 339, 
            "rating": "5", 
            "review": "What an experiecte!. The old temple was fabulous but having the sacred opportunity to watch the dead being burned was beyond compare as a culture and religious experience. Would certainly recommend it to everyone and good to hire a guide as it helps the economy and they have great advise."
        }, 
        {
            "index": 340, 
            "rating": "3", 
            "review": "Check it out if you are curious. We went at the end of the day, after having visited all of the other religious sites in and around Kathmandu. I was annoyed at being charged 10USD to enter the site but had no access to the temple (Hindus only). We went along the water while bodies were being cremated. It was smoky, smelly and there was ash falling from the rice leaves and logs burning. We also saw the long-haired 'ghost men' who are all painted up, sitting around and wanting money for a photo. I guess it just wasn't my thing.... after a day of having paid entrance fees at every location, asked for donations all over the place, been followed by merchants everywhere and having to barter hard for any purchase. I just felt like this place was dirty and 'expensive'. Of all the sites we visited in six hours, this was probably the most interesting due to the cremation concept."
        }, 
        {
            "index": 341, 
            "rating": "4", 
            "review": "Once in a life time viewing but please remember that people are cremating loved ones.. So amazing to witness yet so sad at the same time. The smell of burning bodies was not that bad but the thought that you are breathing in their ash was unpleasant. A thought provoking place to spend an hour or so."
        }, 
        {
            "index": 342, 
            "rating": "1", 
            "review": "This is not a show.... I don't think no one is happy to see strangers taking pictures or watching you especially when you lost a love one. We should respect their culture and this moment of grieve."
        }, 
        {
            "index": 343, 
            "rating": "4", 
            "review": "impressive. you can follow the whole process from the bridge and take pictures if you want. they recently started to charge 10$ at the entrance in town."
        }, 
        {
            "index": 344, 
            "rating": "4", 
            "review": "Not Varanasi. Had visited the Pashupatinath area, but not being able to enter the temple, we spent more time walking opposite the main cremation \"stations\" and having our guide answer our questions about the practices and procedures.Having previously visited Varanasi, one has to say this was on a smaller scale, and less moving for that, plus here apparently the do not cremate at night.Still felt a visit was worthwhile, for the sights and sounds, including mischievous monkeys."
        }, 
        {
            "index": 345, 
            "rating": "3", 
            "review": "A sad place. Even though the crematoria was interesting, it was also sad to be there watching others grieve over lost ones. It seems if there is a buck to be made, it can be made at others expense. I felt like we should have not been there."
        }, 
        {
            "index": 346, 
            "rating": "5", 
            "review": "Peaceful place - time to reflect. Its surprising for me that a place where you see bodies getting cremated in the open can be so peaceful and give you time to reflect. Surprising but definitely a must visit. People do try to take Rs1000 from non-hindus to enter this place but plan well to skip through. No one should be charged for entering a place according to me."
        }, 
        {
            "index": 347, 
            "rating": "3", 
            "review": "Smelly and gruesome place. good only for necrophiles. Definitely to avoid for more sensible tourists! Not worth the ticket price."
        }, 
        {
            "index": 348, 
            "rating": "4", 
            "review": "Great cultural experience. Worth getting a guide (they hang around the entrance) to help explain the rituals and sights. You just need to give him a small donation of your choice at the end."
        }, 
        {
            "index": 349, 
            "rating": "4", 
            "review": "Well worth a visit, a humbling experience to say the least. Was a little hesitant about visiting at first, but glad i didWe had a really great guide, who explained all the details regarding the cremation stages and all the cultural/religious aspects, a great insight into the Hindu religion."
        }, 
        {
            "index": 350, 
            "rating": "5", 
            "review": "Very Interesting. We weren't sure at first if we would go to this site, but so glad we went. We were able to be a part of a police officers service, with a police band and such. It was very heartwarming, yet sad at the same time. It was good to see how a different religion deals with end of life."
        }, 
        {
            "index": 351, 
            "rating": "5", 
            "review": "Cultural experience. We were so fortunate to be able to witness a cremation from beginning to end. Our wonderful guide, Prob, explained all the stages of the cremation and other activities in the area such as traditional ceremonies conducted in remembrance of those who had died in the past. It was quite a spiritual feeling to follow the ceremony. The \"Holy\" men, dressed in ridiculous get ups and their bodies painted white, are a scam. As our guide told us, in his opinion, they weren't \"holly\", as they charged visitors to take a photo of them. We paid of course, just to get a snap of how odd they looked! I recommend this Cremation ceremony."
        }, 
        {
            "index": 352, 
            "rating": "3", 
            "review": "Be prepared for a culture shock. The visit to this site was very confronting so be prepared.It is totally commensurate with the religious and cultural beliefs of the Nepalese and must be respected but this very public way of dealing with cremation is very different to the private way we deal with it. It would not advise that it is a \"must see\" but it is a part of life in a Nepal."
        }, 
        {
            "index": 353, 
            "rating": "5", 
            "review": "The most culturally interesting place in Kathmandu. If there is one thing I will never forget about my 4 days in Kathmandu, it's this place. A very culturally interesting experience along the river close to Pashupatinath temple. As stated in most review, beware - you will see dead bodies."
        }, 
        {
            "index": 354, 
            "rating": "4", 
            "review": "Confronting and yet I was deeply interested. Within hours of passing family bring their loved ones here to this very public of places and yet mourn their loss and display their grief with us westerners watching and questioning. There is a sense of macabre and humor. I past a couple of hindu monks with barely anything on, and yet out pops a mobile phone from under a loin cloth - even here in this most ritualistic of places modern technology has found its place."
        }, 
        {
            "index": 355, 
            "rating": "5", 
            "review": "I didn't regret to pay entrance fee 1000R. To the crematoria you get take bus from Ratna Park (15R) and after you can continue to Bodnath stupa. Crematoria is sad, breathtaking and shocking place. Now entrance fee is 1000R, but I didn't regret to pay it. I spent hours watching burning bodies there and ceremonies there. If you come, on the left side there are cleaning ceremonies of the dead bodies and there is a place for burning rich people. On the right side there are many burning places. In this place you can realized how our bodies are easily transient. If you are in Kathmandu, find a half of the day and spend time there. It is worth."
        }, 
        {
            "index": 356, 
            "rating": "5", 
            "review": "Get at new view of life and death. This place is for the more, serious traveler, this place should be visited whit respect. Please look and observe that life is has an end"
        }, 
        {
            "index": 357, 
            "rating": "5", 
            "review": "Interesting cultural experience. Take a deep breath if you're not a fan of seeing dead bodies. We saw a few - this is where the Hindu's of Nepal burn their dead. It's very interesting and well worth a visit. Watch out for tour guides - if they take you around and tell you stuff they'll want paying!"
        }, 
        {
            "index": 358, 
            "rating": "5", 
            "review": "Visit but beware of scammers. This is well worth a visit, to see the bodies being brought for cremation being washed in the river prior to burning, fascinating to me as a westerner. Photos are allowed unlike in Varanasi, India. Lots of people offering guide services but charging high prices. Agree your price beforehand, I did but saw others that didn't have aggravation from the guides afterwards for saying their price was too expensive. The various holy men etc charge you for taking their photo and I was told that I couldn't go into a nearby temple as I wasn't the right religion, not sure how correct that is but check it out as I was charged for the ticket to the temple anyway! As it was raining hard I didn't protest too much, but I got a feeling of scamming throughout this area. Crematoria is cool though."
        }, 
        {
            "index": 359, 
            "rating": "2", 
            "review": "One for the locals. A culturally and spiritually significant site. All respect to the Nepalese. However this is not an attractive tourist destination. Sure there is the education angle, but I felt like I was a fat tourist imposing my presence at a not particularly happy place."
        }, 
        {
            "index": 360, 
            "rating": "5", 
            "review": "fascinating. fascinating insight into the culture without being \"gross\" or morbid. we could have stayed for hours as it was really interesting."
        }, 
        {
            "index": 361, 
            "rating": "5", 
            "review": "One of the most interesting and memorable experiences I've had. If you are only going to see one thing while in Kathmandu, make sure it is the Crematoria. It, and the surrounding Hindu temple complex, is a moving and memorable experience. We had an amazing young guide who brought us around and told us about the history of the place, and the Hindu traditions associated with cremations. We witnessed three different cremations while we were there, including one of a well-known local politician. We spent an hour and a half around the entire complex, but it felt like only ten minutes and we were both disappointed when the tour was over. I will never forget the time I spent there.Well worth the entrance price."
        }, 
        {
            "index": 362, 
            "rating": "5", 
            "review": "may 2014. well worth a visit..we were fortunate to see the cremation of a Ghurka with all the pomp and ceremony. many Hindu worshippers visiting the temple which is not open to non hindu."
        }, 
        {
            "index": 363, 
            "rating": "4", 
            "review": "Spirituality. While we never visited this place on purpose, it was found by accident, it was a very moving and spiritual experience. While not for everyone still worth a visit."
        }, 
        {
            "index": 364, 
            "rating": "5", 
            "review": "Eye opener. This place is a must see for anyone interested in the culture or Hindu religion. The place is open to Hindus 24 hours and people from all over come to cremate their loved ones. There was one happening while we were there and was fascinating."
        }, 
        {
            "index": 365, 
            "rating": "5", 
            "review": "Very Interesting. While it may not be for everyone, i was fascinated. The rituals and attention to family are amazing. Go with a guide that can explain what is happening and you will get much more from the visit."
        }, 
        {
            "index": 366, 
            "rating": "5", 
            "review": "Rush to see. Its the place to see burning dead body of Hindu people.Whats a Great culture totally different then others.its the place to see fear and unhappiness of NepaliHindu People."
        }, 
        {
            "index": 367, 
            "rating": "5", 
            "review": "Morbid, an eye opener of Hindu culture. This place is Nepal's most renowned cremation site. It was our first time witnessing burning of body in the open. In Hindu culture, after the person is dead, his/her dead body is wrapped in cloth and placed on bamboo litter and body are delivered by barefooted pallbearers accompanied by the deceased's male relatives. The body has to be cremated within 24 hours. The eldest son of the family performs the cremation ceremony. The cries of the family members were heart-wrenching. Even though I don't know them, my tears fell and at that moment I felt strange and awkward taking pictures of the ceremony. A few hours later the ashes were collected and swept in the river. The five elements (metal, wood, water, fire, earth) united to form a human body. When a dead body is cremated in fire, the element returns to nature."
        }, 
        {
            "index": 368, 
            "rating": "5", 
            "review": "Great cultural exposure.. A must experience to understand the culture. You can sit on the other side of the river and watch the cremations, without feeling like you are interfering in the rituals. Humbled and privileged to have experience it."
        }, 
        {
            "index": 369, 
            "rating": "4", 
            "review": "Gruesome, but fascinating. This is an opportunity to view and (with a good guide) understand the Hindu approach to death, and its associated rituals."
        }, 
        {
            "index": 370, 
            "rating": "4", 
            "review": "Cremetoria. Found lots people watching the dead bodies being burned and then parts of burned body collected and remainder is pushed into the river."
        }, 
        {
            "index": 371, 
            "rating": "4", 
            "review": "Sobering. What a glimpse into another culture. I felt privileged to experience it. Use a guide. The one we had was fantastic! We met him at the ticket booth."
        }, 
        {
            "index": 372, 
            "rating": "5", 
            "review": "public crematorium. Unexpectedly, this was a highlight of my Kathmandu city tour! I've never seen or heard of anything like it. I don't want to say too much to spoil it, but I'm a nurse and found it fascinating. I can see where it wouldn't be for everybody, but I view death as another stage of life and I like that the Nepali people seemed to view it the same way."
        }, 
        {
            "index": 373, 
            "rating": "5", 
            "review": "dont listen to those stupid people complaining about 10usd. some hippies just want to get everything for free.... its not like that.....it costs 10usd but, its really interesting and if you TRY TO TAKE PICTURES in GANGES river in varanasi you ll get in trouble coz the police andthe scammers work together there to catch tourirsts trying to take pict of the cremationin kathmandu pictures are allowed.... if you just want to see and not take pics go to varanasi its much bigger ... but if u want to take pics go to this one in nepal"
        }, 
        {
            "index": 374, 
            "rating": "4", 
            "review": "Not something to enjoy, but go anyway. It's hard to give a rating to something that doesn't rate as entertainment. Watching the activities at the crematoria provides an opportunity to contemplate the rituals surrounding death, and the differences between cultures. This is certainly somewhere I wouldn't take the children unless you're ready for a very serious conversation. I'm glad I went."
        }, 
        {
            "index": 375, 
            "rating": "5", 
            "review": "Thought provoking. I didn't know what to expect, having read reviews describing the Cremation areas as \"confronting and disturbing\". I visited with my 25 year old daughter, and whilst the concept of sitting quietly watching the cremation formalities and rituals across a small canal seemed intrusional (and difficult to explain to others), we found it to be a thought provoking and contemplative experience. There are two cremation areas - basic platforms and \"no frills\" for commoners, and an area for more affluent people, with more ceremony and ritual.There was no sign of grief or drama, as the cremations seemed to be conducted more as a final formality and farewell before rebirth.A most worthwhile visit, which gives an enhanced understanding of local culture and thought. At no stage did our presence feel unwelcome or out of place - we were simply observers (amongst a few hundred others) quietly observing part of life's cycle.An important part of the Kathmandu \"experience\"."
        }, 
        {
            "index": 376, 
            "rating": "5", 
            "review": "Interesting.. Very different from what we are used to in the western culture. It can be a little too much and a bit shocking. We have seen the crematorium at Varanasi, but somehow this was more memorable. Here you can see the ritual step by step and although you are watching from the other side of the river you can see all the details."
        }, 
        {
            "index": 377, 
            "rating": "5", 
            "review": "An experience I still can't wrap my brain around!. I don't think I would go here two times but the one time was a must! WOW! Interesting to learn about other cultures and this was certainly no exception!!!!"
        }, 
        {
            "index": 378, 
            "rating": "5", 
            "review": "Memorable. This is Pashupatinath Temple and the sights you see here will stay in your mind for a long time after you have left. Death and grieving are on display in a way very different to western culture. You might feel slightly uncomfortable watching the events going on here. It is almost factory like with its efficiency. A body takes 3 hours to burn and they get through about 30 per day. You will see grieving families washing bodies in the Bagmati River. People draped in white or gold robes. It is all very symbolic. Have respect and don't get too close with your cameras and keep quiet. Tourists watch from the opposite side of the river. Sadhus or Holy Men in all their Technicolour glory will pose for photos if given 15Rs."
        }, 
        {
            "index": 379, 
            "rating": "5", 
            "review": "A very different experience. So, this was a very ... different ... experience, and it's not for everyone. The smell of the smoke stayed in my hair/clothes after (but, so does everything in Kathmandu).You could watch the rituals taking place before the cremations. It was a bit strange to watch people's grief as a tourist attraction, and I therefore refrained from taking pictures. None the less, it's a very interesting thing to see if you are not from a Hindu country.I still felt weird about watching this, but I think most people from countries where bodies are not publicly burned would feel weird about this.I'd be very interested to know how the families feel about tourists coming here for a cultural experience."
        }, 
        {
            "index": 380, 
            "rating": "3", 
            "review": "Check First. We visited this UNESCO World Heritage site as a part of a day tour when we first arrived in Kathmandu. We valued the cultural ritual of this ancient site but were unprepared for the open grief and confronting scenes we were privy to. Ask your tour guide if it is on the tour and perhaps read a little about it before going there. We were so wrapped up in our pending EBC trek that we had not given this site too much thought. I was haunted by the young woman who had lost her husband and her grief stricken cries. So public yet so very personal."
        }, 
        {
            "index": 381, 
            "rating": "5", 
            "review": "The cycle of life. The timeless ritual of farewell, ashes to ashes and return to the waters of life. Take the time to watch and reflect......"
        }, 
        {
            "index": 382, 
            "rating": "5", 
            "review": "Fascinating. This was the most different experience we had while in Nepal. The customs are very different from those in the west. The complex itself is massive and very ornate. You'll note that many locals hang out here to see how cremations are done, since not all places in Nepal cremate. It was at times sacred, profane and sublime! Don't miss it."
        }, 
        {
            "index": 383, 
            "rating": "5", 
            "review": "Moving experience. I wish I had planned more time for the visit as watching a Hindu funeral in progress was a touching experience. There was so much happening and there was so much to see around the temple we wished we had scheduled a lot more time for our visit. There is the official tourist office opposite the home for the elderly so be sure you book a guide from them."
        }, 
        {
            "index": 384, 
            "rating": "5", 
            "review": "hire a local guide, be respectful, and you'll be enlightened. Very interesting visit, and informational. A local tour guide gave us the historical background and insight in the rituals, and found it to be quite educational. The overall grounds are impressive, as are the temples. The hillside is a great place to lounge, and though it's a bit awkward being among those dealing with such grief, it is also very important to understanding parts of their religion and culture. Very, very important and historical place."
        }, 
        {
            "index": 385, 
            "rating": "2", 
            "review": "odd mix of a tourist trap and holy temple. it is a functioning crematorium with families mourning recent past family members. It felt odd going to see a cremation with crying families and having it treated like a show with people taking pictures.i was uncomfortable there and did not stay long."
        }, 
        {
            "index": 386, 
            "rating": "5", 
            "review": "A Unique Experience. What a strange and unique experience for a Westerner! Certainly a memorable moment of our Kathmandu sightseeing journey. 100% worth visiting on the way through to Pashupatinath Temple."
        }, 
        {
            "index": 387, 
            "rating": "5", 
            "review": "Very interesting experience. It is such an experience to see the Crematoria especially if it is a first time like mine...of course you don't only see you also smell as the deceased person burns for several hours. Definitely worth to visit. It is as interesting as temples if not more..."
        }, 
        {
            "index": 388, 
            "rating": "4", 
            "review": "Very intensive experience. All that smoke, dead bodies, dying bodies, flowers, food, and stories may start your mind reflecting on everything you can and even cannot imagine. Astonishing."
        }, 
        {
            "index": 389, 
            "rating": "5", 
            "review": "Unmissable but a little ghoulish - a privilege to observe. We couldn't take our eyes off what was happening, it's not something you see every day in the Western world, but a privilege to observe. We felt a little ghoulish though and intruders on other people's pain, but we were amongst 1000's observing the daily rituals. Go with a guide to explain the intricacies of life and death and ceremony in Hindu Kathmandu."
        }, 
        {
            "index": 390, 
            "rating": "5", 
            "review": "cremation ghats. 1st come here when i was 18! all i can say,after seeing this i deal with death easier,bodies in the open being cremated where as over here its grim coffins! :-( its very peace full there and when i die would like to be cremated there!!"
        }, 
        {
            "index": 391, 
            "rating": "4", 
            "review": "Hold your breath. First thing was the smoke and it is hard to to breath it. The whole thing is exotic and kind of freakish. Not a religious person at so it was all lost on me. Interesting non the less. Could not get past the pollution of the air and river. Also even here locals throw garbage everywhere. One of those things worth seeing though"
        }, 
        {
            "index": 392, 
            "rating": "4", 
            "review": "May cause culture shock. This site is fascinating, may not be appropriate for children. One of the most importand Hindu temples in the world. Non-Hindus are not allowed in the temple but can tour the grounds. Behind the temple is the crematorium where bodies are brought for their final purification ceremony of being burned on a funeral pyre. All this is out in the open. Lots of monkeys and religious pundits willing to let you take their picture (tips required!)."
        }, 
        {
            "index": 393, 
            "rating": "5", 
            "review": "Cremation. This is a gruesome area & 1000's were there to see the many burials that were taking place.We witnessed the cremation of an old lady,from strategy to finish?Many relatives were there to see her cremation & after dropping her body (very heavy lady) the men eventually placed her body on the pyre,where the Priest set about starting the fire that quickly roared into life.Red flames shot up through the straw placed on the body to help the wood & body burn effectively.Whilst it was gruesome it was all completed in a very dignified way.Her son was the one who lit the fire & he had to be helped by a number of other relatives as he was near collapse.If you have a queasy stomach - Don't Go.Neither my partner or I want to see another cremation of this kind."
        }, 
        {
            "index": 394, 
            "rating": "3", 
            "review": "A bit expensive for a funeral. It was culturally interesting to see the corpse being prepared for cremation and if you have not been to Varanasi, you may well be impressed. Otherwise, apart from some entertaining Saddhus, all of whom spoke excellent English there is nothing much there for a non-Hindu because you cannot visit the Temple.At $10 per person plus taxi there and back it does seem to offer less value than many other places in Nepal.And dont forget that you can visit some of the most beautiful Buddhist temples for free!"
        }, 
        {
            "index": 395, 
            "rating": "4", 
            "review": "Cycle of Life. There are three different listings on Trip Advisor for the Pashupatinath Temple complex, but I chose to submit a review under this heading since the most interesting aspect for me was observing the Hindu ritual of cremation. If you spend a significant amount of time here, you are likely to witness all stages of the ritual....This has been going on thoughout generations of Hindus, but I noticed one radical modern aspect...when one man was using his smartphone to record a video of the deceased as they set the cremation fire.Westerners can expect to pay a relatively high fee to gain access to the complex, but it's worth the price to gain a deeper understanding of the culture."
        }, 
        {
            "index": 396, 
            "rating": "5", 
            "review": "Interesting..... Very interesting to see but still felt like an intruder upon people's private grief. Found the experience more natural than Varanasi. Some interesting ??? People around the place made it an experience not to be missed."
        }, 
        {
            "index": 397, 
            "rating": "5", 
            "review": "An insight into Hindu funeral traditions. Visiting the \"ghats\" (cremation sites) by Pashupatinath temple is a very interesting experience. It is important for cultural understanding and fascinating to learn about Hindu believes. Most Hindus in Nepal are cremated here, provided they can reach Pashupatinath within 24 hours of death. There is a hospice nearby, which allows people to die within reach of this sacred place. Take your time visiting (and watching) this area and respect the families."
        }, 
        {
            "index": 398, 
            "rating": "5", 
            "review": "An experience not to be missed.. This is the reality for end of life for many Hindus. Part of our trip was cultural understanding and this was an important part."
        }, 
        {
            "index": 399, 
            "rating": "5", 
            "review": "Life and Death. Take a walk along the river to watch cremation ceremonies that are certain to change your perspective on life. Local Hindus are preparing their loved ones for the transition process."
        }, 
        {
            "index": 400, 
            "rating": "4", 
            "review": "Interesting. This is an interesting and educational site to visit. I did have some reservation about visiting a place of sorrow and did not want to be intruding on others bereavement . You are kept to the opposite side of the river to where the bodies are and you are not intruding. It's not a pleasant place but interesting. There are a number of holy men sitting in the area who will allow you sit with them for a photo for a small donation. There are also numerous monkeys in the area."
        }, 
        {
            "index": 401, 
            "rating": "3", 
            "review": "an insight into a different cultural attitude to death and dying. It did make me think a lot to visit this site. We had a Hindu guide who explained the context for the cremations and the rituals involved. I think it is advisable to have a guide definitely worth it. I wasn't too comfortable with cremations as a spectator sport and particularly the cameras and photographs aspect of it - feels too intrusive and disrespectful. However if you are prepared for what you are seeing you can learn more about the Hindu way of dealing with death and maybe think about our own more private ceremonies too."
        }, 
        {
            "index": 402, 
            "rating": "4", 
            "review": "so particular. we arrived at sunset the last day for us in Nepal.... some body burned, smell, some people started puja...the ticket costs 1.000 rs little bit expencive"
        }, 
        {
            "index": 403, 
            "rating": "5", 
            "review": "Soon to be eliminated ?. A fascinating area to view the daily ceremonies and cremations of the deceased.After the pyre has burned down, the remains are pushed into the holy Bagmati River. Note the men searching the river bed for valuables."
        }, 
        {
            "index": 404, 
            "rating": "4", 
            "review": "Interesting!. It didn't seem to be either intrusive or mawkish to watch cremations taking place at the Ghat on the other side of the river. As our guide explained, they have a very different opinion of death than us. In fact, he questioned why we do everything so - in his opinion - secretly and never seem to discuss the manner of a persons death. Here it is all so open so people visiting here should be aware of exactly what they will see. It is all carried out so matter of factly so totally acceptable to witness - all part and parcel of witnessing life in Nepal."
        }, 
        {
            "index": 405, 
            "rating": "4", 
            "review": "Freaky. I saw some old man get cremated and then ashes pushed into the river. Same river some kids were bathing and playing in. Amazing thing to see, if you can cope with this sort of stuff"
        }, 
        {
            "index": 406, 
            "rating": "5", 
            "review": "Enthralling. I had never seen such a sight before and I was stunned. You will be across the river, but you will have a clear view of cremation ceremonies being performed. I was respectful as it was apparent that the families across the river were in mourning. It provided me great insight to the Hindu religion and the local culture. The overall area is in poor condition but you have to remember that Nepal is a very poor country and conditions like that are common. If you think you would feel strange in viewing such an event, you should not visit this site."
        }, 
        {
            "index": 407, 
            "rating": "5", 
            "review": "Incredible, educational. Fascinating, very impressive! We expected it to be \"creepy\" to watch, but it is not, instead it gave us a completely different point of view of life"
        }, 
        {
            "index": 408, 
            "rating": "4", 
            "review": "Fascinating and educational. This is a must see... you can learn so much about the culture, the people and the religion. Don't go the the cremation site itself, really that can be a bit grim to be so close to it all, and somewhat intrusive, but g across the other side of the river and sit opposite the cremation pyres there you can see everything and all the rituals without imposing on the mourners."
        }, 
        {
            "index": 409, 
            "rating": "5", 
            "review": "Interesting. I had heard that the Hindu religion required cremation but it was really brought home when we observed several cremations in various stages. We were also privileged to watch the ceremony for a gentleman that was being prepared for his cremation. Very interesting and educational."
        }, 
        {
            "index": 410, 
            "rating": "2", 
            "review": "Could have given it a pass.. Not really a tourist attraction as such. These are open cremations on the side of a dirty river. The place was very smokey and the temple is off limits for non-hindus. You could sit and watch a cremation happen if that's your sort of thing.The entrance price was 1,000 rupees which I found to be very steep. I thought I'd see it since I'm already in Nepal. Wasn't very educational or special."
        }, 
        {
            "index": 411, 
            "rating": "5", 
            "review": "So interesting to see how other cultures view death!. First of all, I must say I agree with a previous review that the Crematoria is a sacred place which has nothing morbid about the Hindu practice of cremation and what it embodies. It provides a unique sight, rarely experienced by Westerners. The Crematoria is within the complex of the Pashupatinath Temple. A fascinating site, an open air crematorium where you can learn about the Hindu way of dealing with the departed ones; a large and well kept ancient complex of temples, stupas, and old buildings sitting on the river Bagmati where a traveller can get a good eye-view of the cremation process of a Hindu believer. Also an interesting place to learn a bit about the Hindu and Nepali culture. Ceremony: Impossible to describe it! You need to prepare yourself for this experience and be aware that you might find what you see difficult for the Western eye (Western sensibility can be deeply touched as it can be a bit disturbing for Western eyes). Bodies are brought here within the first few hours of death to be cremated; all the family gather round and help to prepare the bodies before they are cremated. According to the rank of the dead person, the body is cremated in the respective ghat. Families share their grief, come together and prepare their loved one for the next journey. In this cultural and spiritual ceremony the feet of the bodies are unwrapped and washed in the holy waters of the above mentioned river. After that, bodies are decorated with flowers and powder. Some holy milk from the temple is poured into the dead’s mouth and after the performance of the family rituals, the bodies are placed on the fire stand (pyres). Bodies, covered in wood, take around 5 to completely cremate. Afterwards, the ashes are pushed and scattered into the holy river. Last but not least, young boys search the river waters for gold and other metals that did not burn.Westerners don't seem to accept death as part of living; Hindus see it as a sacred end. So, this is an excellent opportunity to learn about the Hindu way of returning and disposing the \"empty shell\" (the human body) where it belongs to. Photography: cremations are a very moving affair. Observed all the goings with due respect and decorum, discreetly. I took no photos, as I felt it was rude to intrude. I hate tourists who despite being told not to take photos take their huge zoom lens intruding into families’ grief. It is really irritating for me to observe those who clearly prioritize a photo to show the friends and relatives back home than to a human being's pain.If you choose not to pay the entrancee fee, as a non-Hindus you may observe the cremations and preceding ceremonies from a close vantage point across the river. Absolutely worthwhile as they are so different from our closed doors burials! Not for the faint of heart, though. One may feel terribly impressed here. An amazing cultural, touching and spiritual experience! A heart moving site to the Western traveller. An interesting glimpse of another culture. A cultural curiosity, an eye opener. Not confronting, just outside our experience. I really learnt a lot.Give yourself ample time and indeed hire a site guide (some with faultless English) who may have much to offer (Non Hindus normally may not get to see these rituals anywhere else. I would strongly advise a guide for a better and further understanding and appreciation of Hindu way of life). Great to see how another religion deals with death. Absolutely worthwhile if you want a cultural lesson, a learning experience. Not for the light – hearted as I said before. A life experience! I felt privileged. Touching, moving. A deeply recommended spiritual place. Certainly educational, indeed. A must see to understand this ancestral culture! Westerners, watch out! We have much to learn!"
        }, 
        {
            "index": 412, 
            "rating": "5", 
            "review": "Most Interesting site. From the title I am assuming this is the temple complex and crematorium on the river where the Golden Temple is. Anyway this is a large and very well kept ancient complex of temples, stupas, and old buildings and sits on the river. The Golden temple is on a hill overlooking the river. This is a fascinating site because you can watch and even photograph the city's dead as they are washed and prepared for cremation. A little further along on the river are the cremation pyres and you can follow the procession of the body from the washing to the cremation. It is a large site to explore and some of the buildings sit along a gorge so it is very scenic too. It is similar to Varanasi in India but this place is far better kept and far more beautiful."
        }, 
        {
            "index": 413, 
            "rating": "4", 
            "review": "Open air Crematorium. Worth the visit as you get a glimpse of the differences in culture.There were two funerals whilst we were there"
        }, 
        {
            "index": 414, 
            "rating": "5", 
            "review": "Hindu way of dealing the departed. This (at the Lord Pasupathinath Temple Kathmandu) is a very rare unique place where one can see and study the Hindu way of returning and disposing the \"empty shell\" (the human body) where it belongs-that is the 5 elements of this earth. Pending the rank of the departed, the body will be cremated in the respective Ghat. Any one can observe all the goings with due respect and decorum. Non Hindus normally may not get to see these aspects any where. I would strongly advise a guide (pay NRs 500/0) to give a running commentary on the rituals, their meanings and significance of them for a better understanding and appreciation of Hindu way of life. A visitor will always cherish such a visit to this place in the Pasupathinathf Temple."
        }, 
        {
            "index": 415, 
            "rating": "5", 
            "review": "Fascinating. A fascinating view into how another culture deals with death in a practical and public way. Best seen and explained by a guide which will be cost you about 1000 NPR."
        }, 
        {
            "index": 416, 
            "rating": "2", 
            "review": "Cremations!! My first and last time. How do I begin this... It was the first time during my stay in Nepal that I smelled beef barbecue...That's how bad it was... We watched everything. How the ceremony begins, how the monks sitting by the river sides do consultations for money, how the people bathe in the holy river while cremations are ongoing, all sort of animals are in the river as well. It's a mess. Wouldn't go there again."
        }, 
        {
            "index": 417, 
            "rating": "4", 
            "review": "Watch Your Step. This stop is a must, as the traveler will get a good eye-view of the cremation process of a Hindu believer. But do watch your step, as my companion stepped in a huge cow patty freshly dropped. Made a mess of his shoe."
        }, 
        {
            "index": 418, 
            "rating": "4", 
            "review": "Cremations. You need to prepare yourself for this experience and be aware that you might find what you see difficult . We visited during the monsoon so the river was higher than usual. Interesting, but I felt it was a touch intrusive for my western sensibilites although it prompted good discussion of Hindu beliefs."
        }, 
        {
            "index": 419, 
            "rating": "3", 
            "review": "public creamation in full view!. Interesting place to go to learn a bit about the Hindu and Nepali culture. The river was at a trickle and full of trash when we were there. Saw a ceremony from the other side of the river where people were dipping the body into the river. Very eerie and felt a bit like we're intruding. We did not following when they took the body to get creamated. Saw a large group of monkeys while we were there. The place was not too crowded when we were there at the end of the day."
        }, 
        {
            "index": 420, 
            "rating": "4", 
            "review": "interesting. A shock for those that are not prepared but very interesting. To watch a burning in the way that it is conducted is very interesting and I have been several times now and taken different people with me on each occasion.A great insight to the way Nepal works and its culture."
        }, 
        {
            "index": 421, 
            "rating": "5", 
            "review": "important cultural site. Witnessing the hindu cremations was interesting and humbling. A cool glimpse into another culture.\njust be careful of pickpockets on a crowded day."
        }, 
        {
            "index": 422, 
            "rating": "5", 
            "review": "Funeral rites. This might not be for the faint of heart. So interesting to see the preparations for the cremating of the dead and how the families share their grief with the onlookers on the other side of the river. Young rascals paddle in the river to grab anything of value thrown into the water."
        }, 
        {
            "index": 423, 
            "rating": "4", 
            "review": "Very interesting. The river was very low when we were there which made for a vivid impression. We watched parts of some ceremonies from the bridge. We had school age children there with us so there was a lot of good discussion on how different cultures and religions do things."
        }, 
        {
            "index": 424, 
            "rating": "5", 
            "review": "Three Sisters. How interesting was that had a lengthy stay here and couldn't believe what we saw. I am very glad that we are not in that culture"
        }, 
        {
            "index": 425, 
            "rating": "5", 
            "review": "Fascinating. This was an experience like no other. Make sure you allocate at least an hour to observe and learn about the public cremations."
        }, 
        {
            "index": 426, 
            "rating": "3", 
            "review": "Far Better Spiritual Holy Places in India - But Good For Beginners.. .I accept my feelings may not be as strong as others as I've visited far better holy places in India and seen the funeral pyres in more dramatic settings. Once again, if you've been to somewhere like Varanasi then you're not going to be terribly impressed here.The first thing that hits you is that there's hardly any water in the river - this is apparently due to the Nepalese goverment - so we were told. So you've got a fairly empty river filled with sand bags trying to direct the trickle of water that's left. And what you're left with is stagnant polluted water filled with ashes and debris which should be flowing away 'to a better world' - but is actually only travelling a few metres. It's not exactly the Ganges.Despite tourists being told not to take photos of those that have died, you'll still probably be irritated by someone with a huge zoom lens intruding into a families grief. Clearly it's better for some to get a photo to show the folks back home than care about someone's pain.Guides will most likely take you here in the daytime - but there is no atmosphere. You really want to be here from around 7pm when there's music and chanting and various other rituals. Only then will you experiece some magic.What I found incredibly sad about this place - and a real wake-up call - was to see children glue-sniffing, and others chain-smoking. It is quite bizarre to see families in grief with the loss of a loved one, while amongst them are kids sniffing glue out of polythene bags, and their parents high on other substances. It would appear that this is a place where those that are hooked on substances also come to sleep at night, as to be honest, I've not seen these people here in the daytimes. So it's your call when you would prefer to visit.I love to see the sadhus - but please accept that the sadhus here are fakes - these are people who dress up to make money out of tourists. But that's fine as long as you accept what's going on. Regardless, they make great photos.Also, if you are not a Hindu then you have to accept you're not going to see the best of what is available. You will not be allowed inside the best temples. So really you're only getting a peek of what is available and going on.If I had not been to far better holy places I would have scored this area higher, as this is exactly the type of experience I like to have in such countries. But the truth is that there are better places, more spiritual places, and more atmospheric places. And ALL of them come alive at night. But if this is your first holy place it's not a bad for a starter, but it is rather limited. PLUS, this is the only holy place I've been to in the world where I've had to pay an entry fee - and a high one at that. Shame the Nepalese goverment aren't plowing all the money they are making out of tourists and putting it back into the community..."
        }, 
        {
            "index": 427, 
            "rating": "5", 
            "review": "We were privileged.... On the day our party went to visit, we were privileged to see a Gurkha cremation. It was a very moving affair, with a salute from his regiment. I took no photos, as I felt it was rude to intrude, but being able to pay my own respects as a UK citizen, to one of the bravest regiments in British history,was my pleasure.The area is quite small compared to Varanassi and ceremonies are less formal than our own funerals, but no less significant. Be careful that you observe the wind direction, as it can blow cremation smoke right across the river and into everyone's eyes."
        }, 
        {
            "index": 428, 
            "rating": "5", 
            "review": "Public Crematorium. This was a life experience.....we were only there for 2 hours and 4 bodies were bought to be cremated. We were spectators to a very real, touching, moving, cultural and spiritual ceremony for cremating their dead.The feet of the bodies were unwrapped and washed in their holy water (what we saw was a squalid, dirty and rubbish strewn river) and yet this was their holy water. The bodies were dressed, de-robed discretely, robed again and decorated with flowers and powder. The holy milk from the temple was poured into the mouth of the dead and after the family rituals were performed, the bodies were placed on the fire stand, whereby fire was placed in the mouth and the body set alight, covered in wood and left to cremate for approx. 5 hours before the entire pile of burnt wood, ash etc was then pushed into the holy river.An amazing cultural experience!!!!"
        }, 
        {
            "index": 429, 
            "rating": "5", 
            "review": "Crematorium. Really interesting. Exposure to another culture.interesting to see opportunity to have photos with local priest.again relax and spend as much time as you like"
        }, 
        {
            "index": 430, 
            "rating": "4", 
            "review": "Cultural experience. A must see to understand this ancestral culture where the long ritual unify the family around the lost one. This is touching and very spiritual experience."
        }, 
        {
            "index": 431, 
            "rating": "4", 
            "review": "Different culture. You will visit the holly place where deads are cremated and stop reencarnations... You have to know what you are going to isit.. You will see the bodys and also smell them meanwhile they are cremated.. If you havn't been before in Varanassi just be prepared"
        }, 
        {
            "index": 432, 
            "rating": "1", 
            "review": "Some people may enjoy the cult. I did not.. That is where families have the bodies of dead relatives washed at a dirty river, then burned at open air and the ashes thrown at the river afterwards. Not a good sight and a very bad smell. Hussain Said Mourad"
        }, 
        {
            "index": 433, 
            "rating": "3", 
            "review": "interesting religious place. It is nothing WOW, but it was worth to pass by and see the religious building. You cannot go in, but observe from the outside."
        }, 
        {
            "index": 434, 
            "rating": "5", 
            "review": "extraordinary experience. What an honor it was to experience this place. While we were there a cremation was taking place and a sevite was preparing for the evening Arati. The Sadhus were in place and more than willing to be photographed...prepare to pay them 100 rupees and they are very happy to let you click away."
        }, 
        {
            "index": 435, 
            "rating": "5", 
            "review": "Very unexpected. During our sightseeing tour we were taken to the Bagmati river and really had no idea what we were about to see. We talked with many locals along the way until we came upon lots of smoke. A local man than proceeded to explain that what we were looking at was in fact a cremation. He explained the beliefs, the procession and the family involvement in such a way we were really caught in the moment. His English was faultless and the amount of knowledge given kept our attention. Whether or not you decide to use the services of a guide is a personal choice but in this case it really turned out to be of great benefit. A sad but unique place to visit that came totally unexpected."
        }, 
        {
            "index": 436, 
            "rating": "4", 
            "review": "A heart moving site. Very unitque site along the river to view the cremations of deceased Hindus - with all the ritual involve. You will need to buy an entrance ticket. The you will be approached and pestered by men who want to be your guide for a few rupees. Recommend not to say a single word when asked ''where you come from''. One of them followed us constantly around, greatly diminishing the pleasure viewing this place."
        }, 
        {
            "index": 437, 
            "rating": "2", 
            "review": "Cremation. If you must see it, spend only a little time. It can bring back bad memories. It is a truly different way to bury your family"
        }, 
        {
            "index": 438, 
            "rating": "4", 
            "review": "Interesting to the western traveler. Yes, there are really outdoor cremations here. Non-Hindus may observe the cremations, and preceding ceremonies from a close vantage point across the river. For the western traveler it is all an interesting glimpse of another culture. Small entry fee required."
        }, 
        {
            "index": 439, 
            "rating": "5", 
            "review": "A place to see. You have to see it , to understand how is the way to the other world in Nepal. Sometime you really feel unconfortable , watching the cremation process , and the intimity of the families."
        }, 
        {
            "index": 440, 
            "rating": "5", 
            "review": "Next to the Pashupatinah Temple. While you will only be able to see the outside of the temple, you will be able to view the Crematoria. It is immediately adjacent to the temple and you can observe what takes place by simply crossing the river and standing opposite the Crematoria. You will still be able to observe what is happening, but will be far enough away to not interfere with what is happening and more importantly not offend.Standing on the opposite side you can observe and take pictures / video as you like. Simply do so with quiet and respect."
        }, 
        {
            "index": 441, 
            "rating": "3", 
            "review": "Didn't want to go here. It really seems like this place shouldn't be opened to tourists. It's very strange that the burning/passing over of bodies to the next life is done in such a public/pay for entry way.\nI don't really recommend tourists \"intruding\" on this place. It's just like tourists rocking up to your local cemetery and watching a burial."
        }, 
        {
            "index": 442, 
            "rating": "5", 
            "review": "Could be a bit disturbing for Western eyes.. What an amazing, spiritual place. It was a trifle unsettling for us as Westerners but we travel to experience new and different things and this was certainly educational. Not confronting, just outside our experience. Definitely recommend it."
        }, 
        {
            "index": 443, 
            "rating": "5", 
            "review": "Interesting and worth visiting. This is a sacred place to the nepalese and I found it very interesting and beautiful. Its worth reading a little bit about their cremation traditions before going. Also, there are several palm readers in the area which can be an interesting and fun experience. But i suggest having a guide as you will need translation."
        }, 
        {
            "index": 444, 
            "rating": "2", 
            "review": "Creepy. Unless you're into the macabre, there are better things to do. While family members grieve, tourists gawk from nearby. It's unseemly."
        }, 
        {
            "index": 445, 
            "rating": "5", 
            "review": "Take time to reflect here. This site has a foreigner entry fee, so despite it being very sacred and intimate, it is open to outsiders. I recommend hiring a driver who is willing to wait while you experience this riverside crematorium. Be respectful with photography, as families are having services for their loved-ones. Enjoy the sacred monkeys an cows ambling along the water. Sit at the river's edge and reflect, walk the temples, see the sadhus. Many younger locals will offer to guide you through this site for a fee, but I recommend just taking in the Crematoria silently and solely."
        }, 
        {
            "index": 446, 
            "rating": "5", 
            "review": "Nothing \"Morbid\" About It. The Crematoria is a sacred place. There's nothing \"morbid\" about the Hindu practice of cremation and what it embodies. The Crematoria is located within the larger complex of the Pashupatinath Temple. We went not knowing anything about the site, but a young, polite, well spoken Nepalese student came up to chat. I expected he'd eventually tell us he worked as a guide and would ask if we would like him to explain the site. He was such a nice kid we agreed and spent the next several hours learning about the temples and the Hindu practice of cremation. We saw nothing remotely close to what one reviewer suggested might be considered \"morbid\". Male members of families genitally wash the body of their love one following a sacred protocol and move it to where the spirit is released by cremation. Male sons perform the sacred rights which include them entering the temple after cremation and remaining in solitude for 13-days. One year from the sacred passage the they return to perform a second period of solitude. It is not possible to watch without feeling heartfelt sorrow for the families and reflect on the more typical western approach to burial where we saturate our love ones with formaldehyde, place them in a box and lock their spirit 2 metres underground. Soaring with eagles makes more sense. We have much to learn. The site is large, give yourself ample time and indeed hire a site guide they have much to offer."
        }, 
        {
            "index": 447, 
            "rating": "4", 
            "review": "Biggest BBQ in Kathmandu!!. If you've ever wondered about cremation ceremonies, then this place will answer every question you ever had. Not for the squeemish or the timid, this place can hit all new levels of what you might consider morbid, or dark...You will see people being cleansed in the river, adorned with colorful paints and chalk, prayed upon, and then put on fire and burned to ashes."
        }, 
        {
            "index": 448, 
            "rating": "5", 
            "review": "Need a guide to appreciate this place. Not usually a place on the tourist trek, but a friend of a friend died while I was in Kathmandu and got cremated there, so I understood some more about the people and their customs after having been to this holy place. It puts death into the perspective of life."
        }, 
        {
            "index": 449, 
            "rating": "5", 
            "review": "JDE0911. I found this place very interesting. The night I went there, there were prayers with three priests with fire and chanting with the people congregated there. It was very respecful and peaceful. There were a lot of people when I went and a few cremations underway. The only things is with the dust and the smoke in Kathmadu at the moment it was a all a bit polluted...."
        }, 
        {
            "index": 450, 
            "rating": "5", 
            "review": "Higher understanding. Observing the cremation process will lead you to really give yourself a thought about your own belief system."
        }, 
        {
            "index": 451, 
            "rating": "4", 
            "review": "The Crematoria. Put your \"big boots\" on for this one. The river is extremely polluted and it is difficult watching the young boy who trolls the water for coins near the cremations."
        }, 
        {
            "index": 452, 
            "rating": "5", 
            "review": "Unique Experience. If you are in Kathmandu, take advantage of this experience. There are probably very few places in the world you can see this. The air quality is poor due to the constant burning, and you will come away with your clothes smelling awful. But the cremation process is extremely interesting."
        }, 
        {
            "index": 453, 
            "rating": "4", 
            "review": "Glad I went but I felt uneasy being there.. It was a unique experience but I felt uncomfortable intruding on a family's grief. Our guide took us there. We were on the other side of the river from the cremations. I got some good photos of \"holy\" men in bright orange dress on the tourist's side of the river."
        }, 
        {
            "index": 454, 
            "rating": "4", 
            "review": "A unique experience. I didn't fully understand where our guided tour was going and so this place was quite a shock. It did feel wrong and intrusive to have a crowd of picture taking tourists watching multiple ongoing funerals. The bodies are placed on a pedestal and covered by flowers. After the family has said their goodbyes, a worker covers the body with straw, kindling and firewood, then lights it up. Watching these bodies burn is a unsettling affair, and definitely not for the sqeamish. Although it sounds odd, the worst part for me was how they treated the \"holy\" river. The worker casually throw all the sticks, plastic bags, and all sorts of garbage in the water forming a huge cesspool, then they sweep the people's ashes into the same mess."
        }, 
        {
            "index": 455, 
            "rating": "5", 
            "review": "...unique. sounds, smells and sights - you get an overload charge, but that's the point of being there as a tourist"
        }, 
        {
            "index": 456, 
            "rating": "4", 
            "review": "great place to see how bodys are cremated. great place to sit, relax and reflect as bodies are brought down and cremated. the place is big and there is plenty and room to visit temples close by"
        }, 
        {
            "index": 457, 
            "rating": "3", 
            "review": "Disturbing to intrude on families grief. A very rare experience which I am glad I visited but felt rather uncomfortable throughout the visit.We had an unasked for guide who we didnt want and who complained bitterly that my tip was too small!There were several cremations taking place at the time of my visit and the air was redolent of scented woods used for the cremationsThe sacred river was a cess pit of the detritus of Kathmandu and my one question to the unwanted guide was why surely if this place was so sacred to them why on earth did they not at least clean up the section running through the temple. He chose not to answer!"
        }, 
        {
            "index": 458, 
            "rating": "5", 
            "review": "Definitely go unless you're squeamish. You can'tbe thereforalong time, as the smokeis quite dense during most of the day, but it's an experience not to be missed. This is different from what you see in other places like Varanasi in India, so well worth going. It's very important to be respectful and not take pictures from close up. A good guide is also very useful, as there are specific rituals that are important to know about as you watch it. "
        }, 
        {
            "index": 459, 
            "rating": "4", 
            "review": "a unique sight, rarely experienced by Europeans. A smaller albeit more comprehendable institution then in Varanasi, this site depicts the local burial customs, gives a unique smell to the ceremony, amidst an ancient great temple setting, gorgeous complex."
        }, 
        {
            "index": 460, 
            "rating": "3", 
            "review": "Macabre. If you are queemish Don't go there. Although interesting part of the Hindu culture. I felt it was too confronting and the river where they empty the ashes was filthy. 100 metre from where the ashes were tipped people were searching for \"treasure\" in the form of gold from jewelry and teeth"
        }, 
        {
            "index": 461, 
            "rating": "5", 
            "review": "WOW. I witnessed the entire process of the Hindu cremation. I found it fascinating how the body is \"processed\", the way the family mourns, the idea that the ashes fall in to the Gangues and the eye candy of all the Hindu priests dressed in all their colour! If you go to Kathmandu, spend time here to appreciate the religion."
        }, 
        {
            "index": 462, 
            "rating": "3", 
            "review": "crematoria. nice architecture but awful smell of burning wood (and whatever else!). Felt a bit awkward - like gatecrashing someone's funeral."
        }, 
        {
            "index": 463, 
            "rating": "5", 
            "review": "Wow. Sitting across the river watching families say goodbye and cremate their loved ones is quite weird for someone from the West but it a strangely intimate and humbling experience.\nBeware the so called holy men - they are simply beggars chancing their arm with gullible travellers."
        }, 
        {
            "index": 464, 
            "rating": "5", 
            "review": "We loved the monkeys, the monks and the architecture up on the hill above. The crematorium was interesting and many bodies were being cremated including a military cremation, but we liked wandering up the hill best. So many baby monkeys and the long-haired old monks sitting outside the small buildings that were so perfectly aligned was interesting."
        }, 
        {
            "index": 465, 
            "rating": "3", 
            "review": "Seeing a person cremated is intense!. This is a very intense experience if you happen upon an actual cremation. This could be very violent looking to young people."
        }, 
        {
            "index": 466, 
            "rating": "5", 
            "review": "This was an eye-opener!. so interesting. They actually were cremating people in shrouds while we and many others watched. They burned the people on these concrete stands, then swept their ashes into the river. Then young boys searched the river for gold and other metals that did not burn."
        }, 
        {
            "index": 467, 
            "rating": "5", 
            "review": "Very Interesting. A eye opening experience. Be prepared. We enjoyed it. Life and death all right in front of your eyes."
        }, 
        {
            "index": 468, 
            "rating": "4", 
            "review": "impressive. you should not bring your children there... even us were awkward...\nBut this is another culture and it's intersting to see bodies burning on the shore of the river..."
        }, 
        {
            "index": 469, 
            "rating": "5", 
            "review": "Not for the light hearted. Watched several bodies being prepped then burned (although they are wrapped in cloth). Fasinating part of the culture. Worth the visit............"
        }, 
        {
            "index": 470, 
            "rating": "1", 
            "review": "Creepy!. The way they cremated the people seemed like a nice ceremony to begin with but, by the time they were all ashes - the family have left and there's a lone man sweeping the remains into the river where a few meters down-river there are people washing their clothes. There were a few con jobs there, pick pockets and the like. The 'saints' that offered to have a picture with you (and then ask you for money after!!) weren't particularly nice and other people throwing rice at you and giving you an unasked for 'blessing' - which they then ask you to pay for too. The creepy men taking pictures of you were the worst part and the poor mentally afflicted weren't what I would call a prime part of the attraction.I would NOT go unless you are really really really really interested in the Hindu culture!"
        }, 
        {
            "index": 471, 
            "rating": "5", 
            "review": "Eye opening. Growing up as a Catholic I guess I always just thought people were either buried or cremated behind closed doors. Going here was a real eye opener as it allowed me to see how another religion deals with death. Bodies are brought here within the first few hours of death to be cremated, all the family gather round and help to prepare the bodies before they are cremated. Then they watch until the ashes are scattered into the river. It's strange to watch as I could not imagine myself being so hands on and involved, it was beautiful to see families come together and prepare their loved one for the next journey. While there you are told the significance of the river and the reasons for every step in the cremation. It really is beautiful to see. We did not stay for an entire cremation as they take up to around 4 hours but I'm definitely happy I went as it opened my eyes greatly to a different way of living and I really think it's something everyone should see for themselves"
        }, 
        {
            "index": 472, 
            "rating": "1", 
            "review": "The crematoria ground. Thought Varanasi (India) on the Ganges was something, but this was so dirty, cows dog and burning people all together. if you;re stomach is not to strong don't go there."
        }, 
        {
            "index": 473, 
            "rating": "3", 
            "review": "Sad. Very interesting and sad, bodies are change to dust, seeing the whole ritual is very interesting"
        }, 
        {
            "index": 474, 
            "rating": "1", 
            "review": "Some things should be left sacred.. I know different cultures celebrate life and death differently, but I could not bring myself to attend this event out of respect for the families of the dead."
        }, 
        {
            "index": 475, 
            "rating": "4", 
            "review": "An Experience. As a Christian I had reservations about visiting this place. It felt disrepectful to attend someone's burial and to watch someone being burned. However, I was able to see how the family participates throughout the ceremony and this is their way of dealing with death. An experience to see at least once."
        }, 
        {
            "index": 476, 
            "rating": "5", 
            "review": "Sounds gruesome --- but a beautiful ceremony. I had very mixed feelings. I was squeamish upon seeing the funeral pyre. Then I witnessed the beautiful ceremony and traditions unfold. It was a beautiful and intelligent way to say goodbye. See it."
        }, 
        {
            "index": 477, 
            "rating": "3", 
            "review": "Strange place to Visit.. Unfortunately, these burning ghats are within the Pashupatinath Temple, that is rather expensive to enter. And once here at the 'crematoria', you stand out vividly as an outsider watching something that probably should be left to the families. We were amazed at western tourists taking pictures, thinking what it would be like to have a throng of Hindu travelers show up at the graveside funeral of your own grandmother and start snapping pictures. It was just weird and creepy. I think it just added to the overall despair of the temple complex, the poor Bagmati River, and the sad caged deer at the other end of the temple border."
        }, 
        {
            "index": 478, 
            "rating": "5", 
            "review": "place full of emotions. I liked to see how families said good bye to their dead person. the simple ceremony is full of emotions. Contrast between life and death"
        }, 
        {
            "index": 479, 
            "rating": "5", 
            "review": "Life, Death, Colour and Smoke. We were here with our teenage children. We are all used to the third world and confronting death. This place is all you expect it to be. Yet another place in Nepal that makes you contemplate your mortality and place in the universe. You feel a little voyeuristic watching other peoples grief. Yet it does us good to see death in manner that is hidden in our society. Then there are the colorful hollywood holys looking for some money for a photo. Wafts of smoke, monkeys everywhere, cremations going on, ashes being dumped in filthy polluted water.Local on lookers, crumbling ancient buildings...it's a place you need to visit. All part of the rich tapestry of life."
        }, 
        {
            "index": 480, 
            "rating": "5", 
            "review": "Very moving and sacred site. The significance of the site is powerful. There were several cremations taking place and it was very interesting to watch the processions."
        }, 
        {
            "index": 481, 
            "rating": "5", 
            "review": "crematoria plenty. you can see everyday crematoryu procesion, crematory working .iys so plentyposibilites"
        }, 
        {
            "index": 482, 
            "rating": "5", 
            "review": "A best way to explore hindu cluture.. It was really interesting to visit this temple and is around. you have enough change to see cremation of death people directly and Nepali culture how the do when people die. you also could explore Pasupati temple or Crematoria from many ways."
        }, 
        {
            "index": 483, 
            "rating": "4", 
            "review": "By Crematoria, do you mean Pashupatinath Temple Complex and Funeral Ghats?. If this refers to the Pashupatinath temple complex, then calling it the Crematoria is a bit of an insult, as it is far more than just the place where many Kathmandu-ites receive their funeral rites. The temple itself is one of the holiest in Nepal and contains a 5-faced Lingum (admission to Hindus only). There is a deer park and many smaller shrines, lingums, chaityas and areas of interest. Watch out for the monkeys; they can be vicious if teased or offered food. Watch out for the sadhus -- they can be expensive if you take their photo."
        }, 
        {
            "index": 484, 
            "rating": "4", 
            "review": "Very moving. This is not a place to like but to respect. This part of the culture is so different from ours that I just had to stand and stare. Hopefully no-one noticed"
        }, 
        {
            "index": 485, 
            "rating": "3", 
            "review": "Interesting.. Very morbid watching the families grieve and burning their loved ones. Did not enjoy this at all but that is only my view. River flowing past the Ghats heavily polluted and Yogis demanding money for photo's. Not a side of Nepal I would recommend."
        }, 
        {
            "index": 486, 
            "rating": "5", 
            "review": "A cultural lesson.. So interesting to see how other cultures view death. I really learnt a lot here."
        }, 
        {
            "index": 487, 
            "rating": "5", 
            "review": "This was a learning experience!. You learn the customs of other countries, and it is good to see the way other people see death.We don't seem to accept death as part of living, they see it as a sacred end. I, myself, would not drink the water where they buried the dead people. That part was a little repulsive to me."
        }, 
        {
            "index": 488, 
            "rating": "3", 
            "review": "A cultural curiosity. A place to see the funeral ceremony if you are interested. It can be observed discretly from the other side of the river."
        }, 
        {
            "index": 489, 
            "rating": "4", 
            "review": "Not for the faint of heart. The day we visited there where 5 platforms in use, after the fire is out the remains are shoveled into the river,people were also in the river looking for coins?A different culture for sure!"
        }
    ]
}