{
    "category": "Kathmandu", 
    "entity": "Budhanilkantha", 
    "avg_rating_stars": 4.354285714285714, 
    "review_count": 175, 
    "rating_stats": {
        "poor": 4, 
        "average": 18, 
        "terrible": 0, 
        "very_good": 65, 
        "excellent": 88
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "Sleepig Vishnu. Budhannilkatha is a temple where you can see lord vishnu sleeping on Sesnag (snake). A good temple to visit in kathmandu. The temple is however small in size. being there with my brother in the month of june. A good place to visit."
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "ALSO CALLED JALANARAYAN TEMPLE. There is a stone image of the Lord sleeping on a coil of serpents. In a small water body. There is a rudraksha tree in the complex."
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "nice statwe. budhanilkhantha is one of the bishnu temple in kathmandu and one of the largest statchu in all around world really nice"
        }, 
        {
            "index": 4, 
            "rating": "5", 
            "review": "Amazing Jal Narayan statue. I was told that the entire statue was made of the holy salagramam represneting Lord Vishnu. Whether that is true or not - the sight of the gigantic lord sleeping on his back with a relaxed fold of the left leg and the four hands with shankh, chakra, gada and padma, and his beautiful chiseled face was a sight to behold. Om Namo Narayanaya!!"
        }, 
        {
            "index": 5, 
            "rating": "4", 
            "review": "Lord Vishnu. A lovely and peaceful place. Must visit. Ask the locals about the story of its origin. There is a resort nearby as well - Park Village Resort which is also a great place to go for picnics or just to be away from the city for some peaceful time out."
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "Bishnu Bhagwan. Lovely temple of Bishnu Bhagwan. We go there and always come up energised and fulfilled our wish. We would highly recommend. After visiting the temple we went to Kapan Sekuwa Restaurant and had our lunch."
        }, 
        {
            "index": 7, 
            "rating": "5", 
            "review": "Largest sclupture of sleeping Bishnu. Budhanilkantha Temple, located in Budhanilkantha, Nepal, (Nepali: बुढानीलकंठ मन्दिर) (literal: \"Old Blue Throat\") is a Hindu open air temple dedicated to Lord Vishnu. Budhanilkantha Temple is located at the base of the Shivapuri Hill and can be identified by a large reclining statue of Lord Vishnu. The temple's main statue of Budhanilkantha is considered the largest stone carving in Nepal.According to one story, a farmer and his wife once struck a figure while plowing the field, which caused it to start soaking blood into the ground. This turned out to be the figure of lost deity of Budhanilkantha, which was recovered and placed in its present position.A legend states that King Pratap Malla (1641–1674) had a prophetic vision. This vision resulted in him believing that kings of Nepal would die if they visited the Budhanilkantha Temple. Nepali monarchs after King Pratap Malla have never visited the Temple in fear of the prophecy.Budhanilkantha is one attraction of Kathmandu valley as it carries different history of Nepal"
        }, 
        {
            "index": 8, 
            "rating": "5", 
            "review": "Om Vishnu. Om Vishnu. Om Vishnu.. An early drive to the temple shrine on a rainy day did not hinder our enthusiasm to visit the place. Worth a visit and we did our rituals and puja. Nice place to visit."
        }, 
        {
            "index": 9, 
            "rating": "4", 
            "review": "The Sleeping Vishnu. It's a must visit temple. The sleeping statue is splendid. It is so well maintained and kept nicely."
        }, 
        {
            "index": 10, 
            "rating": "5", 
            "review": "The Sleeping Bishnu. When you want to see Bishnu, the Caretaker God according to Hindu religion, in the same posture as described in the scriptures, then you find him in Budhanilkantha. One of largest statue made from Single stone is a masterpiece of arts and crafts in Nepal. This place is worth visitng for anyone Hindus or Non Hindus."
        }, 
        {
            "index": 11, 
            "rating": "4", 
            "review": "What a amazing temple to visit.. Very difficult to reach this place. Probably have to hire a taxi to reach here. Temple and the statue is splendid ! However , photographs are not allowed in here .So watch out !"
        }, 
        {
            "index": 12, 
            "rating": "4", 
            "review": "Hindu Pilgrimage Budhanilkantha. It is a must visit temple for Hindus, situated at the base of Shivapuri Nagarjun National Park, at the north of Capital City Kathmandu of Himalayan country Nepal."
        }, 
        {
            "index": 13, 
            "rating": "2", 
            "review": "Overgrown, Dirty and poorly maintained. I have been In Kathmandu for long enough now, the I am finally trying to hit some of the less traveled and visited sites here in the KTM Valley. Today was Budhanilkantha day for us. Fairly close to town, just 10 minutes north of the Ring Road at the North end of town. This 7th Century Carving lays in a pool of green slimy dirty water, surrounded by a yellow concrete fence, and a dirty tarp overhead. The rest of the Temple site is totally unmaintained and falling apart. There aren't really any , or many photo ops here, and locals will scold you if you hold your camera over the fence to take a picture, but everyone including the Hindu's do it. Otherwise this is about a two minute viewing,, kind of like a display at the zoo, and that's about it. There are a few vendors selling the usual stuff nearby but there's really nothing new here."
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "Sleeping Vishnu. Beautiful and serene face Lord Vishnu in a sleeping posture on water creating an illusion like he is floating on water. Very peaceful, calm and enjoyable place."
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "My lord....Vishnu. He, saviour of the world...reside on sheshnaaga submerged partialy in a pond. There, i described it, and feeling proud to do so. Love for him is undying in me... but when i took my wife here, she held me in disbelief. No word was spoken and we both were as if in the court of lord vishnu himself...where he is making us feel his presence. Too much said...but one should come here just to be with Him, and he will find himself. Still overwhelmed...!"
        }, 
        {
            "index": 16, 
            "rating": "4", 
            "review": "Temple with Historical value. It is a historical temple where you can a see a big sculpture of Hind lord Vishnu lying on a ses nag. It was discovered by a farmer during irrigation and later on recovered fully and converted in to a temple. Cameras are not allowed near it. There a Vedic school in this campus we saw 20-25 children learning and chanting slokas from a hindu sastras really impressive. They are children who lost there parents does not have any guardian, they study here, stay here and learn here. Aashram is run on charity. While visiting do spend some time with children and give some donation for ashram operation if you feel so."
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "Bishnu. Went with my family to see sleeping Bishnu and prayed for about 30 minutes.felt so good and lucky after visiting this place."
        }, 
        {
            "index": 18, 
            "rating": "5", 
            "review": "Good Place to Visit n Get Blessings. The Big Sculpture of God Vishnu Jee in the Midst of Small Pond Resting on Snake Bed.The Statue Is Carved in Black Stone and The Crown is made of Gold.It was Very Calm And Peace when we went to seek Blessings of Lord Vishnu Jee"
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "Good place to visit. Big Sculpture of god vishnu ji...Lete huye vishnu ji sesh naag par.....adbhut hain.....But mob.or camera use na karen.....dekh lene par vahan ke log pani me dip kar ke vapas karte hain....Bahar jo board hai us pe nepali or hindi me likha hai mob. Or camera use na karne ke bare me but English me bhi hona chahiye.....Pratima ko side se jhuk kar jarur dekhen ....pratibimb rochak hai..."
        }, 
        {
            "index": 20, 
            "rating": "4", 
            "review": "Beautiful Supine Vishnu. The deity is situated in the midst of a small pond resting in a supine position on the coils of Seshnag. The statue is carved in black stone and the Crown is made of Gold. Its a unique position for the deity which I have not seen earlier. A small replica may also be seen in Pashupatinath Temple, also in Kathmandu."
        }, 
        {
            "index": 21, 
            "rating": "4", 
            "review": "Sleeping Vishunue built in 7th century or so. This is Hindu holy place where many plgrims visit. In the middle of a square pond, it lies very peacefully on snake bed. Only Hindu can go inside. A little away from noisy downtown, it is located in the north, it was rather calm."
        }, 
        {
            "index": 22, 
            "rating": "4", 
            "review": "Believe it or not. Revealing Mythological truth....... Elixir or Poison?\nSafeguarding the human community by accepting the individual pain,"
        }, 
        {
            "index": 23, 
            "rating": "5", 
            "review": "Peaceful and very much anticipated. The environment is so much better and its good to relax here for out of noisy kathmandu. Budget Adventure Treks & Expeditions had been great recommendation for this tour. This is a fabulous place to visit. I was unlucky for the good view but was fantastic environment for chill out of noise..."
        }, 
        {
            "index": 24, 
            "rating": "3", 
            "review": "Going with average but could be poor. What! Really! This!Talk about underwhelmed. My first temple experience in Nepal but it was decidedly average. It is quite small and not a temple complex as I was expecting. The microbus is fun out here, unless you're a foreigner of foreign height and therefore can't actually stand up in minibus when it's overflowing with people.Actually I got kicked out, asked to leave, despite being told by a Hindu family outside that everyone is welcome in a Hindu temple, I don't think anyone told the guy inside! And no, i didn't do anything offensive or get my camera out, just asked to leave as none hindu.Could have so easily given this a miss taking into account all the effort, still it was the starting point of the days schedule taking in here, Kopan, boudhanath and the Crematoria, which were all so much more interesting.I'd say you could give it miss if it doesn't fit in your schedule."
        }, 
        {
            "index": 25, 
            "rating": "4", 
            "review": "Journey as much fun as the destination. From Kantipath, near to Thamel, any number 5 micrrobus and some of the new green and white buses go out here. I think it is always fun to take local transport and this route is good, taking about 20-30 minutes depending on traffic (and only costing 20-25Rs). A short walk up takes you to the reclining Buddha in a pond, off limits to non-Hindus but perfectly visible for the outside. If you are feeling a bit more energetic, Shivapuri national park is a walk up the hill where you can visit some Buddhist temples and enjoy the beautiful forest paths that meander around this lovely area."
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "Peaceful & Blessing. A wonder on the way to the mountains, a hidden gem! A beautiful Vishnu temple. Amazing old stories of discovery, a resting place for Lord Vishnu on his way to meet his dear friend Lord Shiva in the Kailash mountains, Budhanilkantha temple is a place for peaceful worship and calm."
        }, 
        {
            "index": 27, 
            "rating": "5", 
            "review": "wonderful place. i had been to this place it is completely beautiful and yes it is peaceful and all the people will love to be here."
        }, 
        {
            "index": 28, 
            "rating": "3", 
            "review": "needed to clean around the temple. The stone carving really incredible Nepali style,The story is very interesting. Many Religious people visit everyday."
        }, 
        {
            "index": 29, 
            "rating": "4", 
            "review": "If you are staying a little bit longer. Can be reached by local minibus which runs every few mins. From near Garden of Dreams. Takes abt 30mins because of frequent stops but drops you near entrance gate - at the top of the street. It is a beautiful, peaceful reclining statue of Vishnu and the temple area is interesting. There is a monastery kitchen or, back down the road, on the left, just near the bakery, there is a nice, cheap, garden restaurant to relax in. Set back a little from the road. Probably only worth it if you have already done the other major sights but a nice thing to do."
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Worth a visit. I'm so glad that we got to visit this place and pay our respects. It's a very peaceful place with a calming feel."
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "Spectacular Carving. The single stone carving of a larger than life statue of the Hindu Lord Vishnu is a visual feast for the eyes ! I am falling short of vocabulary to describe this wonderful art work !"
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "Sacred Place to visit. Budhanilkantha literally means “old blue-throat’, carved from a single block of black basalt rock is 5 meters in length and it lies in a reclining position inside a recessed tank of water. Vishnu’s legs are crossed and the eleven heads of Shesha cradle his head. Vishnu’s four hands hold objects that are symbols of his divine qualities: a chakra, a conch, a lotus flower and the club (gada)."
        }, 
        {
            "index": 33, 
            "rating": "4", 
            "review": "The vibe is happy here. Budhanilkantha or sleeping Vishnu is a temple in northeast Katmandu. The temple compound contains a large reservoir with a Vishnu statue reclining on a bed of cobra coils. When I was here in 1998 the place was packed and the day was dreary; on this visit there was a marriage, a few tourists, and the day was glorious. There were devotees making a puja and a woman worshipper was tossing rice onto the feet of the statue as part of the ceremony. I felt almost invisible as I went around taking photographs of Vishnu, the marriage ceremony, the puja, people, and whatever else interested me. The vibe is happy here."
        }, 
        {
            "index": 34, 
            "rating": "4", 
            "review": "Vishnu with snakes. At this temple on the outskirts of Kathmandu (a little more than a half-hour drive northeast from the Thamel tourist area) is a big sculpture of Vishnu lying on snakes in water in a shelter (with a fence around and a big cloth cover on top) at the inner area of the temple grounds on which are also a few smaller shrines and a few two-story buildings.There was quite a bit of crowd at the outer area of the grounds at the time of my visit maybe due to some ceremony going on because I saw this big \"kind of\" human-shaped round thing (with like a head & a body but with no arms & legs) wrapped in black and also a wedding display of sorts nearby featuring a young couple sitting on a small platform in like a tent with a painting of Mount Everest behind them and flower pots in front of them along the edge of the tent.Despite a far distance from the heart of the city (the area of Thamel & Durbar Square), I would say this place is worthwhile for its \"creative\" display of Lord Vishnu; and I don't know if there's a similar statue of Vishnu elsewhere, but there's a Buddha wrapped around by a snake and sitting on water that you can see at Bodhgaya in India! :)I did a combo tour with a car & a driver arranged at my hotel in Thamel, costing 3,000 Nepalese rupees (about US$30), with the first stop being Bodhnath Stupa (about half an hour to the east) followed by this temple (another half an hour to the north from Bodhnath) and then Swayambhunath Stupa on a hilltop (about 45 minutes from this temple) before finally returning back to Thamel; and that's probably the best way to go about to see these sights given the significant distances to this temple and Bodhnath from Thamel (especially to this temple being so far that even the mountains surrounding the Kathmandu Valley on that side are seen quite \"closer\" when you're here compared to seeing them from the city!). Actually, you could also consider doing just Bodhnath and this temple with a car tour and doing Swayambhunath on your own since that one's in a walking distance from Thamel (about a half-hour walk west), saving like a thousand rupees."
        }, 
        {
            "index": 35, 
            "rating": "5", 
            "review": "Vishnu at his Divine Peace. This is a very sacred place for Hindus. Looking at the divinely Lord Vishnu sleeping in the middle of Holy Pond is mesmerizing experience. A must visit place for all tourist in Kathmandu."
        }, 
        {
            "index": 36, 
            "rating": "4", 
            "review": "A sacred place for Hindu dieties. A sacred site for Hindus and just on the foot hills of Shivpuri range, you can combine a trip to the temple plus the forest trail walking. Nice place for picnic (Shivpuri) and worship (in the temple)"
        }, 
        {
            "index": 37, 
            "rating": "4", 
            "review": "Lord Vishnu has many incarnation.. It is believe that deity was carved in the seventeen or eighteenth century during the Lichhivi period."
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "Vishnu sleeping on the cosmic ocean. This amazing statue of a prone Vishnu sleeping on the cosmic ocean and dreaming the world is not to be missed, despite its distance from the center of Kathmandu. Located at the northern end of the Kathmandu Valley he rests on a bed of coiled snakes just below the road leading to Shivapuri National Forest."
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "Off the usual tourist trail, and well worth the effort. Budhanilkantha is a very sacred site to Hindus, but it’s also a special experience for travellers like us – being well off the main tourist circuit, most visitors are local devotees…although we did meet some visiting Indians who were very eager to practise their English and excited to have a photo taken with the blonde woman! But the big attraction at this particular temple for followers is the sleeping Vishnu as creator, appearing to float in a pool of water that is representative of the cosmic sea.On the morning of our visit, the devotees were more than a tad distracted by a film crew in action, and the gorgeous green and gold sari-clad film star, posing with appropriate hair tosses for the camera – much more glamorous than the middle-aged Aussie woman with her wash-and-wear travel pants and shirt and sturdy Merrell shoes.While the 7th century Vishnu carved from one gigantic piece of black stone (uncovered by a farmer and hauled to its current location) was impressive, the real delight for us came from the children running around with their friends, pausing on occasion to cheekily pose for John’s camera, maybe practising for when they ‘make it’ on the big screen."
        }, 
        {
            "index": 40, 
            "rating": "5", 
            "review": "Om Namo Narayanaya Namaha !!! 🐍. Om Namo Venkatesaya Namaha !!! Absolutely Blissful Almighty in sleeping position on a huge snake in a pond is a fabulous treat to our eyes , with the grace of God I went to this wonderful temple on 02nd September 2015 , when we sit in silence after doing all the formalities we will be absolutely peaceful and feeling relaxed.Must visit for all age groups when you are in Kathmandu and it is very easily accessible from all parts of kathmandu, 600NPR for a taxi from Thamel and back to Thamel after having blissful Darshan of Budhanilkantha ji.Thanks a lot for everything my dear beloved Narayana,Loving you so much,Peacefully yours,S M Bega Raaj,Happy travelling...❤ ❤"
        }, 
        {
            "index": 41, 
            "rating": "4", 
            "review": "Fascinating temple. Neat little temple with the a statue of Shiva (I think) wrapped in a giant snake lying on his back in a pool of water."
        }, 
        {
            "index": 42, 
            "rating": "5", 
            "review": "Amazing Budha. This is a place where you will find Lord Budha statue lying in the water. It's quite a different and a blissful view to watch the gigantic statue of Lord Budha lying in midst of water."
        }, 
        {
            "index": 43, 
            "rating": "4", 
            "review": "Great for Hindus. Fascinating Sculpture of Lord Vishnu which seems to float in water pool in the north of Kathmandu. This is no longer a good place to escape from the congested city. It has been swallowed up by the expanding metropolis - full of pollution. So only for devout hindus. Better to spend your time out of town."
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "Short visit to Budhanilkantha. Lord Venkateshwara in lying pose surrounded by Water. No cameras allowed inside. Hindus wish to go there to worship. Others also allowed to see the place."
        }, 
        {
            "index": 45, 
            "rating": "5", 
            "review": "so beautiful could not get it out of my mind. What an amazing and eye pleasing darshan of vishnuji. was difficult for me as on wheelchair but did manage to and thank god i could do it. Not allowed to click pictures in that perticular area where vishnuji peacefully is in the bed of water. i could not get the sight out of my mind for days."
        }, 
        {
            "index": 46, 
            "rating": "4", 
            "review": "Peaceful break. Very beautiful place, especially to walk around in the little villages or the nature. Great for a break from the chaos of Kathmandu."
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "Jay Bishnu. I visited this Temple when I was in School Vacation probably more than 15 years ago. Very popular attraction again. I love to go this Temple to pray for God Bishnu soon."
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "Great Mahavishnu in supine position. It is a great carving on a massive black stone, in supine position. The mace, sudarshan, & conch part of carving. The snake (adisesha ) is very much coiled. Beautiful & beatiful"
        }, 
        {
            "index": 49, 
            "rating": "4", 
            "review": "A beautiful statue. Buddhanilkantha is a an impressive carved stone statue of the sleeping Vishnu in a tank of water surrounded by a few small temples and shrines.I visited in June 2015, shortly after the earthquake so travellers were thin on the ground in Kathmandu and there were no others at Buddhanilkantha. It's not such a popular attraction for travellers so it makes a change from the other busier places.The statue is best seen from within the gates where you maybe able to walk all the way around it - sometimes though you can only see Vishnu from the 'feet end'. However, strictly speaking, access is limited to Hindus (the temple boys will remind you of this) so you may only be able to see it from outside the railings.Regardless, it's worth the short trip to such an ancient and peaceful statue that is very important to Hindus. There is no fee but donations are welcome.It's in the north of the valley and easy to get to from Thamel by taxi or bus for the more adventurous. It's right on the edge of the valley and it's only a few minutes walk to open country, an hour or so to Nagi Gompa (a large Buddhist nunnery) or a full day to Shivapuri Peak and back - the second highest peak on the valley rim."
        }, 
        {
            "index": 50, 
            "rating": "4", 
            "review": "Temple with a view. It is a temple with lot of religious significance and it has a great view when you travel and when you reach there you cannot take your eyes off the natural beauty. The statue laying on the pond is of Vishnu, believed by Hindus to be the regulator of the universe. The temple even though small the statue is very big. You will not be allowed to touch the statue but yes you can photograph which is unique in Nepal because most places it's the opposite (i.e., you can touch but can't photograph). Nearby is a conservation area with a monastery on the top of the hill you can try climbing I took a bike along and it was heck of a ride :)."
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "Budhnilakantha Historical site. This is the famous 'Sleeping Vishnu' and I think is a World Heritage site. It is a Hindu devotional place and has a wonderful ancient feeling. I liked it a lot"
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "feeling amazing. budhanilkantha temple is one of the most interesting place to visit.when i went to the budhanilkantha temple i saw the sleeping god in the water.it,s a amazing.it is the most important visiting place for hindu religion.this place is really good for historical lover and architecture lover.i really impress ."
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "Laying Vishnu temple. Located on northern hill of Kathmandu, budhanilkantha temple is another holy place for Hindu people where thousands pilgrims come to visit.\nVishnu is in sleeping aasana."
        }, 
        {
            "index": 54, 
            "rating": "4", 
            "review": "Stone god. This is also one of the interesting place to visit where you can see the sleeping god in the water. I think the idol is made of solid stone. Nice place to visit and specially for Hindu pilgrim visit."
        }, 
        {
            "index": 55, 
            "rating": "5", 
            "review": "Worth visiting for Hindus!!!. Most visit place for Hindus. Although nothing spectacular from architecture or historical perspective for people of other religions. We quite liked it.."
        }, 
        {
            "index": 56, 
            "rating": "4", 
            "review": "must visit place. its a temple where u will find a pond and in pond there is idol of lord brahma resting on shesh nag. one of the place people say about that KIng of Nepal can not visit this place as if he visit will die."
        }, 
        {
            "index": 57, 
            "rating": "5", 
            "review": "temple of the heart. i was born in budhanilkantha and loves to be here all the times.this is something which none of us should miss out.the vishnu temple lies under the big pond,there is a legendary story which none of the kings of nepal should go there."
        }, 
        {
            "index": 58, 
            "rating": "4", 
            "review": "Interesting shops combined with the large stupa. The stupa suffered little damage in the April earthquake and is worth a visit to experience the size of the building and the interesting surrounding buildings."
        }, 
        {
            "index": 59, 
            "rating": "2", 
            "review": "Lord Vishnu in a lying position. Very well carved and Lord Vishnu in a Sayanam pose. Unfortunately, the place as well as the Idol itself is not maintained well and infact quite unclean. The water in the small pond (in which the Lord Vishnu is in a lying down position) is very dirty and probably not replace for long. Approach is not so good as well - both inside the complex and the road leading to that."
        }, 
        {
            "index": 60, 
            "rating": "4", 
            "review": "Beautiful sleeping Vishnu. This statue of Vishnu is located at a distance from Kathmandu and may be difficult to reach for most tourists. However, if you are fan of myths, legends and religious symbolism then do not miss it. It is carved from a single piece of stone and features Lord Vishnu reclining on a bed of serpents. There are very few tourists here so you may be greeted with some odd stares, especially if you are obviously not South Asian."
        }, 
        {
            "index": 61, 
            "rating": "5", 
            "review": "largest stone statue in Nepal. Located on the lap of Shivapuri is a best place to visit the largest carved stone statue you will find in Nepal."
        }, 
        {
            "index": 62, 
            "rating": "3", 
            "review": "Not that impressive and hard to get to from central Kathmandu. The sleeping Vishnu statue may be the biggest there is, and he looks quite impressive in his pond with a fabric canopy over him and with the offerings of milk etc poured over him, but frankly as a non-Hindu he's not really worth the effort of getting across the city to find him. An hour in traffic or 30 minutes on a bike in traffic fumes and then when you get there he is all there is to see. Yes, he is worth seeing if you are nearby, but he doesn't merit a trip himself."
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "Mahavishnu. Massive chiseling of Vishnu in supine position lying on Adisesha (Snake in curls) Fascinating face, vishnu carries Chakra, Gada, Sankhu and one hand on his thighs. Unfortunate that photography is not allowed. Rightly so. A must see place in Kathmandu"
        }, 
        {
            "index": 64, 
            "rating": "4", 
            "review": "Interesting. Had to bargain with the taxi guy to take me here on the agreed price, but was fun. The huge Shiva floating is impressive for pictures. The surrounding small shops make for good nepalese snacks."
        }, 
        {
            "index": 65, 
            "rating": "4", 
            "review": "Sleeping Vishnu. The idol of sleeping vishnu surrounding by pancha naga is really nice I think foreigners are not allowed to main puja area but outside you can see."
        }, 
        {
            "index": 66, 
            "rating": "5", 
            "review": "Sleeping vishnu temple . Right time to go this temple very early morning so you can see puja. The idol of sleeping vishnu surrounding by panchanaga is really nice. I think foreigners are not allowed to main puja area but outside you can see. Really blessed to visit here. Must visit place."
        }, 
        {
            "index": 67, 
            "rating": "4", 
            "review": "Excellent Idol of Lord Vishnu. Budhanilkantha is at 10 km from Kathmandu. Here is Idol of Sleeping Lord Vishnu on Sheshnaag (Ananta). In four hand of Vishnu there are a Chakra Disc,a Conch Shell,a mace and a lotus. This huge Sleeing Idol is lying on a Pond and is covered by fancing. A Nice Place."
        }, 
        {
            "index": 68, 
            "rating": "3", 
            "review": "Sleeping Vishnu. There is a sleeping Vishnu statue in the middle of pool. If you are temple lover then you can go to see otherwise there is nothing great."
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "Nice Place. Had good darshan of Lord vishnu in the sleeping state under the pond. Very good place. We had good time"
        }, 
        {
            "index": 70, 
            "rating": "5", 
            "review": "Stupa. Visited the Stupa which is filled with wonder and years of worship. The city is filled with more garbage than necessary. Talking to one of the local people indicated that it wasn't always this way.... only since the King left his throne."
        }, 
        {
            "index": 71, 
            "rating": "5", 
            "review": "Peaceful and Divine-Must Visit. This place is a must if you like to visit temples. Best time to visit is morning pooja which is around 7.00~7.30 am\nAs this place is believed to have power of both Shiva and Vishnu, when the morning pooja happens you can witness both way of seva and mantrocharana taking place. Its not much crowded by tourists."
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "Great Visit. Visit to Shivapuri Hill with hike to Nagtse Ghumpa together with this temple was great experience. Really like the peace which is hard to find. Great statue."
        }, 
        {
            "index": 73, 
            "rating": "3", 
            "review": "Not Very Appealing. Nice mid size statue of Vishnu reclined on Snake bed in a small water pond. No pictures are allowed which makes it even less appealing to go. You can just zoom your cameras and take the best shot possible."
        }, 
        {
            "index": 74, 
            "rating": "3", 
            "review": "Nothing much to do here. And th road ride is really bumpy to visit this place.. just a statue of sleeping vishnu.. most of the people who come here are locals for praying. No photos are allowed to be taken inside. just get your zoom lens and shoot whatever you can from a distance.. :-("
        }, 
        {
            "index": 75, 
            "rating": "2", 
            "review": "Not that great. Nothing to see really, if you've seen a photo, well then you've seen it! There's nothing worth seeing in the surrounding area as well"
        }, 
        {
            "index": 76, 
            "rating": "3", 
            "review": "Nice statue, but very small.... Beautiful statue of vishnu lying inside a pond of water.. Nothing much to see other than this.. No entrance fee.. Very small locality.."
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "Sleeping Vishnu. A gem somewhat hidden in a corner. A large idol of the sheshashayi vishnu in midst of a water tank, made even more surreal by flickering lights of the numerous diyas fighting away the darkness."
        }, 
        {
            "index": 78, 
            "rating": "4", 
            "review": "Best Stupa by far.. Seen a few stupas in my day. This one is a major center and hub for its followers. Make sure you make time for the side streets to see how folks are living there.Oh... walk clockwise around the stupa. Shop prices were high though due to massive tourist visits."
        }, 
        {
            "index": 79, 
            "rating": "3", 
            "review": "Worthy, but don't go out of your way. This temple is interesting and unique, but small and otherwise nothing special. I visited here because my hike down from Shivapuri Peak ended here. I liked walking around the village and the food was very good and cheap there, but the temple is just okay."
        }, 
        {
            "index": 80, 
            "rating": "5", 
            "review": "Excellent Temple. the nilkantha in ananthsahnam is very beutiful view.The temple view is very much adorable and develop a silent prayer for the god."
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "must see temple. what a graceful temple that gives you great vibes. an unique place to see buddha idol in a sleeping posture. the place is very crowded, so, plan to be their early to avoid big queues"
        }, 
        {
            "index": 82, 
            "rating": "3", 
            "review": "Visit if your a Hindu. Worth a visit if your a Hindu to see the Vishnu statue in water. A typical feel of any Hindu temple. Flowers, incense and prayers going on."
        }, 
        {
            "index": 83, 
            "rating": "4", 
            "review": "Famous for its British founded Boarding School. Budhanilkantha is the starting place for climbing Shivapuri and it was always nice to go up the moun tain and to camp at the top and see the sunrise. It has an implortant tempel for Hindus but made very many trips to the school for scouting reasons as well as when I was writing text books for Social Studies, English and Maths. Taught the former cfrown prince here many times as well as going camping with him. Dipendra went on to kill his mother, father, sister, brother, uncles, aunts and cousins. I always tell people they have to be careful learning from me!"
        }, 
        {
            "index": 84, 
            "rating": "4", 
            "review": "Must see. Budhanilkantha Temple is also called as Vishnu Temple . God Vishnu here is lying on Serpent Shshnaag . Travelers , who want to buy Rudraksha can buy here . Genuine and the cheapest Rudraksha were available here. Few shops outside the temple sells religious products at the cheapest rate all over Nepal."
        }, 
        {
            "index": 85, 
            "rating": "3", 
            "review": "Visit unless you have been to India.... A typical sight from any typical indian temple complex... Long queues, flower garlands, burning incense, crowd, cows.., Pros- Holy pilgrimage place for Hindus travelling from India. Saturated colors for good photography...Cons- Too noisy & smelly for uninitiated. Not very close from city center... can easily take off 2-3 hrs of the day."
        }, 
        {
            "index": 86, 
            "rating": "5", 
            "review": "Lying Vishnu God.... . Hindu god Vishnu will be found here lying on his pet serpent seshnag.. No entry fee required....Place lies just before the entry of Nagarjun National Park."
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "Religious devotion on display. This temple is several kilometres outside of the centre of Kathmandu. I rented a bike for the day and hit up several temples, starting with this one. The temple is free to enter, which is nice since most World Heritage sites in Kathmandu cost money. Also, there are a few adjacent shops serving up yummy deep fried foods and sweets.I am not sure if it was because of the recent holiday called Tihar, but this temple was really alive with Hindu rituals and prayers. The display of devotion really adds to the atmosphere of the place.The Vishnu lying in the pond was really amazing, including the Hindus coming to pray in front of it. Contrary to a review below, tourists are allowed in the pond area, but take your shoes off and you can't take pictures, that's all."
        }, 
        {
            "index": 88, 
            "rating": "5", 
            "review": "Visite during Tihar. The Vishnu in the Pond is an awesome place to be. People go about their religious business while you just enjoy the peace and quit!"
        }, 
        {
            "index": 89, 
            "rating": "3", 
            "review": "It's okay .... The statue itself was pretty interesting to see; however, the surrounding of the temple is surprisingly poorly preserved considering it's a well-known tourist attraction."
        }, 
        {
            "index": 90, 
            "rating": "4", 
            "review": "sleeping vishnu. besides the sleeping vishnu, not open for tourists but can peak through the gates there is not much here!but a good stop on the way to nagarjun or shivapuri walks!"
        }, 
        {
            "index": 91, 
            "rating": "5", 
            "review": "out of katmandu ring. worth going for a change.\ninspirating.\ndont be on a rush.\ntry to get involved with little ceremonies around with the locals."
        }, 
        {
            "index": 92, 
            "rating": "5", 
            "review": "Take a bus to save money. Take a bus to this place which costs Rs20. Its a 30 min ride and you wont get any faster if you went by car. Small place but seriously a sense of peace and beauty when you visit this template. Try to dough rings in the shop near-by."
        }, 
        {
            "index": 93, 
            "rating": "5", 
            "review": "The sleeping God bishnu . Located northen side of ktm valley 7 km from center ratnapark.one of the biggest Hindu temple only Hindu religious is allow inside . You can have little bit hiking around . Budhanilkhanta also know as sleeping God.the God bishnu lying center of pond. Highly recommend."
        }, 
        {
            "index": 94, 
            "rating": "4", 
            "review": "Unique image!. The image of Lord Vishnu lying on the snake is NOT unique but located in a pool of water is unique! It is quite a large image about 2 m wide and 7 m long, very well made and located in a tank about 15 m square. The water depth may be about 1.5 m.Again, photography of the Lord is not permitted."
        }, 
        {
            "index": 95, 
            "rating": "5", 
            "review": "one of the most beautiful historical place. budhanilkantha is consider as one of the most precious n religious place after pasupatinath temple. i had a peacful feeling made my soul so peacful. i would like to visit it again"
        }, 
        {
            "index": 96, 
            "rating": "4", 
            "review": "Sleeping Vishnu. Very nice environment and got a good vibe at this temple, it's a small temple which is about 9kms from Thamel.. Visited this temple on my last day, cleanliness is a concern. Hindus are only allowed inside the arch but westerners can see idol from outside. No photography allowed from inside the arch."
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "sleeping bishnu. Really its amazing ,in the water lord bishnu is there .I reached in the morning time ,I waited for around 1 hour to entered in the temple bcs in that time pandit was going to take a puja but I saw all the puja done by pandit from outside ,so I became so happy to reached in that moment"
        }, 
        {
            "index": 98, 
            "rating": "2", 
            "review": "displaying ...death. Hindu complex of temples close to the airport. Non Hindus not allowed to enter in main temple. Cremation ghats along the small river. Smoke of burning wood and dead bodies everywhere. From celestial humanistic buddhism, to grumpy \"dark\" hinduism. Entrance, irs 1500! Watch out to self-hired guides!!! If i could go back in time, I would'n have visited it."
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "Loved it. Had a spare morning so decided to check it out. We bought a bowl with assorted \"offerings\" & a local walked us around to give to the different statues. Thoroughly enjoyable experience with all the colours & also seeing the locals too. The only downside was the persistence to pay for the shoes to be \"looked after\"."
        }, 
        {
            "index": 100, 
            "rating": "5", 
            "review": "The only idol of Lord Vishnu/Narayan in sleeping mode. There was a great energy in the temple. I wanted to stay there for an hour. There is the statue of Lord Narayan in sleeping mode, perhaps it is nowhere in the world as such."
        }, 
        {
            "index": 101, 
            "rating": "4", 
            "review": "Was forced to PAY to keep shoes outside.. The site s pretty. VISHNU ji statue looks awesome. Now v left r shoes on a stand outside the religious site like MANY locals had. When v came back this lady FORCED us to pay for keeping shoes outside claiming the govt f Nepal has this rule. Pls note there r no notices saying so n she did not give receipts to anyone else XCPT us. I refused to pay saying I would call the cops etc. She started to abuse and walked away. Pls dont pay such people n encourage this behaviour."
        }, 
        {
            "index": 102, 
            "rating": "5", 
            "review": "Narayan Temple. This place has a great story to tell.You will find the lords statue floating in water. It is said that the statue was self made. Small Temple but a must visit."
        }, 
        {
            "index": 103, 
            "rating": "4", 
            "review": "Unique Idol and divine place. Lord Vishnu in a sleeping posture, floating on water. This is a unique idol of Lord Vishnu, which i haven't seen any where. I just hope that, the temple management is in some efficient hands."
        }, 
        {
            "index": 104, 
            "rating": "5", 
            "review": "Lying Vishnu. Apart from the Reclining Mahavishnu in the Indian city of Trivandrum, I saw another Vishnu lying in the pond in this temple. The small temple also had a lovely front porch wherein I could see the thread ceremony of young boys as per the Hindu tradition."
        }, 
        {
            "index": 105, 
            "rating": "4", 
            "review": "Lord Vishnu Lying on Shesh-Nag in a Pond. I thing this is the only temple of Vishnu in lying position. Darshan are comfortable. Photography from outside is possible."
        }, 
        {
            "index": 106, 
            "rating": "3", 
            "review": "Beautiful. Myself and my wife visited this temple during our recent Nepal tour. The statue of Vishnu reclining on the pond is unique. The cleanliness of the place can be improved."
        }, 
        {
            "index": 107, 
            "rating": "5", 
            "review": "Unique Temple. Here you can see Vishnu carved on the rock in the middle of the lake sleeping..camera are allowed so you can take pictures freely.."
        }, 
        {
            "index": 108, 
            "rating": "4", 
            "review": "Must see in KTM. One of the temples that are not downtown. There are approximately 7-8 km from Thamel to Budhanilkantha. Impressive temple, very nice declining Vishnu, made from one stone, black. My advise is to go out from crazy downtown, take a walk around and follow the road down and take the walk in amazing surroundings, plenty of small shops, street life, real Kathmandu. Once you are tired, you can stop Tempu (Tuk-Tuk) it is only munger 5 from there to go back downtown or some of the micros, but micro drivers ar kind of crazy :)"
        }, 
        {
            "index": 109, 
            "rating": "4", 
            "review": "unique sculpture. Lovely to visit sleeping Vishnu The unique fact about this is that the formation was carved of a single stone. Though only hindu's are permitted to pass through the arch to get a closer look, for others the view from the surrounding area is fairly enough"
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "Where the King could not go. This big statue of Mahavishnu resting during cosmic sleep on a 'water-bed' Sesha - the eternal snake which contains or symbolizes all knowledge of Universal imperishable root-matter in all its many not-yet-developed aspects. It was said that a king would die when seeing the image, because he himself was 'an incarnation of Vishnu. The last king was however murdered by his own drugged son."
        }, 
        {
            "index": 111, 
            "rating": "4", 
            "review": "Sleeping goddess Vishnu. Budhanilkantha is situated below Shivapuri hill at the northern end of the Valley. It is about 9 km from the city center. The hub of the temple complex is a pond in which lies a 5 meter (17 feet) long great stone figure of Hindu god Bishnu reclining on the coils of a cosmic serpent. The figure has been estimated to have been found buried in the ground in its original state more than thousand years ago. It is also known as Bhuijasi. Hindus throng to this sacred pilgrimage almost everyday to perform puja but a great number of worshippers can be seen in various festivals, especially on Haribodhini Ekadashi that falls between October/November, the day believed that the sleeping Lord Bishnu wakes up."
        }, 
        {
            "index": 112, 
            "rating": "5", 
            "review": "hindu temple. Nice to visit sleeping bishnu. when we were there so many people were wiating to pary and its so nice to watch them. Priest were friendly and blessed for us. We were with group of friends and it was nice to visir once"
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "Fantastic Place. It is a marvelous stone sculpture, the lord Vishnu sleeping in the serpents; probably it is the tallest and big stone sculpture, situated in 9 km from city of Kathmandu and at the base of Shivapuri National Park, the very beautiful & peace environment around this temple. This temple is somewhat out of the way, but definitely worth a visit precisely because it is less visited by tourists and more a genuine part of Nepali life. I was there in December and was told by my guide that there are only certain months that Hindus can marry. There is something rather nice about the way Vishnu lies there in all his glory and the way the locals worship him."
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "A rare sight. It was a rare sight for me to see a statue of Lord Vishnu lying on water surrounded by a serpent. What's unique is also, as our tour guide told us the fact that the structure was carved of a single stone. Though only hindu's are allowed to pass through the arch to get a closer look, for non hindu's the view from the surrounding enclosure is fairly sufficient."
        }, 
        {
            "index": 115, 
            "rating": "4", 
            "review": "sightseeing tour. marvelous stone sculpture,,the lord Vishnu sleeping in the serpents,,probably it is the tallest and big stone sculpture,,situated in 9 km from city of Kathmandu and at the base of Shivapuri National Park,,,the very beautiful & peace environment around this temple."
        }, 
        {
            "index": 116, 
            "rating": "4", 
            "review": "For an extra time.. This place is not touristy but it worths a visit if you have some extra time to spend in kathmandu.The sleeping black bouddha on the pool with devotees worths pictures. You could have a reading from a palmist close to the pool, there is one who can speak english..."
        }, 
        {
            "index": 117, 
            "rating": "4", 
            "review": "Important Hindu site. The statue of a Hindu god sleeping on a bed of snakes is very interesting, as is watching Hindus giving offerings. This is a great place to see Hindu culture. There are some shops along the road which sell religious items. Worth a visit."
        }, 
        {
            "index": 118, 
            "rating": "4", 
            "review": "Beautiful Less Visited Temple. This temple is somewhat out of the way, but definitely worth a visit precisely because it is less visited by tourists and more a genuine part of Nepali life. I was there in December and was told by my guide that there are only certain months that Hindus can marry and, apparently, this was one of those months, and Budhanilkantha is where some marriages take place. So besides the beautiful statue itself, which rested in a pool of water, there was a wedding party with many women in beautiful saris and a generally peaceful, but festive atmosphere. Besides trekking, this was one of the few places in Nepal where I didn't feel like just like a tourist."
        }, 
        {
            "index": 119, 
            "rating": "5", 
            "review": "Excellent Temple (Don't Miss). I read some reviews about this temple before our trip to Nepal. This is one of the must visit temple, the main statue was amazing and definitely worth watching. Its little away from the city center with bad roads. You can take photos from outside the main pond, but not inside. There is some rudraksha tree inside the temple."
        }, 
        {
            "index": 120, 
            "rating": "5", 
            "review": "Worth a Visit. There is something rather nice about the way Vishnu lies there in all his glory and the way the locals worship him. Worth a visit. Something struck me as slightly weird - they said no photographs while inside of Vishnu. However, just slightly away, photographs are allowed and one can just tiptoe and get the full length photograph of Vishnu. A very calming sight."
        }, 
        {
            "index": 121, 
            "rating": "5", 
            "review": "Visit to Budhanilkantha. A must to visit be it for a Hindu or Other Religions For hindus it is for worship for others just a visiting place. reclining vishnu on a bed of snakes carved from a stone lying in the middle of a water pond.you need to have a transport of your own as it is 9 to 10 km from Kathmandu town but worth visiting"
        }, 
        {
            "index": 122, 
            "rating": "5", 
            "review": "Funerals. I have never been to a public crematorium. This was a unique educational experince and a sobering thought about mortality. I was able to film within metres of the burning corpses which was a somber and absorbing eeperience for any photogrpaher."
        }, 
        {
            "index": 123, 
            "rating": "3", 
            "review": "Shiva on a bed of snakes. This holy place has a temple and a nice statue in the water.Shiva on a bed of snakes.The statue is very nice but the rest is not so impressive and it is situated in the outskirts of Kathmandu so it is a very long walk to get there or you have to take a bus or taxi."
        }, 
        {
            "index": 124, 
            "rating": "5", 
            "review": "Sleeping idol of vishnu : rare attraction of nepal. Budhanilkantha is specially very famous for hindu people. Hindu people worship the statue of lord vishu as the preserver of this world. According to hindus lord vishnu is one who preserve this world.Budhanilkantha is Very clean and religiousness place in Nepal."
        }, 
        {
            "index": 125, 
            "rating": "4", 
            "review": "no tourists here. this area is little bit far from Kathmandu Area, so we went by Taxi. No tourists here, only pilgrims. The statue of Shiva is very particular, in the middle of water...."
        }, 
        {
            "index": 126, 
            "rating": "5", 
            "review": "budhanilakanta of kathmandu worth seeing...... visited nepal in the first week of oct-2o13 . we stayed total five nights in nepal two nights in pokhra and 3 nights in kathmandu . in kathmandu we searching for sleeping vishnu temple. our taxi driver demanded more to visit there. then we agreed for that also. little rain was there . eventhough by seeing this marvelles sleeping idol of vishnu. we felt satis fied . really rare attraction of nepal. this type of idol rare in india. the face, sleeping style everythig is so attraction. pl dont forget to see this, when you are in nepal. unfortunately as photography not allowed , i have not clicked photos."
        }, 
        {
            "index": 127, 
            "rating": "5", 
            "review": "Sleeping god Bishnu. Religiousness place, a good place to go if you are interested to know a little more about hindu religious."
        }, 
        {
            "index": 128, 
            "rating": "4", 
            "review": "Love this. Temple. Very clean and no hassle from venders to buy. Got a chance how students work on painting those beautiful work of art."
        }, 
        {
            "index": 129, 
            "rating": "4", 
            "review": "great statue. the sleeping Narayan of Budhanilkanta is one of the great statues of the Licchavi period,found,it's told,by a farmer when working at his field.the staue is greatly impressive,powerful and full of sweet energy.unfortunately,it has been surrounded,in the 90thies,by an orrendous fence,and it is forbidden to the foreigners to enter inside and admire the god in full view.sometimes can be possible to sneack inside,if you show much respect for the holy place.in the market around the prices of Saligrams and Rudras is very convenient."
        }, 
        {
            "index": 130, 
            "rating": "5", 
            "review": "holy place. Budhanilkantha It is located in Narayansthan, 8 kilometers north of Kathmandu on the foothills of Shivapuri mountain. Hindu holy place."
        }, 
        {
            "index": 131, 
            "rating": "5", 
            "review": "Impressive. Very nice stupa. Large area to walk around. Prayer wheels to touch. Pilgrims and priests. There were a number of shops circling the area. We had lunch at a rooftop restaurant within the stupa circle allowing us a great observation area. Sorry, can't recall the name."
        }, 
        {
            "index": 132, 
            "rating": "5", 
            "review": "once you have to visit. budhanilkantha is specially very femous for hindu people, it is known as jalnarayan as well.this is laying on the water god."
        }, 
        {
            "index": 133, 
            "rating": "4", 
            "review": "A different Shri Hari Vishnu temple. Very nicely decorated Shri Hari Vishnu, similar to Vishnu ji on Seshnaag ji in Kshirsagar. Beware of one duplicate Budhanilkantha, as one cab driver take my friend to duplicate Budhanilkantha inplace of original Shri Hari Vishnu."
        }, 
        {
            "index": 134, 
            "rating": "4", 
            "review": "Surprise. Right here you can see the Rudraksh Tree. Very Unique. Do not buy any Rudraksh from unknown shops. Buy from only certified shops."
        }, 
        {
            "index": 135, 
            "rating": "5", 
            "review": "Cultural place with a scientific wonder. When I heard about it I thought is just another temple when we got there it was different to many other temples. There is no temple all is just a large sculpture of God. But the amazing thing was the stories associated with it and the fact that you can almost see the face of God as reflection on water. I still cannot understand how is possible apparently many physicist have tried to explain and failedYou should see it to believe it. "
        }, 
        {
            "index": 136, 
            "rating": "5", 
            "review": "I just love this place. always something to see, smell and eat! My husband even had a hair cut in one of the booths just off the Budhanilkantha"
        }, 
        {
            "index": 137, 
            "rating": "4", 
            "review": "nice for religious trip. I was expecting more than this tho, but still it was nice, It was raining there so i couldnt get much to see,"
        }, 
        {
            "index": 138, 
            "rating": "5", 
            "review": "Sleeping Bishnu. Jal arayan popularly known as Budhanilkatha about 12 km north of Kathmandu, at the Shivapuri foothills is the largest Vishnu lying on a coiled five headed serpent carved in a single stone. Jalasaya Narayan is Lord Vishnu for Vaisnavas, Lord Shiva for Shivas, and Lord Buddha for Buddhists. This outstanding artwork of Lichhavi sculptures dates back to some 1500 years."
        }, 
        {
            "index": 139, 
            "rating": "5", 
            "review": "Baghwan's abode. This place is a MUST VISIT place to all Hindus. As usual like most of the Hindu shrines in India and Nepal, it is dirty, seems disorderly and littered by touts. However, against these physical distastes, the Lord Baghwan Krishna dwells with serenity radiating his love all around. It is one of the 10 most important Lord Krishna shrines in the world.Non-Hindus are allowed. No entrance fee. Irrespective of one's religious background, it is worthy of visit while in Kathmandu."
        }, 
        {
            "index": 140, 
            "rating": "4", 
            "review": "sleeping budda. very famous temple in kathmandu.people say sleeping buddha is well.This in very peacefull & quite area of kathmandu."
        }, 
        {
            "index": 141, 
            "rating": "5", 
            "review": "\"Om Namo Narayayana\". The reclining \"Narayana Vishnu\" statue, with the stories of it's origin, going back to more than 5000 years; situated 9.6 km away from Thamel, and takes only 22 minutes to reach there.The Significance of this statue is the crossed legs which is resemble to Lord Krishna, who was apparently invited by the counterpart King of this region.The 5 m long statue is at the middle of a pond filled with water. The maintenance is being done well daily basis with refilling new water; many thanks to the temple authority there.There is no entrance fee to the premises.The fragrance of incense and butter lamps make you a marvelous feeling. The Offerings (flower, fruits etc.) are done at the foot of the Statue. There are some pigeons hanging around to pick up the grains gives added significance. Out court of the main premises there are some shrines dedicated to different Hindu Gods. There are some Sadhus/ priests with holy books, threads and tika powder sitting patiently untill a devotee get blessings from them. They cant mantras and put red tika on your forehead and put a thread around your wrist. You may do a donation as per your wish. ( As a frequent visitor I do 10 Rs.).The flowers, fruits, lamps, and incense sticks are well displayed along the roadsides in plenty of stoles. You may get a basket of mixed offerings for 50 to 100 Rs. according to the size of the basket.From Budhannilakantha one can proceed another 4.5 km uphill to get entry to the Shivapuri National Park and Dhamma Shringa, the Goenka International Vipassana Meditation Center."
        }, 
        {
            "index": 142, 
            "rating": "4", 
            "review": "Amazing site. Just could be cleaner and better maintained! The entrance could be better maintained so could the quarters and the Laxmi temple. It was raining when we went so it was a bit squishy/squashy to walk up to the main deity. Definitely wear sandals or flipflops."
        }, 
        {
            "index": 143, 
            "rating": "3", 
            "review": "Crying out for maintainance!. The place is nice and is a weekend get-away for both religious and recreational purpose. But with haphazard building constructions, demolished roads and scattered rubbish, this beauty looks lore like a ravaged beast!"
        }, 
        {
            "index": 144, 
            "rating": "5", 
            "review": "won't believe until u visited. we visited expecting another visnu temple ,but this one was different.the biggest floating statue in the middle of a pond.u experiene a blessing glow from His face.u can take your own time.no long queue,no guards t o chase u.after worshiping we shopped for some souvenir in a shop.suddenly the old lady become sentimental,and presented a gift and asked for our blessing. we blessed her and enjoyed this rare honor.by and large Nepalese simple and friendly"
        }, 
        {
            "index": 145, 
            "rating": "5", 
            "review": "Architecture. The biggest stone carving of lord Vishnu ever seen around Kathmandu valley. Located to the outskirt of Kathmandu. This place is must visit."
        }, 
        {
            "index": 146, 
            "rating": "4", 
            "review": "nice temple. Its in water and good to see the idol. Surroundings are not that clean if you compare with temples in India. Overall its good expeience"
        }, 
        {
            "index": 147, 
            "rating": "4", 
            "review": "Greatly improved environment. Only thing I don't liked here was, I could see long serpentine queue of devotees every time I visited. Perhaps its the supreme power of god that pulled people towards this large monumental temple."
        }, 
        {
            "index": 148, 
            "rating": "5", 
            "review": "Beautiful temple. The idol of sleeping Lord Vishnu in the middle of a pond looks divine. There was a lot of rush though. We had breakfast outside the temple premises where there were many shops that offered local food. you should try sel roti, samosa with sabzi."
        }, 
        {
            "index": 149, 
            "rating": "4", 
            "review": "great temple. its was nice to see, there is a lot of Tibetan monks here its really busy a lot of shops around the temple and a really nice coffee shop to take a break"
        }, 
        {
            "index": 150, 
            "rating": "4", 
            "review": "Better view hotels, away from the city and nice Vishnu temple. This is a really nice place to stay in. Away from the dusty and busy city with a nice view of the hills and really quite. Park Village resort is something you should consider. There is a nice Vishnu temple where the idol is in the middle of a small water body."
        }, 
        {
            "index": 151, 
            "rating": "5", 
            "review": "Peaceful atmosphere in temple. Unfortunately only Hindus are allowed into the sacred centre of the temple, but one gets close enough for good pictures. The sleeping Vishnu ist really beautiful. There is a small market outside, with delicious samoosas and pakoras. Trip by car from the city centre ist 30 minutes."
        }, 
        {
            "index": 152, 
            "rating": "4", 
            "review": "Sleeping lord Vishnu in a small lake. This is unique temple where you get see God Vishnu's idol in a sleeping position in the small water body, which is very rare. Though the maintenance is not very good the place is worth a visit once."
        }, 
        {
            "index": 153, 
            "rating": "4", 
            "review": "The king god. Here is where the king of gods, Vishnu, has its most beautiful temple. The statue of the god is a huge and black block on which thousands of flowers and candles are offered every day. All around devotees and priests go about their worship."
        }, 
        {
            "index": 154, 
            "rating": "3", 
            "review": "Not that much interesting. It's a very important place from the religious point of view but not as much interesting for non-believers. The statue itself is surrounded with quite a big fence and if you are not Hindu you won't get the opportunity to approach it and take a photo. The surrounding area is also not that much interesting, with residential buildings and some market stalls offering religious items mostly. If you are in Kathmandu for a short visit only and you are not that much interested in Hindu religion then you can skip this place."
        }, 
        {
            "index": 155, 
            "rating": "4", 
            "review": "Sleeping Vishnu. To see the big statue made with a single stone was great. Auspicious Place just before Shivapuri temple. Worth great value for huindus specially... Great to be there."
        }, 
        {
            "index": 156, 
            "rating": "4", 
            "review": "The sleeping deity of Vishnu. Budhanilkantha means 'Old Blue Throat'. It is a deity of Vishnu also call Narayan. Therefore, Budhanilkantha is also called Narayanthan means place of Narayan. Here you will see Vishnu in a sleeping position on the thrown of 'Ananta' with his legs folded. The whole deity is floating in a pond. It is worshipped as a holy place by hindus"
        }, 
        {
            "index": 157, 
            "rating": "5", 
            "review": "Good vibrations. The sleeping Vishnu here is great, a very strong energy at this place. Non- Hindus can't go inside but you can view it from the sides- the statue draped with marigolds. Lots of other little shrines around and the Sadhu lady may sit with you in meditation if you are lucky. Definitely a power place of Kathmandu and worth visiting- easy to get to by bus. Very tasty roti and snacks from the stalls nearby."
        }, 
        {
            "index": 158, 
            "rating": "5", 
            "review": "So beautiful!. Lovely Temple (Mandir). People are very nice and it is best to purchase a flower mala and take it inside. You may leave it on any of the Gods or Goddesses, just remember to walk around the middle of the Temple in a clockwise direction. If you ask the Priest (pundit), he can lay the flowers at the feet of Vishnu for you. Non-Hindus can't go into the main small pond area, but you can see it thru the brick lattice work wall. Lovely visit!"
        }, 
        {
            "index": 159, 
            "rating": "5", 
            "review": "Very interesting. This temple seems to be a bit out of the main tourist circuit so it was interesting to see the locals paying their devotion in a quite authentic environment. The gigantic statute of Vishnu is very interesting."
        }, 
        {
            "index": 160, 
            "rating": "5", 
            "review": "At the base of the Sivapuri hills is a remarkable statue of Lord Vishnu\"Budhanilkantha\".. At the base of the Sivapuri hills is a remarkable statue of Lord Vishnu, reclining on a bed of coiled snakes. The statue said to be sculpted from a single block stone, is set in the middle of a small pond and appears to be floating in the water. The stone image is said to be one of three statues sculpted during the Lichhavi period and called Budhanilkantha named after the huge image of Lord Vishnu. The five meter long statue called Bhuijassi by the local Newaris of the Liccchivi – age settlement at the base of Shivapuri hills is also known as Budhanilkanta. The village, now also known as Budhanilkantha.During auspicious days like the eleventh day of the lunar month the priests bathe, clean, perfume, fan the deity and decorate it with ornaments. They also keep a piece of cloth on his forehead to save the deity from the stark sunlight that comes over his face."
        }, 
        {
            "index": 161, 
            "rating": "4", 
            "review": "Buddha Nilakantha \"Vishnu\":It is marvelous piece of sculpture made out of Salagram stone found only in the river Gandaki. Budhanilkantha literally means “old blue-throat.” Ananta has 11-hooded heads. It is believed that the deity was carved in the 7th or 8th century during the Licchavi period. Hindus can walk down the steps and touch His feet.The main festival of the year is when Lord Vishnu, who sleeps on the cosmic ocean during Caturmasya period wakes up on the Haribondhini Ekadashi day in late October or early November.Many thousands of people come on this day. Three other images of Lord Vishnu were carved at the same time. One is here at Budhanilkantha and is considered the most important and original, one is at Balaju Gardens, and one is at the old Royal Palace in Kathmandu, but can not be viewed by tourist. The king of Nepal is not allowed to see the deity at Budhanilkantha, but he can see the other two deities.The deity of Budhanilkantha was lost for a while and was later rediscovered by a farmer. It is believed that the farmers struck the buried deity with his plough and that blood came out from the ground.The morning puja between 9 and 10 am is interesting."
        }, 
        {
            "index": 162, 
            "rating": "5", 
            "review": "Auspicious. Its a famous religous and auspicious place for hindu. I have been to many times there to see/worship as well as to look around this area. This is at the northern end of Kathmandu vally form where, especially in night the vally looks great. The statue of god narayan or budhanilkanta is beautiful and really crafted well. Please note you are not allowed to take photos from inside, but can do so from outside."
        }, 
        {
            "index": 163, 
            "rating": "5", 
            "review": "beautiful temple. worth to combine it with a trip to Nagi Gumpa (2hours walk through Shivapuri park), you can also stay at the nunnery overnight, very peaceful and with a nice view of Kathmandu city."
        }, 
        {
            "index": 164, 
            "rating": "4", 
            "review": "Great history and architecture. The original capital of Nepal before Kathmandu grew up around it. Lots of lovely old buildings and squares to see. The map you are given has enough information, or you can hire a guide. The cleanest public washroom in Nepal!"
        }, 
        {
            "index": 165, 
            "rating": "3", 
            "review": "Good. This is a place to visit if you have enough time. However if you are on a whirlwind trip, there are other better places to see. But the idol of Lord Vishnu lying on water is something to see if you are a devotee of Lord Vishnu"
        }, 
        {
            "index": 166, 
            "rating": "5", 
            "review": "Lord Bishnu.. It is the natural statue from the earth which come out and people find out it was lord Bishnu himself,who came out from Earth with four hand at the bed of Snake! so they started worshiping it to kill their all sins! I love this place."
        }, 
        {
            "index": 167, 
            "rating": "3", 
            "review": "Popped in here for a look-see. I live just down the road from here. In 4 years I never made it. One day, I just decided to go. While it is a lovely statue, remember that if you are not Hindu, you cannot get this close as in the photo, and it is a small temple area so it is a long way to go for just seeing this. And the story that it 'came out of the ground in a single piece' is a bit of a stretch but is the main point of the temple."
        }, 
        {
            "index": 168, 
            "rating": "4", 
            "review": "amazing. The view of lord vishnu resting was quite a surprise as i have never seen such beautifully done Idol. The place in itself was so much old done for peace, culture and obviously religion was so much clean and great site."
        }, 
        {
            "index": 169, 
            "rating": "5", 
            "review": "sleeping Vishnu. I lived in Budhanilkantha for 2 months!! its just under the Shiva Puri national park ,so u can easily walk in the park. In the entrance of park is Vipassana meditation centre which i would highly recomend for a 10 days meditation course, Its amazing!! and its on donation basis. In Budhanilkantha is also the sleeping Vishnu temple witch i still feel in my heart and can hear the people chant and sing prayers. The people around is very friendly and simple. There is also very nice hotel \"Park Village\""
        }, 
        {
            "index": 170, 
            "rating": "3", 
            "review": "Crowded. Although published to be of very cultural and religiously value, it has not been maintained so well."
        }, 
        {
            "index": 171, 
            "rating": "5", 
            "review": "beautiful location. the plance was peace and beautiful at the end of kathmandu at the mountain area. there was the statue of the sleeping god vishnu in the middle of water. the plac e was green and the people over there were very friendly and relaxed. and it was very near to the shivapuri conservation area."
        }, 
        {
            "index": 172, 
            "rating": "4", 
            "review": "Budhaneelkantha. Situated north of kathmandu, Budhaneelkantha showing Lord Vishnu sleeping on a coiled snake in the middle of the ocean, is one of the finest examples of Nepali art. Built by king Vishnugupta in the seventh century A.D., this is a sacred shrine of the Vashnavites in the valley. The pond, in whose centre the statue is located,symbolizes the ocean.There is an interesting aside. King of Nepal cannot visit Budhaneelkantha as he is considered an incarnation of Vishnu. As such being equal to him or part of him he can not visit him."
        }, 
        {
            "index": 173, 
            "rating": "4", 
            "review": "Bishnu resting in the coils of cosmic serpent Seshanag. Budhanilakantha , a splendid, unique , grandeur sculpture of Bishnu resting in the coils of cosmic serpent Seshanag . The idol is large and lying pose inside a pond as if floating in an ocean . It was the ekadashi in the month of November , an auspicious occasion when lord Bishnu awakened from his long sleep and we were fortunate enough to touch the feet of the lord on that day . we had encountered two marriages during our first visit and in both the cases we observed a special type of grass garland around the neck of each bride . This time the crowd was immense , so I could not stay for some more time to view vividly as i have done previously ."
        }, 
        {
            "index": 174, 
            "rating": "4", 
            "review": "Large unique statue of vishnu. it is at one corner of the city but hindus visit it compulsorily. here u find a lot of shivlingas but the main attraction here is a sleeping vishnu statue in a pond. it is s huge creation showing the vishnudeva in full granduer."
        }, 
        {
            "index": 175, 
            "rating": "4", 
            "review": "Nice statue but a long way to go in the heavy traffic.. The statue of the sleeping Lord Vishnu is very nice but the journey there across the city was about 1 hour, mostly in traffic jams and it seemed a bit far to go to see just this one small site. Boudhanilkanta is very congested and polluted and apart from one big hotel offered us little, so we returned to Thamel through more dense traffic, choking and slightly disappointed."
        }
    ]
}