{
    "category": "Lisbon", 
    "entity": "Miradouro-da-Senhora-do-Monte", 
    "avg_rating_stars": 4.74749498997996, 
    "review_count": 499, 
    "rating_stats": {
        "poor": 1, 
        "average": 14, 
        "terrible": 1, 
        "very_good": 91, 
        "excellent": 392
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "One of the best Miradouros. Perhaps the best of Lisbon's miradouros. It is indeed a climb up. Do try to walk it rather than take a tuk-tuk or taxi. You will appreciate the views all the more. Its about a 240 degree view of Lisbon and its amazing!!"
        }, 
        {
            "index": 2, 
            "rating": "4", 
            "review": "Best panorama view of Lisbon. And it is free! You just need to get yourself up there and enjoy the view. About 200 feet down the road are several restaurants and cafes that you can enjoy once you're done enjoying the view or sunset."
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "Best Portuguese sunset. I am not sure if is because it was on a Friday, but the atmosphere was really\nMagic: live music, some bachelorette parties, mojito and an amazing view over Lisbon.."
        }, 
        {
            "index": 4, 
            "rating": "5", 
            "review": "really good panorama. As my friend had a wheelchair, we could not access Sao Jorges castle, so this provided us with a view of it from the next hill. The view across the whole city was marvellous."
        }, 
        {
            "index": 5, 
            "rating": "5", 
            "review": "The best view of authentic lisbon, and also some scenery. Arrived late (1am or so) oN a friday, and was recomended to go here. Very safe and beautiful at night. The place attracts many local which is also a plus. Came on the next day when it was still daylight (around 18:00). Turned out to be a a romantic place with many small locks oN the fence. and There was a wedding going on!!!, Some lemonade stands and people singing, playing the guitar and enjoying the day. Great real experience of the city life.Also the view is stunning..."
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "Best View of Lisbon. This spot was very crowded...for good reason. The tuk tuks, taxis, pedestrians, and Segway riders were all here for the best view of Lisbon. In a city full of great vistas, this has to be the best free one. Everyone was taking pictures and people politely waited their turn to take an un-photobombed shot."
        }, 
        {
            "index": 7, 
            "rating": "5", 
            "review": "nice view. From here you have a very nice view of the surroundings. You can get there with a interesting car called Tuk-Tuk or walking.I would recommend to visit this place."
        }, 
        {
            "index": 8, 
            "rating": "4", 
            "review": "Nice View. Good view over the city, castle and river (just a small piece of it though)! The terrace is a nice place to have a drink as well!"
        }, 
        {
            "index": 9, 
            "rating": "5", 
            "review": "Sunset at Miradouro da Senhora do Monte. Miradouro da Senhora do Monte. The best place in Lisbon to see the sunset and the panorama of the whole city! The highest point in Lisbon! 180º view! The Beautiful Lisbon view from the observation deck."
        }, 
        {
            "index": 10, 
            "rating": "5", 
            "review": "One of the great viewing points in Lisbon. A fabulous vantage lookout over Lisbon just above the steep Gloria tram. Great views over to the port and the castle. Great for sunsets. Lots of stalls serving craft products as well as refreshments, but nobody hassles you to buy anything. Very peaceful even though you get a few street performers. Oh, it's totally free."
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "Hidden gem... Awesome view.. Been to Lisbon many times, and I was convinced that I had visited all the popular look-out points. I was wrong. Only recently did I find this beautiful view of the city... and I Loved It!!"
        }, 
        {
            "index": 12, 
            "rating": "5", 
            "review": "Beatiful View!. Strongly recommend you to go during the sunset. Is breathtaking. And also there won't be many people around so you can have a quiet time looking at the view."
        }, 
        {
            "index": 13, 
            "rating": "5", 
            "review": "One of the best views from Lisbon. This is the place where you can get an scenic view from Lisbon. It is also the perfect spot to watch sunset."
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "One of the best views of Lisbon. Don't loose it. The (old) borrow is in it self very inteesting and the viwes are amazing. The castel de São Jorge can be seen from above and the river Tejo in a unique perspective.\nA tu"
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "best view of Lisbon. After visiting several viewpoints I would say that this is the best one for fantastic views over the city! Simply beautiful and definitely worth the hike up there!"
        }, 
        {
            "index": 16, 
            "rating": "5", 
            "review": "One of the top views in Lisbon. If you go there you experience a fantastic view of Lisbon and the river. For me, it is even better than the one from the castle, because you get the castle itself in the picture."
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "A must visit when in Lisbon. Excellent view area of Lisbon and highest point in Lisbon.\nYou can see the castle, the bridge and Christ statue among others from here for a beautiful picture."
        }, 
        {
            "index": 18, 
            "rating": "5", 
            "review": "Fantastic viewpoint. Almost 360 degrees and close to n Vicente Church and Panteao Nacional for tomb of Eusebio and Amalia Rodrigues. Fresh flowers left at the latter's whilst we were there."
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "Great view of the old city. Great view of the old Lisbon! We stayed at an A-&-B a couple of houses from the miradouro. We got the opportunity to view the old city during the day as well as its beautiful evening view. You could bring a bottle of wine or beer and enjoy it while contemplating the view."
        }, 
        {
            "index": 20, 
            "rating": "4", 
            "review": "Top views of the city. As expected, there is a long walk to be made before you reach this place, but depending on the route you take, the walk might take you along some narrow alleys, which may not seem the safest. However, the place itself has amazing views of the city."
        }, 
        {
            "index": 21, 
            "rating": "5", 
            "review": "The most amazing view of Lisbon. Perfect to go with a botle of wine, some glasses and your friends. Here you can see the most amazing sunset ever and the view is fantastique."
        }, 
        {
            "index": 22, 
            "rating": "5", 
            "review": "Nice view. This is a really nice view on a sunny day, above the roofs of Lisbon houses with the river in the background and blue sky. It is located in a small park, it is easily accessible, although it requires a bit effort since it is on the top of a small hill (a furnicular is also available but it costs massive 3.60 for a really short distance) but it's definitely worth the effort."
        }, 
        {
            "index": 23, 
            "rating": "5", 
            "review": "excellent view for lisboa. this spot is a great to bring your wine sit and enjoy the view. quite a relax area. this is one the several view points of lisboa a must see"
        }, 
        {
            "index": 24, 
            "rating": "5", 
            "review": "one of the most beautiful views of Lsbon. Quite hidden in a rather popular area of Lisbon, there is this wonderful spot with eautiful views on the Tagus river and central Lisbon. Very quiet, it is just perfect for a relaxing moment"
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "great view over Lisbon. You have an awesome view over Lisbon from this Miradouro. It's quite steep but defenitely worth walking up there."
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "Breathtaking views!. The highest hill offers breathtaking views of the city! Simply stunning! Just make sure you when the sun starts to set for photos worthwhile taking!"
        }, 
        {
            "index": 27, 
            "rating": "5", 
            "review": "Beautiful views!. Uphill in Lisbon but worth the walk. Beautiful views, day or night. Able to see the city, the castle and the ocean. A few stalls at the top selling drinks and snacks which is enjoyable after an uphill walk in the hot sun!"
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "This is the best!. This is for me the best of all the miradouros. Views of the monastery, the castle, the bay, the bridge, the city, and beyond the city. Simply panoramic. The view of the castle reminds me of the view of Grenada's Alhambra from its neighboring hill. We visited this mirador one evening after dinner in the neighborhood and enjoyed the site with old folks walking their dog (which they allowed me to pet!), young lovers, meditators, and a running club of about thirty members who passed at a clip!"
        }, 
        {
            "index": 29, 
            "rating": "4", 
            "review": "Excellent views from an antique evevator. A bit pricey, but the antique elevator car and the fantastic views make it a decent tourist attraction."
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Great viewpoint for sunset!. After the inevitably gruelling hike up to reach the viewpoint (as to be expected for anywhere that gives naturally good views in Lisbon) we arrived 10/15 minutes before sunset. There were a fair amount of people already there but it was by no means congested and we easily found a spot. People had brought beers and wine and were sitting on the grass ready to enjoy the views. This is a spectacular viewpoint and great for photos of the LIsbon skyline, whether at sunset or midday."
        }, 
        {
            "index": 31, 
            "rating": "4", 
            "review": "Very nice. strongly suggest to be there at the sunset, romantic and extremely nice.\nif you go late in the afternoon you can easily drink in the area waiting for a nice dinner around there."
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "Best viewpoint. Four days in Lisbon, having seen a double-digit number of viewpoints; this one was the best without a doubt - pleasant crowed, nice music, perfect view across castle and bridge"
        }, 
        {
            "index": 33, 
            "rating": "4", 
            "review": "Stunning view from Miradouro da Senhora do Monte. I took the tram uphill and made a brief stop at Miradouro da Senhora do Monte, can see the stunning view of the sea from there."
        }, 
        {
            "index": 34, 
            "rating": "3", 
            "review": "Ok view but not spectacular . I have been reading tripadvisor and decided to go here rather that to the castle. I must say I waited for something bigger. The view from our hotel room window at 21st floor is pretty much the same. Nice place to visit in case you haven't seen the city from high before."
        }, 
        {
            "index": 35, 
            "rating": "5", 
            "review": "Best Miradouro of Lisbon. Me and my wife love this place. We even went there to make some photoshots for our pre-wedding album. This place is absolutly magic at sunset."
        }, 
        {
            "index": 36, 
            "rating": "5", 
            "review": "The best!. The views that you've got from this Miradouro is just incredible!\nIn Graça neighborhood, the miradouro da Graça is the most famous one, but this one has even better views.\nThere is a small image of the Virgin standing in front of a chapel and overlooks the city."
        }, 
        {
            "index": 37, 
            "rating": "5", 
            "review": "Fantastic!!!. Highligh of my trip to Lisbon. Stunning views of the city, the river, thr bridge. Great place to hang out in thr evning. Bring a blanket and a couple of beer and enjoy stunning sunset. If you are lucky there will be someone singing or playing instruments. Enjoy!"
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "BEST views of Lisbon!. We went up the Calcada de MOnte Road, a gerat experience! At the tp, Miradouro da Senhora do Monte is a site where tons of peopel and carts come up to inorder to see the best views of Lisbon. All worth the efforts to climb up those roads! An easier way is to take one of those Carts to have a funny ride up and down!"
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "The best view of Lisbon. Great view of Lisbon. Shaded by trees, so you can relax a bit. Especially during hot days.Near the place you can buy espresso and pastéis de nata. Maybe a bit expensive, but very delicious!"
        }, 
        {
            "index": 40, 
            "rating": "5", 
            "review": "the best miradouro. It's the highest point from which you can see Lisbon and the river. The view is amazing and worth walking/climbing there."
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "Worth the trek - great view. This was one of my favourite views of Lisbon, however getting there was a bit of a mission - it was so steep at parts I thought I was going to slip! If you aren't up for walking then I reccommend getting a tuk tuk."
        }, 
        {
            "index": 42, 
            "rating": "5", 
            "review": "A sunset worth seeing . This is one of those places where almost any picture looks amazing. The access is a bit tricky by car with small streets but the view is amazing, even more spectacular by the sunset. If you are in a romantic trip, be sure to save an evening to go there."
        }, 
        {
            "index": 43, 
            "rating": "5", 
            "review": "Wonderful!!!. Best views of the city! Not so widely known as other miradouros but beautiful. Always windy and requires rather a steep walk, but the view's worth it."
        }, 
        {
            "index": 44, 
            "rating": "4", 
            "review": "A happy resting spot to view a magnificent city. We walked everyday during our stay in Lisbon. This is a beautiful spot to take photos and sit under the trees. We found this area on the way to one of the other historical buildings and before going to a local \"flea-market\", we would stop here to catch our breath and admire the view."
        }, 
        {
            "index": 45, 
            "rating": "3", 
            "review": "Panoramic View. A short distance from the castle this spot is great for views of Lisbon and photos. Also, a nice spot for a bit of shade from the hot sun."
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "One of the best Lisbon views. At the top of Senhora do Monte Street, you get to one of the smallest yet pitoresc place to get as amazing view of Lisbon. Now very frequented by trendy and hipsters. You also can enjoy a nice sunset seated in the garden and even visit the small Senhora do Monte chapel and statue which lays there."
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "WHY NOT TO TRY FROM ANOTHER ANGLE?. Just in front of the image of Holy Lady of Graça, from Miradouro da Senhora do Monte you can look to Lisbon downtown from a different angle, so wide that you can see from the river side of town almost to the north part of Lisboa, from the old downtown to the modern business districts, with some high buildings. And from this side of Lisboa, the oriental side, this one is, probably, one of the more quiets points to enjoy the vue for the roofs of downtown. and much more..."
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "One of the best view of Lisbon. One of the best view of Lisbon, careful, you might fall in love with the city. You can see the old lisbon, the castle, the river, all."
        }, 
        {
            "index": 49, 
            "rating": "5", 
            "review": "Lisbon best view. Lisbon, the city of seven hills .., Miradouro da Senhora do Monte is the highest point of the city , indispensable visit! 180 ° view and we can see the São Jorge Castle, the Tejo river , the April 25 brilhe, Monsanto Park, Carmo ruins, etc."
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "Best view in Lisbon. Need to say more? Its just a small viewpoint with some trees good for shade, in the middle of the oldest neighborhoods of Lisbon. And it has the best view you can get in Lisbon."
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "Breathtaking view. Very romantic. Take a bottle of wine or a couple of mojitos (we found a bar nearby for only 3.5 euros a mojito) and spend some time there in the evening watching the amazing view of Lisbon. Must see."
        }, 
        {
            "index": 52, 
            "rating": "4", 
            "review": "Great view. Excellent view, well worth the visit, tram 28e next to baixa chiado station will take you within 5-10 minutes walk from the castle entrance. Best time to go would probably be in the evening as its cool.and quite"
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "The best view of Lisbon. This is for sure the best view point of Lisbon. I had the opportunity to go there on the sunset. The ambience was great, furthermore there was a Brazilian guy playing guitar and singing. Just sit and relax."
        }, 
        {
            "index": 54, 
            "rating": "5", 
            "review": "Lively spot!. Take the Gloria lift to this spot in the evening/around sunset and you won't regret it. There was a live performance when we went there and a small market. The views are great and the atmosphere is really cool.You can wander around streets of Bairro Alto and eat at a nice place later. Don't know abt the party atmosphere 'coz we didnt stay back after 11.Also, use only Viva Viagem card with 6 euro unlimited day pass for these lifts. Otherwise they charge just about anything!! 5 euro for us on Santa Justa lift on day 1!"
        }, 
        {
            "index": 55, 
            "rating": "5", 
            "review": "Great view across the Baixa to Alfama. This is a shady garden at the head of the Elevador da Glória funicular with a broad terrace looking across Baixa to the Cathedral, the Castle and the hilly streets of Alfama on the eastern side of the old city. Glorious views, a lovely fountain, shaded benches - and it's free. There's also a cafe up there, though that isn't!"
        }, 
        {
            "index": 56, 
            "rating": "5", 
            "review": "one of the best spots of Lisbon view. Take 1 hour to enjoy a snack and an amazing view. Just by the Pharmacy museum for those who are curious of the history in medicine."
        }, 
        {
            "index": 57, 
            "rating": "5", 
            "review": "Lady of the Hill. We saw this lookout just before midnight through a tour company, Celina Tours. Our tour guide John parked the van and we were able to walk and view the city under the stars. Magnificent!"
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "#1 Spot in Lisbon. SssHHH...hidden gem...Find a way, but definitely the #1 Spot in Lisbon for views, atmosphere, and unwinding! Go straight from the airport, taxi, tuk-tuk, public transportation ,car or walking. Whether you only have a few hours, days, or weeks this is a hidden gem...Early, mid late afternoon- each time of the day is perfect- shady or sunny, tables, excellent service only surpassed by the ever changing views..Loved it so much we re-arranged our schedule to see the sunset every night we were there."
        }, 
        {
            "index": 59, 
            "rating": "4", 
            "review": "What a view.. Find some source of public transportation or be ready to fight for unavailable parking. The site appeared that was just restored/renovated. It was clean and everything in it place. The view of the surrounding city were spectacular."
        }, 
        {
            "index": 60, 
            "rating": "5", 
            "review": "The look of love. The best away to know Lisbon - and to fell in love with the city - is here. It is very easy to arrive there, just take the famous 28, walk a small distance and you will enjoy the best views of the town and the river. It's specially nice at the sunset, in the summer."
        }, 
        {
            "index": 61, 
            "rating": "5", 
            "review": "the nicest miradouro. simply, the nicest miradouro in Lisbon...good caffe bar, great view, not croweded...we where in the morning, so most of little wooden house with food did not worked yet, I guess it is even better in the evening"
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "Picture Perfect Views. Located high up in the middle of Alfama District, this mirador/viewpoint is one of the best in Lisbon. From the large 'platform' you can see over all of Alfama, the Tagus River and beyond. There are several interesting churches in the area that are ripe for exploring. Numerous restaurants, cafes and bars are within close proximity including several that share similar views as the mirador. Be prepared for crowds, especially in the evening."
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "Great view of the city. A bit of a hike, but well worth it. Just a small park (no entry fee). best enjoyed in late afternoon. Bring your camera and something to treat yourself with while watching the sun go down."
        }, 
        {
            "index": 64, 
            "rating": "5", 
            "review": "hidden gem. not the most popular miraduro out there but definitely worth the walk to see stunning panorama view of the city <3 perfect spot for a romantic walk in the evening.A must when visiting Lisbon !!!"
        }, 
        {
            "index": 65, 
            "rating": "5", 
            "review": "Stunning views of castle and Lisbon really great. Great spot we took tuk tuk to get there he waited and let us enjoy view brilliant you can really see Lisbon from there"
        }, 
        {
            "index": 66, 
            "rating": "5", 
            "review": "Best free view and vibe of Lisbon. You can see almost all the hills in here for free, and enjoy one of the enchanted places of Lisbon. If you can try to visit the little chapel and get to know more about the pagan fertility legend regarding Sra do Monte from ancient times."
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "Panoramic View. You just sit there enjoying the view and the atmosphere, absolutely loved it. The castle, the bridge, the ocean everything is there."
        }, 
        {
            "index": 68, 
            "rating": "5", 
            "review": "The mount with a beautiful view. If you want to see the best view of the city, you will walk up to hill more then a bit,as in the whole city, but it is definitely a worth. I recommend to go evening when is nice weather you can see everything."
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "Best point of the city with a great view. I loved this point of the city! It was included on the tour I made by tuk tuk.This Miradouro is lovely and with a huge view from the beautiful city of Lisbon."
        }, 
        {
            "index": 70, 
            "rating": "5", 
            "review": "A worthy workout. To get here you either take the stairs that look like they never are going to end, or walk up hill forever. Either way, when you are at the top, the views of Lisbon will make you forget that previous workout."
        }, 
        {
            "index": 71, 
            "rating": "4", 
            "review": "Good full view of the city. It's high up, but the climb is not too bad and well worth it for the fantastic view of the city. Once up there, don't miss the church next to it which has a very ordinary exterior, but it's such a serene place of worship inside."
        }, 
        {
            "index": 72, 
            "rating": "3", 
            "review": "better to go in the evening. be prepared to climb a million steps in order to see the city view, nothing spectacular at daytime though. Better visit in the evening"
        }, 
        {
            "index": 73, 
            "rating": "5", 
            "review": "Great view - and it's free. The best views in Lisbon. Its a grand climb but take a tuk tuk as that is an experience in itself. Quite a few amenties in the area too."
        }, 
        {
            "index": 74, 
            "rating": "5", 
            "review": "less known gem. A less known miradouro with beautiful views over Lisboa (from the opposite side than the castle), nice little church with a secret (the stone chair !)"
        }, 
        {
            "index": 75, 
            "rating": "4", 
            "review": "The best view from the top. from this point it gave a good view of Lisboa. A quaint chapel is there, a few benches, good shade from the trees around, best if there were cafe shops for frappe on a summer day or warm cocoa or coffee during the colder season. Overall also a good place to view the sunset."
        }, 
        {
            "index": 76, 
            "rating": "4", 
            "review": "Panoramic View. It's worth the climb of 93 stairs. You can reach there by tuktuk also. Very scenic. I could see people choosing the most suitable place, setting up their camera tripod and waiting for the sunset well in advance. It's sure to give you few breathtaking photographs. You can relax there and enjoy a beer while enjoying the view of the famous Sao Jorge Castle and the beautiful town. But it gets very chilling there, so ensure you go there well prepared. There's a small chapel there too.."
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "Fantastic Views. This place has the most amazing views of Lisbon. It's really a must-do when visiting. Be warned- you will need to take some time to click lots of pictures!"
        }, 
        {
            "index": 78, 
            "rating": "5", 
            "review": "Incredible views. Yes, it is quite an effort to walk up to the miradoro. Completely worth it! Grab a bottle of water and go for it! Better just before the sunset."
        }, 
        {
            "index": 79, 
            "rating": "4", 
            "review": "Lovely stop,great for photos. If you take a tuk-tuk tour, you will stop at this outlook. It is a great place to get an overall photo of beautiful Lisbon. There are no services here, just a cart selling water, snacks and other drinks. It is good for about a 15 min. stop"
        }, 
        {
            "index": 80, 
            "rating": "5", 
            "review": "Beautiful!. Absolute must see! I can't imagine my trip to Lisbon without going there. This is the place from where you can see the beautiful city like on the palm of your hand. I bet you will love it! No tiny doubt about it!"
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "How to leave this beautiful place.... We know we never really leave a place, it's locked in memory and, when the view is as beautiful as this, in hearts. The blue sky, the terracotta buildings, the shady benches, the grand old trees, the artisan lemonade, the tasty crepes, guitar music...a place to gaze, a place to read, a place to allow you breath to be taken away. So here is how I suggest you leave. Walk downhill past the noisy tuk-tuks queueing to arrive and then turn right into the larger road following the tram lines. Walk a couple of hundred yards and then turn left downhill when you see the river, again following the tram lines. Narrow streets, down, down you go, past all the crooked old houses, there are cafes and small restaurants serving grilled food, down towards Alfama where there are even more restaurants, bars and wine bars. And you are then by the Rio Tejo. About 45 minutes in total, downhill momentum and curiosity will make it seem like no time at all!"
        }, 
        {
            "index": 82, 
            "rating": "4", 
            "review": "Just a good hotel, but the view is fantastic.. Nothing special about the hotel, decor could be revamped too; however the view over the city is superb - just make sure to book a room with a city view.The one thing that will beat the the city view from your room will be the city view from the breakfast room, higher up in the hotel."
        }, 
        {
            "index": 83, 
            "rating": "5", 
            "review": "Best view of the city.. My favorite spot, grew up close it and still it amazes me!Used to be less crowded than now, but it's impossible not to be amazed by this city view!A must for any traveler!"
        }, 
        {
            "index": 84, 
            "rating": "5", 
            "review": "Amazing views. I'd recommend taking some lunch or snacks, coming up here and enjoying the views sitting on a bench. I went on a Monday afternoon and it wasn't too busy. It's a great place to get a feel for Lisbon, you can see a lot of the city from up there. There's quite a few steps to climb to get to the top but it's all the more rewarding once you get there!"
        }, 
        {
            "index": 85, 
            "rating": "5", 
            "review": "Best view of all! . This place has the best view of the city! Really breathtaking views of the city, the bridge and the River. The ideal activity here would be to soak some sun, enjoy the views and drink the local Sagres Cervaja. Top notch!"
        }, 
        {
            "index": 86, 
            "rating": "4", 
            "review": "Great Views. Lots going on --music, food, an opportunity to buy some local crafts. We were here on a Saturday, so there were many families. We enjoyed walking down and doing some window shopping along the way."
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "The best one, but popular... This is a popular place, with the recent increase in visitors to Lisbon it gets packed. However it is something you really have to see..."
        }, 
        {
            "index": 88, 
            "rating": "5", 
            "review": "My favorite spot in Lisbon. Just grab a bottle of vine and come here at any time of the day, to watch the best city in the world from above!"
        }, 
        {
            "index": 89, 
            "rating": "5", 
            "review": "Picnic spot with locals!. This was place has a great view and locals go at the end of the day to unwind. We saw many music groups performing, and hip crowds having a beer and chatting. Children, dogs, picnics, great view. Go for sunset!"
        }, 
        {
            "index": 90, 
            "rating": "4", 
            "review": "Sweeet View. There are heaps of viewing points around Lisbon but this was probably the best one. and one of the highest too. I would definitely recommend people to go just so they can experience that special moment of awe."
        }, 
        {
            "index": 91, 
            "rating": "5", 
            "review": "$500000 View. Very fonderfull overview of Lisbon.. one of the best cities for visiting in whole Europe... cheap, nice, cultural and good foooooooooood :D"
        }, 
        {
            "index": 92, 
            "rating": "5", 
            "review": "Great view. Don't miss . Stopped here on a private tour. Great panoramic views of Lisbon that helped me gain orientation of the area. Bathroom is available."
        }, 
        {
            "index": 93, 
            "rating": "5", 
            "review": "Great place to have a moment away from the bussy streets of the city. If it's not raining and you really need a moment away from the crowd (as I did) - grab a beer and a snack and go there! Wonderful place to rest and enjoy the view under the shadow of really amazing big trees.I walked up to there from the Green line metro station \"Intendente\" but if you need to give your feet some rest you could get tram 28 or a taxi as well :) Enjoy!"
        }, 
        {
            "index": 94, 
            "rating": "5", 
            "review": "Views like nowhere else. Went up to this viewpoint with friends a couple times. Perfect for late afternoons, the lights are almost always unique. You can just sit there and stare at the city from above. Amazinh"
        }, 
        {
            "index": 95, 
            "rating": "5", 
            "review": "Awesome. In the city of the seven hills this is one with an awesome view of Lisbon! It is told that Ulisses fell in love with Lisbon when we saw this same view, enough said!"
        }, 
        {
            "index": 96, 
            "rating": "5", 
            "review": "Amazing views. A great find. Well worth the walk for the spectacular views over the city. A must if in Lisbon on a clear day"
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "Beautiful views of Lisbon. I love Lisbon and the views from this Miradouro is beautiful. We went at night and the city look so pretty. I recommend to make some time and go there."
        }, 
        {
            "index": 98, 
            "rating": "5", 
            "review": "Fantastic view. Just a few minutes from our Airbnb, we visited the miradouro on our first day in. Fantastic vie, really gets you a good idea of the city. Quite a steep climb though, use took-tooks or tram 28 up to stop Rua da Graça."
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "Outstanding views of Lisbon. A spectacular location for a drink, after dinner stroll or simply romantic moments...This is a spot that is simply beautiful. Popular with locals."
        }, 
        {
            "index": 100, 
            "rating": "5", 
            "review": "Best view over Lisbon. One of the nicest views over Lisbon. Not so known as other miradouros, this is a quiet place, for some reflexion. Must see at the end of the afternoon at sunset."
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "One of Lisbon's hidden gems - Uma das jóias escondidas de Lisboa. Stunning view in a lovely and quiet environment. Don't miss it.\nVista arrebatadora, num ambiente muito agradável e calmo. A não perder."
        }, 
        {
            "index": 102, 
            "rating": "5", 
            "review": "Admire the old quarters of Lisbon!. Don't miss the right street to arrive. Located in a popular district, this Belvedere should be visited on the morning to catch the best light. Wonderful view over the old quarter of the city. Close to a small chapel closed most of the time). Stroll around. Lose yourself in the small alleys. Feel the unique atmosphere of the old town."
        }, 
        {
            "index": 103, 
            "rating": "5", 
            "review": "Best viewpoint at no cost. It's a big hike up here (you need to be in somewhat good shape) but the views are the best that you're going to find. Also it's free. It's definitely worth taking the effort to come up here to take photos of breathtaking views of the city, but make sure you plan it for a clear day."
        }, 
        {
            "index": 104, 
            "rating": "4", 
            "review": "Great view over Lisbon. We took Tram 28 to the top; we got the driver to tell us the correct stop, as it was not obvious. Excellent 340 degree view of Lisbon, including the castle and 25 April bridge. We then walked back down to Martin Moniz metro station."
        }, 
        {
            "index": 105, 
            "rating": "5", 
            "review": "Don't miss it!!. Best view on the city, especially at night! You can see both the castle and the 25 de abril bridge. Easily reachable from Martin Moniz with the tram 28. Asked the driver to tell you where to get off. It's not as crowded as the other miradouros yet, so don't miss it."
        }, 
        {
            "index": 106, 
            "rating": "4", 
            "review": "Most amazing view, off the tourist path. Walk up and enjoy the view, just gaze and enjoy... no facilities or restaurants here, just a peaceful, glorious view."
        }, 
        {
            "index": 107, 
            "rating": "5", 
            "review": "Amazing place, free to view get a uber cab from old town 5 euros! So far this is the best place we have been!. This place was amazing free to get in and we just sat on the edge of the wall looking at the sunset as it came down and made coming to Lisbon The most amazing experience you must come and visit as this is the best view of Portugal!!"
        }, 
        {
            "index": 108, 
            "rating": "5", 
            "review": "This is probably one of the most wonderful sightseeing points over Lisbon!. This is the highest point in Lisbon, where you can have a 270º view over the city center.. breathtaking!\nDefinitely a must see spot. Mandatory!"
        }, 
        {
            "index": 109, 
            "rating": "5", 
            "review": "Perhaps the best miradouro . The title says it all. The view is amazing at whatever time of the day and night, clearly when it is not rainy or foggy. Reachable by car or on foot via a somehow steep uphill road, it has several benches and a kiosk where to buy something to eat or drink."
        }, 
        {
            "index": 110, 
            "rating": "1", 
            "review": "Amazing sunset view!. If you like a fantastic view over yhe river and a part of the historical city of Lisbon, dont't loose this \"miradouro\"!"
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "Amazing view of Lisbon. If you have the chance, is one of the greates place to go and enjoy the Lisbon View. Free of charge."
        }, 
        {
            "index": 112, 
            "rating": "4", 
            "review": "Beautiful view, great vibes. This is the highest point of urbanized Lisbon. It has a really wide view around it and it is splendid. Because it is so high up and outside the main touristic route it doesn't have many tourists. It is quite small and has a really nice cozy chapel. Great for sunsets"
        }, 
        {
            "index": 113, 
            "rating": "4", 
            "review": "real good view , not before sunset. for people who can t climb moutains 18% 300 m to the miradouro. different way possible. ülsce for 100 people , a lot of young people their"
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "Definitely the best in town. I've been to each and every miradouro in Lisbon and this is by far the best in town. An absolute must."
        }, 
        {
            "index": 115, 
            "rating": "5", 
            "review": "Wonderful view of Lisbon city. Great place to visit. You can take a tuk tuk up and walk down.Lots of benches to sit on and you can bring something to eat.When I was there, a small lemonade car was providing lemonade and other drinks, as well as alcohol, and coffee.From this Monte miradouro, I walked down to the next miradouro of Graca, about 10-15 minuttes apart."
        }, 
        {
            "index": 116, 
            "rating": "5", 
            "review": "One of the must does in Lisbon!. You have to see at least one sunset from this spot, but during the day there are also those who stay for hours in the shade of the olive trees, cypresses and pines. The view is amazing and the atmosphere, as in whole Lisbon, relaxed and enjoyable."
        }, 
        {
            "index": 117, 
            "rating": "5", 
            "review": "Highest point in Lisbon. Omg this place is beautiful.. on the day I went it was soo windy that I had to hold on to a tree to be able to take pictures..I don't know if this is the norm up there but it was very windy to the point you had to grab a hold of something.Love this lovely view nonetheless. . Great view overlooking all of lisbon."
        }, 
        {
            "index": 118, 
            "rating": "4", 
            "review": "Nice view. It is a bit out of the way, but on the route from electrico 28. So still easy to visit. You have a great view over the castle and lisboa. If you are in the neighbourhood be sure to visit"
        }, 
        {
            "index": 119, 
            "rating": "5", 
            "review": "Evening fun. This is a very lively place to visit in the evenings, with a lot of young people having fun and socialising in a non threatening way. The local café/restaurant has good views, and reasonably priced, good food. Great place just for the vibe, and the sunsets."
        }, 
        {
            "index": 120, 
            "rating": "5", 
            "review": "Unbeatable at night. Let me start by saying the walk isn't for the faint hearted - after climbing the numerous steep hills to get there my iPhone said I'd climbed 40 floors. Not only are the narrow hills steep, the steps themselves are sloping so expect to be out of breath by the time you reach the top.The view though really is stunning, especially at night when the bridge is all lit up as is all of Lisbon which you can see nearly all of. And unlike the Sao Jorge castle, it's completely free."
        }, 
        {
            "index": 121, 
            "rating": "5", 
            "review": "Dazzling view over Lisbon!. Worth a visit especially at sunset. Take the time to go up the hill and be dazzled by the view of the bridge, the river, the Castle and different parts of the city."
        }, 
        {
            "index": 122, 
            "rating": "5", 
            "review": "Priceless. Best view over Lisbon. Enjoying TuK TuK trip over old Lisbon we get here and appreciate the wonderful view to Tagus river"
        }, 
        {
            "index": 123, 
            "rating": "5", 
            "review": "One of the best panoramic views. On a nice day, a good invigorating walk but with a reward at the top, beautiful Lisbon at your fingertips! Stop for a coffee and immerse yourself in the colors, light and beauty that surrounds you!"
        }, 
        {
            "index": 124, 
            "rating": "5", 
            "review": "Great views. When we went there was lot of construction around the site but still we enjoyed the view of this spectacular city."
        }, 
        {
            "index": 125, 
            "rating": "4", 
            "review": "Lot of steps. Exhaustive but worth climbing. View over Lisbon from there is beautiful, lot of benches to rest and admiring landscape."
        }, 
        {
            "index": 126, 
            "rating": "5", 
            "review": "Nice view and religiosity. Miradouro da Senhora do Monte has a great view over Lisbon. It´s amasing how the sensation of the view changes according to the time, there is, morning or around the sunset. Jjust accross the street, there is, a small church (or chapel) where, as legend says, women with difficulties concerning getting pregnant, ask (and receive) a grace for that. Or, those who are pregnant and visit the place, will have a peaceful delivery."
        }, 
        {
            "index": 127, 
            "rating": "5", 
            "review": "Amazing view. One of the most beautiful spots to enjoy the view over the town... can be kind of windy (-: - also the little chapel is cute to visit and the white saint statue"
        }, 
        {
            "index": 128, 
            "rating": "5", 
            "review": "Now that's a view. Amazing view of the city with the greatest view of the castle in my opinion. At sunset it's apparently amazing..."
        }, 
        {
            "index": 129, 
            "rating": "5", 
            "review": "Nice view of the city!. I stayed at a hotel located next to this wonderful miradouro with beautiful views over the city of Lisbon. It's a favourite place for tour buses to stop and there are many enjoying the lovely (and free!) views of the city, night and day. It's nice to sit under one of the shady trees overlooking the city and just absorb the lovely views. Very peaceful location."
        }, 
        {
            "index": 130, 
            "rating": "5", 
            "review": "The hidden hill of Lisbon!. Hidden behind the castle when you look from the Tagus river, this place gives a wonderfull view over Lisbon.Nowadays, there's a lot of persons who get together to watch the sunset over the city into the sea.Please don't miss it!"
        }, 
        {
            "index": 131, 
            "rating": "5", 
            "review": "Best view of Lisbon. Lisbon is full of miradouros (belvederes), and even though most say the Miradouro da Graça is the most beautiful one (it is indeed one of the biggest ones, with benches and drink kiosks), it is not :-) just a few hundred meters away is the Miradouro Nossa Senhora do Monte, smaller but with a much better view. Offering a view slightly higher than the Graça (and accessible through some stairways in the Graça district), on a clear day you can see Lisbon from the Castle São Jorge on your left down to the Belem Tower on your right. Some say this was the spot where the Marquis of Pombal inspected the rebuilding of Lisbon after the XVIII century Earthquake. If you want great views from the city and do not want to be interrupted by tens of tourists (that are always around the Miradouro da Graça), this is your spot."
        }, 
        {
            "index": 132, 
            "rating": "5", 
            "review": "Best Miradouro in town. From this Miradouro you can nearly see all of Lisbon, from the Castle on the left, towards the Baixa at the center, all the way towards the 25 de abril bridge to the right. Definitely the best spot to enjoy the city."
        }, 
        {
            "index": 133, 
            "rating": "5", 
            "review": "Great view. We travelled here for the view after a recommendation from friends and it was well worth the trip. You can see for miles, it's picture perfect."
        }, 
        {
            "index": 134, 
            "rating": "5", 
            "review": "Best views of the city. One of the best miradouros in Lisbon. Not too easy to find and therefore probably not that touristic, but definitly the best views 360 degrees of Lisbon. It also has a cute little church."
        }, 
        {
            "index": 135, 
            "rating": "4", 
            "review": "Nice view.. Tram #28 from Martim Moniz place to Sra. Monte stop, one before Largo da Graca - 5 min. walk.Very nice view of the surroundings, quite panorama of Lisbon - postcard picture quality."
        }, 
        {
            "index": 136, 
            "rating": "4", 
            "review": "The best place to get a wonderful view of Lisbon . It's better to go there by tram. The view is amazing. You can also contemplate the 25th of April bridge from there."
        }, 
        {
            "index": 137, 
            "rating": "5", 
            "review": "Excellent views of Lisbon!. Given Lisbon's location on several hills the city offers plenty of places with a view. This one is best when you want to get a view over the whole city including the st georges castle. Although it is not the easiest to reach, it's totally worth it."
        }, 
        {
            "index": 138, 
            "rating": "5", 
            "review": "Best view. This is defiantly one of the best view to Lisboan both day and night, nice photos guaranteed, worth to come"
        }, 
        {
            "index": 139, 
            "rating": "4", 
            "review": "Beautiful. One of the most interesting attractions in Graca neighborhood, and it's free! :) You can have a stunning view of Lisbon from there."
        }, 
        {
            "index": 140, 
            "rating": "5", 
            "review": "The highest point in the city. We took the Gloria tram up the hill and a very steep hill it is too. At the top there is a terrace that offers a panoramic view of Lisbon.There is an open-air cafe and it was so relaxing to sit in a deck chair with a drink in hand looking out at all of Lisbon below.There was a serene and unhurried atmosphere up there. Definitely worth a visit."
        }, 
        {
            "index": 141, 
            "rating": "5", 
            "review": "A different view. Many, many people see Lisbon from the Castle walls but what about this breathtaking point? Worth the trouble of finding it and it's even better at sunset. Don't missi it!"
        }, 
        {
            "index": 142, 
            "rating": "5", 
            "review": "Best panorama of Lisbon Hills, Cristo Rei and Bridge over Tagus river. If you are looking for the best panorama photo of Lisbon Hills, then you have to go to this viewpoint. You can oversee Lisbon Hills, Tagus River, 25 de Abril Bridge and Cristo Rei.Simply Amazing. If you ask any Tuk Tuk driver, he will take you there. It is quite busy until late night.You can visit during the day or at night, since it is an open space and the landscape is mandatory."
        }, 
        {
            "index": 143, 
            "rating": "5", 
            "review": "Among the best views in Lisbon!. Definitly among the viewpoints in Lisbon which one has to visit! Get a complete panoramic view of this beautiful city :)"
        }, 
        {
            "index": 144, 
            "rating": "5", 
            "review": "Best view of Lisbon from above!. This is the spot to go to if you want to see Lisbon from above with a beautiful scenario including the castle, downtown, the bridge and Cristo Rei. Amazing angle for great photographs and also a nice place to enjoy the cool breeze in the summer under the trees. Highly recommended!"
        }, 
        {
            "index": 145, 
            "rating": "4", 
            "review": "Unique view of the sunset in Lisbon. In this \"miradouro\" you'll have one of the most beautiful views of Lisbon. In the Graça neighborhood, the old Lisbon. If you can be there in late afternoon to see the sunset."
        }, 
        {
            "index": 146, 
            "rating": "4", 
            "review": "Great spot to see the City... day or night... Another great spot to see the city of Lisboa... enjoyable at day or night.... maybe with a glass of Douro...Enjoy your stay"
        }, 
        {
            "index": 147, 
            "rating": "5", 
            "review": "Beautiful . Chose to stay at an apartment near here just to get this view readily. I wasn't disappointed. Beautiful place"
        }, 
        {
            "index": 148, 
            "rating": "5", 
            "review": "Séxi weekend. The view is absolutely amazing and the walk, hands in hands, through Bairro da Graca, served by the famous 28 tram is a must."
        }, 
        {
            "index": 149, 
            "rating": "5", 
            "review": "An open window to Lisbon. As a Portuguese living in Lisbon surroundings, I must tell you this is one of the perfect viewpoints from the capital city of Portugal! From here, you can have a great, beautiful natural portrait of Lisbon, from the river side to the old part of the city. The sloping street you have to climb to get there is totally worthwhile once you get there to admire such a beautiful cosmopolitan landscape. Perfect for a sunset!"
        }, 
        {
            "index": 150, 
            "rating": "5", 
            "review": "The Best sunset view from Lisbon!!\". That is definitely the best view that you can have from Lisbon. I have been there in the morning and afternoon for an amazing sunset experience that was spectacular. This is a must see spot and after visiting St. George Castle."
        }, 
        {
            "index": 151, 
            "rating": "5", 
            "review": "One of the best Lisbon views. The view is amazing and there is also a small chapel nearby. It is particularly beautiful before and during the sunset. It has a map of Lisbon that explains what you are able to see."
        }, 
        {
            "index": 152, 
            "rating": "5", 
            "review": "Beautiful views of Lisbon at its highest point. After walking the many neighborhoods and hills of Lisbon, we decided to get some help via tram line to reach this miradoura. We had visited the Estrella Basilica to the west and hopped on Tram 28 After a nice ride through the heart of the city, it was nice to get a big lift up the hill to the Graca stop. From there it is a short hike up the steep hill to the viewpoint.Lisbon from every view is beautiful, and this one is no different. It is the highest point however and not crowded at all since it is a little further away than others. It is worth the trek and very picture-worthy."
        }, 
        {
            "index": 153, 
            "rating": "5", 
            "review": "Great walk, amazing view. Just nice stroll to see an amazing view. Especially nice to see sunset, or sunrise if you are an early person."
        }, 
        {
            "index": 154, 
            "rating": "5", 
            "review": "Incredible views of the city. Worth a trip up. I got a taxi there and admired the views a little after sunset. It is quite spectacular and certainly worth the effort to find."
        }, 
        {
            "index": 155, 
            "rating": "5", 
            "review": "The most amazing of all the Mirador. This sightseeing spot is located at the highest point (I think) of the Alfama district. It is a little bit tricky to find and you might end up walking up-hill a lot but the scene from this is totally worth the effort. I had a chance to watch sunset from this place and it was amazing. There are no restaurants around unlike other \"mirador\". I can never get enough of it. Highly recommended"
        }, 
        {
            "index": 156, 
            "rating": "5", 
            "review": "The highest viewing platform of Western Lisbon area. After visiting Castelo Sao Jorge, we first stopped at Miradouro das Portas do Sol ... then took Tram E28 up to Miradouro da Graça ... then up again to Miradouro da S. do Monte, the ultimate place to watch sunset.Highly recommended ... by tram or walking from Almafa area.When going downhill, we took Rua da Senhora do Monte to find Tram E28 again. This street is unique: a lot of old houses with Azuleros (ceramic plates) can be discovered and in particular on the right an old house with an extra room on the roof, just like a lighthouse."
        }, 
        {
            "index": 157, 
            "rating": "5", 
            "review": "The best miradouro in Lisbon!. This panoramic point is simply amazing. The way up is a bit hard, but the view from the top is worth it!"
        }, 
        {
            "index": 158, 
            "rating": "5", 
            "review": "The sun goes down . Beautiful view the best sun set from Lisbon always busy mostly young with guitars and beer just sit there with a beer and feel the atmosphere is priceless a few bar around .have to visit if you in Lisbon"
        }, 
        {
            "index": 159, 
            "rating": "5", 
            "review": "excelent. Great view of Lisbon in PortugalI recomend for you and your familly , friends and anything in the Wold"
        }, 
        {
            "index": 160, 
            "rating": "5", 
            "review": "Unwind. Every time we come here we just feel relax and at peace. The view of the city is just phenomenal. You can take tram 28 to Graca then walk about 5-10 mins to the view point.Highly recommended!"
        }, 
        {
            "index": 161, 
            "rating": "5", 
            "review": "Stunning view. Absolutely incredible view from the top of the mountain. Very picturesque in the early evening hours as the sun sets over Lisbon. Worth every step of the climb to the top!"
        }, 
        {
            "index": 162, 
            "rating": "5", 
            "review": "What a view!. While touring in Lisbon, we climbed high to Miradouro da Nossa Senhora de Monte (Our Lad of the Hill Viewpoint) for a fabulous view from its tiny park encompassing Castle St. Jorges, the Rio Tejo (Tagus River) with its bridges and the red-roof tops of the city. There is also a small image of the Virgin standing in front and a tiny chapel here too."
        }, 
        {
            "index": 163, 
            "rating": "5", 
            "review": "Best Lisbon view. This place is a very \"alfacinha\" place full of tradicional heritage. The view is excelent and without too many tourists"
        }, 
        {
            "index": 164, 
            "rating": "5", 
            "review": "if you know better Lisbon.... please don´t miss this panoramic view Go at sunset and you will have one of the most scenery of Lisbon"
        }, 
        {
            "index": 165, 
            "rating": "5", 
            "review": "Top view of Lisboa, No 1.. We took a tuk-tuk from town down (Praça do Comércio) up ill to this \"miradouro da Senhora do Monte\" with the best view of old Lisbon, the castle, the river, the bridge, etc, etc. really breathtaking. Visit the church if opened. Coming down ask your driver to go trough the old narrow streets right by the castle with so many beautifull things to admire!"
        }, 
        {
            "index": 166, 
            "rating": "5", 
            "review": "Beautiful views of Lisbon. The walk up the steep street is worth the effort for the spectacular views over Lisbon - especially at in the late afternoon when the sun hits the hills with a warm glow. There are a couple of small kiosks where you can buy a drink and a snack and enjoy the view or recover from the walk. to make it easier on the way down you may decide take the yellow funicular tram."
        }, 
        {
            "index": 167, 
            "rating": "5", 
            "review": "Breathtaking view. Must do! Walking better to reach the destination and appreciate the discoveryDo it morning time,do it sunset, do it night timeSimply magical and romantic.Little cafe up there"
        }, 
        {
            "index": 168, 
            "rating": "5", 
            "review": "best miradouro in town. You defenitely have the best view above the castle and the whole town from this Miradouro. Its worth a visit."
        }, 
        {
            "index": 169, 
            "rating": "5", 
            "review": "It's all about the view. Sit down and enjoy the view . Spend some time looking at all that the view has to offer . From this point you can see a good part of Lisbon and the other side beyond the Tagus river. The access is not easy, since it is one of the seven hills of Lisbon . Get ready for a good climb , but will see it well worth it!"
        }, 
        {
            "index": 170, 
            "rating": "5", 
            "review": "Amazing place. Amazing place to visit.. a must seen in Lisbon.. Highly recommended for all. Unique experience........"
        }, 
        {
            "index": 171, 
            "rating": "5", 
            "review": "Incredible view. Don't miss the best place to see the city from above! Also it's a great place to start wandering around Alfama"
        }, 
        {
            "index": 172, 
            "rating": "5", 
            "review": "Beautiful place to watch the sunset.. Just a lovely place to watch the sun go down and take some great photos. Although a bit busy still quite romantic. Bit hard to access but you can get tuk tuk or taxi quite easily and cheaply. Another really good look out ( better in my view) was Lookout Point of São Pedro de Alcântara on the other side in Bairro Alto. Also really lovely was the and Lookout Point of Porta do Sol and Miradouro de Santa Luzia both in Alfama. Try them all - its worth it."
        }, 
        {
            "index": 173, 
            "rating": "5", 
            "review": "The best Miradouro in Town.. The best one in town, the painted tiles you see at the Miradouro do not contain the 25 th of April Bridge because they were done prior to the bridges' construction.From this Miradouro you can also visit Miradouro de Graca and Miradouro Santa Luiza!"
        }, 
        {
            "index": 174, 
            "rating": "4", 
            "review": "Lovely night view . We went there to take some night pictures of Lisbon and it was well worth it. You've got all city at your feet. Sparkling with lights. Beautiful view."
        }, 
        {
            "index": 175, 
            "rating": "5", 
            "review": "Great View. A must go to place, it is where you will have a very good view of the city, enjoy the beautiful scene from high point"
        }, 
        {
            "index": 176, 
            "rating": "5", 
            "review": "Most beautiful view of Lisbon for me!. For me the absolute most beautiful view of the city of Lisbon! It's not too overcrowded yet because it's way up and it's a little bit hidden. I took the tram up to Largo da Graca and walked the rest. Very romantic at sunset ;-)"
        }, 
        {
            "index": 177, 
            "rating": "5", 
            "review": "Good way to get the layout of the city. From this vantage point can see the city and the hills. Great steep ride up here. on a clear day can see across the Rio Tejo."
        }, 
        {
            "index": 178, 
            "rating": "5", 
            "review": "High point. Highest public viewing point in Lisbon, not to be missed. Great panoramic views. Uphill hike to get there or take a Tuk-tuk."
        }, 
        {
            "index": 179, 
            "rating": "5", 
            "review": "great view. the best viewpoint in Lisbon. a place where we can enjoy an amazing view over the city.a little bit difficult to reach this place alone"
        }, 
        {
            "index": 180, 
            "rating": "5", 
            "review": "Stayed next door. We stayed at the hotel on top of the hill/mountain. We observed this breathtaking view everyday. It's rather amazing and one of the best picture opportunities in all of Europe. Bring some wine, relax with the family or special someone. Best part, it's free!Of note traffic getting there is tight. Small streets and not much parking. Most people came via tuck tuck."
        }, 
        {
            "index": 181, 
            "rating": "5", 
            "review": "Panoramic views. Fabulous views, a nice spot on a sunny day with panoramic scenery.\nwe would recommend a visit,not wheelchair friendly"
        }, 
        {
            "index": 182, 
            "rating": "4", 
            "review": "Great landscape / Uma das melhores vistas de Lisboa. Go there. Walk along Graça and Alfama. Your eyes will be delight with the Tejo, among Lisbon quarters at your feet. Ask for a kiss and, if you wish, you can stay at the Albergaria with the same name. Enjoy yourself for a sunset at Lisbon!"
        }, 
        {
            "index": 183, 
            "rating": "5", 
            "review": "The sundowner seranade. Possiblt one of the best views of Lisbon as the sun goes down. But it is a populat spot especially with the locals so don't expect to get it to yourself. Avoid mid to late afternoon when the tours get there."
        }, 
        {
            "index": 184, 
            "rating": "3", 
            "review": "Away from the crowds. Beautiful view over the wonderful city of Lisbon. In general the Miradoura is not crowded and a resting point during the city visit."
        }, 
        {
            "index": 185, 
            "rating": "5", 
            "review": "Highest natural point of Lisbon. A place where you can witness a great view of Lisbon. Good to go by day, sunset or night, you will always want to sit for a while."
        }, 
        {
            "index": 186, 
            "rating": "5", 
            "review": "Amazing view and great lemonade!. Took a nice walk up to the top. It is a decent climb but the spectacular views and lemonade at the top made it well worth it."
        }, 
        {
            "index": 187, 
            "rating": "5", 
            "review": "Not to be missed for the fabulous views!. A short uphill walk through Barrios Altos, absolutely worth it for the amazing views over Lisbon.\nThe atmosphere is also very nice, lots of people and music, especially at sunset.\nIf you prefer you can ride the tram covered in graffiti up and down, it will save on the legs! (Funicular)"
        }, 
        {
            "index": 188, 
            "rating": "5", 
            "review": "Breathtaking View. This Miradouro is breathaking, the view is such that one cannot leave that place,it is so azmasing we can see the Iintire city,The Rio Tejo,the Statue of Crito Rei a famous beautiful Statue of Jesus,so Large and Tall It can be seen from all sides of the Rio Tejo the famous Rio in Lisbon,beautiful were people can walk,site relax just stay ther for ever.this view has a beautiful Chapel with a Statue of Our Lady Do Pranto.It is worth to go their,do not miss it,you will never forget tha beautiful View.It is very relaxing just to seat and look at that beautiful city Lisbon at our feet."
        }, 
        {
            "index": 189, 
            "rating": "5", 
            "review": "A great walk and an even better panorama.. The walk to the Miradouro da Senhora do Monte is well worth the effort as the panoramas that you will find at the top are superb - highly recommended."
        }, 
        {
            "index": 190, 
            "rating": "5", 
            "review": "Lovely view. Nice place to visit specially if u are with your partner the sunset is just beautiful from this view point. recommend it!"
        }, 
        {
            "index": 191, 
            "rating": "5", 
            "review": "Beautiful view of Lisbon. The view from this is amazing you can see almost every corner of Lisbon and the other side of the river we got there by tuk tuk and was very funny"
        }, 
        {
            "index": 192, 
            "rating": "5", 
            "review": "Go see!!. Although it does require some hiking to get to this viewpoint, it is totally worth it! An excellent overview of Lisabon! Too bad it was cloudy when I was up there and couldn't enjoy the sunset."
        }, 
        {
            "index": 193, 
            "rating": "5", 
            "review": "Best Lisbon city view. Especially great at sunset or sunrise. Has the spectacular view of Lisbon. Great place to take photos. Worth all the walk to the mountain!"
        }, 
        {
            "index": 194, 
            "rating": "5", 
            "review": "The best view of Lisbon at night. Walking uphill for this view is definitely worth it, certainly the best spot for looking over Lisbon"
        }, 
        {
            "index": 195, 
            "rating": "5", 
            "review": "Wonderfull view. A wonderfull view of lisbon's mountais. At sunset is really impressive. One of my favourite views in lisbon."
        }, 
        {
            "index": 196, 
            "rating": "5", 
            "review": "Fantastic views, worth the hike!. Quite a trek up the old streets to get there but well worth it, especially if you time it just right for sunset it is really breathtaking. It was busy but also felt lovely and peaceful and you could gaze for hours at the monuments, squares and roads below, the sparkling blue river and the castle perched on its own hill. I'd recommend you go midway/near the end of your holiday so you will be able to spot places you've been and monuments you know."
        }, 
        {
            "index": 197, 
            "rating": "4", 
            "review": "It is difficult to reach by foot. You have to go up and down. you have to walk much. You see usual view in Lisboa: roofs, roofs and roofs.... and a little bit of ocean. but you must go there and verify by yourselves. if not, you don't beleve it."
        }, 
        {
            "index": 198, 
            "rating": "5", 
            "review": "Almost an aerial sight over Lisbon!. Great view !!! Almost an aerial view over Lisbon ! There is a small chapel nearby and a coffee kiosk with terrace where you can enjoy the old Lisbon , on the roof of the small houses and narrow streets and see some ancient monuments with the Tagus River on the horizon."
        }, 
        {
            "index": 199, 
            "rating": "5", 
            "review": "Amazing views. We had to walk a little and ask around, in order to get here, but the views were definitely worth it! We actually saw this place from the Sao Jorge castle, and after the visit, we made the long walk there. It's a great spot, the light was really nice over the city in the late afternoon and the sunset was breathtaking. There was a little cart which sold cocktails and wine and played some music, which was a nice touch for the whole experience."
        }, 
        {
            "index": 200, 
            "rating": "5", 
            "review": "Wonderful view, though quite far from the centre. A very nice spot to enjoy a magnificient view of Lisbon. The best moment would be at the end of the day with a warm light. It is quite simple to get there from the Alfama, you will need to take a tram over a few stops but you can also walk.The only annoying thing is that you will find a quiet and desert surrounding with no (or little) possibilities to have dinner or have a drink."
        }, 
        {
            "index": 201, 
            "rating": "5", 
            "review": "One of the amazing view points. Amazing place for chilling in the evening with friends and a beer. Quite easy to find and definitely worth of seeing."
        }, 
        {
            "index": 202, 
            "rating": "4", 
            "review": "Lisbon seen fron Graça. As all Lisbons viewpoints Senhora do Monte lets you discover the wonderful colours of Lisbon. Be sure to visit aldo the viewpoint of São Pedro de Alcântara to get the opposite view. (These two viewpoints face each other!)"
        }, 
        {
            "index": 203, 
            "rating": "5", 
            "review": "A view that is wonderful at any time of day or night.. What a wonderful view, not many cities in Europe can match it. From this vantage point one can pick out many points of interest like the remains of the cathedral that collapsed in the earthquake, the lift designed by Eiffle that takes one from street level up to street level several stories above and the bridge across the Tagus."
        }, 
        {
            "index": 204, 
            "rating": "5", 
            "review": "Best public view of Lisbon. With a circa 225º panoramic view of Lisbon, beneath the shadow of a Pine tree, this is probably the best view of Lisbon with a public access."
        }, 
        {
            "index": 205, 
            "rating": "5", 
            "review": "Splendid view. This is one of the nicest viewpoints of Lisbon. usually crowded with tourists. Use a Tuk Tuk to get there , but mind you ... any single trip with a Tuk Tuk, for less than 15' does cost you 15 euro's ... even for 5 minutes."
        }, 
        {
            "index": 206, 
            "rating": "5", 
            "review": "It will be your favorito place!. Not so crowded as many others, this is one of the best places to see the whole city! There is no cafe or similar around, so you are just there for the view. An amazing view!"
        }, 
        {
            "index": 207, 
            "rating": "5", 
            "review": "Superb sunset venue. Take a bottle of bubbles and a loved one or close friends and family to watch the sunset from this great location in Graca"
        }, 
        {
            "index": 208, 
            "rating": "5", 
            "review": "Best views of Lisbon. In Graça neighbourhood you can found one of the best viewpoints of the city. Amazing! Also visit the very small chapel built were the first Portuguese king made camp before conquering the city in the mid 12th century. One of the best places in Lisbon. Use tram 28 to get there and also Miradouro da Graça close by."
        }, 
        {
            "index": 209, 
            "rating": "5", 
            "review": "Mesmerizing view. This is by far the best miradouro in Lisboa. It was quite a steep climb to get there, but totally worth it."
        }, 
        {
            "index": 210, 
            "rating": "4", 
            "review": "Still a must, though invaded by Tuk-Tuks!. A must in Lisbon for the spectacular view of the Castle, the Baixa, the 25 April bridge and the Teijo. Nossa Senhora do Monte is where brides often go to offer their bouquets (including myself!) and remains a mystical place in town. We pay a visit every time we a re in town and the only pity is that this year we found far too many Tuks- Tucks with tourists parked there and unprecedented sellers of limonade and caipirinhas...Takes the magic away."
        }, 
        {
            "index": 211, 
            "rating": "5", 
            "review": "Great views over Lisbon. Worth the hill. A great place for a stunning panorama over Lisbon. From here it is possible to see all the sights spanning out to the bridges and the Rio De Janiero esque statue of Jesus on the far bank. Many people arriving here by Tuk Tuk but the walk really wasn't that bad even in the height of summer. A small mobile cocktail bar out of a van at the top serving mojitos and ample benches to sit and watch the vista. Perfect place to view a lovely sunset from."
        }, 
        {
            "index": 212, 
            "rating": "5", 
            "review": "Amazing view of the city!. Not much to say after that title. If you want to take that amazing photo having Lisbon as background, this is it! After you can take a 5 minute walk to another great viewpoint 'Miradouro da Graça'."
        }, 
        {
            "index": 213, 
            "rating": "5", 
            "review": "Breathtaking views. One of the best views one can experience in Lisbon. A great opportunity for a one in a lifetime photograph with Lisbon in the background. A must if you are visiting the city."
        }, 
        {
            "index": 214, 
            "rating": "5", 
            "review": "Another view over Lisbon. The view over Lisbon, specially after sunset is magnific , this point of view is located over one of the famous seven hills of Lisbon"
        }, 
        {
            "index": 215, 
            "rating": "5", 
            "review": "beautiful view. To get here it's rather difficult. The miradouro is hidden up narrow streets, so use a map or better GPS navigation.The view from up there is very beautiful, all the way down to Restauradores square and to Praca de Commercio. We visited in the evening/sunset and it was amazing."
        }, 
        {
            "index": 216, 
            "rating": "5", 
            "review": "Amazing views. Got there by the yellowbus green tram after a short hike from the stop.Wonderful views and nice shade to just sit back and relax.Few food and drink carts around.Also washroom facilities available."
        }, 
        {
            "index": 217, 
            "rating": "5", 
            "review": "close to Graca. You can get there by tram 28 and then a short walk (2 mins) up the hill. When you get to the place, you can even have a mojito or coffee with a custard tart as now there are stands with food and drinks there. Enjoy the views with landing airplanes in sight."
        }, 
        {
            "index": 218, 
            "rating": "4", 
            "review": "wonderful view. nice romantic place to have drink and look over the city. great view of the castle. bit of a steep hike though so be prepared"
        }, 
        {
            "index": 219, 
            "rating": "5", 
            "review": "A breathtaking view of the city. The Miradouro (which means scenic overlook in Portuguese) is definitely a must-go for everyone who gets to visit Lisbon. Here you can have the most impressive view of this entire historical city (besides the Castelo de São Jorge which is located very close to this Miradouro). Surrounding the overlook there is an area covered in grass where, if interested, you can climb over the fence and settle, and just indulge in this picturesque sight in front your eyes. Especially during sunset. It's fascinating. You won't regret it.It could be a little complicated to reach the Miradouro on foot for people who are not too familiar with the neighborhood. I would recommend taking the yellow tram (Elétrico) or No.734 at the bus stop near the Martim Moniz square. Beware of pickpockets because there're lots of them. Then get off at the stop Rua da Graça (near the Restaurante A Tasca do Jaime). Go straight along Rua da senhora do Monte, the street that slopes up to the Miradouro."
        }, 
        {
            "index": 220, 
            "rating": "5", 
            "review": "Panoramic view of Lisbon. One of the best vistas of Lisbon. Very easy to find, not crowded. If coming from a long walk, there is a cafe that offers respite from the heat and walking."
        }, 
        {
            "index": 221, 
            "rating": "5", 
            "review": "Outstanding view. Best at sunset.\nYou will have to climb a lot but it is totally worth it.\nNice place to have a drink or a meal!"
        }, 
        {
            "index": 222, 
            "rating": "5", 
            "review": "Stunning view. As part of a Tuktuk tour we visited this place at the end. Wait for the sun to set over the city to enjoy it even more."
        }, 
        {
            "index": 223, 
            "rating": "5", 
            "review": "panorama of whole lisbon. highest panorama point in lisbon, close to metro station intendente ( but still 20 minutes walk up the hill), access also by car, beautiful at day and night"
        }, 
        {
            "index": 224, 
            "rating": "5", 
            "review": "Hidden gem. Located atop one of Lisbon's hills, this miradouro offers a spectacular view of downtown Lisbon, Sao Jorge castle and the bridge. Not known to the classic tourist guides, the view totally worth it."
        }, 
        {
            "index": 225, 
            "rating": "5", 
            "review": "Sombre. Strange museum but needs a visit. :Lots to see and the Gulbenkian collection of furniture strange mixture of mid east and west. Some lovely sculptures and an interesting family."
        }, 
        {
            "index": 226, 
            "rating": "5", 
            "review": "One of the the best view! . The best view !! All Lisbon at 360 ....it's easy to climb with 28 tramway from Largo Martin Monniz . Thé place to go !"
        }, 
        {
            "index": 227, 
            "rating": "5", 
            "review": "Astonishing views over LIsbon downtown and Bairro Alto Hill.. I just love everything.It is a vvery beautiful spot to take photos of Lisbon and also have a romantic scenario to surprise your love one. It has a small chapel and a astonishing view of Saint George Castle, the river Tagus behind it and all of Lisbon downtown and up front hill."
        }, 
        {
            "index": 228, 
            "rating": "5", 
            "review": "One of the best views of Lisbon!. From this sightseeing place you can have a wonderful photo that includes the Castle, the bridge and the Christ! Lovely!"
        }, 
        {
            "index": 229, 
            "rating": "5", 
            "review": "Better than expected. I almost missed it but then we found some additional time and took the 28 Tram up to a place near this Miradouro. Then went there.\nThe views are the best I've seen in Lisbon and the highest (at least this was my impression).\nNice place to spend some minutes. Definitively I recommend it."
        }, 
        {
            "index": 230, 
            "rating": "4", 
            "review": "One of the best view. This is most probably the highest point to look down to the city. The whole city is at your feet. Sometimes it is very much crowded with tourists."
        }, 
        {
            "index": 231, 
            "rating": "5", 
            "review": "Excellent view. I've seen quite a few miradouros already in Lisbon and so far this is my favourite.Not difficult to navigate walking up the hill from Martim Moniz and there are a few stands at the miradouro which sell refreshing drinks to replenish your thirst while soaking in the view from the highest point in all of Lisbon!Was quite windy when we were there so take something to cover up with if you want to stay there a while."
        }, 
        {
            "index": 232, 
            "rating": "3", 
            "review": "Good views. This is another fantastic view of Lisboa. As always in this town, you'll need to climb a bit to reach it. But it is worth the effort."
        }, 
        {
            "index": 233, 
            "rating": "4", 
            "review": "A great view of the city. A great place for a (almost) birds-eye view of the city. During summer it is usually crowded with tourists.You can take a short walk to nearby Miradouro da Graça and enjoy a drink in its open-air cafe."
        }, 
        {
            "index": 234, 
            "rating": "5", 
            "review": "Nice view. A miradouro not that known and packed as others. Definitely worth a visit. After take a walk through the areas Graca or Mouraria."
        }, 
        {
            "index": 235, 
            "rating": "5", 
            "review": "Superb (and free) views over the city. Take tram 28 to Graca, then a short walk up the Rua da Senhora do Monte. The views over the city are magnificient. There are also several restaurants a short walk from the viewpoint."
        }, 
        {
            "index": 236, 
            "rating": "5", 
            "review": "Wonderfull view on the city. Wonderfull and excellent view of whole city of Lisbon!!! With Renault Twizy is very simple to get on the top of the hill to see Lisbon"
        }, 
        {
            "index": 237, 
            "rating": "5", 
            "review": "One of the Lisbon Hill. one of the best places to review the city of Lisbon in a general matter.You can see a part of Lisbon, one of the seven hills."
        }, 
        {
            "index": 238, 
            "rating": "5", 
            "review": "Great view. Great view, great place to chill with friends or family, really enjoyed being there a few times, hope to comeback."
        }, 
        {
            "index": 239, 
            "rating": "5", 
            "review": "Lisbon's Highest Look Out Point. This is the best lookout point in Lisbon and the best thing it is FREE. It has an amazing beautiful view of the town especially at Sunset. You look down upon the 7 hills of Lisbon over the Castle Sao Jorge, the River Tagus, the Bridge of 25th of April, the Alfama, squares and churches. You also get good views of Baixa and Bairro Alto. Tram 28 comes reasonably close but the easiest way if you struggle on hills is a taxi which are quite cheap.Lots of people of all nationalities on this visit.If this review is helpful then please indicate so below."
        }, 
        {
            "index": 240, 
            "rating": "5", 
            "review": "It is a long way up, but it is worth it!. If you have a car this is a must. There is a lot of narrow streets, but you will end up on a beautiful view of all Lisbon. The best time to go is the sunset or by day where you will appreciate all Losbon."
        }, 
        {
            "index": 241, 
            "rating": "5", 
            "review": "The miraculous miradouro. Do it to see the sunrise or the sunset. And do it either on the first day or the last day of your visit to Lisbon.On the first day, it will help you get your bearings. On the last, it will help you remember all the places and people you met on your trip. Of all the stunning miradouros in Lisbon, this was the highlight."
        }, 
        {
            "index": 242, 
            "rating": "5", 
            "review": "Amazing view!. View includes St. George's Castle, the downtown as well as the Tagus in the background. Pick up a take out lunch in the Largo da Graca and a bottle of wine and enjoy the afternoon. Better yet, stay at the Albergeria Senora do Monte next door."
        }, 
        {
            "index": 243, 
            "rating": "5", 
            "review": "Great Views of Lisbon. This is one of the best viewpoints to see Lisbon. Take a Tuk-tuk up there and drive through the Alfama district. It is fun and the view is free."
        }, 
        {
            "index": 244, 
            "rating": "5", 
            "review": "Well worth the climb. We went to this mirador with a picnic lunch after completing the excellent Lisbon chill out walking tour of the city. The views from the lookout were amazing, the shady trees provided respite from the heat and we enjoyed our picnic lunch while taking in the panorama that unfolded beneath us."
        }, 
        {
            "index": 245, 
            "rating": "3", 
            "review": "Don't waste your time .... How does this spot end up as #5 on the top to-do list in Lisbon, I have no idea. Yes, the view is not bad, but there are numerous view points like this all over Lisbon (St. Jorge castle, which we visited just earlier the same day, has a better view). My problem is, there's not much in the surrounding area, you have to make a hike up there and then you find out there's really nothing but a similar view as other viewpoints in Lisbon .... it was pretty disappointing to me. IF you have a car and you drive up here for the view, fine. But don't make a special trip here especially if you are not driving. It's not worth it imho."
        }, 
        {
            "index": 246, 
            "rating": "5", 
            "review": "Most beautiful view over Lisbon. It´s not that easy to find but if you reach this place you will have the most beautiful view over Lisbon. Just go there, take a bottle of wine with you and enjoy!"
        }, 
        {
            "index": 247, 
            "rating": "5", 
            "review": "The view of the whole Lisbon. You can see the whole city from this top but be prepared cause it can be really windy. Also this place has benches and a few more attractions to visit."
        }, 
        {
            "index": 248, 
            "rating": "5", 
            "review": "One of the best views and free. Yes, it's up a couple of steep little roads but as a result it's probably the highest point you can get a good view from near Rossio. More importantly it's free, unlike the view you would get from say, the castle (which is also nice though)."
        }, 
        {
            "index": 249, 
            "rating": "5", 
            "review": "Great view . One of the breath taking place to see Lisbon and it's free. While going down its lots of places for a drink like cold cervesa or glass of port"
        }, 
        {
            "index": 250, 
            "rating": "5", 
            "review": "one of the best views over Lisbon. the place is very romantic . you can´t miss the view and in the neibourhood.there is a little chapel where woman go if they want to get pregnant"
        }, 
        {
            "index": 251, 
            "rating": "4", 
            "review": "Very nice views... Worth a trip. Great place for photos. I took the green line, Metro to this place. It was the Intendente stop. It is a 10-15 walk from the station but it's worth it. I had a photo of the name of 'Miradoiro da Senhora do Monte' on my phone and showed it to two locals and they pointed me in the right direction; no sweat.It's breezy but the highest point in Lisbon and worth the short time it takes to get there."
        }, 
        {
            "index": 252, 
            "rating": "4", 
            "review": "Almost in the clouds. Okay, slight exageration. But it is the highest point in central Lisbon and it shows with the view. Once upon a time this was a place of pilgrimage outside Lisbon and there was little more here than the chapel (which still exists).Check it out."
        }, 
        {
            "index": 253, 
            "rating": "5", 
            "review": "Probably my favourite spot in Lisbon. The best description of this charming viewpoint would be \"the best skyline overview of Lisbon\". Do not forget to visit this spot before you leave the city. You will understand then why Lisbon is known as 'a cidade das sete colinas'.Nice walk and good atmosphere around the area. Bars and restaurants can be found near to relax after a nice walk."
        }, 
        {
            "index": 254, 
            "rating": "5", 
            "review": "Great city view!. I do recommend to visit it when you are in Lisbon. It was quite windy there but the view was just awesome!"
        }, 
        {
            "index": 255, 
            "rating": "5", 
            "review": "great view. THE SPOT... the best place to see Lisbon, near restaurants and places to see, it´s the perfect end (or start) of a walk through the city! cool"
        }, 
        {
            "index": 256, 
            "rating": "4", 
            "review": "Nice Viewpoint. It's a really nice viewpoint with a formidable view over Lisbon, which used to be a nice variant to the more popular Graça viewpoint. Lately it has become a tourist attraction for all those tuktuk-sightseeing taxis and gotten pretty crowded during the day, although there is no café or similar up there."
        }, 
        {
            "index": 257, 
            "rating": "5", 
            "review": "best view of the city. Spare a couple of hours to go there and just sit beneath a tree to enjoy the view. The view is beautiful."
        }, 
        {
            "index": 258, 
            "rating": "5", 
            "review": "Worth the climb. We walked up here on our last day when we used to the steep roads. It is a lovely spot and gave us an excellent over view of all the places we had visited during our stay. The views are stunning and made the climb well worth while."
        }, 
        {
            "index": 259, 
            "rating": "5", 
            "review": "nice walk destination. very good view for the city, goo dcity walk destination, you can stop on the way for cup of cafe in some nice cafeshop :)"
        }, 
        {
            "index": 260, 
            "rating": "5", 
            "review": "Amazing view. Highest point of the city and gives a great view of the city and the river. From here you can see the castle, the bridge, the Cristo, the streets and squares of Chiado and the park at Marques."
        }, 
        {
            "index": 261, 
            "rating": "4", 
            "review": "Nice View. A nice view of the São Jorge (St. George) Castle and Lisbon. We walked from the castle to this overlook."
        }, 
        {
            "index": 262, 
            "rating": "5", 
            "review": "Fantastic scenic viewpoint. We visited the Miradouro de Senhora do Monte as part of a one hour tuk tuk tour around Alfama. The cost was E 45 for the hour on board.The view from do Monte was of course fabulous - a superb vista of Lisbon, as good as any you will find.Is it THE best as many sites suggest? Perhaps, but it is really that much better than the splendid views from the Castle.We certainly enjoyed our visit there."
        }, 
        {
            "index": 263, 
            "rating": "4", 
            "review": "It used to be a hidden marvel. It is hard to get there if you're not fit, and even if you are you will be panting when you reach the top. But it will be worth every single step you took - the sight is a great payoff, and the breeze is a bonus.Problem is, it is hard to find a place to sit there, since it has become increasingly popular. It is, however, still more quiet and peaceful here than in Miradouro da Graça, partly because there is no cafe/kiosk here (so I recommend you bring your own beverage).Also, there will be a lot of Tuk Tuks there too."
        }, 
        {
            "index": 264, 
            "rating": "5", 
            "review": "Beautiful at sunset!. Lovely panoramic views from this outlook point in Graca. There is a kiosk/café where one can sit and enjoy drinks and snacks."
        }, 
        {
            "index": 265, 
            "rating": "4", 
            "review": "One of the best privaate collections. The permanent collection is good, but do check out if there another temporary exhibit. When I visited, they had the private collection of the royal family of Spain. Overall, you can spend about 2 hours watching each exhibit."
        }, 
        {
            "index": 266, 
            "rating": "5", 
            "review": "Spectacular view!. My husband and I happened upon this view by chance while wandering around the Graca area of Lisbon. Wow! It says a lot about a city when a view this beautiful can be accessed for free, and while just exploring the area. I plan to return with a camera next time!"
        }, 
        {
            "index": 267, 
            "rating": "5", 
            "review": "TOP VIEW. The best point for see Lisbon! Totally recommended, you have a very nice view on Sao Jorge castle, Sao Vicente, the 25th April bridge, Praça do Commercio, the statue of the Christ, and the city of Lisbon "
        }, 
        {
            "index": 268, 
            "rating": "5", 
            "review": "Amazing view and so romantic!. Our hotel was very near this viewpoint. It's lovely anytime of the day but especially in the evening as the city lights come on. Lots of locals come here to enjoy the incredible view. You should too!"
        }, 
        {
            "index": 269, 
            "rating": "5", 
            "review": "Do this!. Part of Lisboa's charm is the presence of miradouros (lookouts) one may stumble upon while traveling around this magical city. These miradouros provide some of the most stunning views of the City of Lights. I highly recommend for you to visit Miradouro da Senhora do Monte at dusk. It's quite a hike all the way up top to this point of the city, but you will become enamored with Lisboa & all of its charm as you watch the lights come to life one by one after the sun rests for the day. I discovered this place during my third trip to Portugal. I fell in love with this city the first time I visited but seeing this breathtaking view made me gaze in awe at all of this city's splendor. No words can do this view any justice. Bring a sweater as it gets quite windy up there. Enjoy!"
        }, 
        {
            "index": 270, 
            "rating": "5", 
            "review": "The best view in town (and it's free!). For me, it's the best sightseeing spot in Lisbon! It's mostly attended by tourists (a lot of portuguese/lisboners never heard of it).It doesn't have coffee places so you won't have noise around you. It's just you and an 180º view of Lisbon starting from Graça, São Jorge's castle, Baixa, Bairro Alto until the end of Avenidas Novas. Ps: Sunset in there is something you'll cherish for a long time :)"
        }, 
        {
            "index": 271, 
            "rating": "5", 
            "review": "The Best View of Lisbon. Amazing spot with a huge view of Lisbon, my favourite. Located in Graça it worth a visit by taking the 28 tram"
        }, 
        {
            "index": 272, 
            "rating": "5", 
            "review": "Lovely view of the city. In a city with lots of wonderful overlooks, this must be one off the best! We didn't take time to have a coffee, but others did and it looked like a very nice idea."
        }, 
        {
            "index": 273, 
            "rating": "2", 
            "review": "Run down and dirty . The panoramic views are nice but not as stunning as Alfama. The neighborhood around it is not very nice and the mirador itself is a bit dirty. There are no cafes or bars nearby"
        }, 
        {
            "index": 274, 
            "rating": "5", 
            "review": "A must. Most beautiful view you could possible have of Lisbon! The entire city is visible from the Miradouro, is a great place if you would want to sit and read a book. It's also one the of the most (if not the most) romantic place in Lisbon, if you are travelling with a special someone, make sure you take the time to just take in the beautiful view of the Miradouro with each other."
        }, 
        {
            "index": 275, 
            "rating": "5", 
            "review": "AMAZING view. Sure, there were some stairs involved, but my goodness what a view. You get to see a huge chunk of the city from up high. The value is priced perfectly for me at 0 euro! Anyone who says the hike isn't worth it is crazy, definitely worth seeing if you have time."
        }, 
        {
            "index": 276, 
            "rating": "5", 
            "review": "Breathtaking view!. Well worth the walk to have the opportunity to see Lisbon from this point. The view is amazing. Great opportunity to take some nice photos. Would definitely"
        }, 
        {
            "index": 277, 
            "rating": "4", 
            "review": "Good view of the city. It always amazes me how people live in such high points, having to climb up with their groceries on a daily basis. Luckily for us ( tourists) who comes to such places once or twice, this point is truly a reward for the effort."
        }, 
        {
            "index": 278, 
            "rating": "4", 
            "review": "Miradouro. great viewpoint with nice baroque church and a little cafe ...................................................."
        }, 
        {
            "index": 279, 
            "rating": "5", 
            "review": "one of the most beautiful miradouro. Lisbon has a lot of miradouro i suggest to do all of them to be sure to see lisbon from every point of view"
        }, 
        {
            "index": 280, 
            "rating": "3", 
            "review": "Not worth the long hike up. Miradouro da Senhora do Monte may be the highest viewpoint in Lisbon, but in my opinion it is too far from the river to get good pictures. The view from Castelo de Sao Jorge was much better, because from there you can see Praca do Commercio, Ponte de 25 Abril and Christo Rei all together. This place is free and Castelo costs 8,50 per person, so that's of course the positive thing about this place. If you have limited time in Lisbon, do not waste your day by hiking here as we did."
        }, 
        {
            "index": 281, 
            "rating": "4", 
            "review": "Scenic and beautiful. A great hike. 60 minutes from lisbon. Great scenic drive and hike . some of the best of what portugal country side can offer"
        }, 
        {
            "index": 282, 
            "rating": "5", 
            "review": "The best view of Lisbon!. It's a really nice terrace above the city center from which you have a breathtaking view. Well worth the hill climbing to reach it. You can literally see everything. It's the best place for taking precious photos."
        }, 
        {
            "index": 283, 
            "rating": "5", 
            "review": "Great miradouro!!. best view we have had in lisbon! very high up, beautiful view! just very hard to find, there are no sign posts and the maps are basically useless! there is also no kiosk so don't expect a drink when you arrive! but it is a spectacular view, well worth the climb!"
        }, 
        {
            "index": 284, 
            "rating": "4", 
            "review": "Worth the \"climb\". It's really high up and not very easy to reach. Also, there's not much to do in the surrounding areas. Probably the best views of the city though since you see the Castle, the river, downtown, etc."
        }, 
        {
            "index": 285, 
            "rating": "5", 
            "review": "Lovely city view. One of the most fantastic views of Lisbon. On the top of one of seven hills of Lisbon. Nearby you can visit the Castelo de São Jorge"
        }, 
        {
            "index": 286, 
            "rating": "3", 
            "review": "Great view. Great view, but not very special. We spent to much time to get there but were completely disappointed! We enjoyed wandering at Alfama and Chiado more than here."
        }, 
        {
            "index": 287, 
            "rating": "5", 
            "review": "Best View of Lisbon. Absolutely fabulous view of Lisbon from this Mirador, I think it's the best in the city. Sunset looks lovely from here, and I think one of the main best things of this Mirador is the low amount of people that go there (I've heard this is were the locals go to have a stunning view of the city), expect the place to be really quiet and peaceful when compared to other spots in Lisbon. Although bring your own beverages and food as on top there is absolutely nothing apart from the stunning view."
        }, 
        {
            "index": 288, 
            "rating": "5", 
            "review": "Great view and excellent atmosphere. Every single Miradouro is special on its own right and you shouldn't miss the Senhora do Monte one, beautiful views and great atmosphere, full of locals!! Love it"
        }, 
        {
            "index": 289, 
            "rating": "5", 
            "review": "Inspiring view. One of the most outstanding skyline views over Lisbon.Lisbon, the city of seven hills, offers you in Miradouro da Senhora do Monte, the possibility to overview lisbon and the outskirts with an astonishing sight.Take a bright sunny day to go there and you'll have a shinny picture!.Take na evening and you'll the charm of the night lights!But, please try to go there at sunset! Just unforgeatable!"
        }, 
        {
            "index": 290, 
            "rating": "5", 
            "review": "Amazing view. One of Lisboa's top places to see the city and the castle!! Also great spots nearby to have a cheap lunch and enjoy neighborhood cosy scenarios."
        }, 
        {
            "index": 291, 
            "rating": "5", 
            "review": "Lisboa hill with a view. One of the best views over Lisboa old town. Go there by the sunset or after hours (by night time) and enjoy the view of the Castelo de São Jorge, Baixa, rio Tejo, ponte 25 de Abril, Chiado and more... Whatever your in, one hour of peace enjoying the view and thinking about the meaning of life or just passing by for 3 seconds is worthwhile the tour up there."
        }, 
        {
            "index": 292, 
            "rating": "3", 
            "review": "Lovely view. It does give a lovely view of the city and worth it for photos if you are round that way (short walk from the castle hill, for example), but it is a mirador with no major facilities other than a cafe bar."
        }, 
        {
            "index": 293, 
            "rating": "4", 
            "review": "Great view!. You've to go there! Great view. Go there by day and night both! See a huge part of the historic city centre!"
        }, 
        {
            "index": 294, 
            "rating": "5", 
            "review": "Amazing view. One of the most amazing viewpoint's in the city, a combination of Lisbon slopes, Tejo river, Atlantic Ocean and the Castle of St.George."
        }, 
        {
            "index": 295, 
            "rating": "4", 
            "review": "One of the best views of Lisbon. While this small place isn't the most accessible one, it has one of the best views of Lisbon. From here you can in the horizon \"Ponte 25 de Abril\" and \"Cristo Rei\". On your left you'll be able to see the \"Castelo of São Jorge\" and in front of you downtown."
        }, 
        {
            "index": 296, 
            "rating": "4", 
            "review": "Fantastic look out point. One of the most breathtaking views to Lisbon...less tourists and excellent place to be to enjou a sunset."
        }, 
        {
            "index": 297, 
            "rating": "5", 
            "review": "Beautiful spot! Worth the hike!. This is a great spot! Relax and have a break. It is definitely worth making the trek by foot. Recommend getting lost on your way up through the town of alfama. Winding and and narrow passage ways."
        }, 
        {
            "index": 298, 
            "rating": "5", 
            "review": "Another overlook you must visit. The nice view (amazing during day or night) should be more than enough for you to visit. You don't need much time to see everything and might like to leave your \"love locker\" if you're visiting it with your pair. From here you can see a couple of other outlooks in the city, which deserve your visit. If you're just in business, you might want to stop by just for a quick look... It will worth your time!"
        }, 
        {
            "index": 299, 
            "rating": "5", 
            "review": "really worth!. dont be scared of hike till here.is worth and not far from bus 28 stop!just a breathless view...nothing else:LISBOA IS HERE!"
        }, 
        {
            "index": 300, 
            "rating": "5", 
            "review": "Miradouro da Senhora do Monte. Stunning views over the city. There are several 'Miradouro' sites to visit, each of the hills of the city of Lisbon."
        }, 
        {
            "index": 301, 
            "rating": "3", 
            "review": "Ok . . .. Bit boring. You can see all around but when you've been to Sintra or Funchal you will find this a little underwhelming. I think you get a better view from the castle too. May as well go there if you don't have much time."
        }, 
        {
            "index": 302, 
            "rating": "5", 
            "review": "Superb vantage point!. Amongst a few of viewpoints in Lisbon that I have been to (including Castelo de Sao Jorge), I can say this one offered the most incredible view. Just perfect for pictures!"
        }, 
        {
            "index": 303, 
            "rating": "5", 
            "review": "Miradouro. Great place for 'legalized' travellers! The view is really amazing, but to get there is kinda trashy way"
        }, 
        {
            "index": 304, 
            "rating": "5", 
            "review": "Nice view of St. George's Castle. Many people go to visit St. George's Castle to get the beautiful views of Portugal and the bridge, however, from this lookout (one of many in Lisbon), it's possible to get the bridge and the castle in the same view, so for people that would like to capture this in a photograph, this is a good outlook to go to. It's not hard to get to, a bit of uphill walking, but nothing terrible. There is a few benches around to sit, and a fence with a whole bunch of lovers locks left on it.It's peaceful and beautiful."
        }, 
        {
            "index": 305, 
            "rating": "5", 
            "review": "best views of the city. one of the highest points of Lisbon you can see almost all city. Situated in Bairro da Graça a picturesc neighbourhood, near other places like Mouraria, Alfama and the S. Jorge Castle you can try the famous 28 electric bus."
        }, 
        {
            "index": 306, 
            "rating": "3", 
            "review": "Nice view but nothing special. After reviewing all the recensions in Trip advisor (1st place of attractions in Lisbon)we have decided to visit this place to enjoy the view of the city.. We went there when it was already dark but honestly l expected more.. The view was nice but not breath-taking.. In my opinion much better view of different parts of the city you can have from the Castle."
        }, 
        {
            "index": 307, 
            "rating": "5", 
            "review": "A view to remember!. From Portugal Hotel towing a 4 year old daughter (she walked the first 10 mins) it took us 15 minutes -- hilly walk and narrow roads, steps, etc. but at the end it is all worth it! The view is spectacular! We walked about 2 mins to the main road then took a 3 min taxi which was about 3 euros! We would have walked but the daughter won't take another step, thus, the taxi. Very safe and highly recommended! Plus it's free!"
        }, 
        {
            "index": 308, 
            "rating": "4", 
            "review": "Great place for a late night drink.. We went there for a late night drink, this place has a nice view, so pop up if you have time at thenight time or even durring the day."
        }, 
        {
            "index": 309, 
            "rating": "5", 
            "review": "One of many. There are many sightseeing places in the city and they are all amazing. It was great to spend the evening just enjoying the sunset even though it was a bit cold!"
        }, 
        {
            "index": 310, 
            "rating": "5", 
            "review": "The most beautiful view!. This top notch thing to do when it's sunny and awesome when cloudy if you want to take timelapse of the sunset. Awesome vibe, people enjoing time, playing guitar, singing all together."
        }, 
        {
            "index": 311, 
            "rating": "5", 
            "review": "Highest lookout point in Lisbon. The best things in life are free like this beautiful view of the town especially at sunset. You look down upon the 7 hills, the castle, the river, the bridge of 25th of April, the Alfama, the churches and squares. Really international crowd up there, bring a bottle of wine and a tripod. When it is very busy, be aware of pickpockets."
        }, 
        {
            "index": 312, 
            "rating": "5", 
            "review": "Breathtaking view in the heart of Lisbon.. Do not miss this viewpoint if you like panoramic views of the city, bridge and bay. Turns into one of the most romantic places in Lisbon after the sunset."
        }, 
        {
            "index": 313, 
            "rating": "5", 
            "review": "Best (public) view over Lisbon. Been to Miradouro da Senhora do Monte many, many times in my life. It was one of my favourite spots to show the best of Lisbon, with no tourists around. Now went back and it is full of tourists. The now pervasive tuk-tuks stop there and have made it a major attraction. Regardless of this, it is still definitely worth a visit, as it has one of the best, if not the very best view from a public spot in and from Lisbon. Magic at sunrise or sunset in a warm day. No food or drinks there, go to the nearby Miradouro da Graça for that (a bit lesser view, yet still great)."
        }, 
        {
            "index": 314, 
            "rating": "5", 
            "review": "Great Overlook. You can really see the city from here. We saw it New year's Day and there were a lot of empty champagne bottles around."
        }, 
        {
            "index": 315, 
            "rating": "5", 
            "review": "Spectacular View. Safe area!! Best time to visit is during sunset to enjoy the panoranmic view of Lisbon city overlooking the red-tled buildings of the city."
        }, 
        {
            "index": 316, 
            "rating": "5", 
            "review": "Poetic. this is the highest viewpoint in the center of the town, and the most lovely, with the little chapel of Sra de Monte"
        }, 
        {
            "index": 317, 
            "rating": "5", 
            "review": "Got engaged here!. Definitely the best view of Lisbon. I recommend seeing it at night, when the city is lit up. My boyfriend proposed to me at this very special place. Don't miss it!"
        }, 
        {
            "index": 318, 
            "rating": "5", 
            "review": "Great view in a great neighbourhood. Miradouro da Senhora do Monte is a great, calm watching spot, in a very traditional neighbourhood. Great place for the end of an afternoon."
        }, 
        {
            "index": 319, 
            "rating": "4", 
            "review": "Nice view over old lisbon. Miradouro is a fort that has quitte impressive views over old lisbon and the waterfronts. I liked it very much. However to get these amazing views you need to pay but I think it's definitely worth the money."
        }, 
        {
            "index": 320, 
            "rating": "4", 
            "review": "A view over the old town. Lisbon has many hills and on top of each you can appreciate the quietness and the beauty of a city that hasn't changed in years, thought is very cosmopolitan and modern on the inside."
        }, 
        {
            "index": 321, 
            "rating": "5", 
            "review": "The Best view from Lisbon!. I was here at nigth and the view from Lisbon, the Brigde, River is amazing! Is difficult to explain the beauty, you must go there!! :)"
        }, 
        {
            "index": 322, 
            "rating": "4", 
            "review": "Romantic. Sunset was very romantic. We had croissants and coffee, perfect evening. I would suggest stopping by and bring lunch with you because it is one of the best views"
        }, 
        {
            "index": 323, 
            "rating": "5", 
            "review": "The Best View of Lisboa. An amazing aerial view of the City, the castle on an adjoining hill, south to the river, the 25 April bridge, the monument of Cristo Rei (the latter two beautifully lit at night) and the hills of Arrabida; west across the city towards Estrela (the floodlit Basilica can be seen at night) and northwest towards the modern residencial and commercial tower blocks.The sounds of the city drifting up create a wonderful atmosphere.A wonderful place to sit and enjoy the most beautiful city in the world."
        }, 
        {
            "index": 324, 
            "rating": "5", 
            "review": "Best view in town!. By far the best view in town. On top of a hill, so you get to see most of the city, the castle and the bridge as well. Beautiful scenery. Bit difficult to find but worth the time. Not anything else to do there but you will enjoy the walk up there."
        }, 
        {
            "index": 325, 
            "rating": "4", 
            "review": "Great sunset view. Take the tram or walk up Alfama & enjoy the view. Great at anti me but better at sunset. A couple of small food stands sell drinks & snacks in the little plaza"
        }, 
        {
            "index": 326, 
            "rating": "5", 
            "review": "Best city view. An excellent place, clean and typical with the best view of Lisbon!You can go by tuk-tuk to know this place."
        }, 
        {
            "index": 327, 
            "rating": "3", 
            "review": "nice view. you'll have a nice view over Lisbon, but that's it. My suggestion: Ideal for couples in love, take a bottle of champagne and two glasses and enjoy sunset"
        }, 
        {
            "index": 328, 
            "rating": "5", 
            "review": "Best view. Little hard to find and away from the underground but has some buses around. Totally worth the effort but this is the favorite place in Lisbon . Incredible city view and it's quiet most of the day.recommended"
        }, 
        {
            "index": 329, 
            "rating": "5", 
            "review": "Breath Taking. Beautiful spot to look out over the city. Great for a night out with friends, grab a bottle and sit to watch the view. Or a romantic stop for two love birds - bring a lock to seal your love with so many others on the fence. Definitely a must see spot!"
        }, 
        {
            "index": 330, 
            "rating": "5", 
            "review": "Amazing view. After a few days of exploration in Lisbon visit this nice spot to see everything once. Recommended both for day and night visit."
        }, 
        {
            "index": 331, 
            "rating": "5", 
            "review": "Favorite place in Lisbon. A bit hard to find and away from the underground but has some buses around. Totally worth the effort, it's probably my favorite place in Lisbon speaking as a local. Incredible city view and it's quiet most of the day, nice to chillout. Only gets a bit windy sometimes. But it's a must do for any Lisbon visitor, then move to Graça, Panteão, Alfama or Castelo, all reachable by walking distance."
        }, 
        {
            "index": 332, 
            "rating": "4", 
            "review": "Gulbekian Foundation and Museums. Easily reached across Praca De Espagna the foundation has 3 main exhibits The permanent exhibit, a separate very good Spanish exhibition from the Spanish Royal palace In a separate building there is a modern gallery as well Don't expect a huge gallery but the quality is very good and it is well worth the visit Ask the reception they will be more than glad to give you the details After a peasant walk in the garden you can find the Modern part of the gallery which is very interesting as well Price is 5 euros each very reasonable I wrote this review because the foundation and Museum are listed as 2 separate entities in fact they are one located in different proximate buildings regards Bobby"
        }, 
        {
            "index": 333, 
            "rating": "4", 
            "review": "Unparalleled Views of Lisbon. Lovely park over looking Lisbon. Views are truly spectacular. Fantastic photo opportunity. There is a tile map showing points of interest you are viewing. A similar map and view from the opposite side is available at the castle."
        }, 
        {
            "index": 334, 
            "rating": "5", 
            "review": "Lovely location and marvelous view. We enjoyed the time here with this fantastic view over the hills of Lisboa. You can sit down there at one of the benches, have a break and just enjoy. One of the things you have to do with good weather in Lisboa! A really nice and calm place beside the other visitors. Find it out!"
        }, 
        {
            "index": 335, 
            "rating": "4", 
            "review": "Awesome view!. It is a bit of a walk up the hill to reach it, but when you reach it - wow! You will see whole Lisbon, terrain configuration and all the key points. It will be easier for you to explore the city later when you take a look from here."
        }, 
        {
            "index": 336, 
            "rating": "4", 
            "review": "Lovely view. It was a little cold and windy the night we went and the sunset was only average, but the location is excellent for a lovely view over Lisbon."
        }, 
        {
            "index": 337, 
            "rating": "5", 
            "review": "Great View. I really recommend Miradouo da Senhora do Monte. It is a must see in Lisbon.You can see this amazing city from the top."
        }, 
        {
            "index": 338, 
            "rating": "4", 
            "review": "Really far but nice. Indeed the highest point to view Lisbon, but it was not my favorite. I think that other Miradouros offer a closer and greater in my opinion view of the beautiful city of Lisbon. However, if you are a fan of the view from a great distance, I suppose this is the best option in the city."
        }, 
        {
            "index": 339, 
            "rating": "5", 
            "review": "Highest Viewpoint in Lisbon. This lovely spot was just up the hill from my hotel, but I did not go visit it until my friend who has lived in Lisbon for four year insisted on going up to see it (she had never been). The view of the city and out to the river were wonderful, even when it was overcast. The city of Lisbon is breathtaking in any weather."
        }, 
        {
            "index": 340, 
            "rating": "5", 
            "review": "tuk tuk!!. the view is fantastic, you have to take the Tuk Tuk, are incredible!! you can see everyting down in Lisbon!! the views are incredible!!"
        }, 
        {
            "index": 341, 
            "rating": "5", 
            "review": "Great Views. The classic views of Lisbon. Definitely worth the effort of getting up there and make the most of it by walking up there if you can as some of the neighbour hoods are very quaint and picturesque."
        }, 
        {
            "index": 342, 
            "rating": "5", 
            "review": "great view of the city!. Takes a while go up here, but the view is breathtaking... great spot to see the sunset in the summer"
        }, 
        {
            "index": 343, 
            "rating": "5", 
            "review": "Great view. Lovely spot to enjoy Lisbon with a great view.\nNothing around except you and the city! And some tourist :P"
        }, 
        {
            "index": 344, 
            "rating": "5", 
            "review": "probably the best panoramic view over Lisbon. this miradouro / panoramic landmark gives the largest view over Lisbon. it is as well an opportunity to enjoy some quiet time watching the city as there not that many tourists."
        }, 
        {
            "index": 345, 
            "rating": "5", 
            "review": "View tower. We were in doubt if we should go up and see town from this tower.and I'm happy I convinced my travel partners to do so.everyone of us left tower happy for views we saw.well worth to spend yoyr money and see lisbon from above."
        }, 
        {
            "index": 346, 
            "rating": "5", 
            "review": "One of the top 3 mandatory Lisboa views. Point of Lisboa contemplation. One of the Lisbon \"Miradouros\" mpre appreciated by the locals.\nJust contemplate."
        }, 
        {
            "index": 347, 
            "rating": "5", 
            "review": "fabulous . What else to add?\nabsolutely fabulous view over Lisbon.\nI came back again at night and it was even better!"
        }, 
        {
            "index": 348, 
            "rating": "5", 
            "review": "Best view in the city. This was a little difficult to find. I walked up through Baixa and Alfamo and walked past the street leading up twice before I actually found it, but it was worth it for the view"
        }, 
        {
            "index": 349, 
            "rating": "5", 
            "review": "Breathtaking!. Breathtaking views!\nGo there and get detached from 'life'!! witness the breathtaking sunset,,so majestic!"
        }, 
        {
            "index": 350, 
            "rating": "5", 
            "review": "Beautiful view of Lisbon. And a great cafe to sit and enjoy the sites. Definitely worth the stop. Can see all of the old city and the Rio Tejo in the distance"
        }, 
        {
            "index": 351, 
            "rating": "4", 
            "review": "Great city view. Easily accessible by foot from the city center. Great place for a picnic. Free! The small negative point about Lisbon in general is the lack of informative panels for the attractions. Easy to get lost in the small twisted roads."
        }, 
        {
            "index": 352, 
            "rating": "4", 
            "review": "Great place to take some photos and admire the view. Nothing much to say about this. A great place to view the city from, find your bearings, take some nice photos or just sit and enjoy the view."
        }, 
        {
            "index": 353, 
            "rating": "5", 
            "review": "One of the best spots to capture beautiful pictures of Lisbon. It seems that this miradouro is a bit out of the way, high up above Alfama, its quieter, and seems to have less tourists than other sites. The views are breathtaking! In the evening, you could pack a bit of a picnic with a bottle of wine and enjoy the sights and sounds of the town below while enjoying the evening. Once in a while, a tuktuk car will bring along a bunch of tourists, but they are there for about 20 mins before they move on to explore other parts of the beautiful Lisbon. Overall, this is a very nice spot for picture taking, both day and evening. We took pictures with our iPhones, but if you are fortunate enough to have one of those serious big cameras, they will find their calling here :) ."
        }, 
        {
            "index": 354, 
            "rating": "5", 
            "review": "Good morning Lisbon. Sunrise and sunset are beautiful here. You have a wonderful view on the National Pantheon and the river.By 8 o´clock cruisers arrive nearly every day.San Antonio protects you (his statue).In the evenings it´s very lively with locals, tourists, musicians, dancers."
        }, 
        {
            "index": 355, 
            "rating": "5", 
            "review": "Nice overall view. Nice short walk up the hill from the trolley stop. Gives a nice view of a large amount of Lisbon, complete with boards which showed the skyline and labeled the buildings."
        }, 
        {
            "index": 356, 
            "rating": "5", 
            "review": "Fantastic view of a great city. Graca is the highest place in Lisbon. The viewpoint can be accessed by the 28 tram and getting off one stop after Largo Graca. Walk up the side street to the west and go around a gentle curve. Ahead will be Miradouro da Senhora do Monte with great views across Lisbon to St. Georges Castle, 25 de Abril Bridge, Cristo Rei monument, the twin towers and dome of Estrela Basilica and a constant parade of planes approaching Lisbon's international airport. No cafe or washrooms here. Best of all its free!"
        }, 
        {
            "index": 357, 
            "rating": "5", 
            "review": "Great view.. Must see in Lisbon. You can see the river and Lisbon from upthere. Great scenario. Really close to Castelo São Jorge. I recommend it."
        }, 
        {
            "index": 358, 
            "rating": "5", 
            "review": "Beautiful View Point over Lisbon. There is a good dozen of miradouros overlooking the great city of Lisbon from different angles however the one at Nossa Senhora do Monte is very special. It is the highest one, rather small and far less crowded than the other ones because the access for large busses is not possible. It is close from the one at Nossa Senhora da Graça and much higher than the Castel Sao Jorge. Parking can be an issue however usually cars don't stay too long. You can find all the info about Miradouros at http://pt.lisboando.com/miradouros/"
        }, 
        {
            "index": 359, 
            "rating": "5", 
            "review": "The best view. It doesn't have a bar/cafe, so it's not overcrowded like the one next to it in Graça.The view is incredible, the best of the city.Don't miss it!"
        }, 
        {
            "index": 360, 
            "rating": "5", 
            "review": "beautiful free view of Lisbon. if you make it to the top of Lisbon's steep stairs and roads, you deserve the reward of the view.you see the center of Lisbon at 240° from an elevated place.it's nice in the morning, after lunch, at sunset... ok it's great all the time with my preference for sunset when you can play with your camera and make memorable panoramic pictures.compared to other places as the Castle or towers, this one is free ! and there is less people than at the Castle.think about getting a bottle of water for the climb as you walk through the residential part of Lisbon and will not see many bars/restaurants close to the top.sometimes there is a guy with a mobile ice/drinks selling machine but not every day."
        }, 
        {
            "index": 361, 
            "rating": "5", 
            "review": "wondefull views. It's a nice place to take a break and take a look at the landscape.\nFor sure a place to visit in lisbon."
        }, 
        {
            "index": 362, 
            "rating": "5", 
            "review": "Best view in Lisbon. It was amazing to be there and look at the view... It's hard to explain just how gorgeous it was. Must see!"
        }, 
        {
            "index": 363, 
            "rating": "5", 
            "review": "very beautiful place to visit. when i was at lisbon , we visit this Miradouro , by the originals TUK TUK , it´s an amazing place , with a small chapel .,Awesome place to go"
        }, 
        {
            "index": 364, 
            "rating": "4", 
            "review": "Melhor vista de Lisboa. The best views in Lisbon. The nearby streets need to be requalified. Lots fo abandoned buildings when you walkj down to thge city center in Arroios."
        }, 
        {
            "index": 365, 
            "rating": "5", 
            "review": "great views if not the best of the city. Bring some snacks and drinks with you along around sunset and see what happens when the sun goes down......"
        }, 
        {
            "index": 366, 
            "rating": "5", 
            "review": "Great view. on the hilltop. Easy toreach, though, with TRAM 28 (Graca). Then a short street climb and you are there. It's a windy place and has trees, so it's quite nice to just stay there on a hot day, admiring the city.\n(and has a very clean bathroom, although dated)"
        }, 
        {
            "index": 367, 
            "rating": "5", 
            "review": "The best view I have found so far. A moderately quiet place with a beautiful view over Lisbon centre (at least you'll find there less people than at \"wild beaches\" around Lisbon). It's not that busy as the ones in other, more touristic areas. Sometimes wind gets really strong out there, so be prepared for that. Perfect spot for late night chat supported by a bottle of wine."
        }, 
        {
            "index": 368, 
            "rating": "4", 
            "review": "Nice!. I got this compulsive need to see a citys view first time visiting. It took me 20 minutes to walk from my hotel, and I got to see the entire city of Lisbon. Probably pretty sweet to watch the sunset - as I was there at daytime. It´s worth the trip, and it´s free of charge."
        }, 
        {
            "index": 369, 
            "rating": "5", 
            "review": "Great for watching the sunset over the city. We were recommended to go here by a friend from Lisbon. It's a less touristy viewing point... a little harder to find but near to the 28E tram line. Beautiful view!"
        }, 
        {
            "index": 370, 
            "rating": "4", 
            "review": "Incredible View of the City. If you want to see the entire city, then I HIGHLY recommend you come here. The view is simply amazing! Just take tram 28 to Rua Graca, then heading in the same direction as the tram, turn left up 'Rua da Senhora do Monte' and follow the road straight up. It's just breathtaking!"
        }, 
        {
            "index": 371, 
            "rating": "5", 
            "review": "Incredible view. It is worth the walk. Just bring some water and be ready to find the most incredible view of that beautiful city."
        }, 
        {
            "index": 372, 
            "rating": "5", 
            "review": "beautiful view. It was not all that easy to get to this viewpoint, but it was definitely worth the effort. As it is more off the standard tourist track, there are not so many people as in different places and you can enjoy the view. Take the tram 28 to Largo da Graca, then it is about 5-10 minutes walk up the street."
        }, 
        {
            "index": 373, 
            "rating": "5", 
            "review": "BREATHTAKING VIEWS!. This place was super hard to find as all we had was a map and there are NO signs for this very hidden gem. We asked for directions along the way & finally found our way up the dreaded steps .. quite a workout indeed! When we got to the top the view was amazing! We made it just before sunset and watched the sun go down and the city light up ; quite the transformation! This is truly a must-do in Lisbon ... although hard to find it is very well worth the chase ;)"
        }, 
        {
            "index": 374, 
            "rating": "5", 
            "review": "steps steps and more steps. Get your walking shoes on as its a fair old climb to the viewing point. It is worth it as reviews are breathtakingky beautiful, I was stunned at the gorgeousness of it. Bag yourself a bench under the shade of a tree and drink in the view. There's a cafe there for a beer and a snack."
        }, 
        {
            "index": 375, 
            "rating": "4", 
            "review": "Wauv!. It takes a bit of walking to get there but it worth it! The view is unbelievably beautiful. The city, the river, a splendid view. It's a 'must do' in Lisbon."
        }, 
        {
            "index": 376, 
            "rating": "5", 
            "review": "5 star view. you will be left speechless after seeing this 180 degree view of all of Lisbon. recommend going right before sunset, and watching the lights come on all over the city. bring your camera!!"
        }, 
        {
            "index": 377, 
            "rating": "5", 
            "review": "One of my favorite sightseeing in Lisbon. From here, one can see the beauty of Lisbon. At Sunset there´s a kind of magi happening. It´s a really cool place to go with someone or alone, with a book and a camera."
        }, 
        {
            "index": 378, 
            "rating": "5", 
            "review": "Beautiful and non comercial scenic spot. So picturesque, and such a beautiful chapel.Not 100's of people mulling around ~ just peaceful and lovely"
        }, 
        {
            "index": 379, 
            "rating": "5", 
            "review": "Lisbon at your feet. This is one of the highest viewpoints in Lisbon, and one who is mostly ignored. You will feast your eyes on a gorgeous landscape, while sitting down and enjoying a drink or something to eat. It is easy to get there on foot, and absolutely worth it."
        }, 
        {
            "index": 380, 
            "rating": "5", 
            "review": "The view. Going there by foot, totally worth it, I've seen all the narrow streets. Very nice view of the city."
        }, 
        {
            "index": 381, 
            "rating": "5", 
            "review": "Gorgeous Panoramic. There are plenty of belvideres located throughout the city, but this is my second favorite after Miradouro das Portas dol Sol. Situated high above the city, it affords you a great view of the charming, red-roofed neighborhood of Alfama below. You can take the Tram or walk by foot (which I prefer because it allows you to wander aimlessly and explore the town leisurely) to arrive here where blue azules tiles adorn the balcony. You'll also find local artists showcasing their work for sale and a cute garden alongside this overlook. Take a moment to soak in the view and enjoy the city from above!"
        }, 
        {
            "index": 382, 
            "rating": "5", 
            "review": "By tram no 12. If you want to try Lisbon old tram and don't want to be like a sardine in a tram no 28. Buy ticket in Casa da Sorte at Praca Figueira and take tram no 12, get off at this Miradour, which is also a great point to explore Alfama."
        }, 
        {
            "index": 383, 
            "rating": "5", 
            "review": "Best view of the city. As well as this spot we visited the castle and a couple of other viewpoints and this is definitely the best. You'll get a view across the whole city looking out to the ocean behind the castle. It's a little difficult to get to but we followed the map and found it fine."
        }, 
        {
            "index": 384, 
            "rating": "5", 
            "review": "The most beautiful view over Lisbon!. This is my personal favorite view over Lisbon. It has easy access and on top you can have sights over Ponte 25 de Abril, Martim Moniz, Castelo de São Jorge, Rio Tejo and southern coast of Tejo with Cristo Rei looking at you. My advice: go there close to sunset and stay till night comes, the change in the city colors is just amazing!"
        }, 
        {
            "index": 385, 
            "rating": "4", 
            "review": "Any time of day or night. There are a number of places in Lisbon where you can have a beautiful view over the city. This one is certainly one of the best and the most easily accessible. Day or night, the view is lovely."
        }, 
        {
            "index": 386, 
            "rating": "5", 
            "review": "Beautiful City Views. There are a few miraduoros in Lisbon, but this one is the most beautiful at sunset and has one of the best unobstructed city views in all of Lisbon."
        }, 
        {
            "index": 387, 
            "rating": "5", 
            "review": "Best view of Lisbon full stop. If your thinking of visiting the miradouro Graça for its view of Lisbon's Baixa keep heading upwards to this view point, Senhora do Monte by far the best view point for Lisbon i have ever seen. If you're having trouble finding it just ask the locals they are more then happy to give directions. It is a must for anybody visiting Lisbon."
        }, 
        {
            "index": 388, 
            "rating": "4", 
            "review": "What a view. This hidden place near Graça is a must see place!It have a very little chapel, but the view... WHAT A VIEW!"
        }, 
        {
            "index": 389, 
            "rating": "3", 
            "review": "Just a view of the 25th April bridge. Nothing special.. Just a small area where you can see the view of the 25 April bridge. You can view the bridge from other areas.If you are already in the area, then take a look. But I would not recommend making a trip just to come here for the views. Nothing special about the area."
        }, 
        {
            "index": 390, 
            "rating": "5", 
            "review": "NICE VIEW OVER LISBON. Nice View ! maybe better than Graça !...it´s next to Graça view ! there is a Church and a Santa (Montain Saint).No Bar, no restaurant ! Only the View point ! I recomend you to go !"
        }, 
        {
            "index": 391, 
            "rating": "5", 
            "review": "The views are Amazing. I had beautiful blue clear skies on Monday, May 12. Was bought here by our bike sidecar tour guide an excellent stop for anyone."
        }, 
        {
            "index": 392, 
            "rating": "4", 
            "review": "Great view. This is relatively easy to find (just up Rua de Misericordia off Largo do Chiado) and has great views of the key areas of the city. There are also street performers up there. Great if you like landscape photography as a hobby. A peaceful place."
        }, 
        {
            "index": 393, 
            "rating": "5", 
            "review": "Great view!. Really worth the climb. Great view of lisbon centre, especially when the sky is clearblue. Chilled there for about 20minutes."
        }, 
        {
            "index": 394, 
            "rating": "5", 
            "review": "Beautiful Landscape. It requires a big walk specially because you have to climb, but the view that you have there is amazing!"
        }, 
        {
            "index": 395, 
            "rating": "4", 
            "review": "Splendid views. The Miradours of Lisbon are great places for keen photographers. The view of the hilltops and the casle are magnificent."
        }, 
        {
            "index": 396, 
            "rating": "5", 
            "review": "Great view of the city. Been there first time every one month ago and feel like I have never seen the city from that point. Little cafe with food and beverages available."
        }, 
        {
            "index": 397, 
            "rating": "5", 
            "review": "Also another amazing view. If you go to Miradouro da Graça, please take your time to view this MIradouro as well. Is also situated in Graça,but higher, so better view. It has a small romantic chappel there and also a romantic hostel with an amazing view in that Miradouro. You can go there with friends or family, but my suggestion would be for you to go there with the Love of your life."
        }, 
        {
            "index": 398, 
            "rating": "5", 
            "review": "lovely viewpoint in Lisboa. this is one of my favourite viewpoints in my home town.it is \"just\" a viewpoint, with a little church, and with an image of one of our saints (nossa senhora do monte).you won't find any coffeeshops or restaurants there, just some wooden benches, and maybe some eldearly or couples or (if you go around dinner time or later) some groups of friends having their beers there (specially on weekends).maybe you can find the church opened and you can take a look inside!but if you love to walk and don't care about the cold wind, you will find it pretty cool! i reccommend going there early morning till sunset. and don´t forget to bring a jacket! :)"
        }, 
        {
            "index": 399, 
            "rating": "5", 
            "review": "Great view. Quite a trek up the hill, but a fantastic view from the top of here over the whole of Lisbon and all around the coast."
        }, 
        {
            "index": 400, 
            "rating": "5", 
            "review": "Must see for the view of Lisbon - beware of pickpockets!. This is a must see when visiting Lisbon. We went at sunset and had a gorgeous view of all of Lisbon. Only downside is that a pickpocket stole my iPad from my handbag outside of the entrance of the monument when I wasn't holding onto it for all of 45 seconds! These guys are criminal masterminds. Turn your head for thirty seconds and they'll reach into your bag without you feeling anything. I went to the tourist police (who were really nice and helpful actually) but I'll never get my iPad back! Beware!"
        }, 
        {
            "index": 401, 
            "rating": "5", 
            "review": "Great view, with a drink by your side. Get there late in the evening, for a great view of Lisbon by night, and a drink away from the crowds of the town center - as a group of friend (2 couples) we had a flat rented nearby, and we walked there late in the evening just after arriving - the place was busy but quiet, perfect to relax and get in the right mood."
        }, 
        {
            "index": 402, 
            "rating": "5", 
            "review": "Amazing view. Amazing view of Lisbon where you can see the entire city with the Castle, you can spend a few hours there just to enjoy the city and the view"
        }, 
        {
            "index": 403, 
            "rating": "5", 
            "review": "Go go go. Amazing view of many in Lisbon. When you think you are loat, just keep goimg. Bring a book or some wine and enjoy the people and view."
        }, 
        {
            "index": 404, 
            "rating": "5", 
            "review": "Best view ever!. Without a doubt, this is the best view in Lisbon. The panoramic view encompasses the castle and the bridge in Lisbon. It's pretty steep and I was fortunate I had a car up this attraction."
        }, 
        {
            "index": 405, 
            "rating": "5", 
            "review": "Outstanding view. Ok so to be clear there is a lot of walking needed mostly uphill to get here, but when you reach it the view is certainly worth it. You can look out across all of Lisbon's major areas and really spend some time up there and enjoy the view. Highly recommended, there are also a few cannons to be found overlooking the city, great photo opportunities."
        }, 
        {
            "index": 406, 
            "rating": "5", 
            "review": "Excellent view. I love the view.Been there a few times, and from time to time I feel the need to repeat and walk all the way up."
        }, 
        {
            "index": 407, 
            "rating": "4", 
            "review": "Stunning view. Great view of lisbon, there are 2 lookout points. Best to go when the sky is dark and the sky is clear."
        }, 
        {
            "index": 408, 
            "rating": "5", 
            "review": "the best view of lisbon. the best view of lisbon during day and night time ... But specialy during night time ... We went there in a tour with a guy called Alexander from Discover With Us tour ... Great time!! Thanks Alexander ... Hope to return soon!"
        }, 
        {
            "index": 409, 
            "rating": "4", 
            "review": "Stunning. On our walk around on our first evening in the city we ventured up the hill towards the Miradouro da Senhora do Monte. It is a beautiful place with an amazing view of the city. Sunsets from there can be spectacular."
        }, 
        {
            "index": 410, 
            "rating": "5", 
            "review": "Fabulous view of the city and sunset. Our Tuc Tuc driver drove us up here after our tour of the Se Cathedral. It is a beautiful place with an amazing view of the city. We were also lucky enough to experience a beautiful sunset which was spectacular."
        }, 
        {
            "index": 411, 
            "rating": "4", 
            "review": "Beutiful views. Beautiful views from this viewpoint, you can have a nice sight of Lisbon, ranging from the Castle, the Tejo River, Baixa and Chiado."
        }, 
        {
            "index": 412, 
            "rating": "5", 
            "review": "Lovely view of the city. one of the best views over Lisbon. Amazing view on the city centre and the river. Worse visiting and relaxing there for a little while"
        }, 
        {
            "index": 413, 
            "rating": "5", 
            "review": "best vew with castle included. I love how the vew is so perfect and so amazing i belive that it was the best Lisbon experience. I want to come back really fast."
        }, 
        {
            "index": 414, 
            "rating": "5", 
            "review": "The most beatiful viewpoint of Lisbon. This Miradouro has one of the best views over Lisbon. A place to visit and sit for a few hours. Saddly doesn't have a coffee shop, would be perfect to have an cup of tea with that view."
        }, 
        {
            "index": 415, 
            "rating": "5", 
            "review": "The Most Beautiful and Romantic. One of the most romantic and enchanted places of Lisbon. Amazing view on the city centre and the river."
        }, 
        {
            "index": 416, 
            "rating": "5", 
            "review": "Difficult to discuss which is the best.... ....due to the hilly position of Lisbon, it has a lot of wonderful \"Miradouros\". This one is at the top of the oldest city part named Alfama, close but higher than the Sao Jorge castle. From here you can have great views over the castle, the downtown city center, the 25th April bridge (remember, this is NOT the Vasco de Gama bridge, like some other travelers said) and the opposite hill of Bairro Alto and Chiaddo.A little church at this view point makes this place special and romantic, with a small square, an open air cafe and some benches.Have in mind, the access to this Miradouro is difficult, it is on a steep hill, and you have to walk uphill a lot, but it is rewarding when you reach it."
        }, 
        {
            "index": 417, 
            "rating": "5", 
            "review": "Best view in Lisbon. One of the best views in Lisbon, this gem is well worth a walk up the hill from Graça for. There's no café there - so grab a bottle of vinho verde and make a little picnic and watch the sunset"
        }, 
        {
            "index": 418, 
            "rating": "5", 
            "review": "Amazing view over Lisbon. The place is quite big and has many nice spots where you can see the nice city of Lisbon. There is an entry fee, but it's worth every cent!"
        }, 
        {
            "index": 419, 
            "rating": "5", 
            "review": "The best Miradouro in Lisbon. This as to be my favorite Miradouro in Lisbon! It is usually not very crowded and the view is just something else. The chapel adds a bit of charm to the place. It really feel like those hidden gems!"
        }, 
        {
            "index": 420, 
            "rating": "5", 
            "review": "unique. amazing view for the city, the river, the bridgewonderful atmosphere of travellersromantic and magical placevery special"
        }, 
        {
            "index": 421, 
            "rating": "4", 
            "review": "Best view of Lisbon. This is the best view of Lisbon for sure - you can see a castle, miradouro da graça, the Vasco da Gama bridge and the statue of Jesus, many squares and Santa Justa lift."
        }, 
        {
            "index": 422, 
            "rating": "4", 
            "review": "Lovely. Beautiful view. I just returned from a 2 month trip to Lisbon and this was one of the better miradouros there. Lisbon is beautiful from every angle!"
        }, 
        {
            "index": 423, 
            "rating": "5", 
            "review": "DO NOT MISS. Seriously. I've been traveling all over Europe, and through Lisbon, and I haven't found a more impressive view of the city. You're up high enough to capture everything, but close enough to see the intimate details of the streets and buildings. To top it off, your view of Lisbon has this stunning river and a Golden Gate style bridge as a backdrop. Take Tram 28 up there, or walk, but make sure you check it out."
        }, 
        {
            "index": 424, 
            "rating": "5", 
            "review": "280º View. Is the best place to see Lisbon. From there you can see the river, the castle, many, many churches, dowtown, \"bairro alto\" Maques de Pombal."
        }, 
        {
            "index": 425, 
            "rating": "5", 
            "review": "Best view in town!. Very nice view over Lisbon. You can reach is with the vintage tram line 28. Get out at Largo da Graca.I like walking, so I walked up there, which is a beautiful scenery walk and lots of nice cafes along the road to get refreshments."
        }, 
        {
            "index": 426, 
            "rating": "5", 
            "review": "Amazing sight!!!!. Just stopped at the Miradouro this past weekend while visiting Lisbon....The views are fantastic and a perfect place to sit and realx while the sun sets....."
        }, 
        {
            "index": 427, 
            "rating": "5", 
            "review": "Best viewpoint in Lisbon. I've lived in Lisbon for 8 years and this is my favourite place in the hole city! It's usually not so crowded as other viewpoints and has breathtaking views! Every traveller should take the time to come here, prederably at sunset."
        }, 
        {
            "index": 428, 
            "rating": "5", 
            "review": "Breathless. The best view over Lisbon, period. Do not visit the city without going there, astonishing view, so beautiful. Love it!"
        }, 
        {
            "index": 429, 
            "rating": "4", 
            "review": "Nice to see, if more than one day in lisbon. Yes, as others told, when you get there by tram 28E, you have a magnificent view of the small gulf and old town of Lisbon. You need to put 2-3 hours for this activity (specially in hot seasons), because the trams are very crowded and with irregular schedule. We could take few great panoramic photos around sunset."
        }, 
        {
            "index": 430, 
            "rating": "5", 
            "review": "A Great View as the Sun is Setting!. We went here as the sun was setting and the view was amazing! This was part of a walking tour. The view is a must on the 'to do' list!Tip: On the way down from the lookout there are several little restaurants where locals eat, where you can have a yummy dinner at a great price. When you sit down they serve bread, cheese, sometimes olives etc. These are not free & if you eat them you will have to pay for them. Sometimes when added together these items cost more than the meal. You can say you don't want them & the items will be happily taken away or you can choose what you do & don't want from what they have brought. This is acceptable practice."
        }, 
        {
            "index": 431, 
            "rating": "5", 
            "review": "A must whilst in Lisbon. Magnificent views of the city and the Tejo River. Great little side walk cafes to just sit and enjoy the atmosphere of the medieval Alfama."
        }, 
        {
            "index": 432, 
            "rating": "5", 
            "review": "My favourite viewpoint in Lisbon !. If you go to Largo Graça this \"Miradouro\" is just a little bit up the hill. It is a small and quiet place , with a small chapel and Holly Mary image is there to accompany you. I think is a very peaceful place , the view is just stunning and you can stay there and relax for a while just absorbing the great energy flow. Its funny because not many people living in Lisbon knows it, its a well kept secret and I advice everyone to visit it if you can!"
        }, 
        {
            "index": 433, 
            "rating": "4", 
            "review": "The place!. The better sightseeing place in Lisbon is in the other side of Bairro Alto. As a great view of all Lisbon, the bridge and the monuments. Could be better clean... but the view is marvelous!"
        }, 
        {
            "index": 434, 
            "rating": "4", 
            "review": "Lisbon at it's splendour. BEAUTIFUL! Marvelous views of Lisbon, Castle, river. This is an outstanding way to discover the town and see Lisbon magnificent and traditional red roofs."
        }, 
        {
            "index": 435, 
            "rating": "5", 
            "review": "Gorgeous views. BEAUTIFUL! Gorgeous views of Lisbon, The S. Jorge Castle, the Tagus river. Make sure you take a camera with you. Been there during the day and at night. Night views are way more stunning"
        }, 
        {
            "index": 436, 
            "rating": "5", 
            "review": "Excellent view and a place to take a drink. Amazing view and there's also two places where you can take something to eat and drink and still see the water. We took the tram one time only to take something to drink and look at the view. It's a bit more peaceful than down in the city centre."
        }, 
        {
            "index": 437, 
            "rating": "5", 
            "review": "Nice view of the Western city. From this elevated view point you get a good view of western lisbon.Quite a steep climb up but worth the view.There is some shade we made it late afternoon so was still hot.The walk back can take down some steep steps and in to the more rundown area of lisbon and off the beaten track."
        }, 
        {
            "index": 438, 
            "rating": "5", 
            "review": "Must see any time of the day!. My friend and I took the 28 Tram and got off at R. Graça then walked up Rua de Senhora de Monte. We actually more or less happened upon this great spot though we had heard about it previously. Does not take much time but absolutely worth the trip up there because the view is breathtaking and unbeatable. No bathrooms around that we could find and not a whole lot of food. We were there during the day but another friend went at night and said it was unbelievable then too - so go at any time!"
        }, 
        {
            "index": 439, 
            "rating": "5", 
            "review": "Where narrow streets become huge vistas!. Not to be missed - it's free apart from the effort of getting there, which is well worth it.We'd seen this vantage point marked in a guide book, but it's not on every map so this could be easily missed.We found using more than one map really handy. As well as showing different features, they name different streets, so having more than one map is a great help to find your way around."
        }, 
        {
            "index": 440, 
            "rating": "5", 
            "review": "Where you take in the beauty of Lisbon. Our tour guide drove us here at the end of our day trip around Lisbon. We had been around the city for the whole day and it was breathtaking to see it all from above, framed with olive trees (growing around the benches, bearing fruit) ; The castle, the city, the ocean. No wonder we saw many locals enjoying a sunny afternoon on the benches!"
        }, 
        {
            "index": 441, 
            "rating": "5", 
            "review": "beautiful view. You must see the city from here, its simply the best. Its also next to the cathedral and castle. It is a bit of a hike up to the point and we visits via Segway. Keep them s in mind when making the trek up to the vista."
        }, 
        {
            "index": 442, 
            "rating": "5", 
            "review": "Superb view of Lisbon. Took a taxi up from the square, €4 app and walked back down via narrow streets. Most beautiful church at the top, with the most exquisite crib I have ever seen. Views are superb all over Lisbon from viewing area."
        }, 
        {
            "index": 443, 
            "rating": "5", 
            "review": "the view. Fantastic view over the hills of Lisbon. It is worth walking in the lovely streets of the city to explore the sights and than go up here and connect all of them while sitting in one of the pubs and relax after a long day of walking."
        }, 
        {
            "index": 444, 
            "rating": "5", 
            "review": "Fantastic view over Lisbon. It is worth the walk up the steep hill to get to this place. My suggestion is to get on the tram although you will still have to walk the last km."
        }, 
        {
            "index": 445, 
            "rating": "4", 
            "review": "Where to look from freedom. Lisbon has a lot of \"miradouros\" and places from which you can have a look of the city from above. It is a really nice view and you can take some time to unwind and admire it."
        }, 
        {
            "index": 446, 
            "rating": "5", 
            "review": "breathtaking spot. Here you can enjoy the best views of Lisbon, Tago and Castle. All the city at your feet! Please take a couple of minutes to admire and appreciate wonderful colors of this stunning city, and your soul will thank you!"
        }, 
        {
            "index": 447, 
            "rating": "5", 
            "review": "Stunning view of the city, sunset and the castle. This is undoubtedly the best miradouro in whole Lisbon, and believe me I went to all of them. It gets a little windy here so take a light jacket or something to keep you warm. The view of the city you get from here will just blow your mind away. You see the bridge, Cristo Rei statue and the castle. And the best part is, it is not so crowded! DON'T MISS THIS!"
        }, 
        {
            "index": 448, 
            "rating": "5", 
            "review": "Excellent Vistas, cafe's at overlook, take the bus or trolley. The view was spectacular, but the drive up (in VW Polo stick, diesel) is not for the faint of heart. narrow streets, deceptive GPS, one ways sending you back over your tracks, I would take the 29 trolley, I think, ask first, which takes you on a trip through the whole area (very crowded though)."
        }, 
        {
            "index": 449, 
            "rating": "5", 
            "review": "Beautiful spot. One of the best views in Lisbon, which says a lot in such a beautiful city! The hike up is worth it."
        }, 
        {
            "index": 450, 
            "rating": "5", 
            "review": "Stunning rest spot. What a great place to visit if you have limited time for taking in an experience of Lisbon! The views are spectacular, and it is a perfect place to take in a casual lunch at the concession there which serves delicious grilled cheese sandwiches and ice-cold beer. The approach to this attraction, following the tram tracks a short distance into the colorful Alfama District from Lisbon's commercial center below is easier than you might suppose, and well worth the small effort."
        }, 
        {
            "index": 451, 
            "rating": "5", 
            "review": "Sunset place. Really worth climbing! Take some snack with you and picknick, there is no cafe or shop around! BUT do not expect to be alone:-)"
        }, 
        {
            "index": 452, 
            "rating": "5", 
            "review": "Can't miss it. Enjoy the view. Lisbon is a beautiful city!\nAlso, if you can, try to visit the church near by,it's also amazing."
        }, 
        {
            "index": 453, 
            "rating": "4", 
            "review": "Find yourself there!. A perfect getaway in the city!Just you and the view... and it doesn't make a difference if it is summer or winter!It's quiet, local, almost hidden - not completely because it's seen from several points, and one always wonders \"there must be an amazing view from up there!\" - and it is!And also one of the best points in Lisbon for photoshooting!"
        }, 
        {
            "index": 454, 
            "rating": "5", 
            "review": "One of the best Lisbon views. This place has one of the best views over the city, being a \"must see\" for anyone.It is not a touristic place, but is turning more and more popular."
        }, 
        {
            "index": 455, 
            "rating": "5", 
            "review": "One of the best views of Lisbon. A definite must stop after a long day of walking up and down the hills of Lisbon. Great views to take in the city and relax. Bring your camera!"
        }, 
        {
            "index": 456, 
            "rating": "5", 
            "review": "A view a beer and a \"bica\" (Portugese espresso). Well worth the trip to the top, either walking the narrow, windy old cobblestoned streets or riding the colorful tram wending its way up."
        }, 
        {
            "index": 457, 
            "rating": "5", 
            "review": "Amazing. Best place to relax and enjoy the beautiful city of Lisbon. The view is amazing, and the cafe on top helps you relax from a long day walking in Lisbon."
        }, 
        {
            "index": 458, 
            "rating": "4", 
            "review": "Nice view if not raining. Love view of the city but I would not necessarily go out of my way to visit. The location is however a great place to start a tour of old Lisbon, with great cares, old churches and monasteries, and a taste of non touristy Lisbon life."
        }, 
        {
            "index": 459, 
            "rating": "4", 
            "review": "Lovely panoramic view with cafe. There was a decently priced cafe (4.5 euros - 7.9 for lunch), the views were lovely, you could see the castle amd most of Lisbon but it can be a bit windy and cold. It's a place to visit if you have some time."
        }, 
        {
            "index": 460, 
            "rating": "5", 
            "review": "One of the best viewpoints in Lisbon. Although much less explored, this is probably one of the best viewpoints in Lisbon.Enjoy the sunset if you are nearby, you will love it ;)"
        }, 
        {
            "index": 461, 
            "rating": "5", 
            "review": "One of the best city Views I have ever seen.. As people have said, do it before sunset to get the most out of it, awesome. Easy to get to too, so everyone is a winner."
        }, 
        {
            "index": 462, 
            "rating": "5", 
            "review": "Best panoramic view. This sightseeing spot offers the widest view over Lisbon. It is quiet and pleasant... The effort of getting there is worth it!"
        }, 
        {
            "index": 463, 
            "rating": "5", 
            "review": "stunning. Absolutely stunning view... We stayed there for three hours, and watched beautiful sunset… We were lucky to meet there one old fado singer who contributed to have morw than amazing time…"
        }, 
        {
            "index": 464, 
            "rating": "4", 
            "review": "nice view. Nice view over the city, and you'll see a nice cathedral too. Can be reached by tram or taxi (which are cheap)."
        }, 
        {
            "index": 465, 
            "rating": "5", 
            "review": "The highest viewpoint!. Of all the major Miradouro tourist viewpoints in Lisboa, this one is the highest and provides the most sweeping, panoramic views of Lisboa and the river beyond. But if you have the time, all the viewpoints are worth visiting because they each provide a different scope and perspective of Lisboa."
        }, 
        {
            "index": 466, 
            "rating": "5", 
            "review": "Good for the sunset. Very windy, being so high, but worth the effort to get here. No cafe just a small chapel. We visited on a morning, but was well worth returning for the sunset as well as the fabulous views."
        }, 
        {
            "index": 467, 
            "rating": "5", 
            "review": "The highest belvedere in town. The highest belvedere in town, so get ready for a fantastic view, went there with a friend to see the sunset, great moment!"
        }, 
        {
            "index": 468, 
            "rating": "5", 
            "review": "Best View of Lisbon. I must say, after seeing almost all the miradouros in Lisbon, this is the one that has the best view. It is located at the highest point of the city. You practically look over the whole of downtown Lisbon, the Tagus and the iconic Ponte 25 de Abril from here. It also has the most relaxing ambiance as it is less crowded compared to Miradouro da Santa Luzia and Portas do Sol that you will pass along the way. You can reach the miradouro by taking the famous Tram 28, it's worth the long and uncomfortable tram ride!"
        }, 
        {
            "index": 469, 
            "rating": "5", 
            "review": "Breathtaking view of Lisbon. Astonishing view of Lisbon and the river Tagus! It's a small miradouro making it really sweet and \"human-sized\". It has a little church/chapel and a saint outside with the rosary around it. It has some trees creating shade for the benches so you can enjoy the view. This is where the famous tiles saying \"Boa Viagem. Lisboa Espera Por Ti\" which means \"Have a good trip. Lisbon waits for you\"."
        }, 
        {
            "index": 470, 
            "rating": "5", 
            "review": "Fantastic Views. This is off the beaten track a bit but is well worth looking for. You can get a number 28 tram to a stop about 400m away and then navigate some side roads to find it.The views are stunning. You can see right across Lisbon, over the river to Christo Re and the Pont 25 Abril as well as lots of other places in the city. The small shrine is also very pretty.If you want to walk back down to central Lisbon, there are some steps to the side, but beware they are very steep at the top and very narrow so not good to go down if you have a pushchair or similar."
        }, 
        {
            "index": 471, 
            "rating": "4", 
            "review": "Incredible View. Breath taking view... I went on New Years Day, so there was a lot of trash on the ground from what was apparently a raucous party the night before... but I still found the spot peaceful and enjoyed the view for several minutes."
        }, 
        {
            "index": 472, 
            "rating": "4", 
            "review": "A great panorama of the city. If you wanna have a charming impression of the city, this is the place. You see S. George's Castle, the Sé (Cathedral), the elevator, the Comercio square and the Tejo river. Let yourself get lost on the streets and get to the castle right away."
        }, 
        {
            "index": 473, 
            "rating": "4", 
            "review": "One good sightseeing point. This is one of several sightseeing points in Lisbon where you can observe all of the downtown area and some of the rest of the town.The area itself is very small with some chairs and trees. There is a very small church too.There is no space for a coffee shop or any other kind of shop, which makes this spot cosy. It's an important spot to me since it was here that me and my wife started to date.It's a very nice place at night with all the city lights but it gets windy so take a coat.There is no parking lot, it's very difficult to park since it's a residential area."
        }, 
        {
            "index": 474, 
            "rating": "5", 
            "review": "Extraordinary view of Lisbon. Probably one of the best views of Lisbon. Nearby we see the battlements of Castelo de São Jorge. Down we can see the roofs of the houses that extend down to the Praça do Martin Moniz. On the other side of the hill we could see the Miradouro de São Pedro de Alcantara and the Convento do Carmo. We may also sit on the small terrace and drink a coffee or a beer in the evening enjoying the sunset. We also visit the beautiful church which is located on site. Not to be missed."
        }, 
        {
            "index": 475, 
            "rating": "5", 
            "review": "Best view of Lisbon. Probably the best view of Lisbon. Nice to hang out for a while or to go for a coffee. Its one of those places that you cant stop staring at the view. packed on weekends.."
        }, 
        {
            "index": 476, 
            "rating": "5", 
            "review": "Oh wow!. What a view, what a mood! I simply love it. You seat under a tree, you enjoy your beer and watch Lisboa...priceless."
        }, 
        {
            "index": 477, 
            "rating": "4", 
            "review": "Check out the miradors, view points, whenever you can. The city and surrounds are more easily appreciated from the miradouro so do go to them and view the extraordinary views that they provide."
        }, 
        {
            "index": 478, 
            "rating": "5", 
            "review": "A very very good viewpoint!. If you've been wondering around Alfama all day, this is a good place to finish and watch the sun go down! Very refreshing, not too big. The highest point of Lisbon."
        }, 
        {
            "index": 479, 
            "rating": "5", 
            "review": "The highest point in Lisbon. And definately one of the best! From here you get a unique perspective of the city, and there is also a small chapel on the hill, said to be blessing to pregnant women. Enjoy the view!"
        }, 
        {
            "index": 480, 
            "rating": "5", 
            "review": "Simply the best view in Lisbon. No one goes there cos there is no bus stop (less than 5 mins walk from 28e tho) and no kiosk. However, this is by far the best view of Lisbon."
        }, 
        {
            "index": 481, 
            "rating": "4", 
            "review": "Great view!. There's a nice little, well-stocked bar and a little park to spend an hour +, calmly enjoying Lisbon."
        }, 
        {
            "index": 482, 
            "rating": "4", 
            "review": "Awesome. One of the best places of Lisbon to see the whole town, great sunsets, rest after a walk."
        }, 
        {
            "index": 483, 
            "rating": "5", 
            "review": "beautiful - especially for sunset. Very nice lookout, over viewing the whole city. Especially nice for sunsets as the small bar serves wine for only 1.8 -2.3 euros per glass (the latter being worth the extra 50 cent). It might be quite windy up there, so bring a light jacket. We always 'hiked' up from metro station Martim Moniz (small streets and at last a steep stairway) adding to the experience and justifying the extra glass of wine."
        }, 
        {
            "index": 484, 
            "rating": "5", 
            "review": "Wow!. As a Lisbon native, for me it's the best view from the city! You feel you've reached the top, you're above all the roofs."
        }, 
        {
            "index": 485, 
            "rating": "5", 
            "review": "Breathtaking. Maybe the most spectacular and wide view of the city of Lisbon and beyond."
        }, 
        {
            "index": 486, 
            "rating": "5", 
            "review": "The best view in Lisbon. The best miradouro in Lisbon.. qlmost 180 gegree view and pretty church behind"
        }, 
        {
            "index": 487, 
            "rating": "4", 
            "review": "Nice view, good point of departure. Apart from the fortress/castle, this is a splendid place to get an overview over Lisboa. It´s also a perfect place to start exploring Bairro Alto, the most charming part of the city, as far as I´m concerned. Take the Elevador da Glória if you´re coming from downtown."
        }, 
        {
            "index": 488, 
            "rating": "4", 
            "review": "enjoy the view. From the Miradouro you can see the tagus river, the St. George's castle as well as Baixa and Chiado. It's nice to sit there, watch and say nothing. You can reach the Miradouro from the Graca square (tram 28 stops there) in 5 minutes. On our way up we met a cute puppy..."
        }, 
        {
            "index": 489, 
            "rating": "5", 
            "review": "British Engineering on display. Brilliant Babcock and wonderful walk round and grate location"
        }, 
        {
            "index": 490, 
            "rating": "5", 
            "review": "high on the hill. absolutely the best views of Lisbon but it is a bit of a climb from the tram stop"
        }, 
        {
            "index": 491, 
            "rating": "5", 
            "review": "Either the best or the second best miradouro in Lisbon. If you want to watch the sun set over Lisbon, this is the place to be. If you want to see an overall view of the city, then the Miradouro de São Pedro de Alcântara is the one you want. It would be hard to choose between the two, and I'm very glad I visited both during my stay in Lisbon."
        }, 
        {
            "index": 492, 
            "rating": "5", 
            "review": "Oustanding View. Surely, one of the most beautiful places in Lisboa."
        }, 
        {
            "index": 493, 
            "rating": "5", 
            "review": "Great balcony for Lisbon!. Beautiful view to Lisbon downtown plus there's an esplanade."
        }, 
        {
            "index": 494, 
            "rating": "4", 
            "review": "One of the best views of Lisboa. Lisbon has a lot of viewpoints, from which you can see many wonderful views of the city. And the Miradouro da Senhora do Monte provides one of the best views of Lisboa."
        }, 
        {
            "index": 495, 
            "rating": "3", 
            "review": "Nice city view, but not the safest one. This is a place where you have a beatiful view of the entire city, but you should go there during the day, because during the night this area is dark and poorly illuminated."
        }, 
        {
            "index": 496, 
            "rating": "4", 
            "review": "Let me tell you.... This is one of the best places in Lisbon to enjoy the beautiful colours after sunset. On the top of one (out of seven) hills, it gives you an amazing sensation of peace"
        }, 
        {
            "index": 497, 
            "rating": "5", 
            "review": "panorama. That really is one of the best panoramic experiences to have a view of this wonderful city!"
        }, 
        {
            "index": 498, 
            "rating": "5", 
            "review": "Best Miradouro in Lisbon. This is my absolute favorite 'miradouro' (viewpoint) in a city full of them. It's located in the neighbourhood of Graça, a bit further than the Miradouro de Graça, and a bit higher, so the views are even better. I think this is the perfect spot to admire the city: the castle, the Baixa, Bairro Alto, the 25 de Abril bridge... Unlike other 'miradouros', you won't find a small bar here, but it is really worth the effort to get away from the typical touristic routs. Really, you will thank me later..."
        }, 
        {
            "index": 499, 
            "rating": "5", 
            "review": "amazing view. this is one of the most beautiful points to get a glimpse of the whole city"
        }
    ]
}