{
    "category": "Lisbon", 
    "entity": "Miradouro-da-Graca", 
    "avg_rating_stars": 4.625, 
    "review_count": 288, 
    "rating_stats": {
        "poor": 0, 
        "average": 12, 
        "terrible": 0, 
        "very_good": 84, 
        "excellent": 192
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "Majestic. The views of Lisbon and the south side of the river Tagus, from this place, are just amazing, not far from Sao Jorge Castle this is another must in Lisbon."
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "Lovely. A great view! Lovely touch having a (very affordable) wine bar up there too! Had a great end to the afternoon drinking wine and overlooking the city."
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "Lovely Vista. Great shady place to linger on the way up to the castle and look at the panoramic view and its free."
        }, 
        {
            "index": 4, 
            "rating": "5", 
            "review": "take time to absorb the ambience and the view. This is a wonderful viewing area across to Alfama and the castle. After a hot day this precinct offered a welcome shady area to relax and enjoy the ambience of the place. Relax at the cafe or purchase a freshly made juice and sit down and enjoy the place."
        }, 
        {
            "index": 5, 
            "rating": "5", 
            "review": "Stunning views. Not to be missed.. Views toward the city and the sea are incredible from here. Very strongly urge coming here. People watching also is great - but the real reason is unquestionably the views. They are free and wonderful."
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "Miradouro da Graca (Sophia de Mello Viewpoint Breyner Andresen). Sophia de Mello Viewpoint Breyner Andresen has one of the most beautiful and welcoming terraces of Lisbon. Place has a small kiosk that conveniently serves its visitors. Very popular neighborhood of Graça."
        }, 
        {
            "index": 7, 
            "rating": "5", 
            "review": "A must-go. Another perfect spot to get an amazing Lisbon view and watch the sunset. Grab your drink at the kiosk nearby and just relax."
        }, 
        {
            "index": 8, 
            "rating": "5", 
            "review": "Breathtaking views of Lisbon!. This is an amazing place for sightseeing. The views are breathtaking and worth the access fee! Make sure you have blue skies before heading up there as there's a reasonable walk up the hills to get there."
        }, 
        {
            "index": 9, 
            "rating": "4", 
            "review": "Best Miraduro of Lisboa. Very hilly, not far from the praça Martim Moniz, visited in night time. you can see all the city.\nIt is a must in this lovely city of Lisbone"
        }, 
        {
            "index": 10, 
            "rating": "4", 
            "review": "The best views of Lisbon. The best lookout spot in town! The castle, the river, the 25th April bridge, downtown Lisbon, all lined up in front of you."
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "Another amazing view. Prepare to walk up or if you prefere you can take the \"electrico\" or a Tuk-tuk, you can see and amazing sunset, view to the Castelo de São Jorge and all the town. There is a litlle coffee place with a terrace to enjoy a beer and there is a bathroom in the litlle square just a side."
        }, 
        {
            "index": 12, 
            "rating": "3", 
            "review": "Spectacular and crowded. Who doesn't go there? It's on tram 28 and the view is lovely. Go early. The place is usually packed with tourists. I prefer the small mirador of Senhora do Monte at the top of Graca. A word about Graca: we were disappointed with the bairro generally, and specifically the restaurants. The largo and the buildings could be delightful, but the promise of the neighborhood is yet to be fulfilled. So, we can enjoy the miradoures and the crowded tram 28 and then move on."
        }, 
        {
            "index": 13, 
            "rating": "5", 
            "review": "Lovely viewing point..... One of the many view points of Lisbon. This one is special since you get an 'upper view' of Castelo George, and also the city. Plus this place is free to visit"
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "Nice view overlooking the city. Must visit when you are in Lisbon because I am assure you will take a lot of good photos up there overlooking the city of Lisbon. Travelling tips: if you are travelling with friends, take a cab up hill, can be a bit challenging walking up (I myself wanna save some energy for another tourist check point)."
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "Free, breath taking view of the city at sunset. This is definitely one thing not to miss while visiting Lisbon/ the Alfama. We were meeting a friend there at 8h15 pm and were lucky to see the sun set, it was an absolutely beautiful view. There is a large patio where you can have a drink and enjoy the view."
        }, 
        {
            "index": 16, 
            "rating": "5", 
            "review": "Lovely spot to see the city and have adrink. This it the spot to go to when in Liaboa...from a hi view you see all of the city and can have a nice drink with even a lunch if you want"
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "A must ... worth the hike up. If you are visiting Lisbon, the Graca cable car is awesome and when you get to the top there is a great view, with a wonderful environment. There are some artists and a nice place for lemonade and drinks. Not that cheap so bring water with you. Truly breath taking."
        }, 
        {
            "index": 18, 
            "rating": "4", 
            "review": "Excellent views . Came here on a free tour. I'd definitely say it's worth the walk up the hill. Amazing views of the city."
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "Busy but worth it!. A great place for fantastic views of the city. It's currently under renovation so you won't have much space to admire Lisbon from above but it's still worth it. There's a little cafe there if you wish to sit down and a small memorial commemorating a great Portuguese poet Sophia de Mello Breyner Andresen. If you're lucky you can also visit the inside of the Igreja Paroquial da Graça."
        }, 
        {
            "index": 20, 
            "rating": "5", 
            "review": "Goldenview. Nice place, especially for the couples. Great panoramic view on the city from where you can see the castle, bridge,river..."
        }, 
        {
            "index": 21, 
            "rating": "4", 
            "review": "Excellent View. Well worth the walk to get up here...and there are plenty of little carts with food and drink on offer to reward your effort! :)"
        }, 
        {
            "index": 22, 
            "rating": "4", 
            "review": "Short ride, but great views. Short ride up the funicular provides good views across river and city. Plenty of market stalls and cafes up there too."
        }, 
        {
            "index": 23, 
            "rating": "4", 
            "review": "Waterfront. Enjoy the view of the red roofs, local restaurants, while eating you will be looking through the fabulous and breathtaking view of the sea, don't miss this place folks."
        }, 
        {
            "index": 24, 
            "rating": "5", 
            "review": "Best view of the city - and it's free!. Terrific viewpoint to see Lisbon and it's free. Plus, lots of food and drink vendors there that make it festive and fun. Definitely worth a trip, at least for some amazing views and photos."
        }, 
        {
            "index": 25, 
            "rating": "4", 
            "review": "Great place for views, maybe some food, just chilling. Lovely little spot with great views of not only house/apartment roofs, but also the sea. To the left is a restaurant with large outdoor eating area, and to the right, if you can't hold on, a private toilet for public consumption - at a price."
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "WONDERFUL Viewpoint to see and photograph the Old Town Waterfront area of Lisbon. Discovered this outlook, parkette, gathering spot by accident along the way as part of out walking trek and old tram ride exploration of the upper areas of the Old Lisbon waterfront area.We were actually making the trek to find the massive and outstanding flea market in the old upper town when we made a stop to explore this miradouro - and the rest stop proved to be a wonderful and extremely picturesque point to relax, get some shade, have a beverage, and take some stunning photos while overlooking the old town and the waterfront."
        }, 
        {
            "index": 27, 
            "rating": "5", 
            "review": "Panorama excellent. Panorama Lisbon, river tejo and castelo de S.Jorge to recommend.Is a nice place to go and visit Bairro da Graça"
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "I love Lisbon. This is a very quiet place with a lovely church. You reach it walking from the back side neighbourhood of the castle. The view is awesome and the best in Lisbon to see the castle Sao Jorge. You easily spend some time here it is so nice."
        }, 
        {
            "index": 29, 
            "rating": "4", 
            "review": "nice view of lisbon. here you can see best view point of lisbon with less tourist and moreover this place is very peaceful and i felt as i was in heaven."
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Nice spot. When the 28 tram broke down we got off and walked up the hill, attracted by the sound of music and curiosity if what we might find higher up. As sometimes occurs the cloud of misfortune (a foreshortened tram ride) had a silver lining in the form of a trad jazz band playing to a small crowd in the Miradouro.We found a table and ordered coffee, then sat back and enjoyed the performance and the view - see photos. There is also a church nearby. Lovely place to while away a sunny afternoon."
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "One of the great viewpoint fro Lisbon. The view is just amazing, you can see the Castelo de São Jorge, Bairro Alto, the River. Has a coffee and you can just sit and enjoy the view. Great place"
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "My favourite Miradouro in Lisbon. This astonishing miradouro is a must-see. First, just get there with the tram, you will not regret it. Second, chose moment of sunset, sit at local cafe with glass of Porto and just enjoy the most romantic view."
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "Spectacular 360 degree views of Lisbon. This is the BEST place to get oriented to the city, as you can see the Tejo, the Castelo, and so many of the barrios. However, getting there by car is not for the faint of heart-best hire a driver, or take a local TukTuk from one of the squares."
        }, 
        {
            "index": 34, 
            "rating": "3", 
            "review": "Only the view. If you like to walk a lot and if you have time enough, but the view on the other side from the city at the miradouro Sao Pedro de Alcantara is 100 times better"
        }, 
        {
            "index": 35, 
            "rating": "4", 
            "review": "Gorgeous View of the City. This location has one of the best view of the City and the Castle. The Graca Restaurant there also has excellent view, in addition to fantastic cuisine."
        }, 
        {
            "index": 36, 
            "rating": "4", 
            "review": "Amazing vantage point. After a walk up the cobblestones, here we are. A beautiful Miradouro over Lisbon while enjoying a bica (Portugese espresso). Perfect for a \"Kodak\" moment."
        }, 
        {
            "index": 37, 
            "rating": "5", 
            "review": "Old city view. From Miradouro da Graça you can watch most of the old parts of the city!It's very well located, 3 minutes walking from Largo da Graça where you can get the tram E28.The restaurants around are really nice and not expensive.But if you get a nice day to chill out, nothing better than staying here with a cold one in hand!"
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "One of the best views over Lisbon. One of the best views over Lisbon, including Castelo de S. Jorge, Tejo River, and a colorful rooftop collection of the city"
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "Best view of the city. Brilliant view from here. Go early though as it seems to get busier throughout the day. Small park and toilet nearby."
        }, 
        {
            "index": 40, 
            "rating": "3", 
            "review": "There are better miradouro's out there. Mostly due to the works they were performing.Note that just below there is a great playground for the kids with snack kiosk"
        }, 
        {
            "index": 41, 
            "rating": "4", 
            "review": "Beautiful viewpoint on the castle and Lisbon. Take the famous Tram 28 until De Graca stop and walk 150 meter downhill to this viewpoint. Combine this viewpoint with a visit of the castle, the pantheon and the san vincente monasteiro going downhill through the Alfama district. Keep in mind that is easy to get lost in this district (making this a very surprising and beautiful experience seeing and feeling the heart of the district) and that the slopes are difficult for children and elderly people."
        }, 
        {
            "index": 42, 
            "rating": "5", 
            "review": "Best view on Lisbon. Best view on Lisbon, like from st George castle, but for free :-) Grab a beer, sit in the shadow and enjoy your time"
        }, 
        {
            "index": 43, 
            "rating": "5", 
            "review": "Great vantage point. This Missouri (overlook) is a perfect spot to watch the Lisbon sunset. It gets a bit windy, so bring along a light jacket or a scarf. Yup can order a drink or two and have some light snacks from the little kiosks that are set up there."
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "Great view of Lisbon downtown. Beautiful view with Tagus river and 25 de Abril bridge on the background with S. Jorge Castle looking over Lisbon's downtown."
        }, 
        {
            "index": 45, 
            "rating": "3", 
            "review": "wonderful place. wonderful place to be. love the outdoorsy cafe's , restaurants and slow paced lifestyle... definitely worth a visitbring your camera for a worthy view of lisbon"
        }, 
        {
            "index": 46, 
            "rating": "3", 
            "review": "Great views but crowded on the weekends.. If you go here, the highlight is really the walk through the neighbourhood. Most people seem to arrive in some kind of transport, though. It is often very crowded at the top, but the views are beautiful."
        }, 
        {
            "index": 47, 
            "rating": "4", 
            "review": "Go for the view. This is a very large old cathedral overlooking Lisbon. The view is a beautiful commanding view of the city. We did not go into the cathedral. This would be a good place to walk through if you were already in Alfama. Go for the view!"
        }, 
        {
            "index": 48, 
            "rating": "4", 
            "review": "On a clear day. You can relax here, either walking along the terrace or drinking beer, coffee, or all of the above :) Do not forget your camera. You can walk up the hill or take the tram 28 (pretty crowded theses days). On the way, visit the Cathedral (Sé de Lisboa)."
        }, 
        {
            "index": 49, 
            "rating": "5", 
            "review": "Beautiful views and less touristic - go !. This is a wonderful viewpoint of the city, with less tourists and in a great area. Find your way there and reward yourself with a coffee at a terrasse under the trees."
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "Looking in to the city. One of the most wonderful places to look in too Lisbon and enjoy the view. In the summer youngsters go there and meet in the afternoon."
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "Nice view of Lisbon and the Alfama neighbourhood. Here you have a nice view of the Alfama neighbourhood and its small streets. You can also see the castle of Lisbon and the big river. It's completely free and a good 15 minute upwards walk from the city centre, absolutely worth it. There are also enough trams and tuktuks that stop here nearby."
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "was my favourite view over Lisbon city. Outdoor service at tables, beer, wine, soft drinks, coffee. Wonderful atmosphere, to sit and enjoy a glas of wine in the evening and to look at the lights all over Lisbon is fantastic. You can see the bridge all lit up. Much recommended!"
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "It's a great view. It's a great view of Lisbon, and the surroundings is very interesting. It's a view to see in daylight and nightlight."
        }, 
        {
            "index": 54, 
            "rating": "5", 
            "review": "Beautiful . We stayed at hostel nearby and it was lovely to be able to sit and pass time in this beautiful location. You can walk up through alfama or up the side street and steps from rossio. Worth the walk and there is a bar that serves drinks sandwiches etc."
        }, 
        {
            "index": 55, 
            "rating": "5", 
            "review": "Beautiful sightseeing of Lisbon. Beautiful place, with all historical places of Lisbon on site and excellent Terrace to take a tea ..........."
        }, 
        {
            "index": 56, 
            "rating": "5", 
            "review": "Yet another view point in Lisbon. This was by far my favourite view point in Lisbon. I could stay there and admire the beautiful view for hours. Very peaceful."
        }, 
        {
            "index": 57, 
            "rating": "5", 
            "review": "Miradouro - take your time when you go there.... do not only pass by. have a seat. have a drink. visit the church and light a candle. stay. breath. have another coffee. observe the people and enjoy"
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "Pace yourself!. It's a climb, but worth every step. Miradouro da Graca has spectacular views over Lisbon both during the day and the night. Maybe it was just the time of day, but it was not particularly crowded when I visited .. maybe the climb discourages people! Lots of photo opportunities."
        }, 
        {
            "index": 59, 
            "rating": "5", 
            "review": "One of the best views of Lisboa.. It is located in the nice neighborhood of Graça, not far from Castelo de S. Jorge. It has one of the most beautiful views of Lisboa. It's a great place to see the sunset, while enjoying a coffee or tea at the small cafe."
        }, 
        {
            "index": 60, 
            "rating": "4", 
            "review": "Don't leave Lisbon without going there!. Located in a popular quarter where you may feel the lisbon athmosphere. Wonderful view over the old city and the river. Stroll around."
        }, 
        {
            "index": 61, 
            "rating": "5", 
            "review": "View.. Next to Castelo S. Jorge with good view of Alfama and down to Tejo River.Walk downhill, few souvenir shops and another picture opportunity at Santa Luzia."
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "Fantastic views of Lisboa. We headed up here off the number 28 tram not really knowing what it would be like. While it was a very windy day, this vantage point has wonderful views over the city and we didn't feel the need to visit the very busy castle. Take the time to visit this viewing area. It's free."
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "SUPERRRRR. really never seen anything like that so spectacular.\nEveryone must to go there and see. Super super fantastic"
        }, 
        {
            "index": 64, 
            "rating": "4", 
            "review": "Beautiful views even in poor weather. A stone's throw away from the Sao Jorge Castle, the Miradouro da Graça has great views to the north and east of the city - lovely even in poor weather (visited on a rainy January morning!). Don't bother with the refreshments though unless you're feeling really flush - you'll end up paying as much as for a full meal in one of the more local restaurants."
        }, 
        {
            "index": 65, 
            "rating": "4", 
            "review": "nice view in the hilly city. one of the citys hills. nice view on a nice day with quite a view over the city and the river. on a bad day, you might only see the city."
        }, 
        {
            "index": 66, 
            "rating": "5", 
            "review": "Nice view!. Especially since Castel Sao Jorge now charges an entry fee it's a nice alternative. You have a good view to the castel, town and Tejo."
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "Stunning Lisbon views. Lisbon is known to be the city of the 7 hills. One of them is Graça and this \"Miradouro\" overlooks Lisbon and provides some of the best views in town. It's as beautiful by day as it is by night. There a great restaurant nearby \"Via Graça\" with a similar view and some very nice restaurants and shops, Right up-there you have the very small \"Senhora do Monte\" Chapel which is very cute and a good place for the faithful. Bring your camera!"
        }, 
        {
            "index": 68, 
            "rating": "4", 
            "review": "View not crowded with tourists. There are so many \"miradouros\" in Lisbon and this is one of the top 3. It's not far from city center. You can see the Tagus river and this old part of town. A place to relax for hours after a long walk. Coffee shops and restaurants are around there."
        }, 
        {
            "index": 69, 
            "rating": "4", 
            "review": "a great view, but second best. On our walk from the Mouraria towards the Alfama we passed the Graça quarter with its viewpoints. A bit further up and a touch more spectacular is the Miradouro da Senhora do Monte. But definitely both are very worthwhile.The Miradouro da Graça can also be reached by using public transport, namely the unique Tram 28 from the Praça Martim Moniz up to the stop Graça at the Largo da Graça. From here it is a short walk to the viewpoint, which is next to the quite grand church Igreja da Graça. Rebuilt after the earthquake of 1755 this church can also be visited unlike its adjoining building around a cloister, which once belonged to an Augustinian monastery.From the miradouro can be seen the whole center of Lisbon and also the castle Sao Jorge. There are trees for shade up here and in a corner is a café with outdoor seating, the 'Esplanada da Graça'.Since 2009 the Miradouro da Graça has officially been renamed Miradouro Sophia de Mello Breyner Andresen, but hardly anybody uses this new name. It is in honour of a 20th century poetess, who is held in high esteem in Portugal and who is buried not far from here in the National Pantheon. At the miradouro can be seen a bronze bust of her as well as a plaque with her poem 'Lisboa' (only in Portuguese)."
        }, 
        {
            "index": 70, 
            "rating": "4", 
            "review": "Excellent place to enjoy coffee and a view of the city. Miradour da Graça is one of the best miradouros in Lisbon (which are many) - it's not too far away from the centre, it offers a stunning view of the city and it is located in one on the few traditional neighborhoods that survived the earthquake of 1755. As it is a bit uphill, it is not crowded with tourists. It an excellent place to relax and get the feel of life in old Lisbon."
        }, 
        {
            "index": 71, 
            "rating": "4", 
            "review": "must see view over Lisbon towards west. As many other have reviewed, this is the place to get a great outlook over Lisbon. Take the 28 tram if it's not too crowded, the tram trip is an adventure in itself up & down the hills and narrow streets. Then walk down towards Alfama for more views.\nProbably a must see in Lisbon...."
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "Postcard from Lisbon. \"Miradouro da Graça\" is one of the perfect viewpoints that Lisbon has to offer to everyone that comes to visit or live in the city! From there, you can see one of the most beautiful part of Lisbon - full of light from the blueish sky and the river on sunny days, and a greyish light on cloudy/rainy days. A perfect window to the city that makes all the way up there totally worthwhile!"
        }, 
        {
            "index": 73, 
            "rating": "5", 
            "review": "Great view - the best in town!. You should go to Graca and get a nice view of town from this viewpoint (Miradouro). It is possible to walk up from downtown. Guess it just take about 15-20 minutes. You can also take tram number 28, and walk from the stop."
        }, 
        {
            "index": 74, 
            "rating": "4", 
            "review": "good view of city. You get an excellent view of the city, including the Castelo de Sao Jorge, rooftops of Alfama and beyond. You can relax in the shade of the trees enjoying the cool mountain breeze. Spend some time with a book or a friend, buy a beer from the small cafe on the terrace that has put seats out, or perch on the wall. There are a couple of fountains nearby with an interesting copper statue as well."
        }, 
        {
            "index": 75, 
            "rating": "4", 
            "review": "A beautiful view on Lisboà city and Castelo Sao Jorge. After visiting Castelo Sao Jorge, we took Tram E28 to reach Igreja de Graca (nice church worth visiting) and the viewing platform.The place is really relaxing. Local residents stay there for a drink and a chat.We continued walking down and up to the next Miradouro da N. S. do Monte, the highest hill of the Graça area to see a wonderful sunset."
        }, 
        {
            "index": 76, 
            "rating": "5", 
            "review": "Great views. Great views of the city from the castle side. My views before had always been from the other side. Just outside the Igreja de Graca, which is well worth a visit."
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "Beautiful View of Lisbon. There are many great vistas in Lisbon because it is the city of seven hills but this one is just beautiful."
        }, 
        {
            "index": 78, 
            "rating": "5", 
            "review": "Awesome Place, Peaceful . This \"Miradouro\" is so nice!The views are breath taking and the atmosphere is unique!While you're looking to the river and Lisbon's unique characteristics you have a small place serving drinks&snacks and a Church as well.It's always busy when the weather is perfect. Good for a drink after lunch or Dinner!"
        }, 
        {
            "index": 79, 
            "rating": "5", 
            "review": "Gorgeous sunset over the city. Stumbled upon this beautiful viewpoint after getting off tram #28 at the top of the hill and ate at the terrace cafe to watch a gorgeous sunset over the city. Encountered the same viewpoint again the next day while exploring the narrow streets of Alfama. A great place to rest and survey the surrounding area."
        }, 
        {
            "index": 80, 
            "rating": "5", 
            "review": "From high on a hill.... My first trip to this particular hill top. More great views, as one would expect. There's a lovely little park right next door that was fun to spend some quiet time in. Can get very, very busy during the tourist season apparently so go early in high season."
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "Stunning views. Sit on one of the terraces of coffee and enjoy the view . Spend some time looking at all that the view has to offer . From this point you can see a good part of Lisbon and the other side beyond the Tagus river. Take a little time to visit the ancient church that's right behind. Access is not easy if you don't have good legs it's better to go by taxi, or tuk-tuk . it well worth the visit!"
        }, 
        {
            "index": 82, 
            "rating": "5", 
            "review": "A pleasant walk and equally pleasant view. Not the greatest view in the world but definitely worth going up after having a look in the Cathedral. Nice spot to get some great pictures of old Alfama. There was also a cruise liner and a US Navy warship there today. Walk up from the bottom - it's nowhere near as arduous as some reviews imply."
        }, 
        {
            "index": 83, 
            "rating": "5", 
            "review": "Stunning View. Great place to just sit and enjoy the scenery and take pictures. Very Clean and well maintained. A must see while in Lisbon"
        }, 
        {
            "index": 84, 
            "rating": "4", 
            "review": "The best. I think the best view on Lisbon. We were lucky the tram stop it was just close at home, but I suggest:stop at the first Miradouro and follow the streets to the Others, so you can also discover the Graca's district popular and typical"
        }, 
        {
            "index": 85, 
            "rating": "5", 
            "review": "GREAT VIEWPOINT. very good viewpoint of the city! You can also the Castle and the 25th April Bridge.I recommend you download a google offline map Visit first the Miradouro do Senhora do Monte, this one second and the Santa Luiza afterwards. They are very close to each other!"
        }, 
        {
            "index": 86, 
            "rating": "3", 
            "review": "Ideal place to look at the roofs of the city.. There is an elevador that takes u there or you can arrive nearby by the tram. The view is well worth the visit and if u keep walking you will arrive to the Sao Vicente de Fora."
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "The best view. the best view in the city. We could see the center, the castle, the bridge, etc. To get there we used the trams 28."
        }, 
        {
            "index": 88, 
            "rating": "4", 
            "review": "excellent views. Take the Gloria funicular from ave Liberdad (about a block up street from Rossi station) tot he top. ticket is 3.6e for two rides. You want to ride up from that street. View is hard to beat, and gardens are nice as well. Had a little spot to have a beer or wine."
        }, 
        {
            "index": 89, 
            "rating": "5", 
            "review": "Terrace view. Busy terrace view point next to church. View over to Castle de Sao Jorge and up to Senhora do Monte view point with overview of Lisbon in between."
        }, 
        {
            "index": 90, 
            "rating": "4", 
            "review": "Worth the walk. Walked up to find Pharmacia Restaurant and museum the views were wonderful and we walked up there daytime and night for photos."
        }, 
        {
            "index": 91, 
            "rating": "5", 
            "review": "Worth the Hike. After a long uphill climb (this is part of the whole Alfama experience) you are rewarded with a beautiful view looking west over the rooftops of Lisbon. The Church is nice, too. Thankfully, its all down hill from there!"
        }, 
        {
            "index": 92, 
            "rating": "4", 
            "review": "View, wine and custard tart. Lovely view from here - and a reward from the climb I had a glass of wine and custard tart in the shade of the pine trees."
        }, 
        {
            "index": 93, 
            "rating": "4", 
            "review": "Another of Lisbon's viewpoints. A different perspective of Lisbon, facing southwest to the Castle and the Mouraria. A pleasant terrace on top invites you to stay for a while and have a drink. It's a long walk up, so a tuc-tuc is definitely appropriate!"
        }, 
        {
            "index": 94, 
            "rating": "5", 
            "review": "Great music too. You will visit this miraydouro not only for the view, but also for the music! We enjoyed musicians of Cape verde. GREAT!"
        }, 
        {
            "index": 95, 
            "rating": "5", 
            "review": "Beautiful viewpoint!. Such a beautiful viewpoint! Definitely worth the walk! These views are what will make you fall in love with Lisboa!"
        }, 
        {
            "index": 96, 
            "rating": "5", 
            "review": "Fantastic end to the afternoon. Excellent vantage point to view Lisbon and SJorges' castle from the eastern side. Very pleasant at the end of the day with the cafe and esplanade"
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "One of the Best views of Lisbon. One of the best views of Lisbon. Lisbon is considered the City of the 7 Hills. This is one of the most beautifully views of the city where you can enjoy our city and it's atmosphere. Is also located in a typical place."
        }, 
        {
            "index": 98, 
            "rating": "5", 
            "review": "Amazing Sightseing. We went on a tour and stop at this Place for pictures and sightseeing.The view of the city is just amazing,we could see the beautiful Rio Tejo,the bricks of the roofs are famous in Lisbon,the endless beauty that we are able to admire of the city and soundings is endless ."
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "Go see!. Although it does require some hiking to get to this viewpoint, it is totally worth it! An excellent overview of Lisabon! Too bad it was cloudy when I was up there and couldn't enjoy the sunset."
        }, 
        {
            "index": 100, 
            "rating": "5", 
            "review": "A must see. Very nice place to have a drink and enjoy a super view over the city.\nEasy to get there and from there you can go to many places by foot."
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "Fantastic views, worth the hike!. Quite a trek up but well worth it, the view of the city is spectacular and especially nice to look over at the castle perched on its own hill with the river behind."
        }, 
        {
            "index": 102, 
            "rating": "5", 
            "review": "Great landscape of Lisbon. Miradouro da Graça is a great place to enjoy a great view of Lisbon. I advise you to go in confortable shoes if you go by foot as it's always up!! If you go on summer you would love what awaits for you on the top: shadow and limonade :D"
        }, 
        {
            "index": 103, 
            "rating": "5", 
            "review": "Stunning view of Lisbon.. I've seen sunset from Miradouro da Graca and it was absolutely stunning. Apart from that it is an absolutely great point from which you can enjoy the view of Lisbon. Fantastic place, don't miss it!"
        }, 
        {
            "index": 104, 
            "rating": "5", 
            "review": "Views as lovely as the atmosphere. Great place to take a rest after strolling through the Bairro Alto neighborhood. The terraced park offers a lovely view of the city down below and river. There are a couple of kiosks so order a coffee or cool drink and take a seat at one of the cafe tables after you've taken in the view. I had a glass of lemonade with bits of fresh ginger root and mint leaves in it. Yum.When we stopped by there was a group of musicians playing in the upper portion with people in the park dancing. It was absolutely charming.The lower tier was a bit more quiet but equally nice. Afterwards, hop on the funicular tram and enjoy the ride down the steep hill."
        }, 
        {
            "index": 105, 
            "rating": "4", 
            "review": "Nice overview on Lisbon which helps to understand city configuration. When no fog nice view. The \"map\" made of azulejos is a bit old, damaged but it gives a pretty good idea on what you can see and where you can head to. It is the mandatory stop for all tuktuk and guided visits in Graça. Not always clean though....."
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "Put this high on your Lisbon to-do list!. Fabulous views, excellent busking musicians all of whom are first-rate and there's a cafe where you can enjoy a leisurely drink as you take it all in."
        }, 
        {
            "index": 107, 
            "rating": "5", 
            "review": "superb view. Superb view of the city - definitely worth the walk up the hill or you can take a tram or tuktuk. Can see for miles on a clear day."
        }, 
        {
            "index": 108, 
            "rating": "5", 
            "review": "Lovely views. Beautiful views over the city and the river - you can see how this was an important place for those explorers to set off from."
        }, 
        {
            "index": 109, 
            "rating": "5", 
            "review": "Beautiful place to relax!. Lisbon is a beautiful city with lots of places to enjoy the view. This miradouro has a café, where you can just sit and relax, while you have a great overview of the city, the river, the bridge..."
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "simply beautiful. Beautiful view, warm welcoming people, funny tuk-tuk and trams climbing up on the city hills: wortth walking around the narrow streets and have a look at the flea market on Tuesdays and Fridays (morning)"
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "Good views with refreshments on the balcony. Not as spectacular as \"Senhora do Monte\", Miradouro da Graça offers a wonderful 180º view of Lisbon, right next to an old church.\nGood to have a drink and rest your legs."
        }, 
        {
            "index": 112, 
            "rating": "5", 
            "review": "Great view of the city. One of the best places to enjoy a view of the city of the seven hills, whether with friends and some bier, or with your other half. Perfect!"
        }, 
        {
            "index": 113, 
            "rating": "3", 
            "review": "nice view, but there are better spots in Lisbon. a nice view, but don't come especially for it, there are other better spots like the castle, Monasterio de sao vincente de fora and more. The Big benefit is the castle view. You will enjoy, if you are in the area anyway"
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "fantastic find. must admit, we only saw this from our hotel room, I thought there must be a great view, we walked through the back streets to get there and we certainly weren't disappointed ... well worth a trip too"
        }, 
        {
            "index": 115, 
            "rating": "5", 
            "review": "you can\"t miss the view. the view is beautiful and there some terraces where you can have a drink.explore the surroundings.Ask for the vilas operárias\"(old worker\"s villas)"
        }, 
        {
            "index": 116, 
            "rating": "5", 
            "review": "Top views. One of the best viewpoints in Lisbon, overlooking downtown, Castelo and the river. Next to it is Graça Church and a few hundred meters away another viewpoint, Senhora do Monte, even higher and also with amazing city and river views! Take a stroll down heading Sé and downtown Lisbon!"
        }, 
        {
            "index": 117, 
            "rating": "5", 
            "review": "Great view!. That's a great place to photograph the city. I would advise you to avoid at night time. Great for a beer or a coffee in the esplanade. Don't miss it. There's another viewpoint very nearby, which has even better views."
        }, 
        {
            "index": 118, 
            "rating": "5", 
            "review": "Top view of the city in a charming neighbourhood. Think no more. Just grab that selfie stick and go right there to take all those wonderful pictures that it will make all of your friends back home jealous!\nDon't forget to visit the church also and grab a drink at the nice esplanade with that breathtaking view."
        }, 
        {
            "index": 119, 
            "rating": "5", 
            "review": "Great place with wonderful view to the river and the city. Great place with wonderful view to the river and the city. A place to relax for hours after a long walk. Coffee shops and restaurants are around there."
        }, 
        {
            "index": 120, 
            "rating": "5", 
            "review": "Simply the best view of Lisbon - no longer our hidden secret.... For many years this was our hidden secret in town. My husband and I used to go there once in a while and used to take there friends and relatives visiting us. For us it's by far the best view of Lisbon, both with daylight and at night. It used to be a quiet and lonely place. Recently it was found out and became popular, lively, busy. But the view is the same. No longer our private and hidden secret place..."
        }, 
        {
            "index": 121, 
            "rating": "5", 
            "review": "Another nice view over old Lisbon. It is difficult to reach, eithe by foot because you have to climb a lot, or by car, because there is no parking place, but the view worth alot. Irecommend to go by táxi or tuk-tuk"
        }, 
        {
            "index": 122, 
            "rating": "4", 
            "review": "one of the best views in town. Quite popular among tourists. You can get there by taking the tram 28 and getting off at the Graca square. Picturesque views. Not to be missed."
        }, 
        {
            "index": 123, 
            "rating": "5", 
            "review": "Sightseeing. Wow what a view. Not to be missed if you want to get an idea of what's around you. Saw this on our bus tour."
        }, 
        {
            "index": 124, 
            "rating": "4", 
            "review": "One of the best viewpoints. Nice at sunset but also more crowded.\nPerfect place for a drink after work.\nNice music, chill out mood."
        }, 
        {
            "index": 125, 
            "rating": "5", 
            "review": "Perfect place for a pitstop . We arrived at the Miradouro da Graça quite by chance, a bit tired and thirsty after some walking. The place was like an oasis; amazing city views, lovely trees giving shade, a little bar with tables to sit and have a refreshment, and soft, charming live music. It couldn't get any better. Highly recommended."
        }, 
        {
            "index": 126, 
            "rating": "5", 
            "review": "Best viewpoint?. Although we did not go inside the castle, we felt the Miradouro da Graca was well worth the trek. You could see the majority of the landmarks in the city, including the castle itself."
        }, 
        {
            "index": 127, 
            "rating": "4", 
            "review": "Great view of Lisbon!. Great view over Lisbon. Would like to go there at sunset; went early in the morning and it was nice and not overcrowded."
        }, 
        {
            "index": 128, 
            "rating": "5", 
            "review": "Great musicians most evenings. This was at the top of our staircase so we passed by several times a day. A lovely evening spot and less busy than some of the other miradouros we saw. Usually someone dying music- jazz sax, guitar etc. buy a cocktail or lime juice. The small church is worth looking inside of its open"
        }, 
        {
            "index": 129, 
            "rating": "5", 
            "review": "Most visit in Lisbon.. Best place to see Lisbon from height. I was there withfriends we enjoyed lo. Dont miss when you are in Lisbon."
        }, 
        {
            "index": 130, 
            "rating": "5", 
            "review": "Perhaps the best view and sunset in Lisbon. This is the place where you should come and enjoy the sweeping views of the city as well as the sunset.\nGet your Pastel de Nata and enjoy the beauty called Lisbon."
        }, 
        {
            "index": 131, 
            "rating": "5", 
            "review": "Nice spot over the hill looking to the river Tagus. A great balcony overthe hill. You can have a beer along with some ' tremoços' or ' caracóis', traditional portuguese snacks while you enjoy the view. Behind there is a beautiful church which belonged to a former convent."
        }, 
        {
            "index": 132, 
            "rating": "4", 
            "review": "Nice. Nice place. There is also a terrace where you can enjo a drink while watching over the city.\nNice views over Lisbon and Castle San George."
        }, 
        {
            "index": 133, 
            "rating": "5", 
            "review": "Nice place to kiss.... A wonderful view of Lisbon and very romantic to go with your girlfriend. In the night is the must\nTry and let me know..."
        }, 
        {
            "index": 134, 
            "rating": "4", 
            "review": "A Lisbon classic. One of Lisbon's most classic views, yet definitely worth a visit. Also check out the nearby (and much better) Miradouro da Senhora do Monte, as well as the Vila Berta inner patio, if you can get in. This is where one of the most famous scenes of Portuguese cinema was shot, with Vasco Santana speaking to a lamplight. The Miradouro has especially good views at sunrise and sunset and has the advantage over the Senhora do Monte of having a kiosk and esplanade."
        }, 
        {
            "index": 135, 
            "rating": "5", 
            "review": "I go here regularly. It is definitely one of the best Miradouros in Lisbon. Right behind the castle Sao Jorge where you can enjoy an amazing view of almost the whole city! It appears less constructed or artificial than other miradouros and it is a relaxing place to hang out. Get a beer or vine verde at the Quiosque and sit below the pine tress ;)"
        }, 
        {
            "index": 136, 
            "rating": "4", 
            "review": "There is a Greek everywhere. Just opposite the Jorge castello...Very nice view also. Visit it with the elevator!!!There is a cafe there where a Greek works. Very hospitable guy....No capucino freddo for the Greeks though....!!!!!!"
        }, 
        {
            "index": 137, 
            "rating": "5", 
            "review": "Brilliant view of the city. One of the best views of the city, although constantly crowded. If you're lucky, you can get a table al fresco and enjoy one of most inspiring sunsets of your life. Guaranteed!"
        }, 
        {
            "index": 138, 
            "rating": "5", 
            "review": "Greatest View. One of the best city views, u can see the river and the bridge, by night is even more awsome with all the lights turned on, really enjoyed being there for real."
        }, 
        {
            "index": 139, 
            "rating": "5", 
            "review": "great city view. Go there with your friend, lover, family or dog. Have a coffee at the small coffee pub, listen street artists, and enjoy the view!"
        }, 
        {
            "index": 140, 
            "rating": "5", 
            "review": "Nice!. I didn't really get the Miradouro hype until we went! Yes! Super fun, excellent views, lively area. Nice to just hang out. we grabbed beers from a little market across the street and just enjoyed the views!"
        }, 
        {
            "index": 141, 
            "rating": "3", 
            "review": "Nice view but atmosphere not the best.. We visited this location in the late afternoon when maybe it would have been better to go when the sun is going down. The view is nice but there are the red roof tops of a couple of buildings that don't give you a completely unrestricted view.I wasn't overly impressed with the seating areas. I think that the Miradouro de Sao Pedro de Alcantara is better which is opposite to this one. At Alcantara the view isn't as high up but the spot itself is nicer in my opinion when the sun is going down...with picnic type bench seating and a nice ornamental garden that you can walk into from the main viewing area."
        }, 
        {
            "index": 142, 
            "rating": "5", 
            "review": "Amazing viewpoint. This is the highest miradouro in Lisbon - which means it's very high up!! We would never have made it without taking a Tuk Tuk to get there. But, it was definitely worth the cost of the ride because the views were amazing. Of course, all the miradouro's we visited were great, but this being the highest one gave the view of seemingly everything in Lisbon.It's worth the time, effort or money to make the climb/ride."
        }, 
        {
            "index": 143, 
            "rating": "3", 
            "review": "Great Views from Miradoura da Graca. The easiest way to get here is Tram 28. You can incorporate a trip to the Castle Sao Jorge as well and see all three Tram 28,Castle and Miradoura with least climbing. This is a lovely spot while walking around the Graca neighborhood and is a typical Portuguese scene. On the Miradoura there is a coffee shop and from here you get great views of the Castle, over Lisbon right down to the River Tagus. The tram 28 terminus at the top is a 5 minute walk away. Tram 28 is part of the day pass for Carris system so is great value and can be bought at Metro Stations machines for 6 euro / day.If this review is helpful then please indicate so below."
        }, 
        {
            "index": 144, 
            "rating": "4", 
            "review": "Great views and atmosphere. The Miradouro de Graça is located in the neighborhood of Graça, connected with the city center by the famous 28 tram. It has great views of the city, from the Castle to the Baixa, Mouraria, the 25 de Abril bridge in the back... It is a nice place to go in the evening, when the sun is about to set, to have a beer from the quiosque (and even if it is usually quite packed with tourists they won't overcharge excessively). It can get a bit chillly in the evening though, so it is better to bring a sweater or a jacket..."
        }, 
        {
            "index": 145, 
            "rating": "4", 
            "review": "Hard to find. The best if you take the tram 28 and than you have a 5 minutes walk. From here you have very nice views over the city, the river, and partly Saint George Castle too."
        }, 
        {
            "index": 146, 
            "rating": "5", 
            "review": "Good views. Worth a visit. The other miradores are also pleasant and I recommend visiting them to get a good sense of the city."
        }, 
        {
            "index": 147, 
            "rating": "4", 
            "review": "Nice view over Lisbon. It's a bit of a walk up the hill but offers a nice view over the city. We stopped on the way up to the Castelo Sao Jorge."
        }, 
        {
            "index": 148, 
            "rating": "5", 
            "review": "A must. A wonderful place to stop and have a drink, while enjoying a wonderful view of Lisboa and the river Tejo. A \"must visit\"."
        }, 
        {
            "index": 149, 
            "rating": "4", 
            "review": "Hard to find, but a really nice view. If you get off at the GRACA stop from Tram 28, this is a 5 minute walk. We got terribly lost so make sure someone maps this for you. The view of Castelo Sap Jorge and the Vasco da Gamo Bridge are really, really nice."
        }, 
        {
            "index": 150, 
            "rating": "5", 
            "review": "Worth the climb. It was a hard climb up zig zag steps to reach the Miradouro Garca but well worth it. The view includes the city, the bridge, river and castle. There is a small cafe and benches in the shade. I recommend this before you then go and visit the castle.Beautiful views."
        }, 
        {
            "index": 151, 
            "rating": "4", 
            "review": "Get your bearings. Access by funicular, splendid views of layout of downtown Lisbon, passable sushi restaurant behind. This tree lined miradouro is a great place to view the city then take some downtime from the hard work of tourism, for a coffee or a spot of lunch."
        }, 
        {
            "index": 152, 
            "rating": "5", 
            "review": "Stunning. On a clear day it gives you one of the most stunning views over Lisbon and the Tagus river.\nUnmissable!"
        }, 
        {
            "index": 153, 
            "rating": "4", 
            "review": "STUNTING VIEW OVER LISBON. A place in one of the 7 hills of Lisbon. Not far from the Castel of São Jorge. It has a Little Cofee with many tabels. Not expensive and with a Great View. It has no Toilet besides the one in a Garden, that they give you the Key from it. A little windy sometimes."
        }, 
        {
            "index": 154, 
            "rating": "5", 
            "review": "From the castle to the river and beyound. This place has probably the best view in Lisbon. You can relax and have a drink as well. The surroundings are packed with good and not expensive restaurants where locals mix with tourists producing really enjoyable ambient. Book a table at the restaurant of your choice, go to \"Miradouro\" for a drink and then back to the restaurant for dinner. This simply because all restaurants are full at 20:00."
        }, 
        {
            "index": 155, 
            "rating": "5", 
            "review": "Great place to be in Lisbon!. I do recommend to visit it when you are in Lisbon. The view is just awesome and worth visitng especially in the very early morning when the sun starts to light the buildings and at night!"
        }, 
        {
            "index": 156, 
            "rating": "4", 
            "review": "A fantastic view. Go there for sundowners, the little bar serves reasonably priced drinks and enjoy the view whilst sitting outdoors under the trees!No need to queue either, there is table service."
        }, 
        {
            "index": 157, 
            "rating": "5", 
            "review": "Best view of Lisbon. We expirienced almost all viewpoints in this city but this one is the best. You will not regret at all. Nice tree shadow, and good cold wine after a long walk in the sun."
        }, 
        {
            "index": 158, 
            "rating": "5", 
            "review": "Also called Miradouro Sophia Mello. This miradouro offen georgeous view of the castle and the area around Rossio square. There is a small cafe but also benches to enjoy the view."
        }, 
        {
            "index": 159, 
            "rating": "5", 
            "review": "Take this tram 18 to Graca!. Beautiful view at the top of the hill where you can see the castle and the city.. Musicians, porto wine or Super Bock to chill out under the pine trees.."
        }, 
        {
            "index": 160, 
            "rating": "5", 
            "review": "Beautiful view . The views are absolutely stunning. High up in the Alfama the views of the Baixa and of Bairro Alto are outstanding. You can even see Sao Jorge Castle. There's a small cafe for drinks and coffee while you enjoy the view"
        }, 
        {
            "index": 161, 
            "rating": "5", 
            "review": "Gorgeous. Go when it's bright and sunny in the morning and for sunset. The view stretches for miles, and sunset colours are beyond gorgeous. Benches to sit on (free) and close to a delicious restaurant called O Pitéu."
        }, 
        {
            "index": 162, 
            "rating": "4", 
            "review": "nice city view. The city expands before your feet. Get the opportunity to see Lisbon from above. That's a very good way to form the city map in your mind."
        }, 
        {
            "index": 163, 
            "rating": "5", 
            "review": "great views. A pretty little look out point if you are walking around the Alfama area. A good view of the castle and the city."
        }, 
        {
            "index": 164, 
            "rating": "4", 
            "review": "Great views over the city, small cafe and toilets available. One of several 'lookouts' across the city, close to the convent and with a kiosk café with tables and chairs. Public toilets are available nearby."
        }, 
        {
            "index": 165, 
            "rating": "5", 
            "review": "Graca grandure. fantastic views over the city to the castle, and from the river Tagus all the way to Edward VII park."
        }, 
        {
            "index": 166, 
            "rating": "5", 
            "review": "great miradouro!. fantastic view and beautiful church! lovely kiosk, seats with a great view over lisbon and the castle, also lovely water features in the background, sun and shade, and a toilet!! rather difficult to find our way there though, due to lack of sign posts and the maps are useless! but wonderful view, well worth the climb!"
        }, 
        {
            "index": 167, 
            "rating": "5", 
            "review": "Amazing view. This was a beautiful view of the city. There are many cafes and bars where one can sit and admire the view. Not to be missed! Easily reached by the trams no 28 and 12."
        }, 
        {
            "index": 168, 
            "rating": "5", 
            "review": "Best View in Town!. Worth stopping by... Simply the best view in town (better than the Castelo de São Jorge). Suggest to go by at the end of the afternoon."
        }, 
        {
            "index": 169, 
            "rating": "3", 
            "review": "The Alcantara Miradoura is way better. It is not like this is a bad view of the city but nor is it the best! Chances are if you find yourself here it is on the way to or from a church or cathedral so the journey will not be a waste. However it views the castle and bay area from their least attractive and least photogenic angle."
        }, 
        {
            "index": 170, 
            "rating": "4", 
            "review": "Great Views. Worth the walk up for the views alone. Not quite up to views from the castle but this ones a freebie...."
        }, 
        {
            "index": 171, 
            "rating": "5", 
            "review": "Best thing in Lisbon are the Miradouros. This is the ribbon on the gift after climbing the whole Alfama neighbourhood. The view is absolutely fantastic and is one of my favourite miradouros, although they are all great! Prices in the cafes around are very reasonable and there is also a small minimarket in case you just want to bring your own picnic. I totally love this place as to stay there for a long time."
        }, 
        {
            "index": 172, 
            "rating": "5", 
            "review": "Unmissable. The most breathtaking Lisbon belvedere. Go at around 11am for a late breakfast, enjoy the views, make the most out of your camera with views over the Castle, downtown and the river meeting the bright blue sky. There's some restrooms in the square and a little cafe which may become very busy during lunch time/afternoon. Parking may also be tricky so just hop in tram 28 and hop off at Graca square. The belvedere is just 2 minutes away."
        }, 
        {
            "index": 173, 
            "rating": "5", 
            "review": "Nice view on the city. A great climbing walk up to this point on small streets in Alfama; a lovely place to rest for 15-30 min, a small caffe there with only 2 EUR for a cappuccino. Better go there in the first half of the day to have the sun shining from behind."
        }, 
        {
            "index": 174, 
            "rating": "5", 
            "review": "Stunning view. Really good end to a climb in the Alfama. Great views, a cafe and also a toilet. Very convenient to the tram 28 terminus, so easy to catch a tram back to the city centre."
        }, 
        {
            "index": 175, 
            "rating": "5", 
            "review": "Hard to find but stunning view. I decide to walk up here, map in hand but did not find a sign for the turn off. I gave up and turned back only to discover an easily visible sign on the return walk. I think most people take a tram or a tour, but I noticed other people walking with maps looking perplexed. You get a stunning view of Lisbon. I belive it's the highest point."
        }, 
        {
            "index": 176, 
            "rating": "5", 
            "review": "The best night view of Lisbon downtown. Here you can enjoy the best view over Lisbon downtown. The place is very quiet and has a small snack bar with a terrace perfect for warm summer nights."
        }, 
        {
            "index": 177, 
            "rating": "5", 
            "review": "Fantastic view of Lisbon !. If you visit Lisbon, you have to pass here, stop for a while and relax without notice time passing by. Great view to Lisbon, and Castle. You can see the Tejo river, the bridge and a fabulous sunset. It is easy to get there by Tram 28, and then walk either to Castelo or Martim Moniz to see typical Lisbon. On the Miradouro, there is a coffee place, so you can sit in the tree shadow."
        }, 
        {
            "index": 178, 
            "rating": "4", 
            "review": "A terrace over Lisbon. Wanting to get a panoramic sightseeing of Lisbon?Please choose a sunny day to climb one of the seven hills - your effort will be rewarded when you reach Miradouro da Graça (Graça' s belvedere).I am sure you will enjoy the 180° view, with the castle, churches' towers and the red roofs lying at your feet.On the right, you will find a woman's head in bronze, remembering Sophia de Mello Breyner Andresen, one of the most important Portuguese poetess, who passed away ten years ago and lived close to the belvedere."
        }, 
        {
            "index": 179, 
            "rating": "5", 
            "review": "One of Many of Lisbon's Lookouts. This lookout gives a nice view of St. George's Castle and the bridge. There is a nice cafe right in the atrium, so one can relax with a drink. There is a church right next door as well, and local artists selling their art. It's in the shade, so it's a nice place to get away from the sun and just enjoy the scenery"
        }, 
        {
            "index": 180, 
            "rating": "4", 
            "review": "fantastic view. from s.apollonia you can go to alfama ,this is the oldest neighbour of lisbon.you can have fantastic view,don't forget to move behind Pantheon ,from there you can have the nicest view of the city,it is like a picture"
        }, 
        {
            "index": 181, 
            "rating": "4", 
            "review": "Adore This Miradoura. Good place for a quick stop on the way to the castle. Breath deeply. Soak in the panorama. Free, and worth every penny."
        }, 
        {
            "index": 182, 
            "rating": "5", 
            "review": "What a view! . Perfectly located off the streets of the old town it's a bit of a walk up a hill but exploring the streets around it makes it worthwhile. There's a cafe at the top and the view will take your breath away. Worth a visit."
        }, 
        {
            "index": 183, 
            "rating": "5", 
            "review": "Beautiful view and cafeteria!. Very good viewing spot although not the best one. From here you can see views of Alfama, castle, river and Baixa. There is kiosk to get drinks from and the big church of Graca. For better view all you have to do is go up the hill at and check Senhora do Monte"
        }, 
        {
            "index": 184, 
            "rating": "4", 
            "review": "Close to the castle. Pleasant views of Alfama, castle, river and Baixa, kiosk with drinks on the square and the big church of Graca. But the better view is higher up the hill at Senhora do Monte"
        }, 
        {
            "index": 185, 
            "rating": "5", 
            "review": "Gorgeous. Best place to be, if you go to Santo Antonio celebration party.\nBy night its also beautiful :) Better go and check it out !"
        }, 
        {
            "index": 186, 
            "rating": "4", 
            "review": "Take some time on climbing up the hills. All these places are packed at night, enjoying a lively atmosphere (music, chatting, bars, etc) and the gorgeous Lisbone skyline ."
        }, 
        {
            "index": 187, 
            "rating": "5", 
            "review": "Nice view. This belvedere gives us a beautiful view of the city of Lisbon, and you can also get up there using one of the funiculars or just by walking up the steep hill, what is not too much."
        }, 
        {
            "index": 188, 
            "rating": "4", 
            "review": "Good View. If you visit Lisbon, you have to pass here.\nGreat view to Lisbon, and Castle.\nRecommend check this place, then go walk down to the downton."
        }, 
        {
            "index": 189, 
            "rating": "4", 
            "review": "Beautiful views!. Great place to stop for a while and relax, especially if it is one of those hots days in Lisbon. Definitely recommended"
        }, 
        {
            "index": 190, 
            "rating": "4", 
            "review": "Yes it is a nice. All the view points of Lisbon are worth visiting, either by chance or planned. There are some great views to be had."
        }, 
        {
            "index": 191, 
            "rating": "4", 
            "review": "nice view. nice view of the city, you can see the Tejo rivers, the bridge and a fabulous sunset. it is easy to get there by eletrico"
        }, 
        {
            "index": 192, 
            "rating": "5", 
            "review": "Great View. This is a great viewpoint of Lisbon. Go there by Tram 28, and then walk either to Castelo or Martim Moniz to see typical Lisbon. There is a small coffee-place there and you can enjoy a good galão with a pastel de nata, while seeing the buzzing city below your feet."
        }, 
        {
            "index": 193, 
            "rating": "5", 
            "review": "Great view point of the Eastern part of Lisbon. Just a short walk from the Castle, you can look over towards the Garca Church and Pantheon.\nGreat for photo opportunities in this area too as the tram 28 goes around here."
        }, 
        {
            "index": 194, 
            "rating": "5", 
            "review": "Impressive. Truly impressive view, worth the effort to climb up :) wait for the sunset, its very nice. a nice one hour there should be more than enough"
        }, 
        {
            "index": 195, 
            "rating": "4", 
            "review": "Another great view spot over Lisbon. It is another great spot with a wonderful view over Lisbon.\nIn this palce you have some places to sit and a coffee shop where you can buy something and sit down ... relaxing with a wonderful view over Lisbon. I bet you will be there 30m only looking... without notice time passing by..."
        }, 
        {
            "index": 196, 
            "rating": "5", 
            "review": "One of the best views over the city of Lisbon. Fantastic. One of the best views over the city of Lisbon. We were taken here by a tuktuk we hired during our stay."
        }, 
        {
            "index": 197, 
            "rating": "5", 
            "review": "Wonderful view!. When I was living for one year in Lisbon, I have beed there many times, it's a good spot while walking around charming Graca neighborhood, typical Portuguese one. On the Miradouro, there is a coffee place, so you can sit it the tree shadow and enjoy such a great view on Castelo and lovely Lisbon, especialy in the evening :), really worth to visit that place :))"
        }, 
        {
            "index": 198, 
            "rating": "5", 
            "review": "Stunning Lisbon views. If you go here you will have stunning views of Lisbon and the river. You can see all the new constructions made after the earthqauke in the XVIII century."
        }, 
        {
            "index": 199, 
            "rating": "5", 
            "review": "What a view!. One of the many great viewpoints in Lisbon. Great for day and day, offering stunning view of the city and its surrounding."
        }, 
        {
            "index": 200, 
            "rating": "5", 
            "review": "View is wow..... Well, after long walk it was perfect place to drink a coffe and have a pleasant stay with spectacular view on Lisboa, the river Tejo. Caffe when we were have good prices, it is for every recomendation to visit it."
        }, 
        {
            "index": 201, 
            "rating": "4", 
            "review": "beautiful view of the city. Single Lisbon's panorama not to be missed..\n..located in a typical neighborhood with odd life..\ngo there!!!"
        }, 
        {
            "index": 202, 
            "rating": "5", 
            "review": "The best view. I was there every night during my stay in Lisbon last week. It is mostly the Lisbon people who comes and sits. The view is just perfect and in the cafe they speak very good English. The church is also very nice and just behind it."
        }, 
        {
            "index": 203, 
            "rating": "5", 
            "review": "Fantastic view of Lisboa. Fantastic \"aerial\" view of the city centre, castle and river. Outdoor cafe. Gets crowded. Noisy in summer"
        }, 
        {
            "index": 204, 
            "rating": "5", 
            "review": "Marvelous view. An outdoor place with friendly atmosphere and extraordinary view. A good place to stop for a drink, tea or coffee..."
        }, 
        {
            "index": 205, 
            "rating": "4", 
            "review": "Beatiful place. The view from here over the Tejo and beatiful traditional houses of Lisbon is amazing...going here is also a good exercise as you have to go up a hill...but it totally worth it."
        }, 
        {
            "index": 206, 
            "rating": "5", 
            "review": "Amazing view. Amazing view, one of the best in Lisbon. Best to visit during sunset, but this is true for every one of the other Miradouros."
        }, 
        {
            "index": 207, 
            "rating": "5", 
            "review": "beautiful view. amazing view of the city,in a vey nice neighbourhood…there is a small coffee place if you want to have a coffee or a drink but also lots of benches use to sit and admire the view!!!a must place in Lisbon!!"
        }, 
        {
            "index": 208, 
            "rating": "5", 
            "review": "Surreal Views. I visited this beautiful miradoura one evening right before sunset and was left speechless. It was a good decent hike/workout to make our way up to the area, but well worth it. Around sunset the buildings and bridges look so amazing. My favorite view of Lisbon!"
        }, 
        {
            "index": 209, 
            "rating": "5", 
            "review": "Nice view of the city. Out of the various viewpoints in town, this is my favorite. There's some trees around, a little cafe area and just a gorgeous view of Lisbon and the April 25 bridge."
        }, 
        {
            "index": 210, 
            "rating": "5", 
            "review": "Come early, it gets crowded. Great spot to enjoy the sunset. Has a little kiosk with drinks and even food. Sit, chill and enjoy! We had a wonderful sunset with around 200 people in front of a historic church."
        }, 
        {
            "index": 211, 
            "rating": "4", 
            "review": "View of the City. Because of this viewpoint's position it is mainly a view of the city, but all the same it is a lovely view. It is nice early in the morning when few people are about or late at night to see the city lit up."
        }, 
        {
            "index": 212, 
            "rating": "4", 
            "review": "very nice spot. Very nice spot to take a break and have a nice glass of cold wine.\nBeautiful view of the downton of Lisbon."
        }, 
        {
            "index": 213, 
            "rating": "5", 
            "review": "Really good view. Especially at night, a small shop opens for drinks. This is a real romantic spot for local people. They know where is beautiful."
        }, 
        {
            "index": 214, 
            "rating": "5", 
            "review": "Great view of the city. Another great Miradoura to enjoy the lisbon skyline. This one id less crowded than alancantra due to less tourists. You can grab a beer, some local snacks and enjoy a great view of the city center and the river"
        }, 
        {
            "index": 215, 
            "rating": "4", 
            "review": "Nice view over Lisbon. You should take the yellow tram to reach this place. Very nice view and excellent for those who want to take pictures"
        }, 
        {
            "index": 216, 
            "rating": "5", 
            "review": "Lisbon for your heart!!. after you see Lisbon from here, you can feel the real Lisbon on your heart!! the view is incredible nice, the river, the castle...Lisbon for you!! for ever!!"
        }, 
        {
            "index": 217, 
            "rating": "5", 
            "review": "great miradouro in amazing Lisboa. great miradouro with amazing view on the city. it is amazing to be there and just spend some times watching the pure beauty of this wonderful city. the miradouros are places to go and this is one of my favourites!"
        }, 
        {
            "index": 218, 
            "rating": "5", 
            "review": "Unbeatable views. I agree with other reviews - if there is one place to take in the views over Lisbon then this is it."
        }, 
        {
            "index": 219, 
            "rating": "5", 
            "review": "great place to have a beer and enjoy the amazing view. Considering viewpoints of the city, Lisbon is blessed with plenty a place to relax and enjoy the view. Graça has a nice cafe with terrace where you can sit and have a beer. Service is a bit lacking though..."
        }, 
        {
            "index": 220, 
            "rating": "5", 
            "review": "There is no such view in the entire world..... Amazing....gorgeous place....full of history, tradition and view. In a very ancient quarter, full of churches, restaurants with pedigree and very good wine bars. A must, if you can spare a couple of hours to walk around the neighborhood."
        }, 
        {
            "index": 221, 
            "rating": "4", 
            "review": "Romantic view. Its one of the best views in Lisbon, you can see the bridge, the castle, the river and the whole city (red roofs everywhere). I usually go there once a week."
        }, 
        {
            "index": 222, 
            "rating": "5", 
            "review": "Great view. A great view over the historic center, the river and beyond!\nThe sunset from here is amazing and I recommend that no one leaves Lisbon without seeing it!"
        }, 
        {
            "index": 223, 
            "rating": "4", 
            "review": "have a drink among locals. This Miradouro is situated in the middle of a nice neighbourhood where locals meet and have drinks on the little terrace with great view."
        }, 
        {
            "index": 224, 
            "rating": "4", 
            "review": "Nice city view. Easily accessible by foot from the city center. Can take the funicular for fun but it is not necessary. Good place to eat an ice cream cone while looking at the sea of orange roofs."
        }, 
        {
            "index": 225, 
            "rating": "5", 
            "review": "Great view. A great view to the historic center of the city. I can see the river, the bridge and the park. The walk up it's quite difficult."
        }, 
        {
            "index": 226, 
            "rating": "5", 
            "review": "I wish I could there everyday. Not so easy to find and depending on the way you choose you'll probably cross some strange neighborhoods (safe although), but it absolutely word it! The view is amazing, the nearby streets are lovely, large houses with beautiful flowers dropping from the balconies and down the street, a wonderful river view. I highly recommend it!"
        }, 
        {
            "index": 227, 
            "rating": "5", 
            "review": "Great view. We had dinner here and the view was breathtaking!\nIt is possible to see all the center, the bridge, the river...\nThis is a must go to all visitors."
        }, 
        {
            "index": 228, 
            "rating": "5", 
            "review": "Lisbon at your feet. Lisbon is a city with many \"miradouros\", beautiful places where you can see and discover the bright side of this capital. This is one you must see!"
        }, 
        {
            "index": 229, 
            "rating": "4", 
            "review": "Great views over Lisbon. Arguably the best of the Miradours, this gives wonderful views of the Castle de Sao Jorge, central Lisbon and the San Francisco Bridge."
        }, 
        {
            "index": 230, 
            "rating": "4", 
            "review": "View. This romantic terrace overlooking the city is a popular hangout for young groups thanks to its kiosk café and fantastic views that go from the castle down to the river. Although it's known as Miradouro da Graça, the official name is Miradouro Sophia de Mello Breyner Andresen, a poet who died in 2004 and who spent many of her days admiring Lisbon from this spot. One of her poems is seen on a wall facing her bust which stands looking out to the city. Very relaxing , do not miss it when visiting Lisbon."
        }, 
        {
            "index": 231, 
            "rating": "5", 
            "review": "Not as good as Miradouro da Nossa Senhora do Monte. There is nothing wrong with this viewpoint. Its just not as spectacular a view as the near by Miradouro da Nossa Senhora do Monte. If your 28 tram terminates at Graca, just go across the street past the retaining wall and walk down the street and around the corner. The viewpoint will be ahead. Up close views of the Castle. You can see part of the 25 de Abril Bridge but not the Cristo Rei monument. When I visited there was a cafe at the viewpoint."
        }, 
        {
            "index": 232, 
            "rating": "5", 
            "review": "Great view, relax and drink.. Another great place to admire the famous views of Lisboa and enjoy a drink (coffee or superbock) and a snack. Do not miss."
        }, 
        {
            "index": 233, 
            "rating": "5", 
            "review": "Fantastic view. Presently, the elevator it is under renovation therefore you can't admire the external part but the view from the top is great on Carmelo ruins and Lisbon center.Get the daily metro fare to save money!!!"
        }, 
        {
            "index": 234, 
            "rating": "3", 
            "review": "Like the mirador Senhora do Monte but not as good. Nice panoramic view of Lisbon, on the hill opposed to the Castle Sao Jorge.compared to the other Mirador (Miradouro da Senhora do Monte), this one has a less fantastic view and more tourists because it's more easily accessible by bus/tram and closer to other tourist attractions.if you go there by public transport, push a bit further by foot to the other mirador, it's worth it. both are free anyway but i prefered the Senhora do Monte 10times."
        }, 
        {
            "index": 235, 
            "rating": "4", 
            "review": "Great views with drinks, nice church. The Miradouro de Graca offers great views and also has a nice terrace on which you can enjoy those views with a drink in the shade of beautiful trees. The Igleja da Graca church is right there and also worth a visit. Can be reached easily with the famous tram 28, Miradouro da Graca stop."
        }, 
        {
            "index": 236, 
            "rating": "5", 
            "review": "Lisbon and Tagus river under your feet. A fantastic view over the old Lisbon roofs ending on the river side in front of Lisbon. An excellent bar/restaurant there, where you can finnish the day having a light meal with a glace of portuguese wine (white, red or green, does'nt matter)."
        }, 
        {
            "index": 237, 
            "rating": "5", 
            "review": "Best spot for watching the sun set!. Spent a late afternoon drinking beers and watching the sun set. Truly remarkable. A fun busy spot to people watch and take in the sights."
        }, 
        {
            "index": 238, 
            "rating": "5", 
            "review": "Very peaceful in the morning. We visited the church as well as the Miradoura in the morning, just shortly after 10am. There weren't many tourists there yet, so we had a splendidly peaceful view over the city in the morning. Additionally there is a small park right next to the benches, which invites to stay and rest for a while."
        }, 
        {
            "index": 239, 
            "rating": "5", 
            "review": "Great view from the city!. The church and the square are beautiful. Stop by there to appreciate the city view. Great place to have a beer or coffee and watch the sunset!"
        }, 
        {
            "index": 240, 
            "rating": "4", 
            "review": "Stunning city views. Take Tram 12 and avoid the queue for 'iconic' Tram 28 - they take the same route up to Alfama.... and it is worth getting up there."
        }, 
        {
            "index": 241, 
            "rating": "5", 
            "review": "Best view on Lisbon. Amazing view, sometimes windy. The bar is OK -- not oustanding (service takes to long). But it worths from the amazing view."
        }, 
        {
            "index": 242, 
            "rating": "5", 
            "review": "See Lisbon through one of the seven hills. Lisbon is famous for their seven hills, and here you can have a breathtaking view over the city, and it's free so... you don't have a reason to pay it a visit!"
        }, 
        {
            "index": 243, 
            "rating": "4", 
            "review": "One of the best photo spots in Lisbon. From this spot you have a lot of nice places to take photos of \"Old Lisbon\".\nBesides, you also have here some good coffee houses where you can just relax"
        }, 
        {
            "index": 244, 
            "rating": "4", 
            "review": "View!. This spot is one of the better places for a good view in Lisbon. Here you have the fortress and downtown Lisbon and also bairro alto at your view. Benches, tables and some stalls with the basics as drinkgs and snacks is also here. Trees make this a good spot in the shade when the sun is burning in the summer months."
        }, 
        {
            "index": 245, 
            "rating": "5", 
            "review": "The best. In my opinion, the sea view in Lisbon is not particularly nice, as the city coast is covered by the port. However, the city view is great. and this miradouro gives the best one."
        }, 
        {
            "index": 246, 
            "rating": "4", 
            "review": "Best views on Lisbon. Strolling through Alfama this is a nice way to round up the visit and contemplate the ever changing Lisbon light and building colors."
        }, 
        {
            "index": 247, 
            "rating": "5", 
            "review": "End your tram 28 ride here!. The gentleman at the tourist office recommended this as a stop for the tram 28 ride, and it was a perfect stop for us to end the tram ride to spend time admiring the evening view of Lisbon. You can see the castle from here as well as the interesting rooftop of the houses in Alfama. From here a slow decend will take you through the streets of Alfama passing restaurants, shops and the St Anthony Church and Lisbon Cathedral. A nice way to explore Lisbon."
        }, 
        {
            "index": 248, 
            "rating": "4", 
            "review": "nice view. It is easier to get there than to the Miradoura da Senhora do Monte, the view is a little bit less breathtaking but still beautiful."
        }, 
        {
            "index": 249, 
            "rating": "3", 
            "review": "Nice view on top of the city - for free!. Wonderful place, with a very nice view over the city.Also very nice, the it is free.Good place to have a picnic."
        }, 
        {
            "index": 250, 
            "rating": "4", 
            "review": "Look out at the Castle and the suckers who paid for a similar view. The insider option for travellers who want to avoid the castle and its rip-off prices. Great little terrace and park nearby with lots of local colour nearby. Easily accessed with Tram 28."
        }, 
        {
            "index": 251, 
            "rating": "5", 
            "review": "never thought that Lisbon had such lovely view. This was the things that surprised me a lot, I never thought that Lisbon had such lovely view. In a sunny day is simply stunning."
        }, 
        {
            "index": 252, 
            "rating": "5", 
            "review": "Nice afternoon there. Go on a summer/spring late afternoon for some drinks. Although the staff serving at those kioskes is a bit unfriendly, the view counterbalances it! As it is high on the top os a hill, we went by taxi (just €4 from Praça dos Restauradores) ."
        }, 
        {
            "index": 253, 
            "rating": "4", 
            "review": "Worth the walk up the hill. Nothing more than a cafe (coffee, beers, wine) with a marvelous overlook of Lisbon from Graça. Sit, drink, and enjoy the view."
        }, 
        {
            "index": 254, 
            "rating": "4", 
            "review": "gorgeous views of the city. Fantastic view and worth a visit. Take time to savor a\ncoffee and walk back into the city.A favorite spot for scenic views."
        }, 
        {
            "index": 255, 
            "rating": "4", 
            "review": "Igreja da Graca square?. The church is nice but outside the church ..take a peek of Lisbon...it is awesome....the best picture one could get of Lisbon."
        }, 
        {
            "index": 256, 
            "rating": "5", 
            "review": "beautiful Church. very beautiful church, easily reachable. it is better to come early and not on weekends, since very many visitors this goal. Tourist groups. In the Church there will be some very loud."
        }, 
        {
            "index": 257, 
            "rating": "5", 
            "review": "Astounding Views of Lisbon!. This is a great place to go to see some of the most beautiful panoramic views of Lisbon. From here, you can see not only the rooftops of many of the buildings, but also the most famous bridge in Lisbon. This is a great place to spend time really admiring the city and have a nice walk."
        }, 
        {
            "index": 258, 
            "rating": "5", 
            "review": "See the roof tops while listening to street musicians. This is a great place to take photos of downtown and its root tops. But it's also a great place to relax listening to street musicians and eating an ice cream from a cart vendor. Tourists come here and although you can contemplate the diversity of Lisbon's 1000 years of visible architecture all by yourself, you'll have the opportunity to discuss it with a very diverse crowd. Enjoy"
        }, 
        {
            "index": 259, 
            "rating": "5", 
            "review": "Spectacular views. Lovely place to sit and enjoy a drink whilst watching the sun set over beautiful lisboa. Drinks a bit expensive but worth the extra."
        }, 
        {
            "index": 260, 
            "rating": "4", 
            "review": "Nice place to take a break.. A 10min walk from the Castle of St-Jorge, many people confuse Miradoura de Graca with Miradouro da Senhora do Monte (a few minutes away).Although “do Monte” probably has better and wider views of the city, the views are still very good from “Graca” and I find it to be quieter and more local. Pack a small lunch and it’s a great place to grab a bench and picnic. There is also a small café with tables and bathrooms nearby.Overall, my favourite still remains Miradouro de São Pedro de Alcantara."
        }, 
        {
            "index": 261, 
            "rating": "4", 
            "review": "Great views and nice terrace cafe. We decided to start our visit to Lisbon with a trip to Miradoura Da Graca.\nThe view from the terrace is excellent with views over most of the city. So great for photographers.\nA nice little kiosk/cafe serves drinks there so you can admire the view."
        }, 
        {
            "index": 262, 
            "rating": "5", 
            "review": "Views to die for. A busy area, but well worth it. We got lucky and bought here by our guide, as it's a steep climb. I an tell you it's well worth it."
        }, 
        {
            "index": 263, 
            "rating": "4", 
            "review": "Great place to relax, meet friends and enjoy the view. Simple terrace with a fantastic view of Lisbon. Tends to get very full, both with locals and foreigners) and you may have to wait to get a table, but it is worth it! A 10 min walk from the Miradouro de Santa Luzia or the Feira da Ladra (flee market), and 15 from the castle."
        }, 
        {
            "index": 264, 
            "rating": "5", 
            "review": "Get 'The View' For Free. It's a bit of an uphill climb to get there but it's certainly worth it. Have a drink in the small cafe and take in the view."
        }, 
        {
            "index": 265, 
            "rating": "5", 
            "review": "Fantastic views. The views are beautiful. Its up some steep streets but worth it. Sit in the little open café/bar and soak in Lisbon."
        }, 
        {
            "index": 266, 
            "rating": "4", 
            "review": "Fantastic viewpoint. The views from here make the trip up the hill totally worth it. Some of the best photos of our trip were taken here. Must see!"
        }, 
        {
            "index": 267, 
            "rating": "5", 
            "review": "This is the place from my heart.. This is really worth visit. It has an amazing view over Lisbon, you can see the Castle, downtown, the River, beautiful light.Save it for a perfect ending of a perfect summer afternoon. Bring someone special with you. This a view of a life time.Also has a cafe with nice music, where you can relax after a day of seightseeing. You can reach this place on foot. Not easy to park. You can also reach it by tram 28 and leaving in Largo da Graça, and walk for 5 minutes."
        }, 
        {
            "index": 268, 
            "rating": "5", 
            "review": "Best Viewpoint of Lisbon. This Miradouro is a bit far from the main turistic area of Lisbon, but it is totally worth the walk (which is almost a climb)! The views from it are totally breath taking, since you can see Baixa, Chiado, Sao Jorge Castle and even 25 de Abril bridge! Beside the viewpoint you'll find small bars that sell food and drinks for a reasonable price."
        }, 
        {
            "index": 269, 
            "rating": "4", 
            "review": "Panoramic view. We visited this Miradoura on two separate occasions. The first time during the day and the views were impressive, the second time at night and the views and night sky were amazing. We did not eat at the restaurant attached to the Miradoura so cannot comment about the food and drinks there, but we can say that the views are stunning and that you should take time to go and visit; you won’t be disappointed."
        }, 
        {
            "index": 270, 
            "rating": "5", 
            "review": "one of the best views of Lisbon. if you want know Lisbon better, go there . Central, easy to get and near a famouse Bairro . Take the the elavator/tramway to get there"
        }, 
        {
            "index": 271, 
            "rating": "4", 
            "review": "Take your walking boots to LIsbon. We took the tram up to Graca to enjoy yet another lovely view over the city. It was nice to see Lisbon from several different view points. All free except for the ancient tram ride admire the views and perhaps have something to eat or drink. Lisbon is very short on public toilets, so be warned."
        }, 
        {
            "index": 272, 
            "rating": "5", 
            "review": "Splendid Overlook. Miradoura de Graça offers visitors stunning views of the wonderfully historic city of Lisbon that are unrivaled by other overlooks. Lovers of all ages, photographers, and historians alike will enjoy the unique experience provided by Miradoura de Graça. For starters, the overlook provides 180 degree panoramic views of the city itself, including the Carmo Church Ruins (Igreja do Carmo), the Castle of Saint George (Castelo de São Jorge) and even the 25th of April Bridge, which is Lisbon's version of the famous Golden Gate Bridge in San Francisco. The views by day are stunning, but by night they are simply breathtaking. A lovely café, located just atop this beautiful vista, provides refreshments and beverages for the weary traveler. For the slightly more adventuresome, there are a number of local cafés within the immediate vicinity that provide authentic dining experiences that are not easily forgotten. Lisbon has some of the best food and service in the world, so don't miss the opportunity to experience it firsthand. Portuguese food is a treat that is a joy unto itself.For photographers, the best time to visit is during the late afternoon until an hour past sunset. Bring your tripod and brush up on your long-exposure techniques. The best images can be taken just after sunset when the lights of the city become visible and the sky turns sapphire blue. To catch sunstars from all the lights, set your F-Stop to F16 or F11 and use a long exposure of at least 30 seconds. For best results, consult your camera owner's manual.For lovers, come early in the day and enjoy a nice lunch at the café or grab a bite at any of the local delis. If you really want to get into the spirit of things though, pack a picnic lunch and bring your favorite bottle of wine. If you prefer, Beer and wine are also available at the café kiosk. Then, sit back and take in the wonderful views together. This is an ideal venue for one-of-a-kind couples photos, and together you can leisurely explore the adjacent pocket park, or the Igreja da Graça – a beautiful 18th century church. Of course, you will want to stick around for sunset, which can be stunning from this vantage point and is also best time to experience the views together. Miradoura de Graça offers the best vantage point in the city to see and understand how all the districts fit together. Regardless of what type of traveler you are, you will not want to miss out on one of the best attractions in all of Lisbon. The best part? This unforgettable overlook and the astonishing views it affords are free, proving that the best things in life don't have to cost money. So, as you plan your Lisbon adventure, be sure to include a visit to Miradoura de Graça; you will not be disappointed."
        }, 
        {
            "index": 273, 
            "rating": "5", 
            "review": "Now this is a view!. Hop off the 28 tram here for a great view and some great photo opportunities. Located just a short walk away is the castle. Also well worth a visit."
        }, 
        {
            "index": 274, 
            "rating": "4", 
            "review": "Great place for a view of Lisbon. We took the 28 tram up from the main square and got off at the big church.You get a really great view of the city from here and some great panoramic shots. It looks out over the castle, the city and the suspension bridge in the distance.We popped into the church afterwards which was very quite and very nice."
        }, 
        {
            "index": 275, 
            "rating": "5", 
            "review": "One of the best Miradoura in Lisbon. Nice viewpoint of city of Lisbon - proibably the best one. You can sit in cafe outdoor seating and drink in an atmosphere of Lisbon. Close to tram station Graca (tram nr 28). We visited it in late evening and night view was amazing - Castelo de São Jorge and illuminated 25th of April Bridge close together. If I return to Lisbon I would definitely go there again."
        }, 
        {
            "index": 276, 
            "rating": "4", 
            "review": "The greatest light in Lisbon. The restaurant that serves it it's not the best in town, but you'll have a great end of the day in there. It's my favorite spot during Summer time, specially because it has the best view above Lisbon."
        }, 
        {
            "index": 277, 
            "rating": "4", 
            "review": "Best Miradoura. We visited 4 Miradouras in Lisbon but this was the only one we went back to. The sunset was amazing and the fact you could sit at a table with a glass of wine made it all the better, Wonderful views!!"
        }, 
        {
            "index": 278, 
            "rating": "5", 
            "review": "Another Lovely View Over Lisbon!. I took the tram up to Graca to enjoy yet another lovely view over the city. It was nice to see Lisbon from several different vantage points, bring you book admire the view and perhaps have a drink at the small cafe. It's a nice stop if you have the time, but if you only have a few days in Lisbon head to which ever miradour is closest to where you are staying."
        }, 
        {
            "index": 279, 
            "rating": "5", 
            "review": "Best at night. One of the most beatiful viewpoints in the city. Got there at sunset and stay a while until lights start popping up here and there throughout the city."
        }, 
        {
            "index": 280, 
            "rating": "5", 
            "review": "Go at sunset!. We visited this lookout as part of a guided walking tour. This lookout is in Alfama. The view is beautiful at sunset. We went to a local restaurant after sunset and enjoyed a delicious meal of local cuisine, at an incredibly cheap price. The atmosphere at night is great, walking back through the quaint little streets, seeing the old town at night."
        }, 
        {
            "index": 281, 
            "rating": "4", 
            "review": "Good view but litter strewn.. The view is better from the castle but as that costs 7.50 Euros to enter the miradoura is a cheaper alternative but quite a pull up.\nThe cafe area had lots of litter."
        }, 
        {
            "index": 282, 
            "rating": "5", 
            "review": "Beautiful View. Takes a little effort (uphill climb) but well worth it, even on a foggy day! My husband and I went up on a foggy morning and really appreciated the 180-degree view of Lisbon and the Tagus River. Would certainly recommend to others looking for a great view/photos."
        }, 
        {
            "index": 283, 
            "rating": "5", 
            "review": "Get the whole view of Lisbon and river Tejo. Just in the way to a lot of historic places, you go by tram and you make a stop just to see a magnificent panorama. Ask the driver to tell you when you have to leave the tram or else you lose the stop."
        }, 
        {
            "index": 284, 
            "rating": "5", 
            "review": "Beautiful overview, but tricky to get there.. Please see my review of the Miradouro da Senhora do Monte for this review, got them mixed up. By the way, it is the Trolley or Tram 28, not 29, that takes you up there. A great view but hard to get to by car or to find parking."
        }, 
        {
            "index": 285, 
            "rating": "5", 
            "review": "Wonderful view over Lisbon. I was here on daytime and you have a nice view, but at sunset wonderful. Undescribele. Take a glas of wine (or beer) and enjoy it. Pretty cool"
        }, 
        {
            "index": 286, 
            "rating": "5", 
            "review": "An amazing view!. One of the best spots if you want to have a wonderful view of Lisbon! Simply great! And placed in a tipycal neighbourhood, close to national monuments like the Monastery of São Vicente de Fora and the National Pantheon. And of course, the Church of Graça!"
        }, 
        {
            "index": 287, 
            "rating": "5", 
            "review": "My favorite sightseeing spot in Lisbon!. You must come here.Oh... and bring your camera!The night view is spectacular.You can see so many monuments and attractions here that you will not regret it.There's a couple of bars with outdoors seating, so have a beer while you enjoy the view!It can get a bit chilly in the winter at night, but bring your jacket and you'll be fine."
        }, 
        {
            "index": 288, 
            "rating": "5", 
            "review": "Fantastic point of view. Enjoy the fantastic view with a good beer. Observation point for the bridge and the castle. U must go there if u go to Lisbon"
        }
    ]
}