{
    "category": "Lisbon", 
    "entity": "Miradouro-Sao-Pedro-de-Alcantara", 
    "avg_rating_stars": 4.584055459272097, 
    "review_count": 577, 
    "rating_stats": {
        "poor": 1, 
        "average": 26, 
        "terrible": 1, 
        "very_good": 181, 
        "excellent": 368
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "Views From A New \"Level\". The stairs from near Rossario station lead you to another world of gorgeous views, shops and restaurants. Nothing more to say.\nIf the steps aren't your thing, take the funicular up and stroll down through the shops and cafes."
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "Great views and beautiful area of town. This is a great place to stop after visiting the nearby Sao Roque. The panoramas are fabulous and you get a fantastic view of Castelo de Sao Jorge on the opposite hill. There is plenty of benches to sit down and relax, beautiful large trees and shade, a pretty fountain, a garden below, numerous kiosk vending interesting crafts, overall it is a great place to visit and a must-do while in Lisbon."
        }, 
        {
            "index": 3, 
            "rating": "4", 
            "review": "Beautiful spot to view the Sao Jorge Castle. While the Gloria Elevador fills up quickly and is now mainly a tourist attraction, it is worth tramping up the steep hillside to visit this lovely spot overlooking the castle and bairros (neighbourhoods) near the Tejo River."
        }, 
        {
            "index": 4, 
            "rating": "5", 
            "review": "Absolutely stunning views. We walked up to this Miradouro a couple of times whilst we were in Lisbon. As well as the amazing views there is a little kiosk and a big square where you can sit and watch the world go by. There's also some stairs which take you down to a little park and another kiosk. For me this is the best view point in Lisbon."
        }, 
        {
            "index": 5, 
            "rating": "4", 
            "review": "walking. One fantastic sightseeing in Lisbon i recommend, and its nearby downtown and all needs, museums, restaurants etc"
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "Great views. Great Views and a nice place to rest and take in Lisbon. There are vendors so you can buy refreshments or buy some local trinkets. Across the street is the Port Wine Museum and down this street a couple of blocks is the San Roche Church"
        }, 
        {
            "index": 7, 
            "rating": "5", 
            "review": "Relax evening. Great views over the East/North and South side of Lisbon, with sometimes with ambience music provided by the numerous players that come and join the wonderful weather."
        }, 
        {
            "index": 8, 
            "rating": "4", 
            "review": "Great views. From this Miradouro there are terrific views of the Baixa and the Alfama districts. The views are particularly beautiful towards dusk, because of the light. There is no charge. This is merely a nice place to enjoy the views. There are plenty of cafes and bars nearby. The Elevador da Gloria is next to it. I cannot imagine anyone visiting the Bairro Alto or Chiado and not going there for a look."
        }, 
        {
            "index": 9, 
            "rating": "5", 
            "review": "So beautiful..... Wandering through Bairro Alto we came across this stunning place. The views of the city are truly fantastic and with the tree-lined park with fountain, a great place to stop and relax."
        }, 
        {
            "index": 10, 
            "rating": "5", 
            "review": "AN EXCELLENT SPOT FOR ROMANTIC WALKS AND GREAT PICTURES!. One of the best 'miradouros' of amazing Lisbon! you can approach it by foot or tram and the view (Alfama, Castelo Sao Jorge etc) from here is simply breathtaking especially during the sunset!! there are also nice musicians and great bar/restaurants around.... highly recommended!!"
        }, 
        {
            "index": 11, 
            "rating": "4", 
            "review": "Fantastic view. From here you get a fantastic view of the city including the cathedral and the castle. It is also very easy to reach from the Avenida da Liberade by taking the Elevador de Gloria rather than face a steep climb."
        }, 
        {
            "index": 12, 
            "rating": "5", 
            "review": "Beautiful place, great atmosphere. We stayed in the vicinity of Miradouro Sao Pedro de Alcantara and had the opportunity to stop and enjoy it a few times during our visit. Our last day in Lisbon was Saturday, and we spent a few hours hanging out there. There was live music, food and drinks of all kinds, beautiful view from Miradouro and beautiful people of Lisbon. Enjoed tremendously twilight time at Miradouro Sao Pedro de Alcantara!"
        }, 
        {
            "index": 13, 
            "rating": "4", 
            "review": "Beatiful views from a beautiful park. Miradouro Sao Pedro de Alcantara sits perhaps 100 yards north of the top of Elevador de Gloria. We missed it when we exited the elevador to the left, but retraced our tracks when we realized we'd missed it.The first thing one notices about this park is the views of the city, a virtual 180+ degree view looking eastward. The most dominant view is of Castelo de Sao Jorge, towering high over the Alfama and the rest of the town. This is also the perfect spot to gaze over the countless red tile rooftops covering most of the city.So glad we didn't miss this park!"
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "Amazing views of Lisbon!. Lisbon has a lot of places with great views (normal, with so many hills) called \"miradouros\", but this one is truly amazing. It is not only that it offers great views towards the Castle, the river and the city, but it is also close to Bairro Alto and Chiado and it is located in a wonderful park with natural shadow (from the many trees), 2 cafes where you can rest plus many benches where you can sit and enjoy the view."
        }, 
        {
            "index": 15, 
            "rating": "4", 
            "review": "A moment of enjoyment. Beautiful scene to Lisbon. But that is only the start. A pleasant living room with a small market place, benches to sit down, tables to enjoy your food with sangria, or just sangria.. Tourists and locals, a place worth to spend some time with a good comapnion."
        }, 
        {
            "index": 16, 
            "rating": "5", 
            "review": "Excepcional view !. Don't miss this! One of the best views towards the castle and the old neighborhood close by. Two cafeterias also allow you to drink something while you enjoy the view...Recommended!"
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "Take the tram!. You can grab the Ascensor da Gloria instead of walking up to this lookout point. Nice view from the top."
        }, 
        {
            "index": 18, 
            "rating": "4", 
            "review": "Amazing view over the city. This is a really nice little park with an amazing view of the old city. There are a few shops too, but other than that there isn't much there except loads of tourists. It's mostly nice to pass by it on a walk through the neighbourhood."
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "One of my best spots in Lisbon. This place was one of my preferred spots in Lisbon. Amazing view on the city. Artists playing nice music. Painters drawing nice pieces you can take back home for your house or as gifts and souvenirs. You can grab a sandwich or a drink from shops nearby and enjoy it in this Miradouro. You can enjoy the sunset and then go down walking to Bairro Alto for the night"
        }, 
        {
            "index": 20, 
            "rating": "5", 
            "review": "Great view !. It is one of the best view points (miradouros) in lisbon. Definitely worth a detour to explore better!"
        }, 
        {
            "index": 21, 
            "rating": "5", 
            "review": "Beautiful view. So nice and sweet place. Wonderful view of the Lisbon. I can't be objective here, as all of the viewpoints are amazing, simply it is amazing city and no matter where are you looking it from it is still wonderful.\nYou will not skip this place as it is a part of many tours, and is near the center."
        }, 
        {
            "index": 22, 
            "rating": "5", 
            "review": "Stunning view to the city center. A very pleasant place having a lot of trees, benches, a fountain, café, gift kiosks and a great spectacular view to the city center which lies underneath. The place has two terraces: the upper one having all the above and with the most of visitors, and the lower one, more quiet. I would recommend to visit the lower one after 5 PM, when there is a natural shade from the wall, or after sunset – the view to the night Lisbon is also great! It is situated in the old historical part of the city, where I advise to get lost in, and just to stroll all the narrow streets."
        }, 
        {
            "index": 23, 
            "rating": "5", 
            "review": "A sunset delight. Yes, although the view is looking at the opposite side of the sunset, what you get is Lisbon and the castle hill bathed in the sunset reddish light, it´s like a fake scenario,"
        }, 
        {
            "index": 24, 
            "rating": "4", 
            "review": "beautiful views of Castelo. Up Chiado and before the beautiful Principe Real square there is this lovely garden with beautigul views on another hill and district in Lisbon: Castelo. Very quiet before, it has been unfortunately much spoiled by hords of (often very drunk) people playing very loud music or making much much noise. Nevertheless, still plenty of charm"
        }, 
        {
            "index": 25, 
            "rating": "4", 
            "review": "Coffee or drinks with a view!!. It's a unique view over Lisbon. Although this is S. Pedro's Garden only Café (for coffee, tea, drinks and small meals, snacks), it never closes (Summer or Winter - when they even borough blankets to costumers...) - so you shouldn't ever miss the experience."
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "Picturesque. A picturesque, elevated park built in two terraces. it has a lake, garden, fountain, sculptures and so on and you get a great panoramic view of Lisbon, including the castle. I recommend to grab a snack and some sangria and sit in the park and enjoy the view ;)"
        }, 
        {
            "index": 27, 
            "rating": "5", 
            "review": "Beautiful panoramic view of Lisbon. I went at sunset and although the sun sets behind the viewpoint, the city looks beautiful at dusk. You get a great panoramic view of Lisbon including São Jorge castle. At dusk the lights come on across the city making it even more beautiful. There are are steps leading down to a small square in front with and you can enjoy drinks with the view at the cafe. We sat and watched the sunset before going to dinner in Bairro Alto. Recommend taking the funicular up as it is a steep climb."
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "Stunning view!. Beautiful elevated square with stunning views, especially at night! Then it is full of people enjoying a few drinks and the view! It's worth the hike up the hill!"
        }, 
        {
            "index": 29, 
            "rating": "5", 
            "review": "Best view of Lisbon. This is our favourite place to sit looking at the view, have a drink and listen to the buskers. If you want to take some great pictures of the whole of Lisbon get the funicular or the elevator up to this place fabulous."
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Super view to the white city. It has an amazing view, a litlle coffee shop with a terrace where you can enjoy a good coffee or tea, or even eat something, you have \"electrico\" that goes up and down to \"Restauradores\" and in there, you can enjoy some street art along the way."
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "great way to save your legs. I took the Gloria funicular up to Miradouro Sao Pedro de Alcantara and had a wonderful view from the Square - Saved the legs as quite a steep climb - enjoyed a cup of coffee too"
        }, 
        {
            "index": 32, 
            "rating": "4", 
            "review": "Great view of the city. If you've already been to Sao Jorge castle here is the place to look at it from another hill top! Best place to take panoramic photos of Lisbon and maybe a drink watching the city unfold."
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "Lovely place to enjoy the view . Stayed at lookout hostel close by and went here many times. Great for the view, have a drink and listen to street musicians. Loved it!"
        }, 
        {
            "index": 34, 
            "rating": "5", 
            "review": "Probably the best view of Lisbon. If you're wandering around the Bairro Alto and Chiado areas, you can't miss this spot, as it provides what is, arguably, the best views of the city"
        }, 
        {
            "index": 35, 
            "rating": "4", 
            "review": "Nice views. This is a great spot to view the city from. You can see the castle and cathedral next to the river and the high points and valleys of Lisbon. One of the best views in the city."
        }, 
        {
            "index": 36, 
            "rating": "5", 
            "review": "Perfect place to relax. I go to Lisbon often and no trip is complete without an afternoon glass of wine at this Miradouro. Lovely, peaceful view with a nice little cafe."
        }, 
        {
            "index": 37, 
            "rating": "5", 
            "review": "Loved it! . Was staying in Lookout Lisbon! Hostel (1 min walk away) so I am always at this miradouro when I have the time. Was never sick of the beautiful view it offers."
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "beautiful view. my favourite spot to relax, enjoy the view and there's a little café to get some coffee while enjoying the amazing view over Lisbon"
        }, 
        {
            "index": 39, 
            "rating": "4", 
            "review": "Great views. Worth the walk to enjoy the spectacular views from this viewpoint, There are bars and restaurants in the area and the good news it is downhill at the end. Nice picture opportunities over the districts with the contrasting hills."
        }, 
        {
            "index": 40, 
            "rating": "5", 
            "review": "Great view and a beautiful place to have an espresso and pasteis.. I loved the Miradouro Sao Pedro de Alcantara!! Great views, huge trees, little outdoor shops and we had a beautiful clear day. Just make sure you wear nonslippery shoes if you are walking down hill."
        }, 
        {
            "index": 41, 
            "rating": "4", 
            "review": "Great views across the city. Excellent spot for seeing the city. You can take the funicular railway from Avenida Da Liberdade for an even more fun visit"
        }, 
        {
            "index": 42, 
            "rating": "4", 
            "review": "Great views, relaxing setting. There is a street fair for all of August at this spot. I really enjoyed grabbing a beer and just sitting on the bench and checking out the view. Highly recommended at sunset. Food, drinks, and souvenirs were overpriced compared to other spots."
        }, 
        {
            "index": 43, 
            "rating": "5", 
            "review": "Beautiful view on the red-roofed Lisbon. Get there from Praca dos Restauradores by Elevador da Gloria (3.60 Euros) or go uphill along the steep Calcada da Gloria (if you like climbing). Bus 758, too, can take you there from Rata or Praca Luis Camoes metro stations."
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "Great view of the city. Right of top of the Gloria funicular. Use the zapping metro card - much cheaper (use it for everything - trains, trolleys). Beautiful view of the castle. Nice park with a little café with wine and snacks."
        }, 
        {
            "index": 45, 
            "rating": "5", 
            "review": "Beautiful view. Elevador da gloria goes to this viewpoint. Stunning view of Lisbon, especially St. George castle. There is a nice fountain and it is possible to buy some souvenirs. Good place to see Lisbon from above."
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "Amazing and beautiful!. You get to see one of the most amazing views of Lisbon ever! And if you are lucky enough to see the sunset even better! There are actually two levels and you may sit there, drink a beer or even have a picnic! I could stay there for ever!"
        }, 
        {
            "index": 47, 
            "rating": "4", 
            "review": "Great views, cool place. This is a great place to visit for the view across the valley to Castillo St Jorge and also the lovely small cafe/wine bar that's great for, coffee, snack, wine. Great service!"
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "Stop for a nice photo. There is the place where all the tourists need to stop for a photo before go for a nice dinner or a crazy night out in Bairro alto. One of the best views of Lisbon!"
        }, 
        {
            "index": 49, 
            "rating": "5", 
            "review": "Beautiful view of Lisbon. Beautiful view of Lisbon . Nice to get to the observation by the carriage Gloria . Recommended reach the observation in the early evening to enjoy the scenery in daylight and twilight time and early evening . Sometimes there are amateur musicians ."
        }, 
        {
            "index": 50, 
            "rating": "4", 
            "review": "Good viewpoint. Good view point to view the city on hills. But honestly after a point all Miradouros start looking the same"
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "One of the best views in Lisbon. Lisbon is known for it's views and it's light, although it has several \"miradouros\" this is one of my favorites we can see the old city, the river and the modern side of Lisboa.\nAnd the best.... it's free."
        }, 
        {
            "index": 52, 
            "rating": "4", 
            "review": "Beautiful views. The viewpoint itself is gorgeous, well worth a visit when the market is on to pick up some traditional food/gifts. Only issue is the cafe is pricier than other parts of the city."
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "Fantastic views. We visited before have dinner at The Insolito, which is across the street. We enjoyed the various vendors and having a drink where we would enjoy the beautiful view of Lisbon."
        }, 
        {
            "index": 54, 
            "rating": "5", 
            "review": "Best view of Lisbon. Just passed by this viewpoint but decided to stay because of the good atmosphere! People were sitting at the fountain, the shadow and there's music. Just loved it! Make sure you go here."
        }, 
        {
            "index": 55, 
            "rating": "5", 
            "review": "Visit at sunset. Beautiful little park with great views over Lisbon. Market stalls with food & drinks, often music. Include it on your wandersing"
        }, 
        {
            "index": 56, 
            "rating": "5", 
            "review": "Great views and atmosphere at night. Great little area. Views are great and we came across some lovely little area with music and drink at night . Worth a visit."
        }, 
        {
            "index": 57, 
            "rating": "5", 
            "review": "Great views. Stayed in the Barrio Alto and this was a lovely place to hang out and see the surrounding city. It was close to our loft. We went back several times and it's pretty lively. They had a festival going on there the one evening which we enjoyed. I think it's a romantic spot to see especially at night. If you are staying in the Barrio Alto you must check it out!"
        }, 
        {
            "index": 58, 
            "rating": "3", 
            "review": "Great Views of the City of Lisbon. We took a tour of Lisbon in a tuk tuk. We were dropped off here for the views and photos. A nice spot to visit, very popular with the tours."
        }, 
        {
            "index": 59, 
            "rating": "5", 
            "review": "great view. This viewpoint is easy to reach (take Gloria elevador from Restauradores) and gives you great views over the city and the river. It is especially nice in the evening when the sun sets and everything is seen in that beautiful orange color. You can stroll down rue Sao Pedro de Alcantara and stop at Sao Rogue church (peek inside to see the contrast between the outside and the inside of the church). Go more down on rue de la Misericordia and stop at Fado in Chiado for a show - nice performance every night at 7 pm."
        }, 
        {
            "index": 60, 
            "rating": "4", 
            "review": "View, street market, terrace, music. Late afternoon, after a day of walking Lisbon, we ended up at this place to have glass of wine. There was a street market, people were playing music and there was a great view over Baixa, Alfama, Castelo,... Lovely place."
        }, 
        {
            "index": 61, 
            "rating": "5", 
            "review": "My favorite mirador in Lisbon. It is a million dollar view of the beautiful Lisbon. During the day, enjoy the sun and calmness, and during the night get a beer or sangria and enjoy the city of lights."
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "Beautiful views. Unfortunately there was a lot of constructions around it but the view is amazing. You can enjoy an ice cream while see the street artists painting-"
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "Magnificant. One of the best overlook to Lisbon downtown! and close to one of the most typical old Lisbon quarter"
        }, 
        {
            "index": 64, 
            "rating": "5", 
            "review": "I love this place. Take the Elevador da Gloria (the tram like funicular off Avenida da Liberdade) to the top and on your right there is the most glorious view of Lisbon towards the castle, especially at night. Whilst you are there walk into the nearby Bairo Alta which comes alive at night and into the early morning wher you can eat or drink in one of the many bars. A great way to just chill."
        }, 
        {
            "index": 65, 
            "rating": "4", 
            "review": "A lovely place to stroll in evening. We entered into Lisbon to 90+ degree heat after flying in from Barcelona. We took the Blue Line down to the city centre, ate some dinner, then took the funicular from Avenida da Liberdade up to the Bairro Alto. Immediately to your right as you exit the funicular sits the Miradouro Sao Pedro de Alcantara. We strolled this lovely park at about 21.00h - as the temperatures dropped. Outdoor vendors sold beer, food and hand-made items, a caffe on the far end was showing the France-Iceland Euro2016 quarterfinal. Plenty benches to sit and enjoy the atmosphere. And the view of Lisbon? Gorgeous. A great photo spot. I've been told the area gets seedy as night goes on and the young people like to drink to drunkenness up in that area. Perhaps I would have wanted to experience that 30 years ago! Instead, we headed back down to the Praca dos Restauradores and strolled a bit more. It was Sunday and the city was quiet and vibrant but at a certain leisure that brought calm."
        }, 
        {
            "index": 66, 
            "rating": "5", 
            "review": "Stunning Views. From atop the mirador, I had expansive views over Lisbon. Castello de S. Jorge is visible across the sea of red tiled rooftops as is the Tagus River and just about everything else in between. The mirador itself can get crowded, but for good reason. There are numerous makeshift stalls selling anything from food and drink to local crafts."
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "best in the evening. great place to spend an evening, just around sunset. The western sun sheds a wonderful orange hue on a large part of Lisbon that lays before you. Few benches, paths and stalls selling desserts, fish and Sangria and street performers singing or just playing guitar made the evening magical."
        }, 
        {
            "index": 68, 
            "rating": "4", 
            "review": "Lovely panoramic city views from this location. Miradouro Sao Pedro de Alcantara is a levelled public garden atop the hill in Bairro Alto. Here you find a nicely manicured area with flower beds, bench seating a public fountain and statue bust as well as wonderful panoramic views of the city of Lisbon. There are seats or you can just stand and admire the eastern part of Lisbon, looking down to Rossio or over to Castelo de Sao Jorge in the distance. It is a nice view point if you are planning to visit this area of the city.During our visit, there was a holiday fair taking place with quite a few food and drink stands sit up at Miradouro Sao Pedro de Alcantara. This made for an interesting added distraction from the views we enjoyed from this garden location."
        }, 
        {
            "index": 69, 
            "rating": "4", 
            "review": "A great place any time of day. Firstly the view from here is fantastic - take time to read the map and identify the various buildings. This view point is a must and a good place to catch your breath after climbing up the Bairro Alto. Its also accessible from the top of the Gloria funicular. At the far end of the view point is this kiosk - service is friendly and the menu is suitable for all day. The toasties on rustic bread are large enough to share unless you are very hungry. The soup is home-made and a good option. The trees offer welcoming shade and the kiosk has a toilet for customers."
        }, 
        {
            "index": 70, 
            "rating": "4", 
            "review": "Romantic, beautiful look-out over Lisbon. The look-out point here with the idyllic garden will grant you one of the most beautiful and romantic views of whole Lisbon (and there are quite a few). You can easily see the fortress, topping the Alfama district."
        }, 
        {
            "index": 71, 
            "rating": "5", 
            "review": "My favourite place in Lisbon. Well, the park and the view is awesome and even better when you arrive from one of the small streets of bairro alto. You can spend some time in the shade of the trees or in the park below. You feel Lisbon here and then you continue down to Chiado. Love that."
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "Great view and break/chill spot.. stopped here with Pedro on walking/tapas tour, great view, shady, refreshments and bathroom available."
        }, 
        {
            "index": 73, 
            "rating": "5", 
            "review": "Excellent view of the city at no cost, just the walk up. As opposed to the view of the city from Castelo Sao Jorge located at the hill to the east, at the old city Alfama. The park is a pleasant 30min slow climb from Restaurandores Square, or one can pay 4euros for the tramp going up. A good evening 'passaggiata' to catch the sunset. After which you will not feel guilty to have a large and rich seafood dinner."
        }, 
        {
            "index": 74, 
            "rating": "4", 
            "review": "Stunning view. It is well worth going to this superb view over the city. I had read before of the three parts of the city, Alfama, Baixa and Avenida, and Bairro Alto and Estrela but had not appreciated that the first and last of this list are on hills and the Baixa and Avenida is in a valley until I went to this viewpoint. It was busy when I was there yesterday in the early evening with people enjoying listening to a very good band that was playing. There is also an interesting sculpture of a paper boy on a statue to Eduardo Coelho founder of an important newspaper in Lisbon."
        }, 
        {
            "index": 75, 
            "rating": "4", 
            "review": "Мagnificent views. The site has magnificent views of Lisbon. There are something like a small park. When I visited there was a festival of local food ."
        }, 
        {
            "index": 76, 
            "rating": "5", 
            "review": "Lovely view day and night!. Lovely little viewpoint and park where locals and travelers alike can sit, talk, and have a drink while enjoying the breathtaking views Lisboa has to offer. I just missed it but a little artist fair was there for a few weeks prior."
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "Lovely view in the afternoon. This is my favorite Miradouro in Lisbon, because it's right across from the Castel Sao Jorge and you can see the nicest parts of Lisbon, plus a glimpse of the river, but none of the industrial areas near the banks of the river. It's so pleasant and calming, esp. in late afternoon when the golden sunshine illuminates the opposite side. There's usually some street musicians to add to the ambience - I could loiter there all afternoon, or have a late lunch at the kiosk."
        }, 
        {
            "index": 78, 
            "rating": "5", 
            "review": "take the Glória tram and enjoy the view. You can´t miss the view and the surroundings.You can go from there to Bairro Alto,just in front of the tram,go to Príncipe real(uphill) or to Chiado (down hill)Don´t miss Sâo Roque church nearby."
        }, 
        {
            "index": 79, 
            "rating": "4", 
            "review": "Amazing View! . My hotel is on top of avenue da liberdade. So instead of taking the Metro and then an elevator we took a cab to the Miradouro which costs just around 7 euro. This is the best way to see barrio alto and Chiado. And if you start here you walk down to Chiado which is easier than starting from Chiado to barrio alto which is where Miradouro is located. Great view of the city and the water. There are some vendors to buys souvenirs."
        }, 
        {
            "index": 80, 
            "rating": "4", 
            "review": "Brilliant viewing point across the city. To get here you can take a taxi to whizz you around the narrow streets to this viewing point,then the venicular tram to take you back down againThe is an amazing viewing point across the city, you have a huge panoramic view of everything – Avienda da Liberdade to the left, St Georges Castle straight across, and the river Tagus to the right.Do not miss the map of tiles which marks all the distinctive buildings. We were lucky enough to have a great sunny date and a lovely market = well worth a visit."
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "Magnificent view. My all-time favorite view point to relax, have a cappuccino and savor the changing light and sky.The castle sits majestically atop the hill and all the pastels blend into a beautiful potrait of Lisbon! !"
        }, 
        {
            "index": 82, 
            "rating": "5", 
            "review": "This is a viewing platform. Great place to take photographs of Lisbon and Rio Tejo from this viewing park and take a rest. This park is shaded by a lot of trees and a lower platform has a laid out garden. You can get to this location on Tram 28."
        }, 
        {
            "index": 83, 
            "rating": "5", 
            "review": "Fabulous panoramic city views!. Located within the Bairro Alto, this miraduoro is a must do! Music provided by various street musicians fill the air while visitors enjoy the sweeping views of the city. Gloria Elevator is adjacent to the park - a fun way to descend to the Praca Restauradores area. Just past the elevator is a small square with a walkway that winds down to the Rossio Square area, passing many small street cafes along the way."
        }, 
        {
            "index": 84, 
            "rating": "4", 
            "review": "Fabulous view. Enjoy a fabulous view over Lisboa, especially Baixa and towards Castelo. At night time the panorama is even more spectacular.Don't forget to visit Convento de Sao Pedro de Alcantara just across road on the other side of Rua Dom Pedro V - spectacular azulejos !"
        }, 
        {
            "index": 85, 
            "rating": "5", 
            "review": "Lovely spot. Just a lovely spot with a fountain and a great view, all the way to the castelo. There are little stands with food and drink, but there is also a restaurant with a nice terrace. You can get here with a little tram at the corner of Avenida Libertade and Rossio, on the train station side."
        }, 
        {
            "index": 86, 
            "rating": "5", 
            "review": "Lovely view. Good starting point for a long walk. Amazing view of the city. Enjoy a cup of coffee and start a walk downhill from there. You could also take the ancient tram that goes down and up again every 10 minutes."
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "Great view . Visited at night but before get dark, great spot with view on lower Lisbon. We got there walking from Chiada area and got back from there by Elevador Gloria. There are a few vendors with souvenirs and you can grab some wine sangria or hot wine and enjoy the view."
        }, 
        {
            "index": 88, 
            "rating": "4", 
            "review": "Excellent views and very close of night life. Very nice to visit. Pleasant place, close to good restaurants and night life area. Easy accesses. Difficult to park"
        }, 
        {
            "index": 89, 
            "rating": "4", 
            "review": "Well worth orth the effort. Well worth the walk up the steep hill to the Miradouro. It has one of the best views of the city and a great cafe where we had lunch. In season you can use the Elevador da Gloria and save your legs."
        }, 
        {
            "index": 90, 
            "rating": "5", 
            "review": "just WOW. The only thing I can say about this Miradoure, or sightseeing point is WOW. I loved seeing the city from this point. Has so much enchantment. One of the best in my opinion."
        }, 
        {
            "index": 91, 
            "rating": "3", 
            "review": "360 view of orange-roof buildings. Just the perfect spot to take photos of the whole of Lisbon! You may opt for the orange tiled-roof buildings, the river or the castle on a hill backdrop for your souvenir photo of Lisbon. The way up via the centenarian elevator is also an experience on its own. The melodic chime of the bell toll singing is also an added sensory treat."
        }, 
        {
            "index": 92, 
            "rating": "5", 
            "review": "View over lower Libon. This place gives you a very nice view over the lower Lisbon. You have also a great view on the castle de San Jorge. The place itself had a fiew artist and singers. I can imagine that it is a wonderfull place in summertime. Unfortunately we visited Lisbon in a rainy week. Around the place there are several bars and restaurants. One restaurant is to be visited, \"the Decadente\""
        }, 
        {
            "index": 93, 
            "rating": "5", 
            "review": "Tapas and a drink. What a place to stand and look out over Lisbon. Small stalls sell cheese, ham, beer, sangria, port wine, drinks, etc. Take your plate and glass and enjoy the view. Once done - either walk to the old town or take the Elevador Gloria down to the center again. I cant imagine Ill ever be in Lisbon again without going here at least once."
        }, 
        {
            "index": 94, 
            "rating": "5", 
            "review": "The favourite Lisbon viewpoint. Among all Lisbon Miradoutos, Sao Pedro is absolutely the most quiet, breathtaking, relaxing. You can easily access it by the Elevador da Gloria. The panorama from up there is gorgeous. You can see all Lisbon as far as the river. The Sao Jorge Castle is in front of you. There is a nice kiosk serving beers or soft drinks. Very often there are small wooden shops selling Portuguese delicatessen or sweets or fresh and delicious orange and lemon juice.I highly recommend to relax for 1 hour sitting at Sao Pedro, taking the sun and looking at the scenic Lisbon."
        }, 
        {
            "index": 95, 
            "rating": "5", 
            "review": "Fantastic lookout with great bar service. Fun to come up here via the Glory funicular (even just to say the name of that!) and sample the famous Ginjinha or whatever else is your pleasure from the lovely kiosk. Then explore the neighbouring streets that sweep along the hillside and stroll back down via calcada do Duque and stop for a brew at the tiny but marvellous Duque brewpub."
        }, 
        {
            "index": 96, 
            "rating": "5", 
            "review": "Breath taking view!. Sublime view over Lisbon. From this point you overllok the Castle, all down town, the river ... And you are at the entrance of Bairro Alto. Best night life is Lisbon :)Not to be missed!"
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "Romantice overview. As my wife and me were descovering small streets of Bairro Alto, at the end of one of 1001 sudendly we came onto the Sao Pedro Miraduro and view was just for that reason because we came to Lisbon :D For my wife :* :* :*"
        }, 
        {
            "index": 98, 
            "rating": "5", 
            "review": "great views. we walked up the hill and were so happy to find the mirador. it was a beautiful, sunny day and not only the view was fantastic, so was the entertainment."
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "Miradouro San Pedro . Beautiful spot with great views, soft music among trees. Don't miss it. Vendors with food and classy ambience. Sit and take in the view and the peace!"
        }, 
        {
            "index": 100, 
            "rating": "5", 
            "review": "Amazing!. No words to describe it!The view, the fado singer..That nigh I fell in love with Lisboa..Going back tomorrow :)"
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "Best Miradouro of them all!. Went to every Miradouro here in Lisbon and in my oppinion this is the best miradouro. But even more I enjoyd \"Santa Justa Lift\" which had even better view to the whole city."
        }, 
        {
            "index": 102, 
            "rating": "5", 
            "review": "Best of a good bunch!. Lisbon is spoilt for choice when it comes to amazing views but for me this was the best in the city. It's a lovely spot with lots of seating, a nice kiosk serving good cocktails and fantastic views. Well worth taking some time out of your day to chill out here and watch the world go by."
        }, 
        {
            "index": 103, 
            "rating": "5", 
            "review": "Beautiful view. In my opinion, the best view over Lisbon. I've been to all the other miradouros twice and this is by far my favourite. It is a nice place to just sit and enjoy the sunset, listen to some music and have a drink. A very romantic place as well. Definitely recommend it!"
        }, 
        {
            "index": 104, 
            "rating": "5", 
            "review": "What a view!. This is a really picturesque spot overlooking Lisbon and is well worth a visit.\nIt's on the bus and tram route and has lots of little shops, cafes and restaurants nearby.\nIt's got the prettiest views over the city in my view and I'm sure the sunsets are spectacular.\nLovely spot!"
        }, 
        {
            "index": 105, 
            "rating": "5", 
            "review": "Nice view and perfect spot to start your sightseeing. Really nice view from the bairro alto over the whole city. Our apartment was next to this little viewpoint/garden and we started our excursions from here and often used the little train to bring us uphill again in the evenings."
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "Watch the sun go down over Lisboa. This viewpoint is up the hill from the main Bairro Chiado area on the way to Principe Real. It is a small area with trees, with a garden below, and a wonderful view across Lisboa to the castle and the river. Have a drink at the kiosk - which has charming staff - and watch the sun go down. The evening we were there a great band was playing and you can spend a lovely hour for the price of a drink."
        }, 
        {
            "index": 107, 
            "rating": "4", 
            "review": "Nice view over Lisbon. Opposite to the Castle, this miradouro as a wonderful view over downtown. Specially nice at the end of the afternoon. A litte to crowed spot during summer time and at night time."
        }, 
        {
            "index": 108, 
            "rating": "5", 
            "review": "One of the nicest views in the entire city of Lisboa!. We happened along this spot when visiting Sao Roque church and the Convento de Sao Pedro de Alcantara. Best view we had! Much better and more accessible than the view from the Castle. It's like a little gem on the side of the street."
        }, 
        {
            "index": 109, 
            "rating": "5", 
            "review": "One of the most beautiful viewpoints!. Located on one of the 7 hills of Lisbon. Arrive there either by the \"elevator\" (lift) of Gloria, by foot or on the yellow tramway that crosses the old town. You may admire the city profile, better to be seen at sunset while sipping a port wine or a \"ginginha\" (cherry liquor). Visit the nearby Port Wine bar (Solar do Vinho do Porto) located on an 18th cent. palace. Stroll around Bairro Alto."
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "wonderful place. wonderful place to be. love the outdoorsy cafe's , restaurants and slow paced lifestyle... definitely worth a visit.bring your camera"
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "Beautiful view over Lisbon. Perfect place for a drink in the sun with a beautiful view over the oldest parts of Lisbon and the river. There are a small cafeteria serving soft drinks, alcohol and coffee.\nIf you are lucky there sometimes are a market with local products like cheese, jewelry and arts."
        }, 
        {
            "index": 112, 
            "rating": "5", 
            "review": "Views. Fantastic views of the city, great spot to sit relax and people watch. Nice bar at the top for refreshments. Worth the hike."
        }, 
        {
            "index": 113, 
            "rating": "4", 
            "review": "Soaking up Lisbon and sunshine. A great place to relax and get a view of the city and the river in the far distance. There are bars, small booths selling cheese, lemonade and crafts and - when we visited - a cool African band playing."
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "Does this place need an explanation?. Lisboa has plenty of miradouros to explore. I have been lucky enough to be at Miradouro Sao Pedro de Alcantara in a sunny day and take beautiful pictures."
        }, 
        {
            "index": 115, 
            "rating": "4", 
            "review": "Nice view of the castle on the opposing hill.. Two view points are, the Iron Elevator, which is quite nice for sunsetting photos as is this location. Tis location is surrounded with nice inexpensive restaurants. With a drink (wine or water, or coke) and an espresso at the end about 10 euro"
        }, 
        {
            "index": 116, 
            "rating": "5", 
            "review": "Great Park With a wonderful View. The first time we saw this park was when our driver pointed it out on our way from the airport to our apartment. The next time was on a walking tour, where we stopped for coffee and beer. This park has two levels and a fantastic view of the city and castle.We were in Lisbon for two weeks and this became a favorite place to stop and rest on our many walks around the city."
        }, 
        {
            "index": 117, 
            "rating": "4", 
            "review": "Great views.... We'd just had lunch and was walking back to hotel and stopped for photos. Decided to have a drink and this place also has a toilet!Only had a glass of wine each but sat under cover with heaters and blankets. The views are to die for, looking out over city and castle. If we hadn't eaten already, we would have here. Wine was 4 euro per glass. Service was very good. Go here and spend some time and linger..."
        }, 
        {
            "index": 118, 
            "rating": "4", 
            "review": "A nice spot to view the city!. Right above barrio alto, it was the last place we visited before we left Lisbon. It offers a great view of the city. It also has a nice park, and a stone map that helps to identify what you see.I think it worths a little stop."
        }, 
        {
            "index": 119, 
            "rating": "5", 
            "review": "what a view. Had to walk up here has the little trams were temporary out of use. But it was certainly worth it also great fun watching the look on peoples faces has they go up the hill not sure if there is another way up but this way there is some great art works on the walls. When you do get to the top its WOW the view of the city is wonderful. This is deffo one place you must go..."
        }, 
        {
            "index": 120, 
            "rating": "5", 
            "review": "Great for admiring views by day and party at night. The view from here is amazing. It is also the most 'active' miradouros in the city. In the evening you will find here quite a crowd, well who wouldn't like to party with a view like that. For beverages and snacks you can go across the street to Bairro Alto and Erasmus Corner."
        }, 
        {
            "index": 121, 
            "rating": "4", 
            "review": "Terraza. Since i diceded to go to Lisbon I was looking for high points where I can see the whole city with the bridge. This was defenetly one of the best places to make great panoramic pictures."
        }, 
        {
            "index": 122, 
            "rating": "5", 
            "review": "Do not miss!. I have been several times in this place...and I would return...the skyline of Lisbon from here ...absolutely great !"
        }, 
        {
            "index": 123, 
            "rating": "4", 
            "review": "Nice point to get an overview of Lisbon. Conveniently located and easy to approach. Take Tram for Bairro Alto and once you get down of the Tram walk a little to your left and you are there. Enjoy the greenery of the park besides the wonderful view of the city."
        }, 
        {
            "index": 124, 
            "rating": "5", 
            "review": "It's a must :). My first miradouro in Lisbon. Fantastic view, nice place and really easy to find. You should get Gloria elevator or simply walk from igreja de sao roque"
        }, 
        {
            "index": 125, 
            "rating": "4", 
            "review": "Maybe a Good place for a Rest. What a vista! Wore the shutter out on my camera and had to revert to the phone, a nice sunny day.\nThe disappointment was that the cafe in the mirador was more expensive than the main street shops. Beware."
        }, 
        {
            "index": 126, 
            "rating": "5", 
            "review": "Great vuews. This place has Lovely views - would be even nicer with sunshine!! Good place to get your bearings of the city. Would recommend."
        }, 
        {
            "index": 127, 
            "rating": "5", 
            "review": "My favourite viewing spot. Spectacular night views of Lisbon from here. Particularly impressive at night with the lights and sights of the city stretching out below."
        }, 
        {
            "index": 128, 
            "rating": "4", 
            "review": "One of the most beautiful views in Lisbon. Always beautiful, but particularly good in a hot sunny summer day, as it is in a cool quiet garden. Nice little coffee house available as well for a quick snack"
        }, 
        {
            "index": 129, 
            "rating": "4", 
            "review": "Lovely views...some graffiti spoils it. We caught the tram up and it was worth it...the views were amazing except for graffiti spoiling the photos...male parts were the common theme so not easy to ignore."
        }, 
        {
            "index": 130, 
            "rating": "5", 
            "review": "Excellent view point.. View point of south side of city. Good access by the foot or \"Elevador Da Gloria\". Amazing view.\nPlace full of tourists even in January."
        }, 
        {
            "index": 131, 
            "rating": "5", 
            "review": "Great view and nice market - little church is also worth a visit. Our bnb was just round the corner from this delightful square so this was my first view of Lisbon and remained my favourite. You can see over the castle and down to the centre of town. On the Saturday morning there was a great little market. And do pop into the church of San Pedro. It is free and there is an amazing chapel entirely made up of inlaid stone as well as wonderful blue and white tiled confessionals in the church itself."
        }, 
        {
            "index": 132, 
            "rating": "4", 
            "review": "Great place with great view. A great place with a great view. My third favorite Miradouro in town. Really nice during the day and chill at night with a beer in hand. Definitely worth for a stop by."
        }, 
        {
            "index": 133, 
            "rating": "5", 
            "review": "Relax.. Stunning view from the top on Tejo River, Castelo St. Jorge,Miradouro da S.do Monte,etc.Relaxed atmosphere, guitar player, lovers,seniors playing cards.Good place to get back Your good mood after stressful day."
        }, 
        {
            "index": 134, 
            "rating": "5", 
            "review": "Great view. Great view of the city. Located right off the Main Street. If you don't want to walk up the hill, you can take the old trolley. Definitely worth a visit to relax and take in the city."
        }, 
        {
            "index": 135, 
            "rating": "5", 
            "review": "One of the best views of Lisbon. Once you have spent a long moment enjoying this amazing view of Lisbon, go and have a look at the nearby beautiful antique shops or, if you prefer visit the design fashion shops in the neibourhood. End up the afternoon with a good glas of port at the Solar do Vinho do Porto"
        }, 
        {
            "index": 136, 
            "rating": "5", 
            "review": "ONE OF BEST VIEWS OVER LISBON. The sunset or at night is even more beautiful. A belvedere where you can have a drink and then go nearby (100 meters) have dinner to the typical Bairro Alto"
        }, 
        {
            "index": 137, 
            "rating": "4", 
            "review": "Breathtaking in the morning. Amazing at night!. My hostel was located just off this very square! I arrived at night and I was amazed by the view! You can see the whole city! It gives you the impression that you can almost touch the monuments! The morning after, I took my time taking many pictures of the view at dawn. Amazing! It is maybe a little out of hand and not as popular as other view points, but it is definitely worth it! Enjoy!"
        }, 
        {
            "index": 138, 
            "rating": "5", 
            "review": "Top class top view. Great view from the terrace which is the highest point in Lisbon.Sitting on a deck chair, drink in one hand and a panoramic view of Lisbon below. Sere and unhurried atmosphere"
        }, 
        {
            "index": 139, 
            "rating": "4", 
            "review": "Good views. If you can walk up to this area there are good views across Lisbon - which I'm not sure you'd see from elsewhere."
        }, 
        {
            "index": 140, 
            "rating": "5", 
            "review": "beautiful. You can see the city from the top. I like it more in the night because i stayed in the park but if you want to take pictures you must go in the day time. If you come in the night you can walk from bar to bar in Bairro Alto after you see the miradouro."
        }, 
        {
            "index": 141, 
            "rating": "4", 
            "review": "Great relaxing stop. Enjoy a glass of wine as you stroll around the park, enjoying the sights and great elevated views. Don't miss the gardens below. Just walk down the steps."
        }, 
        {
            "index": 142, 
            "rating": "4", 
            "review": "Relax with a view. When exploring Lisbon and \"Bairro Alto\" you'll find this little park with a \"miradouro\". Time to stop at the cafe and grab something cold and relax watching over Lisbon. Great to view the sunset!"
        }, 
        {
            "index": 143, 
            "rating": "4", 
            "review": "The View.... Upon reaching the stop of the funicular at the top...you will see miradouro Sao Pedro de alcantara.Here you can see the castle of sao jorge uphill,here you can enjoy looking part of lisbon by day or by night.You can also see also take a bit of your time to relax here at park & enjoy its scenery."
        }, 
        {
            "index": 144, 
            "rating": "5", 
            "review": "Breathtaking view for free!. The Miradouro São Pedro gives you the oportunity to have a great and breathtaking view. Totally worth the visit! And it is for free!!"
        }, 
        {
            "index": 145, 
            "rating": "4", 
            "review": "Great views. Well worth the walk up - or take the tram if you feel you can't manage it.\nGreat views of the city - and a nice bar at the top - lovely to sit out in fine weather and admire the views"
        }, 
        {
            "index": 146, 
            "rating": "5", 
            "review": "Great view, especially in the evening. Great view, seeing the lights on the Castle Soa Jorge area from this point. Great to enjoy with Port wine at the local kiosk."
        }, 
        {
            "index": 147, 
            "rating": "4", 
            "review": "Worth the hike. From Rossario Main line station, there is a series of steep steps that gets you to the centre of Bairro Alto. But I usually find that by the time I've reached to top I need some sort of resuscitation. Better get the funicular, I think which halves the pain. Once up there you have to visit here have a beer or Port and enjoy the view. It is superb. A must do!"
        }, 
        {
            "index": 148, 
            "rating": "3", 
            "review": "A viewpoint. There are many places to view Lisbon and this is a good one looking across towards the Castle (which also offers good views). There is a little area here with a sort of garden from which you can view the City below but there is little to cause you to linger for very long"
        }, 
        {
            "index": 149, 
            "rating": "5", 
            "review": "Nice outdoor stop on a Bairro walking tour. Magnificent views from a spacious park with trees and benches. Near restaurants and bars, stairway from the Rossio railway station-but that's quite a climb up."
        }, 
        {
            "index": 150, 
            "rating": "5", 
            "review": "Gorgeous view. What more is there to say? Easy to reach and not to miss on a Lisbon visit. And free so why hesitate?"
        }, 
        {
            "index": 151, 
            "rating": "1", 
            "review": "Great views but the upstairs bar/kiosk sucks. Earlier today, three friends and I visited the upstairs bar/kiosk for snacks and a few drinks. The four of us are expats living in Lisbon, and had visited this kiosk previously on multiple occasions without incident. However, tonight we were charged for a bottle of wine we did not order, and when this error was brought to the manager's attention, he refused to discount the bill, threatened to call the police, and banned us from frequenting the kiosk in the future. To be clear, my friends and I legitimately ordered over 90 euro worth of food and drinks, so the issue wasn't an unwillingness or inability to pay. However, we were absolutely not going to pay an additional 20 euro for wine we did not order. Unfortunately, the server attending to us came to the end of his shift before we were ready to pay our bills, as he could have confirmed the legitimacy of our claim. Certainly the view from this location is wonderful, but based on my most recent experience with the upper level kiosk, I suggest visiting elsewhere for drinks and snacks. Thankfully, there are a variety of other options nearby and I doubt they will charge you unfairly."
        }, 
        {
            "index": 152, 
            "rating": "4", 
            "review": "lovely views of the city. can be accessed via the elevadore tramp, or a very steep walk from the rossio station. but the views on a clear day is amazing. almost all view points across lisbon are breathtaking!"
        }, 
        {
            "index": 153, 
            "rating": "5", 
            "review": "BEST of all Miraduros in Lisbon! Why? Read on!. MUST DO the following:1. take the Escalada da Gloria (up hill tram) from bottom stop at Avenida de Liberdade - Lisbon's must do #1!2. go there in the evening, when the city's all lit up and street bands line up the top square. Goose skin guaranteed!3. than wander around the Bairro Alto district, with hundreds of restaurants to choose from!"
        }, 
        {
            "index": 154, 
            "rating": "5", 
            "review": "Great views. Quiet, pretty place with amazing views over the city, the gardens are really beautiful. Either at day or night is totally worth going and enjoy the place"
        }, 
        {
            "index": 155, 
            "rating": "5", 
            "review": "Great views. This Miradouro is right across the street from the hostel I stayed at. Even on a rainy day it was fun to wander around and look all the way down to the Tagus River. On sunny days there were artists, musicians and other types of entertainment happening."
        }, 
        {
            "index": 156, 
            "rating": "5", 
            "review": "Miradouro S.Pedro de Alcântara. Gorgeous! Really romantic, and beautiful. You can see Lisbon, and it's beautful. I strongly recommend it! It's worth the visit!!"
        }, 
        {
            "index": 157, 
            "rating": "5", 
            "review": "Art nouveau landscape. Even if the Graca Miradouro is probably the best, this the most art nouveau landscape, because the streets of Bairro Alto are full of nice buildings and \" azulejos \" of this style"
        }, 
        {
            "index": 158, 
            "rating": "5", 
            "review": "One of the best Miradouro. in my opinion is second best to the Miradoura Senhora do Monte, it has a very nice park and a fountain at the base! you can grab the funicular to get to it but only worth taking the funicular if you have the following options(on the spot is 3,.6 euro 2 rides)Buy the Lisbon card and you get also the trains for Cascais or Sintra covered.Buy the Viva Viagem card(0.5 euro) and get a day ticket 6 euro or a 3 day ticket 13,5 euro and ALL your transportation is covered,, including trams 28,18,12, 15 and the Santa Justa elevator which costs 5 euro!"
        }, 
        {
            "index": 159, 
            "rating": "4", 
            "review": "Amazing view of the City.... The Miradoura Sao Pedro is certainly one of the best location to see the city in all perspective, facing the Castelo de Sao Jorge... you will enjoy the view, the scenery but also this area of Lisbon."
        }, 
        {
            "index": 160, 
            "rating": "5", 
            "review": "Very nice view and local shopping area near by. It is one of my favorite views in Lisbon. Since I stayed in the Bairro Alto it was pretty close by to walk uphill there. It's nice to sit there for a while and enjoy the view if it is not too touristy. There are also local shops nearby as I always support them wherever I travel."
        }, 
        {
            "index": 161, 
            "rating": "5", 
            "review": "One of \"the views\". The Miradouro de São Pedro de Alcântara, apart from being beautiful, has one of the great views of the city."
        }, 
        {
            "index": 162, 
            "rating": "4", 
            "review": "Nice area with nice view. We happened upon this place while on a walk in the vicinity, so stopped to take in the view to the river across the rooftops below. Nice gardens and a terrace where you can sit and wile away the hours, as you wish!"
        }, 
        {
            "index": 163, 
            "rating": "5", 
            "review": "Good place to chill out with a glass of wine on a nice day.. After an informative but packed morning guided tour of some of the main attractions in Lisbon we took the funicular from The Avenida da Liberdade and took the few steps to this extensive terrace with its wide ranging views of Lisbon. These take in the river with a distant view of the bridge, and look over to the Castle, but more nearly down tom the Avenida and central district. On a hot day this was just the place to chill out with a glass of white wine listening to the buskers, including a very good jazz trio. We meant to go back in the evening to see the city lit up but never made it. One of the many reasons to come back to this city!"
        }, 
        {
            "index": 164, 
            "rating": "5", 
            "review": "Came back here every night in Lisboa. Very nice garden, full of youngsters drinking and smoking - but everyone is very polite and friendly. Great view (but you very fast get used to them in Portugal). Nice atmosphere."
        }, 
        {
            "index": 165, 
            "rating": "5", 
            "review": "place to see. if you have the time walk around you see a lot more this way ,or buy metro ticket 6 Euros for day can hop on some of the bus with it"
        }, 
        {
            "index": 166, 
            "rating": "5", 
            "review": "A great view and experience. This amazing place offer you a great view from Lisboa. Young people get together and have fun. You need to visit and realize the lively atmosphere. You can go in all seasons but in summer is very special."
        }, 
        {
            "index": 167, 
            "rating": "4", 
            "review": "One of the best views of Lisbon. This viewpoint possibly the biggest one it's also one of my favourite, here you can watch most of Lisbon's downtown and get some sun as well have a coffe on the nearby esplanada."
        }, 
        {
            "index": 168, 
            "rating": "5", 
            "review": "Nice to visit at night as well. We were here during the afternoon and the view was very nice. However it is not a lot different than other city vantage points. Went at night while waiting for a dinner at a nearby restaurant and thought it was much better. There are a lot of young people hanging out which makes it feel alive.You can get a drink in one o the restaurants across the street and then go to the park and just hang out."
        }, 
        {
            "index": 169, 
            "rating": "3", 
            "review": "Great View. It was worth the walk to get there. Lisbon is full of hills, but they offer various ways to conquer them: funicular trains, elevators, and tuk-tuks come to mind. We tried all three at different times and they each had their own charm (well, not the elevator - it was just an elevator, but it did take us up). Once you're up there, the view is really quite nice."
        }, 
        {
            "index": 170, 
            "rating": "5", 
            "review": "Best free attraction in Lisbon. Best way to spend some time in. It's really an open square, or plaza with one of the best views of Lisbon. You can sit on the bench and enjoy the view totally for free."
        }, 
        {
            "index": 171, 
            "rating": "4", 
            "review": "Good view over Lisbon. Nice view. Excellent place. Nice Port place across the street\nMust use funicular : great experience when combined"
        }, 
        {
            "index": 172, 
            "rating": "5", 
            "review": "Great view over the city. What a wonderful view over the city especially as the sun sets. Local musicians only added to the romantic setting. Visited on Friday and was popular with tourists & locals alike. Plenty of bars/restaurants available nearby."
        }, 
        {
            "index": 173, 
            "rating": "4", 
            "review": "Great views, good spot for taking a break from walking. Found this accidentally as we were heading for the Jardim Botanico. There was a musical group playing in the plaza near the cafe. Very enjoyable respite."
        }, 
        {
            "index": 174, 
            "rating": "4", 
            "review": "Viewpoint with live music. Nice place to stop for views of the city, shade and maybe a drink at a nearby cafe. Live music really sets the mood up, inviting you to stay for the rest of the afternoon. And you know what, that wouldn't be such a bad idea."
        }, 
        {
            "index": 175, 
            "rating": "5", 
            "review": "great view. During the night there are a lot of people(I was in a weekend) and it is a nice place. I climbed up to here but there is a tram and I guess a bus"
        }, 
        {
            "index": 176, 
            "rating": "5", 
            "review": "Garden delight. Lisbon is full of tiny delights to entice the the more adventurous. Every where you go there are these tranquil paradises. Some only known to the locals. Get on your feet and walk the hills of Lisbon, it pays dividends."
        }, 
        {
            "index": 177, 
            "rating": "5", 
            "review": "Nice place. Great view especially in the dawn at the old town of Lisbon. There is always some live music and an open space bar invites for a drink if weather allows."
        }, 
        {
            "index": 178, 
            "rating": "4", 
            "review": "Breathtaking view all over town, plus Arrábida. Lots of space, very pretty to view sunrise. Can get very busy on friday and saturday nights!\nYou can have a great view all over Castelo de S. Jorge, also Terreiro do Paço and Sé."
        }, 
        {
            "index": 179, 
            "rating": "5", 
            "review": "At night overview in Lisboa. Even if tired, a stop, by night, in the neighborhood, watching the beautiful Lisbon at night leaves you breathless. Nearby the famous tram 26, awaits his new friends in their quest for Lisboa's discover. So take a brake during the day, or even better at night to plan your next day trip or just have a romantic walk. Loved it, hope you will too."
        }, 
        {
            "index": 180, 
            "rating": "5", 
            "review": "Go see!!. Although it does require some hiking to get to this viewpoint, it is totally worth it! An excellent overview of Lisabon!"
        }, 
        {
            "index": 181, 
            "rating": "5", 
            "review": "Walking sightseeing. This was very good and a eye opiening experience worth the walk the views were fab part of our day in Lisbon"
        }, 
        {
            "index": 182, 
            "rating": "5", 
            "review": "Brilliant Views. Brilliant views with plenty of space to sit down. Easy to access from the city centre. Plenty of restaurants nearby"
        }, 
        {
            "index": 183, 
            "rating": "5", 
            "review": "Best overall Miradouro!. Off all the Viewpoints we visited and we saw most, this one was the best! It's got everything, view, 2 big terrace''s, tree's for shade and 2 nice bars."
        }, 
        {
            "index": 184, 
            "rating": "4", 
            "review": "very special at night!. Why not 5 stars? well there is always the risk of pickpoquets while one marvels at the view...Bairro Alto is close by, which adds to the interest at night. The S. Roque church and its museum are also around the corner, you'll have to go there during the day then."
        }, 
        {
            "index": 185, 
            "rating": "5", 
            "review": "Excellent views, good kiosk cafe, lovely gardens. I really liked this Miradouro, just up from Avenida Liberdade, next to the Elevador da Gloria and near to Chiado and the Bairro Alto. The gardens are very lovely for a stroll, with pretty flowers and fountains. Nice to stop for a drink, day or evening, at the kiosk and just take in the views across the city to the castle. Spacious and open, very pleasant."
        }, 
        {
            "index": 186, 
            "rating": "5", 
            "review": "Amazing spot. one of the most beautiful scenery you can see the other side of Lisbon with the castle at the top of the mountain. You can't miss this spot ..very close to Bairo Alto. Recommended"
        }, 
        {
            "index": 187, 
            "rating": "5", 
            "review": "180 degrees of Lisbon. This is one of the top spots in Lisbon to get a great view as well as a nice rest from sightseeing. You get a 180º of Lisbon since it sits at the top of one of the seven hills. The small garden is a perfect place to recover your energy with a coffee bar and esplanade.Not to be missed."
        }, 
        {
            "index": 188, 
            "rating": "4", 
            "review": "A memorable stop on a self guided walking tour Lisbon. We returned to Lisbon with a limited time for visiting and walked the city--this is one of the visual highlights of a pleasurable walking tour--Lisbon is hilly which creates memorable vistas such as this one!"
        }, 
        {
            "index": 189, 
            "rating": "3", 
            "review": "Lovely Gardens,Great view, Appalling Kiosk. A lovely place to spend an afternoon or evening with an impressive view of Lisbon.If your looking for a place for a relaxing glass of wine I don't recommend the kiosk by the gardens. I heard a lady ask for a white coffee and the waiter replied in a nasty and patronising tone.'we're not racist here my lady, we say coffee with milk'His attitude to her was terrible.The lady quite rightly went to complain about him in the kiosk but no one looked botheredWhen she explained how upset she was by his behaviour, he lust laughed and said'Your getting upset over nothing' and walked off.He then came up to me to take an order to which I replied'It's a lovely place, shame that someone like you spoils it' and walked away.Miradouro de Santa Luzia on the other side is an equally lovely view with and their kiosk had very friendly staff and made a fine sangria."
        }, 
        {
            "index": 190, 
            "rating": "5", 
            "review": "Lovely garden and view. This miradoura is a beautiful little area, spoiled somewhat by graffiti but not enough to take away the joy of discovering it. It is easy to find, just take the funicularacross the street from the Condes building (Hard Rock cafe) and it is immediately on your right. Take some time to explore this region further. Bairro Alto also has the impressive Sao Roque church and so many charming streets."
        }, 
        {
            "index": 191, 
            "rating": "4", 
            "review": "Nice view, I guess a must see in Lisbon. A nice place, with the nice view. Relaxing point which should be included in your walking tour around the places with the best views on Lisbon. Be aware, not much shadow, could be killing on a sunny day."
        }, 
        {
            "index": 192, 
            "rating": "5", 
            "review": "Lovely.. Along with all of Lisbon's miradors, this is not to be missed. Immediately to your right at the top of the funicular."
        }, 
        {
            "index": 193, 
            "rating": "5", 
            "review": "Beautiful spot to relax and enjoy the view. Beautiful little park with great views and a small cafe. Relax in one of the park benches or get a coffee and chill out in one of the cafes recliners enjoying the view of Lisbon"
        }, 
        {
            "index": 194, 
            "rating": "5", 
            "review": "Gorgeous views. This was a beautiful area to enjoy a sunny day, plenty of views, restaurants, and people...You can spend an afternoon walking around the area and visiting little shops for wine, porto, or to sample food, art. This area is full of culture."
        }, 
        {
            "index": 195, 
            "rating": "5", 
            "review": "Fabulous view, especially in the afternoon. Great view, especially in the afternoon, because of the sunlight. You see:\n- Castello de São Jorge\n- Se Catedral\n- Sea\nAnd a lot of other beautiful buildings."
        }, 
        {
            "index": 196, 
            "rating": "5", 
            "review": "Beautiful!. Beautiful views from this location with lots of picture taking opportunities! Great to view the sunset!"
        }, 
        {
            "index": 197, 
            "rating": "5", 
            "review": "great and close to the city. a short stepp walk to this ... or take the tram...lol the street art on the way to this site is excellent, then you get the view"
        }, 
        {
            "index": 198, 
            "rating": "4", 
            "review": "One of the great free views of Lisbon. . We stayed on Avenida street. Once you spot the side street (to your right if you're walking down the street), head up the hill (we walked every time but we're young and fit) which is steep but we didn't find it a challenge at all. Once you get to the top take a right and just up ahead you'll be greeted with a lively park with one permanent bar and few make shift portable bars and of course a great overview of the city. Then make your way down the hill and to your right is the lively barrio alto area, an area I'm quite fond of."
        }, 
        {
            "index": 199, 
            "rating": "5", 
            "review": "Breathtaking sights. Wonderfull breathtaking sights of the whole city. Close to the busy district of bairro alto famous for the nightlife, fado shows and trendy artsy shops."
        }, 
        {
            "index": 200, 
            "rating": "3", 
            "review": "a Must. One of Lisbon best views. There is also a bar on the terrace that is extremely pleasant on a sunny afternoon."
        }, 
        {
            "index": 201, 
            "rating": "5", 
            "review": "The more you see Lisbon the more you love it. Another view of Lisbon, it is a lovelly city and you never get tired to see its diferente views, either during the day or the nigth.\nEasy to reach"
        }, 
        {
            "index": 202, 
            "rating": "5", 
            "review": "Very nice view on Lisboa. Elevador Gloria takes you right here siu it will be probably be the second place you will visit in Lisbon. Wonderfull view on the castle and the city. Barrio alto starts from here. Take the Bica elevator by goind forward towards the opposite way that you would see when looking on the city. You will also cross the path of tram 28."
        }, 
        {
            "index": 203, 
            "rating": "5", 
            "review": "a must. Get there from the Restauradores square by the Elevador da Gloria (1 minute ride) or on foot (a few minutes up a steep hill). Your effort will be rewarded by great views. There is a small cafe where you can buy something to drink."
        }, 
        {
            "index": 204, 
            "rating": "5", 
            "review": "Beautiful Lisboa. If you re looking for amazing views of this beautiful city, this Miradouro is a must. Don t forget your camera!"
        }, 
        {
            "index": 205, 
            "rating": "4", 
            "review": "A great view by day or night. Amazing panaramic view of the city as a whole. Small cafe nearby with musicians plying their trade. Ideal starting or finishing point for a long night ahead."
        }, 
        {
            "index": 206, 
            "rating": "5", 
            "review": "Great view over Lisbon hills. This terrace is a great place to take The Photo of Lisbon as it captures all the great monuments in the river frontline near the city centre: the castle, the cathedral, Graça's Convent, Senhora do Monte Terrace and all the old eighteenth and nineteenth century buildings of Avenida da Liberdade. You'll find it amazing. You also can shop around in the beautiful street shops nearby either you continue to Príncipe Real garden to visit the Natural History Museum or down through Rua do Alecrim to Chiado or even lower to Cais do Sodré. For a total experience go to the Lost in Esplanada, another great terrace oever Lisbon. They have jazz session live music on thursdays. Rua D.Pedro V Nº56-D"
        }, 
        {
            "index": 207, 
            "rating": "5", 
            "review": "View and people watch. Super lookout over Lisbon on edge of Bairro Alto. Great place to watch the sun go down and see sights of the city. Handy for going on Gloria and the port wine institute. But best part is just watching people enjoying themselves in a lovely location."
        }, 
        {
            "index": 208, 
            "rating": "4", 
            "review": "great view over lisbon. the is one of the several miradouros /view points of the city. it's pretty fast to get there, however not easy. you can take Gloria's elevator, which is actually a funicular, for 3.6 EUR round trip, or you can climb up the street for 15 min. be careful, the street it very steep and pebbled with those types of shinny pebbles that are everywhere around lisbon. how they do it when it rains i have no idea!the view from up is very beautiful. make sure you go in the afternoon so that the sun lights the river, castle and all eastern part of lisbon."
        }, 
        {
            "index": 209, 
            "rating": "4", 
            "review": "Great Views. Good spot to view the City and the Castle, great if you want to take panoramic photos. Come up on the Elevador De Santa Justa (funicular railway) and take it all in. Super at night too."
        }, 
        {
            "index": 210, 
            "rating": "5", 
            "review": "Stuning view of the castle and the downtown. This is one of the best sightseeing spots in Lisbon, i visited it after the underground tour in the Lisbon Aqueduct! Coming out from beneath the ground and having this stunning view is... wonderful! Had a cold drink in the outdoor café: delicious!"
        }, 
        {
            "index": 211, 
            "rating": "5", 
            "review": "One of the best miradouros. We went here accidentally while looking for something else and stood there for an hour ore more enjoying the beautiful view over Lisbon. You can easily get here with Metro to Baixa-Chiado and than walk about 700m or with the tram from praqua restauradores."
        }, 
        {
            "index": 212, 
            "rating": "4", 
            "review": "Nice view. This is a pleasant miradouro in lovely settings with a fountain and a little park to relax in. The view is very good as it shows the castle and much of Lisbon, however out of all the miradouros I have seen, this was not one of my favourites.Still, it is in a great location at the top of the Elevador da Gloria and near Bairro Alto, so is therefore easily accessible and you do not need to go far out of the way to come here and won't take much out of your day if you are only visiting the city for a short time."
        }, 
        {
            "index": 213, 
            "rating": "5", 
            "review": "Amazing view over the city. From there, you'll see most of Lisbon. Alfama (Sé and castelo S. Jorge), avenida da Liberdade, Graça and the Tagus river. It's better in the afternoon because in the morning you'll be facing the sun. It can be very touristy at Sunset and even at night but the view is very beautiful."
        }, 
        {
            "index": 214, 
            "rating": "4", 
            "review": "Outstanding view. The view is splended, e ahd breakfast in the little garden too and tha was nice to. As good as you will get at some hotels. Steep clib up or take the elevator. Then enjoy the views."
        }, 
        {
            "index": 215, 
            "rating": "4", 
            "review": "Worth it. We went here to meet my cousins at nighttime and I could imagine the beauty of this place when the sun is setting. At night it is special to Lisbon all lit up. It is a great place to take your date or enjoy a sunset with your sweetheart. The views are spectacular shouting across the city. its well worth to plan an evening here and then head out to the bar scene."
        }, 
        {
            "index": 216, 
            "rating": "5", 
            "review": "Lovely view . A wonderful view to the city of Lisbon.You can get amazing pics and relax in the garden after sightseeing."
        }, 
        {
            "index": 217, 
            "rating": "5", 
            "review": "Stunning view. A pleasant garden from which you can have a great view over Lisbon, the City, the hills, S. Jorge (Saint George) Castle and the river Tagus. It's near Bairro Alto, where you can find lots of restaurants, bars and discos.Just sit and have a rest under a tree, listening to the twittering of birds and enjoy the view!"
        }, 
        {
            "index": 218, 
            "rating": "5", 
            "review": "Wonder Lisbon. Awsome views of the city, awsome place to chill and and take pictures. Recomend that to everyone who comes to Lisbon !"
        }, 
        {
            "index": 219, 
            "rating": "4", 
            "review": "Great views!. One of the best, and most inexpensive, views over the city. Definitely worth a visit as very central and easy to reach."
        }, 
        {
            "index": 220, 
            "rating": "4", 
            "review": "One of the best \"miradouros\". A must go to see the views over our beautiful city. Recently renewed, now it also has a small cafe where you can have some drink while enjoying the view."
        }, 
        {
            "index": 221, 
            "rating": "4", 
            "review": "Nice Visit by Funicular to Miradouro Sao Pedro de Alcantara. You will find this at the top of the Gloria funicular this two-level park offers great views over the city the Castle Sao Jorge and the River Tagus. You can travel on this funicular for 3.60 Euro or free if you have the Carris 6 Euro day pass that covers all Lisbon Transport or take the short uphill walk on the funicular route.. This is a great place to be in the mid to late afternoon as you will have the sun at your backs as you look out over the city. A good photo opportunity with plenty of places to eat and drink. Buskers playing and artists selling really nice paintings and tiles etc.From here you can wander downhill through Bairro Alto to Chiado with nice shops etc.If this review is helpful then please indicate so below."
        }, 
        {
            "index": 222, 
            "rating": "4", 
            "review": "Great views. Fantastic views from the viewing point, there was a good atmosphere with some local musicians playing some cheerful music, we were able to sit and have a drink with fantastic views of the city. Would be good to combine with Alfama and the castle and tram 28."
        }, 
        {
            "index": 223, 
            "rating": "4", 
            "review": "Lovely View in Evening as Sun goes down.. We came across this place by chance as it was a few minutes walk from our apartment. Nice view in the daytime of the red rooftops towards the Castelo St George. But even better in the evening as the sun goes down and the lights come on. There are benches near to the railings and a kiosk bar with tables and chairs. Also a very pretty ornamental garden with old style lamps. I only did three of the Miradouros but this was the best in my view, and a lovely place to relax for a while."
        }, 
        {
            "index": 224, 
            "rating": "4", 
            "review": "Worth it. Excellent views over the city, you cab taje the funicular to get to the top, using the daily pass , otherwise its not cheap.Lot of people, but not very crowded, fantastic look into Lisbon."
        }, 
        {
            "index": 225, 
            "rating": "4", 
            "review": "Lisbon at your feet. Two level viewing point. You have a wonderful view on Tagsu River, Avenida Liberdade, Cathedral Se, and Saint George Castle too. The lower level is full of statues, on the upper level a statue of Eduardo Coelho, who was founder of a newspaper. A nice fountain is also here at the upper level. But the main reason to come and see, this the the view."
        }, 
        {
            "index": 226, 
            "rating": "5", 
            "review": "Fantastic view of the city. great views of the castle. Lovely place to sit. Just at the top of the Gloria elevator. Orientation board to help identify points of interest."
        }, 
        {
            "index": 227, 
            "rating": "5", 
            "review": "Great view point. A great viewpoint to see the city, there're some kiosks nearby so u can spend your whole afternoon there with a great view n some drinks."
        }, 
        {
            "index": 228, 
            "rating": "5", 
            "review": "Alcántara Miradouro. Superb view! Take a little picnic, some chilled Vinho Verde and enjoy the early evening view on the Tagus, the 25 April Bridge...the ferries and sailboats...the city's roof tops..."
        }, 
        {
            "index": 229, 
            "rating": "5", 
            "review": "The most romantic view of Lisbon and St Jorges Castle. It shows Lisbon from its best point and it is great to look at the Castle and Alfama and Rossio with Bairro Alto and buzz behind the Gardens and the statue of the real life size of a Lisbon boy newspaper seller"
        }, 
        {
            "index": 230, 
            "rating": "5", 
            "review": "Breathtaking view over the city. Excellent view over the city and river. Lot of room to have a seat and now also with a small coffee kiosk."
        }, 
        {
            "index": 231, 
            "rating": "4", 
            "review": "Our first evening in Lisboa & we found this magic place. Our first evening in Lisboa & we found this magic place. The views over Lisboa are fantastic. There were market stalls selling bric-a-brac, food, clothing bags etc. An elderly man was giving free tap dance classes. The cafe was very busy with a race for a table or for take aways. There was an area with music where people were dancing their time away. We returned here on a few journeys back to our apartment."
        }, 
        {
            "index": 232, 
            "rating": "5", 
            "review": "Worth a visit. Beautiful views of the city. From here you can see from the top the St. George's castle and water. Buy a coffee, sit, and relax!"
        }, 
        {
            "index": 233, 
            "rating": "4", 
            "review": "Lovely views. Stunning views across to the Castle, nice garden with bar facilities. Quieter than some other Miradour's, especially at night, but the castle at night is the attraction."
        }, 
        {
            "index": 234, 
            "rating": "4", 
            "review": "Always a great stop before heading into Bairro Alto for drinks. Stop here for views over the Castle, not that Lisbon is shy of viewing points. I always stop here for an expresso in the gardens before making my way to the busy bars of bairro alto."
        }, 
        {
            "index": 235, 
            "rating": "4", 
            "review": "Peaceful and Pleasant. A chilling space with a cracking little cafe used by tourists and locals alike with spectacular views of the city, it's easily accessible from Principe Real and via tram from Avenida Liberation it can be windy however the cafe will provide a shawl to keep you snug. Don't hesitate to visit and while away the hours."
        }, 
        {
            "index": 236, 
            "rating": "5", 
            "review": "What a view !!!. Excellent place for morning coffee due to great view and relaxed athmosphere. Is easy to reach by tram, but also walking from Avenida metro station"
        }, 
        {
            "index": 237, 
            "rating": "5", 
            "review": "perfect view with relaxing atmosphere. I enjoyed wide view on Lisbon, at small but peaceful park. When I got there, a street musician sing a song wth playing a guitar. This music also provided relax with spring breeze and shine."
        }, 
        {
            "index": 238, 
            "rating": "4", 
            "review": "Wonderfully picturesque views. Splendid views of the central parts of the city including Castelo de São Jorge. Seemingly a a popular place among the locals as well as tourists, the terrace attracts local artists and musicians who contribute to the atmosphere. The garden itself isn't huge but there are lots of benches - given the time, one could easily spend a couple of hours here with a newspaper or a book. Just don't forget to bring a camera. :)"
        }, 
        {
            "index": 239, 
            "rating": "4", 
            "review": "Perfect spot for views of Lisbon. This popular kiosk has a menu for light lunch items and snacks and a full bar. It is a lovely place to rest after a day walking the hills of Lisbon. Popular with locals and tourists, you may have to wait for a table. But there is a to-go window if you prefer to eat and drink on a park bench."
        }, 
        {
            "index": 240, 
            "rating": "5", 
            "review": "The nicest view of Lisbon. A stop at the Miradouro Sao Pedro de Alcantra, with a fresh orange juice and a pastel, is the best way to feel the quite buzz coming from the city. A calm contemplation of its inner qualities."
        }, 
        {
            "index": 241, 
            "rating": "5", 
            "review": "Tip: Take the metro to Rato, and walk downhill to enjoy the fantastic views here!!!. With picturesque views of the city, this is undoubtedly one of the best miradouros in Lisbon (and free of course!). It is a great place to people watch, and from mid-afternoon, you will have the sun behind you, as you enjoy the fantastic views. There are plenty of places to enjoy refreshments, along with numerous artists selling local artwork. My advice would be to take the metro to Rato Metro Station, and from there walk downhill to Miradouro Sao Pedro de Alcantara. Much easier that way, without arriving completely exhausted... enjoy!"
        }, 
        {
            "index": 242, 
            "rating": "3", 
            "review": "Great view. This is one of the best known miradouros of Lisbon and gives a good view on the castle and Baixa. Nevertheless, always very crowded and a little dirty (for Lisbon-terms). One of the best things to do here is get yourself a take-away box of Sushi at the sushi-place nearby and sit on one of the picnic tables. Remember to bring a bottle of wine and you have a perfect evening! Watch your bag/pockets!!"
        }, 
        {
            "index": 243, 
            "rating": "4", 
            "review": "Quiet park with terrific views, very relaxing, with cafe.. You can sit on the fountain, or down below in the park, or up on the terrace, or in the cafe.. mixed people, nice spot, even with locals and kids. Fun to go up to with the cable car and then onward up to the barrio alto!"
        }, 
        {
            "index": 244, 
            "rating": "5", 
            "review": "Stunning Views over Lisboa. Don't miss this beautiful Miradouro when you're in the Biarro Alto neighbourhood, its simply stunning. Beautiful little park, plenty of benches to rest your weary calf muscles (if you've walked up like we had), there's usually someone with a guitar there singing their heart out, adding to the mood. Enjoy the fabulous views over Lisboa and the castle, you won't regret it!"
        }, 
        {
            "index": 245, 
            "rating": "5", 
            "review": "Stunning views . Just breathtaking views of Lisbon city. Pleasant park and lovely time spent with friends. Well worth a visit you will be just amazed at the beauty of the city"
        }, 
        {
            "index": 246, 
            "rating": "5", 
            "review": "Breathtaking. First time in there, I was trully amased by the view! Incredible! Think it is better than Graça Miradouro. If you are visiting Bairro Alto, dont miss ir!!"
        }, 
        {
            "index": 247, 
            "rating": "5", 
            "review": "You wouldn't expect a view like that!. I stayed just across the park from this \"miradouro\" and didn't know it was there. I just expected view points somewhere higher in the city, however, if you're visiting Bairro Alto, don't miss this small park with a breathtaking view."
        }, 
        {
            "index": 248, 
            "rating": "5", 
            "review": "Wonderful city view. It's well located, with a wonderful view, places to drink something and benches to seat and watch the view or read a nice book"
        }, 
        {
            "index": 249, 
            "rating": "3", 
            "review": "Nice view over the old city and the castle. This square offers a view over the old city and is situated opposite the castle. It is usually quite full of tourists and street musicians. Unfortuntely its walls are full of tags and the lower part of the square is rather dirty."
        }, 
        {
            "index": 250, 
            "rating": "4", 
            "review": "The finest view to Castelo de S. Jorge. Castelo de S. Jorge dominates Lisbon's landscape. It's a classic and with large merit. To take a good look at it and cover also a good portion of one of Lisbon hills, you must pay a visit to Miradouro de São Pedro de Alcântara. As the garden is medium sized and it is fresh and beautiful, I invite you to carry with you a good lot of newspapers and a book and enjoy your stay for a few hours. It will pay you back for sure."
        }, 
        {
            "index": 251, 
            "rating": "5", 
            "review": "Super views and orange juice. Lovely atmosphere at this Miradouro with super views. The café serves great freshly pressed orange juice.\nThe area around the funicular base station to take you there was marred by graffiti - a problem in many areas of Lisbon."
        }, 
        {
            "index": 252, 
            "rating": "5", 
            "review": "Excellent view - maybe the best. Our tour guide took us to this area to take pictures. It has a great view. You can see a great part of the city from this area,"
        }, 
        {
            "index": 253, 
            "rating": "4", 
            "review": "take the funicular. Don't go to the burger hill place at the top!!!!!\nLovely views! We took the funicular up from the main street using our 24hour cassis card (such a bargain). Good place to start a stroll around Bairro Alto or up to the Botanical Gardens:"
        }, 
        {
            "index": 254, 
            "rating": "4", 
            "review": "2nd best mirador in town. In terms of panoramic views, this one is the 2nd best after the mirador in Alfama. The views are nice but you don't get as much detail and color as in Alfama. I believe this mirador was featured in the movie \"night train to Lisbon\""
        }, 
        {
            "index": 255, 
            "rating": "5", 
            "review": "Wonderfull vue of Lisbon. A place to visit and to have a wonderfull vue of Lisbon Donwtown with the Castle, and all the historic center. Near there is Solar do Vinho do Porto, where you can taste some of the best Oporto wines!"
        }, 
        {
            "index": 256, 
            "rating": "5", 
            "review": "Excellent view of the city!. Top-top view point if you want to see the whole city and the castle along with the river side. Must visit in Lisbon."
        }, 
        {
            "index": 257, 
            "rating": "4", 
            "review": "Great place to sit and take in the view or a drink. At the top of the Gloria funicular this two-level park offers great views over the city. There are places to sit in sun and shade, and a kiosk serving beers, coffees, small snacks, etc. Popular for photo-taking or just sitting or strolling. Worth the climb (or the extortionate fee for the funicular)."
        }, 
        {
            "index": 258, 
            "rating": "5", 
            "review": "Gorgeous view. Gorgeous view of the castel and downtown. Very well kept with little bars and fountains! Love it. Take a cab or transport because it's pretty hard to park you car"
        }, 
        {
            "index": 259, 
            "rating": "5", 
            "review": "Great view!. One of the best views of the city! So easy to get to, I went in the morning and evening, It's even better at sunset!"
        }, 
        {
            "index": 260, 
            "rating": "5", 
            "review": "Simply beautiful!. What a place, what a view. Such fantastic vista of part of the city of Lisbon with River Tagus in background. Tea and coffee kiosks around. Ride up the place in tram and enjoy the absolutely marvellous view."
        }, 
        {
            "index": 261, 
            "rating": "5", 
            "review": "Beautiful park. Such a beautiful park by our hotel! We came here after having breakfast and took in the views, the lush gardens and the play area for the kids. I enjoyed it, because in the midst of chaos and rowdy city streets, stands this place where it's serene and just beautiful. A nice mix of the city and garden in one. I wished we got to stay longer, because we had to go on a tour and stumbled upon this place. Definitely a nice stop for a picnic."
        }, 
        {
            "index": 262, 
            "rating": "4", 
            "review": "Beautiful view. In March, around 4 PM, there always was a beautiful view of the city and the Castelo Sao Jorge. It is a nice view point of the Castle and the sea, and there is a small counter for drinks. On nice days, the light is beautiful and there was a guy playing music."
        }, 
        {
            "index": 263, 
            "rating": "5", 
            "review": "Cocktails with amazing view. Went to the Kiosk (Quisque) at this miradouro and bought a Caipirinha and a Porto Tónico with my daughter, with a fabulous view of all Lisbon, including the Castelo de Sao Jorge (St George's Castle)"
        }, 
        {
            "index": 264, 
            "rating": "4", 
            "review": "great views of the city, nice place to sit & chill. with sweeping views of the town looking east towards the Castle this is a great place to be in the mid to late afternoon as you will have the sun at your backs as you look out over the city. Plenty of places to eat and drink, buskers and artists selling paintings etc."
        }, 
        {
            "index": 265, 
            "rating": "4", 
            "review": "Indeed a Great View. I would say this was just as good as any of the other viewpoints around Lisbon. They all show the same center core and great panoramic. My wife and I were just walking by here on the way to the water museum so it was definitely a nice surprise but I didn't think it was that much better than the view from St. George's castle."
        }, 
        {
            "index": 266, 
            "rating": "4", 
            "review": "Another awesome view of Lisbon. An hipster area with an amazing view over Lisbon Tagus River. Sit down if the grass, grab a beer and enjoy the random music portuguese imigrants play in this beautiful place"
        }, 
        {
            "index": 267, 
            "rating": "4", 
            "review": "Excellent view. As others have said, one of the better viewpoints in Lisbon, with a nice little park and a café. Best reached by the funicular from Restauradores. The tile-panel guide to the skyline is quaint but sadly out-of-date!"
        }, 
        {
            "index": 268, 
            "rating": "5", 
            "review": "One of the best Miradouros. This Miradouro is great as it also has some park / gardens on top of the great great great view. The atmosphere is great an we stayed quite late although I would be more careful if alone, especially if you are a girl (sadly) as it is not completely visible from the street. As usual with Lisbon sights, worth the walk!"
        }, 
        {
            "index": 269, 
            "rating": "5", 
            "review": "miradoura. Lovely view,use the funicular to get up there and take plenty of pics. After go on the pavement at the rear and down the slope is the Instituto dos vinhos do porto. Read about it elsewhere, that alone is worth the trip."
        }, 
        {
            "index": 270, 
            "rating": "5", 
            "review": "Beautiful view over the city.... If you go to the Miradouro de Sao Pedro de Alcantara you will have one of the beutiful view over the city of Lisbon... definitely worth the visit.. If you do not want to walk to the miradouro you can get the Elevador da Gloria that departs from Praca dos Restauradores and have a different transport experience..."
        }, 
        {
            "index": 271, 
            "rating": "4", 
            "review": "Nice place to see Lisbon in evening. We went here during sunset time.\nIt is a nice place to see overall Lisbon city from here.\nYou can see Castelo de Sao Jorge also in other side.\nThe best way to come here is by using the famous Elevador da Glori from town around Restauradores metro.\nFrom here you can go enjoying Bairro Alto area."
        }, 
        {
            "index": 272, 
            "rating": "5", 
            "review": "the best spot. one of the best spots in lisboa! you can sit here and enjoy a lovely view over this awesome city. get a drink and sitting here in the evening. but be careful"
        }, 
        {
            "index": 273, 
            "rating": "4", 
            "review": "Lovely Viewpoint. Found this viewpoint by chance after riding on the Elevador da Gloria. Lovely views across to the casle. The viewpoint has two levels of gardens with benches and the upper level also has a small food/drink stall."
        }, 
        {
            "index": 274, 
            "rating": "4", 
            "review": "Beautiful. I stumbled upon this overlook after dinner when i was wandering around Lisbon to take night photographs. It provides an amazing view over the city with a fantastic view of the castle, especially at night. Nearby there is a small garden terrace, beautiful fountain and one of the neat trams to take you up and down the step hill, where you can get a view of Lisbon's modern urban art gallery. A neat site to see as well. One of my favorite parts of Lisbon. Safe travels!"
        }, 
        {
            "index": 275, 
            "rating": "5", 
            "review": "Perfect view!!!!. One of the best views in Lisbon!! Unlimited view in the castle of Sao Jorge and the downtown center! Many benches to sit and relax, especially in the summer, autumn and spring times, Also a very nice quiosque to sit and have a nice drinl. Enjoy"
        }, 
        {
            "index": 276, 
            "rating": "5", 
            "review": "Wonderful Place to Relax. This is one of the nicest lookouts in Lisbon. It's set up in two tiers and both are dotted with benches, so there is plenty of space to sit down and relax. On the upper level, there is a small snack bar. This lookout is close to Barrio Alto, a happening neighbourhood in the evenings, so if you come here in the evenings or weekends, expect lots of activity and large groups of young people singing and playing guitar. The view of St.George Castle is magnificent and the river is visible as well, so it makes for a very nice photograph. One may bring some picnic or wine here and just sit and enjoy the view. Very lovely. There is a funicular very close by, so one can take it up and end up close to the lookout. Because of the lights around St. George Castle at night, this lookout is even nicer in the evening - go both during the day and in the evening if you can. I've attached a few photos taken from this lookout. For more photos, you can see my entire Lisbon album at: https://www.flickr.com/photos/little_baklava/sets/72157648122958913/"
        }, 
        {
            "index": 277, 
            "rating": "5", 
            "review": "Fantastic views!. Beautiful viewing point, definitely worth a visit for sunset. Cafe where you can order a delicious hot chocolate or giant gin & tonic!!! They have other beverages but they were my favourite! Bring your camera!"
        }, 
        {
            "index": 278, 
            "rating": "5", 
            "review": "Perfect Viewpoint. Classic view from Bairro Alto over the city to the Sao Jorge Castle. Worth the climb or take the funicular."
        }, 
        {
            "index": 279, 
            "rating": "5", 
            "review": "One Of THE BEST Panoramic views. One of my ultimate favorite views and a great place to kick back for a coffee or cappuccino and gaze ahead at the gorgeous hues before your eyes .Don't forget the lower level and while in the neighborhood, hook a ride downtown on the trolley. .historic and fun!!"
        }, 
        {
            "index": 280, 
            "rating": "5", 
            "review": "Great view, many benches. This is a great view for a picnic. Large viewing area, many benches, and if you're lucky, a guitar player. Buy some bellota, cheese, and olives at the Mercato Ribeira, bread at a panadeira, and enjoy lunch with a beautiful sunny view."
        }, 
        {
            "index": 281, 
            "rating": "4", 
            "review": "Great view for free!. It has a great view of the eastern part of the city: castle and old town. I went there at sunset but I found out that with the castle in the way I won't see the sunrise so I went down to Cais de Sodre and from there is was amazing. This miradouro is a good place to see the city at daylight!"
        }, 
        {
            "index": 282, 
            "rating": "5", 
            "review": "nice view. really nice view and very easy to reach the place if you go up Bairro Alto, its also very near to Pavilhão da China, a tea house full of little collections from china and other places"
        }, 
        {
            "index": 283, 
            "rating": "4", 
            "review": "One of the mirador of Lisbon. If you are visiting Lisbon, a must to do is probably to pass by most of city's mirador. To me, this one is the best."
        }, 
        {
            "index": 284, 
            "rating": "5", 
            "review": "Amazing views. This is one of the great place to have a view over Lisbon. Nice café nearby for a rest. From here you can see the St. Jorge Castle, the “Baixa” (as they call it) and the Liberdade avenue all the way up to the Eduard the 7th parquet. A really nice place to go to."
        }, 
        {
            "index": 285, 
            "rating": "5", 
            "review": "One of the best views of Lisbon!. Great views, what more can be said? You can see the city and the water as well. Very beautiful. Gives you a great panoramic vista. You can see many of the cathedrals and the castle as well."
        }, 
        {
            "index": 286, 
            "rating": "5", 
            "review": "Great view. lovely little garden, two levels, with great view on the castle, on the Miradouros of Graça, and of Sra do Monte.And a viés on town and the Tejo. Great kiosque.Surroundings are interesting."
        }, 
        {
            "index": 287, 
            "rating": "5", 
            "review": "One of Lisbon's great views.. At the top of the cable car. Very lovely. Next to teeming and very cool Bairo Alto. Acts as the front yard and garden for the great Independente Hostel & Boutique Hotel. Very romantique spot."
        }, 
        {
            "index": 288, 
            "rating": "4", 
            "review": "Another great view. Another place that offers a great view of Lisbon. With some much to offer the view are great. Best on a nice sunny day"
        }, 
        {
            "index": 289, 
            "rating": "5", 
            "review": "Wonderful. You have some nice view of the Baixa (Downtown) and can also have a coffee or a ginja (portuguese cherry licquor). It's really a nice place and not overcrowded by tourists."
        }, 
        {
            "index": 290, 
            "rating": "5", 
            "review": "Beautiful views. Just beautiful views during the day and night. Lovely walk through little streets, lovely architecture."
        }, 
        {
            "index": 291, 
            "rating": "5", 
            "review": "Lisbon at your feet. Wonderful place to see the ancient Lisbon in the popular Bairro Alto district where you can find lots of Restaurants and Bars. The place was renewed a year ago and as a lot of animation with music and a nice coffee shop to get a warm snack, now that is almost winter."
        }, 
        {
            "index": 292, 
            "rating": "4", 
            "review": "Great view over lisbon and Tejo river. You have a great view from part of Lisbon and Tejo river in front of view. Very calm , relaxing and wonderful place for 30m to appreciate the beauty all around.It is a very nice sightseeing place in Lisbon. One of the best in mine opinion (but are more !).You have a esplanade and a small bar around where you can buy a beer and ... enjoy the view for the next half hour.Must visit it."
        }, 
        {
            "index": 293, 
            "rating": "5", 
            "review": "garden with a view of the lisbon city!. The Glória Funicular at Restauradores Square (Restauradores metro station) took us directly to this place. Beautiful garden with a view of the entire city!"
        }, 
        {
            "index": 294, 
            "rating": "5", 
            "review": "Absolutely Gorgeous. Beautiful views of Lisbon. There's also a lower level with benches to relax, have a snack and enjoy the views."
        }, 
        {
            "index": 295, 
            "rating": "3", 
            "review": "beautiful view. take a walk there, or go by the funicular it´s a beautiful view over the city, and the castle on the other side"
        }, 
        {
            "index": 296, 
            "rating": "4", 
            "review": "Good city view. I have been there many times while that year when I was living in Lisbon for one year, it's a nice city view, you can also go there on weekend evening to enjoy some drinks with your friends, 'cos drinking on the street is totally legal in Lisbon, specialy sunset time might really nice :)"
        }, 
        {
            "index": 297, 
            "rating": "5", 
            "review": "Marvellous. This is absolutely my favourite one in lisbon!!! Good either you're with some friends drinking beer or alone reading a book during a lazy afternoon"
        }, 
        {
            "index": 298, 
            "rating": "5", 
            "review": "A must!. Definitely one of the best places in the city for me. Amazing view of the castle, the cathedral and the river, and right next to Bairro Alto. Has a lovely garden to enjoy the sun in."
        }, 
        {
            "index": 299, 
            "rating": "4", 
            "review": "great views. on a clear day, can get a great view of sao jorge castle, the tejo river, and baixa. close to a lot of sights like sao roque chuch, port wine institute, cafe trinidade."
        }, 
        {
            "index": 300, 
            "rating": "4", 
            "review": "lovely. This is next to our hotel.We came up here several times.Very pleasant. Safe and clean with a view of the old city.Nice cafes and restaurants nearby."
        }, 
        {
            "index": 301, 
            "rating": "5", 
            "review": "Lisbon in my Hand. A great place to see a big part of the Lisbon beauty. The Castle in front and down town approaching the river Tagus. No to forget and take a chance to visit Bairro Alto and Principe Real."
        }, 
        {
            "index": 302, 
            "rating": "4", 
            "review": "Good views of Baixa and Alfama. Good views of Baixa and Alfama from Chiado. Not far from night restaurants and bars and Campo Real shops."
        }, 
        {
            "index": 303, 
            "rating": "3", 
            "review": "Great view BUT.... Geat view Lisbon BUT it is overcrowded and touristy and there are a few ugly new warehouse type buildings in the foreground which spoil the view a bit."
        }, 
        {
            "index": 304, 
            "rating": "4", 
            "review": "Lisbon Does This So Well.... ...Sitting little parks at well judged vantage points over the City. This a small area on two levels shaded with trees, serenaded by a fountain and amply provided with benches. The view during daytime is splendid and even better after dark. There is a small cafe with prices a tad above average."
        }, 
        {
            "index": 305, 
            "rating": "5", 
            "review": "Fantastic place, amazing view!. To get to the Miradouro you have the option of using the Gloria Elevator or, if you prefer, you can climb on foot. Either way, you will be presented with a gorgeous view of Lisbon, a peaceful small garden with benchs to relax, and a very picturesque atmosphere. The only downside (that didn't spoiled the fun) are the souvenirs sellers that are sometimes inconvenient and insistent. Apart of that, just be aware of pickpockets, specially on the Elevator."
        }, 
        {
            "index": 306, 
            "rating": "3", 
            "review": "Nice view. Nice view, nothing much to do though. I preferred the views from the other side of the town. It makes an intereting pictures, but you basically see just loads of roofs."
        }, 
        {
            "index": 307, 
            "rating": "5", 
            "review": "Need to see it during the night. It`s a great place to start your walk through Chaido and Bairo Alto, also it really beautiful during the evening and the night, you can see Alfama, the river, and the newest parts of Lisbon too."
        }, 
        {
            "index": 308, 
            "rating": "4", 
            "review": "Scenic spot, perfect for downtime. I was lucky enough to be staying at the hostel just across the street, so I spent lots of time in the park admiring the views of the city below. Perfect spot to read, people watch and just relax after a long day of sightseeing. Grab some coffee (or wine) from the on-site (slightly overpriced) cafe and enjoy some fado from the performers who call the park their stage."
        }, 
        {
            "index": 309, 
            "rating": "5", 
            "review": "Great view. A small park near Bairro Alto with a grewat view over Lisbon where you can seat and relax, near the nightlife."
        }, 
        {
            "index": 310, 
            "rating": "5", 
            "review": "Great photo opportunity with wonderful views of Lisbon.. Perfectly positioned around halfway between Marques de Pombal and downtown Lisbon, take a coffee or a beer and relax for a while while looking out over the city. The funicular runs down from here too. Great pictures to be had from the balcony and the gardens are delightful."
        }, 
        {
            "index": 311, 
            "rating": "5", 
            "review": "This is a nice place for a good view.. This is a nice place for a good view and it's free. You can sit down on a bench and you can listen to the streetmusic."
        }, 
        {
            "index": 312, 
            "rating": "4", 
            "review": "Nice little Square, take the Gloria Funicular. There are several ways to get to this Square containing the Miradour. We opted to take the Gloria Funicular which is opposite the square from the Hard Rock Cafe (pay the driver, approx 3 euros each way). The tram runs every 15-20 minutes. There are 2 funiculars and only 2 stops. If one funicular is at the top, the other is at the ground level.There are cafes and restaurants at the top. We arrived at 10 am so many of the eateries were still closed. There are many park benches on both the tree-shaded upper level and the garden-like lower level to sit and enjoy the views."
        }, 
        {
            "index": 313, 
            "rating": "5", 
            "review": "Romantic. Beautiful view. Must be even more romantic in the evening. Many restaurants on the hill! The tram takes you up the hill as it is very steep but don't both paying for it as it is not worth it. We had a travel card that's why we hoped on. But it is maybe a 15 min walk but a 2 min tram ride (waste of money really)"
        }, 
        {
            "index": 314, 
            "rating": "5", 
            "review": "Amazing view over the city!. Nice spot in Lisbon, offers you an amazing view over the city! Next to some of the best restaurants in Lisbon and Bairro Alto, famous for its bars and clubs."
        }, 
        {
            "index": 315, 
            "rating": "5", 
            "review": "Lovely peaceful views a stones throw from central bairro alto bars. Lovely view, right round teh corner from our apartment in central Bairro Alto. I wouldnt necessarily trek here form the other side of the city, but if in the neighbourhood I would stay a little longer to catch the view at dusk or at night. The bars on neighbouring streets do take away cocktails so grab one and bring it with you! There is also a cafe here serving drinks and snacks til late."
        }, 
        {
            "index": 316, 
            "rating": "4", 
            "review": "Panoramic view. Wonderful guitarist singing while we admired the view! We had been walking for miles so it was a great place to stop and rest..."
        }, 
        {
            "index": 317, 
            "rating": "4", 
            "review": "Great View even in the Rain. My friend and I climbed up to this view point on a rather overcast evening, but the view was still pretty spectacular and there were a good number of people. There is a nice little garden and lots of places to take a load off after climbing up the massive hill (if you didn't take the Elevador da Gloria up)."
        }, 
        {
            "index": 318, 
            "rating": "5", 
            "review": "Great view of the city. Really nice view point of the city. There are numerous cafes nearby where you can grab a beer, sit at the stairs and enjoy an amazing sunset on lisboa. You get a great view of the sea and the alfama area."
        }, 
        {
            "index": 319, 
            "rating": "5", 
            "review": "View of Alfama. Sensational views of the Alfama and the baixa areas. Also a nice cafe to relax with the view and people watch."
        }, 
        {
            "index": 320, 
            "rating": "5", 
            "review": "Best viewpoint of lisbon. For everyone who visits lisbon.This is probably the best viewpoint of Lisbon. Very beautiful in indeed. Go by food ( a lot of stairs but again an experience on its own ) - or take of one the 2 famous elevators You can drink here also here a beer for 1 euro a beer. There are also some lounge chairs.BE AWARE FOR PICKPOCKETS & PEOPLE WHO WANT TO TALK WITH YOU. They are all after your money..."
        }, 
        {
            "index": 321, 
            "rating": "4", 
            "review": "A beautifull view. Worthwhile to go there and enjoy the beautifull view of Lisbon. Bring your camera. Go downstairs to enjoy the beuatifull peacefull garden too.."
        }, 
        {
            "index": 322, 
            "rating": "5", 
            "review": "nice view. was very nice experience, nice view you can see from the Miradouro, we took the Gloria elevator is a small tranway, tipical from Portugal, wonderful sunset, incredible collors ...."
        }, 
        {
            "index": 323, 
            "rating": "5", 
            "review": "Beautiful Views. There are a few ways to get up to the Miradouro, but the nicest is to walk from the Baixa / Chiado areas passing through the lovely neighbourhoods and stopping every now and then for a coffee or a beer or just to watch the world go by. Definitely worth the effort to get there and if you cant make the walk back down hill, the tram is right next door."
        }, 
        {
            "index": 324, 
            "rating": "5", 
            "review": "The best karma do end the day. As I was staying not far from this, it became a ritual after a day of exploring, as the sun set over this amazing city, tranquility all round,  I miss it now."
        }, 
        {
            "index": 325, 
            "rating": "4", 
            "review": "Pretty! Free view of the City!. We stumbled upon this by accident after viewing the city from the Santa Justa Elevator. This was so much better because it was free and you did not have to wait in line. I wish I had seen this first! It is a nice place to take a break and eat a pastry!"
        }, 
        {
            "index": 326, 
            "rating": "4", 
            "review": "Great viewpoint of the city. Great place to understand the layout of the city and see an overview of the city. The area around the viewpoint is also fun for shopping."
        }, 
        {
            "index": 327, 
            "rating": "5", 
            "review": "Where to start your evening at cosmopolitan Lisbon. This is a belvedere, a garden and certainly the right place to start your evening at Lisbon's ebullient quarter of \"Bairro Alto\", where restaurants, cafés and discos complete the scene. But, the \"Miradouro São Pedro de Alcântara\" can be visited at any time. Beautiful, manicured and shaded gardens, with attractive benches, are an invitation to self reflection and peaceful thoughts. At sunset, the magical moments of seeing Lisbon's lights being turned on. Amazing! Lovely views of the quarters of \"Graça\" and \"São Vicente de Fora\", as well as of the \"Castelo de São Jorge\", with the scenic lighting of its walls. Enjoy!"
        }, 
        {
            "index": 328, 
            "rating": "5", 
            "review": "Mandatory Lisbon view point.. In the hill in front of the castle and of other marvelous view-point (Senhora do Monte). Contemplation."
        }, 
        {
            "index": 329, 
            "rating": "5", 
            "review": "Peace Heaven. Excellent view all all hours of the day, if you want to go end of afternoon stop at the refreshment stall at the back and enjoy one of the Mojito or Caipirinha, you will not regret it."
        }, 
        {
            "index": 330, 
            "rating": "5", 
            "review": "Nice view. Great view on all Lisbon, meeting place for Bairro Alto bars. You could buy drinks on Bairro Alto and drink it on this nice miradouro."
        }, 
        {
            "index": 331, 
            "rating": "4", 
            "review": "Stunning. This is a really good place to relax grab a coffee and enjoy the views over the city, especially after walking up so many steep hills."
        }, 
        {
            "index": 332, 
            "rating": "5", 
            "review": "Wanted to stay there for a while.... We visited Elevador da Bica and Miradouro Santa Catarina where we had a coffee and walked afterwards though Bairro Alto to Rue Sao Pedro da Alcantara to Miradouro Sao Pedro de Alcantara. This Miradouro Sao Pedro de Alcantara is even better than the Santa Caterina view.The park at the Miradouro is a wonderful setting. There is a detailed tile map displaying what you are looking at from the park's perspective."
        }, 
        {
            "index": 333, 
            "rating": "5", 
            "review": "Pretty!. Great views and we bought a lovely painting from an artist there too. We walked up a different way rather than take the elevator and it wasn't too hard a walk. It's also a nice spot to sit for a minute and relax after a lot of exploring in Lisbon."
        }, 
        {
            "index": 334, 
            "rating": "5", 
            "review": "Take a break in this beautiful place. Everytime a friend comes to visit Lisbon, this is the place we go before heading to Bairro Alto. Has an amazing view and it's the perfect spot to take grab a drink and take a break from the lively nightlife."
        }, 
        {
            "index": 335, 
            "rating": "5", 
            "review": "Great Views!. We rode the Santa Justa Elevator to the Bairro Alto and walked by the Convento de Carmo ruins (1755 earthquake). We then continued our walk to the Sao Roque church and then to Miradouro Sao Pedro de Alcantara. A nice walk to get to wonderful views of Lisbon, the Cathedral and the Castle across the valley. The park at the Miradouro is a wonderful setting. There is a wonderfully detailed tile map displaying what you are looking at from the park's perspective. The map itself is a work of art! We took the Gloria elevator back down to complete our Bairro Alto stroll."
        }, 
        {
            "index": 336, 
            "rating": "5", 
            "review": "Great views. Take the Elevator da Gloria up and walk over to Miradouro Sao Pedro de Alcantara. Good views across Lisbon."
        }, 
        {
            "index": 337, 
            "rating": "5", 
            "review": "Amazing view!. The \"Miradouro Sao Pedro de Alcantara\", was built in the nineteenth century, it´s one of the most emblematic sights of the city, reopened totally renovated in February 2008. It´s situated close to Bairro Alto and overlooking the Avenida da Liberdade, offers one of the most beautiful panoramas of the city of Lisbon.Here you can see an amazing view of Lisbon! Very romantic at night!"
        }, 
        {
            "index": 338, 
            "rating": "5", 
            "review": "The best view of Lisbon. Fantastic gem that allows you to overlook the best marks of the Lisbon history. Specially beautiful at night."
        }, 
        {
            "index": 339, 
            "rating": "4", 
            "review": "Worth climbing :). Worth climbing :) But there also other nicer miradouros in town. If you like effort - do it for the fun of it."
        }, 
        {
            "index": 340, 
            "rating": "5", 
            "review": "Nice view. Nice view, you can see the city, castle ... and for free. After thant you can visit the Chiado and Bairro Alto"
        }, 
        {
            "index": 341, 
            "rating": "5", 
            "review": "view to a kill. Great views on to the castle, river and downtown Lisbon. Nice to see both during the day and the night. Get the using Elevador da Gloria."
        }, 
        {
            "index": 342, 
            "rating": "5", 
            "review": "Amazing view over Lisbon. It's in the centre of the city. You'll have an amazing view to Castelo de Sao Jorge. It's near Bairro Alto and the historical centre of Lisbon. Nothing more to say. You'll get to it the moment you start wondering around Lisbon. Plenty of people around, kids playing and musicians also playing music in Miradouro."
        }, 
        {
            "index": 343, 
            "rating": "5", 
            "review": "Uau! Lisbon is a delight :-). This sightseeing spot is really nice. Beautiful view over Lisbon downtown and also to other colines and to Castelo Sao Jorge... But it also ... the entrance to Bairro Alto! Lisbon is a delight :-)"
        }, 
        {
            "index": 344, 
            "rating": "4", 
            "review": "Great view. The Miradouro de São Pedro de Alcântara is a belvedere in Lisbon with a beautiful garden, the Jardim António Nobre. From here you have fine views over large parts of Lisbon.From the miradouro you have excellent views over the area, including the Baixa district, the area around the Avenida da Liberdade and the Tagus river. A funicular - the Elevador da Glória - connects the garden with the lower situated Restauradores Square."
        }, 
        {
            "index": 345, 
            "rating": "5", 
            "review": "1 of Lisbon's several magnificent viewpoints. Loved this one! It's an easy ride up from the Restauradores metro stop on the funicular (a little hard to find, but it's on a side street off of Av. da Liberdade), or a steep walk uphill from the Bairro Alto. We were in Lisbon during an unusually hot stretch in June (95 F every day), so the lovely park with lots of glorious shade and a fountain was a welcome sight. I particularly like this lookout spot because you can see the water, the Alfama, and the Baixa Chiado from here. Unfortunately the top of the Rossio train station is quite prominent and is hideous. But just look beyond that and pretend it's not there :)After taking in the view here, we walked down the Rua da Misericordia into the heart of the Bairro Alto. All in all, the trip up and then down made for a very pleasant afternoon.* If you like my review, I appreciate you clicking the 'helpful' button; those of us who take the time to write reviews live for those and it motivates us to do more :) *"
        }, 
        {
            "index": 346, 
            "rating": "4", 
            "review": "One a the romantic Miradouro's. Here we came with our guide from The Lisbon Experience, we drunk a great limonade and overlooked the amazing city of Lisbon.A moment of joy and happiness."
        }, 
        {
            "index": 347, 
            "rating": "4", 
            "review": "Superb Views. Well worth a visit, even just to sit for half an hour and watch the view, easy to get to right at the top of the Gloria funicular."
        }, 
        {
            "index": 348, 
            "rating": "5", 
            "review": "Great view over the Baixa quarter. Great View over Lisbon (Baixa quarter).Its the second best belvedere after Sao Jorge's castle!! The view is even more attractive at sunset or by night when the castle is floodlit. Also at night the terrace becomes a popular outside meeting for young ppl, really close to night-out streets of Bairro Alto."
        }, 
        {
            "index": 349, 
            "rating": "5", 
            "review": "One of the best views. This is one of the best places to see lisbon. The view is amazing.This garden is perfect for a rest when visiting bairro alto or chiado área."
        }, 
        {
            "index": 350, 
            "rating": "5", 
            "review": "Beautiful vista of the city. Beautiful little plaza with fountain and open-air cafe, providing an almost panoramic view of the central neighborhoods of the city. I was just wandering around the city by myself on my first day in Lisbon and came across this place, and was very happy to sit for a while, take in the views, and do some people-watching. It's great that the city provides these vista points."
        }, 
        {
            "index": 351, 
            "rating": "5", 
            "review": "Great views day or night not to be missed. Great to enjoy views over the city, you can see the castle almost at the same level as the belvedere , great atmosphere with lights and a couple of quiosques servicing drinks. A must if you around Baird alto. Very good for any time of trip and specially for romantic stays."
        }, 
        {
            "index": 352, 
            "rating": "5", 
            "review": "fantastic place. It's wonderful part of Lisbon. We lived nearby and every day walked narrow streets, lidtening to Fado music (sometimes even couldn't sleep because of it:-). I liked Alfama the most in Lisbon, definetely worth to visit. But be ready to climb so no high heels :-)"
        }, 
        {
            "index": 353, 
            "rating": "5", 
            "review": "Nice view. In Lisbon you will find several sites where you can have a look over the city. This one can be reached by a cable car."
        }, 
        {
            "index": 354, 
            "rating": "5", 
            "review": "Good views. The castle perched on the hilltop is a great place for views all over Lisbon. The castle and walks are well preserved and is very interesting to have a look around."
        }, 
        {
            "index": 355, 
            "rating": "5", 
            "review": "Very romantic garden. One of the best views of the city\nLots of benches are there to welcome to watch the city and beautiful castle of Sao Jorge"
        }, 
        {
            "index": 356, 
            "rating": "4", 
            "review": "Beautiful place. It unravels a beautiful view of the city, including the Saint George Castle. It's not hard to get to (take a funicular if you feel a bit lazy or tired) and from it you can get to the Bairro Alto very easily."
        }, 
        {
            "index": 357, 
            "rating": "3", 
            "review": "It gives a nice view. You can walk up the city streets or take a funicular to the site,\nThe area provides an interrupted view looking from north to South, to the castle.\nThere are two levels and I really liked the lower level as it allowed a better view to the water.\nA nice place to sit, especially in the evening"
        }, 
        {
            "index": 358, 
            "rating": "3", 
            "review": "Cool area to chill. Rode the tram up and got a really nice view of the city. Really nice restaurants around as well. Great area to hang with friends. Very peaceful. Pigeons in the summer are annoying though.."
        }, 
        {
            "index": 359, 
            "rating": "5", 
            "review": "one of my favorite views. The view is just amazing. You can enjoy the view on a bench or you can enjoy with a nice cold beer or a sangria. Go for it!!!!"
        }, 
        {
            "index": 360, 
            "rating": "5", 
            "review": "Must see. One of the best views in town! And in a very trendy spot. A must go place to have an overview on the downtown city."
        }, 
        {
            "index": 361, 
            "rating": "4", 
            "review": "real experience. We rode the Gloria funicular up to the St. Peter viewpoint. We were there with the locals enjoying the cool temps and view of the tagus river. We had a sandwich and glass of wine at the little cafe. A delightful experience"
        }, 
        {
            "index": 362, 
            "rating": "5", 
            "review": "One of the best photo spots in Lisbon. It's a very good place to visit, with a very nice view over all \"old Lisbon\" - The Castle, Rossio, Praça do Comércio, Alfama, etc."
        }, 
        {
            "index": 363, 
            "rating": "5", 
            "review": "Great spot to hang out by day and night. The view over Miradouro Sao Pedro de Alcantara is exceptional. You will feel like you are watching Lisbon from top of the world. This viewpoint is great place to meet up and hang out with your friends. There are many benches around. You can also bring your own drink and enjoy the jaw-dropping view with your fellows during the night time. This place is also next to Bairro Alto, you can simply walk to any restaurants or bars and let your night flow. Do not miss this spot!!!"
        }, 
        {
            "index": 364, 
            "rating": "5", 
            "review": "Unique view.. ...the all of Lisbon at your feet. Great views and a great experience. Just forgot my camera. A shame to miss that incredible light at the time."
        }, 
        {
            "index": 365, 
            "rating": "5", 
            "review": "Great view of the city's center. This is a great place to rest a little bit, between city walks... in different parts of the day you can get different lights and different results with your photography experiences... here you can take a drink and eat something simple... seeing great background!!!!"
        }, 
        {
            "index": 366, 
            "rating": "5", 
            "review": "Beautiful view of Lisbon. This is a place for a nice break during a busy traveling day. The view of Lisbon - castle and downtown - is amazing, and there's a beautiful tile panel that explains what we are looking at. And, to top it all of, you are just around the corner from several delicious restaurants, and next to a cable car that takes you to Lisbon's downtown. Particularly spacial at the end of the day/sunset."
        }, 
        {
            "index": 367, 
            "rating": "5", 
            "review": "Great views and food nearby. Nice place to just chii out, enjoy the views, have some food from the nearby restaurants and open a bottle of wine."
        }, 
        {
            "index": 368, 
            "rating": "5", 
            "review": "one of the top 10 spots in Lisbon. one of the top 10 spots in Lisbon! there are several miradouros in Lisbon one should visit, this is one of them giving a great view over the castle."
        }, 
        {
            "index": 369, 
            "rating": "5", 
            "review": "A lovely view and the perfect place for a drink and a quiet stroll in the city.. One of the best views in Lisbon and a great place to share a drink and a walk with friends on a summer's evening. It's easily accessible from Bairro Alto or Chiado and you can walk down the tram tracks to Restauradores too, though the climb up is very steep."
        }, 
        {
            "index": 370, 
            "rating": "5", 
            "review": "Elevated civic space close to a cluster of visitor attractions. Miradoura Sao Pedro de Alcantara is worth visiting on its own with its kiosk, postcard views east and south, the occasional musicians and other artists. For me it was also the first of a collection of many elevated viewpoints, and photo opportunities, including the Miradoura's, hotel rooftop terraces, and the tops of civic monuments. For Miradoura Sao Pedro de Alcantara there is also the proximity of Elevador Graca, Egreja Sao Roque, Bairro Alto, and for me, Cervejaria Trindade on Rua Trindade.Garry"
        }, 
        {
            "index": 371, 
            "rating": "5", 
            "review": "So cool at night. My boyfriend and I came here on a Friday night on the way to Bairro Altto and ended up getting out of the taxi early as we were intrigued by the big crowd around the sound of live music. What we discovered was a small band playing near the outdoor kiosk looking bar and people dancing with their shoes off. An absolutely awesome atmosphere accompanied by a beautiful view. Will definitely recommend anyone who wants to see the party scene of Lisbon to come here on their way to Bairro Altto!"
        }, 
        {
            "index": 372, 
            "rating": "5", 
            "review": "Lisbon's Best View. Right on top of the Elevador da Gloria, this is a great spot to see Lisbon from above. We went at sunset and it was absolutely beautiful."
        }, 
        {
            "index": 373, 
            "rating": "5", 
            "review": "wow .. At the upper end of the miradouro there's a Kiosk , and after looking at the beautiful city below and the S. George Castle infront of you , you can relax for a few minutes in an armchair under the trees , with an ice cold Sagres beer in your hand and happiness in your heart , before you continue up to explore the Bairro Alto neighbourhood ."
        }, 
        {
            "index": 374, 
            "rating": "5", 
            "review": "One of the best view over the city. Perfect spot to chill while exploring the city. Great views, especially as the sun starts going down."
        }, 
        {
            "index": 375, 
            "rating": "4", 
            "review": "Nice view of city. We didn't seek this area out but actually stumbled upon it. We only took a tram once on our seven day visit, so we climbed every hill there. This was one of them and I was delighted to sit and rest and enjoy the view. A sweet little park sits just below where people were walking their dogs. It was not crowded when we were there."
        }, 
        {
            "index": 376, 
            "rating": "5", 
            "review": "Speechless!. This place offers breathtaking views of Lisbon. Very lively square, always a lot of people. They also have a couple of nice cafes there and the staff speak very good english. A beer, great weather and fascinating views of the city: what else could you ask for?"
        }, 
        {
            "index": 377, 
            "rating": "3", 
            "review": "Relaxing spot, lovely view. We came across this miradouro by accident, whilst having a wander around the Bairro Alto. It is nice area to have a sit down and relax and admire the views.The views are not as impressive as other areas of Lisbon but it is very relaxing area and worth a visit if you are in the area.It is not, however, somewhere I would specifically seek out, but it was a nice surprise when we were out exploring the city."
        }, 
        {
            "index": 378, 
            "rating": "5", 
            "review": "Another wonderfull seightseeing in Lisbon. This place is special not only because of it´s view, but it´s near to Bairro Alto, an amazing place to have a night out with friends."
        }, 
        {
            "index": 379, 
            "rating": "5", 
            "review": "Delightful!. What a view! It was the first miradouro we visited, so a sentimental favorite as we got our first panoramic look. It's well positioned-- easy walks to other places you want to explore. The people watching with an adult beverage is a wonderful way to spend Lisbon time."
        }, 
        {
            "index": 380, 
            "rating": "3", 
            "review": "Not one of the best viewpoint in Lisbon. Not one of the best viewpoint in Lisbon but is a nice place to site a little and rest, is quiet and fresh in a very sunny day."
        }, 
        {
            "index": 381, 
            "rating": "5", 
            "review": "Castle View. One of the best sightseeing on Lisbon Castle with the possibility to have a dring of snack something from one of the quiosques (small typical bars)"
        }, 
        {
            "index": 382, 
            "rating": "4", 
            "review": "Stop on self-guided walking tour. Decided to do a self-guided walking tour and this was one of the stops. With a great navigator and following the map, was able to locate this stunning outlook quite easily. Gorgeous views over the city and nice spot to sit and relax after the tram ride up the hill. Worth taking in to enjoy the views of the city in a park like setting."
        }, 
        {
            "index": 383, 
            "rating": "4", 
            "review": "Great view at night!. Come here near sunset to enjoy the beautiful views of Lisbon below. While not as breathtaking as Miradouro das Portas dol Sol or Miradouro da Senhora do Monte in Alfama, it provides an amazing panoramic of the city, especially at nightfall when you look westward towards the illuminated Castelo do Sao Jorge. There's also a charming little garden situated here for you to enjoy while taking a stroll through this part of town, which is up on a hill and lined with countless restaurants to appease your appetite after soaking in the gorgeous sights."
        }, 
        {
            "index": 384, 
            "rating": "4", 
            "review": "Wonderful on a Breezy Summer Morning. We rode the Elevador da Gloria up on a Sunday morning and really enjoyed the view and how nice the tree-lined park is. The Elevador does not begin running until ten AM, at least onSundays, I'm not sure otherwise, so keep that in mind."
        }, 
        {
            "index": 385, 
            "rating": "5", 
            "review": "wonderful area. grandios view, botanic garden, easy to walk, easy to find, free entrance, view to the Castelo Sao Jorge, possibility to rest, a small coffee/cola/refresh kiosk, toilettes"
        }, 
        {
            "index": 386, 
            "rating": "3", 
            "review": "Nice, but not a must. There are so many viewpoints in Lisbon that it is hard to see why this one should be a particular point of call. Pleasant enough, if you are in that part of town, but no need to make a special trip to get there."
        }, 
        {
            "index": 387, 
            "rating": "5", 
            "review": "Enjoy the view. Great views of the city, not as crowded or busy as other \"miradouros\" around town. Plus its location is very favorable."
        }, 
        {
            "index": 388, 
            "rating": "5", 
            "review": "Beautiful City Views. The views of the city from this miradouro are absolutely beautiful, and there is even a little garden/park area where you can have a seat and admire the beautiful city.."
        }, 
        {
            "index": 389, 
            "rating": "5", 
            "review": "Beautiful oasis in Lisbon by Barro Alto. With lovely gardens, gorgeous views, a café for refreshments, benches and cooling breezes, its a great place to relax and people watch, you can also buy a sandwich nearby and eat it there."
        }, 
        {
            "index": 390, 
            "rating": "5", 
            "review": "Very good vews of the city. From this place, we can see an important part of Lisbon, and even the castle. And you are very near the \"drinks quarter\" of Lisbon."
        }, 
        {
            "index": 391, 
            "rating": "5", 
            "review": "Lovely view of the town. Lisbon is a city of hills & dales. This is a little square on top of a hill offering a balcony over the city. In fact, there are two sides. A shaded square with fountains and benches to sit and a few steps below another open garden with another balcony. This is one of the best view you can get of the city and the castle standing on another hill in front. It is also a place to rest for a while cooling off in the shade while admiring the view or taking the time to read. There are two side cafés to refresh as well on each terrace. The incline (or funicular) is nearby. So a good way to get there is to go up with this typical means of transport and then decide to walk the street stairs downhill."
        }, 
        {
            "index": 392, 
            "rating": "5", 
            "review": "My favorite Miradouro in Lisbon.. Located right near the heart of the city, this miradouro is very easily accessible. It's right next to the Gloria Elevator tram from Restauradores Square.The views across the city to the castle are stunning. It is big and the gardens are very refreshing. Don't miss the lower terrace, with it's quieter seats."
        }, 
        {
            "index": 393, 
            "rating": "5", 
            "review": "The best view of the Castle. This and the Castle combined will give you a total view of Lisbon. The overlook is terraced, with benches and shady spots to enjoy. It's well worth the walk up."
        }, 
        {
            "index": 394, 
            "rating": "5", 
            "review": "Delightful terrace and great views. We' d seen this mirador from São Jorge so wanted to find it and I'm glad we made the effort. It is a lovely park area, peaceful and a terrific perspective of Lisbon."
        }, 
        {
            "index": 395, 
            "rating": "5", 
            "review": "Amazing view. Look at the amazing view, people watch and drink some wine on the terrace. Great way to chill out in LIsbon"
        }, 
        {
            "index": 396, 
            "rating": "5", 
            "review": "Just wonderful !. After visiting the Igreja de S. Roque(S. Roque church) at the Largo da Misericórdia, go staight ahead and you will fand a small but wonderful garden that gives you a bird´s eye view of Lisbon...i love it!"
        }, 
        {
            "index": 397, 
            "rating": "5", 
            "review": "What a view!. Best place to see Lisbon at night. For those of you that came to Lisbon for the first time, I sugest a tuk-tuk tour to see old Lisbon."
        }, 
        {
            "index": 398, 
            "rating": "4", 
            "review": "Above the city!. Rode the funicular up the hill and enjoyed the views...especially of the Castle since we had been there the day before. A nice garden area on the lower level of the viewing spot."
        }, 
        {
            "index": 399, 
            "rating": "4", 
            "review": "Great view. This is a good place for walk. Great view, especially of the Castelo Sao Jorge. There are a lot of benches so you can sit and take a rest in a hot day."
        }, 
        {
            "index": 400, 
            "rating": "5", 
            "review": "Great view of the city, especially of the Castelo Sao Jorge, which is on the opposite hill.. It is situated in Bairro Alto. From there, we had a great view of the city, especially of the Castelo Sao Jorge, which is on the opposite hill."
        }, 
        {
            "index": 401, 
            "rating": "5", 
            "review": "Really amazing view of Lisbon downtown. One of my favourite spots in Lisbon. Beautiful view of downtown Lisbon and great spot for a well deserved rest after walking up and down hill all day."
        }, 
        {
            "index": 402, 
            "rating": "4", 
            "review": "A Peaceful Square. The Miradouro is on two levels. We spent a happy 20 minutes on the upper level enjoying the views and the lovely fountains."
        }, 
        {
            "index": 403, 
            "rating": "2", 
            "review": "Not worthwhile. I don't really understand why it should be a nice place to visit: it faces the wrong side of the city, the old and ugly one."
        }, 
        {
            "index": 404, 
            "rating": "5", 
            "review": "Great. Wonderful view, romantic, safe and quiet. Recommend to spend a lovely late afternoon. We will return"
        }, 
        {
            "index": 405, 
            "rating": "4", 
            "review": "Nice view of the city of Lisbon. Went up to the park just after sunset. Took the Gloria lift to the park and had nice views. Not sure which spot has the best views of Lisbon, but this would be one of them."
        }, 
        {
            "index": 406, 
            "rating": "4", 
            "review": "Nice view. A good place to view the city from above. Also a good place to start going through Bairro Alto. You can take the funicular up the hill from Praça dos Restauradores. A lot of drug pushers near the funicular, though."
        }, 
        {
            "index": 407, 
            "rating": "3", 
            "review": "Great for sunrise over Lisbon. Good for coffee at outdoor tables in a 19th century park overlooking downtown Lisbon. But you may not want to be there for the free-form drinking party every night into the dawn."
        }, 
        {
            "index": 408, 
            "rating": "5", 
            "review": "Among the best views in Lisbon. Every visitor to Lisbon must come here and have a drink at the outdoor cafe which provides the best views of this beautiful city."
        }, 
        {
            "index": 409, 
            "rating": "5", 
            "review": "Nice view. It's a viewpoint, so of course you get a pretty good overview of the city. What makes this one so nice is the whole atmosphere around it. With 2 little kiosks, lots of people, some vendors and the Elevador da Gloria and Bairro Alto nearby, it's a must-see in Lisbon."
        }, 
        {
            "index": 410, 
            "rating": "4", 
            "review": "Maybe a nice place to start a Lisbon tour. This is a nice spot for a sightseeing of grand part of the city.\nIf it's your first time in the city, it worth starting here, checking city's \"hotspots\" at the labeled map.\nThe location is great, right next to Chiado / Bairro Alto and there's a coffee kiosk with tables that is great to chill out in summer."
        }, 
        {
            "index": 411, 
            "rating": "4", 
            "review": "Nice view, obviously, since it's a viewpoint :-). Nice terrace with a kiosk where they serve drinks, sandwiches and some pasta. Lots of pigeons as well. The staff at the kiosk is nice. And of course you get a very nice view over Lisbon. Nice and quiet location."
        }, 
        {
            "index": 412, 
            "rating": "5", 
            "review": "Beautiful view, lovely little cafes. Always a good place to stop and breath in Lisboa, be it day, night or early hours of the morning. It can get busy but its brilliant for a quick-stop. In the summer there is live music, always wonderful!"
        }, 
        {
            "index": 413, 
            "rating": "3", 
            "review": "good but far from being the best. This is one of the many miradouros in Lisbon, it really offers a cool view of the city and the Castle, but if you wish to have better views from the City just to take some awesome panoramics or just hang around with friends, you'll find more interesting options like the one in front of Igreja da Graça;"
        }, 
        {
            "index": 414, 
            "rating": "5", 
            "review": "Great scenic view over Lisbon. Very good place to see old Lisbon and the castle. Near Bairro Alto, with his pubs, restaurants and night life."
        }, 
        {
            "index": 415, 
            "rating": "5", 
            "review": "Beautiful vista, clean spacious park. Beautiful vista overlooking the city.\nMany benches and a couple of cafes in the park for drinks, snacks etc."
        }, 
        {
            "index": 416, 
            "rating": "4", 
            "review": "Relaxing view. This Miradouro has a relaxing vibe to it and we enjoyed our short stay there. The views are not exceptional, however, they are good and definitely worth a visit if you are in the area."
        }, 
        {
            "index": 417, 
            "rating": "5", 
            "review": "not possible loose this Miradouro. one of the best gardens to see old Lisbon. Stay there the time you can, because all time you will discover one more interesting thing to see"
        }, 
        {
            "index": 418, 
            "rating": "4", 
            "review": "Good view close to city centre. This is the closest to downtown of the lookout points in Lisbon. It is the most accessible by walking or taking the funicular. It’s definitely worth to stop up. It’s not very big so 30 minutes to just walk around and take some snaps is perfect."
        }, 
        {
            "index": 419, 
            "rating": "5", 
            "review": "Viewpoint!. Nice view to St. George's and Rossio. Be sure to take the escalator uphill. The were shooting Spanish \"Master Chef\" when we were there, fun to watch at."
        }, 
        {
            "index": 420, 
            "rating": "4", 
            "review": "A hidden gem. We stumbled upon this viewpoint by accident, and it was the great way to end our trip to Lisbon. From here you can get some of the best photos of Lisbon and enjoy a cold beer!"
        }, 
        {
            "index": 421, 
            "rating": "3", 
            "review": "Nice view . Just a nice view, not breathtaking. But if you catch the gloria funicular, its right beside the top so walk across for a brief visit"
        }, 
        {
            "index": 422, 
            "rating": "5", 
            "review": "Amazing view!. This is one of my favorite places in Lisbon. I love to stay here after a working day and enjoy the landscape at the sunset. After that, I love to go to eat in the restaurants of the Barrio Alto. Do not miss it!"
        }, 
        {
            "index": 423, 
            "rating": "3", 
            "review": "Nice park, good view. I was expecting a breathtaking view and found an average one. Lisboa do not have a amazing city view. The park terraces were nice and the seagulls welcoming you were very cute. I took the tram from Avenida Liberdade for the steep hill to Alcantara, which cost 3 Euro for up & down. I spent only 15 minutes there and took the same tram down. The walls on the way of the tram were painted with a lot of Graffitis, which was very nice. It was nice to see the old town from the top, however it was not breathtaking."
        }, 
        {
            "index": 424, 
            "rating": "5", 
            "review": "At the other side from Senhora do Monte. This Miradouro is at the top of the old Bairro Alto area, in the western part of the city. Therefore I suggest going there around dusk, by the sunset, when the opposite hill with Sao Jorge castle and the whole central area is sunbathed. You can get real perfect photos from here.Being there at dusk, you can proceed then to the restaurant area of Bairro alto for dinner at nice (but pricey) at one of many rastaurants there.The best way to reach the Miradouro is by the steep hill tram (funicular) which starts from the Restaudores square.Beware, the ticket is 3,60 EUR for less than 5 minute ride."
        }, 
        {
            "index": 425, 
            "rating": "4", 
            "review": "Lovely view. Other than the view from St. George's castle, this would be my favorite view of Lisboa. There is a small \"garden\" at the site, that is great for taking pictures and taking in this beautiful city."
        }, 
        {
            "index": 426, 
            "rating": "5", 
            "review": "Some of the best views. This is a lovely spot that you shouldn't miss while in Lisbon. It's calm and perfect for photos during the day. All sorts of people gather there, locals and tourists alike for a short break and very nice views over Lisbon."
        }, 
        {
            "index": 427, 
            "rating": "5", 
            "review": "Great view by night, but best by day. From here you can see the Lisbon castle, the area called \"Costa do Castelo\" (trans.: Castle Coast), Martim Moniz area, Mouraria neighborhood and Alfama neighborhood, which is really beautiful by night.Be aware that this sightseeing spot is near Bairro Alto, so expect lots of (sometimes drunk) people at night, at every day of the week, but specially at weekends. If you want to enjoy this view from a more calm place, there are others in this area for you.Because of this, I recommend you to visit this place by day, where there is much less noise and disturbance."
        }, 
        {
            "index": 428, 
            "rating": "5", 
            "review": "nice view. just right after the stop of the elevador da gloria comes this lovely place, with a very nice view of the city, you can relax under the trees, take an imperial at the kiosk... chilling"
        }, 
        {
            "index": 429, 
            "rating": "5", 
            "review": "Amazing views. Amazing views over Lisbon, overlooking the castle, the sea, and Avenida Liberdade. If you are going from the Avenida, you can take the tram uphill to get here."
        }, 
        {
            "index": 430, 
            "rating": "4", 
            "review": "Nice View. We had about an hour to kill before our dinner reservation at a restaurant close by this place so we ended up hanging out here for a bit listening to live music and enjoying the view of the sunset. It's a nice place to see if you're in the area but I wouldn't come all the way up here just for the view. There are other places in Lisbon, like the castle, that offer a view of the city."
        }, 
        {
            "index": 431, 
            "rating": "4", 
            "review": "Check out the view!. This is a wonderful spot to take a sweeping look at Lisbon from.\nYou can spot numerous landmarks in Eastern Lisbon from this belvedere – the main one being São Jorge castle.\nJust in case you need some assistance with the landmarks, there's a beautiful tiled map of the view to help you out."
        }, 
        {
            "index": 432, 
            "rating": "4", 
            "review": "Lovely viewpoint. We came across this viewpoint by accident and thought the view lovely especially as the other viewing points are on the other side. It had just been raining and so there were some great cloud formations. At the time of writing this (end of October) the funicular Gloria is not working."
        }, 
        {
            "index": 433, 
            "rating": "5", 
            "review": "One of the best views in Lisbon!. Have a delicious glass of sangria de espumante (with cucumber) and enjoy one of the most fantastic views in Lisbon!"
        }, 
        {
            "index": 434, 
            "rating": "4", 
            "review": "Nice view. Arriving there from Elevador de Gloria or from Bairro Alto you are in front of a great view of Lisbon accompanied by nice gardens.\nOne of the many miradouro, sightseeing places of Lisbon which is worth visiting."
        }, 
        {
            "index": 435, 
            "rating": "5", 
            "review": "Beautiful!. The best miradouro in Lisbon. Not as busy as the others seemed to be and had a lovely park and fountain."
        }, 
        {
            "index": 436, 
            "rating": "5", 
            "review": "Excellent View, Beautiful Gardens & near on the Funicular - don't miss this place!. The view is worth the walk up and you can explore the lovely streets as you go.\nTips: Take a coffee break on the way down and enjoy some of the delicious Portuguese pastries and cakes. You can take the tram and then the funicular up to the lookout if you prefer & do the reverse on the way down."
        }, 
        {
            "index": 437, 
            "rating": "5", 
            "review": "What a gorgeous place. Went there for a second time, it is certainly the best view over Lisbon at night. The tiny chapel (Senhora do Monte) is very beautiful as well as the Lady's statue. The S. Jorge castle looks more charming when observed from this Miradouro than from anyplace else in Lisbon"
        }, 
        {
            "index": 438, 
            "rating": "5", 
            "review": "Beautiful park with a fantastic view and cold beer. While the park is a magnet for young people, especially during the evening-- it is for everyone. A magnificent viewpoint overlooking the central city and beyond to the hills of Alfama and the castle. Don't miss the view in the evening, or at sunset, or at any time. The cafe is also a treat, especially after walking on a hot day!"
        }, 
        {
            "index": 439, 
            "rating": "5", 
            "review": "Relax and take in the View. Nice walk up from the city brings you to this garden/park area with a little coffee shop where you stop chill and catch your breath.Great views of the Castle and east of the city also very tranquil to recharge your batteries.Also gives a relief break from the sun and heat.Worth a visit."
        }, 
        {
            "index": 440, 
            "rating": "5", 
            "review": "Great view. In the evening this viewpoint is the meeting point for many young people. It is near \"Erasmus Corner\" and many bars. You have a really great view to Castelo de São Jorge and the rest of the city. If you have a daily or monthly pass for public transportation, you may use the tram (\"Elevador da Glória\") without paying anything."
        }, 
        {
            "index": 441, 
            "rating": "5", 
            "review": "Best landscape in Lisbon. Really beautiful place.\nProbably the best view of Lisbon.\nI advice to go there walking or in trolley (I prefer walking so I can take photos of the famous trolleys)."
        }, 
        {
            "index": 442, 
            "rating": "5", 
            "review": "Arrive by underground tunnel. A door in the wall near the cafe is where you arrive if you take the underground tour of the Mae de Agua reservoir!"
        }, 
        {
            "index": 443, 
            "rating": "4", 
            "review": "One of my favorite Miradouro's in Lisbon. My hostel was really near this nice Miradouro, I went here to drink a few beers in the afternoon sun. To make some notes of all the things I did do that day and to think about what I was going to do next. If you want to go up with the Elevador da Glória, go up and the miradouro is just around the corner. Really nice view of the castle on the hill as well, the Santa Justa elevator has a better view of that. But well.. you can't get a beer there ;)"
        }, 
        {
            "index": 444, 
            "rating": "4", 
            "review": "A nice view, but after Santa Justa it was kind of a letdown. I expected this to be the most scenic view in the whole of Lisbon and it might have been, had I not previously seen the view from the top of the Santa Justa elevator. All in all, very nice but certainly not he best one out there."
        }, 
        {
            "index": 445, 
            "rating": "5", 
            "review": "Gorgeous view of Lisbon and its 7 hills. You can take the tram up the hill and enjoy the magnificent view. The hill where is located is called Bairro Alto and is famous by it night life and restaurants – bars.From there just walk down the street and have a visit to churches and Misericórdia Museum. It end in Chiado where you can have a coffee at the Portuguese typical café Brasileira."
        }, 
        {
            "index": 446, 
            "rating": "4", 
            "review": "Very nice view. Best place to have a drink at night or a coffee during the afternoon ! But the service isn't always very good. The view is amazing"
        }, 
        {
            "index": 447, 
            "rating": "5", 
            "review": "Beautiful views. A must see during your visit to Lisbon, the views are pretty spectacular and you get a very good idea of the layout of Lisbon. There are also street music and some local artists. Or course, you can also fill up your water bottles!"
        }, 
        {
            "index": 448, 
            "rating": "5", 
            "review": "Great view and orientation for Lisbon. Superb view over Lisbon from a calm shady belvedere. There are benches to relax on and kiosks to by beer and snacks. Perfect start to a tour of Lisbon."
        }, 
        {
            "index": 449, 
            "rating": "4", 
            "review": "Nice to see. A great place where you can see the all sight of Lisbon and the Tejo river and other sites like Alfama square"
        }, 
        {
            "index": 450, 
            "rating": "5", 
            "review": "Lovely sight. This is a big \"miradouro\". Its placed near by what I would call the most interesting streets in Lisbon. The place is big, we had no problem staying here for several hours. By the way; the (white) Sangria at the bar there is fantastic."
        }, 
        {
            "index": 451, 
            "rating": "5", 
            "review": "Start your Lisbon trip from here.... The view of the city you get from here is great. There is a little park with cosy little cafe as well. This was my second favorite miradouro after Senhora do Monte. A great place to start your Lisbon city trip!"
        }, 
        {
            "index": 452, 
            "rating": "4", 
            "review": "Nice place to view Lisbon. One of the non expensive and beautiful place to sit and relax. Spend an evening enjoying the breeze, Fado songs by a man and fabulous view of Lisbon. Take the Tram 28 and get down here. For people who like photography can enjoy the views and can spend whole evening here. I visited this place mainly based on listing on trip advisor."
        }, 
        {
            "index": 453, 
            "rating": "5", 
            "review": "Listen the fado....... One of the most beautiful viewing point of Lisboa, closed to the upper stop of elevador Gloria.Big park, pleasant air, good place to relax. A man was singing very good fado songs with a guitar hourslong in portuguese and french. He has a very good voice. It was really good to be there, listen the songs, and watching the beautiful city."
        }, 
        {
            "index": 454, 
            "rating": "4", 
            "review": "View of Lisbon. Great place to sit and people watch and have a fabulous view of Lisbon. Relaxing. Nice little cafe for good and reasonable refreshments."
        }, 
        {
            "index": 455, 
            "rating": "4", 
            "review": "exelent. its a very nice place to stop and have a wonderful view of old Lisbon.its not a good place to go late at night"
        }, 
        {
            "index": 456, 
            "rating": "4", 
            "review": "Good spot!!. Great spot to sit and have a early drink before dinner and watch the city lights coming on, with Saint George's Castle on the background! A must go..."
        }, 
        {
            "index": 457, 
            "rating": "5", 
            "review": "Plenty to see and visit in Belem. From Tore to Monastery, to cream cakes and restaurants, carriage museum, maritime museum, parks... You can spend more than just a great day in Belem."
        }, 
        {
            "index": 458, 
            "rating": "5", 
            "review": "One of the many wonderful views of Lisbon. Astonishing view in one of the more typical areas of old Lisbon.A wonderful choice to have a drink and relax early morning catching the rising sun or at the end of the day.Pay atention to a tunnel recently open that connects underground, this Miradouro with a marvelous garden in the surroundings"
        }, 
        {
            "index": 459, 
            "rating": "5", 
            "review": "An excellent view over Lisbon.. Get an excelent view over Lisbon, the beautiful city awaits your visit. You'll overlook the castle of St.George in front of you and the Avenue of Liberdade (Liberty) and downtown Lisbon (a Baixa). This is a nice spot to rest after strolling through the narrow streets of Bairro Alto."
        }, 
        {
            "index": 460, 
            "rating": "5", 
            "review": "A beautiful sightseeing spot. Lisbon has in São Pedro de Alcantara one of its most beautiful sightseeing. You can see the river, Terreiro do Paço, the castle and all the downtown. It's a lovely place to walk, very near Chiado, Bairro Alto, Príncipe Real and Avenida da Liberdade."
        }, 
        {
            "index": 461, 
            "rating": "5", 
            "review": "Great view. Awesome view, great city. We will come back for sure.\nWe will never Forget those days.\nAlso, nice bear!"
        }, 
        {
            "index": 462, 
            "rating": "5", 
            "review": "Great view and rest. One of the best views in Lisbon (and there are many, many of them). Excellent resting place in all periods of day, especially during hot afternoons and evenings, when you can have a drink in the bar and enjoy in the shadows of high trees. If you don't feel like walking uphill, hop on the Elevador da Bica - an interesting and unusual driving experience and you're up in 2 minutes!"
        }, 
        {
            "index": 463, 
            "rating": "5", 
            "review": "A view to never forget. This is really a place for you to go when visiting Lisbon. The view from here is amazing during the day or at night. If you have a chance, try both (I did it)."
        }, 
        {
            "index": 464, 
            "rating": "4", 
            "review": "Fun & free way to see the city. Impressive view of Lisbon, we took in the sights while enjoying a beer. The walk up was steep, but manageable and gave a good feel of the city with so many shops and restaurants along the way."
        }, 
        {
            "index": 465, 
            "rating": "5", 
            "review": "One of the best places for taking in Lisboa.. Set on the edge of Bairro Alto this is a spacious bellevue with an atmosphere of its own. If you do not fancy the climb, an elevador will take you there effortless and in the typical style of the city. The view is stupendous ranging from the top of The Parque Eduardo vii, the Castelo Sao Jorge is just opposite and the twin towers of the Sé stand out in relief to the background of the estuary of the Tejo, and below linger the Rossio and Baixa ... Not to be missed."
        }, 
        {
            "index": 466, 
            "rating": "4", 
            "review": "As good as Santa Justa. The view from this Miradouro is just as good as from the viewing platform of the Santa Justa elevator, and it's free."
        }, 
        {
            "index": 467, 
            "rating": "4", 
            "review": "Lovely views of the Castle and the City. From this Miradouro you can enjoy a great view over the City towards St Georges Castle. The best views are in the evening as the sun illuminates the view. In the morning the sun is in the wrong direction and everything is in shadow giving poor results to photographs. Well worth a visit after an enjoyable dinner. There is a snack bar which we did not use so cannot comment.on."
        }, 
        {
            "index": 468, 
            "rating": "4", 
            "review": "great spot. Great spot to view the downtown specially at night for drinks if you don't want to hangout at Bairro Alto"
        }, 
        {
            "index": 469, 
            "rating": "5", 
            "review": "Day or Night. Beautiful view of the Castelo de São Jorge, Baixa, Rio Tejo, Avenida da Liberdade from Bairro Alto. Renovated garden on lower level return a wonderful spot to full glory day or night."
        }, 
        {
            "index": 470, 
            "rating": "5", 
            "review": "splendid views of Lisbon city and the castle. We stayed in Atlantico hotel just below this gardens, we walked here every evening to see the sunset and beautiful Lisbon. simply superb.If you have some time then you can easily spend and hour or so watching the view or simply seating in the beautiful landscaped gardens"
        }, 
        {
            "index": 471, 
            "rating": "5", 
            "review": "best view. If some one , want to see lisbon, this is a good spot to goo and to take same pictures ! and you can stay ther relaxing antil you drink a coffe on quiosque"
        }, 
        {
            "index": 472, 
            "rating": "5", 
            "review": "Great Miradouro. This view point of the city is one of the best. It's large with a formal garden on two levels. It's located in one of the best touristparts of the city, Barrio Alto with plenty shops and restaurants, large and small. In the opposite direction is the Principe Real Park. Transportation is not a problem, trolleys and taxis are plentiful. You can even get to the Rossio(downtown) by taking the Santa Gloria elevator which is next to the miradouro."
        }, 
        {
            "index": 473, 
            "rating": "4", 
            "review": "great view - too many bums. I have been in Lisbon before and really love the city. I was amazed at the number of mendicants, beggars and bums this time around. Not sure if that's about the economic crisis or time of year but I did not like it as much. The view from the miradour is excellent if you want to gain some perspective of the city and see the castle from the other side but you may not appreciate being approached by guys offering hashish, cocaine and pot - I wasn't."
        }, 
        {
            "index": 474, 
            "rating": "5", 
            "review": "Lovely for evening drinks. We stayed a short walk from this miradouro and it was perfect to stroll up to in the evening sun, buy a drink and sit enjoying the views. But beware, can be very breezy as you are so high up! Brilliant view of the Castle."
        }, 
        {
            "index": 475, 
            "rating": "5", 
            "review": "Best view of Lisbon. For me this is the best view of Lisbon.At night people gather to talk and have some wine.If you are felling tired to climb all the way up there, just take Elevador da Glória!"
        }, 
        {
            "index": 476, 
            "rating": "4", 
            "review": "Handy viewpoint, near good Fado.. If you use the elevador da Gloria from Restauradores to get up the extremely steep hill, then this very good viewpoint is only a few yards to the right. It's also only a short walk back from here to the Fado in Chiado (left/downhill from the elevador)."
        }, 
        {
            "index": 477, 
            "rating": "4", 
            "review": "A good photo op from the Barrio Alto. Go in the afternoon or evenig for the best light, since you will be facing east. Just to the right from the top of the Elevador (funicular) da Gloria, which starts near Restauradores metro station. Buy a transit day pass -- the single fare is too expensive to be worth the funicular rides."
        }, 
        {
            "index": 478, 
            "rating": "4", 
            "review": "good spot for pictures, a brake or a preview. one of several \"miradouros° with beautiful views iver Lisbon city.Near barrio alto and a couple of blocks above Liberdade Avenue is a good spot for sunset as a preview to dine in the \"barrio\""
        }, 
        {
            "index": 479, 
            "rating": "5", 
            "review": "Amazing viewpoint in Lisbon!. An outstanding view over the downtown, located in the cultural, arts and nightlife district.from here you may also admire the castle hill - amazing, specially by sunset time, when the light is facing on the castle hill!"
        }, 
        {
            "index": 480, 
            "rating": "5", 
            "review": "Our favourite spot. This terrace/garden is really beautiful,view is amazing,there is a little cafe with some sun loungers and a few tables so You can have a coffee or a cocktail and just chill :)"
        }, 
        {
            "index": 481, 
            "rating": "5", 
            "review": "Nice view !. Perfect during the day to take some nice shot from the city or at night to have a beer with friends !"
        }, 
        {
            "index": 482, 
            "rating": "4", 
            "review": "Beautiful views, awful place to park.... The miradouro itself was a very nice experience, we were there early evening on a Friday. I have driven from Alvor, Algarve all the way to Lisbon and we were exploring the city. This was our last stop before driving back to Algarve again. It was quite daunting to find a parking space nearby but I finally managed to park on a very hilly side street. The place itself was very romantic and we could rest after the stressful parking incident and trying to cope with the weekend traffic in Lisbon which was quite annoying not because it's busy which it isn't that bad but the people in Lisbon make it awful with their behaviour whilst behind the wheel. Apart from the evening breath taking views there's also a small café with a nice pastel de nata and a tasty espresso café. I also had a caipirinha but it wasn't that tasty! Looking @ Lisbon listening to Brazilian Bossa Nova. They also provide blankets at this café for people that feel a bit chilly :) Recommended to couples that need a romantic time out, Lisbon is quite sexy but get a cab :)"
        }, 
        {
            "index": 483, 
            "rating": "5", 
            "review": "Spectacular view in sunset. This venue has an spectacular view of the city center and São Jorge castle. You can have drinks and food around so you may sit down and contemplate the colors of the beautiful Lisbon sunset."
        }, 
        {
            "index": 484, 
            "rating": "5", 
            "review": "One of Lisbon's best views!. I pass this Miradouro almost every day on my way from work and always love it. The city view is just beautifull and the surronding space too. You can spend some time on the garden or have a drink at the quiosque. Dont miss this spot when visiting Lisbon!"
        }, 
        {
            "index": 485, 
            "rating": "4", 
            "review": "Stunning view, OK food.. Located in the Bairro Alto, the main reason for eating here is the view over the city and down to the river. A tiled map against the railings identifies the main features of the landscape. Service was quick when we ate at luchtime, despite the fact that only one waiter appeared to be covering all the tables. Sandwiches, beer and a glass of rose went down well and was not expensive. Location is just to the right of the top of the Elevador de Gloria - the funicular railway disguised as a tram. This runs from the NW corner of the Praca dos Restauradores."
        }, 
        {
            "index": 486, 
            "rating": "5", 
            "review": "One the most spectacular views of Lisbon. If you like landscapes, this is the one from Lisbon. You can have a drink and sit around listening to people playing music."
        }, 
        {
            "index": 487, 
            "rating": "4", 
            "review": "One of Lisbon's great panoramas. You can spend a good deal of time during your visit to Lisbon getting to their miradouros, their panoramas which are frequently little parks or squares with cafes and incredible views of the city. My advice is, if you only have time or inclination to visit one, make it this one. You can reach it from the downtown by walking north to Avenida de Liberdade, crossing to the left side of the street, and taking the funicular Elevador/Ascensor da Gloria. At the top, just turn right, and presto, there is the amazing view!"
        }, 
        {
            "index": 488, 
            "rating": "5", 
            "review": "Perfect. Here you can sit down, ear some music and enjoy the excellent view! Came here and love lisbon! They also have some bar to drink amazing drink! i truly recommend!"
        }, 
        {
            "index": 489, 
            "rating": "4", 
            "review": "stunning view. a great place to view lisbon. very pleasant and popular with locals. lovely place to start the evening."
        }, 
        {
            "index": 490, 
            "rating": "5", 
            "review": "The prettiest view. Loved this Miradouro, and came back another time en route to the Palace. If you get a table near the railings, it's a lovely view , even under the hot sun. A coffee and a croissant was delightful. The city splays out one side and the sea on the other. Hugely picturesque, and worth the ride! Like a giant embroidery. Many photo opps, lots of ourists but a happy place. I was traveling alone but at least two people offered to take my pic with the view! Somewhere the essence of Lisbon here..."
        }, 
        {
            "index": 491, 
            "rating": "5", 
            "review": "Just near Bairro Alto, don't miss the view overlooking the castle. This belvedere/viewpoint is probably one of the best. From here, you can have a great view over the Lisbon Castle and the city.\nVery central, near Bairro Alto and Chiado, you should not miss it, it's just next to Sao Roque Church.\nThere is also a tram/funicular just next to the Miradouro, that takes you to downtown (Av Liberdade/Restauradores)"
        }, 
        {
            "index": 492, 
            "rating": "3", 
            "review": "Very nice. Nice view over the castle hill. Due to its big dimensions, the environment is not the best as people are quite dispersed and sometimes it is the meeting point for a not so good frequence..."
        }, 
        {
            "index": 493, 
            "rating": "4", 
            "review": "Great view. A well created space with a view over the streets of Lisbon. Plenty of seating, greenery and refreshments. Artists also painting and selling their wares at not extorniate prices. Go up on Elevador Gloria from Restauradores."
        }, 
        {
            "index": 494, 
            "rating": "5", 
            "review": "A wonderful place in Bairro Alto. Sunny outlooks all round with a kiosk for drinks, seats around plus a lower tier with garden area to lounge about. Fantastic views.\nTake the Gloria train, turn right & enjoy."
        }, 
        {
            "index": 495, 
            "rating": "4", 
            "review": "Not the best miradouro in Lisbon but worth the walk/funicular. I like the view better from the miradouros just below the Castelo near the Museu de Artes Decoratives and Santa Luzia church but Sao Pedro de Alcantara is right by the top of the Gloria funicular or on your way up rue Sao P de A from Praca Luis Camoes, so definitely worth a stop."
        }, 
        {
            "index": 496, 
            "rating": "4", 
            "review": "Great views. This view point offers great views on the city and specially on castello de San Jorge , but miradouro de senhora do monte is higher and has better views in my opinion"
        }, 
        {
            "index": 497, 
            "rating": "5", 
            "review": "Beautiful View. This is a great place to take in great views of Lisbon. It is a rather large park area overlooking the city. We stayed right up the hill and enjoyed stopping here pretty much every day of our visit. If you go on a Saturday night be prepared for a lively drinking crowd."
        }, 
        {
            "index": 498, 
            "rating": "5", 
            "review": "A bird's view. Take the tram \"Elevador da Gloria\", from Restauradores place\" up to Jardim Principe Real. or just walk up the hill - Chiado, Bairro Alto (a very IN place at night). From the Mirdouro you will have a beautiful view over the historical centre of Lisbon. In front of you, the S.Jorge Castle!"
        }, 
        {
            "index": 499, 
            "rating": "5", 
            "review": "Always a pleasure!. I have gone there many times in my life, having grown up in Lisbon. I urge all travelers to stop by, enjoy the view, have a drink and just soak up the atmosphere"
        }, 
        {
            "index": 500, 
            "rating": "3", 
            "review": "Go to Miradouro da Senhora do Monte. Miradouro Sao Pedro de Alcantara is a nice visit combined with the church Igreja de Sao Roque, and maybe the view is better at night. But if you have less time, or are not interested in seeing the church, I would suggest Miradouro da Senhora do Monte instead. This viewpoint is much higher, and you can see much more of Liboa and of the water, and it's only 5 minutes walk off of Tram 28."
        }, 
        {
            "index": 501, 
            "rating": "5", 
            "review": "Great Views. Take the train elevator to get here and enjoy the splendid views from the Mradouro. There are a few restaurants nearby, easy to get some ice cream or smth to dring. It's a popular meeting place so sometimes it gets crowdy."
        }, 
        {
            "index": 502, 
            "rating": "4", 
            "review": "Great views of Lisbon. One of those great miradouros in Lisbon. Great for people-watching as well. Best reached walking downhill--we came from Rato Metro station."
        }, 
        {
            "index": 503, 
            "rating": "3", 
            "review": "A great view. This place during the morning can be very peaceful and it has a great view to the whole city of Lisbon.\nAt night it's a place where groups of friends reunite and get together for a night well spent and partying in their own way."
        }, 
        {
            "index": 504, 
            "rating": "3", 
            "review": "Great view.... ...and that's not just of the 12 foot street art phallus directly in front of you! Great spot for a relaxing wee dougie of sagres, with panoramic vistas of the castle, the lake and orange tiled rolling roofs of the city centre. Can get busy quickly when the sun comes out. Freshly squeezed orange juice is some of the best I've tasted."
        }, 
        {
            "index": 505, 
            "rating": "5", 
            "review": "Drop dead gorgeous!. Amazing view. Start your trip to Lisbon here. With a wee cerveza. In my opinion this is good as it gets."
        }, 
        {
            "index": 506, 
            "rating": "5", 
            "review": "Great view. Lovely little park with a cafe, very relaxing just to sit and take in the fantastic view over the city to the river and castle. Right next to the Barrio Alto with loads of eating places."
        }, 
        {
            "index": 507, 
            "rating": "3", 
            "review": "Great views of city and castle. We kinda stumbled across this park after visiting Igreja de Sao Roque - while there are great views that is really all this park to offer. There are some street artists and plenty of visitors... Anyone with an interest in photography would definately enjoy a visit here. Didnt get to visit at night but I would think night views would be pretty spectacular"
        }, 
        {
            "index": 508, 
            "rating": "4", 
            "review": "Miradoura Sao Pedro. a spectacular view of the city. Lovely to sit drinking a coffee and enjoying the beauty. It has good restaurants and coffee around. The view is really worth and worth the visit."
        }, 
        {
            "index": 509, 
            "rating": "5", 
            "review": "Great view of the city.. You can see the whole downtown from that place, and take a rest before keep walking, you can take the tram from the Praça dos Restauradores to the top of the hill very close to the miradouro."
        }, 
        {
            "index": 510, 
            "rating": "5", 
            "review": "You can't miss this one!. You'll have Lisbon literally at your feet, the views are excellent... it reaches out to the Tagus River and the Sao Jorge castle.Come and wait for the sun set and then head out to Bairro Alto, just behind, to treat yourself to an amazing dinner!"
        }, 
        {
            "index": 511, 
            "rating": "4", 
            "review": "Great views. Very cold day at end of February so not at its most glamorous. However, we were warm from our exertions walking up from.the river side. simples really, Walk up hill - \"Are we there yet?\" Look around, enjoy fascinating buildings,people, etc, \"No\" - walk up more hill - repeat until breathless and then - surprise! Smashing.Better still, then finally discover where the Gloria lift is! Ha!"
        }, 
        {
            "index": 512, 
            "rating": "5", 
            "review": "Romantic scene!. One of the most, if not the most, romantic place to watch the full moon rise behind the Castelo Sao Jorge, if you are lucky enough to be there during full moon. Among the \"miradouros\"of the city this is my favourite one and for some reason it is never crowded as the other ones in Alfama. It has a cafe and it is a few paces away from the restaurant area of bairro Alto."
        }, 
        {
            "index": 513, 
            "rating": "5", 
            "review": "must go. It's near the city center and you will probably be in the area, so there's no reason not to go! We thought it was easy to find. It's a great place to take some pictures and spend a few minutes looking out over the city."
        }, 
        {
            "index": 514, 
            "rating": "5", 
            "review": "superb panorama. superb panorama also at night, also small terrace to enjoy the view with a drink as we did at night. nice view on the castello and much more"
        }, 
        {
            "index": 515, 
            "rating": "4", 
            "review": "nice views. I really like this place and is a must see for visitors. Near to Bairro Alto, great location, has a little bar for snacks and beer, outdoor seating, good price and great view to the city. Perfect for summer days"
        }, 
        {
            "index": 516, 
            "rating": "5", 
            "review": "Amazing views over central Lisboa. Not my favourite (No1 for me is Igreja de Graca miradouro) but very nice small park. Very easy to get there via Elevador da Gloria or via Satna Justa lift and than cca 10 mins walk."
        }, 
        {
            "index": 517, 
            "rating": "5", 
            "review": "beautiful views. a must visit place..just get something to drink at the coffee shop and u can just enjoy the view..i went during the day and the view was beautiful..check out the car being used as a planter box at the terrace..there is also an area at the terrace where people write their wishes on plastic sheets and pin in to the ropes from trees.."
        }, 
        {
            "index": 518, 
            "rating": "4", 
            "review": "Nice view point and Sangria.. We took a half liter of Sangria for 7.50 euros at the little terrasse. It was nice and refreshing.The guitar player on the view point was playing some brazilian tunes... nice :)"
        }, 
        {
            "index": 519, 
            "rating": "5", 
            "review": "beautifull all time. I was hosted next to this view point, and pass by a lot of times, not only pass by i spend a lot of time there, it looks difrente in the morning, evening and night, with difrente colores and lights, i could spend the hole day there"
        }, 
        {
            "index": 520, 
            "rating": "5", 
            "review": "amazing view. Amazing view of Lisbon for free! It has some benches so you can sit and admire this great city and a little bar for a drink or a snack"
        }, 
        {
            "index": 521, 
            "rating": "4", 
            "review": "Any mirador is fun. Go and enjoy the view, it doesn't matter which one it is, incorporate them into your getting around in the city"
        }, 
        {
            "index": 522, 
            "rating": "5", 
            "review": "Our favorite Place. Wow what an amazing view !!! what a place if you sit on the bench for 20 mins and get yourself a drink from the cafe you can take in all what is in front of you, from here you can see the whole of lisbon, my wife brought me here for my 40th and it's a place i cannot get out of my head and i always think of when we talk about Lisbon , right opposite you can see the walls of the castle and the big window of the SE Cathedral and to the right is the river. My wife calls it our place it truely is an amazing view and you should not miss it"
        }, 
        {
            "index": 523, 
            "rating": "5", 
            "review": "My favorite Place !. Gosh !! ,How I miss this ,From here you see all of Lisbon , I would suggest to go there at sunset and stay there till night strikes in . One of the most beautiful scenes you will probably enjoy , with the sun then the lights coming in and just capturing it silently makes it more amazing .enjoy sitting there with a cup of cafe' au lait and listen to the music playing in the background .Superb !"
        }, 
        {
            "index": 524, 
            "rating": "5", 
            "review": "Wonderful view. Must stop in Lisbon. I suggest to go up to this point through Glória Elevator. then at your right side you can find this beautiful place with a brilliant landscape. From here, it is possible to see St Georges castle, Cathedral Sé and the river. During the summer is very comfortable to have a seat, drink something and appreciate all of this."
        }, 
        {
            "index": 525, 
            "rating": "5", 
            "review": "great pictures at this site. the view!!!!!!!great pictures at this site and the place is beautiful with a fountain...go see it. try sunset, its the best time! "
        }, 
        {
            "index": 526, 
            "rating": "5", 
            "review": "Relaxing place with great view. Miradouro Sao Pedro de Alcantara is one of the \"must see\" places in Lisbon. It is just few meters away from Bairro Alto, and if you do not like to walk on \"hill\", there is also funicular from Restauradores, which will bring you there. It is very relaxing place, where you can enjoy your meal, drink or just in magnificent view."
        }, 
        {
            "index": 527, 
            "rating": "5", 
            "review": "Great view. One of the many in Lisbon that you should go. There is a small bar where you can have somthing to eat or drink! Nice place for pics or just reading a book!"
        }, 
        {
            "index": 528, 
            "rating": "4", 
            "review": "amazing view. this place as an amazing view through Lisbon Castle - Castelo de Sao Jorge - and the river also... You can sit in one of the chairs available there and just relax the view and the light of lisbon..."
        }, 
        {
            "index": 529, 
            "rating": "4", 
            "review": "Great view over Lisbon. One of the best views of Lisbon. In front we see the Castelo de São Jorge and Miradouro da Senhora do Monte. To the south we could see the river Tejo. To the north we could see the Avenida da Liberdade with his stroll under the trees. Behind we have the magnificent neighborhood Bairro Alto. We can sit down in one of the park benches in this viewpoint and appreciate these magnificent views. A place not to miss."
        }, 
        {
            "index": 530, 
            "rating": "5", 
            "review": "What a view!. Amazing view from this park - big park, no jostling for views, and the view is fantastic! Lots of benches, small concession area, beautiful fountain, great place to sit, relax and take in the beauty! This park is right next to Gloria Elevator, and is on the border of Bairro Alto and Principe Real."
        }, 
        {
            "index": 531, 
            "rating": "4", 
            "review": "great view over lisbon. if you want to see lisbon and its roof tops and its castle this is the place to go!!! and now they have two nice coffee places to have a drink and snack while enjoying the view."
        }, 
        {
            "index": 532, 
            "rating": "4", 
            "review": "Steep Walk, Nice View. Beautiful view, especially at sunset. Long walk, but worth it. Can see the castle and the river. Made for a worthy destination."
        }, 
        {
            "index": 533, 
            "rating": "4", 
            "review": "Very beautiful views. Lisbon is all about the views, and you get a really good one from this Miradouro. Like for other Miradouros, make it a quick stopping point during a nice walk in the city."
        }, 
        {
            "index": 534, 
            "rating": "5", 
            "review": "One of the best views of Lisbon. Do not miss this spot were you will take beautiful photos of some of the 7 hills of Lisbon, where you can see the old Castle, the Cathedral and the river"
        }, 
        {
            "index": 535, 
            "rating": "5", 
            "review": "My favourite Miradouro in the city. The view from the city you get at Miradouro Sao Pedro de Acantara became my favourite since the first time I've been there!Tou can see from Graca, the Castle, Alfama, all the way to the river Tagus. Downtown area, and behind you, Bairro Alto. So is great to check where you've been, plan where to go, take amazing pics, night or day. A must see. and for free :)"
        }, 
        {
            "index": 536, 
            "rating": "4", 
            "review": "Great view over Lisbon. A bit windy but the view is worth it! There's a coffee shop where you can have some snacks but I suggest picnic style as you have several benches and a small garden."
        }, 
        {
            "index": 537, 
            "rating": "5", 
            "review": "Favorite afternoon place. We used to spend some time in the afternoon there, for relaxing and enjoying the nice view. The place is lively with a lot of young people and street artists. You can also have a drink in the outdoor cafe."
        }, 
        {
            "index": 538, 
            "rating": "5", 
            "review": "Great view of the city. We walked up the hill because our map wasn't clear where the funicular started but when we saw the crowd on the funicular we were happy to have done so. Great view, nice gardens, little kiosks with beverages and nearby streets of Barrio Alto to explore. The Porto bar was not open on Republic Day in midday."
        }, 
        {
            "index": 539, 
            "rating": "5", 
            "review": "great view. lovely spot, small gardens-fun to reach by funicular (and the Port wine Institute is across the street!)"
        }, 
        {
            "index": 540, 
            "rating": "5", 
            "review": "Do not miss it! Beautiful view and it is free. Do not miss it! Beautiful view and it is free. You get one of the best views in the city and you dont have to pay like in the Castelo Sao Jorge, which is nice but there is no castle but just a nice view!"
        }, 
        {
            "index": 541, 
            "rating": "4", 
            "review": "Best view over Downtown. Just chill and sit in a public bank and relax in front the view with St George Castle...better at Night...and having a Porto Wine nearby..."
        }, 
        {
            "index": 542, 
            "rating": "5", 
            "review": "Possibly the best viewpoint in Lisbon!. Ditto. Offers a great view of the city. Very pleasant & large enough not to feel too crowded. Equally pleasant day & night! You can take the funicular up there though it is really not that much of a climb!"
        }, 
        {
            "index": 543, 
            "rating": "5", 
            "review": "Some of the best views of Lisbon available. This is a great little gardenterrace with cafe, we stumbled upon it as there was no mention in our guidebook, we sat here for 2-3 hours drinking wine and taking in the fantastic views of Lisbon, castle and sea. There are two cafes available on the two levels and it's all just near the top of the funicular up from the avenue de liberado, make sure you add this to your list of afternoon lazing."
        }, 
        {
            "index": 544, 
            "rating": "5", 
            "review": "Wow what a View. in the same road as Igreja San Roche. Wonderful view across Lisbon to the Castle. There is a cafe where you could easily rest awhile and enjoy the views."
        }, 
        {
            "index": 545, 
            "rating": "5", 
            "review": "Unique spot for a cocktail. We sat at the cafe at the Miradouro Sao Pedro de Alcantara each evening for an hour or two during our long weekend in Lisbon. It was a lovely romantic spot to have a couple of cocktails watching the sun go down on the castle and Alfama district. As the evening went on however the wind started to swirl around and it got absolutely freezing. The cafe had a supply of blankets to throw around the shoulders if it got too uncomfortable.During the day, the Miradouro is packet with tourists, entertainers and musicians, but there are still plenty of benches and sitting areas to while away and hour or so in the shade."
        }, 
        {
            "index": 546, 
            "rating": "4", 
            "review": "Wonderful Views. The Miradouro Sao Pedro de Alcantara is a must see because of the marvelous views of the city from this spot."
        }, 
        {
            "index": 547, 
            "rating": "5", 
            "review": "Day or night.... This Miradouro not only gives you one of the finest views over central Lisbon, the Castle, and Tejo. Beautiful not at least at sunset... But are also always a place vibrant with life and with several outdoor-cafés. A place big enough to be more like a park, even in 2 levels: You can spend hours here..."
        }, 
        {
            "index": 548, 
            "rating": "5", 
            "review": "Amazing view!. Amazing view to the castle & a part of Lisbon!Go to the lower part of the garden, have less people and have a drink in that small bar, very relaxing! :)"
        }, 
        {
            "index": 549, 
            "rating": "5", 
            "review": "A great view. This Miradouro is located at Bairro Alto with a great view to the castle of São Jorge and Alfama.A visit at night is a must."
        }, 
        {
            "index": 550, 
            "rating": "4", 
            "review": "A window over Lisbon. A city lying over seven hills is always a city with charming belvederes and São Pedro de Alcantara is a good example of it. The space has been improved as it is now extended over two levels both with beautiful flowerbeds and small terraces"
        }, 
        {
            "index": 551, 
            "rating": "4", 
            "review": "Nice view. Either before or after adventuring into Bairro Alto and /or Solar do Vinho do Porto, this privileged view is well deserved"
        }, 
        {
            "index": 552, 
            "rating": "4", 
            "review": "Perfect spot for chilling out at sunset hour.. You'll be astonished by the vastness and amazing view.\nThis viewpoint has two levels, both with esplanades with live music, dj's, snaks and drinks.\nClose to Bairro Alto and Gloria Funicular."
        }, 
        {
            "index": 553, 
            "rating": "4", 
            "review": "a sight for sore eyes. the midarouro is a great place to get your barings and a good place to sit and talk in the afternoon. The cafe is nice but has no toilet facilites. the outdoor cafe has a range of hot and cold snacks but the pigeons are a distraction and can cause a problem, if you don't like birds constantly at your feet. The views make up for this and you can get some panoranic photos of Avenida and across to the castle."
        }, 
        {
            "index": 554, 
            "rating": "3", 
            "review": "really nice view. Great place to hang, near Bairro Alto and Principe Real both really good places to eat and have some drinks in Lisboa.. At night you must be careful with your personal belongings, there are pickpockets around the area.."
        }, 
        {
            "index": 555, 
            "rating": "5", 
            "review": "Magic sunset over Lisbon. It's a great spot to watch the sunset over Lisbon. It as a cafe (which in my opinion is overpriced), but you can always take your own drink or buy it in one of the groceries around and jus sit and lay back in one of the garden benches. It's a wonderfull way of ending a full-tour day and preparing to start the night in the nearby Bairro Alto."
        }, 
        {
            "index": 556, 
            "rating": "4", 
            "review": "Beautiful place to sit and enjoy a coffee and the view. This 'mirador' feels a little off the beaten track, but it's definitely worth seeking out. It's such a peaceful place, with amazing views of the river and further out to sea. Beautiful on a sunny day."
        }, 
        {
            "index": 557, 
            "rating": "5", 
            "review": "Picturesque pedestrian square with great views.. Very romantic in the evening too. The plaza is paved with traditional Lisbon black and white tiles, there are lovely plantings and trees, and plenty of benches to sit on and admire the gorgeous views of Placa Rossio and the Castelo St. Jorge."
        }, 
        {
            "index": 558, 
            "rating": "5", 
            "review": "Cool place to enjoy the views!. One of the best places to see a different view of Lisbon. It has a wonderful sight and an esplanade where you can drink a beer, either in the afternoon or by night.In the summer, the night gets really lively with many locals and visitors enjoying the music.A nice place for a drink after dining in Bairro Alto."
        }, 
        {
            "index": 559, 
            "rating": "4", 
            "review": "Beautiful sights by the day or by night.... The title of the review really says it all!Whether you go by day or by night this place has one the most unique views of the cit of Lisbon, combined with a beautiful park and even a well known food kiosk.Be sure not to miss to tile panel explaining all the different you can view from up here, be sure to identify them all!"
        }, 
        {
            "index": 560, 
            "rating": "4", 
            "review": "at night!. Go to this place at night when it's dark and all the lights of the city are shining. You can climb from the Restauradores square but it's a pretty steep road. I recommend the 60-second ride by tram but if you do not have a daily transport card you will need to pay 2.75 Euro one-way. Enjoy!"
        }, 
        {
            "index": 561, 
            "rating": "5", 
            "review": "best in the city. Best miradouro in the city. Full of annoying people trying to sell you necklaces. But great view point."
        }, 
        {
            "index": 562, 
            "rating": "5", 
            "review": "A Must!. If you come to Lisbon you can't miss this place! Right on the top of one of Lisbon's hill this view point gives you an amazing views of the castel and the cathedral. You can also have a drink in one of the bars... and relax...."
        }, 
        {
            "index": 563, 
            "rating": "5", 
            "review": "Chill out spot. These gardens above the Rossio area offer a tranquil setting for some of the finest views over Lisbon. Very peaceful and there is a good little café in the corner. At the top end of the Gloria ‘elevator’ This side of town does not get too busy it seems and there is another fine small garden further on up the road towards the Jardim Botanico – I cannot remember the name, but is directly opposite the Jardim and there is a wonderful old cedar tree in the middle."
        }, 
        {
            "index": 564, 
            "rating": "5", 
            "review": "Amazing the view from this viewpoint. From this place we have a beautifull view of the others neighborhoods like the castle. Here you have a nice promenade with nice music."
        }, 
        {
            "index": 565, 
            "rating": "5", 
            "review": "amazing view. This is such a magical place. You feel like you have whole Lisbon in your hands and suddenly you feel this ease in you. Loved it. And there is no annoying people trying to sell you drugs."
        }, 
        {
            "index": 566, 
            "rating": "5", 
            "review": "My favourite viewpoint in Lisbon.. There are several view points in Lisbon, but this one, specially in summer nights, has a special magic. There's a kiosk with drinks, snacks and music."
        }, 
        {
            "index": 567, 
            "rating": "5", 
            "review": "amazing view of lisbon. the perfect place to see lisbon ,beautiful snaps for a great memory"
        }, 
        {
            "index": 568, 
            "rating": "5", 
            "review": "Great view!. Great place to stom and enjoy the view whilst drinking a Nice cold beer to start your night off before going into bairro alto!"
        }, 
        {
            "index": 569, 
            "rating": "4", 
            "review": "A must-see aspect of Lisbon life. I grew up with Blue Ridge Parkway overlooks, but Lisbon gets it right: these are like urban overlooks with seating for 50 and a wet bar. I happened upon my first one entirely by accident. This was my second, but it's arguably the best in Lisbon, with a marvelous view of the city and across to the castle on the next hill."
        }, 
        {
            "index": 570, 
            "rating": "5", 
            "review": "My favorite view in Lisbon!. You just have to go there to see for yourself. And don't forget to take Elevadore there or back, very cool"
        }, 
        {
            "index": 571, 
            "rating": "5", 
            "review": "The Best View of Lisbon. This park is a magical spot. The views of Lisbon can't be beat, and there's an outstanding cafe where you can enjoy a nice lunch or afternoon coffee while watching the tourists and passers-by.Most of the lunch items at the cafe are simple, like toasted sandwiches, but they're tasty and not at all expensive. When the weather is nice, it's probably one of the best places to sit out and enjoy the day."
        }, 
        {
            "index": 572, 
            "rating": "4", 
            "review": "a great place to stop and enjoy the city. you can look across the city to the castel sao jorge and sip on a drink while soaking in local color. jsut up principe real is a jardim with lovely trees and quiet atmosphere despite being on a major thouroughfare. just down the hill is igreja sao roque (not to be missed) and barrio alto. take a moment to sit and enjoy this lovely spot in the middle of everything."
        }, 
        {
            "index": 573, 
            "rating": "5", 
            "review": "Great View over Lisbon!. Miradouro São Pedro de Alcantara is a beautiful space. With a splendid fountain, lots of trees and has a terrace bar great to be with friends. I strongly recommend this place to everyone, even at night to take a drink.The view over Lisbon is fantastic! Whether you can watch all the old part of Lisbon as the Castle of São Jorge and Restauradores, you can see as well more modern areas - Saldanha."
        }, 
        {
            "index": 574, 
            "rating": "5", 
            "review": "Wow!!!. Take the Gloria elevador (although too expensive...)!! Then take a coffee with a pasteis de nata on the terrace an just enjoy the view!"
        }, 
        {
            "index": 575, 
            "rating": "4", 
            "review": "Beautiful day or night. A Lovely Viewing Point. It is Located at the top of Elevador da Gloria .This is a cobbled miradouro . It is nice and worth a visit."
        }, 
        {
            "index": 576, 
            "rating": "4", 
            "review": "One of the great views of Lisbon. Located near Bairro Alto and at the top of Gloria elevator"
        }, 
        {
            "index": 577, 
            "rating": "5", 
            "review": "Stunning views of Baixa, Mouraria and Castelo. This is a cobbled miradouro (viewing point) located at the top of Elevador da Gloria and right next to Bairro Alto. The views are stunning, especially at night. Definitely worth a visit.And it's free!"
        }
    ]
}