{
    "category": "Lisbon", 
    "entity": "Arco-Triunfal-da-Rua-Augusta", 
    "avg_rating_stars": 4.414754098360656, 
    "review_count": 610, 
    "rating_stats": {
        "poor": 5, 
        "average": 42, 
        "terrible": 1, 
        "very_good": 254, 
        "excellent": 308
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "4", 
            "review": "History looking down at you .. This magnificent piece of architecture is very central and around the narrow streets where there are many shops and restaurants. It is mainly something to take photographs of ."
        }, 
        {
            "index": 2, 
            "rating": "4", 
            "review": "Another good view point. After hearing about the history of the square, it seemed the obvious thing to pay the €2.5 to visit the top of the tower.A lift takes you to the level of the clock mechanism and then you walk up a few flights of narrow stairs to reach the top.Your reward is a beautiful view over the square on one side and with the castle above and behind you. Very spacious up there and looked a lot less busy than the Santa Justa Tower which we could see from our vista.They could have improved the experience by giving more information about the clock and the tower in English.Certainly worth a visit."
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "Amazing view. Amazing view of downtown and the riverfront of Tejo; no qeues to enter to the clockroom or reach the viewpoint on top of the building; the price (2,50€) is reasonable."
        }, 
        {
            "index": 4, 
            "rating": "5", 
            "review": "Really beautiful, must see at night!. The arch is incredibly beautiful...especially at night when it's lit up. From Rua Augusta you can see the statue and the river behind the arch. From Parco Commercio on the other side of the arch you look down the magnificent street. In the summer months, at night they have an amazing light show shown on the façade of the arch and the building it's attached to. Now THAT is really spectacular but it doesn't run year around. There are a number of restaurants on the Parco Commercio so the arch is a fantastic setting for dinner (esp since it's lit up)."
        }, 
        {
            "index": 5, 
            "rating": "4", 
            "review": "What a view. It's an iconic arch at the central point of Lisbon so to be able to go to the top was something I didn't want to miss. At 2-50 each it's an inexpensive trip there could be some more history but what there is is very interesting and when getting to the top the view is incredible"
        }, 
        {
            "index": 6, 
            "rating": "4", 
            "review": "A MAGNIFICENT ARCH WITH EXCELLENT VIWE ON THE TOP.. One of the most beautiful and popular monuments in Lisbon. a genuine historical structure and an architecture masterpiece. and (especially) the view of the top is breathtaking! if you have the time (and pay the ticket!) don't miss to go up!"
        }, 
        {
            "index": 7, 
            "rating": "5", 
            "review": "Wonderful looks of Praça do Comercio. The perfect place to have a wonderful look at the most visited place of Lisbon Praça do Comercio from its upper side and to take a photo sorrounded by the roofs of Lisbon."
        }, 
        {
            "index": 8, 
            "rating": "4", 
            "review": "Take a moment to look when walking through the Baxia. The Arco Triunfal da Rua Augusta is close to the river and easy to see when walking around the city center in the lower town."
        }, 
        {
            "index": 9, 
            "rating": "4", 
            "review": "On the Way to Breakfast. Awesome structure, mimes and human statues abound around this feature, very interesting and lovely to walk to, by and through!!"
        }, 
        {
            "index": 10, 
            "rating": "4", 
            "review": "Good city views. We visited this just before dusk so saw a good sunset over the main bridge in Lisbon. Access is by a lift and then stairs. The views of the city are excellent, and it is quite safe at the top."
        }, 
        {
            "index": 11, 
            "rating": "4", 
            "review": "1st time in Lisbon . Great view of center of town\nGood place to catch trams , buses and mini taxis\nLocal artisans and vendors set up stands on weekends making it a great place to find souvenirs and gifts"
        }, 
        {
            "index": 12, 
            "rating": "5", 
            "review": "Worth the money because of the view. The view from the Arch is phenomenal and really beautiful. You will get photos that otherwise wouldn't have been possible. I really liked it up there."
        }, 
        {
            "index": 13, 
            "rating": "5", 
            "review": "Very picturesque and a nice place to walk!. As we were out exploring the city on a Saturday, we gravitated to this area of town and found it to be picturesque and vibrant. There is a handicraft fair on Saturdays, and the streets have many musicians. Nice place to walk!\nCape Cod Blackie"
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "Overwhelming. Great view with relaxing ocean view, overwhelmed with the place and a must see, you can use the hop on hop off to visit it, the hop on hop off is really useful and nice."
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "Great View - Not Obvious. We didnt know that you could go to the top of the arch. However, it was listed on the Lisboa Card, so we went. The view is wonderful of the town, square, castle, waterfront, and the statues. I would put this on the must do especially if you get the Lisboa card. We did the 48 hour Lisboa card, and this was one of the gratis options. Once at the top, you can also ring the bell and confuse all the tourists that have not benefited from going to the top of the arch. Enjoy the views !!"
        }, 
        {
            "index": 16, 
            "rating": "4", 
            "review": "Photo stop. lots of people, couples getting wedding pictures done here with the magnificant plaza view. recommended meutermedia"
        }, 
        {
            "index": 17, 
            "rating": "4", 
            "review": "beautiful start to the square. beautiful arc that tops of an amazing square, lots of beautiful views of the water and further up to stores and shopping."
        }, 
        {
            "index": 18, 
            "rating": "4", 
            "review": "Nice overview of Lisbon. If you want to soak up a good amount of history in one little stroll, this is the place for you. But if you aren't into that sort of thing this area is great for views and photo opportunities."
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "Loved it!. One side is the Commercial Plaza; the other leads to Rua Augusta the famous walking street in Lisbon. But this beautiful monumental arch just sings history and commands some great photos. Gotta see it."
        }, 
        {
            "index": 20, 
            "rating": "4", 
            "review": "\"Triumphal!\". This is a very nice arch and a true piece of history! You can see it from the Rua Augusta or directly from the square of the commerce. The € 2.50 that you pay to get here and enjoy the view both on the city and the ocean is it is pretty inexpensive. I guarantee you some spectacular photos. If you wait for the sunset it will be even more attractive!"
        }, 
        {
            "index": 21, 
            "rating": "5", 
            "review": "A great view towards downtown area and praça do comércio!. Exceptional view over baixa and praça do comércio. Also very close to the castle and chiado. Fantastic view of squares streets in baixa.\nExceptional! Don't miss it!"
        }, 
        {
            "index": 22, 
            "rating": "4", 
            "review": "Stunning arc!. If you manage to to take a walk all the way down towards the metro train you will see the subway train at the end of the restaurant area of downtown Lisbon. A stunning piece of architected and adds real heritage!"
        }, 
        {
            "index": 23, 
            "rating": "5", 
            "review": "Only your eyes can tell you the story. Just go to Lisbon and enjoy. A beautiful structure by day and by night. A great display of different crafts and beautiful cafes to take the sun at any time of the day."
        }, 
        {
            "index": 24, 
            "rating": "5", 
            "review": "A beautiful Gateway. Everyday we seemed to begin or end our day here walking through the Arch to the Praca or the other way to do a little more shopping. It is so beautiful especially with the sunrise or sunset. Best time to visit is late afternoon when the crowds from the cruise ships have gone. If you get into Lisbon before 8pm come here to see a beautiful sunset and the city that looks to be shinning from the sun in places. This is a great place for photos if you have a zoom lens."
        }, 
        {
            "index": 25, 
            "rating": "4", 
            "review": "Beautiful arch. A nice Arch located in the city center, on one of the best areas to walk around and enjoy Lisbon nice buildings"
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "A Must visit attraction. This attraction is a great starting point for views & to get your bearings of Lisbon's historical attractions . A real bargain at 2.5 euros and unlike the other attractions, no queues and no crowds. Great views especially on a sunny day like we had - highly recommended."
        }, 
        {
            "index": 27, 
            "rating": "5", 
            "review": "Why travel to Paris? The Arco Triunfal is right here - in Lisbon!. Why travel to Paris? The Arco Triunfal is right here - in Lisbon! So much art and architecture in one place - you may spend the whole day here!"
        }, 
        {
            "index": 28, 
            "rating": "4", 
            "review": "Downtown Lisbon. Did a walk through the area, beautiful archetecture, the area beyond held many shops selling variety of goods."
        }, 
        {
            "index": 29, 
            "rating": "5", 
            "review": "Wonderful view from downtown. Must be place in Lisbon downtown. Way up will by elevator and stairs, the view from the top will compensate the effort"
        }, 
        {
            "index": 30, 
            "rating": "4", 
            "review": "Well hidden gem. Only realised you could get up here by looking on TA.Ticket office is easy to find once you know to look. We went up around 11:00 am and there were only handful of others. Well worth it."
        }, 
        {
            "index": 31, 
            "rating": "4", 
            "review": "Great, breathtaking, must see. It large and beautiful. The statue is marvelous. The buildings exterior designs are craftsmanship at it's finest. The plaza is like looking at a mirror, both sides the same."
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "Hidden gem in an obvious place. This is a great little find in an obvious place, the entrance is just off the square but once you get up to the top the search was well worth it. Great views of the city!"
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "Beautiful place!. Take some time to admire this area if you're ever around. The Arco do Triunfo is emblematic of the city and worth snapping a quick selfie in front of it!"
        }, 
        {
            "index": 34, 
            "rating": "5", 
            "review": "Have to see it. Amazing Arc, so great details. Wonderful place to be. As it is in the heart of the city, you will not be able to skip it :D\nOne one important thing, our tour guide informed us that street that goes behind the arc is full of drug addicts and pickpockets, so be careful."
        }, 
        {
            "index": 35, 
            "rating": "3", 
            "review": "Beautiful arch with nice views from top. Arco Triunfal da Rua Augusta is an absolutely beautiful arch to see when visiting Lisbon and it's perfectly on your way from Rua Augusta to Praca de Comercio. It costs 2.50€ to take an elevator up top to see the 360 degree view over Lisbon but the city offers many better viewpoints over the city so depending on your interest is not a real must to visit the top."
        }, 
        {
            "index": 36, 
            "rating": "5", 
            "review": "Go early for peaceful views. Really enjoyed this. The Arch opens at 9am and was still virtually empty when we climbed to the top around 9:30. Great views of the Plaza and the river. Entrance is included with the purchase of a Lisbon card and is definitely worth the trip to the top."
        }, 
        {
            "index": 37, 
            "rating": "5", 
            "review": "Great Views of the city. This has the story of the city on it. You can pay and go up to the top to get a good view of the city. Lisboa is very hilly but you will be able to see most of it from the top."
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "Great View!. Sits on a beautiful square on the water. Definitely climb up to see the view! Then walk around the the square/praca and check out the river."
        }, 
        {
            "index": 39, 
            "rating": "4", 
            "review": "Great area to be around.. Lots of restaurants and people around this area. It's a good site to get some great pics.Be wary of people trying to sell cocaine-laced marijuana to your teen."
        }, 
        {
            "index": 40, 
            "rating": "5", 
            "review": "Beautiful. Gorgeous view of the city, my favorite actually.I really recommend and it's quite affordable.There is a lift but you will always have to climb a few steps."
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "Impressive monument with splendid views. A very striking monument and - usefully - a lift/elevator - so that you don't have to walk all of the way up. It affords good views over the city and the Tagus."
        }, 
        {
            "index": 42, 
            "rating": "5", 
            "review": "Super view. Its a place to go. There is visits to the top, prepare to wait in line but its worth it, the view is amazing. Sometimes they made projections in the walls by night, if you are in Lisbon in that time, dont miss it."
        }, 
        {
            "index": 43, 
            "rating": "5", 
            "review": "More impressive than expected. Woaw! Approaching by descending the Rua Augusta, which is a must anyway, provides the best impression: the sea behind, the majestic architecture, and take the time to look into the side streets and, above all, the artistic pavement. Too lovely and impressive!"
        }, 
        {
            "index": 44, 
            "rating": "4", 
            "review": "Introduction to Lisbon. It's a big arch, a nice arch,at the the end of a really busy restaurant and shopping avenue. Not quite the Arc de Triomph but it does its job. Great introduction to Lisbon."
        }, 
        {
            "index": 45, 
            "rating": "5", 
            "review": "Wonderful experience. A soberb view over Lisbon city and the other bank of Tagus river! Very good for shooting photos and selfies!!!!"
        }, 
        {
            "index": 46, 
            "rating": "4", 
            "review": "Great views of the city. This quite new attraction is a must for the city visitors, as it offers great views of Praça do Comércio and the Baixa District. You can buy the combined ticket with the Lisbon Story Centre for 8€"
        }, 
        {
            "index": 47, 
            "rating": "3", 
            "review": "It's an Arch !. As arches go it's an impressive one but similar to several others around the world. This overlooks a wide open square which has seating around the square attached to various cafes. Worth seeing if in the area and a nice place to enjoy a glass of Sangria"
        }, 
        {
            "index": 48, 
            "rating": "3", 
            "review": "Not really worthy.... Just went up because included for free on my Lisbon card. Nice view of Praca do Comercio, but overall nothing really special."
        }, 
        {
            "index": 49, 
            "rating": "5", 
            "review": "Quick visit. It was fun to squeeze this in, we had the Lisbn Card so it was included. Is it worth 3.50, probably not, but not busy."
        }, 
        {
            "index": 50, 
            "rating": "3", 
            "review": "See on the way but not a destination. It's a nice photo op and cool to see if you happen to wander past. Maybe there's more history or backstory to this clock tower but without knowing it, it's kind of a spot you snap a pic and move on."
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "Views. An historic way to orientate yourself in this beautiful down town area of the city. There's a lift to take you most of the way to the top and a narrow staircase for the remaining floor to the top. Very simple but worth doing."
        }, 
        {
            "index": 52, 
            "rating": "4", 
            "review": "Nice example of Portugal arcitecture. this is a beautiful landmark not far from the water area. Nice place for pictures and people watching."
        }, 
        {
            "index": 53, 
            "rating": "4", 
            "review": "Triumphal arch as good as anywhere . The Arch is as good as the Arch de Triomphe in Paris or Wellington Arch in London and is positioned to welcome visitors arriving by ship so it is near to the coast leading into the shopping and eating heart of Lisbon."
        }, 
        {
            "index": 54, 
            "rating": "4", 
            "review": "Entrance of Praca do Comercio. A landmark or entrance of Praca do Comercio, a grand and elegant arch. Do walk around the area when you are strolling from Rossio to Praca do Comercio."
        }, 
        {
            "index": 55, 
            "rating": "5", 
            "review": "The arch. Lisbon has its own \"arc de triomphe\". It is nicely placed right at the entrance to the old city (Rua Augusta). Or if you are coming from the old city, you exit right into the esplanada by the river."
        }, 
        {
            "index": 56, 
            "rating": "4", 
            "review": "Well worth the visit despite being poorly advertised. I hear this is Lisbon's newest tourist attraction. The monumental arch is obviously visible from Praça do Comercio and Rua Augusta but you can now get tickets to climb to the top and take in the views. The tiny entrance is on the Rua Augusta side and easily missed as I never saw a queue there during our stay, probably as I never saw any advertising for it save for one website. Entrance is free with the Lisboa Card, otherwise entrance is €2.50 per adult which is pretty good value. The first part is accessible by a lift and the rest via the old spiral staircases which serviced the clock and other parts of the monument. Parts of the staircase can be dangerous for small children so make sure you're always holding on to them. Once at the top the parapet wall is high enough to ensure safety. Strollers must be left at the bottom by the ticket desk. There is a room on the way up where you can observe the clock's mechanism and there is limited interpretation. personally, I think it's a missed opportunity as it could include a lot more interpretation on the history of the arch, its construction and what it represents. The views at the top are brilliant. Some say you should see this instead of the Elevador de Santa Justa which also provides a brilliant view but its a different view so I'd still recommend you visit the Elevador in addition to the Arco. Overall a good value attraction which is yet to be discovered by the crowds. So shhh..."
        }, 
        {
            "index": 57, 
            "rating": "4", 
            "review": "Very nice view of Lisbon. From the top os the arch and for a symbolic price you can have a pretty nice view of Lisbon and the old part of the city."
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "A great overview of Lisbon. Arco da Rua Augusta is a monument that offers a privileged view over Lisbon. It costs 2,5 euros to go up the elevator and check it out. It's worth it. The monument is beautifully crafted in stone. You can see my photos on my blog: http://vanessasenasousa.blogspot.pt/2016/08/arco-da-rua-augusta-e-praca-do-comercio.html"
        }, 
        {
            "index": 59, 
            "rating": "4", 
            "review": "Much better than the lift. We have been advise by the hotel to go on top rather than the elevatore. Good advice, no queue, nice view and you feel like alone on top. I recommend."
        }, 
        {
            "index": 60, 
            "rating": "5", 
            "review": "Great view from the arch. . Free entrance with Lisboa Card. Enjoyable view over Rua do Augusta towards Praça Rossio, short tour up that can be a stop on your way to restaurant etc."
        }, 
        {
            "index": 61, 
            "rating": "4", 
            "review": "Nice area. walking around this area you are drawn to the historical architectures and the many different sights near the arco ."
        }, 
        {
            "index": 62, 
            "rating": "4", 
            "review": "360º view over Lisboa. This monument is located next to Praça do Comércio, being himself a historical reference of Lisbon. The visit has cost 2.5€ per person (price for adults, is cheaper for children) and the experience is great. The way to the top of the building is made by elevator and stairs. The stairs are narrow and only allow the passage in one direction at a time, however the movement between floors is very well organized. When we got to the top, we have a fantastic surprise when we realize the fantastic 360º view over Lisbon, It is a place of obligatory passage in Lisbon, ideal for photographs. This monument is not suitable for people with motor disabilities. There is no near parking so you have to walk through Lisbon center to get there."
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "and you enter into La Praça do Comercio. Experience a walk in this old part of the Lisbon city and you will always remember it. It is really enchanting."
        }, 
        {
            "index": 64, 
            "rating": "4", 
            "review": "Arco Triunfal da Rua Augusta. The top of the Arc , offers panoramic views of the city, To visit , the entrance to the monument is by Rua Augusta, by just a small door next to the arch. The ticket costs 2.5 euros. Access to the elevator that takes on the top floor. , You have to climb about 30 steps to reach the room where the clock is located. In this space was placed a sign in which he explains the history of the arc, since its construction in 1759 to its completion in 1875.From the top you can admire the Terreiro do Paco, with the newly restored equestrian statue of José I, the Baixa, the Cathedral, the São Jorge Castle and the Tagus, ."
        }, 
        {
            "index": 65, 
            "rating": "5", 
            "review": "Beautiful views of Lisbon. Yet another spot for catching beautiful views of this amazing city. We had the Lisboa card which allows for free entry (otherwise, it's €2,50 for adults). They scan your card and provide you with a ticket. You have to insert the ticket into a turnstile to enter the elevator, and again as you leave (so don't misplace your ticket while at the top). The elevator takes you up to one level below the rooftop, and a small staircase takes you the rest of the way. Stunning views across the river as well as the city center, with Rua Augusta directly below. We went in the late afternoon and it was practically empty. The entrance is on Rua Augusta just before you cross the street to get to Praça do Comércio - if you're facing the plaza, it'll be on your left."
        }, 
        {
            "index": 66, 
            "rating": "5", 
            "review": "Superb . Catch the metro to terrio do paco and you will surface right on the square next to the arc. Beautiful view . The square itself has places to eat around the perimeter . Go though the arc and you will enter rows of shops with restaurant tables set out in between. Great choice for lunch"
        }, 
        {
            "index": 67, 
            "rating": "4", 
            "review": "Nice views of the square. This is an easy place to visit at €2.50. There are some narrow stairs after the lift ride. There are good views of the square and the river."
        }, 
        {
            "index": 68, 
            "rating": "5", 
            "review": "Come here for pictures. come here for pictures and eat at the plaza. We stopped by here after visiting the Oceanarium, and strolled around the plaza, took pictures, and couldnt have been a perfect day. If its too sunny and hot during, then its better to come here late afternoon. The smell of fresh water and air, gives it a nice relaxing time"
        }, 
        {
            "index": 69, 
            "rating": "4", 
            "review": "Beautiful architectural design. Walking throughout Lisban is a pleasure as most of the buildings are beautiful designed. As the Arc is aswell"
        }, 
        {
            "index": 70, 
            "rating": "5", 
            "review": "Main Rue. The main road leading to the sea with plenty of shops and restaurants along side the car free pedestrianised area."
        }, 
        {
            "index": 71, 
            "rating": "3", 
            "review": "Another arc de triumph . It is placed in a nice place, in the back there is the Augusta street with lots of shops and Caffès and in the front of it the square and the river. Don't miss it and take some pictures there. Basically it on another arc like In each European city."
        }, 
        {
            "index": 72, 
            "rating": "4", 
            "review": "Great view from the sea side. Very picturesque Arch by the main pedestrian street. Go through it and see it from the side closest to the harbour. It's great, but beware of the shady characters that hang around near the plaza there."
        }, 
        {
            "index": 73, 
            "rating": "4", 
            "review": "Amazing structure !. It's an amazing structure full of art you will certainly notice while visiting the very famous Praça do Comércio"
        }, 
        {
            "index": 74, 
            "rating": "4", 
            "review": "Steve C. Pretty much just another arch which is on the Rio Tejo. Also known as Praca do Comercio (Trade Square) and palace Square. It's by the departure point city bus and tram tours and boat tours cruising along the Rio Tejo.\nVasco do Gama is represented on the left and Pompal on the left."
        }, 
        {
            "index": 75, 
            "rating": "4", 
            "review": "Beautiful Arch. You can picture the crowds sending Vasco DaGama off on his explorations from this arch and square. Right in the heart of the historic district, surrounded by port wine shops, restaurants, souvenir shops and the main shopping area."
        }, 
        {
            "index": 76, 
            "rating": "5", 
            "review": "One of the best things we did!. Really cheap to get in and it has the best view of the rue Augusta. Great for orientating yourself with Lisbon. TIP: keep your ticket as bizarrely you need to scan it on the way OUT"
        }, 
        {
            "index": 77, 
            "rating": "4", 
            "review": "Incredible Sculpture. I'm always amazed at the incredible skills of craftsmen from the past. This monument is no exception.It sits majestically opposite the entrance to the sea and acts as a reminder of the once powerful days of ocean explorers and seafaring sailors .Head towards the water, take your shoes and socks off (socks comment is for untrendy people only) and put those hot heels in the cold Atlantic waters. Let momentary shock ease you into heavenly calmness. It's what you deserve."
        }, 
        {
            "index": 78, 
            "rating": "4", 
            "review": "Well worth a look. This is beautiful to look at from the street, but is worth going up to the top it cost 2.50euros.You climb the winding staircase to the top of the Arco Triunfal and from there you get great views across the square and out to the river and inland over the city. You can see up to the cathedral and the Theatre and the castle.We enjoyed it very much."
        }, 
        {
            "index": 79, 
            "rating": "5", 
            "review": "Great Arch, just majestic!. This is a beautiful structure in the central part of Lisbon. On one side there is the waterfront with the Comercio Square in front of the river, and on the other is the beginning of a beautiful set of roads lined with all types of shops, from yummy cake shops to cafes, restaurants and many others. There are people everywhere, and all of this creates such a lovely atmosphere when you go out for a walk to enjoy the day or the evening. It is absolutely charming. The Arch is a symbolic structure expressing the city's gratitude for their ability to survive and in the end triumph and prosper, after the 1775 devastating earthquake. It's a symbol of re-birth and at the same triumph over adversity. As the Latin inscription on the Arch states: \"The Virtues of the Greatest, that they may be a lesson to all, mark for eternity the grandeur of the Portuguese soul and its achievements throughout the ages\". Excellent!"
        }, 
        {
            "index": 80, 
            "rating": "2", 
            "review": "Avarage. Maybe i am just not the typical tourist, thisfeels just like a must do. If you could, just take a cab and have it drive by so you can cross it of your list. There is a lot of nice architecture on your way to costa da caparic if you take bus 161. Nice bridges, jeaus statue and more. Alot of beggers and different people asking you for money around the area."
        }, 
        {
            "index": 81, 
            "rating": "4", 
            "review": "Good place to admire Lisbon. Arch top we have a magnificent view of Lisbon and the Tejo River.\nIts a good place to visit in sunny days!"
        }, 
        {
            "index": 82, 
            "rating": "5", 
            "review": "Great view of the city. Just go and visit, it is really worth it. Cost are just 2,50 euro and you got a wonderful panoramic experience over the city, the square and shopping streets."
        }, 
        {
            "index": 83, 
            "rating": "5", 
            "review": "Great history!. Our tour guide shared the history of the arch and the waterfront and it's very interesting. Easy to find and central to everything. You can catch all the hop on buses, tram and tours here."
        }, 
        {
            "index": 84, 
            "rating": "4", 
            "review": "Take Jump Shot. In every icon of the city we visited, my better half always have a souvenir jump shot, this huge arch facing the promenade and enjoy the water with the view of Vasco Da Gama bridge."
        }, 
        {
            "index": 85, 
            "rating": "3", 
            "review": "Another Arch. This arch sits in a giant square but on the other side of the arch is the beginning of great shopping and Port and wine tasting. Once you take your picture of this arch, head through it and enjoy the wines."
        }, 
        {
            "index": 86, 
            "rating": "4", 
            "review": "Beautiful Architecture. This is a stunning thing to see, and well done to Lisbon to making sure these things are kept when times are so hard"
        }, 
        {
            "index": 87, 
            "rating": "3", 
            "review": "Take a Selfie. One of those things you need to say you saw. But also a good place to get travel information nearby and a transport hub. Form here you can get to many other parts of Lisbon. There are museums near by. We stumbled on one the Museum of Money which is free and we normally never would have gone to."
        }, 
        {
            "index": 88, 
            "rating": "5", 
            "review": "The Gateway to Peace!. When you get to the city, go here first, have a seat, reflect and relax by the river, then you're set for the day!"
        }, 
        {
            "index": 89, 
            "rating": "4", 
            "review": "Attractive arch structure at the end of Rua Augusta. This is a monumental arch entrance to Rua Augusta from Praca do Comercio in the city centre of Lisbon. You can see the triumphal arch structure conveniently while strolling along Rua Augusta or from the square. This monument was built to commemorate the city's recovery from the 1755 earthquake that devastated Lisbon. The arch was completed in 1875. From Rua Augusta, you see the backside of the arch which has a clock face surrounded by decorative relief. It is not as attractive from this location however, fromhere but you see the statue of King Jose I through the arch gap. This is nice for photographs. From the square you see the full spectrum of design that went into the arch's construction. Here you see six columns holding up the 30 metre tall structure, a relief of Portugal's Coat of Arms midway up the centre arch, as well as an allegorical arrangement of figures, three atop the centre arch which opens to Rua Augusta and one each upon the two side arches which form part of the walkway around the plaza at the north end. It is a nice overall composition worth a few clicks of your camera."
        }, 
        {
            "index": 90, 
            "rating": "5", 
            "review": "cocaine hash marijuana?. This place is very touristy. There are a lot of cool shops and the atmosphere is get. I seriously have never heard this so much in my life though cocaine hash marijuana?"
        }, 
        {
            "index": 91, 
            "rating": "4", 
            "review": "The view is amazing!. Right in the city centre of Lisbon is this Arco Triunfal. We took the lift to go up and then the small stairs. When we were up on the rooftop with beautiful statues. One side overlooking the Praça do Comércio and the other side the small \"high streets\". Also a great view over the beautiful city."
        }, 
        {
            "index": 92, 
            "rating": "4", 
            "review": "The heart of Lisbon.. Spectacular square that leads you to either the waterside or the shopping district, with plentiful restaurants."
        }, 
        {
            "index": 93, 
            "rating": "4", 
            "review": "Very pretty area of the city. The monument is located in a nice part of the city, with a nice square (where sometimes there are artists selling very pretty hand-made souvenirs), and close to the ocean. Perfect place to relax after a day of sightseeing!"
        }, 
        {
            "index": 94, 
            "rating": "5", 
            "review": "Magnificent!. This is one of the most beautiful of all of the triumphal arches in Europe. It really is beautiful on a day with sunny blue sky, the adjacent yellow walls really bring out the glorious qualities of the arch. Great entrance to a beautiful area of shopping and eating. I love this plaza. And the arch sets it off beautifully."
        }, 
        {
            "index": 95, 
            "rating": "5", 
            "review": "Nice Site. The arch is a great thing to see while in Lisbon. It's a quick visit to see. Great architectural arch."
        }, 
        {
            "index": 96, 
            "rating": "5", 
            "review": "You cannot avoid it. For those interested in the history of Lisbon there is no way of missing the Rua Augusta Arch, the entrance is only 2 € and no queue at all. Just rise over the city and looked at it from a bird's view. A nice experience."
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "Central Landmark. Whether you are interested in the history of the Arch or not, the gateway to the city of Lisbon, and the entrance to the grid area rebuilt after the 1755 earthquake, is a landmark and focal point that makes navigating around the city by foot easy. It opens onto the Rua Augusta on one side, a main shopping thoroughfare where you will find several well-known names mixed among local portugese shops, and the waterfront on the other."
        }, 
        {
            "index": 98, 
            "rating": "5", 
            "review": "Beautiful arch. This sits like some Arch de Triomphe, but rather than celebrating victory in war it represents an entryway to many splendid sites in Lisbon. For Lisbon's glorious past, it deserves to say hello to tourists in this pompous way."
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "Top of the Arc. We noticed there were people on the top of the Arco Triunfal on the Praca do Comercio and, after a little bit of searching found the entrance on the Rua Augusta. A lift takes you part way up the building and then you climb stone spiral staircases to the top.The views are some of the best in Lisbon, overlooking the main square and the river."
        }, 
        {
            "index": 100, 
            "rating": "4", 
            "review": "Entrance gate to the main square. This arch marks the entrance to the huge main square of the city, the Praca do Comercio. The arch itself is worth to stand and take a look at, it is beautiful and rich in details!"
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "Climb to the top of the Arc! Great view!. I had walked under the arc a lot during the last few years and just recently found out you can also buy a ticket and get on top of it! A lift takes you half way up and there is a staircase to the very top (with staircase traffic ligths, because it's quite a small staircase)..Really nice view to the city, the square in front of it and to the river."
        }, 
        {
            "index": 102, 
            "rating": "4", 
            "review": "Praça do Comercio. This arch is included in the buildings that are in Praçca do Comercio. In the archs around the gate is located a flea market"
        }, 
        {
            "index": 103, 
            "rating": "2", 
            "review": "Over rated city. There are some beautiful buildings but the whole city seems grubby and unloved. There seems to be a big drug problem, we were offered drugs on the street on countless occasions (and we are a mature couple) The public transport system is very good & easy to use, but feel the city is over rated and very expensive."
        }, 
        {
            "index": 104, 
            "rating": "5", 
            "review": "stunning entrance. This is one of the first things you see when you enter the town centre and is very impressive. It sets the tone for the city"
        }, 
        {
            "index": 105, 
            "rating": "4", 
            "review": "Nice place to visit. Beautiful architectural design, nice path getting you to the concert squares onto the ocean, nice location"
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "Two clear distinctive vantage points. Heading toward the arch is an incredible stroll down a street full of shops and cafes. Cross through slowly and enjoy the architectural details. On the other side you enter into a completely different world in one of Europe's largest squares and the waterfront. Stunning."
        }, 
        {
            "index": 107, 
            "rating": "5", 
            "review": "Go there while praça is not having an event . The nice view, easy to access, almost at the corner. If you like photography or you are Instagramer, here is the one! Don't miss it :) \"Good for rainy days even! \" Cause the streets are empty for you taking pictures."
        }, 
        {
            "index": 108, 
            "rating": "4", 
            "review": "Amazing point of view. It is an interesting place, a lift take you until the middle and after some stairs you arrive at the top . From there you dominate the Taje river, and all the ancient districts of the capital."
        }, 
        {
            "index": 109, 
            "rating": "4", 
            "review": "Shopping, Eating, Viewing beautiful architecture. This is a busy hub of a place in central Lisbon. If you look at the arch from the seaside, it is beautiful. The intricate design of the arch itself is awesome. There are trams going places and you can also easily get an Uber car. Walk in under the arch and you are in a buzz of activity, with street performers in abundance. Some are actually quite good. The shops are the usual variety--H&M, etc. I think if you want local things, you must walk outside of this center to find them. Be careful of the hawkers for the various eateries, as they will usher you in quickly. Some of the food is not very good, so I'd say to look at menus before sitting down. This wasn't my favorite thing to do in Lisbon, but it did fill up a day."
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "Great views of the city. Highly recommended. Inexpensive. Entrance on the left side of Rua Augusta. Elevator to top floor and then stairs to go up."
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "Fantastically impressive. At the far end of the busy Rua Augusta you will be drawn to walk down to see this impressive arch, one side it has a coat of arms facing the Praca do Comercio square, and the other side looking up Rua Augusta has a beautiful monument clock featuring motifs.\nLook through the arch to see the River Tagus."
        }, 
        {
            "index": 112, 
            "rating": "5", 
            "review": "Fantastic views. Wonderful views from the top. Small charge but well worth it. Steps & a lift but not difficult.can look right over the city centre."
        }, 
        {
            "index": 113, 
            "rating": "4", 
            "review": "Worth a visit - wonderful viewpoint. Well worth the trip up to the top of this monument - only a couple of euros and you get lovely views over the city and the sea and particularly over the square below. A working clock linked to the bell on top of the monument may encourage you to time your visit well! There's a lift and then some steps to top."
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "Impressive Arch. Arch is impressive and especially the way it is integrated with the neighboring buildings.The alley next to it is full of restaurants."
        }, 
        {
            "index": 115, 
            "rating": "5", 
            "review": "Impressive arch. Wandered down the pedestrian street and this arch stands almost at the bottom giving access to a stunning square. Great photo opportunity"
        }, 
        {
            "index": 116, 
            "rating": "4", 
            "review": "Nice view. You have from the top of the Arc a nice view on the place and the rest of the downtown. You can see the bridge and the statue too. Quite nice"
        }, 
        {
            "index": 117, 
            "rating": "5", 
            "review": "Good View. Nice place to take pictures from Lisbon, just take a lift for 3 euros and get at the top of the roof to see an amazing view."
        }, 
        {
            "index": 118, 
            "rating": "4", 
            "review": "Great architecture and view from there. it is good to visit just 2.50 Euro for entry, there is an elevator and a few steps to climb. The view is amazing - you can see the castle in Alfama, the whole city, the river."
        }, 
        {
            "index": 119, 
            "rating": "5", 
            "review": "DO IT! Super cool and CHEAP!. We were pleasantly surprised when we discovered that you can actually climb to the top for about 3 euros (talk about a cheap attraction!). An elevator takes you more than half way where, you then have to climb a few narrow winding stairs. Once up top you get a super great view of the Plaza, the city, and the river! Not to be missed!"
        }, 
        {
            "index": 120, 
            "rating": "5", 
            "review": "beautiful architecture. very impressive Triumphal Arch, loved the architecture in Praca do Comercio, great river views from here."
        }, 
        {
            "index": 121, 
            "rating": "4", 
            "review": "Wonderful view of the city. We were able to get into this for free with the Lisbon City card. The view from the top is amazing. You can see everything and it is worth it just for the views! We went up both during the day and at dusk. You can see most of the popular sites from the top."
        }, 
        {
            "index": 122, 
            "rating": "5", 
            "review": "Amazing detail!!. Although this is in a fairly busy area you can take as long as you like to admire this wonderful archway."
        }, 
        {
            "index": 123, 
            "rating": "5", 
            "review": "A beautiful square at the entrance to the city.... This area is well worth a visit while in the city- it is a hub of commerce, and there are restaurants and bars, etc. all around it. We enjoy walking, and there is always a lot of activity going on in this area, with buskers performing, and you can have a view of the River Tagus as well. Well worth a visit!"
        }, 
        {
            "index": 124, 
            "rating": "5", 
            "review": "Lovely view of the whole (almost) Lisbon. Early-evening views of Comercio, Tejo, Sé, Rosio and Rua da Praca is just as wonderful as from Arc de Triomphe in Paris on the Champs-Élysées ... pulsating life in the streets, a good place for unusual photographs or only watch around and keep hands with a loved one. Lift onlyin lower floor, then up the stairs. So for wheelchairs only partially."
        }, 
        {
            "index": 125, 
            "rating": "5", 
            "review": "Seen from two sides. This is an interesting piece of architecture and can be seen from Parca Comercio and Rua Augusta for the other side/"
        }, 
        {
            "index": 126, 
            "rating": "3", 
            "review": "Place to see . You need to see the arch when you go to Lisboa. Very nice arch. You can go up too but, very busy, we are in May and it is packed."
        }, 
        {
            "index": 127, 
            "rating": "4", 
            "review": "Overview of the city. On top of the arch you have a stunning view over the city of Lisbon. From the Rua Augusta to the Castle to the statue Cristo Rei. Worth paying the 2,50 euros for it."
        }, 
        {
            "index": 128, 
            "rating": "5", 
            "review": "Massive and magnificent!. The soaring arch provides the perfect entrance to the Praca Comercio. It's a pleasant stroll through the shops and cafes on Rua Augusta to reach the arch and the waterfront beyond."
        }, 
        {
            "index": 129, 
            "rating": "5", 
            "review": "Colossal arch. Bit hard to miss this. In Praca do Comercio at one end is this huge arch and the other end is the waterfront. Go through this arch and you are immediately on the trendy street of Rua Augusta with all its restaurants and street entertainers. Best reached by metro station Terreiro do Paco. Just come up out of the tube station and you are in the huge square with the huge arch at one end."
        }, 
        {
            "index": 130, 
            "rating": "4", 
            "review": "Can't avoid to see it when visiting Praca do Comercio. Impressive Arch you cross gooing from Praca do Comercio to Chiado. Street artists, shops, beatiful people all around makes this pedestrian street a charming part of Lisbon on foot."
        }, 
        {
            "index": 131, 
            "rating": "5", 
            "review": "Well worth seeing!. Spectacular piece of architecture set in an elegant sure, with arched walkways similar to the Liston in Corfu on each side."
        }, 
        {
            "index": 132, 
            "rating": "5", 
            "review": "Stunning Archin Centre of Lisbon. The is area of Lisbon is very impressive - in the centre, it is the centre piece of the area. A total most visit."
        }, 
        {
            "index": 133, 
            "rating": "5", 
            "review": "Stunning gateway to the city, with the river backdrop. Dont miss!. Plenty places to view, photo, eat and drink around this spacious area, or just sit by the river. Watch out for the drug pushers that will pester all day and night in the centre, and make a firm \"NO\". Avoid the Tuk tuks that swamp the city now, use the trams or your legs to walk."
        }, 
        {
            "index": 134, 
            "rating": "5", 
            "review": "The big Lisbon arch. If you collect big and imposing arches, you will want this one! Paris has its Arc, London its Marble Arch - and this is Lisbon's, complete withfine clock and grand square. Really worth seeing."
        }, 
        {
            "index": 135, 
            "rating": "5", 
            "review": "Great views of the surrounding area. This visit was not in our plans but when we paid for the history of Lisbon in the Tourist Information in the square we were offered a combined ticket for an extra euro. We took up the offer and visited the next day. Not many visitors so no queue and only a few people on the 'roof'. Lovely sunny day so it was ideal. Great views.Would recommend"
        }, 
        {
            "index": 136, 
            "rating": "3", 
            "review": "Awesome views from the top! . I guess that's the main attraction... the awesome views you get from the top! :) This is not a good place for disabled people or with mobility problems, since you have to go up and down very narrow round stairs. For those who are up to it and love a great place with bird's-eye view, this is an awesome spot."
        }, 
        {
            "index": 137, 
            "rating": "5", 
            "review": "Lovely Views. We went to the top of this it has amazing views you can see all over Lisbon and out to the water and the other side. The statues are beautiful close up and you also can see the clock mechanism in side very cool. But really a great photo opportunity."
        }, 
        {
            "index": 138, 
            "rating": "5", 
            "review": "Beautiful view. Visit right before sunset. Totally worth the visit. Beautiful view and not crowded at all on a Friday evening. You take the elevator and then some steps."
        }, 
        {
            "index": 139, 
            "rating": "4", 
            "review": "The Arc of Lisbon.. The Arco Triunfal da Rus Augusta is lovely. The setting is gorgeous and the square beautiful. A very picturesque spot in Lisbon that should be on all itineraries."
        }, 
        {
            "index": 140, 
            "rating": "5", 
            "review": "Lisbon Arc. This is located within the Praca du Comercio square which has load of cafe's and restaurants on the side. Walking farther along is the harbour where the Ponte Vinte Cinco Abril bridge is in all its glory! We had a fabulous time snapping photos and loittering around Lisboa!"
        }, 
        {
            "index": 141, 
            "rating": "4", 
            "review": "Photgraphic Arch. This arch separates the Praca do Commercio from the Avenue Augusta that is one of the major shopping areas of Lisbon. Although we did not do so, the top of arch can be reached by elevator to the top for a nominal fee. Great photos can be taken from there."
        }, 
        {
            "index": 142, 
            "rating": "4", 
            "review": "Centrepiece of the rebuilding of Lisbon. Commemorating the rebuilding of Lisbon after the 1755 Earthquake, this arch is the centrepiece of the plaza looking out to the sea. There is a side entrance for those who wish to climb up to the top of the monument, but it is best seen as a major piece of historic civic architecture."
        }, 
        {
            "index": 143, 
            "rating": "5", 
            "review": "Great views! . We were tempted by the elevator further down Rua Augusta, but having read that the Arch has better views, cheaper entry and potentially no queues we thought we'd give it a shot. We visited late evening and that was perfect as we hit 'golden hour' in terms of the beautiful light across the city and also zipped straight up in the lift and found the viewing platform to be nice and quiet (perfect for lots of pictures!) definitely recommended for the bargain price of €2.50!"
        }, 
        {
            "index": 144, 
            "rating": "5", 
            "review": "Fantastic Arco and fantastic view. This Arc has been opened not to long ago and it is really great to see what a beautiful surprise this is, the views here are fantastic and the renovation as well . A must see and really cheap as well"
        }, 
        {
            "index": 145, 
            "rating": "5", 
            "review": "Very nice view of Lisboa. We recommend this place as a must see for everyone. Very nice view of Lisboa! (free for Lisboa Card holders, about 75 steps + lift )."
        }, 
        {
            "index": 146, 
            "rating": "4", 
            "review": "Impressive and meaningful. A beautiful gateway to the plaza and sea beyond. Take he time to really examine the special beauty of this monument. It is quite breathtaking and that makes it tempting to stand there with or without the selfie stick and click and move on. Whatever you do, don't be a tourist. Be an art lover and spend some time looking at the thing and soaking up all the meaning."
        }, 
        {
            "index": 147, 
            "rating": "4", 
            "review": "Don't forget the EarthCache!!. On a sunny afternoon, I walked down the main avenue to the river, through this impressive Arch. Really worth taking quite a few pictures. And once you are there, if you like Geocaching ... you should know what to do :-)"
        }, 
        {
            "index": 148, 
            "rating": "4", 
            "review": "So nice its beautiful. This is one of my favorite destination the architecture is amazing in the plaza as well the Arc that leads you to a busy street full of shops and restaurants. Grab a Pastel de Nata or try the other sweets that they offer in most of the place. Then walk all the way to the next square and on the left side you find the train station with Starbucks coffee good for resting after a long walk."
        }, 
        {
            "index": 149, 
            "rating": "4", 
            "review": "Enter history. This arch leads to the historic city center of Lisbon. Passing under it you enter the old commercial center, now converted to offices, stores and shops and squares."
        }, 
        {
            "index": 150, 
            "rating": "4", 
            "review": "An impressive view right next to the sea front. A good area to walk from as not far from the shopping and walking centre of Lisbon - just a short stroll to the sea front walk and port areas."
        }, 
        {
            "index": 151, 
            "rating": "4", 
            "review": "photo op!. Giant monument with great history. Its a quick stop right at the start of Praca do Comercio. Pass under and take some photos..."
        }, 
        {
            "index": 152, 
            "rating": "3", 
            "review": "interesting piece of art. It's interesting architectural item of Lisbon city, not only due to the historic and artistic side, but also the location matching perfectly with the surroundings.\nIs also a nice option to go to the top, worth to pay the ticket and have a unique view over the square and the river side."
        }, 
        {
            "index": 153, 
            "rating": "5", 
            "review": "Masterpiece. A colossal arch that connects the city center and the Praca dos Comercio. You can take the elevator for a fee and a see the wonderful view of the city. The city's arch is a centerpiece to be admired. Its a beautiful example of artistic talent and a showpiece."
        }, 
        {
            "index": 154, 
            "rating": "5", 
            "review": "Wonderful views!. We got a tip from a Portuguese friend that the public can now go up the famous white arch. Only just opened and 2.50 Euros each. Hardly anyone up there whereas the Eiffel 'tower' was heaving. Superb 360 degree views of the city."
        }, 
        {
            "index": 155, 
            "rating": "5", 
            "review": "Great view of the Praca do Commercio and Rio Tejo. This was another must visit site and was also accessible for free for holders of the Lisbon Card. The clock mechanism was being wound during our visit and it was interesting to see the link between mechanism and bell above on the belvedere. The views of the Praca do Commercio, on one side, and the Rua Augusta, on the other, are excellent and the more interesting for their intimacy and evocation of the Roman era. The sculpture on top of the arch is also very impressive. As at every other historical or site of interest in Lisbon we found the staff very friendly, helpful and very capable English speakers."
        }, 
        {
            "index": 156, 
            "rating": "4", 
            "review": "Wonderful views. Lisbon, being built on some very steep hills, is all about views, which makes walking around the city such a wonderful experience. The view from the top of the arch is very different from the rest as it's in the lower, central part of the city and provides 360 degree views.Access is through an elevator ride, followed by a climb on a narrow spiral staircase with \"traffic lights\" allowing for alternating up / down traffic."
        }, 
        {
            "index": 157, 
            "rating": "4", 
            "review": "A diiferent view of Lisbon. We stumbled on this place as we went in to ask about another museum. The 2 euro entrance fee is well worth paying to see the streets of Lisbon from on high."
        }, 
        {
            "index": 158, 
            "rating": "4", 
            "review": "Great views a must climb. Arch that can be seen from the main boulevard through Lisbon and a climb to the top is more than worth it.Great views onto the main square & back into Lisbon city, only 5 euros for two & there's a lift, great."
        }, 
        {
            "index": 159, 
            "rating": "4", 
            "review": "Pretty nice view on the top. It's not a must see place but it's worth of couple of euros to pay a visit. The stair to the top after the elevator are really narrow."
        }, 
        {
            "index": 160, 
            "rating": "4", 
            "review": "Majestic Arch- gateway to Lisbon's Hertage.. This imposing arch forms the northern side of the Praca commercio.There are beautiful carved figures on all sides,but the most meaningful is the triad of glory holding hands of valour and genius on the top of the arch.For a small fee you can climb the tower to have panoramic views,but very early in the morning it was closed."
        }, 
        {
            "index": 161, 
            "rating": "5", 
            "review": "Nice touch of history. This is Lisbon's \"Triumph Arc\".On the top are statues which represent historical figures such as Viriato, Marques de Pombal, Numo Alvares Pereira and Vasco da Gama.So when you're down in this area - the Baixa - make sure to extend your stroll all the way towards the river front at Praca do Comercio and marvel at this arch which is a supreme symbol of Lisbon's resurrection."
        }, 
        {
            "index": 162, 
            "rating": "4", 
            "review": "Beautiful place. The arch looks great both from the distance and the close-up. Worth going up as it offers beautiful views."
        }, 
        {
            "index": 163, 
            "rating": "5", 
            "review": "Better view than Santa Justa elevator. Ever since I started planning my sightseeing in Lisbon, people were telling me not to miss the view from Santa Justa elevator. Well, if you ask me, this one is even more beautiful, while the waiting is shorter. I would definitely recommend visiting."
        }, 
        {
            "index": 164, 
            "rating": "4", 
            "review": "Great to see. Similar to other monuments in the world, but it's placement by the water is what makes it so beautiful to see. All the buildings around it are yellow and marble and the square that leads to the streets is fun with little tables of local crafts. I recommend seeing it at night all lit up. Truly a sight to see"
        }, 
        {
            "index": 165, 
            "rating": "5", 
            "review": "Stunning From Ground Level, Fantastic Views From The Top. The arch is beautiful, very intricate and imposing from ground level but also worth paying the small fee to get to the top. A lift whisks you most of the way up and there never seemed to be any queue. A few steps to climb to get right to the top but the views are well worth it. Superb panoramas of the square below, the city streets and the river - breath-taking. You can stay as long as you like and apart from us there were only 3 others up top."
        }, 
        {
            "index": 166, 
            "rating": "5", 
            "review": "Triumphant. It fits perfectly to the surroundings of the square, celebrating the triumph over nature. Just accidentally discovered that it can also be an excellent view point without the fuss and waiting of Santa Justa Elevator and at half the price. No disabled access."
        }, 
        {
            "index": 167, 
            "rating": "4", 
            "review": "Great architecture and good photo opportunity. Beautiful area, landscaped into a plaza where you walk around easily, can see the sea and it leads to/from a main thoroughfare of shops/restaurants/places of interest.Trams/buses can be taken from here and a Metro station is nearby.Allow 20 minutes to look around and you'll be done."
        }, 
        {
            "index": 168, 
            "rating": "5", 
            "review": "Beautiful architecture. Second Triunfal is magnificent at head of classic wide European major shopping & strolling street. Great ice cream shops."
        }, 
        {
            "index": 169, 
            "rating": "5", 
            "review": "Amazing views & history. Gorgeous Arch with really cool sculptures on top. I took a lift up to the very top (only €2.50) and I was to say the view was incredible. You can see different parts of the city from the top: over looking the beach, Alfama, etc.The lift takes you quite high up and then you have to walk up a few steps no big deal ... But it is definitely worth it and I highly recommend it.Under the arch there is beautiful walkways where people sell all kinds of ornate products on stalls."
        }, 
        {
            "index": 170, 
            "rating": "5", 
            "review": "Lovely arch. You can't miss the arch if you're in Old City Lisbon. It is amazing and seems like the history is all the way around. Definitely worthwhile to explore."
        }, 
        {
            "index": 171, 
            "rating": "4", 
            "review": "Looking triumphant. Try not to race under the arch on your way to the waterfront or commercial section. The arch looks pristine, and great and you can marvel at the carvings. ALso you can enjoy the covered walkways on either side. Such a beautiful landmark in a beautiful city, and you can have a rest at the nearby open air cafes/restaurants to truly appreciate the wonderful arch. Great scenic setting."
        }, 
        {
            "index": 172, 
            "rating": "5", 
            "review": "Great views, no queues. We spent €2.50 to go to the top instead of waiting in a very long queue for the Elevator. Amazing views of the Praca do Commercio."
        }, 
        {
            "index": 173, 
            "rating": "5", 
            "review": "The story of an arch born of an earthquake.. In 1755, Lisbon suffered an earthquake who caused a Tsunami.Lisbon was devastated, the King fled to a tent and stood still terrified.Then, a man, a providential man, the Marquis of Pombal, both a dictator and a powerful organizer, rolled up his sleeves and got to work.He chose a wonderful team of architects, city planners and engineers and rebuilt, in few years, a new Lisbon.In the new main square - Terreiro do Paço - he built a 30m high arch symbolizing the triumph of the will and he didn't forget to carve his own statue...You can go by lift to the top and enjoy one of the most wonderful views of the capital, both towards the River Tagus and, opposite, towards Rua do Ouro."
        }, 
        {
            "index": 174, 
            "rating": "5", 
            "review": "Majestic Arch. Don't just rush under the arch on your way to the waterfront or commercial section. Savour the details. Marvel at the carvings. Stroll along the covered walkways on either side. Such a beautiful landmark in a beautiful city."
        }, 
        {
            "index": 175, 
            "rating": "4", 
            "review": "Imposing. It's certainly imposing. A great centrepiece to the main square opposite the waterfront, and a nice walk through to the main shopping area.I guess you'd call it a bit of a feature!"
        }, 
        {
            "index": 176, 
            "rating": "5", 
            "review": "Monumental. Wow that must have taken some time to carve. Quite a landmark and great backdrop to the Square! Nice covered area for sheltering from the rain plus watching trams and tuktuks and people!"
        }, 
        {
            "index": 177, 
            "rating": "4", 
            "review": "A triumph.. A very beautiful arch of triumph, built after the earthquake, stands beautifully as an entry into the biggest square in Lisbon. Lovely architecture, definitely worth passing."
        }, 
        {
            "index": 178, 
            "rating": "4", 
            "review": "Beautiful arch. The rua Augusta features great shopping and will bring you to Avenida de Libertade.A must visit, again, wear comfy shoes."
        }, 
        {
            "index": 179, 
            "rating": "3", 
            "review": "Ok for a triumphal Arch. An arch is an arch - it's big, everyone takes a photo, the street leading up to it is interesting, the square after walking through it is large, what more can be said!"
        }, 
        {
            "index": 180, 
            "rating": "4", 
            "review": "Great views. Lift half way up then 72 steps. Fantastic views from the top over the bay and old town. Well worth the few euros."
        }, 
        {
            "index": 181, 
            "rating": "3", 
            "review": "It is nice to see but not a must see. As with most of the places that I visited in Lisbon it was not awe-inspiring but it was something to see."
        }, 
        {
            "index": 182, 
            "rating": "5", 
            "review": "Magnificient. Magnificient entrance to the Capital with enormous statues-really impressive at the enormous square Parca do comercio- pæne of the biggest squares in Europe"
        }, 
        {
            "index": 183, 
            "rating": "5", 
            "review": "A brief trip to the top. we had an hour to spare before heading off, we managed to get to the top and it was totally worth it, what a great view of this fabulous city. We were so lucky to be there when the clock chimned, great to be able to see the workings of the clock."
        }, 
        {
            "index": 184, 
            "rating": "4", 
            "review": "Large portal opening up to the sea.. Walking along this street, through the imposing gate, and suddenly the sea is there. An enormous space with fresh sea air. Built after the devastating earthquake in 1755. It is more tna 30 meters high. It is a monument with scultptures, the most important on the top is a large female figure holding to crowns. On the sides there are represented Vasco da Gama, the explorer, and Marquis de Pombal, the rebuilder of the city after the catastrophy among others."
        }, 
        {
            "index": 185, 
            "rating": "5", 
            "review": "Beautiful architecture. Arco da Rua Augusta beautifully connects Rua Augusta and Praca do Comercio. Good photo opportunities!"
        }, 
        {
            "index": 186, 
            "rating": "4", 
            "review": "Great view from the top. This is a lovely building which looks so impressive from the square. You can pay 2.50 euros to go to the top (under 5's free). Its worth it for the fantastic view"
        }, 
        {
            "index": 187, 
            "rating": "5", 
            "review": "Stunning arch. At the base of the city after you walk all the way from up north near the airport. The square that faces the arch is enormous and has a maze of things to see. Great people watching."
        }, 
        {
            "index": 188, 
            "rating": "4", 
            "review": "Brilliant. I am not exactly into architecture but even I was impressed by this huge and magnificent archway. It ornate and includes a clock too. The vista from the arch across the square is great, as it the view in towards the town linking it to another square more central to the theatre etc."
        }, 
        {
            "index": 189, 
            "rating": "4", 
            "review": "Very nice view - Rua Augusta- Arch and Belvedere Lisbon downtown. From the top you have a fantastic view through the square (Praça do Comércio) and the river. In it´s interior you can see the clock room with a mechanical clock.You can visit it everyday till 19h00 I think. Price is 2,50; kids up to 5 are free."
        }, 
        {
            "index": 190, 
            "rating": "4", 
            "review": "Narrow winding steps to get up, but good views.. Tight winding steps to reach the top after the lift access. Worth a visit at sunset, only 2.5€. Great views over the river front."
        }, 
        {
            "index": 191, 
            "rating": "4", 
            "review": "A view over the river. It is a wonderful view from the top, You can see the other margin of Lisbon, and in a clear day you can see forever. The statues around you are very interesting."
        }, 
        {
            "index": 192, 
            "rating": "3", 
            "review": "Interesting place. Definitely worth it to see. A lift to the top and admire the panorama of the city. That's all. Generally Lisbon is too overrated."
        }, 
        {
            "index": 193, 
            "rating": "4", 
            "review": "Not a must but interresting.. In case you are at Praca do Comércio and have some spare time then go to the Top of this arch and have a good 360° view of Lisbon's downtown."
        }, 
        {
            "index": 194, 
            "rating": "4", 
            "review": "Great attraction to visit. Nothing too exciting about this place, as with all others arcs of Europe.\nFor 1.45 errors you can go up with a lift and discover the city from the above."
        }, 
        {
            "index": 195, 
            "rating": "5", 
            "review": "Look at how beautiful this archway is!. And you must look up from both sides and see the clock. The architecture is amazing and the scale is immense. You just need to take it in."
        }, 
        {
            "index": 196, 
            "rating": "5", 
            "review": "View. you go up in a lift most of the way, then up some narrow stair ways to the top entry is 2-50 which is good value when you get to the top the view is WOW would deffo say go up we came down just before sunset, but given another chance would stay up there for it has it must be amazing."
        }, 
        {
            "index": 197, 
            "rating": "5", 
            "review": "Promenade. Entrance to pedestrian plaza with monuments, street performers and leading to picturesque view on the waterfront. There is also a Beer Museum located nearby!"
        }, 
        {
            "index": 198, 
            "rating": "4", 
            "review": "nice symbol. A nice symbol, located central at the end (or beginning) of the shopping avenue. A great view to see."
        }, 
        {
            "index": 199, 
            "rating": "3", 
            "review": "Short trip. Up and down again. Great view and ok site.Not to expencive either. Not to crowded either, maybe because a rainy day.Been there done that"
        }, 
        {
            "index": 200, 
            "rating": "5", 
            "review": "Perfect way to end (or start) your time in Lisbon. Wonderful views, and may I congratulate this venue on being non-smoking, it's fantastic to see an attraction that values the health of their guests."
        }, 
        {
            "index": 201, 
            "rating": "4", 
            "review": "Triumphant views over city and river. The modest entry fee gives you access to a lift that takes you up most of the way. Steps then take you up the next couple of levels with a very simple exhibition at the first level after exiting the lift.Worth it both for the up close views of the huge statues (toes/wings and claws all could be observed in detail) and the wonderful views of the city below and beyond."
        }, 
        {
            "index": 202, 
            "rating": "4", 
            "review": "Worth a visit.. This is at the end of one of the main routes to the coast. It is worth a visit. The only thing that lets this down is that its hard to look at it for too long without someone coming up to you and trying to sell you something, over and over again."
        }, 
        {
            "index": 203, 
            "rating": "4", 
            "review": "Great architecture. The best part of this attraction is that you are not required to travel exclusively for seeing this. If you are visiting Praca de Comercio you will find the Arch at the end of the street. Walk through and you will enter into a great market."
        }, 
        {
            "index": 204, 
            "rating": "5", 
            "review": "Gateway to the Tagus!. Beautiful landmark with a stunning click and yes yoy can go up and admire the view of the river and city! It's a great place to stroll and see the vendors under the arches and to walk along the riverfront. An all time favorite place to take friends!"
        }, 
        {
            "index": 205, 
            "rating": "5", 
            "review": "Lisbon's newest attraction. Probably one of the greatest values in Lisbon, for about 2.50 euro, you accent to the top of the arch and have unique views of Lisbon downtown and the St. George Castle. Beautiful sunset and the perfect spot to end a day tour of Lisbon. A bit hidden to find, but ask around and you'll find the little entrance at the end of Rua Augusta."
        }, 
        {
            "index": 206, 
            "rating": "3", 
            "review": "It's all Praca do Comercio. I love lisbon. The architecture and atmosphere are beautiful but if you look at the list of top things to do, four or five of the top ten are all areas next to each other in the city center. This is a nice arch I guess but it's in the middle of Praca do comercio so don't plan too much extra time here. I did however like the view from the seafront accross the road of the bridge and southern part of the city."
        }, 
        {
            "index": 207, 
            "rating": "5", 
            "review": "Great views. If you like going up tall things and having views across a city then this is for you. We were lucky to have the top of the building to ourselves so it was very peaceful. A lift takes you part way up and then a narrow spiral staircase leads to the roof. Not much to see on the way up but the views of Lisbon and the castle are well worth the small entrance fee."
        }, 
        {
            "index": 208, 
            "rating": "4", 
            "review": "A short stop by the Commerce Plaza. Although the architecture is one of the topics to admire in this place, the surroundings are even better, the buildings around the plaza are unique as well the sculptures and themes"
        }, 
        {
            "index": 209, 
            "rating": "5", 
            "review": "Best view of city. Loved this view/ few people waiting- short q/ good price and lots of space at the top. Not great for people with poor knees as its a narrow staircase."
        }, 
        {
            "index": 210, 
            "rating": "4", 
            "review": "Nice landscapes. OK, this is paid attraction, but if you want to see something nice - you need to pay.There are scenic views from the top of the arc."
        }, 
        {
            "index": 211, 
            "rating": "4", 
            "review": "Impressive views from behind into the square. Lovely photo op. From either side to get a view through the archway. Better in good light. Early morning has less crowds to get in the picture."
        }, 
        {
            "index": 212, 
            "rating": "4", 
            "review": "Enjoyable to walk to! . The walk to get here is nice. You walk by many shops and restaurants along a pedestrian only street. The area does have its share of solicitors and pickpockets, as does any large city. When you continue on you arrive at the river."
        }, 
        {
            "index": 213, 
            "rating": "5", 
            "review": "ARCO DA RUA AUGUSTA. I walked from the Hotel down to the Arco Rua Augusta, and I love it, the weather in Lisbon is great , people are very friendly"
        }, 
        {
            "index": 214, 
            "rating": "5", 
            "review": "History speaks to us. From the Arco triunfal da Rua Augusta we can see the river, the sea, the other side of the river and Jesus statue, as we can see the wonderful portuguese calçadas and hand made tiles, you can't go to Lisbon and not visit this place."
        }, 
        {
            "index": 215, 
            "rating": "5", 
            "review": "Amazing. Fabulous view at the end of the street towards the sea, a real stand out on the front at Lisbon. Well worth going."
        }, 
        {
            "index": 216, 
            "rating": "5", 
            "review": "Climb to the top!. Few people know this (for now) but you can climb to the top! theres an elevator access at the bottom of the arch to take you most of the way up. Then some stairs but nothing too serious. And it is so worth it. The views over the Rua Augusta and over large parts of the city are AMAZING! You really should not miss this. Worth the fee to get up there and then some!"
        }, 
        {
            "index": 217, 
            "rating": "4", 
            "review": "Great. This at the end of the square as you come to the river a huge arch which is very impressive well worth the walk as go under it on the way to the river,a lovely area to have a stroll, and watch the world go by"
        }, 
        {
            "index": 218, 
            "rating": "5", 
            "review": "Masterpiece. Colosal triumph arch that connects the city centre and the Praça do Comercio, the huge open square to the Tejo river."
        }, 
        {
            "index": 219, 
            "rating": "3", 
            "review": "Drug dealers, prostitutes and tourists. Rua Augusta is a historic pathway in the middle of Lisbon. Still, it is not exactly the most pleasant place nowadays: you'll be overwhelmed by sketchy offers, day and night."
        }, 
        {
            "index": 220, 
            "rating": "4", 
            "review": "Great Location. Located right in the city centre, at one end of the main street. You can pay to go up for the views."
        }, 
        {
            "index": 221, 
            "rating": "4", 
            "review": "The gate to the Tagus!. Once you cross this arco you will be in the Praça do Comercio and... Just in front of the magnificence of the river and the wonderful view of the Christ statue and the XV Abril bridge! The style of the gate is really elaborated and offer many picture opportunities from different angles. I had no time to take the opportunity of enjoying the view from above from the mirador located there... Well... We will do it next time!!"
        }, 
        {
            "index": 222, 
            "rating": "4", 
            "review": "Big Arch. We got to see this huge arch upon walking the shopping grounds of Lisboa. There are also couple of restaurants amd cozy cafe along the way. Nice"
        }, 
        {
            "index": 223, 
            "rating": "4", 
            "review": "Spectacular Arc at the start of Rua Augsta. Reminiscent of the Arc de Triomphe in Paris, this stately monument opens on to Rua Augusta. It is a great piece of architecture and the street that follows makes for an enjoyable stroll."
        }, 
        {
            "index": 224, 
            "rating": "4", 
            "review": "Great!. We went here in januari and it wasnt very cold. The sun was shining pretty bright and there was a light breeze. The detail on the arch was pretty amazing and there was a nice view on the ocean and the south bank."
        }, 
        {
            "index": 225, 
            "rating": "5", 
            "review": "Must see. Ok so I do have a passion for building and monuments. But you really do have to see this arch it is truly amazing the way it frames the street statue and view to the river."
        }, 
        {
            "index": 226, 
            "rating": "5", 
            "review": "Can't miss it. Made of stone, it looks like what it is, a triumphal arch-like, historical building located on Commerce Square. There was an earthquake in 1755 and this was built to commemorate the city's reconstruction. You can see the Portuguese coat of arms and the sculpture of Glory rewarding valour and genius by French sculptor Célestin Anatole Camels."
        }, 
        {
            "index": 227, 
            "rating": "5", 
            "review": "stunning monument. we walked there on a cloudy day. The monument it self represent what a tourist expect to see from a great city like Lisbon. My only regret was the weather. Chose a sunny day if you want to explore the area better."
        }, 
        {
            "index": 228, 
            "rating": "5", 
            "review": "Amazing visit. We visited Lisbon for the day, taking the bus up from Vilamoura... (3.5/4 hour drive) but we'll worth it!We walked from the bus station to the Arco Triunful square to experience some of city it took a good 45 to an hour...mainly because we didn't know where we were going and often wandered towards things that looked interesting.But there is so much to see, so I would love to visit again, there's a host of ways to see it all as well... tram, tour bus, segway (if you brave), metro (if you want to go it alone), or on foot...(if your a real wanderer)! You definately see more of the city life on foot.The lead up to the Arco was buzzing with energy, shoppers, performers, music and tourists... lots of cafes, restaurants and plenty of shopping.Castles, historical tours, museums, the zoo and plenty more.Amazing times to be had, loved it!"
        }, 
        {
            "index": 229, 
            "rating": "5", 
            "review": "Gem.. Beautiful ceiling, romantic setting with the view of the river or pedestrian Rua Augusta.Some good shops nearby.Very often windy because of proximity of the water."
        }, 
        {
            "index": 230, 
            "rating": "4", 
            "review": "Some of the Best Views of the City. Some of the best views of the city are from the top of the arch. Traffic up and down the stairs is controlled by a colored light system so no need to worry about squeezing by passing visitors."
        }, 
        {
            "index": 231, 
            "rating": "4", 
            "review": "Stunning view over downtown Lisbon and Tagus river. Near Comércio Square, downtown, it's possible to overlook Lisbon from the triumphal arch rooftop of Augusta street.A lift will take you up. Open from 9AM to 7PM.A short visit of 30 minutes is enough to enjoy the 360º stunning views. Bring all the family members, take amazing pictures having the city as scenario, and don't forget to ring the bell!"
        }, 
        {
            "index": 232, 
            "rating": "5", 
            "review": "Beautiful scenery over Praça do Comércio and Tagus River. If you wish to overlook Praça do Comércio from the heights and have a look over the architecture of 'Lisbon Baixa' streets, than you must take the lift to miradouro do Arco da Rua Augusta.You can buy the combined ticket for Lisbon Story Centre, since it also deserves a visit and learn more about Lisbon history."
        }, 
        {
            "index": 233, 
            "rating": "4", 
            "review": "nice place. a bit of a bottle neck on silvester after the fireworks :)luckily i am not claustrophobic.Nice arcitecture and surroundings."
        }, 
        {
            "index": 234, 
            "rating": "5", 
            "review": "connects square commercial to shopping street. connects square commercial to shopping street. nice arch with nice details. take a nice picture from the square commercial"
        }, 
        {
            "index": 235, 
            "rating": "5", 
            "review": "Great view of sea, castelo and Rua Augusta. No line to enter, this attraction is a wonderful spot to view the Castelo do Sao Jorge on the hill, the pedestrian Rua Augusta with its inlaid stonework, and the harbor sea."
        }, 
        {
            "index": 236, 
            "rating": "4", 
            "review": "Great view of the city's downtown and old harbour. For just €2,50 you can go to the top and have a great view of the downtown as well as of the Commerce Square, tha Castle of Saint George and of the old harbour leading to Tejo River. It's date goes back from 1875 and it's the main entrance of the city, meaning the triumph of Lisbon. Worth to see."
        }, 
        {
            "index": 237, 
            "rating": "5", 
            "review": "Beautiful arc marking the entrance to Rua Augusta!. There's no way you'll miss it since its location is pretty central and it's a great place for photographs! Its history is also very interesting so if you have a way of finding it out, make sure to do so!"
        }, 
        {
            "index": 238, 
            "rating": "5", 
            "review": "Magnificent architectural example. A city's arch is always a centerpiece to be admired. This arch is a beautiful example of artistic talent and the showpiece the king had in mind when he commissioned it. It's the entrance to the plaza of commerce and the water's edge. Free for the looking. It seems like it's perpetually very busy and crowded on the square. Be mindful of your valuables."
        }, 
        {
            "index": 239, 
            "rating": "4", 
            "review": "Attractive arch in the Chiado district. This arch looks out over the Praca do Comercio and up Rua Augusta and the shopping district. It's a beautiful old structure and has been well maintained (after probably some extensive restoration work). Very photogenic if you can get the sun at the right angle."
        }, 
        {
            "index": 240, 
            "rating": "5", 
            "review": "Beautiful Arch. This arch leads into the city or out towards the main plaza. An architectural wonder of Lisbon. No doubt it won't be missed."
        }, 
        {
            "index": 241, 
            "rating": "5", 
            "review": "A grat view to the lisbon dontown. From the top of this arch you can see a great view to the downtown Lisbon!! A visit for all the family!"
        }, 
        {
            "index": 242, 
            "rating": "5", 
            "review": "a must see location. This is where you should start your first day! looking into the city from the waterfront and getting your bearings - wonderful square where you can sit and enjoy people watching and the view of the ocean."
        }, 
        {
            "index": 243, 
            "rating": "4", 
            "review": "Historical Architecture. It's a beautiful bit of architecture. What a gorgeous landmark. This once was the grand entrance to the city. Lift to the top,just 2.5 euros, so no need to worry about having to climb hundreds of stairs. The view is well worth it."
        }, 
        {
            "index": 244, 
            "rating": "5", 
            "review": "Imposing! . Wow, a great piece of historical architecture with massive public square and the entrance to the main pedestrian shopping area; so fabulous in the evening when all lit for Christmas."
        }, 
        {
            "index": 245, 
            "rating": "4", 
            "review": "Imposing . This arch dominates the square that leads to the promenade by the sea. To cross the road to the Arc there is the longest 'Zebra crossing' I've ever seen."
        }, 
        {
            "index": 246, 
            "rating": "4", 
            "review": "Quite impressive . A very interesting piece of architecture dominating the square, also visible from the street cafes on the road leading to it."
        }, 
        {
            "index": 247, 
            "rating": "5", 
            "review": "Can't not finding it. The Arco is a great monument just in front of the Praça do Comércio. There is no way not seeing it! Take your time to enjoy every single detail!"
        }, 
        {
            "index": 248, 
            "rating": "5", 
            "review": "Amazing experience. First time there and I loved it. Amazing view from the top you call see all the down town from there and take amazing pictures. The price is worth (only 2.5€ per person)"
        }, 
        {
            "index": 249, 
            "rating": "5", 
            "review": "Good views. It was well worth me visiting the monument and going to the top for the views. I also enjoyed seeing the sunset from the top."
        }, 
        {
            "index": 250, 
            "rating": "5", 
            "review": "Saw the monument! . During our Lisbon tour we saw this monument which is very close to the sea and the main town area.\nVery touristy and lots of cafe around."
        }, 
        {
            "index": 251, 
            "rating": "5", 
            "review": "Arco Triunfal . I started walking around from our hotel and found this beautiful piece of architecture. Definitely worth visiting and learning the history about."
        }, 
        {
            "index": 252, 
            "rating": "4", 
            "review": "Quite the entrance. Very impressve entrance to the pedestrian district. The architecture is very intricate and impressive. Worth a stop by."
        }, 
        {
            "index": 253, 
            "rating": "5", 
            "review": "What an entrance to the main pedestrian precinct. Over looks the main square and the river plus you can go uptop to admire the view in both directions."
        }, 
        {
            "index": 254, 
            "rating": "4", 
            "review": "Lisbons most impressiv Rooftop. Its one of Lisbon Citys beacons . Well known . The \" Arch \" is the \" historical main portal \" to pass if you are \" walking intoo Lisbon \" . Long years , closed to the public , opend and cleaned , you can take a lift \" to Lisbons most impressiv Rooftop \" . The Single adult Ticket was in October / 2015 - 2,50 Euros . Unfortunatly , the structure doesnt allows a acess for all those visitors who cant climb stairs / wheelchair . So , if you wanna visit this attraction please remind , you need still climb stairs and you shouldnt be high afraid . For everybody else , i recommend a visit . Specially if you want take some nice Pictures of a Sun Set ."
        }, 
        {
            "index": 255, 
            "rating": "5", 
            "review": "Beautiful white arch.. It's a beautiful bit of architecture. For a small amount of money you can go to the top and watch a beautiful sunset."
        }, 
        {
            "index": 256, 
            "rating": "5", 
            "review": "Majestic in size, quality of workmanship and focal point in the surroundings. We could see the top of the Arch from the ruins of Carmo, we saw parts of it as we walked throughout Lisbon. Finally we got to it as we walked the waterfront. What a gorgeous landmark! An easy \"if we get separated\" check in spot it is spectacular. The huge open square across the street and track lines with Jose 1st statue and the great stairs down to the waterfront is people watching at its best. Young lovers, old lovers, children running to the water and back like a flock of tiny birds, down and back, down and back. The arch itself has such dynamic carvings and detailed illustrations I stood on the \"inside\" looking out toward the bay, then from the bay side looking inward to the vibrant shopping area. It's a lovely snap shot of life in Lisbon at any time of any day."
        }, 
        {
            "index": 257, 
            "rating": "4", 
            "review": "A grand entrance-way. This once was the grand entrance to the city and is unmissable. It makes for great photographs with plenty to see and do in the vicinity."
        }, 
        {
            "index": 258, 
            "rating": "5", 
            "review": "Beautiful. At the begining of a walking tour which began at the Palace Square (Comercio Square) we marveled at this triumphal arch which lead us to the pedestrian street lined with every kind of shop imanginable."
        }, 
        {
            "index": 259, 
            "rating": "5", 
            "review": "Maybe 'just an arch / archway' but truly is an impressive central point, strong architectural backdrop, etc.!!!. The Arch of Augusta Street may be just a decorative arch / archway to some, but for many whether tourist or local longtime resident, the arch IS (next to or viewed behind the the equestrian statue of King Jose 1 in the centre of the massive waterfront public square that the arch way opens up onto) an amazing backdrop to the public square, an VERY IMPRESSIVE architectural element full of symbolism, an easy to find central meeting point is your group gets separated for any reason, AND also announces the entrance to either the amazing waterfront / riverfront open, historic plaza if you approach it from the north , OR opens onto introduces the foor of the amazing Augusta Street pedestrian open air shopping mall with it's amazing collection (wide mix) of retail shops - high end and tourist - and great cafes and restaurants.The arch is self is an extremely beautiful, picturesque, and symbolic classical style sculpture which acts as the central point of the historic architecture of buildings that surround the 3 sides of the amazing, wide open public plaza / water front square.The archway also acts as a central point of pick-up or drop-off for various means of public transportation - buses, trams, taxis / cabs, tuc tucs, segway tour groups, and even a meeting point for large group of travellers that arrive at the waterfront via the massive international cruise ships that dock nearby.(Google the arch to find out more important specific details of it's history and the symbolism of the various sculptures incorporated into it's design.Also on Saturdays and Sundays, the arch provides the focal point for an outdoor marketplace of better quality, genuine had crafted artists, craft makers, jewellry makes, etc. We actually stayed just a block away from the archway and public square, and visited the market several times over the weekend.All in all, the archway IS one of the main visual icons that represent and is photographed thousands of times a day for the central public square.Don't be turned off by the possible throngs of tourists. Take time to view and enjoy the artwork of the arch, and take in the ambiance of this central and historically important old world core of Lisbon. We went to and through the arch at all times of the day - and it always made for GREAT photographs and an amazing backdrop for family memories.Not to be missed!"
        }, 
        {
            "index": 260, 
            "rating": "4", 
            "review": "Cool neighbourhood. The arc itself is just there, more impressive though than cool. The neighbourhood has got some nice restaurants and brothels though, which make this the place to be."
        }, 
        {
            "index": 261, 
            "rating": "5", 
            "review": "Great views from the top. We payed E2.50 to take the lift to the top. There is an interesting display about the history of the area half way up, and you can see the clock mechanism. Then at the top it's a great view of Lisbon in all directions, and fun to see the sculptures close up too. The stairs are steep and winding so not for the very unfit or those who suffer with vertigo."
        }, 
        {
            "index": 262, 
            "rating": "4", 
            "review": "Excellent perspective on the city.. Lift to the top (just 2.5 euros), so no need to worry about having to climb hundreds of stairs. The view is well worth it, so would help you to get oriented if you did it early in your trip to Lisbon."
        }, 
        {
            "index": 263, 
            "rating": "5", 
            "review": "Big and clean. If you're a fan of arches you'll like this one. You can't miss it as it's really big and it's between the main pedestrianised shopping street and the waterfront. Only 2.50 Euro to go up it and the entrance is on the left going towards the sea. In a rather down-at-heel city with lots of dirty, poorly maintained buildings, this monument at least is sparkling clean. Not something requiring a special trip but worth including if you're wandering around the Biaxa area."
        }, 
        {
            "index": 264, 
            "rating": "4", 
            "review": "Very impressive Arch. Situated at the end of Rua Augusta this is magnificent Arch that leads to the Square and eventually the riverside. just great to stroll around admire the whole are and its architecture. Well worth a visit."
        }, 
        {
            "index": 265, 
            "rating": "4", 
            "review": "You Can't Miss It. Dominating the end of Rua Augusta, Lisbon's pedestrian shopping street the Arch is fun as you can go up in it, something easy to miss as the entrance isn't well marked."
        }, 
        {
            "index": 266, 
            "rating": "4", 
            "review": "Impressive Arch. . Situated between the main Rua Augusta walking street and the Placa do Commercio, it is a most impressive monument. White in colour with interesting and skilful carvings. You can't miss it if you're walking round the old town."
        }, 
        {
            "index": 267, 
            "rating": "4", 
            "review": "Great view. It's a program that everyone must do. We've got a fantastic view of Lisbon for only 2,5€. And preferably in the late afternoon to obtain the best feeling of Lisbon' light and the crowd return to home after work"
        }, 
        {
            "index": 268, 
            "rating": "4", 
            "review": "Pretty cool. Nice arch, lots of detailed carvings and stuff. Leads out to a big square in front of the sea. Worth a visit."
        }, 
        {
            "index": 269, 
            "rating": "5", 
            "review": "Huge arc. Between la Praca do Commercio and Rua Augusta this huge \" door \" connect one of the Street of Lisbon to the river"
        }, 
        {
            "index": 270, 
            "rating": "3", 
            "review": "free view as part of your walking tour. no reason to go up, a fun area with bustle of mostly tourists. Walk thru, check out the river, find a café for food and drink..."
        }, 
        {
            "index": 271, 
            "rating": "3", 
            "review": "A \"must see\" for the easily impressed. A large triumphal arch similar to triumphal arches in many cities. Originally intended to commemorate the 1755 earthquake, but not finished until 1875; thus providing it's own comment on Portuguese progress. One side faces the Praca do Comercio where pickpockets and drug dealers frolic unimpeded among tourists. The other side faces the Rua Agusta, a wide shopping mall filled with the usual multinational shops, \"Oh dear, we found the cutest little H & M in Lisbon, don't you know.\""
        }, 
        {
            "index": 272, 
            "rating": "5", 
            "review": "good part of the city. This is a nice part of the city,there are lots of places to eat and many shops. There is a very big plaza just a few meters away which is amazing. This is a good place to send some of the day. Remember the Portuguese make there own boots and shoes of leather and they very good quality. Also very reasonable price."
        }, 
        {
            "index": 273, 
            "rating": "4", 
            "review": "Impressive. Highlights the plaza. Many shops, restaurants and museums in the area. Lots of activity. Great views of the river."
        }, 
        {
            "index": 274, 
            "rating": "4", 
            "review": "Iconic archway at end of Rua Augusta. This is part of the Praca do Comercio square and forms the end of the Rua Augusta - main pedestrianized way from Rossio down to the river. Apparently, good to go up at sunset, although we didn't manage that."
        }, 
        {
            "index": 275, 
            "rating": "5", 
            "review": "to the top. Go to the top and you'll have a beautiful view from our amazing city of Lisbon,not expensive at all."
        }, 
        {
            "index": 276, 
            "rating": "5", 
            "review": "The best view in Baixa. I was there three times since it open again, it's one of my favorite places of Baixa. The view that you get from there is so beautiful, that you want to take 360º photos!"
        }, 
        {
            "index": 277, 
            "rating": "5", 
            "review": "Over Arching. Get the lift 2.50 Euros most of the way to the top then a few flights of stairs to the roof terrace. Great 360 degree views over Lisbon and the river, from Praca do Comercio up R. Augusta to Praca Dom Pedro IV."
        }, 
        {
            "index": 278, 
            "rating": "3", 
            "review": "OK.... If you are in this area, then you can't really miss it, but it is nothing special. This area is the toursit hot-sot, so be prepared..."
        }, 
        {
            "index": 279, 
            "rating": "4", 
            "review": "Central square within lisbon. Huge square near the front some restaurants around and also close by.Marvellous architecture all around the square and lots of people watching."
        }, 
        {
            "index": 280, 
            "rating": "5", 
            "review": "The perfect place to feel the city energy.. If you have time you must seat in one of the terraces around the square, enjoy a good portuguese cofee and enjoy the view, worth it."
        }, 
        {
            "index": 281, 
            "rating": "5", 
            "review": "Historical place. Nice to visit such historical places and nice for taking photos as well. Quality restaurants and bars are around"
        }, 
        {
            "index": 282, 
            "rating": "5", 
            "review": "Magnifico monumento na baixa de Lisboa, estratégicamente localizado.. Beautiful and very well located in downtown, near the river. You can see it when you are visiting the historic center of Lisbon."
        }, 
        {
            "index": 283, 
            "rating": "3", 
            "review": "views over Lisbon. Only 2.50 EUR to take the lift up to an enclosed viewing room, a small spiral staircase takes you to the top with great views over central lisbon and the river."
        }, 
        {
            "index": 284, 
            "rating": "5", 
            "review": "Not to be missed!. For a very modest fee you ascend first to the clock room and then to the open top of the Arch. Superb views over the city. This little trip is a must!"
        }, 
        {
            "index": 285, 
            "rating": "5", 
            "review": "Beautiful & Impressive. Beautiful arch gate that is located on the entrance of Comercio Square when you reach it through the walking street called Rua Augusta. This site is a must visit for tourists in Lisbon. The best way to see this is by enjoying walking from Rossio metro station through Rua Augusta walking street."
        }, 
        {
            "index": 286, 
            "rating": "4", 
            "review": "Beautiful. This is a very photogenic Arch near the sea front. It is difficult to miss if you are in Lisbon as a tourist."
        }, 
        {
            "index": 287, 
            "rating": "4", 
            "review": "Definitely worth a visit . Beautiful and right by the sea. Great history too. Huge plaza surrounded by a few cafes. Really nice area which you can reach by bus, taxi, tuk tuk or tram"
        }, 
        {
            "index": 288, 
            "rating": "5", 
            "review": "impressive and a must. nice monument with beautiful architectural structures, a walk through history marks your shoulders as you walk under it, so many kings, tyrants, martyrs, soldiers have walked there..."
        }, 
        {
            "index": 289, 
            "rating": "4", 
            "review": "Visually Stunning Entryway to the Commercial Plaza and the riverfront.. At the end of Rua Augusta, restaurant row and pedestrian zone, this arch makes an impressive framing of the plaza beyond and the river views. It's possible to climb to the top, fee charged, but we didn't take the time. Too hot a day."
        }, 
        {
            "index": 290, 
            "rating": "5", 
            "review": "Easy to climb and a wonderful view. It is a wonderful building worth to see in details. But it is great to climb on the top, too. There is an elevator that you have to pay. I forgot but I think the elevator was just to second or third floor and then there are stairs to the top. I try to climb to the highest buildings in all cities that I visit because the view is really great but some stairs are really scary. The stairs here were very easy to climb and there were even small children climbing. The view is really great so it is worth to go to the top."
        }, 
        {
            "index": 291, 
            "rating": "4", 
            "review": "Impressive arch. It is now possible to go up to the top for a small charge where there is a great 360 degree view of Lisbon."
        }, 
        {
            "index": 292, 
            "rating": "4", 
            "review": "Beautiful structure. A focal point on downtown Lisbon, this is a beautiful structure that you cannot miss on a visit to Lisbon. Set at the entrance to the main square down on the water, it is constantly surrounded by tourists, but we'll worth a look."
        }, 
        {
            "index": 293, 
            "rating": "4", 
            "review": "Impressive!. A wonderful sight. Start your walk from Rossio square and walk down Rua Augusta under the very impressive arch and finish up in the wonderful Praca do Comercio, before heading down to the Cais das Colunas. A lovely way to take in the main and best sights of Chiado."
        }, 
        {
            "index": 294, 
            "rating": "5", 
            "review": "Arco Triunfal just up the street!. Beautiful arc just up the pedestrian street of Rua Augusta which is also where we stayed. Impressive mo u ent overlooking the river. A must see!"
        }, 
        {
            "index": 295, 
            "rating": "5", 
            "review": "Majestic work of architecture. This Tiumphal Arch stands at the End of Rua Augusta leading to the Praca do Comercio. The details of the moldings under the Arch are very beautiful, worthy of some photos.Altogether a very impressive Arch."
        }, 
        {
            "index": 296, 
            "rating": "4", 
            "review": "Impressive. Beautiful and impressive triumphal arch. It is possible to go to the top to see amazing views of Lisbon. We didn't do that on this occasion, but enjoyed it from the ground instead. Great photo opportunity."
        }, 
        {
            "index": 297, 
            "rating": "4", 
            "review": "Majestic entry to the Rua Augusta. Nice example of triumphal arc with great attention to details, contributing a lot for the gorgeous layout of Rua Augusta and the Royal part of Lisbon"
        }, 
        {
            "index": 298, 
            "rating": "4", 
            "review": "Entrance to the promenade . Arco Triunfal da Rua Augusta is at the entrance to Praco da Comercia and to the river's promenade. Lovely atmosphere!!!"
        }, 
        {
            "index": 299, 
            "rating": "4", 
            "review": "Overlooking history...tells its own story. This is another beautiful landmark which overlooks a grand square, and bears the story of the city's history....in addition to the grand arch itself, there are many statues of important people in the city's history. Take a close look at the entire edifice and get to know the stories it tells... We were fascinated to know that we were standing on the sight of the massive 755 tsunami. The square is a great place to visit, and the arch is a wonderful monument that overlooks the many tourists and locals who pass by..."
        }, 
        {
            "index": 300, 
            "rating": "4", 
            "review": "Lisbon Icon. The landmark arch is very detailed and really picturesque. The adjoining square contains a few beautiful statues as well. Nice place."
        }, 
        {
            "index": 301, 
            "rating": "5", 
            "review": "Beautiful details. The whole arch is detailed and its perfection, its located right before you enter the square, there are lots of shops before and on the beautiful day you can get some great photos, it was raining a lot when I was there but that didn’t stopped me to enjoy the moment."
        }, 
        {
            "index": 302, 
            "rating": "5", 
            "review": "Amazing views . This place has some of the most amazing views over the rooftops of Lisbon. The clock mechanism can also still be seen in full working order."
        }, 
        {
            "index": 303, 
            "rating": "5", 
            "review": "Magnifecent, do not miss this landamark. Like the Arc de Triomphe in Paris, this one is in Lisbon, and it is the same name, just in Portuguese. The details of it are fantastic, and it leads to the Rua Augusta, on one side which is full of restaurants, pastry shops, people, entreteiners, and fun, a lots of fun. On the other side, The Praca de Comercio, and the River Tagus."
        }, 
        {
            "index": 304, 
            "rating": "4", 
            "review": "Lovely arch and a good landmark. It's a beautiful arch. Went at night so didn't climb to the top, but there was a group of musicians and many people dancing, so also a good place to people watch."
        }, 
        {
            "index": 305, 
            "rating": "5", 
            "review": "Must do in Lisbon. Great walk at sunset in front of Plaza del Comercio to see a nice view of the bridge and the Christ. Many restaurants in the area, and stores."
        }, 
        {
            "index": 306, 
            "rating": "5", 
            "review": "Rare case, where it make sense to pay for a view in Lisbon. The arch could be visited. The view from the arch top offers an unbelievable view on the entire city and almost every major tourist attraction is visible from here."
        }, 
        {
            "index": 307, 
            "rating": "5", 
            "review": "Great views in central Lisbon. Pay 2.50 Euros and head up to the top of the Arc and the views are spectacular. From all angles you can see the beauty of the city from a birdseye view. Take an elevator and then two sets of circular stairs and you are there. A sunny day will help."
        }, 
        {
            "index": 308, 
            "rating": "4", 
            "review": "Good visit. Super view from up here only a few minutes walk from city centre to this right down by the water front and only a few Euros to go up"
        }, 
        {
            "index": 309, 
            "rating": "5", 
            "review": "Emblematic Monument. Emblematic monument in the city, it marks the centre of the city and you can't miss it. Great photo opportunity and adds a feel of grandeur to an already beautiful plaza."
        }, 
        {
            "index": 310, 
            "rating": "5", 
            "review": "Wonderful . A beautiful view, for sure. You can see all the city and it's totally worth it. It's not available for wheelchairs."
        }, 
        {
            "index": 311, 
            "rating": "4", 
            "review": "BeautifuL arc. Very impressive arc at the end of the street, taking one into the largest square of Lisbon. Carved stone details"
        }, 
        {
            "index": 312, 
            "rating": "5", 
            "review": "Amazing !. Have to go there. Plenty of places to enjoy different kinds of food. Many artist displaying their many talents. Lots to see and buy! The Arch itself is beautiful. A lot of detail went into this,and so high too! A lot of walking but lots to do and see.Beautiful at night all lit up!"
        }, 
        {
            "index": 313, 
            "rating": "3", 
            "review": "Copy of the Triumph Arc of Paris. Beautiful arc and that's it. Has a significant sign in the Portugal's history. Not a must to see. Has more significance fir Portuguese people than tourists all over the world."
        }, 
        {
            "index": 314, 
            "rating": "5", 
            "review": "Amazing views!. We had walked under this arch many times. We found that you can pay to go up in an elevator and then take stairs the the top of the arch for amazing views of the city and for sunsets!"
        }, 
        {
            "index": 315, 
            "rating": "3", 
            "review": "Great structure, interpretation isn't great. The view is absolutely amazing and of course the structure in itself is built heritage and therefore excelent. It is also inexpensive to visit but the interpretation leaves a lot to be desired. The display panels are challenging to read as they are white letters on a white background and you have to position yourself at an angle people can see. I doubt it very much that anyone with a visual impairment is able to access it. It is hard to understand how the clock mechanism works and it would be worth explaining to those who are not portuguese (I am) , the significance of the people featured in the sculptures in the arch."
        }, 
        {
            "index": 316, 
            "rating": "5", 
            "review": "Great Views from The R. Take a trip to the top for just 2.50 euro and see the spectacular views - don't forget your camera. A very clever stop go system in use for the narrow stairs."
        }, 
        {
            "index": 317, 
            "rating": "4", 
            "review": "What a surprise. Located at the end of Rua Augusta, just entering Terreiro do Paço, probably the most important square in Lisbon, just by €2.5 you can have a nice experience climbing to the top of this monument and see a different view over Lisbon. Good option for the always crowded Elevador de Santa Justa"
        }, 
        {
            "index": 318, 
            "rating": "5", 
            "review": "Impressive. Very photogenic, whether you are there by day or at night. Near the river with a lot of cafes around and a street market on Sunday with many craftsmen, rather craftwomen who sell a lot of nice jewellery. Don´t miss the market."
        }, 
        {
            "index": 319, 
            "rating": "4", 
            "review": "Beautiful Plaza. Quick and easy to get to from the city centre, have a quick stroll around in this beautiful square and gaze over the bay. Perhaps even a cheeky visit to the Beer Museum!"
        }, 
        {
            "index": 320, 
            "rating": "1", 
            "review": "Nice to see from far. Nice to see from far, its beautiful but the place is full of pickpockets and drug dealers, its not safe to walk around in a carefree way at all, so do you need to go for a nice walk and be worried all the time, No, so don´t go there its not worth it."
        }, 
        {
            "index": 321, 
            "rating": "2", 
            "review": "Just nice view to the sea. Poor in comparison with other triomph arcs from european cities, full of \"artisanal\" stands with cheap products."
        }, 
        {
            "index": 322, 
            "rating": "2", 
            "review": "Boring, boring, boring. We decided to take a ticket that included Lisbon Story Centre and Rua Augusta Arch. On the way up there isn't that much to see at all and once you get up you'll be bored after literally 2 min. You can barely take photos of Praça do Comércio because of the walls and if you try and point your camera in other directions all you'll see are lots and lots of once beautiful buildings of downtown Lisbon that are now in horrible state.Definitely not worth a visit!"
        }, 
        {
            "index": 323, 
            "rating": "4", 
            "review": "Impressive. Impressive monument located at the city’s main square. Definitely worth a visit and although we did not travel to the top I can imagine it offers some great views of the city."
        }, 
        {
            "index": 324, 
            "rating": "4", 
            "review": "monumental. Must visit in Lisbon. At the end of Esplanade, beautiful arc, view from the top is super nice. Beautiful place."
        }, 
        {
            "index": 325, 
            "rating": "4", 
            "review": "worth a visit :-). Nice place with a great view if you go up. It worth a visit if you are around here! The statue and the arch are really nice"
        }, 
        {
            "index": 326, 
            "rating": "5", 
            "review": "On Top :). It was my first time here. You must to see Lisbon from here! :) New perspective of the city, nice spot to take some pics. Workers were nice too. :)"
        }, 
        {
            "index": 327, 
            "rating": "5", 
            "review": "Excellent, especially if there is something on. Went here for a light show in Aug. Fantastic.10 out of 10 for production. crowded but a good place to grab a coffee and relax."
        }, 
        {
            "index": 328, 
            "rating": "4", 
            "review": "Restored. Finally restored Trinufal Arc, the details are very interesting and you can even go up to the top. There is a small entrance where you pay to go up."
        }, 
        {
            "index": 329, 
            "rating": "4", 
            "review": "People are like ants. Great overview from the top of the entire city. Entrance is cheap! The view, fantastic! You can look over the city and the coast like. Also the 25 de Abril bridge is visible, with the Jesus statue. The castle too. In the evening, the sunset is beautiful even though sun sets behind the buildings."
        }, 
        {
            "index": 330, 
            "rating": "4", 
            "review": "sigo seeing. You must go upstairs for sight seeing. great view!!! a must see for lisbon travellers. dont miss it!!"
        }, 
        {
            "index": 331, 
            "rating": "4", 
            "review": "Beautiful view. The view is wonderful!! I loved the Comercial Square and the Tejo river there!! In my oppinion, one of the most beautiful views I have ever seen."
        }, 
        {
            "index": 332, 
            "rating": "3", 
            "review": "Popular tourist area. This is amongst the top attractions in Lisbon. Lots of history behind the construction of this triumphal arch. Popular tourist area and all restaurants and bars charge quite steep rates for food & drink"
        }, 
        {
            "index": 333, 
            "rating": "4", 
            "review": "Great views. Great views for the rivers and an amazing place for taking good photos. The statue and the arch are amazing."
        }, 
        {
            "index": 334, 
            "rating": "5", 
            "review": "Great views!. Beautiful area with great river views! A lot of bars and shops and things to see! Great for taking photos! Be careful at night for people pushing drugs...."
        }, 
        {
            "index": 335, 
            "rating": "4", 
            "review": "One of the best views of the city!. Situated in the beginning of Rua Augusta is one of the best places to see Lisbon from above! Panoramic view from all sides of the city help you capture the beauty of the city!\nA little bit difficult to climb the narrow stairs to the top!\nA real must with a reasonable price!"
        }, 
        {
            "index": 336, 
            "rating": "5", 
            "review": "bang in the centre don't miss this little gem. small fee to enter and a few steps, but bang in the centre and a great view from the top . the door is tucked away for the entrance and like quite a few things in Lisbon, you do have to look to find it..lol"
        }, 
        {
            "index": 337, 
            "rating": "3", 
            "review": "Impressive Arch. When in Lisbon and you see this arch all you need to do is admire the workmanship that has gone into it.\n@instabuilt"
        }, 
        {
            "index": 338, 
            "rating": "4", 
            "review": "Do It.... Cheap and easy to reach, the Arch itself its something nice to admire and to climb. For just a small price (around 2 euros) you can enjoy a great view of the centric part of the city and take great pictures. Most of the times, there is hardly anyone around so if you are in the area you don't have any excuses to go up for a minute or so...."
        }, 
        {
            "index": 339, 
            "rating": "4", 
            "review": "Excellent view over Lisbon. Recently opened to public on of the most iconic sites in Lisbon with a splendid view of Tejo River and Terreiro do Paço."
        }, 
        {
            "index": 340, 
            "rating": "5", 
            "review": "Spent the day in Lisbon. Was a lovely sight to taking some stunning photos of the arch and the statue. The surrounding streets also have plenty of life in them with something interesting around every corner."
        }, 
        {
            "index": 341, 
            "rating": "5", 
            "review": "Another great view of the city. Just by the end of Rua Augusta which is a street with plenty of shops and esplanades it has three great features:1- The arch it self it's very beautiful.2- After you pass it by coming from Rua Augusta you'll be dazzled with 'Praça do Comércio' square.3- About an year ago you can go to the top of it and enjoy 360 views of the city (you have no better view of the castle than from here)"
        }, 
        {
            "index": 342, 
            "rating": "5", 
            "review": "Augusta Triumph Arch. Nice arch in the Praça do Comércio at the end of the Augusta street, Lisbon downtown, the main place to take the tram (eléctricos), tuk-tuk car, etc."
        }, 
        {
            "index": 343, 
            "rating": "5", 
            "review": "Pay for the entrence because if not you will miss the best spot to take pictures from. Entry was 2.5, an elevator takes you up and you also have to take the stairs. You can see the castle, santa justa elevator, tram 28, the tejo river and many more."
        }, 
        {
            "index": 344, 
            "rating": "5", 
            "review": "Nice view over Lisbon. In the Praca de Comercio we found the Arch of Augusta Street.Very strategic place to built the Arch, considering the fact that in the Praca de Comercio was situated the royal palace, destroied by the great earthquake.You can climb up on the top of the Arch and can admire the view.A few statues are sorrounding the uper side of the Arch, giving it more than a door look.Opposite the Arch is one side the river Tejo and the other side place Rossio.A clock included in the Arch shows you the passing time- you can do the magic and continue your trip- but must see this Arch!"
        }, 
        {
            "index": 345, 
            "rating": "4", 
            "review": "Starting Point. Every time one visits Lisbon you feel you haven't arrived until you walk through the Arch onto the Rua Augusta and into the bustle of the city."
        }, 
        {
            "index": 346, 
            "rating": "5", 
            "review": "A great area to visit and central gathering place. . This area is right in the heart of everything. The arch itself is very nice, but the plaza and surrounding area complete the picture. Good place to have a coffee or hire a Tuk Tuk driver for a tour"
        }, 
        {
            "index": 347, 
            "rating": "4", 
            "review": "gate to the fancy Lisbon. The landmark in Lisbon. It ends the pedestrian commercial promenade and frames the square by the river. Many activities take place there all the time."
        }, 
        {
            "index": 348, 
            "rating": "5", 
            "review": "Great view over Lisbon and Rio Tejo without any queuing. For just 2€ and without any waiting you get access to a great view point with an amazing view over Lisbon and the river."
        }, 
        {
            "index": 349, 
            "rating": "4", 
            "review": "amazing. Loved looking at the Arch. The view through the Arch walking towards the Tagus river is amazing. Go down early in the morning to view it when their is no people around. it makes fr great photo's. Its one of the focal points of Lisbon. many bars and restaurants surround this area"
        }, 
        {
            "index": 350, 
            "rating": "4", 
            "review": "Amazing view. A quick trip to have a great view of the praca de commercial square and back into the main part of the town."
        }, 
        {
            "index": 351, 
            "rating": "5", 
            "review": "Beautiful rooftop view of Lisbon. the access to the top of the Arch has only reopened recently and for 2.50Euros you get a beautiful view of the Lisbon rooftops. You can see the pedestrianized street below you, the Rua Augusta, and admire its cobbles.You can see the magnificence of the buildings that surround the square. There is a spiral staircase that leads up to the top which then leads to the rooftop terrace. the staircase is only really wide enough for one person, hence the need to press the button on what looks like a traffic light system on either side to make sure that it is clear to go up or come down."
        }, 
        {
            "index": 352, 
            "rating": "4", 
            "review": "a view. This arch was made after the earthquake 1755. There is an elevator, so go up and enjoy a wonderful sight of Lisbon and the Tagus. Truly beautiful."
        }, 
        {
            "index": 353, 
            "rating": "5", 
            "review": "Great view over Terreiro do Paço Square. Inside the building there is an exhibition about the rebuilding of Lisbon downtown after the earthquake and you can also see the mechanism of the Rua Augusta arch's clock. Upstairs you'll find an awesome view of Lisbon, the castle, the river. It's a beautiful terrace with a view."
        }, 
        {
            "index": 354, 
            "rating": "5", 
            "review": "Fabulous spot in Lisbon. Beautiful arch and a nice atmosphere with a great view I'd the river. Not too many people around and a nice spot for photos."
        }, 
        {
            "index": 355, 
            "rating": "5", 
            "review": "Lovely square and view in Lisboa!. One of the most beautiful city squares in the world! A visit to the impressive arch offers interesting piece of history and a wonderful view over Lisboa and the river! Don't miss it!"
        }, 
        {
            "index": 356, 
            "rating": "5", 
            "review": "Nice to see on the way to something else. It is a picturesque and impressive arch leading to the Praça Comércio. There isn't much to do at the site other than admiring its splendour. However, there is plenty to see in the area and you won't be disappointed."
        }, 
        {
            "index": 357, 
            "rating": "4", 
            "review": "Good short visit. A short visit but one which is well priced and offers a nice introduction to Lisbon. Interesting architecture, lovely views and well contextualized with historical panels. Ultimately, it's the price of a beer and probably going to create more interesting memories..."
        }, 
        {
            "index": 358, 
            "rating": "5", 
            "review": "Beautiful square. Great place to visit - the square in front of the arch is beautiful, great views all around ... The arch is a lively place in itself and with the walking street with live music, street artists etc there's lots of things to look at and enjoy!"
        }, 
        {
            "index": 359, 
            "rating": "5", 
            "review": "Breath-taking view. This one is a must see. The entrance fee is only 2.50€, you'll need to go up a couple flight of stairs to reach the top. It offers a panoramic view of the entire town, as beautiful in the day as at night."
        }, 
        {
            "index": 360, 
            "rating": "5", 
            "review": "What a site. This monument today presents the entry to the baixa zone of Lisbon. The baixa was destroyed during the 1755 earthquake. Marques de Pombal remodeled and rebuilt the city. You will enjoy this view many times as its located by a huge square near the Tejo river. Its a must. Put it on your check list"
        }, 
        {
            "index": 361, 
            "rating": "4", 
            "review": "Good miradouro. Paid the 2.50€ entry to go up to the viewing deck on top of the arch. There was a lift for part of the way up which was nice. Unique view of the Praca do Comercio from the Arco which you cannot get anywhere else. Also there are good views of the castelo, Elevador da Santa Justa and Convento do Carmo in the distance. Would recommend but not my favourite miradouro of the city."
        }, 
        {
            "index": 362, 
            "rating": "4", 
            "review": "What a view. The Arch stands right at the beginning of the walking section of Biaxo. When you are there the city climbs before you and the beautiful waters of the bay are at your back. Very nice place to drink in the atmosphere."
        }, 
        {
            "index": 363, 
            "rating": "5", 
            "review": "You must go to the top. The arch is the gateway to Lisbon's post-earthquake city, built in the huge Praça do Comércio/Terreiro do Paço. This square opens to the Tagus river and the Arch front it in its northern side.You can pay 2,5€ (as of 2015) to climb to the top, but it is a must. The view from up there is simply unbeatable! You can take in all the area that was destroyed in the great earthquake/fire/tsunami of 1755 and reconstructed by Marques de Pombal.There is a lift to the top"
        }, 
        {
            "index": 364, 
            "rating": "5", 
            "review": "Stunning 360º view of downtown Lisbon. Arco (Arch of) da Rua Augusta was built to be a symbol of the triumphal rebirth of the city of Lisbon after the terrible earthquake that devastated the city in 1755.Since August 2013 it is possible to visit the top of this monument and enjoy a spectacular view of Lisbon - Castelo de S. Jorge, Rua Augusta, Cais das Colunas, Praça do Comércio."
        }, 
        {
            "index": 365, 
            "rating": "4", 
            "review": "Beautiful. Very beautiful and detailed arch, both during the day but more so at night when fully lit up. Both sides of the arch are gorgeous."
        }, 
        {
            "index": 366, 
            "rating": "4", 
            "review": "Great place to visit. The arch is amazing and surrounded by great restaurants! if your goal is to take pictures do it anytime other than sunset because the pictures will turn out very dark."
        }, 
        {
            "index": 367, 
            "rating": "4", 
            "review": "Impressive. Large and impressive arc near the large commercial square. It looks like it is well preserved. Walking toward the square, it looks pretty as it opens into the wide square and the water. The street in the other side is full of shopping and places to eat as well."
        }, 
        {
            "index": 368, 
            "rating": "4", 
            "review": "Impressive Arch monument and near river promenade. From our cruise ship we walked to the Arco Triunfal da Rua Agusta which was about a 30 minute walk through busy streets. Then we walked along the river promenade back to the ship before heading out for our bus tour of Lisbon. There are small cafes and stores around this area. Near this arch you will find hop on hop off tour buses and also the historic trolley cars."
        }, 
        {
            "index": 369, 
            "rating": "4", 
            "review": "Lisbon visit. Here for day from cruise ship,area flat which is hard to find in Lisbon,nice views over river and the tourist office has all novelty gifts,fine of chocolate sardines etc,I was disappointed in shopping in this area but we had a wheelchair user with us,had nice day out,coffee and pastries cheap"
        }, 
        {
            "index": 370, 
            "rating": "5", 
            "review": "Lots of cafes and restaurant.. When you are walking in downtown Lisbon this street is called Rua Augusta and its close to traffic it will take you a good 1/2 hour to go from top to bottom."
        }, 
        {
            "index": 371, 
            "rating": "5", 
            "review": "Malls and shops. There is a lot of shopping to do here. Nice restaurants and coffee shops. Lots of antique stores on sidewalk at the time I visited Lisbon. Busy street and near the Tagus Bridge."
        }, 
        {
            "index": 372, 
            "rating": "4", 
            "review": "You will not miss it!. Go down Rua Augusta to Praca dos Comercios an you will not miss this amazing building. It is impossible not to take a good picture there"
        }, 
        {
            "index": 373, 
            "rating": "5", 
            "review": "Great. Great Arch overlooking the artory of Lisbons rua de Augusto. When walking underneath from the praça do comercio you get the awe of entering the main streets where everything feels alive."
        }, 
        {
            "index": 374, 
            "rating": "5", 
            "review": "The gate of the shopping street. The gate of the shopping street, the Arc of Rua Augusra can be seen form the pedestrian street and from the Placa de Comercui as well. It's a grandious view."
        }, 
        {
            "index": 375, 
            "rating": "5", 
            "review": "Nice area. Hotel was near the arc so we ate on augusta street almost every night. Arc is beautiful and worth the time to visit"
        }, 
        {
            "index": 376, 
            "rating": "5", 
            "review": "Good viewing spot. 11 meter high, 6 column the statistical datas of this nice arch. 4 statue - Pombal marquis, Vasco da Gama and the Tej and Douro rivers. You can see them very close, if you go up to the top of the arch. You have a wonderful view from above, you think you can reach by hand the river and the whole inner city."
        }, 
        {
            "index": 377, 
            "rating": "5", 
            "review": "Beautiful arch. It's an emotion to reach Commerce Square (a Praça do Comércio) walking down Rua Augusta e through the Arch, that frames the Tejo River...enchanting, for the ones the have the eyes to see."
        }, 
        {
            "index": 378, 
            "rating": "4", 
            "review": "Impressive Views from the Top. A very impressive structure well worth a visit. There is a fee to go to the roof top but it-s well worth it as the views are phenomenal. You can see the Santa Justa Lift Ticket, Sao Jorge, churches, etc., from the top. For $2.50€ you can’t go wrong."
        }, 
        {
            "index": 379, 
            "rating": "5", 
            "review": "Rúa Augusta. From far away you see the\"Arco\" triumphantly opening the city on the Tagus banks, such beauty, such majesty...beautiful perspective."
        }, 
        {
            "index": 380, 
            "rating": "3", 
            "review": "Nice at sunset. a nice place to become nostalgic, overlooking the \"Praça do comercio\" and the Tagus river on one side and the shopping streetRua Augusta on the other."
        }, 
        {
            "index": 381, 
            "rating": "5", 
            "review": "Impressive arch. We visited during our re-positioning cruise on the Celebrity Equinox in May, 2015.\nThis impressive arch was right in the heart of the city and worth taking a photo opportunity. The flow of walking traffic goes under it and the clock had accurate time."
        }, 
        {
            "index": 382, 
            "rating": "4", 
            "review": "Awesome, if limited, view. Saw the arco from afar, and found it really cool that we could just go on up for cheap (€2,50). The walk itself was an experience because of the tight, winding staircases. The view at the top was awesome! Plus seeing the huge statues up close was great. Although, given that I'm not very tall, it was hard to see a lot of things. Glad I went up though, it introduced me to much of Lisbon, and I was able to get a good look at certain points of interest that I wanted to visit."
        }, 
        {
            "index": 383, 
            "rating": "4", 
            "review": "Well worth a visit. This is just north of the Praca do Comercio. For a small fee, you can climb up onto the roof for a great view of the square itself and the Baixa district."
        }, 
        {
            "index": 384, 
            "rating": "4", 
            "review": "Horse and Rider. The statue takes pride of place in the Plaza Commercia, and leads to the central pedestrian shopping street in Lisbon. The square the statue and the Archway are all beautiful, and the view through the arch in either direction gives great views of Lisbon street, or the river."
        }, 
        {
            "index": 385, 
            "rating": "5", 
            "review": "Was beautiful. Was a really nice walk down from Rossio square. The gateway is fantastic, nice place to go. Lots of places to stop and have a coffee to take in the sights"
        }, 
        {
            "index": 386, 
            "rating": "5", 
            "review": "Fabulous views of Baixa and the river Tejo. Right there in the heart of Baixa Pombalina, the center of the city, you can enjoy the outstanding presence of Lisbon´s Triumphal Arch. It´s quite cheap to go up and enjoy a fab view of the river Tagus, the castle or the typical pavement design in Praça do Comércio, were afterwards you may even enjoy a drink in one of the nice restaurants and esplanades. Not to be missed !"
        }, 
        {
            "index": 387, 
            "rating": "4", 
            "review": "Very impressive! You can't miss it!. The square next to it used to be used for a huge parking lot but they realized it is better used as the way into the shopping street."
        }, 
        {
            "index": 388, 
            "rating": "3", 
            "review": "it's nice, but nothing special. when you first see it it's nice to see, but then that fades away and its nothing really special, right next to the beach, shops and metro/train station though so that's nice."
        }, 
        {
            "index": 389, 
            "rating": "5", 
            "review": "Great place to quickly see incredible views for low price. only €2.5 and no wait at all. Incredible 360 degree views and an excellent location for hopping on the tram to see another part of the city."
        }, 
        {
            "index": 390, 
            "rating": "4", 
            "review": "One of the must see in Lisbon!. Amazing building, next to the Tagus (Tejo) river... definitly a must to see and an amazing spot to take pictures."
        }, 
        {
            "index": 391, 
            "rating": "4", 
            "review": "Nice Video Show. You can't miss this, as it stands out at the end of the pedestrian walking street in Lisbon. It is very pretty and nice to go to the top and enjoy the panoramic views of the ocean, the ships and the Christ. Lots of stairs, or you can take the elevator up."
        }, 
        {
            "index": 392, 
            "rating": "5", 
            "review": "Best 360 view of the city!. The beautiful day given to us made time spent at the top a view to remember. Lisbon is just so beautiful and so panoramic frames were great, the view of the bay with the bridge and Christ the Redeemer in the distance on a clear day from that point was fantastic. I don't think it's fair to say it's just an arch, it's an arch with a wonderful view."
        }, 
        {
            "index": 393, 
            "rating": "4", 
            "review": "Another arque de triumphe. We reached gthe location after seeing it on our way to our hotel/A tuk tuk took us to the location.The arco-a monument woth seeing.The Rua Agusta , a disappointment.Not what one would expect from a shopping area.And as my friend pointed out - a pedestrian Area w/o even one Macdonald's?"
        }, 
        {
            "index": 394, 
            "rating": "5", 
            "review": "A different view of Lisbon's downtown. Great view of Rua Augusta, Terreiro do Paço and Tagus river. It is a bit narrow to get to the top through the stairs, but worth it!"
        }, 
        {
            "index": 395, 
            "rating": "4", 
            "review": "Beautiful, just above the huge seaside plaza. The grand arch and entry is a fitting greeting when coming off the lovely, huge seaside plaza and starting up Lisbons pedestrian shopping street. We were fortunate to do our 1st visit late afternoon and learn of the giant video/ sound show that evening, which drew us back at 9:30 pm . The projected lights and images across the arch & adjacent building fronts was spectacular."
        }, 
        {
            "index": 396, 
            "rating": "3", 
            "review": "Just an arch. It's a nice piece of architecture but it's not out of this world. I recommend seeing it as you go shopping but I wouldn't make a special trip just for this."
        }, 
        {
            "index": 397, 
            "rating": "5", 
            "review": "Superb views. A magnificent arch with access to a viewing level and 360 views. There is a lift to the 2nd level, then 79 steps to the top up a narrow spiral staircase, controlled by traffic lights to avoid accidents. On a clear day the views up Rua Augusta to Rossio, and to Castelo Sao Jorge are beautiful and also over Praça Comercio to the harbour. Tickets were €2.50 and worth it."
        }, 
        {
            "index": 398, 
            "rating": "5", 
            "review": "Brilliant white giant. You cannot miss this beautiful white arch that dominates the entrance to the commercial square. View it from both sides and examine the complex details. As the area gets quite busy, it will be difficult to get distance photos without people in them. Busses and trams stop nearby as this is a major landmark of Lisbon. Once in the square, it is surrounded by many restaurants and shops. Walk to the end and you are at the ocean."
        }, 
        {
            "index": 399, 
            "rating": "5", 
            "review": "Never tire of the views. Love the views from the top of the arch along with the sculptured ropes and the bell. Gazing over the panorama of roofs in Lisbon encapsulates the appeal of this city."
        }, 
        {
            "index": 400, 
            "rating": "4", 
            "review": "Triumphal Arch. Really impressive, from both ends.huge, white and busy. Best viewed from the square. Look at the detail and look from a distance."
        }, 
        {
            "index": 401, 
            "rating": "5", 
            "review": "Amazing view over Lisbon. For only 2,50 euros you can get one of the best views of Lisbon without having to wait for hours in line! I went there twice at different times of the day (early afternoon and early evening) and there were no more than 3 other people.\nDon't miss it."
        }, 
        {
            "index": 402, 
            "rating": "4", 
            "review": "Beautiful!. The Arco Triumphal is very beautiful. It leads on Praia de commerco.\nOnly downside is its very touristy area with alot of peddlers and shady characters"
        }, 
        {
            "index": 403, 
            "rating": "5", 
            "review": "Beautiful Architecture!. We didn't tour it or anything, but just walked around outside and gazed at this stunning monument. Definitely take the time to check it out. If nothing else, there are plenty of great food stops and shopping boutiques to hit up while you're there!"
        }, 
        {
            "index": 404, 
            "rating": "5", 
            "review": "Eye catching. Submerge yourself in what this beautiful monument has to offer. Very nice spot to grab a coffee.\nBeware the hasheesh men."
        }, 
        {
            "index": 405, 
            "rating": "4", 
            "review": "Nice monument. Nice to se, also the streets around it are worth viewing. Recommend going early to avoid crowds. Restaurant s nearby are a bit more expensive though"
        }, 
        {
            "index": 406, 
            "rating": "5", 
            "review": "Amazing little gem. Don't understand why this place was so quiet, 2.5 euros for one of the best views in Lisbon. You can see everything... don't miss it if you are in Lisbon"
        }, 
        {
            "index": 407, 
            "rating": "5", 
            "review": "Can't miss it!. This is a very beautiful and unique monument. in fact all the square where it is locates is fantastic. Check also teh cafes And Rua Augusta."
        }, 
        {
            "index": 408, 
            "rating": "5", 
            "review": "For €2.50, the elevator to the top of the Arco Triunfal should not be missed.... For €2.50, the elevator to the top of the Arco Triunfal should not be missed, as it offers brilliant 360 degree views of Lisbon. The Arco Triunfal is tucked at the southern end of one of the most beautiful Augusta pedestrian streets in Lisbon, which starts at Rossio square. The staff here are friendly, and afterwards, you can cross the street, and have a glass of wine in front of the Atlantic Ocean, at one of the many outdoor cafes."
        }, 
        {
            "index": 409, 
            "rating": "5", 
            "review": "Great views. A couple of euros and you're in, You get the most amazing views if you manage to make it to the top. Wear comfy shoes as its quite a hike and a lot of steps.Its not the nicest looking arch, its not Paris remember but it does have a lovely humble charm. Lisbon is a lovely city and it seems content to stay in the past.Very city central. Well worth a visit,"
        }, 
        {
            "index": 410, 
            "rating": "3", 
            "review": "Makes for a Nice Photo. While there are more dramatic and beautiful and larger arches, this one is pretty nice. I you stand on Via Augusta towards the river, there;s as nice a photo as I can imagine and I'm not very creative. It's on every tourist's walk so you can't miss it."
        }, 
        {
            "index": 411, 
            "rating": "4", 
            "review": "Amasing view. Nice and convenient in the center of the city, Excellent place for panoramic pictures from the top. Possible combination with the ticket for Lisbon story center (8 EUR)"
        }, 
        {
            "index": 412, 
            "rating": "5", 
            "review": "Great Views of Comercio Square. To pay €2.50 for these views is an amazing deal! It's an elevator ride up most of the way and some stairs (including a narrow spiral staircase, warning to the claustrophobic). The top is open and you can see over Comercio square and the water and all of the town to the other side. Worth a stop!"
        }, 
        {
            "index": 413, 
            "rating": "5", 
            "review": "greatest view of lisbon. The renewed Archway is now open to the public. Enter through Rua Augusta, take the elevator and then climb the staircase (make sure you press the green light as this is a sign that you have a free passage going up, or down afterwards). The view is STUNNING! It is said that this archway reveals that the whole downtown area of Lisbon is actually devoted to the masonic lodge."
        }, 
        {
            "index": 414, 
            "rating": "5", 
            "review": "Arco triunfal da rua Augusta. Great view of the Tagus and south bank of the river and the Praça do Comércio from one side and from the other, a beautiful view from Lisbon downtown's rooftops and streets, mainly the Rua Agusta. The entrance is cheap for the beautiful view, its a perfect place to visit during a stroll in downtown Lisbon."
        }, 
        {
            "index": 415, 
            "rating": "4", 
            "review": "Nice view. Nice and well known place in Lisbon with really nice view over the river and Rua Augusta. From the top of the arc we have a different perception about Lisboa. It must be experienced"
        }, 
        {
            "index": 416, 
            "rating": "5", 
            "review": "Just Rose is wonderful!!. Magnificent monument and I advise you to pay 2.50 euro to go up there, the view is breathtaking. There is a lift and then a small spiral staircase but it is really worth."
        }, 
        {
            "index": 417, 
            "rating": "5", 
            "review": "A new and different way of seeing Lisbon. Not that usual seeing Lisbon from the bottom to the top this monument allow us to have a different perpective of this amazing city. For the price it is 5 stars and you will take amazing photos from the top of this arch"
        }, 
        {
            "index": 418, 
            "rating": "3", 
            "review": "Nice. Not special.. Nice surprise at the end of Rua Augusta shopping street. Not very special. You can go to the top but we didn't do that."
        }, 
        {
            "index": 419, 
            "rating": "5", 
            "review": "Iconic Arch!(Is a Must). This is an iconic place to visit while in lisbon, it have a sightseeing balcony for a few euros, but i dont think is worthed paying to visit this seightseeing mirador since is too low and after being at Santa Justa lift that is 3 times taller is completely pointless paying for going to a lower spot. But is worthed a few pictures and is a must in your Lisbon trip!For the arch structure itself you dont need to pay, so you can just visit without any charge, just going to the mirador cost you around 5 euros."
        }, 
        {
            "index": 420, 
            "rating": "5", 
            "review": "Nice overview. Nice, not very crowded spot to overview and understand the downtown area and plan, also excellent view of the river and Lisbon city hills."
        }, 
        {
            "index": 421, 
            "rating": "5", 
            "review": "Great monument. We stumble across this amazing piazza after getting off the 28 tram. If you're standing with the river behind you looking at the monument you can see lots of open air cafes to the right of the piazza, and narrow roads facing you full of shops. Great place for shopping, eating and drinking."
        }, 
        {
            "index": 422, 
            "rating": "5", 
            "review": "Good alternative to the Elevador. No queues or crowds, €2.50 entry, great views and the chance to see the statue and clock movement up close. If the queues are long at the Elevador Santa Justa this is a better bet."
        }, 
        {
            "index": 423, 
            "rating": "5", 
            "review": "Big surprise. Having been a downtown lover I finally decided to climb and take a look at the view... You can see forever from up there! It great! And the statues, carved to perfection..."
        }, 
        {
            "index": 424, 
            "rating": "4", 
            "review": "Doorway to Commercial Square. This is the Arch that leads to the Commercial Square. It is relatively small, not the most imposing or that noteworthy but Rua Augusta is probably the most interesting street (stretching from Rossio Sq to Commercial Sq.) It is lined with shops and eateries and pulses with the spirit of Lisbon. A must for any first-time visitor to Lisbon. It is also a central point to start exploring the barrios of Alfama, Barrio Alto, Baxia and Castle Sao Jorge"
        }, 
        {
            "index": 425, 
            "rating": "4", 
            "review": "great attraction. A triumphal arch, amazing attraction on Commerce Square. Surprising place, the area is unbelievable. Spend some time in there to feel the place."
        }, 
        {
            "index": 426, 
            "rating": "5", 
            "review": "Marvelous!. I had seen the Arch on travel shows before we visited and wasn't disappointed! It is magnificent to see, as well as the statute in the square. I am almost more amazed that my Fodor's travel book barely gives it a mention! I thought I must have missed something, oh well, it's a must see, regardless."
        }, 
        {
            "index": 427, 
            "rating": "5", 
            "review": "Wonderful. What a lovely entrance into the square and view out to the estuary. It is very majestic and welcoming. The whole structure and decorations are fantastic. Spend some time absorbing it if you can."
        }, 
        {
            "index": 428, 
            "rating": "5", 
            "review": "A triumph for the people. pedestians pass through this arch at the foot of Rua Augusta to make their own grand entry into the expanse of the Praca do Comercio and views of the river beyond."
        }, 
        {
            "index": 429, 
            "rating": "5", 
            "review": "A small pleasure !. You want to feel you know your way around Lisbon? so visit the Arch, go into the small side-door pay the small fee, and enjoy one of the best views of the city of Lisbon you can take. Imagine the past of this historic city, the stories among the place! It is certainly a small pleasure to be able to enjoy the view!"
        }, 
        {
            "index": 430, 
            "rating": "5", 
            "review": "Place to see when visiting Lisbon. Traditional old central square. Somehow we found our way there several times and always found something new from the streets surrounding it."
        }, 
        {
            "index": 431, 
            "rating": "5", 
            "review": "Lovely View. A fantastic view of Tagus river and all down town Lisbon. A place you should visit in Lisbon. There's also a lot to see nearby."
        }, 
        {
            "index": 432, 
            "rating": "5", 
            "review": "Great Start!. Hello Travellers here´s a good place to go shopping, eat, drink, walk, you can choose many thing to do starting in downtown. This is a Excellent starting point to go to St George Castle, Alfama, Chiado, Terreiro do Paco Bairro Alto etc.\nGo and explore it\nRecomend it!!"
        }, 
        {
            "index": 433, 
            "rating": "4", 
            "review": "Impressive landmark. This intricately carved monument is an impressive sight in Lisbon. We walked past it many times during our stay and at no time did we see that you could climb to the top.....missed that sadly...maybe next time!"
        }, 
        {
            "index": 434, 
            "rating": "5", 
            "review": "Lovely Arc with views to the ocean & beyong. I loved this place, it opens to the ocean, great picture spot, Rua Augusta ends here and it hosts many restaurants and cafes. Must visit for a walk down and around it."
        }, 
        {
            "index": 435, 
            "rating": "4", 
            "review": "Look up, way up. We walked by this tourist attraction and ended up staying for a while. This Arch was built to commemorate the city's reconstruction after the 1755 earthquake. It has six huge stone columns (some 11 m high) plus the statues of various historical figures. We had to look up, way up to see this attraction.On the side facing Rua Augusta is an intricately designed monumental clock, don’t miss this photo opportunity.After shopping you can relax at the other side facing the Commerce Square and River Tajo.Happy travelling!"
        }, 
        {
            "index": 436, 
            "rating": "5", 
            "review": "Impressive view. From the top you get a really nice view on the main Lisbon avenue and on Praça do comercio. Worth to visit and its just a few euros to get access to it."
        }, 
        {
            "index": 437, 
            "rating": "4", 
            "review": "Interesting street. Rua Agusta has lots of cafes, restaurants, shops at both sides of the street and it's strictly pedestrian only. Here's where all the actions are. It's nice to just sit in one of the cafe and watch people walking up and down the street, especially on a nice sunny day."
        }, 
        {
            "index": 438, 
            "rating": "4", 
            "review": "Great walk. An impressive landmark. We started the walk at Praça D. Pedro IV, where there is a beautiful fountain. We walked up Augusta st to Praça do Comercio. On a Beautiful sunny day, great riverview."
        }, 
        {
            "index": 439, 
            "rating": "5", 
            "review": "A impressive sight. A place to watch the world walk by, seems to a gateway into the lower city. As impressive as Paris though not as large."
        }, 
        {
            "index": 440, 
            "rating": "4", 
            "review": "Impressive river view. This arch is closely connected with Lisbon's history and has accompanied the city evolution through time. If you climb to the top you will be able to have a magnificent view of both parts of the town and the river, including bridges, quays and what not. For people with disability the elevator doesn't take you right up to the top so take that into consideration. Also it is a bit windy over there :) so take care with hats and scarves. It's a good point to start a visit to Lisbon's riverbanks, and it's part of the shop district so lots of stores both high end, lux and artisan crafts. There's a lot of cafes and restaurants close by and you can catch a bus from here to other parts of town."
        }, 
        {
            "index": 441, 
            "rating": "5", 
            "review": "Lovely spot.... The first thing we saw on our arrival in Lisbon... the gate to Praca do Comercio... the street to reach the Arc is full of shops and street perfromers and it's definitely very vibrant..."
        }, 
        {
            "index": 442, 
            "rating": "5", 
            "review": "Beautiful!!!. A beautifull view of Lisboa and of it's Tejo river...\nA great and diferente view of Castelo de S. Jorge... A must in Lisboa!"
        }, 
        {
            "index": 443, 
            "rating": "4", 
            "review": "Very cool area in Lisbon. This is a must see spot in Lisbon. Right next to the beach and surrounded by a lot of restaurants and shops. Very nice area."
        }, 
        {
            "index": 444, 
            "rating": "4", 
            "review": "The Arco Triunfal. Well, At the end of Rua Augusta you can find the Arco Triunfal (the arch of triumph), which was intended to be a decorative element to praca de comercio (commerce square), where government buildings were (and some still are) located while Lisbon was being reconstructed after the 1755 earthquake. It was built in the 19th century, It's also known by the name of arco de Augusta"
        }, 
        {
            "index": 445, 
            "rating": "4", 
            "review": "Great people watching area. The street leading up to the arch is filled with people strolling and street performers. The square is particularly beautiful at night when lit up."
        }, 
        {
            "index": 446, 
            "rating": "4", 
            "review": "A really nice view to oldtown lisbon. You must visit inside and paying like 2 euros you can go upstais and enjoy a nice view of the old streets (renascentista arquitecthure) as well as have great pictures"
        }, 
        {
            "index": 447, 
            "rating": "5", 
            "review": "Fantastic views of the city. As expected the views from the top of the Arco Triunfal are fantastic, but what made it an even more enjoyable experience was the relative ease you felt in getting to the top. Not only is it only a couple of Euro to go to the top, you enter through a very well managed entrance to a speedy lift which takes you most of the way up. This means that there is only a small amount of stair climbing to be done. They also have a clever traffic light system which allows visitors to indicate when they are coming up or down the steps, as they are only wide enough for one flow of people.That having been said, I would still definitely say that if you find walking difficult or get out of breath from a flight of stairs, that this is not the attraction for you (which is a shame).Once up there you can spend as much or as little time as you want admiring the remarkable views of such a beautiful city. Naturally it is a great place for photos, esp of Rua Augusta and Praca do Comercio."
        }, 
        {
            "index": 448, 
            "rating": "4", 
            "review": "Hard to miss if downtown. Beautiful area - Arc is full of spectacular detail and is the centerpiece of the boardwalk. Lots to do in the area"
        }, 
        {
            "index": 449, 
            "rating": "5", 
            "review": "Fantastic view from the top. Only cost us €2.50 each to go to the top. There is a lift to the clock room and then some narrow spiral stairs to the roof look out..Great views over the Praça do Comércio and up Rua Augusta the other way.Well worth visiting."
        }, 
        {
            "index": 450, 
            "rating": "4", 
            "review": "The most famous and lively street in Lisbon. Rua Augusta broadwalk is definitely one of must-see places in Lisbon. You can find here plenty of restaurants, shops (with traditional Portuguese wines and ports) and street artits. Of course it is necessary to mention about the amazing Arco Triunfal. I was really impressed how beautiful and huge is the arch."
        }, 
        {
            "index": 451, 
            "rating": "5", 
            "review": "A walk... The arch has been under reconstruction.\nNow its a great place to visit and to go right up to a have a great view of Lisbon and the river. You can see 360 all around :)"
        }, 
        {
            "index": 452, 
            "rating": "5", 
            "review": "Really beautiful. It's a brilliant arc! the all street is just mngnificent and then you get to this La creme! Amazing!"
        }, 
        {
            "index": 453, 
            "rating": "5", 
            "review": "View from the top. That's possible to get to the arch roof and there's a beatiful view out of there. There's a lift there, and some very small exhibition inside."
        }, 
        {
            "index": 454, 
            "rating": "4", 
            "review": "This thing is massive! . You can see the arch from quite a ways. I was on my way to a massage parlor I had read about here on TA and I look to my right and it just hit me in the face. Considering how old it is, it is in such great condition and fantastic picture taking opportunities exist with this arch. You can climb to the top I believe for about 5 euros. I didn't do it. I wanted to get the pictures from the outside instead of above."
        }, 
        {
            "index": 455, 
            "rating": "4", 
            "review": "Lovely area and great photo opportunities . Lovely area with lots going on and some great views. Make sure you get some good pictures as it's hard to describe how pretty the buildings are. Worth a walk around the area to explore a little."
        }, 
        {
            "index": 456, 
            "rating": "5", 
            "review": "Wonderful view. It is now one of the places where climbing to the top you can enjoy a wonderful panoramic view of the area of downtown Lisbon and where the city touches the Tejo river."
        }, 
        {
            "index": 457, 
            "rating": "5", 
            "review": "Magnanimous!. Strolling down the Rua Augusta you will find the Arco Triunfal. On the otsher side de magnanimous Praça do Comercio and the Tagus River. If in Lisbon no way arround this visit if you are into history and pompous monuments."
        }, 
        {
            "index": 458, 
            "rating": "5", 
            "review": "High up, above the crowds - for superb views in all directions!. Walk from Praco do Comercio (Black Horse Square as it is known by many Brits), go through the arch and turn immediate right to find the entrance - it's easy to miss this as there are often handicraft stalls in front which can distract you. The entrance fee is a very reasonable €2.50, money well spent! There is an internal lift which whizzes you up to floor 2, where the spiral staircase starts. Press the button and wait for the green light before ascending the first set of stairs (these are very narrow and so you can only go one at a time). After viewing the clock mechanisms and displays in the upper chamber, press the button on the upper set of stairs before ascending to the roof of the arch. Prepare to be astounded - the views are superb in all directions! By the way, the upper terrace is well protected by a high, and thick wall, giving a feeling of security and also protection from the wind which can be strong."
        }, 
        {
            "index": 459, 
            "rating": "4", 
            "review": "Arco da Rua Augusta. Really nice, great pictures of downtown you can take, sorry that new stores are taking the place of the old traditional ones from the street"
        }, 
        {
            "index": 460, 
            "rating": "4", 
            "review": "Impressive. Beautiful and magnificent structure that leads you to Praça do Comercio (Market Square), and other beatiful places in the area. And you can always go up there to get a beautiful of the city."
        }, 
        {
            "index": 461, 
            "rating": "4", 
            "review": "great place to catch a break. visited many places that day and wanted to catch a break and have a quick lunch so we did come here, many restaurants near by and you can enjoy the view while eating,great resting place in busy day"
        }, 
        {
            "index": 462, 
            "rating": "4", 
            "review": "Really good thing to do. We bought a combined ticket for the Arco Triunfal and the Lisbon Story Centre, which was really good value. Being at the top of the Arco was excellent: one of three great views we enjoyed over Lisbon (the other two being the Castelo Sao Jorges and the Santa Justa Elevator).A lift takes you most of the way, then there are a few more flights of stairs. You feel very 'centred' at the top - after all, you are at the point where the Pombaline Baixa (the world's first modern city layout) meets the massive Placa de Commercio.You can ring a bell (at least, we think we were allowed!) and just soak in the views.There is a little bit of interpretation about the creation of the Arco one floor down - but a white font on a silver background isn't a great idea!"
        }, 
        {
            "index": 463, 
            "rating": "5", 
            "review": "Nice walk. Very nice site and the surroundings of a delightful neighbourhood. Walk around, go till the Tejo riverside, turn around and go to the streets nearby. Do not forget to go to the berr museum"
        }, 
        {
            "index": 464, 
            "rating": "4", 
            "review": "Makes a great photo. We did not bother to go to the top, instead we just looked from the ground. It is a great work of art and makes a good picture"
        }, 
        {
            "index": 465, 
            "rating": "5", 
            "review": "spectacular views of the city and the river. The trip up the arch is very easy (elevator) and very cheap. The view is fantastic and it is definitely worth it."
        }, 
        {
            "index": 466, 
            "rating": "4", 
            "review": "Great views of the city center. We started our visit of Lisbon by spending 2.50 euros to take the elevator to the top of the Arc. It was a great view of the city center and the Praca do Comercio. There are also great views from the Castle (which is more expensive) and other lookout points which are free, but the Arc was a great way to start our sightseeing. We enjoyed looking down on the Arc from the Castle and seeing how much higher up we were there!"
        }, 
        {
            "index": 467, 
            "rating": "3", 
            "review": "Average compared to other cities. This is a nice attraction in a beautiful square but if you compare to Paris, London, or other cities it is not that amazing. The best part is it is in a beautiful square right on the river and there are great restaurants and sites in the area."
        }, 
        {
            "index": 468, 
            "rating": "4", 
            "review": "Nice view. After having a walk in rua Augusta i went to visit this nice Miradouro. The view is amazing and its a nice way to finish the afternoon. A litle bit expensive but because you only go there once dont miss."
        }, 
        {
            "index": 469, 
            "rating": "4", 
            "review": "Nice historical area. Lisbon have kept the old fashioned look and feel of this area. The whole area was very nice with old trams that are still used for transport and the tuktuk tricycle!"
        }, 
        {
            "index": 470, 
            "rating": "5", 
            "review": "It is open!. Wasn't the last time but the repairs are made and it is open for only a few euros. There are a few steps to climb, but nothing bothersome. Awesome views of the city, castle, river, bridge, and more. The only thing that could make it disappointing is if it rains."
        }, 
        {
            "index": 471, 
            "rating": "4", 
            "review": "Give it a try. Nice view, at the end of one of the main streets (shopping one, pedestrian, lots and lots of stores) leading to the river. On the weekend just after it there is a local market for handmade stuff. Also see the monument after it leading to the river and walk along the water for some spectacular views of the other part of the city"
        }, 
        {
            "index": 472, 
            "rating": "4", 
            "review": "Can't miss it. If you visit central Lisbon, you can't miss this monumental architecture. It connects the river with the square and the shopping area."
        }, 
        {
            "index": 473, 
            "rating": "4", 
            "review": "Lovely architecture. A lovely building leading to a square full of shops and restaurants. Nice for a wander. Right near the sea so you can visit the sea too."
        }, 
        {
            "index": 474, 
            "rating": "4", 
            "review": "Nice city view, well organized, good price. For € 2,50 each we took the entrance and the elevator to the top: very easy! First we reached the clockhouse step-by-step upstairs. From there we found another very small stairway to the roof with a monument. Fantastic city-view to every side! You can see the castle, the Tejo, the famous bridge and the christ monument on the other side of the river. No shelter on the top when it rains. Then use the clockhouse with the little exhibition. Attention: at the staircases - there are small signals: green is for going; red for waiting. We could recommend this experience."
        }, 
        {
            "index": 475, 
            "rating": "4", 
            "review": "a walk to the river. Take a walk from Rossio to the river (Praca do Comercio). You will need to walk under this beautiful arch. Breathtaking views."
        }, 
        {
            "index": 476, 
            "rating": "5", 
            "review": "Beautiful arch. The arch is beautiful and huge. It's located near the Praça do Comércio (Comercio Square), that's another fantastic place to see. Recommended!"
        }, 
        {
            "index": 477, 
            "rating": "4", 
            "review": "we stayed at the hotel mundial. a short walk from our hotel this as a lot to offer from museums shops and restaurants to a walk across the square to the sea front to watch the sun go down worth going to"
        }, 
        {
            "index": 478, 
            "rating": "4", 
            "review": "Nice sight. Enjoy great views over Lisbon and praça do Comercio. No access for disabled people to the because of the stairs"
        }, 
        {
            "index": 479, 
            "rating": "5", 
            "review": "Grand Archway. Situated in the Praca do Comercio the Arco is an impressive sight. Take a trip to the top for views of the square. The statues on top of the Arc are huge when you get up close to them."
        }, 
        {
            "index": 480, 
            "rating": "4", 
            "review": "Impressive. Handsomely made and very beatiful. Situated between \"Praça do Comércio\" and Rua Augusta, one of the main streets of the city center"
        }, 
        {
            "index": 481, 
            "rating": "5", 
            "review": "Great View and Open Space. We were quite I pressed with the size of this square. We also loved how all the shops are around the outside of it and there is very little busking or other activities in the middle. Just a nice spot to hang out."
        }, 
        {
            "index": 482, 
            "rating": "4", 
            "review": "Great view and square. The Arc is situated on really spacious square that leads you to the ocean. The view is great, especially at sunset. During the say it could be very sunny, but its worth seeing it."
        }, 
        {
            "index": 483, 
            "rating": "5", 
            "review": "Newly opened. Wonderful views over Waterfront. Very cheap. Great photo opportunities at sunset. Restaurants nearby."
        }, 
        {
            "index": 484, 
            "rating": "4", 
            "review": "Nice view!. It's a new viewing point and it's great! It has a little history resume about the meaning behind the Triumph Arch!"
        }, 
        {
            "index": 485, 
            "rating": "5", 
            "review": "Lovely. Gutted that we only saw this place properly on the last day.\nAs you go under the arch and pass the big square there is the sea area, we sat there and watch the sea along with other people while a gentleman sung the best songs (in English)"
        }, 
        {
            "index": 486, 
            "rating": "5", 
            "review": "Imposing. It gives you the feeling that this is the \"door\" to enter the historic center of Lisbon and this is indeed true. It is very impressive and prepares you appropriately for what you are going to experience walking around the beautiful historic center of Lisbon."
        }, 
        {
            "index": 487, 
            "rating": "4", 
            "review": "Wasn't Expecting it. I was truly surprised when I saw this phenomenal structure. It isn't as grand as the actual arc de triumph in Paris but is worth some photos and you can go up in it for some good views of Baixa."
        }, 
        {
            "index": 488, 
            "rating": "4", 
            "review": "A majestic view. Enjoy the perfect alignment from Rua Augusta all the way to Praca do comercio. It is the heart of Lisbon's tourism, which can be an inconvenient."
        }, 
        {
            "index": 489, 
            "rating": "4", 
            "review": "Beautiful view. The arc is stunning and over looks the square and sea on one side and the city's bustling neighbourhood on the other. You could actually go up to the top. The entry is about 2 euros and you get an aerial view of the city square. All the tourist trams and open air buses start near the arc and there is a small shop across which sells the local cherry liquor or gijinia"
        }, 
        {
            "index": 490, 
            "rating": "5", 
            "review": "The magnificent symbol of Lisbon's rebirth!. The magnificent \"Arco Triunfal da Rua Augusta\" symbolizes the rebirth of Lisbon after the terrible 1755 earthquake. Its construction, in neoclassical style, lasted 100 years - from 1775 to 1875! Amazing and beautiful results! Take the lift - at an E$ 2,50 fee - and enjoy, from its terrace, a 360º view of Lisbon and its main monuments. The arch connects monumental \"Praça do Comércio\", on the banks of \"Rio Tejo\" (Tagus River), to \"Rua Augusta\", a pedestrian street and main gate to the \"Baixa Pombalina\" quarter: the pumping heart of Lisbon! Enjoy!"
        }, 
        {
            "index": 491, 
            "rating": "5", 
            "review": "Arch + old town. First impression arriving in lisbon wasnt the best - reminded huge cities where cars on streets are more than people,but when we got to old town,our worry of disappointment dissappeared.old town and arch as part of it looms great and lisbon became my favourite city of trip (madrid-porto-lisbon-lagos)"
        }, 
        {
            "index": 492, 
            "rating": "5", 
            "review": "Worth a Visit. Only 2.50 euro to visit top of arch for fantastic views. Elevator takes you up most of the way then a few sets of stairs to reach top. We visited around 10am and had the place to ourselves, not sure if many people know you can visit, I wasn't aware just happened to see sign advertising. Anyway if you don't mind heights I would recommend a visit."
        }, 
        {
            "index": 493, 
            "rating": "5", 
            "review": "A must see. Its is so beautiful you cannot miss it. Go upstairs and take a look of the Tagus River and historic neibourghoods around, I recommend it in early mornings or late afternoons, when the light is at that point that makes Lisbon unique. And don't forget your camera, you will want to remember it!"
        }, 
        {
            "index": 494, 
            "rating": "5", 
            "review": "2 euro 50 cents, money well spent. Have looked at the arch for many years and now the chance to actually stand on top. Brilliant experience,the views offered make for stunning photos . To see the square and streets from a different viewpoint add to a very nice experience. No time limit on how long you stay,so just ascend and city and people watch. Lovely in the sun."
        }, 
        {
            "index": 495, 
            "rating": "5", 
            "review": "It is magestic. This Arco Triunfal da Rua Augusta is indeed a majestic arch and it is at the end of a very busy and interesting Augusta street and the the heart of Lisbon. It nice to go up and see a beautiful scenary with the Tagus (Tejo) river at the bottom of your feet."
        }, 
        {
            "index": 496, 
            "rating": "4", 
            "review": "Impressive. Very impressive building and the escape way from the shopping frenzy at Rua Augusta on to the wide Praca do Comercio to give you and your bank account a breezer."
        }, 
        {
            "index": 497, 
            "rating": "5", 
            "review": "Opulent View. Walking down the Rua Augusta is like we are in another world,lots of tourists,many esplanades restaurant ,coffee shops,pastry shops beautiful stores for every tasty,then going through the Arco Triunfal is a beautiful site very unique,so must to admire and to see it is mesmerizing."
        }, 
        {
            "index": 498, 
            "rating": "5", 
            "review": "Arco Triunfal da Rua Augusta. A fitting entrance to the old waterfront of Lisbon - how many stories this Arch could tell! Each time I visit Lisbon I take yet another photos of this amazing arch. The carvings are sublime."
        }, 
        {
            "index": 499, 
            "rating": "4", 
            "review": "Really worth it. This is a little known (yet) attraction in Lisbon, it opened quite recently and I think tourists haven't quite heard about it yet; but it's really worth it. For 2,5€ (if I am not mistaken) you can climb to the top of the Arch of Rua Augusta and have a unique view of the Terreiro do Paço and of Rua Augusta itself. There are a couple of long flights of stairs to get to the top, so this attraction may not be suitable for elderly people or for people with mobility limitations."
        }, 
        {
            "index": 500, 
            "rating": "5", 
            "review": "beautiful arch. nice arch overlooking the big & beautiful square of Praca do Commercio, joing the square with the main street rua Augusta"
        }, 
        {
            "index": 501, 
            "rating": "5", 
            "review": "Stunning views. A must do! Beautiful 360 views from here and the arch itself is really quirky and beautiful inside and out. The winding staircase to the to the top is very narrow and an adventure. Well worth going"
        }, 
        {
            "index": 502, 
            "rating": "5", 
            "review": "Hidden Gem - amazing 360º degrees view of Lisbon. I highly recommend visiting the Arco Triunfal da Rua Augusta tower. It only costs 2.50 euro and has fantastic views!! The elevator takes you up the majority of the way and then 2 stairwells take you to the top. They have a cool red light/green light system for their oneway stairwells so that you don't run into someone walking the opposite way.Skip the Santa Justa Elevator and come here instead!!"
        }, 
        {
            "index": 503, 
            "rating": "4", 
            "review": "Different view of Lisbon. Friendly staff, a 360º quick view from Lisbon with other prespective!After to be on the top, just choose wich attraction you should choose next!!!"
        }, 
        {
            "index": 504, 
            "rating": "5", 
            "review": "Stunning Arch at the end of a busy shopping district. The arch dominates the end of the Rua Augusta and has the added advantage of a lift which takes you to the top for a fantastic view of the the Terreiro do Paco overlooking the Rio Tejo"
        }, 
        {
            "index": 505, 
            "rating": "4", 
            "review": "Triumphal arche!. The Rua Augusta Arch is a stone, triumphal arch-like, historical building and visitor attraction in Lisbon, Portugal, on Commerce Square, built to commemorate the city's reconstruction after the 1755 earthquake. The four statues over the columns, represent Nuno Alvares Pereira and Sebastião José de Carvalho e Melo, Marquis of Pombal on the right, and Vasco da Gama and Viriatus on the left. The two recumbent figures represent the rivers Tagus and Douro."
        }, 
        {
            "index": 506, 
            "rating": "4", 
            "review": "Start of a great pedestrian only fun zone. Beautiful arch building at the entrance of pedestrian only zone. Closed to car traffic, this opens into an area filled with many shops and cafes. Took pictures of the entry way but did not go up the Arch for the view."
        }, 
        {
            "index": 507, 
            "rating": "5", 
            "review": "Wonderful view. This newly-opened attraction has a great view of the Praça do Comércio. It has a lift that takes you to the top."
        }, 
        {
            "index": 508, 
            "rating": "4", 
            "review": "Nice view, and no lines.. Visited this seeing as how it was just down the street from our hotel, and it was a nice view on the top. Payed 2,5 euro p.p(I think), and you take the elevator up to the upper levels. Here you will be greeted by a green-red light that indicates wether or not the small stairs going up are free. After walking the first set of stairs, you come to a large room with some historical information, before you walk up another set of stairs. Not sure if there is any way for people that need weelchair(or people that have problems walking up stairs in general) to get up to the top.When you get to the top, you will have a 360 degree view of the harbour/baixa/centre. The view is nice, and there is no time limit on your stay up there."
        }, 
        {
            "index": 509, 
            "rating": "5", 
            "review": "Nice 360º degrees view of old Lisbon center. I saw in the news during our holidays that the Arch was open to the public and we decided to go there.We went before lunch and there were not too many people. We bought the tickets, went up on the elevator and then the rest till the top is on foot in a narrow stairway. It is easy to climb and so worth it!The view is very nice, the Tagus river, the bridge, Almada and Cristo Rei on one side and old Lisbon on the other, with S.Jorge Castle and the Cathedral."
        }, 
        {
            "index": 510, 
            "rating": "5", 
            "review": "What a view.... open since a year, offer a 360° view on all part of the old Lisboa. Nice light at the end of the day"
        }, 
        {
            "index": 511, 
            "rating": "5", 
            "review": "Amazing view over Lisbon and Tagus. It's an amazing experience. It opened again just last summer after reconstraction. It has an amazing view and definately worth it. You must visit it only to see Lisbon unite with Tagus river up until where your eye can catch."
        }, 
        {
            "index": 512, 
            "rating": "5", 
            "review": "Wonderful view to Terreiro do Paco and far... Very reasonable price for a beautiful view of this fantastic city and Terreiro do Paco. Our kids had a lot of fun ringing the bell on top. Not to be missed."
        }, 
        {
            "index": 513, 
            "rating": "4", 
            "review": "Lisbon. Nice place not expensive plus loads to see Good idea if you are in a hire car park at the airport 13 Euros for 24 hours then get the bus into town 8 Euros for 4 people\nThe old part of Lisbon is nice and take the tram or tuk tuk uo to The Castle of St George"
        }, 
        {
            "index": 514, 
            "rating": "3", 
            "review": "Nice view. The Rua Augusta Arch is a stone, triumphal arch-like, historical building on Commerce Square, built to commemorate the city's reconstruction after the 1755 earthquake .\nWorth to see"
        }, 
        {
            "index": 515, 
            "rating": "4", 
            "review": "Lovely. Very impressive, once at the top beautiful views on the square below, the sea and along the Rua Augusta."
        }, 
        {
            "index": 516, 
            "rating": "5", 
            "review": "A place to visit. Just, take the profit to climb on theis maginficent and well placed place to have a good look for the center of Lisbon and have and insight how Lisbon have been rebuilt after teh hearthquake."
        }, 
        {
            "index": 517, 
            "rating": "5", 
            "review": "very nice. IT looks great especially at sunset time... I walked there every day and enjoyed it really. Rua Augusta is pedestrian steet and you can enjoy walking there. Just be aware of pickpockets..."
        }, 
        {
            "index": 518, 
            "rating": "5", 
            "review": "Superb. This seems to be a copy of the arc de triomphe in Paris. The big difference is that you have a magnificant look over the Tagus and the square."
        }, 
        {
            "index": 519, 
            "rating": "4", 
            "review": "The Southern entrance to lovely Augusta street. The composition of being at the Southern end of the loveliest street of Lisbon and the continuation of the big commercial square in between this Arch and the river, makes this monument a MUST to visit for any traveler. It is seen from the Rosio square and all the way when walking along the beautiful Augusta pedestrian street."
        }, 
        {
            "index": 520, 
            "rating": "4", 
            "review": "Good for a few photos. You cannot miss the arch as you are strolling the Rua Augusta towards to Praca do Comercio waterfront plaza area. The reality is that the arch -- huge, imposing, detailed -- makes for some good pictures. But that is about it. Your time related to the arch is just the few minutes it takes to walk around the approaches and snap a few pix."
        }, 
        {
            "index": 521, 
            "rating": "5", 
            "review": "Great view!. This attraction is located in centre of the town, and provides a spectacular 360 degree view over the whole city. Only 2.50€. Dont miss it!"
        }, 
        {
            "index": 522, 
            "rating": "4", 
            "review": "Important Attraction. Here you can appreciate the old architecture, old sculptures, really good sights of Lisbon. You shouldnt miss this location as it contains a lot of history of LIsbon. The Archway is an icon of Lisbon that you have to visit."
        }, 
        {
            "index": 523, 
            "rating": "3", 
            "review": "Grand!. Archway that is standing over the lower walking street and to the gateway to the ocean. Old architecture, nice sculptures, nice entrance to the city of Lisbon."
        }, 
        {
            "index": 524, 
            "rating": "5", 
            "review": "great site al Praca do Comercio. the view, the movement, access to rua augusta and several historics sites like praca do rossio and av Liberdade"
        }, 
        {
            "index": 525, 
            "rating": "5", 
            "review": "Simply beautiful!. You can't miss this in Lisbon as it's on the main street in the downtown area called the Baixa.. It's located at the end of Rua Augusta opening up to a large square in front of the Tagus river!"
        }, 
        {
            "index": 526, 
            "rating": "3", 
            "review": "Another triumphal arc. Don't see any special in this arc. All attraction at Praca do Commercial is not very special in my opinion. However you can't miss this part of the city."
        }, 
        {
            "index": 527, 
            "rating": "5", 
            "review": "not to miss...... love this area, close to the water and the middle part is so huge, they were watching world cup when we went there to visit. set up a gigantic screen and people were just dropping in and sat down to watch the game. local restaurant everywhere and u can watch while eating dinner. or u can just watch boats coming and going."
        }, 
        {
            "index": 528, 
            "rating": "5", 
            "review": "Great viw. We bought the combined ticket of Rua Augusta and Lisbon Story great value and both are worth the visit from the top of the arch the view of Lisbon is fantastic and you get to see the statues up close and they are beautiful.This a visit that everyone should make, and the Lisbon story is very well made because you get to see lisbon before the hearth quake and it's restoration and you learn the history of the city."
        }, 
        {
            "index": 529, 
            "rating": "4", 
            "review": "Beautiful View. It's a beautiful view over Lisbon, outstanding view over Tagus River. After go and walk aside the river to end a perfect day watching the sunset over 25 April's Bridge. Just lovevly."
        }, 
        {
            "index": 530, 
            "rating": "4", 
            "review": "Great view. We wanted to go to the Lisbon Story Centre and there was a combination ticket to go up the arch for an additional couple of Euros. It was definitely worth it. There were some great views up there!"
        }, 
        {
            "index": 531, 
            "rating": "3", 
            "review": "Rua Augusta. during the night there are people singing, its a nice place for spending time, Rua Augusta its a interesting place for walking"
        }, 
        {
            "index": 532, 
            "rating": "5", 
            "review": "Very nice. An huge arch limiting a wonderful square. From there you can take buses that go everywhere. This place is always full of people even in a rainy day!"
        }, 
        {
            "index": 533, 
            "rating": "5", 
            "review": "Beautiful!. This beautiful triumphal arch connects Praca de Commercio which is the Commerce Square with Rua Augusta, a lovely pedestrian shopping area full of cafes, shops, and bakeries. Great photo ops. abound in this area. Don't forget to check it out day and again at night when lit up. We did not realize that we could have gone to the top of the arch. However, there are many opportunities throughout the city for great views."
        }, 
        {
            "index": 534, 
            "rating": "5", 
            "review": "Very beautiful. Imposible not to see. It´s in the center, very close to the shopping streets.Near the Commerce Square. Metro Station: Rossio (Line Green)"
        }, 
        {
            "index": 535, 
            "rating": "5", 
            "review": "great views and short queues. We stumbled upon the entrance to this attraction by accident after hours. In the daytime I think we might have missed it due to the crowds around the arch. The entrance is just under the arch on the right hand side as you are walking into the city. Entrance is cheap (a few euro), and a lift takes you most of the way up the arch. You then have to walk a couple of short flights of narrow stairs, but a good 'traffic light' system ensures you don't meet anyone coming the other way. The views from the top of the arch are wonderful and give you a different perspective from those traditionally found from the Santa Justa elevator, or from the various miradouros around town. This view lets you look up into the castle, and straight down the lovely patterned cobblestoned Rua Augusta"
        }, 
        {
            "index": 536, 
            "rating": "5", 
            "review": "Beautiful 360-view of Lisbon. The entrance beneath the Arch is very well organized with kind and knowledgeable staff. An elevator brings you quickly to the second floor from where, after you take a short walk up the steep stairwell, you arrive at the platform on the top of the Arch with magnificent sculptures and breathtaking view of the entire city, best of which is beautiful Praca de Comercio right beneath the Arch. You can also combine the ticket with the interactive Lisbon story in the Historical Museum right across the square."
        }, 
        {
            "index": 537, 
            "rating": "5", 
            "review": "Arco Triunfal . Beautiful arch. Near rossio plaza. Nice shops and pastelarias. Close to the waterfront. Not overly crowded once you pass through the arch."
        }, 
        {
            "index": 538, 
            "rating": "4", 
            "review": "Lovely people watching place. So picturesque,and a great place to people watch and drink coffee.Love the pedestrianised wide street"
        }, 
        {
            "index": 539, 
            "rating": "4", 
            "review": "Panoramic view. Very good deal if you want to see Lisbon from above. A lift takes you to the upper floor, then 2 more little stairs (with signals to know if you can start going in the stairs or not - as they are narrow, it's impossible to go up if someone is coming down and vice-versa of course) Nice view, it's a pity that there are no seatings and no explanations of the panoramic view to help you recognising some buildings. We were alone when we went, it was during a working day so maybe that no tourists had arrived yet. Great view over the Praça do Commercio."
        }, 
        {
            "index": 540, 
            "rating": "4", 
            "review": "Nice view !!!. Enjoy the view of Lisbon from a special point !This arch is a really nice place to visit !!! Just look at the tagus and see all the surrounding involved , really interesting I believe"
        }, 
        {
            "index": 541, 
            "rating": "4", 
            "review": "Wonderful monument!. Now you acn take the lift and see the views from the top of the arch! Absolutely fantastic! I love this arch !"
        }, 
        {
            "index": 542, 
            "rating": "3", 
            "review": "A Nice Arch On The Way to Harbor Area. Downtown Lisbon is basically a huge shopping area. You either walk towards the water heading downhill, or walk up hill towards the Bell Towers & Castle. We first chose to walk toward the water. This arch, like many others in Europe, is impressive. The pictures from the backside toward the water look good, but not as good with the sun on the front looking up the street.(To Travel Is To Live)"
        }, 
        {
            "index": 543, 
            "rating": "4", 
            "review": "Interesting sightseeing. It's a gateway for accessing the main square.Very interesting spot to watch from both sides, from Rua Augusta and from the Square.It makes you feel in the last century with all that structure around"
        }, 
        {
            "index": 544, 
            "rating": "4", 
            "review": "Beautiful area. The area around the arc (Baixa i.e. the old town) is beautiful area with old historic buildings, a large lovely square (praca do comercio) with view over the bay, bars, restaurants and shopping."
        }, 
        {
            "index": 545, 
            "rating": "4", 
            "review": "Gateway to the city. This Arch is reminiscent of the more famous Arc de Triomphe in Paris and is a fitting entrance to the biggest open space in town, Praca do Comercio, which overlooks the river. It's situated at the southern end of Rua Augusta in the district of Chiado and welcomes you to the waterfront. If you're wandering around downtown, you can't and won't miss it, so keep roaming and you'll encounter a huge archway."
        }, 
        {
            "index": 546, 
            "rating": "4", 
            "review": "Do not miss the view from it. For a fee of Euro 2.50, the elevator takes you to the top of the Arco Triunfal. It is money well spent, the view is superb. You get a very good impression of the various neighbourhoods of Lisbon."
        }, 
        {
            "index": 547, 
            "rating": "5", 
            "review": "Fab architecture. The race is beautiful with fabulous architecture. It's at the end/start of one of the main streets filled with shops and bars. It is a must see and offers great views."
        }, 
        {
            "index": 548, 
            "rating": "5", 
            "review": "Beautiful architect work. Great arches on to all the main shopping down town, a must go!Amazing stores of all types, lots of restaurants and bars."
        }, 
        {
            "index": 549, 
            "rating": "4", 
            "review": "Good View, Great Architecture. This is a place you will probably end up even without planning to be here. The Arch is at the end of one of the main shopping streets and there is a large square that ends the street. Sometimes there will be festivals in that square. The Arch is of white stone or white stone exterior. You can imagine guests of the country coming through the port and entering at this point. After the main square there is a promenade and the Sea. People will sit here and relax at the cool breeze. While the structure itself will only take a few moments to enjoy there are a few cafes here that allow a nice place to sit and admire all the sights. While I did not enter and go to the top it is possible to do so."
        }, 
        {
            "index": 550, 
            "rating": "4", 
            "review": "Walking through history.... Arco Triunfal da Rua Augusta is an amazing historical attraction worth the time and interest. It proudly showcases Portugal's history."
        }, 
        {
            "index": 551, 
            "rating": "5", 
            "review": "Great view. From the top I saw all the way until the other side of the river. It is also possible to see all the city around the hills.\nRecommend it, but it's not free!"
        }, 
        {
            "index": 552, 
            "rating": "5", 
            "review": "Go up and see it for yourself. After Castelo de São Jorge, this is probably one of the best views you'll get of Lisboa. Simply because it is right in front of the Tagus river and right above the largest square in the city. Plus you can see the Castle from there and Rua Augusta, which looks so charming with its Portuguese tiles and orange rooftops. It is worth the fee!"
        }, 
        {
            "index": 553, 
            "rating": "3", 
            "review": "NICE VIEWS ONTO WATER. Large plaza with monument in centre, quite ornate. Very busy with tourists and the like. One of the must see tourist spots to tick off your list if so inclined"
        }, 
        {
            "index": 554, 
            "rating": "5", 
            "review": "Beautiful. It is the Arch of Lisbon. Now, it is possible to visit and go to the top of the Arch. In Praca do Comercio, face to the river."
        }, 
        {
            "index": 555, 
            "rating": "5", 
            "review": "Arch du Triomphe, eat your heart out.. This arch is attached to a street full of cafes, delightful shops and imposing architecture. Additionally it faces one of the most beautiful waterfronts ever. Irresistible."
        }, 
        {
            "index": 556, 
            "rating": "5", 
            "review": "Spectacular view. Should been open for a long time, we have the sensation of old Lisbon days as we were Vasco da Gama or even Marquês de Pombal"
        }, 
        {
            "index": 557, 
            "rating": "4", 
            "review": "History behind!!. One of the most touristy monuments in Lisbon, that I recommend to visit. Walking up the stairs, it's possble to have a beautiful view of Tejo River and part of the town. 2,5€ is charged for that."
        }, 
        {
            "index": 558, 
            "rating": "5", 
            "review": "The best place to start a tour in Lisbon. This monument takes us back to when Portugal was one of the most influential nations in the world, and was the gateway to show the greatness of the nation for those who were visiting it.Nowadays is a wonderful monument to see, and to begin the tour."
        }, 
        {
            "index": 559, 
            "rating": "5", 
            "review": "\"Invest\" the money and go upstairs. We went up there and you shouldn't hesitate to pay those 3€ for it. Especially around 6 o'clock when it starts getting dark it was absolutely lovely. You can really see how beautiful that city is when you stand up there."
        }, 
        {
            "index": 560, 
            "rating": "4", 
            "review": "Best views are from the square. This is located at the end of a great pedestrian street that opens onto a large plaza. There are several cafés along the street and the square where you can sit and people watch and enjoy the view of the arch and the surrounding buildings."
        }, 
        {
            "index": 561, 
            "rating": "5", 
            "review": "Fantastic views. A must.. This is finally renovated and Lisbon needed this spetacular lookout. It's easy to go up, fairly cheap and the views are fabulous. Also you can learn some history and see up close some magnificient statues.\nI definitely reccomend"
        }, 
        {
            "index": 562, 
            "rating": "5", 
            "review": "A MUST!. If you are visiting Lisbon, you must go to the heart of this wonderful city. It´s the most important and beautiful city that leaves you in Terreiro do Paço and the magnificent marble arch. Justo visit it!"
        }, 
        {
            "index": 563, 
            "rating": "5", 
            "review": "Beautiful!. Needless to say we walked under this arch several times on our way to or from Praca de Comercio. The arch is reminiscent of the Arch de Triomphe in Paris. Great photo opportunities at or near the arch. The whole city is just a great big wonderful picture opportunity."
        }, 
        {
            "index": 564, 
            "rating": "5", 
            "review": "Excellent!. The view is amazing, the stairs to the top are interesting. The best time of the day to go is at sunset. Amazing light!"
        }, 
        {
            "index": 565, 
            "rating": "4", 
            "review": "At one time or another you'll pass by- check out the views. We often found ourselves in Praca Comercio- it was a good starting point and we also would check in with the tourist information office(s) there. On our last day we finally went to the top- it wasn't very expensive and not many people. The Views were wonderful- and to think we almost missed them! Worth the quick trip up. Just be mindful that when you get to some stairs, see if the light is green or you can press the button so you have the right of way going up or down. We missed that information so wound up encountering people on the way down on the small circular stairs. There is an elevator but you also have to climb short flights of steps"
        }, 
        {
            "index": 566, 
            "rating": "3", 
            "review": "Between Augusta and Comercio Square. It's a nice arch but I wouldn't say that it was a \"must see.\" However, if you are in Lisbon, you will see it because it is between Rus Augusta and Comercio Square. If you want really good views of Lisbon, go to the Castle or the park in Barrio Alto."
        }, 
        {
            "index": 567, 
            "rating": "5", 
            "review": "A must see when in Lisbon. I did not realize you could go up to the top of the arch, but this review is for the Rua Augusta and Commerce Square. It was a nice walk down the Rua Augusta from Rossio Square once passing under the Arch you open up to the Square and the Tagus River. There are plenty of restaurants along the street and the square."
        }, 
        {
            "index": 568, 
            "rating": "4", 
            "review": "Lovely views and pretty cheap. Pretty nice views from both ends of the arch, and at only €2.50 entry it's worth going up. Wouldn't be the best views of Lisbon but nice all the same."
        }, 
        {
            "index": 569, 
            "rating": "4", 
            "review": "impressive. impressive arc at between the \"Praça comercio\" and the \"Rua Augusta\". One of the many impressive buildings in the city."
        }, 
        {
            "index": 570, 
            "rating": "5", 
            "review": "Easy Access, Amazing View. This arch is located probably at the most central area/street of Lisbon! It's a new attraction, since until some months ago you couldn't get inside. It offers an amazing view to the old part of the city, with all the roofs, and to the tiver. I'm a local, so I know the others viewing sights, and trust me: It is definitly worth the entrance (it costs 2,5€)."
        }, 
        {
            "index": 571, 
            "rating": "4", 
            "review": "downtown. This Arch might be just a \"simple\" arch, but it is important for what it represents, and also cause it is the entrance to Augusta Street, which is full of great restaurants and will be one of the most pleasant walks you'll have in Lisbon"
        }, 
        {
            "index": 572, 
            "rating": "4", 
            "review": "Fantastic view of the river Tajo and Praça do Comércio. Lisbon is a city that provides you fantastic views from different points and parts of the city. However this is the newest one and really interesting. Fee is not expensive so one can enjoy view of river Tajo, Praça do Comércio, Sao Jorge Castle, Rua Augusta, etc. and be so close to statues at the Triumphal Arch."
        }, 
        {
            "index": 573, 
            "rating": "5", 
            "review": "You can take great pictures!. The street is worth a visit. Lots of stores where you can buy anything, eat at the bakeries or small cafes with sidewalk tables.\nGo down the street all the way and you will see the Arc. Pass through it and you'll be at Comércio Square."
        }, 
        {
            "index": 574, 
            "rating": "5", 
            "review": "nice panorama. open some months ago, from here you can see the old new part of Lisbon. Go up because it worth the visit"
        }, 
        {
            "index": 575, 
            "rating": "4", 
            "review": "Entrance to the city... Walk down the entrance from either direction and it's just beautiful. The Arco facing the river has a lot of details and at night is spectacular"
        }, 
        {
            "index": 576, 
            "rating": "5", 
            "review": "Charming. Walk and be surprised...get down to the praca do comercio and see the Tejo, the river that dreams of being the sea..."
        }, 
        {
            "index": 577, 
            "rating": "5", 
            "review": "the best scenery view of Lisbon, 360º. the best scenery view of Lisbon, 360º, it is just recent but doing this is very nice, the view is just breathless"
        }, 
        {
            "index": 578, 
            "rating": "5", 
            "review": "Nice place at the day. nice pedestrian street to walk with many shops and restaurants on both sides of the street during the day that ends at the arc. Am saying the day because during the night maybe when you walk maybe you will visit persons trying to sell you drugs!!! i \"offered\" from around 10 different persons along the street the only thing that you have to do is to ignore them and they will let you alone."
        }, 
        {
            "index": 579, 
            "rating": "4", 
            "review": "Take some photos. The square is huge so you get some very nice photo opportunities. Take some time to read up on the history and it will greatly enhance your visit to this square. I liked the open spaces and stood there imagining the time it took them to erect the Dom Jose statue and how the royals used to watch the bull fights from their balconies."
        }, 
        {
            "index": 580, 
            "rating": "4", 
            "review": "Nice arch. Not far fro our hotel so saw a few times. Nice part of the square it is beside. Good photo opportunities around here!"
        }, 
        {
            "index": 581, 
            "rating": "4", 
            "review": "Nice Arch. Not far from our hotel and got some great pictures night and day of the arch and staue through the middle."
        }, 
        {
            "index": 582, 
            "rating": "4", 
            "review": "Impressive triumphal arch. On our flying visit, we found most of Lisbon rather scruffy and disappointing, but this arch was one of the highlights. Walking down from Rossio square towards the seafront, it is hard to miss. Vastly high yet narrow, it provides an obvious photo opportunity, especially after you cross into the open square beyond, by the sea (the Praca do Comercio.) We didn't realise you could ascend to the top of the arch, and didn't have time anyway, but according to other reviews, you can. This area is pleasant to walk around and is one of the touristy highlights. As for the rest of central Lisbon, well, it's just a shame about all the derelict and unkempt buildings, and all the graffiti everywhere. I hope Portugal begins to recover soon."
        }, 
        {
            "index": 583, 
            "rating": "5", 
            "review": "Surprise. I am portuguese, lived in Lisbon for years, keep going there often, and the city still surprises me. Seeing it from the rooftop off the arch give me a perspertive i never had and it was amazing. Dont miss it."
        }, 
        {
            "index": 584, 
            "rating": "5", 
            "review": "Another good view of Baixa. It is a very good place to go. There you have the best view of Rua Augusta and also a very nice view of Praça do Comércio with trams and restaurants.I suggest to go there during the day and look at the colours of Praça do Comércio with sun and also after the sunset to enjoy the night view.Also a very god place to take photos."
        }, 
        {
            "index": 585, 
            "rating": "5", 
            "review": "One of the most beautiful views over Lisbon. If you are visiting Lisbon, PLEASE, do not waste the opportunity to experience one of the best views of this unique city.Its a very recent attraction offered to the city visitors and one that you will simply love.Open from 09h00 to 19h00 at a 2,5 euros price.Free entry for children up to the age of 5."
        }, 
        {
            "index": 586, 
            "rating": "4", 
            "review": "Gorgeous at Sunset. Stunning, especially at sunset! This arc is reminiscent of the Arc de Triumph in Paris. Several art galleries and exhibits as well as shoppes and restaurants are surrounding this area. This was one of my favorite areas in Lisbon."
        }, 
        {
            "index": 587, 
            "rating": "5", 
            "review": "Nice restoration!. I was in Lisbon in May and the Arco was closed due to restoration. I returned in September and was delighted to find out that the observation area was open. Beautiful view!"
        }, 
        {
            "index": 588, 
            "rating": "5", 
            "review": "Stunning. Such a beautiful arch, a mall on one side and a restaurant lined square the other. Great for some interesting photo ops"
        }, 
        {
            "index": 589, 
            "rating": "4", 
            "review": "What a stunning arch!. This is an absolutely stunning triumphal arch, connecting Praça do Comércio with Rua Augusta.Taking a photo of the arch with the statue of King José I in its middle from Rua Augusta – is a photo-op must."
        }, 
        {
            "index": 590, 
            "rating": "5", 
            "review": "Feeling the history and the current financial situation. At the end of Rua Augusta, you see the Arco Triunfal and when doing so get reminded what a wealthy country Portugal once was, and when you see the people on the streets begging, the empty eyes watching you from stairwells and the people struggling to make a living, fighting the conditions you get a sense of Lisboa and Portugal today. A country in financial less flattering circumstances, but nevertheless fighting to survive. Hats off for the portuguese people!"
        }, 
        {
            "index": 591, 
            "rating": "5", 
            "review": "A Beautiful Arch Leading to the Main Square of Lisbon. The arch leads into Lisbon's main square on one side and an excellent pedestrian/shopping mall on the other. The mall is full of cafes, restaurants and shops. There is a tempting patisserie on the corner of one of the intersecting roads. Don't miss seeing this incredible structure and checking out the mall.Tip: There is a tourist information booth in the square where you can buy the Lisbon Card, get free maps and have inquiries answered etc. There is also an information office located in one of the buildings in the square, where you can buy tickets to the story of Lisbon etc."
        }, 
        {
            "index": 592, 
            "rating": "5", 
            "review": "WOW view!. This is incredible place! Beautiful arch itself is one of the main decorations of the central Commerce Square. White accent between yellow buildings looks terriffic under bright Lisbon's sun! The viewpoint on the top of the arch lets you overlook both Glorious Square and charming Augusta Street from the best spot! It's been a surprise that there were just a few people and not the huge crowd as I expected.Just a 2 Euro fee is nothing in compare to the excitement you get there upstairs!"
        }, 
        {
            "index": 593, 
            "rating": "3", 
            "review": "Ride the elevator to the top. After going there two days after the elevator inauguration only to find out it was \"out service\" due to a malfunction I managed to actually go back and go to the top of the arch. You'll get a good enough view, but from many other points of Lisbon you'll get a much better view for free."
        }, 
        {
            "index": 594, 
            "rating": "5", 
            "review": "GO - Beach, Views, Architecture!. Absolutely a must see. Just walk through quickly at the least! The arch itself is beautiful and so easy to get to. Plus, if you continue through the plaza, there is a cute little beach and lovely places for photographs! Plus there are several restaurants in the area and some flea market type tables selling things if you're interested in that. We went right around sunset and it was absolutely breathtaking. You can even take an elevator up to the top of the arch and see the view from there as well as the clock on the arch."
        }, 
        {
            "index": 595, 
            "rating": "5", 
            "review": "Amazing view. Outstanding view to S. Jorge Castle and Praça do Comercio. Lisbon is a breathtaking city and this new place is a must. Can see also the clock mechanism. The admission fee is fair."
        }, 
        {
            "index": 596, 
            "rating": "5", 
            "review": "The door. First place to go when arriving in Lisbon. Opening the city to the stores, restaurants, bars and it all. In front of the big entrance of the Ships from longtime. Good place to imagine the time of Navegation."
        }, 
        {
            "index": 597, 
            "rating": "5", 
            "review": "Brandnew viewing point.. The Arch was renovated, finished on the 10th August. Inside lift goes to the top, from where is a breathtaking view to the Comercio, the Tejo, the city center, the Rua Augusta. You can see the antique structure of the big clock, which is really very interesting."
        }, 
        {
            "index": 598, 
            "rating": "3", 
            "review": "Nice gateway, pictures in abundance. Impressive and very nice to see, located exactly on the Praca do Comercio at the end of Rua Augusta, of course it isn't an attraction that takes your breath away but in the context it is interesting both for arch itself and especially for the beautiful surrounding where it is located."
        }, 
        {
            "index": 599, 
            "rating": "3", 
            "review": "The gateway to the downtown, although still under renovation. We didn't spend more than a moment gazing up, trying to imagine what the Arco, another of the Marques de Pombal's creations, might look like under all the scaffolding. But then looking up Rua Augusta there are so many nice shops, cafes, etc. So if the Praca is a bit disappointing right now since it is under renovation, not far away there is lots to command the attention."
        }, 
        {
            "index": 600, 
            "rating": "3", 
            "review": "Still under renovations. Its still worth it since the surounding plaza is still very nice. We did plenty of shopping in the area. Tried to get some info as to when it would be finished and got no responses worth officially reporting"
        }, 
        {
            "index": 601, 
            "rating": "3", 
            "review": "Under renovation. We enjoyed the shopping. The people watching and picture taking here. There is no traffic on the road except at intersections and it is mostlly a few cars. Some discount shopping, some ceramics, tourist trap restaurants, and beautiful hilly surrounding on all side except one - near the waterfront."
        }, 
        {
            "index": 602, 
            "rating": "4", 
            "review": "just an arch. This arch is at the end of Rua Augusta the main street in Lisbon, and which now is pedonal pass the arch and you enter a great square a lots of café and small restaurants, on the two side buildings several exhibitions are held. Marquis de Pombal is the author of this new rebuilt Lisboa after the earthquake in 1755. You will be able to climb up when the recontruction is complete as they say. The view will be fabulous. On sundays below the arch you can see a sort of flea market for old books"
        }, 
        {
            "index": 603, 
            "rating": "2", 
            "review": "Repairs. This arch is currently completely enveloped in repair covers and cannot be seen at all. It appears that the work on it will take some considerable time so I would advise anyone to check before expecting to enjoy this"
        }, 
        {
            "index": 604, 
            "rating": "4", 
            "review": "Nice Arch. I think is beatyful because is in the middle of the downtown, so, from the Arch you can see all the peolpe walking around and drinking coffee, in their own world.Is a good framework for a picture."
        }, 
        {
            "index": 605, 
            "rating": "4", 
            "review": "Schedule it on your trip.. A beautiful monument of Comércio Square. Buit to celebrate the city reconstruction after the 1755 earthquake. In ther area, slaves were sold during the empire. The area has many restaurants with outdoor seating and several shops. It's something like the Arc de Triomphe as it welcomes the tourists."
        }, 
        {
            "index": 606, 
            "rating": "5", 
            "review": "Iconic monument in Lisbon!. Built to commemorate the city's reconstruction after the 1755 earthquake. It has six columns (some 11 m high) and is adorned with statues of various historical figures. Originally designed as a bell tower, the building ultimately transformed into elaborate arch within more than century-long delays. Next year will be cleaned and will be allowed to visit the upper part of the arch, looking forward to do it!"
        }, 
        {
            "index": 607, 
            "rating": "5", 
            "review": "Great, night and day. One of the Icons of the city, the Arco makes a great visit and one of the best spots for pictures of your visit to Lisbon. It is situated in the begining of Rua Augusta, a commerce street woth no cars, good shops and nice esplanades, that connects Praca do Comercio (with recent improvements, new restaurants and very nice esplanades) to Rossio, another great plaza in the city. Great pics any time, the illumination in the night time is something special also.Enjoy!"
        }, 
        {
            "index": 608, 
            "rating": "4", 
            "review": "Beautiful. This is a beautiful view into the river. It is easy to find in the Rossio area. You can't miss it. Take a walk through to the park."
        }, 
        {
            "index": 609, 
            "rating": "4", 
            "review": "A window over the river. Everyday one can find lots of people taking pictures along Rua Augusta (one of the pedestrian streets), using \"Arco Triunfal da Rua Augusta\" as a frame for the equestrian statue (King Jose I) and the river. The arch itself is a monumental work of sculpture constructed to comemorate city's reconstruction of the heavy earthquake occurred in 1755. Its magnificence comes from cornice's height (30 m) above which stays the feminine figure of Glory (7 meters tall) rewarding Value and Genius"
        }, 
        {
            "index": 610, 
            "rating": "4", 
            "review": "Beautiful and historic. One of Lisbon landmarks, the Arch is very beautiful and from there you can visit Terreiro do Paço and walk near the river, or you can go to Rua Augusta and visit a lot of shops. There are also many restaurants and cafes nearby."
        }
    ]
}