{
    "category": "Marrakech", 
    "entity": "Morocco-Active-Adventures", 
    "avg_rating_stars": 4.989285714285714, 
    "review_count": 280, 
    "rating_stats": {
        "poor": 0, 
        "average": 1, 
        "terrible": 0, 
        "very_good": 1, 
        "excellent": 278
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "Sahara sunsets for the win . Highly recommended desert excursion, great value for the price. Just returned from the 2-day Zagora desert/Atlas mountain tour. Booked the day before, w/ excellent communication. Tour guide and driver were excellent, although we made several stops we never felt rushed. Left a lot of options open for us to decide on our own to customize tour for us, even bargained with the locals for souvenirs. Rode camels through desert in the sunset, the sunrise in the morning was unreal. Food was amazing, A+++"
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "Wonderful day!. Just got home from an great day with Abdul. We did the day trip to the Atlas Mountains. Booking was easy and communication was great with Mohammed before our excursion. Would highly recommend a day outside of the city learning more about the Berber culture. We drove out of the city and stopped first to have breakfast with a Berber family then a little further went for a short camel ride. Then drive through the mountains and rode miles up to the waterfall then to an amazing lunch with a Berber family. Hiked back down then drove to the other side of the mountain for some ATV's then home. Long day, but so much fun and learned a lot. Thanks Abdul and Morocco Active Adventures for an awesome day!"
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "Unforgettable Tour through Morocco. We did a private tour for two. We booked the three days trip starting in Marrakech over Ait Ben Haddou, Ouarzazate, Tinghir and Erfoud to Merzouga. The way back we took the route a bit more south passing amongst others Tazzarine, Nkob and Zagora. The booking we did from Germany was really easy and Mohamed from the agency answered all our questions we had upfront really quickly. Starting from the very first moment when our guide and driver Abdul picked us up we felt really safe and comfortable at all times. Abdul gave us interesting information and answered all of our many questions with pleasure. No matter where we stopped, we enjoyed great food and clean sanitary facilities.To stay at the hotel Xaluca was another highlight on this perfect trip which could only be topped by the camel riding and the night in the dessert camp with the friendly staff. We enjoyed a great night with a group of about 12 other tourists from different countries including african live music. Visiting a nomadic family in a mountains cave gave us an impression of local living conditions what we found interesting. By the way, Abdul is a very good driver which we find important given the winding roads in Morocco. We are more than happy with our decision to have booked the trip at Morocco Active Adventures and can recommend it without hesitation. Special thanks to Abdul who made this trip unforgettable to us."
        }, 
        {
            "index": 4, 
            "rating": "5", 
            "review": "Thanks Said ! Fun 3 days. great three days tour in the desert. The team was very flexible and adjusted to our special schedule. Said was great company. It is very important as we spend a lot of time driving. Thankss"
        }, 
        {
            "index": 5, 
            "rating": "5", 
            "review": "Friendly staff and great experience. We booked a 3-day-tour from Marrakech to Marrakesh. Everything was amazing!Tour guide Rachid, was every helpful. He plan things ahead and therefore managed to change our original plan based on the weather conditions. Listen to us carefully and answer all kind of questions. Unlike most tour guide, he does not force us to buy anything or treat us differently based on our \"performance\". Instead, he observed our real interests and introduced some really nice local shops when we need. Always on time and detail oriented (he always make sure there is enough toilet paper before he show me the way to the toilet...)The sand tour was bravo! Staffs at camp site were very friendly and versatile. After the dinner, there was a bonfire party, with great live music from staff, incl original Africa songs with drones and pop music with guitar. The dromedary guide Hamd's strong will to learn Mandarin was impressive. Hamu, the cute chef, turned out to be a great company. We enjoyed the food, the Dromedary dance he taught us, and company under the beautiful star ceiling. Nice trip and highly recommended!"
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "Fantastic day to Atlas Mountains . What a fantastic jam packed day! We booked easily via Whatsapp two days prior to our day trip to the Atlas Mountains. We were picked up by Abdul (who was fantastic for the whole trip) in a nice people carrier and started our journey into the mountains. We stopped for Moroccan tea at the first house after this we carried on into the mountains stopping at the best places for pictures - the views are fantastic across the atlas and Abdul certainly knew the best places for pictures and was happy to take them for us. We had a short came ride which was Ok for the novelty factor, after this we carried on driving and eventually arrived at our next destination. We visited a small town in the mountains where we rode mules to a waterfall, hiked for a while and reached a Berber house where lunch had been prepared. We enjoyed the lovey tajine food and fresh bread basically on a roof top looking out over the mountain! The sights alone walking through the town/village were so interesting, to see how people live was great. We hiked back down the mountain after lunch and drove on to the lake area where we did quad biking for an hour. This was really good fun but perhaps could have been a little faster! Abdul was happy to chat to us and answer our questions but also let us snooze and just chill - it was a long day but so worth it! Great service and they even followed up with a whatsapp message the next day to ask if we enjoyed ourselves, where we thought they could improve and also if we needed any more advice or help for our stay. A truly great company - book with them you won't find a better trip that encompasses so many different activities and sights!"
        }, 
        {
            "index": 7, 
            "rating": "5", 
            "review": "Amazing Sahara Tour with Morocco Active Adventures. We contacted Morocco Active Adventures via WhatsApp which made it easy to book our 4day trip, since they answered to my questions very quick. Our guide was great and amazing driver. We got lots of knowledge, passion about their Berber culture and fun and laughter too. It was a pleasure to visit Youssef's Berber family, enjoy lots of lovely music, try great food, see fantastic scenery, spend a great night in the Sahara desert under stars with Berber music.The food was very good as well. Excellent experience, strongly recommend!"
        }, 
        {
            "index": 8, 
            "rating": "5", 
            "review": "As good as it gets!. We wanted a 3 days package from Fes to Marrakesh. When we were organizing the trip we didn't know which agency to book it through. The problem was that the reviews in many agencies looked to good to be true. We were sure that the reviews are fake but we were wrong. I cannot say how are the other agencies but the trip we did was perfect. Our guide was Said (excellent!!!) and he really overachieved our expectations. Definitely worth it!"
        }, 
        {
            "index": 9, 
            "rating": "4", 
            "review": "Super experience of beautiful Marocco. After good, clear & timely communication per email upfront, we (group of 6 friends) were picked up early at our hotel in a comfortable airco-ed car (although maybe a little small for 6 adults) by our nice guide Abdul and then drove towards the Atlas. Fisrt stop was at a tradiotional Berber family house where we were showed around and tasted some bread and the lady of the house explained about the tea, then back on track towards a beautiful small valley for a short camel ride. Never did it before but what an experience :-) Then a longer drive through the beautiful & scenic Atlas and Ourika valley. The next stop was for a combined hike & mule ride (most of us liked it, myself I found the mules quite wobbly) to some waterfalls and a very tasty lunchbreak at a Berber family home. Then another spectaculair drive to the stop where we drove ourselves on a quad/buggy through the sand/dry river banks. After a long but very nice day Abdul brought us back at our hotel. He really could tell us a lot about moroccon,arabic & berber life and took good care for us by getting us new water bottles every now and then. Would definitely recommend it!"
        }, 
        {
            "index": 10, 
            "rating": "5", 
            "review": "Amazing ATVing in sand dunes. You are left feeling that you want to do it all over again! We had a 4day trip including quad biking in Merzouga, the experience was great amazing. Our guide Mohamed was very friendly and expert. Highly recommended. Thank you so much!!!"
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "Absolutely fantastic!. Youssef was the best guide we could have asked for. He met us at our hotel in Marrakesh and started explaining the entire trip to us while we were driving in a very comfortable SUV. He gave us history of every stop and he made stops that were absolutely unexpected (a baby camel and family!). Besides Youssef being fantastic, the trip overall was amazing. We spent time in the Atlas mountains on our way from Marrakesh to Fes. The stops were incredible including rock climbing in a gorge, a visit to a family friend living in a cave and a Nomadic family living in the desert. The ATV riding through the dunes of the desert was unreal and we could not have asked for a more fun trip."
        }, 
        {
            "index": 12, 
            "rating": "5", 
            "review": "A Great One-Day Trip with Kids. I must confess, I was nervous booking a trip over the Internet into the hills of Morocco with my entire family. We were travelling with myself, my wife, and our 2 children (10 and 13). We did the one day excursion into the Atlas Mountains, and it was a fabulous experience. We loved the 2 home visits and particularly enjoyed the mule ride up to the waterfalls. The trip was very professional and exceptionally well organized. The guide was thorough, knowledgeable, and even willing to tolerate us pestering him about his personal life as we tried to get some concept of what day today life is like in Morocco."
        }, 
        {
            "index": 13, 
            "rating": "5", 
            "review": "Absolutely Amazing !!. We (a family of 3 with a girl age 9) did a 6 days round trip from Marrakech to Essaouira, Safi, Casablanca, Rabat and Meknes. The route by the ocean is simply stunning. Our guide Abdul is superb and with his knowledge of the history and culture, he makes the tour a real pleasure. The accommodations arranged by Abdul were great and so were the places we stopped for lunches/dinners. This is the second time we did a long tour with Abdul as our guide, as in his company the tour is much more fun and informative. Can’t wait to come back again for another long tour to cover the north of Morocco."
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "Amazing adventure trip. We have just back from Morocco and we had a great trip with Morocco Active Adventures. Our guide was Mohamed and he is a very funny and friendly person. The was through High Atlas Mountains, camel ride, ATVs and hiking."
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "Fantastic four day tour!. Our tour guide was Said and he was amazing! We went on a four day tour around Morocco leaving from Marrakech, travelling south east. Our four days was jam packed with adventures from horse riding, camel riding (seriously uncomfortable), camping in the desert, sand boarding, quad biking and going to see the waterfall. Said was very informative, funny and kind. One of the highlights of our trips was visiting a Berber cave, it was truly eye opening getting to meet some beautiful people and see how they live. Our adventure was amazing, but it did require a lot of time driving, so if you want to spend less time in the car, just mention it to them when you are planning your trip and they will accommodate you."
        }, 
        {
            "index": 16, 
            "rating": "5", 
            "review": "Amazing Tour (3 days/2 nights). I dealt primarily with Mohamed in getting the tour setup and our tour guide was Hassan. Mohamed was very responsive and answered all my questions thoroughly before I made the decision to book the private tour. Tour: The tour was great and highly recommend it to anyone traveling to Morocco. We did the 3 day/2 night Sahara tour. We visited a bunch of places in between and spent one night in the desert. Hassan was friendly, courteous, knowledgeable, and very accommodating. Not only was he a great tour guide he is an amazing driver. Driving through the mountainous regions and tight roads was not easy and I came away very impressed and felt safe. Hassan was always on time and made sure we would be able to enjoy all the tours at a relaxing and enjoyable pace. Highly recommend the company to anyone on the fence about taking a private tour. For those who are considering group tours (the ones you can typically get at your riad or from guys on the street) be aware that those do not come with English speaking tour guides. You just have a driver bringing you from one destination to the next and a group of other tourists trying to figure out what things are."
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "Awesome adventure day!. I chose these guys based on other reviews. We took a private tour for 2 and we opted for a pre planned itinerary which started with breakfast in a Berber home, followed by a camel ride, a drive through the Atlas mountains, a hike to the waterfalls, a lunch in a Berber house, a donkey ride and then quad biking in the desert. It was a long day so be prepared, but it was so much fun! Our guides were very friendly and knowledgeable about Morocco and kept us very comfortable with bottled water and stops along the way. This definitely enhanced our trip to Morocco and I'd highly recommend it."
        }, 
        {
            "index": 18, 
            "rating": "5", 
            "review": "Awesome four-day customized tour. I have checked many many tours that start from Marrakech and finally found this one, it was the best I would say. The activities here were amazing. They were the most beautiful memories I have ever had. We also appreciated the customised service. We wanted to add Ouzoud waterfalls, which was on the opposite direction from our tour. But the company managed to do it for us. Our driver Saied and guide Addi were very thoughtful, flexible and friendly. Me and my boyfriend we had really comfortable time with them. We were worrying because many tours would bring you to shopping place, but this never happened to us. Every second we felt it was for us and we enjoyed it a lot. Lastly I want to see, Morocco was super nice. Especially with various activities. We did rock climbing, horse riding, camel riding, sand boarding, star gazing, quads biking... They were all super fun, I really wish could have a trip back there just do all those activities again. It was my first time doing quads biking on the Sahara dunes, we could drive to some areas you can never get access to with camel or walking. Saw those dunes without any foot prints. Wonderful!The accommodations were really good as well. First night we stay in a four star hotel on the way to the desert. It was kinda on the top of a hill. So we could oversee the town. The most amazing was the swimming pool, it had a cold water pool, a hot water pool, and while sitting in the swimming pool you can actually enjoy the amazing view. And the camp in the desert was the best camp I have ever seen. Very awesome and comfy. We moved our bed outside and slept under the stars. It was the first time we saw those stars that clear and the view was breathtaking."
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "Camel Ride. I know it is touristy however my daughter (16yrs) booked a camel ride at sunset. We were dressed in the traditional Touareg blue head scarves and dress and mounted our camels. Only my daughter and I were taken out with the most knowledgable young guide, whose name I forget. He told us all about the camels and pointed out many things of interest along our trek. He then took us to a Berber village where we dismounted and enjoyed mint tea and pancakes. We then headed back riding against the back drop of the setting sun. This was such a lovely experience to share with my daughter"
        }, 
        {
            "index": 20, 
            "rating": "5", 
            "review": "Excellent and cannot be missed! 6 Star experience. Thank you to Ati and Sahid for such a great day - unforgettable!These guys are genuinely the best tour guides we've ever had in over 5 countries. They took care of us like we were their close friends and it was their top priority that we had a great time and learnt about Morocco and the Ber Ber people.We choose the Atlas Mountain one day tour and it follows very close to schedule but without being rushed or forced. The booking process is a bit strange in that you pay a deposit into a pay pal account but do not be concerned about this. Its a very well run business.Pros:- knowledgeable and friendly tour guides- well planned day with lots of activities (perfect if you are short on time)- everything is taken care of and tour price is all you payCons:- none We cannot wait to come back and do another tour."
        }, 
        {
            "index": 21, 
            "rating": "5", 
            "review": "Desert Delight (3-Day Marrakech to Fes Tour). Words cannot explain how amazing this experience was. Addi and Said are great guys who are very informative and friendly. For anyone wanting to really experience Morocco and Berber culture, such a trip is a must!"
        }, 
        {
            "index": 22, 
            "rating": "5", 
            "review": "Wow! Exactly what we hoped for and more!. We had the most amazing time on our trip with Morocco Active adventures. Truly our guide (& new friend, Youssef) is what made the experience all worth it. He kept us laughing and seemed to know everything about everything. We could make changes in our itinerary for a \"let's go look at that\" kind of thing. Or he never once tried to hurry us even though we were trying to stay on schedule. Then when we were too tired and just wanted to go back to our hotel, like everything else, \"No problem!\" We slept out in the Zagora desert after riding to camp on Camels (pretty painful for the fellas). The camp was awesome but it was pretty warm (what do you expect) and the driving is very long. However you're going to leave feeling like you \"know\" Morocco when you're done. Youssef is welcome to our home in Las Vegas anytime!"
        }, 
        {
            "index": 23, 
            "rating": "5", 
            "review": "Zagora desert 2 day. Booked from the UK and the communication was excellent and answered our many questions promptly. Booking and paying a relatively small deposit of 50 euros was simple through paypal. We then got picked up from our hotel at 9am by two really nice guys. The driver was a brilliant driver that drove at decent speeds but we always felt safe which is an achievement by itself as anyone has seen morrocan drivers would know. He told us that we of we wanted to stop for anything like drinks, toilet or just to take a picture he would (and did). The tour guide was really knowledge, interesting and funny. He told us stories of morrocan traditions, as well about the sights. For lunch we stopped in a lovely riad with a pool to cook off as the temp was about 43° at this point. Be aware that as they will stop whenever you ask the journey can increase. We didn't ask to stop that much as they advised enough places with spectacular views and sights. So with minimal stops that we requested it took us about 9hours to get to the desert. At the desert we were greated by the men from the camp that led us on camels for about an hour to a camp in the desert( while the sunset) . At the camp we were given green tea and time to shower, settle in etc. The showers were also pretty decent. The tents have a light, beds, a charging point carpets so you could say this was closer to glamping than camping ☺. Dinner was beautiful, tagines, salad and melon. It was quite windy when we were there so they didn't light a fire but they sang songs, played drums, guitar and danced. They kept us well entertained all night. Switching the lights off in camp gave a spectacular view to the unreal Blackett of stars where we lay until about 1.30. The heat in the tent was incredibly hot and many chose to sleep outside which seemed safe enough As it was very windy on our night we slept in the tent but it was very hot and nosy from the wind. We didn't sleep much but please don't be put off by this because it was worth one night of sleeping not too well. The next day, they woke us up ready to see sunrise, had another really jive breakfast before we rode the camels out if camp and started our journey back. Again we could of stopped in a a few museums but as I was tired I slept and wanted to just get back so our stops were limited. A truly outstanding tour, company and guides. There is so many more good things to say but my fingers are hurting any questions please let me know and il try and help"
        }, 
        {
            "index": 24, 
            "rating": "5", 
            "review": "4 days desert, climbing, quad, Berber tent, camel and everything in between. Had a blast with Morocco Adventures. My guides Addi and Syed were fantastic. They were informative, knowledgable and truly amazing. I hope they get paid well and tipped well because they are worth every penny. Operator Mohamed answered all questions and was spot on with every adventure.I'm going to miss this place and my driver and guide Addi and Syed. We had some good times, ask them about the crazy Canadian.Thanks and will be backAdam from Toronto"
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "highlight of our trip. An absolutely unforgettable unique experience. Our guide was brilliant he knew the culture and history of the whole country.All the hotels we stayed in had beautiful views and surroundings and really good food.We did loads of stuff the camel trek in the desert was definately one of our highlights.I cannot recommend this tour enough for a superb, authentic experience!"
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "The absolute highlight of our trip to Morocco. We have just returned from a month overseas and I felt compelled to write about the amazing time we had with Morocco active adventures. Right from the outset, Joussef spent a lot of time going over the trip in detail and was very reassuring, considering we were booking at very short notice as we weren't sure of the conditions being suitable for a desert trip with two young boys aged 9 and 11 in July, until we got to Morocco. We felt far more comfortable and confident after speaking to him over any other groups we had spoken to.Abdul our driver was the best! Very friendly, easy going and accommodating. He took every effort to meet our specific, individualised needs - even to the extent that he sourced great places to stay with swimming pools in the most unlikely of locations, when my youngest wanted to have a swim after a hot day travelling! He also went out of his way to help us deal with a problem that occurred in the Riad that we had been staying at in Marrakesh. His service was not only above and beyond, but we had no doubt that it was from a genuine concern for us all having a good time. From Marrakesh to the overnight desert camp in the Sahara and back to Essouira over 4 days, we owe all the amazing things that we experienced to Abdul. We consider him a friend and were sad to say goodbye. I hope our paths cross again. It was a once in a life time journey. I have no hesitations in highly recommending this company, they are worth every penny - in return for a priceless experience."
        }, 
        {
            "index": 27, 
            "rating": "5", 
            "review": "Absolutely Amazing. I along with a group of friends went on a five day tour with guide Youseff and driver Mustaffa, and from the outset they both made us feel very welcome and at home. We went to many different cultural locations and engaged in activities such as rock climbing, quad biking and camel riding. Youseff was unbelievably kind and committed to the enjoyment of the group, and nothing was too much trouble. I would have no hesitation in recommending this tour to anybody that is interested in seeing Morocco for what it is, an absolutely lovely part of the world."
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "The BEST of Marrakech and Morocco!. We absolutely loved touring with Ali! He was so knowledgable and accommodating! I appreciated being picked up directly at our Riad and how easy all the logistics were! We saw so much of the High Atlas-a Berber home, rode camels, hiked, went horseback riding to a waterfall and even went on quad bikes! I cannot say enough good things! It was a great value and wonderful experience! This was especially great if you only have a couple days in the Marrakech area!"
        }, 
        {
            "index": 29, 
            "rating": "5", 
            "review": "One day trip . They were Amazing!! Ali was So friendly and took some amazing pictures. Amazing scenery. Fantastic view into Moroccan culture. MMA WAS GREAT! Picked up very prompt from hotel too."
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Best trip ever. My friend and I are college students studying in southern France. We both have been wanting to visit Morocco for some time now and we were unsure how to get to all the cool places we wanted to see safely and efficiently. Luckily, this company came in so clutch! First of all they completely personalized our trip to make the most of our limited time in Morocco. Youssef, our guide, picked us up and drove us the entire way. We had a 3 day trip that included a camel ride and camp out in the Sahara, a visit with a berber family, along with a bunch of other beautiful stops. Everything was beautiful and of all my traveling, Morocco was my favorite place by far. All of the accommodations were above and beyond expectations and our guide, Youssef, was absolutely fantastic. Youssef really knows his country and the people in it. Would recommend this company to anyone looking to make the most of their time in Morocco and get off the beaten tourist path."
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "Great day trip - highly recommend!. Our group of 4 friends recently booked onto the 'Atlas Mountain' day trip as we wanted to experience something a bit different and out of the city and this looked the most fun and value for money, especially with the great reviews. We certainly were not disappointed and loved every minute of this day-trip.Our tour guide (Ali) was really great and very friendly. Very happy to answer any questions on Morocco, religion, culture or just about anything. We went during Ramadan so considering his limitations he was brilliant.The itinerary they offer is a lot of fun - we especially enjoyed the walk to the waterfalls and the quad biking. There is a lot of driving involved but the views are amazing - especially all the changes in scenery and colours.Would highly recommend this to anyone. Even though Morocco is quite cheap and this might seem like high initial cost - you definitely get value for the whole day and see so much you would otherwise miss.Final comment goes to the organisation of the day trip. The website offers chat using whatsapp which made communication and organising very easy for us.Would definitely use this company again if we go back."
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "Best Tour in Morocco!. I recently completed a four day tour with Active Adventures and it was on of the best tours I have ever taken. I was traveling with my two daughters, ages 21 and 17, and we had Youssef Bani as a guide. He was absolutely wonderful. One of my daughters was ill on the first day, and he was patient and accommodating, allowing us to leave at 2 p.m. instead of 8 a.m. He took us to some amazing places that I don't think we would have seen on a different tour, and throughout the four days he was consistently professional, while also being very warm and friendly, throwing in extras such as midnight sand-boarding for my two girls who were up for more adventure than I was. Although we spent over a week in Morocco, the four days we spent on this tour were definitely the highlight of our trip. I would DEFINITELY recommend this trip, and especially Youssef, to anyone up for a fun, adventurous tour."
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "Highlights of Morocco, G Adventure Tours 14 days. This was not a \"couples\" trip but I had to click something. This tour with G Adventures was excellent in my view. We were 14 people in total. 4 couples late 50s/early 60s, six young folk...20s...We all clicked very well. Yassine, our guide, was a 29 year old Moroccan. Amazing ambassador for his country. This is an \"adventure\" tour so you are staying in interesting, quaint hotels. You are travelling in a comfortable van. We covered just over 3000 km. There were lots of stops along the way. There's free time and you are not obliged to eat or always be with the group. All breakfasts were included and about 4 lunches and 4 dinners. You experience local sights with local guides. We rode camels and camped one night in the desert. We walked up a mountain path and stayed overnight with a family, kind of like their version of a bed and breakfast. We had a fish fry over charcoal at a fishing port. Ate in the markets at the food stalls in Marrakech. I felt that that this trip was excellent value for the cost. We all enjoyed ourselves and we did not all know each other before hand. There was flexibility in what you did or did not do....but we mostly all always did all of what was offered. If you are looking for luxury and five stars....this is not your trip. But if you want a wonderful \"experience\", see how the country really is and get an education about this interesting country, try this G Adventures trip."
        }, 
        {
            "index": 34, 
            "rating": "5", 
            "review": "Best Tour Ever.! . Youssef is the best tour guide I have ever met. Me and my friends had a AWESOME trip in Morocco.! He was very professional and fun.! He explain very well and we stayed in the best places with the greatest views.! I recommend 100%.!"
        }, 
        {
            "index": 35, 
            "rating": "5", 
            "review": "Awesome . I visited Marrakech in December and with two friends I enjoyed a day tour through the mountains and desert. We visited a Berber family where we drank tea, rode a Camel and did a donkey ride through the mountain, taking us to a family where we would had lunch. We finished the day after a beautiful ride to the desert through the mountains to have a mesmerizing squad ride during sunset. What gave our trip an extra was our great guide Youssef Bani, a very kind, knowledgeable young man who did everything to teach us about the culture and to make us feel welcome. We loved the music he played us in the car (a comfortable 4-wheel drive) as well :-)"
        }, 
        {
            "index": 36, 
            "rating": "5", 
            "review": "An action packed tour with brilliant cultural features and wonderfully helpful staff. I went on a 5 day desert tour with 9 of my university friends and we had an absolute riot! From the moment we met our guide Yussef and driver Mustapha we felt very welcome and excited for all the activities we'd be doing. The rock climbing, hiking and quad biking had been arranged brilliantly and everything went very smoothly, even though we were a bit of a roudy bunch at times! The camel ride to the Berber camp in the desert was definitely a highlight of the trip and the stargazing there was spectacular. I would recommend this trip to anyone wishing to explore Morocco regardless of age or health. Thank you Morocco Active Adventures!!"
        }, 
        {
            "index": 37, 
            "rating": "5", 
            "review": "Incredibly awesome trip!. We booked a three day desert trip with Yousseff. There was never a dull moment in during the trip. We learned so much about Berber culture. Since Youssef grew up in a Berber family himself, he took us to a a real family living in a cave, to have tea with them. The entire trip felt really \"real\" and was just flabbergasting! I can very highly recommend it!Some of the highlights were driving over the Atlas Mountains after it had snowed, climbing up a cave to meet with the Berber family, Yousseff willing to accomodate us when we said we were climbers (he tried to arrange a short climbing activity for us on the spot), amazing hotel on the way, sleeping in the desert!, riding camels etc etcJust book this trip, you won't regret it!"
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "An enriching trip through Moroccan and Berber culture. Our experience with our guide Said was much more than being guided to the amazing sites and activities. Over 2 and a half days, we gained a much deeper understanding of the Moroccan people and their culture and the history and stories behind the places we went. We left as strangers but completed our tour as friends. The camel ride into the Sahara dessert was breathtaking, and nature delivered us a truly authentic experience with lots of wind and blowing sand. How we appreciated the Moroccan shesh (turban) that covered our heads and faces! Good food, a Moroccan drum performance with audience participation, comfortable beds in private tents, and yes...a flush toilet. The staff was friendly and funny and stopped often for photo opportunities. Don't miss it."
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "Met Gierende Banden!. We went on a 4 day trip with Mohamed and Youssef to the Merzouga desert and back to Marrakech with 4 persons.The first day they picked us up at the hotel precisely at 8 AM to start the tour. With our luggage on top of the car we left with \"gierende banden!\" in a very comfortable Toyota 4x4 to the High Atlas Mountains. Mo and Youssef where very good companions on our trip, although we didn't speak French and Youssefs English was limited. Mo could tell us a lot about Morocco which made the long car ride very interesting. Driving up the atlas gave us some amazing views. We continued the ride through the Dades Valley and the Valley of the Roses, too bad it wasn't the right season, for we did only see a few roses there. The day stopped at the Tinghir Valley, where we stayed in a small riad with a beautiful view over the valley. Here we had dinner and enjoyed a night with music played by the owner and staff.The second day we started with a visit to berbers in their cave to drink some tea. After that some rock climbing, a climb of about 20 meters, which was very nice to do and also very accessible for non experienced climbers. Then we continued our trip to the Merzouga desert. Arriving in our room we took only the necessary stuff with us to travel to our camp for the night, a one hour camel ride away. The ride was a very exciting experience, with beautiful sights of the desert. Beware of sore legs after haha! The next day we watched the sunrise, which was nice but not that special, since the sunrise was at the not desert side of the camp. It was possible to go sand boarding, we tried it, but since the boards where in bad condition and it was impossible to tighten your feet. You could only slide down and walk back up. The ride back was pretty good, and back in the riad we could wash all the sand away with a refreshing shower. Then, what I think, came one of the best things of the trip: Quad biking through the desert. After a short introduction by Mohamed (Another one, I think about 96% of the people is called Mohamed there) we went for a nice drive through the sand dunes. Mohamed really took the time to make everyone in the group feel comfortable with the quads and the dunes. We took some high dunes and steep rides down which were very cool to do. After the quad biking we drove to a big riad in Quarzazate with a swimming pool, pretty good.Last day we visited The Atlas Film studios and Ait Ben Haddou, an old town with lots of tourists. We also did some offroad with Youssef which was nice. Then we drove back over the Atlas Mountains to our hotel.We look back on an excellent trip and special thanks to Mohamed and Youssef! Who learned us to talk like berbers and make camel sounds, or was it the other way around? Thanks guys! Spartacus!"
        }, 
        {
            "index": 40, 
            "rating": "5", 
            "review": "One of the greatest experiences of my life!. It has taken me far too long to sit down and write a review because I wanted to have the time to do this incredible company justice. I would book a trip with them again in a heartbeat! We did the day trip to the Atlas Mountains and our guide was so incredible. He stopped often so we could take photos, took us to have tea with a very kind Berber family, took us to lunch at a great restaurant, and was extremely helpful in assisting us up the mountain at our own pace. We captured great photos, talked to some great people, and had an incredible experience neither of us will ever forget. I am so glad we followed the advice of the reviews online and booked a trip with this company. I highly recommend them! Gorgeous scenery with the nicest guides around for a great price!"
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "Excellent!. Morocco Active Adventures organized our entire tour – soup to nuts within Morocco. Mohamad worked closely with us for couple of weeks over phone/WhatsApp/email in the run-up to the trip to cover all of our requirements and build a customized trip. We are a family of 3 with a 5 yr old with some dietary constraints and demanding to see most of Morocco within 8 days.  After a relaxing flight in business class on latest acfts of Qatar Airways (SIN-DOH A350 and DOH-CMN on 787) we were warmly greeted by Abellatif Essaleh Amanar at Casablanca Airport. Abellatif was a very safe and courteous driver who looked after the tiniest of our needs. He ensured we had a safe vacation and didn’t miss any anything. He also doubled up as guide (although we had dedicated guides at all attractions) with his very good English, contextual knowledge is a walking encyclopedia – it was very helpful and appreciated. We must say he is indeed the best driver/guide we have experienced from all our visits around the world. An amateur music composer with compilations on youtube. He made the long drives seem very short with his songs, chat about Berber cultures, local experiences and education as we passed landmarks. We got very close to him during the 8 days. In fact, he even invited us to his place in Marrakech for dinner with family. We were amazed and privileged to experience such a warm Moroccan hospitality. We now have a friendship to cherish.  We highly recommend Morocco Active Adventures and Abellatif to all who is planning their next trip to Morocco. Excellent service."
        }, 
        {
            "index": 42, 
            "rating": "5", 
            "review": "Brilliant . The best few days ever! We went on 3 day tour Marrakesh-Merzouga- Marrakech beginning of April. Had an amazing trip filled with gorgeous views and amazing experiences all along. Our guide Hassan and driver Brahim were great. They are very knowledgable guys, all questions been answered with no language barrier. It was so easy to communicate with them and the office. I contacted them through Watsapp and received almost instant reply that just makes so much easier and way quicker then emails that i send inquiries to other companies that do those kinda trips. Don't look any further they do know how to take a good care and especially those two amazing people that we spent wonderful time with.I fell in love with Morocco it has so much to offer, landscapes are just amazing... I already booked 2 weeks down there. Cannot wait for next adventure in August to begin.Thank you guys for every single minute of the tour that was incredible."
        }, 
        {
            "index": 43, 
            "rating": "5", 
            "review": "WOW!. We booked this trip to celebrate our first wedding anniversary after reading reviews on tripadvisor, and so glad we did. This trip was without a doubt the best experience of my life. Hassan was out tour guide and what a knowledgeable, kind, honest , and funny man he was. There wasn't one question he couldn't answer and told us so much about the history and cultures in Morocco. The berber families who we shared breakfast and lunch with were also kind and friendly and seemed genuinely excited to share their life with us. We went on a camel ride, mule trek, walk to the waterfalls and quad biking to finish the day. Moubark our driver was also such a kind, honest and hilariously funny gent and made us feel safe the whole trip, even though driving on the crazy mountain roads. Learning about the culture, taking amazing pictures and eating some of the best home made food you'll ever taste made the trip amazing but sharing the day with Hassan and Moubark made the day so much more memorable and an experience we will never forget. We will definitely be back and next time for longer."
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "Unbelievable experience !!!!!. My wife booked this day trip for our 1st wedding anniversary and it was unbelievable and a lifetime experience . We were met outside our Riad by Hassan and taken to the tour car which was a 4x4 and then introduced to Moubark who was such a polite guy . We were then taken to a Berbers house and showed around and any questions we had were answered very clearly and explained very well . We had breakfast here and then made our way to experience the camel ride, we then went on to the atlas mountings where we were introduced to more Berbers where we travelled to a Berbers house for lunch by a mule . We then went to the waterfall and then sight seeing and finally to the quad bikes . I can't explain in words how amazing this was and how much we were looked after . Hassan and Moubark are amazing a lovely people and I would recommend anyone to try and get these to brilliant tour guides for there tour . We will definitely be returning soon for a further tour with Hassan and Moubark . THANKYOU once again you are both incredible people and such a great and organised company . It was the best anniversary with my wife ever and it was a pleasure for u both to be apart of making it that special . Such great and fun people . See you both very soon :)"
        }, 
        {
            "index": 45, 
            "rating": "5", 
            "review": "Big day of fun. Clean, prompt transport with wonderful, engaging guides. Our day involved camel riding, visiting a but ur village, donkey ride, a hike to a spectacular waterfall and then quad biking for an hour.The breakfast and lunch provided were really tasty. Our guides were entertaining and accommodating.Can't fault it. Would recommend it to all age groups!"
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "Unforgettable experience . Me (24) and my boyfriend (31) from london booked this trip because of the amazing reviews we saw on here and it really did deliver.We had the most incredible day and it was an experience of a lifetime. Ali was an amazing guide and makes it feel like you are all friends that have known eachother for years.You explore the Atlas mountains better than any other tour because there is very little driving and more exploring. We went to a Berber house for breakfast, then the ourkia valleys, then climbed the mountain, had a camel ride and a mule ride, lunch with a berber family and then we had the quad biking add on which is definitely worth it because you get an hour and a half extra in the desert!Do not go to Marrakesh without booking this trip, it was the highlight of our holiday!"
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "Jam packed day!. We were met very promptly in the morning by our tour guides; Youssef and Mohammed. They were very cordial and pleasant. They took us for breakfast at a traditional Berber village; which was delicious. After that we went for a short dromedary ride. From there we went to another village where we mounted mules and navigated rocky terrain and loose gravel paths to another Berber village where we had a delicious tagine lunch with a very scenic view of the valley. We continued with the mule ride until we came to a very scenic waterfall, which was a lovely reprieve from the heat.FOLLOWING ALL THAT: we went for a quad-bike drive through the desert against the landscape and the sunset. In summary, it was a really busy day! We did so many things and travelled so far. Our tour guides were wonderful; made an effort to properly get to know us, engaged in lively and jocular conversation, despite an obvious language barrier, and were only too happy to accommodate our requests.5/7 would recommend to everyone."
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "Great Trip as a solo female. I am retired. I travel a lot. Solo. In groups. As a couple. I booked with Morocco Active Adventures to have a guide to introduce me to a new country and culture. They were great. Youssef was knowledgable, friendly and prompt. I felt totally secure. Whether in the Marrakech medina, on a camel in the desert or bouldering in a red rock canyon. He explained a lot to me about Moroccan history, Berber culture and daily life. I travel to expand my understanding and appreciation of people and places foreign to me. Morocco Active Adventures successfully provided that. I would absolutely book a trip with them again if I am so fortunate to return to Morocco."
        }, 
        {
            "index": 49, 
            "rating": "5", 
            "review": "Amazing day in the mountains. We chose this tour after reading the amazing reviews on trip advisor and we were not disappointed. We had only 2 1/2 days in Marrakech and this enabled us to do/see/experience so much in one day.Ali our guide was very proficient in English and gave us lots of useful information regarding Marrakech/Morocco and also offered answers to the lots of questions we had, if he didn't know the answer he found it out for us. He also very kindly supplied a huge bag of sweets for us to share with the local children on the way up the mountains, of whom we seen a lot. I felt bad when they ran out :-(My favourite part was chilling by the waterfalls and the sights and sounds we passed on the way there. If you have a weak stomach then possibly the mule ride may not be for you, it was a bit of a white knuckle experience in some parts lol....Best take proper shoes as we only had sandals which was not ideal and possible a little dangerous at times.Its a long trip so take plenty water for the day or small change to purchase.Thank you so much Moroccan Active adventure for our unforgettable once in a lifetime trip."
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "Amazing. I just wish I had time to do their other tours. I contacted Morocco Active Adventures before my trip via WhatsApp. They were extremely helpful in answering my questions as we have a 2 year old with us and I wanted reassurance the trip would be suitable with her. In the end we decided to do the Atlas tour but without the quad biking. I paid a deposit via PayPal and the driver came on the day we suggested (this was changed last minute from Saturday to Thursday as rain was predicted on Saturday. Thank God we managed to change the day).So Ali picked us up at 9am and off we went to the Atlas mountains. Started with amazing tour of a Berber house with breakfast. Then onto the camel rides followed by a mule ride into the mountains. Without doubt this was the highlight of the trip. The views were stunning. Breathtaking. Ali was busy taking amazing photos for me and I was on the mule with my daughter and my wife on another mule. The place where we had lunch was mind boggling. A different world. So relaxing. Views stunning.After lunch we took the mule back down the mountain and to Imlil where we started off. Then we went back to the hotel by 5:30pm.My only regret was not booking a longer holiday and going on their other tours. We hope to be back one day and I have to say, this company are brilliant."
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "Best trip of my life. I went with a group of friends and started out in Marrakech. Then we took about a 9 hour drive spanning over an afternoon and morning the next day. It was easily the most fun I've ever had on a vacation. We stopped for pictures along the way and stayed in a very nice hotel one night on the way to the desert. Last we rode camels and I've never had an experience like it. The tour guide was amazing and so was Morocco"
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "Marrakesh-Fes. We took a three-day (more than 1000 km) trip with them from Marrakesh to Fes, via Merzouga. It went off without a hitch. It was a well-planned itinerary, great car and accommodation, and above all, extremely friendly, professional, and well-informed guide, driver, and support staff. Their prices may seem high compared to average prices in Morocco (for comparison, our 3-whole-days trip for 2 persons cost roughly the equivalent of 35 nice dinners for two in Morocco), but in my opinion, it was well worth it. Morocco is quite large and diverse, and if you want a hassle-free, comfortable and quite unique experience with no prior planning, I would highly recommend this."
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "Believe the hype - look no further. I have travelled the world and use Tripadvisor often, but never felt so passionately about an experience. MAA gave me one of the best single days of travel I have experienced anywhere. I contacted Youssef via Whatsapp and he arranged for me to spend an incredible day in and around the Atlas Mountains. My guide was exceptional and we went well off the beaten tourist trail. If you are like I was and browsing through seemingly endless companies for a Marrakech day excursion, look no further. A truly awesome experience. Thank you MAA."
        }, 
        {
            "index": 54, 
            "rating": "5", 
            "review": "Highlight of our trip to Marrakech!. We chose to do the Atlas Mountain day trip since we were only in Marrakech for 4 days and it was the best decision we made! Our tour guides, Adi and Abdul were absolutely incredible. It was only Adi's second week in training as a guide and he clearly is a natural. They were both so passionate about their culture and Morocco and told us story after story about the history, culture, their families, etc. Not only were all the activities spectacular, but we gained two friends along the way. I highly recommend them and I hope we are able to visit Morocco again and to do the 3 day desert tour with them. Highlights of the day other than our amazing guides: breakfast in Berber home (best semolina and tea we had all week), short camel ride on Aisha and Fatima, amazing views of the mountains, Mule ride through the village to the waterfall, short hike, delicious lunch of Tagine in a Berber home with view of the mountains, and one of the best ATV experiences we've had. HIGHLY RECOMMEND. -- Tell Adi and Abdul Harmony and Alex say Hi!"
        }, 
        {
            "index": 55, 
            "rating": "5", 
            "review": "Wish we could rate them 7 stars. We booked with this company before we travelled to Morocco based on excellent tripadvisor reviews. The whole process of booking was smooth through WhatsApp. Their communication was very clear, direct and excellent with no hidden charges. The itinerary sent was self explanatory. We were a bit apprehensive to stay 4 days in a vehicle with an unknown driver but Ali (the driver) was the best person, we have met in our life. Very polite, genuine person with good command on English. He genuinely made us comfortable through out the 4 days long excursion. We had plenty of opportunities for photos, etc. The accommodation and food provided by the company was of high quality. The people we encountered at every stage were very nice and polite. Overall the experience was amazing. We got to see a different side of how people live in Morocco i.e. nomads and their way of life. Truly we never had such a lovely experience before. If you are in Rissani area, do not forget to have Mudfoona (Berber Pizza)."
        }, 
        {
            "index": 56, 
            "rating": "5", 
            "review": "Atlas mountain/Berber house/camel ride/mule ride/quad biking. I booked the trip a few days prior to arriving in Marrakech.. I received quick replies. It was so easy to book. i just had to pay a deposit and the rest in cash.Our guide, Yousef was amazing we gave him the wrong address and he was so patient with us. He was on time to arrive and had water bottles ready for us, which was very kind. We drove to the Atlas mountains, visted the valleys such as Oukahmden, Ourika, Asni , Imlil and others, he parked the car at various destination we had a chance to take pictures and really enjoy the scenerey. His knowldge of the Berbers was fantastic and so was his English. We went to two Berber houses for breakfast and lunch. Which was organic,healthy and delicious. We learnt so much aBout the Berber way of life, the history and tradition. Yousef was such a lovely, humble person. I don't think we will ever forget him.He was really down to earth and we got on so well with him. We visited the Imllil Valley and hiked to the waterfall . The Mule ride was so exciting going up to the mountains. We also went on a camel ride. The quad biking was such a thrill, a must do! It was exciting to do it in Takerkoust llala lake. Amazing scenery, There was so much more but to much to write in this review. What i particularly liked was that we got to do everything in one day and i couldn't find any other company that offered this type of trip.Thank you so much Morocco Active Adventures, especially Yousef.Ahlam and Faris"
        }, 
        {
            "index": 57, 
            "rating": "5", 
            "review": "One Packed Day of Great Fun (and Educational)!. The one day tour of the Atlas Mountains is a blast! Breakfast in a Berber village, camel ride, donkey ride, water falls, spectacular scenery, lunch in a Berber village, \"lake\" and quad rides to end the day! To compliment the activities we learned and appreciated the life style and cuisine of the Berber people. This is one tour where you will spend more time doing stuff than time spent in the vehicle. I would highly recommend this one day trip for anyone wishing to have fun, taste great food, and learn a little."
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "Cow Milk Zero (inside joke with our guide). We went through at least a dozen itineraries offered from the other operators, and this one had all the things we wanted to do and all in a one-day trip!We were picked up directly from our Riad and then taken in a very safe/reliable 4x4 SUV to the various locations/activities: tea/breakfast at a local Berber family-house, then camel-riding for 20 minutes (which is more than enough time for the novelty of it), then a more comfortable ride on a mule to a waterfall - which was pretty damn cool and which had a shack with locals providing freshly squeezed OJ, then mule-rode to a Berber house in the mountains and had lunch on the rooftop with a nice view of Atlas Mountains, then to a lake where people jet ski and stuff, and finally quad biking in the sand dunes/hills. The other tours have you riding a camel for waaaay too long (IMO) and either don't have the waterfall bit or the quad biking bit all combined into one day (we got back to Medina at 7pm).Ali was our guide and was excellent. He cracked jokes and went out of his way to make sure we were having a great time.Thanks!"
        }, 
        {
            "index": 59, 
            "rating": "5", 
            "review": "A must do!. My boyfriend and I (ages 23 and 25) booked to do this trip to do on my birthday. Right from the start, Mohammed was great at corresponding with us, making sure everything was arranged before we got to Marrakech and giving us tips. We were picked up at 8.15 (Mohammed emailed to confirm the day before which I was impressed with) and went to a Berber house which was a great and insightful experience. I believe that no other trips do a few different villages! The mule ride was my highlight going up and down the mountain and to villages although at some points it was so steep and narrow I was fearing for my life a bit but that just added to the experience. The lunch was chicken kebabs, homemade bread and then a lamb tagine with potatoes and vegetables which was delicious and it was great that they had remembered my boyfriend is a vegetarian so he was provided with a vegetarian tagine which he said was the best veggie dish he has ever had! The trip is definitely worth the value and is pretty much a 11/12 hour day packed with different things and we basically had a private tour as it was just the two of us in a 4x4 with Yousef which was great. Definitely an experience we won't be forgetting and was a great day out of Marrakech. Would highly recommend!"
        }, 
        {
            "index": 60, 
            "rating": "5", 
            "review": "\"Brilliant 1 day tour and amazing guide. Best tour company by far. A week ago today I was experiencing a wonderful time on my one day tour to the atlas mountains. I wanted to do something memorable for my 40th Birthday and after much research on various tours in morocco I kept coming back to Morocco Active Adventures. If your looking for culture, tradition, history, fun activities, great food and warm friendly people, then this is the tour for you, this tour gives you the whole moroccan experience and a great time. This was the best experience i had in marrakech and far exceeded my expectations. It was a great tour with many things to do, see and experience and my guide youssef was fantastic!,he was very accommodating especially to my dietary needs, knowledgeable, informative, warm, friendly and patient. I felt extremely safe with youssef the whole day and he really made my trip one to remember ! Most definately an asset to Moroccan active adventures, keep up the good work Youssef.I booked my tour direct through email (morrocanactiveadventures@gmail.com) it was that quick and easy ! I booked my tour last Saturday, flew to Morroco on Sunday and was experiencing my tour first thing on the monday morning (my birthday !)I was picked up from my hotel promptly at 8.00am by my guide Youssef and drove about an hour to the Atlas Mountain through the Ourikka Valley. we stopped in a Berber village where we visited a Berber house to find out how Moroccan and Berber families live, and was a chance to share a local traditional Berber breakfast which allows you to have a taste of real pure homemade ingredients and made a lovely change from the taste of processed ingredients we are normally used to, made by the family, and to learn a bit about them and the history of the Berber people. After a short drive, we stopped to have a camel ride which i really enjoyed. We then drove through the beautiful mountain scenery with amazing colourful landscapes, crossing several authentic Berber villages until we reached the village Imlill via different rivers and Valleys such as Asni Valley. From here, we met with a local expert mountain guide and had a peaceful serene ride on a mule to another Berber house where we had traditionally made mint tea followed by a delicious lunch offered by the local family. After lunch, we went hiking/trekking to the waterfalls, which i found beautiful calming and peaceful. We then drive back on a different road to Marrakech, via Lala Takarkoust where i thoroughly enjoyed myself quad biking!I really enjoyed my trip to Morocco and my tour to the Atlas Mountain and hope to visit morocco again in the near future as i would love to experience the desert tour with Moroccan Active Adventures. This is a must do tour if you are visiting Morocco!! :) Shukraan to Mohammed and Shukraan so much youssef, hope to see you again.Salaam Alaikum"
        }, 
        {
            "index": 61, 
            "rating": "5", 
            "review": "An amazing experience. I cannot fault this company. Our day trip to the Atlas Mountains was flawless from start to finish. Rashid was our guide while Ibrahim did the driving. Both were exceptional. There was nothing Rashid did not know, and he instantly made you feel at ease with him. Being a Berber himself, he knew things that other guides simply would not know. His fun, adventurous personality alongside his knowledge of Moroccan culture and history was staggering and we learnt so much from him. Ibrahim was, well, a good driver as well! It's not easy to navigate the small, dangerous roads which line the sides of mountains but he did it calmly and efficiently and never made us feel concerned. As for the trip itself - it was the highlight of our short stay in Marrakech. We soon learned that you had to go outside the city to experience 'real' Morocco and had we not done this, our opinion of the country would be unfathomably different. If you're considering booking an excursion while you're here, don't hesitate - just do it, and I can highly recommend this company - and I have pretty high standards.For our particular trip (Atlas Mountains day trip) we were picked up from the Riad at 08:00 and from there we had a 30min or so drive to a Berber house. We could look around and see how they made their food and lived, and then the Wife of the house made us Tea (which was gorgeous) and bread. We then drove further and had a short camel ride, after which a mule ride higher up into the mountains followed by a short trek. The mule ride was great - and was such an insight into how the Berber people lived. It is an exhilarating experience being atop a mule on such perilous pathways, going higher and higher (and then down, which is actually more scary) and putting your trust into the two mule-keeper guys who barely speak any English. But in fact they seriously know what they're doing because well, they do it every day. So don't be concerned. We then went on to a second Berber house to have some lunch and (you guessed it) more tea! The food was really good and the snow capped mountains in front of you were such an amazing view. Our guide gave us some typical Berber clothes to try on (something the other one didn't) which just serves to show how this company will go above and beyond to make your experience a little better.The day ended with an hour of quad biking. This was great and will most definitely cater well for any adrenaline junkies out there, myself included. The quads were in good condition, the tracks fun and enjoyable with some great sights along the way. We were dropped back to our Riad at about 7pm, just in time for a good picture of the sunset. Oh yes - they have no problem letting you stop for as many pictures as you want as you go up the mountains, so for all you snap-happy people, fear not. I would like to thank both Rashid and Ibrahim for being such spectacular guides. Both of you are lovely people - keep doing what you're doing. Maybe I'll see you another time."
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "A magical journey through Atlas Mountains and beyond to the Sahara. Just back from the most amazing trip to Morocco where we decided we wanted to see a little bit more than just Marrakesh. Therefore we booked a 4 day trek with moroccoactiveadventures and from the moment our guide Ali picked us us up from our Riad to the moment he dropped us back we had the adventure of a lilfetime.Driving through the Atlas mountains was simply breathtaking as was visiting Ben Haddou Kasbah, a world heritage site followed by the amazing Boumalen Dades famous by its Dades Gorges. Our first night we were blown away to stay in the most amazing 4 star hotel greeted in a tradional Berber way as we walked through the reception. Sat and watched the sunset with a cold Casablanca beer followed by a traditional Hammam massage (naked...who knew?) and wonderful buffet dinner with local red wine.The highlight of day 2 was reaching the Sahara and trekking across the Sahara desert by Camel for a few hours to reach a Berber camp where we met 4 other travellers and were treated to a Moroccan feast and Berber drums and singing and dancing. Such fun! At bedtime we were given a hot water bottle each and our own little Berber tent with double bed and heaps of blankets as it gets so very cold during the night. We lay on the dunes looking at the stars for quite a while....spectacular.... you almost touch them!I will never forget the sights and sounds of Morocco. The camels and goats on the roadside and dusty markets and souks that made you feel like you had been transported back to another age in time. Our 3rd night was in another wonderful Riad with so much charm and beauty. Our guide Ali was marvellous.....went far and beyond the call of duty. He was always smiling and helpful and went out of his way to ensure our trip was memorable. A really lovely guy...very traditional and humble. We miss him and can't wait to book another tour with this wonderful company. You literally contact them with what you'd ideally like to do and what your budget is and they put together a trek based on this. We were expecting to slum it at times but this was far from the truth....We felt like royalty. Thankyou Mohammed for organising our trip and to Ali for the magical journey you took us on and your friendship :)"
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "Superb 3 day tour. Just back from a great 3 day trip with our guide, Ali. Very friendly, knowledgeable and a great driver too.Highlight had to be staying in the Berber camp overnight. A unique experience that I strongly recommend."
        }, 
        {
            "index": 64, 
            "rating": "5", 
            "review": "What A Day. We were staying in Marrakesh and after a day in the markets and souks we decided that the following day we needed to explore the Atlas Mountains a little. We were pushed for time as we were only in Morocco for three days so we booked this action packed one day tour and we were very glad we did. Our guide Youssef was fantastic, friendly, informative, good fun and really made us feel we had some basic understand of the culture of Morocco. The day was full of interest including camel riding, quad biking in the desert, mule riding a fantastic lunch in a Berber home and hiking to a waterfall. We enjoyed every minute as did our 13 year old daughter who was kept enthralled and occupied. When we re visit Marrakesh we will go for longer and book with this company again for a longer tour. The whole event was very professional and easy with Youssef picking us up promptly form the foyer of our Hotel at 8am."
        }, 
        {
            "index": 65, 
            "rating": "5", 
            "review": "What a wonderful trip to Sahara!!!. We just came back from a 4 day trip to Sahara (Merzouga) from Marrakech. It was an unforgettable and very exciting experience! I loved it. My favorite moments were entering Sahara on the camels, quad biking, and looking at the stars at night! I was amazed. Our guide was Youssef, and he was great. He is fun, patient, trustworthy and very knowledgeable, we learned so much about local culture! We joined another couple who turned out to be great companions, so it was 4 of us, which I think is the best way. Initially, I was considering 3 day tour, but I am happy we did 4 days because we had time for quad biking after the sunrise and got to see couple additional places, and weren't driving all day. While on the road, the scenery is constantly changing from mountains to dessert and it's so beautiful that the drive itself is enjoyable too. Youssef also considered our individual needs / desires and was very helpful throughout the trip. The company also provides additional bonus of free shuttle to or from the airport if they have available cars, so it was very nice of them to do that for us. I would definitely recommend Youssef and this company to anyone interested in adventures!!!! :)"
        }, 
        {
            "index": 66, 
            "rating": "5", 
            "review": "One of the best trips I've done!. I would really want to recommend to travel with Morocco Active Adventures!Me and my boyfriend had a 4day-trip with Morocco Active Adventures, Marrakech<->Merzouga Desert, which for me was one of the best trips I've done!All events and parts of the trip held a high standard, which made us feel safe and comfortable the whole time. At the same time the trip contained unique experiences, surprises and adrenalin kicks.We had the opportunitity to do the trip together with two other girls, which made us a group of 5 people with the guide - This felt like a good group size and possible to fit in one car. Being a small group made it possible to be flexible and have personal requests about the itinerary.What really made our trip special and great was our guide (and new friend!) Youssef! While being both personal and professional, he taught us about the Moroccan and Berber history, answered all our thousands questions and made us experience a multifaceted and authentic Morocco."
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "Amazing Experience. I just got back from our 3 day 2 night excursion from Marrakech to Fez, with camel trek and night in the desert. I must say it was an unforgettable unique experience. Our guide was FANTASTIC, probably the best thing in the trip, he was a true berber who knew the culture and history of the whole country. Also, very important he was a very safe driver, which considering how much you travel should be a priority. His name is Ismeil and if you can ask for him. He went out of his way ordering Berber pizza which we wanted to try and setting us up for an authentic Moroccan barbeque. He also knew where to stop to take beautiful pictures. The hotel we stayed the first night was small and modest but we had a delightful host which served an amazing dinner. The views from his riad are also beautiful. The camel trek and desert were also a unique experience. The car used for the trip was very comfortable and well kept. It had bluetooth and a usb charger so feel free to bring your own playlist and also charge your devices. The one downside was the guide we hired in Ait Ben Hadou, this has nothing to do with the company, but i just wish he bad better english. Despite this I cannot recommend this tour company enough. Book your trip and enjoy, ask for Ismail for a superb, authentic experience!Greetings from Rio de Janeiro, Brasil."
        }, 
        {
            "index": 68, 
            "rating": "5", 
            "review": "BEST Atlas mountain Day excursion! Don't look anywhere else!!!. You really do not need to look anywhere else when finding an day trip to the Atlas Mountains which includes camel and mule rides PLUS quad biking!! Ali the amazing friendly tour guide picks you up from your hotel/riad at 8am then your magical trip begins. First you drive up to a traditional village house for some tea and bread/dates/fruits while there you can have a tour of the house, theres chickens, cows , lovely views at the top of the stairs also. Next stop is the camel ride! Short and sweet 20min camel ride with again lovely views of the mountains! Ali is always offering to take pictures and is very helpful! Then after an hour of driving (it does not seem that long when you are admiring the beautiful views, Ali always offers stop the car for us to take pictures. He also gives interesting facts and information about the Berber villages and towns). Once you reach the Berber village you are taken on an amazing mule ride it truly is an amazing feeling to be able to ride a mule plus looking at the most breathtaking views! You then take a short walk to the waterfalls (I personally found this waterfall better than the Ouzoud, it had clear water running down). After the waterfalls you can either go back on the mules or walk, we did both and the mules walk with us till the end of the atlas mountain part of the trip. Next was an amazing Moroccan lunch (best food we've had in Marrakech) in a Berber house with a panoramic view of the Atlas mountain, it was truly an amazing experience. Back in the car we go to the quad bikes but that's after we take a stop at another glorious view. That's it. So many activities in one day. Don't look anywhere else this is the best trip to the Atlas Mountains!!! Thank you once again Ali you were an incredible tour guide!!"
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "Unforgettable tour fantastic tour guide. What a great trip. We booked the 3 day tour from Marrakech because of the great reviews and can honestly say we were not at all disappointed. Ali, our guide was brilliant. Everytime we stopped anywhere he knew people and wouldn't let us get hassled or pressured into buying anything! We had a slightly extended drive (due to terrible weather) to Boumaine du dades through the most wonderful countryside stopping along the route to eat and wonder round the Kasbar. We stayed in a hotel with the biggest beds I've ever seen and although the food wasn't great it didn't detract from the tour. The following day we drove to Merzouga for our camel ride into the sunset to stay in a Berber tent. Amazing. The camp was great, food fantastic and camp fire very necessary (it was very cold at night) and it even had a working toilet (not traditional I know but very welcome). Next morning we were up early for sunrise, back on our camels and back via more amazing scenery including the snow covered high Atlas Mountains, and finally back to Marrakech.Ali, our driver was truly wonderful, we felt very looked after. He is very knowledgeable and bought us, pizza from his home town of Rissani which we had for dinner after he dropped us back to our Riad. Also, and very importantly, the car was extremely comfortable which was very important as we spent a lot of time driving through the Maroccan countryside. thank you also to jousef for great communication before and after the tour. This is a great company. I really would highly recommend it."
        }, 
        {
            "index": 70, 
            "rating": "5", 
            "review": "Life changing experience. This tour is honestly the most AMAZING experience I have ever had. My friends and I had no idea what to expect, but because of our tour guides (Jose and Abdul), we had the experience of a lifetime. We were only in Morocco for 2 and a half days so this tour allowed us to do so much in one day: camel riding, atv riding, hiking the atlas mountains, mule riding, and having breakfast and lunch with a traditional berber family. Jose and Abdul were kind, funny, and so helpful throughout the whole day. They taught us so much about the culture and really went above and beyond to make sure we had a great day. Jose even was photographing each activity and he captured so many amazing photos. He also was able to connect with us through Facebook so getting the photos was easy as can be. Overall, I had the most incredible time and I already want to come back and do a longer tour with this company. Thank you so much to Jose, Abdul, and Morocco Active Adventures for an experience of a lifetime! I hope to be back soon."
        }, 
        {
            "index": 71, 
            "rating": "5", 
            "review": "Different experience . If you're looking for something different, I mean totally different, you HAVE TO choose this company!!! I might sound like a marketing staff from the tour company but I promise you in didn't get paid at all!!! LOL Imagine while other tourists are walking in the gorge you are already trying to climb up the rocky mountain for the very first time; while others are still immersed in the excitement of riding a camel, you have already hopped off the hump and jumped up and down various dunes in a 4 wheelers like in an 80s adventure movie set; while others travel for an hour just to visit a Berber family, you have a Berber guide by your side all day long, not to mention the chance to see Berber family in the Cave! All along with other stuff add up to an 4-day unforgettable experience for me and 2 other friends.Our guide Youssef is too good to be true. He's super considerate all the way, considerate like your family. Attractive and funny and a man with enough knowledge of his country and culture. Any questions you can shoot and you'll end up falling in love with this magical place without feeling like a total stranger. I think it's him that make Morocco, Berber culture and the whole trip so special. Also, his English is phenomenal which makes communication much easier and much more fun. I believe his French Spanish or Berber, now a bit of Chinese as well will contribute a lot to your trip. I'm usually a backpacker. But this trip is even better than backpacking. I know it sounds surreal but tell me how you would feel when Youssef turned a blizzard road closure into a breathtaking snow mountain siteseeing. And most importantly, Youssef is a very professional guide. Everything is arranged perfectly even with unexpected events and there's no unnecessary shopping and extra fees at all. I know it could be a bit daunting to try new things and price might not be cheap as those bus tours. But trust me, every penny you spend will be worth it. 我是16年2月来的摩洛哥，这个tour，特别是4天3晚上的这个带摩托，滑沙什么的是最棒的。如果看到这条信息的中国朋友不用找了，就报这个吧，真的特别赞。又可以攀岩又可以在沙漠里骑骆驼又可以在沙漠里骑着四驱车飞驰，我当时是骑着那个车飞上了一百多米高的沙丘，真的是永生难忘的体验。价格方面我当时也有犹豫，四天三晚不到四千的价格的确太贵，但是去完了之后真的是觉得太特么值得了。我们是三个人的团，可能会贵一点，如果你们有四个人的话，杀价杀到三千五百以下完全没问题。但是不要杀太狠，你玩完了以后就会发现他们家的利润真的是很低了。所以让这些可爱的Berber 人多赚点钱吧！他们公司的经营理念真的是很不一样，顾客服务更重要的那种。如果要找导游就找youssef，真是又可爱又性感的当地人。毕竟人家现在也会说一点儿中文，请放心大胆地调戏他。我实在受不了这么好的tour没中国人来过，必须安利"
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "Great Tour, Thanks Ali!. We booked a three day tour from Marrakech, visiting the High Atlas, Ksar Aït Ben Haddou, the Todra Gorge, the wells near Erfoud, Ouarzazate, Valley Of The Roses, camel ride into the Sahara from Merzouga and more.Unfortunately for us, the tour was postponed by a day (due to heavy snowfall in the High Atlas pass!), but our guide Ali couldn't have been more helpful.Not only did he rearrange our tour, he also spoke to our riad to re-arrange our bookings, and kept us fully informed of what was going on.On the tour itself Ali was always happy to explain things to us, and really helped us get a feel for his beautiful country.The tour was a pleasure. If you're lucky enough to get Ali, ask him to help you find the local 'pizza' that's the speciality of Risanni - it's delicious.Thanks again..."
        }, 
        {
            "index": 73, 
            "rating": "5", 
            "review": "AMAZING TOUR WITH AMAZING TOUR GUIDES. This was the best tour of my life. I had the most amazing time and we were able to do so much in just a day. My tour guides (Jose and Abdul) were amazing and planned everything perfectly. They were so polite and personable and taught my group and I so much about Morocco in such a short period of time. This trip was so great that I am already planning another one with the same company (hopefully same tour guides) for sometime in the future with my family. Thank you so much to Jose and Abdul for the great experience!!"
        }, 
        {
            "index": 74, 
            "rating": "5", 
            "review": "Excellent trip with Youssef. The real adventurous trip with the right tour guide # I would definitely recommend you their thoughtful arrangements and exciting activities. I gave them 5 stars plus one for Youssef Barney. He is a real guide with professional instructions and considerate minds which make our trip full of joys. Au revoir ! Morocco! I will come back, for your company really gave us an unforgettable trip!"
        }, 
        {
            "index": 75, 
            "rating": "5", 
            "review": "An Unforgettable Experience. I 100% recommend this tour to anyone going to Marrakech. There was a group of eight of us, and everyone was left in awe after this tour ended. Our tourguides Jose and Abdul were very friendly and were very knowledgable. It was very convenient (they were able to pick us up at our hostel) and worth every single pennyy. We were able to do so many incredible things in one day (camel rides, mule rides, hiking, atving and breakfast and lunch in a small village). I hope to come back and use the same company to explore even more of Morocco."
        }, 
        {
            "index": 76, 
            "rating": "5", 
            "review": "Amazing trip! A MUST DO in Marrakech, Morocco! A real taste of the culture!. We had a group of 8 and were only in Morocco for 2 days. We did the one day active tour through the Atlas Mountains with the camel ride, donkey ride, traditional Berber breakfast and lunch, as well as ATV riding. Honestly this experience exceeded any and all expectations we had. Jose and Abdul were amazing guides and they really made the experience for us. This tour was well worth the price and you won't regret it!! It was better than any other tours offered since they really show you the culture and life of the Berber people. A trip myself and my group will never forget. Thanks again Jose, Abdul, and Moroccan Active Adventures for the trip of a lifetime!"
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "Snowy mountain day adventure!. We are two friends doing a short holiday to Morroco from the UK, we wanted to do a trip out of Marrakech for the day, and after reading the reviews for Morocco Active Adventures, decided to book their Atlas mountains day trip. We fitted in a traditional Berber breakfast and lunch, camel ride, short hike and quad biking in the desert and still got back to Marrakech not too late! we had a wonderful time with our excellent guide Youssef, who taught us some Berber phrases and played some good music in the car! We would highly recommend this trip, if we come back we would use this company again and maybe even book a longer trip."
        }, 
        {
            "index": 78, 
            "rating": "5", 
            "review": "2day dash over Atlas Mountains taster of Morocco. We were warned 2 days wasn't t enough by the team but we didn't have longer. Abdul was a great guide, we drove a comfortable spacious car hundreds of miles through the highest pass in Morocco in the amazing Atlas Mountains . We were disappointed not to see round the studios as we thought that was part of the trip but time was precious.the camel rides and the sunset in the Zagora desert was a treat. The Berber tents were luxurious and the drumming and singing into the night were great. Next day, our return was dashed by a huge dump of snow in the mountains, the first of the winter! This meant we had to divert round Agadir. Nothing was too much trouble for our guide and he found us a great eatery on the long journey.we would recommend books and in car entertainment as although the views were stunning and there was lots to talk about, you might find 13 hours of driving hard! Next time, we would use the same company and have a trip tailored to our needs. The company is amenable to anything. Not just the trips on the website!"
        }, 
        {
            "index": 79, 
            "rating": "5", 
            "review": "Best part of our trip to Marroco. We can only recommend in booking a tour with Marocco Active Adventures. My GF and I had a private guide, that drove us from Marrakech to the Merzouga desert, where we rode camels, tried sand boarding, watched the sunset and the stars in the night and finally also slept there. The next two days, we also got to see very interesting stuff. For example, we had a tour in film studios, where game of thrones, Gladiator, the mummy etc. were filmed and we visited nommads living in caves in the mountains. The guide was very friendly and knew how to treat western folks, such that we had time on our own, but also gained some interesting insights, when he pointed out cultural and other Maroccan specific background information. Overall I would recommend to everyone interested in travelling to book a tour with those guys. One more thing: the contact before our tour was very easy, friendly and reliable. I could just write messages in WhatsApp and seconds later, I already got an answer."
        }, 
        {
            "index": 80, 
            "rating": "5", 
            "review": "The Road Less Travelled Trip- Marrakech to Fes *Amazing!!. We just returned from a 10 day adventure in Morocco and had the most amazing time! We spend the first 5 days with Ali, our wonderful guide from Morocco Active Adventures. Joussef was an excellent resource prior to our trip, finding the best itinerary for us. From the moment Ali picked us up from our Riad, we felt at ease and were able to sit back and enjoy the grand adventure. We stayed in great places, ate delicious food, helped nomads water their goats in the middle of the desert, heard amazing stories and music and felt a part of the Moroccan family. I cannot say enough good things about this company. Ali was open to all of our questions and always had a great attitude. We have the coolest pictures and many treasured memories from our time in the desert! Definitely would recommend to anyone!"
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "Abdul is the best tour guide. I booked their package tour from Marrakech airport to Sahara desert(5day trip). My driver/guide was amazingly knowledgable about Morocco, Berber culture and made the whole experience quite relaxing and safe. The tour seems a bit expensive, but is well worth the money and If you are looking to experience real Morocco, look no further than this tour!"
        }, 
        {
            "index": 82, 
            "rating": "5", 
            "review": "Day trip to Atlas Mountains. Just back from Marrakech for a short time and have great time in this amazing country. During our stay we had the contact with Joussef via whatsapp(during 10min) and booked a day trip to the Mountains with different activities including camel ride, donkeys, hiking and ATVs with great lunch in a Berber traditional house."
        }, 
        {
            "index": 83, 
            "rating": "5", 
            "review": "Excellent Day Tour. Brilliant day excursion with so many activities. Our guides (Yousef and Ani - hope I got the spelling correct!) were really nice with great senses of humour. Highly recommended."
        }, 
        {
            "index": 84, 
            "rating": "5", 
            "review": "Lifetime experience. This is the most fun I have had for a long time, it's a fantastic way to see the real country. Our tour guide was helpful, knowledgeable and fun. We really enjoyed it. Something different."
        }, 
        {
            "index": 85, 
            "rating": "5", 
            "review": "Awesome trip to Merzouga desert. We've had the MOST AMAZING experience in our life guided by Mohamed from Active Adventures.\nThe tour was for my birthday and we had great hike, amazing night in desert with a camel ride and the next day an active adventure with quad biking. Highly recommended!"
        }, 
        {
            "index": 86, 
            "rating": "5", 
            "review": "Best family Sahara adventure. I want to recommend the 4day trip to Sahara to everyone coming to Morocco with kids. My experience with Morocco Active Adventures was just amazing! Safety is their priority, but fun is a close second! Beautiful landscape, good food, great service, funny tour guide. Highly recommend!"
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "Desert quad experience. We did the quad bike activity with our three teenagers, totally fun and Excellent value for money. 100% satisfied."
        }, 
        {
            "index": 88, 
            "rating": "5", 
            "review": "Incredible experience all wrapped in one!. We took the 1-day tour out of Marrakech and it was incredible! My husband and I spent 3 days in Marrakech and this was the best day trip to experience what was outside the walls. Our driver met us in the lobby of our Riad at 8am and drove us about 30 minutes outside of the city where we had breakfast (tea and homemade bread with honey, butter and oil) with a local family. We got back in the car and stopped for a quick 15 minute camel ride (great photo opp). After that we had the option to ride a mule or hike to a nearby waterfall - my husband hiked wit the guide and I rode the mule. After the waterfall we rode mules to another local village and had lunch overlooking the town. View was amazing and the food was delicious. We drove for a while and then stopped to ride quads for an hour or so. The quad guide invited us to tea before going back to the car. Overall, it was an incredible to experience so much culture in one day. It was adventurous but not overwhelming; the guide really caters to each personality. No place we went felt like a tourist trap. Very authentic and I would highly recommend!!"
        }, 
        {
            "index": 89, 
            "rating": "5", 
            "review": "Absolutely amazing!!!!. If you want to experience the real Morocco and do some soft adventures, this company is your place!! Our driver(guide) was very knowledgeable about the area we visited. The hike in Todra Gorges was wonderful with great views to reach the nomadic family in the cave. Our deseert overnight was the highlight of our trip in Morocco. Would highly recommend it for those looking for an adventure."
        }, 
        {
            "index": 90, 
            "rating": "5", 
            "review": "Morocco family adventure tour. We booked Morocco Active Adventures for a tour starting from Marrakech to Atlas Mountains and Sahara Desert. It was an adventure of a lifetime with different activities: Hiking in the Valleys, rock climbing in gorge and 4whelers in Sahara desert with a camel ride to the Berber camping. Our guide, did an excellent job and we really appreciated his insights on the historical context during the drive. We will recommend Morocco Active Adventures to anyone we know going to Morocco. Enjoy your trip!"
        }, 
        {
            "index": 91, 
            "rating": "5", 
            "review": "A one in a lifetime experience!!. We did a four days three nights tour from Marrakech. It was absolutely amazing! Not only did we get engaged in the most romantic setting you can imagine (after a camel ride on top of a sanddune in the desert during sunset), but our guide Abdul made sure we had a one in a lifetime experience!He picked us up from our Riad in the morning and from the very first moment we liked his positive aura. He is very educated and talks very passionately about Morocco. It was such a pleasure listening to him, he taught us a lot about the Berber culture and all the places we visited. He was very caring, making sure we always had enough to drink in the car, or offered to stop the car for taking pictures or bathroom breaks. He always gave 110 percent, explained everything very well and we immediately felt like as if a friend was showing us around. Besides being the absolute best tour guide you can wish for, Abdul is also a gifted musician. He played the most beautiful songs for us while driving through this breathtaking scenery. Every time we listen to one of his songs now, we only need to close our eyes and we see all of those magical places again in our minds: the High Atlas, Kasbah Ait Ben Haddou,Kella Mgauna, Dades valley, Dades gorge, Tinerhit, Erfoud, Risani, Ouarzazate, Erg Chebbi, Alnif, Draa Valley etc... Probably the best part of the tour besides experiencing the width of this magnificent country was staying in a camp in the desert and sleeping in a Berber tent. The people in the camp were incredibly welcoming and went out of their way to celebrate our engagement with us. After dinner, they even surprised us with a song and a big cake with our names on it! Thank you guys, this memory will always be in our hearts and we promise that we will come back to the desert!Abdul and Joussef both made sure that we would get to the desert before the sunset and we want to thank you again for how wonderful you treated us! We felt very special! Abdul stayed with us for a while in the camp, he played different instruments with us and sang beautiful songs with his amazing voice, we simply loved it! Sleeping in the tents was super comfortable, they provided plenty of blankets, we didn't even need them all. We were surprised by the bathrooms in the camp, it made everything feel pretty luxurious. We would recommend anyone who is interested in learning more about the country and the rich culture of the Tamazight to book a tour and ask for Abdul (his English is great!). The booking process needs to be mentioned too. Joussef made everything very easy, he responded quickly via Whatsapp to our questions. They are real pros and we will definitely come back for another tour! We are so grateful for this experience and feel like we have found a true friend in Abdul."
        }, 
        {
            "index": 92, 
            "rating": "5", 
            "review": "Fantastic day out from Marrakech! A must do trip!. We visited Marrakech for a week in January and took a day trip to the Atlas Mountains with Morocco Active adventures. It was the highlight of our trip! We were picked up by Ali who was an extremely knowledgeable and helpful guide. The mountain areas were fascinating...so different from the bustle of Marrakech. Great scenery and really interesting seeing the Berber villages and houses. The lunch and mint tea stops were excellent.We just loved the donkey ride to the waterfall then up to the village. It was great fun. Finished with a very peaceful camel ride with no one else in sight, then upped the adrenaline with some quad biking. All great fun and definitely a must do trip! Thanks Ali!"
        }, 
        {
            "index": 93, 
            "rating": "5", 
            "review": "Excellent tour . Highly recommend this operator. We were treated very well. Our guides were very nice and the experience was very authentic. The cost of the trip is completely justified. Great experience guaranteed."
        }, 
        {
            "index": 94, 
            "rating": "5", 
            "review": "Quality Tour. We booked a 3 days tour to the Sahara and spent NYE in a tent amidst huge sand dunes, which was an unforgettable experience. Thanks to our guide Ali who picked us up at our riad and who drove safely and explained everything in detail in perfect English it was an ace tour. He stopped wherever we wanted and we never felt anxious or uncomfortable, not even near the Algerian border. The camp in the desert was organised very well. We had a great vegetarian dinner there. We even had some tea at a nomad family's tent. After 2 and a half days our guide dropped us in Fes. It was definitely worth the money. If you prefer quality tours to cheap mass tours, this is the right tour provider!"
        }, 
        {
            "index": 95, 
            "rating": "5", 
            "review": "Excellent Tour. We visited Marrakesh with a group of 10 for a view days. On one of these days we took a tour of the Atlas Mountains with Morocco Active Adventures.The tour was first class! The two tour guides were fantastic, the activities were amazing and the food was excellent! I would book another tour with these guys in a heartbeat. Absolutely class!"
        }, 
        {
            "index": 96, 
            "rating": "5", 
            "review": "Superb. An amazing trip including camel ride, mule ride to a waterfall and quad biking. This was the highlight of our stay in Morocco! Picked up early by Ali our guide who was excellent! He stopped when ever we wanted to take a photo and was really informative on Moroccan culture. The highlight of the day was eating the freshly prepared food and drinking mint tea in the traditional Berber houses! The whole trip lasted around 10 hours. Comfy walking shoes a must!"
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "Excellent day trip. We organised our Atlas Mountains day trip before our visit to Marrakech as we knew we would need a break from the intensity of the city. the great reviews on this site. Our driver Ali picked us up from our Riad on time, and we proceeded to the mountains. He was very knowledgeable with excellent English and a good sense of humour! He let us stop the car for any photo opportunities and also took some great photos of our adventures camel and mule riding, and quad biking. Breakfast and lunch in a traditional Berber village house was a great experience and the food was delicious, with awesome views! Definitely recommended, and worth the money, even if it may seem expensive to begin with. It was a shame we didn't have the time or money to do one of their other trips, but we definitely will if we ever return!"
        }, 
        {
            "index": 98, 
            "rating": "5", 
            "review": "If you have a short trip to Marrakech, invest a day with these guys!. My group of 10 friends were in Marrakech for just 3 days but really wanted to see the Atlas Mountains so we decided to do the Active Atlas Mountain tour. It was an amazing, jam-packed day and every single one of us had a fantastic time. We felt like we saw all of the mountains by the end of the day, rode camels, went hiking, quad-biking through the desert at sunset, had gorgeous food and met some really lovely people. The mule ride was a surprising highlight for me as it was really peaceful! The tour guides Ani and Yussef really made it though, they were great fun and really knowledgeable, so much so that we'd all like to come back and do one of the longer tours! It was well worth the time and money and turned our Moroccan holiday from a good one to a great one."
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "Amazing Desert Trip. I had the most amazing holiday with Morocco Active Adventures during my stay in Marrakech. Our guides were very helpfull and knew everything we wanted to know. We saw all the major attractions and met great people on the trip. The contact were very easy(via WhatsApp) then a small deposit via PayPal.We will definately recommend Morocco Active Adevntures and will also come back to Morocco for sure."
        }, 
        {
            "index": 100, 
            "rating": "5", 
            "review": "Once in a lifetime, must-do experience!. My friends and I did the 4 day, 3 night tour from Marrakesh to Fes. This was a great way to experience the culture, meet some wonderful people, and enjoy the beauty of the Sahara Desert, in a cost-effective, stress-free manner. During the 4 days, we experienced a variety of activities and scenic views, as well as plenty of delicious food. The accommodations were comfortable, and everything just seemed to work out smoothly (such as arriving at the dunes at the perfect time for the sunset). Merzouga was a highlight of the tour, in the heart of the Sahara Desert. We had plenty of time to enjoy the dunes, and even took a camel ride to a campsite where we stayed in Berber tents and enjoyed traditional food, music, and breathtaking views of stars. Youssef B. was our guide and did an exceptional job. He made things very comfortable and safe. He was extremely knowledgeable about the culture and the different sites and experiences we had and it felt like he tailored the tour for us. He answered all of our questions and there was no question that we couldn't ask. We enjoyed laughing with him and learning about the culture. I will definitely recommend this to others and hope to make it back one day!"
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "A must do in Marrekech!. After a couple of days in the souks this is such a welcome relief. This trip was amazing from start to finish. We did the Atlas mountains with lunch in a Berber village. Our guide was informative, funny and helpful and the scenery was fabulous. A real photo opportunity for anyone."
        }, 
        {
            "index": 102, 
            "rating": "5", 
            "review": "Great day with the locals. First I was amazed about how professional they are , our driver was outside our villa on time, They communicate with you earlier to confirm everything in advance.The tour start with local breakfast and small trip to the village. You will live a full day with local and experts the tour will show you how the real life goes on on Marrakesh and make you part of it.Bring a snickers shoes, The hiking road is kind smelly with all the donkey moving around but once you skip that awful tight road the open space is much cleaner and greater view. I highly recommend"
        }, 
        {
            "index": 103, 
            "rating": "5", 
            "review": "Must do when visiting Marocco. This day trip was really the cherry on top of our Morocco cake! You get your own private driver, ours was Youssef and he was absolutely amazing. He knew everything about the Moroccan culture, landscape and people and was very friendly and fun. We laughed a lot that day! During the day you get to do different activities, such as donkey riding (my favourite!), camelriding, quad bike riding and you meet two different Berber families. And the drive through the Moroccan mountains and nature is absolutely a relief from the busy Marrakech. You get to see such a different side of Morocco, which is really amazing. Thanks Youssef for all your help, friendliness and laughter. This trip really made our Morocco trip!"
        }, 
        {
            "index": 104, 
            "rating": "5", 
            "review": "Incredible!. My friend and I had the most amazing time on our week long Adventure tour, filled with non-stop smiling, laughter and fun. All correspondence prior to the trip was prompt and efficient and the tour was tailored to exactly what we wanted with no issue at all. Our host was great, extremely knowledgeable, adaptable, accommodating and just a load of fun. The tour is great value for money, worth absolutely every penny. Absolutely all elements of the tour were organised for us, a completely stress free trip for us! All accommodation we stayed in was far beyond our expectations and we most definitely never went hungry! As 2 young girls travelling alone our families had some concerns prior to the trip but not once did either of us feel even remotely unsafe. The experiences (like rock climbing, donkey and camel riding, quad biking, visiting a local family in their home a cave on the side of a cliff etc) were out of this world, things we'd never dreamed of doing! Would 110% recommend this tour group to anyone thinking about a trip to Morocco."
        }, 
        {
            "index": 105, 
            "rating": "5", 
            "review": "A must do when in Marrakech.... We did the 1 day Atlas mountain trip which was fantastic, well worth the money and was the highlight of our trip to Morocco, I would definitely recommend this .Looking forward to our next visit."
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "A wonderfully organised genuine experience - couldn't be bettered. As a maturish/ish active couple, we don't usually do 'organised' travel, but on a short three day break to Marrakech, we looked and saw Morocco Active Adventures and emailed/booked a full day trip to the Atlas mountains. The best decision ever!! Mohamed was brilliant with the pre and after email organisation, and our guide for the day, Abdul, was just amazing. Just us two, every single part of the day, the five different activities and people involved, were superb. Abdul was engaging, thoughtful and told us so much about the history of Morocco and the Berber people.We had a wonderful breakfast with a Berber family which felt like genuine hospitality, followed by a camel ride, a 3 hour mule trek up through several Berber mountain villages to a lunch with another family, onto a small trek to a waterfall, then back to the car and a drive back down from the mountains to an hours quad biking in the desert and a spectacular sunset. Every part of the 'team' really made sure we were enjoying our experience.... no expectation of tips. But my tip, would be to make sure you do have some cash on hand because we genuinely felt that Mohamed made sure to use small family groups to benefit both parties, a little extra for them ...... and a huge privilege for us. I wish I'd had a bit more cash, and I'd have loved to have had a few very little bits for the children we saw, happily playing with spinning tops. Absolutely not necessary nor expected....but we got so much from the day.We are already planning to go back to Morocco, to try another Morocco Active Adventure"
        }, 
        {
            "index": 107, 
            "rating": "5", 
            "review": "What a tour!!!!!. What can i say?....AMAZING!!!!I booked All Trails Day Tour in advanced and liaised with the manager Joussef. From the first email i felt reassured and comfortable with thia company. Paid a small deposit to secure my booking via PayPal.My partner and I did a one day tour visiting the Atlas mountain and Berber Village, Quad biking, mule and camel rides. Had a fantastic tour guide and conversation kept flowing...this was one of the best excursion i have ever done. Most importantly, the highlight of my Marrakech trip.My advice to othera: do where comfortable hiking boots/walking shoes, bring wet wipes and a bottle of water. If you need something do not be afraid to ask the tour guide...they will make a pit stop etc.A big big big thank you to everyone at All Trails Tour. I will be booking through this company again when i visit other cities in Morocco.I highly recommend this company."
        }, 
        {
            "index": 108, 
            "rating": "5", 
            "review": "Wonderful trip with Morocco Active. Have just back from our trip from Marrakech and Sahara desert. We booked a day trip with Morocco Active Adventures to Atlas Mountains. The booking was very easy via WhatsApp with Mohamed, then we sent a deposit via Paypal. The trip to Atlas Mountains including different activities such as camel riding, mules, hiking, lunch with a Berber family then quad biking in rocky desert. Thank you so much for this amazing trip."
        }, 
        {
            "index": 109, 
            "rating": "5", 
            "review": "Family tour with Morocco Active Adventures. Our family had a highly enjoyable and informative tour with Mohamed as our guide. We were looking for an option for private tours rather than joining group tours that were offered through the travel agency I used to book the trip, and so glad that we made this decision! Our driver was great with very good English. If you are looking for something slightly different to your family tour then I definitely recommend you get hold of them for the Sahara Tour, you won't regret it!!"
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "Great day tour. Just back from our trip in Morocco and Active Atlas Mountains was one of our highlight in Morocco. All Trails Tours was great, very easy to book the tour via email amd next day Mohamed picked up us at the hotel on time.Thanks again."
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "Amazing tour. Great morning out. Yusef was a great guide with the right balance of safety and adventure, friendly guide and very knowledgeable. I would definitely recommend it to anyone looking for fun, challenge, exhilaration and lots of laughter!!"
        }, 
        {
            "index": 112, 
            "rating": "5", 
            "review": "A must do in Morocco. My sister and I had a four day desert trip including a full day desert quad biking tour and absolutely loved it. Mohamed was a great guide and the scenery was breathtaking. It will take alot to beat this quad biking safari. We definitely recommend Morocco Active Adventures for your safari in Morocco."
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "1 day tour with Ali. My husband and I booked a 1 day atlas mountain adventure tour with All Trails Day tours online from the USA prior to our trip to Marrakesh. We had friendly and easy contact arranging and paying for the tour with Youssef via email. On the day of our tour Ali our tour guide picked us up from our Riad and spent the whole day talking to us about the Moroccan way of life. We did the camel riding, quad bikes, mule ride to the waterfall but the most interesting part for us was learning about how the Beber people live and visiting homes for tea and lunch. Thank you to Ali for giving us such a great experience,"
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "Amazing Tour with an Amazing Tour Guide. So we chose the 3 day private tour from Marakech to the far Desert and back. Day 1: Picked us up at hotel and drove through the mountains which were beuatiful, then visited a famous/awesome Kasbah where we had lunch. Then continued through the country stopping a few times and then arrived at our hotel for the night. Day 2: Left hotel in morning and then visited an awesome Gorge, Oasis, and town. Absolutly stunning scenery. Also had the opporutunity to visit a nomad family who lived in the mountain side (amazing experience), then continued on visiting ancient desert water wells and a fossil processing plant. Lastly dropped off at the edge of the true desert for the camel ride. This was the highlight of the trip and was surreal. Camped overnight in the desert and looked at the stars for hours among the dunes after a great dinner and music. Day 3: Left on the camels right at Sunrise and got back to hotel, then a lot of driving back to Marrakech. Overall a near perfect Moroccan adventure among out of this world/time scenery. One of the most important aspects of this was our tour guide. He made the vacation/tour unforgettable instead of merely great. Was extremely intelligent, spoke English well, passionate about his country/culture, and was really friendly. Helpful in every way. If you are an English speaker make sure you request Abdul!"
        }, 
        {
            "index": 115, 
            "rating": "5", 
            "review": "A life changing experience!. We took the all day tour to the Atlas Mountains. This was an amazing experience. The entire day was filled with exiting things to do and see. But the best part of the tour was getting to know great people and a new culture. We were welcomed in the home of 2 Berber families for lunch and tea. We had a wonderful time with our guide, Ali. After the tour is over, you will look back and remember this day as one of the best experiences in your life!"
        }, 
        {
            "index": 116, 
            "rating": "5", 
            "review": "Loved every minute!. Took the 3 day tour, Marrakech - Merzouga/Erg Chebbi - Marrakech. Youssef picked us up from our hotel, and showed the time of our lives! He is an amazing driver and an awesome tour guide. I hope you like off roading and going off the beaten path. We started our trip off seeing the mountains, the gorge was spectacular and met a family of nomads that lived in a cave. They invited us to their home and we all had tea. Everyone we came across was friendly and welcoming, I learned so much about Morrocco and the culture. You'll be eating real Moroccan food, it's yummy! If you're looking for a unique adventure this is it. I highly recommend it. The food and accommodations were amazing, stayed at the Xaluca dades hotel we received a royal welcome of singing at the entrance. Not expected at all! Driving through the desert was amazing but the camel ride was into the desert was the best! After the camel ride you enter a camp site in the middle of what appeared to be nowhere. Don't worry, there is a washroom. We shared the camp site, with a small group of tourists. The stars at night were stunning. The Berber music really set tone for the evening. You'll be able to see some animals, mostly cats, I saw a bat and mouse prints in the sand. Best trip of all time! I would go back in a heart beat. Thank you Youssef!"
        }, 
        {
            "index": 117, 
            "rating": "5", 
            "review": "An Amazing Experience. We had an amazing tour of Morocco. We chose the four day desert tour, and everything went smoothly, from booking to being picked up at our riad in Marrakech. Our guide was Youssef, who was amazing. He had many interesting stories to tell us about the culture of Morocco. Highlights were Todgha Gorge, and the sand dunes at Merzouga, which we crossed by camels and camped at overnight. I would recommend this to anyone visiting Morocco."
        }, 
        {
            "index": 118, 
            "rating": "5", 
            "review": "Adventure atlas mountain trip. We had an amazing day with our guide Hassan and driver Mohammed. They picked us up from the hotel and took us out first for a camel ride, then we went to a local house for tea and breakfast. I am a beginner photographer and Hassan knew all the best spots for photos and took plenty of pictures of us too. Then up to the mountains on the mules which was my favourite part of the trip. We finished the day with quad biking. I would recommend this trip to anyone, it was real value for money, Hassan was friendly and knowledgable. We felt safe in Mohammed's hands, he even had to tackle a rock slide. Communication was wash via whatsapp. If we return to Morocco we will definitely be booking another excursion."
        }, 
        {
            "index": 119, 
            "rating": "5", 
            "review": "Day trip to Atlas Mountains, with Camels, mules and quad bikes. We are six middle age friends from Surrey. We booked the one day Atlas mountain tour and had a fantastic day.Ali our driver was excellent, from camel rides, to mules up to the waterfall and lunch with a Berber family and afternoon evening creating sand storms driving quad bikes across the desert. All of it was excellent.Thanks Ali and thank you All Trails Tours"
        }, 
        {
            "index": 120, 
            "rating": "5", 
            "review": "Brilliant. I had the most fun on this trip. Singing in the dessert and drinking mint tea! It was a really relaxing day and good to do something different."
        }, 
        {
            "index": 121, 
            "rating": "5", 
            "review": "2 Day Tour in Atlas Mountains. I searched a lot of different tour operators before choosing this company and I am so glad I did. All the reviews so far are spot on, you can't go wrong booking with these! I traveled to Marrakesh with 3 other girls (in our 30's) for a week in Sept and we wanted to experience more than just the city life, but we only had a couple of days to spare.Morrocco Active Adventures came up with the perfect package for us, ticking all the boxes....camel ride, hiking, waterfalls, experiencing Berber culture and quad biking spread over 2 days.Our wonderful guide Abdul picked us up at our hotel on time, in a comfortable jeep to start our adventure! Abdul entertained us while we made our way to the Atlas Mountains. He gave us really good insight to Berber culture and Morocco in general, it was really interesting! We were able to have a laugh with him too, which added to the overall experience.We stopped to do the Camel ride first, which was good fun. It was the first time for me so it was a novelty and the guide that took us up the track was really friendly. You can take pictures as you please and you don't feel under pressure to tip.Abdul then took us on to our next stop which was a traditional Berber family home. We were shown around the house met the family, they were so nice. The grandmother showed us how to make a proper sweet mint tea and gave us freshly baked bread with local preserves etc. I also got some Henna done by the young girl in the family. All the time Abdul was translating from Berber to English and we were able to interact with the family. It was a really humble experience. The Atlas Mountains are beautiful, especially in the valleys. We arrived in a village, where we went on a short hike to some waterfalls. Our guide was really sound, he didn't rush us, we could stop and take photos and rest when we needed to. It was really enjoyable.Abdul then met us again and drove us to the next village we would stay for the night. We got our evening meal in another traditional Berber house, in the middle of the mountains where we saw the sunset and had a gorgeous lamb tagine cooked by the family. It was so tasty! We learned some Berber words! That night we stayed in a small hostel down the road, pretty basic. 1 room with 4 single beds, shower facilities. It did the job, don't expect luxury! :) We had fresh pancakes and mint tea in the morning before we set off to do our 4hour hike around the mountains. Our guide was a young local Berber lad, who knew the area very well. His English wasn't amazing, but he got his message across. It was a nice temperature for hiking, not too hot. The scenery is beautiful, very diverse and hard to believe the dessert is only a few hours away!We arrived at another village where we got our lunch served at a local restaurant along the river. Don't expect amazing food here....it's in the middle of the mountains! Before we set off we got a mule ride through the village in these narrow streets, it was a lot of fun! The locals were so nice and welcoming. Our last stop was the quad biking, it was brilliant! Great track where got to let rip but they were still very safety conscience. They took pictures in the middle of it. You will get dirty.....as it is all sand and dust, but I would recommend it if you like a bit of speed!We got dropped back to our hotel that evening after a fantastic adventure! I would highly recommend this tour company to anyone! It was extremely good value for everything we got and I couldn't say more positive things about our guide Abdul!"
        }, 
        {
            "index": 122, 
            "rating": "5", 
            "review": "THE option if you're visiting Marrakesh and the desert. My wife and I went from México to Marrakesh in September 2015 and hire \"All Trail day Tours\". At the beginning we weren't very sure about our choice because there are many agencies offering similar services, however it worth every Euro, believe me. We hire the private tour from Marrakesh to the Merzouga desert, our driver Mohammed made the trip really interesting and fun. It was very valuable that Mohammed was completely flexible to stop every time we wanted for a picture or to rest and go to the bathroom. The restaurants and hotels along the trip are very good options because you don't miss a typical meal or you get to stay in beautiful Riads without compromising your comfort or safety. The all wheel drive van was confortable and had all the equipment to enjoy the trip AC, seat belts, nice seats, etc. While in the road we had the opportunity to visit the \"Atlas\" film studios,Todra Gorges, Dades Valley, some local markets and obviously the Merzouga desert experience and camping was amazing! When we got back to Marrakesh the company provide us a local guide called Aziza which was very friendly and knew a lot about the surroundings. Definitely a very good experience I recommend and would take again if possible."
        }, 
        {
            "index": 123, 
            "rating": "5", 
            "review": "camel rides. this is a very fun way to get into nature with the family and also be with animals that are friendly and able to get you where you need to go safely"
        }, 
        {
            "index": 124, 
            "rating": "5", 
            "review": "Some of the best three days of my travelling adventures so far!. We - two girls in our mid twenties - spent three days with Youssef (tourguide and driver). From the minute Youssef picked us up from our Riad we had a great time. There's a lot of driving involved, especially as we asked to head back to Marrakech rather than Fez - but the sights along the way, the continuous information from Youssef and the stops for photos were just amazing. My favourite night was the first night in the budget Riad (very authentic and bit like staying at your Moroccan grandparent's house - very homely, warm and colourfully decorated). The view across the valley was just indescribable - it certainly didn't seem like a cheaper option. My friend's highlight was the following night in the desert. We rode camels in, had a go at sand boarding and then literally slept under the stars, before quad biking across the dunes the following morning. It appeared Youssef purposefully avoided tourist spots where possible, we asked to eat lunch in authentic places so that's where he took us and it seemed like we got to see some of the real Morocco. Three days together could push anyone's limits but the three of us didn't stop laughing and Youssef felt like a good friend rather than a tour guide. We were initially concerned about the price, but honestly, it was worth every penny. It's a lot to do/travel in 3 days which was fine for us but probably a bit too much for young kids so I would say do it over a longer time period.The only thing that could have made it any better would have been setting off on the camels maybe a bit earlier so we could have got more sandboarding in before dark.If you do anything in Morocco, do this tour! We have holiday blues from this excursion alone."
        }, 
        {
            "index": 125, 
            "rating": "5", 
            "review": "Great day tour. Having a short time in Marrakech, we took a day tour in the Atlas mountains. Our guide and driver were so friendly all day by giving us water and taking photos. We ride camels, mules and did an hour of quad, in the middle of the real Morocco. A must do for people that wants to discover outside of the city"
        }, 
        {
            "index": 126, 
            "rating": "5", 
            "review": "Amazing one-day desert adventure!!. We chose the two-day one-night trip to Zagoura desert. The desert adventure is a great experience, very interesting and well organized. Youseff is a great guide, cordial, talkative and very knowledgeable. The camp site was comfortable and had all the necessary amenities such as shower, toilets, and wonderful food. In the morning we were woken up early to enjoy the beautiful sunrise, which was lovely. If you don't have too much time, but want to enjoy a break from Marrakech, this is a very good choice!"
        }, 
        {
            "index": 127, 
            "rating": "5", 
            "review": "An incredible day in the mountains, Suhkran!!. All Trains Tours definitely deserves five stars! This was our first time in Marocco and we decided to do the day excursion to Atlas Mountains to get away from the hectic life of Marrakech. We never expected to see and do so much in just one day; ride camels and mules, visit traditional Berber houses to drink tea and have lunch, hiking to a waterfall and a ride on a quad bike. There is something to enjoy for everybody!We were lucky to be one of the very few tourists that day, which gave us the opportunity to get a great impression of how the Berbers live in the mountains. Not to mention the detailed an abundant information of our incredible guide, Joussef, who definitely took part in making this trip unforgettable. He clearly enjoyed teaching us more about his country and traditions, and he took the time to answer all our questions.This day was undoubtedly the highlight of our vacation, and was worth every euro we paid. On our next trip to Marocco; another great excursion and the same guide please!"
        }, 
        {
            "index": 128, 
            "rating": "5", 
            "review": "Best Trip! Must do while in Marrakech. This day tour was amazing. Hassan and Ali were the best. Everything you could possibly want to do was done on this tour. Also best food on my trip"
        }, 
        {
            "index": 129, 
            "rating": "5", 
            "review": "Great camel trek up the Atlas mountains. We went on a day trip which included a camel trek up the Atlas mountains, great guide and a real fun day out!"
        }, 
        {
            "index": 130, 
            "rating": "5", 
            "review": "Memorable Experience with All Trails Day Tours. I found it quite overbearing the amount of tour companies on offer both on TripAdvisor and in Marrakech. I wanted to organise a day trip for my mum and I, quickly and without any fuss or bargaining involved. I came across All Trail Tours online and found a whatsapp contact for Youssef. Within 15 minutes of sending a message I was able to organise a personalised and private tour that suited both my mum and I, for the NEXT day. It was such a wonderful and memorable experience and we had a fantastic and knowledgeable and kind tour guide accompanied with a very safe driver who gave us a day to remember in and around the Atlas Mountains. Without a doubt, I would highly recommend booking a trip through All Trails!"
        }, 
        {
            "index": 131, 
            "rating": "5", 
            "review": "Beautiful experience. Booked a 3 day trip through the riad where we stayed first night in Marrakesh.\nUnforgottable experiance. Travelling through the Atlas Mountains, ending up in Sahara was one of the most beautiful experiences.\nSleeping in the tentunder the clear sky in Sahar is just breathtaking!never will forget this trip."
        }, 
        {
            "index": 132, 
            "rating": "5", 
            "review": "Amazing!!!. I went with 2 other friends and we had a amazing time. I would recommend Youseff he was brilliant in every way possible he was very accomadating and helpful and gave us the best time we could have had. The trip was so much more enjoyable when you know you can communicate well with Youseff and he made us laugh through out our trip. We will never forget marrakkesh and we will never forget Youseff he was the best!!!!!"
        }, 
        {
            "index": 133, 
            "rating": "5", 
            "review": "AMAZING TIME!!! Best tour guide in Marrakech!!. We went as 3 girls, so we wanted adventure, we were up for anything lol our tour guide was yousaf, he understood us all, and knew exactly what we wanted to do, he organised 2 days for us, and we couldn't have done it better ourselves!! we all REALLY enjoyed the activities, especially the camal ride! Yousaf was an amazing tour guide, he understood all our needs, he never rushed us, and gave us enough time to do things in our own time, his car was fully air conditioned, and he always stopped for our cigarette breaks lol there was no problem with English because he spoke it fluently. Thank you yousaf for an amazing and unforgettable time in Marrakech!!!! We couldn't have done it without you!!!!!"
        }, 
        {
            "index": 134, 
            "rating": "5", 
            "review": "3 day trip to Merzouga. On the first week of august-2015, I book a 3 day trip to Merzouga; before the booking, the Travel agency was dedicated to attend all of my questions and not-very usual requests (i.e. to do the 3 day trip in 2.5 days, with pick up and drop off at the airport). The driver, who also was my guide, Mr Youssef Bani was simply great; he spokes 5 o 6 languages fluently, excellent driver and most important, friendly and respectful; I strongly recommend both the agency and the guide, they are very helpful and will take good care of all your travel needs, from finding a good place to eat, buy, sightseeing, etc.."
        }, 
        {
            "index": 135, 
            "rating": "5", 
            "review": "Just Perfect. It was absolutely amazing from start to finish and the staff were very friendly.We spent 5days in tour including 2day quad bikes driving from amazing ocean of sand dunes to a Oasis. We went off road which was a dusty, adrenalin pumping experience and ended up in our hotel in Merzouga village. In my opinion it's the best way to see some amazing sights even with very short time. Will definitely return when we next go to Morocco with more time!! Overall, would recommend for a fun trip!"
        }, 
        {
            "index": 136, 
            "rating": "3", 
            "review": "Great day with a few problems. We have given this a 3 star as although we had a great day there were definitely a few problems.Pick up was on time and a good, new, comfortable car, the driver/guide (don't know if he was a guide or not) was good and very friendly.When we got to the waterfalls however he just pointed at a path and said follow that down to the waterfall, we followed this path which stopped and you had to go down the hill with no clear paths. We got lost for over an hour in the 40 degrees heat which was obviously not ideal, other people were with guides on their separate tours (they all weren't heading to the waterfall so we couldn't follow one) and it was hard for them to direct through these woods we were heading through. We eventually turned around and made it back to the start point and then headed down the hill on the other way \"the exit\" route from the waterfalls down the steps and past the shops.We eventually made it down and found our driver/(guide?) at the bottom waiting for us. We were not happy at this point however he redeemed the day by paying for our boat trip under the waterfall and also by reserving us, in or opinion, the best seat in the best cafe for our lunch.The waterfall was a great thing to say however it was Moroccan school holidays and it was full of kids jumping in the water which rendered the water a horrible brown colour at the bottom, we know from a family members previous trip that at different times of the year the water was very clear and attractive. This is not the tour operators fault though of course. We would have scored this a 5 had we not just been pointed in a direction and sent off on our own. This was not acceptable in our opinion."
        }, 
        {
            "index": 137, 
            "rating": "5", 
            "review": "Astounding tour with incredible people. As two young women traveling alone, we took a lot of care selecting a tour company and are so glad we settled on MAA. Our guide, Youssef (also known as José) was out of this world. We felt not just cared for but like we were truly friends. Our four-day, three-night tour took us through Dades Valley, Merzouga, the Sahara, and Ouzazarte. We were picked up from and delivered back to our Riad in Marrakech. We got to ride camels, have tons of tea with locals, go on an exciting hike through the gorge, chat with Berbers and learn some of the language, play with a ton of adorable babies (Youssef is the world's best baby playmate), get henna in a local home, and, of course, ride camels and watch sunrise and sunset over the sand dunes. But more important than all of these \"active adventures\" (harhar) was the sense of the \"authentic\" Morocco, which we got from visiting donkey parking, eating local dates, and most of all, talking with Youssef. He is a fount of information and is so passionate about his country and people. This sense of cultural exchange was exactly what we were looking for but hard to find in reviews - so if this is what you're seeking, a real dive into what Morocco means to Morrocans, then MAA is the place for you.The entire team went above and beyond in terms of caring for us. Some of the examples I won't even say because others should not expect them - we certainly didn't - but, for example, they helped out tremendously when we were having bank problems, catered generously and attentively to a gluten intolerance, and generally went above and beyond to make us feel safe and cared for. This adventure is what made Morocco and the whole trip for my friend and me. We would do it again a hundred times, and encourage you to do so! It's outstanding and worth it."
        }, 
        {
            "index": 138, 
            "rating": "5", 
            "review": "excellence. My husband and I returned from Morrocco changed people the care and fastidious attention to our needs could not have been more perfect. Our guide was incredibly knowledgable. He had an amazing sense of our travel and life experience and matched it perfectly when we asked him advice about what to do and see while in Marrakkech. I cant say enough about how perfect this trip was thanks to this travel company."
        }, 
        {
            "index": 139, 
            "rating": "5", 
            "review": "Great Camel Ride, beautiful trip in Marrackek. Our 3 days tour with Ali was at the right choice. He was a very gentile and intelligent guide and processes some of the best skills to be a tour guide.The tour is not cheap but has good value. We enjoyed time riding the camels, traveling to the other side of the area, learning about local food and some interesting culture.We love the stories from Ali.Thank you all for arranging such a good trip."
        }, 
        {
            "index": 140, 
            "rating": "5", 
            "review": "Amazing guided experience!. Since there were only 3 of us, we were very careful when choosing a tour guide for our first trip to Morocco. A friend recommended us Morocco Active Adventures, and, honestly, it was the best decision we made. Our tour guide was Joussef, and you could see he loves what he does; he was very kind and respectful. Throughout the trip he became our friend; for that, we are truly thankful. It was an amazing trip; the hotels where we stayed were beautiful, and the people who worked there were very amicable and provided a magnificent service. The night at the desert camp was unforgettable and the camel rides at sunset and sunrise indescribable. Joussef is fluent in five languages, including Spanish and English, which was a big plus for us. We recommend Morocco Active Adventures to everyone, it is worth the money and it leaves you wanting to go back.Morocco is a beautiful country!Thank you again for everything Joussef,Alexandra, Jose and Estefania"
        }, 
        {
            "index": 141, 
            "rating": "5", 
            "review": "“amazing country with a wonderful guide/driver”. We Just came back from a great trip arranged by Morocco Active Adventures. From Marrakech to Fes via Erg Chebbi sand dunes, the landscapes are just amazing, Valleysm forests, mountains then sahara desert and we were welcomed by our camels in Merzouga desert. Our guide Jose is one of the best person we had in Morocco, he is very funny, friendly and knowledgeable driver guide."
        }, 
        {
            "index": 142, 
            "rating": "5", 
            "review": "Excellent off the beaten path guided tour. Abdul was our guide for the day and arrived a bit late to pick us up at the hotel, mighty apologetic for the delay because he went to the wrong hotel by accident. Anyway, he was there and we got into his car for a fabulous, adventurous journey. Abdul is personable and an excellent guide. He took us to traditional Berber homes in the Atlas mountains for breakfast and lunch and is a treasure trove of history, pop culture, philosophy, religion and anything else you may be interested in about the local area. Since we come from a place famous for skiing, we wanted to see the ski resort in the Atlas mountains. This meant a detour for Abdul from the planned route, but he did it cheerfully. There was some snow there in May which excited the children. On the way back to the hotel, we also hired quad bikes for a trip through some rugged terrain. Once again, enjoyed by the family. By the end of the day, my boys got quite attached to Abdul and were sad that the trip had come to an end. I think that is a great testament to what a superb tour it was. I would definitely recommend Morocco Active Adventures for any type of tour. There is a good reason they have nearly 100 5 star reviews. They have earned every single one of them."
        }, 
        {
            "index": 143, 
            "rating": "5", 
            "review": "Visit to Marrakech. The best tour in the world! Worth the money. 100% recommend. You will love Marrakech!! Camel ride, camping at dessert, beautiful views. The tour guide will become your friend. Everything is awesome."
        }, 
        {
            "index": 144, 
            "rating": "5", 
            "review": "Incredible tour...definitely recommend!!. Best tour experience we could have asked for. Jose was an incredible guide and became a friend, going above and beyond the job requirements to make sure we had the best experience possible. He made the car rides fun and the accommodations both nights were incredible. This tour made me want to return to Morocco and I have already recommended this tour to many friends!! Thanks for the experience of a lifetime!!!!!!!!!"
        }, 
        {
            "index": 145, 
            "rating": "5", 
            "review": "Jose is the BEST!. Jose was the best tour guide we could have asked for. Not only did he do an amazing job during the tour, but he also made sure to take care of us after the tour was over. He took us to the airport during his free time, and even made a stop at McDonalds! We hope to remain good friends with him. As for the actual tour, it was UNBELIEVABLE! The long car rides were so much fun, as Jose made sure to make it interesting along the way. We stayed in a beautiful hotel the first night and then in tents in the Sahara the second night...the tents are more like hotel rooms! Jose and the other tour guides that were in the desert with us even made a cake for one of us who had a birthday that day. Needless to say, Jose and Morocco Active Adventures are definitely the best!"
        }, 
        {
            "index": 146, 
            "rating": "5", 
            "review": "Amazing Morocco. This tour exceded all of my expectations. The sights were spectacular and the hotels we stayed at were very nice. Our guide Jose treated us very nicely and organized an amazing trip. The best part of the tour was the camel riding and spending the night at the Sahara desert. Definitely an unforgettable experience. One of my favorite trips without a doubt."
        }, 
        {
            "index": 147, 
            "rating": "5", 
            "review": "Morroco. Jose was extremely nice and helpful. The hotels and sights were very nice. The best parts were the camel rides and the Sahara desert. One of my favorite trips. Definetely worth it!"
        }, 
        {
            "index": 148, 
            "rating": "5", 
            "review": "The Significant Tour and Country Alike. Not only is Morocco inexplicably the most diverse and different place I've ever visited but the people I met and tour i went through made the experience that much better. I would have had lots of fun without the tour but I'm more than happy I went through M.A.A. because it was the best tour I've ever taken in the best country ever."
        }, 
        {
            "index": 149, 
            "rating": "5", 
            "review": "Trip of a Lifetime. I had a lot of expectations heading into Morocco, and they were all exceeded thanks to our wonderful tour guide, Youssef. My friends and I spent a day and a half in Marrakech before we were picked up by Youssef for our three day journey through the Atlas Mountains into the Sahara. The journey to the Sahara is not a short one, but Youssef somehow managed to make it feel that way with numerous entertaining stops along the way. I learned more than I ever could have imagined walking around and talking to Youssef about the different lifestyles that we encountered. Once we finally reached the desert, we quickly climbed atop our sweet camels and rode into the sunset. It was the most beautiful thing I have ever witnessed, and it was soon topped by the breathtaking sunrise we experienced the following morning. Our night spent camping out in the Sahara is one that I will never forget, many thanks to Morocco Active Adventures!"
        }, 
        {
            "index": 150, 
            "rating": "5", 
            "review": "Fantastic Experience with Morocco Active Adventures. We arranged for a 3-day private tour 5/19/15-5/21/15 starting out in Marrakech and dropping us off in Fez at the conclusion of our trip. We traveled through the High Atlas Mountains, the Todra Gorge, rode camels in the Sahara, slept in a beautiful tent out in the dessert, fed baby monkeys in cedar Forrest. It was an unforgettable experience and the highlight of our time in Morocco. We loved our tour guide Ali. He made us all feel special and took such great care of us the entire time. He was also very knowledgeable and took time to explain, inform and help us appreciate his country. I can't say enough good things about him! Thank you so much Ali! We were three women embarking on our first adventure in Morocco. Before we went we were nervous planning and thinking about things like personal safety and where we would go to the bathroom and how hot was it going to be in the dessert? We never had anything to fear. Our safety was never in question. Yes, there were bathroom stops along the way and they were always clean and what we were used to. In the dessert you had to pour water to flush the toilets but hey we were in the dessert and it was an incredible experience! The vehicle was comfortable and we had AC. The camel ride at dawn and sunset was timed for a perfect temperature outside and it was unforgettable, it helped me experience the magic of the Sahara. I have no words to describe it. It's something each person has to experience for themselves. Ali even helped arrange for a surprise birthday cake for me! It was so special. I will always remember my time in Morocco and can't wait to return. Shukran Ali and the great team at Morocco Active Adventures!"
        }, 
        {
            "index": 151, 
            "rating": "5", 
            "review": "Toubkalguide. Absolutely fabulous day out to the Atlas mountains, via visit to a local market, Argan factory, lunch and camel trek. Looked after from 9-7pm brilliantly. Thank you!"
        }, 
        {
            "index": 152, 
            "rating": "5", 
            "review": "Eye opener. Once inside the walls of the medina it is a real eye opener I'm a very well travelled person and this is amazing you will see and small things that you have never smelt before but I loved it just close your eves and listen and you will know you are some were very foreign"
        }, 
        {
            "index": 153, 
            "rating": "5", 
            "review": "10 Day Trip Around Morocco. My partner and I are very pleased with our driver and guide. He speaks very good English and took care of us for four days as we travelled from Fez to Marakesh. The hotels and tent accommodation provided by Active Adventure was first class.We are very pleased with their professional service. I would recommend them to anyone for their next travel."
        }, 
        {
            "index": 154, 
            "rating": "5", 
            "review": "Beautiful Place Beautiful People. This has been the most amazing feeling i have ever gotten from this hotel it made me feel at home and i felt like they wanted to take care of me they spent enough time to understand my needs in the industry of hunger and would love to go back when ever i get the chance to!!!!"
        }, 
        {
            "index": 155, 
            "rating": "5", 
            "review": "Lovely day trip to the Atlas Mountains. Had a lovely day with a stop to the Argan oil co-operative and to Richard Branson's kasbah, which is beautiful., our guide up the mountains Abraham was so sweet and respectful. Great day out from start to finish."
        }, 
        {
            "index": 156, 
            "rating": "5", 
            "review": "brilliant. liked it all good value for money friendly driver polite and amusing.Prompt with timing.Trip to souk an experience but you need to be wary of pick pockets although we had no problems."
        }, 
        {
            "index": 157, 
            "rating": "5", 
            "review": "Souks. Put us at ease for our first trip to the souks .booked through thomson picked up from hotel and returned.a half day tour"
        }, 
        {
            "index": 158, 
            "rating": "5", 
            "review": "Excellent DayTour. I was in two minds at first about paying more for Morocco Active Adventures than my tried and tested Riad approved excursion tour company but I didn't regret it at all.Our guide was very polite and treated us not just as a friend but as family.We stopped at a Berber Village family house where they served us fresh bread and delicious mint tea. We continued through the Ourika Valley with beautiful views. By the end of the day we were overwhelmed with his hospitality as he invited us to lunch at his own family house (not part of the service folks but we were very touched by the offer).Thank you so much. We will definitely recommend."
        }, 
        {
            "index": 159, 
            "rating": "5", 
            "review": "Amazing Tour, great guide. We had a four day tour with Idir as our driver. Ali helped us to plan things and explained exactly what to expect, and Idir was a brilliant and charming guide, and safe driver.We drove from Ouarzazate to the Dades Valley and then on to Merzouga, where we rode on camels to an encampment and stayed overnight in the desert - definitely the high point of our trip. We had one horrible meal on the tour but no-one is perfect and Ali said he would take this food stop off the agenda for future clients, as he had recently had similar feedback.We paid 700 euros for three of us for a four day tour with guide / driver, two overnight stays (one in desert) and evening meals. Not cheap (for Morocco) but money well spent. Thank you Ali and Idir!"
        }, 
        {
            "index": 160, 
            "rating": "5", 
            "review": "desert tour. the offered organised tours are ust fantastici didnt like at all the understanding of time , most trips start a half hour later"
        }, 
        {
            "index": 161, 
            "rating": "5", 
            "review": "everything was amazing. everything was amazing weather , the natural food m the special service from the heart , very professional staff"
        }, 
        {
            "index": 162, 
            "rating": "5", 
            "review": "OUARZAZATE,ZAGORA!!!!. ...we took a kombi till region Ouarzazatr,dessert and 12 of us we traveled cck 6h ...that cost us 50euro per p..so when we arrived all of us ware impressed and was wrelly ineresting to see d oldiest city tribe of berberian..we had lunch some tajine and cous cous and back to trip till Zagora...there we took our cammel and whith berberians we travel for 1h till berb.bungalows where we sleeped...so i can say everything was AMAZING and a great adventur"
        }, 
        {
            "index": 163, 
            "rating": "5", 
            "review": "Fantastic trip - these guys are absolutely brilliant!. My sister and I travelled to Morocco in March and these guys really made it the trip of a lifetime! We had so much fun and definitely have Morocco Active Adventures to thank. Youssef took us on our desert trip and he was absolutely brilliant, we learnt so much about Berber culture and he made us laugh so much, we couldn't have asked for a better guide! Every Riad we stayed in was exceptional, with great food and superb hospitality. Ali picked us up in Marrakech and gave us a fantastic introduction from the minute we stepped off the plane. If you are going to Morocco definitely go with this company - we cannot fault them at all. Thank you so much Morocco Active Adventures! (Emily & Hannah, UK)"
        }, 
        {
            "index": 164, 
            "rating": "5", 
            "review": "Great value. Fantastic to get around and about,great sights to see and value for money...a must when visiting great service"
        }, 
        {
            "index": 165, 
            "rating": "5", 
            "review": "City bus. Great to get a feel for the place. And you could get on and off as much as you liked. Good a d clean bus with great drivers and on time! Not like GB!"
        }, 
        {
            "index": 166, 
            "rating": "5", 
            "review": "Day trip to High Atlas Mt. Breathtaking views of the countryside. Had a lunch with a local Barber family which was a highlight as well"
        }, 
        {
            "index": 167, 
            "rating": "5", 
            "review": "Family desert adventure. If you want to enjoy amazing landscapes of Sahara Desert and stunning view, a trek in Merzouga desert it is really must do thing in Morocco. It is ideal for relaxing and photo-shooting, the landscapes change from time to time. Take your family-friends and enjoy your time there."
        }, 
        {
            "index": 168, 
            "rating": "5", 
            "review": "Fun adventure in Morocco. I definitely recommend this excursion for a day or more in Merzouga Desert. It was the highlight of our trip to Morocco. Great day, lots of fun, very knowledgeable tour guide, he did a great job of stopping and explaining things to us. This is a fun and educational adventure. It is totally worth it and you'll be glad you did it!"
        }, 
        {
            "index": 169, 
            "rating": "5", 
            "review": "Morocco Sahara Camel Riding. Really a trip and a team me and my 2 friends will never forget. It was a fantastic way to see a lot of Southern Morocco in short time. The experience was great and the tour guide we had was awesome, very friendly and great driver. You won't regret it!"
        }, 
        {
            "index": 170, 
            "rating": "5", 
            "review": "Marrakech to Zagora and the Dessert Night. I was in Marrakech for only 3 days... thus, I have no time for long tour!I made one great descion: take a tour from Marrakech to Zagora for 2 day/1 night tour to th e Desert.G R E A T !It is the one of the best nights of my life!I was wake until 2am looking at the starts and walking on the desert before I returned to camp.Food and services, normal, nothing espectacular.But the desert was great!It cost me around 60 Euros, including on stop at old city in dessert... great!If you have only 2 days free in Marrakech...I would suggest this trip!But, be willing to go around (close) by your self... that was the best part!Starts is almost around the year sky...nothing can better for astronomers.. :)"
        }, 
        {
            "index": 171, 
            "rating": "5", 
            "review": "Sahara Tour. We have just back from a great trip with Morocco Active Adventures. The camel ride was one of highlight of the in Morocco, also, the berber family in the cave with their children. Thank you so much."
        }, 
        {
            "index": 172, 
            "rating": "5", 
            "review": "Fantastic High Atlas Tour. I've spend 1-day with my friends in High Atlas with absolutely great tour guide - Khalid Amor. Everything was very organise and very rich in different experiences and places but with no rush - perfect for holidays where you want to relax but also experience the country and soak up all the beauty that's there :D. Was great!!! I highly recommend Khalid Amor :)"
        }, 
        {
            "index": 173, 
            "rating": "5", 
            "review": "Experience of a lifetime. I loved our 2-day trip to Zagora. So much to see, so much to learn and our guide Omar made it a trip never to forget. A night under the stars in the desert, the camel trip, Ait Ben Haddou and just the amazing landscapes we passed. I will be returning to Morocco for sure"
        }, 
        {
            "index": 174, 
            "rating": "5", 
            "review": "Trip To The Atlas Mountains. Be prepared with bottled water, trainers and sun protection. The views are incredible and the mountain people friendly. Try the mint tea ceremony and demonstration of bread making."
        }, 
        {
            "index": 175, 
            "rating": "5", 
            "review": "Amazing Trip. My friend and I went to Morocco for a long weekend looking for adventure and a new perspective, and we came away with so much more. We did the two-day trip to the Zagora Valley with Youssef. As two college-aged American girls traveling alone, we felt completely safe throughout the whole trip. Youssef taught us so much about the Berber lifestyle, and our experience in Morocco would not have been half as rewarding without having him as our guide. From joking and telling stories over mint tea to visiting an authentic argan oil cooperative to experiencing incredible mountain views and playing drums with Berber people around a campfire under the stars, every moment was stimulating and unforgettable. Do this tour, you won't regret it!"
        }, 
        {
            "index": 176, 
            "rating": "5", 
            "review": "Got to be done. Its a must to get out of Marrakech for a day and go up to the Ourika Valley. Theres not a huge price difference between operators of tours and they are negotiable. See the Berber village and visit the Arom Mantagne factory and but some products from the female co-operative that extract the oil from the Argan tree fruit stone. Lunch is normally included but do make sure you wear sturdy footwear if your tempted to climb up to the waterfalls. Not for the faint hearted or unfit"
        }, 
        {
            "index": 177, 
            "rating": "5", 
            "review": "Thank you Morocco.... ...for the wonderful memories! I recently returned form a 4 day holiday with a friend. This included as a whole 2 days in Marrakesh, where we had a 2-day trip to Zagora desert in the middle, and then back to Marrakesh. We organised the Marrakesh - Zagora trip with Morocco Active Adventures from London. Our communication with the tour agency was prompt right from the start. Our driver Ali was very friendly and well organised. He picked us up from the hotel and dropped us back there in the end.The journey was long but fun - with good conversations, beautiful scenery outside the window, and the sound of Ali's nice personal music set in the car (he even burnt a CD for us which I now listen to and remember the good time). On the way we had the chance to stop where we liked to admire the views, take pictures, have some food, see attractions like Ait Ben Haddou which is part of the UNESCO world heritage. We also had a camel ride on the way to the bivaque in the desert near Zagora where we spent the night.The people there were great and the service was wonderful. If I have to describe my experience with one word, this would be \"magical\". It was definitely a trip to remember and I highly recommend it!"
        }, 
        {
            "index": 178, 
            "rating": "5", 
            "review": "Like a Roadtrip with Informative Friends. My friend and I took an overnight trip to the desert from Marrakech since we didn't have much time to spend in Morocco. It was the perfect trip. The guys were accommodating, informative and fun! I would recommend this experience to anyone looking for a great time.Thanks for Everything!"
        }, 
        {
            "index": 179, 
            "rating": "5", 
            "review": "Great Guides for a Trip to Morocco. Just returned from a 5-day trip to Morocco, based in Marrakech. Did not know much about what to do, where to stay, or where to eat. But, with Morocco Active Adventures, there was no need to worry - they took care of everything, which was great. Sightseeing in Marrakech. Trip to the Merzouga desert. And, various other places in between."
        }, 
        {
            "index": 180, 
            "rating": "5", 
            "review": "Camel Ride. Despite being the only two on the morning camel ride we both thoroughly enjoyed the camel ride experience. Our guide was funny and even used leaves off of the trees to make us both a very artistic camel. The view itself was a bit samey but a stop at a Berber village was most enjoyable, eating the best pancakes we'd had on the trip and of course some delicious mint tea.Gentlemen wear loose trousers as it can get a bit uncomfortable!"
        }, 
        {
            "index": 181, 
            "rating": "5", 
            "review": "Best Part of My Trip. My time with Morocco Active Adventures was wonderful. Everything was very well organized, professional, & informative. The time spent getting to know the locals and in the Sahara will never be forgotten. I would highly recommend Morocco Active Adventures."
        }, 
        {
            "index": 182, 
            "rating": "5", 
            "review": "Informative, safe and entertaining tour!. My sister and I recently travelled with Active Adventures out to the Moroccan Desert. Words cannot describe our experience and we decided it was not only the best country we had ever visited, but the best travel company. Our first communication with Active Adventures was prompt, precise and flexible! Joussef got back to us straight away with details and dates and options, but what was more important, he offered us advice which made us feel very safe and informed.The 4WD was clean, comfortable and very easy to travel in with plenty of room. The accommodation was all of a very very high standard. We ate beautiful, local food and were treated exceptionally well by staff at every hotel.However, what made the trip truly wonderful was our guide Youssef. Youssef went above and beyond at every point. He was our guide, our expert, and soon, our friend. Nothing was too difficult to organise, and once he knew our interests and travel preferences, he went out of his way to make sure our trip focused upon these! I can't describe how much we enjoyed our trip, and have plans to return as soon as possible. Thank you so much."
        }, 
        {
            "index": 183, 
            "rating": "5", 
            "review": "Great People great service!. Youssef and Hassan were an amazing team. I cannot recommend this tour enough. Morocco is a very special country, and these two men shared their insight and passion for their country. Going into the desert was extremely special and amazing. Berbers are a special breed of people. GO!!!!"
        }, 
        {
            "index": 184, 
            "rating": "5", 
            "review": "Highly recommend. Really it was an authentic adventures. We had a trip to Sahara desert and our guide made us feel comfortable every minute of our excursion. If I visit Morocco again I will not hesitate to take another tour with this group for more time."
        }, 
        {
            "index": 185, 
            "rating": "5", 
            "review": "Marrakech Sightseeing. What an amazing experience, thank you so much to the team for the trip to the top, a dynamic young professional and friendly team. If you like authentic adventures, do not hesitate, go for it!"
        }, 
        {
            "index": 186, 
            "rating": "5", 
            "review": "Amazing trip. We would like to thanks our driver for the great day trip that we had few weeks ago. Just one trip to Atlas Mountains but we had a lot to see and to visit. The breakfast with a local family is of our highlights in Morocco. Thank you again Mustafa."
        }, 
        {
            "index": 187, 
            "rating": "5", 
            "review": "Unforgettable Experience!. One of the best experience of my life! Thanks to Jose, who was the best tour guide to show us around Marruecos and this amazing culture. He took us to every place mentioned in the plan and even more places, making this trip unforgettable. He was very attentive, helpful and fun. He made us feel comfortable every minute of our trip and also he taught us a lot of words in Arabe and Berber. All the hostels we stayed were beautiful and all the employees were very respectful. For sure, if I visit again Marruecos i will not hesitate to take another tour with Jose and his group Morocco Active Adventures - Day Tours, they are the best!!"
        }, 
        {
            "index": 188, 
            "rating": "5", 
            "review": "An excelente experience!. The guide tour was a nice guy. Very respectful, funny, and talkative. It's was a complete experience to know Marocco's beauty and the culture."
        }, 
        {
            "index": 189, 
            "rating": "5", 
            "review": "An excellent and memorable tour!. An unforgettable experience to enjoy the beautiful scenery of Morocco with nice guide of Morocco Active Adventures!"
        }, 
        {
            "index": 190, 
            "rating": "5", 
            "review": "Best trip in my life so far!. We are a group of 4 women travellers from Hong Kong, and the 4d3n desert trip was the best we have ever had (among our experiences throughout Asia, Europe & America)! We did the trip from Marrakech to Fez, traveling in a comfortable 4x4 with nice local music & wifi (ssssh… don't tell others!) and seeing all the wonderful views of Atlas mountain, Sahara desert and above all, the unforgettable camel riding and camping under the starry sky. We were taken to a secret place for a nice picnic with amazing desert view, and we also visited berber village and nomads to know about the desert culture. They did not take you to shopping & no extra costs. Well, this maybe similar to other desert tours, but what stands out is the incredible guide & service provided by Morocco Active Adventure (MAA)!MAA was the fastest to reply my queries and I even managed to talk to them via online chat before confirming my booking! This gave me confidence on their experience and as a group of lady travellers from Asia to visit such an exotic country like Morocco, we truly value this ^v^!The guide, Youssef, is incredibly amazing, experienced and entertaining! He is knowledgeable in local culture and traditions, and makes you feel like a good old friend. You will be surprised by the talent he has got, and also find him a funny lad who shares silly jokes and full of wild ideas. We had met other travelers & their guides on our way, and we believed our experience was unique, awesome and the best! We wished we did a longer trip and spend more time in the desert!We visited in April 2013, and we are still in touch with MAA, sharing our traveling experience and others."
        }, 
        {
            "index": 191, 
            "rating": "5", 
            "review": "Quad bike in sahara. I had a great morning, learning to ride the quad and learning some amazing stories about Sahara Desert and its Berber people. I can only advise any traveller to Merzouga Desert, not to miss this unique active adventure. Highly recommended."
        }, 
        {
            "index": 192, 
            "rating": "5", 
            "review": "Take me back!!!. We did the 4 day trip and was greeted by a well presented and happy guide (the whole trip he was amazing). All local info shared was phenomenal as he was well traveled and had lots to talk on. The transport was an air conditioned 4x4, very comfortable for the 2 of us and we felt super safe with our driver and his road etiquette. Lots of driving so was very important. Accom was 4/5star and extremely happy with them. All safe clean and very nice.Sites blew us away.. One minute dry arid land the next green valleys of bliss. I must mention or aim was to get to the desert and we were impressed by the scenery on the way.Desert was amazing - exactly what I expected, beautiful serene and peaceful. Our camel rides were an hour into the camp site one night stay and back on the camel the next morning. We luckyily shared a camp site with a bunch of fun and interesting English speaking tourists which made it even nicer! Now to our guide - if you can request anyone Youssef Bani was excellent. He is a wealth of knowledge, funny and energetic and didn't fail to deliver on any of our guided tour with him! He certainly made our tour more special!! Thank you to the team and most importantly to our guide.!! "
        }, 
        {
            "index": 193, 
            "rating": "5", 
            "review": "Fantastic experience. I booked a 2 day, one night desert tour from Marrakech to Zagora, then back to Marrakech. As a female solo traveler, I was a bit apprehensive about a private tour, but I need not have worried. Ali was an excellent driver, and Mohammed was a wonderful guide who made me feel safe and well-taken care of the whole time. The stops we made were interesting and beautiful, and it was nice to have the company of two men who knew the landscape and the country so intimately. As promised, we returned to Marrakech in plenty of time to pick my daughter up from the train station. My only regret is that I did not have time for a longer tour!"
        }, 
        {
            "index": 194, 
            "rating": "5", 
            "review": "Unforgettable Trip with the Morroco Active Adventures!! ♥. Definitely one of the best experiences that I have had so far! They picked us up at the airport, made many many stops without rush or complained so that we could enjoy the view from different points, instruct us culturally and made sure that we were comfortable at all times. The tour guide Jose and the employees at the hotel were very helpful, respectful and available at all times. The food was AMAZING and endless! Even though the camels did hurt is an experience that should be tried at least once in your life... The night at the desert was one of the best part of the trip... There they played music with the drums and integrated us to participate, dancing and playing the instruments as well. It's something that's definitely different which makes it even better."
        }, 
        {
            "index": 195, 
            "rating": "5", 
            "review": "Best Trip ever.... Thank you Joussef, Ali and Adi for the wonderful and exciting trip from Marrakech to the Sahara and back. Joussef and his crew are doing a very good job!! I can really recommend the tours. We made the four day trip from Marrakech to quarzazate, Sahara desert and back, with nice locations in the route like canyons and a finally camel riding. Joussef gave us a nice hint for a shopping location in Marrakech and the Riads recommended by him were very very nice. We will come back!! Stefan"
        }, 
        {
            "index": 196, 
            "rating": "5", 
            "review": "Awesome day with Morocco Active. Our group of 5(all girls) had our 1st visit to Morocco with Active Adventures, from start to finish it was an extremely smooth process. We did a quad bike tour in sahara desert. Our guide, makes it possible to experience some of the most amazing sights in dunes. The staff were patient and gave clear instructions on how to operate the quad bikes.Thank you to everyone at Morocco Active Adventures, you guys made our day awesome!!!"
        }, 
        {
            "index": 197, 
            "rating": "5", 
            "review": "Safe Adventure.... Saiid took the time to give us(two women travellers) the true Moroccan experience during our visit to Marrakesh. We enjoyed the customized tour that Saiid planned for us, and had an excellent experience overall. Thank you so much.Angela + Laura"
        }, 
        {
            "index": 198, 
            "rating": "5", 
            "review": "Meet a different world!. Traveling is transported to another time and Morocco is no the exception. For known and enjoy a place in his totally, you need to experience everything that characterizes it, the people, the food, the scenery, the weather, the music, the culture and tradition; all this I experienced this past summer with the help og our guide Jose. I recommend this trip to anyone waiting for a new experience, I assure you that you will not regret."
        }, 
        {
            "index": 199, 
            "rating": "5", 
            "review": "The best in my Morocco trip. Just a quick note to say how pleased we were the last week of our trip with Morocco Active Adventures. A quad bike in Merzouga dunes, is an ideal adventure among friends and families, I recommend to everyone !!"
        }, 
        {
            "index": 200, 
            "rating": "5", 
            "review": "Unforgettable, exciting and unique. Unique landscapes, best food in the world (don't be afraid to try it all), the best tour guide and the desert is just breath-taking. I went with a group of six girls and we felt completely pampered, safe and entertained. Also, we learned so much from Morocco because of our guide, José Aventuras. He vas awesome and considerate at all times. Even one girl, whose birthday we spent in the desert, he went and bought a cake for her and surprised us all. It was just beautiful. A MUST-DO FOR EVERYONE. May the desert steal you like it stole me. Thanks for everything José :D"
        }, 
        {
            "index": 201, 
            "rating": "5", 
            "review": "Marroco unbelievable place. My girlfriend and me enjoyed with this amazing company! Great staff, really friendly and have a lot of experience is the activity. The tour was unbelievable, the guide is amazing, great english and he gave us a lot of confidence on our first dives. I highly recommend to do the adventures activities with this company.Thank you guys we had a wonderful time with you."
        }, 
        {
            "index": 202, 
            "rating": "5", 
            "review": "We went to Morocco. I went to Morocco with my girlfriend as part of our honeymoon and we had a great experience. It was one of the most valuable experiences in our lives. The night at the dessert was unbelievable, The food always was good. we recommended it 100%."
        }, 
        {
            "index": 203, 
            "rating": "5", 
            "review": "Once in a lifetime experience, worth doing again!. What can I say that hasn't already been said? We did the 4 day 3 night trip from Marrakech to Fes. Such an amazing trip in large part because of Joussef. He made you feel like an old friend, not just a client on a structured tour. From Ait Ben Haddou, to the Toudgha Gorges, to the guest house in Ramlia (middle of no where!) to the camel trek for the overnight stay in the Sahara (where you can't help but sing that song by the Police in your head as you have some tea) to the Barbary Apes (monkeys) in the cedar forest of Azrou. It's an adventure full of nonstop excitement, learning and cultural expansion. My girlfriend at the time always talked about doing things to \"make your world bigger\". Taking this trek definitely fulfills that mantra."
        }, 
        {
            "index": 204, 
            "rating": "5", 
            "review": "Lifetime Experience. On October 2013 I went to Morocco with my husband as part of our honeymoon and I had a great experience. First, I was a little scared since it was only both of us and the tour guide and we did not have any internet or GPS so we did not know where we were going, but it was one of the most valuable experiences in our lives. Hotels where really great! The night at the dessert was unbelievable. Tour guides are really trustful. We didn’t know in which hotels we are going to stay before arriving, but I really love them. The food was good always. The last day we leave our luggage with the tour guide and he was going to take them to another tour guide since he has to go to another tour and we already pay. Our tour guide told us that at a specific time the other tour guide will pick us with our luggage and ride us to the airport. We trust him as always and at that specific time the other tour guide pick us and ride us to the airport. I really blessed for this opportunity. I recommended it 100%."
        }, 
        {
            "index": 205, 
            "rating": "5", 
            "review": "Cause this is Africa ♫. Every time someone asks me about my euro-trip, I always talk first about my trip to Morocco even if Morocco is in Africa and not in Europe because the countries in Europe are all pretty much the same, churches, beautiful architecture, bridges, trains, parks, blabla, but Morocco is so different. Deserts, giant rocks, sandstorms, delicious food, beautiful clothes and jewelry and amazing views. I went with 5 boricua friends and we had a blast with Youssef (Jose). We spent 2 nights in beautiful hotels and 1 night in the Sahara Desert. Seeing the sunrise in desert was astonishing. Jose taught us a lot about Morocco and its culture and traditions and showed us a beautiful part of his country. Thank you for everything Jose!! You're an amazing person! I recommend this tour 1000%."
        }, 
        {
            "index": 206, 
            "rating": "5", 
            "review": "Experience of a lifetime. I spent a short weekend with these guys, and they did the best job. I got to see so much of their beautiful country for a great price, and I still think about it everyday. You will no doubt leave this experience with memories and people you will hold close to your heart. I wish I could live it all again!"
        }, 
        {
            "index": 207, 
            "rating": "5", 
            "review": "Trip of a lifetime. This was far and away the best trip I have had. The tour guide was incredible. Not only did he take us to our destination but he gave us so much insight into the local culture along the way. We learnt the language, and experienced the highlights. Atlas Mountains, desert...all incredible. Would recommend this company to anyone. A MUST do."
        }, 
        {
            "index": 208, 
            "rating": "5", 
            "review": "Bucket List Experience of a Lifetime. Four of my friends and I wanted to get out of Morocco as much as possible, in the least amount of time and without ending up so broke! We came across the tour and our assigned tour guide, Joussef, made us feel welcome since before we even accepted to take the tour! He was always very attentive with the flight and transportation arrangements so our once in a lifetime trip would be exactly just this... and more! We were picked up straight from the airport in a really comfortable 4x4 and started our journey into the desert, which consisted of just enough sightseeing mixed with adventure. We rode camels in the Sahara Desert, sandboarded (Yes!, you read correctly!), had an incredible feast in the middle of the desert, sang and danced to traditional music, gazed at the vastness of the night sky and even got to see a Saharan sunrise. Just absolutely memorable experiences that I will forever cherish! Youssef treats you like and old friend and will go out of his way to make his guests feel at home. Recommend this tour or a longer one (depending on your interests and budget) without giving it a second thought!"
        }, 
        {
            "index": 209, 
            "rating": "5", 
            "review": "The best trip in my life - el mejor viaje de mi vida. A really great experience, spent the night at the Sahara's Desert are unforgettable. The staff was really nice and kind. They make me feel in home. The camel trip to the desert was fun. I recomend this company 100%. I'm in love with Morocco thanks to Jusef.Una gran experiencia, pasar la noche en el desierto es inolvidable. El equipo es muy bueno y generoso. El viaje en Camello al desierto fue divertido. Recomiendo esta compañia al 100%. Gracias a Jusef estoy enamorada de Marruecos."
        }, 
        {
            "index": 210, 
            "rating": "5", 
            "review": "Adventure in the Sahara. From the landing to the views, everything was perfect on our stay on Morocco. The crew was amazing, as well as the experience.. It was surreal"
        }, 
        {
            "index": 211, 
            "rating": "5", 
            "review": "The best way to experience Morocco!. My friends and I did a 4 day adventure from Marrakech to Fes. It was the best way to get from one point to the other and we made so many memories along the way. Traveling in a comfortable air conditioned 4x4 was a luxury. We stopped at various destinations, slept under the stars, rode into the desert at sunset on the back of camels, sand boarded down the most beautiful dunes, and were treated to tea and music with Berbers. Experiences next to none and forever memorable in our hearts. What set the bar so high was undoubtedly our guide Joussef who catered our trip to fit our needs. He is extremely knowledgeable about his country and the culture, speaks many different languages, and treats you like good friends. It is well worth doing this tour to get a unique Morrocon adventure. I only wished we did a longer trip."
        }, 
        {
            "index": 212, 
            "rating": "5", 
            "review": "Great Adventure. My son and I made a great personalized trip into the dessert of Morocco. Quad biking, sleeping in the dessert, beautiful sun rise and sun set, tea with berbers, rock climbing. Our guide Joussef was extremely helpful and entertaining. We can heartily recommend Morocco Active Adventures."
        }, 
        {
            "index": 213, 
            "rating": "5", 
            "review": "Camel trekking in Sahara. This was my first trek ever. It took us 03 day in sahara desert and was more than everything I imagined. I would definitely recommend taking this trip from Marrakech and heading up to see both the mountains and desert.Thank you so much M.A.A"
        }, 
        {
            "index": 214, 
            "rating": "5", 
            "review": "New Adventure. I had the best time with this company... Driving in off-road and dunes, I believe I have found another adventure that is just as exciting and so much fun. Try it, you will not regret it. Thank you Active Adventures for the great trip!!!"
        }, 
        {
            "index": 215, 
            "rating": "5", 
            "review": "An experience I will never eveeer forget!. The whole trip is something out of this world. Morrocco is such a magical place and we would have been completely lost if it werent for these guys. Jose (one of the guides) was the best! We had little time to be in the desert and he made it posible for us to see everything in just two days. We were always taken good care of anywhere we went. It truly is one of the best trips I have ever done and I would totally recomend it to everyone!"
        }, 
        {
            "index": 216, 
            "rating": "5", 
            "review": "2 Day Trip to Zaggora Dessert. Two of my roommates and I went on a one night and two day trip, and it was amazing! Our guide (Youseff) picked us on time at the airport, drove us for 6-7 hours from Marrakech to Zaggora Dessert, where we stayed at a camp-like place. The camp was great. They greeted us with Moroccan tea, we had a full dinner and had a great tent to sleep in. After dinner the whole camp group learned how to play the drums around the campfire. Our guide took us up to the sand dunes and we got to see the beautiful stars. The next morning we went on a 45 minute camel ride and met up with our guide at the end of the ride. We road-tripped back to the city and on the way stopped by some of the sight-seeing places of Morocco. We got to stop by the place where they filmed Gladiator and even toured the city of that particular place. Our guide was phenomenal. He made us feel welcomed and even taught us Arabic! We learned so much from him and he answered any questions we had. The car that we drove in was plasted with music and he stopped whenever we wanted to take pictures. It was an amazing trip because my roommates and I were on a tight schedule and they were really flexible in the trip. They even set us up with an amazing riad the night before our flight. The riad was beautiful, accommodating and fed us delicious breakfast in the morning. We had a flight at 6am and the lady who lived/worked there woke up at 4am to make us breakfast. They were all so incredibly sweet. This trip was by far one of the best experiences I've had my semester abroad. We felt so safe and enjoyed every minute of this trip. There was always something exciting going on and I would recommend this trip to anyone! Youseff, thank you so much for an amazing trip!! You are the best!"
        }, 
        {
            "index": 217, 
            "rating": "5", 
            "review": "Fantastic Excursion. We took the 3 day tour to Dades valley and Ait Ben Haddou, camels and night in Merzouga and finally to Ouarzazate. They put us up in top notch hotels and the accommodations exceeded our expectations. Best of all was our driver and guide. Youssef was knowledgeable, interesting and extremely helpful. This was particularly important since there was a good amount of driving involved."
        }, 
        {
            "index": 218, 
            "rating": "5", 
            "review": "An unforgettable trip.. Thanks to this amazing tour I fall in love with this beautiful country. They offer an excellent service. I learned a lot about the culture and the country. I fall in love with the landscapes, they seem to be unreal, is like magical. Youseff is an excellent guide. He made me change my vision about the world, about everything with this beautiful trip. I definitively recommend this tour because is different and you learn more about the arabic culture. I assure you, there won't be regrets. I love Morroco and i know i will be back to see more about this fascinated country and continent. <3"
        }, 
        {
            "index": 219, 
            "rating": "5", 
            "review": "Atlas mountain trip. Trip was organised by the hotel just for us. Car turned up on time. The guide was waiting at the Atlas mountain. Had a very good experience. On the wAy back came through a different way. It was such an amazing trip."
        }, 
        {
            "index": 220, 
            "rating": "5", 
            "review": "The reason why you book with Morocco Active Adventures!. We would have been lost, directionless and eventually disappointed IF we had not contacted Morroco Active Adventures for a 4 day trip. Our guide Youssef had everything organized, we had a wonderful vehicle, we went to places that were remote, exquisite, wild. Even when weather intervened, Youssef took care of us. The magical camel trip to the desert will remain imprinted in my memory forever. Visitors to Morroco have not seen this rare jewel of a country unless they travel with one of Morocco Active Adventures' guides."
        }, 
        {
            "index": 221, 
            "rating": "5", 
            "review": "Experience of a lifetime!. Definitely one of the best experiences of my life! First of all our tour guide, Jose, was amazing since the moment I contacted him to the very end of the trip. He is such a great person and tour guide, of course. You might think that the way to the dessert is long, but these people really know how to make it worth it! I learned so much from the Moroccan culture, the tour guide really know about his country and his culture, they explain everything perfectly. The scenery was incredible!! All the places we went were so beautiful and the desert I can't even explain! The places, the people, the food, everything was SO good!! The hotels they booked for us were also really good and the night we slept at the desert was probably one of the best nights of my life. It is just a magical experience! If I ever go back to Morocco (which I hope I do someday) I will definitely do this tour again! Everything was just perfect."
        }, 
        {
            "index": 222, 
            "rating": "5", 
            "review": "In love with Morocco. I can easily say that this was the best trip of my life. I learned so much about moroccan culture while enjoying the wonderful and beautiful views of the city and the desert. Youssef is an amazing person and an excellent tour guide, I'm so grateful for everything he and his team did for us. It was an amazing and unforgettable journey, without a doubt I will do this tour again someday. It was magical!"
        }, 
        {
            "index": 223, 
            "rating": "5", 
            "review": "Excellent driver/tour facilitator for Marrakech and all of Morocco. Five years ago we visited Morocco with our best friends and had a wonderful tour of the country which was arranged through a travel agency. We were particularly impressed with our driver, Fedli Mohamed, who not only delivered us safely to each destination, but also saw to our every need. We recently returned to Morocco. Before we left, we contacted Mohamed directly to see if he was still with the same company since it was important to us to secure his services. We found that he was now independent and could not only drive us but also make the complete trip arrangements for us. He planned the whole trip for us, securing lodging, hiring local guides and arranging site visits. We had every bit as fantastic a trip as we did the first time and it was roughly half the price. Mohamed is honest, dependable, and dedicated to serving his clients. He is based in Marrakesh and can either do day trips from there or can take you through the whole country. He picked us up and dropped us off at the Casablanca airport. We reached Mohamed at his email address fedlimohamed@gmail.com"
        }, 
        {
            "index": 224, 
            "rating": "5", 
            "review": "Fabulous tour. Youssef and the rest of the guys took such great care of us. Had such a wonderful adventure - just simply the best!"
        }, 
        {
            "index": 225, 
            "rating": "5", 
            "review": "Went with a Thomsons tour. Worth taking a tour as we would never have found some of the places we visited! Make sure you go with a good tour guide, not ones that are by the entrance to the city as we were warned against these."
        }, 
        {
            "index": 226, 
            "rating": "5", 
            "review": "Mountain Trekking. Our Riad arranged a private Atlas Mountain trek with this company. Just the 2 of us and a wonderfully pleasant man with exceptional English speaking!! Amazing memories :-)"
        }, 
        {
            "index": 227, 
            "rating": "5", 
            "review": "Camel ride in Sahara of Marzoga. We were in Marrakech over for a long weekend, by chance we found this company through tripadvisor and booked by email. The price was fantastic and our driver guide was very friendly, helpful and great. Thank you so much Mohamed."
        }, 
        {
            "index": 228, 
            "rating": "5", 
            "review": "Unique expreience. I can honestly say me and my wife had a unique experience, as our respectful guide gave us a very informative traveling experience about the vast culture of Marrakesh. The location for the waterfall itself is incredible. many locals diving in and bathing inside whilst others marveling the delights of the gushing streams above their heads. its quite a walk to reach the zenith point but well worth it because a little abit of sacrifice is required to reach ones destination :)"
        }, 
        {
            "index": 229, 
            "rating": "5", 
            "review": "We had a great time in Morrocco!!!!. My wife and I just got back from a 14 day trip to Morocco. We really could not say enough good things about Morocco Key Travel. They arranged everything and took fantastic care of us the entire time. We have traveled to numerous other countries, and Morocco Key Travel and Ibrahim are the best. The places we stayed were all very nice. We particularly enjoyed staying in the Riads because they were beautiful and right in the historic areas. Our trip was sort of a loop around the central part of the country. We went to Rabat, Meknes, Fes, and then out to the desert. It was the best part of the trip. We spent a night in a tent camp out in the desert. Later we met some Berber Nomads, and we had tea with them. After the desert, we went to Essaouira, then to Marrakesh. Key Travel thought of everything to make our trip more enjoyable. All in all the best vacation experience we have ever had."
        }, 
        {
            "index": 230, 
            "rating": "5", 
            "review": "Brilliant Morocco Adventure!. As a young, solo female traveller I was concerned about how safe it was for me to travel in Morocco, however that concern was no longer after discovering this brilliant tour company that offered all the experiences I wanted for my trip to Morocco from Australia - 4WD, desert camping, camels, sand boarding, quad bikes, local cuisine and cooking class, learning the language etc etc. It was more expensive than the group tours I originally looked at, but so so worth it - even just for the amazing accommodation you get to stay in!! And because it is a private tour you feel safe - my tour guide, Joussef, knows everyone there, and knows everything about the areas and towns you drive through, he taught me some arabic and berber language, and your itinerary is extremely flexible. On the first night he sat me down with a giant map and gave me five different itinerary alternatives, so I picked two and we kind of made it up as we went along, it was awesome! Plus we threw in a whole lot of 4WD river crossing, desert and dune drives spontaneously. A definite 5-star experience for anyone wanting an active-style adventure in Morocco!"
        }, 
        {
            "index": 231, 
            "rating": "5", 
            "review": "Best Tour in Morocco. Earlier last month I booked a last minute trip to Spain along with two friends. While the planning unfolded we contemplated venturing south to Morocco. After booking a four day trip to Marrakech we were realized that if we were going down to Morocco we might as well go out to the Sahara and see the dunes right? Yes, that escalated quickly. It just so happens that from Marrakech the three mayor dune systems are 7.5 hours to Zagora and 10 hours to either Erg Chigaga or Erg Chebbi (BEST DUNES in terms of size, vastness and greatness). At first we were a little skeptical about spending 20 hours driving back and forth from the desert in a four day/3 night trip but \"when in Rome...\" Well we found out that most excursion companies that we contacted refused to take us since we wanted to do to much in too little time. Marrakech Tour Excursions was one of the few that were willing to take us out. This good initial impression never faded away proved to be accurate. From the pick up to the drop off back our driver, Hamid, was very professional, friendly and knowledgeable. We were picked up from Hostel Riad Marrakech Rouge in a very comfortable and I would say upscale Toyota Prado SUV. The added comfort of the personalized tour and the vehicle made the long drive something truly enjoyable. Between the conversations with Hamid and sightseeing from Marrakech to the desert the ride was well worth it. During the ride out you get to see changes in landscape from dry Marrakech to deciduous forest a you go up the Atlas Mountains up to the snow-covered peaks and back down eventually passing Ouarzazate (Moroccan Hollywood) and from there dissecting painteresque towns all the way to the desert. Once we arrived to Erg Chebbi we had the camels, or dromedaries as we learned is the proper name for the one-humped Saharan camel, and our desert guide Said waiting for us ready to go. We got out there just in time for the sunset as we trekked our way out to the Berber camp. Upon arriving I was favorably surprised by the facilities at the camp. The camp consists of a series of huts lined up one next to the other in typical Berber fashion. They even have a restroom set up out there in the desert! That night Said cooked for us the best tagine (chicken) which we had during the whole trip. After supper we went off to build a fireplace and Said played the tbe and bendir (berber drums) and chanted traditional folkloric music of the region. Next morning we we up before sunrise to see the sunrise above the sea of dunes. Once up we were left free to roam the surrounding dunes and sandboard our way to exhaustion. After this we camel trekked our way back to Merzouga while contemplating the vastness and perfectly shaped dunes. Once back at the town Said took us to the Hotel where we had a very good and filling breakfast followed by a shower before heading back to Marrakech. All in all if you can't judge by my experienceI am HIGHLY recommending going out to the desert and Marrakech Tour Excursions made this all possible for us. This is a great opportunity to witness the greatness of nature and immerse themselves in a completely foreign culture. This is why along with the great treatment we were given I would strongly suggest you contact them if you are contemplating any trip around Marrakech. Even if you are not going out to the desert they offer different tours like the Tour of the Imperial Cities in which they take you around different cities in northern Morocco. I cannot emphasize this enough, they are professional, amiable and easily approachable. If I were to go again I would definitely contact them."
        }, 
        {
            "index": 232, 
            "rating": "5", 
            "review": "A lifetime experience. My friends and I went on a trip to the desert with Marrakech Tours Excursions. We really wanted to go into the desert but didn't have that much time. We contacted Joussef and he arranged a custom trip that was perfect for our needs (2 days/1 night from Marrakech to Merzouga/Erg Chebbi). Hamid, our experienced driver, picked us up early in the morning in a very comfortable air-conditioned 4x4. We arrived at the desert just before sunset and took a camel ride into the Erg Chebbi Dunes for approximately 1 hour. We spent the night in a traditional berber camp, where Said, our friendly host, prepared some traditional tajine for us. The next day we had a great time sandboarding. The price for the tour was very reasonable. I highly recommend M.T.E. to everyone."
        }, 
        {
            "index": 233, 
            "rating": "5", 
            "review": "Wonderful private tour. My family had an absolutely wonderful 4 day trip into the desert. We contacted Youssef about a trip from Fes to Marrakech and he arranged a wonderful itinerary. In particular, our guide Omar was excellent; he had a great eye for sights and obviously knew the area extremely well. As we learned, he grew up in the region where we traveled, and his love for the area really shone through during our trip. He showed us local schools and businesses they were helping to support, and it was really touching to see him and Youssef giving back so much to the Berber communities where they grew up. We spent a night out in Berber tents in the Sahara, another night far off the beaten track in the desert (after a day of off-roading), and a third night in the Dades Valley. Our driver was excellent as well; never once did I feel like we were unsafe or out-of-control, even though we drove nearly 100km through the desert with no roads in sight.The price of the trip was incredibly reasonable -- much cheaper than if we had tried to book individual hotels and travel. More importantly, the company and the guide treated us like family, helping us bargain, recommending local specialties, and sharing stories from their own lives and experiences. No one ever pushed us to buy anything, unlike the guides in Fes and Marrakech. I will certainly be recommending this company to everyone I know traveling to Morocco. One note: the desert areas we visited get quite cold in January, so bring warm clothes!"
        }, 
        {
            "index": 234, 
            "rating": "5", 
            "review": "Highlight of our trip!. My husband and I adored M.T.E's tour into the desert!!!That's due in huge part to our wonderful tour guide and driver, Joussef. It feels like going on a road trip with a good friend - he really went out of his way to make sure our journey felt easy, effortless and personal. Originally from a Berber village in the desert we were exploring, Joussef introduced us to his mother, brothers, and extended network of Aunties. We were invited to have lunch and tea with them, a wonderful glimpse into Berber life. His mom even made us a special drink to try to help calm our rumbly tummies. Joussef's English is excellent, and he was able to answer even our most obscure questions, point out things we could never get from a guide book (try and learn the special hand signal for Berber independence!) and introduced to some pretty amazing contemporary African music (a must for a long, desert road trip). Part of the trip was spent off-roading into the desert, where we really felt like we were the only people for miles and miles. It was a special treat to get to fully experience the silence and remoteness of the landscape. Riding the camels was delightful, and not just some posed picture - we must have ridden the camels for an hour at sunset into the Erg Chebbi, the magnificent dunes of the Sahara. Not once were we pushed to buy anything - a huge relief from the tour guides in the cities. We highly recommend M.T.E. and Joussef for a really personal POV of Morocco."
        }, 
        {
            "index": 235, 
            "rating": "5", 
            "review": "Hire a taxi from the street. Make the tours with a private taxi driver. just find a taxi that is more like a mini van; his car more like a new one, and the cost will be much cheaper than your hotel tour. All drivers know the points of interest and will be glad to take you on tour. We went to the five water falls and climbed up the mountain. It was a great day if not the best.There is also the hop on hop off tour bus the we take in every city we visit. It is a good ride between the main tourists attractions and you get to see the city in ease."
        }, 
        {
            "index": 236, 
            "rating": "5", 
            "review": "Relax and enjoy. I've found this company on the tripadvisor - my first intuition was that I could trust these people and they didn't disappoint me... I told Youssef what our idea was and he organized everything for us - they were very flexible to rearrange the whole trip when our luggage were delayed - not to mention the help they provided to get the lost baggage back.We had a great guide, Abdul - he treated us as family (no exaggeration), took us everywhere, recommended original local places to eat and enjoy, told us interesting stories about everyday life, helped bargaining, but waited patiently when needed... Thanks again, Abdul!I would choose this company again - they listen to your wishes and make your dream come true - even if that seems impossible :-)"
        }, 
        {
            "index": 237, 
            "rating": "5", 
            "review": "Ouzoud waterfalls. amazing.. bring your swimming suite.. don't settle for the first restaurants near the parking.. there are other with breathtaking view on the way down"
        }, 
        {
            "index": 238, 
            "rating": "5", 
            "review": "Excellent. We went on several trips organised through click excursions which were fabulous, first one was to the desert for 2 days & 1 night, so pleased we did have private 4x4 car as wouldn't really want to travel 7 hours in a mini bus with other people, had wonderful driver called Hakim who went out of his way to take us to Ben Hadou where alot of films are made i.e Gladiator & Prince of Persia, then on to where they process the argan oil. Camped in the desert overnight with the Nomads, camel ride was around 2 hours!!Second trip was to the amazing waterfalls that are over 330 feet high, Mohammed took us around there and as he grew up there was very knowledgable about the area, a real piece of paradise, an absolute must to go to!! even got to see monkeys very close up!! CLICK EXCURSIONS"
        }, 
        {
            "index": 239, 
            "rating": "5", 
            "review": "Wonderful 5-days trip. We contacted Marrakech Tour Excursions before flying to Marrakech and they planned for us a 5-days trip starting from Marrakech and including some of the most amazing places in that part of Morocco. We visited Ouarzazate, the amazing Gorges and of course The Desert! Our guide, Amar, was more than a simple guide. We always had the feeling of having a friend with us. He was very open with us and he explained to us everything he could about Morocco and Berber history and culture. We also had very interesting discussions about different cultures in our world and especially in Marocco. In addition he was also a wonderful guide, having all the time something to explain to us on every place we visited. Both him and our driver were also very professional, always in time and open to any request from us. Every expence was clearly explained in advance and we didn't spend even 1 dirham more than what we planned. I would definitely recommend this experience to anyone who wants to discover what Morocco really is. This is an experience for real travellers, other than simple tourists. Take this chance, you won't regret it!"
        }, 
        {
            "index": 240, 
            "rating": "5", 
            "review": "Great day trip. We hired a guide and a 4 x 4, the trip was very interesting and the guide very knowledgeable. The car was very comfortable and the views spectacular. We also visited two waterfalls of the five set in the hills"
        }, 
        {
            "index": 241, 
            "rating": "5", 
            "review": "Full day Atlas mountain tour. Was a truly amazing day! We arranged the tour via our Riad - The Riad Elizabeth. We were taken to various mountains, lakes, Richard Branson's Retreat called Kasbah Tamadot, the Berber Village and inside a Berber home aswell as a Berber restaurant where we had dinner with a waterfall in front of us. The experience was absolutely breathtakingly brilliant, the best day in Morocco by far! The scenary and landscape is just beautiful - so peaceful and magnanimous in all its glory. Definitely worth going on a full day tour of the Atlas mountains."
        }, 
        {
            "index": 242, 
            "rating": "5", 
            "review": "Ourika Valley and the waterfalls. After reading reviews for those who stayed at Diwane Hotel (recommended by the way); we opted for a day trip via the tourist information centre. We had a private car and a guide for the waterfalls bit too.Our only downside was that it was not made clear we had to pay the guide too for the waterfalls, thankfully we had enough money. The trip was 500 dirhams and our guide for the waterfalls charges 300.It really depends what you are after but if you are the Guilez area, pop over the tourist information centre to organise a trip.My favourite part of the holiday, and I am glad we did not go on a group excursion which we found would cost a lot more."
        }, 
        {
            "index": 243, 
            "rating": "5", 
            "review": "..a private tour of Marrakech is well worth doing at the start of your trip here.. We have just had a great 3 hour tour of the main city attractions. Boy what it worth it!There is no way we could have had just great insight to the city on our own. We now feel set up to explore the whole area on our own - well armed for the market traders!Beware though! It seems that all the guides take you 'favourite' stores for your own personal tutorial about spices, carpets, trinkets and such. They are all just an excuse to sell you there wares. Non threatening but the carpet store manager was a formidable salesman that would well in any secondhand car dealership!Oh, and our guide warned us not to allow any of the sideshow snake charmers to place a snake around your neck for a picture - unless of course you don't mind negotiating the fee of the picture before he takes it off you!Anyway, do the guided tour!"
        }, 
        {
            "index": 244, 
            "rating": "5", 
            "review": "Marrakesh by Air. An early start, but well worth it. Seeing the sun rise over the Atlas Mountains from a hot air balloon is an experience not to be missed."
        }, 
        {
            "index": 245, 
            "rating": "5", 
            "review": "Recommended Private Tour Guide. We arranged a private tour with Senhaji Zaher through the La Mamounia Hotel. He took five of us through the Medina, the Mellah and the Kasbah. He is extremely knowledgeable of the history, culture, customs and he explained everything in excellent English. He has a sense of humour that was exhibited in all of the discussions he held.His email address is senhajizaher1@yahoo.fr"
        }, 
        {
            "index": 246, 
            "rating": "5", 
            "review": "Ourika valley. It was a one day excursion that was a excellent quiet moment outside of the city, mother nature was great as usual and the calm was outstanding"
        }, 
        {
            "index": 247, 
            "rating": "5", 
            "review": "Mountains to Mohammed. We did three tours into the Atlas Mountains, two with local guides called Mohammed. Ourika valley was a quick and exerted 50 minutes unto the falls and back down. Great guide. Ouzoud falls was superb to see and well worth a long day out - 3 hours there and back. We also did a walk at Imlil with a guide which can be as long as you want."
        }, 
        {
            "index": 248, 
            "rating": "5", 
            "review": "Evening excursion. Visiting the city of Marrakech is definitely one to be had.. You need your wits about you at all times"
        }, 
        {
            "index": 249, 
            "rating": "5", 
            "review": "maison yves saint laurent marrakech. we went to maison yves saint laurent marrakech it was great traveled by a carriage beautiful loved the horses"
        }, 
        {
            "index": 250, 
            "rating": "5", 
            "review": "Essauroi - the port. Lovely place. Golden sands, but a fish port. Medina was lovely not harassed like in marrakech and a good tour, very smelly but a fun day out. Was interesting to see people in everyday life, haggle and go up to about 1/4 of what they ask for, prine example fake sunglasses-wanted 100dinar, got them for 3. The views from the fort are excellent, has amazing history and been used in the filming of othello"
        }, 
        {
            "index": 251, 
            "rating": "5", 
            "review": "Atlas Mountains, Souk. Atlas mountains are stunning. Amazing view but only for strong and able bodied people. Soul-market are full of fantastic goodies but you have to bargain a lot."
        }, 
        {
            "index": 252, 
            "rating": "5", 
            "review": "Tours organised by Hotel Ryad Mogador. We went on a few tours. The Atlas Mountains is a must as you visit a lot of authentic barber villages on route and it is the true Morocco. We also went to the coastal fishing village of Essaouira. Very pretty and had a wonderful lunch of fresh fish at a restaurant there. Visited Agadir but not that impressed as it was a holiday resort with very little character."
        }, 
        {
            "index": 253, 
            "rating": "5", 
            "review": "Marrakech palaces and souks. Great guide told us so much about the history and it was lovely to wander the streets investigating the city. You can do 2 half days but combining the 2 is a nice day out"
        }, 
        {
            "index": 254, 
            "rating": "5", 
            "review": "city tour. Take a city carriage ride it was really great to see all the city in this way (better than in a taxi)"
        }, 
        {
            "index": 255, 
            "rating": "5", 
            "review": "Mountains/Waterfalls. We did a day trip out to the mountains, which was stunning. We swum in the waterfalls and scaled a mountain with the help of our lovely guide."
        }, 
        {
            "index": 256, 
            "rating": "5", 
            "review": "Atlas mountains - great trip. We had an excellent tour guide called Yousef and he couldn't have been more helpful and knowledgeable. He stopped when we wanted to and we had a really good trip from 9:00 - 15:00 with a good lunch included (although too much food for us at lunch time). Definitely recommend this trip."
        }, 
        {
            "index": 257, 
            "rating": "5", 
            "review": "Ourika Valley Tour. We began our trip to Maarakesh with the half day tour of the city - it was worth it to orientate ourselves but to be honest I think that most of the places we visited, my partner and I would've found with ease and the map from our riad.However, we took a trip to Ourika Valley a couple of days later that completely outweighed the city tour. Our guide Sa'ad (not sure the spelling is spot on!!) was funny and informative. Along the journey to the waterfalls, passing spectacular views, he told us lots of interesting facts about the mountains, Berber culture and gladly answered any questions we had. Sa'ad took us for a little optional off-roading which made our palms sweat!! But, it was fun and he was a great driver even in windy steep parts of the journey. The waterfall itself was nice, but, as it's the height of summer, the water was a little low. We had lunch in a restaurant that the company use regularly and it was fine. There were tables where we could dangle our feet in the river, if we so wished, to relieve ourselves of the heat. Our only regret was not booking a 3 day tour into the desert particularly if we'd had the same guide, as he was great. Thank you for wonderful day. Well worth the money!!"
        }, 
        {
            "index": 258, 
            "rating": "5", 
            "review": "go where you want to go. After touring the medina and souks of Fes, Marrakech was repetitive on a grander scale. Our private guides showed us the newer sections of the city that have boutiques cropping up everywhere. Unbelievable progress underway. Went into small private collections not mentioned in guide books."
        }, 
        {
            "index": 259, 
            "rating": "5", 
            "review": "Efficient, tour was exactly as described.. We did a day tour out to the Ouzoud waterfalls. The driver and guide were ten minutes early, and then we were off. It was really worthwhile to have a private tour, and to have something organised from this end before you go. (Youseff is very good at getting back to you by email to organise it all before you set off). I paid a deposit by Paypal, and paid the rest at the end of the tour. Nice and simple. Dirhams or Euros are fine.The trip is long, but definitely worth it when you get there. We trekked about, had something to eat, and then when we were done, we found them and we could go back home. SO nice not to have to wait for a busload of lemmings to finish.Our guide Ismail was very chatty and taught us a lot about how Rammadan works and the Berber people. On the way back I think we all dozed a bit (apart from the driver!!). We could stop to take some pcitures of things that grabbed us on our way (so a cattle bartering market, or a french fortress). Nothing was too much trouble. Ismail's English was excellent.The driver didnt speak much English but he seemed obliging enough. It might be pricier than arranging a cab to take you there and back, or to do a bigger tour group. For us, though, this was totally worth it."
        }, 
        {
            "index": 260, 
            "rating": "5", 
            "review": "The best experience ever. This was the best tour I ever made. The tour guide was very kind and funny. The people, food, service, price...everything was perfect! I just can't wait to do this tour again!! 100% recommended."
        }, 
        {
            "index": 261, 
            "rating": "5", 
            "review": "Best Travel Experience in Morocco. Merzougha is roughly a 7-8 hour drive from Fes through the Mid and High Atlas Mountains. It is the best way to see large sand dunes. You arrive and then take a 1-1.5 hour camel ride into the dunes. Many choose to overnight in the dunes with an organized tour. Many options are available from many of the local hotels in and around the area. It is possible to have part of your group stay in a hotel and part of your group spend the night in the dunes. We have arranged and sent many groups to Merzougha and many say they prefer to stay one extra day in the large dunes. You can climb the dunes, snowboard down the dunes. The best time to go is April/May. The summer time gets too hot. Groups find it comfortable to do an overnight in during December and Jan. It is worth mentioning that this is a longer drive from Marrakech and cannot be reached in one day. You can visit small dunes in a city called Zagora which is about a 7 hour drive from Marrakech, yet the dunes there are not even in the same category as the ones in Merzougha."
        }, 
        {
            "index": 262, 
            "rating": "5", 
            "review": "Marroco. The Adventure trips to Morrocco has been one of most unforgettable trips in the world. it is a trip filled with unforgettable and exciting moments. I'd recommend anyone to go on this trip."
        }, 
        {
            "index": 263, 
            "rating": "5", 
            "review": "Unforgettable experience!!. -Great tour guides -Good food-Beautiful Hotels-Mind blowing site seeing -Let me just say the I stayed overnight in the Sahara desert and did not sleep because I was in awe of the amazing night sky. We all then saw the sunrise and it was a moment that I will never forget. You learn about the culture of the desert and just embrace the peacefulness of standing in a sea of sand. -Amazing!"
        }, 
        {
            "index": 264, 
            "rating": "5", 
            "review": "Ridiculously awesome!. This was probably one of the best experiences of my life. I did a three day tour with three of my friends, and I am so glad we picked this. Our guide's name was Youssef and he was awesome! He met is in Marrakech, and from there we began an amazing three day adventure. A beautiful hotel on the first night, a night in the desert on the second, and on the third day we ended up in Fes. I seriously wish we could have done more time in the desert. I can't describe the amazing views, the amazing experience, it was truly unforgettable.I loved our off-road adventures, and our drives through various Berber villages. It's something that you truly have to experience at least once in your life.Make sure that you get Youssef and his driver (forgot his name.....yikes) for this. Truly worth the money!"
        }, 
        {
            "index": 265, 
            "rating": "5", 
            "review": "Ourika Valley with Morocco Sports. I was in Marrakech on business and had just a free day for the sight, then I booked a day trip to Ourika Valley with this company. I had an excellent experience with a private guide/driver(Mohamed) in his comfortable 4x4, he was friendly, knowledgeable, and FUN! Thank you so much. Sure I will be back with my family for a sahara trip.Will"
        }, 
        {
            "index": 266, 
            "rating": "5", 
            "review": "Off-Road Adventures Tour. My girlfriend, other two friends and I recently returned from Morocco. One highlight from the trip was the Off Road Adventures Tour. It was great fun travelling in the dunes and through the berber villages by ATV, it's a good way the enjoy the beauty of sahara. Mohamed, was our tour guide, he was easy to talk to and ensured that everyone was enjoying themselves along the way. The quadbike or ATV, is a must do for anyone travelling to Morocco!!"
        }, 
        {
            "index": 267, 
            "rating": "5", 
            "review": "Go Morocco Sports. Our family has kayaked with Morocco Sports for one day in the whitewater, the experience was amazing and great, the unique thing that we realise it in October and the water is little cold but it’s very fun adventure. Thank Mohamed"
        }, 
        {
            "index": 268, 
            "rating": "5", 
            "review": "Morocco trip and sahara camel ride. My family and I have just back yesturday from a trip with MTE. We had such a great time. We were a little nervous initially about going to Morocco and to africa in general, because of all what happening in Mali and Algeria but we need not have worried. Our stay in Marrakech and sahara camel ride was great, so we recommend the team for averyone who wants to expeience the real Morocco.Thank you again"
        }, 
        {
            "index": 269, 
            "rating": "5", 
            "review": "Special Experience. Riding camel, sleeping in the big tent, watching the sky fulled of stars and singing around the Campfire. This is a experience I have never had before. Everyone should try it and will fall in love with Sahara. Haha~~"
        }, 
        {
            "index": 270, 
            "rating": "5", 
            "review": "Moroccan trip. Last October, we travelled to Morocco with them and had a wonderful time from the start. We were met by Mohamed in the airport, who introduced us to our wonderful guide Said in Marrakech. Our experience was great especially the camel ride in Erg Chebbi sand dunes. We encourage everyone to do it."
        }, 
        {
            "index": 271, 
            "rating": "5", 
            "review": "Amazing Experience in Sahara and Marrakech. We have just back from our amazing experience in Morocco. Our trip was one of the best trip for our honeymoon in Marrakech and an overnight in a berber tent enjoy with thousand stars. Dont miss it!!!"
        }, 
        {
            "index": 272, 
            "rating": "5", 
            "review": "Amazing introduction to the Saharas!. We booked a 4-day tour from a group of 3 young professionals from Fes to Marrakech, and it was by far the best part of our month-long travel in Southern Europe and North Africa. Our guide Joussef was a very friendly and knowledgeable host, with a comfortable Landcruiser that took us to the depths of the desert & close contact with the local Berber culture. Definitely recommended for travellers who want to check out the desert - couldn't have been a better experience!"
        }, 
        {
            "index": 273, 
            "rating": "5", 
            "review": "Ourika valley. Me and my husband did a day trip to ourika valley during an extremely hot day of July. Yousef was our guide and Mohamed was the driver. With these gentlemen we felt so safe and provided us with all answers of our many questions because we were really excited by the local culture of amazir people. Besides, the SUV was very comfortable with AC which really gave us a release from the burning heat. If you are heading to Morocco don't hesitate to book with MTE team. You will get the best of what Morocco can offer."
        }, 
        {
            "index": 274, 
            "rating": "5", 
            "review": "Excellent Day With Morocco Sports. Me and my girlfriend spent an amazing day in Essaouira with Morocco Tours Excursions. Our tour guide Youssef was such great and full of fun gentleman. He let you have all stops for pictures. the day was so busy and we had the chance to see the cooperation of argan oil and had the best fish lunch in the medina. Follow our advice and book your day trip and more with this company, I assure you that you will not regret for that."
        }, 
        {
            "index": 275, 
            "rating": "5", 
            "review": "Amazing experience. I've been in Morocco three months ago and I couldn't ask for a better experience. Great team, very helpful people!"
        }, 
        {
            "index": 276, 
            "rating": "5", 
            "review": "Super friendly guide!. My girlfriend and I went on an excursion to the ouzoud waterfalls, what a sight. The guide spoke very good English, was super friendly and even helped us book some coach tickets. I highly recommend them!"
        }, 
        {
            "index": 277, 
            "rating": "5", 
            "review": "Sahara Adventure. Amazing experience that you will never forget! Everyone should try it!"
        }, 
        {
            "index": 278, 
            "rating": "5", 
            "review": "Sahara at its best!. Simply put, it's the best experience you'll have in many years to come. You'll go to the best stops with the best views, stop at good restaurants, stay in comfortable hotels with great service and, finally, the big night at the Sahara! Easily one of the best things I've done in my life; don't miss it!"
        }, 
        {
            "index": 279, 
            "rating": "5", 
            "review": "Night in the desert. This was a once in a lifetime experience; truly amazing. We traveled around very cool sights around Morocco like the Atlas Mountains, beautiful gorges, and finally the Sahara. The night at the desert was the best part of the trip. We traveled to an oasis on dromedaries, ate typical moroccan tangine, climbed to one of the tallest dunes in Morocco, and slept under the stars. Youssef and the crew were very nice and helpful throughout the trip and they took us to good restaurants and good hotels. I would recommend this experience to anyone."
        }, 
        {
            "index": 280, 
            "rating": "5", 
            "review": "sahara trip. Several years ago, my sister and I would like to take a desert tour trip to Morocco to find out its breathtaking landscape. We found Marrakech Tours and Excursions online and we booked 04 day trip from Marrakech to Fes. Our funny guide his name is Youssef. I can’t say enough wonderful things about his team and the experience they provided for our adventure in Morocco, as 02 girls, travelling to Sahara desert, the tour was better than we could ever have imagined with this friendly guides, take us into incredible scenery, keeping all of us safe without pushing us into doing things we didn't want! If you are looking for an excellent service and amazing trip in Morocco, M.T.E is your place. 110% recommended"
        }
    ]
}