{
    "category": "Marrakech", 
    "entity": "Le-Jardin-Secret", 
    "avg_rating_stars": 4.71304347826087, 
    "review_count": 115, 
    "rating_stats": {
        "poor": 2, 
        "average": 4, 
        "terrible": 0, 
        "very_good": 19, 
        "excellent": 90
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "Perfect escape from the hectic souks. The souks are an amazing experience but after a few hours can leave you feeling tired and stressed. Le Jardin Secret is the perfect escape from all this. The entry is 50 Dirhams which is a reasonable price to pay for a quiet moment of reflection. The garden consists of an Islamic style garden and an exotic garden, both of which feature fountains fed by an ingenious system of water pipes all the way from the Atlas Mountains. There are two cheap cafes where you can enjoy some Moroccan tea and free biscuits for 15 dirhams, with only the sound of trickling water to disturb you. The garden is quite difficult to find, be wary of people offering to \"guide\" you there. Do not give them change until they take you right to the door, and do not feel obliged to pay them at all. Your best bet is to ask for directions to cafe Arabe, the garden is opposite this well known restaurant."
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "A beautiful secret garden. Stumbled upon le Jardin Secret by accident, while browsing TripAdvisor over lunch... The gardens are beautiful and tranquil, with a variety of interesting plants and a few features from the original irrigation system. There's a video on a loop that explains how the place was built. Definitely worth a visit."
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "A delight, just go!. This newly opened garden is a total delight. Two very different gardens offering a haven in the middle of the Medina. There are places to sit, a place for a light lunch or a a drink, information about the planting and the restoration, and a tower which offers fabulous views of Marrakech. We were lucky to meet the man behind the project and his enthusiasm for this garden shows in his attention to detail throughout - plants are named, steps are provided for a better view. Do pay to see the tower, the guides are very well informed and bring the history to life. Do go."
        }, 
        {
            "index": 4, 
            "rating": "5", 
            "review": "Hidden Gem - must visit this garden. These recently opened gardens are well worth a visit - it is a welcome break from the frenzy of the city. We spent 2-3 hours relaxing in the garden, looking at the wonderfully refurbished water system as well the the amazing plants. They have one of the city's highest towers - the views are unparalleled. There is a cafe overlooking the gardens and if you keep your entry receipt they may allow you back in on another day without having to pay again.Before too long this could be one of Marrakesh's top 10 destinations - see it soon!"
        }, 
        {
            "index": 5, 
            "rating": "5", 
            "review": "Secret is the word. Secret is the operative word, we had to ask directions, which is not easy when my French is rusty and Arabic non existant, not every in Marrakech understands English. Once we found the gardens they were fairly recently opened and clean and easy to walk around. There a few benches to rest on, also a café and toilets, all very clean and well presented."
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "Paradise on earth . I was walking along the medina and stumbled across this place by accident. it was just what we needed its a calm oasis in the middle of the hustle and bustle of the medina. We felt at peace straight away the staff explained what the garden had to offer before we paid the entrance fee (50 dirham adult children free) well worth it. It was the most beautiful garden i have been to and i have been to all the gardens in marrakech and many around the world. We just didn't want to leave. They have pomegranate trees,fig tree,date trees and grape trees its just unbelievable. The staff couldn't do more for us from mohammed the waiter to the chef who made the best coconut tart i have ever tasted. Their mint tea was also the best we have tasted. Its the overall ambience we feel that makes this the best place we have visited in marrakech."
        }, 
        {
            "index": 7, 
            "rating": "5", 
            "review": "The Secret Garden. We stumbled across this on our way to the square and decided to have a look. It was a VERY hot day, so we went in for shade as much as anything. I very pretty place with lots of twists and turns and interesting plants. A small cafe inside, but in such hot weather, an ice-cream shop would have been VERY welcome and would have added to their profits nicely I would have thought."
        }, 
        {
            "index": 8, 
            "rating": "5", 
            "review": "A jewel in the medina. We went to see this newly opened garden after reading some reviews comparing it to the Yves Saint Laurent s garden stating it was better, we were not disappointed. Although the entrance is expensive we fully appreciated the work done to restaur these garden. I would highly recommend it. The level of Authenticity is to perfection. It s so peaceful there and the guides are super nice. Lunch was wonderful (had a salad) in this beautiful surrounding. A must for plants lovers and people interested in renovation...it took 3 years of hard labour for this to happen."
        }, 
        {
            "index": 9, 
            "rating": "5", 
            "review": "Lovely garden. A real gem! Two gardens are visible within the walls of this garden, and it is really stunning, both visually and the smells of citrus, rosemary and lavender are beautiful. Climb the stairs at the back of the garden and you will be able to see an aerial view of the Medina."
        }, 
        {
            "index": 10, 
            "rating": "5", 
            "review": "A new spot to visit in Marrakech, it is worth your time. Make sure to ask for the guide at the garden. He will explain the reason why the owner decided to change his mind from opening a Riad to sharing the history and magic with everyone. Also, this is a new spot in Marrakech so if you ve been to Marrakech more than once, you have a new place to discover and enjoy inside the Old Medina. the owners!"
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "A huge surprise. Recently opened place in the mid-medina area. Restored with passion. Wonderful and helpful staff that provides you with all relevant information. Pay the few extra dirhams for access to the tower. Spend the approx. 20 minutes it takes to see the documentary about the place and the renovation, plus the animation on the old water supply systems to the medina."
        }, 
        {
            "index": 12, 
            "rating": "5", 
            "review": "Peaceful. The garden can be found behind high walls in the old town. Once through the doors, you enter a small garden, then this leads into the larger garden beyond. It's an amazing place, so quiet and peaceful, very different from the old town outside. The loudest sounds are of water and birdsong. We were taken round by one of the attendants, who was obviously very proud of the place. From the terrace overlooking the garden you get a great view of the whole site. It's wonderful that only a few years ago, there was nothing here, and the short film of how the garden was conceived and built, is well worth watching. A lovely place in an interesting city."
        }, 
        {
            "index": 13, 
            "rating": "5", 
            "review": "Holiday . We can't put into words how amazing the gardens are if you come to Marrakesh this is one place you have to visit we we lucky enough to be invited to official opening and spoke to the lovely man that owns and restored this magnificent garden it is breathtaking a truly perfect day I will remember forever than you to every one that made our day perfect if you go no wherever else you truly must take in these magnificent gardens"
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "recreation of old gardens in city centre riad. a former palace just outside of the main souks. Good historical exhibition (small) but the gardener has tried to recreate authentic plants and layout of the time it was in its hayday - mixture of Arab and herb gardens with trees and shrubs and plants form around the world. Very interesting if gardens are you thing."
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "Lovely hidden garden. A quiet place to escape when you need a rest. A lovely garden for a wonder. I went with my mother in law and we both enjoyed the day"
        }, 
        {
            "index": 16, 
            "rating": "5", 
            "review": "Beautiful and peaceful. The gardens were lovely, so peaceful and a fascinating story behind it. It's still very new but the planting is beautiful and I can't wait to see it mature. A real must see. Thank you to the friendly staff and owner."
        }, 
        {
            "index": 17, 
            "rating": "3", 
            "review": "so peaceful. I had read about this calm oasis and thought that if we found it we would go in even if it was just to use the free wifi and the western style toilets. On the day we had spent in the Medina my boyfriend found our way to the garden (which wasnt easy) but once you are on the correct street it is easy to find. And yes once inside it is very calming and tranquil with lovely seating areas and a small cafe (we didnt use this) the wifi was great and the lovely toilets a delight lol The gardens themselves are not amazing and I would not make a journey here specifically to visit the garden but if you are in the Medina and souks and need a break from the frenzy then for the price you pay it is worth it for the calm , the wifi , cafe and toilets. It really is nice that they have been renovated , so if you are in the Medina and find the garden do go in."
        }, 
        {
            "index": 18, 
            "rating": "5", 
            "review": "Better than the Majorelle Gardens. While Yves Saint Laurent Majorelle Garden is lovely, we enjoyed the Le Jardin Secret more. There is a fascinating story about how they discovered historic water features of the garden and it is more authentically Moroccan than Majorelle. There is a wonderful cafe on the grounds too."
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "YET ANOTHER OASIS OF CALM IN THIS CRAZY CITY!. This place was recommended to us by our hotel, and it's certainly worth taking the time to visit.Located a short walk from the main square, this place is an absolute gem!From the moment you enter the entrance foyer, you're transported back in time.The gardens have only recently opened & the level of restoration work is something to behold.We were given a short, escorted tour & brief history of the gardens by Amine, a very knowledgeable & friendly guide who answered all of our questions with ease and really seemd to be enjoying his job, a very nice guy!We were then passed over to Jawad, who's the guide for the the tower. Once again, his knowledge was very extensive, and he was more than happy to answer our questions & take plenty of pictures of us. Again, he really seemed to enjoy his job and it showed.The gardens themselves are a delight to see. The restoration has been very thoroughly done, with plenty of information boards around, showing the progress from ruin to beautifully presented gardens. It's a fascinating place, ideal for whiling away an hour or two, and all for around £5 per person."
        }, 
        {
            "index": 20, 
            "rating": "5", 
            "review": "5 stars, absolutely wonderful!. Visited here on the 8th October, late afternoon. We'd been told this was a great place to visit, but really weren't prepared for just how great it actually was! The gardens themselves are outstanding - beautifully designed and maintained - photos really don't do it justice. You really need to see it for yourself.The staff were incredible too, extremely helpful and knowledgable. We chose to buy tickets to go up the tower as well, and were not at all expecting the personal tour we got, which was wonderfully informative. Our tour guide Jawad was amazing, he knew everything about the place and explained it to us in a really engaging way. He was also kind enough to show us the panoramic view from the top of the tower and point out all the important landmarks, looking out over Marrakech. Lastly, the cafe provided us with delicious beverages and the waiter who served us was absolutely lovely. We will 100% be returning!"
        }, 
        {
            "index": 21, 
            "rating": "4", 
            "review": "HISTORICAL RESPIT FROM CITY. This unexpected Secret Garden is a surprise so close to the center of Medina activities. There is a good story illustration about the history of the family and garden and a pleasant way to spend a little time. The refreshments are served in a hot spot on the patio and not very inviting on a hot day."
        }, 
        {
            "index": 22, 
            "rating": "4", 
            "review": "Fantatsic views of Marakesh. Le Jardin Secret is well worth a visit.We just stumbled across the gardens and were so pleased that we did venture inside as the gardens are a real surprise - very beautiful and well laid out. It is so peaceful inside - a relaxing escape from the hustle and bustle of the souk.Make sure that you buy a ticket to climb the tower as the views of Marakesh and the surrounding country side are amazing.The tour guides are very passionate about the gardens and were very knowledgeable."
        }, 
        {
            "index": 23, 
            "rating": "5", 
            "review": "Good place for relaxing. Nice place.. more relaxing in Medina from souk with à lovely guid Jawad.And also food is good and nice.Next time again."
        }, 
        {
            "index": 24, 
            "rating": "5", 
            "review": "Oasis in the heart of Marrakech's Medina. A mesmerizing oasis to get away from all the hustle and turbulence of the Medina.Le Jardin Secret is divided into two different gardens. The area was built back in the early 16th century in the Saadian dynasty but was deserted for a long time, falling in a state of disrepair. An Italian architect restored the ancient structures of the building lately and re-opened this beautiful garden in 2016.You can now visit an exotic garden an the islamic garden, both served by the original ancient water system which served the whole Medina with the water from the Atlas mountains once. I was amazed by the craftily system which was explained to me by a very friendly, heartily guide.You should also visit the tower at the corner of the garden. It is higher than the rest of the buildings in the Medina, offering a stunning view over the whole city and beyond to the Atlas mountains."
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "Secret. 50 dirham entry each. Inside it is very quiet and peaceful. Nothing like the outside. You can get some really beautiful pictures"
        }, 
        {
            "index": 26, 
            "rating": "4", 
            "review": "Nice after the tour in the tower. Buy the ticket for the tower. the tour guide will explain the history behind this garden and location. without it, it is just another garden."
        }, 
        {
            "index": 27, 
            "rating": "4", 
            "review": "Go here first!!! . Great place to go and have a quiet chill before heading into the hustle & bustle of the souks. The staff here were amazing & gave us a little tour. You can also go up the tower here & look over the whole medina, the staff were again great, they took our map & pointed out all the places to go. Go here on your first day!"
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "Favourite find. Love visiting the gardens-so beautiful and tranquil. The staff are very friendly and attentive.Great cafe to chill out in-will be back!!"
        }, 
        {
            "index": 29, 
            "rating": "5", 
            "review": "I promised to leave a good review... . Gawad made me do it!! Gawad met us in the garden, and was incredibly informative and entertaining about everything within the garden, then we went up the tower and he was brilliant about everything we could see from the tower. We ducked in to get something to drink and to get out of the markets for a bit, we were also hesitant to pay the charge to get in, but after being in there, totally worth it.I would recommend as a visit either early into your visit, as the view is the best I saw of the city and surrounding mountains, to plan where you would be interested in, or towards the end, should you become weary of the pace of marrakech and want some quiet space. Ate here too, food was good, the cocktails (non alcoholic, naturally) were amazing. The iced tea was perfect for the heat, could drink that all day."
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Awesome secret spot.. Definitely one of the best hidden spots in Marrakech. So peaceful and quiet. The smells as you walk around are mesmerising and plentiful. Jawad is also a special member of staff, so knowledgeable and friendly."
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "Delightful find in middle of souks. Beautiful gardens, fabulous views over whole of Marrakech and really helpful friendly charming hosts. A must see!! Only reason I said no to being popular with tourists is because it's only been open 5mths and they've not discovered it ! It's not yet in Lonely Planet!"
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "A little bit of fresh air in the medina. Very nice gardens and buildings. The photography series of the restoration is very interesting. There are 2 cafes that will be open soon and they look nice and cosy. It's a zen atmosphere, perfect contrast with the bubbling Medina and souks. Well appreciated."
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "A delightful secret garden. You must find this wonderful garden in the midst of the souks, it is absolutely fantastic and a must see !!! The guides are lovely and you definitely benefit from their knowledge. Everyone who works in the garden loves their job. Take time to relax with a mint tea after wondering around and prepare yourself for the lively noise when you return to the souks. Its even more amazing when you learn that the owner was going to build a hotel on the site but after discovering the ancient irregation system he decided to create this amazing garden. An amazing legacy."
        }, 
        {
            "index": 34, 
            "rating": "5", 
            "review": "A gem in the medina. The new Le Jardin Secret, is really a gem in the crown of historical renovations in the medina. The gardens represent both local and international flora and fauna, set within the historical architecture of times long past. I especially enjoyed being able to see and trace the actual process of water distribution and irrigation of the site today, just as it was more than 400 years ago. This beautiful garden is located in a popular area of the medina, yet once inside the walls, you would never know the life buzzing just outside. It is a calm and peaceful place, where you can even enjoy a coffee or snack. It is a place of sanity, within the excitement and noise of the souks and medina."
        }, 
        {
            "index": 35, 
            "rating": "5", 
            "review": "Tired of the hustle and bustle of the Medina?. This garden is, as stated in other reviews, an oasis of beauty and calm. I was surprised to find this place in the middle of everything that goes on in the Medina but there it was - a garden so lovingly restored to surpass it's original (imagined) beauty.The garden is young but it rejoices in the ancient knowledge of water which it still uses for irrigation. I predict that in time, this garden will be more popular than the lovely Jardin Majorelle. What fascinated me the most in this garden was the lengths the restoration crews went to to keep all the construction methods authentic and hand made when it would have been so simple (and a tragedy!) to utilize new methods.When you are tired of the markets and the souks, catch your breath and relax here.You will be happy that you did."
        }, 
        {
            "index": 36, 
            "rating": "5", 
            "review": "A beautiful discovery. Off the dusty, narrow streets of the medina in Marrakech, lies a place close to being heaven on earth. This place is called Le Jardin Secret. For more than 70 years, this ancient Riad and garden was left to rack and ruin but since 2008, the garden and it's architecture have been renovated and rejuvenated back to their former glory. For the first time in over 400 years, the Riad has opened its doors to the public. The Riad was home to some of Morocco's rich and most influential people. There is a pavilion and tower with a terrace that you can look over the garden and city of Marrakech. There are two gardens irrigated with water from the Atlas Mountains. The first garden is an exotic garden filled with plants and trees from the five continents, bursting with the scent of lavender. The other is an Islamic garden. All Islamic gardens are based on Heaven and have an Olive, Fig, Date and Pomegranate tree with a a fountain of water in the middle to represent life.There is a cafe where you can sit in shaded the garden and enjoy the tranquility of this secret haven with lunch of panini, french fries with delicious homemade coleslaw, homemade dessert and a cool drink of fresh juice, bottled water or mint tea, whichever takes your fancy. It also has free wi-fi but you'll have to get the code from a member of staff.The Riad and garden has an interesting story to tell, there is a video to watch on how the project was cleverly but painstaking put together and there are guides to tell the history of this most beautiful discovery with information on its plants and the 1000 year old water system that still irrigates the gardens today.We were also privileged to meet the owner who kindly gave his time to tell us how he came to acquiring and renovating the buildings and garden.Entrance fee is 40 MAD so it if you want to get away from the hustle and bustle of the souks and experience something serene and special for an hour or two in the heart of the medina, then Le Jardin Secret is the perfect place."
        }, 
        {
            "index": 37, 
            "rating": "5", 
            "review": "Spiritual and beautiful oasis in the heart of the Medina. Easy to find, these peaceful gardens are magical and you don't want to leave. A large riad renovated beautifully, with its irrigation system and two very different gardens where you can find a spot to sit down and get a thé à la menthe or some (very good) food. Don't forget to go up the tower (extra charge but worthit), it is one of the best views on the Medina and really worth it.Few people know about it but it will surely be very popular, and the staff, passionate about the place and the whole project, is incredibly welcoming and informative. Iðll be back, for sure!"
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "Wonderful place. That's a very beautiful place to visit with plenty of history hide in this site, it costs 70dh including the tower but worth it. When you come in ask for Amide is the best guide you can have, very friendly. Thanks Amide for the nice time!!!"
        }, 
        {
            "index": 39, 
            "rating": "4", 
            "review": "Peaceful oasis . Worth a visit to see the amazing transformation of a derelict site back into a tranquil garden. The garden has themed areas and is based on Islamic traditions. Some lovely features to look out for and the irrigation system is pretty amazing. Guides will explain the gardens and the cafe is a good spot to have a cool drink."
        }, 
        {
            "index": 40, 
            "rating": "5", 
            "review": "A peaceful respite from the hustle and bustle.. A beautifully restored garden away from the hustle and noise in the city. Guides are free and knowledgeable, thank you Amine. Good quality snacks and drinks. Great views from the tower."
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "Paradise in the Medina. If you have had enough of the madness of the souks, come to this lovely garden to rest your feet & soul in the middle of the Medina. Beautifully refurbished space, a very calming and pleasant atmosphere to recharge your batteries..."
        }, 
        {
            "index": 42, 
            "rating": "5", 
            "review": "Beautiful and Peaceful. The gardens have been beautifully restored and this is a must see if you are in Marrakech. They are so peaceful, it is hard to believe the hustle and bustle of the souks is only a few metres away! It is definitely paying the extra to go to the top of the tower to view the city and whiling away a few hours of lunch was wonderful."
        }, 
        {
            "index": 43, 
            "rating": "3", 
            "review": "Beautiful renovated gardens . This is a beautiful renovated riad garden. It's quite small but very tranquil. There were hardly any visitors when we were there which made it even more peaceful. There's a video of the renovations which has some interesting information on the traditional Morrocan building techniques and garden structure. It was 40 dh so pricier than some of the bigger more established places but worth a stop while meandering through the Souks. There's also free WiFi throughout the garden."
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "A must while in Marrakech. I am sitting in the garden whole writing this review. I am afraid the staff will have to kick me out. The restored gardens are stunning, peaceful, magical and spiritual. My guide Amine was very well normative and passionate about the history the restoration process and sharing this magical secret garden. His English was perfect. The view from the tower is the best in the Medina giving a great perspective. A must while in Marrakech. Don't leave without visiting"
        }, 
        {
            "index": 45, 
            "rating": "4", 
            "review": "Garden shows history and medicinal qualities. Althought it was not the best season for this garden, it is worth seeing for the beauty of layout and the understanding of medicinal plants"
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "Tranquil and interesting. Beautiful gardens and an interesting story behind it. The guide we had, Mohammed, was very knowledgeable and charming. At the end of the tour he brought us a map and marked some great places to visit, with some insider tips.We had mint tea on the veranda, but soon a roof top terrace will be opening for lunch.Recommend going up the tower, as it offers a stunning photo opportunity."
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "Blissful tranquility and serenity. Stunning. Beautifully designed. A perfect escape from the bustle of the souks.Cafe serves great food too."
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "Stunning tranquility. Such a beautiful restoration of a large riad garden. Well worth a visit to linger in either the exotic garden or the Islamic garden. Watch the video and view the photographs to appreciate the scale of the project, carried out by local craftsmen and labourers. An hour well spent in respite from the bustle of the medina."
        }, 
        {
            "index": 49, 
            "rating": "5", 
            "review": "Amazing Gardens. Two amazing gardens irrigated by water from underground aqueducts from the atlas mountains. A very knowledgeable guide showed us around and explained why the plants were chosen and where they came from in the gardens and history of the water system. You can pay extra to visit the top of the tower and see views across the Medina to the atlas mountains."
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "Lovely - must see, a lot more than just a garden. We were al mesmerised by the way this garden has lovingly been restored and the history preserved. For us it was a fascinating insight to Marrakech life and culture - not just now but hundreds of years ago as well. This coupled with the strong rosemary scents were both intoxicating and mesmeric - we highly recommend a visit. The staff we met were both interesting and intelligent about the project too."
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "Serenity in Marrakech - Le Jardin Secret . Add this place to your must do list. How to find it: - it's not been open long,  so look for Arabe Arabe. Le Jardin Secret is just opposite.After a hot non-stop \"tour\" through the souks of Marrakech, trailing behind an uncommunicative local guide, we were in the mood for a cooler change. We'd seen Medinas before. Something different, please! First up next morning was the Jardin Marjorelle. Easy to find: shaded; stylish; busy.But the highlight was yet to come  - Le Jardin Secret/The Secret Garden. What a place - a lovingly restored Riad with 2 beautiful gardens. The interior richness hidden from the outside gaze. Here you are a welcome guest - ushered in, shown the delights of the place by Mohammed and Jawad who clearly delight in it also. The video is excellent and you get a real appreciation of how much care and loving attention to detail has gone into this faithful reconstruction by its Italian owner who has clearly made this a labour of love. It's a place of beauty. Already relaxed, we sat in the shade beside running water, admiring the Islamic garden whilst mint tea and tasty panini were served by Mohammed our waiter. The people here have been hand-picked. We felt quite special, really.We weren't going to shop, but they have great stuff! Hand made locally - some of it by the artist who works there, some by a women's cooperative. Summary: hospitality, beauty, history and style. Leave the souk behind."
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "Tranquil place to visit on a hot Moroccan day!. We were lucky enough to visit the Secret Garden on a quiet day. In fact, we were the only visitors for a while which made it feel like your own private garden.The staff were keen to share with us why the garden was laid out as it was and why certain plants were important.The loan fans were a nice touch on the way in!"
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "Definitely place to visit. We had some problems to find it, but definitely it was worth it.Amazing place full of fragrant plants and herbs. Jawad was brilliant guide and made our visit even better. After tour we had lovely lunch and drink in the garden."
        }, 
        {
            "index": 54, 
            "rating": "5", 
            "review": "Arhitectural en Engeneering MUST. Just sooo impressed by the ancient old techniques. By the stunning work that has been done there. Go and see the film first. It makes such a difference to understand it."
        }, 
        {
            "index": 55, 
            "rating": "5", 
            "review": "Tranquil escape from the hubbub outside . Very well built and maintained garden, with friendly and helpful staff who were generous with their time. Lovely job!!"
        }, 
        {
            "index": 56, 
            "rating": "5", 
            "review": "Lovely secret garden. It was lovely to find out the history and see the renovation of this place on video in the gardens. The views from the tower are stunning and the guides are very knowledgeable and friendly. Two beautiful and very different gardens, set back from the hustle and bustle of the Medina. So peaceful you could sit and relax for hours. Also has cafe and several proper toilets! Would recommend a visit. :)"
        }, 
        {
            "index": 57, 
            "rating": "5", 
            "review": "Calming greens and blues in spacious light after shafts of rainbows in the dusky souks. A shopping dawdle in the souks, having dragged the children away from the pool, was wonderfully interrupted by this surprise gem. Cool drinks and mint tea along with apple pie whilst absorbing the thought provoking tranquility, listening to trickling water whilst feasting our eyes on the planting and sympathetic renovations enhanced our humour on a boiling afternoon. We had the whole garden to ourselves for about an hour which we are sure will become a rarity. The research, love and care that has gone into the project is evident. We can imagine a beautiful wedding party walking in joy through the souks to arrive at the garden for photos and celebrations."
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "An oasis of tranquility in the midst of the Souks. So, so glad we found this garden through trip advisor- it wasn't in our guide book as it has only been open 5 months.The whole area has been transformed into two most beautiful & peaceful gardens one of which is based on an Islamic garden. I cannot begin to describe the peace as soon as you enter, the guides fitted about are unobtrusive and informative- of particular interest is the way they have used and old watering system bringing water from the Atlas Mountains. We were lucky enough to meet the modest owner whose idea it was to transform the space back to gardens rather than possibly a more profitable Risd. He was undoubtedly proud of the work that had taken place here.Well worth a visit right in the heart of a busy bustling city."
        }, 
        {
            "index": 59, 
            "rating": "5", 
            "review": "Amazing caring custodians !!!. We were so gobsmacked at meet the Mauros who are here for a visit til tomorrow. They are so interested in their project !! We were also very excited to meet the many caretakers there. We went back the next day for coffee and cake and were invited in. \"This is your home\" the restaurant waiter told us where to go sightsee in the medina. And even drew us a map !!"
        }, 
        {
            "index": 60, 
            "rating": "5", 
            "review": "Wonderful, quiet oasis in the medina. What a stark contrast from the rest of the medina! You walk into the garden and are greeted by a beautiful landscape and the calming flow of water. The gardens, once part of the mosque, were abandoned for years. They were restored between 2013 and 2016, and the place just opened in February of 2016. We had the great opportunity to meet the architect and owner -- an Italian guy who has lived in Marrakech for years. If you have any question of whether it's worth the visit, check out their video on YouTube (just search Le Jardin Secret Marrakech, and you'll find the video in a few different languages)."
        }, 
        {
            "index": 61, 
            "rating": "4", 
            "review": "Very nice. Very beautiful garden with a tower which shows a beautiful landscape of Marrakesh and Atlas Mountains but quite pricey for what they offer to the visitors."
        }, 
        {
            "index": 62, 
            "rating": "4", 
            "review": "Tranquil gardens with an interesting film and nice cafe and shop. We are not normally chasers of nature but enjoyed visiting this garden (more than majorelle). It was pretty and tranquil, and there's an interesting 20 minute film about the recent renovations which was great. Staff are friendly, and passionate about the site, and we were lent hats and fans which was appreciated in the August heat! We were surprised how large and tranquil the site was considering its location in the souks."
        }, 
        {
            "index": 63, 
            "rating": "4", 
            "review": "Beautiful garden. A very beautiful relaxing garden in the heart of a buzzing Marrakech, well worth the visit. There are plenty of benches to sit and just relax. Its peaceful and it aslo give you an opportunity to see the residents of Marrakesh enjoying a day at the gardens."
        }, 
        {
            "index": 64, 
            "rating": "5", 
            "review": "Beautiful, Peaceful Gardense. These gardens are so lovely, definitely an oasis of calm in the busy city. There is lots of information on their history. When we went, there was a extremely helpful and friendly member of staff who told us even more about the gardens and even guided us around which was an amazing extra! The cafe is lovely and the food and drinks are not overpriced and taste delicious! Definitely worth the entry price,a must see for me!"
        }, 
        {
            "index": 65, 
            "rating": "5", 
            "review": "Great Visit. . A lovely garden. Not as famous as Majorelle but if you combine the two on a day you will be disappointed in either. A good day out enjoying two beautiful gardens."
        }, 
        {
            "index": 66, 
            "rating": "5", 
            "review": "Great Garden Concept. Read about the Gardens before coming back to Marrakech this year ,and on the day I entered the gates were transported to another world in both the Garden and History of the place ,tales of the Harem and what went on in the main house told to me by an enthusiastic member of staff .As I walked in and payed ,the place had just opened as it was so hot would have liked it to open earlier but saw the staff getting a morning debrief before the tourists arrived .Staff and Garden are new and are pleased that jobs have been created here also got to meet the charming Italian Owners wife and son .The Gardens are not like one we are used to but set out in Islamic style even the water contains no fish or plants,found it fascinating how it would have been watered with clever irrigation from the Atlas Mountains .Had a cold drink in the cafe area over looking another Garden with the tower in the corner ,would have liked to have eaten there but had had breakfast earlier.One the way out went into the small shops area and bought two plaques made from Cedar wood one painted in a beautiful pattern and signed by the Artist who was in the shop the other I had painted Gold on part of the carved Cedar wood pattern .Came away loving this place and hope to return when are next visiting Morocco."
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "Stunning little oasis. Beautiful gardens and lovely little cafe for a refreshing cool drink in the shade. Interesting history and film show as well."
        }, 
        {
            "index": 68, 
            "rating": "5", 
            "review": "Amazing jewel in the Medina. What an amazing restoration project this has been - a beautiful tranquil Riad with 2 amazing gardens, following the Moroccan traditions of transporting water to enable irrigation of the beautifully planted gardens, Very helpful, enthusiastic & knowledgeable staff on hand to help you enjoy the place, we followed our tour around the gardens with a \"Virgin Mojito\" on a very hot afternoon this was a great break. Well worth a visit if you are in Marrakech - its tranquil and beautiful."
        }, 
        {
            "index": 69, 
            "rating": "4", 
            "review": "Peace in the midst of the bustle of the souks. This is a charming, tranquil garden in the middle of the souks. The vegetation is not particularly colourful, but the archways and water features are pictureque stopping points. There is an interesting film about how the garden was created (by hand, no machinery) from the ruins of a riad."
        }, 
        {
            "index": 70, 
            "rating": "5", 
            "review": "Beautiful spot. We spent our last two hours in Marrakech in this wonderful small garden in the heart of the Medina. It has only recently opened after an extensive renovation and the staff are all so friendly and so eager to share about the history of the building and the renovation. We took our time wandering around as it was hot but it was so quiet and peaceful - don't miss going up the tower even though there is a small additional charge. The view from the top is great and the young man there was so friendly and informative. We had a snack and drink from the small cafe while sitting in the shade and despite the heat it was cool and relaxing and again, the service was great. Nice small gift boutique as well with a local artist working in there - he signed the piece we purchased."
        }, 
        {
            "index": 71, 
            "rating": "5", 
            "review": "Lovely quiet corner in a busy city. A great corner to take a break from the busy souks. The gardens are beautiful and the renovation story fascinating. The staff are understandably proud of the gardens and took the time to explain the meaning behind different areas. One of my favourite attractions in Marrakesh."
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "small pleasant rest from the heat and the grinding sales persons in the souk. NICE garden worth the stop and the $5 , had tea there and it was reasonable considering we had the whole garden to ourselves .... worth the stop good place designate as a meeting spot if your with a group .... had a lovely server ..... again its a nice rest from the souks salesmen"
        }, 
        {
            "index": 73, 
            "rating": "5", 
            "review": "Stunning gardens. Tucked away in the Souks, and a little difficult to find, but well worth the hunt! This place is relatively new, but it is already gorgeous - I can only imagine how amazing it will look in a years time. We were greeted by amazing staff who talked us through the irrigation systems, which is incredible! They talked to us about the lay out of the garden, for both the exotic and Islamic gardens, and we learnt so much about the plants themselves as well as the meaning behind each design - really enlightening. We sat and enjoyed mint tea on the terrace, served by Jawad who was incredibly attentive. Would highly recommend this spot for a visit."
        }, 
        {
            "index": 74, 
            "rating": "4", 
            "review": "Peaceful Garden. We came across this garden by accident, but it was a pleasant suprise. The exotic garden en the islamic garden are beautiful and peaceful. The garden offers a great escape from the chaos of the souks and the crowd. The staff was very friendly and provided lots of information about the history of the garden and its symbolism. It's recommended to also buy a ticket for the tower - it has a great view!"
        }, 
        {
            "index": 75, 
            "rating": "3", 
            "review": "Okay. Le Jardin Secret is okay to go and see if you're in close proximity to it. The gardens are okay and it is quite pretty but there's not actually much to see. I saw someone on here say that it was better than the Majorelle Gardens which is the most ridiculous statement I have heard as they are incomparable, the Jardin Majorelle is really absolutely stunning.My favourite thing about Le Jardin Secret had to be the hilarious waiter who asked me if I would marry him."
        }, 
        {
            "index": 76, 
            "rating": "5", 
            "review": "Peace and beauty. Great to go here for a little peace when trying to escape the craziness of the souks. Pay the extra dirham to go to the top of the tower; the views are amazing."
        }, 
        {
            "index": 77, 
            "rating": "4", 
            "review": "Great looking Garden. After visiting the Place Jemaa El Fna, we visited this garden on the opposite of the Café Arab. It is a nice little garden with a Medditerraine part and also an Islamic Garden. the man from the garden was nice and explained why certain plants and trees were in the garden."
        }, 
        {
            "index": 78, 
            "rating": "5", 
            "review": "Great place, great view!. It's one of those places you mist visit. The garden is very nice a Jawal, the guide, makes you feel at home. He talked to me about the garden and how the Kuran is tied to the design. Jawal also showed me the different plants,their names and what they where used for. The tower inside of the Riad is 7 storiea high. You can climb it and take amazing panoramic pictures. Right across is Cafe Arabe which I recommend to get a bite to eat."
        }, 
        {
            "index": 79, 
            "rating": "5", 
            "review": "Wow! What a stunning, and truly special place.. This was by far the best garden I visited during my time in Marrakech. It really was beautifully kept, and provided tranquility within the chaos of the medina. Entry was a reasonable price - you pay approx 40 Dirham for access to the gardens and an additional 30 Dirham for the tower where you can see right across the medina. Spectacular view! I also liked the information and educational details, provided in perfect English. This is also still very new to Marrakech so not known by all the tourists like Jardin Majorelle is. You can also stop for lunch at Cafe Arabe across the street from the garden. Loved it!"
        }, 
        {
            "index": 80, 
            "rating": "5", 
            "review": "Loved this shiny new garden. The garden just opened recently we were told and it looks perfect. So handy as its in the centre of the town too. we loved it."
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "Truly beautiful and tranquil . This place is like stepping out of Marrakech and into another world. Both gardens are beautiful and we'll worth a visit. The staff there were very friendly and informative. I got some mint tea and biscuits while in the garden, reasonable prices for all the food there. A proper hidden gem and a very nice place to come across accidently. Definitely worth a visit just to get away from the hustle and bustle of the city for a while."
        }, 
        {
            "index": 82, 
            "rating": "2", 
            "review": "Waste of time and money. Not sure if I came at wrong time of year but garden just seemed overgrown, nice structure and location but it didn't do anything for me. Just go to Jardin Majorelle instead, this is only worth 10 minutes if you're passing by."
        }, 
        {
            "index": 83, 
            "rating": "5", 
            "review": "Inspiration. Best Place ever. Beautiful Gardens. Watch the video about the restoration. Visit the tower! And have a drink or lunch in the restaurant. A Mindful experience."
        }, 
        {
            "index": 84, 
            "rating": "2", 
            "review": "10 minute walk around. We left this for our last day and only spent 10 mins walking around. We skipped the tower as the views of the city all seem to be similar and still cost 40dh to get in. Wouldn't go out of your way. Very few flowers - more about the history and how the irrigation system works."
        }, 
        {
            "index": 85, 
            "rating": "3", 
            "review": "Not bad - not great . Popped in here as we happened to be nearby on our last day in Marrakech and the reviews were good.Very cheap entry, only 40DH, staff were very nice and welcoming - stored all our bags from shopping at the souks for free.Lots of information about the gardens and their restoration was available which was nice.The gardens themselves were OK, a bit boring to be honest. Very average. We had a very funny chat with one member of staff in particular while we had a drink in the cafe, not 100% sure of his name (maybe jawad??) but he was hilarious, if a little strange."
        }, 
        {
            "index": 86, 
            "rating": "4", 
            "review": "This place is a secret!. We were told about these gardens by the owners of the Riad where we were staying. It's tricky to find but use of a map and GPS will lead you to it. The gardens are opposite the Cafe Arabe which is a highly recommended restaurant. It's not cheap to go in the gardens but heck you are on holiday! The gardens have two areas and you can also visit the tower if you wish. There are photos of the site before it was renovated and the gardens created - what a difference! Not quite as nice as the Jardin Majorelle but still lovely and peaceful."
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "Stunning. We felt rather disappointed with Jardin Majorelle, this however, surpassed all expectations. Tranquil, beautiful with fabulous explanatory video of its restoration. I'm not a spiritual person, but the significance to the Islamic faith of the design & plants was interesting & informative. Photographic paradise. The staff were friendly, helpful & informative. Well worth a visit."
        }, 
        {
            "index": 88, 
            "rating": "4", 
            "review": "Lived up to the newspaper review.. A real pleasure to step out of the hurly burly of the souks and wander around these beautiful gardens. We had a snack lunch which was tasty, just what we needed."
        }, 
        {
            "index": 89, 
            "rating": "4", 
            "review": "Quiet in the middle of the city.. I wish we had longer to spend in this small garden but didn't realise the video about the construction was 20+ minutes and had to rush back to the bus to our hotel. The gardens themselves, one Islamic and one exotic, are beautiful. We didn't pay extra to go up the tower but you could really appreciate the beauty from the balcony. The cafe also looked lovely and the tour guides there were very informative, telling us all about how the water travels to different parts of the garden. We only paid 40 dirhams each as they were still working on the garden as it had not been open long."
        }, 
        {
            "index": 90, 
            "rating": "5", 
            "review": "Pleasant surprise!. I wasn't really expecting much, since I wasn't too impressed with Jardin Majorelle. I'm not a huge garden fan in general, but this place impressed me! I found the history and restoration so facinating. You must watch the video, which is located in a small view room 1/2 way through the garden - it really makes you appreciate the garden so much more. Also, read about how water is distributed through out the garden - it is so interesting!"
        }, 
        {
            "index": 91, 
            "rating": "5", 
            "review": "A beautiful little accidental find. If you have an hour or so, do not miss the Le Jardin Secret Open Air Museum. The palace has been rebuilt and the gardens restored by a design team lead by an Italian architect. The property has an ancient ceramic aqua-duct fed by the Atlas Mountains and has been beautifully restored to its original glamour. The 2 tour guides that showed me different sections of the site (included in the entry fee) were informative, lovely and very welcoming. They both spoke beautiful english. The information provided is also in Moroccan Arabic, French and English so I was able to get a lot of detail about the history. The islamic garden and the exotic garden were both beautiful, and have inspired me to do more in my own garden at home in Australia on return. A fantastic little site in the heart of the Medina."
        }, 
        {
            "index": 92, 
            "rating": "5", 
            "review": "True escapism!!! Worth a short break. We didn't plan to visit this place. The last minute we decided to visit and it was a good choice.We start with a quick cafe on the terassa. The service was so welcoming.Then we visit the chamber where there is a 23 min. Movie in French or English , that tells you all you need on this place and it renovation.Then we hang around the two gardens listening to the water, fallowing the irrigation system. One Islamic gardenAnd one exotic.We finished at the unique tower that is a perfect spot to see the Medina, since these days it is not allow to built higher then8 miter at the Center and here we could climb 17 meter to view.Going down we stopped at the cafe againThis time for fresh cut fruit salad and tortia with fresh veg salad.It is little higher price then the normal price of heart Marracech, but you can feel the western touch taking care of the local treasures"
        }, 
        {
            "index": 93, 
            "rating": "5", 
            "review": "Hidden Gem. Amazing place. Takes you away from the crazy streets. We loved it. The peacefulness of it & relaxing atmosphere We didn't eat here but plan to go back before the end of our stay"
        }, 
        {
            "index": 94, 
            "rating": "5", 
            "review": "Wonderful find. Stumbled by the Gardens as we walked past and realized they just opened last month. 20% off entrance fees of 50dhs for the gardens - additional 30dhs for the tower. Staff were wonderful - they approached to give a background of the place. The view from atop the tower was beautiful - the Atlas Mountains would be beautiful if the sky was clear. Sitting by the pool for a cuppa was relaxing - the coffee one of the better ones here."
        }, 
        {
            "index": 95, 
            "rating": "5", 
            "review": "No longer a Secret, a must to visit. After 6 years of restauration the Secret Garden opened in April 2016. The restauration has been done with great care and attention to detail. There are 2 gardens, the Exotic garden has plants and trees from all over the world and the main garden is Islamic. All beautifully done. 3 comments, 1. Staff were all very helpful and informative, 2. There were several excellent descriptions of the plants and irrigation, 3 Well worth seeing the 20 minute film about the restauration"
        }, 
        {
            "index": 96, 
            "rating": "5", 
            "review": "Great garden, very peaceful . What a lovely garden. It was very quiet and peaceful. There are two gardens, one with exotic plants and another more traditional Islamic garden. There is also a tower you can go up, which costs extra, but it provides a panoramic view over Marrakech."
        }, 
        {
            "index": 97, 
            "rating": "4", 
            "review": "New history created . Went out if our way to visit here. It was raining so we almost had the place to ourselves. Had a basic but freshly cooked snack in the courtyard under umbrellas. It is worth paying extra for going to the top of the tower. Interesting and a different addition to the history of the area. The gardens are new so I would say in a couple of years they will start to show their true beauty more but the Islamic design is true to its origins. Worth a visit."
        }, 
        {
            "index": 98, 
            "rating": "5", 
            "review": "Great atmospheric restaurant.. Whether you are looking for a terrace to take a drink or a courtyard to enjoy a meal then this is the place. Semi-formal service but very pleasant staff who were initially quietly distant but, as you conversed more they opened up and were very charming. Would eat there again."
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "Wonderful Oasis. Last week I was excited to discover that a new open air garden museum has just opened in the Marrakech Medina. The Secret Garden can be found in the Mouassine district of the souk, just opposite the restaurant Cafe Arabe.You initially enter through the Exotic garden, which is filled with plants from around the world. This garden has a contemporary feel, with the eye being drawn through by an Islamic inspired water rill.The second “Islamic” garden was restored, following what would have been the original 18th century layout. Water is at the heart of each garden, and increases the sense of tranquillity and as a place of contemplation.A tower found in the far right corner of the Islamic garden can be entered for an extra fee, currently 30 DH. This does seem rather expensive, considering that the fee to enter the garden itself is 40 DH. However, from its roof terrace, you can enjoy good views over Marrakech, as well as a “birds eye view” of the garden itself.Should you wish to linger a while longer, two cafes are found within the Islamic garden serving light lunches and afternoon teas."
        }, 
        {
            "index": 100, 
            "rating": "5", 
            "review": "A beautiful garden ever seen in Medina!!. \"Le Jardin Secret\" is an excellent realization of an artistic and traditional islamic garden. It had been a residence of the Sultan families in the middle of the Medina in Marrakech, it's a real incredible discovery ever done! It's an ideal oasis as a shelter from sun, you can take light meals and fresh drinks among the beautiful plants... Discover the paradise!"
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "Indeed a charming secret garden. We were taken to this wonderful little paradise by our local guide. We arrived hungry and thirsty so had a delicious lunch in the cafe. The food and tea were beautifully fresh and the waiter hilarious! The gardens are very calm and tranquil and every area is different. There are plenty of places to sit and drink in the atmosphere. You can climb up the tower for a small fee where you get an excellent view of the walled city. The planting is spectacular and even the tiled floor was a gem. Also the loveliest toilets in Marrakech!!"
        }, 
        {
            "index": 102, 
            "rating": "5", 
            "review": "Hidden gem!!. We stumbled across the gardens as you do with most things in Marrakesh! It was truly a hidden gem. They gardens have only been open a few weeks but it felt like they had always been there which of course is true although only recently restored to their former glory! Visiting with 2 teenagers all of us were enchanted with the gardens and the lovely staff. Who were happy to chat about the gardens and to guide us to various points of interest. It was a welcome respite from the hustle and bustle and a definite must for any visitors."
        }, 
        {
            "index": 103, 
            "rating": "5", 
            "review": "I am a Garden Designer & was bowled over by this fabulous Jardin!. A real MUST if you love to visit gardens! Great coffee & lunch! A perfect escape from the chaos of the medina."
        }, 
        {
            "index": 104, 
            "rating": "5", 
            "review": "Oasis of calm. This is a definite must see even if there is still some work going on. The gardens are beautiful and calm with places to sit and admire the variety of flora, listen to quiet running water or take tea. Magnificent views over the medina as far as the Atlas Mountains. Can't wait to visit again as the gardens mature."
        }, 
        {
            "index": 105, 
            "rating": "5", 
            "review": "Beautiful gardens. A true gem, the garden is a peaceful break from the medina chaos. The staff was very friendly and helpful."
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "A hidden jewel ... absolutly to be visitten !!. From the first step in you are out off the hustle and bustle of the souks, a magnifiscent Islamique palace and one of the most ancient of the Medina of Marrakech, original water supply system of traditional architecture. A stunning place to be visited .Every detail is amazing !!!"
        }, 
        {
            "index": 107, 
            "rating": "5", 
            "review": "Fascinating and spiritual experience.. Recently opened, this is a stunning pair of gardens and a trio of tranquil buildings. Most of it had been restored from some delapidated ruins, some built from the ground up, and successfully combined old and new with great panache and style. The whole thing, designed by an Italian architect with a British garden designer and using a host of Moroccan craftspeople and builders, showcases the artistry and allegory of Islam. The incredibly knowledgeable and passionate guides tell a fascinating story of history, construction and spirituality which make for a must-see experience. Brilliant."
        }, 
        {
            "index": 108, 
            "rating": "4", 
            "review": "Beautiful oasis amongst the hustle and bustle . Le Jardin Secret has only been open around 3 weeks , beautiful gardens restored back to a very high standard. The guides are very interesting and stunning views across the rooftops of Marakech and onto the Atlas Mountains from the tower.You can relax in the cafe , very peaceful of if you fancy something a little stronger the bar Arabe is just opposite ."
        }, 
        {
            "index": 109, 
            "rating": "4", 
            "review": "A break from the hustle and bustle of Souks. So this is essentially 2 formal walled gardens, one tropical with a range of flowers and plants, the other is an islamic garden with central water feature. Staff at this setting could not be more helpful. We paid extra fee and went up to the tower which was okay and a chance to look across the rooftops of Marrakech. The guide provide information about the construction of the current site as well as the history. A video is also playing on loop to tell the story of the very recent renovations to create the gardens. Even with 20 discount, price was a bit steep in our view. All very pretty and tidy but other attractions in area such as the Tombs or Palace Gardens you pay a lower fee."
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "Tranquility amidst the madness. Recently opened after an eight year restoration this is well worth a visit - a true oasis in amidst the chaos of the medina. A garden encompassing the traditional architecture, water and pathways with a tower providing views across the City. There are a couple of cafes where you can sit, drink mint tea (other drinks are available!) and just take in the atmosphere.Entry fees are currently reduced during the first few weeks and we paid Dh40 per adult to access the main area (normal price Dh50, under 18s free) plus Dh30 for the tower (didn't notice normal price and there is a small fee for under 18s)."
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "Stunning - a contemporary twist on a traditional riad garden. Completely endorse the previous reviewers comments. We noticed the work going on behind a high wall opposite Cafe Arab when we were here last year. The garden is a real delight with a definite twist - not one but two gardens. We visited the week the gardens opened and were enchanted. You walk off the busy streets of the medina into an oasis of calm. A traditional riad or garden has been restored with a very understated cool vibe. A nice contrast to the lush Majorelle Gardens and the more traditional gardens in the Bahia Palace. Very helpful staff and we also got a wee history of the renovation from the Italian architect. Not to be missed !"
        }, 
        {
            "index": 112, 
            "rating": "4", 
            "review": "Beautiful. We visited with our two boys and enjoyed the peace and quiet of the garden and the views from the tower. It's only been open a couple of weeks and there are a few things that aren't quite as they'd hope, but it will mature into a haven."
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "Amazing oasis in the middle of the medina. What an amazing place of beauty and tranquility in the middle of the medina. It just opened 10 days ago after years of careful renovation. Two beautiful gardens. The exotic garden with amazing trees from around the world. The Islamic garden with amazing watering systems, fountains - a place of meditation.Charming guides, a little cafe that offers refreshments. We could have spent all day there. A new highlight and great addition for anyone visiting Marrakech and interested in its history. A huge thanks to the Italian architect for bringing this magical place back to life and sharing it with us."
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "Wonderful recently-restored open air museum and garden. My wife and I visited Le Jardin Secret having stumbled upon it almost by accident on what proved to be its day of opening to the public, on 20 March 2016. What fabulous luck it was to have discovered it.This is an open air museum in which the creator, over several years and with the assistance of many local craftsmen, has restored an important historic Riad and two gardens within it. The architectural restoration includes the rehabilitation of a tower of the type once-common within the Medina but now almost completely absent, as well as a full restoration of two gardens, one with exotic plants and one a traditional cruciform Islamic garden.In addition, the Riad was historically supplied with its own Atlas Mountain-derived water source, which has been completely restored, including the ingenious gravity-fed irrigation system which both serves to provide water for the gardens and domestic services but also powers the fountains and water features which are a highlight of the gardens.The attention to detail is outstanding in this museum and the creator has made something here that will both prove to be one of the Medina's best attractions but is also a testament to the architectural and horticultural history of Marrakech. Absolutely outstanding."
        }, 
        {
            "index": 115, 
            "rating": "5", 
            "review": "Wonderful newly-restored open air museum and garden. My wife and I visited Le Jardin Secret having stumbled upon it almost by accident on what proved to be its day of opening to the public, on 20 March 2016. What fabulous luck it was to have discovered it.This is an open air museum in which the creator, over several years and with the assistance of many local craftsmen, has restored an important historic Riad and two gardens within it. The architectural restoration includes the rehabilitation of a tower of the type once-common within the Medina but now almost completely absent, as well as a full restoration of two gardens, one with exotic plants and one a traditional cruciform Islamic garden.In addition, the Riad was historically supplied with its own Atlas Mountain-derived water source, which has been completely restored, including the ingenious gravity-fed irrigation system which both serves to provide water for the gardens and domestic services but also powers the fountains and water features which are a highlight of the gardens.The attention to detail is outstanding in this museum and the creator has made something here that will both prove to be one of the Medina's best attractions but is also a testament to the architectural and horticultural history of Marrakech. Absolutely outstanding."
        }
    ]
}