{
    "category": "Marrakech", 
    "entity": "Boucharouite-Museum", 
    "avg_rating_stars": 4.7043478260869565, 
    "review_count": 115, 
    "rating_stats": {
        "poor": 3, 
        "average": 4, 
        "terrible": 0, 
        "very_good": 17, 
        "excellent": 91
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "Small fee for special exhibition and builkding. Delightful, quiet , well preserved courtyard building which exhibits rag rugs by a specific tribe. Amazing colour and designs that look so moden despite being of a tribal origin. Has a calming cafe."
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "an oasis of calm and beauty. If you are interested in art or culture this will be the highlight of your stay. An added bonus is the delightful roof terrace garden, and the beautifully served coffee and biscuits brought up to you.\nStunning, fascinating, interesting, informative and just plain lovely."
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "What a wonderful surprise. We had the chance and pleasure to meet the owner of this place and listen to him passionately talking about how this little museum was born, learn about the rugs and the story behind them..it was our favourite place to visit in Marrakech, really. The selection of pieces exposed is excellent, their display very creative..anyway the house itself is stunning and the rooftop garden is one of the most beautiful we've seen."
        }, 
        {
            "index": 4, 
            "rating": "5", 
            "review": "Lovely museum with fantastic architecture and interesting exhibition . Absolutely worth a visit to admire the rugs and everything else at this small but lovely museum. The architecture alone might be worth the visit."
        }, 
        {
            "index": 5, 
            "rating": "5", 
            "review": "Inspiring! . A must see during your stay in Marrakesh. Awesome building with a very fine collection of rugs from local craftsman. Truly inspiring!"
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "Would recommend the 2 day Desert tour to anyone!!. Would recommend the 2 day Desert tour to anyone!! We really enjoyed our time camping in the desert and riding the camels. The time riding camels was just enough without being too much. The dinner in the desert was very good and the accommodation was simple but clean and great for one night. The tour was well worth it to get into the desert and see the incredible views best stargazing there is. The Atlas Mountains are very beautiful and the Ouarzazate visit was great for getting a feel for the culture of the area. Great tour!"
        }, 
        {
            "index": 7, 
            "rating": "4", 
            "review": "Visit a historical building with colourful rugs. The museum is a bit hard to find even with a map but certainly worth a visit if only for the building, a well conserved old two story house with an atrium and roof terrace hidden away in the middle of Medina. Boucharouite is a hand woven rug tied of different pieces of fabric, which form abstract patterns. They were originally made by illeterate women in the High Atlas on an upright loom in their modest house from scraps of their old clothing. Now it is of course more of an industry, maybe still home based and the fabrics used are leftovers from making garments. There are too primitive abstract needlepoint pieces sewn also with fabric threads on a base of discarded blue polyester sacks, which used to contain grains. I bought my first boucharouite last year and it made me so happy during the long dark Finnish winter that I purchased another, bigger one from the same shopkeepeer in the Souk de Babouches, where the prices are reasonable."
        }, 
        {
            "index": 8, 
            "rating": "4", 
            "review": "to visit with family. If you`re visiting the Museum of boucharouite in Marrakech, you will first notice the beautiful calm that this place has. It`s also very good and helpful if you want to learn new interesting things about Moroccan culture. The combination between the design and the informative side really makes visiting this museum a one of a kind experience. The building is not very big, and one the great part about it, is the fact that it`s usually quiet, and not as crowded as other places. To sum it up, going to the Museum of Moroccan Arts is, in my perspective, a learning and spiritual visit."
        }, 
        {
            "index": 9, 
            "rating": "5", 
            "review": "A peaceful oasis for the visitors of the Medina. After you visit the Medina, take the Judge's Street (Derb al Cadi) and visit this characteristic upper-class mansion, the home of a judge. You will find a most peculiar and interesting museum; Boucharouite art, decorative panels made of colorful cloth rags by berber mountain women during the winter months. The designs are not just appealing, they are... modern, amazingly so. Ask Patrick, the museum director, to explain you the details, take a cup of coffee or tea afterwards, with homemade sweets or tidbits."
        }, 
        {
            "index": 10, 
            "rating": "5", 
            "review": "Fab museum and Patrick is full of stories and knowledge. We came away fascinated by the textiles,people and art.We have started looking for these unusal rugs online. We would highly recommend this museum."
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "interesting place! Save the tickets . We went there without any expectations, but the place was really interesting and calm. A lot of different carpets with nice furniture and decor around. Looks fantastic. A nice terrace is upstairs to simply have a rest or drink green tea. A piece of calm in the middle of medina. If you would meet the owner, he can explain the history of the carpets, surprisingly interesting! Save the ticket and you can return whenever you like for free!! :)"
        }, 
        {
            "index": 12, 
            "rating": "5", 
            "review": "brought Marrakech alive. Musee Boucharouite is not a typical museum by definition but well worth the cost and search. It is easy to find if you follow signs and ask friendly shopkeepers, Be warned local kids will charge for their help. Set in small riad the Boucharouite rugs each have a unique artistic value and are imbibed with symbolism and expression you would expect at the Tate modern.Patrick is a passionate collector and was happy to take me on a personal tour and discuss the art work with me. I really valued his insight. The world could do with more galleries and musees like this, with its support of local culture and artists. My only disappointment is that circumstances prevented me from going back a second time, to hang out and absorb the work properly. I visited here at the beginning of my first stay in Marrakech and Morrocco. it really helped me understand and contextualise the Berber culture and the craft souks during the rest of my visit"
        }, 
        {
            "index": 13, 
            "rating": "2", 
            "review": "a museum, really?. This place is tricky to get to and then, after paying an entrance fee you will discover that \"museum\" is probably not the correct word for this place. It is in half of a riad, the half that still looks like it is rented out to tourists. Yes, there are boucherite rugs here and there and there is a tiny bit of info about them but.....this is not a museum, at least not in my understanding of the term. I went mainly because it was raining and it was near by but I would not recommend this place unless you like looking at renovated riads."
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "My favourite museum in Marrakech!. Such a hidden gem! We were lucky to have Patrick the owner show us around. It gave us a new appreciation of these poor man's rugs 'boucharrouite' and the beautiful stories behind them. The museum was very beautiful and well curated. Now I am inspired to make my own boucharouite! That was a beautiful encounter, thank you Patrick!It could be quite hard to find but look out for the signs on the walls, it helps a lot."
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "A beautiful place to learn about Moroccan culture. My husband and I truly enjoyed our visit. The collection was beautifully curated and truly works of art. We were fortunate to meet Patrick the owner who told us the meaning and symbols behind the rugs which provided emotional stories of the women who created them. It gave us an authentic insight into the culture and art of the region. We highly recommend a visit."
        }, 
        {
            "index": 16, 
            "rating": "5", 
            "review": "hidden gem - worth seeking out. The museum is quite hidden away but there are signs as you get closer. It is essentially a collection of rugs made by Berber ladies from the rural villages, this may not sound that interesting but it is very well presented and if the owner is around he will give you the full story behind each rug.The house itself is also nice to explore and drinks are served on the roof if you need a break.Ticket costs 40dh which is a bit pricey but you can return with the same ticket another day which you may want to do to relax on the sunny roof terrace.If you are a fan of arts and crafts then you will enjoy this."
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "Nice museum into souks!. The location of this museum isn't that good, but maybe this is the charm. We liked very much and is one type of museum that we see before only in some region of Romania! A museum dedicated to all forms of Popular Art, located in 18th century riad."
        }, 
        {
            "index": 18, 
            "rating": "5", 
            "review": "Beautiful Berber carpets collection. The museum, led by a very passionate and informative french, is a very interesting insight in the Berber culture. It shows an art carpets collection which you wouldn't otherwise find in the standard alleys of Marrakech Medina. Well worth a visit and if you have time talk with the owner, who will be happy to explain the meaning and the artistic significance of the symbols on the carpets."
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "An oasis of calm. The museum is an oasis of calm amidst the chaotic surroundings of Marrakech: not just for displays which are to a certain extent incidental to the overall ambience of the house - delightful!"
        }, 
        {
            "index": 20, 
            "rating": "5", 
            "review": "A hidden jewel worth the price. Go and see this wonderful place. It is a must. Ignore the boys in the street who say it is closed - it is not!! The owner, Patrick, has gathered an eclectic selection of rag rugs, hand made by Berber tribeswomen and displays then to their best advantage. They are truly works of art. We had the good fortune to be shown the collection by the owner, and his insights were amazing. The house itself is in the delightful riad style, renovated with taste and care to become an oasis of calm in the centre of the medina."
        }, 
        {
            "index": 21, 
            "rating": "5", 
            "review": "Eye-opening curation . We got to know more about the Berber art and culture in this visit. Patrick, the owner of the museum, patiently walked through the interesting pieces with us. This beautiful, tastefully-built museum used to be a boutique hotel owned and designed by Patrick. The terrace, in particular, was unexpectedly relaxing and romantic. We were very much inspired by this place, and would highly recommend Boucharouite Museum to art lovers."
        }, 
        {
            "index": 22, 
            "rating": "5", 
            "review": "FANTASTIC \"DREAM\" IN A BEAUTIFUL PLACE WITH A PERFECT HOST. I would like to thanks fisrst of all Patrick for his love for the beauty and the arts, along his love for the \"simple\" berber people of Morocco's mountains. The opportunity that Patrick offer to us (with the contribution of 40 dh of the ticket that is \"always\" valid for YOUR next visit) is \"priceless\"... The house and the story of the house are so involving and the \"peace\" and the beauty that surraund you will last for a long time since you will leave them. The story, the culture that is shown, will contribute to your \"spirit elevation\" and to your consciousness of what means the beauty and the art, in any kind of expression. Don't miss also to have THE talks with Patrick, he is a very kind man and an appassionate collector, you will surely earn \"something\" after that speaches. Looking forward to come back to you soon Patrick, I will do my best efforts to allow all people I will meet to have the same chance of me, to enjoy your \"dream\". Thanks, Paolo"
        }, 
        {
            "index": 23, 
            "rating": "4", 
            "review": "Must go. It was really really such a gorgeous place, you need to go there to see how the berber women lived and how they used to make the famous moroccan rugs."
        }, 
        {
            "index": 24, 
            "rating": "5", 
            "review": "A most beautiful insight into Berber Women's rug making . This is simply a most stunning place. It covers the history of rag rugs and an insight into the Berber women's life. Patrick, the owner has decorated the museum beautifully. It's the most relaxing place. Just chill on the terrace with a mint tea in the lovely surroundings. Definitely worth a visit"
        }, 
        {
            "index": 25, 
            "rating": "4", 
            "review": "Fabulous host . Patrick is a wonderful host with so much to tell you and so many different artistic analogies of how the boucharouite rugs are created. Definitely changes your perception of art and it's abstract meanings. One thing he said stuck with me, artists can be artists without them knowing the meaning of art, without education and without any knowledge that they are creating a piece of art. Each of the rugs in this museum is a abstract connotation of a piece of their family history, be it pain, love, joy or death."
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "A very special place that will give you a real feel for what it is like to live in a wealthy family's riad. One of the major reasons for coming here is the outstanding collection of rag rugs beautifully displayed and explained. The collection is very specialThe other reason you have to come is to see the magnificently restored riad that houses this collection. We felt as though we were having a unique opportunity to get beyond the walls of a top quality, no expense spared, unbelievably tasteful restoration of a very special riad that felt like it was being lived in as soon as we left. What a gem.We were the only people there. Once you get to the Ben Saleh mosque, the house is well signed. Be patient as you wind through the labyrinthine sreets. it's part of the experience.This was one of our top discoveries in Marrakech."
        }, 
        {
            "index": 27, 
            "rating": "3", 
            "review": "Pretty handmade rugs in a nice home. Located in some back alley ways, a serene house decorated with these handmade rugs by poor berber women. They were very pretty and you got to learn some berber history. If you are an art person then you will appreciate it, if not then you might not be impressed. IMPORTANT: its closed sundays. and if you try to go on sunday not knowing its closed, since its in an alley, you will get trapped by young boys trying to direct you and then will demand money from you."
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "Peaceful oasis in the Souks. Great examples of the local technique of blanket making, all set in a stunning house in the least expected place. Nice little roof terrace for some peaceful reflection over a pleasant mint tea"
        }, 
        {
            "index": 29, 
            "rating": "5", 
            "review": "Excellent host. Today l visited this museum with 3 others from my tour group. We were warmly received by the staff and then we were introduced to Patrick. His passion and knowledge about art as a creative form was infectious. We learnt so much about these wonderful art forms that are expressions of Berber life. Highly recommended. The riad itself is worth visiting and you can have tea on the terrace too!"
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Heaven in the Souk. We visited Patrick and his team last week and I have to say this place is something special . The building itself is beautiful and the rug history is fascinating. If you are not a fan of museums or rugs I still would recommend visiting for a mint tea on the terrace ( the best we tasted in Marrakech) the terrace itself is stunning with beautiful flowers , comfy rug covered sofas and a real place of peace and serenity in an otherwise crazy city. We loved it so much we visited twice. Thanks for a lovely welcome from Patrick and his team . Charlotte and Kate."
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "MUST VISIT!. Beautiful riad converted museum. I have always been a lover of Boucharouites and this visit gave me a whole other perspective of the art behind them. Patrick, the owner, gave us a delightful tour and explained in depth from origins to symbolism behind the pieces.\nIt is definitely a must visit in the Medina!"
        }, 
        {
            "index": 32, 
            "rating": "4", 
            "review": "Worth a trip if you're interested in art. Well hidden in the depths of the Souk but as others have commented a real Gem of a museum and has a unique twist on it with the unusual origin of the art form. Unfortunately no Patrick today but despite this we whiled away a pleasant hour in the heat of the day in this tranquil Riad."
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "A definite highlight in Marrakech. What a great find in the souks of Marrakech. This private museum was recommended by the owner of the Riad I stayed in - and she said it is her favorite place in Marrakech - and I do agree - what a gem! Patrick, the owner, showed me his house and his art and all I can say is - I have so much respect for what he did! The art is beautiful - and I am so thankful he made his house a public space. I really wish him and his museum all the best and I truly hope many visitors find their way to this Marrakech secret. Susanne"
        }, 
        {
            "index": 34, 
            "rating": "5", 
            "review": "Must visit - a highlight of my time in Morocco. I cannot speak highly enough of this place. The riad itself is just beautiful - a peaceful oasis in the middle of busy old Marrakech. The museum displays are amazing. Patrick, the host and owner, gave us an insight into many of the stories behind each piece, which really made the experience a true honour for us. The museum has been created with so much thought and passion, and his knowledge and admiration of the works and the stories behind them is incredible. This was a major highlight of my time in Morocco, and probably my favourite couple of hours spent in Marrakech. I highly recommend people visit this museum. Thank you Patrick, and good luck with your endeavour."
        }, 
        {
            "index": 35, 
            "rating": "5", 
            "review": "Joyous. An inspiring experience. What a privilege to spend time in the company of Patrick who is so passionate about the art he has collected and displayed in this wonderful setting which gives life to the voices of these women. His enthusiasm, warmth and understanding of the boucharouites made this the highlight of my trip."
        }, 
        {
            "index": 36, 
            "rating": "5", 
            "review": "Poetry through carpets. A lovely spot built by a french romantic. This old riad went from a guesthouse to a museum, the texts written are gorgeous and transport you in a new universe. The rooftop has everything one needs to relax. A bit hard to find but worth the treasure hunt. We ll be back with friends!"
        }, 
        {
            "index": 37, 
            "rating": "5", 
            "review": "Very tasteful, a real gem. Beautifully displayed collection of rugs, the idea of turning a guesthouse into a museum was very well executed. The real highlight of the place is Patrick, the owner/curator who talks about his collection with knowledge and passion. Hearing him describe the stories behind these carpets brings an extra dimension to this already wonderful museum."
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "Small boutique museum, a treat for the body mind and soul. This small museum is so gorgeous, so lovingly cared for by Patrick who has an eye for art like few others in the world. Unique because the museum has a focus on Berber carpets that are absolutely out of this world, each one telling a story, each one a Matisse or Picasso in its own right. Actually this little gem was a highlight for me...kind of caught me off guard. Patrick is such a wonderful storyteller, the spaces in the museum so refined and beautiful.. Viewing each piece is like aromatherapy for the senses."
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "Gorgeous. The collection of beautiful and inspiring rugs is housed in a stylish Riad that was formerly a guest house. We had the great good fortune to meet the owner who shared his knowledge and enthusiasm with us, taking us round and sharing stories and insights. We feasted our eyes and nourished our souls. I spent several hours there and only left reluctantly as we needed to eat. However I understand there will soon be a cafe on the roof terrace with simple fresh wholesome food. Hooray! I absolutely loved this Musee and will return every time I'm in Marrakech."
        }, 
        {
            "index": 40, 
            "rating": "5", 
            "review": "Lovely and peaceful. Helpfully signposted this place is a hidden gem. It's 40 dirhams each (£2.60). We were the only people there and we stayed for about 2 hours. The museum is a lovely example of a riad with beautiful Berber rugs throughout. The staff were helpful and served us some refreshing drinks on the lovely rooftop terrace."
        }, 
        {
            "index": 41, 
            "rating": "2", 
            "review": "Was closed. We wanted to visit due to all the nice comments.Some guys on the way already told us it was closed and when we got to the museum it was actually closed even it said on the sign it's supposed to be open. Too bad!But if you plan to to there it's quite easy to find because of a lot of signs"
        }, 
        {
            "index": 42, 
            "rating": "4", 
            "review": "Interesting collection of rag rugs in a nice former riad.. This is a very interesting little museum, which was a riad previously. It is not so much a museum more a collection housed throughout the owner's house. I shows his collection of 'rag rugs' that the owner has amassed over the years which vary in quality and design but are mostly well worth looking at.If the owner is there, it is a pleasure getting a tour from him."
        }, 
        {
            "index": 43, 
            "rating": "5", 
            "review": "Really, a rug museum? Yes, really!. The Boucharouite Museum is dedicated to the Berber craft of making rugs from rags. All of the rugs on display were originally meant as functional pieces, not works of art, but in this place, they have been elevated from the floor to eye level, allowing you to see the intricate detail that goes into each one. The museum is housed in a converted riad and retains much of the original structure, including a relaxing roof terrace where you can while away an hour or two with a pot of mint tea and light snacks to recharge for another venture out into the hustle and bustle of the Médina. The staff is friendly and will happily engage you in conversation, explaining in detail the history of the museum itself, or offer up interesting facts about the rugs, or just idle chit-chat. As I was leaving, a staff member flagged me down and told me that I could hang on to my admission ticket and come back again for free if I felt like coming back and spending some more time. Honestly, I regret not taking him up on the offer - it was a splendid visit, and I definitely recommend it.Nothing is easy to find in Marrakech, but searching out this hidden gem is well worth it. Like a lot of other tourist sites, local kids like to hang out nearby and offer to guide you to the museum for a fee, but it's easy to find if you just follow the signs or use an offline maps app on your smartphone. At 40dhs, and free for those under 16, it's a really cheap and informative way to spend an extra couple of hours in Marrakech."
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "Outstanding, the absolute highlight of my visit to Marrakech. Everything about this house is beautiful, I was truly moved by the experience of meeting Patrick and listening to his stories about each Boucharouite. A visual feast of colour & texture, even seeing and smelling the plants will leave you feeling lucky to be alive. Don't let the men on the streets outside put you off visiting by telling you that the museum is closed as it won't be, they simply want money to guide you there."
        }, 
        {
            "index": 45, 
            "rating": "5", 
            "review": "Easy to find; well curated. We thought the museum was pretty easy to find--even when we had just arrived in the Medina--due to the nice signs on several walls pointing to it. Of course, several young men insisted it was closed because of Ramadan (it wasn't!) so we felt very fortunate to arrive at this oasis. It is definitely one of the best curated and displayed museums in Marrakesh. Though we did not get the private tour by Patrick, we enjoyed seeing the artwork and rugs and reading about them. They reminded me of the quilts from the American midwest--same sort of \"pioneer spirit\" of women making art from nothing. We enjoyed this glimpse into a \"hidden side of Morocco.\""
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "The highlight of my trip to Marrakech. When I first arrived in Marrakech, I was disappointed by how tourism overruled the Moroccan culture. However, when the owner, Patrick, opened up the museum 30mins early for us, it was clear, just how passionate Patrick was about his stunning rug collection. Patrick gave us a private tour and truly inspired my dad and I with the fascinating stories behind the rugs. Despite being pressured for time to arrive at our next hotel, we decided to spend 3 hours at the museum! There is a rather small fee to pay to visit, on the other hand, once you have paid the fee, you are able to visit the museum as often as you like during the rest of your trip! Another highlight for me is that from the money raised by the museum, 10% is given to an organisation that helps Moroccan girls to extend their education (compulsory education is till 12 years old), so that they can reach their dream profession. I also very much liked that the Riat was furnished traditionally, hence, one could admire the rugs in their true environment and not in a bare, white, clinical gallery space. So if you would like a personalised insight into the true Moroccan culture, then visit the Boucharouite Museum!"
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "Favourite spot in Marrakech. Walking into the museum was a complete escape from the chaos of the souks. We were initially unsure about visiting a \"rug museum\" but were completely blown away and surprised by the beautiful works of art and stories behind them. The artworks are displayed in the rooms of a beautiful riad, carefully curated by the owner who we were fortunate enough to have show us around and tell us the story behind the museum. The terrace was beautiful and incredible to lounge around, and the foot bath at the end was a really nice touch. I feel really blessed to have been able to visit while it's still quiet, and I'd recommend this to anyone visiting Marrakech."
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "Beautiful, peaceful, and educational . My friend and I went here as a way to get relief from the sun and ended up staying for 4 hours! The rugs are absolutely beautiful and the owner walked around with us explaining the story behind many rugs and teaching us the symbolism so we could analyze the rugs properly ourselves. There is a beautiful, quiet rooftop terrace where you can chill out and also a footbath in the courtyard, very relaxing. When you buy a ticket once, you can reuse it, so would recommend going at the start of your trip so you can escape to the terrace whenever you need a break from the bustle of the zouks! 10/10 would recommend."
        }, 
        {
            "index": 49, 
            "rating": "5", 
            "review": "Don't miss this House of Wow!. My boyfriend was initially dubious about this museum, but by the end of our visit, he dubbed it the 'House of Wow'. We were so fortunate to have Patrick give us a tour of the museum. He has such incredible passion for helping people to see and understand the symbols in these rugs and to use your own eyes and mindset to interpret the works of art. It was incredible to learn the stories of these women, most of whom have nothing. It certainly gave us an entirely new appreciation for art and this format. Take the time to visit this museum, chat with Patrick and enjoy the peaceful space within the hectic medina. This was without a doubt my favorite thing we experienced in Marrakech."
        }, 
        {
            "index": 50, 
            "rating": "4", 
            "review": "Sympathetically beautiful Riad. . You wouldn't stumble upon the museum, but easy to find with directions. We spent 2 hours in the museum as we got talking to the owner, who was so passionate about his collection of rugs. He explained several rugs and the designs behind them. Overall a really nice experience and the Riad was absolutely stunning, with a picturesque terrace."
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "Highlight of my trip to Marrakech. I had read the reviews on trip advisor before deciding to visit this museum with my husband, originally I had thought it would be interesting but I had not expected it to totally make me feel as emotional as it did, I have no idea why but I felt some sort of connection to these women who made these exquisite works of art.We were lucky enough to be told the history of quite a few of the pieces by the lovely owner Patrick, we so appreciated his time in explaining the meaning behind some of these rugs, he is so passionate about what he does and it was a joy to hear his stories, please do not miss out on this experience, if you can speak with Patrick it will make your visit more enjoyable as once you get the true meaning behind the rugs only then can you truly understand the meaningfulness behind them."
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "Oasis in the madness of the Souk. Came upon it by chance as looking for something else. Beautifully restored Riad. History of rugs, why and how made very moving. They really need to be considerd as works of art and expression of culture of ordinary Berber women Really calm courtyard and restful roof garden with excellent coffee and complimenttary cake"
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "Beautifully informative. Worth a look and the time.I enjoyed the slow pace and solitude to amble around,as no hassle here...lots to sed"
        }, 
        {
            "index": 54, 
            "rating": "4", 
            "review": "rag rug museum. Wonderful collection of handmade rag rugs, sensitively displayed throughout a beautifully renovated riad together with stories of the women who had created them."
        }, 
        {
            "index": 55, 
            "rating": "2", 
            "review": "Not much to see, expensive. Finding the museum is an adventure. Not worth the fee of entrance though. Poorly taken care of. Visit at your own risk and peril"
        }, 
        {
            "index": 56, 
            "rating": "5", 
            "review": "Superb!. You really must come here. It's well-signed from the Marrakech Museum and takes just 5 minutes. This former riad is beautiful and the rugs on display are delightful. Do take tea r coffee on the terrace for a relaxed break from Marrakech. You will also be allowed to visit as many times as you like for your 40 dirhams ticket. I only hope this place stays tranquil as I fear it will become overrun when it starts getting into the guidebooks (it was only opened in 2014)."
        }, 
        {
            "index": 57, 
            "rating": "5", 
            "review": "Beautiful rugs displayed in a calm environment. Then rugs and the stories behind them are displayed thoughtfully in this beautiful ex Riad. The rugs are just beautiful and it is fascinating to learn a little of their creation and the story behind them. The building itself is stunning and so peaceful. Please make the effort to find this unusual little museum."
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "Fab!. Just visited the museum. This place is excellent. The history of women woven in fabric, their loves and lives displayed in art."
        }, 
        {
            "index": 59, 
            "rating": "5", 
            "review": "Hidden gem. Very soulfully written stories to go along with the works of art. A story of the women not unlike any other country in the world. Beautifully displayed."
        }, 
        {
            "index": 60, 
            "rating": "5", 
            "review": "wow!. One of the most attractive places I have ever visitted, while this place is mainly about a unique type of carpets, the museum is decorated in the most beautiful way, not to mention the stunning house itself. A serious surprise! If you enjoy places of true beauty you got to see this!"
        }, 
        {
            "index": 61, 
            "rating": "5", 
            "review": "Curated with real passion, utterly lovely. A lovely riad that would be interesting in itself, filled with many examples of vernacular rag rugs. Free flowing improvised patterns a world away from established traditional patterns normally seen in Moroccan textiles. Eye opening stuff."
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "Mint tea and sunshine .... ... the icing on the cake to this most gorgeous place that is the Boucharouite Museum - and I pretty much visited them all during two weeks in January and February 2015 in Marrkech. Note it is not open on Sundays. It costs 40 dirhams to visit but you can reuse your ticket as often as wish - and you will wish ..., The rugs are exquisitely displayed on walls, on beds, on every surface and their brilliance of design and colour is a revelation. This was a BnB Riad and the rooms remain as bedrooms and bathrooms which are delightfully utilised to display the collection. And when it all gets too much to take in - enjoy a 15 dirham mint tea on the lovely roof terrace that comes complete with Moroccan biscoti. I would allow half a day to take it all in and have time to lounge on the roof. Second only to the the Majorelle Gardens. Highly recommended."
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "Must visit museum. Very interesting museum. Watch how the peasant lady express their emotions in the pieces of rug rag. From all spots I visited today, i think this museum is the best."
        }, 
        {
            "index": 64, 
            "rating": "5", 
            "review": "Unique experience. An interesting concept but made unique by the personal attention of the owner. Having told us what was there we wandered round at our own pace. He then he gave us a full explanation, a wonderful charismatic tutorial on the rugs and their possible meanings and place in art. Just fabulous."
        }, 
        {
            "index": 65, 
            "rating": "5", 
            "review": "A MUST DO. Make sure you put this museum on your list if you are visiting Marrakech. Boucharouites are the hand made rugs made out of old clothes, bits of wool and anything else that can be found. They are not only functional but also works of art and tell the story of people's lives. When you reach the top you are invited to sit on the patio and enjoy a lovely coffee or tea.Patrick, the owner, is the most interesting, genial and generous man and you will find yourself completely absorbed in the stories and histories he tells. Part of the entrance fee goes towards the education of girls."
        }, 
        {
            "index": 66, 
            "rating": "5", 
            "review": "A wonderful surprise. A sheer delight. This new museum is dedicated to the art of the Berber woman. And what art it is! Full of meaning and personal experience. The owner is charming and gives his time to explain everything. Don't miss tea on the terrace. It is worth seeking out and spending time."
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "A treasure house. This is exceptional. The stories behind the art of the woman whose work is presented here is remarkable. The place is fabulous. Don't miss tea on the terrace. And if you are lucky enough to need the owner the visit is even better. Highly recommended."
        }, 
        {
            "index": 68, 
            "rating": "5", 
            "review": "Unexpected gem. This is a collection of rag rugs made by Moroccan women (mostly in the 70's/80's). On the surface you might think, 'how dull'. The reality is quite different. The museum lays out the stories of the women who made these rugs, finding an outlet for artistic expression despite the hardships and strictures in their lives. This is 'outsider art' at its most human and life filled. The owner is a really interesting guy who will make the whole thing come alive as he describes the people, rugs and answers questions. The museum is in a beautiful riad, with a lovely terrace to sit quietly, drink coffee and enjoy the world. This was one of the best places we visited whilst in Marrakech."
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "Fascinating. Would definitely recommend this insight of the Boucharouite art. Set in a riad, very quiet and with beautiful pieces and insightful information."
        }, 
        {
            "index": 70, 
            "rating": "4", 
            "review": "Great collection of rugs in beautiful Riad setting.. Off the beaten track but worth seeking out for an hour out of the bustle in a beautifully restored Riad seeing fascinating collection of craft rugs."
        }, 
        {
            "index": 71, 
            "rating": "5", 
            "review": "Oasis in Marrakech. A highlight of our time in Marrakech. We stumbled upon this gem, and were delighted with both the peacefulness and beauty of the Riad and the style and beauty of the exhibits. As others have mentioned, Patrick the collector has a keen eye and overflowing passion for these cultural works that is evident when you speak to him and upon exploring the museum. A must see for any traveler to Morocco, and although requires some navigation in the medina, well placed signs will easily guide you to this oasis."
        }, 
        {
            "index": 72, 
            "rating": "4", 
            "review": "Good museum. If you're interested in museums or/and moroccan culture, it's a must. Inside you would find some interesting furniture and traditional clothes, specially recommended if you have a free mid-day and you want to invest your free time in something cultural."
        }, 
        {
            "index": 73, 
            "rating": "5", 
            "review": "Beautiful and unusual museum. This museum features a selection of hand-made Berber rugs presented as works of art. It's something that wouldn't have occurred to me and apparently it might not have occurred to the makers either if it weren't for the keen eye of Patrick, the museum's Proprietor. He very kindly gave us a tour, plus detailed and enlightening interpretations of the works he had on display. The museum is in a beautiful house which was formerly a Riad and you can still enjoy a drink up on the terrace. On the way there several young men tried to convince us that the museum was closed and that we should go the other way to the tanneries; if this happens to you, don't believe them!"
        }, 
        {
            "index": 74, 
            "rating": "5", 
            "review": "New Discovery. We have visited Marrakech several times so have seen many of the main museums and points of interest before. Discovering Musee Boucharouite was the real high light of this trip. The art work on display is truly unique, so many stories being told. We felt blessed to meet Patrick the owner of the collection."
        }, 
        {
            "index": 75, 
            "rating": "4", 
            "review": "Charming. It took a little navigating to find this little gem, but it was worth it. Great to see what life was like and to appreciate the local craftsmanship of the rugs.Worth a visit."
        }, 
        {
            "index": 76, 
            "rating": "5", 
            "review": "Thank you!. A really pleasant first day in Marrakech, thanks to Musee Boucharouite and Patrick, the founder. He introduced the great building to us as well as the wonderful art, particularly the \"Boucharoittes\", the artisan rug art. A truly relaxing experience to have a cup of coffee with this art connoisseur, away from the medina chaos just one block away. When we asked, Patrick was kind to gave us an address where to look for carpets and rugs to take home. If you are a bit sceptic to do purchases in the Souk, this was the place to go, Soufiane (13, Souk des Tapis). We ended up buying a wonderful artisan wool carpet, pillow cases etc. Our visit could not start in a better way. I wish Patrick and his museum a great future as the establishment has been open for the public only a few months. We also thank all you guys here at Tripadvisor to put it up on top of the list, we might never have found this otherwise."
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "Trendy Museum for Local Art. We weren't quite sure about going but it turned out to be one of our most inspiring and pleasant experiences in Marrakesh. Wonderful architecture, beautiful art and a great place to spend time for a tea."
        }, 
        {
            "index": 78, 
            "rating": "5", 
            "review": "A lense into Moroccan culture. This museum was a highlight of my time in Marrakech because it was one of very few places where visitors can actually learn about Moroccan culture. The owner gave us a tour and explained the works of art, the people who created them, and how they parallel modern European artists. The owner has a true passion for the Moroccan culture and the artwork in his Riad. You'll find in Marrakech that everybody (except this museum) is pushing a hard sell in every interaction they have with you, whether you want what they are selling or not. This museum was a pleasant break from that. The museum is at the end of a narrow street called Derb al Cadi. There is an obvious sign on the main street (Derb Sidi Ishak) pointing you down the narrow street (Derb al Cadi) towards the museum. Easy to find on Google Maps. You'll know you are going the right way if the locals approach you to tell you the museum is not that way."
        }, 
        {
            "index": 79, 
            "rating": "5", 
            "review": "Nice place, inspiring art collection . Very pleasant welcome in magnificent traditional house. With cordial and informed explanations by the owner and founder of the collection, a wonderful moment during our vacation in this old fascinating town. We spent some moments on the rooftop where you can enjoy a drink."
        }, 
        {
            "index": 80, 
            "rating": "4", 
            "review": "It's not all about the rugs.. (can I say that?). Fantastically restored riad with lovely roof-top cafe. Check out the 1930's furniture from the Marmounia - exquisite. The artwork is interesting. Definitely worth a detour."
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "Beautiful calm gem.. Definitely worth checking out, ignore all the kids telling you it's closed or a dead end they just want you back spending money in the souk. Aim for the Marrakesh Museum and you will start seeing signs up on the walls for this museum. Gorgeous building hidden down a tiny ally way. The rag rugs are different from those sold everywhere else and are there merely to admire as art. Have a chat with Patrick the owner, really interesting guy with lots of passion for the area, his house and the Berber rugs. Lovely way to spend an hour."
        }, 
        {
            "index": 82, 
            "rating": "5", 
            "review": "A great eye for artistic expression . . .. This hidden Museum has so much to offer. Both the exhibits and the building itself are exquisite. Patrick, the collector and building owner, has a great eye for artistic expression. He has sifted through vernacular crafts, in the form of woven and embroidered rag rugs from rural villages, to create a display of stunning visual delight. This is embellished with old photos venerating the king as seen in traditional homes. Good photos and well chosen text to interpret the collection.Stay for tea on the roof too! Well worth a detour to visit.Neighbourhood of local colour - we stayed in a Raid nearby.See www.lacollectionberbere.com/en for more about the rug collection."
        }, 
        {
            "index": 83, 
            "rating": "3", 
            "review": "nice rugs, but pretentious. nice riad, but pretentious french nonsense- I hate it when pretentious people turn lovely things into commodities to suite their own egos and pocket books."
        }, 
        {
            "index": 84, 
            "rating": "5", 
            "review": "Great addition to Marrakech. This little museum is a fantastic addition to the list of must visit places in the medina of Marrakech.Patrick has put together a fantastic collection of popular art in the shape of handmade artisan floor coverings.Not to be missed"
        }, 
        {
            "index": 85, 
            "rating": "5", 
            "review": "Rags to Riches!. A lovely and quiet museum displaying 'rag rugs', which offers a welcome break from the hustle and bustle of Marrakech. My wife and I really enjoying looking around this beautiful riad, with the owner and staff being very welcoming. If you come across the museum, hidden away down some back streets, be sure to visit."
        }, 
        {
            "index": 86, 
            "rating": "4", 
            "review": "A hidden gem. Charming little museum in a Riad which is like somebody's home. The \"rag rugs\" are displayed in every room, even the toilets, Not very easy to find though."
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "lovely Riah, passionate owner, good display and well presented with English and French notes. We wandered around and found the Riad off the beaten tracks, it was quiet but has only opened recently. The museum is dedicated to the art form of rug making by the poorer class of tribeswomen who live in the hills I understand (hopefully) and the rugs are made from scraps of material from clothing they have owned. The base of the rug is from nylon sacking found in markets to carry farm produce. The clothing scraps maybe from their own personal family items and have memories of those family members such as fathers robe or babies first outfit etc. The patterns weaved are what makes it an art form rather than a basic rug. The displays are interesting to see but we were fortunate to meet with the owner of the Riad whose passion for Marrakesh has turned the house first into a guest house and now into a museum. Now obviously we were lucky to meet and have a good chat with him and through him learn more of the art form hidden within the displays. Personally I am not a very arty person and struggled to appreciate some of the displays but I did enjoy the house and its history. My partner Pennie was much better at appreciating the rugs for their art. There is a terrace which will serve drinks and nibbles."
        }, 
        {
            "index": 88, 
            "rating": "5", 
            "review": "Well worth a visit. A new museum showing Berber rag rugs as works of art, which is set in a beautiful Riad. Displays are interestingly situated in bathrooms and bedrooms. Patrick, the owner, is wonderfully enthusiastic and has many ideas about how the museum can be developed. Very moved by the stories behind these beautiful rugs."
        }, 
        {
            "index": 89, 
            "rating": "5", 
            "review": "Well done is an understatement. Patrick has done an excellent job creating this spot. The collection is good, I'm not a rug expert, but without a doubt he has an excellent eye. The place is laid out perfectly. It was a real treat to see the rooms and terrace staged as they were. Yes, it is a relaxing place from the hassles outside."
        }, 
        {
            "index": 90, 
            "rating": "5", 
            "review": "A museum full of passion. I urge anyone visiting Marrakech to visit this unique museum,, not only are the Boucharouite rugsstunning each one a work of contemporary art ,,, but Patricks Riad is filled with love and passion,From the well planted courtyard to the beautiful terrace , just enjoy every room and space filled with extraordinary delights... ."
        }, 
        {
            "index": 91, 
            "rating": "4", 
            "review": "Worth visiting. Very beautiful Dar with a unique spin on the Dar experience. The space has been reappropriated as a museum for the Boucharouite, which are essentially the rag rugs made by women too poor to afford wools or looms. Very interesting experience, since in general learning about women's experiences and stories in Morocco is rare. When we went it was self-guided, but it also seemed like it might be a showroom? Also if there are groups of small children telling you the museum is closed, don't listen to them, this is true in general in Morocco."
        }, 
        {
            "index": 92, 
            "rating": "4", 
            "review": "Relaxing but expected a bit more. I enjoyed this place, it was a nice break from the hassle outside and the art was very nicely arranged.. However I expected a bit more, as it was rated as number one attraction in Marrakech at the time."
        }, 
        {
            "index": 93, 
            "rating": "5", 
            "review": "Gem of a museum. What a delightful museum - showing the lives of Berber women as represented in their handiwork. We were lucky to speak to the man whose passion this museum is, his explanation of the stories and lives of the women expressed via these handmade rugs brought them to life for us. Highly recommended and easy to find thanks to all the signs along the route."
        }, 
        {
            "index": 94, 
            "rating": "5", 
            "review": "Beautiful Boucharouite!. This week, whilst walking in the north of the Marrakech souk, I discovered a new museum. Musee Boucharouite, owned by Patrick de Maillard is dedicated to the art of Moroccan rag rugs. I do not use the word \"art\" lightly, as these rugs made by Berber ladies in the Atlas Mountains would not be out of place in a contemporary art gallery.Patricks's enthusiasm for this craft, or art work is contagious! From entering the peaceful courtyard, I was immediately lost to this surprising Moroccan art form. This museum was once a Maison d'hôtel or guest house. However, Patrick's passion for boucharouite took over, and you may now share it with him.With each rug that you see, it is difficult not to compare them to works of artists or designers such as Matisse; Rothko, Delaunay or Kandinsky!You may linger with a mint tea and Moroccan pastries in the courtyard, or take advantage of the gorgeous roof terrace. If you are lucky, Patrick will be there in person to share with you the symbolism and history of the carpets on display.Do make the effort to visit. It is well sign posted from the local vegetable market situated directly between the Rahba Kedima Square and the Marrakech Museum."
        }, 
        {
            "index": 95, 
            "rating": "5", 
            "review": "Passionate man with a dream. A rare five star rating from me. If I were to give someone some advice id tell them to go right at the T Junction were you can either go to the Marrakech museum on the left or to this little gem on the right. Follow the well marked signs to the museum."
        }, 
        {
            "index": 96, 
            "rating": "5", 
            "review": "Saved The Day. We stumbled upon the museum after our first foray into the souks. Tensions were running high as the museum of Marrakech is not nearly as easy to find as the sign by our riad would have us believe. As a result we spent what felt like forever travelling in circles and being accosted by salesmen who took notice of how we were traveling in circles. Eventually we latched on to a series of signs leading to a \"museo\" and followed them to salvation.The museum is highly specific in it's subject matter, covering primarily boucharouite - carpets made from the tattered remains of old clothes. The subject has surprising depth and emotional resonance. The museum itself is a centuries old home in incredible condition, and all about it are positioned myriad carpets of every color and design. Patrick is outspoken, insightful and immensely generous with his time and knowledge. We must have spoken to him for an hour, during which we covered everything from the making of the carpets and the history of the house, to places to eat nearby and methodologies for effectively negotiating in the souks. Suffice to say we the museum and its staff are gems. If you take the time to pay the the work, the home and the people the attention they deserve, you will find the experience immensely fulfilling."
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "What a gem!. The museum is signposted most of the way in the souks and once you have found it you will be delighted.Ihad a 30 minute talk with Patrick the owner,what an interesting and enthusiastic man who is very knowledgable about all aspects of art ,especially about Berber rugs,it was a real find!The Riad itself is beautiful and everything is well displayed.this is a real must for anyone interested in Art....and there is a little cafe for drinks!"
        }, 
        {
            "index": 98, 
            "rating": "5", 
            "review": "A hidden away gem. This is a most worthwhile half day trip. Part of the fun is actually to locate the place as it is hidden away among narrow alleyways. Persevere and you eventually find some discreetly placed signs. The owner kindly provides a map to enable safe navigation on the way out! It has only recently opened and focuses on female Berber folk art, namely two styles of rug, Boucharouite and Zindeh. It is housed in a converted Riad and the owner and champion of this art form is there as an enthusiastic guide. Do not forget to take some leisurely refreshment at modest prices on the balconey -- a real haven of repose from the bustle outside."
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "Amazing trip. Wonferful trip amazing reid would recommend this reid 100 percentthe staff they treat you like royalty"
        }, 
        {
            "index": 100, 
            "rating": "5", 
            "review": "Interresting place. A good experience, nice facts and a good place for a long visit. Highly recomend, you must see it and also ask for professional guidence. Not expensive"
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "A wonderfull and interesting visit. The owner and guide gived us an interesting survey of this cultural specificity. The old ryiad in itself is worth the view."
        }, 
        {
            "index": 102, 
            "rating": "3", 
            "review": "Great. a great meseum, feeling the History of morocco and africa and andalousia, i went there with some friends, don't follow guides"
        }, 
        {
            "index": 103, 
            "rating": "3", 
            "review": "August. . We visited this in august.\nUnfortunately it says on the door that this is closed for the entire of august.\nIf we had managed to get in it would have cost a mere 40dirham a head. Would have been good based on previous reviews but alas not to be this month."
        }, 
        {
            "index": 104, 
            "rating": "5", 
            "review": "Unexpectedly Different. We stumbled across a sign for this small museum while out shopping and remembered having read the reviews on Tripadvisor. We thought we would give it a go. The peace and quite inside this converted riad was such a welcome relief. As we stood in the courtyard I heard someone calling from the landing above us. He was waving & smiling. I assumed it must be to someone who was stood behind me, but there was no one there. He then came down to welcome us to the museum. The man was Patrick de Maillart, the founder, owner & curator of this collection of rugs from Moroccan Berber women. Patrick has taken some time to build a collection of rugs which he considers to be great art. He spoke to us at length with great passion and enthusiasm, describing how & why it all came about. He wants the world to see this art and he wants to promote the women's work so they can benefit from it.The first thing Patrick did was suggest we took off our shoes, relax & dip our feet in the cool water of the pool in the middle of the courtyard. After that he let us loose to view the rugs and paintings. He told us to take our time, so we did. We had drinks on the terrace at the top of the riad and then made our way back down again. As we did we met Patrick again for a chat about what we had seen. We agreed that the works had great merit. Well worth a visit, this museum is perhaps best suited to adults. I visited with my wife & 21 year old daughter."
        }, 
        {
            "index": 105, 
            "rating": "5", 
            "review": "Quite an astonishing little museum. Down a back street off Derb Sidi Ishak (Azbzt) in a fine historical Riad is one of the strangest and most beautiful little museums I have visited in Marrakech. I was priviledged to be given a tour by the founder Patrick (of Maison de la Photographie fame) and it was a real eye-opener. It's a great and somewhat quirky addition to the thriving alternative attraction scene in Marrakech and if you can grab Patrick's attention then do - he is passionate about the carpets and has real insight into their interpretation."
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "Made Marrakech for us!. Wonderful! We stumbled on this museum by accident (as most of the reviews say...) and it is truly beautiful. The collection of rugs made by women in the tribal villages and mountains is stunning, with an extensive backstory on their lives and why they make these rugs. Each rug is a unique artwork, and we cannot recommend this museum enough. The layout of the works is exquisite, and totally worth the money for how much there is to see. DO NOT MISS THIS GEM!!!!"
        }, 
        {
            "index": 107, 
            "rating": "5", 
            "review": "A Hidden Gem!. I stumbled upon Musee Boucharouite in Marrakesh which dedicates itself to displaying works of art in the form of Berber rugs. All the rugs are woven by women using an array of fabrics and woven into artful pieces. The curator renovated the riad several years ago to be used as a guest house but he has now turned it into a museum to feature this work. Patrick was extremely kind and he very much enjoyed discussing the history of Berber rugs. He was very enthusiastic about sharing this space with visitors and even more enthusiastic about sharing his love for this collection and his wish to preserve the workmanship and artistry for future generations. The museum is definitely worth a visit. http://lacollectionberbere.com/en/collections/boucharouite"
        }, 
        {
            "index": 108, 
            "rating": "5", 
            "review": "Oasis from the Souk. This is a great little museum containing a nice collection of \"rag rugs\" created by berbers from all over Morocco. The museum was a riad and was repurposed into the museum so it has a very comfortable feel to it and I took a much needed rest on the roof-top garden. I literally bumped into the museum roaming the Medina and really enjoyed the detour."
        }, 
        {
            "index": 109, 
            "rating": "5", 
            "review": "Wonderful place . It's was a wonderful interesting place to visit .If you love art and like history this is the place to visit . We spend the afternoon at this museum it was fantastic worth a visit ."
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "not just a museum. Found the place by chance - followed the signs - and it was a very pleasant visit. A collection of rugs, very well put together. Plus there are some interesting paintings. You may think that rugs are boring but you will change your mind once you visit this museum. This woven rugs are more than home décor, they are family history, popular art and culture, all together. Next to each exhibit there's a detailed text (in English as well!!!) so guests can understand the context of how this beautiful pieces came to be. The house itself is beautiful and you can enjoy a drink on the terrace, in the shade. We will visit again!"
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "Special Museum. This is a wonderful gem of a place in Marrakech featuring woven rugs made from scraps of old pret-a-porter clothes on a backing of plastic bags that emerge as stunning art. The rugs have been curated by a man who has taken care to select stunning examples of expression. A moving collection."
        }, 
        {
            "index": 112, 
            "rating": "4", 
            "review": "Rugs. Nice converted Riad found by mistake glad we did very friendly and English reading Hard to find, some signs near leather souks,"
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "One man's passion, highly recommended. We were staying in a riad just round the corner from this gallery, and also stumbled across it by accident. Patrick has an infectious passion for the history and artistry conveyed in these rag-rugs: whole family histories are woven into them.The exhibition is beautifully presented in his riad, with quotations from the woman who created the artwork.This museum is a little gem to the north east of the souk - find the vegetable seller area of the souk and head 50m or so east for the Derb El Cadi on your right and there are small signs to direct you. There's every chance you'll be the only tourists there and it really is worth the effort: Highly recommended."
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "Beautiful and stylish property. Stumbled across this museum by accident - just followed the signs - and were so glad we decided to take a look. Patrick, the owner, was enthusiastic, informative, chatty and welcoming and a joy to converse with. The rag rugs he has collected are displayed artistically throughout the lovely home he has created. There is a mixture of some modern artwork and his personal touches are seen throughout. The roof terrace is an absolute delight and we could have stayed there for hours and hours. Coffee and homemade cakes sat underneath a canopy of drapes to shelter from the hot sun was wonderful. We wish Patrick luck with this new venture. If his wonderful enthusiasm and personality is anything to go by, he will certainly make a great success of it. We would definitely visit again on any future visits to Marrakech."
        }, 
        {
            "index": 115, 
            "rating": "4", 
            "review": "Nice small museum. Only just opened, it essentially showcases rag carpets from the past, displayed in a Ryiad (local house) that still retains the baths, beds etc. As with most things in central Marrakech, not that easy to find but is 5'' south of Marrakech Museum. The roof top juice and cake facility was not yet operational but should be soon. Very pleasant to visit and well displayed."
        }
    ]
}