{
    "category": "Marrakech", 
    "entity": "Ecomusee-Berbere", 
    "avg_rating_stars": 4.726315789473684, 
    "review_count": 95, 
    "rating_stats": {
        "poor": 0, 
        "average": 3, 
        "terrible": 0, 
        "very_good": 20, 
        "excellent": 72
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "Wonderful insight into history of us all.. Fantastic displays and artefacts = beautifully curated - although some more English Descriptions would be good. A must see for Marrakech along with the Jardin Majorelle if in Marrakech for a couple of days or more"
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "Stunning exhibits in an up-to-date setting. Great collection of beautiful costumes, stunning jewellery, crafts and everyday objects. A really informative display, much more up-to-date than any other museum we saw in Marrakech. This exhibition has a real \"wow\" factor, and gives a great overview of Moroccan culture. Surprisingly inexpensive to visit."
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "Spend the extra DarHims and see the museum. A small museum in the Jardin Majorelle, located in the old painting studio. Meticulous and concise, the short tour gives you a pocket sized view of the Berber life without being overwhelming."
        }, 
        {
            "index": 4, 
            "rating": "5", 
            "review": "interesting people and their history. you should see where the berbere people live and work before you go to the souk things are priced better that you buy and cheeper"
        }, 
        {
            "index": 5, 
            "rating": "5", 
            "review": "A museum which benefits the community. Like other comments this review is of the ecomusee Berbere de l'ourika. We stopped here on our way to see the waterfalls further up the valley. And had a very interesting and excellent stop at this small museum. It's a restored traditional family home with the guide giving many insights into the traditions and lifestyle of the Berber people. Berber people have many traditions and the symbolism and story telling within carpet designs was particularly interesting. They are also good engineers, with some very interesting tools and work methods. A great stop and ticket money and donations benefit the community too which is nice. Well worth an hour of your time."
        }, 
        {
            "index": 6, 
            "rating": "4", 
            "review": "Nicely presented. A nice small museum with emphasis on traditional Berber crafts and costumes. Housed within the Jardin Majorelle, a lush oasis filled with plants not native to Morocco. Separate admission is, I think, possible for those who are already familiar with cactus and bamboo."
        }, 
        {
            "index": 7, 
            "rating": "5", 
            "review": "Wonderful ECOMUSÉE BERBÈRE, NOT the one in Jardins Majorelle. It seems that there is a confusion between 2 museums here on Tripadvisor, the Musée Berbère in Jardins Majorelle, and the ECOMUS'EE BERBERE in the small village og Tafza in the Ourika Valley. I am talking about the second one, in the Ourika Valley, 35 km from Marrakech.It is a must on the way to Ourika, probably the worthiest place to visit in the valley. Don't miss the sign in a bend of the road, drive up to the mosk and walk from there (the signs are not very visible). The inhabitants have collected all kind of artefacts related to all aspects of the life in the Berber homes and rebuilt the caid house of the village to host the collection. The museum is very informative, the guide (SAlah ) is simply driven by passion, and the artefacts are very interesting, seldom shown together. A lot of photos, maps and explanations are definitely worth looking for this little but complete museum."
        }, 
        {
            "index": 8, 
            "rating": "5", 
            "review": "The best Besber museum in Morocco. Very impressive collection of Berber objects originating from diverse regions of Morocco, from the Rif to the Sahara. 4 rooms: the Berbers, traditional skills (craftwork, daily objects, ceremonies), jewels (exclusive objects from different regions), and finery (costumes and weaving, arms, doors, carpets, musical instruments).We loved the jewels and clothes."
        }, 
        {
            "index": 9, 
            "rating": "5", 
            "review": "Awesome Museum . I visited this museum on 5th July 2016 and was shown around by Salah. This was a great lesson on the Berber Culture. Salah was so informative and knowledgeable. He has a great personality and made this tour fun and very interesting. I would definitely recommend a visit, this museum is a true treasure!"
        }, 
        {
            "index": 10, 
            "rating": "5", 
            "review": "This was a real highlight of our visit to Jardin Majorelle. The Berber Museum within the Jardin Majorelle in Marrakech is a fascinating and beautifully set out exploration of the Berber culture. The artefacts, art, traditional dress and innovative design of the collection are all first class."
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "Excellent. In village you can see how they pure oil,there way of l,living,school,every thing is organic,Spice factory,Carpet made by hand is wonderful and colourful"
        }, 
        {
            "index": 12, 
            "rating": "5", 
            "review": "Beautiful jewelry. This may be the easiest place to see such a wide variety of clothing and jewelry from the Berbers. Fantastic quality of what they have on display. I was disappointed you are not allowed to take photos, but they do sell photos and books in the gift shop if you need a reminder about what you've seen. The museum is very small, but if you're there in the gardens, you might as well see it."
        }, 
        {
            "index": 13, 
            "rating": "4", 
            "review": "Worth visiting. Lovely exhibition, everything well and intetestinglg presented. You buy the ticket together with the Jardin Majorelle."
        }, 
        {
            "index": 14, 
            "rating": "3", 
            "review": "Interesting,but not worth the entrance fee. Lovely gardens, with some spectacular plants. Museum is interesting, but limited, particularly if you don't speech French. Compare to the entrance fee charged for some truly amazing Marrakech sights, the fee is unreasonably high."
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "Exceptional introductory insight into Berber culture. Small museum within the grounds of the Jardin Majorelle.Very,very good.Very atmospheric lighting in the room around the jewellery exhibits"
        }, 
        {
            "index": 16, 
            "rating": "5", 
            "review": "Great for quick orientation to Berber culture. This is embedded in the Yves Saint Laurent garden, and is a worth while stop to make when there. Price of entry is small (a few dollars), and it will give you a nice overview of Berber culture. Materials are available to read in several languages (Arabic, French, English) so as to have information accessible to visitors."
        }, 
        {
            "index": 17, 
            "rating": "4", 
            "review": "Great stop en route to Atlas Mountains from Marrakech.. The excellent Salah Benyoussef gave us a tour of the museum, and gave us a brilliant insight into his Berber heritage."
        }, 
        {
            "index": 18, 
            "rating": "4", 
            "review": "Very interesting. Gives a brief overview of the different Berber cultures. The focus is on clothing and jewelry. Definitely worth a stop if you are at the gardens since connected to them."
        }, 
        {
            "index": 19, 
            "rating": "4", 
            "review": "Great place to learn about the Berbere culture!. Lovely exhibition, tastefully done and well curated museum. Worth while a visit if you are in Jardin marjorelle and is interested in the Berbere culture."
        }, 
        {
            "index": 20, 
            "rating": "5", 
            "review": "An Excellent Introduction. This museum gave a fantastic insight into the ways of the Berber people. I loved looking all the different pieces of jewellery and the traditional attire. The layout is well thought out and you get taken on a journey as you wander through the museum. This is well worth doing."
        }, 
        {
            "index": 21, 
            "rating": "5", 
            "review": "Well laid out and informative.. Well designed with a card in English describing everything in each room. Allow an hour for a visit here."
        }, 
        {
            "index": 22, 
            "rating": "5", 
            "review": "Really fantastic museum. Very well displayed and explained exhibits. We found this museum very informative and inviting. It also helps that it is set within the jardins magorelle which is stunning."
        }, 
        {
            "index": 23, 
            "rating": "5", 
            "review": "Excellent museum. Not to be missed!. The Berber Museum is a must on a visit to Marrakech. It is a really well thought out museum, which explains the origins and lifestyles of the Berber tribes. The artefacts are wonderful, with the jewellery and clothes the most fascinating of all.\nA gem of a museum!"
        }, 
        {
            "index": 24, 
            "rating": "5", 
            "review": "Loved it!. When I arrived at Jardin Majorelle, I didn't want to enter on this museum, but I changed my mind when I buyed the ticket. This is an extraordinary museum of Berber and I loved it. The only problem is you are not allowed to take pictures inside. For 30 Dirhams/pers, this is worth visiting!"
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "Great museum. This was a fascinating museum and well worth the visit. Great for kids and children. Gave a real insight into Berber life and culture. Exceptional guide. We had Salah (so?) whom was extremely knowledgable and charming. Highly recommended"
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "Daytrip to the Ourika Valley organised by the Écomusée Berbere & Maison de la Photographie (Marrakesh). I spent most of the day there, and would have loved to see more. I saw the river, the gardens, two villages and the museum. Salah, my guide, is a very nice person and explained every item in the museum, and I could even try the musical instruments! (Very exciting for a musician.) His mother cooked me a delicious vegetable tajine."
        }, 
        {
            "index": 27, 
            "rating": "5", 
            "review": "Facinating find.. On a recent trip to the Ourika Valley, we finally managed to visit the “Ecomusee Berbere” or Eco-Berber Museum. Located in heart of the Tafza village (on the way to Seti Fatma), it is well worth stopping off to visit. Khalid who looks after the museum, will guide you around the collection of Berber artefacts, so that each object is brought to life. You will find on display a range of carpets, ceramics, jewellery as well as everyday items and tools used by the local Berber families. This museum is linked to the Photography Mueum in Marrakech, and so a collection of 1920’s – 1930’s photographs of “travellers in Morooco” is also on display. Even though we have lived in Morocco for ten years, we still managed to learn a thing or two!The museum has a lovely panoramic terrace, where you can take tea if you have time."
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "very interesting for the people who do not know about Moroccan Culture. Based on the level of berber background , Ecomusem is just an amazing place to visit to learn more about the berber cuisine and crafts."
        }, 
        {
            "index": 29, 
            "rating": "5", 
            "review": "A FINE COLLECTION, PERFECTLY PRESENTED. This is simply wonderful. Costumes, jewellery, language... Lots of info for those who want it: lots of things to ogle at for those so inclined.A fine collection perfectly presented."
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Personalised Guided visit. Hands on experience. The inaccurate pinpointing on the map seems to show this in Marrakech itself. In fact it is in the Village of Tafza in the Ourika valley some one hour's drive as you head into the Atlas Mountains. We were guided personally around by Salah Ben Youssef born and brought up in this Berber village and given intricate detail of the way of life of the Berbers in this former Chieftain's house where the exhibits are spread over a number of rooms in a relatively confined space. Salah brought everything to life encouraging us to try our hand ao the various musiacl instruments, guess from the designs which carpets were intended for me and which for women. His effervescent enthusiasm made this a tour highlight and onenot to be missed"
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "Salah - a wonderful guide. This visit was a highlight of our trip to Morocco. The enthusiastic and witty delivery from Salah our guide, indicated a true pride and knowledge of his history. This is well worth a visit and I urge you to be generous as it is peanuts to get in and worth so much more."
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "You must see it when in the majorette garden. This museum is small, but if you want a overwiev of the original culture - just use the quarter of an hour it takes. Tastes are different but the thought, that they did this fine juvellary when Europe was only in its medieval age - its impressive."
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "Excelent. Great place to visit, easy to find and very good hospitality.\nThank you so much, and we really eppreciate it"
        }, 
        {
            "index": 34, 
            "rating": "5", 
            "review": "Marvel at the workmanship. Buy your ticket at entrance to Jardin Majorelle. On entering each section pick up the laminated card explaining what you are looking at in English. The clothing and jewellery are fabulous."
        }, 
        {
            "index": 35, 
            "rating": "5", 
            "review": "Ecomusee Berbere Ourika. A fantastic visit with a passionate guide who is obviously doing this for the value of preserving his culture more than for the money. So much more fun than regular museum visit. The location in a renovated but historic adobe building in its original village location is a plus."
        }, 
        {
            "index": 36, 
            "rating": "5", 
            "review": "Recommended. Very nice set-up and good explanations. Many exposed objects can be found in the modern clothing and interior."
        }, 
        {
            "index": 37, 
            "rating": "5", 
            "review": "Great museum. My husband and I both agreed that this was a wonderful museum. We may have been biased because we had spent 5 days hiking in and around Berber villages and were interested in learning more. But this is really an extremely well-curated museum with an extraordinary collection."
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "Lovely. We visited the museum today and were really pleasantly surprised. The walk through the Berber village to get to the museum was magical with so many welcomes! The museum was really interesting and so cheap. The young man who showed us around (salah I think) was thoroughly charming and informative. This was a great visit. Highly recommended"
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "Interesting commentary. My friends and I visited the Berber Museum earlier in the year and it was really interesting as Salah Ben Youssef gave a talk about how the Berbers live. We had only been in Marrakesh prior to coming out into the countryside and the difference was amazing. Salah Ben Youssef made it interesting as he had some funny anecdotes and he was very friendly so we could ask him about the culture. I would definitely recommend a visit here. ."
        }, 
        {
            "index": 40, 
            "rating": "4", 
            "review": "nice but bad info. This is a great museum, except the only English sign board gives completely backward info about religion, and wrong info about the language. Ignore the board and enjoy looking at the beautiful displays, described in Arabic and French only."
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "A beautiful experience and vieuw on the Berber people. The Majorelle garden was not bad, but little disappointing, a nice collection of hugh catussses from all over the world. The museum was a fantastic experience for me. It it nicely arranged an one of the man working there knew so much about the history and especially the Berber people. Nicely arranged objects with proper information. A very nice close off after visting the gardens, very much worth the extra ticket!"
        }, 
        {
            "index": 42, 
            "rating": "5", 
            "review": "Keeping their heritage alive.. We were taken to this Museum by our hotel. It is about an hours drive out of Marrakesh. Really beautiful druve. You feel like you are going back in timewith each km you drive.The museum is in the heart of a Berber village. I did feel like I was intruding. It is very primitive with their clay bread ovan still used outside. We were taken around by a local man. He was very informative and very proud of his culture and traditions. The views fro. The top of the house are amazing.It cost 20 dirhams pp to see this house. We did have a local old man follow us around trying to sell us bracelets and necklaces. The stones are authentic however the metal beads are actually plastic! We nevertheless parted with 220 dirhams as i looked at it more as a gift ith the bonus of some tatt in return. We did have 2 local children asking for money too.Tip. The village is not suitable for wheelchairs or if you find climbing stairs a problem. Very bumpy terrain too for pushchairs. The house has steep stairs and sheer drops so hang onto little kids!"
        }, 
        {
            "index": 43, 
            "rating": "5", 
            "review": "A bit of the local culture. Loved it. If you want to get a taste of the local heritage and culture, something that goes a bit deeper than the markets and the touristy attractions, this is it. Worth a visit."
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "Fascinating little museum. This museum was an awesome little bonus experience, tucked into the middle of Jardin Majorelle. The museum explained this complex culture through well-designed displays of jewelry, clothing and cultural artifacts. Don't miss the jewelry room, which is just magical in its setup."
        }, 
        {
            "index": 45, 
            "rating": "4", 
            "review": "Interesting Little Museum. The young lad who did the tour is from the Berber Village so he was very knowledgeable. It's not what you expect, but it's still a must go. The views from the top is amazing. There were so many children in the village that came out of the wood work and were asking for money. I felt like I just wanted to help them all. One of the mother's just asked for lipstick. I gave them some coins and candy. Made me realize how blessed we are."
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "Fabulous Museum. Best display of jewellery I've seen in ages, and wonderful costumes (some still worn in parts of Morocco), household goods and more. Don't miss it."
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "Tour in the afternoon. Great afternoon looking around the Berbere village and the museum was on the way. The guide was great and very friendly. The museum had many items that day back to 1400. Really nice"
        }, 
        {
            "index": 48, 
            "rating": "4", 
            "review": "small cultural meuseum but cultural. Finally a place of Morocco's history, illustrated with photographs which is more rare.De it was created to be lively and to support indigenous .Top cultural place to see and be enjoyed without moderation! one to two hours provide contact and pleasant place.you can also have lunch or a cup of tea on the terrace."
        }, 
        {
            "index": 49, 
            "rating": "3", 
            "review": "Small but gives an idea - pieni, mutta ideoita antava. The museum is devided on different themes - some everyday equipment, clothes, jewelry and videos. It is fast visited but as a result you get some ideas how the life of berbere was. Here in museum it seems to be more colourful and rich than what you see on the countryside alive. Same in Finnish:Museo on jaettu eri osioihin - arkipäivän välineitä, vaatteita, koruja ja videoita. Museo on nopeasti läpikäyty mutta antaa idean siitä millaista paimentolaiselämä on ollut. Museossa se näyttäytyy värikkäämpänä ja rikkaampana kuin tämän päivän elämä maaseudulla."
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "small but so interesting. Amazing little museum of berber life and culture. Would recommend if history, culture and lives appeal to you. To find this little hub in the madness of marakkech was fantastic."
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "Don't miss this oasis in Merrakech. Lovely gardens and beautiful museum to enjoy. There's a plethora of succulents and other interesting plants to enjoy. Also, the cafe serves beautiful fresh salads and club sandwiches."
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "Good museum in Marrakech. Small museum but very informative and the presentation of the exhibits was excellent. Found inside the Majorelle Gardens. Entrance to gardens 50 DH and to museum a further 25DH"
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "Fascinating. Small but cramed with interesting stuff and translated handouts so you could really appreciate what you are looking at."
        }, 
        {
            "index": 54, 
            "rating": "5", 
            "review": "Review of Berber way of life and dress. This small museum is located within Jardin Majorelle. The painter's workshop and studio has been made into a fine museum on aspects of Berber culture. Manikins wear the dress of various groups. Video displays show aspects of their life. No photos are permitted."
        }, 
        {
            "index": 55, 
            "rating": "5", 
            "review": "Stunning. Refurbished in the last two years and now outstanding. Absolutely essential to visit as part of the garden experience."
        }, 
        {
            "index": 56, 
            "rating": "4", 
            "review": "Located in garden of majorelle. This museum is located in the garden of majorelle and worth a visit. There is a lot of ancient berber clothes and jewelry. It is displayed at a nice way to give an impression of the Berbers."
        }, 
        {
            "index": 57, 
            "rating": "5", 
            "review": "must see. very well done. utensils, dressing, jewelry. many photoes to help you understand berbere life and diversity"
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "Museum in Jardin Majorelle. This is an expertly curated museum on Berber history and culture. The exhibits on clothing and jewellery were especially interesting. This is one of the things which most helped me understand the history of the Berbers and how they have shaped the region. Highly recommended as an add on to anyone who visits the Jardin Majorelle, only wish they allowed photos"
        }, 
        {
            "index": 59, 
            "rating": "4", 
            "review": "A gem. Well worth a visit to see beautiful and sophisticated crafts and gain an understanding of their context."
        }, 
        {
            "index": 60, 
            "rating": "4", 
            "review": "A tiny jewel box of a museum. Tiny, gorgeously designed and beautifully curated (by Yves San Laurent) museum on Berber culture with a (natural) focus on design, clothing (or as they sweetly define it 'finery') and jewellery. A wonderful example also of how to make the most of a tiny space."
        }, 
        {
            "index": 61, 
            "rating": "4", 
            "review": "Small but interesting. This museum is worth your time on a rainy day. There is so much to see in Marrakech, but this little museum shows costumes, jewelry and some of the culture."
        }, 
        {
            "index": 62, 
            "rating": "4", 
            "review": "Fascinating look into Berber culture!. Fascinating look into Berber culture! When in Marrakech on a trip way back (care of a ferry from Spain and a train from Tangier) ... we had the chance to check out this museum and then later in the trip head outside of Marrakech to a Berber market, which was even more interesting and highly recommended."
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "Best Museum in Morocco?. Best museum we visited in Morocco. It's not just that the pieces were curated by YSL, an artist and collector with an eye for the real deal. The museum, though small, is beautiful, including one room that seems to have a Yayoi Kusama infinity room vibe. There was a line to get in, that didn't move terribly fast, but it was worth the wait....and the wait resulted in a comfortable and not-packed visiting experience. This place was a highlight of Marrakech."
        }, 
        {
            "index": 64, 
            "rating": "5", 
            "review": "Interesting and worth a trip. Great to learn more about Berber culture. I really enjoyed this small but well laid our museum, the opening film helps to put into context Berber way of life and the exhibits were well displayed and labelled."
        }, 
        {
            "index": 65, 
            "rating": "4", 
            "review": "Great museum!. This museum is great for giving you an insight in to the Berber's way of life, as well as the lives of the sub-Saharan tribes."
        }, 
        {
            "index": 66, 
            "rating": "5", 
            "review": "Recommended. This museum is located in a riad tucked in one of the narrow alleys of the Medina. Although a bit difficult to find, there are several signs along the way so watch out for these! The museum exhibits artefacts of 'Popular Arts'; mainly Boucharouite carpets, but also exhibits other art forms such as paintings. The riad is an exhibition in itself, so it. The owner is passionate about the collection, and was more than happy to offer us his insights. Definitely one of the highlights of Marrakesh, and highly recommended."
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "One of the best small museums. We had to leave this museum before we decided just to set up camp. Amazingly well done and packed with information without being packed with artifacts. In terms of overall effect it is likely the best small museum I've ever been to. Stunningly well done Berber displays and a tight focus add to the experience. It's in Jardin Majorelle and totally worth the price."
        }, 
        {
            "index": 68, 
            "rating": "5", 
            "review": "Musee Berber in Majorelle Jardin. Name of this attraction in Tripadvisor ranking ( Ecomusse Berber ) does that some people think this is about any Berber village and included photos are proof for that. In Musee Berbere in Majorelle Jardin it is not allowed to take pictures at all - what is a pity. Small but unusual museum and coming to one of its rooms gives WAUW experience as to be in a desert at night. Look not only up but also down - and you will see why. Among tools is there a splendid drill machine. Simply an invention."
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "Brilliant and fun. I enjoyed berbere and i did not dislike anything about it. Wer saw the traditional life in morrocco and we visted mountain and we discovered morrocan oil caleed argan oil."
        }, 
        {
            "index": 70, 
            "rating": "5", 
            "review": "Brief but illuminating overview of Berber history and culture. Would have spent more time in the museum, rather than the surrounding gardens has I known how good it was!"
        }, 
        {
            "index": 71, 
            "rating": "5", 
            "review": "Museum in the Majourelle Gardens.... DEFINITELY worth a visit. interesting, beautifully presented, an English leaflet. Kids found this to be the most interesting \"not another museum Mummy\" place we visited!!!"
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "Excellent. Well established and appointed Artisans Co-op with a good and quality array of Berber and other goods. Not to be missed"
        }, 
        {
            "index": 73, 
            "rating": "5", 
            "review": "Great experience. When it comes to Berbers there is very little I don't like.\nThe museum details the history of Berber tribe."
        }, 
        {
            "index": 74, 
            "rating": "4", 
            "review": "A small but rich museum. A compact collection of beautiful berber artefacts, including jewelry, clothes and tools. Unique pieces presented in a small museum located in the Jardins de Majorelle."
        }, 
        {
            "index": 75, 
            "rating": "5", 
            "review": "Ecomusee Berbere - it's a must!. One of my favourite days in the area of Marrakech was spent in the Ourika Valley. My friends and I (a group of 4) booked the Ecomusee Berbere tour through the Photography Museum (which is also worth seeing), and we were kind of blown away. This is a real authentic experience without stoping at any touristy shops along the way… we used public transport to get to our destination (with the help of our guide), when we arrived we did a gentle three hour hike in the beautiful valley, explored a few villages and a salt mine, then we ate a delicious lunch at our guide Khalid's house - lovely home, amazing food and amazing people! We then toured the Ecomusee Berbere - a great informative museum housed in a renovated Kasbah. Khalid was with us the whole time and was super informative and passionate about the Berber culture, the surrounding nature, his people, etc. This is the real deal - this is not a typical tourist trip.. if you are looking for an authentic Berber experience, ditch the tourist groups (you will see tours advertised in Marrakech at travel agencies, restaurants, and your accommodation), head to the Photography Museum and book a tour with Khalid. I couldn't recommend it more."
        }, 
        {
            "index": 76, 
            "rating": "5", 
            "review": "Hidden Gem. We only found out about the ecomusee through the photography museum - our driver didn't even know about it. While not as developed as the one in Marrakech, the ecomusee has lovely photos, and our fantastic docent taught us all about patterns in the berbere rugs. Our only complaint was that a second guy showed up after our fantastic docent had finished his tour and started throwing his weight around, saying that he was the one really in charge, that despite the fact that it clearly says shared entry for the photography and ecomusee, that we had to pay again, the books were wrong, blah blah blah. Obviously trying to make money on the side for himself. A totally disagreeable man. The docent was charming, however, and the ecomusee is more than worth the duck in, if you can avoid the overseer."
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "Fascinating. Loved the Berber history and all the information. The costumes and artifacts brought the history to life and we learned a lot about the culture"
        }, 
        {
            "index": 78, 
            "rating": "4", 
            "review": "We were blown away by this school. What an experience! The chambers, the terrace, the prayer room all were visions to be seen.We paid to go to the 'museum; as well, but didn't feel the need to go into that."
        }, 
        {
            "index": 79, 
            "rating": "5", 
            "review": "Its a gem away from the tourist trail.. This was a very interesting and informative visit to a beautifully restored traditional village 3storey house which was for the an important person of the village. Saved and restored privately and employing locals it brings work and visitors to a poor area. Khalid who lives in the village was enthusiastic and informative in English and French, about Berber culture and their lives today. You can get there by taxi, shared in my case, then go on to the Ourika valley."
        }, 
        {
            "index": 80, 
            "rating": "5", 
            "review": "Berber home/museum outside Marrakech. Spent a wonderful couple of hours at this beautifully restored Berber house (directions from Maison de photographie in Marrakech) up in the Ourika valley. The guide Khalid (who speaks English and French, and is from the village) is hugely knowledgeable about Berber culture and radiates enthusiasm. Fabulous views of the Atlas mountains from the terrace, where you can have a couscous or tajine lunch, if you warn them in advance. A highlight of my trip.Hilary (UK)"
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "majorelle oasis. beautiful tranquil lush and highly maintained oasis in the centre of Marrakech offering relaxation in a hectic city. Go early before the crowds get there."
        }, 
        {
            "index": 82, 
            "rating": "5", 
            "review": "Precious museum. Very creatively and informatively conceived. Unique and interesting museum. Must see. Excellent short film in the first room."
        }, 
        {
            "index": 83, 
            "rating": "5", 
            "review": "Great experience- an authentic insight into the community life.. Even better then expected. Booked it through the Museum of Photography (it wasn't easy to choose between the different tour options offered by the city) it provided an authentic insight into the life of the community. Did about 3 hours walk through the valley, ate at Khalid's family home (our guide) home, visit the beautifully curated Berbere Museum and a local ceramic factory. Khalid has a natural talent with people, we became friends."
        }, 
        {
            "index": 84, 
            "rating": "5", 
            "review": "A useful primer on Berber life as was. Visiting en route to the Ourika Valley, we were bowled over by this excellent little museum in the village of Tafza--once a chieftain's home on the flanks of the Atlas. The owner's nephew was an engaging guide to daily life in this clan, instructing us in the iconography and colours used in the woven rugs, the working of a Berber door lock and a drill, and the various other tools and artworks they so ingeniously created. We left with a real sense of the culture, not least because of his lively and informed approach. The only sadness is the poverty you see in the village. I have no idea how involved the people are in the Ecomuseum, but I can only hope that the interest and revenue it produces somehow feeds back into their lives."
        }, 
        {
            "index": 85, 
            "rating": "4", 
            "review": "Colorful kaleidoscope and so much more. This is a market which was bursting at the seams when we visited it one afternoon. I was taken aback by how colorful it was the shops with the various goods in it, the people with their beautiful, quirky clothes (a different style sense). The goods were reasonably priced and you can bargain as well. There was this very interesting pet shop and I was kind of tempted to buy a parrot but good thing I didn’t because God knows how I would have carried the parrot back home. Even the haggling part was fun as well."
        }, 
        {
            "index": 86, 
            "rating": "5", 
            "review": "Superb day. This tour,organised by the Photography museum is an absolute must. A wonderful day long introduction to Berber culture led by Khalid, an enthusiastic,knowlegable,kind and very articulate guide. Khalid is a natural host and a gifted teacher. DO NOT MISS"
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "Not sure if this is the Berber museum at the YSL Gardens. We went to the Berber Museum at the Yves St Laurent Gardens (Majorelle Gardens). Interesting display of items, staff willing to talk about the displays. We spent an interesting few hours here."
        }, 
        {
            "index": 88, 
            "rating": "4", 
            "review": "Great guide. The visit to the berber village was a bit of a culture shock. The museum is a steep climb up through the village and we were hassled for money from young boys. However,the villages were friendly and the guide showing us around the lovely museum is very enthusiastic and knowledgeable. He told us he had learnt to speak English in just five months at the beginning of this year. He told us the stories woven into the beautiful carpets and we saw how the homes and lives would have been years ago. He them took us on a guided walk through the valley around the village and explained a lot about life there today. It was a great experience and we felt very welcome."
        }, 
        {
            "index": 89, 
            "rating": "3", 
            "review": "normal. i think nothing especial in this place , i saw the houses before & i think hand in India morebeautiful. it is part of my trip to ourika"
        }, 
        {
            "index": 90, 
            "rating": "4", 
            "review": "fastinating. a real taste of the original berbers costumes, jewelry and weapons so interesting and beautifully preserved"
        }, 
        {
            "index": 91, 
            "rating": "5", 
            "review": "A great way to experience Amazigh culture. We had a great time with Khalid. Book your trip through the photography museum in Marrakech. They'll set you up with someone who will help you get grand taxi to meet Khalid in Ourika. From there, you've got options.There are waterfalls, gardens, and of course the museum.Khalid really steals the show. He speaks a ton of languages and is a great, funny guy. You eat lunch at his house (a really nice place) with his family, and you get to see them work - his dad and brother are both ceramic artists.This was one of our favorite activities during our 6 weeks in Morocco!"
        }, 
        {
            "index": 92, 
            "rating": "5", 
            "review": "A wonderful insight into Berber culture. A fantastic experience. Khalid provides a brilliant insight into a way of life and a community that has a great deal of wisdom and natural richness. A day of surprise (who knew that the Berber language was in part German in origin), great food (plums and apricots straight from the tree ), good humour and hospitality. Thank you, Khalid for the welcome to your village, the smiles of your family anf friends, and one of the best days of my life."
        }, 
        {
            "index": 93, 
            "rating": "5", 
            "review": "Genuine Berber Experience. The tour provided by Khalid at the Berber museum was the highlight of our stay in Marrakech. Go to the photography museum and sign up for the Ourika Valley tour. For 240 DH per person (about $30), the museum will arrange for a shared \"grand taxi\" to the Ourika Valley, where you will be met by Khalid, who will take you through his home village, visiting a pottery shop, meeting children, vieiwing the museum and eating lunch at his family home. Khalid will customize the tour for each group, visiting neighboring villages, the orchards and farms in the valley, a walk to the river, and even a stop for a camel ride. The guide is very engaging and will let you know what it is like to live as a Berber. Thought riding in the shared taxi is a bit daunting, it is part of the experience, and the photography museum makes the arrangements simple, negotiating for the ride with the driver. Plan on a whole day, from about 9 to 5 for the whole trip. It's worth it."
        }, 
        {
            "index": 94, 
            "rating": "5", 
            "review": "Best part of the Holiday. Beautiful scenery of snow capped mountains, tree covered foothills, stunning Berber villages, salt mines, the Berber market (so much better than the Souks in Marrakesh and just as big) the walk through the hills, the lunch with Khalid (Museum Curator) and his wonderful family, the Berber Museum was fascinating, the crazy taxi rides and the friendly Berber people. Stay in Ourika Valley and travel into Marrakesh and you will have a much better holiday. It's only 30 or so kilometres from Marrakesh but you will find the people so different. they smile and don't harass you every step you take."
        }, 
        {
            "index": 95, 
            "rating": "4", 
            "review": "A nice, interesting lession in Berber customs. We went on a day-trip from Marrakesh to Kasbah Bab Ourika, and a visit to this museum was on the agenda. To be honest, we did not think much about it, but we were very much taken by the enthousiasm of the museum guide, and learned a lot about Berber life and customs. When I couldn't keep on standing and listening, the guide put me outside on a little stool. I enjoyed myself watching life in the hamlet around the museum, and greeting the locals going to and from the communal bath. They live in, what we would call, pure poverty, with just ditches instead of paths, with a Frisian cow on a rope attached to a tree but absolutely nothing to graze around her but pure dust and sand, lots of chickens not finding anything to eat either but still, seemingly, enjoying themselves and roosters behaving as super macho's. But life, here, is lived to the fullest, and there is dignity in all those I saw passing by. We were pleased to have visited this museum.It is situated outside Marrakesh, in the Ourika Valley. Entrance fees are small, children free."
        }
    ]
}