{
    "category": "Playa-del-Carmen", 
    "entity": "3D-Museum-of-Wonders", 
    "avg_rating_stars": 4.775862068965517, 
    "review_count": 116, 
    "rating_stats": {
        "poor": 1, 
        "average": 4, 
        "terrible": 0, 
        "very_good": 15, 
        "excellent": 96
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "Something fun and new!. We spent our full day in Playa Del Carmen just chilling and we chose to spend a an hour or two at the 3D Museum of Wonders. We picked a perfect day to go because it was pretty empty so getting our photos was a snap! ;) This was something new for both of us so we thoroughly enjoyed it!"
        }, 
        {
            "index": 2, 
            "rating": "4", 
            "review": "Wonderful. Martin was great . We live in nearby Cancun and had a free invite to overnight in Playa . I had seen my friends Facebook pages and the photos they took here and i wanted to do the same !!! After learning it was $25 each to enter , not even in pesos , we walked away, turned off.We came back .....and we were generously rewarded with Martins personal attention. WORTH IT"
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "Unique and fun family pictures taken. Visited on a Tuesday noticed discounts offered on Sundays. Paid $25USD for adults and $20USD for children. When you enter the museum you are required to remove your shoes walk with your sock or nylons that they provide. The museum has two hallways that are sectioned off by art work area and also indicates where the photographer should stand and were the person posing should stand. On the day of our visit there was no one else visiting and I honestly loved it because we had no one rushing us and we took as many pictures as we wanted to. We were there for about 1hr 1/2 and enjoy all the neat family pictures we took."
        }, 
        {
            "index": 4, 
            "rating": "3", 
            "review": "good but expensive. I think is a cool idea and everything should be fine with a 30 usd cover, which I don't consider that high, but when you compare what you paid with what you get you'll feel robbed"
        }, 
        {
            "index": 5, 
            "rating": "5", 
            "review": "Great fun. Very unique and good fun. Thanks to Samantha for helping us get good pictures. Didn't realize beforehand how interactive it was but really enjoyed it. Entrance is a bit low key so hard to find so would suggest some better signage but well worth a visit!Also a good break from either the heat or the rain!"
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "A must do in playa del carmen. It was one of the best places I visited great idea and amazing people working there a special thanks to \"Samantha \" who helped me to get memorable pictures withe here great ideas and smily face all the time"
        }, 
        {
            "index": 7, 
            "rating": "5", 
            "review": "A must see in playa del carmen a 3D museum that is interactive great timfor children have lots to do spent 2 hrs. Spent 2 hrs there Time went really fast, end result amazing photos. shows you where to stand to take photos to get best 3D effect, a total of 4 rooms filled with 3D pictures.very close to 5th avenue the main destination of tourists to Playa Del carmen"
        }, 
        {
            "index": 8, 
            "rating": "4", 
            "review": "Fascinating. A nice option to spend on a rainy day in Playa del Carmen. It is amaizing how your senses have been tricked.."
        }, 
        {
            "index": 9, 
            "rating": "5", 
            "review": "Amazing experience . Amazing place to visit. Very unique and the art is spectacular. There are also art students who volunteer there and they are super nice and will take pictures for you to make sure they look 3D. This one girl was a sweetheart, can't remember her name."
        }, 
        {
            "index": 10, 
            "rating": "4", 
            "review": "An interesting experience!. This is a place that is worth the visit as you will get some great pictures! The tricky part is getting the right angles when taking the pictures, be sure to bring a decent camera. We went quite late in the evening and had about 2 hours to explore, which i believe is just enough time. A tour guide came and found us and took pictures for us as he said he knew the best angles. The only thing i wernt best pleased about is that he kept telling us how to pose, which did take some of the fun away for us. All in all, a good place to go and visit and have a laugh, also a an interesting place to visit if you are interested in art."
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "A must see in playa Del carmen. My daughter and I visited the 3D museum on our vacation. A very fun interactive experience. $25 was a little pricey but with that being said.... We spent a couple of hours there and got some great pictures"
        }, 
        {
            "index": 12, 
            "rating": "3", 
            "review": "Fun activity on a rainy day. We enjoyed the artwork. It is a self guided tour and you are allowed to take photos. We had fun posing with the 3-D artwork and it made some great pics to take home."
        }, 
        {
            "index": 13, 
            "rating": "5", 
            "review": "Incredible Experience!!!!. I went with a friend to visit this beautiful museum on September 3td...The 3D painting are just amazing! U can take pictures and really looks like u are inside it!That was unique! Never saw something like that before!If u go to Playa Del Carmen is a MUST DO!I highly recommend to visit this beautiful museum!Thank u 3d museum of wonders for this life time experience!"
        }, 
        {
            "index": 14, 
            "rating": "4", 
            "review": "Good break from the beach. Visited this place after reading up on trip advisor while we were on vacation in Playa Del Carmen. Very easily accessible and located centrally and for us was a short cab drive from our resort. Entry was 25 usd per adult ( children below 5 don't pay) In all there are 43 art works and each of them have a pointer on the floor from where pictures can be clicked. In our case one of the staff, a young chap from Ukraine (sorry I am unable to recollect his name) was very helpful and took pictures of us at EVERY art work. He must have spent an hour with us and then said he will leave us to spend more time by ourselves. I believe the staff are generally very helpful in this place. We must have spent a good part of 3 hours in total including the commute. Worth the money and time but only if you are into contemporary art and seek something different."
        }, 
        {
            "index": 15, 
            "rating": "4", 
            "review": "great fun. had my reservations visiting this place, but was glad we visited. it was a lot of fun with art you can interact with and have some memorable photos"
        }, 
        {
            "index": 16, 
            "rating": "5", 
            "review": "Amazing Place, well worth the visit!. We went here one very hot afternoon. This is the most ideal time to go as when it is raining the place gets packed! Not ideal as you wouldn't be able to take your time at each picture and you would end up with lots of people in the backgrounds of your photos. There were only 2 other groups of people there when we went so it was very relaxed. As it was so quiet we were able to have the brilliant Eric come round with us. He was so helpful. He helped show us the positions to stand/sit for different pictures and he took lots photos for us too. We have so many amazing photos that people love to look at. We had a fantastic time, it was well worth the money and my daughter aged 12 loved it to. It is amazing to think that just 1 artist created all these pictures.This place is really worth the visit."
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "A must see!. Do yourself a favour and take time out from the sun and visit this brilliant place. The photos you come way with are well worth it! Don't go on Sunday (cheap day) or when it's raining as it will be a waste of time. Go when it's quiet for the best photo opportunity.A huge thank you to Eric who showed us around and made sure we got the most out of our visit!"
        }, 
        {
            "index": 18, 
            "rating": "5", 
            "review": "Amazing experience,. Great museum, different experience. Arhur took us around and took pictures and explained everything. Go there it's fun with kids."
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "3D Museum of Wonders. We were looking for something to do with the kids and found out about the museum on Tripadvisor. We had a great time, the kids loved it. It was well worth the trip to Playa del Carman."
        }, 
        {
            "index": 20, 
            "rating": "5", 
            "review": "Highly recommend it for everyone.. Had soo much fun taking the pictures. Not expensive for all the picture you get to take with your camera at no extra cost. We had to ask for help because it was only my husband and me on this trip and Tzimatzi \"i think that's how you spell her name\" was very nice in helping us with the poses and takiing our pictures. Highly recommend this place for all the family. Great customer service from Tzimatzi \"hope i got her name spelled ourlt righ\" thank you sooo much!!!"
        }, 
        {
            "index": 21, 
            "rating": "4", 
            "review": "So fun and great employees.. We had a blast posing with our family for these pictures. The employees were really helpful in making sure that we got the right spot. It is a lot bigger than it looks so if you are short on time, run through first and make sure to get shots at your favorite spots then go back with the time you have left."
        }, 
        {
            "index": 22, 
            "rating": "5", 
            "review": "Amazing way to spend a couple of hours . I researched fun things to do with teenagers before travelling and was so glad I found this museum. Easy to find in PDC. Our guide Tzirintzi was very helpful in taking pictures for us and suggesting where to position ourselves for best pics. Enjoyable 2 hours spent for bargain price of approx £19 each!!"
        }, 
        {
            "index": 23, 
            "rating": "5", 
            "review": "Something I was not expecting. Went in expecting to see the \"Magic eye 3D pictures\" as I had not taken interest in finding out what this attraction was. It was nothing like that, it is the 3D artwork created by Street artists that you can become a part of. For that reason, I did not take a camera with us, I was an idiot! Carlos, one of the guide entrance staff, kindly lent us his mobile phone and then emailed us all the images we took, at no additional charge, amazing. My wife and I had fun posing for the pictures, as they are unique in their presentation and we would highly recommend if you have kids. I would also recommend taking a tripod and a camera that has a timer option, this is what we are going to do next time we go. You will have fun and it is not far from 5th Avenue, so make it part of one of your days out."
        }, 
        {
            "index": 24, 
            "rating": "3", 
            "review": "TO EXPENSIVE. I live in Playa and is kice that they have a new entertainment in town. It was wery. But beside pictures.. There is not much to do. And the price is waaaaay to high for what it is. And there ir only the local discaount on sundays"
        }, 
        {
            "index": 25, 
            "rating": "4", 
            "review": "Great fun taking photos on the 3D artwork. A bit pricey but well worth it. This was a great afternoon and had heaps of fun posing on the very clever paintings. Staff were helpful taking photos of both of us and there were helpful pointers of spots where to stand to get the best effects,"
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "Great fun.. Incredible 3D art which is interactive and lots of fun to take photos in. Go with a group so you can all have turns taking the pics."
        }, 
        {
            "index": 27, 
            "rating": "5", 
            "review": "Great Rainy Day Trip. Had a blast! The less visitors the better. You r only limited by ur imagination! Bring a couple of cameras and take the time to setup the best shot! Have Carlos help show u some photo angles! A must see adventure!!"
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "Hidden Gem. If you want a couple of hours out of the sun then this place is perfect.... Hidden down a side street just off 5th avenue."
        }, 
        {
            "index": 29, 
            "rating": "5", 
            "review": "Had a great time! . I found out about the Museum through Trip Advisor. Our taxi driver located the attraction very easily. I didn't like having to walk up several steps (like inside of a movie theater). The theater room was not air conditioned. However once we started the self-guided tour it was absolutely wonderful. I think the price is a bit much. Other than that it was great! I'd probably go back if I ever return to Playa del Carmen."
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Great place to visit!. Visited today, on my own, and Eric was extremely helpful and patient in taking my photo when needed. Easy to spend an hour or two here and get out of the heat for a while! The artwork is amazing.Very enjoyable, Niamh, Ireland."
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "Amazing wonder of the world and fantastic opportunity for wow photos. Wow.. This was a whole lot of fun. We went at 8.30pm and no one else was there so Eric the guide was able to give us a lot of great tips on where the best place was to stand and pose for the best picture. This is soo amazing and I recommend this 3D museum to all the family and couples. I loved the photos we got and had great comments when posting them on FB."
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "Wonderful experience. We had a great time at the 3D Museum. Since we only had about 45 minutes to spare, Tzirintzi escorted us through the museum, explaining how to pose, and even took pictures for us with our phones. It was a wonderful experience and excellent customer service! I highly recommend this museum to everyone who visits Playa del Carmen."
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "Amazing experience. I was very pleased to visit it with my husband. We loved the experience the paintings are fantastic, although it wouldn't have been this amazing experience without the help of Eric who took the pictures for us and guided us through our experience there. I really recommend it! and ask for Eric!"
        }, 
        {
            "index": 34, 
            "rating": "5", 
            "review": "Fun for the Whole Family. I'd been bugging my husband to go here with the kiddos and he did it when I was out of town! He really messed this one up! However, he nicely arranged that I could return within a week and the kids would be free. I would have to pay for myself. Overall, an ideal visit is one where you have 2+ hours to pose with the whole family and let the guides help/take the pictures. They are there to help you pose and make the pictures the best they can be. It's an expensive experience, but worth it for the hands-on experience getting my kids involved with a different form of art."
        }, 
        {
            "index": 35, 
            "rating": "5", 
            "review": "Excellent break from Beach and Heat. We toured the Museum as a way to get away from the Heat and Beach for a day. We spent approx. 2 hours touring the museum which was amazing. Everyone from ages 6 & 9 all the way up to 60 enjoyed this place. This is a hidden gem in Playa that everyone should experience. When we went, it was not crowded at all (only 2 or 3 other groups). If it became crowded, it may not be as enjoyable, but still would be an amazing place. The price may seem a little high, but it was worth it."
        }, 
        {
            "index": 36, 
            "rating": "5", 
            "review": "What a find . Arthur was great he walked with me on my solo trip and took pictures for me and showed me around very nice and kind the place was very cool got some really cool pictures too!!!"
        }, 
        {
            "index": 37, 
            "rating": "4", 
            "review": "Interesting find. Found this on the internet before leaving the states. It was a great take for a short trip into Playa del Carmen. Eric walked around with us and showed us how to stand to take the best pictures and took our pictures when we all wanted to get in them. Great thing to do on a very hot day as it was very comfortable inside."
        }, 
        {
            "index": 38, 
            "rating": "4", 
            "review": "Amazing!. The ticket is about 25 dollars. Is expensive but it is worth it. Museum is quite small, but you can take pictures and we were in it 2 hours. First we take pictures alone, then came Carlos and picture us. He is very nice guy. You need to go there to see what amazing work did some guy. :)"
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "Very unique attraction!. Never seen anything like this before, lots of fun taking pictures (the guides are extreamly nice and friendly btw), and the end results are amaizing! You may think is a little too expensive, but is definetly worth it!"
        }, 
        {
            "index": 40, 
            "rating": "5", 
            "review": "Worth the visit.. Just been to the 3D museum of wonders after finding it on trip advisor. We had such a laugh. The people are very friendly. Carlos showed us how to take the best photos. We spent at least 2 hours in the museum, good day for the whole family, can't wait to show our photos when we get home. Thanks again Carlos and the team xx"
        }, 
        {
            "index": 41, 
            "rating": "4", 
            "review": "A good time... Very unusual!. We went to the 3D Museum, just for something different... And it is! It if fun to see everything and the grandkids loved it. We all had a great time. Make sure you take your camera!! It is a must.The cost to get in is just a bit high... $25 for adults and $20 for kids, so it isn't a cheap visit. But, we had fun, so it was worth it!"
        }, 
        {
            "index": 42, 
            "rating": "5", 
            "review": "A great place! You don't want to miss it.... Artur is a very good guide in the museum, and the best photographer ;))  I highly recommnded you to visit there."
        }, 
        {
            "index": 43, 
            "rating": "5", 
            "review": "Loved it !!!!!. Just got back from an amazing time at the 3D museum with two young kids and the Mrs. This place is amazing an a must do when in playa del Carmen. We were lucky to get Sanela who did an amazing job taking pictures for our family and was very patient with us. Even after walking out of the museum me and the wife wanted to take another picture at the bubble and she gladly obliged"
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "Must visit!. I went alone but thanks to the local tourguidz Carlos, awesome friendly and helpfull young man, my visit is one never to forget! He showed me all the best ways to take pics and took with every art piece splendid pictures!Amazing museum! Bit expensive but worthwile! I highly recommend! Everone who saw my pics wants to come here.Thank you Carlos for making this visit a winderfull experience!"
        }, 
        {
            "index": 45, 
            "rating": "5", 
            "review": "A must do. I discovered this museum on this website. I am really glad that my husband and I went. This is the coolest museum I have ever been to. The staff at the museum were very helpful in taking our pictures and directing where the best angle was to take the photo. The ticket price for the two of us by the time it came through my VISA card came out to be about $49."
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "MOST SEEN!!. This is a mandatory visit in playa del carmen, this museum is AMAZING better if you go with a group of friends! The place have lots of awesome 3D arts that come to live when you take a picture. The staff is super friendly, we spend hours of fun there! I definitely coming back. They also have a little souvenir store, so DONT FORGET to stop and get something, im enjoying my coffee every morning in my 3D museum mug!! i wish i can come back!! ;("
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "Fun Family Bonding. My ten year old located this museum online and asked to go. It was just minutes from our hotel, so we spend a fun family evening here before dinner. Javier helped us out tremendously, positioning us and then taking our photos through most of the displays. Couldn't have asked for a better evening together. Well worth the entrance fee."
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "Perfect cultural evening !. Great museum ! A 3 hour guided tour ! The best guide, great photographer! Such a delightful day ! Kids will definitely love itThanks"
        }, 
        {
            "index": 49, 
            "rating": "4", 
            "review": "An Awsome Experiance. Had seen the new sing on the wall when pass by, had a couple of days off and being a local good price was offered, so we give it a try, at the begining no one explained about it but sodenly we has a guy give us instructions and helping us with the picturers, his name is Arthur if im not wrong (sorry if i am) he didn't speach to much inglish or spanish but we make it work, the photos were great and enjoyed a lot this place, every time i have the chance i recomend, great for those rainy days."
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "Fun and creativity in one place!!!. Awesome place to have really good and creative pictures!!! Bring socks if you get cold when walking on floors. It takes like 1 1/2 hours to discover all the murals. Ask for a host guide- they know how to make the best shots!!! ( Ours was Jaqueline Blass Botello - great one!!). Air conditioning inside. Parking available.Recommend for teenagers and older-small kids might get tired quickly of posing!!! Lots of laughs and fun!!!"
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "Beat the heat for an hour right here! You won't regret it.. The whole family enjoyed this place! If you can't find it, just ask. Everyone we asked knew right where it was. Make sure you bring your camera!"
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "A hidden gem!. This place was fantastic! We went and found it on a rainy day trying to find something to do! It is a new place so not many know about it! My husband was not so excited initially about the idea but once we got there, we had a blast! We laughed and had so much fun! It is a little pricey but you will leave with a bunch of fun photos! We spent about 1 1/2 hours at it but it was not busy at the time we went. It was such a unique experience!!"
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "Wonderful museum experience in Playa!. My wife and I with 2 young teen girls had a blast and spent almost 3 hours taking almost 100 photos! Our family and friends at home are amazed -- they thought the pics are the result of a \"green screen\" with PhotoShop editing. But they are raw photos from my iPhone!Our guide Carlos was wonderful walking along with us to all the paintings and showing us subtle hints to optimize each photo and providing various photo options to make the painting come alive. He also took several pictures so the 4 of us could be in the scene. Make sure to watch the documentary at the entrance if you can spare about 20 minutes to provide background on the artist's early days as a street chalk painter, but it's not necessary if you're short on time and want to directly go interact with the paintings.We visited on a Thursday at 2:30pm when the weather was nice so the museum was almost empty which was great and allowed us to take our time. But then it started to rain and more people arrived toward the end of our visit. so I suggest you call ahead to see how busy they are and if you're flexible consider visiting early morning or at night since they are open until late.We've been visiting Playa every 1-2 years since 2000 and are so pleased this Museum is there. We plan to return with other family members when we go back to Playa next summer!"
        }, 
        {
            "index": 54, 
            "rating": "5", 
            "review": "Definitely a must see . The guide we had was great. He would go to each piece of art and place us in a perfect position for the pictures. Both my kids had a blast!"
        }, 
        {
            "index": 55, 
            "rating": "5", 
            "review": "Best Museum Experience Ever. A totally unexpected experience to have found in Playa del Carmen, Mexico. The entrance was a bit pricey for us but worth every cent. The paintings are beautifully created and our guide Carlos did an amazing job of explaining how each one was created and in assisting us in taking our pictures. It only takes a little playfullness to create memorable pictures; this was such an unforgettable experience. A must see attraction in Playa del Carmen!"
        }, 
        {
            "index": 56, 
            "rating": "5", 
            "review": "Trip to Playa Del Carmen - 3D museum. I had a chance to visit the 3D museum of wonders on my last movie shoot in playa Del Carmen. What a great idea and lots of fun for kids and adults alike. We had such a great time checking out the artwork and taking lots of very fun pictures. I will always cherish the memories from this place. The staff was very helpful and the place was immaculately clean. Definitely a place to visit while in the Yucatan peninsula."
        }, 
        {
            "index": 57, 
            "rating": "5", 
            "review": "Great time, something differetn. My mother came to visit us in Cancun so we decided to visit this location in Playa del Carmen. We really had a blast. It was late so right away our guide, Martin, let us know that time was of the essence as we didn't have a lot of it. He perfectly guided us through the different rooms, setting us up and helping us get the perfect shots! What a blast, we were laughing like mad at how silly we felt but the pictures were gold. I'd definitely go back. I'd recommend for kids but not too young. They probably wouldn't appreciate it as much as older ones. It's not cheap but worth the visit."
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "Don't Believe Everything You See.... A must see while in Playa. The guys working the museum are great, they patiently take you around to every piece, placing you in the correct pose, even going so far as shooting pics for you. Worth the hour spent."
        }, 
        {
            "index": 59, 
            "rating": "5", 
            "review": "TERRIFIC PLACE !!!. I visited the 3d museum last week and I have to say it is a wonderful place, for local people you pay the half price. To be honest i think the prices are a little bit expensive but it's worth it. The paintings on the walls are extremly amazing. You can really feel the 3d Dimension in all the hallway. Another suggestion could be promote it even more. The place was empty and nobody knows where is located. The staff uis really nice, kind and helpful. I am very sure it is going to be a hit very soon!!!"
        }, 
        {
            "index": 60, 
            "rating": "5", 
            "review": "Like No Other . Words can't explain the awesomeness of this place. A bit overpriced but the pictures will last forever! Definitely a fun place for the whole family. Martin our tour guide took pictures for us so that we could be part of the art together."
        }, 
        {
            "index": 61, 
            "rating": "5", 
            "review": "A lor of fun. This was the best experience we had in Playa del Carmen! Relatively new, the museum is not crowded as the town is, and this gives opportunity to slowly explore it and play around, taking funny pictures. Our guide, Jaclyn, was very supportive, giving us the best advice from where to look and how to place ourselves, in order to get probably the most intresting photos of our vacation. And it is like into a game, where children and grown ups have fun! This is also the biggest 3d museum in the world, so don't miss it!"
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "Outstanding . Ok, this place isn't for everyone, but I had a great time. It was a little more artsy than I expected, but Carlos made it a lot of fun for me. You really need a camera to enjoy this experience, and it is kind of like some places where they dress you up to match the period or theme of the place, and you enjoy the pictures later, but Carlos made it fun to pose and create special imigrary. I really enjoyed it, but I could see that it requires a certain level of an artistic eye that not all will have. I'm going to go on and rave about Carlos because he really took the time to help me shoot pictures that I couldn't on my own and offered suggestions, but let me be creative as well. Dedicate some time and effort to this place and you will be rewarded."
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "fun time. Fun to go and take pictures of you and your friends and family with all the 3d effect paintings. Good laugh. Good for small and big kids (adults) :)"
        }, 
        {
            "index": 64, 
            "rating": "5", 
            "review": "We were amazed!. Although my friends and I had not planned this on our itinerary, we came upon the museum by accident! I have to say that we were not disappointed! Our guide, Carlos, was very attentive. He was patient and so helpful with our pictures. He was both a guide and photographer. I would recommend this tour to pretty much anyone!! As my friends and I agreed, this visit was a chance for us to be kids again!"
        }, 
        {
            "index": 65, 
            "rating": "5", 
            "review": "So amazing!!!. Such a fun museum! Amazing staff who help you pose for optical illusion pictures, and are super friendly. Well air conditioned. So cool and fun, with amazing photos!!!"
        }, 
        {
            "index": 66, 
            "rating": "5", 
            "review": "Tons of Fun!. Went there today since I wanted to explore the city a bit more, away from the resort. I arrived around 10:30am which was a good thing since there were only a few other people and I had the place to myself.Since I came alone, the incredible guide Carlos happily showed me each art piece and helped provide recommendations on where to stand for great pictures. He was very nice and knowledgeable about the artist and the pieces represented throughout the exhibition.Thank you Carlos, you deserve a promotion for your service!"
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "Fantastic and unusual. I found this on a Google search when looking for thing to do around playa del Carmen. So glad I did! It is a fun and interesting way to spend time. Agree with other reviewers that it is not easy to find (we actually found it while looking for an optician), best way is to look for pelicanos shopping centre on 10th avenue.We were there for about 9.30am and apart from one other couple had the place to ourselves. Helpful staff who will tell you the best places to stand for the best effect and will even follow you around to take photos (although I am not sure whether this level of service will be available at the busiest times). There are also helpful markers on the floor which indicate where to stand to get the best results from photos.Would recommend although is quite expensive at £20 per person."
        }, 
        {
            "index": 68, 
            "rating": "5", 
            "review": "loved parking here. they have great parking garage access to 5th avenue! would highly recommend paid 3$ us for about 4hours. cant beat location."
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "Vocational trip. Visiting 3D Museum of Wonders in Playa del Carmen, recommended by friend, was the most fun adventure from our Mexican trip this year. Ones I seen my friends pictutes from this museum, I thought this is #1 on my list to visit that time! M6 family weren't really in to going to museum true summer time of vocation, and my kiddo wasn't really excited to have this time of exploring from the beginning... But let me tell you, me my daughter really loved it!!! It is trully cool idea ones it get hot outside and you went already in a morning on a beach, to get to the great air conditioned rooms with mysterious pictures, where you and your kids can be part of it. Stuff is very friendly and will assist you with advices from wich corner you will look your best and mat h to the ephisod, and will kindly help you with photografing. The owner of a Gallery we met there that day was very nice, and I think it is an awesome idea,she became to add on to developing fast already growing Playa del Carmen."
        }, 
        {
            "index": 70, 
            "rating": "5", 
            "review": "So much fun!. Arthur helped us take some really great pics at the museum. It's fairly priced, not crowded and the perfect entertainment for a fun afternoon. It's great for adults and kids alike. Thanks Arthur for all of your help. We had such a great time!"
        }, 
        {
            "index": 71, 
            "rating": "2", 
            "review": "The hard to find atraction. We seen an addvertisement for this museum on the ferry from Cozumel so we thought we go to check it out. Well first it opens at 11am not 9am like all the adds say so don't go until lunch time. Then there was no air conditioning UH very hot. Needless to say it is not easy to find as there are not but one sign and it sends you in the wrong direction. So for all that want to go it is located in a small shopping mall below the movie theator. Enter the building on the side you find the parking lot. There may not be anyone there and you will need to go into the theator to find someone. Good luck hope they fixed the AC."
        }, 
        {
            "index": 72, 
            "rating": "4", 
            "review": "A lot of fun for the whole family. We visited on our last day in Mexico, had just 1 hour to spend there before going to the airport. The exposition is not terribly big, but with kids it's barely enough to see all the scenes, and to take two-three pictures at most of them (but not all), especially during peak season. There is also a video about the museum, which we skipped amid the time shortage. Give yourself about 2 hours so you can make the most of it (like taking really cool pictures). You will be asked to take off your shoes. Take the black socks they give you - I kept my own (white-colored), and it didn't look pretty on the pictures.The price for tourists is double of the price for residents - $25 versus $12.5 (American dollars, not pesos)."
        }, 
        {
            "index": 73, 
            "rating": "5", 
            "review": "Awesome. Went here on a whim after too much sun and this place was fantastic. A lot of fun for about an hour. Did not expect it to be worth the $25 per person fee but it was. Best pictures my wife and I took on this vacation"
        }, 
        {
            "index": 74, 
            "rating": "5", 
            "review": "A really good museum. Yesterday, I went to the museum with my family and it was a good and fun time for us, taking pictures, talking with the staff Sanela (she was very very friendly and attentive with us and she told us that was the best angle for the photo) and watching how the others people were having fun timeI recommend it for all people"
        }, 
        {
            "index": 75, 
            "rating": "5", 
            "review": "Visit to the 3D museum . Fantastic..amazing afternoon..thoroughly enjoyed the museum and the staff were on hand to explain everything on display..well worth a visit!!"
        }, 
        {
            "index": 76, 
            "rating": "4", 
            "review": "different.. This place was fun; I wished they had someone to help us position ourselves optimally for our photos, but we still got some really cool ones. The art is very cool. They make you take your shoes off so you can either go bare foot or wear the weird nylon things they give you. They give you a bag to carry your shoes with you. Worth a visit for the photo opps."
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "Must see!!Unique!!. I have been travel all around, I have been in Europe, Bahamas,Jamaica, Miami,Orlando and I never seen something like this. It is the first time I go in a museum and I can interact with the paint. At the beginning I didn't know what to expect, but after the first pictures I was really surprise and I love it. I start to interact with the paint over and over and I had a lot of fun. It look so real that I showed some pictures to my friends and they asked me how I end up in there and I had to explain that it is a paint and it is all based on prospective. YOU MUST VISIT the 3D MUSEUM OF WONDERS, you can party all night and this is a good activity to try in the day . I found it UNIQUE, really wonderful experience . I LOVE IT, PATRISSIMO."
        }, 
        {
            "index": 78, 
            "rating": "4", 
            "review": "Good-Unique. Nice unique museum. Definitely a good place to visit while in Playa de Carmen. I think the admission was $22 usd (a little high). It was a very different experience that i will take wit me. You are welcome & encouraged to take photos and video. If you want to park at this location you will have to pay (I don't know how much). The museum is in walking distance of Playa de Carmen's hotel/beach district. The high admission is prob due to museum guide which doubles as a photographer/videographer. The tour will probably take about 45 mins to 1hr &15 mins"
        }, 
        {
            "index": 79, 
            "rating": "5", 
            "review": "Awesome place. I have been a Playa resident for almost 10 years and I am very happy to see that attractions of this level area available in Playa del Carmen this visit is a must while visiting La quinta avenidaThe museum is a great novelty and the pictures you can take are awesome great activity for the entire family I'll recommend it to everyone "
        }, 
        {
            "index": 80, 
            "rating": "5", 
            "review": "Amazing 3D gallery. The gallery is huge it takes 2-3 hours to visit all. Very interesting and unique painting. I will recommend to my friends."
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "Sunday Visit With my Family at the 3D Museum of Wonders.. It is by far the best Art-Museum I´ve ever been to! The one thing that makes me say that, is that you can interact with the art exposed at this museum in Playa del Carmen. I took hundreds amazing pictures with these 3D effects and a lots of people started asking me where I was because they were interested in going; In deed, a very original and different plan. Unique experience and funny at the same time; the staff was also amazing. Definitely worth it! I´m already interested in going back with a first-date since it looks like the perfect place for this! :)"
        }, 
        {
            "index": 82, 
            "rating": "5", 
            "review": "Fun for the whole family. What an amazing place! You can interact with the objects in the drawing, as if you become a part of the painting. It's a must see at any age - if you are open for little \"wonders\" in your life."
        }, 
        {
            "index": 83, 
            "rating": "5", 
            "review": "Extravagant . I can be there all day long. Is stoning to se so much beauty in the same place. Exelent for pictures like the ones I did take."
        }, 
        {
            "index": 84, 
            "rating": "5", 
            "review": "So much fun!!!. Me & my husband were vacationing in Cancun - came here for our wedding anniversary. Spent a day in Playa and this was such a welcomed delight to get away from the hot sun. This 3D museum is alone worth the ride from Cancun. Had so much fun!!! It was like we were kids again! Spent more than hour just wondering at the amazing works and taking these spectacular pictures. We had a blast! And I'm looking forward to bringing home the awesome pics we took! I'm gonna show it all my friends, so they can make time to come here on their trips to Mexico."
        }, 
        {
            "index": 85, 
            "rating": "5", 
            "review": "Magic Place!. Great place to visit in Playa Del Carmen to rest from the sun or on the rainy day...very conveniently located just in the centre of the town, hence walking distance from 5th avenue and the beach.Our whole family had tons of fun :) Adorable photos to take back home! Truly magic place! ;)"
        }, 
        {
            "index": 86, 
            "rating": "5", 
            "review": "A must visit!! . Me and my kids visited here a week ago and had the absolute best time. The kids enjoyed every bit of it! We got lots of amazing pictures and had the best time. Definitely will be back to this place!!"
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "WONDERFUL EXPERIANCE ! MUST VISIT !. We went with all family ! Its amazing place and very unique ! I was told its first of this kind in Americas ! i highly recomend to visit this place if you are on vacation in Playa del Carmen , Cancun or Tulum . It is located in Playa center . Has ac and great staff !"
        }, 
        {
            "index": 88, 
            "rating": "5", 
            "review": "On the level with world's best 3D attractions. Visited this cool new attraction with my 8 year old son during the weekend. Amazing fun! Great artistic work! First time I saw this kind of gallery in Singapore last year and I must say the one in Playa is bigger, better organized and overall more impressive. The kids can lose themselves playing for hours. My son was bugging me to go back for the rest of the stay in Mexico:)"
        }, 
        {
            "index": 89, 
            "rating": "5", 
            "review": "A MUST VISIT IN RIVIERA MAYA!!! . If you are staying in Playa del Carmen or Cancun, you just MUSTvisit this place!! It's located just in the center of Playa del Carmen, in a very convenient location right on the 10 avenue, between 8th and 10th street. The museum is full of INCREDIBLE interactive 3D artwork which becomes alive in pictures! We really couldn't believe our eyes how you can literally become one with the art. Our whole family had an AMAZING time there! We took a lot of great pictures and we will never forget this experience. I highly recommend to visit, you will not be disappointed."
        }, 
        {
            "index": 90, 
            "rating": "5", 
            "review": "Wonderful time at this Museum.. I had a great time and perfect guide- Tony- at this museum. The introductory film is very interesting. The artwork is amazing and I loved all the Historical famous works and painting style featured in the gallery. Being part of the art pieces was incredible and couldn't have been possible without my experienced guide Tony. He made sure that the pictures came out perfect too. There is an elevator in the center, so people with disabilities could come as well to join in this fun experience. I saw lots of smiles from all the people there today! I highly recommend it."
        }, 
        {
            "index": 91, 
            "rating": "5", 
            "review": "A GREAT experience...with help from our guide Artur!!!!. This was a great experience for us to toy around with the magical wonders of 3D art. We took a lot of pics and when we looked at them, it was as if we were in the scene. Our guide, Artur, was a great person to help us take our pictures that made the 3D images come to life."
        }, 
        {
            "index": 92, 
            "rating": "5", 
            "review": "Unusual and fun place. My daughter found this museum on the Internet and we visited on a cloudy day. Had a really great guide, Tony, who took photos for us and made it a great experience."
        }, 
        {
            "index": 93, 
            "rating": "5", 
            "review": "An unexpected experience in Playa del carmen!. This is a very unusual experience, a lot of fun for all ages, great photos for mamories, but also impressive art. We came with a group of friends on a rainy day and we really enjoyed it. Highly recommended to all visitors of the Riviera Maya."
        }, 
        {
            "index": 94, 
            "rating": "5", 
            "review": "3D fun for everyone. This is such a neat idea. We had so much fun and we didnt have any kids with us. We took tons of pics. Had lots of laughs. Its a must do if you have kids or friends that are kids at heart. Our guide was very nice and helpful."
        }, 
        {
            "index": 95, 
            "rating": "5", 
            "review": "Fantasy world...... Definitely is experience mast do, is like enter on a magic world of fantasy on 3 DYou area part of the panting on your pictures pose and what ever is the frame you are in side of the magic stories of special effect. The painting they are amazing well done and the armory of the place make very special time to spend there.I wa s with my family and we all have a blast....."
        }, 
        {
            "index": 96, 
            "rating": "5", 
            "review": "Awesome place. It was awesome time! From now it is one of my favorite places in Mexico. I recommend everyone to visit it. Many thanks to Arthur photographer, my pics are terrific!"
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "That was out of this world!!!!. I visited 3d museum of wonders last week with my husband, we spent two hours taking pictures, so many good photos for my facebook! And there was some guy Arthur, he helped to choose right angels for photos. Recommed to visit museum in Playa del carmen!!"
        }, 
        {
            "index": 98, 
            "rating": "5", 
            "review": "Something new you haven't seen before. If you don't know where to go in Playa del Carmen when you are on vacation there or how to spent weekends with your family or how to impress your girlfriend or boyfriend, invite them to visit 3D museum of wonders! I'm sure they haven't seen it before because it is unique place where you can take lots of amazing pictures that look alive. And what's important,museum staff is always ready to help you and to explain how to make photos. Must-attend place in Playa!"
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "Amazing. My pics are fantastic! A photographer is very nice and professional.This is something you definitely need to visit!"
        }, 
        {
            "index": 100, 
            "rating": "5", 
            "review": "Fascinating! Recommended! So fun!. We LOVED this Museum that just opened 3 weeks ago. We spent 2 1/2 hours inside, having a ball taking fun, unique, and cute pictures. A guide comes around with you and takes all your pictures for you. He also assists with the photo arrangement. Great way to spend a few fun hours with your family day or night, rain or shine. They are open from 9 am to 10 pm. Worth every penny! GO!"
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "Fun time. Museum has like 50 plus 3d art exhibits. Spend about an hour there looking at everything. Staff is helpful. Took some fun amazing pictures."
        }, 
        {
            "index": 102, 
            "rating": "5", 
            "review": "Unique museum and greatest fun ever! . Wonderful time!!!! Where drawings coming alive in the photo camera!!!! I had so much fun with my friends and everyone became a child again!!! You have to go with friends or family to share the fun with and move camera in different angles to get the best 3 dimensional effect, but the fun is extraordinary! The painter is genius! I knew some of his paintings from all around the world, but having so much of his work under one roof and the short move about him in the beginning at the cinema, that you have to pass before going to the exhibition- is very educating, interesting and fun. For me it is a place I can definitely come back to few times with a huge pleasure, as I still don't get it how the painter is doing it and the playtime being there is endless! Must see!"
        }, 
        {
            "index": 103, 
            "rating": "4", 
            "review": "New attraction in Playa, great fun!. I went there on my own to have a sneak peek - as we work in the same building, I had noticed the construction and painting. It looks great, and several of the paintings are really impressive!Go with someone else though - when you're alone, no one can take pictures of you!"
        }, 
        {
            "index": 104, 
            "rating": "5", 
            "review": "Amazing place to spend your time. This 3D Museum of Wodners is a fantastic place. There are lots of great perspective pictures. It will become a Must to See in the Playa del Carment."
        }, 
        {
            "index": 105, 
            "rating": "3", 
            "review": "Super expensive. The photos came out great. We went on a rainy day. I felt the twenty five dollar per person admission was way too high. We only spent about an hour here."
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "Finally Art and more culture to Playa del Carmen. Fantastic experience and activity while visiting Playa del Carmen,Lots of great things to do after the tour, walking 5th Ave, great places to eat and shop"
        }, 
        {
            "index": 107, 
            "rating": "5", 
            "review": "Unique Experience !!!!. I travel for Vacations to Big Cities and never seen a Interactive and Fun 3D Museum like this one. It will Become a Must to See in the Mexican Caribbean"
        }, 
        {
            "index": 108, 
            "rating": "5", 
            "review": "¡Great experienced!. Awesome! my husband and I had a very fun afternoon, admiring of the talented perspective work. The other part of the fun is making photos from the correct angle and can show everybody that you were in Italy and a the same time in London and surfing any beach..."
        }, 
        {
            "index": 109, 
            "rating": "5", 
            "review": "Great stop on a rainy day!. An art gallery that people are encouraged to run around and take pictures! Make sure your camera or cell phone is fully charged as it it easier to see the 3D effect of artwork through a lens. Guides are available to help you with pictures and information about the artwork.You will be asked to remove footwear in order to enter gallery. You may want to pack a pair of socks if you are worried about getting a chill. Signage on outside of building is a bit hard to see unless you are looking for it. We went on a Sunday, a couple hours before closing. It was quieter and admission was 2 half price. Not sure if that promotion was for residents only or both residents and tourists. We enjoyed our visit and we recommend it to anyone looking for something to do indoors in Playa Del Carmen."
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "A Wonderful Experience in Playa. A perfect way to enjoy a few hours with your family or loved ones while admiring downtown Playa Del Carmen this 3D Museum of Wonder is a must experience attraction suitable for all ages. Located in Plaza Pelicanos, on 10th Ave. between 8th & 10th you will be transported to numerous exotic wonderlands. Nothing like any other museum. Don't forget to bring your camera or iPhone!"
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "What a fun place to visit. Went here with my boyfriend, it was such a great place to take amazing photos. Perfect illusions, remarkably well done! You must have a camera, the 3D shows up only in your photos. I would recommend this for all age groups from children to adults."
        }, 
        {
            "index": 112, 
            "rating": "5", 
            "review": "Don't Miss Out On This Experience. We live in Cancun and made the drive down to Playa today to check out this new attraction. Well worth the drive. Locals get 50% off on Sundays which makes it quite accessible for those of us who earn pesos and not US dollars. For Americans and Europeans the price is very reasonable. Be sure to take socks because although they give out small pantyhose footwear they had run out and the floors are very cold. It's a great way to spend an hour or two being wowed by the 3D artwork and to capture some great images. Make sure you take a camera! They have staff on-hand to point out the best angles to get the best effects my only suggestion is that they should be wearing t-shirts that identify that they are working there because at first it feels somewhat obtrusive when someone comes up to you and starts telling you what to do without knowing that they work there.Also, because they place is fairly new there aren't too many people right now while you go through the various exhibits so you can really get the most out of the experience which is completely interactive. Perhaps they should consider, for the future, having people go in small organized groups with an allotted time for each exhibit so that you can get the most out of each exhibit which requires time to set-up the photo and really understand what is going on in the image. I would hate to imagine what it would be like once there are lots of people all trying to take photos of each exhibit. Some planning will be required.That being said we thoroughly enjoyed ourselves and plan to go back again but the next time with socks and a better camera and a GoPro to see what we can do with them."
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "AMAISING EXPERIENCE. IT WAS A REALLY FUN TIME TAKING PICTURES IN THOSE BEAUTIFUL SETS. IT seems to me to be in hollywood or nyc not in playa del carmen, really well done and lots of fun!"
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "Absolutely fantastic!!! Must visit 3D Museum of Wonders in Playa Del Carmen. 3D Museum of Wonders is a wonderful place to visit during Your stay in Playa Del Carmen and Quintana Roo. Lot of photos for Your albums and unforgettable experiences are granted. All the visuals are originally made by the world's 3D painting art pioneer and they all are worth to be called the masterpieces. We made pictures with telephone and photo camera. All pictures are amazing. We experienced unforgettable joy. It was an attraction to all of us, despite of age.Great location in the center of town 10th Av. between 10 & 8th St. - close to all famous central places, cafes, beaches, shops, etc. We reached 3D Museum of Wonders instant."
        }, 
        {
            "index": 115, 
            "rating": "5", 
            "review": "The most amazing adventure in Playa!. Just visited the museum, super impressed with unique idea of it. It's is magical, I felt like a kid in candy store, so exciting and fun! It takes you the land of wonders and creativity! It is very well done and I've never seen anything like that before! I would definitely be back again, because there always new ways to explore it. Make sure you visit it and enjoy the experience!"
        }, 
        {
            "index": 116, 
            "rating": "5", 
            "review": "2 hours of pure JOY.. This is an absolute MUST visit new attraction in Playa del Carmen for all ages.It is fun, you take great pictures to send home, make an album. The vist will bring all in super good mood. You can play with more than 30 different 3d paintings made by an Italian artist and pose alone or with your friends. Super friendly helpful staff will assist. It is affordable too."
        }
    ]
}