{
    "category": "Playa-del-Carmen", 
    "entity": "Cenote-Chikin-Ha", 
    "avg_rating_stars": 4.605015673981192, 
    "review_count": 319, 
    "rating_stats": {
        "poor": 3, 
        "average": 11, 
        "terrible": 5, 
        "very_good": 75, 
        "excellent": 225
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "Hidden family adventure gem!. Our family is very active and loves adventure. We were driving down the road to Tulum and saw this place. We decided to visit. For $35 a person we got the all inclusive treatment. A tour guide that took us on a bike ride to visit a Cenote cave. Zip lining, snorkeling in some pretty awesome Cenotes and then we got to enjoy the park on our own. Soooo much better then those hyped up Xelxa parks, xcaret parks. We have done it all. Don't get me wrong those places are fun. But, this place for the $ offers so much more! We actually got to relax and enjoy our time together as a family... no running around the park, no pushing and shoving with other guests. We got top notch service, individual attention and once we were hungry they have a kitchen that serves delicious empenadas (for a little extra cash). So, if you are looking for a unique experience this is it! It's been about a week since we visited and not a day goes by that my kids don't talk about Chikin-Ha. Thank you David for being an awesome tour guide."
        }, 
        {
            "index": 2, 
            "rating": "4", 
            "review": "Very pretty. This was a lovely stop after visiting the Mayan ruins. In addition to the cenote there were lovely cafes and a garden with walking paths."
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "Unique Experience. Although our visit was relatively quick this was a nice thing to do while on a beach vacation. There are apparently over 4000 cenotes in this area of Mexico and I've only been to two but this was a lovely area and the \"hiking\" was not difficult."
        }, 
        {
            "index": 4, 
            "rating": "5", 
            "review": "Cenote. Beautiful spot to visit. We had a car we rented while at the resort in Playa del Carmen. This was one of our favorite spots to visit!"
        }, 
        {
            "index": 5, 
            "rating": "4", 
            "review": "swimming into deep waters. After a sunbathing day in Chichen-Itza a cool and refreshing dive in this blue-green water was the max. Pity that it ended with stormy weather and lots of rain. But we had prior to this a lot of fun."
        }, 
        {
            "index": 6, 
            "rating": "4", 
            "review": "very nice cenote for bathing and snorkeling and - if trained - diving. Cenote chikin ha is nice and offers some logistics (bathrooms), in a very beautiful environment. I came here for diving, but families also enjoy the place, and snorkel or jump in the clear and fresh water (24 celsius)"
        }, 
        {
            "index": 7, 
            "rating": "5", 
            "review": "You won't be disappointed!. Wow! First ceynote experience and loved it! Great dives and the crystal clear pool outside of the caves is family friendly. We took our 2.5 year old with a floater and he LOVED it. Watched the fish, snorkelers, and zip liners. We could've stayed all day.Their is a cook at the kitchen that works a couple days a week. She made fantastic empanadas for 10 pesos.Very local and in the jungle - -they offer off roading, etc there too. We saw a tarantula while there. So, it's the jungle folks."
        }, 
        {
            "index": 8, 
            "rating": "5", 
            "review": "Unique Natural Beauty and Adventure. My wife and I did three cenotes together, where you snorkel in two of them and walk around the third one then get a lunch. This was preceded in the tour by a snorkel with turtles in Akumel. We did a Viator tour. Nickolas was our guide and was excellent. The cenotes are intrguing and beautiful with extraordinarily clear water. A tad chilly but not too bad. This was a geographical learning experienced, full of beauty and just a great tour. Lunch is a little skimpy. Photos were $30 for the entire tour which compared to other tours is a great buy and you can bring your own waterproof camera. We enjoyed this and Nickolas was a great guide. I wish they would take the large orange hose out of the cenote and remove the wire cable above it. They detract from the photos and views."
        }, 
        {
            "index": 9, 
            "rating": "5", 
            "review": "Seeing is believing!. Beautiful cenote! The water was crystal clear. Be careful because you really can't tell just how deep the water is until you're actually in it. We had lunch with out tour. The food was authentic, flavorful, and filling. The hostess was polite."
        }, 
        {
            "index": 10, 
            "rating": "5", 
            "review": "Fantastic. It was fantastic clear cold water just what was neede after visiting Coba Maya fantastic trip and Jose our guide was very informative."
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "Real improvement. Major overhaul and refurbishment since my last visit. Management have really taken it upon themselves to make it a better facility ."
        }, 
        {
            "index": 12, 
            "rating": "5", 
            "review": "Fun afternoon. Booked the trip to swim with turtles in Akumal with scuba caribe and it included entry to this park. Their literature described it as a visit to a cenote after lunch. The photos looked nice. What actually happened is that you arrive, get to do 3 zip lines, 2 over open cenotes, and one high and fast one. Then you have lunch, we had fresh cooked empanadas and pico de galo. Food was amazing. Then a Mayan cleansing ritual. Then you get to swim through a cave seeing the rock formations and cave paintings. Then FINALLY a swim in the beautiful cenote. It was an incredible day out and value as part of this trip, and I would recommend it to anyone staying nearby."
        }, 
        {
            "index": 13, 
            "rating": "4", 
            "review": "Have to experience this. This was a pretty cool experience. The cenotes were something I have seen on tv and wanted to experience. If you like snorkeling or caves you will enjoy this activity. Warnings: the water is cold for some (73-76 degrees). If you have claustrophobia or don't like tight places you probably won't enjoy this much. Good to do on a hot day, because the water will definitely cool you off."
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "Wasn't expecting much. . I weren't expecting much of a fun time here but I soon ate my words. Was absolutely amazing and would DEFO do this again. Swimming and snorkelling in caves and small lakes and also very knowledgeable. Glad I did it. Great tour guides too!"
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "Great GUIDED cave diving.. If you're a certified diver, with great buoyancy and comfort in tight places, then a guided cenote dive is a good thing to do.We have gone with several groups, and went with a guide from German Yanez, a world-recognized cave instructor in Cozumel. They handled all of the arrangements.The cenote starts in a pool. After donning your gear, going over safety procedures and gas management, we were off. The cenotes in this area are fairly cold (need a 5mm wetsuit, and a hood, to stay warm). You will need a light and a back-up. The guided tour is very relaxed. You get to see a lot of the cave, the halcyon line (fresh/salt-water demarcation layer), and lots of channels and small rooms.It takes a whole day to do this dive (you will probably move to another site), but is well worth the effort and planning that it takes to do it safely."
        }, 
        {
            "index": 16, 
            "rating": "3", 
            "review": "Great place, too many people. Great swim, right beside a restaurant. You can jump from higher platforms and have lots of fun BUT remember that this water is \"heavier\" than you are used to in pools, rivers, and the ocean. Do yourself a favour and take a lot of air before jumping. Also, if you are not a good swimmer, don't be a hero, rent a life jacket."
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "A must see!. Beautiful property, well-kept, nice Banos. Favourite cenotes so far to dive in. Snorkeling available to. Would love to have had more time to walk around the grounds taking in the \"jungle\" and wildlife."
        }, 
        {
            "index": 18, 
            "rating": "4", 
            "review": "Beauitful cenote and relaxing dive. This was my favorite of the three cenotes I dove. Like all of the cenotes, the water was crystal clear and beautiful. The formations within the cavern are stunning and I liked how wide the caverns were (not claustrophobia concerns)!"
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "Truly Breath-taking! The Experience of a Lifetime. Wow!!! I never dreamed that I would get to see such a beautiful sight!! If you get the chance, come to this place! Be respectful of where you put your feet and take in the amazing views! The Cenotes are such beautiful creations and I am amazed by them! Seeing the light come into the water is like another world."
        }, 
        {
            "index": 20, 
            "rating": "4", 
            "review": "Unique experience. This is one of several cenote options south of Playa. Be aware that sunscreens (all types) and swim fins are not allowed."
        }, 
        {
            "index": 21, 
            "rating": "5", 
            "review": "BEAUTIFUL!!!!!!!!. This is a must see and do activity! you will learn so much about the mayan culture and repel down to what they used to believe the \"underworld\" entry!"
        }, 
        {
            "index": 22, 
            "rating": "5", 
            "review": "Incredible experience. My husband and I were staying near Akumal for our honeymoon and we booked an excursion through Ocean Tours Akumal turtles and cenotes. It was the best day we had on our trip! Our tour guide, Macarena, was so knowledgeable and incredibly sweet. Our group was able to visit 3 cenotes at Chikin Ha, where we swam in 2 and observed the other. I had never experienced anything like this! It was amazing! The cave cenote was breathtaking. We snorkeled in the crystal clear, very cold water and we couldn't even see the bottom. I thought I would be scared since it was kind of dark in that one and we were in a cave, but the group was great and there was a line to hold on to when we went from one part of the cenote to another. I had never seen such clear water in my life!The open cenote was also amazing. It was in the middle of the jungle and had beautiful plants under the water and so many colorful fish. My husband used to have a fish tank full of guppies and we saw them there in their natural habitat! That was cool. The water felt so amazing since it's so hot and humid in August, and we didn't want to leave! If you couldn't tell, we LOVED LOVED LOVED this excursion and I definitely recommend booking with a group and a knowledgeable travel guide. She told us stories about the wildlife and the cenotes and the history there. Everyone always felt safe and comfortable too. We booked Ocean Tours through Lomas Travel at our hotel for $79USD per person for the sea turtle snorkeling in Akumal plus these cenotes and it was worth every single penny!"
        }, 
        {
            "index": 23, 
            "rating": "5", 
            "review": "Quiet amazing. Definitely worth a visit. For us it was not so much the water, it was more about the creation of the cenote and how they are all linked. I was not aware that there is about 14m of fresh water with sea water underneath. Quite amazing.The water is crystal clear and warm - 24c."
        }, 
        {
            "index": 24, 
            "rating": "4", 
            "review": "2 great Cenotes with Zip lining for beginners is perfect. We had fun and it was experience, I have never done the Cenotes and Zip lining so this was perfect. I personally do not like heights so I did 3 of the to Zips and that was good for me . If you like edventure then the 3 line is for you, as per the Cenote is was beautiful and the natural rock formtion/ caves along with snorkeling made this excursion fun. The price is right and if you stay at the Barcelo you could walk but I recommend a Collectivo (Tax)i, because once you cross you still have a ways to walk to the main entrance."
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "AMAZING. Best excursion ever! Absolutely gorgeous, highly recommend! Water was perfect temperature and the fish are so pretty. It was very relaxing."
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "Great experience. It was a lot fun.. Water is freezing though.. Overall glad we did it. We did with great group and our tour guide was awesome."
        }, 
        {
            "index": 27, 
            "rating": "4", 
            "review": "Go see a cenote. Returning to dive the cenote after 20 years, it was nice to see the next generation of ownership taking acre of this sacred place. We dove with Dive Mike and Jorge did a fantastic job with our inexperienced dive group. The access and grounds are being updated but be careful. Exposed rebar, and other areas under repair; made the adventure a bit more \"exciting.\" A natural wonder that must be seen."
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "Like no other place on earth!. As part of a day trip with diveXplor.com we went to Akumal and here. What a fabulous experience Chikin Ha is. Three totally different cenotes, two you can swim in and one sacred. The water was crystal clear, you could see everything and I felt like I was in another world. Snorkelling through the caverns it was so relaxing and time was irrelevant. There's lots to do here. There is wonderful information on Mayan culture and it's a great place to do something unique."
        }, 
        {
            "index": 29, 
            "rating": "5", 
            "review": "Fabulous dive. Did scuba dive here. Well worth the trip. Other people snorkelled with good feedback. Went with pro-dive Mexico. Freshwater cave dive totally different to what I have done before. Definitely recommended"
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Chickin-Ha cenote. We heard about cenotes many times from our friends, but experienced this miracle for the first time in the summer of last year (2015). We were vacationing in Mexico, in Playa del Carmen, that day we vent to Tulum, to see Mayas ruins and pyramids, than we vent to the beach, not far away to swim with turtles. The day was really, really hot (nothing unusual for the summer), we were tired, beat up, and heat existed. The only thing we could of dream was a cool shower, and cold beer. Our friends told us that they have a surprise for us; I told them that the only surprise I will accept is a cold 6-pack. But they took as (me, my wife and my daughter) to a place like I have never seen before ( and only 300 pesos per person , $ 15 dollars) I could not understand what it was, but the water looked so fresh and inviting, so we just went right in. Oh, my Lord, it is absolute impossible to describe the feeling that we experienced at that moment. After 98 degree heat, submerging your body in the cool (70 degree) water was heavenly. We spent about 1-1.5 hours swimming, relaxing, and enjoying the water and the beautiful view. When we came out of the cenote (that how my friend told me that little lake was called), I understood meaning of the word- rejuvenation. It felt like there was no long day of extreme heat and long walking behind as, It really felt ……Well, I don’t know how to describe the feeling. Skin, burned by mad Mexican sun felt so soft and smooth. Undesirable.This year we went there again. Highly recommending. The cenote called Chickin-Ha located on Mexican freeway # 307 ."
        }, 
        {
            "index": 31, 
            "rating": "3", 
            "review": "Nice but not what I expected!. The cenote itself is very beautiful, however, the rocks are very, very slippery! If you do not have on water shoes you could really break your neck. I thought I was going to the under ground cenote so I was slightly disappointed. However this was beautiful. I did not stay in the water long as it was very GREEN. The children there seemed to be having fun, the water was not cold and there were fish swimming with you. The life jackets they give you, well lets say some could be revamped...."
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "Beautiful!. Awesome experience! The water feels cold but it's so worth it, if sunny, you'll get great underwater views of caves!!! Might want to bring water shooes"
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "Worth the walk (1.5 miles) from the main road. There are 2 beautiful and enormous cenotes back in the jungle here, part f a state park (I think). Both of them are partially in a cave, and partially out in the open. The water is crystal clear and cool enough to feel crisp and refreshing, but not cool enough to seem cold. There is nothing in the water that is going to bite you. Swimming here makes you feel like you are truly lost in the jungle, stumbling across your own oasis. There are few crowds, so when I was there (around 2pm), my party had the whole place to ourselves. I will go back again.You can get a taxi from your hotel, all the way back into the jungle and not walk the 1.5 miles from the main road yourself. BUT negotiate a price first, before you leave your hotel and for ROUND TRIP. Otherwise, if you wait to call a taxi when ready to leave the cenote, the price quadrupled on us to get back to the hotel."
        }, 
        {
            "index": 34, 
            "rating": "5", 
            "review": "Super Cool Cenotes !. I have been in a rainy day in these Cenotes but I have really enjoyed my experience . The Cenote Chakin Ha is not too far from Playa del Carmen, around 30 Minutes by Collettivo ( cheap Van Taxi Service ) it's composed from more than a Cenote and just in one is possible to swim . The Daily Pass of 300 Pesos per person include the possibility to swim in the Cenote and to visit the area around it where you can discover another 1 or 2 Cenotes and 2 Caves . With a guide is possible to visit one of these Caves where is possible to swim, otherwise you can look at it from a kind of terrace built next to it . The area it's plenty of mosquitos ! ! ! Now you can use Solar Cream and others lotions for the Cenotes contamination so I would recommend to have a nice swim in the main cenote after that lot of anti mosquitos lotion ! ! ! Enjoy this incredible place !"
        }, 
        {
            "index": 35, 
            "rating": "3", 
            "review": "it was cool but not really my style. really cool looking but not worth the mosquito bites in my opinion. you cant use any repellant or sunscreen here."
        }, 
        {
            "index": 36, 
            "rating": "4", 
            "review": "Great Time had with Turtles at Akumel Beach and Cenote Chikin Ha Tour by Ocean Tour. We booked the Turtles and Cenotes tour with Oceantour through our resort and had a wonderful time. My family of four (kids 12 and 15) was picked up on time by the tour bus and our guide for the day was Francesca, who was simply marvellous the entire time. We were driven to Akumel Beach where everyone was provided with life jackets and snorkel gear. Francesca was great at giving her instructions and Gonzales was our photographer for the tour. We spent about 50 minutes snorkelling and were able to see about six different sea turtles eating and two sting rays. After our swim with the turtles we were driven to the Cenote Chikin Ha.Again, Francesca was great at giving us the history of the cenotes and we were able to swim in a large open one and then got to go in a partial underground one. It was such an amazing experience. After swimming, a buffet meal was included, which was only fruit and meat on a bun. We were not impressed at all with the meal, but it was the turtles and the cenotes that we came for and we were not disappointed in either area. After lunch Gonzales showed the groups pictures and the price for a CD or a USB was $30.00 U.S.D., which I felt was quite reasonable (Actually at the time of writing this review, I had just finished another similar tour and the tour offered their pictures for $65.00, so $30.00 was a definite deal).Overall it was a great tour. Remember to bring swim wear and a wet shirt (long sleeved is better) as they do not allow sunscreen with the turtles or the cenotes. If you forget the wet shirt or t-shirt, OceanTour does offer to sell their long sleeve shirts for $20.00 U.S."
        }, 
        {
            "index": 37, 
            "rating": "1", 
            "review": "Lost Camera. My memories captured on my underwater camera was lost in the cenotes. Staff at front desk did not show any concern and brushed me aside. I would not return based on my experience."
        }, 
        {
            "index": 38, 
            "rating": "4", 
            "review": "Great places to visit. Good places to visit fro a trip . lots to see and do for all the family . Good shops easy to get a taxi from Hotels in Riviera Maya or uses the local bus services easy to uses"
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "Stunning. Went here with part of a trip to the ruins well worth a visit but was an extremely long day so be prepared as some travel advisers tell you different time scales"
        }, 
        {
            "index": 40, 
            "rating": "5", 
            "review": "Cenote. Beautiful spot to visit. We had a car we rented while at the resort in Playa del Carmen. This was one of our favorite spots to visit!"
        }, 
        {
            "index": 41, 
            "rating": "4", 
            "review": "Cenotes Dive of Chikin Ha. We dove with Pro Dive and Gustavo was our guide. He was excellent. Diving the Cenotes is a wonderful experience. I suggest that you have 25 dives or more in your logbook before trying it out. The guide is super safe and has extra tanks for emergencies, but you are diving in closed quarters for 45 minutes. I highly recommend a full body wetsuit. I went with a shortie and was fine for the first dive, then cold on the second. Water is super clear and there are only rock formations to look at. Fresh water dive, so divers may want to make this there last dive and then all of their equipment is flushed with fresh water for the journey home."
        }, 
        {
            "index": 42, 
            "rating": "5", 
            "review": "Magical place. We visited Cenote on our day excursion to Tulum and then to Playa Del Carmen for shopping. Swimming in the Cenote was such an awesome experience. The water is cold when you first get in, but feels great after being in the hot sun at Tulum."
        }, 
        {
            "index": 43, 
            "rating": "5", 
            "review": "Great experience. This excursion involved both the Chikin Ha Cenotes and also swimming with turtles at Akumai Bay. Fun experience seeing several different areas starting with 8 am pickup in Playa and returning around 2:30.Started at Akumai Bay with turtles and coral reef. Probably saw between 15-20 turtles. Ricardo and his photographer did a great job. I can't remembe the photographers name, but he did an awesome job. He took over 200 pictures in which you could purchase on a flash drive for $30. Great pictures of many animals, group and couple shots as well as the scenery.---well worth the money. Other highlights included several stingrays, puffer fish, and endless reef shots. After snorkeling with turtles, took a short trip to Cenotes. We were able to swim in two Cenotes, plus visit another one with a religious ceremony taking place. Water was so refreshing. Ricardo did a great job explaining traditions as well as identifying various plant life--root systems are amazing. Small snack before return to resort.They don't allow sunscreen at the the bay, so recommend wearing a shirt if sunburn is a concern. Highly recommend this experience as the Cenotes was something I hadn't experienced. It wasn't a strenuous activity. Equipment of snorkel, mask, and life jacket were of decent quality."
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "Amazing. This was our first time to a cenote & it was everything we had hoped. We were lucky & had a guide, Able, to ourselves. He was very informative, explaining everything to us, & took some awesome pictures for us. This is not your tourist attraction which is why we loved it so much. Thanks again, Able for making our first experience so great."
        }, 
        {
            "index": 45, 
            "rating": "5", 
            "review": "Cenote Chikin Ha - Very Nice and Quiet!!. Overall, we really enjoyed this cenote. We had never heard of this one, but we drove by and saw it on the side of Federal Highway 307, about 20 KM south of Playa Del Carmen. This cenote is not listed or advertised in any of the brochures or pamphlets. It is next to Cenote Cristalinos and Cenote Katchen-Ha park. It is a mile west of the highway and a info booth is located at the front gate. The man at the booth provides you with a ticket and you pay at the reception desk inside the park. There were showers, changing rooms, and running water and toilets. There were two types of ticket prices: one for the zip line and all cenotes they had to offcer for $45 or the $20 for the three cenotes. We chose the $20 option, and it was well worth it. Water was cool, clean, and actually drinkable (although i did taste it and it was cold and clean). We spent about 3 hours there. Bring water shoes, towels, and some food or snacks. They do have a small kitchen and souvenir stands. Life jackets and snorkel equipment is available at no extra charge."
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "Surreal! An experience I'll never forget!. Absolutely beautiful. Even with all the people there, the water just seemed to be so quiet and tranquil."
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "Wonderful Remote Cenote Eco Park - Not Disneyland Tricked out. ***Big Cave Diving Site, Although We Just When For the Snorkeling and to Explore**First, I just want to get it out there that we loved this place because there were NO crowds. Maybe 20ppl in the entire park.My wife and I, both in our mid 40s, and were staying at the Hard Rock Riviera Maya on a vaca in late May 2016. We wanted to see some of the local cenotes but thought the $240 USD for the tour the hotel offered was an unreasonable amount. I was right ;^)This is park is only 5 miles south of the resort. We took a taxi from the resort and it took less than 10 minutes to get there and cost $200 pesos ($11USD). We gave ourselves about 3 hours to visit the park and asked the taxi to pick us up afterwards and they did.We paid $600 pesos ($33USD) for the two us for the entrance fee. PROBABLY..a bit more than we should have, but we came outside a tour group and we didn't call before coming.The park is very rustic, Xcaret...it is not, but that is what we wanted. Everyone speaks english and are very cool. There are not lockers, so bring the minimum. If you have a snorkeling set, bring it or they will rent a set for $50 pesos.A guide will walk you around the park from about 20 minutes. Don't worry...they are not there to follow you around all day. Let them show you everything. I am a generous tipper and I gave my guide $200 pesos, probably $100 is fine.There are 3 cenotes, although you swim in just 2 of them. The 1st cenote in the back is the best. Your half in a cavern and the water is crystal clear. The 2nd cenote is more like swimming in a creek with clear water. There is a lot of vegetation, so there is a lot decay that can get stirred up if you are not careful. The fish viewing is fantastic, all fresh water. Three-3 1/2 hours is really all you need, then move on down to the other Cenotes in the area or Akumal Beach.Bring: a backpack or bag, a few bottles of water, snorkeling set, a few towels, an UNDERWATER CAMERA!!, and maybe a small snack."
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "Part of our full day tour. We visited here later in the day, in fact it was closing time, 5pm. We had a tour guide that led us to the best areas to snorkel. It was a great way to cool off since the water was cold!"
        }, 
        {
            "index": 49, 
            "rating": "5", 
            "review": "Swimming. This was fun. I was not a fan of swimming to the second part (which you will know what i mean when you go) but where you do the experience of jumping into the water, that section was really nice."
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "Akumal &Dos Ojos Cenotes excursion. Great tour, friendly staff. Best day of our trip.saw the sea turtles at Akumal & the caves were beautiful. Lunch was included which was ok."
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "Beautiful Cenotes. My friends and I went to the Cenotes Chikin Ha. There were three cenotes; only the first one was open-air. We did swim in that one, which was lovely!! The other two were in caves. It was a very short walk through the jungle to get from one to the next. We got there by rental car. Drove south from Playa del Carmen. $20.00 USD per person. Changing area, bathrooms and shower. Great afternoon."
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "Amazing. I went here with a group of about 15 friends as we were in Cancun celebrating a wedding. I was a bit worried that this was going to be an overly commercialised kind of place. I couldn't have been more wrong! It was set in a national park type setting. The zipling and quad biking were fun and added to the whole experience but the Cenotes were the real gem. Truly one of the most amazing and magical things I have ever experienced. The trip was very affordable and much closer to Cancun than some of the others that I was looking to attend. I really cant recommend it enough!!"
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "Out of this world beautiful. One of several cenotes we visited, and this was the most beautiful! I could have stayed here all day, just snorkeling around, watching the fish in the clearest water ever. Felt like I was inside a fish tank. Just amazing!"
        }, 
        {
            "index": 54, 
            "rating": "5", 
            "review": "Cooling. On arranged trip with allesio, visited 3 cenotes, 2 you can enter, snorkel and gear provided, well worth visit."
        }, 
        {
            "index": 55, 
            "rating": "4", 
            "review": "pretty area. Lush. There was ziplining here too. Lots of people snorkeling in the main cenote. The underground one was very cool--creepy in a good way because of the darkness. Worth a swim. Wear swim shoes or watch your step because the rocks can get slippery."
        }, 
        {
            "index": 56, 
            "rating": "5", 
            "review": "best day of the holiday. We took a trip that included 5 Cenotes. It was a bit of a strain for my husband who is 70.But we would not have missed it .The activities like zip lining, snorkeling, rappeling into the water was fun. The tour operators made sure you were safe."
        }, 
        {
            "index": 57, 
            "rating": "5", 
            "review": "Amazing !. You absolutely need to stop by, and relax by this cenote. Fresh clear water to deep in and beautiful fish !"
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "Perfect, Well Guided Tour from Eric. Me and my girlfriend went to chickin-ha during our stay across the street at barcelo maya, and was privileged to have eric as a tour guide. He was very friendly and beyond educated on the countries history along with the history behind all the cenotes. He made the whole tour worth while. For only 45$ U.S., you get a 4 hour excursion that includes multiple zip lines, travel to 3 cenotes, and a few mile bike ride through the jungle. I highly recommend this to everyone of all ages, and also recommend to wear water socks under your shoes because the rocks are rough and slippery at points."
        }, 
        {
            "index": 59, 
            "rating": "5", 
            "review": "Awesome!!. Just got back from this, and I had been to Cenote ChaakTun last year. I was really mind blown. This one is similar but longer and larger. The colors are amazing, and the place is well lit. It has both a swimming and a walking part. We did the underground river tour, which is what I would recommend. The other cenotes are nice for swimming (I believe there are 4 cenotes in the park), but the absolutely amazing place is the underground river. It is a little expensive (somewhere around the $50 mark per person, but that includes the guide). I took my parents with me) (my father is 70 and my mother 60), and we had no issue. Along with us there was another couple with a girl (around 8 or 9), who also had no issue (other than the cold water of the cenote. We all loved it. It's truly a beautiful place that makes you feel like you are in a National Geographic documentary"
        }, 
        {
            "index": 60, 
            "rating": "5", 
            "review": "Our First Cenote!!!. Ohhhhhhh my greatness. Snorkeling in the Cenote was/is and experience I will never forget. It was absolutely beautiful, breathtaking, and kinda scary. But after a minute of getting use to the underwater heaven, I loved every aspect of it. The Mayan shaman was a wonderful experience also there. Being blessed."
        }, 
        {
            "index": 61, 
            "rating": "5", 
            "review": "An open Cenote. Slippery on rocks but a great experience to swim in this natural pool. We tried several different Cenotes and enjoyed them all."
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "Small but Beautiful. Was a really nice place a lil small but private and the girl that was our tour guide went out of her way to help us have a good time. Could use better snorkel equipment. But all in all had a great visit to this cenote"
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "Beautiful and refreshing . I did a day excursion to this cenote area. It was lovely and fun! I was able to snorkel in two cenotes and the last one was a nice walking trail to view. I would recommend this to everyone."
        }, 
        {
            "index": 64, 
            "rating": "5", 
            "review": "Beautiful! . We booked a tour through our hotel that included a stop here along with snorkeling with the turtles at Akumel. Price was $79/person. The cenotes were absolutely beautiful, something not to miss!"
        }, 
        {
            "index": 65, 
            "rating": "5", 
            "review": "Amazing. The cenotes were my favorite part. Can't miss it. So much to do. You need to see all 5 of the cenotes."
        }, 
        {
            "index": 66, 
            "rating": "4", 
            "review": "Amazing. Didn't think my young grandkids would like it but they were amazed. They didn't stop asking questions all the time we were there. The beautiful clear water the grounds were kept very clean. It's nice to see so many people who were taken by this beauty around us."
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "Brilliant, Beautiful Place. Visited today with my wife and daughters (11 and 6). We booked with Ocean Tours who where excellent. The place is beautiful and a true experience to be able to swim in the water and hear about the Mayan history."
        }, 
        {
            "index": 68, 
            "rating": "5", 
            "review": "Brilliant beautiful place.. Absolutely beautiful place, the waters are so clear, its breath taking. We had food there which was lovely as well. We met the shaman in the cave and got blessed. Well worth a visit."
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "Amazing!. Words cannot explain how thrilled we were with this experience. We decided to go on this excursion spur of the moment. Our tour guide was phenomenal: friendly & knowledgeable. He made it such a great experience. We were able to see some beautiful turtles, stingrays, coral, and fish. Snorkeling in the caves as an experience second-to-none. We really enjoyed the Mayan ceremony that started at the caves as well since it really gave it an authentic feeling. The ziplining our tour guide took us on was an added bonus. We also loved eating lunch in the \"hut\" after snorkeling. We have lots of memories from this day that we will cherish. HIGHLY RECOMMEND!!!!"
        }, 
        {
            "index": 70, 
            "rating": "3", 
            "review": "Beautiful nature, but ok-ok water. I'm not sure if I'm biased, but I have been to another cenote that exceeded our expectations for all cenotes. This cenote has a very beautiful nature setting around the water, but the water was murky and small. We enjoyed seeing a lot of fishes, though. The 3 attractions (Xtabay, Chikin-Ha and Taakbil-Ha) were worth for the price of $20 per person. If you have your own snorkel equipment, bring them with you! If you don't have them, they cost $6.25 each per person. The mask and the snorkel come together, but the fin cost separately. The Xtabay and Chikin-Ha-- you may swim there. It's not big, though. It felt like a pool-sized cenote and you may not swim at the Taakbil-Ha. Beautiful nature to look and there's a path to walk through. We came here at 2:15pm and it was very quiet. With us- there were only like 9 people. I'm not sure if earlier in the day, it's packed, but if there were just 11 of us, it kind of says a lot. If you have a time to spare, visit this cenote, but if you don't... find a better cenote to visit."
        }, 
        {
            "index": 71, 
            "rating": "4", 
            "review": "beautiful. We were diving , this is a lovely cenote for both divers and snorkellers , it has plenty of facilities from the kitting up area , which is covered with benches to the wash room , facilities , showers and shop,Also once in the cenote ,the light pattens are amazing and so worth diving. The set up is good for both divers and snorkellers so good family choice."
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "Snorkel with the turtles and 2 Cenotes at Chikin-Ha. Marc, our guide, made this trip a very enjoyable and pleasant experience.  We had an amazing time and would do the tour again."
        }, 
        {
            "index": 73, 
            "rating": "4", 
            "review": "we went scuba diving in the cenotes. well worth the trip!!!. Scuba diving in the cenotes is well worth the trip. our camera got flooded. not fun. we had 5mm suits but was not cold at all. prodive was excellent"
        }, 
        {
            "index": 74, 
            "rating": "5", 
            "review": "Turtles in Akumal Beach and 3 Cenotes at Chikin-Ha. Our guide Marco picked us up in front of our lobby about 25 minutes late due to having to wait for other guests at a different hotel. We drove to one more hotel and then drove to Akumal beach. At the van we stripped down to our bathing suits and were fitted with the appropriate sized life jackets, fins, mask and snorkel. All our belongings were safely left behind in the van. Once at the beach, we showered and had some photos taken by a photographer and then went into the water to get our gear on. Marco was super helpful and patient with everyone while our group of 12 figured out how to put on all our equipment. Once we were ready we all walked backwards into the water and then started swimming out as a group. Within a few minutes we spotted a green turtle. Minutes later we saw a white stingray and then a grey stingray. Eventually we swam out of the zoned off beach area and over to the reef. There we managed to see lots of colourful fish and amazing huge black and white spotted ray. On our way back to the beach we saw two more turtles and another ray. All in the span of about 45 minutes.After we showered off, we headed back to our van and drove to the cenotes (which happen to be across the road from the Barcelo resort). We exited the van and walked over to the Emerald cenote - half open, half cave. I have to say this is one of the most amazing creations of nature I've ever seen. The water was clearer than anything I'd ever seen before. It had crystal clear blue water with beautiful green plants growing. Looking the other direction you saw turquoise water that led to amazing underwater caverns that turned into pitch black nothingness. The next cenote was the Turquoise cenote and this one was most under limestone cave roof. The water here was a dark turquoise and there were underwater caves and crevices in all directions. There were a few divers here checking out the caves. These underwater caves go for miles and miles. The final cave was a dry cave, meaning that we didn't snorkel in it because there was only a little bit of water. There were amazing vines that came down from the top of the cenote ceiling and plunged into the water. These are the roots of the ficus trees, known to grow many hundreds of meters to seek water. There was also a sacred Mayan ritual going on in the cave with a beautiful procession of candles lighting the pathway. This traditional Mayan cleansing ceremony wasn't accessible to the public. But we were able to smell the beautiful aromatic traditional Mayan incense that was filling up the cenote. After the last cenote we had a light snack of simple Mayan fair.We had an amazing time and would do the tour again in a heartbeat."
        }, 
        {
            "index": 75, 
            "rating": "4", 
            "review": "Awesome experience. This is one of the best experiences I had while visiting Cancun. You can rent lockers and lifejackets if needed and then take a swim in the cool Cenote and even jump in. Would recommend going to Chichen-Itza for the morning and then cooling off there."
        }, 
        {
            "index": 76, 
            "rating": "4", 
            "review": "2 Cenotes and Snorkeling with Sea Turtles. We booked through a company called Barracuda. This was by far the best tour we went on while in Mexico. The open Cenote we snorkeled in had some small fish and plants, the closed cenote was very clean and easy to get to. I highly recommend this tour company and snorkeling with the turtles!"
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "Lovely cenote to dive. This was our first experience of cenote diving and we were very impressed. Best to go with an organised group. Toilets available on site."
        }, 
        {
            "index": 78, 
            "rating": "5", 
            "review": "Four Cenote with ziplining to Boot!. My son and I booked a tour from Cancun to four cenote visits that included ziplining, kayaking, and snorkeling, and it was truly an epic father/son adventure. The tour guide ride to the four separate cenote parks took approximately an hour an a half from Cancun's hotel zone and occasionally down some rough and pot-holed roads (Mayan massage).into the cenote areas.  At the sites yoiu'll toss on life vests, harnesses, and helmets to be lowered down into one crystal clear cenote for an amazing view and experience. At another you'll zipline into an open cenote and splashdown in fresh water and laugh when you do. At another you'll jump off a small cliff into the jungle river and swim your way up to another zipline adventure. The final one also included a short kayak trip down another jungle setting.  If you're fortunate to have a good tour guide you'll get a look at the local flora and fauna, maybe try out some ancient Mayan gum (not bad, actually, and learn which trees to stay away from like the black sap variety that will blister your skin should you cut into it (eh, don't. It's a park and the tree will take its revenge. Saw some colorful birds and enjoyed the jungle setting. The Xenote tour group also includes lunch for the day outing. There are rest rooms into the park and plenty opportunity for waterproof cameras or cell phones to get some one-in-a-lifetime photos. Finally this, don't be afraid to try the ziplines into the cenotes. They have two offerings; the first is the slide for life bar where you hold on and release at your time while the second provides a sling to sit in until you hit the water. Exits from the cenotes require some stair climbs and smiles. Enjoy!"
        }, 
        {
            "index": 79, 
            "rating": "4", 
            "review": "3 for price of one. You are able to see three cenotes for $20. All were very interesting. At this facility you can rent snorkeling equipment, scuba equipment, or just swim and enjoy.The furthest cenote you walk around the jungle area, listening to the birds. The cave is lit by candles. There is a small altar where a shaman will conduct a ceremony. This is extra. We just walked around and it was great, half cave, half open. You can't swim here. The second site is a small cave structure. I did not swim there. The third is open sir with a partial cave structure. Many small to medium sized fish. Very pretty surroundings."
        }, 
        {
            "index": 80, 
            "rating": "5", 
            "review": "Like walking on the moon. Myself and two others were guided through Chikin-Ha as part of a small group by Ocean Tours. We went to three different cenotes, each was different.One was still used for Mayan ceremonies. At the time we went it still smelled of incense and there was a shaman at the far end of the cave setting up for a ceremony, it was very beautiful and interesting. The other two you can snorkel or dive in (we were part of a snorkel tour). The water was crystal clear, and one was 15m deep. It was one of the most surreal experiences I've ever had, it was just lovely. People who have trouble with stairs may struggle with accessing the cenotes, as the stairs are carved into the rock and are not level at all points. However, most people should have no trouble with the snorkeling- you don't have to be particularly fit to enjoy. I do recommend wearing a wet suit and a life jacket- it was cool in the shaded cenote, and most tours require you to wear a life jacket."
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "Great excursion with a refreshing nature experience. The Chikin Ha Cenotes are beautiful and extremely refreshing. They contain mineral water that is great for the skin and are a nice change from the salt water of the ocean. A short hike in leads you to the first cenote where you are able to swim with wild freshwater fish. The local flora and fauna is unscathed and can be observed in its natural beauty. Further up the trail there are even more cenotes with interesting stories behind each one. There are old religious relics that can be observed and the history is very interested to learn about. If you're lucky, you may catch a glimpse of the rare mot-mot birds that are native to the area. Overall a great experience and this one goes highly recommended."
        }, 
        {
            "index": 82, 
            "rating": "5", 
            "review": "Breathtaking. If you have never visited a cenote, then try Chikin-Ha. Buried in the jungle, the crystal clear waters of these underground rivers, caves & caverns offer interesting scuba dives & snorkeling. The cenotes were part of the survival of the Mayan culture.You won't see as many fish as in the sea itself, but the system of caves & caverns offers a unique, refreshing water experience. A Mayan ceremony is also part of the experience."
        }, 
        {
            "index": 83, 
            "rating": "5", 
            "review": "Snorkeling and Diving and awesome place!. I did a two tank dive at the Cenote with Pro Dive, but they had Snorkelers in the party as well. Some people did the zip lines. It was easily accessible, with life jackets, food, and restrooms. a nice place to bring the family for a morning or afternoon."
        }, 
        {
            "index": 84, 
            "rating": "3", 
            "review": "Beautiful Cenotes but high prices and some rude staff. My girlfirned and I visited the Barcelo Beach Resort for one week and set out to do some exploring on our own. The Chikin Ha Eco Park and cenotes was located almost directly across the road. Speaking to the man tending the gate entrance was a pleasant experience and we were told it was $300 MEX per person to go swimming in the cenotes. It was a 1.5 kilometer walk up a dirt road until we arrived at the reception to the cenotes and park (this is where you pay your admission). I'm a birder and had some good quality birds along the entrance road and hoped to walk it again the following morning. I spoke to the man at the entrance to the park and he told me that just walking up the road was no problem and that I would not need to pay the entrance fee as I was not entering the areas where the cenotes are located. I returned the next morning and set off down the road excited to have found somewhere with suitable habitat and a reasonably large forest. Not 15 minutes into my walk I was stopped by one of the Chikin Ha staff members who informed me that I could not enter the area without first paying the admission price. I explained that I had spoken to the gate keeper a day earlier and he had no problem with me walking the road, I was essentially told to shove it and that by walking past the gate I needed to walk the remaining kilometer and pay the price of admission. Although we enjoyed the cenotes and subsequent birding, this experience left me with a bad taste in my mouth and I did not return to the park. I am more than happy to support local parks and wildlife areas, however $300 MEX (approximately $20 - 25 usd) is a ridiculous price to pay daily for the experience of walking up a dirt road. If you are visiting the area I would recommend checking out some of the many other cenotes located in the immediate area instead."
        }, 
        {
            "index": 85, 
            "rating": "5", 
            "review": "I LOVE this place!. The owners were kind enough to let us shoot a photography day here with mermaids. It was absolutely amazing. The staff was nice, the cenote is incredible. I cannot wait to return!!!!!!!!!!"
        }, 
        {
            "index": 86, 
            "rating": "5", 
            "review": "Amazing!!!!. Been to other cenotes in this area but none compare to these...best one is the underwater one where you snorkel between the rocks to a hidden ceremonial site...it's simply amazing!!!!"
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "Snorkeling/Diving. I have been to Chikin Ha three times - two times for Snorkeling on an excursion with Ocean Tours, and once for diving through the cenote. Both times were very enjoyable, and the cenotes are kept clean and eco-friendly. The staff is very helpful, and their empanadas are really good!"
        }, 
        {
            "index": 88, 
            "rating": "5", 
            "review": "Big blue hole. There are lots of these cenote's in playa and this is a really nice one... The water is really cold though..."
        }, 
        {
            "index": 89, 
            "rating": "5", 
            "review": "Beautiful. Beautiful place to visit. Did some cliff jumping and went on the zipline into the water. An hour or so would be enough time here. Water was amazing to see how clear and deep."
        }, 
        {
            "index": 90, 
            "rating": "4", 
            "review": "swimming in cenote was good but cold!. worth doing along with the turtles at akumel beach, this was great, saw about 8 turtles and a sting ray"
        }, 
        {
            "index": 91, 
            "rating": "5", 
            "review": "Absolutely beautiful. If your not into the cave diving, and just want to see the beauty Playa has to offer above water, or swimming around. This places some of the most surreal atmospheres I've ever encountered. The clarity, and calm of the water is almost to colorful, and amazing to be true. You almost feel like your walking around in a dream, or some Movie set. It's really hard to explain in words..."
        }, 
        {
            "index": 92, 
            "rating": "5", 
            "review": "AMAZING!. A definite must see...absolutely beautiful. Go with Oceantours and be guided through the experience , it is well worth the dollars."
        }, 
        {
            "index": 93, 
            "rating": "5", 
            "review": "Beautiful!. The beauty cannot be described in words. You must see if for yourself! So quiet and untouched. Spend the day exploring!"
        }, 
        {
            "index": 94, 
            "rating": "5", 
            "review": "Dawesome. We had a lot of fun here . They have a zip line and a platform for jumping off. There is a photographer who takes pics that you can purchase."
        }, 
        {
            "index": 95, 
            "rating": "5", 
            "review": "Ruins. Went to chichinici by bus stopped here on the way...Amazing swam in the water said it takes 10 years off your life. We were amazed and seen one of the seven wonders of the world. Then took as to a shopping area wotrth the trp"
        }, 
        {
            "index": 96, 
            "rating": "5", 
            "review": "Chikin Ha Cenote Jan 2016. Amazing location. Great centoes. We bisited here and attended a Mayan Wedding with a Shaman...so cool to be part of our friends celebrations. But as well, this place is very cool. A must see if in the area."
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "Outstanding!. We booked this place through a tour company. I guide was Franke' and she was outstanding. This place had three cenotes, 2 wet and 1 dry. We were able to swim in the first two. The first one was open and had a bunch of fish in it. I enjoyed this one. The second one was my favorite. It had a cave setting but the light hitting the water was just right. It was great to say the least. The last cenote was \"dry\". By dry they meant we couldn't swim in it. The whole environment around the cenotes was excellent and the tour of the cenotes was also excellent. Chikin Ha is open to the public but I would recommend booking through someone as it can become quite busy and the guides know there stuff. Highly recommend this spot!"
        }, 
        {
            "index": 98, 
            "rating": "1", 
            "review": "small. too small,too out of the way,not worth going.There was lots of the town people in it.It was like a swimming pool for the town people."
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "Amazing Excursion area!. We went snorkelling here but, once we arrived, we got so much more! We did a Mayan cleansing ceremony followed by snorkelling in the cenotes. Once we were done with that, we did zip-lining and then snorkelled with turtles and rays in the ocean. An outstanding time!"
        }, 
        {
            "index": 100, 
            "rating": "4", 
            "review": "Diving Chikin Ha. We dive at least one cenote every time we are in Playa del Carmen. They are all different and all have their own particular charm. They are unique to the Mexican Riviera. We are trying our best to hit them all."
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "Very beautiful and the water was awesome. This is a very beautiful and peaceful place. Very zen. The view is very beautiful the water was very nice."
        }, 
        {
            "index": 102, 
            "rating": "4", 
            "review": "Cool cenotes but small. There are three cenotes after you pay about 500 pesos (for two people) at Chikn Ha. Pay in pesos, not US$, as it will be cheaper. Two of the cenotes are open to snorkeling or diving; we snorkeled. They are both rather small for snorkeling; I've been to larger cenotes near Playa, but they were cool, lots of fish and interesting flora and formations. I'm sure if you dive, you get to see a lot more, but I'm not a diver just yet. I thought it was a bit expensive for what you get, but maybe this was because we only snorkeled. Still, it was a cool experience. The ceremonial cenote was really beautiful too. If you are prone to getting chilly, wear a wetsuit. I'm glad I did because I was warm enough to snorkel all of them comfortably. We went when there weren't a lot of people, but if it had been crowded, it wouldn't have been as fun since they are smaller cenotes."
        }, 
        {
            "index": 103, 
            "rating": "5", 
            "review": "wonderful scuba diving. Scuba diving was amazing! Challenging dive for the ears--lot's of changes in depth during the dive. Beautiful with the sun light filtering into the water. The interface of fresh and salt water was interesting."
        }, 
        {
            "index": 104, 
            "rating": "5", 
            "review": "Just beautiful . We visited as part of the turtles and cenotes excursion, in which we visited 3 of the cenotes at Chikin Ha, including the holy Cenote, which is set out with candles and an altar, and was absolutely stunning! A really beautiful complex of cenotes, with shower and changing facilities and good paths. Definitely worth a visit"
        }, 
        {
            "index": 105, 
            "rating": "5", 
            "review": "Heavenly. What a great place to dive .. Snorkelling conditions were great too. Kids and fun too. Loved it . We will return ."
        }, 
        {
            "index": 106, 
            "rating": "4", 
            "review": "Cavern Dive. Came here for our (mine and GF's) first ever cavern dive; went with a full-cave certified dive guide through Dive Shop Mexico. The experience was amazing. I strongly recommend this cavern or any cavern for the diving enthusiast. Not recommended if you have any sorts of claustrophobia; an English diver in our group had to call the dive towards the end of the first dive simply because of this. Also, diver should be self reliant in diving and gear and have proper buoyancy skills. Other than that, the Cenotes are an amazing place to dive."
        }, 
        {
            "index": 107, 
            "rating": "5", 
            "review": "STUNNING Eco Park. WOW! This experience was absolutely AMAZING! Swimming in the cenotes and learning about their cultural significance to the Mayan people was excellent."
        }, 
        {
            "index": 108, 
            "rating": "5", 
            "review": "Visit the place!!. I went cenote diving in chikin ha with \"Dive Mike\" (with instructor Micael) from playa del Carmen and it was a blast! My mum went snorkling and she was very happy for guide Eric and the amazing cenote+the possibility for rappelling. We had an fantastic day!!"
        }, 
        {
            "index": 109, 
            "rating": "4", 
            "review": "Different snorkeling experience. Swimming in a under water cavern. Then swimming in an open lagoon. Very different experience. Enjoyed a nice lunch in between. Great outing."
        }, 
        {
            "index": 110, 
            "rating": "4", 
            "review": "Great experience but prepare to be eaten alive by Mosquitoes. Cenotes are beautiful places and a great experience for anyone visiting Mexico. I would advise long items of clothing and as much mosquito replant as you can stand because both and boyfriend and I were eaten alive!"
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "Loved our family visit . Visited yesterday with my husband and 3 kids. The entry was surrounded by other cenotes entrances and easy to miss. There is a very long driveway. We were offered a $250 peso self explore, which we chose, or a $500 peso adventure with zip lines. My 8 year old was not charged. We did not pick up a free life jacket because we all swim well but wish we had for the kids. The fresh water is not as buoyant as the sea. We went to the furthest cenote first, which is beautiful but you can't swim. The middle one is partly in a cave and is magical. No artificial lights needed, just enough day light filters in. The closest one is uncovered and picturesque but the water does not have the same amazing quality as the covered one. My husband spotted a blue morpho butterfly Highly recommended trip, even though it is expensive. We did not use changing facilities. Only 5 cars were there when we arrived at midday so it was really quiet."
        }, 
        {
            "index": 112, 
            "rating": "5", 
            "review": "This Is A Must Do On Your Vacation!. This is just 50m across from the entrance to Barcelo Resorts. We took advice of a staff member and walked to this from our Resort. From the main road it was about a 1.5km walk down a narrow dirt road to the entrance. There are walkways easy to maneuver to get to each of the cenotes. You can snorkel in 2 of the 3 cenotes (the third one you walk through). It is absolutely beautiful, crystal clear water. We spent hours snorkeling in the open/partially covered cenote and the second cave cenote. The third one you can walk down into, but not snorkel in it. Snorkeling you realize just how deep these caves are and there are scuba divers even deeper down in the darkness of the underwater caves - all you see is the glow of their headlamps. Probably my favorite part of the whole vacation!"
        }, 
        {
            "index": 113, 
            "rating": "4", 
            "review": "A lovely cenote . We came to chickin ha with Ocean Tours and brought masks and snorkels with us. The water in the cenote was clear and we saw fish. Lots of fish. But no turtles. Fairly busy but a memorable couple of hours."
        }, 
        {
            "index": 114, 
            "rating": "1", 
            "review": "poor hygene, dirty bathrooms. The attraction is supposed to be bathing in the denote. After a full day of excursions public bathroom visits you do not want to take a \"bath\" where 100's of people are bathing to clean up."
        }, 
        {
            "index": 115, 
            "rating": "4", 
            "review": "Cenote. We enjoyed the day. Very unique experience & would recommend. this is the second time we have gone. Our kids really enjoyed this over just another snorkle trip."
        }, 
        {
            "index": 116, 
            "rating": "4", 
            "review": "Nice cenote for snorkeling. I spent more than 2 hours snorkeling in this cenote - you can see various fishes (there are some who are very intent on picking on your dead skin cells) and turtles (if you are lucky).Also nice: you can see stalagmites and stalactites as well as a lush underwater plant life."
        }, 
        {
            "index": 117, 
            "rating": "4", 
            "review": "Adventure. Our tour guide took us here and it was well worth the trip. Water was clear, it wasn't crowded and it didn't feel rushed."
        }, 
        {
            "index": 118, 
            "rating": "5", 
            "review": "Awesome. We did a day trip, in the morning with swam with Sea turtle, in the afternoon, we swam here, it was so much fun and the highlight of our trip"
        }, 
        {
            "index": 119, 
            "rating": "5", 
            "review": "Diving was fantastic. Excellent diving in the Cenote, well organised dive shop called Dive Mike in play Del Carmen, lovely place to visit as well."
        }, 
        {
            "index": 120, 
            "rating": "4", 
            "review": "Beautiful natural setting. We spent a day here just soaking up the beauty of the place. Very relaxing hardly any tourists (early December). We also did the underground river tour which was neat to see but chilly in the water and not really worth the extra cost, mainly a photo opportunity for those with waterproof cameras. The park though is definitely worth a visit. Right across the highway from the Barcelo."
        }, 
        {
            "index": 121, 
            "rating": "1", 
            "review": "waste of money. Nice walk around the park - 15 minutes for $29 each. Buggy, nothing to see. Do not waste your time or money"
        }, 
        {
            "index": 122, 
            "rating": "5", 
            "review": "Great Trip. We had a really good half day trip visiting Chikin Ha as well as another cenote, booked with the Sunwing rep at our hotel, the Yucatan Platinum Princess."
        }, 
        {
            "index": 123, 
            "rating": "5", 
            "review": "Very interesting place :). Excelent place for cenotes diving and snorkling. A lot of place for diving equipment preparations, nice environs. Very good entrance to water."
        }, 
        {
            "index": 124, 
            "rating": "5", 
            "review": "One of the most serene locations in Playa. This is an amazing easily accessed cenote in the Playa area, it is a beautiful walk through the jungle and you reach this incredible overhang and see the cenote it is simply stunning and an incredible dive, simply getting into the water and patting the water the catfish will come to see what you are doing."
        }, 
        {
            "index": 125, 
            "rating": "5", 
            "review": "Stunning Natual Cenotes. Well worth seeing. Ive wanted to see the famous Cenotes for years and it was top of my \"to do list\".\nThese are stunning to look at, you feel weird swimming in them as if your shouldn't be there. its a part of the world most have not experienced. Go as you wont be disappointed"
        }, 
        {
            "index": 126, 
            "rating": "4", 
            "review": "Must See. This is such a cool place. Must dive at least once. It is open enough that you don't have to be cave certified. We really enjoyed it. it is quite the ride from Cancun but if you are in PlayCar it is worth it"
        }, 
        {
            "index": 127, 
            "rating": "4", 
            "review": "Amazing and breathtaking!!. This cenote location gives you the best of both kinds of cenotes. You can explore the collapes cenotes and the covered underground cenotes. They are teaming with many kinds of fish and the water temperature is pleasant. We have not been to a bad cenote yet, however, at Chikin Ha, the facilities are clean, the food is great, and the staff are very friendly. This is also a place you can work out or have a wedding. Very beautiful place."
        }, 
        {
            "index": 128, 
            "rating": "5", 
            "review": "Highlight of our Vacation!. Zip Lining with my friends was so much fun! Snorkeling in the cenotes with underwater photography produced some of the best colorful pictures. Jesus gave a wonderful tour including Mayan culture. I would definitely do it again!"
        }, 
        {
            "index": 129, 
            "rating": "5", 
            "review": "Make sure you do the underground portion!. We considered many cenotes and after a few recommendations from our hotel we choose Chikin Ha and were not disappointed. This location has several different Cenotes and they let you walk around and enjoy them as you wish. They also have an underground river section that you can take a guided tour for about $25.00 extra and that was our favorite part! I'm a big wimp about cold water and was concerned I would hate it but once I was in it was no problem. There had been quite a lot of rain in the days before we were there and that causes the water to be a bit cloudy but even then it was an amazing and unique experience. The underground portion takes about 45 minutes and you swim in underground caverns and swim/walk through underground caves filled with rock formations, it's truly spectacular. If you are in the Yucatan make sure you check out a cenote, it's truly amazing!"
        }, 
        {
            "index": 130, 
            "rating": "5", 
            "review": "Simply Beautiful. We came to Chikin Ha through a guided tour through Ocean Tours. It was my first Cenote. It was absolutely beautiful, and the water was clear, lots of fish, and the grounds were clean and well maintained. It had clear paths and railings and walkways were in good condition. I would recommend this place and I will also return as it was the highlight of my trip."
        }, 
        {
            "index": 131, 
            "rating": "5", 
            "review": "3 very uniquely beautiful cenotes. Soooo much fun and soooo beautiful and peaceful! We enjoyed three of the cenotes: 1) snorkeled with beautiful fish, turtles, and plants; 2) adventurous snorkel through cave that was dark enough to require flash lights; and 3) calming island where weddings and other ceremonies are performed."
        }, 
        {
            "index": 132, 
            "rating": "4", 
            "review": "Visit 3 Cenotes in 1. Chikin Ha tour is actually a visit to 3 cenotes for 1 price. There is an open cenote, a cave cenote and another grotto cenote that is sacred and you do not swim in. All very nice and refreshing for a visit. They were working on installing some ziplines to do when you visit as well. We were there in the off season, and although there were wires up, there was no ziplining, so we asked the girl at the desk if we could get a reduced price, and she lowered it from 300 pesos to 250 pesos, so about $6 per cenote. Lovely area, well marked paths, at the two in which you could swim, there were also some scuba divers doing cave dives, who were deep below you following their rope trails. It was neat to see them, as the water was very clear. And we just watched the movie The Cave, which was about cave diving, and filmed down the road at Hidden Worlds. Yes, the water is cooler, but you are in Mexico, and its always hot, so it doesn't take long to adjust to the cooler water. They have changing rooms, bathrooms and showers here. Also equipment rentals if you didn't bring yours. Check it out for a nice half day trip."
        }, 
        {
            "index": 133, 
            "rating": "5", 
            "review": "awesome. This place was great, we even saw a turtle in one of the cenotes. Thoroughly enjoyable. Photo package also well worth it, which is unusual."
        }, 
        {
            "index": 134, 
            "rating": "3", 
            "review": "It's okay but nothing spectacular.. I would rather take a boat out for snorkeling than do the cenotes. They were cold and there wasn't much to see."
        }, 
        {
            "index": 135, 
            "rating": "5", 
            "review": "Amazing experience!. Highly recommended if you are in the area. Coming from Playa del Carmen it is the first cenote, which includes caves and as well much snorkling! we could see many fishes and as well a turtle, which was amazing!"
        }, 
        {
            "index": 136, 
            "rating": "5", 
            "review": "Great diving. This is one of the larger Cenotes for general cavern diving. Crystal clear water, easy entry and exit. Also good for snorkelling"
        }, 
        {
            "index": 137, 
            "rating": "5", 
            "review": "Family adventure . I came here with the family in August, it was hot and humid out. Upon arrival, you park and walk down a gravel road and through the jungle to get to the gift shop and restroom area. There are several trails from the central gift shop location. I believe there is a total of 5 cenotes here at the Chikin Ha property. There are various wild birds and countless species of trees as well. We went zip lining through the jungle and over the largest cenote there."
        }, 
        {
            "index": 138, 
            "rating": "4", 
            "review": "Experience multiple above ground Cenotes in one visit.. I was a little afraid to go underground as some Cenote's are and found this tour perfect for me. Everything was above ground with some cave like areas that I could choose to swim in or not. We took my 83 year old mother who was able to walk the stairs to and from each cenote. If you have not ever seen one of these remarkable sites, I recommend you carve a half a day at least for this experience."
        }, 
        {
            "index": 139, 
            "rating": "4", 
            "review": "great place to snorkel. this place is a must ,very crystal waters ,was beautiful ,and is open ,if you are afraid of close place , 8like other cenotes), the bad thing is that we want to stay longer and it was rainy"
        }, 
        {
            "index": 140, 
            "rating": "5", 
            "review": "Must Visist. This place was incredible. I was only upset with the fact that we were only allowed to stay on hour. If you do have a chance to go please invest in renting a life vest and take comfortable water shoes."
        }, 
        {
            "index": 141, 
            "rating": "5", 
            "review": "Great spot to swim in a cenote. This was a beautiful, tranquil cenote that gives you an idea of what it is like to visit these unique (only place in the world that has these) places."
        }, 
        {
            "index": 142, 
            "rating": "3", 
            "review": "Worth seeing, but different than what I was expecting.. This was my first visit to a cenote. This location has an open cenote, which is like a small lake. There is stone around the area to enter the water. The water is clear and you can see the bottom clearly. At the time of my visit, there were some areas with floating leaves on top of the water. Looking around at the bottom, there is a lot of algae and dead leaves and such. There were not many fish which was disappointing. I expected there to be more life inside the cenote. The second one they called a river. It was a short cave with 2 openings. It is relatively dark inside. The water is clear. Looking down, you see rock and dark crevices. Since the sun does not reach inside the cave very much at all, this space is absent color, sort of grey.The third was also a cave but you are not allowed to swim. It's pretty to see. There's a big opening with a ring like little body of water around the edge. Very slick down there, so be careful if you go in to take a look.So, this place is interesting. I'm happy I had the opportunity to see it. But, I gave it average because I really expected to see more life in the water. I would not recommend paying for the extra activities as I didn't see where that would be a good use of time there. They did seem to be making improvements on property at the time of my visit."
        }, 
        {
            "index": 143, 
            "rating": "4", 
            "review": "It's a Nature gem. Lovely place to visit while at Playa del Carmen. It's a dozen meters deep hole, so if you are brave enough take a dip."
        }, 
        {
            "index": 144, 
            "rating": "5", 
            "review": "Beautiful. I had heard that the cenotes have gotten a lot busier since all the great TA reviews, but we had them to ourselves on our visit last Wednesday afternoon. There are 2 small cenotes that you can swim/snorkel in with cute tiny fishes. One is a cave, the other is open. The third cenote is strictly for just looking at, a nice quiet zen area. Please wash off all bug spray and sunscreen before you enter the cenotes. I was worried about the mosquitoes as they love me, but I didn't get bit once, unlike some other cenotes I have visited (xuuman ha)."
        }, 
        {
            "index": 145, 
            "rating": "4", 
            "review": "Good fun. Well kept grounds, changing rooms and cafe. The cenote is deep but easily reached by steps cut through the surrounding rock. Lots of colourful birds."
        }, 
        {
            "index": 146, 
            "rating": "5", 
            "review": "One of the best day ever!. Crystal clear water and beautiful greenery surrounding the centote. It was a very interesting to know that this centote was not fed by an underground spring but by rainwater alone."
        }, 
        {
            "index": 147, 
            "rating": "5", 
            "review": "World wonder. This was a brilliant visit book with Thomson's where they get there before the crowds so you can get better pictures"
        }, 
        {
            "index": 148, 
            "rating": "4", 
            "review": "Ahhhh.. The refreshing \"water holes\" in the middle of the jungles of the Yucatan Peninsula. Great place to visit"
        }, 
        {
            "index": 149, 
            "rating": "4", 
            "review": "For beginners . If it's your first cenote and you are not comfortable diving in dark caves full of bats, go to this one ! I enjoyed it a lot and wasn't scared at all."
        }, 
        {
            "index": 150, 
            "rating": "4", 
            "review": "Lovely location and less commercial than others. Enjoyed a cenote dive here, however you can swim and snorkel here to. Important to note you do need to get in the water to appreciate the cave environment. It is small and there are no coach parties therefore quieter, however still offers equipment, changing and rest rooms and restaurant etc. Worth a visit"
        }, 
        {
            "index": 151, 
            "rating": "5", 
            "review": "excellent guide, beautiful scenery. saw the cenote as part of the chichen itza tour. could not swim in it, just picture taking. which was abdolutely enough.\nawesome, highly recommend"
        }, 
        {
            "index": 152, 
            "rating": "4", 
            "review": "Amazing dive. Out of the way, not crowded at all, great light and a lot of underground swim throughs. These are caves not caverns!"
        }, 
        {
            "index": 153, 
            "rating": "5", 
            "review": "Woooooww!!!. This is one of those nature wonders!!! Amazing place... of you come to the Yucatan Península and love nature, this is the place to come"
        }, 
        {
            "index": 154, 
            "rating": "5", 
            "review": "Highlight of my Mexican trip!. Wow! what an incredible adventure. We took so many photos, explored the area and enjoyed the light lunch. The store had more than your usual knick-knacks to bring home, we had a hard time choosing what unique gifts to bring back. There's a liquor sold here, flavored Tequila that's incredibly yummy!"
        }, 
        {
            "index": 155, 
            "rating": "4", 
            "review": "Great experience. Great experience, freezing cold water, but really worth the visit. Be aware of the mosquitos in the last pool you visit, they are a nightmare."
        }, 
        {
            "index": 156, 
            "rating": "5", 
            "review": "vacation. Just wish it hadn't been raining. Beautiful place to visit. Nice little restaurant at location helps"
        }, 
        {
            "index": 157, 
            "rating": "4", 
            "review": "loved zip lining into the river!!. i wasn't a big fan of the atv's they were kind of hard to drive. but the zip lining, river, and the cenote were really cool."
        }, 
        {
            "index": 158, 
            "rating": "4", 
            "review": "\"awesome place\". clear and cold water....amazing place for visit.\nit cost $119.00 US dollars per person, including ATV rental and 3 Zip-lines...\nVery fun and adventure !!!!"
        }, 
        {
            "index": 159, 
            "rating": "4", 
            "review": "Magical place. Myself, my husband, and two of our friends visited Chikin Ha for a few hours in September. It is easy to access this cenote with a rental car. The grounds around the cenote are well maintained and clean. There was a rudimentary restroom and changing area... more substantial than what you find at most cenotes, though. Admission was 300 pesos (~$20 USD at the time), which is really steep compared to other cenotes in the area. I think you are paying for access to the scuba-ing cenotes on site, and the better maintained facilities. Your admission includes use of a life vest if desired, access to two cenotes for swimming/snorkeling, and one cenote for just looking/visiting (it appears to be a sacred site). The first cenote you access is just slightly murky with vegetation, but there are still lots of fish to see. The second cenote is crystal clear and very, very deep and cold. No vegetation at all in this one. This is where people do the scuba diving. It is obviously better for scuba than snorkeling, but I still enjoyed snorkeling here and watching the scuba divers take off on their adventures. I also really enjoyed visiting the sacred cenote... you could see scuba divers under the surface, which was unexpected and interesting. All in all, I would not recommend this cenote if you only want to snorkel/swim, but if you feel like spending more to see a very unique site, go for it! We enjoyed it."
        }, 
        {
            "index": 160, 
            "rating": "4", 
            "review": "fantastic experience. wonderful experience swimming in cenote. changing area available but need to be a swimmer ,however there were life jackets available"
        }, 
        {
            "index": 161, 
            "rating": "5", 
            "review": "A Snokle Treat. The water was cool! No. Really cool. Unlike most of the swimming in the Playa area which feels like you are swimming in a cup of hot tea. Clear cool water in a jungle atmosphere. Our guide Carolina was great explaining this cenote's history and how all of the cenotes in the area are connected by underground rivers and streams. Very relaxing time here and will definitely come back."
        }, 
        {
            "index": 162, 
            "rating": "5", 
            "review": "First time to a cenote - and now I must go to more. We went on a very grey, cloudy day, with the occasional drizzle and a fair bit of thunder around. That being said, we found the 3 cenotes at Chikin Ha to be totally magical. The clarity of the water is unbelievable, the formations under the water are stunning, the serenity of the surrounds are just beautiful. Although I initially thought 300 pesos to get in was a lot, ut was money very well spent. If the sun is shining I can only imagine how much better this would be. If you like natural beauty, water and snorkeling/diving (make sure you take a mask and snorkel) - then go!"
        }, 
        {
            "index": 163, 
            "rating": "5", 
            "review": "Beautiful resort in the jungle. Water is so clear, and great place to cool off. They provide you with life vests and you go about your business, but you are not allowed in the underwater caves."
        }, 
        {
            "index": 164, 
            "rating": "5", 
            "review": "A Great Dive. This is a great place to do some diving. We had blast exploring the unique features the cenotes have to offer. The lines are well marked. Water is cold so bring a wet suit. Best for experienced divers!"
        }, 
        {
            "index": 165, 
            "rating": "5", 
            "review": "Like swimming in a cathedral of water and light.. Fantastic complex of three cenotes-- two you can swim in and one to just walk around. The cavern cenote was a surreal experience. Like being in a cathedral of water and light. We happened to get there early in the morning when the light was at just the right angle to come through the cavern entrance and pierce the water. The light beams contrasted beautifully with the dark, deep, abysses where you couldn't see the bottom. My husband got a little claustrophobic inside (a lot of the cavern has low head room), but I had a great time. The other cenote has a lot of greenery along the bottom which was a different change of pace. If I ever go back to Mexico, I will go here."
        }, 
        {
            "index": 166, 
            "rating": "4", 
            "review": "Nice spot. Must Visit, beautiful nature and surrounds, Free fish pedicure!Beautiful spot to take photos and relax for an afternoon"
        }, 
        {
            "index": 167, 
            "rating": "5", 
            "review": "Swim or dive in the jungle. I go cavern and cave diving a lot here. Magic underwater. Very cool to chill as well when its hot. Large areas to swim and explore. Super friendly family lives on site"
        }, 
        {
            "index": 168, 
            "rating": "5", 
            "review": "Nice cave. great easy cave to navigate the thermocline is awesome. no real serious restorations , lot of different structure, when you get to the middle of the dive, its awesome."
        }, 
        {
            "index": 169, 
            "rating": "5", 
            "review": "beautiful!. beautiful place!!!! its really big it has like 3 cenotes tu swim there, but its an amazing place! i've been there with family and friends and totally recommendable!"
        }, 
        {
            "index": 170, 
            "rating": "5", 
            "review": "great cenote. beautiful, peaceful and remote.relaxing and fascinating. The cenotes are very unique and interesting and easy places to explore. Look forward to diving them."
        }, 
        {
            "index": 171, 
            "rating": "5", 
            "review": "Refreshing and beautiful!. We went today to visit these cenotes with privatetourguidekay and had a wonderful experience. All safety issues were taken care of, rest room stops, snorkelling gear brand new and the cenotes were outstanding and all very different. Go with Kay's company...personal service with 5* treatment. Just enjoy the experience of floating around these underground caves where the water is crystal clear and refreshing after temperatures in the mid thirties."
        }, 
        {
            "index": 172, 
            "rating": "5", 
            "review": "Amazing! . Myself and my family visited here in August and we were amazed at just how beautiful the Cenotes were. I would highly recommend visiting but just remember to leave off the suncream as the water is crystal clear because it is not contaminated and should be kept that way. My 14 yr old daughter loved the Cenotes although she found them 'freezing' which is actually so refreshing once you get used to the coldness! Look out for the stunning Motmot birds, truly beautiful, we really did have the most amazing day!"
        }, 
        {
            "index": 173, 
            "rating": "5", 
            "review": "Great snorkeling experience. Great experience. History combined with a superb tour giide and a quiet snorkeling experience. Well worth the price."
        }, 
        {
            "index": 174, 
            "rating": "5", 
            "review": "Chikin Itza. This trip was great due to the guide Jorge, who was very knowledgeable and able to answer all our questions. yes its an early trip but worth it , as well as the drinks along the way"
        }, 
        {
            "index": 175, 
            "rating": "4", 
            "review": "Beautiful birds here. The swim in the first and largest cenote is very refreshing, once you take about a minute to get over the shock of jumping in that cool water. I believe it's between 70 and 75 degrees F.We sighted a number of Orioles and colorful Warblers, but the beauties are the Blue-crowned Motmots."
        }, 
        {
            "index": 176, 
            "rating": "5", 
            "review": "All around. We had the best experience on our snorkeling tour of the cenote. The underground river was amazing. The water was cold but worth it. The sights were breathtaking and an experience you shouldn't miss."
        }, 
        {
            "index": 177, 
            "rating": "5", 
            "review": "amazing experience. swimming in cents its something you will never regret. I can say I was a bit afraid before but the experience was just great."
        }, 
        {
            "index": 178, 
            "rating": "4", 
            "review": "Not just a hole in the ground! . Visited Chikin Ha today with my Teenage Daughter and Son. We went with Ocean Tours, our second trip with them, and another great guide named Elisa. So, a comfortable minibus trip to Chikin Ha, parked and kitted up, snorkel and mask. A relatively short walk to our first viewing point via a shower and the toilets. You cannot wear suncream or chemical mosquito products here. This was not a problem for us, but be aware trees / water = mosquitoes. We were shown 2 underground areas one of which is a religious area where a shaman will apparently smoke bad spirits out of you!! Or something similar. We then went for our first dip in a beautifully clear watered pool, a bit chilly to start with but once your in your in. Once back out we sat on the path leading out of the area, with our feet in the water. An abundance of little fish then came up to clean our feet. Then on to a second dip in another deeper and semi underground area. The sun shining through the trees into the water and then through into the lower waters was fantastic to see. Well worth the visit"
        }, 
        {
            "index": 179, 
            "rating": "4", 
            "review": "Refreshing!. We did two dives here. The facilities are good and had yummy fresh empanadas. There are a couple of places to snorkel and the water is crystal clear and 'refreshing' when you first get in! As a dive site it was fun exploring the caves and the light coming in at places was beautiful. As a nervous diver in enclosed places it was fine, the tunnels/caves are wide."
        }, 
        {
            "index": 180, 
            "rating": "5", 
            "review": "Special place.. Wow! What a gorgeous swimming \"hole!\" We enjoyed paddling around in the refreshing waters. This is a very beautiful, special place, but it was a bit tricky to find during our excursion. Our driver got lost in several small, and very poor towns. Visiting the place was an anthropological experience in itself."
        }, 
        {
            "index": 181, 
            "rating": "3", 
            "review": "Ascent on first dive was breathtaking. Otherwise, not on my \"do again\" list.. We did two dives in the Cenote...It was nice and well laid out. And if you're a cave diver, maybe you'll love it. the most beautiful part was the ascent on the first dive. Otherwise....well, I'm from the desert. Rocks with nothing on them are pretty much par for the course. I get that we're not supposed to disturb anything, but it was too slow. I was bored out of my gourd and the pace was so slow that I just plain froze in my wetsuit. Maybe I'd dive another one. Though parts of the dive were gorgeous, I wouldn't do it again."
        }, 
        {
            "index": 182, 
            "rating": "4", 
            "review": "Refreshing after a long morning.. Really beautiful refreshing waters, lifejackets are available for those who have trouble swimming+young children.Many people do cannonballs into the water, small black fish swim along side you in the water. Very cool but not too crazy to explore while swimming."
        }, 
        {
            "index": 183, 
            "rating": "5", 
            "review": "Gorgeous. This cenote is breathtaking! The water is perfectly clear and the rock formations create beautiful underwater lights."
        }, 
        {
            "index": 184, 
            "rating": "4", 
            "review": "Terrific Cenote. We loved the cenotes although the prices was a bit higher than we thought. They charged us 250 pesos per person and we brought all of our own snorkels and masks. The water was a bit cold but it was a nice change to the heat and humidity. We took our three teenage sons along and they really enjoyed themselves. We stayed for about 2 hours and had a great time. Would definitely recommend."
        }, 
        {
            "index": 185, 
            "rating": "5", 
            "review": "Amazing . Beautiful place. There are three xenotes, the third one you can observe the rituals, and the two others you can swim. The water is cold, cold, COLD, but is a unique experience, clear waters, so pure. The service was good. The tickets cheap, they have clean bathrooms, which is very difficult to find in any xenote, and the little restaurant was good. I do recommend this place 100%"
        }, 
        {
            "index": 186, 
            "rating": "5", 
            "review": "Such a treat. Bring your towel and swim shoes. I recommend a life jacket (available there) so you can float and focus on the view. Watch your step as the walkways are rocky."
        }, 
        {
            "index": 187, 
            "rating": "5", 
            "review": "Underwater wonders. if you have your snorkel equipment bring it. you can miss out on seeing the tropical fish that are in both cenotes. fins allowed on the cave one because it is deeper. nice cool refreshing water. beautiful scenery -- will do again. scuba diving allowed here too."
        }, 
        {
            "index": 188, 
            "rating": "5", 
            "review": "Fab trip. Beautiful & refreshing water but to cold for me. Husband loved it. If you are brave enough then you should swim in it."
        }, 
        {
            "index": 189, 
            "rating": "5", 
            "review": "Great Cenote with Great Facilities. I was out doing some cave diving and Chikin Ha has fantastic facilities, access, and great scenery! I look forward to getting in there again soon!"
        }, 
        {
            "index": 190, 
            "rating": "5", 
            "review": "Very nice Cenote to visit. The area consists of several cenote's that are worth visiting. One of them is an open one with quite some exotic fishes. Another is partly covered."
        }, 
        {
            "index": 191, 
            "rating": "5", 
            "review": "beautiful. These Cenotes were absolutely breathtaking! We loved swimming in the open and closed cenotes. The Mayan cenote was amazing as well. It would have been nice to see a ceremony."
        }, 
        {
            "index": 192, 
            "rating": "5", 
            "review": "beautiful. This is a amazing place, where you can swim in a cenote. Lots of steps to get to but well well worth it. Great place to visit."
        }, 
        {
            "index": 193, 
            "rating": "4", 
            "review": "Great dive. Place is nice. water is cool, and if you never done a cenote, its a good place to start. Would do again, but will get boring after 2-3 times."
        }, 
        {
            "index": 194, 
            "rating": "5", 
            "review": "Best one!. We visited this Cenote as part of the swimming with Turtles Tour.\nThis was the best Cenote we visited all holiday and I highly recommend it."
        }, 
        {
            "index": 195, 
            "rating": "5", 
            "review": "cenote. great day with the zip wires, cenotes, absailing things some of our group had never done well worth a visit"
        }, 
        {
            "index": 196, 
            "rating": "5", 
            "review": "very nice. amazing day out, swimming in this cenote, there are few around, plus you can use zip-wire ove the cenote"
        }, 
        {
            "index": 197, 
            "rating": "5", 
            "review": "3 very different cenotes. One open to the sun, one in a cave, and one with no swimming that is a ceremonial site. Bring a lighter for the candles in the last cenote. The first two cenotes are beautiful swimming holes, no need to bring snorkel gear."
        }, 
        {
            "index": 198, 
            "rating": "5", 
            "review": "Beautiful cenotes!. Had such a great time here with my family…thanks Private Tour Guide Kay! Such a beautiful place and a great experience for my family of 11…worth the visit."
        }, 
        {
            "index": 199, 
            "rating": "5", 
            "review": "Cavern Diving. A most exciting experience....if you dive and have no desire to cave dive (like me), I strongly recommend to try the Cenotes at least one time (bring your go pro). I promise it will be an experience you will never forget. Of course be smart enough to go with an expert guide, and don't try to be a cave whisperer (can be fatal), follow the protocols for cavern diving, and listen to your guide (they will brief you on everything). The bugs kinnda bite, but the dive experience is outstanding. There are no squeeze areas, and make sure you have a backup light (its very dark without it)."
        }, 
        {
            "index": 200, 
            "rating": "4", 
            "review": "You will also find a wonderful array of fish swimming with you. Cenote is a natural sink hole mostly fresh crystal clear water. Wonder experience for the family. The water is cool and fun to swim."
        }, 
        {
            "index": 201, 
            "rating": "5", 
            "review": "Great value + great time!. The guides were a lot of fun. cenotes were breath taking! had fun on the zip lines and really enjoyed the intimate mayan ceremony. not crowded either! lots of cool fish and even turtles !"
        }, 
        {
            "index": 202, 
            "rating": "5", 
            "review": "Great cenote. We caught a local bus to this cenote (Mexican bus drivers speed 140 in an 80 zone). What I dint realise is that we had to walk down a dirt road for 1 1/2 kms to get there. It was incredibly hot and the mozzies were swarming. BUT it was all worth it !! There is a set of 3. The first is gorgeous with clear water and lots fish and turtles. The second cenote is under a cavern. It looks scarey to begin with but take the plunge and get in, it's wonderful and so different to the other cenotes we went to days earlier. There are a few bats inside but they a don't bother you. Water is cool but there's no need for wetsuits. The last cenotes is not for swimming. It's a big cave with water around the edges. There appears to be a 'temple' of sorts inside. The day we went it smelled of Frankinsense which added to the allure. Take water, organic sunblock and repellant. The cost was a bit expensive $18 per person, some of the other cenotes (Azul & Cristellino) we're only $6 each."
        }, 
        {
            "index": 203, 
            "rating": "5", 
            "review": "Amazing Experience. Amazing cenotes, lots of wildlife - loved swimming in these surroundings.It was an experience I'd never forget and got some amazing photographs."
        }, 
        {
            "index": 204, 
            "rating": "4", 
            "review": "Love it. Great but amount of time here not enough. An hour and a half is not enough time to have lunch and enjoy the cenote. Loved jumping in from top level!!!!!"
        }, 
        {
            "index": 205, 
            "rating": "3", 
            "review": "Long day, but enjoyed it. Enjoyed it....long day. Cenote was awesome. Make sure you bring or wear your suits. We were not told about the denote visit until we where I'mN the bus."
        }, 
        {
            "index": 206, 
            "rating": "5", 
            "review": "Great for diving and a good snorkel too. went here to snorkel, just caught the local bus and got dropped off, beautiful area, lots of nature in the jungle and a good snorkel too, if you are a scuba diver it is a must!"
        }, 
        {
            "index": 207, 
            "rating": "5", 
            "review": "Kin - Ha Cenote / Zip line / 4 wheeler. So here we are on the beach at our resort and we get approached by a young man named Benjamin who starts his sales pitch with us regarding all the tours his company provides and how much money we will save by going through them instead of through the hotel. Last year we had done expeditions through the hotel and they were nice and you paid for it, however they were all day long, and this trip was around 4 hours. After thinking it over and realizing how much we could potentially save financially and how it was only 4 hours long we decided to go for it! The van picked us up at 9:00 am, not the best van, not the worst, but to be expected, we paid slightly more for a private tour - did not have to pick up anyone else from other resorts worth it in my opinion. We traveled for about 30 minutes, switched vehicles when we got to a rough dirt road, hoped in the 4 door pick up truck (new truck) traveled another few miles and we were at our destination. This place is in the middle of the jungle for real, super cool very laid back environment. They got right to business signing waivers, taking money, explaining the rules, gave us a locker to put our things in (change of clothes, phones, money, etc) Before we knew it we were on our 4 wheelers heading down the rough dirt road which was pretty fun, they go over the operation of the 4 wheelers thoroughly and you get a helmet and goggles and a life vest (for cenote). After about 15-20 minutes of cruising through dirt roads and jungle we got to the cenote. This place was really cool its like a big crater in the earth, water was very clear and clean, 2 zip lines, 4 or 5 different platforms (cliff jumping) to jump from. The highest is 55 feet, we did the 45 footer and that was awesome! The zip lines were a lot of fun as well, we had a group of about 10 of us and the only people that did the zip lines and cliffs was our party and 2 others so we could just keep jumping and zip lining without waiting. We were there for about 45 minutes, then back on the 4 wheelers and back to the base camp destination were we started. They took our lunch order (burger, fries, and water - other options too, watch out for the HOT sauce it is HOT and delicious if you like that stuff) While we waited we walked the grounds and went to another cenote, this one was basically completely under ground really cool like a cave with stilagtites or stilagmites, water was cold (under ground) theres a narrow slot that you can jump (15-20 foot) through to get down or you can take the stairway, we opted for the jump which was awesome. Got some cool photos down there, then the group got together we took a short walk around the grounds and got to the next zip lines from the tree tops. There is 2 zip lines there both pretty long and fun. Afterwards lunch was ready and delicious! They have a photographer that follows you on your journey and at the very end there is an area where he shows you your personal photos that you can purchase, or you can purchase a DVD with all your photos on it for $40.00 we opted for that as he took some great action shots. Our guide was Remmy and he was very cool, very laid back, very positive, and also very informative. No complaints at all from this party, it was myself, my girlfriend, and her teen-age daughter and we all had a blast!!! Highly recommended!! Thanks Kin-Ha keep up the great work!"
        }, 
        {
            "index": 208, 
            "rating": "5", 
            "review": "One of the most exiliterating experiences I have ever had!. This underground cenote is amazing! At first, I was scared to death to walk down the stairs into the dark unknown. Once I got to the bottom of the stairs, I was in awe of the beauty of the cenote. The water is chilly but feels amazing in a hot day. The water is clear but it is super scary to jump in initially. After about 5 minutes, I didn't want to leave!I highly recommend this spot. Especially after a visit to the Coba Ruins which is right down the road."
        }, 
        {
            "index": 209, 
            "rating": "5", 
            "review": "Once in a Lifetime Experience!. If you are not afraid of water or heights, you have to dive into one of the many \"Cenotes\" in Mexico! It is like \"Cliff Diving\" but without the worries of poor timing! LOL!"
        }, 
        {
            "index": 210, 
            "rating": "5", 
            "review": "family run and owned...quiet and un touristy. the water was clear and cold...many divers in the tunnels. family style setting..we went in with a guide and that made us feel safe and confident and we all enjoyed the extra details."
        }, 
        {
            "index": 211, 
            "rating": "5", 
            "review": "Amazing Day!. I had an amazing day visiting this place! Our tour guide Mundo made sure we had fun all day long. He is a great guide! He is patient and funny and was really going out of his way to make sure we had a great day. This place is really more than I expected and it really was awesome. I highly recommend you visiting this place and asking for Mundo Carvallo as your guide."
        }, 
        {
            "index": 212, 
            "rating": "5", 
            "review": "One of the prettiest cenotes!. Cool, sparkling fresh water in the heart of the steamy jungle: you can easily see why cenotes were sacred to the Maya people.This is one of my favorites for snorkeling or SCUBA. Area is well-maintained, safe, & secure. Paths easy for strolling & carrying heavy gear.Cool cave formations, flowering lily pads, colorful fish, & baby turtles. Just perfect!"
        }, 
        {
            "index": 213, 
            "rating": "5", 
            "review": "Great cool down after Itza. This was a welcome relief after a long trip to Itza, clean changing/toilet shower areas and although a bit slippy the stairs allow you easy access to the water. Several viewing areas for non swimmers to take photos or simply relax with a drink/ice cream etcNever seemed busy whilst we were there, respect their rules and shower first to protect a natural wonder"
        }, 
        {
            "index": 214, 
            "rating": "5", 
            "review": "What an amazing history.. Just fabulous, so glad we went, the history of this site is just amazing, not really suitable for children so we left daughter, son in law and granddaughter at hotel, but husband and I just loved it even though it's so hot and tiring, not to be missed."
        }, 
        {
            "index": 215, 
            "rating": "5", 
            "review": "Three in one!. This cenote is actually multiple cenotes all in one place. The paths throughout are well-maintanied and easy to walk, with clear signs to help you get around, because it is a pretty big place overall.There is an \"open\" cenote, which is wide and sunny, surrounded by tropical foliage, and full of beautiful fish and underwater flora. It is perfect for snorkeling or just lazily swimming in the cool refreshing water. There is a small set of wooden steps to help you in if you do not want to just jump- this was good for our six-year-old who was a bit timid. Some areas are deep and it is amazing to just float along and look through the crystal clear water and see the rugged bottom.There is a \"closed\" cenote. It is like a cave tunnel and you can swim from one end to the other. It was fascinating. Of course, because there is no sun to warn the water, this cenote is pretty chilly, so you will probably not linger in the water too long. It is fun though, and a bit thrilling as you swim through the dark water with the stone roof over you. I will admit, I was a bit scared, but that is because I have a fear of the dark. Silly me... :)There is a sacred cenote that you are not allowed to swim in, but is so lovely and peaceful It is kind of underground, but not completely, and there are lots of openings in the ceiling of the cenote. The tree roots that have made their way through the limestone rock and are trailing down to the water and earth below are incredible to see. The water in this is so still and so blue. It does feel like a magical place.I have visited other cenotes (Cenote Azul is another one I like a lot), but this one beats them all! GO!!!! Take your snorkel gear. You will love it!!!"
        }, 
        {
            "index": 216, 
            "rating": "5", 
            "review": "Great FUN!. We rolled up to this off the beaten path cenote by chance but are very glad we did. Was very affordable- If I recall we paid about $25/person and that included snorkel gear and the two zip lines on the property. One cenote was under a cave and didnt have many fish but amazing rock formations to swim underneath. The other cenote had much more sunshine and a lot of marine life. Our guy was fun and stayed with us the entire time. We had a very inexperienced group and only snorkeled but always felt as our guide was with us and keeping an eye on us. The zip lines both went over water and had great views. Also for lunch, the empenadas were basically a $1 each and were amazing. Overall no complaints from anyone in our group and a great time was had by all. Thanks again!!"
        }, 
        {
            "index": 217, 
            "rating": "5", 
            "review": "So refreshing!. My partner dove here while I snorkelled, it was a lot of fun. We booked through ProDive, dive master, Baptiste was very knowledgeable. My guide was Fernando, he was very nice and friendly. I loved the cenotes, esp where it was SO hot there in the jungle."
        }, 
        {
            "index": 218, 
            "rating": "5", 
            "review": "What a hidden gem!!. We asked a local driver to take us to a cenote where we could float alone and that wasn't crowded so he took us here. We were greeted cheerfully and were the only ones there at 9AM on a Sunday! It only cost us 500 pesos to get in as well. We didn't have to wear life vests, helmets or go with a tour guide. We found the cave cenote and jumped in. The water GLOWED topaz blue - it was like swimming in a gemstone! There was absolutely no one there and we had the place to ourselves for a while.I am sure that it's probably not for everyone. There are stairs and walking, and like I said, the float vest was optional (which we loved). I also recommend Carlos Aguilar to drive you if you detest busses of tourists like we do! 998-844-81 67 -- he was amazing."
        }, 
        {
            "index": 219, 
            "rating": "5", 
            "review": "Refreshing!. We did these cenotes after a morning swim at Akumal. The cenotes are beautiful, and were refreshing when you jumped in to swim! Would recommend these for half a day excursion to anyone to experience them!"
        }, 
        {
            "index": 220, 
            "rating": "5", 
            "review": "Cliff diving. This was an awesome experience to not only see but to experience the swimming in a Cenote and diving off the cliffs, actually they don't like you diving and want you,to enter the water feet first ....oppps"
        }, 
        {
            "index": 221, 
            "rating": "5", 
            "review": "Cave scuba diving. Very cool to dive in enclosed area with no waves or current. Not much marine life but the cave formations make it a bucket list to-do item"
        }, 
        {
            "index": 222, 
            "rating": "5", 
            "review": "Quite and Beautiful. A quiet cenote with beautiful diving that feels off the beaten track. I had some homemade empanadas for lunch and they were tasty! Not very touristy feeling at all."
        }, 
        {
            "index": 223, 
            "rating": "5", 
            "review": "Great value for self guided visit. Walked (ran really- be careful!) across highway from Barcello. Looking for cristalino cenote and came across chiken ha first. Was right next to kanten chi cenote which is about 800 pesos for guided tour. We had a group of 11 and negotiated with the guy in the booth to get in for 200 pesos instead of 250 each. Walked 20 min down dirt road and came to the facility. Showers and lockers provided. 3 cenotes"
        }, 
        {
            "index": 224, 
            "rating": "5", 
            "review": "Peaceful and charming. 3 cenotes, one open with a wide range of fish and surrounded with plants and birdchirping, one cave with lot of\"spa fish\", and one just for take pictures. Long distance on foot, but worth to see it. Not so many people, entrance fee is ok, 200 pesos / p. Showers, toalettes were clean and nice designed."
        }, 
        {
            "index": 225, 
            "rating": "5", 
            "review": "Beautiful Cenotes!. There were 3 total Cenotes here 2 to swim in and 1 to look at. It was off the beaten path, so there was not a lot of other people there. I would highly recommend it if you have the time."
        }, 
        {
            "index": 226, 
            "rating": "4", 
            "review": "Better than most Cenotes in Mexico. Most cenotes you have to trek down flights of stair or scuba dive them. And then there are the masses of people that swim in and \"go\" in the cenotes. UHG! the smell is usually sooo bad however, this one was nice and wasn't too awful for a germ freak like myself. I would recommend going in off season and PLEASE shower before entering, the water is cold anyway Just bite the bullet."
        }, 
        {
            "index": 227, 
            "rating": "4", 
            "review": "Interesting refreshing experience. This is the first time for me visiting a cenote and it was very refreshing. This is on private land and run by family members so it is a b&b of cenote I guess. We were take to this cenote as part of our excursion.There are several under ground river or pools of water and the main one where one can swim from one to the other side is amazing. Water is refreshing and the sun beam dances as it strikes the clear cool liquid. We saw divers scuba diving and apparently it is very deep, and the divers are cave diving trying to connect the cenotes. A great place to spend the morning or the afternoon and it is easy to get to just past Playa del Carmen on the way to Tulum."
        }, 
        {
            "index": 228, 
            "rating": "5", 
            "review": "Another Adventure!. Scuba Diving the cenotes is an unforgettable adventure. One thing is for sure, each and every cenote is very different from the next and very unique. This particular cenote is no different, it is big in area with very large rock and quite a varied fossil deposits, in contrast to the Dos Ojos/Bat Cave cenote which is fascinating with its stalactites, etc.Make sure to visit with a reputable dive company and you will not be disappointed. Cenote diving is typically a 2 tank dive, each on a different route. This cenote has caves as well but that is a completely different dive adventure that requires special certification/training."
        }, 
        {
            "index": 229, 
            "rating": "5", 
            "review": "Unexpected Photos & Fun..... I can't tell you how many times I've drove by this place and never saw the sign, Ugh, I'm ashamed. Haha.... We stopped in this January and did the tour and this place is Beautiful. You can tell they put ALOT of effort into the grounds. You can start by looing into a small gift shop or having a get together at their shelter. Then you may walk a short distance to an open pit style Cenote and take a swim or Dive here. There is a second Cave Cenote for the same a little further, both quiet and serenly beautiful. Jungle canopy is thick, so dont NOT go if there is some rain. NOTE: (I prefer visiting Cenotes' in the rain, usually You can have the place to yourself)The third is a \"Mayan Ritual\" Cave Cenote that is only for walking and photos. This is where is got a little paranormal. None of the photos of my wife would take. Me and my friends photos (taken as tests) were clear and normal. I will post the photos here and you tell me what you think....Skulls and mist on a clear and sunny day, An arm of \"pure light\" touching my wifes face in another. Wow!!!!The folks who run this place are polite and curtious, grounds are clean and presentable. Plenty of parking and paths are smooth to travel for the most part....I WILL be back....Tell em', \"Chicago Joe\" sent You...."
        }, 
        {
            "index": 230, 
            "rating": "5", 
            "review": "Fantastic dive in Chikin Ha cenote. We had a great diving experience in this cenote, getting in the water in Chikin Ha, reaching through the tunnels the rainbow cenote (beautiful) and coming back. We did two exploration dives, amazing lights, incredible halocline experience and nice galleries.I definitively recommend it!"
        }, 
        {
            "index": 231, 
            "rating": "2", 
            "review": "Didn't have an experience like previous posters. I don't know what happened at this Cenote, but our experience was terrible. We were brought here by a private tour guy name George who insisted this is the best cenote in the area. I pressed him to stop here at the beginning of the day but he pushed back saying the water is to cold at 10 in the morning. I explained to him that this isn't my first rodeo, and all cenotes are cold regardless of time of day. So he took us to Akumal first and then to the cenote. I should have known better when we pulled in and the driver to a wink and a smile from the guy in the booth at the entrance. He opened the doors to the van and basically said see you in 3 hours. We were never told that you should buy the expensive option for the best experience, so we bought the basic tour for $25 USD. The basic tour was, well, basic. Walk yourself to the cenotes and have at it. The first one looked like a swamp and when I told the group to jump in, they thought I was nuts. The second one was nice, but just a basic pool of water under a partial cave. The third one had a layer of white scum over it, so nobody dared enter. We were there for a total of 40 minutes. When we got back to the van, George was really surprised to see us and wasn't happy when I told him to take us back to Akumal so we could hang out at La Buena Vida. Funny thing is there was a brochure for Kantun-Chi cenote which is right next door. It looked awesome, and I would say worth a shot before trying the frickin Chikin....."
        }, 
        {
            "index": 232, 
            "rating": "5", 
            "review": "fun. there are 3 cenote here one was a little dark I found it a little freaky but it was very safe our guide Teamara was very informative one was a sacred place of the Maya there was a alter and sacred objects set out very cool don't touch there was a tradicial wedding going on everybody in white felt bad walking inon the bride's happy day but she never quit smileing so beautiful. the last cenote was quite shallow and loaded with fish and tiny little turtles great day $68 us each and they do the driving and feed you have fun!"
        }, 
        {
            "index": 233, 
            "rating": "4", 
            "review": "Interesting time. Well worth it. Enjoyed the swimming and the artifacts that were presented. Hopefully the locals might enjoy some of the profits as they are in dire need of more higher standards of living. Enjoyed the crystal clear cool waters. A little cool to get in, but once you are there. Fantastic."
        }, 
        {
            "index": 234, 
            "rating": "4", 
            "review": "Great fun :). Wow I liked the look of it huge and fresh. However I disliked the temperature of water it was very cold."
        }, 
        {
            "index": 235, 
            "rating": "5", 
            "review": "two tank dive there. Good equipment and dive master---very fun dive, and a must do if you scuba. We were charged $220 per diver and it was well worth it."
        }, 
        {
            "index": 236, 
            "rating": "5", 
            "review": "Great Dip. This was included as part of a different tour. I wouldn't have thought to go on my own but was glad I did. It was really refreshing and interesting. Would do it again in a heart beat."
        }, 
        {
            "index": 237, 
            "rating": "5", 
            "review": "No fear. This was my first time in a cenote its really nice and the water is so clear. We went into 2 different caves and swam around with Paco our guide who also happened to be quite attractive. We did rappel into the cave, I liked that and was not frightened at all like some of the men and women. We zip lined into the water but when you do this water goes up your nose so be prepared. After that there was 2 zip lines thru the forest you have to climb very high towers which are almost vertical so if you are not in good shape don't do it. I am a 44 year old and had no problem at all. There was a lunch at the farm it was traditional Mayan food which was a bit bland but fine. The juice was from flowers and yummy. After that we went to Tulum and saw the ruins and beach and there was some tourist flea market type things along the park road. The water was a bit rough there and I did not go in very far. Lots of stairs to go down to the beach so its not good for people with mobility issues."
        }, 
        {
            "index": 238, 
            "rating": "5", 
            "review": "Chikin Ha and swimming with turtles. Went to this place with my Son. We had a great time the tour guide was excellent, well informed with its history. I recommend it to everyone."
        }, 
        {
            "index": 239, 
            "rating": "5", 
            "review": "FUN!!. We went with Sea Blue travel - great price, lots of experience, great with our children, delicious lunch. We ziplined in the jungle, drove ATVs through the jungle to 2 Cenotes where we were able to swim and dive, so much fun and such great guides and people!!"
        }, 
        {
            "index": 240, 
            "rating": "5", 
            "review": "Great Cenote Dive. This was an amazing dive with great rock formations. Martin from Cenote Xperience in Playa was a great Dive Master."
        }, 
        {
            "index": 241, 
            "rating": "5", 
            "review": "Very Nice. We took the Chikin Ha tour from Sandos Playacar and was amazed at the clarity of the water of the cenotes. We took every opportunity to snorkel in each the cenotes. Scuba divers were 50 ft below us and we could see them clear as a bell. This is a great place to visit and see cavern type cenotes."
        }, 
        {
            "index": 242, 
            "rating": "5", 
            "review": "Mysterious paradise. While at one of our a' la carte dinners at the Barcelo' we met another couple from Port Alberni (small world). Mike and Emily have been coming to the Barcelo' for nine years and told us of this Cenote directly across from the entrance to the Barcelo' Resorts.We spent the next day exploring and snorkelling this amazing Cenote. Crystal clear water, lots of depth and the lagoon was breathtaking!Thank you so much Mike and Emily for making our vacation a memorable one!See you back home.Cheers,Glenn & Maria"
        }, 
        {
            "index": 243, 
            "rating": "4", 
            "review": "Interesting. Good information from the guide.intersting data regarding the Mayan culture. Disliked that the pyramid was closed to climbing.Also, did not feel vendors were allowed on the path in the grounds attempting to sell their wares."
        }, 
        {
            "index": 244, 
            "rating": "5", 
            "review": "excellent place to swim!. I loved it was a great experience, I love everything but the water felt cold!. amazing people, great suvenirs, great views, the people who work there was very helpful and nice, I really enjoyed!"
        }, 
        {
            "index": 245, 
            "rating": "4", 
            "review": "Peaceful setting, beautiful scenery. Peaceful afternoon at the cenote Chikin Ha. It is located a short distance from Puerto Aventuras. Traveled by a colectivo to the location and then walked about 15 minutes to the entrance. Very interesting cenote and not very crowded - a great place to spend the afternoon. Arrived around 12:15 and stayed for about 2 hours exploring the various cenotes."
        }, 
        {
            "index": 246, 
            "rating": "5", 
            "review": "Hidden gem in the mayan jungle. Spectacular cenotes, peaceful environment and fantastic service make this eco-park a great place to spend a day in the mayan riviera"
        }, 
        {
            "index": 247, 
            "rating": "4", 
            "review": "Peaceful.... These cenotes are peaceful, not too over crowded and so clear. There are three main cenotes, all different and each one has its own unique attraction. The first cenote you come to is best for fish and snorkelling. The second one is great for scuba diving. The third one has fossils on the walls. Beautiful."
        }, 
        {
            "index": 248, 
            "rating": "5", 
            "review": "Quite and Beautiful. I loved the underground river and the main CENOTE. The kids love to dive on the Cenotes. It's very calm and it's really well maintained."
        }, 
        {
            "index": 249, 
            "rating": "5", 
            "review": "The best. I went to several cenotes and this one was the best for me you have to try it.Take moskito off products."
        }, 
        {
            "index": 250, 
            "rating": "4", 
            "review": "Not as good as Dos Ojos but quieter. I enjoyed Chikin Ha cenote a lot. It's very close to Playa del Carmen so you can do it in an afternoon or morning, doesn't need to take the whole day. There are three cenotes all within walking distance so you get to see a small selection, and each one has its own character. Definitely worth a visit."
        }, 
        {
            "index": 251, 
            "rating": "5", 
            "review": "Cavern Diving. Pro Dive was a very good operator, dive guides were very safe, excellent briefings and cavern diving was an amazing experiance."
        }, 
        {
            "index": 252, 
            "rating": "5", 
            "review": "awesome adventure. Gives you an opportunity to see some beautiful areas that made the Myan villages so attractive to live work & understand their style of life. Its not indebth, boring, and yes I would have liked more time but honestly we did a lot and I recommend the opportunity to enjoy more then the standard Pool, beach atmosphere at the resorts."
        }, 
        {
            "index": 253, 
            "rating": "5", 
            "review": "Great dive. This is a must for scuba divers it's not like a ocean dive . It was a super day that not every body will get to see. Just do it"
        }, 
        {
            "index": 254, 
            "rating": "2", 
            "review": "Skip this one,. This is a Xenote that is natural, small, not that much there. It has one cave that you swim in for 10 minutes and one open air that you get 10 minutes in. It is packaged with a Turtle swim package at Akumal. Go with one of the better Xenote/jungle entertainment packages and a separate snorkel trip"
        }, 
        {
            "index": 255, 
            "rating": "5", 
            "review": "This place was awesome!. Lorenzo was our guide on this tour and he was an terrific guide. The zip lining into the water was so breathtaking. My wife and I had a great time on the ATV's and during the ride we switched into our bathing suits and took the plunge."
        }, 
        {
            "index": 256, 
            "rating": "4", 
            "review": "Cool. A lovely cool swim after walking in the jungle . But you need to be aware there is nowhere to get changed after your swim ."
        }, 
        {
            "index": 257, 
            "rating": "4", 
            "review": "Lovely Place to visit. Very interesting place to visit. We went on a tour and had an English guide who was very good. We learnt alot about the Myan culture. The buildings are incredible, so very precise."
        }, 
        {
            "index": 258, 
            "rating": "5", 
            "review": "Underground underwater caves. Very pretty stalagtites and stalagmites, wish I had had a camera! Deep in the jungle, enjoyed this swimming tour!"
        }, 
        {
            "index": 259, 
            "rating": "5", 
            "review": "Gorgeous!. Once you arrive, you pay $25 a person to enter. You have to shower off before going in the water, getting rid of sunscreen, bug spray and other oils. Don't want to upset the delicate ecosystem within the cenote! The mosquitoes were awful but if you stay in the water, you'll be okay. I would recommend wearing wet socks, as there are rocks and such. It kind of freaked me out how clear the water was! Beautiful view of tiny fish and a couple of birds in the trees. Be sure to take a towel,water and a camera. They do provide lockers, life jackets and tubes."
        }, 
        {
            "index": 260, 
            "rating": "3", 
            "review": "Watch out for the Mosquitoes. A great trip but it was ruined by the amount of mosquitoe bites we recieved to the point that it was hard to pay attention to our guide due to continuously fighting the insects."
        }, 
        {
            "index": 261, 
            "rating": "5", 
            "review": "swim. Very cool to see. Probably good idea to bring towel and change of clothes as this is inside a cave not out on a beach"
        }, 
        {
            "index": 262, 
            "rating": "5", 
            "review": "Amazing crystal clear water. If you're used to ocean diving, this is a slight change since cenotes are basically fresh water. Did two great dives."
        }, 
        {
            "index": 263, 
            "rating": "5", 
            "review": "If you get a chance to dive -- do it. Easily accessible -- walk down to water with dive tanks on. Incredible experience, did with Dressel divers. What an amazing opportunity to experience cavern diving,"
        }, 
        {
            "index": 264, 
            "rating": "5", 
            "review": "So fun. Amazing trip snorkeled kayak zip lined and rappelled the guide was very knowledgeable and they feed us twice"
        }, 
        {
            "index": 265, 
            "rating": "5", 
            "review": "Beautiful natural place. Chikin Ha was not something my partner and I would have chosen to do whilst we were on holiday, but it came as part of a turtle snorkelling tour booked through our Thomas Cook rep. The Cenote is owned by a family who look after it really well. There is plenty of plants and wildlife to look at as you move between the various cenotes.Our excursion gave us the chance to snorkel in two of them and view another. The first swimmable was in a cave. The water was freezing, but the sight of all the limestone rock both above and below the water was amazing. The second was like an underground garden. Beautiful flowers and loads of fish and turtles, dragonflies, butterflies, etc.It's such a peaceful place and looks as though it is never too busy. It was nice to find something new to enjoy that I would never have considered anyway. If cenotes is your thing, then I definitely reccomend Chikin Ha due to it's variety of cenotes."
        }, 
        {
            "index": 266, 
            "rating": "4", 
            "review": "Chikin Ha Cenote Tour. The Chikin Ha cenote excursion was excellent. The tour was not \"rushed\" like some can be. It was very relaxing, beautiful and informative. Swimming in the below ground cenote was a very memorable experience. Un-wordly clear water. So clear that fellow swimmers almost appeared to be floatin in the air on my GoPro video. The above ground pool was very picturesque as well. I highly recommend this trip."
        }, 
        {
            "index": 267, 
            "rating": "5", 
            "review": "Nice Day. Dove at Cenote Chicken Ha with Dive Mike dive shop in Playa del Carmen (see separate review). This is my second Cenote dive (Choc Mal was first). This is a beautiful cenote dive, lots of caverns, and the facilities at the dive site are great and clean. Good dive site."
        }, 
        {
            "index": 268, 
            "rating": "4", 
            "review": "Very nice!. Had a great tour guide thru this cenote, plus snorkeling with the sea turtles. Well worth the money."
        }, 
        {
            "index": 269, 
            "rating": "5", 
            "review": "Awesome. Our young adult children jumped from a high platform into the water. The view from the bottom looking up makes you realize how breathtaking Mother Earth is."
        }, 
        {
            "index": 270, 
            "rating": "4", 
            "review": "Cold water. I don't swim but my family does. Dipped myself in the cenote and my family went swimming. Great experience."
        }, 
        {
            "index": 271, 
            "rating": "5", 
            "review": "Nice cenote. Really nice and well-maintained cenote, worth visiting. We visited them through Ocean Tours, it was really nice experience to snorkel and get to know more cultural background about cenotes."
        }, 
        {
            "index": 272, 
            "rating": "5", 
            "review": "Great for cave diver training. I am local resident and take all my cave diver candidates/clients to various cenotes during the week long (and intensive) scuba diving training. Chikin Ha and X'Tabay are the two cenotes on the property and boost an array of wild life and fauna, typical to the Mayan jungle.Very pleasant staff and if I recall, visitors on a tour can enjoy local food too, fresh from the Mayan stove.I highly recommend visiting Chikin Ha cenote."
        }, 
        {
            "index": 273, 
            "rating": "1", 
            "review": "Nice but no thanks. Is nice to see but lots of people and is just jumping and getting out and jumping againNice to see but there are plenty of cenotes to chose"
        }, 
        {
            "index": 274, 
            "rating": "5", 
            "review": "must do - take a dip !. When entering the scene it was already mesmerising. The swim was better than expected though cold 19C. Do it, it's a experience worth it, even for 15 min don't let it pass, the food by the way and the service was great as well."
        }, 
        {
            "index": 275, 
            "rating": "5", 
            "review": "Cenote awesome. jaw droppinly beautiful, amazing although I have been before and note that there are now restaurants and gift shops situated there,"
        }, 
        {
            "index": 276, 
            "rating": "4", 
            "review": "Refreshing. Love the cool refreshing water and a day of sun and sand. Lovely to just relax in the cool very clear deep cenote and chill. In the jungle and so quiet and tranquil."
        }, 
        {
            "index": 277, 
            "rating": "5", 
            "review": "AMAZING....100%. Five of us went through Olympus Tours and had a truly amazing time. We snorkeled in the underground cenote first and then headed along the path to the one in the open still with time for the sunlight to illuminate underwater. Lunch after was simple yet delicious. We were served an empanada, banana, plenty of water, cake, granola bar and a lollipop - haha. Well, after two hours of snorkeling we devoured it all. The blue cichlid fish in the open air cenote were electric blue...so cool! Be sure to ask about the dog with scratches on his face - from a jaguar fight!"
        }, 
        {
            "index": 278, 
            "rating": "5", 
            "review": "Amazing cenote. The mosquitos outside the cenote were pretty fierce but the cenote was amazing. Our guide (Manual from Bahia divers) took us through twice along different routes, Gliding over amazing bleached pieces of limestone which looked like giant dinosaur vertebrae was sensational. Ask to dive it."
        }, 
        {
            "index": 279, 
            "rating": "5", 
            "review": "Good time. We visited these cenotes as part of a 1/2 day trip. Just a few notes for people. Snorkle in the open cenote first. Because it gets direct sunlight, plants and such grow in the water. If you save that one for last, you will want to shower off. BUT, if you snorkle in the larger cave cenote last, you can kind of rinse off in it. Also, the water is colder than you might expect but it will help reduce the itching and swelling of the mosquito bites you are sure to get while walking the paths! :)"
        }, 
        {
            "index": 280, 
            "rating": "5", 
            "review": "Great cenote to dive. There are so many great cenotes in the Playa area. This is one of them. Very beautiful grounds also."
        }, 
        {
            "index": 281, 
            "rating": "4", 
            "review": "Fun for a quick visit. I liked the fact of what it is and that you can go swim in it...beautiful to behold and lush gardens.\nDislikes - it's very cold water and there were lots of black fish swimming with you."
        }, 
        {
            "index": 282, 
            "rating": "5", 
            "review": "WOW!!!!. All i can say is this trip is a must. It is incredible and well worth the money. The temples were so impressive."
        }, 
        {
            "index": 283, 
            "rating": "5", 
            "review": "Brilliant Trip to Chikin Ha. We booked our visit to the Chikin-Ha cenote and Akumal beach snorkelling with turtles during our stay at Playa del Carmen. This was a fantastic half day trip taking in Akumal (tortuga bay) and Chikin-Ha cenote which are located close to Playa del Carmen. Our tour guide Giovanni was great and spoke good English, the cenotes were outstanding, water was crystal clear and quite cold, and the photographer was great. Didn't think much of the lunch (empanadas and banana cake) but overall this was a great experience and superb value for money."
        }, 
        {
            "index": 284, 
            "rating": "5", 
            "review": "having 3 attractions altogether was great!. We were able to havr lunch here, prepared by Mayan natives, which was amazing in itself. The fruits were delightful and the avocado delicious. They even had hibiscus flower juice which we enjoyed especially as we ate them as children. There was ziplining, both a short one and a longer one, over the water. Then kayaking, which was lots of fun, including crashing into the embankment and eachother now and then. We even went into a small cave like area, very nice. Heading back to the end was like the amazing race :) was alot of fun. Ended with swimming in the cenotes, water was crystal clear and very cool, there was even a jumping platform. And for those just wanting to relax, there were some hammocks, looked heavenly. All in all a wonderful experience and so convenient to have all these activities in one place, makee it easy."
        }, 
        {
            "index": 285, 
            "rating": "5", 
            "review": "Great cenote for family. We wanted to visit a cenote and do some beach snorkeling in the same day. This was perfect. Akumal (tortuga bay) snorkeling and Chikin Ha cenotes are close enough to Playa del Carmen and to one another to do them in less than a full day. Yes, there are probably better, more amazing cenotes, but we had a great guide (Lada, and adorable russian with near-perfect english) and the cenotes were very neat, water was clear and cool, and the photographer (Gonza) was excellent (CD with all pics, no videos, was $25 US). Whether or not you are there with a group, try an empanada, they are fabulous!"
        }, 
        {
            "index": 286, 
            "rating": "4", 
            "review": "Beautiful natural pools. It's a little secluded and under construction some of it but it is a very unique scenery , never seen under water natural spring water pools before, great price $30, the staff can't be more cordial and helpful"
        }, 
        {
            "index": 287, 
            "rating": "5", 
            "review": "Nice place. The beauty of this place is incredible! The water is very cold and to get in the water and get out of it, there is only 2 small wooden staircases...not the best..."
        }, 
        {
            "index": 288, 
            "rating": "5", 
            "review": "loved it. travel time sucked, but it is a must see!!! The staff made this tour great. I would say it is a great place to see."
        }, 
        {
            "index": 289, 
            "rating": "4", 
            "review": "Enjoyed- peaceful and beautiful. Went at a quiet time in the afternoon; had the caves to ourselves other than a few scuba divers. Pretty pools with lots of little fish in the first pool. A magical place. Take your snorkel gear to see better under the water."
        }, 
        {
            "index": 290, 
            "rating": "5", 
            "review": "Excellent Cave Diving!. 3/23/14 - Incredible first dive of the day. Easy entry over stepped rocks into the crystal clear waters of the Chikin Ha Cenote system. Dive over boulders in the cavern zone for ten minutes before reaching the tie in for the cave section. Beautiful shafts of light piecring the light-green algae covered surface. After a 100foot jump on a reel over to the main line of the cave, which went from florida gold line to Danny Riordin's braided nylon. the delicate sculpted and scalloped limestone was so delicate, that even our bubble brought down a light rain of small rocks. Tiny albino shrimp, smaller than a grain of rice, were caught in our cave lights as we pushed through the dark passages. The field of limeston, sculpted by years of acidic water from above, often looked like fields of bones. Finning was careful through these sections, but they always seemed to open up into larger rooms. Well, until they didn't - we turned at ~52 minutes in not on thirds (my SAC rate was ~.55 on the entire dice) but due to a combination of new silt, calcium silt, and limestone dropping from above. On exit a large rock, perhaps 3ft wide, broke loose and struck my legs as we passed. Could have found the line faster, but situation was handled well. Good thing it didn't whack Juan's head - I was leading out. On the way out the Halocline (layers of water separated by salt and fresh water) were far clearer as I was leading the dive instead of following. We ran about five minutes faster out due to my longer legs and the slight flow that pushed us gently out of the cave. Decompression in an open area of the basin afforded us the ability to watch the snorklers puddling above us and tour divers following the cavern line. We both surfaced at 111 minutes, smiling and laughing and agreeing that this had been an enjoyable day. Can't wait for tomorrow."
        }, 
        {
            "index": 291, 
            "rating": "4", 
            "review": "Group tour. Came here as part of Ocean Tours Turtles and cenotes excursion. We were able to swim/snorkel in 2 of the cenotes, the 3rd one being smaller but used for religious events. Food we were provided with was very good. Washrooms very clean ."
        }, 
        {
            "index": 292, 
            "rating": "5", 
            "review": "Another great day. We combined a snorkel trip to the cenotes and to akumel to snorkel with the sea turtles. Great day. You can not use sunscreen because it is dangerous to the shells of the turtles. Bring a t shirt. The cenotes are beautiful fresh water. It is a great trip for beginning snorkelers like my daughter. The water is calm and clear."
        }, 
        {
            "index": 293, 
            "rating": "4", 
            "review": "Enjoyable visit. A unique experience being able to snorkel inside caves and share the history of the site; delicious snack too at end of visit."
        }, 
        {
            "index": 294, 
            "rating": "5", 
            "review": "Amazing. The best visibility ever. Unique scubadiving experience. Will be back soon hopefully... Another world"
        }, 
        {
            "index": 295, 
            "rating": "5", 
            "review": "Cenote spectacular. WOW is all I can say if you have never been its an erie mix of wonder and amazement almost sacred as you will be swimming in the waters of thousands of years"
        }, 
        {
            "index": 296, 
            "rating": "5", 
            "review": "Great diving. Loved diving here. Strongly recommended or divers of all levels of experience. Dove here with CenoteXperience."
        }, 
        {
            "index": 297, 
            "rating": "5", 
            "review": "Somewhere Under The Rainbow. Chikin Ha is so colorful. It is named the rainbow cenote for a reason. While under water, you see all the colors of the rainbow up above. We have dived a lot of cenotes, and this one is my favorite because of all the colors and the lights."
        }, 
        {
            "index": 298, 
            "rating": "5", 
            "review": "Very special cenote. Cenotes are privately owned by citizen's . This one was handed down to a Grandson in his 20's. He has made this place a magical wonderland for himself and his staff. They are all like family and its very nice. We hung out with a young fellow named Sebastien ,who was just adorable. He showed us around the cenote & took me over to the sweat lodge. It is used in Mayan rituals on full moon's they use special leaves & bark to burn the rocks that heat the lodge. The leaves & wood have a very distinct aromatic smell that is memorable.After you steam at night on the full moon you can cool down in the cenote. They have a shaman at this paticular cenote & a special cenote just for his ceremony's. You won't find this at any of the 6 or so one's I visited. The place is a very short cab ride down a dirt road across from the main town in Playa. You can swim here, snorkel or have a shaman fix you up. Each cenote has there own vibe this one is very close to my heart."
        }, 
        {
            "index": 299, 
            "rating": "5", 
            "review": "Scuba diving. One of our two main reasons for visiting Playa del Carmen was scuba diving in the Cenotes, and we did them all. It was a sensational good experience."
        }, 
        {
            "index": 300, 
            "rating": "5", 
            "review": "3 cenotes in nice jungles. nothing amazing compairing to Chchen Itza cenote but not a bad place if not counting chilly water :), better on a sunny day than cloudy. it looks prettier under the water."
        }, 
        {
            "index": 301, 
            "rating": "5", 
            "review": "A must visit. A great place to visit, it is a must. No dislikes. You need to book this trip with your holiday rep, as ours with Thomson included a swim in the underground cave plus lunch."
        }, 
        {
            "index": 302, 
            "rating": "5", 
            "review": "Beautiful and fun!. The Cenote at Chichen Itza was so pretty. The water is kinda cold and deep, but I think it is so neat to know that you can swim in the same water as the ancient Mayans. The history of the Cenotes are really interesting as well. The cenote at Chichen Itza has a cliff where you can dive into the water. There are life jackets that you can rent for three dollars, but my husband and I chose to just swim without one, and it was fine. There are a lot of vines hanging in the water, and you aren't allowed to touch them, so you can preserve the cenote, but it was pretty awesome."
        }, 
        {
            "index": 303, 
            "rating": "3", 
            "review": "Nice and clean!! Very Expencive Tequila and Gifts!!. Very nice to see the place but the prices are very expensive!! Especially the Tequila and there is a Misunderstanding when our agent told us that that will be tequila Factory but it came that is Tequila Shop!!"
        }, 
        {
            "index": 304, 
            "rating": "5", 
            "review": "Great dive!. We were fortunate during our visit to this Cenote, and there were no divers outside of my husband and myself, and our dive guide. It was beautiful, we loved our time there."
        }, 
        {
            "index": 305, 
            "rating": "5", 
            "review": "The most beautiful cenotes I've seen so far. It was my first visit to Mexico and I have visited a lot of cenotes during my stay, but the nicest ones were those of Chikin-Ha. When I was there with Ocean Tours, we were the only people around, so the atmosphere was very peaceful and quiet. It's very special to go snorkling in the half-open cenote, to visit the underground one, and to snorkle in the open cenote where you might find some terrapins. Really a place to relax and to enjoy nature!"
        }, 
        {
            "index": 306, 
            "rating": "5", 
            "review": "deep down swimming. Great facility; music playing, excellent dressing rooms and a great swim way down in the sink hole. If in the area don't miss it even just to watch the divers & swimmers"
        }, 
        {
            "index": 307, 
            "rating": "4", 
            "review": "Interesting. We visited and saw the cenote and mayan purification ritual as part of a tour. We didn't have time to swim but the cenote looked lovely - you could see some fish through the clear water.The Mayan purification ritual was interesting to observe. They took your picture with the priest which you could buy afterwards - a nice momento but quite expensive at $20.Would advise using mosquito repellant!"
        }, 
        {
            "index": 308, 
            "rating": "5", 
            "review": "Beautiful surroundings and a great learning experience. We learned so much on this tour-and it was breathtakingly beautiful. Highly recommended! My husband was not feeling well-so it was just my daughter and I who went. We both enjoyed it-and would go again on our next visit."
        }, 
        {
            "index": 309, 
            "rating": "5", 
            "review": "a piece of paradise. Haven´t been to other cenotes in the area but visiting Mexico without seeing this paradise on Earth is just not worth! The flora ist breathtaking and swimming with turtles in the cool water is unforgettable. Grab one of the colectivo-vans operating between Tulum and Playa, walk abt 20mins through a forrest full of various butterflies, tarrantulas etc. or simply rent a bike to get there. You won´t regret!"
        }, 
        {
            "index": 310, 
            "rating": "4", 
            "review": "Lots of fun. We all have fun there, it does not cost too much to get in. lots of little fish in the Cenote, they nibbles on your feet."
        }, 
        {
            "index": 311, 
            "rating": "5", 
            "review": "First cavern dives. Great first cavern dive with Mikes. For qualified divers this is a must. It is a short walk from the car park to the easy entry points. It is good dance from the entry point to the exits, so a real cavern experience."
        }, 
        {
            "index": 312, 
            "rating": "5", 
            "review": "Beautiful cool waters. Saw a bat and a turtle, please see main review though, please remember to spray with insect repellent beforehand. Simply a must was beautiful."
        }, 
        {
            "index": 313, 
            "rating": "2", 
            "review": "Tourist trap. Scenery ok but was a tourist trap. Lots of shopping there and the natural beauty was nice. The swim wasn't worth the trip."
        }, 
        {
            "index": 314, 
            "rating": "5", 
            "review": "breathtaking.!!. Seeing the Chitzen Itza and learning about the history of the Mayan and Aztec was amazing. our tour guide named Alfonso from the Sun travel, located at the Ocean Maya Royale resort was awesome."
        }, 
        {
            "index": 315, 
            "rating": "5", 
            "review": "Amazing. This place is so beautiful and we got to swim with turtles in the crystal clear cenotes!! well worth a visit but make sure you wear mosquito spray!!!!!!!!"
        }, 
        {
            "index": 316, 
            "rating": "5", 
            "review": "Must see. Very interesting and had a GREAT tour guide. It was hot and a lot of walking and stairs but well worth it. We actually wen in May but the date on this site didn't go back that far."
        }, 
        {
            "index": 317, 
            "rating": "5", 
            "review": "a must do!. Fabulous snorkeling, the water is refreshingly cool and exploring the cavern and its pass ways via snorkeling is just amazing. Spotted plenty of turtles too. I recommend this place for an afternoon."
        }, 
        {
            "index": 318, 
            "rating": "5", 
            "review": "Underground water hole CENOTE. An adventure to experience the underground fresh water hole called a Cenote there are many around Mexico where the Limestone has cracked and over many hundreds of years made these amazing places. You have a life jacket and snorkle and float around in the clear fresh water looking at what's beneath. Beware of mosquitos which are in their masses and will bite. Take a camera and money for souvenirs."
        }, 
        {
            "index": 319, 
            "rating": "5", 
            "review": "great cenote. this cenote park has several areas- bring bug spay! lots of mosquitos- really picturesque and wont take up your whole day- I like diving and snorkeling cenote so we really enjoyed the easy access and choices this small park has"
        }
    ]
}