{
    "category": "Playa-del-Carmen", 
    "entity": "La-Playa-Xpuha", 
    "avg_rating_stars": 4.5049504950495045, 
    "review_count": 101, 
    "rating_stats": {
        "poor": 0, 
        "average": 6, 
        "terrible": 2, 
        "very_good": 30, 
        "excellent": 63
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "Excellent. Had lunch here as part of our cenote tour with Cancun adventures..excellent food and beach with white powder sand and bar with swings"
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "Gorgeous, gorgeous beach & water!. Can't rave enough about the beautiful beach and water. Enjoyed the shrimp cocktail and drinks at La Playa, excellent dishes, cold beer, and very reasonable prices! They even refund the entrance fee when you show them your receipt on the way out!\nDefinitely worth the drive from Playa!"
        }, 
        {
            "index": 3, 
            "rating": "4", 
            "review": "Xpu Ha Oct 2016. A great location with a spectacular beach. Sadly, the 'free' beach chairs are not the best but, just makes you spend more time in the water. You can pay $$$ for the higher end chairs n umbrella, but not neccessary, in my opinion. Go see the beach!!"
        }, 
        {
            "index": 4, 
            "rating": "5", 
            "review": "Our favorite bech. Save your receipt to get a refund of entrance fees at the gate. Umbrellas and chaise can be expensive in high season. Bring your own chair or blanket and walk a little away from in front of the restaurant. Great cheese fries. Some topless north and south."
        }, 
        {
            "index": 5, 
            "rating": "5", 
            "review": "really paradise!. It's one of the few beaches that isn't a big party and we hope it stays that way. If you drive, enter at the sign that says \"Restaurant\" to park close. The beach club service is terrific (good drinks) and the changing rooms, restrooms, and showers were very good. Take snorkelling equipment...only 75 yards out, you'll find part of the reef. Next time we'll go with a boat to snorkel in more spots. Water was lovely....calm because of the bay. Beautiful white sand. Good for families."
        }, 
        {
            "index": 6, 
            "rating": "4", 
            "review": "Great time at the beach. This past may I went with a friend to play Xpu-ha and it was nice, but not as great as the other beaches I had visited. The beach wasn't as clean when I went who knows maybe I was just unlucky and they hadn't cleaned it as much. The nice thing not too many visitors since it's far from Cancun and some distance from Playa del Carmen. The bar they have there with the swing bar was ok. The price was high considering the quality of the food. It was just alright. If you have a chance visit this beach, but you can do yourself a favor by visiting other nicer beaches."
        }, 
        {
            "index": 7, 
            "rating": "5", 
            "review": "Beautiful huge beach. Lots of spots to walk, sit be alone. Great little restaurant, includes lounge chairs if you eat. Short walk from the highway (collectivo) if you're healthy...it is HOT on that road. A must do if you're in the area"
        }, 
        {
            "index": 8, 
            "rating": "5", 
            "review": "One of the most beautiful beaches, suitable for kite surfing.. I was there last December and it is one of the most beautiful beaches I have visited in Riviera Maya. Waves are stronger than in other neighboring beaches so it is appropriate for kite surfing, among other sports.It is also a great place for snorkeling, plenty of fish and coral!..... however you need to be very careful as there are a lot of big corals near the beach where the water is not enough deep yet so you can hit a coral and get hurt and also hurt the coral.Also, because the coral begins very close to the beach there are risks for you to stand in a coral with barefoot. That will be hurtful for you and the coral. I recommend you to use aqua shoes.You are allowed to install your camping tent and enjoy the entire day there."
        }, 
        {
            "index": 9, 
            "rating": "5", 
            "review": "Surprisingly tasty. I went here with my tour group after we had finished the day's tours. Buffet lunch was including in the tour and the buffet really did not look like much when we arrived. However, looks can be deceiving and in this case they most certainly were. The food was delicious! My favorites were the ceviche, which so fresh and amazing, and the fish tacos. I wish I had both right now. The chicken fajita tacos weren't that good, imo, but that might be because I got the bottom of the pan. My boyfriend went back when they had a new tray, but I still preferred the fish tacos--it's not even close. They were that good! There was also spaghetti at the buffet which I thought was weird but it was also really good. I loved the swing chairs at the outside bar. We did not go to the beach, but it looked beautiful and fun."
        }, 
        {
            "index": 10, 
            "rating": "5", 
            "review": "Outstanding. This beach is a magnificent gift from nature. It is very well preserved and the beauty of nature is intact here."
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "Absolutely stunning!. It's just a place for fun. There are families and couples and singles all together, but it somehow still works that way. There are swings! Hanging at the bar!!! Now, it's not like they are super comfortable, but they are bar swings! If you're at the beach with kids or otherwise not into the bar, a waiter will come to serve you at your lounge on the beach. Pina coladas were perfect!"
        }, 
        {
            "index": 12, 
            "rating": "5", 
            "review": "GORGEOUS!. Incredible beach! Truly amazing. Had so much fun paddleboarding at KSM Beach Club. They have it set up so well! Definitely worth a trip!"
        }, 
        {
            "index": 13, 
            "rating": "4", 
            "review": "Very nice Beach, not that crowded!!!. Hi there,We visited this beach and is located right behore Catalonia & Tulum Resor beach, there are not much freeways signs about it, it has like three different entrances, it is private and the cost is about $50 pesos per person, it it hihgly recommendd because it it not that crowded like other beaches, the color is very awesome. You cna find restaurans, restrooms,etc, all basics.."
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "Love this beach!. This is by far one of my favorite beaches in Playa del Carmen. It is not a walkable distance from the city but a short collectivo ride and your there."
        }, 
        {
            "index": 15, 
            "rating": "4", 
            "review": "The uncrowded beauty of Riviera Maya. One of the prettiest beaches in the area. Playa club de xpuha is a small family run place which has waverunners and kayaks, restrooms and local music on the weekends. Sunday brunch. Yummy."
        }, 
        {
            "index": 16, 
            "rating": "4", 
            "review": "Beautiful. the beach is gorgeous, and beautiful reef nearby, good restaurants and hotels, perfect for a day or a week or a lifetime, I loved it."
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "Hidden jewel. We loved this beach, it was byy mistake we came to this beach, but it was well worth it. Not to many tourists except a few of us. Definitely coming back to this beautiful beach."
        }, 
        {
            "index": 18, 
            "rating": "4", 
            "review": "Amazing and peaceful. Such a great beach, not crowded, beautiful Caribbean blue waters. We ate at the beach club, twice it was great, once they tried to double up on the tip by folding the bill so we couldn't see it was already included. Yes, I asked for my money back, and get it."
        }, 
        {
            "index": 19, 
            "rating": "4", 
            "review": "Great place to swim and enjoy the day in the sun. We had a lovely day on the beach and were able to get there by collectivo bus. It is nice and secluded and the beaches are white sand and beautiful views."
        }, 
        {
            "index": 20, 
            "rating": "5", 
            "review": "Amazing Beach. White sand, crystal clear water, beach beds and beer in this beautiful place will make your day one of the best of your vacations!"
        }, 
        {
            "index": 21, 
            "rating": "4", 
            "review": "Great little beach off the beaten path. We went to Xpuha beach about 10:30 on a Sunday. We primarily came here to snorkel. We first walked over to a beach club, and rented some chairs and an umbrella, but after we ordered food, we didn't have to pay for them. It was a little windy, so the water wasn't really calm, but calm enough. We snorkeled for about an hour and a half, and didn't see a lot of fish, but maybe we weren't isnorkling in the right spots. We still had fun though. By mid afternoon, the place got really busy. I'm guessing because it was a Sunday, as it seemed like a lot of locals were there. Just a tip, DO plan your ride back to your hotel in advance. We couldn't find anyone to help us call a cab, and were told that we were going to have to walk all the way out to the highway to flag down a cab back to our hotel. Luckily, my husband spotted a cab dropping off some people, and we were able to get a ride. All in all, we really enjoyed our day. "
        }, 
        {
            "index": 22, 
            "rating": "3", 
            "review": "Good For A nice Day At The Beach. Day Off is one of those things you can't waste so when we want a good beach day, we go to \"La Playa\" in Xpu-Ha, the food is always good, credit card is accpeted, you can rent a palapa with chairs and table if you bring your own food, the beach is fantastic a the ocean is great, the service is slow and is very difficult to get the attention of a waiter every time we go, but it's the only down side to this great place."
        }, 
        {
            "index": 23, 
            "rating": "5", 
            "review": "Day at the Beach. The beach was so beautiful. We loved the good food and service at the Bonanza. One direction, there was sand and the perfect place to swim with fish. In the other direction, there was a remote area to beach comb and soak in the view."
        }, 
        {
            "index": 24, 
            "rating": "5", 
            "review": "A Local secret. Best beach . No high rises or busy commercial areas. Not crowded, three little rustic beach bars, sand floors. About 10 min. south of PA. They charge 45P/each at gate for entrance then if you eat at beach bar will refuund back at gate with receipt. Can rent palapas and chairs nominal, sometimes they don't chg if eating there. Live music in afternoon Thurs-Sun. Can take collectivo from Playa and walk in from Hiway about 20-25 min walk on dirt road. Great for swimming all sand."
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "Awesome beach just south of PDC. We escaped our massive all-inclusive resort to spend a day at this wonderful beach. We spent 8 hrs sipping Bohemia's while enjoying the beautiful water and beach with my family. Prices were fair for drinks and food and entrance fee is refunded if you spend enough at the restaurant. Great place to spend a day or two maybe!"
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "Best Beach. This is the best beach location! We go here every year when we visit Mexico. The beach is calm enough for our 5 year old and the amenities surrounding it are enough that we can hang out all day and be taken care of. "
        }, 
        {
            "index": 27, 
            "rating": "5", 
            "review": "Loved it!. Beautiful beach, but I guess it changes on a daily basis, because one day we went and it was like a pool, clear and just beautiful, we loved it so much that we came the next day and waves were a little stronger and there was a lot of seeweed, so it just depends. But I would definitely come back to this beach.,"
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "Great reef. Beautiful reef but there was a lot of surge so there were not huge numbers of fish. On a calmer day there are more fish. You drive in through private property and they charge you 3 bucks a person to get in. There is a restaurant with facilities. Never a lot of crowds here so its a great place to get away to a secluded beautiful beach."
        }, 
        {
            "index": 29, 
            "rating": "5", 
            "review": "A Hidden Gem in the Mayan Riviera. We have been to many beaches in Cancun and the Mayan Riviera area and I have to say that, in my opinion, this is by far the best beach in the whole area. The water is crystal clear, cerulean color, the sand is like flour and best of all, it is not crowded. You truly get that Caribbean feeling that many of us so long for.Yes, the few beach clubs in the area are tourist traps, but we found La Playa to be just fine. Food was decent, service was very good and I don't think that paying $55 for food, drinks and beach lounges all day is an unreasonable price, especially for the kind of beach experience you get. I have paid a lot more for subpar experiences.As mentioned above, the water here is beautiful with minimal seaweed. There is also kayaks available for rent ($200 mxn/hr) and trips to the close by reef for snorkeling. I snorkeled in an area that was closer to the beach and although the marine life was not spectacular, I did see a lot of live coral and it was certainly worth my time. Xpu Ha is a hidden gem and I would highly recommend spending a day there. In fact, we liked it so much we went two days in a row!"
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Beautiful and fun. The restaurant was so fun. They had a taco buffet, and a Caribbean band. The beach is one of the most beautiful I've ever seen. Definitely a locals attraction, and a fun place!"
        }, 
        {
            "index": 31, 
            "rating": "1", 
            "review": "90+ waiting time for snacks is not acceptable. And then charged more on the check. I live in Playa del Carmen and have on 10+ occasions taken friends and visitors to Playa Xpu-Ha Restaurant. Service is always so-so, and prices are not cheap. The time before this I was charged 2700 twice on my credit card and had to fight with the bank to get back the money. This time around, we came in around 12.45 and ordered drinks. Drinks came in very quickly and they took our order of snacks: nachos and 3 x quesadillas. By 2 PM our stuff hadn't arrived although I had asked the waiter three (!) times for it. Everytime he said \"I will bring it shortly\", except the last time when he said \"what, no one brought it out to you?\". By 2.15, 90 minutes after ordering I just told the manager to cancel the order to which he wanted to check \"what had happened\". Kids (and I) were hungry and asked for the check. It took another 10-15 minutes to get the check - no excuse or so. Oh behold, they had added more items on the check so I had to send it back! I will NEVER ever bring people back to this restaurant, and I will do my best these guys either change management and waiters or go out of business by going on every single online forum for tourists. They are fraudulent, rude and don't give any good service.You might ask why I come back? Because the beach is beautiful, but now I have seen it to last a lifetime."
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "Walked this Beach. Beautiful (Out of the way) beach....locals favorite!...Turtles leave the ocean and lay their eggs here on the beach and 46 days later baby turtles appear from under the sand to scurry back to the ocean....helpful locals and tourist ensure with assistance that each baby-T makes the travel to the ocean....most wonderful experience!"
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "The hidden jewel of Riviera Maya. Amazing place and those guys at KSM are great, nice music, nice food, they rent paddel and kayaks, the atmosphere is perfect for a full day at the beach."
        }, 
        {
            "index": 34, 
            "rating": "5", 
            "review": "best beach!!!!!. a frind of us recomended us this paradise...we loved this place, ad we stayed a long time!!!!!! there were some places ti eat something"
        }, 
        {
            "index": 35, 
            "rating": "5", 
            "review": "Great little beach club. We love to visit beach clubs outside of Playa when we want some peace and quiet, and this place fits the bill perfectly. We went with friends who had a rental car this trip, but the walk from the highway wasn't too bad, so we will use the local colectivos next time. Prices were excellent and the food was very good. A little cheaper than the beach clubs in Playa. We rented two plastic tables and 6 chairs for about 200 pesos in food consumption, no problem. We paid 40 pesos per person to get in, and got that back when we left with our receipt. The water was beautiful and there were hammocks, nice bathrooms and lounge chairs (I think those were an additional charge). The service was very attentive for this area and we enjoyed our day here."
        }, 
        {
            "index": 36, 
            "rating": "4", 
            "review": "Pretty but pricey. Spent a day here on our recent trip to PDC. First time to Xpu ha. Nice beach but pricey on loungers foods and drinks. Have spent time at other beach clubs for less and had better service. Food was good but will not probably be back due to prices, no value compared to places like Lido in PDC or Playa Pariso in Tulum"
        }, 
        {
            "index": 37, 
            "rating": "4", 
            "review": "Still my favorite beach even after 25 years.. The beach bar is great and so accommodating with padded lounge chairs and umbrella to rent for the day. The waitstaff is wonderful, especially Cesar, who made us feel so at home! There are bathrooms and showers for public use which is great if you plan to spend the day. The swimming here is exemplary because its located in a semi-protected cove. There are a couple of eerily abandoned resorts that I would have loved to have explored but are closed to the public and guarded by the government since they must own these now by default. There is an incredible cenote (Casa) that opens to the sea, that used to be accessible from the beach, but is now part of the property being guarded. We came by van from Playa del Carmen with no wait for a pick up. I plan to return when next in Playa."
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "Secluded Oasis - XpuHa. Looking for a beach off the beaten trail? Check out Xpu Ha. Beautiful views, idyllic setting and beautiful beach. Easy going, casual atmosphere located south of Paamul, look for the KLM sign northbound on 307. There is a not a better way to spend an afternoon. Sit back and relax in one the many available beach chairs, grab some light eats & beverages from the bar and let the afternoon just do it's thing. You won't have to do anything at all, but be a part of the beauty. There is snorkeling, kiteboarding, fishing or as I did chilling. Feels pristine and out of the way like you stumbled on to your own little world. If you visit you will be glad you did. There is an entry fee, no worries, it's worth every peso ($100 pesos for two or $50 peso per person)."
        }, 
        {
            "index": 39, 
            "rating": "4", 
            "review": "Nice beach, great swimming, better snorkeling than Xel-Ha. It was a lovely beach and the snorkeling is quite good here. We were surprised. It was a bit more crowded than we expected, but we found a quiet spot. You don't have to pay for the beach if you stay away from the resorts and beach clubs, but as we found out you have to pay for beach access. The price depends on what street you go down, so that kinda sucks. Also it is very poorly signposted from the highway so pay attention."
        }, 
        {
            "index": 40, 
            "rating": "4", 
            "review": "Nice beach, Nice water, paddle boards for rent. 300 peso min per person for drinks and food. A cute off the path beach that's really hard to find. Drinks were good, they do a horrible job explaining The Game: it's 300 pesos per CHAIR to sit. If you don't use a chair....just dump your towels on the sand. Or get a couple drinks, that were good and like $8 each (18:1 exchange rate) There's a restroom and showers and a hotel.Snorkeling was SAD and not worth it."
        }, 
        {
            "index": 41, 
            "rating": "3", 
            "review": "Beautiful beach but food left a lot to be desired!. I had mixed feelings about this place. The beach is quite nice, but it is quite nice in this entire area, so there are probably better options. The entry via access road cost 40 pesos per person, which isn't horrible vs other places I've been. The place was very crowded when I visited, but it was during the Easter holiday so that was to be expected. parking was a slight challenge but not as bad as it could have been. We arrived about 11am but on the way out, I noticed many cars parked well outside the main parking area that had obviously arrived later than we had. Sure glad we didnt get there even 30 minutes later since that would have been a very long walk in the heat!Upon arriving on the beach, we set our things down at a double table with 6 chairs underneath an umbrella. This was going to be temporary while I searched out a better spot, but I quickly realized that this was the only spot underneath shade remaining. So, we took it. None of the lounges at this place are under shade, which seems bizarre. The table & chairs we had were sufficient. There is a nominal charge unless you spend some $ to eat drink, which we did, so there was effectively no charge to use them. This is how it SHOULD be at a beach club but i noticed several clubs now charging for seating IN ADDITION to food, which is a joke and I will avoid this scam at all costs!The kids and adults had a lot of fun on the very nice beach here. But sadly, the food left quite a bit to be desired. We ordered their seafood platter and a whole fried fish. Not only were the portions not as big as expected, most of the food just was not that tasty... quite bland, which is a bit weird cuz this place seems much more frequented by locals rather than tourists. The worst part was that the seafood platter, which included Lobster, Shrimp, Fish & Octopus, was quite light on Lobster (somewhat understandable) but VERY light on shrimp with only 4 pieces. A decent amount of fish but it wasn't good, and a TON of Octopus, which only 2 people in our party would eat, so most of it went to waste. This was a platter meant to serve 3+ people but in all honesty, the decent part of it could barely feed 1 adult adequately. Needless to say, we left hungry at around 4pm and took an early dinner back in Playa.One thing about this area that I am unsure of is this... upon arrival at La Playa, I realized that there were a bunch of beach clubs on this beach, contrary to the maps, which really only show La Playa. I'm not sure if this parking area is only supposed to be for La Playa, but it doesn;t seem so given the immense amount of cars and somewhat limited space in front of their restaurant. After having their food, I had wished we tried another place, but maybe next time. Service was decent enough, but the food part is a deal breaker for a return visit from us."
        }, 
        {
            "index": 42, 
            "rating": "3", 
            "review": "Very windy. Not good for small kids. Not really a family beach. Best suited for those wanting a meal/drink on a beach or for those wanting to try kite boarding."
        }, 
        {
            "index": 43, 
            "rating": "5", 
            "review": "very charming, hip beautiful beach. Not the easiest to find, just north of Akumal, but worth finding it. Beautiful waters, white sands, and funky bars and restaurants, bathroom facilities etc, locals use this beach as well as ex pats in the know, more than touristic beaches nearby. Loved this place"
        }, 
        {
            "index": 44, 
            "rating": "4", 
            "review": "Great option for a beach day. Me and my family and friends have been going to this beautiful cove, Xpuha, for 12 years and Restaurant La Playa is the best option. They 've updated the place constantly, providing everything one may need. Hammocks, waverunners, brand new bathrooms with nice changing rooms, proper showers, toilets, etc.There's good, safe-food, ( the whole fish being our favorite dish), friendly waiters and a nice family friendly environment.We've tried other beach clubs but this is just it!!For those who like it, they have a band playing on weekends (we rather listen to the braking waves :-)Bravo!!"
        }, 
        {
            "index": 45, 
            "rating": "4", 
            "review": "Restaurant is SLOW!. The beach is spectacular but try to visit on a weekday as there are LONG wait-times for food from the restaurant on weekends."
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "Great quick getaway. Living in PDC I highly recommend coming here to visit as its a quick 20 min away from PDC. Beautiful beaches, good food, and a nice, relaxing time vs the hustle and bustle of PDC beaches at times :-)"
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "Piece of paradise. if you dont mind to walk a litle bit, you can find a perfect place to stay without all the caotic pleople around. White sand and turquoise water. The best 40 pesos spent just far away 20 min from playa. Go by colectivos."
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "Welcome to the paradise. This beach is bery nice ( different from Playa Del Carmen)One of the best between Playa Del Carmen and Tulum.Ideal place if you wanna kite surf.Enjoy it !"
        }, 
        {
            "index": 49, 
            "rating": "4", 
            "review": "Becoming commercial. It did not take too long for Hpu-ha to start being more commercial. There are at least two outfits that were not there last year but there is still tranquility at the north end where good snorkeling is. One should visit the day when the winds are calm because the sea is shallow and the waves pick up sand making water murky. All in all is still a place to visit but may not be for long."
        }, 
        {
            "index": 50, 
            "rating": "4", 
            "review": "Beautiful Views While enjoying an Adult Beverage. I've been to this beach many times with my husband alone, my friends and with our whole family. I love the bar with the swings and as the evening rolls in a live band makes it a fun party atmosphere. A few years back I contacted the restaurant there to have a surprise party for my husband, they never got back to me. I've never eaten at this restaurant but felt it would be a super location for a party. I guess they have enough business? The beach is clean and mostly a family collection, so I felt safe. I understand that they need to maintain the location, but the fees to park seem to fluctuate according to how much the attendants need to refresh the cervesa in the cooler or maybe other reasons. I live here and every single time I have gone there, the \"parking fee\" has been different and not in any upward trend. Up, down, up, up down. They should post their parking fee at the entrance so there's no suspicion ( which there is)However, the bar with the swings is awesome and the bar tenders are always friendly and chatty. It's a great, safe place to go. Enjoy."
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "Beautiful drive down the cost line. We found this little spot cruising down the coast line looking for things to do. It was great because while we drove, our daughter got in her nap, and by the time we found something awesome to get out and explore she would wake, and be refreshed to enjoy the great beaches, and spots we'd find right off the main Hwy."
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "ksm beach club. the KSM beach club was wonderful the food was great and the bbq on sundays is to die for the staff mostly speak Spanish but try real hard to communicate there are a few that speak some English I spent the first few days of my trip at glamping right behind the club .the beach is beautiful they have great music and great staff I kept going back on the combie (Mexican van bus that's cheap ) to the club and beach a must see and experience"
        }, 
        {
            "index": 53, 
            "rating": "4", 
            "review": "Shhhhh, don't tell anyone about this place.. A little gem of a place. Take a collectivo from PDC for thirty pesos, tell them you are getting off at playa \"shpu ha\". You'll see a rope across a road and a guy under a little hut. Pay him forty pesos each and he'll give you a ticket. Keep it and don' t loose it. Make your way down the end of the road for approx ten minutes. Once there, enjoy and awe at the beauty. There's a beach bar club that you can rent chairs and tables. The wooden loungers are pricey. You can get the curved plastic ones for free if you consume 120 pesos of food and drinks. Beer is reasonable, food is so so. At the end of the day, if you used the club, pay your bill (they take credit cards with a piece of id) and keep your receipt. When you get to the front gate by the highway and over the guy the tickit he gave you and your receipt from your food and drinks and he'll refund you the frothy pesos you paid earlier in the morning to get in. So a free chair and your admission refunded for 120 pesos of beach club tab.A great day in a picture perfect setting for beach bums."
        }, 
        {
            "index": 54, 
            "rating": "4", 
            "review": "Really nice beach . Great beach if you are looking for something more quiet than Play Del Carmen. Water is crystal clear. Decent restaurants with your usual beach food."
        }, 
        {
            "index": 55, 
            "rating": "4", 
            "review": "Playa Xpuha, Jan 2016. Many visits to this beach as the beach is gorgeous. White sand for ever! Beach chairs are not the beach unles you pay 250 pesos for u brella and loungers. Otherwise they tables and palapas to use, no charge. Food is consistent...not great but edible. Prices moderate and service good as well. Again, great beach."
        }, 
        {
            "index": 56, 
            "rating": "3", 
            "review": "Great beach area!!. Warm water, soft waves, and shaded area with beach chairs and umbrellas. There are restaurants and the area where you can order favorites such as aguachile, ceviche, hamburgers, tacos, etc."
        }, 
        {
            "index": 57, 
            "rating": "5", 
            "review": "Awesome beach, crowded on Sunday afternoon . After missing the entrance once we finally found it just beyond Hotel Barcelo. You pay 40 pesos, children too, and drive down a long driveway. The car park was full and parking was on driveway. I was a bit put off by the very smelly piles of rubbish and the stench of the toilets as we walked through the beach access. The live music had drawn the crowds and it was packed around the beach club. We walked up the beach to a slightly less densely packed area,where the sea weed had not been cleared. There my complaints stop. The beach has the most beautiful blonde sand with pink freckles and the sea is turquoise and crystal clear. Wow. There are minimal waves and it is shallow for perhaps 30m so it seems very safe. We could see some fish swimming around us and there were snorkelers further out. Come with a picnic and idle a day away here. Awesome."
        }, 
        {
            "index": 58, 
            "rating": "3", 
            "review": "Best beach near Playa Del Carmen. Lovely white powder beach, nice chairs and umbrellas to rent. The restuarant serves a decent variety of foods, from ceviche to burgers. The food isn't the best around but the beach is. Live Latin music on Saturday and Sunday and only 20 mins south of PDC by car."
        }, 
        {
            "index": 59, 
            "rating": "5", 
            "review": "Beautiful. This is a very lovely beach that you should defenetly visit, the sand is white and fluffly and the water crystal clear."
        }, 
        {
            "index": 60, 
            "rating": "5", 
            "review": "JEWEL!. We 1st visited this beach in the 90s when it was a camp ground -lol...now they ave built several billion $ resorts around it. The beach is amazing ....pristine sand and 9 shades of turquoise to the ocean. A must see if you are a beach dweller. Viva Mexico !!"
        }, 
        {
            "index": 61, 
            "rating": "5", 
            "review": "Mr. Awesome place love the beach very quiet have time just to soak in what mexico is all about with family and friends. The pink sand is incredible and for the most part very calm"
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "My Favorite Place!. \"La Playa Xpu-Ha\" I am a frequently visitor here! My favorite dish is the ceviche!The road is private the family who owns it charges you 40 pesos per person, which you are entitled to ask for a refund if you spend more than 200 per person on the beach club. That is not hard at all, they have beach beds for rent available and you can also take any of the tables free of charge. The food is very good! The quality is incredible and the prices are fair.The things to try are the ceviche, the shrimp tacos and the coco fizz."
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "Excellent food and a beautiful beach. We stopped here on our way back from Tulum and they had a buffet lunch set up for our group. It was delicious - especially the ceviche! After lunch we had time to relax on the beach. The sand was the softest I've walked on and the water was nice once you got past the seaweed gathering at the shoreline. I wasn't impressed with the gift shop, but I would go back for the ceviche anytime!"
        }, 
        {
            "index": 64, 
            "rating": "4", 
            "review": "Our favorite beach. This is our (and our neighbors) \"go to\" beach and we live here! Make sure you get your receipt and turn in the unused wrist bands at the entrance for a refund."
        }, 
        {
            "index": 65, 
            "rating": "5", 
            "review": "Lovely non touristy beach-please don't go!. this is a lovely very unaffected beach. Not many tourists know about it and hence it's not heavily populated. Many locals. water is lovely and the beach is white and soft...just like the postcards. Please don't go-let us continue to enjoy it without the hordes of tourists:)"
        }, 
        {
            "index": 66, 
            "rating": "5", 
            "review": "One of the best beaches around. For me one of the most beautiful beaches i've been so far. Crystal clear waters, big enough so there's not a lot of people even if it is high season. The entrance is around $20 or $50 mxn depending on where you go in. There are a couple of restaurants and bars but you can also bring your own drinks and food. Is perfect for being all day long, taking long walks, renting some boards for stand up paddle because the water is always really calm. There is a reef where you can snorkel and an abandoned hotel, so is a beach with a sort of mystique that everybody loves."
        }, 
        {
            "index": 67, 
            "rating": "4", 
            "review": "Beautiful. Serene and away from the hustle and bustle of tourists. This quiet beach allows your to feel like you can enjoy the beach without all the crowds. No loud techno music just the beauty of the sea and warmth of the sand."
        }, 
        {
            "index": 68, 
            "rating": "5", 
            "review": "tranquilo. tranquilo is relax in spanishits beautiful quiet beachfor some pepole too quietfor me i feel like in amazing caribian movie"
        }, 
        {
            "index": 69, 
            "rating": "4", 
            "review": "PARADISE. Been there for lunch with friends and the place is so natural and beautiful. You do not pay to park your car if you consme in the restaurant. Kind of rocky the shore but still great!!"
        }, 
        {
            "index": 70, 
            "rating": "4", 
            "review": "A Great Beach. A great beach about 25 minutes south of Playa del Carmen by the Collectivo vans. Make sure you announce to the driver where you want to get off. It does involve about a 5 minute walk to the beach after you get off the van and a 40 peso fee to get in (refundable when you spend 120 peso or more at a beach restaurant). Nice clear water and a great beach. There are several beachside restaurants where you can get food and drinks"
        }, 
        {
            "index": 71, 
            "rating": "5", 
            "review": "perfect !. Really nice beach, no rocks , almost no seaweed, nice coral, very nice restaurants around.\nPerfect water color!"
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "It should be the first Blue Flag Beach in Playa del Carmen. No seaweed, no rocks, awesome snorkeling on top of corals and lots of fish, showers, toilets, a great diving shop, live music by the tiny restaurant, and nothing else needed. Tips: don't carry a cool-box, as they charge 100 MXN per person, for all the persons using it! Buy their beer, it's a bucket of 6 beers for 150 MXN. If you eat there, ask for the bill and you'll be reimbursed like 70-80 MXN out of the total paid as entrance fee. Visit the local tienda, as it has many wonders for sale. If you visit during the hatching season, you'll see teensy-weensy turtle babies being helped to find their way to the sea. Prepare to spend there a whole day, and you will not regret it!"
        }, 
        {
            "index": 73, 
            "rating": "4", 
            "review": "Great beach. This is a really beautiful beach which is great for families, couples, or lone wolves. The beach is public which means free and on a nice sunny day its a little slice of paradise."
        }, 
        {
            "index": 74, 
            "rating": "3", 
            "review": "Amazing beach. The amazing beach here is the reason to visit. If on a weekend, good live cuban/latin music. The food is OK. The service on weekends is slow, during the week some better."
        }, 
        {
            "index": 75, 
            "rating": "5", 
            "review": "LaPlaya Xpu-ha !!!. Cozy, local establishment! The food was very good and the music and scenery was perfect too. Beachfront was inviting"
        }, 
        {
            "index": 76, 
            "rating": "5", 
            "review": "Great Private Beach. Definitely worth the trip to find. A private beach with very few people there, nice waves, but still calm enough, great place to rent a wave runner and get out."
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "Nice beach!. Nice beach away from the crowded cities, there is a restaurant where you can buy drinks and food. If you would like more secluded location try Xcacel, its a federal protected area, enjoy."
        }, 
        {
            "index": 78, 
            "rating": "1", 
            "review": "Do not waste your time. Would never go again. The charge for everything. Next they will charge for the view. We paid to get into the place then they wanted us to pay to use the tables. We were going to order but instead just left. It used to be nice but not anymore."
        }, 
        {
            "index": 79, 
            "rating": "5", 
            "review": "One of my favourite beaches on the Riviera Maya. One of the finest beaches on the whole of the Riviera Maya, unspoilt and definitely worth a visit if you are staying in the area."
        }, 
        {
            "index": 80, 
            "rating": "5", 
            "review": "Best beach. Lovely And Peaceful. Great snorkelling. Not too many people. Sargasso was not too bad that day but it Hans had an impact for sure"
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "Great Beach Bar With Local Feel. Came here for lunch on a Cancun Adventures tour and loved it! The view is phenomenal and the place is off the beaten path and is not crowded whatsoever. When you imagine an authentic Caribbean bar-this is the spot! Great food, drinks, music, and views. What else could you want?!"
        }, 
        {
            "index": 82, 
            "rating": "4", 
            "review": "A lazy day on the beach.. A beach located on one of the largest natural bays in the Riviera Maya, wonderful to stroll and to swim. Bring your snorkeling gear as you can find a few interesting coral heads close to either the south or the north tips. If you want to be confortable, bring a cooler with plenty of drinks and snacks and a shade so you can enjoy the day."
        }, 
        {
            "index": 83, 
            "rating": "5", 
            "review": "Best Beach!. We lucked into this wonderful beach. The water is so clear. Drinks were great. Fun live music and best of all there were no crowds. This is a must for anyone visiting the Playa area. We had some snacks right under our umbrella. Great snorkling area as well. And no seaweed!!!"
        }, 
        {
            "index": 84, 
            "rating": "5", 
            "review": "Beach Bliss. Beautiful beach and coastline here. Nice little beach bar with lounges and on some time life music. Food is good. We had the whole fried grouper and beers are cold. Margarita is good as well. Service Friendly. We spend time at here everytime we are in the Riviera Maya."
        }, 
        {
            "index": 85, 
            "rating": "5", 
            "review": "Locals will hate me for this.. What a wonderful place. It's our go to beach for fun in the sun. Turn in at the Jet ski by the road, pay your 40mp, enjoy some refreshments on the beach or at a table, get your computer receipt and return the bracelets to the gate for a refund.BUT...The Ex-pats will be the first to tell you to avoid Xpu-Ha. We want to keep it a secret. Don't tell anybody you heard it from me."
        }, 
        {
            "index": 86, 
            "rating": "4", 
            "review": "off the beaten path. We came here as part of Cancun Adventures tour, and really enjoyed the clear water and nice beach. I wish we would have had a little more time to explore."
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "Most Beautiful. This beach is a hidden gem. Sugar soft sand, the clearest water I have ever seen, and a little reef you can snorkel to and explore. BEST.DAY.EVER!!!"
        }, 
        {
            "index": 88, 
            "rating": "5", 
            "review": "Perfect spot for chill with actions and great food. This is the place to be. So we learned that all playa del carman beaches are public so you can walk and sit anywhere. This restaurant has excellent real Mexican foods n drinks with nice beach sitting area. Beach is clean, with naturally some seaweed. It's law to not remove the seaweed. There's attractions for water sports nearby..we plan for our next visit to be sure to book our resort near here for walking to. We booked a \"Cancun Adventure\" tour with Gabo for Tulum ruins and cave swim, they brought us here for lunch! Best day trip ever!"
        }, 
        {
            "index": 89, 
            "rating": "5", 
            "review": "find quiet place to relax on saving budget mode , off the people of playa. the locals will charge you entry fee 50 pesos , so you can use showers and bathrooms, if you have your own supplies of food and drink pay up is your option ,, if you plan to rest on the beach and have a bar tap for all day you skip that 50 pesos and use facilities of locally bars. No fansi equipment . the view is fantastic manage to see tulum ruins"
        }, 
        {
            "index": 90, 
            "rating": "4", 
            "review": "Lovely beach. We got a taxi from hotel. Paid about 40 pesos to enter which we received back by saving our restaurant slip showing we had spent at least 120 pesos each at the restaurant which was excellent."
        }, 
        {
            "index": 91, 
            "rating": "5", 
            "review": "Fantastic swimming beach!. Playa Xpuha is one of the very best beaches for swimming located between Akumal to the south and Puerto Aventuras to the north on HWY 307. To access the public entrance coming north from Akumal you enter at the southern end of the beach. There is a per person charge for parking. The entry fee is perfectly worth the money spent to access the white, soft sands and crystal clear turquoise water of Xpuha. You will find beach chairs for rent, a small bar/resturant and a kite surfing operation here. This beach is one of my favorite places to spend a lazy day walking the beach and swimming."
        }, 
        {
            "index": 92, 
            "rating": "4", 
            "review": "xpu ha. nice public beach with awesome sand and great for long walks, a nice little cantina/restaurant that has great fish and shrimp tacos. south end of beach is a deserted resort and virtually on your own, the point on the far south end has a breathing fissure that spouts wave water. parking access is a few pesos, but make sure you do not get stuck in the sand. if you show a meal and drink ticket purchase you get your access fee back."
        }, 
        {
            "index": 93, 
            "rating": "4", 
            "review": "Beautiful beach, beach clubs are a pain.. The beach is stunning, amazing clear water, lovely sand, the entrances from highway are closed off with a chain and you need to pay to get in and supposedly get refunded if you spend a certain amount at the beach club. The beach club is about 25 U$ a person for the chairs and umbrella, the food is ok, nothing great. Take your own umbrella and beach towel, there isn't really any shade and save yourself the beach club hassle unless you want to spend it all on drinks."
        }, 
        {
            "index": 94, 
            "rating": "5", 
            "review": "Beach paradise in paradise. The most gorgeous beach we have ever been to. We rented a car and drove there from Playa. The entrance is hard it find and you will have to pay an entrance fee to get bracelets and park your car. There is very limited parking so get there early. There are small restaurants and bars on the beach."
        }, 
        {
            "index": 95, 
            "rating": "5", 
            "review": "Love it. Just a beautiful place!! The entire area is beautiful, good restaurants, places to stay, to rest and relax!"
        }, 
        {
            "index": 96, 
            "rating": "5", 
            "review": "Beautiful Beach. Stopped here for lunch...good food and very friendly staff...beautiful beach!! Excellent value!! We would highly recommend this beach."
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "Beautiful. Xpuha can be hard to find. Its on the highway south towards Akumal, and you need to look at a map and know where to enter. There are several small beach clubs where you can drive in and park, or if you go by combi you can easily walk in. It's a quiet, relaxing, beautiful beach and in some places you can pay a fee to bring your dogs, in other areas it is frowned on. There's an RV park and I always found that if I had leashes and paid a fee I was allowed to park and take my dogs walking as long as they were under control and well behaved."
        }, 
        {
            "index": 98, 
            "rating": "5", 
            "review": "Crystal Clear Water. Quaint and out of the way. Loved it. Beautiful water and not crowded. Just what I needed. Looked like a Corona commercial."
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "\"Perhaps the Best Beach in the Riviera Maya!\". Xpu Ha beach is spectacular, with no rocks, easy entry into the aqua-emerald colored Caribbean waters, light waves and crystal clear waters due to one of the largest fresh water cenotes, \"Cenote Manati,\" that feeds crystal clear water into Xpu Ha Bay. The sand is pristine, champagne color. This beach often hosts photo shoots for \"Corona\" beer commercials, calendar for football cheerleaders and fashion photo shoots. The area is super private and the beaches are uncrowded with a few boutique hotels, private villas and estates, and a small all-inclusive hotel. There is also a activity booth at the far end of one of the beach areas where you can rent a \"SUP\" board, kayak, or other activity. Xpu Ha beach is just 15 minutes south of Playa del Carmen and 1'10 from the Cancun airport. Maria Knows Mexico!"
        }, 
        {
            "index": 100, 
            "rating": "4", 
            "review": "Xpu Ha is a special beach. Long walks on very nice sand.... Have been here many times. Over 8 years. Cheleo and his people are good at entertaining us.Good restaurant/bar on the beach. Feet in the sand if you want. If costs30-40 pesos per person get into the property. Long story about why... Pay it and get it back if you spend some pesos at the restaurant..The sand on this beach is SO NICE. Promise you will love it.No stairs or elevators. All on the ground ...."
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "Excellent Local Beach Club. We arrived and it is 40 pesos per person to get in and covers parking. If you spend 120 pesos and bring the receipt you get this returned to you. We went on a Sunday. There were very few tourists mostly locals which was great. They have continuous live music Thursday through Sunday. The beach was excellent and they had a great variety of water sport rentals at a reasonable rate. The restaurant had a varied menu. We had a pina colada and a tequila sunrise which were very good. The service was great for a beach restaurant and they did not push you to buy anything. We had chicken wings and they were well prepared. The water was like glass so great for snorkeling. diving, kayaking, stand on paddling or jet skis. All of these can be rented there if you do not bring your own. The day was very pleasant and look forward to going back again. It is about ten minutes south of Playa Del Carmen and 200 meters south of the hotel Catalonia Royal Tulum. The 80 Pesos we paid to enter was returned when we left with no problem."
        }
    ]
}