{
    "category": "Playa-del-Carmen", 
    "entity": "Barcos-Caribe", 
    "avg_rating_stars": 4.5083798882681565, 
    "review_count": 179, 
    "rating_stats": {
        "poor": 0, 
        "average": 14, 
        "terrible": 2, 
        "very_good": 52, 
        "excellent": 111
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "4", 
            "review": "They do a Good Job. There are three different companies. The Barcos Caribe are really top notch. It is about a 30 to 35 minute ride form Playa, at the Quinta, to the dock at Cozumel. It is very inexpensive and a nice service. Somethings the water is rough, so plan your day accordingly. Watch your weather reports. The service is good. The people are friendly. The boats are clean."
        }, 
        {
            "index": 2, 
            "rating": "4", 
            "review": "quick trip. Quick and efficient transportation to Cozumel. Ride was a little rough the day we went but the service was good."
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "Good price, smooth ride. Only a couple to choose from, and this is the cheaper of the 2. Be sure to talk to the street sellers before booking, they can often offer you a cheaper price. $17us/$275mx roundtrip"
        }, 
        {
            "index": 4, 
            "rating": "3", 
            "review": "Major seasickness but clean boats. The quality of the boat was fine and clean. However, due to the waves and rocking of the catamaran, I got massive seasickness going to Cozumel."
        }, 
        {
            "index": 5, 
            "rating": "5", 
            "review": "Very organized staff & fun ride (really rocky for anyone with motion sickness). We landed in Cancun and were destined for Secrets Aura Cozumel. We had booked the hotel transfer through Amstar DMC. The transfer included a shuttle to Playa del Carmen followed by the ferry to Cozumel and then a 20 minute taxi to arrive at our destination. We took the 9 pm ferry in the month of October. It was a full moon that night and it was beautiful reflecting on the water. The Barcos Caribe staff took our luggage in a very fast and organized way and supplied claim tickets. The staff members are professional. They are all buttoned up in uniforms. They offer everyone something to drink before sailing. There is a video series that provides safety info. After that there is a funny video series aimed at tourists by EMCEE Oscar. He's always next to a bikini-clad babe and they show you the tourist attractions on the island of Cozumel. ;) It kept us entertained for the 30 minute ferry ride.The only thing that was hard on me was that the water was rough that night and the boat was rocking and reeling. I would have fared better with some dramamine. We took the ferry twice more during our week long stay. The other two times were less rocky during the day. The ferry costs about $8 per person/each way. A bell boy at our resort advised us to purchase one way tickets each ride (instead of round trip) because sometimes the time slot that you want back will be provided by another carrier. He told us they won’t always honor tickets from the other carrier."
        }, 
        {
            "index": 6, 
            "rating": "4", 
            "review": "Good service, cheaper than Ultramare. Several providers of ferries between playa del carmen and Cozumel. Barcos caribe is certainly cheaper than Ultramare and provides the same service, we travelled with both several times. Save yourself some $$. Barcos caribe feels more local, Ultramare a bit shinier and tourist orientated. Both have onboard bars."
        }, 
        {
            "index": 7, 
            "rating": "5", 
            "review": "EXCELLENT, FAST, SERVICE!!!. they fast, boat ride was smooth an the air conditioner work great inside...so we took a nap...woke up at the dock....the boat does rock when u sit on the upper deck. but they all do.."
        }, 
        {
            "index": 8, 
            "rating": "4", 
            "review": "Ferry to and from Cozumel. We enjoyed riding the ferry to Cozumel Mexico on one of our excursions. It was a peaceful ride.We were given our tickets and when it was time to board you were able to sit wherever you wanted - it was not crowded at all!"
        }, 
        {
            "index": 9, 
            "rating": "5", 
            "review": "Wow. By taking this ferry you have a 30 minute ride to and from Cozumel.This ferry has a bar and air conditioning and it only cost 10.80 US each way.You take this ferry from Playa Del Carmen.Ask anyone for directions."
        }, 
        {
            "index": 10, 
            "rating": "5", 
            "review": "Cozumel Trip. Used the ferry service from Playa del Carmel to Cozumel. Service was great and ferry was clean. Good journey across. Cheap way to do it your sel trip"
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "Reliable, comfortable, and fast. Great service through this company. We needed a ferry to Cozumel and found this one by word of mouth. The boats are clean, fairly modern, and comfortable. The ride just flies by. Note, if you or someone in your group has a local resident card, the price will be half of what is typically offered to tourists."
        }, 
        {
            "index": 12, 
            "rating": "4", 
            "review": "Comfortable ride to Cozmel. Caribe staff were friendly. Boat was on time. Air Conditioning was perfect. Good Value. Boat was very clean. Waters were smooth."
        }, 
        {
            "index": 13, 
            "rating": "3", 
            "review": "Timely ferry service to/from Cozumel. This ferry service is one of three available locally and operates between Playa del Carmen and Cozumel. The boats/ships are quite modern, clean and comfortable and the ride is very smooth and fast. The terminal has been recently upgraded and is also clean and spacious. Worth noting is that if you or someone in your group has a local resident card, the price will be half of that offered to tourists."
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "This tour is a must!. It was a wonderful excursion! We took the ferry to Cozumel where we were able to tour the Island by shuttle. The beaches we saw were a beautiful clear blue with white sands."
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "The Best on This Route. Of the 3 lines operating here, far and above the best service. Newest, best maintained and most comfortable seating. And well groomed and very polite crew Really service oriented."
        }, 
        {
            "index": 16, 
            "rating": "5", 
            "review": "Fast, reliable and comfortable . This is the nicest and cheapest way to cross from Cozumel to Playa Del Carmen! Very comfortable and reliable!"
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "Great voyage to Cozamel. Number one, clean ship mid deck area has nice seats with AC blasting short 40 minute boat ride. each way"
        }, 
        {
            "index": 18, 
            "rating": "1", 
            "review": "Beware they over charged me. I live on the island of Cozumel. My husband and I are residents with resident cards along with the plan local cards. We took a trip two days ago over to playa del Carmen to meet a friend for lunch. The way over after showing our plan local cards we were charger 69p for each. On the way back we ran to catch the ferry and I took out the cards to show we were locals along with my credit card and said I'm gonna run to bathroom so just give tickets to my husband. After getting home to Cozumel I saw I was charged 135 for each of us. I went back to the ticket counter and explained .the girl called her mgr and put me on the phone with him. He said I would have to go back to playa and get the other half of the ticket I gave to girl when boarding before he would help . Ok so I have to buy a r/t ticket and then try and find girl who took my ticket and the exact ticket. No way!! So I just said o.k I will call my cr card company and they will fix it. Poor serviceMy credit card company has already given me the credit."
        }, 
        {
            "index": 19, 
            "rating": "4", 
            "review": "Price /Kwality OK. Nice boot with airconditioning rooms. Quick and on time to visit cozumel. Good service and save.16 dollars retour ticket"
        }, 
        {
            "index": 20, 
            "rating": "4", 
            "review": "Very nice trip to Cozumel. I haven't tried the other ferries, but I can say that this is not only a good deal, but very nice and relaxing trip. The inside cabins are air conditioned and they serve drinks and snacks. Departs every hour on the hour so you never have to wait long for the trip there and back. If you can grab the mid deck outside seats in the back, you will have a beautiful view of the water and Playa del Carmen as you leave and Cozumel and you arrive.Go straight to the ticket counter behind the ferry landing and bypass all the guys selling tours. We paid 7 dollars each way."
        }, 
        {
            "index": 21, 
            "rating": "4", 
            "review": "The best ferry to Cozumel and back!. Off to Cozumel for the day, the water was a little rough but still pretty smooth sailing. All of the staff worked really hard to be sure that all of the passengers were OK. I can't comment on the ride back... the ride was so gentle that I napped until we got back to Playa del Carmen!"
        }, 
        {
            "index": 22, 
            "rating": "4", 
            "review": "Easy way to get to Cozumel. It was fast and they service drinks and food on the boat. Lots of convenient times! We were so glad it was very easy to use."
        }, 
        {
            "index": 23, 
            "rating": "5", 
            "review": "Cozumel. Great service , we used this ferry for our trips to Cozumel one crossing was quite rough but the ferry was great felt really safe . Lovely clean ferry very modern and quite plush very good value and always on time . They give you a safety video to watch and the crew are very smart and helpful , overall great service all round well impressed ."
        }, 
        {
            "index": 24, 
            "rating": "5", 
            "review": "Great ferry ride to Cozumel. We chose Barcos Caribe because it was the next to leave Playa del Carmen for Cozumel, but we found out our choice was well made. Fast, efficient, on time, comfortable, air conditioned, and great staff who appeared to enjoy their jobs. What else can you ask for. Highly recommend!"
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "I only use this ferry company. The best boats and best prices.. This is the only ferry company that I use. They have the best boats and the best prices, along with the best schedule."
        }, 
        {
            "index": 26, 
            "rating": "1", 
            "review": "Unacceptable customer service!. Service at the front desk is not only rude and mean but wanted me to pay more that what I'm supposed to pay (I'm local and as local we have an special discount) stating that \"due to the high season our rates for locals were not available\"... Then... I'm I not suppose to travel on high season or what?? But well... I use Ultramar now and I'm quite satisfied with the service and only that but the boats are waaaay more comfortable."
        }, 
        {
            "index": 27, 
            "rating": "5", 
            "review": "Upscale Ferry. I travel from Playa del Carmen to Cozumel from time to time. I awaited the start-up of Barcos Caribe and have not been disappointed having used it a number of time. Actually I try to arrange my schedule to fit theirs. Not only are they newer boats, but far nicer than the other two lines. I enjoy sitting in air-conditioned comfort in a leather reclining seat to any other option. Great experience."
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "On time, comfortable. We use this service to cross from Playa del Carmen to Cozumel at night. They had extended hours, attentive staff and on time."
        }, 
        {
            "index": 29, 
            "rating": "5", 
            "review": "Very Nice Ferry!. We took the ferry over to Cozumel twice and both time we had a very pleasant time. Once you leave the ferry terminal Caribe employees will walk around asking if you'd like a beverage! Nice.The ferry's were all on-time, clean and the staff was very professional and nice; generally greeting everyone with a smile and a hand to help you get off the plank from the boat."
        }, 
        {
            "index": 30, 
            "rating": "4", 
            "review": "No problems here. I paid 135 Mexican pesos for one adult one-way ticket each. We sat at the very front when we boarded. This turned out to be nice because we had a little extra space in front of us instead of another row of seats right in front of us. The boat was multi-storied and I believe became fully seated before we left. The ride was quick and not rough at all. Coming back was easy. We bought our tickets and waited a few minutes in an outdoor seating area. Had no problems with the services (but Cozymel sucked because it was seemed abandoned and I don't recommend it) but there is at least one other option regarding transportation to and from Playa del Carmen and Cozymel. TIP I saw one dude plug in his iphone to charge in the ceiling above one of the seats. Look at the ceiling for an outlet if you'd like to do this (but people will look at you like you're crazy)."
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "Smooth ride to Cozumel!. Great comfortable seats on this Ferry as it's a catamaran. They have outside seating and inside with seats that recline and it has AC. Much better option than sitting in the hot humid sun! Runs on time and is reasonably priced. If you tend to get sea sick I would suggest going on this Ferry and not the other one as it's a boat and you would feel the roughness if there's waves."
        }, 
        {
            "index": 32, 
            "rating": "4", 
            "review": "Bumpy ride. Cheap but bumpy ride (but that could have been from the storm coming in). They will give you vomit bags if you need it. Seats are comfy. Cost was 135 peso round trip. Soda cost about 1 USD. It only took about 30mins to get to Cozumel on this ferry"
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "Great Ride. We take the ferry to Cozumel every year and this year we used Barcos. I get easily seasick and hate the ride but their boats are remarkably smooth and well appointed."
        }, 
        {
            "index": 34, 
            "rating": "5", 
            "review": "Efficient and priced right.. It was easy to get tickets. The boat is air conditioned, which was great. It left and arrived on time."
        }, 
        {
            "index": 35, 
            "rating": "4", 
            "review": "Affordable. We took the Barcos Caribe round trip from Playa Del Carmen to Cozumel. Very affordable, easy boarding and comfortable seating. Drinks/snacks available on board. We will use this service again if traveling to Cozumel!"
        }, 
        {
            "index": 36, 
            "rating": "5", 
            "review": "Best ferry to Cozumel. It was fast, cleaned, well maintained, on time for arrivals and departures and it is cheaper than the others."
        }, 
        {
            "index": 37, 
            "rating": "5", 
            "review": "Cheapest option for Cozumel!! :). I took my boyfriend to Cozumel for his birthday and when looking for options to cross over, all the other companies were above 600 pesos!!! I was freaking out because it was just too much money for half and hour and then I came across Barcos Caribe. Is the cheapest you can get!! If you live in the state, you pay $138 pesos ROUND TRIP!! Its a steal!! The staff on the ticket office were so helpful and flexible since my bf didn't have his mexican ID with him! The service is good, fast and during the cross they put you a TV with all the activities you can do in Cozumel. The schedules are wide and confortable! Best option definetely!"
        }, 
        {
            "index": 38, 
            "rating": "3", 
            "review": "Cozumel. went to cozumel from Playa del Carmen and trip there was full of music and fun - different excusions - snorkling, private island playa blanca/lunch which was delicious. Trip back was a bit rocky with boat swaying fro side to side at times . About a 40 minute ride to cozumel."
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "Perfect beautiful ocean cruise. Nice way to get to Cozumel from Playa delf Carmen. Fair price, short wait times, nice smooth cruise. Boat was clean and we felt safe."
        }, 
        {
            "index": 40, 
            "rating": "5", 
            "review": "Superb trip to Cozumel. Barcos Caribe is the newest ferry service in the area. After using others we used them this trip and couldn't be happier!! The employees are so very nice and helpful and the boats are awesome. Seats are comfy, AC inside is great and the trip to Cozumel is quick. New favorite from now on!"
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "Great price for ferry to Cozumel. Very comfortable ferry ride to Cozumel. Prices were better than the other options. The schedule of times to and from made it very convenient!"
        }, 
        {
            "index": 42, 
            "rating": "5", 
            "review": "Cheapest way to get to Cozumel. This is the local owned and operated ferry so it has more and later runs to Cozumel than the others. It's also the cheapest and it's nice and clean."
        }, 
        {
            "index": 43, 
            "rating": "5", 
            "review": "Ferry to Cozumel. We missed Our airline connecting flight to Cozumel and had to fly into Cancun. We transferred to Playa and got on the Barcos Caribe! We had an amazing ride and very comfy! Indoor leather seats with awesome air conditioning. We would definitely use the service again!"
        }, 
        {
            "index": 44, 
            "rating": "4", 
            "review": "Good Service. We used all 3 ferry services while we were down there and thought Barcos Caribe was pretty good. They are the least expensive of the 3 which is great, but in all honesty, I would take whichever ferry was leaving the dock first."
        }, 
        {
            "index": 45, 
            "rating": "3", 
            "review": "Traveled in a rainy day. Safe and sound since we traveled on a rainy day to Cozumel.\nDisadvantage the long line of people waiting to get on board. They could have made a better management there. Drinks are offered on board, but they didn't have cold water (only cool), or cold soda, or cold coke light...:-/"
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "Used to visit Cozumel. Great 45 minute ferry ride linking mainland to Cozumel. Drinks are reasonably priced and staff very attentive. Sit outside as aircon is very cold."
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "Wow. The ferry was nicer than you would expect and the people were all very friendly. Much nicer than the last time I was in Playa."
        }, 
        {
            "index": 48, 
            "rating": "3", 
            "review": "Transport to Cozumel. We tried the three ferry services for roundtrip journeys during a dive trip to Cozumel. Not too much to distinguish between the three, seas were calm, none left on time, and trips seemed to take about the same amount of time. Barcos should be faster than Ultramar but didn't notice that big a difference in our trips. Barcos had very small outdoor seating so arrive early if you want or need to sit outside. Afternoon return to Playa was a bit warm so lulled off for a short siesta after diving in the morning. Main advantage to Barcos seemed to be the regular service during the afternoon while Mexico Waterjets and Ultramar had breaks in their schedule."
        }, 
        {
            "index": 49, 
            "rating": "5", 
            "review": "cheap easy ride. Excellent way to get to cozumel. The tickets were cheap, the ride was fast and comfortable for the whole family."
        }, 
        {
            "index": 50, 
            "rating": "4", 
            "review": "Fast and easy transport from PDC to Cozumel. This company is quite new on the market. Offering better price then the yellow/blue Ultramar.The boats are clean and spacious with very comfortable inner seats. The outside seating is very limited, but if you are fat you will take you place.The trip takes about 30-35 minutes and if seated inside you can also have fun by watching the company video on the TV. Quite funny mostly for the way the talk and the way it's made (a bit amateur).Preferrably buy tickets by yourself and do not let any \"street stravel agency\" buy them for you with a discount etc. because they are generally lying and you will play the same price."
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "Fast. Friendly. Lower cost. Modern Ferries.. I cannot express how happy I was when Barcos Caribe started service between Cozumel and Playa del Carmen... their ferries were newer, faster and filled long gaps in the schedule. The other two ferry companies really took advantage of their stranglehold on service. They were slow to cross, taking at least an hour, and expensive - even with a Plan Local discount. Barcos Caribe changed that. They lowered prices for locals and only take 45 minutes to cross! At least the new competition caused the other carriers to speed up, but I'll always choose BC first when I am able."
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "Great transportation between Cozumel and Playa del Carmen. Fast transportation, clean, comfortable seats. An excellent way to cross between the island and the mainland. Very inexpensive. The trip across is about 35 minutes."
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "Nice boat. The cost is about 135 pesos each way to Cozumel. It takes about 30 minutes. The boat is nice and clean and they have tvs with commercials to make the time pass quickly."
        }, 
        {
            "index": 54, 
            "rating": "5", 
            "review": "Fast, Easy and Comfortable. We had a large group of travelers (22 people including kids). They gave us a dollar off the rate for adults to ride from Cozumel to Playa del Carmen. Normally the rate is $8 USD one way and kids are $4. I believe that it was one of the cheapest companies. We were told a ferry leaves every 30 minutes by our hotel, but Barcos Caribe looked as if it left every hour the other companies rotated every other hour. We checked our luggage (free) and some of us sat outside on the deck some sat in the air conditioned inside complete with snack bar, and places to charge electric devices. The seats were comfortable no matter where you sat and even though we left the Cozumel dock after the other company we passed them up on the water and arrived basically at the same time if not a little before. This company is fast, easy and a quick way to get back and forth between Playa and Cozumel in less than an hour (about 45 minutes). Overall I would use this company again."
        }, 
        {
            "index": 55, 
            "rating": "4", 
            "review": "Second trip to PDC.. Love the ferry to & from PDC & Cozumel. only downside, this ferry does not have enough outside seating nor seating on the side of the ferry."
        }, 
        {
            "index": 56, 
            "rating": "5", 
            "review": "Quick and Easy Ferry Ride. I booked our flights into Cancun for a stay in Cozumel.. Not on purpose... We figured out we saved $600 on airfare by taking a taxi to Playa and jumping on the Ferry to Cozumel! It was $8 per person American and they took Visa and cash. We picked the Barcos Caribe because the time was right and the ferry looked clean. It was and we were pleased with the friendly staff. Be sure to sit on the 2nd level outside to enjoy the trip making it an excursion rather than a transport ride! It was about 20-25 minutes one way and they have a bar on board with reasonable prices."
        }, 
        {
            "index": 57, 
            "rating": "5", 
            "review": "No Sea Sickness. The ride from Cozumel to Playa Del Carmen was so enjoyable and comfortable on Barcos Caribe. So glad this is the ferry we decided to use. The smooth trip took approximately 30 minutes and the boat was very clean and the staff was very professional. There was no need to worry about sea sickness, it was similar to a roller coaster. Even the children on the boat were saying \"Weee\"!"
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "First Class Seating. For a day trip out of PDC to Cozumel, we chose Barcos Caribe and were so glad we did. Inside seating on the second level can best be described as First Class. Lots of elbow room, lots of leg room, a reclining seat and flat screens that provide Island info and some light entertainment. Floor-to-ceiling windows allowed ship watching and taking pictures. You'll wish the ride was longer! And, after a long day of touring on Cozumel, the seating on Barcos was perfect for a nap on the return trip.Ladies in neatly pressed uniforms stood at both ends of the loading gangway greeting us and ensuring our safety. Everyone with Barcos was customer-oriented friendly. Loading and unloading of a boat full of people was well rehearsed and proceeded efficiently.Pricey at $135.00 MXN, but provided a great trip to and from Cozumel."
        }, 
        {
            "index": 59, 
            "rating": "5", 
            "review": "Nice ferry ride. We took an excursion to Cozumel. The ferry was very clean, plenty of seating, well air conditioned, plus sold beer at low prices"
        }, 
        {
            "index": 60, 
            "rating": "4", 
            "review": "Convenient and easy travel. Very clean and smooth ride from Playa to Cozumel. I was happy with the baggage check system as we were travelling with backpacks and suitcases."
        }, 
        {
            "index": 61, 
            "rating": "4", 
            "review": "Quick Ride to grest Island. This ferry service provides a quick, clean and refreshing boat ride from Playa De Carmen to Cozumel. Each time we visit we ride this ferry across and spend a day on the other side. If we are in Cozumel, we ride and spend the day in Playa. When in Playa we ride and spend the day in Cozumel. Great service back and forth at all times during the day and evening"
        }, 
        {
            "index": 62, 
            "rating": "4", 
            "review": "Ferry to Cosumel. We used this Ferry both ways. The cab driver recommended and think he was right. It is a Catamaran and very nice. Both Ferries cost the same I believe this si the nicer of the two."
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "FUN TRIP TO COZUMEL. Every time we visit Playa we take the ferry out to Cozumel. This boat is a fun ride, very safe and fast. Look for flying fish along the way, we see them every time. We always rent a scooter and drive all the way around the island and then head back on the ferry at the end of the day. Highly recommend."
        }, 
        {
            "index": 64, 
            "rating": "5", 
            "review": "Nice Smooth Ride. A very comfortable way to travel between Playa Del Carmen & Conzumel. Ferry had outside seats and inside air conditioned cabins. Beverages & beer can be purchased on board through servers. It takes less than an hour to get across and keep your eyes out for Dolphins,as you approach Cozumel and on the Port side."
        }, 
        {
            "index": 65, 
            "rating": "4", 
            "review": "Boat trip. Big boat, people who work there are nice, good drinks, comfortable, clean which amazed me I wasn't expect it."
        }, 
        {
            "index": 66, 
            "rating": "5", 
            "review": "Boat trip from Playa to Cozumel. The boats leave on time and they are very comfortable. You can buy snacks on board and I felt pretty much safe.The only thing is they have TVs thay stay on all the way, so it´s a bit noisy if you´re trying to sleep during the trip."
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "BEST WAY TO TRAVEL. I've gone to Cozumel many times and done the 3 companies by far the best. after you try Barcos Caribe and go with another company you feel so uncomfortable. Seats are reclinable amazing view just love the company."
        }, 
        {
            "index": 68, 
            "rating": "5", 
            "review": "Ferry to Cozumel. Excellent ferry. Well priced. We thought it was very clean. We felt very safe. The staff was very helpful. We would take this ferry again anytime."
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "Good Ferry Service. This was one of three ferry options to Cozumel. $10/each way per person. Comfortable and air conditioned."
        }, 
        {
            "index": 70, 
            "rating": "4", 
            "review": "What's to say?. Well a ferry ride is a ferry ride, but I must say, I was traveling with a friend who got sick. The personnel on board was very attentive and was watching out closely for all those who were turning green. We made it over to the island and back and will use this ferry again."
        }, 
        {
            "index": 71, 
            "rating": "5", 
            "review": "My favorite ferry!. This ferry has the most shaded outside seating. It is also the cheapest at $8 one way. I have taken all three but prefer this ferry. Only buy a one way so that you aren't limited on return times."
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "Bumpy but beautiful ride. We had walkers and boarded first. They have handicap seats in the front. The hostesses helped get us a drink and made sure we were comfortable."
        }, 
        {
            "index": 73, 
            "rating": "3", 
            "review": "Easy, as expected for a ferry ride.. Nothing more or nothing less. It was a good deal, it was a quick trip, and arrived on time. I have no complaints what so ever."
        }, 
        {
            "index": 74, 
            "rating": "5", 
            "review": "Comfortable Trip. The ferry is a catamaran hull, so the ride is more stable in rough seas. Overall, the staff are friendly. Bicycles can be transported."
        }, 
        {
            "index": 75, 
            "rating": "5", 
            "review": "Ferry ride to Cozumel. The staff was very professional. The ferry was clean and modern, not at all what I expected. Boarding was orderly and quick. The ferry is well kept."
        }, 
        {
            "index": 76, 
            "rating": "5", 
            "review": "Cool day in Cozumel. We were looking for something to do one afternoon so we took the boat to Cozumel. Boats ran on time with comfortable seats. Worth the few bucks for a great evening in Cozumel."
        }, 
        {
            "index": 77, 
            "rating": "4", 
            "review": "Good. Nice spacious seats made out of leather. Ride was very rocky many people got sea sick! But staff was very helpful bringing paper towels, bags, and water if you were not feeling well. They played a nice welcome dvd and has snack bar"
        }, 
        {
            "index": 78, 
            "rating": "3", 
            "review": "not for the faint of heart. this was a catamaran style boat that felt like it got a little sideways on the trip from Cozumel to playa del Carmen."
        }, 
        {
            "index": 79, 
            "rating": "5", 
            "review": "Cozumel to Playa deal Carmen Ferry. We used the ferry to get across from Cozumel to Playa Del Carmen. The Ferry was clean and the staff very helpful and courteous. The price of a one way was 7.50 USD the round trip 15 USD getting the tickets is easy at the port. The ferry schedule is online and the staff was very cool with us jumping on the earlier one since we arrived early. The ride was great and ship was nice and clean. I pre out my tickets with an agency that was handling my transfers but ended up paying triple the price for nothing extra. Save yourselves the aggravation of knowing you overpaid and buy your own tickets at their booth it's easy and properly priced!"
        }, 
        {
            "index": 80, 
            "rating": "4", 
            "review": "Great ferry ride. The trip over to Cozumel was ok even though the windows were salted up, but the trip back was amazing because we rode on the top deck."
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "Ferry to Cozumel. We took Barcos to Cozumel.\nIt was a quick comfortable ride to Cozumel from Playa deal Carmen. 15$ for transport both ways. There was ferries running quite often and everything was smooth sailing , minus the ride, it is veryyyyyyy bumpy. Not recommended for those with motion sickness."
        }, 
        {
            "index": 82, 
            "rating": "4", 
            "review": "Punctual, Cheap and Swift. I used the ferry to travel to Cozumel, you get great views leaving Playa del Carmen and great into Cozumel. Very reasonable trip price $135 MX but note if taking luggage no car access to ferry departure in Playa del Carmen."
        }, 
        {
            "index": 83, 
            "rating": "5", 
            "review": "Favorite ferry to Cozumel. We sat outside on a lovely day, a perfect breeze and a shady roof so we were not in the sun. Very pleasant voyage."
        }, 
        {
            "index": 84, 
            "rating": "5", 
            "review": "Fast ride to Cozemel. very clean an very friendly..we got the round trip ticket for 15$ an return any time that was sweet because they leave on certain schedule so we knew we to be back to the boat.."
        }, 
        {
            "index": 85, 
            "rating": "5", 
            "review": "very modern. The ferry with this company is very comfortable, staff members are nice and the boats are pretty new and modern, what makes the ride nice"
        }, 
        {
            "index": 86, 
            "rating": "5", 
            "review": "Easy, comfortable trip.. We took the ferry from Playa del Carmen to Cozumel, and back a week later. Both times were a smooth pleasant ride, comfortable temperatures, and friendly attendants. Overall I would definitely use Barcos Caribe again!"
        }, 
        {
            "index": 87, 
            "rating": "4", 
            "review": "This is the only ferry that goes Cozumel-Playa del Carmen until 10pm. All of the others make you leave Cozumel at 7 and there are nice places to see at night. You must get there early if you want to be in the up part and get a seat, it gets crowded fast. I was lucky because I arrived just on time for the return and they let me stay in very nice spot because there were no more seats."
        }, 
        {
            "index": 88, 
            "rating": "5", 
            "review": "they also had VIP area. excelent service, very low cost , very secure every seat had security livejacket , and the aircondition service, or also with fresh air, is very puntual on time to arrive, very good service"
        }, 
        {
            "index": 89, 
            "rating": "5", 
            "review": "Your best bet!!. There are several ferries available from Playa del Carmen to Cozumel, but this one is the best deal in town. This ferry has comfortable seating inside. With the other company you may have to sit outside in a hard plastic chair. I was impressed with the cleanliness and professionalism of the serving staff. Additionally, the prices are the best!"
        }, 
        {
            "index": 90, 
            "rating": "4", 
            "review": "Used this to get to Cozumel, good ferry with excellent facilities. We used this ferry to cross to Cozumel. It was straightforward to use and there was indoor and outdoor seating and it was possible to buy food & drink on board."
        }, 
        {
            "index": 91, 
            "rating": "5", 
            "review": "Easy Trip to Cozumel. Comfortable ride roughly 30-40 minutes. Spacious seats, snack bar in rear of boat with beer if you like."
        }, 
        {
            "index": 92, 
            "rating": "5", 
            "review": "Clean and efficient. I have to be honest - we selected this company because they were the cheapest. I think it's worth reading reviews of all three competitors as our experience was a pretty rough ride. Seas were rough and maybe all boats would have fared the same but ours seemed a little smaller than the others which might make it a bit quicker but we were definitely buffeted around by the waves. In the end it didn't really affect us at all but if this is something that might bother you I would recommend doing your research. As for staff, service, timeliness and all other factors you would look for in a transportation option - couldn't fault them. Staff come around to take your drink orders - beers were ice cold! Impressive. Would definitely recommend."
        }, 
        {
            "index": 93, 
            "rating": "3", 
            "review": "Just picked the first ferry going to Cozumel.. It is a newer ferry and they don't waste any time leaving. I was a bit seasick from the hugs waves and thank you Dramamine. I highly recommend you take some with you or buy in Cozumel as our way back was super stormy! There was definitely some wave crashing going on. The ACDC videos were kinda fun.It was a average ride - great to have air conditioning and very efficient."
        }, 
        {
            "index": 94, 
            "rating": "5", 
            "review": "Awesome fiery boat. Super nice and smooth ride over to Cozumel. Sat inside lower level, seats were like airplane. Tv too"
        }, 
        {
            "index": 95, 
            "rating": "5", 
            "review": "Catamarans; smoother ride to and from island. We picked Caribe to ferry to Cozumel as the ocean tends to be rough and these boats are a catamaran, more stable design. They also have an interesting advertising video that plays during the trip. You can take your ferry tickets to these places and get a free margarita for example. We used our tickets at SkyReef and we received two free regular cup-sized drinks."
        }, 
        {
            "index": 96, 
            "rating": "5", 
            "review": "Comfortable. A great way to Cozumel,easy to get to ferry,and very quick crossing,no more than 35 minutes,very comfortable seats."
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "Smooth Ride. Best and also the least expensive ferry. Clean and the AC works great. Their travel schedule is comparable with the others so save yourself a couple bucks."
        }, 
        {
            "index": 98, 
            "rating": "4", 
            "review": "Very comfortable. Very comfortable seating. Was a nice quick ride to Cozumel. This ferry was very clean and spacious. Holds a lot of people so arriving last minute was no problem."
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "short boat ride to Cozumel. Ask for the senior rate if you qualify. Enjoy fresh air and ocean spray on the upper outdoor levels or ride in comfort inside down below."
        }, 
        {
            "index": 100, 
            "rating": "5", 
            "review": "Easy to do. We took the ferry from PDC to Cozumel and it was very easy to use. Great staff and very helpful and an excellent return price. They were hourly so no rush or hassle to return."
        }, 
        {
            "index": 101, 
            "rating": "4", 
            "review": "This is the Best of the 2 Ferry Companies. The Blue and Yellow Ferries were more Expensive and Not as Nice in Quality of Seating and Amenities."
        }, 
        {
            "index": 102, 
            "rating": "4", 
            "review": "I Hate Taking These!. So there are now three ferry companies that cross over to Cozumel, UltraMar no longer has the monopoly. We bought tickets through Caribe on the way there and Ultramar on the way back, Both made me and nauseated as the Ultramar usually does. I was a bit skeptical at first but a lovely man named Alturo helped my husband and I as he explained the prices and times. And he taught us that the tickets are good for six months! It realyl is best to buy a one way ticket to Cozumel as that way when you get back to the dock it doesn't matter what time or what ferry company you are using, you just buy whoever is available."
        }, 
        {
            "index": 103, 
            "rating": "5", 
            "review": "Barcos Caribe the best Ferry to Cozumel!. A new comer that has changed the industry! Professional Ferry attendants that help with any needs on your 20-30 minute voyage.. Timely and clean.. Beverage and snacks available.."
        }, 
        {
            "index": 104, 
            "rating": "4", 
            "review": "cozumel trip. very good trip to cozumel, could get better in the service but good for the price!!! compare to the other ferry's I can recommend it with out a question, the boats are not new but work perfectly."
        }, 
        {
            "index": 105, 
            "rating": "4", 
            "review": "Nice Transport. Took them back to PDC. lower price, and nice seats made the ride comfortable in early evening. Will take them again."
        }, 
        {
            "index": 106, 
            "rating": "4", 
            "review": "great location,friendly,very clean. Great location, very clean rooms in main building, friendly, great bfast. Get a room in the main building facing pool."
        }, 
        {
            "index": 107, 
            "rating": "5", 
            "review": "Ferry to Cozumel. We took this ferry over to Cozumel and it was wonderful and would highly recommend using this ferry."
        }, 
        {
            "index": 108, 
            "rating": "4", 
            "review": "Smooth ride. We took Barcos Caribe over to Cozumel.It was quick, and smooth. The Boat was clean and well attended to."
        }, 
        {
            "index": 109, 
            "rating": "5", 
            "review": "In my experience better than the others. Keep in mind I do not have an abundance of experience with the local ferry situation. I did, however, take a few back and forth last year and again in 2016 to Cozumel to do some diving. Apparently it is customary to leave your gear on the bottom level at the stern. With Barcos Caribe I never felt like my gear was at risk and it was always respected. With others I have arrived in Cozumel to find my gear both soaking wet and not even on board, but sitting off to the side almost out of sight on the dock."
        }, 
        {
            "index": 110, 
            "rating": "4", 
            "review": "Quick and easy way to Cozumel. Took the catamaran across from Playa to Cozumel. Boarding was quick, easy and efficient. the day we went the sea was particularly rough, but the crew handled everything with ease. Inexpensive and quick. take the time to go, it's worth it."
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "Simple, quick and inexpensive way to visit Cozumel. Comfortable ferry to Cozumel. Very spacious and quick. Cost US$9 one way. Leave on the hour from the pier in Playa Car, 5/10 min taxi ride from the main hotel at Playa del Carmen. Really do recommend this as a day out.Top Tips. When you arrive you can get a taxi to take you to local beaches, away from the highly developed main area (which is more costly to eat and drink). We went to Sand Dollar sports about a 45 min walk, 10 min taxi ride (not far the cruise liner berth) to snorkel. Cost US$2 to hire a locker. You can dive here too with instructors."
        }, 
        {
            "index": 112, 
            "rating": "5", 
            "review": "Newest Ferry to Coxumel. Barcos Caribe make the 3rd and newest ferry to cross back and forth from Cozumel. New, comfortable and convenient schedules for day trips to Cozumel or Playa."
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "Ferry to Cozumel. Comfortable, had TVs, offer drinks for small fee, fast ferry. Many options for seating based on preferences, very nice."
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "Quick trip to Cozumel. Grabbed a one way ticket on the 5pm barco to Cozumel. Everything here was efficient and friendly. Boat was large, had AC going and trip was easy and fast. Not sure what else you need for a quick ferry ride."
        }, 
        {
            "index": 115, 
            "rating": "5", 
            "review": "Nice Ferry Ride. We were staying at Playacar Palace in Playa del Carmen (right next to the ferry). We decided to take the 45 minute ride over to Cozumel. The ferry is air conditioned and has a snack bar. It is roomy and a smooth ride. We highly recommend this transportation."
        }, 
        {
            "index": 116, 
            "rating": "3", 
            "review": "Nice service but Too Unstable!. These boats have a very nice staff on-board. Everyone is very professional and helpful. As far as the boat itself- it is pretty large to be so rocky and move so much with the waves. We were both sea-sick- would try a different boat next time."
        }, 
        {
            "index": 117, 
            "rating": "3", 
            "review": "Every hour. 270 pesos per person round trip to Cozumel. Comfortable seating. 30 min ride. Lots of departures and returns scheduled. In general every hour though there are some that leave at other times. Good service."
        }, 
        {
            "index": 118, 
            "rating": "5", 
            "review": "Fast Fairly Clean Lest Expensive. No complaints here. Exchange your currency to peso's and pay for the boat ticket (better price 135 peso's Jan 2016 one way no purpose of buying a round trip just get it when you go back to the main land)."
        }, 
        {
            "index": 119, 
            "rating": "4", 
            "review": "Choppy waters. We wanted to spend an afternoon on Cozumel and this was the ferry leaving at the time we wanted. It is very clean, well staffed and organized. The water was choppy that day as it was so windy, but I managed not to get motion sickness. Thank you captain!Great way to get to Cozumel."
        }, 
        {
            "index": 120, 
            "rating": "4", 
            "review": "The cheapest. It's great because it's the cheapest , I don't know about service but it's clean and gets me to Cozumel"
        }, 
        {
            "index": 121, 
            "rating": "5", 
            "review": "Great service, Great schedules!. We wanted to visit the island of Cozumel. and crossed roundtrip through this ferry ship company. there are two other companies, but this one had the newest and nicest boats."
        }, 
        {
            "index": 122, 
            "rating": "4", 
            "review": "Well run ferry service. Very affordable and well run ferry service to Cozumel. The staff is very helpful and want to make you feel comfortable."
        }, 
        {
            "index": 123, 
            "rating": "3", 
            "review": "Barcos Caribe Ferry to Cozumel,MX from Playa Del Carmen,MX. My guy and I found cheaper prices for Barcos Caribe Ferry in downtown Playa Del Carmen,MX early Christmas Day 12/25/2015. This company and 1 other company offers transportation from Playa Del Carmen,MX to Cozumel Island,MX. The employees and service was good and they spoke some English. The boat ride was approximately 30-45 minutes. You could seat yourself inside which had air conditioning. You could seat yourself outside on 2 decks. Be Warned: 1) Take Motion sickness pills 1 1/2 hr before you board this boat. The waters of the Caribbean Sea were approximately 5 ft high with white caps and it was a rocky ride. If you get Sea sick you may be able to go to the Upper deck. If you want to sit on the Upper deck, you must be there early and get to the front of the line for boarding. I was seated near an Emergency stairwell and an isle and I had to hold on for dear life during the boat ride. They do not provide Ice cubes and do provide beverages in cans and snacks for purchase..2) Restrooms are provided on the ferry, however, the Restrooms were outside on a side of the boat and in rough water you risk falling overboard because the safety railings are too short. My guy said it was a Suicide Mission to try to get to and inside the Restroom and he decided against using it. I was very happy to arrive on Land from the roundtrip on Barcos Caribe. I would travel again aboard the Barcos Caribe."
        }, 
        {
            "index": 124, 
            "rating": "4", 
            "review": "Can be a rough ride!. Service was efficient and pleasant. Luggage handled well at both ends of the trip. The ride from Playa Del Carmen took 45 minutes and it was an extremely rough crossing. Waves were big and the boat rocked considerably. Not for the faint of heart or anyone prone to motion sickness. Staff was handing out bags, just in case. I was glad to get back on land!"
        }, 
        {
            "index": 125, 
            "rating": "5", 
            "review": "Cozumel trip. This boats had the best price and service to go to Cozumel, is a short trip (about 35 min) and you can choose freely were to sit.If you get dizzy easily I´ll recommend to take a pill before travelling."
        }, 
        {
            "index": 126, 
            "rating": "4", 
            "review": "Cozumel Ferry. The Accomodations for the 35 minute ferry ride were very comfortable they have plugs to charge items on the boat and snacks but no wifi. If you get sea sick please sit at the top as the boat is rocky. It was timely also no delays. The price was also decent."
        }, 
        {
            "index": 127, 
            "rating": "4", 
            "review": "Great ferry service between Cozumel and Playa del Carmen. Great service. Arrive early to be at the front of the line if you want outdoor seating- which I recommend, particularly in the evenings. Be prepared for motion sickness if it's something you're prone to, even the calmest of days seem to get the best of people."
        }, 
        {
            "index": 128, 
            "rating": "4", 
            "review": "The ferri gets you to Cozumel Island and back. Barcos CARIBE is one of the two companies operating ferri connection to Cozumel. Its ships seems to be somewhat bigger than their rival. This makes for smoother ride when the sea is a bit rough. Both ferries run on time so you should be there at least ten minutes before scheduled departure and earlier if you want to get a seat on one of two open air decks."
        }, 
        {
            "index": 129, 
            "rating": "5", 
            "review": "Excellent transportation to Cozumel - have a nice trip!. Clean, comfortable, professional, punctual a great value and way to get to Cozumel from Playa del Carmen; a very pleasant surprise."
        }, 
        {
            "index": 130, 
            "rating": "5", 
            "review": "Above and beyond travel experience - except!. They came to our resort to take us back to airport but the cabbie asked my husband for a tip and unfortunately we were out of cash - it was not good for him to do that. We are generally big tippers and i was annoyed that he asked versus allowing us to give the tip."
        }, 
        {
            "index": 131, 
            "rating": "5", 
            "review": "Great ferry service!. We were impressed with the ferry we took from Playa to Cozumel. Comfortable seating, good pricing, and nice smooth ride...highly recommended. We sat below, safe from the sun and spray.\nNos impresionaron mucho el precio, comodidad y servicio de esta compañía."
        }, 
        {
            "index": 132, 
            "rating": "5", 
            "review": "Best Ferry to and from Cozumel. I currently have been taking a weekly trip to Cozumel, and have tried all the Ferries. Caribe is the best, not to mention the great price for both Locals and Tourist. The is Lifejackets clearly visable under every seat, staff that will take and order for refreshments and deliver to your seat. I prices on refreshments are not over charged and the same price you pay at any corner store. I feel safe on this Ferry."
        }, 
        {
            "index": 133, 
            "rating": "5", 
            "review": "Best, most comfortable ferry. Barcos has the largest boats and the most comfortable. There's outside seating and inside A/C seating (which gets pretty cold). They have the cheapest price for tourists... you'll save about 25 pesos each way over the other two ferries. Refreshments are available... beer, sodas, snacks such as candy bars and chips, etc."
        }, 
        {
            "index": 134, 
            "rating": "5", 
            "review": "Easieat way to get to Cozumel. When we went out to Cozumel we happened to use Caribe, it was a really easy crossing, they handled our luggage for us and were friendly and polite. On the way back we used another company who refused to handle our luggage and we ended up struggling up two flights of stairs with it. We will definitely use Barcos Caribe in future!"
        }, 
        {
            "index": 135, 
            "rating": "5", 
            "review": "Best ferry service with the best rates.. We were on the maiden voyage of Barcos Caribe from Cozumel to PDC early this year. We couldnt believe the great value this company was offering. New boats, friendly staff, comfortable ride. We expected this was just a promotional gimmick to get a market share, but here we are almost a year later and the price and service remain the same. To the owners and investors who made this ferry service possible, thank you for giving us an alternative...dont change a thing."
        }, 
        {
            "index": 136, 
            "rating": "4", 
            "review": "Like being on an airplane in the 50s. Took this back and forth from Cozumel. Stewardesses all have the greatest outfits, 1950's airline. They look so professional. The board the ship and depart like an airline.Air conditioned inside. Not much to see because no forward sight, only behind.Choppy both ways. You cannot get up and walk around.Pleasant way to travel."
        }, 
        {
            "index": 137, 
            "rating": "5", 
            "review": "Cozumel visit. We took the ferry to Cozumel, $18 round trip I believe. The boat is nice and clean. AC, but no wi-fi. Very spacious, plenty of seats."
        }, 
        {
            "index": 138, 
            "rating": "5", 
            "review": "I use to visit cozumel. it is one of the ferry to go to cozumel, the ride is great 30 minutes, the Ac works, but there is no wifi"
        }, 
        {
            "index": 139, 
            "rating": "4", 
            "review": "Comfortable Ride. Barcos Caribe provided a comfortable ride from P.D.C. to Cozumel for a good price,a little less than the other ferry services. The ticket counter personnel were helpful and informative. The ship was clean and sells snacks and drinks for the 45 minute ride."
        }, 
        {
            "index": 140, 
            "rating": "5", 
            "review": "NIce ride. Took this ferry line to Cozumel. Nice smooth ride,clean and comfortable and refreshments are available for purchase on board. Of the three ferries available this was the cheapest."
        }, 
        {
            "index": 141, 
            "rating": "5", 
            "review": "Excellent Service. Normally, I wouldn't bother to review a review about a ferry service. However, I wanted to let everyone know about their service. We bought RT tickets ($18ea) from Playa to Cozumel. So, if you have a problem with motion sickness, you better take something because I saw a person \"lose it\" on both trips. The water was a little rough on the 1st trip, but not on the 2nd. That leads me into the service...On the 1st trip, a woman was sick and one of the attendants stayed right there with her...helping her, giving her a cold wet cloth, making sure she was OK. On the 2nd, a guy was really sick and the attendant was there...helping him, cleaning up HIS mess. I couldn't believe it! I was really impressed how they helped these passengers. So, I definitely recommend this ferry service!"
        }, 
        {
            "index": 142, 
            "rating": "5", 
            "review": "The cheapest and convenient. There are 3 companies that you can choose from on the route between Playa del Carmen and Cozumel, of which Barcos Caribe has the cheapest tickets. One way for an adult costs 135 MXN and the connection is very good. (the other companies are 165 MXN and 164 MXN one way) I suggest you to occupy the spots on the top floor (however, if you come last minute, those will probably be already occupied) where it is not closed area, it is open air (with some cover so that you do not get sunburtnt) and the breeze from the sea makes it a pleasant experience. To be honest, we found the closed areas of the boat way too cold due to the A/C. The staff will offer you some drinks to purchase during the boat ride (aproximaltely 50 minuetes). I read reviews where customers complained that it is never on time. Well, our departure was scheduled to 9:00, and it actually was at 9:04, 4 minutes, I think can be understood. The same happened on our way back. I would also suggest to just buy one way ticket. By the time you return, you might not want to wait and just pay the higher price for a different company that Barcos Caribe, that goes back earlier."
        }, 
        {
            "index": 143, 
            "rating": "5", 
            "review": "Clean, Fast and Courteous. Excellent service, timely schedule, and clean, comfortable seats. The roundtrip ride goes by quickly."
        }, 
        {
            "index": 144, 
            "rating": "5", 
            "review": "Great. We took it from Playa del Carmen to Cozumel it was very clean and quiet. best of all it was fun and nice to se the Ocean change colors"
        }, 
        {
            "index": 145, 
            "rating": "5", 
            "review": "Excellant Ferry trip to Cozumel. Chose to take this Catamaran type ferry because of the open top deck seating to allow for fresh air, higher is better for reducing sea sickness effects. The trip was great, bathrooms were clean and refreshments and snacks are available for purchase. Seems to make the run anout 5 minutes faster than the alternative ferry line."
        }, 
        {
            "index": 146, 
            "rating": "5", 
            "review": "Smooth sailing. No motion sickness here. Very smooth ferry and seemed to be faster than the others. It only took 30 minutes to/from Playa del Carmen/Cozumel."
        }, 
        {
            "index": 147, 
            "rating": "5", 
            "review": "Ferry from Playa to Cozumel.. We rode this ferry to Cozumel and back. The fair is cheaper then the competition. Only buy a one way ticket each time."
        }, 
        {
            "index": 148, 
            "rating": "5", 
            "review": "Nice day trip to Cozumel. This high speed ferry took us from Play del Carmen to Cozumel. The ferry was very clean and runs almost hourly. It was the most cost effective of all of the ferry's that make the run between Playa del Carmen and Cozumel."
        }, 
        {
            "index": 149, 
            "rating": "5", 
            "review": "ferry to cozumel. sat on the upper outside deck covered mostly from the sun. There was someone who offered to get beers for you from the lower bar area, Nice quick ferry service for 9$ US one way."
        }, 
        {
            "index": 150, 
            "rating": "4", 
            "review": "Cozomel day trip. ferry to Cozomel good service ,reasonable price ,get one way ticket as different ferry companies run at different times, best to hire acar to view islandi"
        }, 
        {
            "index": 151, 
            "rating": "5", 
            "review": "Best Ferry to Coz!. Great way to get to Coz from PDC. Took another boat back, and it was not nearly as nice as the Barcos Caribe boat. Nice A/C and clear windows to see the ocean pass by."
        }, 
        {
            "index": 152, 
            "rating": "5", 
            "review": "Definitely something different!. If you've never been on a ferry before, like me, it is a fun and interesting experience. The process is simple, buy tickets, and walk down the dock and board the ferry. Choose a window seat, some have electrical outlets if you need them. Drinks and snacks are served for a fee, including beer and liquor. There is a safety video, and a woman who comes around to check and make sure you don't need anything."
        }, 
        {
            "index": 153, 
            "rating": "4", 
            "review": "Ferry to Cozumel. Modern, well run ferry service to Cozumel from Playa Del Carmen - could sit in air conditioned cabin or outdoors."
        }, 
        {
            "index": 154, 
            "rating": "5", 
            "review": "the way to travel to cozumel. it was nice to travel in a ferry with a/c optional they play music on the roof top for the ones who want to enjoy the breeze and the sun while on the way to Cozumel and back."
        }, 
        {
            "index": 155, 
            "rating": "5", 
            "review": "Cheaper and Faster. Cheaper than Ultramar AND Faster!! What more could you ask for??? Definitely wear sunscreen if you are planning to sit on the upper deck. I prefer the air-conditioned cabin. :)"
        }, 
        {
            "index": 156, 
            "rating": "3", 
            "review": "Cheaper than Ultramar. I'm always feel dizzy in these boats but it's clean.Prices are just okey, is more expensive go to Cozumel than Isla Mujeres, I prefer the last one."
        }, 
        {
            "index": 157, 
            "rating": "5", 
            "review": "Ferry Service from Playa Del Carmen to Cozumel. This ferry service is new and has the best price of the ferry services ($9 USD). The crew aboard the ferry was very professional and spoke English with an open deck for seating and a very good air condition cabin with comfortable"
        }, 
        {
            "index": 158, 
            "rating": "3", 
            "review": "The cost was fair and the ferry was clean. Other than the girl who sold us our tickets trying to scam us out of a ticket by accusing us of not paying (which didn't happen), the experience was okay. The construction area where the ferry drops off and picks up in playa was loud and dirty, but the staff were fine and the trip was quick. I like that this company left on the half hour, it allowed us a little extra time to hang in cozumel before we headed back to Playa."
        }, 
        {
            "index": 159, 
            "rating": "5", 
            "review": "Better than ultramar. This boat is the same as ultramar, the service is the same and the schedules are roughly the same, but its about 100 pesos cheaper for round trip. Thankfully ultramar has competition now so they will have to lower their prices.I also recommend that you go early and return before 5 pm because the last boats are always PACKED and sometimes you have to wait for the next ferry if yours fills up.2 things about the prices:First, i saw someone said that its not fair that nationals get a discount on tickets, but keep in mind that some people use the ferry to commute to and from work. The discount is only for people with Quintana Roo ID, not all Mexicans. And second, round trip tickets are the exact same price as two one way tickets so i would recommend just getting a one way ticket so you're free to return whenever you please. "
        }, 
        {
            "index": 160, 
            "rating": "4", 
            "review": "Barcos Caribe to Cozumel. Beware the ferry hawkers EVERYWHERE in Playa de Carmen and go directly to the the official ferry operator - Barcos Caribe.Buy your tickets, queue up for the next boat and 30 minutes later you're in Cozumel having avoided haggling with various people wanting to not only sell you boat tickets, but all manor of other things to do on the island - car/bike hire, taxi tours etc - with no guarantee that what you buy in PdC will even be valid or well-priced upon arrival.The ferry was clean, punctual and did it's simple job very well. Would recommend them from experience as opposed to any other ferry company (which may be equally good, after all)"
        }, 
        {
            "index": 161, 
            "rating": "5", 
            "review": "Cozumel WOW for snorkelling. I really enjoyed my trip to Cozumel island, watch the video as you go over for places to visit, we went to chankanaab and it was brilliant,the fish where amazing,I would choose this ferry as its the cheapest and it's very clean and we saw flying silver fish, so keep an eye out for these as there was loads of them when we went,children are half price 12 and under,just check the timetable out online,quite easy to do.enjoyed the trip loads"
        }, 
        {
            "index": 162, 
            "rating": "5", 
            "review": "Great option to get to and from Cozumel. This is a great boat option to get to and from Cozumel. The price is a bit less than some of the other ferry options but drinks, AC and comfortable seating is still offered."
        }, 
        {
            "index": 163, 
            "rating": "4", 
            "review": "Good price, good ride. I took this ferry from Playa del Carmen to Cozumel and back. Pretty clean and was very pleased the A/C was on full blast. They come around and sell drinks for a good price. The ferry left to Cozumel right on time, but on the way back to PDC the ferry was delayed for about 45 minutes.Other than that the price was a bit cheaper then the other ferry companies."
        }, 
        {
            "index": 164, 
            "rating": "4", 
            "review": "Help on the High Seas. Our group wanted to take a day trip over to Cozumel. This ferry company was the cheapest rt/pp costing $20 each. Overall, the ferry was great. There were options to sit outside or inside, it left on time & arrived on time. My personal problem was sea sickness. We sat up top on the trip over and even though it was only a 30 minute ride, I started feeling ill right as we ported. On the way back I thought sitting in the air conditioned cabin might help me, but 5 minutes before we arrived, I nearly lost it in my seat. I bolted to the back where this lovely ferryboat attendant helped me to the bathroom. Unfortunately, the bathroom wasn't air conditioned so that didn't really help me but I saved all the other riders from my misery. The nice attendant checked on me once and then again when we docked. She helped me back into the cabin area to wait for my family. She stood me under a very cool A/C vent & gave me smelling salts. She was so kind. I wish I remembered her name to say Gracias! I would recommend this ferry boat for the price, timeliness, seating options & the kind staff who helped me when I needed it."
        }, 
        {
            "index": 165, 
            "rating": "4", 
            "review": "Decent trip. Cheapest mean of transportation to go to Cozumel. Absolutely affordable and convenient. Staff, amenities are OK. Definitely the best ship for this road."
        }, 
        {
            "index": 166, 
            "rating": "5", 
            "review": "Professional & friendly. Used them both ways to Cozumel. Left on time, pleanty of room & clean. I advise only buy ferry tickets one way, because you might be ready to leave & there is another ferry company (there are 3) leaving sooner than the one youve already bought. It was just coincidental they were the company leaving at both our times. We paid exact $10.00 USD per person each way.It takes about 30 minutes to go across."
        }, 
        {
            "index": 167, 
            "rating": "5", 
            "review": "Ferry ride to beach club. Took this ferry to Cozumel to a beach club. Wonderful trip - left on time; returned on time. Inexpensive - $10 USD."
        }, 
        {
            "index": 168, 
            "rating": "5", 
            "review": "Clean, comfortable and quick. We travelled to Cozumel on July 25th for a weeks vacation on the island. The Barcos Caribe was the next leaving Playa Del Carmen so we bought our 1 way tickets and waited. The Ferry Terminal is under construction so things were a little disorganized but we managed to find the correct line. Loading was done quickly and they tagged our luggage and gave us an id portion to prove that the bags were ours. The trip over was about 35 minutes with very comfortable seating and bar service if desired. Upon arrival we had to wait for all bags to be loaded from a 4 wheel dolly onto the baggage carousel........waste of 15 minutes since we tried to take them from the dolly ourselves but we're not allowed. Overall a great clean and friendly service that connects Playa Del Carmen to Cozumel. We will hopefully be able to use them when we head back to PDC."
        }, 
        {
            "index": 169, 
            "rating": "4", 
            "review": "Super clean and comfortable!. We used Barcos Caribe ferry from Cozumel to Playa del Carmen for the first time yesterday. We are very impressed with the cleanliness & comfort. This company offers the best value. All of the ferry companies have always treated us well but have to give Barco top rating in all areas of service."
        }, 
        {
            "index": 170, 
            "rating": "3", 
            "review": "sick an tired of the more expensive prices for international tourism while being in the riviera maya. The ride was okay but, I got sick and tired of the more expensive prices for the international tourism while being in the riviera maya.( 50% more expensive than national tourism)."
        }, 
        {
            "index": 171, 
            "rating": "4", 
            "review": "Quick and Convenient. We used Barcos Caribe to get across to Cozumel, the boat was quick and reasonably priced but don't sit at the front of the boat of you get sea sick it can get quite bouncy! Also make sure you grab a timetable as the boats don't come back from Cozumel every hour later in the evening."
        }, 
        {
            "index": 172, 
            "rating": "5", 
            "review": "The best value ferry to Cozumel. There are several companies that fight for your business to get you to Cozumel, but this one is legit! Quick, cheap ($10 USD each way), and they run back and forth all day and night. Don't get pressured by the hype guys outside the other ferries!"
        }, 
        {
            "index": 173, 
            "rating": "4", 
            "review": "ferry boat to cozumel. it was very nice and clean and on time,and a little cheaper than the others 135 pesos one way.You can sit on top oir in the airconditioned area inside,very comfortable seats"
        }, 
        {
            "index": 174, 
            "rating": "5", 
            "review": "$10.00 USD OR 135 PESOS - FERRY RIDE TO COZUMEL. Caribe started there business in February They are the least expensive. Buy one way tickets as the 3 different ferries do not accept each others tickets. On our trip only one of their boats was working, so the times were different on their website. They do update info on Facebook but you can call the terminal to make sure the times are correct (987 120 3982 ext 120). They serve snacks and drinks and the trip takes about 35 minutes. We sat on the upper deck and had a great view of the trip. If you are going to rent a car it is cheaper to do so on the island. There is one road that you travel that only goes one way. There is also a highway. Get the info from the rental company before you leave. To get to the beach it is 17 km away and you need transportation to get there. The charge for the other ferries was $12.00USD."
        }, 
        {
            "index": 175, 
            "rating": "5", 
            "review": "Great Ferry Service to Cozumel. We took this Ferry to Cozumel for the day. It was about $20/person roundtrip so a great value. They offer various times to depart and arrive so it works out well. Inside cabin is air conditioned and that was nice. It took about 30 minutes to get across to Cozumel. We sat outside on the way back and watched the sunset. A great value and a great ride."
        }, 
        {
            "index": 176, 
            "rating": "4", 
            "review": "Great Value - Spoiled by serious sea sickness (that was probably just me). We embarked on this ferry ship on our way forth and back from Playa del Carmen to Cozumel. The trip forth was during the daytime and we were sitting on the top section outside. The views at this level were AMAZING! I vividly recommend trying to board early so that you can rush to seat upstairs. Plus, I did not feel much sea sickness at this level (might have also been because my stomach was still empty at this point). The ride lasts about 35-45 minutes.On the way back from Cozumel, we sat in the bottom section. There, there was minimal views of the outside only but the ship had flat screen screens playing popular Youtube videos and short vines. There was also free wifi. It would have been perfect if it was not for the acute sea sickness I experienced. The ship was going so fast that it amplified its constant up and down movements. Moreover, I had just had dinner in Cozumel which I'm sure contributed to my discomfort. This 35 minute-ride felt like an eternity. I was trying hard to keep myself from throwing up the entire time. Eventually, a hostess noticed me and brought me a sickness paper bag as well as some cotton balls dipped in a strong alcohol (smelled liked rum). After smelling it, it lowered my sickness and helped me manage it all the way to the destination. I also felt comforted in the fact that many people around me also grabbed these rum cotton balls (even some who looked like seasoned ferry travelers). Overall, I do recommend Barcos Caribe but beware of sea sickness."
        }, 
        {
            "index": 177, 
            "rating": "5", 
            "review": "What a ride!. We spent about $14 usd one way for the ride from Cozumel from Playa del Carmen. It was fast, comfortable (air conditioned), great service, and most importantly, the facilities were clean."
        }, 
        {
            "index": 178, 
            "rating": "5", 
            "review": "30 minutes and $13 USD one way to Playa del Carmen. The ferry was on time, well run and offered smooth efficient transportation. Perfect. There were other choices but we made the right one."
        }, 
        {
            "index": 179, 
            "rating": "5", 
            "review": "fun ride. great service, very clean and organize. the crew members carry on plastic bags for people that may feel sick or need to vomit.price lower than other companies with the same service"
        }
    ]
}