{
    "category": "Playa-del-Carmen", 
    "entity": "UltraMar-Ferry", 
    "avg_rating_stars": 4.135021097046414, 
    "review_count": 474, 
    "rating_stats": {
        "poor": 12, 
        "average": 58, 
        "terrible": 25, 
        "very_good": 158, 
        "excellent": 221
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "Quick Trip across to Cozumel. For $12.00 round trip, a great ride across the ocean to do more shopping. Took approximately 30 minutes and provided either an open ride on the upper deck, air conditioned lower deck and the ability to have a cocktail while enjoying the ride. Neat to see Cruise ships in passing!"
        }, 
        {
            "index": 2, 
            "rating": "4", 
            "review": "Smooth ride. We went from Playa to Cozumel using them and went from Cozumel back to Playa a few days later on MarCaribe. Would def recommend them instead. The ride was way smoother. On the ride home we all had headaches and wnated to hurl! Ultramar had a fun badn to entertain us, the ride was outdoors so we really got to experience that beautiful turquoise sea and they had snacks, drinks and beer for not too much money. Wiould use them again. Buy your tix from the booth and not the people trying to \"help you\" down the sreet"
        }, 
        {
            "index": 3, 
            "rating": "3", 
            "review": "Rocky Ferry Ride. On the way the ferry was fine, the music was entertaining and the boat didnt leave on time, was scheduled for 11 and left around 11:15. They said it was the newest and fastest boat however Caribe left on time and got to Cozumel on time.Coming home the waters were extremely bad, the wind was blowing and the swells were no doubt about 6-8ft high. The boat was rocking and alot of people were seasick. The Caribe left on time as well, this ferry did not."
        }, 
        {
            "index": 4, 
            "rating": "1", 
            "review": "Told us the wrong time then refused to give a refund. We purchased tickets in a hurry at 12:30pm because we were told by the representative at the stand that the next ferry left in an hour (1:30pm). After we purchased the tickets we drove 7-8 minutes to the dock to find out that the next ferry does not leave until 3pm. Their company office is approximately 20 feet from the dock and therefore I walked to the office and requested to speak to somebody. Their best offer to a solution was they could refund me half of the money for our ride to Cozumel (and could use a different company) but that we had to return with them (UltraMar). I continued to ask for a full refund and they stated I had to go back to the stand I purchased the tickets at, I refused to walk that distance to receive a refund and miss the next ferry at 2pm (time offered by a different company). We were able to convince them to send a representative to us and we needed them to arrive quickly but they took their time. It was not until 2:30pm they decided to give us a refund, and I took the money and purchased the next ferry at 2:45pm from a different company. When we finally arrived at Cozumel at 3:45pm we found all the beaches were closed at 5pm. We only got a chance to eat and returned back to Playa del Carmen after the sunset and it was dark. We lost the day and sunlight due to this company not providing proper service. DO NOT USE THEM!!!"
        }, 
        {
            "index": 5, 
            "rating": "4", 
            "review": "rocking and rolling ride but super easy. we have always wanted to ride the ferry over to Playa Del Carmen, so we finally did it on our last trip there. The ride was great! However be prepared for a rocky ride if the seas are rough.The service was great and the boat was clean. You should know that if you sit up to you can get wet!! Nice crew!!"
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "Nice & Easy. We were lucky that the UltraMar ferry was leaving within 10 minutes of reaching the dock. A nice and comfortable way to travel to cozumel!"
        }, 
        {
            "index": 7, 
            "rating": "5", 
            "review": "Bien . Good service. Muy buena opcion para cruzar desde Cancun a Isla Mujeres. 2 opciones muelles para Cancun, Playa Linda y Playa Caracol (zona hotelera) Por 14 usd de costo, llegas comodo en butacas a tu destino. Con pantallas de tv. Si bajas en pkaya Caracol quedaras muy cerca dek Mall Forum.Very good option to cross from Cancun to Isla Mujeres. 2 docks options for Cancun, Playa Linda ( Torre escenica y Capitain's Jelly Rogers) and Playa Caracol (hotel zone) cost $ 14, you get comfortable in seats to your destination. Tv screens. If You choose Snail beach it's close of Mall Forum, downtown near artisan market.The crossing to Cancun takes about 35 minutes"
        }, 
        {
            "index": 8, 
            "rating": "5", 
            "review": "Great boat and axcillary facilities. This is a very good size terminal for the area. It could use some more clearly marked English language signs for the majority of the visitors to direct you to the correct locations and for the time tables. Otherwise, a couple of shops for refreshments and other travel goods. Great place to people watch if you got a little extra time on your hands or for a quick nap in my case after scuba diving all morning off Cozumel. The actual ferry was in great condition and plenty of seating for all the passengers. Does get busier in the evening compared to morning departures."
        }, 
        {
            "index": 9, 
            "rating": "5", 
            "review": "Pretty straightforward. Not much to review. The advertise wifi but it never works. At times the band can be annoying, so stay inside."
        }, 
        {
            "index": 10, 
            "rating": "5", 
            "review": "always choose Ultamar. have traveled several times back and forth over the years between Coz and Playa and have always chosen Ultamar. They are always have been on time when I have left both very late and early."
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "Like a fine aircraft, plus photos with a Mayan warrior.. While many prefer to ride on top, the air-conditioned interior was like riding first-class in a jumbo jet. During the ride to Cozumel, a young man in full Mayan regalia posed with travelers for photos. On my return, I noticed a full-service bar and purchased a cold drink which was most refreshing. The cool air and comfortable seats were what this old body needed."
        }, 
        {
            "index": 12, 
            "rating": "1", 
            "review": "Limited times to get back to cozumel. Almost missed our cruise ship because the ferry left late. They seemed more interested in selling drinks than on time service. Luckily the boat waited for our group. Not impressed. We tried to get on an earlier ferry but all the men said was \"it's impossible\"."
        }, 
        {
            "index": 13, 
            "rating": "5", 
            "review": "Great ride. Awesome staff they waited 15 minutes before departing due to our bus load of athletes and bikes all arriving a few minutes late. Was nice and cool sitting up in open decks and the island by night looked beautiful"
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "Commute to and from Cozumel. My wife and I were staying in Riviera Maya for our anniversary and had family visiting Cozumel at the same time. We decided to take the ferry over to visit them one day. My wife doesn't exactly love being on big boats because she gets motion sick. We decided to sit on the middle deck which is outdoors. Much to our surprise they offered snacks and drinks (for an additional fee of course) and a full band playing really good music. All of this kept her mind off of being on the boat and made it an enjoyable trip for both of us. I would highly recommend this ferry company over the other two options."
        }, 
        {
            "index": 15, 
            "rating": "4", 
            "review": "Easy process. Avoid all the \"salesmen\" go straight to the ticket office which is near the boarding area. We were able to ride in the top open air area both directions. Great no fuss service! Clean bathrooms too!"
        }, 
        {
            "index": 16, 
            "rating": "5", 
            "review": "Great fun live music nice ride nice view to Islas Mujeres. Great fun live music nice ride nice view to Islas Mujeres. Great view. No long waiting. Comes every half an hour"
        }, 
        {
            "index": 17, 
            "rating": "4", 
            "review": "Standard ferry. Between Cozumel and Playa del Carmen there are several options. All pretty similar but at different times and prices. Check each ticket booth for the option that suits you the best.The boat had indoor air conditioned and outdoor seating."
        }, 
        {
            "index": 18, 
            "rating": "5", 
            "review": "UltraMar Ferry crew saved our vacation!. My wife accidentally lost her wallet on the 7am trip from Cozumel to Playa del Carmen on Tuesday, August 30, 2016. We didn't notice it until we reached the bus station where we had intended to take the Airport Bus to Cancun. We panicked and rushed back to the boat which was just about to return to Cozumel. My wife explained what happened to the person who was supervising the boarding. He graciously allowed my wife to run down to the boat to search for her wallet. As she rushed to the boat he called the captain on the radio to ask for some time and help. Once my wife boarded the ship she looked in vain for the wallet. Tears came to her eyes as she realized that it must be lost. Then almost miraculously a crew member descended from the bridge with the lost wallet. One of the crew members apparently found it and immediately took it to the captain for safe keeping. We can't thank the captain and crew enough for their kindness and help. We enjoy scuba diving on Cozumel several times a year and part of the fun is the ferry ride. It's amazing to us how friendly and nice the people are in this area. We feel so comfortable and welcome. Thank you so much for making our vacation a memorable one. We love you! Steven & Katherine"
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "Easy. Decided to do off the cuff. Cheap easy ( band on board were excellent) air conditioning could not fault. 45 mins ish they run every half hour and signs up everywhere. Tip don't book return as it makes for a more flexible day."
        }, 
        {
            "index": 20, 
            "rating": "5", 
            "review": "Ferry from Cancun to Isla Mujeres. Take a local bus to Puerto Juarez (look for the sign in the front window of the local bus). Another option is to take the R-1 bus to downtown Cancun and board a combi (little van, at a nominal cost, for the rest of the way to Puerto Juarez). At Puerto Juarez, exit at the first stop, walk through the huge parking ramp, to find the ticket office for the Ultra Mar ferry. They do not accept charge cards. There is an ATM machine there if you don't have pesos. Taking the ferry that departs from Puerto Juarez to Isla Mujeres is much cheaper than going on the ferry that departs from the hotel zone to Isla Mujeres."
        }, 
        {
            "index": 21, 
            "rating": "5", 
            "review": "Nice ferry ride to Cozumel. We took the ferry round trip to Cozumel, The staff was nice, boat was clean and nice and a good band played going both ways, Our return trip was made during a large storm so it added excitement, but it was still fun for all of us."
        }, 
        {
            "index": 22, 
            "rating": "5", 
            "review": "Smooth and quick ride, I recommend it. Reasonably priced smooth ride over from Cancun to Isla Mujeres. What can you say about a ferry but I have to use 100 characters so they will post this."
        }, 
        {
            "index": 23, 
            "rating": "4", 
            "review": "Quick trip to the Mainland. A comfortable trip from Cozumel to Playa del Carmen and back. Air conditioned, full bar and snacks, comfortable seats. A 45 min trip. $10 each way."
        }, 
        {
            "index": 24, 
            "rating": "5", 
            "review": "On time, comfortable. We use this ferry to go from Playa del Carmen to Cozumel and back, staff was very attentive with my mom needed special assistance. On time and comfortable spaces."
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "Comfortable and fast. Good option to cross between Playa del Carmen to Cozumel and vice-versa. Good service, with a full bar and waiters going around offering snacks and drinks. A/C which is key in the heat of the Yucatan peninsula. In little under 30 min you make the trip."
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "Alex . Got advice to take this Ferry to Catano... Super cheap only $1 round trip and you are transported to a different town and safe 👍🏾"
        }, 
        {
            "index": 27, 
            "rating": "5", 
            "review": "Great time!. About a 45 minute ride from Cozumel to Playa del Carman. Had a live band on board that was very entertaining. On the ride back - same band and had mixed drinks and snacks for purchase. Would definitely ride again!"
        }, 
        {
            "index": 28, 
            "rating": "3", 
            "review": "It's a ferry and then some. Ok it's a ferry from playa to Cozumel. If you want to sit in a/c, they have it. Want to feel ocean breeze, check. You want some sun, A+✅. Entertainment? You betcha. We got the ferry to and from with the same Cuban karaoke dynamic duo. On the way to, very entertaining. Coming back, it was the same set list but if you took video of the female performance, it may be a little NSFW. Hey, anything for tips, right? One word of caution, do not get a car rental from playa for Cozumel. I won't go into it but if anyone from the ticket booth wants you to rent from Iguana Tours for a car, don't do it. It was terrible. There are many car rental services in Cozumel once you get off the ferry and the prices are very reasonable. But again do not let yourself be led to a little office behind the senor frogs. Big waste of time."
        }, 
        {
            "index": 29, 
            "rating": "4", 
            "review": "It's a ferry. It got us to Isla Mujeres in about 20 minutes. Not sure what else you can say. It's a boat, it didn't sink, and it was quick. I did have luggage with us and the staff took it from us and loaded it into its own area with other luggage so I didn't have to carry it, that was a plus."
        }, 
        {
            "index": 30, 
            "rating": "4", 
            "review": "good value. My wife and I wanted to visit Cozumel so we took the ferry over , it took about half an hour , on the way over we sat inside but on the way back sat outside , outside is the best way, we saw a dolphin on our return trip, not expensive , fairly frequent , trips and excursions are offered on board if you want to do anything on cozumel. Drinks are for sale also if you need one ."
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "To Isla Mujeres. Took the ferry over to Isla Mujeres. Great view of the water. Sat inside going over and sat on top coming back. Best seat up top. Great views and wind blowing to cool you off."
        }, 
        {
            "index": 32, 
            "rating": "4", 
            "review": "Great service. We used all 3 ferry services while we were down there and thought Ultramar was great. Ultramar and Mexico Waterjet are about the same price - more expensive than the other one. The thing I liked better about Ultramar is their outside seating was better. But in all honesty, I would take whichever ferry was leaving the dock first."
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "Amazing ride! . We always travel via UltraMar Ferry over to Isla Mujeres from Cancun. The first good view of the spectacular blue water when we arrive in Cancun. Air conditioned! / or ride on top in the sunshine and breeze. The staff is willing to help you with your luggage. The new port on Isla is very nice too. $9 ( US dollars) per per person round trip. Only about a 20 minute ride, and red room available. You can buy your tickets at either port terminal."
        }, 
        {
            "index": 34, 
            "rating": "5", 
            "review": "Got us to and from Cozumel on time and on budget!!!. We decided to leave our rental car at a lot in Playa Del Carmen and just use the people ferry over to Cozumel for our 3 night stay. Glad we did. The round trip ferry service for a family of four was $57 USD. One trip on the car ferry for a family of 4 was quoted as $80 for just one way. So, this was the way to go. Plus, cabs in Cozumel are regulated so fairs are predictable. They checked out large bags as we neared the vessel and baggage claim after the trip was easy. We sat upstairs in the open area where unbeknownst to us they have live 'entertainment'. A karaoke version of the song and the performer sings. Not bad since it's included. If this is too loud or bothers you, just head inside! Drinks were good and were affordable. All in all we will use UltraMar again when we head back to Cozumel."
        }, 
        {
            "index": 35, 
            "rating": "3", 
            "review": "Ferry trip to Cozumel. After using all three regular ferry services to Cozumel during a recent diving trip, not sure I have a significant preference for any of them, hence the average review. Trips were fine, seas were relatively calm, and none of the ferries left on time (all within 10 minutes of schedule). Ultramar had the best outdoor seating on the big second deck with plenty of covered seats. Not being a catamaran, Ultramar probably is a bit slower but didn't really notice since we sat outside both trips."
        }, 
        {
            "index": 36, 
            "rating": "4", 
            "review": "Excellent water service . Since we spend our vacations on Isla Mujeres, riding the Ultramar is mandatory. Fun and accommodating, plenty of snacks and drinks. Always a decent guitarist to entertain for the short ride over."
        }, 
        {
            "index": 37, 
            "rating": "4", 
            "review": "We take the ferry everytime. We frequent Playa del Carmen and take the ferry across to Cozumel every time. It is our favorite thing to do. It is fairly quick, 30-40 minutes and comfortable. My daughter tends to get sea sick and she had managed to avoid it on the ferry. It is never really busy so we can spread out and get comfortable on the ferry and relax for the ride. There is a video that they show on a big screen, it has good air conditioning, and there is a guy or gal that come around with snacks that you can purchase. You can also take you snacks with you when you board the ferry."
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "Fast and timely Ferry between Cancun and Isla Muejeres. It is a 20 minute (beautiful) ferry ride from Cancun to Isla Muejeres, leaving every 30 minutes at the top and bottom of the hour. The cost is around $8 round trip. I purchased tickets through their website a few days ahead, where they send an email voucher that allowed me to pick up the tickets once we are arrived at the terminal in Cancun. I am not sure how much time this saved us, but this is an option.The Ferry only holds 250 people. Get there early, say at least 15-20 minutes before to get inline (with tickets), so that if the boat fills up that you do not have to wait for the next boat.There are two levels: the top is open (outside) and the bottom is inside with air-conditioning. They ask if you have wet clothes or item to seat upstairs. If you have luggage, you will be asked to store them at the back out of the boat, so remove any valuables before getting onto the boat, since you will be separated from them during the trip.They do sell snacks and drinks on the ride."
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "Loved it!!. Its great to take the ferry over to Cozumel!! It takes 45 minutes each way and I recommend you buy a one way. Why? IT time restricts you from all that you will want to see AND IF MISS IT, YOU HAVE TO BUY ANOTHER TICKET !! It runs 365 days a year and on the hour 6am-10pm"
        }, 
        {
            "index": 40, 
            "rating": "5", 
            "review": "Fast and innexpensive. We traveled round trip from Cozumel to Playa del Carmen. Fast and inexpensive. The trip across is about 35 minutes. Leaves you off in the center of Cozumel and Playa del Carmen."
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "Must do . We use the ferry every time we are in Playa. It is always on time and a quick way to visit Cozumel for the day! Oh and it is very inexpensive."
        }, 
        {
            "index": 42, 
            "rating": "5", 
            "review": "Great Ride!. Our group of six took the UltraMar Ferry to Cozumel. We wanted just a short visit of a few hours. The employees told us the best times to travel to avoid the cruise ship tourists, which was about 4 in the afternoon. The ride was smooth, the scenery breathtaking, and the entertainment was thoroughly enjoyed by all. I would recommend UltraMar to anyone who is looking to visit Cozumel."
        }, 
        {
            "index": 43, 
            "rating": "5", 
            "review": "Excellent.. We took the ferry from Playa Caracol. The first ferry at 9am and we come back in a 4:pm something ferry. No issues, a very nice trip. Only a little advice. My husband did not read that the ticket says \"Do not separate the sections\" and ripped the ticket for boarding the ferry with the intention of saving the return section in his wallet. Do not do that! Some guy in charge scolded us \"Pero porque lo ripio!!!\" and the lady that was in charge of boarding too. No idea why because the different section of the tickets have the same serial number, indicating they were part of the same ticket. That was the only little issue. We felt safe, the ferry is clean, it was in time and we had a very good time in Isla Mujeres."
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "Fast and fun - worth the money!. This ferry was only a five minute walk from our hotel. For $19 US round trip, just the ferry ride alone was worth it! The downstairs is covered and air conditioned, and upstairs gives the most incredible views. I kept taking pictures of the water! It leaves every 30 minutes and takes about 20 minutes to get to/from Cancun Isla Mujeres. A perfect day trip with my husband and 8 year old son."
        }, 
        {
            "index": 45, 
            "rating": "5", 
            "review": "Fast, friendly. Nice and big, indoor/outdoor sitting.We sat outside and we had a live band play on our trip to Cozumel from playa.They drinks, snacks for sell also, did not leave on time, but I was fast and felt safe."
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "on time and easy!. This ferry from the Hotel Zone to Isla Mujerles was super easy to find and ran right on time, every hour on the hour to the island, and every hour on the half hour back to the Hotel Zone. The reps were friendly and answered all our questions. Seating available on the top level if you want sun or in the cabin if you do not. Snacks available for the 20 minute ride. $19 per person round trip."
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "Live entertainment now, both ways. My girlfriend and I were staying a week in Cozumel and decided to go to Playa Del Carmen for a day.When we got to the ferry ticket office across from the town square, there were not less than three people that spotted us as dumb tourists and ushered us to the ticket window where there was no line and several clerks. The tickets were $8 one way which is crazy cheap for a ferry boat. It was very well organized and the people were ultra nice and helpful. We went out on the open air area of the upper deck, and, to our surprise, as soon as the boat was underway, an entertainer appeared, a guy in dreadlocks but dressed very nice and he sang songs like Frank Sinatra, mostly in Spanish. He had his own amplifier set-up and apparently worked for tips.On the way back, there was a four man rock ensemble and they were great. They played a variety of rock music, mostly sang in English, and we loved it. We gave them a generous tip, and they handed me a CD.Very very fun pleasant trip. You have a choice of ferry companies, just pick the next one to leave."
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "Smooth ride. It cost $10 US each way. The ride is a little over 35 minutes. The view is fantastic, especially if you see a cruise ship. It's cool to see the giant Mexican flag at the Cozumel dock. There was live music on both trips and snacks available. Well worth a day trip to the island. Check out the museum just a few blocks from the pier."
        }, 
        {
            "index": 49, 
            "rating": "5", 
            "review": "Clean and smooth ride. We had our luggage with us and the staff helped out the entire time stowing it and having it ready for us as we departed. The ferry was clean and we quickly got to the island."
        }, 
        {
            "index": 50, 
            "rating": "4", 
            "review": "Fast and efficient . We stayed in Puerto Juarez a stones throw away from the ferry and rode it almost every day while here. It's fast and efficient. 146 pesos (~8 USD) for a round trip. Inside is air conditioned. Upstairs is a nice view. Sometimes there is a man with a guitar playing. Avoid."
        }, 
        {
            "index": 51, 
            "rating": "4", 
            "review": "Beware of Pre-Paid Tickets. First, the ferry was on time and very clean. They even had entertainment on the upper deck. I have no complaints at all about the actual ferry service which is why I'm giving it four stars. However, I purchased round-trip tickets for 8 people through my credit card using points from their reward program. We were able to board with no problem going to the island. Coming back was a different story. They kept saying they couldn't find the reservation and we actually missed one ferry while they fooled around with this. Since we were flying home and had to meet the shuttle, this didn't sit well because we were held up for 45 minutes. One of the employees even told another we were lying in Spanish but my friend knew what she said and called her out on it. They finally allowed us to get the tickets which we had already paid for. If the company is going to offer this kind of deal, they need to be prepared to honor it - we were not going to pay for tickets twice. I'm sure buying tickets there would have been no problem."
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "3rd time in 2 years - always good!!. We've been over to Isla from Cancun 3 times in 2 years with two kids & we've used Ultramar from both Gran Puerto (X1) & Playa Tortuga (x2). Both were very good rides, even in a rain storm this last time! Highly recommend them!! They are efficient & will load & unload your luggage if you are staying is Isla too, as we did."
        }, 
        {
            "index": 53, 
            "rating": "4", 
            "review": "Ferry service to Cozumel. There are actually 3 ferry service companies that run between Playa del Carmen and Cozumel. They leave on the half hour and hour so it's easy to get a ride. It is less expensive to purchase a round trip ticket. The drawback is that you do have to ride back with the same company. We chose to ride round trip on the Ultramar because it was leaving the soonest. We were going to wait (there were 5 of us)because the ticket was more expensive than the other two companies, but they gave me a discount, so even ferry tickets are negotiable.The ticket booth gave us the return ferry schedule, so it made it easy for us to find a convenient time to return.Do take caution if you are planning to return late. The last boat can fill up and then you will have to wait until morning to return. One of the hotel workers told us it had happened to her the previous week."
        }, 
        {
            "index": 54, 
            "rating": "2", 
            "review": "Rude ticket sales women!!. Pros:Ferry is very punctualRuns every 30 min until 11:30pm There is an air conditioned waiting room close to the men's restroom.Cons:Only 2 of the ticket sales women were niceOne was especially rude and extremely unhelpfulIf you purchase your ticket beforehand, you must bring a printed voucher. They will not accept an email confirmation.No one in the ticket office will be nice enough to help you out here."
        }, 
        {
            "index": 55, 
            "rating": "5", 
            "review": "What great Fun, Adventure and Entertainment!. We decided to got to Cozumel for an afternoon for the fun of it. Though it is largely a series of cruise ship docks and anchorings it is beautiful and different in its own right. The plaza at both Playa Del Carmen and Cozumel near both docks are fun a worth a look. An easy cab ride to the terminal from locations in Playa Del Carmen. Take the UltraMar Ferry. Blue and yellow \"and\" big really easy to spot.The real story hear is the crazy fun of riding the ferry with all the locals and Mexican tourists sprinkled with a handful of international tourists.The breeze is always blowing it seems in Playa. Beautiful breeze actually. The large safe passenger ferry makes its way to Cozumel in about 45 minutes dock to dock.On this day we sat by the Port side of the ferry and we were sprayed by lovely warm seawater as we cruised through some waves. The boat gently rocked but never scary. Just perfect actually.I addition we had the fantastic entertainment. A reggae singer on the way over with people dancing including one crew and plenty of laughter and smiles.On the return cruise we had a four piece blues in Espanol band. What fun.In addition we had a Tupperware convention group on board. Probably gathered for a weekend sales and celebration event. These ladies rocked the trip. Laughter and singing is always good.Felt like we were miles away on some wonderful adventure. Certainly made our day and would not want to have missed that adventure in our three week visit to Playa Del Carmen and our lovely unique stay in the “singular” Petit Lafitte Boutique Hotel."
        }, 
        {
            "index": 56, 
            "rating": "1", 
            "review": "Chaos!. They do not not card payments even though they advertise that they do, the lady that sells the tickets was running late and none of the other staff members know how to sell them. So by the time she got here 20 minutes after the ferry was scheduled to leave there was 50 people at least in a line trying to all buy tickets at once. They also charge an extra $3 US than there advertised price for no apparent reason."
        }, 
        {
            "index": 57, 
            "rating": "3", 
            "review": "Rough water, smelly boat. The ride to Cozumel was rough. The whole boat smelled like bathroom cake and I had to close my eyes or I thought I would puke from the choppy ride. I have never been sea sick in my life, but this was a tough 15-20 minutes to handle... I know it isnt really the boat's fault. There was a band playing music on the outer deck which was pretty good and fun, but the smell coming from the bathrooms and encompassing the entire inside the boat was just horrific..."
        }, 
        {
            "index": 58, 
            "rating": "3", 
            "review": "Ok, but no other options that we knew about. These folks were late both ways. On the way over 45 min and on the way back about 1 hour. Save your money to rent a golf cart when you to your destination. Try to sell you cheezy photos you have to pose for before boarding."
        }, 
        {
            "index": 59, 
            "rating": "5", 
            "review": "Fast Ferry to Cozumel, and great entertainment.. We were in the UltraMar Ferry to Cozumel. I bought the online tickets from their website for traveling from mainland to Cozumel. But you also can buy it at the port as well, no need to buy it online. It took about 30 mins to reach Cozumel Island. On the ferry, there was a small performance of live band. Would love to recommend this ferry company."
        }, 
        {
            "index": 60, 
            "rating": "4", 
            "review": "Always a smooth quick ride. I've ridden the Ultramar Ferry many times from Cancun to Isla Mujeres I have always had a great ride this year in April we went to Cozumel flew into Cancun took the Ultramar ferry from Playa de Carmen to Cozumel even though it was pretty rough that day was still a great ride they help with your bags actually took them just like they would have if they are on an airplane so that you don't get the wrong one or somebody doesn't walk off with yours there's always music... snacks and if it's hot out ... air conditioned inside I believe there are two or three different ferry that you can take after taking a couple I like the UltraMar the best I believe they're all about the price I would use ultramar....."
        }, 
        {
            "index": 61, 
            "rating": "4", 
            "review": "Great Ferry. We bought our tickets before we left online and had absolutely no trouble getting a ferry voucher. Grab a beer or soft drink before you get on the ferry, sit upstairs, and enjoy the ride. Tons of seats, nice people, beautiful ocean, and always on time. On the returning ferry and guitarist played the time away...highlighly recommend!"
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "Nice Ferry Ride. We took the Ferry to Cozumel, costing 300 pesos each round trip. The ride was very nice, the ferry was clean and the crew were fun. They offered snacks and drinks for the ride and even had a band for entertainment. It was very enjoyable"
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "Quick, fun good schedule plus onboard entertainment!. Ferries from Playa del Carmen run everyday and quite frequently, you have many options to choose from. We took UltraMar (the blue and yellow boats). We paid 300 pesos round trip and boarded the next departing boat. It takes about 45 minutes dock to dock and we had onboard live entertainment, a 4 pc band doing covers and getting the passengers into the music on the way to Cozumel and a singer on the return trip.If you are prone to motion sickness go topside and sit in the middle to middle aft (less rolling and pitching) so you can keep the horizon in view. Avoid the side seats unless you don't mind a salt shower if the water is rough. Very enjoyable and professional staff."
        }, 
        {
            "index": 64, 
            "rating": "3", 
            "review": "Wish I had researched this part more. With all the research I did for my first trip to Mexico I neglected to read more detail about the part where I took the ferry from Playa Del Carmen to Cozumel. Our airport transfer driver basically brought us to the ticket booth for UltraMar - I just didn't realize there were multiple ferry companies. Don't get me wrong, I was fine with the ferry ride, just wish I knew a few things. One - it is not great to buy your return ticket ahead of time because then you are stuck with that specific ferry boat unless you want to pay for new tickets. When we returned we had just missed the 11 a.m. ferry and had to wait until 12:30 for the next boat. There were other ferries leaving at 11:30 and 12 that we could have taken if we did not already have tickets. This would have been okay if we didn't have all of our luggage with us. The boat ride was enjoyable - we sat on the top deck and enjoyed the sunshine. We were not expecting the entertainment. On our trip over it was a trio of musicians and they performed some fun songs - a few from my zumba class so that was fun, but they wanted tips at the end and I didn't like feeling like I needed to pay additional money for the entertainment that I was not expecting to have on the trip. On our return trip we were at least aware that it was going to happen so it was our choice to still sit on top even though there would be an entertainer. This time it was a solo male singer with a karaoke machine and it was just not very good. Bottom line - buy your ticket only when you are ready to go - there are multiple ferry boats at different times each day. UtraMar was a great ride, but know that there are singers on the top level. Unfortunately I don't know what the bottom part of the boat is like."
        }, 
        {
            "index": 65, 
            "rating": "4", 
            "review": "Pretty good, although.... I enjoyed the ferry ride - it's more expensive than other ferries to Isla Mujeres but overall is worth the extra. The boats feel well maintained and the staff feels more happy to be there. I took the ferry from Puerto Juarez instead of Playa Tortuga or any of the other Zona Hotelera beaches - Puerto Juarez is much cheaper comparatively for identical service. Carry pesos, the exchange rate will screw you if you let them - but that's as with anywhere else in Mexico. The one caveat - they say the lower deck is air conditioned: it is, but if you sit by the windows in the lower deck then you don't have the full effect of A/C. It may almost be worth it to trade off for an upper deck seat."
        }, 
        {
            "index": 66, 
            "rating": "4", 
            "review": "Isla mujares and Isla contoy. The ferry ride was nice food was good in Isla contoy . But the waiting time before the ferry ride from cancun can be cut short so we can get more time in Isla mujares . In Isla mujares we only got one hour . That was the only thing . Overall the trip was good"
        }, 
        {
            "index": 67, 
            "rating": "4", 
            "review": "Nice, comfortable transportation...with entertainment!?!. Just a couple of points to make about this service. My wife and I used the one in Playa del Carmen to visit Cozumel. There are a couple different ferry companies, but I just liked the color of the boat, and that's how I made my decision. The ferry is located near 5th & Juarez in Playa del Carmen, and as you walk through the park/town square, there are a ton of vendors. There is also a restaurant, I think it is called Mexico Loco, but it is just past the ADO bus station and start walking toward the beach on the left. It had really good 'lemonade', in Mexico lemonade is actually limeade, but it hit the spot on a humid day. If you linger in the park area, you will get bombarded by little kids trying to sell their trinkets. It is sad to see, but once we told them, 'No thank you' (Or, \"No, Gracias\" in spanish), they walked away. As we got closer to the ferry, we had people asking if we were taking the ferry, and my mistake was that I started talking to someone before getting to the Ultramar booth. I got to the booth and purchased our tickets, I did one way because I wasn't sure what time we would head back, incase Ultramar didn't have the time we needed to leave. You don't save any money by purchasing round-trip, it is the same cost. After getting our tickets, the guy I talked to before the booth, was still standing there wanting me to 'help' me plan activities like renting a scooter while in Cozumel. Don't fall for this, there are other people on the other side that will actually have the equipment, I handed him my change in pesos and walked away so he would leave me alone.On the boat, you can sit on a bench outside or go in the inside where it is crisply air-conditioned. On the way to Cozumel we sat outside on the covered area, it was a nice ride, then we got entertained by a singer with huge speaker, looking for money. He was pretty good, but it was a little annoying that the company and employees allowed this, as some of us don't want to sit and listen to music we don't know, especially that it was blaring. My only other comment is that they have drinks and snacks on board that are pretty cheap compared to other places. I paid in pesos, which is typically cheaper than paying in US Dollars."
        }, 
        {
            "index": 68, 
            "rating": "5", 
            "review": "Nice way to get to Isla Mujeres. Quick trip to get to Isla Mujeres. Price is very reasonable and has plenty of seating inside and out. Runs every half hour so you can spend as much or as little time as you want on the island."
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "Fast and Fun. I have ridden the ferry several time from Cancum to Isle Mujeres. They leave about every half and hour during the day. It cost 10 Dollars round trip for each person. They load you up quickly and get you off even faster. Today, we had a musician playing on the top deck for our entertainment and tips. They have clean restroom in the port and also on the boat. The boat also have beverages for sale. Just a fun way to spend sometime and then walk around Isla Mujures."
        }, 
        {
            "index": 70, 
            "rating": "5", 
            "review": "Quick transport to Isla Mujeres. The Ultramar ferry is a quick way to get from Cancun to Isla Mujeres or to Cozumel. They have service from a number of ports in the hotel zone. There is usually a mariachi performing on the outdoor deck which is nice for first time riders but can grow old fast for returning visitors and locals. Have some pesos for tip ready!"
        }, 
        {
            "index": 71, 
            "rating": "4", 
            "review": "Cheap, Regular & Quick. Took the ferry over to Cozumel mainly to get a present for my daughter from the island but found it to be quick, reliable and relatively cheap return at £12 return in Pesos.\nThere is plenty of room even when busy and the lower deck has a/c.\nAll in all a good experience"
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "Clean Enjoyable ride. Recently my wife and I traveled to Cozumel by way of the Ultramar Ferry. Surprised at the cleanliness and efficiently run operation. The ride was smooth and only 35 minutes for 165.00 pesos one way. 300.00 if you prefer to take their round trip. They serve beers and mixed drinks while on the voyage."
        }, 
        {
            "index": 73, 
            "rating": "5", 
            "review": "An ideal transport for convenience and speed. An ideal transport for convenience and speed, very spacious, with an outdoor area where you can enjoy the view while traveling or if you prefer an enclosed air-conditioned area."
        }, 
        {
            "index": 74, 
            "rating": "3", 
            "review": "Your getting what you pay for.. The ferry the Isla Mujeres from Carasol terminal is affordable, about $19 usd. It's also quite fast for a boat of its size. The crew are pleasant and the vessel was obviously sea worthy. The draw backs are that the lower cabin is stuffy and un-comfortable even with a/c going. Also the ticket staff over charge you for a golf cart rental on the oldest most poorly maintained carts of the island. Don't take their suggested deals. Better yet, take the R1 bus Puerto Juarez and take the good ferry. It's cheaper, faster and more spacious."
        }, 
        {
            "index": 75, 
            "rating": "1", 
            "review": "Dont go to Isla Mujeres on the UltraMar Ferry. I went to Isla today, and the ferrys are not running often enough. It took us almost 2 1/2 hours to get on the ferry in Cancun at Puerto Juarez, and we had to wait for the third ferry to return us to Puerto Juarez. If you want to spend almost 4 to 5 hours waiting for a ferry to visit the Island, that is your choice, but not mine. Don't know what is up, perhaps a budget cut."
        }, 
        {
            "index": 76, 
            "rating": "4", 
            "review": "Fast and furious Ferry boats.... There are 2 different companies for Ferry, the price different is 8$/pp vs 9$/pp, you pick one...it goes fast...recommended to take sea sick pill if you think you will be sea sick...First floor inside is AC freezing cold..."
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "Perfect. Perfect way to expore a beautiful country.. wish I had takem more ferries whilst I was in mexico.. From arriving at the port to buying tickets, waiting for the ferry and whilst on board. The whole experience was faultless!"
        }, 
        {
            "index": 78, 
            "rating": "5", 
            "review": "ferry trip. well worth the 20$ just to get out on the gorgeous water. Enthusiastic local entertainment-be sure and tip. Great inexpensive outing to explore the island and see something different than crazy cancun. The dock at playa de tortuga had bungee jumping over the ocean(40$), surprisingly good food, souvenir shopping and a festive atmosphere."
        }, 
        {
            "index": 79, 
            "rating": "3", 
            "review": "Perfect way to get to Isla Mujeres. The husband and I wanted to visit Isla Mujeres and UltraMar Ferry was recommended. It was a quick and efficient trip... don't expect anything more than just a boat ride to the island. It was $4 one way and easy to reserve, however, they could not find our reservation regardless of the email we showed them. Our email had our confirmation number and proof of purchase. After a while and wait, they finally gave us our tickets. The window seats as expected were seated fast. The water is very beautiful to look at riding on the ferry from Cancun to Isla Mujeres, however, the window gets washed away by ocean water."
        }, 
        {
            "index": 80, 
            "rating": "4", 
            "review": "A relaxing start and end to our vacation in Cozumel. One way tickets were $10 USD each and ferry was clean, comfortable, large. Places to sit indoors, in A/C, or outside on metal benches (covered on top). Snacks and drinks, including beer, available on board. We had our luggage with us and were instructed to drop it off in one area and the porters would load it onto the ferry. They give you luggage claim slips so don’t lose yours. 30 min trip to Cozumel. Sit outside and scan the sea for flying fish! I really enjoyed just watching the blue colors of the ocean and feeling the warm sunny breeze on my skin – it helped put me in a relaxing mood for the start of my vacation. When we arrived at the Coz ferry dock, the porters loaded the suitcases onto a baggage cart and transported it 50 ft away onto an oval conveyor belt in a “secured” area. This took longer than it did to get all the people off the ferry. We pulled our bags off the conveyor belt and had our luggage slips ready to show the security personnel at the exit of the secure area. It will go faster if you have a few dollars in your hand along with your luggage slips. On the way back a few days later, we also dropped our luggage off with the porters and gave them a few $ tip, then retrieved it at PDC where they just put the bags out behind a tension barrier and you pointed to your bags (with $ in your hand) and they handed you your bags. This was faster than the conveyor belt that they used the first time. Either way, the key is to always have a few USD in your hand when you ask for something. There was a band on board in the upper deck/outside area and they played live music while we rode across to PDC. They also came around with a tip jar and were selling CD’s. They were not bad at all and they sang alternating songs in Spanish and English. Again, snacks and drinks were being sold as soon as the ferry left the dock. I find the ferry to be a pleasant experience, and UltraMar has very nice ships."
        }, 
        {
            "index": 81, 
            "rating": "4", 
            "review": "Live music whilst enjoying the crossing. Ultramar is a standard ferry which plies the Cozumel to Playa crossing. 30 min approx gets you across. On this occasion there was live music to keep the passengers entertained. Food and drink can also be purchased. Seating is both inside and outside - outside under cover and in full sun."
        }, 
        {
            "index": 82, 
            "rating": "4", 
            "review": "Quick and Efficient. $19 round trip per person from Cancun to Isla Mujeres. The ticketing process and boarding process was fast and efficient. The ride to the island was smooth and took no more than 20 minutes. The boat seemed well maintained, had bathroom facilities, indoor and outdoor seating. At the end of the day be sure to queue up early as the ferry terminal can get quite busy with everyone trying to leave the island."
        }, 
        {
            "index": 83, 
            "rating": "3", 
            "review": "Just ok. The boat seemed a bit run down. Easy to purchase tickets. Nothing special. Went to Isla Majeres island. Had no problems going. Returning the boat was 37 minutes late. That's too long to wait in the hot sun. They also had no one to explain to us why is was so late. Just so so. Take smaller type boat if possible. We paid $19 us per person."
        }, 
        {
            "index": 84, 
            "rating": "5", 
            "review": "Nicer than I expected. We took the ferry one day to Isla Mujeres. The seats on the ferry are basically what you ride on when you take a charter bus, very comfortable. The ride was very smooth. Two gentlemen walked around with papers to rent a golf cart on the island. It was only $35.00 USD for the day. You really cant beat that. The golf cart we had was pretty beat up but, for $35.00, I wasn't surprised. I will definitely be taking the ferry again when I return to Cancun."
        }, 
        {
            "index": 85, 
            "rating": "4", 
            "review": "Across to Playa del Carmen. We boarded the ferry and it left promptly as scheduled. The trip across the water was quick (20 minutes) and the waves were of no real concern until we docked at the pier in Playa del Carmen. The water was anything but calm on that side. The dock staff secured the ferry effortlessly and assisted every single person from the rocking boat. The return trip home left on time as well, but the waves were gigantic this time ! The captain maneuvered the ferry really well through the 30' swells and we docked safely back in Cozumel, although it did take about 45 minutes through those waves."
        }, 
        {
            "index": 86, 
            "rating": "5", 
            "review": "Purchase Tikcet either online on at place!. Getting a Ticket for $9.00 was a bargain to to go Playa Del CarmenLoved that they come and go every 30 mts I believeThis Ferry was very convenient and the agents were very pleasant!"
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "It's a Boat Ride!. During a recent visit to Playa Del Carmen my wife and I took the UltraMar ferry to Cozumel. This is a boat ride folks, not a cruise ship! If you're prone to motion sickness don't spoil your trip by failing to take an appropriate dose of motion sickness medication. This will be a ride with a lot of motion even under the best of weather conditions, and will take between 30 and 45 minutes depending on wave conditions."
        }, 
        {
            "index": 88, 
            "rating": "4", 
            "review": "NICE FERRY RIDE TP COZUMEL. We took the ferry from playa del Carmen to Cozumel . It's approx. 25 mins across . If you have never been on one before , take gravol . It helps take the queezy feeling away . Actually I found sitting downstairs a lot more comfortable . It's air conditioned and has a big screen tv , and padded seats. They do sell snacks and drinks as well ."
        }, 
        {
            "index": 89, 
            "rating": "4", 
            "review": "Took the UltraMar ferry to Cozumel on 03/17/2016 for $10.00 US/each. I picked this ferry because the female employees at the ticket office looked professional and there was nobody in line.I thought the Ferry ride was fun but it was a windy day and many looked sea-sick.The seating area on top was full and my wife was disappointed we couldn't sit there. After we got started and hit the waves the sea started to splash on top and the people came running down to the inside/air conditioned seating.The boat rock and rolled but I thought is was fun and enjoyed the trip over to Cozumel. Be prepared to wave off the peddlers, they can be very over-whelming. Just buy a one-way ticket to prevent losing or a problem with the return ticket."
        }, 
        {
            "index": 90, 
            "rating": "4", 
            "review": "Great ride to Isla Mujeres. So what can I say about this...it is a FERRY!!! We took it over to Isla Mujeres for the day. Nice, comfortable, scenic."
        }, 
        {
            "index": 91, 
            "rating": "4", 
            "review": "Visit Isla Mujeras by Ultramar Ferry. Just on the horizon off the coast of Cancun lie a unique Island where you can have a great day out, Using the ferry from alongside Riu Peninsular it only takes 25 minutes to reach the Island during which they offer to sell you tickets for golf carts on the Island which is the best way to get around. You will find that on reaching the Island there are dozens of places to hire these carts so you do not need to buy tickets on board the ferry. Once you arrive and hire a cart you set off on the circular road that circumnavigates the small Island and takes in sightseeing activities such as the turtle farm, well worth a stop, and the Punta Sur which gives fantastic views over the wild ocean and huge surfing style waves. We had great fun on the carts and they are really easy to drive if you can stop laughing long enough. There are loads of places to stop and take in the views and I definitely recommend it for anyone visiting the hotel resorts in Cancun."
        }, 
        {
            "index": 92, 
            "rating": "4", 
            "review": "Ultramar ferry- don't book rental car through them. We took the ferry round trip from Playa to Cozumel for the day. The ferry experience was fine- it was a 30 minute trip and the ferry was clean and comfortable. However, I made the mistake of booking a Jeep rental through Ultramar (they will offer you car rental, scooter rental, excursions, etc. when you buy your ferry tickets). The company they use is called Rooster's and it's terrible. The Jeep we got was missing the front passenger seat belt, the radio was broken, the check engine light was on, and the lone windshield wiper was broken (which became highly problematic when we got caught on the road in a late afternoon downpour). Book the ferry, but do yourself a favor and book a rental car directly through Avis or one of the established international rental companies on Cozumel."
        }, 
        {
            "index": 93, 
            "rating": "2", 
            "review": "Ferry ride from H--L. Carnival put us on this Ferry from Cozumel to Playa Del Carmen for a tour. It was early am on 2/26. This boat was too small for the seas it navigated. A storm had just moved through, there was a high wind and probably 10 ft swells. I grew up on the water and this was one of a handful of times I was afraid on the water. The crew, who speaks no English, sheparded us to the top. No choice for downstairs given. We were soaked 2 minutes into. The crew was laughing. They keep moving people from right to left- obviously not a good thing to do in high seas because you are overweighing one side of the boat.There was room for everyone downstairs and NO ONE should have been on top. People were sick everywhere. I was just afraid. This is how ferries capsize. We wound up moving to ENCLOSED downstairs 10 minutes into the hour long trip- which was WAY TOO dangerous. It is only a matter of time before this one winds up in the news. Do yourself a favor- pay a little extra money and/or go a little further and get on a bigger boat."
        }, 
        {
            "index": 94, 
            "rating": "1", 
            "review": "Ripped Off. We purchased round trip tickets in Playa del Carmen. When we tried to board worth the tickets in Cozumel, we were told a piece of the ticket was missing. Despite showing the ticket agent my bank account showing I purchased the tickets, we were forced to buy tickets again. Very bad customer service! We had proof of purchase, we should not have had to buy tickets again."
        }, 
        {
            "index": 95, 
            "rating": "4", 
            "review": "Great. Took the ferry from Coz to Playa. It runs hourly; another company runs on the half hour. Had no problem crossing on a very windy day. The ferries are clean and modern. Don't buy round trip if you're not sure what time you will be leaving, that is if you want to leave on a half hour and have bought a trip for the one that leaves on the hour, you'll have to wait around.We paid $10 ea one way. Last ferry leave 11 pm.I was freezing so I went upstair, much warmer."
        }, 
        {
            "index": 96, 
            "rating": "5", 
            "review": "Fun ride. An inexpensive and quick trip to the island! Always entertainment in good weather,and just a fun ride on the ocean."
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "The View Is Worth It. The best way to enjoy the colors of the sea, the water is always showing different shades of blue, sometimes you are able to see big fishes, corals or rayas, the air is always refreshing the Caribbean hot weather of the middle of the day, great transportation to Cozumel."
        }, 
        {
            "index": 98, 
            "rating": "4", 
            "review": "Good service. Nice ride from playa Del Carmen to Cozumel. Live entertainment on your way to the island nice crew and friendly. Cheap way to travel. Will use this service again!!"
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "Great and Quick Ferry Service to Cozumel. This is a great ferry service with many options each day. Their is a variety of seating options both inside and outside. The ferries run on time and the trip takes about 30 minutes.I would use them again."
        }, 
        {
            "index": 100, 
            "rating": "4", 
            "review": "Easy to use. The tickets are easy to purchase before you get on. Bathrooms are clean on ferry but NOT at pier before you get on. Use the ones on the ferry if needed. It travels on a bit of Mexican time but overall clean and good experience. Take a Dramamine if you are prone to sea sickness and the upstairs open air helps."
        }, 
        {
            "index": 101, 
            "rating": "1", 
            "review": "Round trip not honored . 1. Cash only 2. Don't buy any \"packages\" ( golf cart, scuba etc) . There's plenty of carts and hasslers at the island when you arrive . At least you can see what you get before you buy...3. They DID NOT return us to original port as promised in brochure. Purchased round trip ticket and basically shrugged their shoulders as they winked at their taxi buddies. The taxis and ferries are obviously \"contracted\" with each other. We took the bus back to our hotel 7 miles away for 1/10 of the price ..adios jerks .."
        }, 
        {
            "index": 102, 
            "rating": "5", 
            "review": "Safe Ferry nothing to worry about. Ferry takes from point a to point b nothing to worry about. for some reason they only take cash. They have some silly practices like taking your luggage from the boat to \"baggage claim carousel\" 30 ft away, but not a big deal. Take your time, don't buy anything on the dock, not even a taxi. It will be much cheaper just feet away."
        }, 
        {
            "index": 103, 
            "rating": "4", 
            "review": "Great ride!. Ferry ride was great, fast and reasonably priced. However, their booking system for reserving a golf cart on Isla Mujeres needs to be improved. We booked and paid for a golf cart but when we arrived on Isla Mujeres, there were no more golf carts available. They need better communication."
        }, 
        {
            "index": 104, 
            "rating": "3", 
            "review": "Nothing too exciting to report.. Just a ferry over to Isla Mujures. $19 us per person takes about 25 min. The bar in the staging area on Playa Tortogas beach where you stand and wait for the ferry is VERY expensive and will try to overcharge you. I would avoid it."
        }, 
        {
            "index": 105, 
            "rating": "5", 
            "review": "Enjoy the trip. We took ULTRAMAR ferry from playa del carmen to cozumel.the price was 163 peso for one way and 300 peso for round (go and back).The trip took 40 minutes, nice music (some guys playes guitar and singing) the luggage arrived fast and didnt brake. Stuff was very nice. Recommended."
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "Ferry. We were flying into Cancun to stay in Isla Mujeres, so we took the ferry to the island. I thought riding on the upper deck was a blast! The view is the beautiful, the ride is fun, and I loved the guys playing guitar. I was smiling the whole time, both trips. Great way to start and finish a vacation.Seems like it's crowded heading to Isla Mujeres during the day and crowded heading towards Cancun in the evening. We did the opposite and there was a lot of open space."
        }, 
        {
            "index": 107, 
            "rating": "1", 
            "review": "Terrible travel advice. There's UltraMar Ferry ticket center near Gran Porto Retort, in front of the beach and Punta Langosta. A guy named Wil approached us on the fist day of our trip to Playa del Carmen. He sold us the around trip UltaMar tickets of $20 USD/person and $50 USD/person for Eco Tour Snorkeling all-inclusive with lunch and drink in Cozumel Island which the ferry would left in half hour. Wil said it's only took 15mins walking. However, it took half hour for us-first time visitor walking in the beach. We gave up and came back to reschedule for 10AM next day morning. We came to the information center again to check with the tour around 8:50am. The staff in the information booth said everything is ready for you guys, but the trip not including lunch. We were very surprised but since we paid already we still made our trip. That was not end of our surprises yet. Weather was good in Playa del Carmen but too windy in Cozumel. The ferry was really turbulent due to choppy waves and high speeds! After we landed, the snorkeling was closed in Cozumel due to windy and cold! We were very angry! We just checked before we left. The staff that told us everything was good to go in the morning apparently didn't call the tour guides at Cozumel, and did not inform us not to go because of the cancellation. We waited another 2 hrs for the return ferry since we did not plan to shop or do any other activities and we did not bring enough money and cloth....The guy Wil told us $18 only is for child, and $20 for adult...He took $2 per person into his pocket because the ferry ticket is $10 for child; $18 for adult.... And it's even worse to get refund! It took a day and half just to get refund for the snorkeling trip.... Wil and his staff were not trustworthy!! ... You really need them to write down everything into your receipt including Lunch; manager name and phone..."
        }, 
        {
            "index": 108, 
            "rating": "3", 
            "review": "Fast service to Isla Mujeres. We boarded the Ferry at Playa Caracol, very close to our hotel. This port charges $22usd as opposed to the advertised $19USd. There is a $3 port fee? Must go in their pockets.Service to Isla Mujeres was fast but we were never told that there is a stop at another port along the way so the 30 minute trip ended up taking 45.On the way back, we were told that the ocean was too wavy to stop at Playa Caracol so they left us at another port. No offer of ground transportation to make up for this so we took the city bus (very inexpensive) back to our hotel. Bring water for the trip as they do not sell anything on this ferry as they do the other larger ones such as Playa del Carmen to Cozumel. All in all, a bit of a wasted trip as Isla Mujeres' beaches are really ugly and the town is dirty with few attractions. DOn't waste your time."
        }, 
        {
            "index": 109, 
            "rating": "4", 
            "review": "Best Option to get to Isla Mujeres. We took the ferry from Cancun (Port Juarez) to Isla Mujeres. It was a little over $160 pesos per person, and the ferry departs every 30 minutes and runs all day! The ferry itself was very clean and in good condition. There is an interior seating area with large windows, and an open air top deck. I loved sitting up top! The views were fantastic and it was fun to feel the sea spray. The ride itself took about 20 minutes, but there were some high winds the day we sailed."
        }, 
        {
            "index": 110, 
            "rating": "4", 
            "review": "Fast and fun. We took this ferry from Cancun to Isla Mujeres. They run every half hour so it is very convenient and about 160 pesos per person one way. The boat has a top deck open to the sun and a lower enclosed deck for bad weather. The staff help you aboard and stow you luggage for the trip- very friendly and helpful. The trip was quite enjoyable with good views leaving Cancun and approaching Isla."
        }, 
        {
            "index": 111, 
            "rating": "4", 
            "review": "Easy, Convenient, Fun. There are three ferry companies offering transportation every hour between Playa Del Carmen and Cancun. (Services are staggered). You can purchase tickets before your go out on the dock to board the boat. Prices for a ONE way ticket range from $9.00 to $11.00 depending on which ferry company you choose. UltraMar was $9.00.Three recommendations are-1-Go earlier in the day on weekends or peak season to avoid the crowds. 2-Only purchasing a ONE way ticket so that on your return you will only have to wait something less than 30 minutes for a ferry ride back on this or the other two ferry services. If you purchase a round trip ticket you might save a couple of dollars but it will cost you in time. 3- In order to get a decent seat, go ahead and get in line on the dock.I took the UltraMar ferry on the way over to Cancun and one of the competitors on the way back. UltraMar was less expensive, a better experience with entertainment, beverage servers and more outside seating. I would recommend this service. The bright yellow and blue boats."
        }, 
        {
            "index": 112, 
            "rating": "5", 
            "review": "Fastest way to get from Cancun to Isla Mujeres. Round trip fast Ferry is only $19 per person. They took cute picture on the dock as you board and amazingly found everyone on return trip to sell the pic for $10 - well worth it. You can take slower car ferry which docks outside of town in Isla Mujeres but not us."
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "Ferry to Cozumel. We took the ferry to Cozumel. i think it was 165$ pesos per person on way. they suggest to buy one way at the time because sometimes they refuse the return ticket and you end up having to buy another one. once you get to Cozumel there is so much you can do. We rented a Jeep and rode around the island"
        }, 
        {
            "index": 114, 
            "rating": "4", 
            "review": "Nice boat, but expect sales offers. This boat had a mini bar right inside the front door that had beer and also frozen mixed drinks, which was nice.. except that I had a pretty choppy ride and ended up regretting the pina colada.Was approached for on-island rental sales for scooters, etc. Polite but we declined. Boat was very clean and new, plush inside and a very entertaining band on the upper deck. Would go again."
        }, 
        {
            "index": 115, 
            "rating": "5", 
            "review": "Fast and easy . Ferry was pretty easy to find. From the hotel district hop on a city bus and take it to the playa tortuga stop. Round trip tickets are around $19 for 2 people. You can also pre-order your golf cart here as well and pay by credit card. You MUST have a driver's license or you'll have to put a $50 USD deposit when you get to the golf cart place. The guy at the ticket booth will tell you otherwise but I found this out first hand. Ferris run every hour with the last one from the Isla Mujeres coming back around 5pm."
        }, 
        {
            "index": 116, 
            "rating": "5", 
            "review": "Very comfortable and relaxing.. I had been hesitant for years (10) about going over to Playa del Carmen by ferry due to reviews of people getting sick. Took the chance with my two teenage children and hubby this past summer and glad we did it. Ferry was air conditioned, has comfy big seats, drinks, snacks, restrooms, lots of room inside and outside for seating. Family even slept on the way back to Cozumel. Don't wait like I did, take the ferry and explore."
        }, 
        {
            "index": 117, 
            "rating": "5", 
            "review": "Very good service to Coz…..fast and clean. The boats are fast and clean. Has a bar with snacks. The ac works great so its nice and cool inside the cab. The staff professional. Would use again."
        }, 
        {
            "index": 118, 
            "rating": "4", 
            "review": "Ferry from Cozumel to Playa Del Carmen . We took the Ferry back and forth to Cozumel / airport. The ride was very quick 30 minutes and staff was nice. They offer refreshments during the trip."
        }, 
        {
            "index": 119, 
            "rating": "1", 
            "review": "They made us miss our ferry and wait 1 hour in order to sell us a tour. A lady from UltraMar approached us when we were queuing to tell us about a snorkel trip they were selling. We said we didn´t have time because the ferry was leaving in 5 minutes. She said \"don´t worry, there is still time\". We went with her to the nearby UltraMar office where she spent 15 minutes trying to charge my mastercard using up to 4 different machines. None of them was working so I told them we were leaving. She insisted and called her manager who tried a couple more times until it finally worked. FINALLY THEY HAD THEIR MONEY! THey were both very relieved. In the meantime, THE FERRY HAD LEFT WITHOUT US AND WE HAD TO WAIT AN HOUR until the next ferry departed to Cozumel. But that is not the end of it. When we reached the Aqua Safari pier in Cozumel, THE SNORKEL TRIP HAD LEFT WITHOUT US, even when we were assured that \"they will be waiting for you in Cozumel\". We had to wait another TWO AND A HALF hours until the next snorkel trip departed, and as you can guess, it was probably one of the worst snorkel trips we´ve had, including crappy equipment and rude manners from the staff, who was only worried about their tips. The operator was Aqua Safari for your information.Avoid purchasing anything from the Ultra Mar staff at the Cozumel pier. Everything can be arranged much cheaper at any of the beaches in Cozumel (snorkel, diving, jetski..) and those operators are far more professional and polite."
        }, 
        {
            "index": 120, 
            "rating": "1", 
            "review": "HORRIBLE. I inquired after the ferry from Playa del Carmen to Cozumel, and was told that there would be a ferry at my port at 9 o'clock in the morning. I arrived the next day to discover that The 9 o'clock was at another port, approx. 1 mile away, and the next ferry at my port was at 9:45. We decided to wait for this instead of running to the other port. We waited 45 minutes only to discover at our inquiry, 5 minutes to go, that our port had been cancelled and we would have to go to the other port 1 mile away. The misinformation was their fault, they claimed that they had called the other ferry to wait for us, and we had to run all the way to the other port as they provided no taxi. We arrived only to discover that the ship had left. Sweaty, exhausted, and awful, we demanded compensation from them for wasting our whole morning and also causing us to miss our tour we had booked in Cozumel. The staff was extremely unfriendly and cold, and gave us absolutely NOTHING for their mistake. Instead they merely took our tickets and refunded us, telling us to go to another company. PLEASE DO NOT PATRONIZE THIS HORRIBLE COMPANY."
        }, 
        {
            "index": 121, 
            "rating": "5", 
            "review": "Fast, easy and entertaining. Easy and fast transportation from Playa del Carmen to Cozumel. The ride was smooth and the day was gorgeous so no complaints. For our listening pleasure there was even a singer on board with his makeshift P/A system belting out the latest pop hits. (If you take in a beer or two it'll all be very entertaining.)"
        }, 
        {
            "index": 122, 
            "rating": "3", 
            "review": "Just mediocre. The first day we tried to get to Isla Mujeres, we popped out of the hotel, and in typical Mexican fashion, a concierge sort, definitely not an employee of the Riu, put us in a cab that went maybe 8 blocks for 15 bucks, I knew then that we had just been had. The terminal was like a little craft fair clip joint, and the lady in the booth, wanted 3 times the rate I had read. I seldom get miffed, but suggested, she was goosing us just a bit too much, and we walked off. The frugal wife wanted to bus it back to the Riu but a little old cabbie pulled up, and asked where we were going. I told him, I didn't find a closed automotive shop and a tire store, very interesting, so he took us back to the hotel for 10 bucks, and due to the one way set ups, had to go maybe 40 blocks. I got up the next morning, and noticed the ferry docking 200 feet down the beach. Long story short, we walked 200 feet on the sand, had a couple of beer, and went to Isla Mujeres. I would compare riding around the Isla comparable to the Road to Hana, on Maui. I wouldn't call it a waste of time, but it used the better part of one day, out of our 7. The departure time on our return didn't suit us, so we took the first boat, to the downtown terminal, which is a good place to depart, other than our original departure dock, earlier that day, next to the hotel. I still wonder why the guy outside the hotel sent us on a bum steer the first day, other than the cab driver pieces off concierge guy, and the lady in the booth is in cahoots with the cab driver. Welcome to Mexico. If you feel you are being had, just don't do it. We had an inexpensive lesson. This post is under the ferry, not so much the Isla. To be clear, the ferry was very professional, it was just the rest of the day, was not so hot"
        }, 
        {
            "index": 123, 
            "rating": "4", 
            "review": "Modern Experience. There are three ferries that cross from Playa Del Carmen to Cozumel. Ultramar is the most expensive for tourists but not by much. Currently the charge 163 pesos... (about $10 US). The two others, Caribe and Mexico III charge 138 or so pesos. Ultramar seems to be the fastest... by a few minutes. The boat is modern, clean and as nice as any ferry I've been on (and I've ridden on ferries in Vancouver, Seattle, L.A. and Key West). The typical person will walk up to the three counters and look at the posted times for when the next ferry leaves... and pick the earliest one. Usually you only need to buy one way and then buy your return ticket when you are coming back... again usually from the one leaving the soonest."
        }, 
        {
            "index": 124, 
            "rating": "4", 
            "review": "Quick, Fast and Clean. I only ended up on the Ultra Mar ferry because they were the next to be leaving the docks at Playa Del Carmen. The boat was very large and wasn't near full either time I was on it (two different ships). Both ships were very clean and the crew was friendly and not pushy about the food they were trying to sell. The ferry to Cozumel left a few minutes early, while the ferry back left right on time. Very fast trip both times (35 minutes)."
        }, 
        {
            "index": 125, 
            "rating": "5", 
            "review": "Fun and Fast ride to Isla Mujeres. Boats have an air conditioned cabin as well as an open air seating area on top. We had live music with a classical guitar player on the way out to the island and that was really festive. They do encourage you to tip and I was more than happy to do so. You can get the ferry from the Hotel Zone for $19, but they also operate out of Puerto Juarez for 164 Pesos (about $10) and you can reach that on the R1 bus. You may have to wait a little longer for the bus back to the Hotel Zone from Puerto Juarez but I'm a sucker for paying local prices. Simple but nice ferry service that will get you to Isla Mujeres every half hour."
        }, 
        {
            "index": 126, 
            "rating": "1", 
            "review": "Horrible Customer Experience. I lost a portion of my ticket and didn't realize it until we were boarding the ferry. My friends and I were trying to get on this ferry to catch the last shuttle back to our resort. It was apparent that my two friends and I purchased our tickets together given the sequence of numbers. Guy in photo did not offer any flexibility for us to board the ferry. His attitude was such a spoiler. Tip would be don't lose your ticket and evened the an innocent instance, they won't bend. Other than that transportation is reliable and uneventful. One star rating is based on the customer experience which can make or break the experience."
        }, 
        {
            "index": 127, 
            "rating": "5", 
            "review": "Comfortable and Reliable Ferry!. My husband and I took the Ultramar ferry to/from Playa Del Carmen/Cozumel. The ferry was on time for each ride and the ride was very comfortable and smooth. On our ferry back to PDC there was even live entertainment which was fabulous! I would highly recommend Ultramar for transportation to/from PDC/Cozumel!"
        }, 
        {
            "index": 128, 
            "rating": "5", 
            "review": "Ferry to Isla Mujeres. Our group of four women took the ferry across from cancun to Isla mujeres. We left from puerto Juarez. The ferry left on time and was a pleasant ride. The restrooms at the landings were clean and neat. Snacks and beverage service was available. I felt safe and comfortable on this little adventure and we thoroughly enjoyed our little shopping spree on the island."
        }, 
        {
            "index": 129, 
            "rating": "4", 
            "review": "Playa to Cozumel. Took the ferry after a wedding in Puerto Morelos. If the weather is windy the boat may be rocking. It takes about 45 minutes and it cost gringos $10 each way. (Cash only)We had luggage so you do have to check it. Go toward the back of the boat and someone will give you a ticket for bags you check. We brought on a carry-on sized bag with underwater camera equipment-we sat on top where there is more room and more air and less of a chance to get sea sick. Boats can be more crowded on the weekends. It's a nice inexpensive ride to Cozumel."
        }, 
        {
            "index": 130, 
            "rating": "4", 
            "review": "Ferry to Isla Mujeres. Take the ferry from Puerto Juarez, it’s about half the cost of catching it from the hotel zone. Take the R-1 bus from the hotel zone and it terminates at Puerto Juarez. There’s also a $3 usd port fee in addition to the price of the ticket, didn’t see that mentioned anywhere on the website."
        }, 
        {
            "index": 131, 
            "rating": "4", 
            "review": "Easy trip, but not so much on time :). Typically ferry ride but they had a live band that was really good and made the time pass quicker. Prices where about $18 per person round trip and ferry left every hour. Be sure to get a round-trip ticket as it's a little more expensive to get 2 one-way tickets. Ferry left about 10 minutes later than posted both times."
        }, 
        {
            "index": 132, 
            "rating": "5", 
            "review": "Nice trip to Cozumel. This is a very nice service and round trip to Cozumel island. We sail on Nov the 30th at 2 pm and then get back to Playa del Carmen in the evening.\nMusic was the same both ways. These musicians needs to add more songs to their playlist :)\nFunny, nice, good price!!!"
        }, 
        {
            "index": 133, 
            "rating": "1", 
            "review": "“El Embarcado”. We arrived to book our ferry tickets fro transport from Cancun to Isla Mujeres after checking with the concierge in the hotel to make sure the ferry was running. After we arrrived, they told us that the ferry was not running from that location but they would bus us to another location in which the ferry was running. We were planning on renting a golf cart on the island for the whole day. The guy who sold us our tickets told us that if we did not book it thought him, we would not be ableto get one. So, like the suckers we ended up bing, we did it. Do NOT do this. There are many available rides right across the street from the port and were less than the cost to rent from the ferry operator. Plus, we ended up having to walk several blocks to try and locate the building that we could get our golf cart from. When we got there, we found out that we only had until 5 PM with the golf cart. This was a problem since we were delayed several times through no fault of our own. Plus, the guy running the counter was rude and \"could not understand english well.\"The bus that they arranged to transport us pulled up on the side of the road and told us to get out for the ferry. This was after we were delayed once more by the bus driver running a red ligth and getting pulled over. We had no idea where we were going and there was no one from the ferry service to help us. A nice gentleman on the sidewalk helped us. We ended up having to walk a couple of blocks and wait another 45 minutes for the next ferry.... all the more taking time away from our day there and the golf cart rental. The ferry was nice and well taken care of. The service was absolutely horrendeous!"
        }, 
        {
            "index": 134, 
            "rating": "5", 
            "review": "Quick and clean. We sat both inside and outside on the deck, both were pleasant. Nice morning ride on the deck with a little local Sax. They play lots of 80s music. The ferry is always on time. Leaves ever thirty minutes. Buying round trips are cheaper. Our ferry was to Isla Mujeres that departed from Puerto Juarez."
        }, 
        {
            "index": 135, 
            "rating": "4", 
            "review": "Kill Two Birds With One Stone. For all you tourists who book a trip to Playa del Carmen or Cozumel Mexico I would strongly suggest you get a taste of the other location by using the UltraMar Ferry.The ferry is very clean and comfortable for the 45 minute journey between the two ports. The service is every two hours all day in both directions. I would recommend it most highly for a nice change of pace."
        }, 
        {
            "index": 136, 
            "rating": "4", 
            "review": "Fast way to Cozumel.. We have travelled to Cozumel by UltraMar ferry now for a couple of times. It is a ferry company, as the rest of them. Clean ,fast and good staff. If the seas are rough, all boats will pitch and you might get sea sick -this does not have anything to do with the company, like some here seem to think. So take a pill before you leave, and spend a nice 30 minutes out on the sea."
        }, 
        {
            "index": 137, 
            "rating": "3", 
            "review": "Its a ferry. Not sure what more to say, the boats are big, clean, well run, and on time - they get you to the off shore islands as promised and prices are fair."
        }, 
        {
            "index": 138, 
            "rating": "5", 
            "review": "Great idea!. We always go to Cozumel on our cruises and wanted something different. This time we took the ferry to Playa Del Carmen. Very cheap $13.50 per person and we got to see the mainland."
        }, 
        {
            "index": 139, 
            "rating": "5", 
            "review": "Embarcadero. The ultramar ferry sails from Puerto Juarez and a taxi from downtown Cancun cost approximately 3-4 dollars. The ride to Isla Mujeres takes less than thirty minutes and you can sit top side in the open air or inside below which is air conditioned. At the ticket terminal in addition to tickets they will try to rent you a golf cart or scooter to use to tour the island. You can make a better deal when you reach the island. Beware if you are not vigilant you make get shortchanged at the ticket counter. Overall it is a large improvement from the previous ferry service to Isla Mujeres."
        }, 
        {
            "index": 140, 
            "rating": "4", 
            "review": "Wasn't a Bad Way to Get to Cozumel. Rather than flying direct to Cozumel we decided to taxi to PDC from Cancun and ride the ferry. It was very affordable, right about $10 per person. Boats are nice, air conditioned, snacks and drinks available. Ocean was pretty rough on the way over and could be a problem if one is prone to seasickness"
        }, 
        {
            "index": 141, 
            "rating": "4", 
            "review": "Nice ride to Isla Mujeres. We picked up the ferry at a dock just a couple of blocks from our hotel. The cost for the round trip was $22 round trip which seemed very reasonable. The boat was very clean and the staff was kind.The strange part of the trip was there was a man with a guitar playing and singing on the top deck. He sang two songs and then came around with a tip jar that he thrust in each persons face. The boat docks at a central location on Isla Mujeres. Make sure to note what number boat you got off of. There are 4 different boats that go to different drop off points. There are specific places to line up for each boat for the return trip."
        }, 
        {
            "index": 142, 
            "rating": "2", 
            "review": "Posted Departure Time Not Observed. Boarded the ferry and noted the posted departure time was to be 3pm. Sometime after 3pm one of the crew came in and announced we were leaving soon. Then another 15 mins passed and another announcement made. We didn't leave until about 40 mins past the posted departure time of 3pm. By then we had been sitting in the ferry nearly an hour bobbing up and down in the rough seas. Not real comfortable."
        }, 
        {
            "index": 143, 
            "rating": "1", 
            "review": "El Embarcado. Sold us our ferry tickets with our golf carts included. Arrived at the island and they sold us golf carts that were not available. Said our golf cart included insurance which I found out was not true when a scooter ran into us and we had to pay for the damages"
        }, 
        {
            "index": 144, 
            "rating": "4", 
            "review": "boat ride to Cozumel. I took the ferry ride from Playa del Carmen to Cozumel. The ride was nice, and accomodations are adequate. The luggage was checked, and I got to ride in the shaded area. It is a neat ride."
        }, 
        {
            "index": 145, 
            "rating": "5", 
            "review": "Fast and Fun trip to Cozumel. We used Ferry between Playa Del Carmen and Cozumel! 35 minutes of fun! We used upper open deck, perfect for wonderful pictures! Inside very clean, has restroom, air conditioning, big screen tv's. Transfer was 240 pesos per person, kids under age of 5 are free!"
        }, 
        {
            "index": 146, 
            "rating": "4", 
            "review": "Fast, reasonably comfortable. We were told this was the best way to get to Isla Mujeres, and it is fast and efficient, and runs often enough we didn't have to wait to return. The only downside was that the taxi driver in the cab line after didn't know where our resort was, and drove in the wrong direction over our protestations until he gave up. Be very careful getting back to your resort from the Ferry! You don't want a cab ride to spoil a very efficient ferry ride."
        }, 
        {
            "index": 147, 
            "rating": "4", 
            "review": "Fast, Safe and Comfortable!. We took the ferry over to Isla Mujeres from the RIU Palace Peninsula area for a relatively cheap round trip ticket. The ride was smooth, fast and included some live music during the ride. If you are looking for a quick way over (and back) to Isla Mujeres from Cancun then I recommend using the UltraMar Ferry."
        }, 
        {
            "index": 148, 
            "rating": "4", 
            "review": "Consistent, Safe, Comfortable. Always a great ferry ride to say the least! Always clean and affordable. The ferry times are listed online and in most resorts near the area. For $17 usd round trip you can leave early and stay in Cozumel most of the day! They offer beverages from soda, water to libations on your 30 minute ride to the island. Can't go wrong - they gotcha covered."
        }, 
        {
            "index": 149, 
            "rating": "4", 
            "review": "Trip to Cozumel. We used this service to travel between Playa Del Carmen and Cozumel on our honeymoon. Not the cheapest ferry, but the most convenient for sure. Nice boat, staff okay, overall satisfied and would use again."
        }, 
        {
            "index": 150, 
            "rating": "5", 
            "review": "Great experience . This was a great experience. It allowed us to go back and forth and really experience more of Mexico, and was extremely easy, clean & comfortable"
        }, 
        {
            "index": 151, 
            "rating": "5", 
            "review": "Great stable fast ride. Nice to have ferry every 30 minutes. The location is a bit far from our hotel but not too bad. Price is a little expensive but they gave me a small discount when i asked and i bought the round trip ticket. Four people about 600 pesos round trip. Boat was fairly big - we did not ride the smaller ones. Very stable. We took Dramamine before trip to island Mujeres, but it was so stable we did not take it on return trip. If you go too early nothing will be open on the island, except the golf cart rental. We enjoyed driving with fee people on the road! DO NOT take the Ultramar taxi when you come back. They price gouge way more than other servivices!!"
        }, 
        {
            "index": 152, 
            "rating": "5", 
            "review": "Clean, Fast, Easy way to Cozumel.. Ferry service from Playa Del Carmen to Cozumel. Clean, Fast, Friendly. Easy on and easy off (with luggage). Nice air-condition inside and beautiful outside seating. Very nice trip."
        }, 
        {
            "index": 153, 
            "rating": "5", 
            "review": "Fast and Efficient. We used the UltraMar Ferry twice to take us from Play del Carmen to Cozumel. You can choose to sit in comfort in the air conditioned section or sit in the open air section. We did both. There is usually a band playing on the open air section. Hearing the live music helps pass the time. The trip took us no longer than 45 minutes each way. Excellent customer service, too. If you are carrying bags, you'll need to check them. They use a numbered tag that matches a receipt they give you. Don't lose the receipt. UltrMar checks the number on the receipt to the number on the bag. You will not be allowed to take with your bags without the receipt. AND don't forget to Tip the Band!"
        }, 
        {
            "index": 154, 
            "rating": "1", 
            "review": "Beware. Do Not use this company. THEY LIE!!! Sold me round trip tickets to Cozumel, saying the last ferry back to Playa del Carmen was at 9:00pm, the last shuttle was at 7:00 had to purchase new tickets with a different company. Be careful with the parking attached to the ferry ride, again they LIE"
        }, 
        {
            "index": 155, 
            "rating": "5", 
            "review": "Quick trip to Playa del Carmen!!!. So smooth and easy. We walked up to the pier paid for our tickets 15 minutes before departure.The round trip ride was very comfortable with AC and a clean boat."
        }, 
        {
            "index": 156, 
            "rating": "5", 
            "review": "Best way to Cozumel!. Comfortable, fast, clean and safe...everything you want in a ferry ride! My son enjoyed watching the waves and didn't get seasick at all."
        }, 
        {
            "index": 157, 
            "rating": "5", 
            "review": "No complaints. A Great service! . My wife and I used this service during one of our excursions on our honeymoon. We took a regular ferry from Playa del Carmen to Cozumel. There was a live band on board and they were fantastic! I loved listening to them and if they had a show while we were in town, we probably would have gone! The way back was an express ferry. It was a nicer boat and was very comfortable. Enjoyed both rides."
        }, 
        {
            "index": 158, 
            "rating": "4", 
            "review": "Good and organized service. There are two major ferry services between Cozumel and Playa del Carmen. I tried both in one week. This is by far the better service. Upgraded ferry with excellent A/C and friendly staff. Far better seating as well. Definitely recommended.Oh and this is not an attraction, it is a service. But oh well, I guess if you had enough tequilas on board (yes they have a bar), it COULD be an attraction as well. :)"
        }, 
        {
            "index": 159, 
            "rating": "4", 
            "review": "Great ferry service from Playa del Carmen and Cozumel. The boats are in good shape, have Wi-Fi service and snack and beverages are offered for purchase. The staff is attentive and efficient. The boats departed and arrived on time."
        }, 
        {
            "index": 160, 
            "rating": "5", 
            "review": "My favorite ferry line to take while in Cozumel!. We've always taken UltraMar Ferry lines while in Cozumel/Cancun/Playa Del Carmen and its always been a good experience. We planned to go to Playa (from Cozumel) on Sunday of our trip and pretty early in the morning. We got there around 8:15 and the next ferry was at 8:30 but with Mexico WaterJets company. We bought a round trip and went about our way. This was the first time we've taken this company but we did because it was the next trip out. The mistake here was that when we were ready to leave Playa we had just missed the ferry and the next one wasn't for another hour and a half. Therefor, we bought a one way with UltraMar so we could get back to Cozumel. I would always recommend getting one way tickets, no matter which ferry line for this. Anyways, UltraMar is always my favorite for multiple reasons but to name a few, they always have crew members walking around making sure everyone is okay and that everyone has a safe trip and they always leave on time. With the exception of one time, we've had entertainment on the boat which I love. It really gets people in the mood to have a good time. I know some people can get sea sick and many have complained about that on the reviews. I've been a handful of times and I've never felt sick even with high waves. I wouldn't criticize the ferry line for that as its a more as a individual thing. I think they are very safe and look out for all passengers. UltraMar would be by first choice when traveling by sea whether its to Playa, Cozumel, Cancun or Isla Murjeres. I've been to all and all sizes of boats."
        }, 
        {
            "index": 161, 
            "rating": "4", 
            "review": "Clean and cool!. We stayed in Cancun for a week and took the ferry from Tortugas 3 times. 2 times we returned on the 5:30 ferry, but one night we stayed later and took a different ferry. The ferries are really clean and air conditioned well inside or beautiful to sit up top in the fresh air."
        }, 
        {
            "index": 162, 
            "rating": "3", 
            "review": "Enjoyable ride but beware of overcharges. My wife and the kids have stayed in Playa the last three years. We decided to take a trip over to Cozumel this year to one of the private beach clubs. There are three companies that offer ferry services to and from Cozumel, UltraMar being one of them. The published schedule says departures are generally on the hour every hour however when we arrived to pay the schedule was for 11:30 and we probably actually left at 11:45. We were charged 586 pesos for 3 adults and 1 child. The lady at the booth said they did not take credit card which I later found out to be untrue. She told me it would be $44 USD. I did not think much about the conversion until I after I boarded that she have overcharged me about $8. Coming back I used a credit card, go figure, and it was the same cost but when I received my Capital One alert it was $36 USD. The lady basically pocketed $8."
        }, 
        {
            "index": 163, 
            "rating": "1", 
            "review": "Left us stranded. Did not go on schedule. Had to wait two hours to get across and another hour to get on a ferry to go back. I understand technical difficulties, but there was no communication. We were just left angry in the hot sun."
        }, 
        {
            "index": 164, 
            "rating": "5", 
            "review": "Good vibes to Cozumel!. The music onboard made the trip to and from Cozumel more enjoyable. I tipped the band. I even got a drink while aboard. We were up top to enjoy the band and fresh air; it made the short trip go even faster."
        }, 
        {
            "index": 165, 
            "rating": "5", 
            "review": "Prompt courteous service. We were happy with the people and the comfortable ride. The cabin was air conditioned. The ride took about 25 minutes and then when we went to return to Cancun at 4pm they let us on even though the gate was already closed (we were running behind)"
        }, 
        {
            "index": 166, 
            "rating": "4", 
            "review": "Good. Took the boat across to Isla. It was a quick, fun & sometimes choppy way to travel to the Isla. For only $19 each, you cannot go wrong with some form of entertainment both ways."
        }, 
        {
            "index": 167, 
            "rating": "4", 
            "review": "Nice ride. We enjoy taking this ferry to Isla. It is clean, comfortable, and it has air conditioning inside. The attendants are great packing your luggage away, the topside is fun on a good day, and they have a guy playing a guitar and singing for your entertainment...just tip him...good company...."
        }, 
        {
            "index": 168, 
            "rating": "5", 
            "review": "Fast ship to cozumel. The ferry ride to cozumel was fast, comfortable and entertaining. I believe we paid between $15-20 US per ticket. Overall i was happy with the service."
        }, 
        {
            "index": 169, 
            "rating": "4", 
            "review": "Fun but can be choppy . It's a 40 minute trip and on a clear day you can see from Cozumel over to playa - but be warned it can be very choppy so pick a good clear day - there are other ferries but we like this one because they have more outdoor seating and usually have live music onboard too - safe trip - just get your sea legs."
        }, 
        {
            "index": 170, 
            "rating": "4", 
            "review": "Quick and Easy ride to Cozumel. It was a quick and easy way to spend a day in Cozumel. It was a nice excursion and the ferry left every hour or so. Best to just get a one way ticket as there is more than one carrier and that way you can return on the next available ferry."
        }, 
        {
            "index": 171, 
            "rating": "4", 
            "review": "Great Transportation. We arrived with a man on a trike carrying our luggage and depositing it behind the security gates (for $50. I went over and got 2 one-way tickets to Cozumel for $163 MXN each. We used UltraMar because it was the ferry line running the soonest from Playa del Carmen to Cozumel and was the last one we could be on to meet the 16:00 deadline.UltraMar is the yellow and blue line. Their ferries have an open air deck, it was open when we went this trip, on Saturday afternoon November 1st so we sat on top with the blinds open, it was refreshing. There was live music and people selling snacks and drinks, including National beers.All together the ferry takes an hour; this includes loading, travel and unloading. They now tag your luggage when you check it in, giving you half the tag to claim it at the other side. You give them the tag, point out your bag, they verify the tag matches and give it to you. Do not lose the tags; it will cause a considerable hassle for you, especially if you do not speak Spanish. They have never told me there was a limit to the amount of luggage you can bring, we have hauled tons of luggage and groceries but that does not mean that there is not a limit that they enforce at high capacities.The ferry ride can be rough and often times it is. I have only had one smooth trip. If you tend to get car, motion or boat sickness you will want to take medication for it before crossing. I grew up on boats and never had a problem but there have been several times that the sea has gotten the ferry’s bow a rolling, especially in the lower deck, where it can sway and roll back and forth as you bump and ram wave after wave, and I myself could not wait to get onto steady land. For a more detailed account of our experiences with both UltraMar and Mexico WaterJets Ferry Lines check out Traveling Martinezes"
        }, 
        {
            "index": 172, 
            "rating": "3", 
            "review": "Fast Service - Look for Life Jackets. It only takes about 30 minutes to go across Cozumel to Playacar, Playacar to Cozumel. Findout where the life jackets are because so one will tell you. If you want a window or outdoor seat get there at least 20 minutes before departure. $16 roundtrip."
        }, 
        {
            "index": 173, 
            "rating": "5", 
            "review": "Relaxing Ferry!. We have visited Cozumel a half dozen times and will always pick the yellow ultramar!! I know it costs a little more but it is faster and it more accommodating for luggage. I recommend sitting outside on the second deck. The live music always sets a perfect atmosphere!"
        }, 
        {
            "index": 174, 
            "rating": "5", 
            "review": "Amazing Ride. This boat ride to Cozumel was so much fun. We sat on the top deck in the back and enjoyed the views and the light splash of mist from the waves. They have a live band that plays on the boat as well as selling alcohol, which is always a good thing. Highly recommend this ferry. It was $22 per person round trip."
        }, 
        {
            "index": 175, 
            "rating": "5", 
            "review": "Great Trip. The Ferry from Playa to Cozumel and Cozumel to Playa was fantastic. Great value and even had entertainment to and from! It was a very pleasant ride and great music! I would def reccommend taking the ferry even if it is just to sight see!! We did see a sea turtle and lots of fish to and from! If you want to sit on the deck or ride in the airconditioner this ferry has it all! You can even purchase cold drinks!"
        }, 
        {
            "index": 176, 
            "rating": "3", 
            "review": "From Point A to Point B. It gets you where you're going. It's a little pricey so my suggestion is to plan to spend a day in Cozumel to make it worth your while."
        }, 
        {
            "index": 177, 
            "rating": "3", 
            "review": "Prompt, but puzzling. The ferry to and from Cozumel is prompt and on time. It's puzzling to understand the price. Street hawkers herd you to the ticket window. Our charge was $22 round trip. Of, course, they only take cash and, as typical in the area, the attendants conveniently don't have change. If you buy round trip, remember that your particular ferry company may not return exactly when it is convenient for you. Later in the day, the ferries return every two hours, instead of on the hour. Seas can be a bit rough on the short 40ish minute ride."
        }, 
        {
            "index": 178, 
            "rating": "4", 
            "review": "Efficient and Comfortable. The ferries run constantly between Cozumel and Play de Carmen. All boats are comfortable for the 45 minute trip. Boarding and I boarding is quick and easy."
        }, 
        {
            "index": 179, 
            "rating": "2", 
            "review": "You never know the price!. So what I quickly learned in Mexico is, the price is never the real price ! We had seen the price chart listed and once we got close to the ferry, men came up to us telling us that they could get us a deal. They said 22.00 US each and lead us over to pay, once there the ladies working there were yelling that the ferry was leaving and it was 30.00 US each! In a rush we paid the money. The confusion is there are price charts at hotels, at the warf etc... None of them give the same price. We were later told 30.00 US each return was a really good deal.I guess the only advice is don't be suprised that no one seems to know how muchit costs!!! Also if you want to sit up top for the view you will have to be ther early and wait in line. Also use the bathroom before you get on, one of the ladies in our group used the facilites and there was an inch of waste on the floor. she was told it was from the waves rocking the boat around. At the very least don't wear flip flops"
        }, 
        {
            "index": 180, 
            "rating": "3", 
            "review": "BEWARE. I asked if they took credit cards and they said no. I asked again, \"How can that be\"? \"Cash only Signore\". I figured out why. A one way trip was $12 USD. I gave the rude attendant a $50 bill. She returned $20 pesos about $1.25. That's why they want money. On the return I paid with a credit card no problem, same boat crew and all. BTW the ferry is convenient but packed so get on early to get a seat. if not they'll put you in the engine room!! They really don't care as long as they get your money!!!"
        }, 
        {
            "index": 181, 
            "rating": "5", 
            "review": "Great service . The best $10 usa you'll spend on vacation and that's round trip from Puerto Juarez more expensive from hotel zone and not as frequent. Awesome ride ,service, and Caribbean blues! Usually live entertainment also, classic mexican musicians. And best yet you get off on an island! Don't forget our vacation is to someone else's home, be a good tourist and you're going to have a better time!"
        }, 
        {
            "index": 182, 
            "rating": "4", 
            "review": "Easy and inexpensive way to get to Cozumel!. Weather was windy and seas a bit rough but a fast and easy way to get to Cozumel to spend a day. Don't buy your return ticket until you're ready to leave so you won't have any time constraints."
        }, 
        {
            "index": 183, 
            "rating": "5", 
            "review": "Great ferry service. But don't book return ticket.. Great ferry service. But don't book return ticket. Clean ferry, clean bathrooms. If the water is rough, hope that you don't have a weak stomach. The reason they say not to book a return ticket, is that there are several ferry companies, and the one you are booking may not return till a later time of the day. That means you may have to wait an hour for your specific company to return instead of just booking another ferry company that is leaving sooner for the same price."
        }, 
        {
            "index": 184, 
            "rating": "3", 
            "review": "Great Views but Big Motion Sickness. We took the ferry from the port located next to the Barcelo Costa Cancun. It was pretty windy that day and there were some swells in the ocean. This caused the boat to rock side to side and from front to back. Made for a crazy ride. Even the caballero who was singing on the boat was holding on for dear life while his amp was falling over. On a calm day, this would be a great ride. The cost was $19 USD return pp."
        }, 
        {
            "index": 185, 
            "rating": "5", 
            "review": "Ultramar Ferry to Cozumel. Very enjoyable ferry ride from Playa del Carmen to Cozumel. 30-35 minutes. Boarding and exiting the ferry was very quick. Cost was $24 US for two people each way. For those of you who are worried about motion sickness, it was actually quite a smooth ride the day we went. Ultramar Ferry runs every hour."
        }, 
        {
            "index": 186, 
            "rating": "4", 
            "review": "Fun Ride. My first trip on ferry to Isla Mujeres. I road downstairs going and it was a bit rough. On return to Cancun, I rode on top. We had a guy singing Spanish songs for tips. The view was awesome. Nice outing for family or friends."
        }, 
        {
            "index": 187, 
            "rating": "4", 
            "review": "Go to Cozumel!. Very efficient and they have a band playing during the ride. On time. So easy to get to Cozumel and spend the day there. Don't go if you get seasick, however, without taking dramamine or wearing an ear patch. We went on a very windy day and I felt pretty queasy. No fun to listen to \"La Bamba\" while tossing your cookies."
        }, 
        {
            "index": 188, 
            "rating": "5", 
            "review": "Great trip to Isla Mujeres!. I was told that visiting Isla Mujeres is an absolute must when you are in Playa del Carmen (or Cancun)--so we made our way out there. First, we took the ADO from Playa del Carmen to Cancun, hopped on a taxi, and headed to the Ultramar Ferry dock. The ferries leave about every half hour, and are pretty on schedule.My friend and I purchased a flexible round trip ticket that could be used at any time. It was about $10 roundtrip. We boarded the boat rather quickly, and made sure to nab a seat on top.For entertainment, there's a guitar player who sings a mix of songs. I didn't feel sea sick at all and really enjoyed the boat ride. In a short 20 minutes, we arrived in Isla Mujeres!"
        }, 
        {
            "index": 189, 
            "rating": "4", 
            "review": "Only by One Way Tickets - Gives More Flexibility for Your Return. We took the ferry from Playa to Cozumel and back again the same day. I would recommend purchasing only a one way ticket because there are two ferry companies with different times. I purchased round trip tickets so I had to wait around for an extra hour instead of being able to go on the other ferry. The tickets cost around $11 per person each way. Bring pesos or American dollars because they don't always accept credit cards. As others have stated there was a band playing which was very entertaining and helped to pass the time."
        }, 
        {
            "index": 190, 
            "rating": "5", 
            "review": "Speedy Service, Beautiful Jet Catamarans. I loved the rapid service to Isla Mujeres-the ride was really fun, the watercraft were amazing! The boats run every half hour, and you have your choice of riding on the top deck or below in the beautiful interior cabin with large view windows."
        }, 
        {
            "index": 191, 
            "rating": "4", 
            "review": "Nice trip. Nice ferry ride. Took about 30 min to get to Cozumel from Playa del Carmen. The downside was that Visa was not accepted. For a group of 8 we were taken back about this. Cost is $10 US each way. Comes often so times were not a problem."
        }, 
        {
            "index": 192, 
            "rating": "5", 
            "review": "Gliding all the way to Isla Mujeres!. Riding the Ultrmar to Isla Mujeres was such a treat! It was a beautiful day and we rode on the open aired top level. It was a 20 minute ride. There were two gentlemen up front singing and playing guitars and instruments. What a nice touch. The ocean was calm and we glided along. There is a lower level covered area as well on the Ultramar. Those seats were quite cushy! Nice! Great service. They even help you store your bags in a certain section of the ferry. It runs every 1/2 hour and after 8:30pm I think it runs less frequent. Maybe every hour??. Check on it before you go."
        }, 
        {
            "index": 193, 
            "rating": "5", 
            "review": "Good value - Easy transportation. All good...good value and easy. Cab ride from the hotel, buy round trip tickets and your off. The ferry runs every 30 minutes."
        }, 
        {
            "index": 194, 
            "rating": "4", 
            "review": "Enjoyable, safe, resonably priced.. Travelled Cancun - Isla Majeures. On time, clean, professional. Live music onboard added a very nice ambience."
        }, 
        {
            "index": 195, 
            "rating": "1", 
            "review": "Tried to rip me off!!!. I travelled from Playa Del Carmen to Cozumel to do some scuba diving. Unknown to me, the member of staff ripped the wrong part of the ticket off before I boarded at Playa. When I came to board the ferry back to Playa, I was told my ticket was invalid and I had to buy another one. I had already been allowed through the initial ticket inspection before I was told this. I explained that the agent at Playa had taken the ticket stubs, and this wasn't my fault. I was told tough and I had to buy another ticket. I refused to buy another ticket as I had already paid for a return ticket. The guy radioed his supervisor and he came back telling me I needed to buy another ticket. Being polite didn't work. The only thing that did work was going absolutely mental and keeping at it until they let me board.Total rip off merchants - they need to train their staff properly (unless it's a scam), it's not exactly rocket science to tear and retain the correct part of a ticket!!!! Whilst I was having my strop, an American couple told me they had done exactly the same to them. I'm assuming since they were boarding with a ticket and not going crazy, that they gave in and bought a new ticket. Nice money making scam. I loved the diving on Cozumel - saw turtles and dolphins. Just a shame the return trip was so stressful. And it all happened on my 30th birthday."
        }, 
        {
            "index": 196, 
            "rating": "5", 
            "review": "Perfect. Its cheapest go to isla mujeres from puerto juarez, at zona hotelera cancun its expensive. U can go from cancun center to puerto juarez in cab just for4 dlls, its like 7 minutes far from center."
        }, 
        {
            "index": 197, 
            "rating": "4", 
            "review": "Now with live music. I have been using UltrMar to get from Playa Del Carmen to Cozumel for ove 15 years and they are freindly and on time. Now they have music also. The trip is not cheap, about $25USD but is very convenient."
        }, 
        {
            "index": 198, 
            "rating": "3", 
            "review": "Good Safe and Fast Boats But Poor Logoistics. Departure locations and times changed without advanced notice. We did not know until we got off the bus that we the location had changed. Then we were given departure times when we purchased tickets however when we were in line for the boat, they removed two of the times."
        }, 
        {
            "index": 199, 
            "rating": "5", 
            "review": "On time and affordable. Very efficient, clean easy to get to from playa mujeres also nice view from top of ferry good photo opportunity"
        }, 
        {
            "index": 200, 
            "rating": "5", 
            "review": "Great way to get to and from mainland but can be rough!. Took a ride on this ferry last week when there was weather in the area. Apparently from other reports, this can be a rough crossing even when weather is mild. You know its rough when inquired whether conditions as what we were in were common and \"this, it's no bueno\" is the response, so I appreciated the honesty and friendliness Of the crew. Several persons became ill and crew was immediately available to pass out bags and help out the sick. Although weather conditions cannot be controlled, how the situation was managed was, and extremely well in the circumstances. I definitely recommend that anyone already prone to becoming I'll takes precautions (such as medications), avoiding heavy/rich meals and a lot of water/drinks an hour before taking the crossing."
        }, 
        {
            "index": 201, 
            "rating": "4", 
            "review": "Easy transportation to Cozumel. Easy to find the ticket booth near the pier that is currently under renovation. The staff is very kind to those who get motion sick. They hand out bags as one starts to look like they will get sick. I thought that they were the better ferry to take - you could actually see out of the windows on this ferry."
        }, 
        {
            "index": 202, 
            "rating": "5", 
            "review": "Easy trip over . This service is reliable and good value.You can book your open tickets (leave whenever / return whenever) around town but better to do at the ferry terminal. About USD 6 each way. The ride over was very entertaining with a band and lots of people dancing! The ride back was very rough, they handed out sick bags before hand! The ferries are clean and there are many services each day."
        }, 
        {
            "index": 203, 
            "rating": "5", 
            "review": "Great!. I don't like boats. The swaying rocking motion, the thud after crashing over waves...... The Ultramar was great! Fast, clean and friendly. Everything i had hoped for.........To those who get sea sick, take a Gravol quick dissolve 30 mins before departure, sit inside, take a window seat and relax. It was a good experience."
        }, 
        {
            "index": 204, 
            "rating": "5", 
            "review": "Fast Service!. Very fast service, and clean ships every time I have traveled to Cozumel with them. It appears they are adding more ships to the fleet, which is needed as it seems to be more crowded each time."
        }, 
        {
            "index": 205, 
            "rating": "4", 
            "review": "Cozumel. This island is easily reached by ferry from Playa Del Carmen. You should avoid the ticket touts and buy from the ferry office. We hired a local 4 wheeler for the day though an agent on the pier. It cost us $50 + $20 for fuel. (refused the extra \"insurance\" - have own damage waiver cover). The cost with the extra insurance would have been about the same as hiring a taxi for a tour of the island. It was a fairly beaten up vehicle but got us around. There are lots of scooters and motorbikes in town which can make it tricky but the open road makes it enjoyable and the coast on the far side is lovely . There is some good snorkelling and then the coast opens out to wild, windy rocky beaches and azure seas. You can continue on foot if you like walking. The whole island seems to be limestone (fosilised coral etc). The rock pools and vegetation are interesting. You might want to take sandwiches etc so you can stop where you want."
        }, 
        {
            "index": 206, 
            "rating": "5", 
            "review": "Easy crossing. My husband and I were staying in Playa del Carmen and wanted a day trip to Cozumel. We got the UltraMar ferry which we thought was reasonably priced. We heard that the queues for tickets could be quite long so we got the tickets before wondering around town. There was plenty of seating for everyone and the water was a bit choppy so it was a little rough but not too bad. The ferry was on time and we were very satisfied with the journey and there were nice views in and out of the ports."
        }, 
        {
            "index": 207, 
            "rating": "4", 
            "review": "Nice ride. We took the UltraMar Ferry back and forth from Cozumel to Playa del Carmen twice recently. There was live entrainment on two of the trips and they were a fantastic distraction from the queasiness. Note that they do not always except credit cards. If there's a long line to get tickets prior to the departure time…you're out of luck. Have cash available (the nearby ATM were not working) Friendly staff, clean seats and did I mention the band!"
        }, 
        {
            "index": 208, 
            "rating": "4", 
            "review": "Very enjoyable. We took the UltraMar ferry as part of our cruise excursion from the Cozymel port to Playa de Carmen. It was clean and comfortable and the staff worked very hard to make everyone's trip enjoyable."
        }, 
        {
            "index": 209, 
            "rating": "5", 
            "review": "Great - but only buy a one way ticket. We travelled from Playa del Carmen to Cozumel, pleasant fast ride and air conditioned inside.Would recommend you only buy a one way ticket as there are two different companies running ferries at alternate times, unless you know for definite the ferry times you want to travel on beforehand"
        }, 
        {
            "index": 210, 
            "rating": "3", 
            "review": "Cheap and Easy to get to Cozumel. The ferry system is THE method to get to the island, be prepared for large numbers of people, all traveling with supplies... this is not a boat cruise. Easy to navigate on the Cozumel end, same as 5th avenue though."
        }, 
        {
            "index": 211, 
            "rating": "4", 
            "review": "Bumpy but fun ride to Cozumel. You can round trip for approx 300 pesos. The boats are med size and will bounce a bit if the water is chopy. Not good for those with sea sickness. On board you can buy drinks and chips. Live music and quick to cross to the island"
        }, 
        {
            "index": 212, 
            "rating": "4", 
            "review": "Good ride across from Cozumel to Mainland Mexico. One of cruise ship stop was in Cozumel and we took boat from Cozumel to Mainland to go to resort and ruins. Boat was clean and has food and drink available. Boat ride is about 45 min each way and over open ocean so it is quite rough. Many of passenger couldn't keep what they had for breakfast. They do provide burp bags ... Most of us had no problem, but if you suffer from sea sickness then think twice."
        }, 
        {
            "index": 213, 
            "rating": "5", 
            "review": "FAST AND EASY WAY TO COZUMEL. I found this to be the fastest and easiest way to arrive on the island of Cozumel. The ferry leaves from Playa del Carmen every 2-3 hours until 10pm. You will arrive within 30-40 minutes depending on the conditions of the seas. I found this mode of transportation very economical during my Riviera Maya tour costing 163 pesos one way. I stayed in Cozumel a week and returned via ferry back to Playa del Carmen to catch a bus from ADO terminal for the airport. Everything is very close together. On the other side if you decide to land in Cozumel by plane and want to visit Playa del Carmen for the day you can do so taking the ferry up until 9pm. Take advantage of the UltraMar convenient transportation the next time you visit the Riviera Maya. Happy Travels!!!!"
        }, 
        {
            "index": 214, 
            "rating": "5", 
            "review": "Taken twice before, this time got Mexico Waterjets. I have to say our experience on UltraMar was much better than Mexico Waterjets which is the one that runs the opposite hours. The boat we got with Mexico Waterjets (the noon one that leaves Cozumel to go to Playa) was awful. The top \"outdoor\" section is only open on the back so it's pretty enclosed and spells like fuel fumes. The lower enclosed air condition has windows which at first I thought were frosted but I think it might be layers of dried salt so you can't see out. The two times we've been on Ultra Mar they have a nice open section on top so you can see where you're going and catch the fresh air.We will make sure we plan our departure next time to get UltraMar for a better (less nauseous) experience."
        }, 
        {
            "index": 215, 
            "rating": "4", 
            "review": "Great service - loved the music too!. Reading previous reviews, I worried about seasickness. No need at all! The ride was just fine, well-organized, and had the added enjoyment of an entertaining group of musicians/singers. Half-price with INAPAM card."
        }, 
        {
            "index": 216, 
            "rating": "4", 
            "review": "Whoa!. Ok, the water was super choppy and I was green. That staff did everything they could to make me comfortable for the 40 minute crossing. The ferry was clean, smelled nice. The bathrooms were clean as well. The staff was amazing and I highly recommend UltraMar when you need to get from Cozumel, Mexico to Playa Del Carmen. We arrived via Carnival Cruise Lines."
        }, 
        {
            "index": 217, 
            "rating": "4", 
            "review": "Rough seas ahead.... Took the 11 am Ferry from Playa del Carmen to Cozumel. It was a windy day and the boat was swaying back and forth. The crew was very pleasant and quickly distributed vomit bags. The transfer took over 45 minutes and many got sick. The return ride was equally rough. If you get motion sickness easily, avoid the ferry."
        }, 
        {
            "index": 218, 
            "rating": "4", 
            "review": "great way to visit Cozumel Island. Very convenient way to visit the island from Playa del Carmen. As advised just buy a one way ticket so you don't get stuck with one of the two operators who travel back and forth.Good little band on ferry who help the journey go by.Beware that there are no ferries by either company between 2 and 4pm!"
        }, 
        {
            "index": 219, 
            "rating": "4", 
            "review": "Choice-Good value-Fun-. Pleasant 45 minute water ride both ways.Best is to buy a 1 way ticket.If you buy a return ticket, you are stuck with the schedule of 1 of the 2 providers that leaves you less options for a return.Never a problem to get a ticket.There is some local music played on the boat that an individual can embrace, or slide away from.If so, sit in the back and don't complain.Cost was a simple and good value $13/way - $26 return"
        }, 
        {
            "index": 220, 
            "rating": "4", 
            "review": "great ride to cozumel. you have 2 reasonable ferry choices to Cozumel and both are great. You will have musical entertainment both directions, making the ride always pleasurable"
        }, 
        {
            "index": 221, 
            "rating": "5", 
            "review": "Excellent Service, Friendly Staff. My mom and I were going on a shore excursion to the Mayan Ruins and had to take the ferry to get to Playa del Carmen. This ferry crew are AMAZING!! From the moment, we stepped on the ferry, they greeted us, offered us drinks and I spoke to them in Spanish (I have been learning Spanish for six years and am trying to become fluent in the language!). We didn't really know where to sit so we sat on the lower deck, closest to the water. The water can get quite a bit bumpy and they give everyone barf bags just in case! The people we sat behind got seasick and I am very surprised that we didn't follow suit. The ferry crew were amazing at coming around and helping the people that were sick and making sure those who weren't were feeling okay! Since, we had to go on the ferry twice, we talked to many travelers who suggested to sit on the top deck of the ferry (the sea air helped make you feel less sick!). We tried that and it really worked! It was nighttime when we came back and a completely dark ride through the open waters but, my mom and I felt so much better sitting on the top deck then, the other deck that we rode on. The ferry crew was the same as we had seen much earlier in the day and they remembered us and talked to us for a while! SUCH a friendly crew aboard this ferry definitely sit on the top deck though if you are nervous about the ride!"
        }, 
        {
            "index": 222, 
            "rating": "5", 
            "review": "Quick, clean and inexpensive.... This is the best way to travel between the mainland and Cozumel. We took three trips to the mainland while in Cozumel and between Ultramar and Mexican WaterJets we much preferred the Ultramar ferry's, as their boats were better and cleaner. Just know that sometimes they have issues that cause the schedule to unexpectedly change (happened to us). So, make sure to plan on catching an earlier ferry back, so you have a back up in the case of that change. Also, if you transport your dive gear with you back/forth, watch it from the moment it is being offloaded and you will be able to pick it up right off the deck after the other luggage is removed or directly from the baggage supervisor without having to worry about it (a couple dollars goes a long way in making this a faster smoother baggage pick up)."
        }, 
        {
            "index": 223, 
            "rating": "2", 
            "review": "Seasick!. My husband and I are not ones to get seasick. We booked a tour of the local ruins through our cruise ship which included the 1/2 round trip on this ferry from Cozumel to the main land. We had a thunder storm the night before and the water was still quite choppy. We were told we would be fine and to board the ship. We were fine until they hit open sea, they were travelling WAY too fast for the conditions, it was impossible to stay in your seat. Staff members were going around checking on everyone as one by one everyone started throwing up. They had tiny plastic barf bags for you! I. luckily did not get sick (barely) but my husband was not so lucky...I can't imagine if the ferry was full and everyone was throwing up, would have been horrid. Thankfully there were only a few families on board."
        }, 
        {
            "index": 224, 
            "rating": "3", 
            "review": "$26 USD?????. You have to pay $26 USD for a round trip 30 minute ferry ride to Cozumel. They run pretty regular but the last one back to Playa de Carmen is at 7pm so don't miss the boat! You can buy snacks on board."
        }, 
        {
            "index": 225, 
            "rating": "5", 
            "review": "Day trip from Cozumel to Playa del Carmen. Day trip from Cozumel to Playa del Carmen. Ultramar is one of two companies that run between the two cities. Ultramar departs every other hour (refer to schedule) with the trip lasting between 40 and 50 minutes to cross the channel. The ticket offices take both Peso and American Dollars. The boats appeared to be in very good condition with indoor and outdoor seating, concessions, bathrooms and flat screened TVs. Boarding/exiting is conducted from both the front and back of the ferries and is open seating. Oversized luggage will be checked on boarding and reclaimed boatside at your destination. Tips: Depending on the weather/sea conditions, the ride can be bumpy. If your prone to becoming sea sick, plan accordingly. Only purchase a one way ticket (no discount for round-trip), then you can take whatever ferry is sitting at the dock when you want to leave. Exit the boat from the rear, it seems like everyone heads for the front and it gets congested."
        }, 
        {
            "index": 226, 
            "rating": "5", 
            "review": "Great service! amazing boats.... the only problem,, they ruined the open ocean experience with the loud musician playing guitar and singing something that was barely understandable..."
        }, 
        {
            "index": 227, 
            "rating": "4", 
            "review": "Great round trip experience. We traveled to Playa Del Carmen MX and had an easy walk to the ferry to go to Cozumel. There is some construction going on nearby so one should be careful walking around. The important thing to remember is to not buy round trip tickets. The reason for this is the two ferry companies work with each other on an every other hour basis. So if you bought r/t tickets you would have to wait until that particular ferry departed even though the other ferry was leaving sooner. It's kind of confusing but when you get there you will understand."
        }, 
        {
            "index": 228, 
            "rating": "5", 
            "review": "Ferry ride over. Had a stress free ride from playa to Cozumel and back. They ferry was prompt and on time. The boarding and offloading was quick. Our big recommendations were to only buy one way as you don't get a round trip discount and you can choose between two ferries with different time schedule. We ended up going back on same one due to the time we wanted to leave Cozumel."
        }, 
        {
            "index": 229, 
            "rating": "3", 
            "review": "Returned us to a different dock then the one we departed from. We took the Ultramar Ferry from Cancun to Isla Mujeres and everything was fine on the way there. Left ontime right at 9:00am. We left from Playa Caracol which was a super short 5 minute walk from our hotel. On our way back they said Playa Caracol was closed due to bad weather, but the weather was not bad. They were running a little late and I think they just wanted to make up time, annoying to say the least. They dropped the entire boat off at Playa Tortugas which is about 3 miles away. It wasn't the end of the world, we figured out how to get on the bus and made it back to the hotel. Other then that, everything was as advertised. Music on the ferry is pretty corny but entertaining."
        }, 
        {
            "index": 230, 
            "rating": "5", 
            "review": "Great and comfortable ride. The rides were $17 dollars rountrip and free for young children under a certain height. We were comfortable and fast ride to isla mujeres. My mom who is claustrophobic and doesn't do boats did very well."
        }, 
        {
            "index": 231, 
            "rating": "4", 
            "review": "Efficient. The UltraMar Ferry is one of two ferry companies that share the route from Playa Del Carmen to Cozumel and back. Ferry service runs every hour on the hour.UltraMar has a very clean, spacious, and air conditioned vessel. If you want, you can sit on the second deck which has no windows and thus is open to the breeze. There is a small bar on the lower deck that serves snacks and drinks.For a family of 4 (3 adults, 1 child) we we able to pay using a Visa credit card 3 separate times (about 600 pesos). However one time on a trip from Playa Del Carmen to Cozumel, they told us cash only. Not sure why. Also they severely questioned the age of my daughter. She is 11 but 5'4\" tall and they gave me some grief when I presented a child's ticket for her.Other than that tough, the ferry is a quick (45 minutes), easy ride between San Miguel and Playa Del Carmen. The ferry was always on time and the ride was always comfortable.One thing to keep in mind is that sometimes there is no 9:00pm ferry. Not sure why that is, but we got caught by that once and had to stick around Playa Del Carmen for the 10:00pm ferry instead. Also the two ferry companies share hours, so it is probably not a good decision to ever buy a round trip ticket."
        }, 
        {
            "index": 232, 
            "rating": "5", 
            "review": "Efficient Service. We had a great journey over to Cozumel. The ferries were clean and efficient. It cost £6.50 single. It is better to buy two singles as there are two ferry operators. This gives you the opportunity to be flexible and use either operator."
        }, 
        {
            "index": 233, 
            "rating": "5", 
            "review": "Live music. Took the ferry to Playa del Carmen, did not expect to have such a great time - band was great!! Drinks and snacks are served and the water is the most amazing blue color. Ferry docks right at Senior Frogs, and the shopping is all close by."
        }, 
        {
            "index": 234, 
            "rating": "2", 
            "review": "UltraMar does not return packages left on Ferry. My family and I have traveled to Isla Mujeres more than 8 times using the Ferry. The most recent trip, we left a duty free package mistakenly. We arrived at the port in Isla at 12:30 pm. I returned to the port at 1:30 pm trying to retrieve the goods with no avail. The run around I was given was ridiculous. So don't expect returned goods if you leave them on UltraMar!!! They will not help you get your belongings back. Very disappointed..."
        }, 
        {
            "index": 235, 
            "rating": "5", 
            "review": "Grat Trip. Nice ride, with a great Latin band playing both legs of the journey, the boats are fast and comfortable, just try and get there a bit before sailing time, and you will get a good seat"
        }, 
        {
            "index": 236, 
            "rating": "5", 
            "review": "Neat way to Cozumel. It is pretty cool to take this boat ride to Cozumel. It is air conditioned and comfortable and reasonably priced."
        }, 
        {
            "index": 237, 
            "rating": "5", 
            "review": "ferry to playa. It was air conditioned. They did walk around selling beverages, water, sodas, etc. Plenty of seating. We thought it was strange on the way to Playa, the screen was showing what to do in cozumel."
        }, 
        {
            "index": 238, 
            "rating": "5", 
            "review": "Very good transportation!. We used Ultramar Ferry from Cozumel to Playa del Carmen. The ferry is very well kept, clean, AC inside, as well as TV for entertainment. Great choice!"
        }, 
        {
            "index": 239, 
            "rating": "5", 
            "review": "Ferry to Cozumel. Take the ferry across to Cozumel. There is entertainment on the 35 minute ferry ride. Rent some scooters and tour this island. You can travel down the east coast taking you to Punta Sur and travel through the Ecologic Reserve. Then travel back to the city via the west coast. You will not be disappointed!"
        }, 
        {
            "index": 240, 
            "rating": "2", 
            "review": "Bad organization!. This company offered it services in a huge nd important event in Cozumel in which they didn't organize the timing. Their schedule sucked nd didn't match with the Sacred Mayan Journey that was held in the island two days ago. Many ppl lost the arrival nd departure of the oars because they bought tickets with them. Please don't offer something that u cannot provide well."
        }, 
        {
            "index": 241, 
            "rating": "4", 
            "review": "Cozumel to PDC. We used the ferry twice during our last trip. PDC to Cozumel and return. The ferry is clean and comfortable with AC inside. Boarding the ferry in PDC can be a little bit of a challenge for someone who is tall. The opening was only about 4 1/2 ft tall. This might depend on whether high or low tide. On the return trip - 7 am ferry, the ferry left 15 mins late. Not a pick deal if you allow for the extra time in your schedule. The cost was 163 P one way. Understand that the fee is going up."
        }, 
        {
            "index": 242, 
            "rating": "5", 
            "review": "Nice ride!. While staying in Playa del Carmen, decided to check out Cozumel, as we had not been there in years. The ferry runs roughly 7am to 9pm every hour. The sales guys at the kiosk suggest to go one way, then buy one way back - no change in cost vs. round-trip. This was great because if you buy round-trip, you only have certain times to come back, w/the one-way you have more flexibility. It was a last minute decision for us, but we still got on - it was packed - holds about 450+ people. Because we were all but last, we ended up on top in the sun. It was nice - but bring a hat, just in case - it's toasty w/o shade! I get sea sick VERY easy, so I was pretty concerned, and was frankly glad to be outside. No sea sick at all, pretty smooth ride and only took about 30 mins.On the way back, we got in line earlier and were seated on the inside - it was quite plush, very air conditioned and extremely comfortable-yes, you're packed in there, but the seats are very roomy, so you don't feel squished. Again, very concerned about sea sickness, but I did fine, no problems at all, even though we sat on a side, rather than in the middle. They offered drinks, snacks (for sale) and played 'commercials' for attractions. Was very impressed the whole process and look forward to doing it again!"
        }, 
        {
            "index": 243, 
            "rating": "5", 
            "review": "!! To Cozumel. !! :). I took. The ferry on playa del carmen to travel to Cozumel , it takes only 45 min , and it's calm,nice and and live music, the only bad thing is the price , but you would enjoy the island of Cozumel , have fun !!!"
        }, 
        {
            "index": 244, 
            "rating": "5", 
            "review": "Very good. We took this ferry twice during our stay in Cozumel and it was convenient and comfortable each time."
        }, 
        {
            "index": 245, 
            "rating": "5", 
            "review": "Just relax for 45 minutes.. Great ferry - we sat downstairs in the comfy seats with the air con, plug in your own music, close your eyes and before you know it you are arriving in Cozumel! They sell drinks and crisps etc. on the ferry!Just buy a one way ticket and then another one on the way back - that way no problem of having to wait a long time.You will be hounded all the way to the ferry queue by people wanting to sell you tickets, excursions for diving etc. etc. - don't be sidetracked!! Just go to the regular ticket desk and buy a one way - no problem and even though the queue appears long - there is lots of room!"
        }, 
        {
            "index": 246, 
            "rating": "3", 
            "review": "Great ride-- DON\"T buy round trip though. They had live music and it was interactive and fun. Well kept boat. Awesome tripThe only thing is they push you to buy round trip (and why wouldn't you, you're going back) yes but their schedule is opposite of the other ferry's schedule which is another company. So just get one way and then when you are done in sightseeing, buy your return with which ever one is sooner. It might be with this one, but it beats waiting 2 hours when you've just missed one."
        }, 
        {
            "index": 247, 
            "rating": "3", 
            "review": "Good idea but needs improvement. We took this ferry twice to and from the cruise port. On our way to our tour they picked up our excursion tickets when getting into the ferry. The ferry seats were comfortable and they kept playing a video in loop of tourist places. The bar staff was very friendly and greeted the passengers. Too bad I cannot say the same for the rest of the staff they were too busy on their phones playing and telling each other jokes. I stop one of them to ask a question and you would have thought i had asked her something improper. She did responded but with an attitude, the bar runner guy joined us and attempted to correct the girls attitude. Once we got off the fairy the passengers seemed lost since they did not have the tickets to their excursions which had more details like excursion number, etc. On our way back we sat on the outside this was better you did not feel the water sloshing and bumping of the water. In the interior we saw lots of people sick but in the outside it was so smooth. The seats are not as soft but its a short ride to the dock. We had some ferry guy come and give us instructions in broken English and in a voice volume that you could not hear anything. He repeated his speech three times but yet people still did not hear or understand. Next thing we notice they are passing a bucket for tips. The bar runner guy told him to repeat his speech for our area but he made a gesture and walked away. So the bar runner guy told us a summary of what the first guy had said."
        }, 
        {
            "index": 248, 
            "rating": "4", 
            "review": "Cozumel ferry. Was excited to take the ferry to Cozumel during our stay in the Maya Riviera. We did not realize Cozumel was so close! We were able to use a credit card for the fare. It only took about a half hour to cross. Even though the lines can be long, they have many boats. So don't worry if you think you won't fit on the ferry! There was space for everyone inside. The ferry is clean, but the bathrooms are not great. So wait until you get to the dock and use those if you need."
        }, 
        {
            "index": 249, 
            "rating": "4", 
            "review": "Useful and you have one every hour. They are two companies working and you have a ferry leaving every hour. The cost is 155 pesos (around 13 US $). It cost the same buying 2 single tickets than a return one so although is a pain to the queue twice, you might want to see which company is leaving first at the time of your return and buy your ticket then.You can purchase drinks on board. Trip is around 50 min. Pretty easy. The only bad thing are ones cutting lines, pushing, etc. Shameful to say that this behaviour was displayed by the visitors and the locals. I am wondering what these people would say if we saw the same behaviour carried on by visitors at home. Ferry had plenty of seats. If you tend to be cold, be aware that there is a strong air con inside so head upstairs for outdoor seating or bring something to cover up. Enjoy Cozumel and its beautiful waters."
        }, 
        {
            "index": 250, 
            "rating": "5", 
            "review": "Fast and cheap!. The ferry from Playa Del Carmen to Cozumel was fantastic. It was fast, efficient and great service. The staff take your bags upon boarding, there are comfy seats inside to sit on or you can take in the fresh air and sit outside. The line for the ferry to Cozumel was huge as it was peak season, but on the way back it was quicker and quieter. The ride itself was pleasant. There were a few bumps but overall very enjoyable. There are two services available, however due to our departure and arrival times, the UltraMar was the one going when we wanted to leave."
        }, 
        {
            "index": 251, 
            "rating": "5", 
            "review": "Ride up top if you can.. We used this ferry from Cancun to Isla Mujeres for a half day trip. The ferry is clean, the service prompt and it is all very accessible. The ticket counter only takes cash, so plan accordingly. Also, there is a \"dock\" fee that adds a couple of dollars per person above the advertised prices.We rode up top on the way over, and inside on the way back. It can be a rough ride depending on the waves, which for us made it kind of fun."
        }, 
        {
            "index": 252, 
            "rating": "4", 
            "review": "fast ferry!!. Fast ferry that took us across from playa de carmen to Conzumel. Great time, snack avaliable in the boat. nice view of both place from the boat."
        }, 
        {
            "index": 253, 
            "rating": "5", 
            "review": "be adventurous and take the ferry. Try taking the ferry over to cozumel when in playa del Carmen - what fun! People going to work, back packers and tourists - all together bouncing about on the beautiful carribean sea. The hire cars are a sight to see - we hired what we thought was to be a volkswagon \"herbie\" convertible - metallic green and held together with ties - even mod con air conditioning via the hole in the floor!! Still, we certainly attracted a lot of interest and still grin about our adventure some 5/6 months on.Travelling around Cozumel is easy enough and the beautiful coast line will take your breath away, white horses all the way. Don't bother paying for costly trips - even if you could find one. The booking office for the ferry is easy to find and not over crowded nor expensive. The shops in Cozumel,'s main street cater for the \"rich cruise shippers\" and have security on the doors - ready to protect all of the precious jewels and metals - what a dazzling site. Venture further in and you will find all of the usual bars/cafes and market stalls - all willing to haggle - and make sure you do. All in all, a great day and still giggling about our day in \"herbie\"!"
        }, 
        {
            "index": 254, 
            "rating": "5", 
            "review": "Two Different Cozumel Ferry Lines. From our hotel in Playa, we took a taxi because it was a bit too far to walk (and it was hot). A suggestion we took was only purchase a one way ticket. That way, you can leave on the ferry leaving right away and on the way back, go to the ferry line which has the next ferry to depart. The price of 2 one way tickets is the SAME as a round trip ticket. They will try to sell you a round trip ticket but we are so glad we didn't. On the way back, the ferry leaving when we were ready to go was actually the other company. Otherwise, with a round trip ticket, we would have ended up waiting another hour...The ferries are wonderful and clean. No worries there!"
        }, 
        {
            "index": 255, 
            "rating": "5", 
            "review": "Our first ferry experience won't be our last.... We have been to Cozumel 3 times now and this was our first time that we have taken the ferry. We found it to be very enjoyable and was impressed by the fast, friendly, clean, comfortable, efficient and overall fun experience."
        }, 
        {
            "index": 256, 
            "rating": "4", 
            "review": "Ultra seasick. I never got sea sick until I rode on this ferry .Bring a barf bag. (they provide bags if needed). Take some sea sick pills 30 mins before boarding. It gets hot (a/c is too weak) so bring a fan."
        }, 
        {
            "index": 257, 
            "rating": "5", 
            "review": "Fun Day.. Fast service to isla mujeres. Isla Mujeres was fun. Rented a golf cart ans saw the entire island. Tasted food from local vendors on the cheap. Excellent food and overall a great day. Would recommend it highly. Only negative is that everywhere in Mexico they want you pay for the restroom which I think is ridiculous. And the tipping everywhere you go is outrageous."
        }, 
        {
            "index": 258, 
            "rating": "5", 
            "review": "A nice comfortable ride from Cozumel to the mainland. This was the most comfortable boat ride I've ever taken. The trip takes 40 minutes each way. The cost is a little steep at $13 each way. Do not buy round trip as you will most likely be taking the other ferry back to the island. The air conditioning aboard really helps with sea sickness as well. I took Dramamine and had no issues with sickness."
        }, 
        {
            "index": 259, 
            "rating": "3", 
            "review": "Ferry to Cozumel. Nice but loud and crowded. They do serve beer and soft drinks but they have a band and if you sit close to the front of the sun deck it can be a little loud. It is very crowded and you will more than likely get stuck sitting next to someone you don't want sitting next to you."
        }, 
        {
            "index": 260, 
            "rating": "5", 
            "review": "UltraMar--super Beware of Taxi Scam. Be sure to tell your taxi driver that you want UltraMar Ferry, you best ride to Isla Mujeres. We made the mistake of asking for the ferry at Playa Tortugas and we left off at Mexicana. Horrible! Bad boat and only had 2 trips 10:00 and return at 5:00."
        }, 
        {
            "index": 261, 
            "rating": "5", 
            "review": "Nice Ride. My wife and three teen agers went to Cozumel for the day and had lunch at the Hard Rock. We enjoyed the ride and sat outside both ways to enjoy the experience. The ride back was at sunset and had live music, we loved it and would do it again in a heartbeat.We paid about $24 for a round trip ticket."
        }, 
        {
            "index": 262, 
            "rating": "5", 
            "review": "Live Music and Drinks on the Ferry. The ferry is a very enjoyable experience. Live music on the upper deck, open air, and great views of the ocean."
        }, 
        {
            "index": 263, 
            "rating": "5", 
            "review": "Fun Ride to Cozumel. Excellent and fun trip! Hope the waves are down, can see bad sight in bathrooms at end of journey due to seasick people giving it up! Buy a one way ticket because there are two ferry companies and the alternate hourly so never buy your return ticket until just before you actually elect to return....."
        }, 
        {
            "index": 264, 
            "rating": "5", 
            "review": "Ocean Breeze or Air Conditioning. Your option to sit downstairs in the AC or sit upstairs and have the breeze go through your hair. My husband sat in the ac and he said it was great, no worries about getting sea sick. I sat upstairs with the breeze, awesome. That's what its all about. On our way to Cozumel we were offered water, on the way back, not. It was still great. Plus you can buy a roundtrip ticket in advance so you don't have to worry about the ticket on the way back."
        }, 
        {
            "index": 265, 
            "rating": "4", 
            "review": "Quick, efficient, but stormy wavy day. We rode an early ferry to Cozumel. Everything went great with buying tickets, had a short wait in line, and then loading on the ferry in an efficient manner. This ferry is huge. Most everyone sat inside, it was an overcast, windy and rough seas day. Motion does not bother me but there were a few with sea sickness bags and definitely using them! The crew were passing them out right and left. The ride was nice, with an informational type movie up front. It was just a very wind stormy and overcast day. So windy, that when we got off the ferry and were walking to the taxi area, my arms were blowing up in the air- and I was even carrying heavy bags! We were on our way to deliver items to the orphanage there. But yes, we really liked the ferry ride... And want do do it again, especially when the seas are a but calmer. If you have a tendency to get sick, remember to take a pill before you get on. It will help a lot. ;)"
        }, 
        {
            "index": 266, 
            "rating": "4", 
            "review": "Water Limo!. Man this company has grown in the last few years. These ferrys have super comfy seats with A/C and a TV playing something while you cruise across the water.The tickets are about 13usd each way and the ride from PDC to Cozumel is about 20-30 min depending on the water conditions.They sell snacks, water, beer."
        }, 
        {
            "index": 267, 
            "rating": "5", 
            "review": "Great ferry ride between Cancun and Isla Mujeres. While we were staying in Cancun we decided to go visit Isla Mujeres using the Ultramar ferry.I wanted to take it from Puerto Juarez since it is a lot cheaper, but getting the right information on how to get there from the hotel zone was a little hard to obtain. I got a lot of conflicting information from the front-desk, concierge, travel agency, etc...Some said that the ferry was the same price from Playa Tortuga, other told me that the only way to get to Puerto Juarez was to use a taxi, etc... So here is the real information, as of today at least. The round-trip ferry ride cost you 17.00$US from Playa Tortuga and about 10.75$US (140 Pesos) from Puerto Juarez so it is cheaper (about 6.25$US per person) from Puerto Juarez.There is a bus that goes from the hotel zone to Puerto Juarez, it is the R-1 Bus with \"Puerto Juarez\" written in the front window. Not all \"R-1\" buses go to Puerto Juarez, but from what we saw the \"R-1 Puerto Juarez\" bus runs about every 20 minutes. The bus ride from Park Royal hotel (middle of hotel zone) to Puerto Juarez took us 21 minutes.This bus let you out right in front of the Puerto Juarez Ultramar Ferry, and picks you up at the same place at the end of the day. No trouble at all !About the ferry ride, it is very frequent so you won't have to wait to long to catch one, and it is quite fast, about 15 minutes.This is a great way to get to Isla Mujeres and it is cheap so we enjoyed it and would recommend it."
        }, 
        {
            "index": 268, 
            "rating": "2", 
            "review": "Wish there was an alternative Ferry Service. We took the ferry from Playa del Carmen to Cozumel last week. Although, we were informed that the service accepted Visa credit cards, we were surprised when they pushed for cash only for one leg of the trip.For the return trip, I was much more firm with the agent and they accepted Visa as payment"
        }, 
        {
            "index": 269, 
            "rating": "5", 
            "review": "check the schedule from isla to cancun. great experience from cancun to isla mujeres. 17 bucks rdtrp.. took the last ferry out but it was to puerto juarez not playa tortuga. more expensive cab ride back to hotel. however , ferry service was great. live music on ride back, under a starlit sky and mexicans singing out loud to their local music gave me goosebumps and made me smile."
        }, 
        {
            "index": 270, 
            "rating": "5", 
            "review": "Love Latinga playing on the ferry.. I seem to get lucky enough to hit the right hour for the Ultramar ferry when going over to Cozumel. Nothing gets you in the Island mood so fast as a nice cold cervesa on the weather deck listening to the guys from Latinga, ship band, while looking at the water. They play on tips only, so give a little. I bought the CD and loaded it on the iPhone. Good Stuff. This trip they saw us and the bags heading to the dock and held the ferry a minute to let us get on. Great company! Be sure though not to buy a round trip ticket, unless you are willing to wait. The two ferry companies alternate hours, more or less, throughout the day."
        }, 
        {
            "index": 271, 
            "rating": "4", 
            "review": "The easiest way to get from Playa to Cozumel. There are actually two ferry services, and they alternate crossings, so don't buy a round trip ticket... you might very well want to come back on teh other line. They also do NOT run every hour - there are some gaps - and we got skunked that way, having to wait aroung in Playa for an extra hour.The ferries are pretty comfortable, and have a lot of capacity. Both sell snacks and cold drinks, but no coffee - get it before you board. Th ewhole deal takes about 45 minutes, including boarding."
        }, 
        {
            "index": 272, 
            "rating": "5", 
            "review": "Items Left Returned To Owner. While visiting Playa Del Carmen, a person in our group accidentally left some merchandise along with a very expensive camera at Captain Dan's. Jorje from Ultramar was kind to get the merchandise back and contact us in order to get the items back to their owner. Our friend was not very optimistic of the merchandise's returns as expensive items were accidentally left, but two days later we met with Jorje and some of his friends from Ultramar and everything that was in the bags including the camera was returned! The friendliness and honesty of the Ultramar employees is outstanding. I recommend their ferry service very much!"
        }, 
        {
            "index": 273, 
            "rating": "3", 
            "review": "Nice way to get to Cozumel from Cancun. After spending 3 days in Cancun we headed to a rental house on Cozumel via the ferry from Playa Del Carmen. It should be noted that there is no ferry from Cancun to Cozumel. You actually have to travel about 30 minutes down the coast to Paya del Carmen to take the ferry. The ferry runs all day once an hour and costs about $12 one way. There are two ferry companies that provide service. Mexi-jet and Ultramar. Both offer the same services and both take about 30-35 minutes to make the crossing. If you are prone to seasickness do not sit inside on the front as it is quite the rocky ride. I enjoyed sitting on the upper open deck on the stern of the boat."
        }, 
        {
            "index": 274, 
            "rating": "1", 
            "review": "Just about everyone was seasick. I think I might have been the only person on this entire boat who was not seasick, and that took some effort on my part. The ride was extremely rough and people were throwing up everywhere, faster than the staff could hand out the little blue barf bags. We saw a much larger UltraMar ferry sitting in the dock; I don't know why they were using the little ferry, but it was a very rough passage. The sea didn't seem to be overly rough. At the end, they pulled out a big hose to wash all the vomit off the deck, so I guess this is something they are used to.We spent all day in Cozumel being worried about the return trip and another forty-five minutes of people throwing up everywhere.. the sea seemed to look much wavier and rougher later in the day, so we took a chance and booked the return ticket with another company called Mexico Waterjets. It was a world of difference. The ride was so calm in comparison, even though we could SEE huge waves, we did not feel them on the much bigger boat, and it was only thirty minutes rather than forty-five. I would absolutely not recommend travelling with UltraMar unless they are using the bigger of their ferries-- our ride on the smaller one was simply awful."
        }, 
        {
            "index": 275, 
            "rating": "5", 
            "review": "Great ferry ride between Cancun and Isla Mujeres. This is an easy way to travel to Isla Mujeres from Cancun ($17 round trip). The ferry is fast and smooth. You can sit outside or inside in air conditioning. We rode one way outside and the retun trip inside. The outside benches were not padded, but the trip was less than 1/2 hour so that was okay. Hold on to your hats outside, though! We rode inside on the way back and it was very comfortable! High-backed, bus-like seats. Large windows but constant sea spray so not great viewing. The better viewing is from the outside seats (upper deck)."
        }, 
        {
            "index": 276, 
            "rating": "5", 
            "review": "Good and safe experience. This is a top-class service, and I was very pleased to use the Ultramar ferry that joins Playa del Carmen and Cozumel / Isla Mujeres. It is fast, safe and very comfortable. I used it to spend the day in Isla Mujeres, and came back right before sunset. To make it better, there is free internet aboard and the tickets are very reasonable. Good experience!"
        }, 
        {
            "index": 277, 
            "rating": "4", 
            "review": "Ferry to Cozumel. Quick, efficient ferry. The only issue I had was that you cannot use a credit card to buy a one-way ticket."
        }, 
        {
            "index": 278, 
            "rating": "5", 
            "review": "great trip over to Cozumel. Definitely worth at least 1/2 day to sightsee and find Margueritaville !! Great Lunch and atmosphere"
        }, 
        {
            "index": 279, 
            "rating": "5", 
            "review": "Free Wifi!!!. Bring the laptop as wifi is free. Fast Fast ferry!!! Try to get a seat in the \\back so you can keep an eye on your luggage."
        }, 
        {
            "index": 280, 
            "rating": "4", 
            "review": "get there early and bring water...long wait but worth it to get a seat. worth it to get a seat to get there early to sit outside, near ocean and breeze on hot day to cozumel!"
        }, 
        {
            "index": 281, 
            "rating": "4", 
            "review": "Clean and fast. The boat was clean and it was only about a 30 minute ride to Cozumel. Cost was roughly $24 round trip. Book one way tickets though."
        }, 
        {
            "index": 282, 
            "rating": "4", 
            "review": "Cozumel. Reasonable rates. Not a good day, but definitely worth seeing.\nBeware of car rental thieves!! They completely ruined our day."
        }, 
        {
            "index": 283, 
            "rating": "5", 
            "review": "easiest way to get to Isla Mujeres. Ultramar is the fast boat (there's a slow boat but not regular and not that much cheaper) to Isla Mujeres. Cost 140pesos return. you can buy the return ticket from Cancun and use it anytime, there's no expiry on it. It runs every 30 mins and takes about 15-20mins, and air conditioned !"
        }, 
        {
            "index": 284, 
            "rating": "4", 
            "review": "The Ferry to Cozumel. We always take this ferry over to Cozumel. You can sit inside with air-conditioning or sit uptop and catch some sun. There is always a small band on the upstairs level .... nice entertainment and they ask for tips at the end but not required. The have a man that comes around and offers you drinks/snacks for a price and they also have a consession area on main floor. And it offers bathrooms.I believe this ferry leaves every hour. When you buy you tickets only buy one way .... because there is another ferry that runs opposite to UltraMar .... so deciding on when you want to return you can pick which one best suits your schedule.Ummm I think its about a 40 minute trip or a little less.Cost is about $15 per person (adult) each way"
        }, 
        {
            "index": 285, 
            "rating": "5", 
            "review": "Music and quick travel to Cozuem. Fast ferry to cozumel. Convient and about 40 minutes dock to dock.. Had a great band on board and served snacks and beer....."
        }, 
        {
            "index": 286, 
            "rating": "5", 
            "review": "Great little trip. we stayed in Cozumel and took a couple trips to the Playa del Carmen area. This ferry leaves on time every 30 min and makes constant trips back and forth. Its cheap, safe and great outdoor seating to see the beautiful coastlines as you approach the shores. One the one trip there was a band playing music inside which was a nice surprise. I think they offer drinks and snacks for a minimal price. Its a a great little trip in itself to travel across the channel."
        }, 
        {
            "index": 287, 
            "rating": "4", 
            "review": "visit Cozumel. departure every 30 minutes,best way to visit Cozumel.It takes only 45 minutes to get to Cozumel.Don't forget to visit San Miguel."
        }, 
        {
            "index": 288, 
            "rating": "5", 
            "review": "Ferry Ride. Great deal for $12.00 to go across from Cozumel to Playa Del Carmen. Watch out for unscrupulous taxi drivers if they think you are not going very far once you get there."
        }, 
        {
            "index": 289, 
            "rating": "5", 
            "review": "One of 2 ferrys to cozumel. You have a choice between this company and another company to go to Cozumel. They both charge the same price and the boat is the same. They run at opposite hours of the day."
        }, 
        {
            "index": 290, 
            "rating": "3", 
            "review": "Same as always. The ferry service between Cozumel and Playa del Carmen is a necessary evil. The temp is usually too cold inside, lots of fumes outside. At least this time of year there are not many people, so you get your pick of seats."
        }, 
        {
            "index": 291, 
            "rating": "5", 
            "review": "Crazy Ferry to Cozumel!. We were so not prepared for this ferry ride, but we had a blast. We ended up on this ferry 3 times on our excursions to Cozumel from Playa. Get ready for an exciting ride to say the least. We sat on the top and were entertained by a great live band that makes the trip fun and takes your mind off the rocking and rolling ferry. Yes the ferry rocks and rolls. My wife thought for sure she was going to get sick, but once the band started playing and everybody starts getting into it, she ended up having a great trip each time. There is no live music on the bottom level.Price: About 12-13usd per person one way.FYI: Only buy one way tickets at the ferry terminal. There are 2 different ferry companies leaving at different times. So if you don't want to be stuck wating to come back, don't buy round trip tickets. On our last ferry to cozumel we missed the ultra mar, but were able to buy tickets with the other company which were the same price, we were glad we didn't buy the roundtrip or we would have had to wait another hour for the ultra mar and we ready to get back to our hotel.P.S. If you have any mexican coins you want to get rid of take them to tip the band, they make their money off tips only."
        }, 
        {
            "index": 292, 
            "rating": "3", 
            "review": "Good ferry ride. All in all was a pleasant way to go to Cozumel and then back to Playa. Staff aboard the ferry were very nice and we were entertained with live music."
        }, 
        {
            "index": 293, 
            "rating": "1", 
            "review": "Ferry to Cosamel.. Water was rough and was sick the whole way. Staff on the ferrywere excellent. They were very passionate and caring, they couldn't do enough for you. I believe if the water was calmer itwould of been a pleasant trip."
        }, 
        {
            "index": 294, 
            "rating": "4", 
            "review": "going across. Those ferries operate in cancun and playa del carmen and having tried both locations; i can assure you it is a quick crossing both to isla mujeres or playa del carmen to cozumel.If it is a large boat it can still be rocked by bad weather. But all ships rock under bad conditions. The staff is o.k. , the utilities as well. Just remember it is a very short crossing so nothing to really worry about."
        }, 
        {
            "index": 295, 
            "rating": "4", 
            "review": "Prepared!. New n clean....staff was prepared w throw up bags and it was needed that day along w alcohol due to bad weather. On time n well organized. Clean bathrooms too"
        }, 
        {
            "index": 296, 
            "rating": "5", 
            "review": "Fast. We traveled over to Isla...Took are little dogs ...They were so helpful with boarding and taking care of our puppies...Would do it again ...Very pleasent experance...We will go over soon and take the dogs..."
        }, 
        {
            "index": 297, 
            "rating": "4", 
            "review": "good ride. no problem, well organized. nice wind blowing on a hot hot day...very relaxing day. i did get stung by a bee...unfortunately"
        }, 
        {
            "index": 298, 
            "rating": "1", 
            "review": "Terrible Customer Service. When we were given our roundtrip voucher they tore off the part needed to come back, we ended up having to pay again to get back. They refused to get a manager for us and told us the ferry was leaving in 5 minutes and if we didn't get one we'd be left on Cozumel. DO NOT RECOMMEND. Use the other service and make sure they don't rip off both sections (which we didn't think to check or realize they did)"
        }, 
        {
            "index": 299, 
            "rating": "4", 
            "review": "Great start to a trip to Cozumel!!. How can you go wrong with a live band playing......trip was a breeze and the staff was great. Buy tickets one way at a time so that you can leave on your schedule."
        }, 
        {
            "index": 300, 
            "rating": "5", 
            "review": "Quick & no sea sickness!. We took the Ultra Mar ferry back from Cozumel twice and it was modern, quick and on time.FYI- there are two competing ferries that go to Cozumel and they switch off hour to hour as to who's running, so only buy a one way ticket or you may be waiting over an hour."
        }, 
        {
            "index": 301, 
            "rating": "3", 
            "review": "Ferry from Playa to Cozumel. The ferry itself was good but I can do without the 'entertainment'.\nI just wanted transportation to the island and enjoy the ride. Didn't want a party-boat."
        }, 
        {
            "index": 302, 
            "rating": "4", 
            "review": "quick service but just buy a one way ticket. You can always buy your return ticket on the way back and that way you can choose which one you travel on and you are not stuck waiting for a certain ferry to come and get you."
        }, 
        {
            "index": 303, 
            "rating": "5", 
            "review": "Rode 4 times in September with no problems. We rode the ferry to and from Cozumel and Playa Del Carmen and the ferry to and from Isla Mujeres and Cancun. Each trip left on time, was relatively affordable and was comfortable. The ferries all seemed to be built in the USA within the last 5 years."
        }, 
        {
            "index": 304, 
            "rating": "5", 
            "review": "So easy to access and very inexpensive. Great fun, indoors you can ride in the air conditioned, spotless and new cabin, or on the deck above in the sunshine and breeze where you may be serenaded by someone who plays an instrument, most often with a really bad voice but what the heck it's fun. You then tip the singer a few peso's for his songs you enjoyed while you crossed the water. There is help on either side of the Ferry if you want help with your bags."
        }, 
        {
            "index": 305, 
            "rating": "5", 
            "review": "Boats to and fro Cozumel. Boats are comfy and fast. Inside AC. Baggage well cared for-don't lose tickets. If you have definite schedule check the departure times on both sides of card. Boats leave and arrive at different times on diff days-usually alternating. Sometimes big gaps around 12:00 noon and 2:00 so go early if possible because they leave continually till noon, big pause for tacos, and many later in afternoon for workers"
        }, 
        {
            "index": 306, 
            "rating": "5", 
            "review": "ALOT OF FUN!!. This is a great way to spend a day, go over to cozumel, the submarine rides are really cool, the sellers are a little more persistant, and the boat ride alone is alot of fun, music drinks, good time!!"
        }, 
        {
            "index": 307, 
            "rating": "3", 
            "review": "Nothing special. The ferry is clean and nice, but is like any other the toll MXN$155 and the leave every hour only check the day because is different in odd days and even days."
        }, 
        {
            "index": 308, 
            "rating": "5", 
            "review": "Nice Trip. We enjoyed the ride and clean boat. The little band was a nice touch as well. Would like to have ridden on the top deck but that was closed for some reason"
        }, 
        {
            "index": 309, 
            "rating": "4", 
            "review": "Go to Cozumel!!. A great trip to Cozumel to bar hop around the island!! Stop by the Money Bar, fish taco at Coconuts are awesome, Rasta's is a blast and Playa Bonita is a hoot!!"
        }, 
        {
            "index": 310, 
            "rating": "3", 
            "review": "Quick, efficient but super rocky. If you're prone to sea sickness this Ferry ride is probably not for you. The design of the ferry doesn't do much to stabilize the rocking.Other than that the ferry was fast efficient, comfortable and well worth the ride to visit Cozumel."
        }, 
        {
            "index": 311, 
            "rating": "5", 
            "review": "the desk staff are rude rude rude but the musicans on board are amazing. I have been to mexico 3 times now and there is nothing like a day trip to couzmel but the ticket office staff are so rude. but the musicans on the boat are great, i bought there CD it was $10 bucks great buy"
        }, 
        {
            "index": 312, 
            "rating": "5", 
            "review": "Awesome. You can go to Cozumel for really cheap with the Ultramar. Visit the island by yourself with the excursion (which I dont like because they do not give you enough time). We went there twice with the Ultramar. The ferry is right next to the hotel (PLAYACAR PALACE) and comes and goes every hour. We also stopped by the Cozumel Palace and ate there for free. At Cozumel we rented a Jeep for $50 to ride around the island with. :)"
        }, 
        {
            "index": 313, 
            "rating": "5", 
            "review": "Live entertainment on a ferry.. We enjoyed the ride. Seemed like a quick ride. There is a band that plays going across to Cozumel and also when coming back..They were great! The terminal in Cozumel was nice too."
        }, 
        {
            "index": 314, 
            "rating": "5", 
            "review": "Great way to get to Cozumel. Loved the ride over to Cozumel and back would higly reccomend it, would do it again Just line up and go"
        }, 
        {
            "index": 315, 
            "rating": "4", 
            "review": "It did what it was supposed to do.. It was on time, got me to and from Isla Mujeres (from Cancun), and comfortable. Ample seating indoors and outdoors. During the evening trip back, there was a musician on the top deck singing classics in various languages. Not a bad way to spend a Saturday evening. I thought the price was a little steep, but still in the reasonable range. Now, if only the guys behind me could stop talking for the 15 minute ride so I could actually hear the music......."
        }, 
        {
            "index": 316, 
            "rating": "3", 
            "review": "Quite expensive, too hot or too cold, and very noisy! not all bad though!. Not all bad, if you can sit outside without getting wet it can be a very enjoyable ride, unfortunately indoors they have air con blasting everywhere so you freeze, and they play a most annoying promotional video with very loud music and narration to accompany.on the top deck outside you sometimes get a band playing to entertain you which is usually very nice and they do bring round refreshments and things which you can buy but they are not fussy, toilets on board which is great ..just make sure you walk fast once you have got off so as to not get hassled by the people selling you tours, jeeps, scooters on the other side in cozumel or in playa! usually runs on the hour, but beware which ticket you have as there are two different companies which alternate every hour, and their schedule changes every month!"
        }, 
        {
            "index": 317, 
            "rating": "4", 
            "review": "Nice way to travel to/from Cozumel. This is a fun way to get to/from Cozumel but if you go in the Summer, I definitely suggest sitting on the top (outdoor) part. I know that sounds crazy but the inside didn't have any cool air and with as many people as were on there, there was no air circulation. We sat inside on the way there and I thought I was going to sweat to death, but on the way back we sat on the top part and there was a nice breeze and you got to see more. Also whichever port you start from, just buy a one way ticket instead of roundtrip because there are two different companies at the port and when you are ready to come back you can see which one is leaving next. That way you don't have to wait an hour if you just missed the ferry from your roundtrip ticket."
        }, 
        {
            "index": 318, 
            "rating": "5", 
            "review": "Great convenient service to and from CZM. There are 2 ferry services from PDC to CZM and back. They run on alternate hours and are very efficient. It is best to buy one way tickets instead of round trip. That way if you decide to leave earlier or later you are not locked into one ferry service. They offer snacks and drinks on board."
        }, 
        {
            "index": 319, 
            "rating": "4", 
            "review": "Good convenient way to get to Cozumel. Got to the dock at 7am which was when their boat was going to leave. Every month is different. For the month of August the schedule went like this: odd days (1,3,5,7, etc.) had even times, such as 8am, 10am, noon, 2 pm departures. And the opposite for even days...they had odd times such as 7am, 9am, 11am, etc. Just check their website, they even have a twitter account. Anyways, getting back to the story....got there at 7am and asked if we could board. They responded tickets are around the corner. So we went there and were told it was 156 pesos or something like that for one way. It ended up being $25 roundrip. There were no peddlers, hustlers, or anything of that sort. We just saw a ticketbooth that read \"Ultramar\" and the yellow and blue, which are their colors. We boarded and left around 7:10 or 7:15. They are pretty punctual. No musician playing, no music period. No wallets stolen, no theft. None of what I read about terrible experiences. My wife said the morning ride was \"peaceful, relaxing.\" Her and I get a bit seasick. Yes, it's true, you do get wet if you don't sit in the middle or are just on the wrong side. We got wet and moved to the middle just everyone else moved. No biggie. Got there in a half hour and same on the way back.We took the last boat at 8pm on that day. It was packed, but we arrived 30 minutes earlier. They had 3 boats lined up to take people back to Cancun. This time it was a bit late, not quite as punctual. Plus, there was a van that said \"Funeral\" on it near the dock, so we assumed some dead guy was getting transported by boat back to Cancun. It took awhile. Some people cut in line and hear whistles and some yelling at them. My wife and I sat inside in the AC this time. However, the waters are rougher during the night and she said she felt dizzy, disoriented, but not seasick. We had no problem with buying roundtrip tickets from this company.They have bathrooms, snacks for purchase, and wi-fi. They seemed pretty punctual for the most part and were courteous. You pick up the ferry at Playa Del Carmen. Just go to the dock and around that area you'll see the ticket booth. When you arrive at Cozumel, there is only one main dock there, so just tell the cab driver and you'll pick up the ferry exactly where you got dropped off. There was no confusion at all for us. I'd recommend taking this ferry to anyone."
        }, 
        {
            "index": 320, 
            "rating": "4", 
            "review": "Fast & Easy. We took Ultra mar from the port in Playa del Carmen. It was roundtrip $24/per person. typical outdoor/indoor seating. They have pull down shades to block the ocean splash if the sea is rough. Staff offered activities for Cozumel. We rented a scooter for the day for $25."
        }, 
        {
            "index": 321, 
            "rating": "3", 
            "review": "Ferry to Cozumel/Playa. The ferry itself is very convenient to get between Cozumel and Playa. It is very comfortable, has beverages and snacks and only takes about 45 minutes. The main thing I do not like about the ferry is the process to purchase tickets and boarding/unboarding the boat. First tickets - you really need to watch the people selling tickets - I have had them try not to give me my change twice! So be on your watch here. I suggest always buying one way tickets because there are 2 ferry companies that leave at different times and the tickets are not transferrable. So I have purchased a round trip ticket once and had to wait > 2 hours to return due to the hours of operation of the company I purchased it from. And you do not save any money buying a round trip ticket. But the sellers do not tell you that - they always assume you want a round trip ticket - so you have to say one way. Also, I find the tickets expensive - $156 pesos each way. The boarding/unboarding process is very unorganized and be prepared to find yourself having to push your way to get off.Oh and sometimes they have live music, which is nice, but be prepared to be hit up for tips at the end."
        }, 
        {
            "index": 322, 
            "rating": "5", 
            "review": "Ferry to Cozumel. Buy your tickets at the pier and don't be late! They go every hour and if you are a minute late you are not going for an hour. Only pay one way so you can come back when you want. Last ferry to Playa is 9pm so don't miss it and expect it to be packed. I loved Cozumel! Park in the parking area 2 blocks from the pier off the one way street? 10th?"
        }, 
        {
            "index": 323, 
            "rating": "5", 
            "review": "Cozumel is a must see!. I love taking the ferry over to Cozumel! It has become one of our favorite destinations. This was our 3rd Cozumel visit and I hope there will be more. It is one of the most beautiful islands, when you get out of the city and see the actual beaches. I would easily compare some of the views to Hawaii and other Caribbean countries we have visited. Do yourself a favor and put Cozumel on a Must See list! The ferry experience is awesome, comfortable, easy and quick!"
        }, 
        {
            "index": 324, 
            "rating": "4", 
            "review": "Ferry to Cozumel. The ferry to Cozumel was an experience you have to try when in Playa Del Carmen.It is a fun day trip if you are looking to break up your vacation."
        }, 
        {
            "index": 325, 
            "rating": "5", 
            "review": "FERRY TO COZUMAL. New, well cleaned, nice conditioning and extreme faster than the Mexican ferry. try to use this company for comfort."
        }, 
        {
            "index": 326, 
            "rating": "5", 
            "review": "An attraction in itself. I took both the UltraMar and Mexico Waterjet ferries back and forth to Cozumel. OK, I'm obsessed with riding boats and confess I did a round trip just for the thrill of it. There is Wi-Fi on both, the ferries are clean and spacious, and you will arrive on time even if they leave a few minutes late. There is air conditioned indoor seating as well as limited open air seating. Check the clouds as you may prefer to be inside during a storm. Be warned: I gave this an Excellent review, however, I do not suffer from sea-sickness. I overheard a woman tell her queasy husband, \"Pues, por eso dicen que cruzar a Cozumel es cruzar a Cozumel\", meaning, I guess that's why they say taking the ferry to Cozumel is what it is...and there's no way around it. The trips may not be suitable for the faint of stomach unless those people bring anti-queasiness remedies. There are attendants who moniter passengers for green-ness and will whip out plastic baggies for them. Some of my trips were less rocky than others, but for me the whole fun was in the other trips with their rhythmic extreme side to side swings that lead to us being airborne (over and over the whole trip, storm or no storm)...I don't know why the guidebooks don't warn people of this beforehand..."
        }, 
        {
            "index": 327, 
            "rating": "4", 
            "review": "Good Ferry. Good way - and the only (?) to Cozumel. Enjoyed the ride - even though it came a shover. Don't rent a car at Cozumel before you actually can see the car... Easy to negotiate prices as there are a lots of cars to rent - and some of them are wrecks...The lighthouse and Ecopark at the southern part is great - but only open from 9:00 AM to 4:00 PM."
        }, 
        {
            "index": 328, 
            "rating": "3", 
            "review": "A bit overpacked on the last boat.. We traveled on the ferry back from Cozumel on the last ride at 9pm, disappointed that there was no 8pm ferry. It was hot and muggy and overpacked even though we were sitting in the open air section. I would recommend avoiding the last boat or sitting in the air conditioned area below with a window seat to avoid feeling seasick. Our other experiences with the ferry were fine, and I would recommend it as a good way to get to the island."
        }, 
        {
            "index": 329, 
            "rating": "5", 
            "review": "reliable and fast. The best ferry for getting around. Reliable, fast, clean and friendly staff."
        }, 
        {
            "index": 330, 
            "rating": "4", 
            "review": "Nice. Great ferry with free WIFI!! Be sure to buy one-way tickets to Cozumel so you can choose departures that leave every hour. If you buy a roundtrip ticket the options are only available in two-hour increments."
        }, 
        {
            "index": 331, 
            "rating": "3", 
            "review": "be ready to wait. nice ride and prices are fair but many show up at last minute to squeeze on, and it's irritating! If you want to ride up top for view Be ready for people to go in & out a billion times and bump into to you and sit on you. It's a zoo up top!"
        }, 
        {
            "index": 332, 
            "rating": "5", 
            "review": "Fast and smooth!. This is a great way to visit Cozumel if you are staying in Playa Del Carmen---warning! They keep the a/c cranked up inside the ferry so take a tee=shirt or light jacket for the ride."
        }, 
        {
            "index": 333, 
            "rating": "3", 
            "review": "About as expected. Liked: it will get you from point A to point B\nDisliked: the operators and ticket sellers are shady and questionable"
        }, 
        {
            "index": 334, 
            "rating": "4", 
            "review": "Cozumel Ferry Ride. Flying into Cozumel and taking the ferry to Playa de Carmen can be great fun, but watch out for your return times especially if you are trying to catch a flight. The lines can be very long and the schedules may or may not work. But overall the rides are comfortable and fun!"
        }, 
        {
            "index": 335, 
            "rating": "3", 
            "review": "Good.... On the way to Cozumel the trip was good, but on the way back they over booked the boat and there were people that couldnt get a seat... not fun, took forever to get out of the boat"
        }, 
        {
            "index": 336, 
            "rating": "4", 
            "review": "Ferry to cozumel. We took a taxi from our resort to playa beach and got on a ferry that took us to cozumel.about $24.00 roundtrip. from there we took a taxi to a wonderful beach that was good for snorkeling.We brought our own goggles and snorkel.Just ask your taxi driver and they can recommend a good beach.Ours wasn t to far!The ferry took about 50 min.each way and you can buy water,beer,or softdrinks.We sat on the top outside so we wouldn t get sea sick."
        }, 
        {
            "index": 337, 
            "rating": "4", 
            "review": "efficient. Provided the service we needed. Buy the tickets from the blue, plywood building. Beware of the 100s of vendors trying to charge you more for the tickets."
        }, 
        {
            "index": 338, 
            "rating": "5", 
            "review": "Nice ride to Cozumel. The ferry was a very relaxing way to get to Cozumel. The trip takes a little over an hour and you really enjoy the breeze and sea scenery. There was a live band playing which made our ride more enjoyable."
        }, 
        {
            "index": 339, 
            "rating": "5", 
            "review": "Good price. Clean and nice. not a bad price. They even had a band playing on the top level for entertainment for the 30 min ride! Free WIFI was available on the boat as well!"
        }, 
        {
            "index": 340, 
            "rating": "4", 
            "review": "Excellent. Had a live band on the crossing they were great crew was very helpful."
        }, 
        {
            "index": 341, 
            "rating": "4", 
            "review": "Great ride, but pricey. I love to take the ferry, you have to take it you have any thing to do on the mainland but it sure cost a lot. But what you gonna do, u have to pay to get there, or go to cozumel. It's a great ride but the should be kinder to the picket books of the tourist, that want to see there country. My advice, if you take any tours get them to pay for your tickets."
        }, 
        {
            "index": 342, 
            "rating": "4", 
            "review": "Comfortalbe Modern boats. I take the ferry boats on a regular baseis from Cozumel and this is my favorite line. Ultramar boats are more modern and comfortable."
        }, 
        {
            "index": 343, 
            "rating": "5", 
            "review": "Super easy trip to Cozumel.. The ferry and its operators are first-class. I'm not sure there's much of an advantage to going to Cozumel if you're already staying in Playa, but the ferry ride is fun."
        }, 
        {
            "index": 344, 
            "rating": "5", 
            "review": "Best Way To Isla Mujeres!. I traveled to Isla Mujeres many times with Ultra Mar Ferry. Very reliable, comfortable and inexpensive way to spend some time on the island for sunbathing, clean beach, quiet times, great restaurant, beware - shopping is expensive but overall good place to take a break from crazy Cancun."
        }, 
        {
            "index": 345, 
            "rating": "4", 
            "review": "Get there EARY and sitin the back!. Ferry to Cozamel. Nice trip, and they treat you well. You can get a beer during the trip, and it is $ 2 per. The wind in your hair, and the sun on your face feels great. 2 boats per trip, so if you miss one, you will catch the next. We rented our jeep to see the island on the ferry, and it was $ 60 for the day. Least expensive anywhere on the island. FUN!!!"
        }, 
        {
            "index": 346, 
            "rating": "5", 
            "review": "Comfortable Ferry Trip. We been taking the ferry for several years between Playa Del Carmen and Cozumel. Each year, they make improvements. The port in Cozumel is clean, they check your luggage and the ferries all seem to be well-maintained."
        }, 
        {
            "index": 347, 
            "rating": "5", 
            "review": "Pleasant ride!. I've taken this ferry numerous times over the years between Playa and Cozumel. I think this trip was the best one so far! The sun was shining, water was smooth, the band entertained us while we sipped a cold beer and it took exactly 35 minutes to cross. Excellent trip!"
        }, 
        {
            "index": 348, 
            "rating": "2", 
            "review": "Expensive. We used the ferry for a day trip to cozumel and found the prices to be very expensive. We told the ticket girl we wanted round trip tickets and was charged roughly 40USD for them only to be told upon arrival at gatekeeper that they were one way tickets even though they had two separate stubs on the ticket. We noticed a woman next to us who had a different color ticket with a different price on it, so I dont know if we got screwed or not, but for the price it sure feels like it. Also the live band is very loud, and then they want tips. Try to sit on a lower level to avoid this!"
        }, 
        {
            "index": 349, 
            "rating": "3", 
            "review": "Made it to Cozumel. . .but were soaking wet!. The ferry is efficient, clean and perfectly fine. BUT. . .unless you want to get wet, do not sit outside near the perimeter! We were \"splashed\" by two waves that went went right over our heads. The first wave slapped my friends face so hard that her glasses fell off. We were surprised (an understatement). If we had only picked different seats closer to the middle (away from the railing)! Otherwise, the ferry is fairly organized, cost effective, easy and comfortable."
        }, 
        {
            "index": 350, 
            "rating": "5", 
            "review": "Very fast. This ferry is ultra fast is actually a catamaran, we took it from Playa Tortuga to Isla Mujaher for a day trip. You can sit inside in air condition or upstairs in open air. cost was $17 round trip. Very good service."
        }, 
        {
            "index": 351, 
            "rating": "5", 
            "review": "Fun. We had a great trip over to Cozumel and loved sitting outside"
        }, 
        {
            "index": 352, 
            "rating": "5", 
            "review": "Relaxing. Relaxing trip. Ferry was on time and the view of the Caribbean verses Cozumel or Playa Carmen was exquisite. No discount for purchasing a round trip ticket."
        }, 
        {
            "index": 353, 
            "rating": "5", 
            "review": "Ferry to Cozumel. Excellent - fare price - worth taking the trip (Cozumel is beautiful)"
        }, 
        {
            "index": 354, 
            "rating": "5", 
            "review": "Nice way to travel.. We went over to Cozumel via ferry \"just for something to do\". Seemed a little expensive, but on vacation, .......who cares."
        }, 
        {
            "index": 355, 
            "rating": "5", 
            "review": "excellent service.. excellent service, very smooth and always on time."
        }, 
        {
            "index": 356, 
            "rating": "5", 
            "review": "Quick cheap way to and from the Mainland. We took this ferry multiple times on our trips to Cozumel to get to Playa Del Carmen and back for various attractions. The price is really good, it's a smooth quiet trip on a very clean boat with snacks and drinks available for purchase. You can purchase your tickets right at the port in a kiosk for the same price that you would buy them anywhere else. If you have an internet connection you can check the times of departure for ferry trips. It's almost an attraction itself rather than just a mode of transportation. Nice ride."
        }, 
        {
            "index": 357, 
            "rating": "5", 
            "review": "Ferry from Cozumel to Playa. The transfer from Cozumel to Playa was only about 35 minutes and they had a band play for us. It was great and made the time go by really fast. You have to get there early to get a seat on the top floor which is where the band plays."
        }, 
        {
            "index": 358, 
            "rating": "4", 
            "review": "They do the job....... We went to Cozumel and took the 8 am. service. Nice boat where you can sit outside or inside. Easy transfer. And they were on time.....!"
        }, 
        {
            "index": 359, 
            "rating": "5", 
            "review": "Lots and fun. Always on time, comfortable and the newer faster ferries have a band that plays. They are excellent, I even purchased their CD. You can rent a vehicle while on the ferry to drive around Cozumel. Very reputable. Just remember to take your license."
        }, 
        {
            "index": 360, 
            "rating": "4", 
            "review": "Very professional. Took the UltraMar ferry over to Cozumel. The swells were pretty significant that day so it was a rocky ride. A few people lost their lunch. But it was clear this ferry company is very professional and focused on passenger comfort. They even had a small band playing music for the return ride. I believe they have a big catamaran that is probably smoother than our mono-hull was."
        }, 
        {
            "index": 361, 
            "rating": "5", 
            "review": "quick and efficient. took to conzumel from playa del carmen. bought a one way ticket so I could take whatever ferry back (As there are two companies and the trade off ever hour so coming back if you want to return at a specific time and bought a roundtrip you might have to wait an extra hour."
        }, 
        {
            "index": 362, 
            "rating": "3", 
            "review": "Cozumel service. Couldn't be in Playa del Carmen without a quick ferry ride over to Cozumel which is Mexico's largest island. Just went over to have lunch and came back. Price was ok and it was only about 1/2 hour each way."
        }, 
        {
            "index": 363, 
            "rating": "5", 
            "review": "great service. Liked the trip.excellent service and live music on board - even bought their CD :)"
        }, 
        {
            "index": 364, 
            "rating": "4", 
            "review": "Getting to Cozumel from Cancun. The 40 minute ride was comfortable even with 6 foot waves! The crew was courteous and did not bother you with a bunch of 'buy it now' nonsense. The band was very good and did a variety of songs that passed the time more quickly. Once in port, the disembarkation was easy and smooth to get to our final destination. Definately the best way to get to the island other than by plane."
        }, 
        {
            "index": 365, 
            "rating": "5", 
            "review": "Cozumel ferry. Took Ultra Mar to Coz. Good ride with loud entertainment in Spanish. Took about 45 minutes. Very professional baggage handling The other ferry service was more blue collar. Throwing the bags up and over the railing. It was also mh faster, getting us to Playa in a half hour. No entertainment, which, in my opinion was a good thing."
        }, 
        {
            "index": 366, 
            "rating": "5", 
            "review": "great day trip. very convenient,air conditioned,reasonable,only about 10 minutes away from the resort ,cab ride is $7"
        }, 
        {
            "index": 367, 
            "rating": "4", 
            "review": "Dependable ferry. The ferrys between Cozumel and Playa del Carmen is fast and dependable, but be careful to buy only a one way ticket unless you are positive about your return time. The companies do NOT honor each others tickets."
        }, 
        {
            "index": 368, 
            "rating": "4", 
            "review": "Tickets.... Good service, but try and book it one way as there are 2 lines and don't have the same departure time. Cost is the same."
        }, 
        {
            "index": 369, 
            "rating": "5", 
            "review": "Goin to Isla Mujeres. Take this tip- when you are in downtown Cancun, look for the bus Red # 1 that takes you to Hotel Zone and will take to Puerto Juarez - it's cheaper if you depart from there, pay in pesos that is better. It's almost half hour ride and its a beautiful view, The beach is enormous and very clean, you can eat fresh fish and have some tequilas or margaritas at the town. Very friendly people. You r gonna love it, so dont miss it if you go to Cancun or Playa del Carmen"
        }, 
        {
            "index": 370, 
            "rating": "5", 
            "review": "45 min and your in COZUMEL!. about $10 for youyr 45 min ride across the open waters of the Carribean! Youll hardly feel like Johnny Depp aka Captain Jack, but you will get to see Cozumel and see Playa Del Carmen from a whole new perspective. The bost is fun and usually there is a guitarist on board playing music."
        }, 
        {
            "index": 371, 
            "rating": "4", 
            "review": "reliable route to cozumel. inexpensive-runs on schedule-easily accessible-terminals at each end are easy to find-lots of seating on board-able to purchase cold drinks"
        }, 
        {
            "index": 372, 
            "rating": "4", 
            "review": "Luxurious crossing in the first level!. Gave it very good rating because of the unexpected comfort found in the bottom level with AC and super comfortable seats. However the price is too high I think at $13US. The other disappointment is that I was offered to buy a two way ticket and presented a time table that did not fit my needs but not told that another ferry company offered the crossing as well. I bought the two way ticket only to find out later that another ferry company with a timetable that better fits my needs was available. I ended up wasting the money spent on the return leg by buying a one way with the other ferry company becasue I needed to be back in Playa del Carmen at a certain time."
        }, 
        {
            "index": 373, 
            "rating": "4", 
            "review": "Nice ferry ride. This was a good ferry ride but as usual the photos were a total rip off. I'd use their service again. It was convenient, well priced and the staff was friendly."
        }, 
        {
            "index": 374, 
            "rating": "5", 
            "review": "Great value and entertainment!. the ride over to Cozumel was very affordable and enjoyable... we especially loved the band that played on our way to and from the island - they were great!"
        }, 
        {
            "index": 375, 
            "rating": "3", 
            "review": "35 minutes ride. Sit on the back of the ship, so you won't get dizzy"
        }, 
        {
            "index": 376, 
            "rating": "3", 
            "review": "1/2 hour trip. Very rough ride over to Cozumel...they did have a band playing which was great."
        }, 
        {
            "index": 377, 
            "rating": "2", 
            "review": "Confusing and Not accommodating. There are two ferry company's that make the commute between Playa Del Carmen and Cozumel. My first advise is do not purchase a round trp ticket. And if you don't purchase round trip you are forced to pay cash. AND if you pay in USD, you pay more.The ride itself is very pleasant, even had a local band entertain us one morning on the 8:00 run. Watching the cruise ships coming in to Cozumel was something new to us as we do not visit the populated destinations as a rule.One thing, there are some very rude tourists who feel they own an entire row of seating.Upon our arrival at Playa, I did hear of some wallets and purses had gone missing. Not sure why they are not keeping an eye on their belongings.The times fluctuate every day. The ferry that left at 7 one morning will leave at 8 the next day. This is simply my recommendation to be weary when using this transportation. It is reliable and safe, just not consistent as a public transportation user from the US.Again, nice ride. Just want to let you all know of the schedule and fares that can be confusing.."
        }, 
        {
            "index": 378, 
            "rating": "5", 
            "review": "Ferry to Cozumel. Loved the live music on board! Made us forget all about the rough seas"
        }, 
        {
            "index": 379, 
            "rating": "5", 
            "review": "ferry to cousumel island. it was fast, and nice trip over.comfortable, and great way to get to cousumel island for a day trip"
        }, 
        {
            "index": 380, 
            "rating": "4", 
            "review": "Fast transportation. Visited Cozumel with this ferry in the worst conditions (the port was closed after our return due to the bad weather). Unfortunately I suffer from sea-sickness so this did not make my ride very enjoyable.In better conditions though it is a fast ride on a nice ship and the staff was very attentive for helping out people with difficulties due to the roughness of the sea.Mad props to the band being able to stand up and play all kinds of songs while the rest of us were fighting to just stay seated."
        }, 
        {
            "index": 381, 
            "rating": "5", 
            "review": "A fun trip to Cozumel!. EASY and affordable! We were surprised to find that there was a band that would be entertained the 45 minutes across the ocean to Cozumel! Made the trip go fast, and comfortable too."
        }, 
        {
            "index": 382, 
            "rating": "5", 
            "review": "A Fun Ride. We took the UltraMar Ferry to Cozumel to meet our dive boat. They had a band that played for the entire trip across. It was fun and entertaining and even though the seas were very rough that day, the trip was very enjoyable."
        }, 
        {
            "index": 383, 
            "rating": "4", 
            "review": "Really Wasn't As Bad As I Feared. I was very hesitant about making the trip from Playa Del Carmen to Cozumel on this ferry. Mostly because I had heard horror stories from friends regarding the whole motion sickness issue. I'm happy to say that was not the case..for me anyways.It was obvious from the stains on the seats that not everyone was so lucky! All in all I found the ride quick and the seating very comfortable. It was nice to be able to buy a drink on board should you want one also! My only complaint would be that they could have done a better job cleaning the boat."
        }, 
        {
            "index": 384, 
            "rating": "4", 
            "review": "Ferry ride to Cozomel. To the ferry to Cozemel for a Snorleling tour. The ferry ride was great. They even had a live band playing on the trip over."
        }, 
        {
            "index": 385, 
            "rating": "4", 
            "review": "Rocky ride. Tickets are for sale at the yellow booth behind the terminal. Lots of street vendors will try to sell you tickets. Avoid them."
        }, 
        {
            "index": 386, 
            "rating": "4", 
            "review": "Cozy Cosumel. Nice tour at affordable price. Island is small but quint. Ilsa de Mujeres is a little gem in itself."
        }, 
        {
            "index": 387, 
            "rating": "4", 
            "review": "UltraMar Ferry. Bought our tickets from the Ferry vendor. Had no problems with using our return tickets at whatever time we chose. Cost was $13.00 USA per person, per trip, so a total of $26.00 per person.It is quite crowded in the morning (we went at 10am) as a lot of business people use the ferry to get to work on Cozumel.Never used the bathrooms or bought anything so can't help out there.Seats are comphy, and the ride was ok. We even had a snooze on the way back.Boarding and exiting was quick. I suggest staying on the lower level, for quick exit.The waves were quite large on the way home but they didn't seem to bother the large ferry. It took about 45 minutes each way.All in all, a pleasant way to get to the island."
        }, 
        {
            "index": 388, 
            "rating": "3", 
            "review": "Ferry to Cozumel. Just wanted to see Cozumel, not to do anything specific but wouldn't go again. Just more of the same shopping as in Playa del Carmen. The ferry was nice but confusing but there are 2 ferry lines on alternating schedules so don't buy a round trip ticket because you may go back on the other ferry."
        }, 
        {
            "index": 389, 
            "rating": "5", 
            "review": "Clean, runs on time.. UltraMar is one of two ferries (the other one being Mexico) that offered service runs between Cozumel and Playa del Carmen. It's clean, air-conditioned, and runs on time. All-in-all, it's a good deal."
        }, 
        {
            "index": 390, 
            "rating": "4", 
            "review": "Saw Jose Canesco going to Cozymel. They called up a 2nd boat when the first one was full. Nice job!"
        }, 
        {
            "index": 391, 
            "rating": "1", 
            "review": "Terrifying and operators don't care and lie about conditions. It was a windy day but it wasn't storming. None of the operators warned anyone the ride ahead of us from Cozumel to Playa del Carmen would be very, very rough. Ten-foot high waves covered the boat at one point. Passing out little blue barf bags is routine for the ushers. The boat bobs and pitches and rises and falls into the sea from about five minutes into the ride until the last ten minutes. Elderly people should avoid the ferry entirely. Once in Playa del Carmen, an ambulance was called to take care of one woman who went into shock. A teenager fell off of her seat on the top deck. The operators say the ride can sometimes be more rough. They laugh about it. They treat anyone who is unhappy with disdain."
        }, 
        {
            "index": 392, 
            "rating": "5", 
            "review": "Quick (AND entertaining). We travelled to Isla de Mujeres (which we VERY much recommend) as well as Cozumel. The ferry was fast and the enterainment on board a nice addtion"
        }, 
        {
            "index": 393, 
            "rating": "5", 
            "review": "Ferry to Cozumel. The ferry from Playa del Carmen to Cozuel runs often and if very fast and comfortable. It is an easy walk to the terminal from almost anywhere and purchasing the tickets there is fast. Great day trip."
        }, 
        {
            "index": 394, 
            "rating": "4", 
            "review": "tourist kiosk inside ferry terminal. We thought booking here would be smart! not the case...do not rent a scooter for cozumel from \" scooters & cars \" right in front of ferry terminal, no signal lights, no horn, no speedometer and seat did not latch...Mexico Tourism should address complaints if they want to improve thier Reputation, yours sincerly< JOHNNYCANOE> Manitoulin Island, Ontario, Canada...Gracious"
        }, 
        {
            "index": 395, 
            "rating": "2", 
            "review": "Rough ride!. The water was rough and I think that had a lot to do with my queasiness on the ride. The trip took 45 minutes instead of the published 30. I couldn't wait to get off. I think it's the type of boat they use."
        }, 
        {
            "index": 396, 
            "rating": "3", 
            "review": "Very rough. I know its just the water but the ride is rough and be warned before you go to Cozumel if you have a weak stomack."
        }, 
        {
            "index": 397, 
            "rating": "5", 
            "review": "Fast, easy to book. Spotlessly clean, seats for all passengers with refreshments. Simliar inside to a Hovercraft with aircraft style sating"
        }, 
        {
            "index": 398, 
            "rating": "3", 
            "review": "Comfortable ride...ticket sales staff could use improvement. Have used this ferry a few times going back and forth from Playa Del Carmen to Cozumel. My BIGGEST complaint is the ticket counter. Two out of the three times I purchased tickets the cashier tried to rip me off, either by overcharging when the fee was clearly printed on the board behind her head, or by short changing. On one of the trips they sold more tickets than there were seats forcing people to sit on the floor of the outer upper deck. The good points...Free wifi. Someone is always around the ticket counter with a brochure to show you your ferry schedule so you are aware of the return times. If you can get a seat there's nice comfortable seats inside with a/c, t.v's, and sometimes entertainment. They have someone come around to sell drinks. Bench seats located outside. Didn't use the washrooms."
        }, 
        {
            "index": 399, 
            "rating": "5", 
            "review": "The Way to Ferry!. It only takes about 45 minutes to ferry back and forth from Playa del Carmen to Cozumel - and granted there are only a few mass transit possibilities for doing so, but the UltraMar ferry makes the journey a comfortable one, whether you are seated below in the air conditioned, soft-seats or above in the outside on the benches. And the price for a round-trip ticket ($312 pesos) is pretty reasonable."
        }, 
        {
            "index": 400, 
            "rating": "4", 
            "review": "Bring pesos. The were orderly and a nice saafe ride to Cozumel and back. They only take cash and if you give them $20us I only got 64 pesos in change on the way there and only 56 pesos in change comeing back.That is approximately $15us each way. If you pay in pesos it is 156 which is about $12us each way.There are two companies that offer ferry service and it you get no discount for buying round trip and might have to wait awhile for your companies next boat. I traveled Ultramar both ways. wifi is really weak on the ferry, but it was better than I got anywhere else."
        }, 
        {
            "index": 401, 
            "rating": "5", 
            "review": "Ferry to Cozumel. Go to Las Palmeres for drinks and get over to Los Cincos Soles to shop"
        }, 
        {
            "index": 402, 
            "rating": "3", 
            "review": "Cozumel ferries.. It's just a ferry so nothing more to say. The ferries don't appear to bother about sticking to the timetable and just leave when they feel like it!"
        }, 
        {
            "index": 403, 
            "rating": "4", 
            "review": "i think is the ferry to cozumel. Just takes a little time to get there, but very cheap."
        }, 
        {
            "index": 404, 
            "rating": "4", 
            "review": "Efficient. Nothing to complain about. We have used Ultramar several times to get to Cozumel and Isla Mujeres and they are on time, friendly and good value for your money. There is usually someone entertaining on the top deck for tips but they were not pushy at all."
        }, 
        {
            "index": 405, 
            "rating": "5", 
            "review": "Very Rough ride. A few years ago we took the ferry from Cozumel to the mainland & a storm was coming in so water was very very rough, They handed you a barf bag as you got on the ferry, Im sure it is not always that way"
        }, 
        {
            "index": 406, 
            "rating": "3", 
            "review": "Ferry to Cozumel. It's expensive - $17 USD each way each person, and only 1/2 ride. Of course, there's mayhem. The ships are o.k. When we came back in the late afternoon, there was a band playing, which was nice. the crew are madly trying to sell you beer/drinks/snacks the whole time."
        }, 
        {
            "index": 407, 
            "rating": "5", 
            "review": "Cozumel here we come.. Lucky enough to have a ferry ride with some awesome musicians to entertain us on the way. =)"
        }, 
        {
            "index": 408, 
            "rating": "5", 
            "review": "Passenger ferry to Cozumel. Good service, but the ticket prices have gotten our of most peoples price range"
        }, 
        {
            "index": 409, 
            "rating": "3", 
            "review": "Take your dramamine , and bing your nose plugs. I rode this boat about 15 years ago, and again in Feb 2012 and it was the same, very rough and rolly . I do not get sea sick, but for those who do be warned this big boat rocks and rolls. Some A#*hole decided to throw up in the garbage can rather than over the railing which caused a chain reaction. So if you get sea sick take your meds !!! A seat in the way back of the upper deck may get you wet, but a few rows in will give you fresh air while keeping you dry."
        }, 
        {
            "index": 410, 
            "rating": "4", 
            "review": "Fast way to get to mainland. This ferry runs all day like 8 am to 10 pm from Cozumel to Playa Del CarmenCosts about 25 usd per way per adult, takes about 35 to 45 mins. Ferry features outer deck and an air conditioned inside with full bar. The trip I took featured a local band playing for us, doing mainly covers, but they were good."
        }, 
        {
            "index": 411, 
            "rating": "4", 
            "review": "Ferry Trip. great trip across, coming back the ferry was to leave at 4...but late by 1/2 hour for no reason that we were told. Just keep in mind if you need to be back across at a certain time"
        }, 
        {
            "index": 412, 
            "rating": "5", 
            "review": "excellent value, very safe. This is a great way to get from Playa Del Carmen to Cozumel. There are two ferry companies and one runs almost every hour from early morning to late night. The schedule is online. In Feb 2012 the cost was $13 USD one way per person. There is no need to buy a return ticket. Just buy it on your return. They are very safe, clean and comfortable. I would say they are better than the ferry system in Washington state or British Columbia. To top it off, on our return trip, a Mexican band played music all the way back. They did it all for tips."
        }, 
        {
            "index": 413, 
            "rating": "4", 
            "review": "Got to Cozumel quick and easy. decent price, left when they said they would. Tip: buy one way tickets. If you buy a round trip you are tied to a certain return time. o/w gives you the option of taking either ferry service back at a time that works for you."
        }, 
        {
            "index": 414, 
            "rating": "5", 
            "review": "Cozumel ferry. A Comfortable and fast way to get to Cozumel from Playa Carmen"
        }, 
        {
            "index": 415, 
            "rating": "5", 
            "review": "Fast, Clean, On Time, No hassles. Exploria organized our Cozumel tour. They selected UltraMar as the ferry. Fast efficient boarding on the 10 AM ferry. took 35 minutes. No musicians on trip to Cozumel. windy but bright blue sunny skies and warm wind so enjoyed our seats outside. Several children with motion sickness. Take dimenhydrinate 30 minutesbefore departure if you need it. Trip back was smooth. great musicians with Spanish guitars. Memorable and hassle-free."
        }, 
        {
            "index": 416, 
            "rating": "3", 
            "review": "Nice clean ferry- but beware of a scam in operation. The bus drivers will drop unsuspecting tourists off at an UltraMar Ferry sales booth up the road from the real ferry location. The sales people at the booth will charge $3 more per person and seat you in a \"waiting area\". Then they will tell you that the tide is too low to land the ferry there. They will then put you on the bus again and take you to the \"real\" ferry location where you could have bought your tickets cheaper and not gone through this scam and wasted about 45 minutes of your time. This has to be garnering thousands of extra dollars for UltraMar each year. They should be ashamed and this should be stopped immediately by the tourist authorities. The bus drivers have to be in on this too. Beware!"
        }, 
        {
            "index": 417, 
            "rating": "4", 
            "review": "The Blue and Yellow Ferry Was a Blast!!!. I was expecting rickety old boats and to be horribly ill by the time we reached Cozumel from Playa del Carmen from all the reviews I read and stories I heard. I must say I almost think they truly did not ride the ferry. We rode the blue and yellow boats which appeared to be in VERY good condition and though not new, close to it. They were clean and well maintained with three levels. The lower level was enclosed, the middle had half walls with rails across the top and open air and then the very top was very open and windy. Per recommendation, we arrived about a half hour early which gave us our choice of seating. Being late, did not leave you with many options and the top was the last to fill but this is where many of the late comers had to go while other couples and families had to split up and sit separately in seats not filled. We had roundtrip tickets but there is no savings no matter which way you do it. In each direction, we had a great band which I believe was called Laquina, who played the entire trip for us while ushers walked around offering beverages for purchase. The trip to Cozumel took 5 songs or about a half hour while the return trip only took 4 songs and seemed a lot shorter but I am sure it was not. I would have loved to ride the ferry just to hear the band continue to play and they sold CD’s which we now wish we would have purchased. The water was a bit rough this day so on the trip to Cozumel, we had taken Dramamine though we were not known to get sick. The ferry was big enough to where the motion was not overly noticeable to me – there was a band standing up playing with no problems. On the way back, I did not take Dramamine and had no problems at all. The band plays on the middle level of the boat and kept us very entertained which may have helped though too. No complaints at all about the ferry ride from us."
        }, 
        {
            "index": 418, 
            "rating": "3", 
            "review": "Too crowded. They allowed way more people than there were seats and it is Difficult to stand. Too cramped, but it got us to Cozumel!"
        }, 
        {
            "index": 419, 
            "rating": "5", 
            "review": "take your dramamine. I wasnt sick, however, many many people around me were. If you are not allergic to dramamine, take it!!! It's not worth the upset stomach because all you get is a bag, not a bathroom. Its a 30-45 minute ride. Plan accordingly"
        }, 
        {
            "index": 420, 
            "rating": "5", 
            "review": "Awesome. Take this Ferry across to Playa.. This ferry was great. You can sit outside or inside. They have comfy seats with air-conditioning, free wifi, a tv that plays shows, food, coffee and the boat doesn't rock as much as the other ferries. They even hand out barf bags if you need it. Great price and they get you to Cozumel from Playa in 35 mins."
        }, 
        {
            "index": 421, 
            "rating": "3", 
            "review": "rough ride. This ferry took us to Cozamel for the day. A bit of a rough ride."
        }, 
        {
            "index": 422, 
            "rating": "5", 
            "review": "Great atmosphere!. Note: I hate being on a boat when it's windy and the water is choppy.When I was traveling from Playa del Carmen to Cozumel that is exactly what happened. They did a very nice thing on my travel, not sure if they do it for all of their ferries but there was a small band that played music the entire time and got everyone on the deck to calm down (if they were like me) and sing along. I did enjoy my time on the boat with that additive."
        }, 
        {
            "index": 423, 
            "rating": "4", 
            "review": "Left on time, crew was very helpful. Location to catch the ferry is very central to all of Playas hotels/condos. Crew took good care of the bags that needed checking. (extra suitcases etc)"
        }, 
        {
            "index": 424, 
            "rating": "5", 
            "review": "Go out there!. the ferry starts at 8h30 am to 10 pm every 2 hours ..go out to cozumel for a day good diving sights ! its around 24 us dollars round trip so good price for good fun (only 12min walk by the beach from the reef hotel)"
        }, 
        {
            "index": 425, 
            "rating": "1", 
            "review": "Sea Sick!. Lovely ferry, comfortable and clean, but terrible crossing if you have a tendency for sea sickness."
        }, 
        {
            "index": 426, 
            "rating": "4", 
            "review": "easy. comfortable seats, easy and affordable. Seas were rough but not their fault."
        }, 
        {
            "index": 427, 
            "rating": "4", 
            "review": "Excellent. They run every hour back and forth from Cozumel to Playa"
        }, 
        {
            "index": 428, 
            "rating": "4", 
            "review": "Very efficient. There are two ferry companies going to and from playa del carmen and to cozumel. Ultramar Ferry is one of them. Prices are reasonable but buy a one way ticket because the two companies alternate their route times and you can take either to come back and you dont save any money for buying a round tip. They are clean and large enough to provide service for pretty much everyone. There is seating inside and outside and they sell drinks and snacks aboard but the ride there is very short"
        }, 
        {
            "index": 429, 
            "rating": "4", 
            "review": "top day trip tip. First up its a modern ferry however as another review stated somtimes with live music, we had a 4 piece band doing a selection of latin classics - the brasilians loved it!If you are going for a day trip DO NOT BUY A RETURN TICKET get two singles.Its the same price but it gives you more flexability.There are two companies that run the rout each sail on alternative hoursif you decide you want to go back at 3 then just buy the single ticket from the company that sails at 3."
        }, 
        {
            "index": 430, 
            "rating": "4", 
            "review": "Efficient and on-time. Everything you'd want from a ferry service from the Yucatan Mainland to the off-shore islands. These ferries are clean, reliable and good value for money. Sometimes they even have Mexican entertainment on board!"
        }, 
        {
            "index": 431, 
            "rating": "5", 
            "review": "Great ferry service. Went from Cozumel to Playa on the larger of the ferries they had. Very easy walked up to window on the pier put down visa/master card and for $12.50 each we were on our way. They do briefly \"look\" at your carry on and put our big backpacks on board separate like a plane. Have a snack bar on board, we took our own water. On the way back you have to buy tickets about 100 yards up the street from the pier on the north side in a little building. We came back on the 10:00pm. While we were waiting you could listen to the live music from Senior Frogs which is next to the pier. On the way back they used the \"open\" ferry so you could either site inside or out in the air. Beautiful moon lit night."
        }, 
        {
            "index": 432, 
            "rating": "4", 
            "review": "Very modern and clean. It was on time, modern & Göran. Felt like a vety good alternative."
        }, 
        {
            "index": 433, 
            "rating": "4", 
            "review": "Good ride... Buy the one way ticket to Cozumel, we bought roundtrip at were not coming back till the 5pm ferry but we were ready to come back at 4pm.. so if you buy one way you can buy a ticket back with another company that is a few dollars cheaper.."
        }, 
        {
            "index": 434, 
            "rating": "5", 
            "review": "Great Value. This is a fast comfortable way to go between Playa Del Carmen and Cozumel.Try em you like it."
        }, 
        {
            "index": 435, 
            "rating": "5", 
            "review": "Efficient Transport to Islands. We used the fwrry to both Couzmel and Isla de Majores. The ferry to Isla had free wi-fi, which was a bonus to do a quick download of mail. Also, at their port facility in Cancun, there was aple, safe good parking at a very reasonable price."
        }, 
        {
            "index": 436, 
            "rating": "1", 
            "review": "Brace yourself. We took the UltraMar from Playa del Carmen to Cozumel at 10am. We were at the end of a very long line of people so we got terrible seats. My reccommendation would be to NOT take this boat, however if you are going to do it, wait and be the first people on the boat so you can get a seat on the top deck with air. We were on the top deck by it was enclosed and we were facing a wall. Even at 10am it was terribly hot and there was no air circulation where we were. The boat ride was VERY ROUGH. I am typically rock solid on boats, but this one made me somewhat quesy because it is such a long ride. We learned our lesson for the ride back and got a seat on the top that was open and even though it was still quite rough, it was much more tolerable."
        }, 
        {
            "index": 437, 
            "rating": "5", 
            "review": "The most comfortable way to Cancun from Playa. Only leaves on the hour, so timing is important. Be on time as they leave promptly."
        }, 
        {
            "index": 438, 
            "rating": "5", 
            "review": "The Best. The best ferry to Cozumel, faster, cleaner and better than the other company."
        }, 
        {
            "index": 439, 
            "rating": "5", 
            "review": "Smooth Sailing. We've traveled to Cozumel almost every year that we go to Playa Del Carmen. We always use UltraMar. The ships are very clean. Decent bathrooms aboard. A beverage and snack bar as well. They view movies or videos to keep you entertained during your crossing. They have a decent amount of times to choose to travel to Cozumel and also to return to Playa."
        }, 
        {
            "index": 440, 
            "rating": "3", 
            "review": "enroute to Cozumel. the trip across was fine, however the day visit to Cozumel was a waste of time, nothing of interest, even the natural enviroment was not worth seeing or experiencing. and the food - not edible."
        }, 
        {
            "index": 441, 
            "rating": "3", 
            "review": "Don't buy round trip tickets!. Two ferry companies operate on this route leaving on alternatiing schedules. They will automatically try to charge you for a round trip. There is no discount for purchasing a round trip, it simply restricts when you can return. If you by a one way ticket, you can return when you want. Aside from this, the service is fine. There isn't much in Cozumel unless you are planning on snorkleing."
        }, 
        {
            "index": 442, 
            "rating": "5", 
            "review": "DO NOT GET A TOUR- Take the Ferry. UltraMar Ferry is quick, affordable, and very convenient. They have wi-fi on their ships, so you can even research activities on your way there. I always take the ferry to Cozumel and then just take a taxi to spots where there is coral reef (easily findable online). In total, I end up paying about $300 pesos (20 something dollars) for my round trip and I get to spend as much time as I want on the island, as opposed to $50+ dollars for a \"tour\" where they take you to spots in the ocean crowded with other snorkelers, and leave you there for about 20 minutes (even though they claim it will be 40). You get to choose your own time, your own food, your schedule, everything. Definitely the way to go."
        }, 
        {
            "index": 443, 
            "rating": "4", 
            "review": "Great except for the band on the upper deck. We took the UltraMar ferry from Playa Del Carmen to Cozumel. The cost for a ticket is 26 USD round trip per person, hang on to your ticket for the trip back and make sure that you check the schedule. Do not make the same mistake that we made of sitting on the upper deck because they have a band that plays really loud music and that with the movement of the boat is more than enough to make you sick and give you a headache. As usual, the band asks you for tips or to buy their CD during the boat ride - we were hoping that we wouldn't be subjected to this on the way back but no such luck. The best part of the ferry is how quick it gets you from point A to point B, it is on time and it looks very sea-worthy."
        }, 
        {
            "index": 444, 
            "rating": "4", 
            "review": "You may be seasick!. We took the ferry to Cozumel on a very choppy day, and nicknamed the boat the Ultra Barf! Almost every other passenger was sick, and the ferry staff had a heck of time handing out barf bags in sufficient quantities. What a job! Having said that, they were very accomodating. They made the rounds constantly during the 30 minute trip, even fanning and rubbing the backs of the poor souls who continued to feel ill for the whole trip. For about $15 CDN, you get a live band and can purchase cold drinks and snacks if you can keep them down!"
        }, 
        {
            "index": 445, 
            "rating": "5", 
            "review": "Speedy and comfortable. Easy trip. No discount for round trip so go one-way as others suggest."
        }, 
        {
            "index": 446, 
            "rating": "4", 
            "review": "Good expeience. Always enjoy the quick trip to Cozumel on ultrMar ferry. There is bar service on board and sometimes entertainment. During peak seasons it can get busy and there can be long lineups so plan ahead overall good experience"
        }, 
        {
            "index": 447, 
            "rating": "3", 
            "review": "Get the sick bucket .... I was so looking forward to this trip to Cozumel but as soon as we set off I began throwing up & I'm hardly ever sick. In fact I'm 50 years of age & have only ever thrown up half a dozen times in my entire life. God this was so rough! I'm not sure if it was the time of year or what. Maybe it's calmer in the summer? The girls were great as they rushed up & down with sick bags & tissue, & stuff to sniff, although I almost popped it in my mouth as my husband said it was a mint! Well done girls you do a fantastic job! I sat at the front bottom deck going & the waves were thrashing hight above my window. On the return journey I sat in the middle (inside) at the top & was almost sick but took deep breaths & managed not to be. It's such a shame as I love a ferry trip. The music that was outside was good but ever so loud."
        }, 
        {
            "index": 448, 
            "rating": "4", 
            "review": "Nice boat servicing islands in the area. I really enjoy the quick trip over to the islands in the area and they have a bar on board too. It's the best way to island hop in the area."
        }, 
        {
            "index": 449, 
            "rating": "1", 
            "review": "Be careful of the waves as you will likely get sick!. My wife and I made a day trip to go to Cozumel and decided to take the Ferry and did regret it. For those of you who have a weak stomach, you have been forewarned...you will likely get sick on the Ferry. If I was aware of this, I would have thought twice before going but honestly did not anticipate the amount of rocking of the Ferry due to the high waves (yes, it was like any other regular day here in Playa Del Carmen).It is about a 45 minute ride each way and while it can be a pleasant experience, I do not recommend it for those who can get sea sick quickly. As you enter, they will hand out plastic throw up bags to everyone and on our trip there and return many did throw up except the locals who are likely used to it.Tip: Would not recommend on travelling on Sunday as many places are closed in Cozumel and if you decide to go, sit on the lower level as it tends to rock less than the upper level."
        }, 
        {
            "index": 450, 
            "rating": "4", 
            "review": "trip to the past. We have stayed many times in Cozumel & enjoyed seeing how it has blossomed!"
        }, 
        {
            "index": 451, 
            "rating": "1", 
            "review": "Don't buy round trip tickets!. My mother in law and her husband went to Cozumel on Friday 15th 2011. They decided to buy round trip tickets and had the most awful experience with Ultramar. They saw the schedule online the night before however it was totally different from what they offer at the box offer at the time they came back from Cozumel. They had to come back with another company TO AVOID TO WAIT 2-3 HOURS and had to pay another ticket. We spoke with Miguel (Manager in Playa) who has no customer skills and did not care what happended to us. He has poor skills when dealing with this situations. I guess the moral of the story is Do not buy a round trip tickets because you will be surprise when coming back."
        }, 
        {
            "index": 452, 
            "rating": "4", 
            "review": "Easy way to get to Cozumel. While you will be approached by everyone to buy tickets from them, you should really buy at the ferry, since there are two companies and they come and go at different times. I'd also just buy one way so you're not locked into a return company. That paid off for me b/c I got sick during the day and we were forced to return earlier than we had initially planned.Loading and unloading was fine, but a little slow as there were only two exits doors. You're \"forced\" to watch advertisements on video the entire way, but you can tune them out. There is food and drink on board."
        }, 
        {
            "index": 453, 
            "rating": "3", 
            "review": "quick ride, but traveling with a small dog, you are required to go up top. On the ride back we were all tired, and salty after a day of diving. Yet here was a great band on the level we were at. Enjoyed the ride even more"
        }, 
        {
            "index": 454, 
            "rating": "5", 
            "review": "Cozumel Ferry. Great service over to Cozumel. Very straight forward and easy to book yourselves. Buy single tickets because you may not be able to get back with the same company"
        }, 
        {
            "index": 455, 
            "rating": "3", 
            "review": "no other public transport. is the only way to go to Isla Mujeres from Cancun and from Playa to Cozumel and cancun form zona hotelera you must take a taxi is good goes all day long but en playa the last one is at 5 pm"
        }, 
        {
            "index": 456, 
            "rating": "5", 
            "review": "incredible trip!. sailing thru caribbean blue water has no comparison, just great!"
        }, 
        {
            "index": 457, 
            "rating": "4", 
            "review": "one of two ferrys boats between Playa and Cozumel. Both ferry companies have comfortable clean fun transportation of large ferry boats with inside or topside outside seating"
        }, 
        {
            "index": 458, 
            "rating": "4", 
            "review": "Easy travel. Plenty of seats. Great way to visit Cozumel. They had beverage service and was $28.00 for a RT ticket."
        }, 
        {
            "index": 459, 
            "rating": "4", 
            "review": "took to Cozumel. Its a ferry--what more can i say. Transpoortation from Playa to Cozumel. Ferry was FULL, however quite smooth ride and takes approx 30 min to get there."
        }, 
        {
            "index": 460, 
            "rating": "4", 
            "review": "Ferry with a bar. Fun ride to Conzumel. The ferry was packed but we enjoyed the trip."
        }, 
        {
            "index": 461, 
            "rating": "5", 
            "review": "Fast service to the Island.. We last rode on the ferry from Cozumel to PDC in 1996 and wow have they ever upgraded the ferries since then. I thought the price was reasonable at $14 a person each way. The ride took about 40 minutes and was a mixture of smooth and rough, the company can't control the waves. One woman next to me was turning greener than the color of her dress and could not get off the boat fast enough.We enjoyed the ride and would utilize this company the next time we are in either PDC or Cozumel. Just avoid all the people on the piers on both sides trying to persuade you to go to their restaurant, car rental agency, etc."
        }, 
        {
            "index": 462, 
            "rating": "5", 
            "review": "Smooth operator. Got the ferry over to Cozumel on a very wet and windy day. Dreading it but had lodgings booked. Need not have worried -smooth crossing on a clean and comfortable craft.Ticket purchase easy and ferry Bang on time."
        }, 
        {
            "index": 463, 
            "rating": "5", 
            "review": "Nice trip. It was raining but the trip itself was smoother than others we had."
        }, 
        {
            "index": 464, 
            "rating": "5", 
            "review": "Excellent Service. When we travelled to Cozumel from Playa del Carment the boat was clean, we got a seat and listened to a very good band which were playing during the crossing. Worthwhile doing and much cheaper than trips arranged by holiday reps."
        }, 
        {
            "index": 465, 
            "rating": "3", 
            "review": "Queasy Ride. As we made our way to buy our tickets, we faced a gauntlet of vendors near the ticket booth who were trying to sell us excursion tours. There were so many of them and they were a bit aggressive so that part was really annoying.The ferry itself is clean, air conditioned with comfortable seats, and has free wi-fi. They also sell snacks and drinks including beers and margaritas. There is a clean bathroom on board. The ride was approx 30 minutes. We were dropped off near the shopping area in Cozumel so that was convenient.On our way back, the ride was super rocky. The ferry was swaying side to side almost the whole time. I'm not normally prone to motion sickness, but this was the worst ride of my life. Just two days prior, we took a fishing boat from Cancun to Isla Mujeres that was a smoother ride than this. Anyway, I held on, but my friend got sick.. Luckily, she was near a waste basket. Since the ride made us sick, we were unable to go out in Playa del Carmen. That was too bad because it dropped us off right in front of Senor Frogs and I really wanted to go there."
        }, 
        {
            "index": 466, 
            "rating": "4", 
            "review": "Best way to get from PDC to Cozumel. Price for the ferry was $11 USD per person each way. Was great to sit outside as they had entertainment and food/drinks available to purchase. If you are sitting on the outside looking over the water, be aware of water splashing up into the boat, its kind of refreshing. The inside of the boat is nicely air conditioned as well. Its a short trip but quite enjoyable."
        }, 
        {
            "index": 467, 
            "rating": "5", 
            "review": "Ferri is clean, fast and comfortable. The only way to go by ship to Cozumel there are two companies but both are good and safe.It takes about 45 minutes to cross from Playa del Carmen to Cozumel.If you get seasick you better stay on the lower deck in the middle as far back as possible. It is well ventilated and has a great air conditioner"
        }, 
        {
            "index": 468, 
            "rating": "5", 
            "review": "No nonsense transportation. Trip from Playa to Cozumel is $15 US, the only reason that i wanted to make sure to mention, there are is another ferry, and just make sure that if you are heading to Cozumel to snorkle, you mgith be better off, buying the return ticket at Cozumel, otherwise, you might have to wait around another hour, if you buy a round trip ticket. Time to reach Cozumel or Playa is approx. 25 minutes. They also sell some drinks and beers on board. Ferry drops you off in front of Market in Cozumel. Try to go shopping in Cozumel when the ships are NOT in, otherwise, you will pay premium prices."
        }, 
        {
            "index": 469, 
            "rating": "5", 
            "review": "Nice ferry...very clean.... Nice ferry ride to and from Playa del Carmen. The band that plays is a little loud, but not bad at all. The band is very talented and will play requests. The ride is about 45 minutes, and is very relaxed."
        }, 
        {
            "index": 470, 
            "rating": "1", 
            "review": "Do not take Ultramar ferry! They fool tourists. On February 14th I was boarding the Ultramar ferry. I left my luggage to the Ultramar employees in charged of putting my luggage onboard, they put a band with an identification number and they handed me the ticket with the same number to claim the luggage on the other side. Once in Cozumel, these employees put the luggage on a trolley while passengers were disembarking the boat. I was checking every single luggage put on the moving band from the trolley, anxious to get to my hotel and relax. I noticed there was an employee at the exit of the luggage claim area checking everybody’s claim ticket to make sure no one leaves with a luggage that does not belong to them. My luggage did not appear even after the trolley was emptied. I quickly notified the responsible from Ultramar on site. He communicated with the quay in Playa del Carmen, my luggage was nowhere to be found. I gave them the cell phone number where they could reach me in case they find it.I had to go to the hotel without a thing. I never received a call from them. Two days after, when I could finally get in touch with a higher responsible from Ultramar, I was accused to have orchestrated everything to have my luggage stolen and then claim it! I still have the claiming ticket in y possession but no luggage and still no compensation from Ultramar.I had to go to have a police report because my passport was inside my luggage. There they explained me that often the company’s own employees steal and unfortunately there is no way to prove it. Do not take Ultramar. They fool tourists."
        }, 
        {
            "index": 471, 
            "rating": "3", 
            "review": "Its a ferry. This is not an attraction... its a ferry from playa del carmen to cozumel. The bad was loud, but there werent bad. I had no issues what-so ever with the experience other than it was just a ferry. If you want to get to/from cozumel... its a must. ITs only a 30 min ride, so no matter what happens, its only 30 min."
        }, 
        {
            "index": 472, 
            "rating": "1", 
            "review": "Avoid. I was boarding the ferry in Playa del Carmen it was raining a little the ferry was moving a little there were 4 people standing there no one helped me the gangway was in poor shape I slipped and fell broke my ankle, they asked me to move out of the way so they could continue boarding people, I felt they could have helped more."
        }, 
        {
            "index": 473, 
            "rating": "5", 
            "review": "ferry to isla mujeres ULTRAMAR!!!!. from this place you can cross to isla mujeres, theres two companies, el mexicano and ultramar ferry, DONT TAKE EL MEXICANO!!! their boats are really in a bad shape and it takes forever to get to isla, they are both the same price but ultramar ferry are totally way better, and theres no charge for the parking, by the way ultramar its on the left side, the yellow company not the green onei went the fist time with el mexicano, but everyone wqas puking, cuz its a long ride, the second time i went with ultramar and it was only 20 minutes, was great"
        }, 
        {
            "index": 474, 
            "rating": "2", 
            "review": "Get on the boat early so you can get a seat away from the \"band\". Yes, this is an incredibly inexpensive way to get to and from Cozumel and Playa del Carmen. Just make sure you get on board early enough to get a seat downsairs (or inside on the upper deck). The ferry company provides \"entertainment\" on the upper (outside) deck. It's 3 guys banging on drums and trying to sing for the entire 45 mnute trip. These gentlemen aren't musicians . . . . they are pure auditory pain! You will be miserable after the first 10 minutes of this noise. At the end of the ferry trip, you will be downright ready to jump overboard."
        }
    ]
}