{
    "category": "Playa-del-Carmen", 
    "entity": "Parque-Los-Fundadores", 
    "avg_rating_stars": 4.28755364806867, 
    "review_count": 466, 
    "rating_stats": {
        "poor": 5, 
        "average": 66, 
        "terrible": 3, 
        "very_good": 173, 
        "excellent": 219
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "Absolutely Stunning Sculpture with the Caribbean Sea in the Background. Just outside the ferry terminals and busy street area of Playa Del Carmen is a public park with this gorgeous structure. If you stand back about 50 feet and peer through the opening, you can see the stunning and beautiful Caribbean Sea. Kids were playing, vendors were setting up for the day's ferry rides or local attractions, all in this safe and charming park area."
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "This is a park. Nice park with benches and food stands around, they commonly have \"traditional\" dances here in the evenings with people dressed in Mayan attire. Cant beat the view to the beautiful ocean."
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "Quintessential Playa. This is a must stop, if only for the requisite photo with the arch. It's a nice place to hang out. Couple shows happen daily, including Mayan drummers. Nice playground for kids, plenty of shade and places to sit, and vendors selling fruit and snack. Worth a visit"
        }, 
        {
            "index": 4, 
            "rating": "4", 
            "review": "cute little park. stopped here to rest our feet and we got a great show, the mayans did their spin on the pole,not sure what they call it, and after that there were dancers in the lower part of the park, very nice way to end to our day. there were also the local street vendors on site as well."
        }, 
        {
            "index": 5, 
            "rating": "4", 
            "review": "Fun shopping area. Took a taxi to this area for some shopping. Fun experience. Most of the shops had the same stuff. There were some high end stores. We even saw one of the waiters from our hotel working in his momma's jewelry shop on his time off."
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "Great photo op. The beginning of our walking tour. Multiple street vendors and shops. Sidewalk cafes are abundant and generally clean. We had not visited for 16 years or so and could not believe the growth of this formerly quiet village. We spent a fun few hours shopping and shooting photos."
        }, 
        {
            "index": 7, 
            "rating": "5", 
            "review": "Pretty. This is an excellent park to go sit and watch people come and go during the day and just chill at night. Beautiful views of the ocean and right by the Quinta Avenida."
        }, 
        {
            "index": 8, 
            "rating": "5", 
            "review": "realy nice clean place. allways lots going on you dont get mitherd by street traders close to all the good beach bars and shops"
        }, 
        {
            "index": 9, 
            "rating": "5", 
            "review": "Very Cool!. If you're in Playa, make sure you leave the main strip to head towards the beach to check this out. It's massive and super cool. Plus the beach is amazing."
        }, 
        {
            "index": 10, 
            "rating": "5", 
            "review": "Great Time !!. An unforgettable day awaits you here, do not miss this opportunity at all!! Everything you can think of is here. The beach, food, lots of fun, or perhaps if you are in the mood to just strolling in this area, this would be a good idea to relax and spend the rest of your time here. Time runs out fast, start early your day .Enjoy it! And do not miss the show of the men flying around a high pole, while tied up by their ankles impressive brave men ! Great show!"
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "Enjoyed the men doing a traditional dance!. Was walking by this park and just happened to come upon a fabulous entertainment show of a troupe of Mexican men. They climbed up a pole and put on a fabulous show. Must be seen to be believed. Quite a crowd gathered and they passed around a hat for donations.........It was awesome!"
        }, 
        {
            "index": 12, 
            "rating": "4", 
            "review": "Great area to meetup. Great place to meetup with people. Surrounded by bars, restaurants and shops. Regular entertainment though I didn't see a timetable, so probably missed some stuff."
        }, 
        {
            "index": 13, 
            "rating": "3", 
            "review": "Great Beach. Nice place to visit and get a great view of the beach. Perfect to walk around and take pictures as well as spend the day."
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "Portal Maya Statue in Playa Del Carmen. Visited the Portal Maya Statue while on a bike tour with The Royal resort. Our guide was excellent and explained what all the parts of the statue represent. At night, the local Mayan's perform cultural dances and it is well worth coming back for that! You can have your pictures with them but be sure to tip them well."
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "Free show and access to section of beach. Ran into this location when strolling down quinta avenida shops. Nice statue to take a picture. There is a 10 minute free show from The Danza de los Voladores (Dance of the Flyers) that all ages can enjoy. Not sure on the show times but recommend if you are staying close by."
        }, 
        {
            "index": 16, 
            "rating": "5", 
            "review": "Iconic Archway, cute park with daily entertainment!. This archway is a must stop for Playa del Carmen.. it's beautifully situated right in front of the beach. Great place to stop and take pictures. Plenty of benches and snack vendors make this a nice stop to relax and listen to the waves. There are also different performances by the arch that locals put on relatively often. We saw a really cool one at night with several people dressed in Mayan costumes doing some type of fire dance that fun to watch!"
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "Fun day. We took a bus going here from cancun. It was one of the memorable things we did to explore the city and the culture. Love the shops and restaurant choices and the beach area. The park has a mini day time show that we got to enjoy."
        }, 
        {
            "index": 18, 
            "rating": "4", 
            "review": "Unique Casting. Very cool statue in bronze at the Ferry Dock, and \"Central Park\" in Playa Del Carmen. Culture and style, nothing bad about that! Very fun outdoor markets and streets lined with vendors, buyer beware!! Altogether, fun atmosphere!"
        }, 
        {
            "index": 19, 
            "rating": "4", 
            "review": "Great Photo Spot. Walked up here while having a few drinks at Wah Wahs and walked the performers. Wonderful way to stop and take some pictures and enjoy the culture."
        }, 
        {
            "index": 20, 
            "rating": "4", 
            "review": "Beautiful. Just go and take it all in...the culture, the people, the atmosphere. Take pics and enjoy the beauty"
        }, 
        {
            "index": 21, 
            "rating": "5", 
            "review": "Flyers. Went to watch the flyers off the pole, well worth the 10 minutes it takes many food outlets close by good food an arch way nicely frames the ocean,In the evening we watched a dance show,"
        }, 
        {
            "index": 22, 
            "rating": "4", 
            "review": "Nice vibe!. A nice way to end a walk on the beach, shopping or to begin the trip to Cozumel. Nice to see that the new and the traditional can go together in such a manner."
        }, 
        {
            "index": 23, 
            "rating": "4", 
            "review": "Interesting arch and scenary.. Enjoyed all the characters on the arch, There is a small open chapel and in the evening performers hang off ropes and spin around on a huge poll type structure. Vendors sell snacks such as coconut strips and mango."
        }, 
        {
            "index": 24, 
            "rating": "4", 
            "review": "for tourists but nice. everything is made for entertaining tourist, but Iliked it very much\nMaya show and dance with the carribean ocean behind,\nI like the view and the costums, the music and the dances.\nWhenever there is somethg to see, atmosphair to catch"
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "Shopping. Definitely worth a walk around. There a high end shops and just general souvenir shops. Only spent an hour or two here, wish we had longer"
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "This is amazing. Got to see this beautiful structure and great performance by locals and great atmosphere must see when visiting Playa Del Carmen."
        }, 
        {
            "index": 27, 
            "rating": "4", 
            "review": "Birthday relaxation. Love the statue and the beach is beautiful. We heard you can get live entertainment here. But when we visited nothing much was going on. Perhaps it was too early in the heat for the locals to be milling around. But nevertheless we got an opportunity to marvel at the sculpture and beauty of the beach and sea.Perhaps another visit."
        }, 
        {
            "index": 28, 
            "rating": "4", 
            "review": "Mexican Key West. Just like Duval St. in Key West. tons of restaurants, bars, shops, but with the local touch. The Papantla Flyers a beautifulsculpture leading to the beach and Aztec dancers and a church if you need to stop in.  A little pricey, but still a #1 spot for the tourist. I went in off season and it was packed. Have money, many temptations and impulse buys ahead."
        }, 
        {
            "index": 29, 
            "rating": "5", 
            "review": "Place of interest. We walked here along the shoreline and found this area by chance. Interesting structure with a nice beach area and lots of live music, busker style. Fun to sit and watch the people walking by. Felt like we saw a bit of the real local culture."
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Slow down and relax. Nice place to relax and watch the locals and tourists go by. Always something going on from the pole flyers to push cart vendors."
        }, 
        {
            "index": 31, 
            "rating": "4", 
            "review": "Very nice beach area. The area was very nice, safe, clean, vendors everywhere. The day we were there a band playing local Mexican music, dressed in typical Mexican attire. Looked and sounded great. Good place for pictures. Beautiful sunset"
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "GORGEOUS!!. My wife and I took a taxi here and back from our hotel (Xcaret resort), it was about 8-10 bucks plus a tip - and only about 5-10 mins away. The drivers there and back were very friendly and funny. I looked this spot up on google maps before we left, and I am sooo glad I did. We were there for a few hours. There are a TON of shops with great priced souvenirs, drinks (1$ beer), restaurants etc... There are a TON of pharmacies around 5th ave, literally every 2 or 3 stores is a pharmacy which is NICE! The beach/view is simply AMAZING!! exactly what you are looking for when you picture a \"perfect beach with perfect water\" We will be back next year!"
        }, 
        {
            "index": 33, 
            "rating": "4", 
            "review": "Lovely place to relax. Lovely little garden area to sit under palms trees people watching and relaxing. Every afternoon the bird men climb the pole in the centre of the park to entertain the crowds ."
        }, 
        {
            "index": 34, 
            "rating": "4", 
            "review": "Nice little beach side park. Great little park by the beach in Playa Del Carmen, we had a beautiful day with a lovely breeze, only draw back is it was a cruise ship day so a little busier than normal."
        }, 
        {
            "index": 35, 
            "rating": "4", 
            "review": "We took our son here. Locals and tourists alike mingle here. There is a play ground. Street artists do shows here for small change in the evening. It is right next to the ferry. We let our son play for a fgood hour while we gave our feet a rest and people watched. There is a history with this park that is worth reading online."
        }, 
        {
            "index": 36, 
            "rating": "5", 
            "review": "sign by the sea. walking the beached to get away from major hawkers, the amount of people hawking is amazing. One guy I turned away from claimed I didn't like Mexicans! Not a smart sales tactic"
        }, 
        {
            "index": 37, 
            "rating": "4", 
            "review": "Nice spot!. Great little spot to explore, shop & take in the local culture. People in all directions & plenty to see!"
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "Beautiful. Came across this by accident was stunninngly beautiful,great photo opertunity & great place to find some shade & rest up for a while."
        }, 
        {
            "index": 39, 
            "rating": "4", 
            "review": "The stroll that lead here. We walked from our hotel along the beach and about 40 minutes later we came across this statue. There was a ceremony when we arrived but not because our arrival just something to commemorate the past and possible future to come. The Mayan ceremony was a powerful tribute."
        }, 
        {
            "index": 40, 
            "rating": "5", 
            "review": "Birthday gaeway. We just pass, but it was a maya's show there, with dancers, very nice place, I love Playa del Carmen !!!"
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "Fundadores Park is a must visit. This is more that just a little park, it is a place for locals to gather, and for us tourists to people watch. Food is all around, and it adjoins 5th ave, and is next to the ferrys to Cozumel....if you just want to hang for a while and relax, this is the place....also, great beach.....spend some time here, you will be glad you did...."
        }, 
        {
            "index": 42, 
            "rating": "3", 
            "review": "Nice View. Nice park with lots of people selling item's with a great view of the ocean and you can sit there and enjoy the entertainment , people singing and putting on little shows...Nice place to sit back and enjoy the view"
        }, 
        {
            "index": 43, 
            "rating": "4", 
            "review": "A DAY IN 5TH AVE. Nice place to take pictures and shopping around the surrounding area. Nice view of the beach and ocean, can see some of the big ships going to and from Cozumel."
        }, 
        {
            "index": 44, 
            "rating": "4", 
            "review": "Nice place to watch the street artists. went down to 5th avenue a few nights and watched a few different artists in the park, nice authentic (bit touristy) acts :) and close to the shops and bars, its a must visit if only for the photos"
        }, 
        {
            "index": 45, 
            "rating": "4", 
            "review": "Fun Day in Playa del Carmen. We had a great day in Playa del Carmen exploring the shops in the 5th avenue shopping district. We also ferried over to Cozumel, which was fun too, but we enjoyed Playa del Carmen more. Seemed newer and cleaner."
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "Great entertainment and beach. . The location is just off the famous 5th avenue. Walked by as we were shopping had great Mayan tradition shows on for free, the beach was clean and brilliant. Great for stopping by while going for a shop, also loads of local markets for souvenirs etc."
        }, 
        {
            "index": 47, 
            "rating": "3", 
            "review": "Probably at least worth walking through on the way to the ferry.. Not really very much there. Appears neat an clean. Small chapel is worth a glance. I actually preferred the area before they tore up the cobblestones in some areas, but still OK, the new and butt ugly new statue on the ocean side not withstanding."
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "Nice place to hangout. This place is right by the beach! They have performers performing cultural dancing. You can buy cocunts there and other fruit and snack to enjoy!"
        }, 
        {
            "index": 49, 
            "rating": "4", 
            "review": "Very Pretty Park. I like this park. Beautiful ocean view. Interesting folks abound. The only downside for me - this park is located on the 'aggressive' end of 5th Ave."
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "entretaining. Very good to people watch, great to see the voladores of papantla or just to sip in a ice cold coconut."
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "Beautiful and lots of shopping!. This was a fun area with many locals selling everything from fresh fruit to souvenirs. Well worth the trip!"
        }, 
        {
            "index": 52, 
            "rating": "3", 
            "review": "Parque Los Fundadores. Visiting Parque Los Fundadores is a fun place right on the beach, Normally they have beautiful sand sculptures on the beach that are made from the locals. Very impressive. Walking down 4th Avenue is another story which can be annoying with vendors trying to lure you in their store and not taking no for an answer as they will try to sell their merchandize. Some can be annoying as they call out to you and insist as your walking down the street. Just ignore them and keep on walking unless you want to bargin to buy something."
        }, 
        {
            "index": 53, 
            "rating": "3", 
            "review": "Stop if there is a show, but otherwise.... Have a little tip money too. Good souvenir shopping around, but buy the little treats form the cart vendors there. They are good and cheap. Otherwise a good gathering place, and good beach out front, but the park is nothing special otherwise."
        }, 
        {
            "index": 54, 
            "rating": "4", 
            "review": "A darn impressive sculpture.. I've personally seen many a bronze seafront sculpture but the this emotive structure of two (what i see as mermaids) rising from two ocean vortexes is right up there with the best. Well worth checking out!"
        }, 
        {
            "index": 55, 
            "rating": "5", 
            "review": "So busy but so much fun. We love el Parque Los Fundadores at night. You have different things to do to see. So many people gather in this area at night."
        }, 
        {
            "index": 56, 
            "rating": "3", 
            "review": "shoppng. too many people hassel you for me.Was a wide varity of shops from tacky to high class worth going as you can get all your gifts for home"
        }, 
        {
            "index": 57, 
            "rating": "5", 
            "review": "Amazing. My kids loved this art. We found this to be a very fine architecture. My kids enjoy the Mayan show that they had on Friday, August 26, 2016. This was the day we visited La Quinta Avenida."
        }, 
        {
            "index": 58, 
            "rating": "4", 
            "review": "Awesome Sculpture on the Beach. This image of mermaids is a bronze sculpture from 2012. It celebrates the Mayan Calendar and is the first thing you see from the ferry pier. The artist is Arturo Taravez from Guanajuato, Mexico. The white church is near this area as are fruit stands, beach rentals, and sand castles."
        }, 
        {
            "index": 59, 
            "rating": "3", 
            "review": "stop off if you are passing by. I wouldn't go out of my way to come here. there wasn't anything going on really that we hadn't seen at Xcaret Park done with real style. I am sure if you were staying locally it may be worth a walk to see the artists that perform here, but wasn't worth the trip otherwise"
        }, 
        {
            "index": 60, 
            "rating": "3", 
            "review": "Nice place to stop by. It was a bit above average - good. There are some interesting things that occur at regular intervals like dancing and cultural performances and the tall pole spinning show. Can get a little busy at these times and the shop owners around it aren't shy about calling out or approaching.It's all part of the experience and was good to see."
        }, 
        {
            "index": 61, 
            "rating": "5", 
            "review": "Beautiful park near the ferry to Cozumel. Stopped by this park on the way to catch my ferry to Cozumel. Another night I stopped by and watched men swing from this very tall pole. It was pretty cool to see!"
        }, 
        {
            "index": 62, 
            "rating": "4", 
            "review": "Rain dance. Comfortable area to explore. Vendors approach but accept if you not interested, no pressure.\nRain dance, pole is amazing, worth watching"
        }, 
        {
            "index": 63, 
            "rating": "3", 
            "review": "Don't go out of your way. This is a nice place to take a picture but the show that was going on wasn't that great. At least it's free. This is definitely a place that you just walk through on your way somewhere else."
        }, 
        {
            "index": 64, 
            "rating": "4", 
            "review": "Great meeting spot. My grand daughter love to play in the kids area. they have shows weekends and such a view of the beach."
        }, 
        {
            "index": 65, 
            "rating": "5", 
            "review": "Landmark picture must. Typical Playa del Carmen picture. Lovely to walk around or just sit to watch the beach and enjoy the view."
        }, 
        {
            "index": 66, 
            "rating": "5", 
            "review": "Very cool Mayan cultural exhibitions!. We very much enjoyed watching the Mayan people in costume perform at this park. Very colorful costumes and brilliant performances here. Very photographic during the performances as well as at sunset. We also saw some great views of lightening off in the distance on more than one occasion. Very cool!"
        }, 
        {
            "index": 67, 
            "rating": "3", 
            "review": "Nice park. This is the start of the attractions near 5th avenue in Playa Del Carmen. worth checking out for 5 minutes. Store and food all around"
        }, 
        {
            "index": 68, 
            "rating": "4", 
            "review": "Beautiful. This was right by the beach. It had a\nBunch of little stores near it and a ton of kids running around.\nIt is a beautiful work of art. We enjoyed this area by the beach very much. Wah-Wah Beach Club was close to this on the beach."
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "Beautiful Beach & Shopping!. What more does one need when you have a beautiful beach, shopping, & restaurants ! This is definitely the place to visit to get them all."
        }, 
        {
            "index": 70, 
            "rating": "4", 
            "review": "Nice place to visit, good free local entertainment. A good free place to visit, some good local traditional entertainers topped off by the flying acrobats who add a touch of adrenalin to the activities.\nWorth watching if you are in the area"
        }, 
        {
            "index": 71, 
            "rating": "5", 
            "review": "Great picture oppertunity.. This is just beautiful to see. You can see the men perform on top of the pole their folklore music that is just amazing to watch and hear. It such a nice experience and a most do."
        }, 
        {
            "index": 72, 
            "rating": "4", 
            "review": "Portal Maya Statue in Playa Del Carmen. I loved this place. We were staying just a couple of blocks away and always found ourselves hanging out each day. I particularly enjoyed some of the shows that the locals would put on, or just hanging out to people watch. At the beach front of the park is a new bronze sculpture placed there in late 2011. It is entitled “Portal Maya 2012”. It celebrates the Mayan calendar and the date of December 21st. 2012. The sculpture was designed by artist Arturo Taravez who is from Guanajuato, Mexico. It has since become an iconic image of Playa Del Carmen. It is a beautiful work of art that you need to see up close to appreciate it."
        }, 
        {
            "index": 73, 
            "rating": "4", 
            "review": "Nice area of town. Wouldn't really consider this an \"Attraction\", but it is a nice area to see the beach and the ferries."
        }, 
        {
            "index": 74, 
            "rating": "5", 
            "review": "Great Pics. This is a wonderful place to take some amazing pics. Make sure you visit some of the smaller shops along 5th ave. and don't let the salesmen scare you. They are actually pretty funny."
        }, 
        {
            "index": 75, 
            "rating": "5", 
            "review": "Nice beach. This is not the best beach in the Riviera but is def a nice place to chill out. It is big and super central."
        }, 
        {
            "index": 76, 
            "rating": "4", 
            "review": "Very pushy shop owners. The sculpture is superb , but walking through playa del Carmen is not pleasant as most shop owners are hassling the tourists non stop to come into their premises"
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "hermoso lugar. pasamos por hay tipo 4 de la tarde y estaban haciendo varios espectaculos, muy entretenido y mucha musica y comida por todos lados, un lugar muy agradable. Great place, music and food everywhere, people at the street will do shows all day for tips ( so they are free, but you should help them out). We went around 4PM and had an amazing time."
        }, 
        {
            "index": 78, 
            "rating": "3", 
            "review": "Good place but the beach not so good. Hi,This is Playa del Carmen traditional place to visit by local and tourist, it has a very gorgeous momument, there is no cahrge to recah the beach however you need to struglle a little bit to find a public or porvate parking spot. There are artistisc events going on, the beach is not that calm like Akumal but still nice."
        }, 
        {
            "index": 79, 
            "rating": "5", 
            "review": "A really nice place to visit. This park offers a very nice break from the typical shopping/resorting experience. Make sure to witness the performers that hang of long lines by the feet spinning. I think they go every 10 or 15 minutes at certain periods in a day."
        }, 
        {
            "index": 80, 
            "rating": "4", 
            "review": "So this must be the central plaza in PDC. I swung by this place on a Sunday evening after a great day at the beach. The beating of the drums is what drew me in...... only to find some dressed in typical Mayan costumes and dancing to the beat of the drums. This show did make for an interesting 30 minutes or so; the dancers do take up a collection from the audience."
        }, 
        {
            "index": 81, 
            "rating": "4", 
            "review": "Entertainment . Parque is full of entertainers. Tips are recommended and preferable. You can watching traditional Mayan dance with authentic costumes and music or you can watch acrobatic that are climbing and alighting attached to thair legs while they hang upside."
        }, 
        {
            "index": 82, 
            "rating": "4", 
            "review": "Nice Park with local merchants. I loved the whole 5th avenue strip, but at the end you're met with a nice park surrounded by local merchants."
        }, 
        {
            "index": 83, 
            "rating": "5", 
            "review": "Lots of shopping and great beach. Lots of good shops, Pandora store about 30% cheaper than back at home so worth a visit. The beach is lovely."
        }, 
        {
            "index": 84, 
            "rating": "3", 
            "review": "Nice Square for Free Local Traditional Shows. We have been here in the middle of the day and at night. Local groups performing in traditional wear is nice (including the ability to take pictures with the performers for a few pesos of course). Can be very hot during the day as it is pretty open, but worth it to watch the shows. We usually stop here on our way to the 5th avenue shopping area."
        }, 
        {
            "index": 85, 
            "rating": "3", 
            "review": "Try the parasailing and experience the wave runner and boat ride.. We really enjoyed the parasailing experience, and got a short ride on the wave runner and had a good time on the boat while waiting for our turn on the parasail. The beach and ocean water were very nice, just like the rest of the Cancun and Riviera Maya areas. The shopping was a little too pressured to be enjoyable."
        }, 
        {
            "index": 86, 
            "rating": "5", 
            "review": "Beautiful Plaza. When in Playa you should stop by the Plaza daily because you never know what celebration or performance is going to happen. Always colorful and fun."
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "The heart and soul of Playa. Took the ferry over. One of my favorite places on earth. I long to be back here, with the smell of cochinita pibil cooking in the cafe, the fresh fruit spear vendors, the beautiful statue, and the sand sculptors.... beach soccer, sun, the mariachis, and the soft sea breeze. There is so much to do here, including the 20 minute ferry to Cozumel. From quaint churches to crazy vendors, you will see a bit of everything here. Shopping abounds. But the beach is the main attraction. The statue marks the best stretch of white sand and very swimmable turquoise water. sigh. I am daydreaming of another trip."
        }, 
        {
            "index": 88, 
            "rating": "3", 
            "review": "Dance show. I was walking on the beach and ended up at this park. There were some traditional dancers performing. It was pretty entertaining and you could just take a break from all the walking on the 5th Ave and the beach. There were local people as well as tourists."
        }, 
        {
            "index": 89, 
            "rating": "4", 
            "review": "Nice Common Area. Nice little area in the center of a lot of shops. Access to the beach with a nice view. Lots of people congregate around, so lots of people gazing."
        }, 
        {
            "index": 90, 
            "rating": "5", 
            "review": "A busy spot. Very busy area, close to beach and walking distance to ferry terminal, fun to sit and relax after the walking on 5th Avenue . . . of course everyone should make a point to see this work and appreciate the history it commemorates."
        }, 
        {
            "index": 91, 
            "rating": "5", 
            "review": "fun place to be. We were there on Thursday evening. There were performances offered by some traditional Mayan dance group (right under the arc) and Flying dancers. See pictures..."
        }, 
        {
            "index": 92, 
            "rating": "3", 
            "review": "Beautiful. Great views, support local vendors. Bought delicious refreshing coconuts for 80 pesos, a steal! Lovely way to end a day exploring 5thow avenue"
        }, 
        {
            "index": 93, 
            "rating": "5", 
            "review": "Awesome. Just a great place to hang out with family and friends. Lots of construction going on now. Be ready to get asked to buy buy buy."
        }, 
        {
            "index": 94, 
            "rating": "4", 
            "review": "beautiful view. close to shopping, souvenir shops, restaurants, and the pier. The water is beautiful but that area can be a little crowded"
        }, 
        {
            "index": 95, 
            "rating": "4", 
            "review": "Nice busy... Nice very busy. We took the Ferry to Cozumel from here and did some shopping on both places. Shopping was very reasonable and a variety of things to chose from."
        }, 
        {
            "index": 96, 
            "rating": "5", 
            "review": "Beautiful breathtaking views. Beautiful sculpture near Ferry Pier. Look through, past the sculpture and you can see the gorgeous beach and water.\nLove everything about the whole area!"
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "A couple of visits. Great shopping, food and nightlife we'll worth a visit or two ! So much choice in restaurants it's hard to know where to begin"
        }, 
        {
            "index": 98, 
            "rating": "4", 
            "review": "Be Prepared to be hounded. Nice area to see, but you WILL be bombarded with people trying to peddle their wares....just say no and stick your ground, otherwise you may come home with a $5 mood ring that you paid $800 on special deal JUST FOR YOU"
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "Beautiful Sculpture. Beautiful sculpture located close to the ferries that take you to Cozumel. Music venue on beach at night some nights."
        }, 
        {
            "index": 100, 
            "rating": "4", 
            "review": "nice area. We walked thru this area a few times getting from our hotel to Wah Wahs. Nice place with several vendors and nice local shows. Leads to a nice spot on the beach. A little bit of everything in this area."
        }, 
        {
            "index": 101, 
            "rating": "4", 
            "review": "Evening stroll. Nice stroll to enjoy local culture and arts!! Right next door to Playacar Palace, safe area, fun atmosphere!"
        }, 
        {
            "index": 102, 
            "rating": "5", 
            "review": "Fun Place. Fun place to hang out and take pictures near 5th AVE. Great place to eat fresh fruit or a snack from one of the many vendors."
        }, 
        {
            "index": 103, 
            "rating": "4", 
            "review": "Catch a show!. We stumbled here after walking on 5th Avenue. We took some pictures, had a beer at a nearby bar, and on our way out, there was a cool show starting. We grabbed some snacks and sat and watched a Mayan Dance. On our last day in PDC, we were walking on 5th Avenue again, and there was another show. Very family friendly with snacks, beach, and a little park nearby."
        }, 
        {
            "index": 104, 
            "rating": "4", 
            "review": "Nice place tovisit. This is a nice change to just stroll round and enjoy the views. There are plenty of places to eat and shops for the ladies"
        }, 
        {
            "index": 105, 
            "rating": "3", 
            "review": "This is a nice park to take the kiddies. This is a nice easy park for the kiddies and you can take a photo with the statue by the sea. The beach is nice to so if you get hot you can go for a swim."
        }, 
        {
            "index": 106, 
            "rating": "3", 
            "review": "Just a photo-op. Good place to stop for a photo and rest before exploring the nearby shops on 5th Avenue but not something I would seek out to see."
        }, 
        {
            "index": 107, 
            "rating": "5", 
            "review": "full of people and food. this is where the ferry to Cozumel leaves and arrives, very busy area, locals as well as tourists, clean"
        }, 
        {
            "index": 108, 
            "rating": "4", 
            "review": "Fun for the family. Go in the late afternoon when they have dance groups performing right under the arch. We loved the Mayan dancers the best. There is a play area for the kids as well."
        }, 
        {
            "index": 109, 
            "rating": "4", 
            "review": "nice place to visit. Went to have lunch at a small cozy restaurant and spent the afternoon visiting this beautiful spot. It was warm and sunny even went for a swim....worth going to visit."
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "Enchanting. Romantic and pretty , we loved sitting here in the evenings watching the shows the lovely people of this town put on for our enjoyment, with the beautiful sea breeze to cool us down after a long hot day sunbathing"
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "Walking. This is at the beginning of 5th Avenue and well worth seeing normally there is a performance at 4pm."
        }, 
        {
            "index": 112, 
            "rating": "4", 
            "review": "Photo op and hub of Quinta Avenida/Playa Del Carmen. Often the site of some event in the evening. Frida Kahlo was featured the evening we ventured out to Quinta. Be wary of the crowd but enjoy your surroundings."
        }, 
        {
            "index": 113, 
            "rating": "3", 
            "review": "Nice to see.. There was nothing grand about this site, but it was nice to see and take photos of. It's along 5th avenue and the walk is nice."
        }, 
        {
            "index": 114, 
            "rating": "3", 
            "review": "Very nice. We stumbled into this area and were surprised by the lovely show the locals provided . Being in the beach provided a much welcomed breeze."
        }, 
        {
            "index": 115, 
            "rating": "4", 
            "review": "Right off the shopping strip. Beautiful beach next to the ferry terminal and adjacent to the mile long 5th Avenue shopping strip. Clean and upscale"
        }, 
        {
            "index": 116, 
            "rating": "3", 
            "review": "Selfie must!. This is a great place for a family picture. The square gets lots of local people and tourist engaged in some \"Mayan\" dancers and rituals at evening. From there, you can easily get into the Mall shops like Old Navy and Zara. I would recomend taking the time to look into the chapel of Virgin of Carmen that is just next to the park."
        }, 
        {
            "index": 117, 
            "rating": "3", 
            "review": "Shopping. Just visited here while on holiday. Busy place, lots of shops ,bars and café`s. Not such a nice beach.Ok for a visit, wouldn't want to spend my holiday here though"
        }, 
        {
            "index": 118, 
            "rating": "5", 
            "review": "Beautiful walk by the beachfront. Surrounded by local restaurants, vendors and Playa del Carmen's locals, it's a great location to observe a cross-section of the town."
        }, 
        {
            "index": 119, 
            "rating": "5", 
            "review": "beautiful. Beautiful place to see the water is so blue and you can get the ferries to go to cauzemal , a must see lots of stores and restarants on the beaches was there Feb 2015"
        }, 
        {
            "index": 120, 
            "rating": "4", 
            "review": "Great spot for that family picture while in Playa Del Carmen. This area of town offers some old style Mexico shopping, street food, and if you are there at the right time even a Mayan show from a high pole. Lots of great food around and a hub of activity."
        }, 
        {
            "index": 121, 
            "rating": "4", 
            "review": "We enjoy the nightlife and attractions. We have been staying in a condo near 5th avenue and enjoy walking down the street to the park. At night as the sun goes down there are performers that climb to the top of the tower and twirl and spin down to the ground. The kids love it and we sit and watch the entire thing. We've seen it a dozen times and its still amazing that all these grown men climb up and spin down. There are sculptures in the park and the park is very near the ferry landing to Cozumel. Check it out, its free and interesting!"
        }, 
        {
            "index": 122, 
            "rating": "4", 
            "review": "Beach of the Mermaids. The ferries to Cozumel are located here and a beach where people are playing soccer and/or relaxing."
        }, 
        {
            "index": 123, 
            "rating": "5", 
            "review": "It is neat looking!. Its nice to see and there is a park next to it. You also have other sculptures to look at in the area.."
        }, 
        {
            "index": 124, 
            "rating": "5", 
            "review": "Beautiful, picturesque spot. You cannot walk through Playa del Carmen without stopping in the Parque. Be sure to snap your family photo under the gorgeous public art. This is a beautiful stop while lunching and shopping along the streets of Playa."
        }, 
        {
            "index": 125, 
            "rating": "5", 
            "review": "Wonderful, lively stretch of beach and culture. Great spot for people watching, travellers and locals alike. Many different things going on from festivals, weddings, dancers, local crafters. Day or night this area is ever changing in activity. Nice spot to watch the sun rise, it is quiet and free of people at 5 AM"
        }, 
        {
            "index": 126, 
            "rating": "5", 
            "review": "Free Fun in Playa Del Carmen. This area of Playa Del Carmen was great. It seems to be a place where locals hang out after a long work day. I visited when I got off the ferry from Cozumel. It was a busy Saturday evening. Local vendors selling snacks/water. A group of dancers did a short free performance displaying the Mayan culture. It was nice to see the people so proud of their ancestry. There is a free public beach, some restaurants near by and a small playground for children. Unfortunately there is a McDonalds about 2 blocks from here. Its a must prior or after the ferry to Cozumel!"
        }, 
        {
            "index": 127, 
            "rating": "4", 
            "review": "Second trip to PDC. Beautiful location, next to ferry and Senor Frogs and shopping on 5th street and all the local shops."
        }, 
        {
            "index": 128, 
            "rating": "5", 
            "review": "beautiful. very pleasant time walking around, a bit of hassle here and there from the shop keepers but just smile and carry on by unless you really do want to go into their shops."
        }, 
        {
            "index": 129, 
            "rating": "4", 
            "review": "Beautiful View. This park is very beautiful and relaxing. Be sure to get a close up view of the Portal Maya Statue and the Nuestra Senora del Carmen Catholic Church. If you plan to watch the flying Papantla performers, be prepared to be solicited for tips."
        }, 
        {
            "index": 130, 
            "rating": "5", 
            "review": "Amazing statue. This is located right by where you get off the main fairy. The statue is definitely worth your time to go see. Also, there are Aztec Indians that do dances under it and you can take pictures with them. When they are finished, another group climbs a pole very high in the air and comes down on ropes upside down."
        }, 
        {
            "index": 131, 
            "rating": "3", 
            "review": "Shops of all types. Peddlers where very annoying and sometimes to intrusive. Be careful of the ever asking \"remember me from your hotel\" all of the vendors/peddlers will try to get your attention that way."
        }, 
        {
            "index": 132, 
            "rating": "3", 
            "review": "Nice place to walk. Nice place to walk, next to the beach and the Cozumel ferry. The beach is really nice with clear turquoise water. If you are lucky, you may see the aerial show. It's free but donations are welcome and the guys will come to see you for sure! The big statue at the entrance is really nice. We didn't stay long but worth the visit."
        }, 
        {
            "index": 133, 
            "rating": "3", 
            "review": "Nice open area by the ferries to Cozumel. The statue is much bigger than I imagined. Lot of life in this area as it is on the way to the Cozumel ferries. Hang out, take some photos and that's about it."
        }, 
        {
            "index": 134, 
            "rating": "5", 
            "review": "Massive Statue. Very nice statue, very nice, clean and next to the ferry. The public beach is very clean and nice. At night time they have the these flying guys kinda scary but entertaining. Its a good place to walk and enjoy the breeze from the caribbean sea...."
        }, 
        {
            "index": 135, 
            "rating": "5", 
            "review": "Beautiful Sculpture!. We were taken here on a bicycle tour from our resort. We got a nice local perspective on the meaning of this statue- he called it the 'Love Statue'."
        }, 
        {
            "index": 136, 
            "rating": "4", 
            "review": "Picture worthy locale with free shows. The place is alive with many people. We saw a free aerial acrobat show and Aztec/Mayan Indian dancing show free (donations welcome) while visiting."
        }, 
        {
            "index": 137, 
            "rating": "4", 
            "review": "A walk on 5th Avenue. It was a pleasant experience even if you are just out for a walk, people watching instead of shopping."
        }, 
        {
            "index": 138, 
            "rating": "4", 
            "review": "Sunday evening visit. Nice place for a sunday evening walkthrough with family, I loved the \"Papantla Flyers\" o \"Voladores de Papantla\" performers.I guess the only little detail is that the park seems to need some maintenance and cleaning, other than that the place is great and nicely located in Playa's downtown."
        }, 
        {
            "index": 139, 
            "rating": "4", 
            "review": "Explored slightly here. The pier was beautiful. Took lots of pictures and mostly just enjoyed the scenery. We enjoyed the little show they did as well here."
        }, 
        {
            "index": 140, 
            "rating": "4", 
            "review": "fifth avenue shopping. this was quite a a lively area plenty of shops and bars, to choose from, very hot down there, better to go down there first thing in the morningThey are all open by 9.30.I think it gets very lively at night with all the bars...."
        }, 
        {
            "index": 141, 
            "rating": "5", 
            "review": "great place. This place is a most go..beautiful.! Nice walk, beautiful views with lots and lots of good restaurants and plenty of stores to visit."
        }, 
        {
            "index": 142, 
            "rating": "5", 
            "review": "Unique and Beautiful Landmark. A beautiful view, in the heart of the downtown area. Definitely a must see at sunset! There are often shows and other entertainment in that area."
        }, 
        {
            "index": 143, 
            "rating": "3", 
            "review": "Good to rest after walking Quinta. It's a very nice beach front park. Good for families with children because have a playground for them. When we were just resting and enjoying the view, starts a show of flying Mayas in the center of the Park. Interesting and different. I can describe this place as an oasis in Quinta Avenida where the locals and tourist can rest and enjoy a beautiful day."
        }, 
        {
            "index": 144, 
            "rating": "4", 
            "review": "Amazing sculpture. Sitting in this market square with children enjoying the play area is wonderful. It is very busy here at the end of 5th Avenue but you can also,watch the ferries crossing to Cozumel"
        }, 
        {
            "index": 145, 
            "rating": "5", 
            "review": "Good place for pics!. There's a lot going on on this end of town including a show on the town square-don't miss it! It's put on by an aerial troop and they are quite talented. Best part is it is free and they perform for tips only."
        }, 
        {
            "index": 146, 
            "rating": "3", 
            "review": "Peacfully underwhelming. If you're looking for something amazing & exciting to happen here you won't find it but if you're looking for a beautiful downtown area to walk around, relax & enjoy the scenery, look no further! I absolutely LOVED 5th avenue. No cars or scooters trying to run you off the road, just hundreds of people walking around, shopping & dining."
        }, 
        {
            "index": 147, 
            "rating": "4", 
            "review": "Great Vibe. This area sits at the end of Fifth Avenue and after the hustle and bustle of the shops this is very welcome distraction.A brilliant place to grab a drink and soak up the atmosphere.There is loads going on, a market area selling trinkets, gifts, food, and a Mayan dance show held beneath the sculpture.To me, it's what holidays are about, sitting and watching the world go by.Do it, make the time - you will not regret it!"
        }, 
        {
            "index": 148, 
            "rating": "5", 
            "review": "Nice place to hang out and watch sunset.. It is located next to the ferry terminal. In the evening they play music and along with other traditional mayan dance. It is located few blocks from the main mall on 5th Ave. It is good to visit one time to experience the relax atmosphere."
        }, 
        {
            "index": 149, 
            "rating": "4", 
            "review": "A great place for pictures!. Super picturesque with plenty of places to snap photos! The walk from there to resort is an easy one with many options for a bevy or snack!"
        }, 
        {
            "index": 150, 
            "rating": "4", 
            "review": "Beautiful!. This is a gorgeous view and the performers were awesome. Can't wait to see it again. Love all the shopping that is available."
        }, 
        {
            "index": 151, 
            "rating": "5", 
            "review": "Beautiful Spot. Pretty place to relax and enjoy the ocean and beach. First night we were there had Mayan dancers that were very good. Close to restaurants and ferry to Cozumel."
        }, 
        {
            "index": 152, 
            "rating": "3", 
            "review": "Ok beaches good show in the park area. The beaches were fairly busy since it was a nice day and the beaches here are generally public. Most of the areas that are maintained by hotels are cleared of seaweed and raked to remove trash and debris. Plenty of places to get a massage on the beach, which feels great but there may be sand.There was a Mayan show in the park when I was there one day which was great, enjoyed it very much."
        }, 
        {
            "index": 153, 
            "rating": "5", 
            "review": "Playa del Carmen. Playa del Carmen centre is a mix of shopping or relaxing on the beach, near the Cozumel ferry terminal. Many locals are trying to sell trips and can save you loads on travel company prices, even if it's just ferry tickets. We always felt safe, booked to visit Chitchen Itza and saved over £100... the trip was excellent and included lunch and a cenote visit."
        }, 
        {
            "index": 154, 
            "rating": "3", 
            "review": "Interesting!. This is at the end of the Quinta Avenida in Playa del Carmen right in a public beach area. Can't be missed!"
        }, 
        {
            "index": 155, 
            "rating": "1", 
            "review": "waisted day. you are better off buying your gifts from your hotel venders.the venders are a none stop pest. prices are high people will not let you shop in peace. I like to be left alone.if you like to haggle then go."
        }, 
        {
            "index": 156, 
            "rating": "2", 
            "review": "Left feeling violated. Such a cool city but the nagging of the merchants turned my stomach. They would lie to you trying to convince you they were your waiter at whatever resort band you had on. I figured out real quick and bypassed any merchant that tried to sell me that load of crap. You can't go in to any store with them shoving stuff in front of you to buy. I will never visit the city again. Resort life for me!"
        }, 
        {
            "index": 157, 
            "rating": "5", 
            "review": "Beautiful must see. Wow just wow.. What a beautiful town square. Lots of vendors and people. they even had a little show for us to watch put on by the locals."
        }, 
        {
            "index": 158, 
            "rating": "5", 
            "review": "Beautiful Artwork!. This huge piece sits just right by the beach of Playa Del Carmen, and steps away from the Ferry Terminal. It was Thursday afternoon, and we were treated with a Native Dance Show. Beach is open to the public, so bring your swim wear and enjoy the nice sand beach, and all the restaurants around."
        }, 
        {
            "index": 159, 
            "rating": "5", 
            "review": "Sculpture. Just beautiful and lots to see. Old church, dancers, and shopping. Best places to eat from street tacos to steak. Never found a place to eat I didn't like to eat."
        }, 
        {
            "index": 160, 
            "rating": "5", 
            "review": "Awesome!. We love to people watch at this place. This visit was a bit better than most because we caught a Mayan ritual as it began. Plus the views are Awesome!"
        }, 
        {
            "index": 161, 
            "rating": "5", 
            "review": "Beautiful beach with tons of shops. Beautiful beach! The water is gorgeous! Tons of shops for souvenirs, many places to get a bite to eat and drink. When we went they had live entertainment in the square which was nice to sit and watch. Great place to visit, would love to go again."
        }, 
        {
            "index": 162, 
            "rating": "5", 
            "review": "Do not miss it. You can meet domestic people, good beer, cheap massage. Every night is a program Mayan people ritual dancing..."
        }, 
        {
            "index": 163, 
            "rating": "3", 
            "review": "Little church. There is a beautiful church in there, the surrendings shops are very nice. The only thing we didn't like is that the kids playground place was very dirty and no maintenance, found lots of broken glasses which make it very dangerous for the children playing without shoes."
        }, 
        {
            "index": 164, 
            "rating": "4", 
            "review": "Great Walking. Beautiful beach area, pretty busy but very enjoyable with lots of eateries and drink facilities at hand"
        }, 
        {
            "index": 165, 
            "rating": "5", 
            "review": "Un expected cute area near our hotel.. Entrance to public beach, this square had entertainers in the evening was a nice place to sit and people watch."
        }, 
        {
            "index": 166, 
            "rating": "3", 
            "review": "Fun walk, pretty beach, but shops are way over priced.. We visited 5th avenue for our touristy shopping excursion. It was fun to walk around and look at what the shops had available. However, the majority (I mean about 95% if you can't find a good deal) were way over priced. There were many instances where we could get the same product for half the price state side. A lot of the stores were not willing to negotiate. We've been to shops in multiple countries, and for the touristy stuff sold, this was the most expensive place we had ever been. When I say touristy, I mean random souvenirs (i.e. hats, shirts, random pottery, cooking spoon holders, etc.)."
        }, 
        {
            "index": 167, 
            "rating": "5", 
            "review": "Cultural Location for Mayan Show. We happened to hear the music and instruments on our walk down 5th Avenue (Quinta Avenida), and saw the Mayan musicians on the top of the Blue pole, and later a Mayan dance and music at the stage. It was fun to watch. The dancers do solicit donations, but they were not aggressive. They do welcome pictures as well!!"
        }, 
        {
            "index": 168, 
            "rating": "3", 
            "review": "A walk on the 5th ave. Enjoy the walk on a sunny day. However, the stuffs displayed at the stores along the street are over priced."
        }, 
        {
            "index": 169, 
            "rating": "4", 
            "review": "Main square Playa. Nice park right on the beach in Playa next to the Ferry to Cozumel. Fun to hang out and people watch"
        }, 
        {
            "index": 170, 
            "rating": "5", 
            "review": "Gorgeous Beach View. Located off of 5th Avenue in Playa Del Carmen, you don't want to miss this beach. Pack your swim suite to enjoy a break from shopping by laying or swimming on this stunning beach."
        }, 
        {
            "index": 171, 
            "rating": "5", 
            "review": "Love it downtown!. Great shopping and food! Found great deals on silver jewelry. Found a little bar looking over the ocean and the ferry with great prices for Corona. May stay in this area next year!"
        }, 
        {
            "index": 172, 
            "rating": "5", 
            "review": "Great vibe!. A really enjoyable stroll down 5th. So much culture & people from EVERYWHERE on the globe. So many diverse languages abound. Nice shops, the outside and some of the brick & mortor shops did bargain, so that's always a plus. The atmosphere at the beach in the evening was cool."
        }, 
        {
            "index": 173, 
            "rating": "5", 
            "review": "Fun local color!. We went through here on our way to a Cozumel day trip. Ferry ticket booths are just to the right of the statue. This also acts as the main inlet from Cozumel and it's cruise ships so shopping in the square can be pricey. Sunday seems to be the day the locals go to the beach. plenty of groups drinking and singing. Lot to look at! Take a seat somewhere in the square and take in some people watching!"
        }, 
        {
            "index": 174, 
            "rating": "1", 
            "review": "PORTAL MAYA... don't miss this.. located center of beach, just beautiful.lots of locals and street shows gorgeous statue"
        }, 
        {
            "index": 175, 
            "rating": "5", 
            "review": "wow this was a big statue. the beach was amazing and the massage me and my wife had on the beach for only 40 dollars for the both of us was awsome"
        }, 
        {
            "index": 176, 
            "rating": "5", 
            "review": "Indian Show nightly. You will be surprised at the Indian show. Very dangerous and yet the music was very soothing. Great view of the Gulf. Vendors are nearby so you can get a cold drink while you watch the show."
        }, 
        {
            "index": 177, 
            "rating": "5", 
            "review": "very entertaining. We enjoyed the traditional dance show while waiting to board the boat to Cozumel. The dancers were entertaining and fun to watch."
        }, 
        {
            "index": 178, 
            "rating": "5", 
            "review": "Shopping. 5th avenue has great shopping. Some great deals, some not. You need to know what to pay and make a deal. Cab from hotel is $7"
        }, 
        {
            "index": 179, 
            "rating": "5", 
            "review": "Excellent entertainment. Just past the shopping on 5th Avenue there was a lot of entertainment in this area. We really enjoyed the dancers and performers! Next time plan to spend more time here!"
        }, 
        {
            "index": 180, 
            "rating": "4", 
            "review": "Enjoy the view...ignore the tour touts and over-priced restaurants. A really lovely sea front parque that is being ruined by over commercialization. Hard to enjoy the outing when they make you feel like all you are is a walking ATM!"
        }, 
        {
            "index": 181, 
            "rating": "5", 
            "review": "Free park and entertainment . Locals put on shows here that are free to the public, if you donate to them they allow you to take pictures with the performers. Very entertaining to watch"
        }, 
        {
            "index": 182, 
            "rating": "4", 
            "review": "Great View. Great beach side spot where you can view shows in the evening. The shows are free however the performers do accept tips and are willing to take photos after the show."
        }, 
        {
            "index": 183, 
            "rating": "5", 
            "review": "The best part of 5th Ave- The Park!. We walked to this park which is right beside the ferry dock. Accordingly, 5th Avenue is the hub of the town and is a pedestrian mall, a shoppers paradise from the low end to the ultra expensive in the shopping experience. From designer shops to the tacky nik nak shops, this spot is prime. At 5 pm we were lucky to catch a show - a performance but two groups. The first was the \"Tower of the Voladores\". Daring Mexican men launch themselves up a very high pole ( 80 feet high) headfirst and making a slow spiraling descent to the plaza below. Each one is suspended by ropes round their ankles. The Mayan dancers at the base of the arc are superb in performing ritualistic dance. This adds a touch of true culture in an area that is so commercialized. Oh, and this event in the park is a complete contrast to the vibe of 5th Avenue. Love it."
        }, 
        {
            "index": 184, 
            "rating": "5", 
            "review": "Beautiful scene . This is a beautiful little park at the end of 5th Avenue. It has an amazing beach. A variety of shops. Great photo opportunities. And if you are lucky you my have some local entertainment too. The sculpture is also very beautiful and perfect for a photo."
        }, 
        {
            "index": 185, 
            "rating": "5", 
            "review": "Cool Statue. Really cool statue and nice beach. Lots of vendors surrounding the area though so not as peaceful an environment."
        }, 
        {
            "index": 186, 
            "rating": "5", 
            "review": "Fabulous!. This was such a cool experience. We got to see a native dance, which was absolutely amazing. It was cool to see all of the locals that hung around this area. They were just hanging out enjoying the end of the day."
        }, 
        {
            "index": 187, 
            "rating": "5", 
            "review": "Stunning, near to bottom of 5 th Avenue and the sea. This is the place to relax, sit down and watch the world go by. This sculpture is beautiful and a beautiful land mark, you cannot miss it. It's near the bottom of 5 th Avenue near the beach. If you are lucky, you may see street entertainers. Lots of photography opportunities. A place you can relax and take your time in the heat of the day."
        }, 
        {
            "index": 188, 
            "rating": "4", 
            "review": "Very beautiful sculpture near 5th avenue on the ocean. 5 th avenue is definitely a one time visit, there are little shops every where, but unfortunately everyone hassles you to try to get you to go in and shop at THEIR store."
        }, 
        {
            "index": 189, 
            "rating": "5", 
            "review": "Pretty spot. Cool Sculpture.. Great spot for a photo-op. Nice view and great spot to hang-out and people-watch. Get out your camera!"
        }, 
        {
            "index": 190, 
            "rating": "5", 
            "review": "Lovely sculptures. The sculptures at the beachside are beautiful and epic. You don;t need a ticket to get up onto the ferry platform and the view is great from up there. Playacar mall is very close with good but pricey food options."
        }, 
        {
            "index": 191, 
            "rating": "4", 
            "review": "mermaid island. i had looked up places to see in playa del carmen, and wanted to find this place. our hotel had bikes and we were riding around and stumbled upon it. Such a cool statue."
        }, 
        {
            "index": 192, 
            "rating": "4", 
            "review": "Shopping, restaurants and entertainment. As the name suggests, 5th Avenue is a shoppers paradise from high end Cartier to Playa Mart. Look out for the crocodile skin boot shop and how cigars are rolled.If you can, catch the Tower of the Voladores. It is completely bonkers with crazy men launching themselves of an 80 foot pole headfirst and making a slow descent to the plaza below. Admittedly they are suspended by ropes round their ankles. Got to see!The Mayan dancers are also superb and in complete contrast to the vibe of 5th Avenue."
        }, 
        {
            "index": 193, 
            "rating": "5", 
            "review": "Nice place :). Nice place on the beach in city center, many local musicians playing in the evening. Next to old white chapel"
        }, 
        {
            "index": 194, 
            "rating": "5", 
            "review": "Stunning!. This is a gorgeous site to see, right next to the church, and set in front of the turquoise Caribbean waters. Great spot to snag a few pics and right at the end of 5th avenue. We stop here every time we come to Playa del Carmen."
        }, 
        {
            "index": 195, 
            "rating": "5", 
            "review": "Shoppers delight. 5th avenue is full. Of shops restaurants. Ice cream parkour so. A great place where you can even get the ferry over to Cozumel. This area is so built up. If you haven't been for a while. Try it again"
        }, 
        {
            "index": 196, 
            "rating": "5", 
            "review": "Beautiful. Great vibe in this area. Shopping, restaurants, entertainment and great scenery. Highly recommend coming in the day or night. We went in the evenings when it was cooler out and felt totally safe. There were lots of tourists, family's and children having a wonderful time."
        }, 
        {
            "index": 197, 
            "rating": "5", 
            "review": "5th Ave.. LOTS and LOTS of shops. If you come from a resort that is all inclusive, you have a wrist ban on. I recommend covering it with a watch or bracelet. Some of the store workers will bug you a lot knowing that you are a easy tourist."
        }, 
        {
            "index": 198, 
            "rating": "4", 
            "review": "Lovely day out to see Parque Los Fundadores. This is a nice day out down to 5th Ave to see shops and nice to people watch having a cold beer . Stop and take photos of Parque Los Fundadores looking out to sea ,we'll wreath a visit ."
        }, 
        {
            "index": 199, 
            "rating": "5", 
            "review": "Parque Los Fundadores. This is such a beautiful place. Definitely lots to see here! We even got the chance to see a Mayan ritual while we were there."
        }, 
        {
            "index": 200, 
            "rating": "5", 
            "review": "Great park on the beach at Playa Car. This is a great people watching place lots of people pass through here. So get a drink and a snack from the local vendors and have fun."
        }, 
        {
            "index": 201, 
            "rating": "5", 
            "review": "very nice. Booked a trip to come here and spend four hours me and the Mrs. We enjoyed our visit. Visiting loads of the many shops they have even dough they are repetitive after a while with the people asking you to go into. Good places to get gifts and there's a little shopping mall near the end of long road if you manage to walk all the way to the other end. well worth a visit and different to get out of Cancun. Plus the beach is nice as well. loads of places to eat you will be spoilt for choice."
        }, 
        {
            "index": 202, 
            "rating": "4", 
            "review": "Lovely!. Very happening landmark of Playa Del Carman. Really like the atmosphere here with live entertainment - demo of traditional Mayan ceremonies. Well deserved for its iconic status."
        }, 
        {
            "index": 203, 
            "rating": "5", 
            "review": "Lovely. We came across the area by accident and ended up sitting down on the steps and watching buskers, dancers and these acrobats clinging up this mad looking pole. Something going on every day."
        }, 
        {
            "index": 204, 
            "rating": "5", 
            "review": "amazing. what a truly amazing area this is ,my wife and I CAME HERE and did not know that this was here as well as as the BEAUTIFUL sandy beach and blue green ocean behind it.Playa del Carmin is one crazy city but we enjoyed going there very much.A must experience for sure!!"
        }, 
        {
            "index": 205, 
            "rating": "5", 
            "review": "5 th. ave.. Souvenir shops etc. An all day place. I would recommend this attraction to anyone. Senor Frogs is an amazing place to eat although a little pricey!"
        }, 
        {
            "index": 206, 
            "rating": "5", 
            "review": "Great Spot to see. We got lucky and were able to catch a free show of the Mayan dancers, it was excellent and I loved to see the culture."
        }, 
        {
            "index": 207, 
            "rating": "4", 
            "review": "Great Mayan Dance Performance. While passing through Playa del Carmen's prime tourist and shopping district he happened upon this beautiful park. There is a magnificent, soaring sculpture back-dropped by the stunning turquoise sea and sunset, under which a group of traditionally dressed Mayan dancers were performing to the beat of Mayan drums. We stopped for several minutes and were mesmerized by the rhythm and highly physical nature of the native dance. The cost was a tip jar circulated by some of the dancers amongst the crowd. Fun experience!"
        }, 
        {
            "index": 208, 
            "rating": "3", 
            "review": "Typical busy tourist beach. Nice enough park area just off 5th Avenue with all its shops. Free entertainment shows in the park. Beach just ok, we had a quick stop but it didn't really appeal. It was pretty crowded with lots going on and quite noisy so a bit difficult to find somewhere quiet to relax."
        }, 
        {
            "index": 209, 
            "rating": "5", 
            "review": "Playa visit. On every trip to the Riviera Maya, we always take at least a half day to Playa's Fifth Avenue. We love walking the street chatting with the vendors and stopping in at the Pez Vela bar with the swing bar seats. It's a great place to visit and to wander."
        }, 
        {
            "index": 210, 
            "rating": "3", 
            "review": "Vendors are relentless.. Playa has changed a lot in 10 years. The area is much more built-up and crowded, and the vendors are more aggressive."
        }, 
        {
            "index": 211, 
            "rating": "3", 
            "review": "Pretty in the morning; shows at night. Some local vendors selling fruit in the morning, traditional free shows at night. Pretty open areas to sit."
        }, 
        {
            "index": 212, 
            "rating": "3", 
            "review": "Nice first thing in the morning.. I usually tend to stretch here in the early morning to catch the sunrise. Its a great start to the day and the setting with the small church is really nice."
        }, 
        {
            "index": 213, 
            "rating": "5", 
            "review": "SHOP! SHOP! SHOP!!. If you want to get out for the afternoon or day 5th ave is the place to go. There is a ton of shops as well as restaurants and bars. The beach is spectacular and a good place to go for a swim. You can get all your souvenirs here, stay for the day or just a few hours. Just a FYI...if the cruise ship are coming into port expect the prices to go up...they are lower when the ships aren't there!"
        }, 
        {
            "index": 214, 
            "rating": "3", 
            "review": "Fun to sight see, expensive to shop here. We didn't visit any of the restaurants, but did do some shopping. All seemed very expensive, tourist trap for sure. Most everything, even after they lower the price was full retail price in the U.S. A Swatch Watch was over $200, he dropped it to $175 it retails in the U.S. for $80 -- buyer beware."
        }, 
        {
            "index": 215, 
            "rating": "5", 
            "review": "beautiful island. Take the ferry from Playa del Carmen only 40 minutes. Don't by your return ticket at the same time. There is 3 different ferries that run there. All leave at different times so you have options when you want to head back."
        }, 
        {
            "index": 216, 
            "rating": "4", 
            "review": "Enjoyed the performances. Great sunset, there were some performers dressed as the prehispanic Mayans , impressive dance that included fire, There is some restaurants with great food with in walking distance, there is a military base across from it which makes this park a safe place to visit"
        }, 
        {
            "index": 217, 
            "rating": "5", 
            "review": "Beautiful arch on the beach, near the Pier, beckons you here!. Walking the beach toward the pier we spied this arch! It just drew us in and we took photos of every angle. Did not know what it was. There is a nice playground for the kids. You can sit on the wall edge for a rest. We could see what appeared to be a ride spinning around, 4 cables with people on them, getting closer and zooming in it is not a ride but some acrobats!! So crazy to see these guys peacefully gliding round and round after the madness of 5th Avenue."
        }, 
        {
            "index": 218, 
            "rating": "5", 
            "review": "In the midst of the modern a reminder of traditions!. A free family event for all ages! This park houses incredible performing troupes. They are well skilled in dancing on the 80 feet high totem pole! There's a resident group which performs the aztec dances which are native to this area."
        }, 
        {
            "index": 219, 
            "rating": "5", 
            "review": "Playa del Carmen shopping and beach front area. Transportation through \"Go Mexico\" for a half day adventure of shopping. We dinned at \"La Mission\" located on 10th street. Very good authentic Mexican menu with open air dinning. We enjoyed the Mayan historical entertainment at the beach front park. The weather was perfect."
        }, 
        {
            "index": 220, 
            "rating": "4", 
            "review": "Great spot for people watching. This is a great spt to enjoy on the beach right by the ferry terminal to Cozumel. Lots going on and fund time just hanging out. Be sure to check out the really cue small chapel adjacent."
        }, 
        {
            "index": 221, 
            "rating": "4", 
            "review": "Beautiful overlooking the ocean. Great place to stop and rest your feet after walking 5th ave. The statue is very cool to see and lots of shady places to sit and watch the ocean."
        }, 
        {
            "index": 222, 
            "rating": "4", 
            "review": "Nice place to spend 30 minutes. We came here twice. Once on a day just to look around and loved the \"gateway\" statue to the sea. We also dropped by late afternoon and saw the guys performing at the top of the pole and then descending on the ropes tied to their ankles whilst playing music. Awesome. We also saw under the gateway statue some (mayan?aztec?) dancers and musicians which were pretty cool. Definitely worth a drop by in the early evening and I suspect a lot more goes on throughout the evening that we didn't see."
        }, 
        {
            "index": 223, 
            "rating": "5", 
            "review": "Great place. A good place to rest your feet , after a walk on 5ft. Avenue, local food vendors are around, not to many, which it is good, family oriented area."
        }, 
        {
            "index": 224, 
            "rating": "5", 
            "review": "Beutiful focal point of Playa del Carmen. It's just a statue, a big statue on the waterfront near the ferry terminal. Just a block from the main road in town."
        }, 
        {
            "index": 225, 
            "rating": "5", 
            "review": "beautiful sculpture. This is a wonderful addition to the square by the ferry to Cozumel. We took a great photo of the sun setting inside it."
        }, 
        {
            "index": 226, 
            "rating": "5", 
            "review": "Beautiful Park and Live Atmosphere. Took a nice evening stroll to this park and it was great. Vendors selling fresh fruits and sweets around, families, beach and there's also an evening show. It was fun , i would revisit again."
        }, 
        {
            "index": 227, 
            "rating": "4", 
            "review": "Statue was breathtaking. The satue was the doorway to an awesome beach which the locals seemed to enjoy. We didn't take our suits and wish we would've. It was a Sunday and very busy. We didn't know we could take the ferry across. We will plan better next time. Street shopping was fun. Best tequilas around."
        }, 
        {
            "index": 228, 
            "rating": "5", 
            "review": "Easter fun. We happened to be in Mexico over the Easter break. Lots of fun and excitement on 5th Avenue in particular around the Parque Los Fundadores. They had several different dancers dressed in authentic Mexcian/Mayan Regalia...it was fun to watch."
        }, 
        {
            "index": 229, 
            "rating": "5", 
            "review": "Great place to sit and people watch with some ice cream!. Great sitting area by the beach and Quinta Avenida ! After walking up and down the streets - it was relaxing to sit and people watch for awhile:)"
        }, 
        {
            "index": 230, 
            "rating": "5", 
            "review": "Nice park and beach area. This was quite and nice treat. The children loved the playground, not pictured above. The sand was nice as was the water. The occasional plane taking off from the Playa del Carmen airport made our experiences here more interesting and fun. Know there are places to sit here and places nearby to eat and shop. However, there needs to be a place to wash the sand off your feet after being on the sand."
        }, 
        {
            "index": 231, 
            "rating": "2", 
            "review": "Looks like an afterthought. Dubious artistic quality might once have have been majestic but looks a little degraded as its its surroundings."
        }, 
        {
            "index": 232, 
            "rating": "4", 
            "review": "beautiful giant sculpture full of symbolism. this is a huge sculpture right in downtown Playa , you can see all the symbolic figures that make up the Mexican culture , from Jaguars to modern man...its situated in from of the ocean its always busy with tourist and locals ."
        }, 
        {
            "index": 233, 
            "rating": "5", 
            "review": "Nice Place but bad taste sculpture. I really enjoy visiting playa downtown, this place is very nice, beautiful view and energy, but I didn't like at all the huge sculpture. it just looks tacky, like too much, and not well done. but with out that is a beautiful place to visit."
        }, 
        {
            "index": 234, 
            "rating": "5", 
            "review": "Nice Beach Park. Lots of free entertainment, by the beach. Very crowded. Mayan drummers and dancers in the square. Some Mayan dancers climbed a very high poll and spun around. It was fun, free entertainment."
        }, 
        {
            "index": 235, 
            "rating": "5", 
            "review": "Beautiful spot!!!. We have just returned from Playa del Carmen and loved the Plaza as usual!! The view is incredible!! Lots of shops and restaurants nearby for all to enjoy!!"
        }, 
        {
            "index": 236, 
            "rating": "4", 
            "review": "nice spot. Besides some restaurants in Playa-del-Carmen. It is the front door to the commercial area of the fifth ave if you coming from the beach."
        }, 
        {
            "index": 237, 
            "rating": "4", 
            "review": "Nice day out . Brilliant view in a nice day. Nice to just chill and watch the day go by. A few little shows put on over the day, close to the main shopping strip, on the beach, what more could you ask?"
        }, 
        {
            "index": 238, 
            "rating": "4", 
            "review": "Nice plaza, lots of stuff going on.. This plaza is situated right next to a beach, ferry to cozumel, and an outdoor shopping center. Don't let that fool you, it is a wonderful place to sit, relax, enjoy the sea breeze, and do some people watching. Lots of people go there, either for the free shows (Mayan dance and other cultural stuff). There are also many food stalls around the plaza for you to buy fresh fruits."
        }, 
        {
            "index": 239, 
            "rating": "4", 
            "review": "Wow has this area changed over the last 10 years. Although we have stayed a week North of Playa del Carman about three years ago, I have not been to the ferry dock facility at Playa del Carman for about ten years and WOW has the area CHANGED! NEW NEW NEW NEW NEW everywhere!stumbled across a very colorful (costumes) Mayan ceremony presentation just off the beach under this GIGANTIC bronze statue just up from the beach."
        }, 
        {
            "index": 240, 
            "rating": "5", 
            "review": "Beautiful, expect for the fist fight!!. It is a very beautiful setting. There is a small Catholic church that overlooks the beach. 5th street is great for shopping and dinning. The only downside, was the fist fight that broke out from a few drunk locals. I guess chalk it up to free entertainment."
        }, 
        {
            "index": 241, 
            "rating": "5", 
            "review": "A Wonderful New Symbol for Playa. Finally we have a Symbol for our town and we can be Very Proud\nof it.!!!! Look closely and you will find much detail to outline the\nhistory and growth of our wonderful little seaside town. As you look at other towns.....those that have an anchor or symbol are\nrather ordinary....This is Special !!!!\nJohn.....resident for almost 10 years"
        }, 
        {
            "index": 242, 
            "rating": "4", 
            "review": "great sights. great sculptures and shops. lots of food and drinks. you can spend the whole day here. walking distance from the reef hotel."
        }, 
        {
            "index": 243, 
            "rating": "5", 
            "review": "Go at night. There was an acrobatic show in the middle of the square, and that combined with the lively atmosphere of tourists and locals was a great experience."
        }, 
        {
            "index": 244, 
            "rating": "5", 
            "review": "great beach front.. very cool to see in person. nice beach to swim in. great chinese right in front of monument. great to see if in playa del carmen"
        }, 
        {
            "index": 245, 
            "rating": "5", 
            "review": "Lots of shopping - great ferry ride to Cozumel. Shopped Playa del Carmen one day - lots of american and local shopping to satisfy most. Had lunch at Italian restaurant was pretty good - price was similar to US. Another day took the Caribe ferry to Cozumel for a day of snorkeling. Ferry was nice ride and did not take too much time. Two great days in this area!"
        }, 
        {
            "index": 246, 
            "rating": "4", 
            "review": "LOTS TO SEE AND LOTS TO DO HERE !!!. There's always much to see and do on this Plaza. There are shops of all varieties and usually some sort of show going on with The Voladores or Indigenous Peoples dancing or playing music. Very entertaining but it can get very hectic."
        }, 
        {
            "index": 247, 
            "rating": "4", 
            "review": "Nice Parque. You can go and seat there to watch the different shows at nights and hear the sound of the waves. A lot of tourists and locals also. A friendly environment."
        }, 
        {
            "index": 248, 
            "rating": "3", 
            "review": "way to busy for me.. It was way to busy people asking us to come in some even saying they know us but we haven't been here ever, watch your self.Stay safe"
        }, 
        {
            "index": 249, 
            "rating": "4", 
            "review": "Lots of contrasting elements. Talk about eclectic, this is it... The magnificent Caribbean Ocean to the East, just behind a modern sculpted monument to life...the pole at the center of a cute square, from which 4 men spin around \"flying\" down to the ground...to the West, a beautiful Mediterranean architectural style, Chappell del Carmen, first built of wood, many years ago by the real fishermen who made a living as such...(must go inside and admire it's unique layout and altar), lots of shops, eateries and even a nearby bar or two all around. Only a few steps away the ADO bus station.Take a few minutes, or an hour...or longer, to enjoy it all!! Don't forget your video camera!!"
        }, 
        {
            "index": 250, 
            "rating": "5", 
            "review": "Take this tour with Isreal. Isreal was very informative & we learned so much about Mexico! I highly suggest taking this tour if your in pretty good shape physically."
        }, 
        {
            "index": 251, 
            "rating": "4", 
            "review": "Great Sculpture. Worth going here, to look at the beautiful statue, that forms an arch , in this small park It is directly on the beach. We went to Cozumel on the ferry and you can see it as you leave and arrive at the ferry, it is a wonderful sight."
        }, 
        {
            "index": 252, 
            "rating": "5", 
            "review": "Beautiful at night. Right by the ferri, lots of bars and restaurants around. The sculpture looks amazing at night and if you are lucky enough to see a full moon."
        }, 
        {
            "index": 253, 
            "rating": "4", 
            "review": "Go see. Cost nothing and a great little square near the port. An interesting show as well. Plenty to see, bring your camera."
        }, 
        {
            "index": 254, 
            "rating": "4", 
            "review": "Engaging show. Stopped by to watch shows while out shopping - you could tell the dances had a lot of history behind them - I wish I knew more of the history"
        }, 
        {
            "index": 255, 
            "rating": "3", 
            "review": "Historic port. At the center of Playa del carmen on it's waterfront is the historical Park next to the ferry pier to cozomel. good photo op and beach plyground to stop with the family"
        }, 
        {
            "index": 256, 
            "rating": "5", 
            "review": "5th Avenue. This is a place to see a very Americanised area but be warned you will get pestered a lot and they will try to get as much money as they can so you must haggle & haggle hard you can get some great bargains.Also listen to the comments from the shop owners some of the things they come out with like free Tesco bag no charge."
        }, 
        {
            "index": 257, 
            "rating": "3", 
            "review": "Nothing Special about this park.. This park is adjacent to the public beach in Playa del Carmen. It is crowded and the park is often filled with people drinking. Not very suitable for tourists at all."
        }, 
        {
            "index": 258, 
            "rating": "3", 
            "review": "great place to sit. Shady, secure, great show, beautiful views, on the beach friendly people, grab lunch, sit and eat Fab"
        }, 
        {
            "index": 259, 
            "rating": "5", 
            "review": "Fun place. Nice beach with plenty of shops and places to eat. There are several performers that are fun and interesting to watch."
        }, 
        {
            "index": 260, 
            "rating": "5", 
            "review": "Parque Los Fundadores. This is a nice area to break from shopping on 5th avenue. You can view the dancers dressed in Mayan costumes or watch them climb a pole & spin upside down as they descend. A beautiful entrance to the beach"
        }, 
        {
            "index": 261, 
            "rating": "5", 
            "review": "Nice sight. Beautiful place with some shows and carts with food or things to buy. Very nice sculpture and you can see at the ferry the boats coming or going."
        }, 
        {
            "index": 262, 
            "rating": "5", 
            "review": "A walk down 5th Avenue and Found a Place for a Siesta. A great view of the beach and the ocean with a cooling breeze after walking. A nice place for meeting up and having a rest."
        }, 
        {
            "index": 263, 
            "rating": "3", 
            "review": "Really cool place to visit and explore. The prices are pretty expensive and the street vendors are relentless trying to get you to view and buy their merchandise. But the small restaurants and beach area are amazing. We had the best guacamole ever at a little beachside grill called Mexico Loco with some cervesas for a great price."
        }, 
        {
            "index": 264, 
            "rating": "5", 
            "review": "Very interesting and entertaining. This is the central plaza in Playa and as a result something is always happening there, Mayan wedding ceremonies, dancing, music, etc.."
        }, 
        {
            "index": 265, 
            "rating": "4", 
            "review": "Busy spot, lots of shops and restaurants. We had supper at senior frogs restaurant it was a lot of fun. The food was really good and they interact with their customers in a fun way"
        }, 
        {
            "index": 266, 
            "rating": "4", 
            "review": "Make it a point to hit 5th Ave!. Great time. Went to Senor Frogs which we had a blast!! The staff really knows how to interact with the customers and make the experience worth your wild! Be prepared to have fun!"
        }, 
        {
            "index": 267, 
            "rating": "5", 
            "review": "Super nice area. We seen a show of 4 men sitting up high on a pole playing music. Swung down on ropes to get down. A+"
        }, 
        {
            "index": 268, 
            "rating": "5", 
            "review": "Beautiful sculptures!. This is a nice place to visit - away from all the people who want you to come into their shops. While we were there, there were some Mayan dancers who were pretty good. It was a nice, peaceful break from everything."
        }, 
        {
            "index": 269, 
            "rating": "5", 
            "review": "Cultural Experience. The Mayans perform a daily ceremony to the gods at this location. It is very colorful & interesting to watch."
        }, 
        {
            "index": 270, 
            "rating": "4", 
            "review": "Entertaining!. Always some entertainment happening.....the pole climbers are really something to see. A good resting place after walking 5th Ave."
        }, 
        {
            "index": 271, 
            "rating": "4", 
            "review": "away from crazy shoping. Park is worth a visit for tranquility and nearby beach. Another bonus are performances mostly with traditional dances. I was lucky to see the voladores, flying from the high pool in the middle of the park...."
        }, 
        {
            "index": 272, 
            "rating": "4", 
            "review": "Impressive sculpture. This area is right on the front in Playa Del Carmen. The sculpture dominates the area as well as framing the beautiful white sands of the beach and aquamarine sea. The bronze is pretty impressive and is certainly worth a look."
        }, 
        {
            "index": 273, 
            "rating": "5", 
            "review": "Wonderful public space.. Between the beach and 5th. avenue...night time Mexican Pole show, Mariachi bands...surrounded by restaurants and shops."
        }, 
        {
            "index": 274, 
            "rating": "4", 
            "review": "Fabulous. It is a must to spend a few hrs in this park watching the entertainers perform. We managed to watch the pole performance and the native dance."
        }, 
        {
            "index": 275, 
            "rating": "5", 
            "review": "Go watch the flying Mayan Performance!. Walked to park/beach area from Playacar. This area is a high traffic tourists area. The flying Mayans perform regularly for tips."
        }, 
        {
            "index": 276, 
            "rating": "4", 
            "review": "Interesting place to stop. Stopped here while shopping on 5th Ave, there seemed to be entertainment and lots of shade if you want to give your feet a break and relax. Also beautiful back ground for a picture. There are small shops all around to pick up trinkets or liquor"
        }, 
        {
            "index": 277, 
            "rating": "5", 
            "review": "beautiful beach and lots of action. Playa del Carmen is a great town to walk around and see lots of people and merchants asking for your business. The beach is beautiful and ferries leaving from here to Cozumel"
        }, 
        {
            "index": 278, 
            "rating": "5", 
            "review": "Nice view of the ocean and art of Mexico. This stop was part of a bus tour that we were able to get the history behind each piece of art that is along the boardwalk. The art is interesting and the view of the ocean and city are fantastic."
        }, 
        {
            "index": 279, 
            "rating": "3", 
            "review": "Maintenance?. The sculpture itself is beautiful/amazing! Unfortunately, when we were there, there was no water in the pool and the fountain and lights were not operating. Didn't make for the best photo opportunities but I'm sure when it's running it is incredible."
        }, 
        {
            "index": 280, 
            "rating": "5", 
            "review": "Dancing. This we just happened upon and we started watching the show, music dancing and it was over. the dancers were dressed in feathers and sang and danced to music"
        }, 
        {
            "index": 281, 
            "rating": "5", 
            "review": "It’s one of the primary focal points of the downtown. My wife and I found this eponymous park called Parque Los Fundadores by accident while walking along the beach called Playa Fundadores (aka Playa Piñatas). Parque Fundadores sits right on the beach and commemorates the Founders of Playa del Carmen and is a significant historical location within the city. It’s one of the primary focal points of the downtown draw of tourists from around the world, acting as the epicenter of 5th Avenue and Juarez, as well as the ferry out to the island of Cozumel. There’s your traditional street vendors hawking food, as well as a children’s playground, plus the primary sculpture that fills up they skyline in just about every photo shot taken in this area. There are also several events that take place throughout the day, from the acrobats who scale the pole and slowly lower themselves on ropes as they spin in a giant circle, to the Maya street artists who paint themselves in ritual costumes to perform for the masses. It is also unique in Playa del Carmen in that it is the first beach to feature handicap/disabled access, although beyond that it is your typical tourist beach in that it’s generally full of the average tourist types smoking cigarettes and kicking back a few beers in the sand, taking photos, maybe playing some volleyball or strolling along, and a few people camped out taking in the sun if happens to be out for the day."
        }, 
        {
            "index": 282, 
            "rating": "5", 
            "review": "Perfect picture taking spot. We loved the Myan dancers that performed in the evenings although I'm not sure if they were there every evening."
        }, 
        {
            "index": 283, 
            "rating": "4", 
            "review": "Cultural fun. We been going here for many years and brought some friends who absolutely were amazed by the culture, it's a lot of fun and free to do we been going here for many years and brought some friends who absolutely were amazed by the culture, it's a lot of fun and free to boot."
        }, 
        {
            "index": 284, 
            "rating": "4", 
            "review": "Visit Early Evening. This is a place to visit at around 5pm when the Myan dancers and the ;Bird Men' perform in the square. This is all free and any donations at the end of their performances are greatfully received."
        }, 
        {
            "index": 285, 
            "rating": "5", 
            "review": "A must do while in playa del carmen . This is a park located way at the end of 5th ave near the ferry boats to cozumel lots of entertainment here at different times from the myan rope hanging guys to guitar players shoe shiners always somthing not uncommon to see locals just relaxing in the park people watching theres also great sculptures a huge one and the beach is right there too"
        }, 
        {
            "index": 286, 
            "rating": "5", 
            "review": "the start of the 5th ave promenade. A very landmark to meet the gang when it gets busy in Playa on 5th avenue. This public square is at the start of the 5th avenue promenade and can get busy because of the Cozumel Ferry Pier."
        }, 
        {
            "index": 287, 
            "rating": "4", 
            "review": "Well worth the experience. You just have to say no thank you to all the touts, be determined as to what you want to look at. Some very expensive shops there but shop around whatever you want to buy."
        }, 
        {
            "index": 288, 
            "rating": "5", 
            "review": "All I can say is wow, Entertaining.. This was Fun,  I was exhausted just watching, Get a front row seat!!The costumes are pretty cool, and the dancers give it their all.And with the exchange rate the way it is, you can afford to leave a tip !!"
        }, 
        {
            "index": 289, 
            "rating": "3", 
            "review": "Crazy walk down 5th ave. Well if you like being approached to buy crap, this is the place for you. While it I fun to walk down 5th ave ending at the Parque Los Fundaores, get ready for the locals to get you to buy things. There were hundres of people there , watched a traditional poll swinging act, but know that if you watch, you are somewhat expected to donate money for the \"free\" show. I would recommend it if you have a high tolerance for wheeler and dealers."
        }, 
        {
            "index": 290, 
            "rating": "5", 
            "review": "Always something going on. The park has plenty of vendors selling fruit and candies. Several times during the week a performance by Xcaret with people dressed as Mayan Indians, there is also a performance by the Papantla Flyers, they are dressed in brightly colored costumes and climb a pole and end up flying around the pole attached by rope. They do come and ask for donations after their performance and the Mayans will let you pose for pictures with them also for a donation."
        }, 
        {
            "index": 291, 
            "rating": "5", 
            "review": "Nice day. We had a great day exploring and looking at the stores. Was time well spent and a break from the Hotel. We ended up at SR. Frogs for a beer. Great afternoon."
        }, 
        {
            "index": 292, 
            "rating": "5", 
            "review": "Intesting statue and lovely beach. The statue has many very interesting features and is close to the beach and the boat ferry to go to Cozumel."
        }, 
        {
            "index": 293, 
            "rating": "5", 
            "review": "Great Place. Loved all the shops, and just amazing to see, would go back in a heart beat! People very friendly, and felt really safe! Go to FAT Tuesdays!"
        }, 
        {
            "index": 294, 
            "rating": "4", 
            "review": "Make Sure To Stop Here. Grab a coffee from Starbucks or a beer from a local store and have a break from walking. You can also enjoy watching a traditional dance, it's free to watch but they do like a tip!"
        }, 
        {
            "index": 295, 
            "rating": "5", 
            "review": "It's all here... sun, sand, surf, music. Frankly I got a bit tired of the chaise lounge territorial games at our beach club. (not their fault, I have since learned that much of the beach had washed away and they had less chairs and what was left was stacked like sardines). I packed up my gear and headed down the beach toward the ferry terminal. I came upon this really cool (HUGE) sculpture and also noticed there were no beach clubs here, just folks lying in chairs and towels. I plopped my stuff down and went for a swim. Great waves here for body surfing. Clean water, no seaweed or litter, and you can hear some of the music from a nearby club depending on how close you are. It's public, free and lovely. Lots of room even on the weekends. I ended up here more than our beach club for the past 2 weeks. When I got thirsty, I could grab some sodas or beers a couple hundred yards away at the mini mart type store. Very laid back."
        }, 
        {
            "index": 296, 
            "rating": "4", 
            "review": "Great, traditional style, entertainment!. Totally worth stopping by the park in the late afternoon/early evening to see some of the entertainment. Very beautiful and powerful stuff.. not to mention free - although it's great to tip if you can!"
        }, 
        {
            "index": 297, 
            "rating": "4", 
            "review": "Worth the trip. Great way to spend a couple of hours enjoying the sights, people watching and doing a little shopping. I would also recommend a visit to a local establishment for taste of local tequila."
        }, 
        {
            "index": 298, 
            "rating": "4", 
            "review": "5th Avenue Park. Great way to spend a couple of hours shopping on 5th Avenue, then walking over and relaxing at this little park with a great view."
        }, 
        {
            "index": 299, 
            "rating": "4", 
            "review": "Free and shopping!. While 5th avenue has many of the shops you will see at home, if you have pseos its a lot cheaper.Walking through the shops takes you to more individual tourist shops of which some are quite interesting. Places to eat and drink and a large square where you can watch free local entertainment while being near the sea."
        }, 
        {
            "index": 300, 
            "rating": "5", 
            "review": "Great Culture Experience. We watched a Mayan Dance and Cultural Program-- Excellent and beautiful at sunset after a great meal."
        }, 
        {
            "index": 301, 
            "rating": "5", 
            "review": "Great relaxing park to see the local flair.. Right on the beach stands this statue that is 50 feet high, shows a man and a woman, being whisked upwards by a spiral of wind and water holding hands. All around the spirals, are sculptures that include depictions of other elements important to the area including a jaguar, sea shells, Mayan from the past and present, and two rings from the Mayan ball game"
        }, 
        {
            "index": 302, 
            "rating": "5", 
            "review": "Nice place. This gives a beautiful view, the photo is important to take a peace of Playa del Carmen. The th avenue is right next to this incredible place and of couse the beach and ferry for Cozumel"
        }, 
        {
            "index": 303, 
            "rating": "5", 
            "review": "Nice area . Nice area with Mayan show right at the south end of town by Cozumal ferry station. Worth a visit when in town"
        }, 
        {
            "index": 304, 
            "rating": "4", 
            "review": "Nice place to relax and experience some Mayan tradition. This is an open park, downtown in front of the beach. There was a dance troupe in colorful costumes performing when we were there. They also have those high towers with people spinning around... a nice, free cultural experience."
        }, 
        {
            "index": 305, 
            "rating": "3", 
            "review": "Turicstic zone.. There are many shops, noise, salesmans., I don´t like it.If you need something to buy, it is goog place."
        }, 
        {
            "index": 306, 
            "rating": "4", 
            "review": "gateway to the sea. very interesting and wonderful pictures, you can see Cozemel and has a very nice park to relax and watch entertainment."
        }, 
        {
            "index": 307, 
            "rating": "3", 
            "review": "Pretty beach, nothing on Australia. I was recommended Mexico by many friends raving about the beaches of Playa, tobe honest Australian beaches beat this section of coastline hands down. 5th Ave is busy, but keep your wits about you regarding shopping and bagging a bargin. I found going into the larger supermarket- type tourist shops better, fixed prices and you don't have to barter. Food is good and great deals to be found. Nice social environment. Be careful not to be scammed about taxi's to return you to your hotel, fix the price BEFORE you get in. 5th ave to Xcaret area should be approx $15 USD."
        }, 
        {
            "index": 308, 
            "rating": "5", 
            "review": "Simply Stunning!. This entranceway to the beach is stunning, but pales in comparison to the beach itself. An absolute must see to anyone visiting the area!"
        }, 
        {
            "index": 309, 
            "rating": "5", 
            "review": "Great Little Park. During our week in Playa we found our way to this park practically every day. One night there was a Mayan fire show that we sat and enjoyed with locals and tourists alike. It was really nice to sit and watch with kids playing in the area and people hanging out eating ice cream or fruit from the nearby fruit vendors, kind of reminded me of old ice cream socials in my community on fourth of july as a kid. Another afternoon we wandered by and stopped to watch Mayan pole flyers performing. Just a great little gathering place to catch different things happening at different times. The fruit stands nearby are amazing too. I went to them almost daily on the trip to buy a cup of fresh cut fruit assortments to have as breakfast at the hotel the next morning since we were leaving too early every morning for dive trips to enjoy the hotel's breakfast. The fruit was always really fresh and tasty as well as really cheap."
        }, 
        {
            "index": 310, 
            "rating": "5", 
            "review": "Gorgeous spot!. Love seeing these mermaids when I visit! Soft sandy beach with lots of food options beachfront, great shops all on 5th Ave, and they do a 1pm show with costumes and climbing up the pole to music, super cool to experience."
        }, 
        {
            "index": 311, 
            "rating": "3", 
            "review": "Nice little beach park. Nice little beach park where the locals come and sell there good's and put on little shows with music. They also have little stands to buy food and drinks.Nice to see the local people our to walk to the ocean and put your feet in the warm water with the soft white sand between your toes...."
        }, 
        {
            "index": 312, 
            "rating": "4", 
            "review": "this was right where we got off the boat that took us to some of the islands.. IF YOU LIKE going where the people go and believe me there were lots of people there , you will get to watch the outside activities that folks all seem to like."
        }, 
        {
            "index": 313, 
            "rating": "4", 
            "review": "Good for an hour,. Nice park , lovely little church on the left hand side , sometimes with entertainment , good to rest an hour after your shopping trip , but not more , don't forget to take some pictures for your Facebook , lol yes and a selfie ,😂😂😂"
        }, 
        {
            "index": 314, 
            "rating": "4", 
            "review": "Nice place to sit for an hour or so. Good place for people watching. There was also a dance troupe dancing Mayan style. Not sure what the significance of the statues is, but a pretty impressive work in bronze? Nice location next to the beach."
        }, 
        {
            "index": 315, 
            "rating": "4", 
            "review": "5th Ave shopping a must!. We took a taxi from our resort to Playa del Carmen for the day to shop, sight see, people watch and walk the beach. The taxi's are safe and affordable"
        }, 
        {
            "index": 316, 
            "rating": "4", 
            "review": "Interesting, hopping park and beach.. Check out the park, but the restaurants right on the park a bit too touristy and pricey. Lots of diverse people in the park."
        }, 
        {
            "index": 317, 
            "rating": "4", 
            "review": "Nice to walk through. Happened to pass by and snap a picture while touring 5th Ave. There was a show going on with who I believe was a Native American man dancing and placing his feet in fire. We also stopped by a cart here where they were selling sliced mangos with lucas (spicy seasoning) on it. That was tasty and cheap!"
        }, 
        {
            "index": 318, 
            "rating": "4", 
            "review": "Centre stage, Fifth Avenue. This is a great area to visit to see the local Mayans perform their native dances, watch as they perform on a pole high above the square and just gaze over the waters to Cozumel. Don't forget to visit the beautiful little church at the edge of the square..."
        }, 
        {
            "index": 319, 
            "rating": "4", 
            "review": "Beautiful beach and surrounding area. Just off 5th Ave ... worth the stop to look around and explore :) There's often locals selling various products and snacks as well as great photo ops"
        }, 
        {
            "index": 320, 
            "rating": "4", 
            "review": "Lovely day in Playa del Carmen. This beautiful park on the beach in Playa del Carmen is just one of the many hilights of this beautiful destination city."
        }, 
        {
            "index": 321, 
            "rating": "3", 
            "review": "Nice park. We've been to this park several times and it's always been crowded. I don't think it's a place I'd want to park myself for anymore than an hour. Last time we were there (Oct 2015) it was under some type of construction."
        }, 
        {
            "index": 322, 
            "rating": "5", 
            "review": "Day Trip to Playa. One tip, if you are in a resort, hide your resort wristband, all the shop owners are your waiters (so they say - only recognized one of them)!"
        }, 
        {
            "index": 323, 
            "rating": "5", 
            "review": "Lovely park in Playa. We always enjoy visiting this lovely park area. It attracts many visitors for its beautiful beach, music and entertainment, darling shops and vendor area and food vendors. We've enjoyed live music, Mayan dancers, aerial trapeze artists, gorgeous kite-flying and have also attended Sunday Mass in the quaint chapel nearby."
        }, 
        {
            "index": 324, 
            "rating": "4", 
            "review": "Artisans and performers abound! But beware.. A few steps from fifth avenue and you are at a unique popular park overlooking the beautiful Caribbean. Here you will find a mix of local performers and artisans putting their talents on display for you hoping for gratuities. A great place to have an ice cream cone or a snack while you sit back and watch the traditional ceremonies and other performances. Be aware that the locals know this is a spot where tourists relax and are preoccupied with the performances so make sure and keep your valuables secure. Since. phones and cameras disappear in seconds. I was at Playa about six years ago and since then I noticed the theft has gotten much worse. Somehow in Playa my credit card info was electronically pick pocketed. I did not use a credit card sleeve protector and I found out the thieves can buy a devise online for under $100.00 that picks up credit card information right out of your pocket from up to 25 feet away without even knowing it. I was also surprised at how often storekeepers and gas stations tried to steal by trying to tell me the wrong dollar/peso conversion. So, enjoy but be smart and alert! Thumbs up if you found this helpful. Go forth and vacation!"
        }, 
        {
            "index": 325, 
            "rating": "3", 
            "review": "5th ave. great for shopping good deals .but beware they will all want you to come into there stores and some can get mean and call you names just say no thanks and keep walking.. great just to go and see 5th ave."
        }, 
        {
            "index": 326, 
            "rating": "3", 
            "review": "shopping lol. My 1st time to the caribean side.bring lots of spending money and tip money seams like eveything is twice as much as it should be.everyone has a hand out for a tip."
        }, 
        {
            "index": 327, 
            "rating": "4", 
            "review": "The one place we enjoyed in Playa!. We are not big fans of Playa del Carmen. It is just too touristy and we felt like people were constantly bombarding us! We did however, enjoy this area. We felt like we could relax and enjoy people watching and the views."
        }, 
        {
            "index": 328, 
            "rating": "5", 
            "review": "5th avenue. this place was amazing all kinds of shops,bars, etc. took a taxi to here cost was $7 in us money. had a good time walking around 5th avenue. bought some items to bring back home."
        }, 
        {
            "index": 329, 
            "rating": "4", 
            "review": "Walkable beach. A beautiful beach front to walk, sit, rest and just enjoy the ocean. There are reasonable massages on the beach front asa well."
        }, 
        {
            "index": 330, 
            "rating": "5", 
            "review": "people watching. The parc is a great place to sit and people watch, locals and tourists alike. You don't want to spend hours there but a few minutes sitting on a bench every now and then is fun."
        }, 
        {
            "index": 331, 
            "rating": "5", 
            "review": "Great area. Love the area. Beautiful sightseeing and great shopping area. Many restaurants to check out as well."
        }, 
        {
            "index": 332, 
            "rating": "4", 
            "review": "Can't miss it it's that big. This is in the Centre of Playa Del Carmen on the Beach. Watch out for the Mayan show and pole Divers around about 12 and 5:30"
        }, 
        {
            "index": 333, 
            "rating": "4", 
            "review": "Party Playa. There is always something fun and exciting to watch while touring around Parque Los Fundadores. It is always a colorful, musical and cultural experience. There is something for everyone."
        }, 
        {
            "index": 334, 
            "rating": "5", 
            "review": "Beatiful. An amazing place to spend the day with you family or couple\nEnjoyed eating the mangos on a stick\nCheck it out!!"
        }, 
        {
            "index": 335, 
            "rating": "4", 
            "review": "Lovely time in Mexico. Nice shop area and beach around and lots of restaurants were u can try all type of food and drinks,.;)"
        }, 
        {
            "index": 336, 
            "rating": "4", 
            "review": "Quaint little park to enjoy while you're heading to the beach or waiting on the Ferry.. I loved the centerpiece to the Park. Very lovely. I only casually walked by the park, during one of my walks along the beach. A nice little place to relax before the Ferry comes or like I did, as a little something extra to do, while enjoying a nice walk on the beach enjoying the surf and sand!!!"
        }, 
        {
            "index": 337, 
            "rating": "4", 
            "review": "nice gate to the ocean. I was there in the early morning so there was not so many people, watching people reading under the status and the dog running around, it was very nice to see normal people's life there"
        }, 
        {
            "index": 338, 
            "rating": "5", 
            "review": "fun shopping. We like going down fifth to shop. But a lot of the store owners are getting more grabby. They don't like it when you say no. But otherwise we do like going there to shop."
        }, 
        {
            "index": 339, 
            "rating": "3", 
            "review": "A nice area to check out - seenic, right on the ocean.. It was raining a lot the entire time when we were there. I wished we could have hung around to take picture."
        }, 
        {
            "index": 340, 
            "rating": "3", 
            "review": "Pretty sight. Nice park. Many times you can catch a folkloric show or music. Expect to make a donation but it is woth it."
        }, 
        {
            "index": 341, 
            "rating": "4", 
            "review": "Go here but walk past the ferry pier and past senor frogs for about 10 mins and there is beautiful unspoilt beaches. Go here but walk past the ferry pier and past senor frogs for about 10 mins and there is beautiful unspoilt beaches. Buy a bottle of beer from the local shop at the Cozumel ferry pier and walk up. You won't regret it! Only a few private villas share the beach with you"
        }, 
        {
            "index": 342, 
            "rating": "5", 
            "review": "relaxing. went for a walk and came across this great sculpture and it was noce just to hang out and soak in the community at the beach. went back at night and there were stories and fire displays being put on by the locals dressed as tribesman"
        }, 
        {
            "index": 343, 
            "rating": "4", 
            "review": "Shops shops. Lots of shops high end and souvenirs galore. Nice beach and things going on. Ferry terminal . Worth a look"
        }, 
        {
            "index": 344, 
            "rating": "5", 
            "review": "special attraction. a place in the Middle of 5th avenue with a public beach near. special structure in metal I think..a lot of visitors were there."
        }, 
        {
            "index": 345, 
            "rating": "4", 
            "review": "Restful and Beautiful. Safe, clean and not far from the 5th avenue.\nLack of spots to sit and rest (to have a lunch..)\nNice beach near by."
        }, 
        {
            "index": 346, 
            "rating": "3", 
            "review": "lots of bargins. lots of bargins but you are not left to look on your own they do rester you a lot best way to pay was Mexican money"
        }, 
        {
            "index": 347, 
            "rating": "5", 
            "review": "Nice day out to Playa Del Carmen. It's was a bit rain this day and we decided to go to Plaja Del Carmen to see local people life ,it's nice there ,just all guys from the shops around so noisy ,and always touch you ,do not like this ,I understand they try to sell for turist and earn money ,but not like that ! My advise will be if you going for souvenirs you can always have half price of asking price , do not pay straight away ,go for half,it's works !"
        }, 
        {
            "index": 348, 
            "rating": "4", 
            "review": "Fun meeting place. This is a nice place to sit and watch people take photos of themselves. We saw some dancers there who were average, but lent to the native charm of the place. There are many shops around with everything from high end items to souvenirs. It is quite close to the ferry dock and the colectivo hub in Playa."
        }, 
        {
            "index": 349, 
            "rating": "5", 
            "review": "playa del car downtown. Amazing place to visit, very close to resort we stayed.Becauseful place to go for window shopping. Lots of activities throughout the day, hiphop, mexican dance etc."
        }, 
        {
            "index": 350, 
            "rating": "5", 
            "review": "busy place. Great place to have a beer and people watch. A lot of chatty vendors wanting you to buy there stuff. Some very interesting people at night like I said a great place to relax and people watch"
        }, 
        {
            "index": 351, 
            "rating": "5", 
            "review": "romantic. my wife and I was shopping on 5th ave when we came across this beautiful picturesque area and it leads down to the beach and the views where just fantastic, at the same time there was a show going on for anyone to watch but be prepared to put your hand in your pocket because they ask for donations (the show was fantastic, this is a great area for photo's"
        }, 
        {
            "index": 352, 
            "rating": "3", 
            "review": "Nice sculpture. We did catch the aerobats in the park, but it wasn't very significant. The park was a little dirty. There was a sand pit around the children's equipment but the sand was not very safe for kids to play in. Lots of debris."
        }, 
        {
            "index": 353, 
            "rating": "5", 
            "review": "Beach at Playa del Carmen. This is a beautiful area. We have been here when the locals have sand sculptures - something to definitely take in if you can! The sand in absolutely wonderful, as is the scenery."
        }, 
        {
            "index": 354, 
            "rating": "3", 
            "review": "Nice park. This is a really small park but you can find many things on the sorroundings, like the beach, stores, local fruit vendors, a little chapel and there is a show (voladores de Papantla), a shopping center and is very close to the ferry port that goes to Cozumel."
        }, 
        {
            "index": 355, 
            "rating": "3", 
            "review": "Tourist Hub. Nice open square overlooking the sea and backing onto 5th Avenue. Comes alive as the sun goes down with plenty of music and dance shows to see in front of the statues."
        }, 
        {
            "index": 356, 
            "rating": "4", 
            "review": "Fun evening. This is a great place to hang out and enjoy being part of the crowd. Vendors barking catchy comments trying to lure you in to buy souvenirs. It's a strange area where high end shops share space with MA & PA stores. Shop around before you buy anything and don't forget to haggle down the price. Everything here can be talked down by close to half. You can catch a bus from your hotel usually tv about 20-30 pesos a person. Just catch it at the enter to your resort and ride in to town. You can also catch a taxi if your not adventurous enough for the wen bus.There really is a lot going on"
        }, 
        {
            "index": 357, 
            "rating": "4", 
            "review": "Picture perfect. Great place to take pics right by the ferry Doc. Close to the noreigen cruise ship doc also. Plenty of food and shopping near by"
        }, 
        {
            "index": 358, 
            "rating": "2", 
            "review": "Tourist Bazzar. We went shopping here - didnt buy anything - expect dinner. Was overwhelmed by the shouting vendors and attempts to get you into the shops. Very touristy. Not my scene."
        }, 
        {
            "index": 359, 
            "rating": "5", 
            "review": "Mayan Dancing & Indiginous spectacles. The only part of Playa where real Mexican culture florishes... You can see an Indiginous show of music, dance, and flying... and Mayan fire ceremonies reanacted in the eve. I love it."
        }, 
        {
            "index": 360, 
            "rating": "4", 
            "review": "5th Ave is great place to visit. Shopping, restraunts, bars, & people watching! It all can be found here. We love visiting the stores & picking up trinkets. Don't be afraid to haggle over prices, they will always drop their asking price. We also enjoy the sites of 5th Ave., and love to visit one of the sidewalk cafes & people watch."
        }, 
        {
            "index": 361, 
            "rating": "4", 
            "review": "nice walk. We went there for a walk every day. There was a show with indians some days. It is located next to the harbour to Cozumel."
        }, 
        {
            "index": 362, 
            "rating": "4", 
            "review": "Downtown. Really cool area for shopping and walking around taking in the sights. After a walk down 5th avenue, this is along the ocean and beach"
        }, 
        {
            "index": 363, 
            "rating": "4", 
            "review": "Noisy place. There are a lot of people and they make a noise :) if you like being in crowd, you should go there ;) beach isn't good near ("
        }, 
        {
            "index": 364, 
            "rating": "4", 
            "review": "nice park plaza. they have a mayan Indians doing an awesome show five climb a large poll. four of them tie ropes on leg and slowly swing around and come down the fifth one plays a drum on top"
        }, 
        {
            "index": 365, 
            "rating": "4", 
            "review": "Family Fun. Take the kids for the day and experience art on the beach. public bath rooms and plenty of restaurants and shopping in the area. The beach here is awesome - perfect sand and water temp of about 87 degrees. Only need to pack your sunscreen and camera! SALUD!"
        }, 
        {
            "index": 366, 
            "rating": "4", 
            "review": "Beach was extremely crowded. We were here New Year's Day and the place was extremely crowded! Of course we still enjoyed our day but it was crazy busy. We caught the tail end of the Mayan Show and the guys who go up the pole and swing down on ropes. My husband and son enjoyed some fresh mango and a coconut."
        }, 
        {
            "index": 367, 
            "rating": "5", 
            "review": "Love the history behind the statue. We have a bike tour with our guide tour Lois he is excelent guide also very friendly and seem know all the history behind the statue excelent place"
        }, 
        {
            "index": 368, 
            "rating": "4", 
            "review": "Stopped by on our way to Cozumel.. Very nice beach and place for local atmosphere. There are many places to shop and a great beach to walk upon."
        }, 
        {
            "index": 369, 
            "rating": "5", 
            "review": "Beautiful Statue, Local Flair. Steps from the beach, just north of the ferry to Cozumel, the Parque Los Fundadores is a great spot to spend some time taking in the scenery. Beautiful view of the beach in one direction and a taste of local life in the other. The north border is lined with fruit stalls selling fresh pineapple, watermelons, etc., for just a few pesos. The statue at the east end of the parque serves as a sort of window to the sea, and frames the view of the Caribbean perfectly. It looks particularly beautiful at night with a full moon lighting the sky and reflecting off the water. Take a few minutes to check this area out, and most evenings you'll find music and dancing in the Mayan custom, including performers dressed in ornate headdresses."
        }, 
        {
            "index": 370, 
            "rating": "4", 
            "review": "Just next to Fifth Avenue. In the most centre of Playa, you will find this beautiful park. Just next to the beach. You can relax there and take a picture in front of the sculpture"
        }, 
        {
            "index": 371, 
            "rating": "4", 
            "review": "At the beach. At night a local show with fire and dance is performing they are very good and play music on droms too."
        }, 
        {
            "index": 372, 
            "rating": "4", 
            "review": "5th Ave shopping. shopping and dining on 5th ave is fun but be careful of merchants claiming to 'work and remember you' from your hotel because they see it on your wrist band!!"
        }, 
        {
            "index": 373, 
            "rating": "5", 
            "review": "Had to see this it wasn't disappointing. My hubby really wanted to see this so we did and it was aweosme and the beach was great too, and cool to see the ferries that went across to Cozamel"
        }, 
        {
            "index": 374, 
            "rating": "4", 
            "review": "A vibrant plaza right off the beach.. Full of life, vendors, street foods, hawkers - fun and full of life. Especially fun to visit at night. Have a great time."
        }, 
        {
            "index": 375, 
            "rating": "4", 
            "review": "The birdmen. happened to be in the Parque around 6pm when the Birdmen display was happening, very cool to watch the performers descend to the ground by way of a rope tied around their legs. a must see in Playa del Carmen"
        }, 
        {
            "index": 376, 
            "rating": "4", 
            "review": "Stop by for some free shows on your walk downtown. Park at the end of 5th avenue, by one of the main piers to Cozumel. They have two free shows featuring indigenous Mexican Indian dancing. One is very dramatic and features dancers spinning in the air from a tall maypole style post. The other is more of an Aztec style dance with drums. Both are very entertaining and free. Also around the square is some decent souvenir shopping and food. On one end is Senor Frogs on the beach. Touristy type place, but actually has decent food and one of the few restaurants on the beach (outside of beach clubs)."
        }, 
        {
            "index": 377, 
            "rating": "4", 
            "review": "Beautiful statue.. Saw this beautiful, breath taking statue on the beach at 5th Avenue shopping centre in Playa de Carmen."
        }, 
        {
            "index": 378, 
            "rating": "4", 
            "review": "Great place ofr a time out. Access to the beach, a playground for the kids (who are probably sick and tired of all the shopping and being good), and street entertainment of the most epic proportions."
        }, 
        {
            "index": 379, 
            "rating": "2", 
            "review": "Very few investment. Being a famous spot it should have a lot more investment, the local government headed by the CORRUPTED PRI is destroying Playa del Carmen"
        }, 
        {
            "index": 380, 
            "rating": "5", 
            "review": "Nice to see. Beautiful spot to take pics. Right next to the Cozumel ferry. Lots of places to shop. Senior Frog is also a nice place to ear and have a marguerita."
        }, 
        {
            "index": 381, 
            "rating": "5", 
            "review": "Very nice park. Nice park and going down to the nice turquoise water. Usually there are people doing some shows, tricks or like the Voladores from Papantla, Veracruz, people with nice little things for us to buy, for us or for souvenirs."
        }, 
        {
            "index": 382, 
            "rating": "5", 
            "review": "Very nice place to watch some local street shows. I went for a walk in Quinta Avenida and found this amazing spot. Some local artists were singing and dancing what seemed to be from Maya origin. It seems to be a spot where there is usually something going on and totally worth checking out. It's just on the west end of Quinta Avenida so you can't miss it."
        }, 
        {
            "index": 383, 
            "rating": "4", 
            "review": "Great place to hang out. Great place to hang out if you get tired walking the Avenida. There are ferries going to Cozumel and don't really know the schedule but the times that we've gone to the Avenida they have the Mayans with costume on, performing on the pole. Don't really know the height of the pole but they were playing the flute and they go down by the belt on their waistband. There's a Catholic Church next to it and if you want some fresh coconut juice right out of the coconut, this is the place to go. The little carts with fruit and drinks are everywhere at this place."
        }, 
        {
            "index": 384, 
            "rating": "5", 
            "review": "Beautiful Beach. Beautiful beach with a variety of restaurants directly on the beach where you can use their lounge chairs if you drink/eat there. If you don't want to do that just put your towel on the beach and enjoy."
        }, 
        {
            "index": 385, 
            "rating": "4", 
            "review": "Lots of places to spend money!. Playa del Carmen is growing and has a lot of shopping on 5th ave. Just a block away it is still growing."
        }, 
        {
            "index": 386, 
            "rating": "5", 
            "review": "My destination. I saw this picture and thought it was beautiful but did not expect to actually be blessed to see it up close and personal so it was a 5 star for me thank you Lord for the opportunity"
        }, 
        {
            "index": 387, 
            "rating": "4", 
            "review": "Fun but sketchy. We went to this area and the surrounding markets twice during our stay, both times around sunset. There are many different kinds of interesting shops- we bought some unique souvenirs. We saw mimes, dancers, and other street performers. It was really cool! The only drawback- after dark, several different people offered us lots of different kinds of drugs (and samples of them) as we were walking by. I just don't feel very safe where people are peddling heroine, ya know? You should be safe as long as you bring a buddy and don't follow them down the sketchy alley."
        }, 
        {
            "index": 388, 
            "rating": "5", 
            "review": "Strategic location. It is on the beach next to the ferry to Cozumel, bus station to Cancun, and the legendary 5th avenue. Playground for the kids and shops all around. This is a must visit."
        }, 
        {
            "index": 389, 
            "rating": "5", 
            "review": "A great place to rest awhile, take in the scene. I love hanging out at Parque de los Fundadores. The Voladores de Papantla take turns performing with the Mayan dancers on the beach nearby. There are shops and restaurants around the park and you can see people going and coming, to and from the ferry dock and the ferries themselves. It's a great place to relax, people watch and enjoy the ocean breeze."
        }, 
        {
            "index": 390, 
            "rating": "5", 
            "review": "Unbelievable Statue. Great park or zocalo near the ferry dock with unbelievable statue not to be missed. Sometimes there is music in this square and they have the guys that climb up the pole and then tie ropes to the feet and come down upside down and go round and round the pole to the ground."
        }, 
        {
            "index": 391, 
            "rating": "3", 
            "review": "Great park.... Lots of events happening in this little park. Close to the ferry and 5th avenue. Food, picnics, and shopping nearby. Added bonus was some locals artists practiceing there trade."
        }, 
        {
            "index": 392, 
            "rating": "4", 
            "review": "town travel. beautiful area....and you can catch a ferry over to Cozumel....We tried but the water was too rough so we just stayed in town and shopped."
        }, 
        {
            "index": 393, 
            "rating": "5", 
            "review": "Great Family area. Its a great area for shopping, getting local snacks, as well as a good family area. It has a small obstacle/ playground area for kids. With some decent inexpensive restaurants nearby. The ferry to Cozumel is close by as well as various shopping areas. They also have local performers at this location"
        }, 
        {
            "index": 394, 
            "rating": "4", 
            "review": "Well if you are in Playa you should see the Parque. Very nice views. It is the most touristy spot in the area. There was one store that had UPC codes on their items so the price was the price without any haggling. That is nice. The beach looked good for swimming compared to a few spots along the coast."
        }, 
        {
            "index": 395, 
            "rating": "5", 
            "review": "Wonderful Scenery. This location is fun to be when they start to dance folkloric. In General this location surrounded by many stores and also close to Ferry."
        }, 
        {
            "index": 396, 
            "rating": "5", 
            "review": "our trip to fifth avenue. it was just beautiful lots to see beautiful people lots to look at so many markets and cafes. there is a reasterant that has a tree that has grown up in the middle od it that has hotel rooms that are off on that branches its like a tree house reasterant it is so cool"
        }, 
        {
            "index": 397, 
            "rating": "3", 
            "review": "Pretty location. The beach is great. The children's park needs better upkeep.. Great walking trip from PDC. You can either go up 5th ave or walk the beach (or both!) Gave my 3yo a place to crawl and play. The church near by is lovely."
        }, 
        {
            "index": 398, 
            "rating": "4", 
            "review": "The local shopping. I like fifth avenue but it looks like they will be doing considerable upgrades to the area. There were blocks of buildings under construction with upscale store names featured as the coming tenants.It can be an irritation walking along the street as the vendors are constantly calling to you to come see their goods. They know as well as I do that they all have pretty much the same stuff, supplied by the same companies with money paid to the same organizers. I just got plain tired of hearing the same calls over and over again.Being on fifth avenue on Halloween was a very unique experience and a good one in that there were so many people the vendors really couldn't do their calls and target you directly. Staying in the middle of the street also helped keep them at bay.I don't think I will ever be able to fully explore the avenue as I don't walk as well as I used to so we only got about 8 blocks from the Playacar Palace and returned. I am looking forward to sampling some of the local restaurants on the next trip."
        }, 
        {
            "index": 399, 
            "rating": "5", 
            "review": "This area was filled with beauty, sounds and culture!. I had seen this statue on a review or website prior to my trip and was determined to make it to it. We got to this point right as the sun was setting. There were several street performers that were beautiful and amazingly talented; I believe they performed just for tips so we were happy to throw a few dollars in the basket as the person came by because they put on a cool show. This was a beautiful place to just sit and listen to the ocean, the sounds of music, meet people or just relax while shopping. The beach here was beautiful as well. We didn't get in the water here but several people were int he water even after dark. You could see the lights of Cozumel from the beach and that was pretty awesome."
        }, 
        {
            "index": 400, 
            "rating": "4", 
            "review": "Beautiful. very crowded but nice area to meet, to shop, rest, take pictures or just people watch. be mindful however that locals will approach you constantly trying to sell something/everything"
        }, 
        {
            "index": 401, 
            "rating": "5", 
            "review": "The men on the pole. Every day there is a production which is staged several times. It is an ancient Mayan dance - done by 5 men. It is free to public - and very worth watching. These 5 men climb a pole which is about 50 feet in the air, and then swing down, upside down!"
        }, 
        {
            "index": 402, 
            "rating": "4", 
            "review": "Nice little parc. this parc have to offer a lots,full of shops nicely done shoping mall with brand name stores,have playas near the Cozumel ferry lots of foreigner peoples entertainment waching them"
        }, 
        {
            "index": 403, 
            "rating": "5", 
            "review": "good. good to have a nice time watching the mayan show the dancers who fly from a post attached to a rope ."
        }, 
        {
            "index": 404, 
            "rating": "4", 
            "review": "Beautiful landmark. There were performers and such there, which made it pretty fun. The shopping here is awesome. I took a picture here that is now the desktop on my computer screen!"
        }, 
        {
            "index": 405, 
            "rating": "5", 
            "review": "A Must Visit. Always Something happening, here in this wonderful square of Parque Los Fundadores. Located next to the ferry, that goes back and forth from Playa Del Carmen to Cozumel. Don't forge to bring your sunblock and comfy shoes."
        }, 
        {
            "index": 406, 
            "rating": "5", 
            "review": "stop over. Nice little park to stop by on the way to the ferry to Cozumel Great place to just sit and people watch"
        }, 
        {
            "index": 407, 
            "rating": "4", 
            "review": "Good people watching area. The town square near the cozumel ferry is a hive of activity. It is at the far north end of 5th ave. There are shows/entertainment in the square, places to sit & people watch & the huge statue to view & watch the ferries come & go. Go & see the statue as the sun rises & it looks like the statue figures are reaching for the sun. Hawkers are everywhere so just say 'no gracias' & don't make eye contact unless you are interested."
        }, 
        {
            "index": 408, 
            "rating": "5", 
            "review": "Shopping. Great shops and such a wide variety but prepare to be approached by most shop keepers to get you into the shop also people on the street saying they've met you before as its a ploy to get you into a shop and learn to haggle over prices keep all this in mind and you'll have a great time x"
        }, 
        {
            "index": 409, 
            "rating": "5", 
            "review": "Beautiful view. Had the opportunity to see this beautiful sculpture during my first trip into the city. There were Voladores performing in the square which was quite a treat. Locals were hanging out, tourists taking it all in. It was quite the microcosm."
        }, 
        {
            "index": 410, 
            "rating": "3", 
            "review": "Park at the end of 5th Ave. This park is where 5th Ave and Benito Juarez meet. Its also right beside the place where you can catch the ferry to Cozumel. The sculpture is interesting, but nothing mind-boggling. There are lots of benches to have a seat and read a book, however unfortunately every 30 seconds you will be bothered by some hawker trying to sell you jewelry, ice cream, tours, etc. There is no peace to be had here. Plus when I was here the seaweed was bad so the park stunk like rotten eggs."
        }, 
        {
            "index": 411, 
            "rating": "4", 
            "review": "Shopping. Our whole family enjoyed walking down 5th Ave and looking in the shops!! Love how they keep everything looking nice! Love the new mall!!"
        }, 
        {
            "index": 412, 
            "rating": "3", 
            "review": "Shopping on 5th ave. There was plenty of shopping but it was high pressure from owners to shop in their store and the really tried to put on the pressure.I shopped at the Playamart which is kinda like a 5 and dime. They had a little bit of everything and no pressure to buy. Prices were reasonable and there was no negotiating like most of the other retailers.it definitely is something to experience .right in front of this picture is a small beautiful church. Buyer beware!"
        }, 
        {
            "index": 413, 
            "rating": "5", 
            "review": "Beautiful !!!!. This is the view or the water gods, just by the ferry dock in playa, when the sun is up the rays come threw the tope of the statue making it look like the gods are reaching for the sky, Amazing !!"
        }, 
        {
            "index": 414, 
            "rating": "5", 
            "review": "A must stop for everyone in Playa Del Carmen. This place has changed a lot over the years, all for the better. Everyone going to Playa should check it out. A cool place to hang out in the evenings. Great for people watching!"
        }, 
        {
            "index": 415, 
            "rating": "4", 
            "review": "Pretty & Fun. Cool area to walk around, shop, take photos! This was a nicer area of the beach. There is always something fun happening! The Marreache band playing up the top of the really high pole was amazing!"
        }, 
        {
            "index": 416, 
            "rating": "5", 
            "review": "good view of the bech. it was right in the middle of 5th avenue near a beautiful church that you could visit there where a lot of places to tak e pictures of the beach and see the ferry boat"
        }, 
        {
            "index": 417, 
            "rating": "3", 
            "review": "a bit disappointed - but impressed by the wheelchair access to beach. arrived here expecting more than what was there, a few 'Mexican' stalls and a couple of places to get a cold drink, and a seating area. Did really like that they had wheelchair access to the beach."
        }, 
        {
            "index": 418, 
            "rating": "5", 
            "review": "Love this place. What can I say. I just love this place. Beautiful clean beach and warm friendly people with plenty of sunshine. Who can ask for much more than this."
        }, 
        {
            "index": 419, 
            "rating": "5", 
            "review": "very nice day out. this is a wonderfull town lots to do fantastic views i def recamend a vist lovely shops very safe must see"
        }, 
        {
            "index": 420, 
            "rating": "5", 
            "review": "What a beatiful bronze. In this center square is a show, where the locals are closing the day with a ritual that is not to miss. and a quiet place to sit and watch the ocean. Be aware of the merchants who say..remember me I was your waiter...such a bad lie...if you are wearing a wrist band from the resort you are staying they comment on the resort as well. They were not to happy with me as I called them liar. Most of the merchants were fun to haggle with."
        }, 
        {
            "index": 421, 
            "rating": "5", 
            "review": "NICE VIEW, CLEAN SIDE OF THE BEACH THIS YEAR.. It was very nice. There was a show you could sit and watch. Never had really explored this end of the beach."
        }, 
        {
            "index": 422, 
            "rating": "4", 
            "review": "Park is pretty Cool. Lots to see and do - the guys on the pole are crazy !!! Cant explain - you HAVE to see it ! Lots of fresh fruit vendors - missed the guy doing spray painting art (sad)"
        }, 
        {
            "index": 423, 
            "rating": "5", 
            "review": "Playa del Carmen, Cancun Riviera Maya. This park was very relaxing, you can also do a little shopping, there is a small but very cute church. Good restaurants if you decide to eat, and the best is the beack."
        }, 
        {
            "index": 424, 
            "rating": "4", 
            "review": "Nice sculpture.. This place is at the very end or beginning of Quinta Avenida, depending on which direction you come from. It's a great place for a nice picture, if you're coming to Quinta Avenida anyway."
        }, 
        {
            "index": 425, 
            "rating": "5", 
            "review": "Went to cozumel on the ferry. Went to Iberostar Cozumel sister resort to the one we had in Rivera Maya. Cozumel has the smallest Hard Rock Cafe in the world"
        }, 
        {
            "index": 426, 
            "rating": "3", 
            "review": "Interesting. Nice place but to much hassle from the shop owners would be much better if you was left to browse without the hassle you would buy more"
        }, 
        {
            "index": 427, 
            "rating": "4", 
            "review": "nice. I would suggest a stop at this park just to see the sculpture. Plenty of low priced shopping but be prepared to be harassed by people trying to sell you something."
        }, 
        {
            "index": 428, 
            "rating": "5", 
            "review": "Beautiful and accessible in chair wheels . If you want to spend an evening with friends or family walking around but you have a beloved one using a chair wheel it is not easy to find the perfect place, but Playa del Carmen offers amphibious vehicles, this is amazing so everyone can enjoy this Paradise."
        }, 
        {
            "index": 429, 
            "rating": "3", 
            "review": "A place for a quick visit. Nice beach but tthere are oo many people harassing tourists to sell all kinds of things. We decided to leave rather than keep telling people we did not want to buy what they offered."
        }, 
        {
            "index": 430, 
            "rating": "3", 
            "review": "good pictures. pretty much just a place to sit around and relaxing.; public access to the beach. just blocks from 5th avenue."
        }, 
        {
            "index": 431, 
            "rating": "3", 
            "review": "Busy, shop owners hassle. Hard to walk and enjoy the area without shop owners dangling flyers from their own version of fishing poles, trying to lure you into their stores. Pun intended. Sculpture at shoreline unique and worth a photo but that's about it."
        }, 
        {
            "index": 432, 
            "rating": "4", 
            "review": "POPULAR PLACE - MUST VISIT IF IN PLAYA DEL CARMEN. It was our first time that we made it to this Park, so impressive and full of life. Parque Fundadores commemorates the Founders of Playa del Carmen. \"It is a significant historical location within the city, originally a community gathering spot where residents obtained water, food and basic living essentials, this seaside location was the market hub for the then small village\". (Taste of Playa\") I strongly recommend."
        }, 
        {
            "index": 433, 
            "rating": "4", 
            "review": "pretty area next to port. Nice beach area and shopping next to the local pier to and from Cozumel, can be very busy during the day with locals and tourist accessing the ferry port.A must see is to witness the amazing men who climb a very high pole and then swing upside down"
        }, 
        {
            "index": 434, 
            "rating": "4", 
            "review": "Found interesting finds. The beach was nice (although I didn’t bring my bikini on my trip here, which I regretted), and the market stalls were filled with interesting finds. Most places sold almost the same things. Try to haggle with the store owners, they are used to it. We mostly shopped in the bigger stores because I hate haggling, and enjoy seeing the prices right on the items so that I can mentally decide if I want the item or not. There are so many restaurants to choose from, and this is where you can also buy some tours from that are cheaper than the resorts. Overall I had a very interesting day here."
        }, 
        {
            "index": 435, 
            "rating": "5", 
            "review": "A Nice and Beautiful place to be at Sunset!. A Nice and Beautiful place to be at Sunset! There was a live show performed by Dancers at sunset with Drums. Very fun to watch. Keep in mind there will be a performer that will come around looking for a donation."
        }, 
        {
            "index": 436, 
            "rating": "5", 
            "review": "Uuu!. I thought that there are two mermaids trying to hug each other, but when I got closier - its a couple, I think it's pretty romantic place, especially in the evening. And also locals are doing performances there,- It's nice!"
        }, 
        {
            "index": 437, 
            "rating": "5", 
            "review": "Essential photo opportunity. We just had to start our evening here. There was a fire eating act on, when we went. Very good, free entertainment with a great atmosphere. Best time to go, is early evening just as the sun is setting. Simply unforgettable and romantic. We positioned ourselves just beneath the two ladies and managed to get a passer by, to take our photo. The best part was that they returned the phone to us instead of running off with it, which is always a worry."
        }, 
        {
            "index": 438, 
            "rating": "3", 
            "review": "Pretty nice. Nice place, beatiful statut with a nice background of the carabean see. Dances and shows on the place all day. Nice restaurant all around, a bit small but cosy."
        }, 
        {
            "index": 439, 
            "rating": "4", 
            "review": "Take a seat and relax a bit. Lots going on here. Performers, playground for young children, food vendors, and a nice place to take a break."
        }, 
        {
            "index": 440, 
            "rating": "5", 
            "review": "Fun little park. Excellent place to take pictures. There was a live band playing on the Sunday that we visited. Nice beach with lots of families enjoying the sun and sand. You'll find lots of vendors here. I especially enjoyed the cold, fresh pineapple (on a stick)."
        }, 
        {
            "index": 441, 
            "rating": "5", 
            "review": "Stumbled upon a very cool performance.. When we arrived there was a cultural performance going on. It was very cool, They climbed about 50 feet up in the air on a pole and came down attached to ropes in a choreographed display. Very nice to stumble upon."
        }, 
        {
            "index": 442, 
            "rating": "5", 
            "review": "playa de carmen. Taxi to playa de carmen costs roughly £10 each way,hundreds of shops and bars,staff try to sell you things but they aren't rude and you can share a bit of banter with them"
        }, 
        {
            "index": 443, 
            "rating": "4", 
            "review": "Arches. Beautiful place for pictures. Very Clean! Lots of people. Close to where the boats were to go to Cozmel."
        }, 
        {
            "index": 444, 
            "rating": "5", 
            "review": "A really fun park to visit.. this was a gorgeous park with local performers and right in the middle of a ton of shopping. If you want something fun to do for the day, this is a great place to visit."
        }, 
        {
            "index": 445, 
            "rating": "1", 
            "review": "Pushy Vendors. I hated going in to any shop because the shop owners harass you from the moment you enter their store. Some might find this an interesting feature of the Mexican culture, but I was very uncomfortable. I would have bought much more if I was just left alone to browse items on my own. I couldn't get out of there fast enough!"
        }, 
        {
            "index": 446, 
            "rating": "4", 
            "review": "Better deals if you walk off a block or two. But the atmosphere is awesome!. Very neat place. Lots to see. Lots to shop. You get better deals if you walk a block or two off 5th ave. The Cenote restaurant was awesome and the staff was super friendly. Be prepared to be hassled to buy jewellery and look in every single persons shop. Don't make eye contact lol Definitely a great experience none the less. I went with a friend one day and on my own on another day and I felt safe and was able to get some great deals."
        }, 
        {
            "index": 447, 
            "rating": "5", 
            "review": "shop and swim. beautiful sculpture ..beach clean and quiet...nice area plus shopping..really hot..wear a hat...wear sunblock...good deals on the avenue..better at the end of street...."
        }, 
        {
            "index": 448, 
            "rating": "3", 
            "review": "Nothing special. Nothing special just a square at the start/end of 5th avenue. Monument as shown in this picture is beautiful though."
        }, 
        {
            "index": 449, 
            "rating": "4", 
            "review": "review. was a cool place to see,was in downtown playa had some type of local concert going on at the time we were there"
        }, 
        {
            "index": 450, 
            "rating": "4", 
            "review": "lovely park for pictures at the ferry to Cozumel. very beautiful park next to the ferry that takes you over to Cozumel. We got some beautiful pictures there. If you can make it through the 5th Avenue nightmare, it is beautiful."
        }, 
        {
            "index": 451, 
            "rating": "5", 
            "review": "Beach arch in Playa del Carmen. Beautiful spot for pictures and a walk along the beach when you need a break from shopping on 5th Avenue."
        }, 
        {
            "index": 452, 
            "rating": "4", 
            "review": "If you like people watching. We were able to experience the local culture in the square. We interacted with local people and learned their history. The Indian dancing under the arc was cool. But beware of pick pockets. It's very busy and easy to get distracted. Pay attention to your surroundings ."
        }, 
        {
            "index": 453, 
            "rating": "4", 
            "review": "Mexico holiday. We visited about 3rd and what a lovely square to sit and have a drink. Lovely views out to sea watching the ferries. Lots of entertainment when we were there, Indian dancing and flying men -these were amazing."
        }, 
        {
            "index": 454, 
            "rating": "5", 
            "review": "Beach in the city. Beautiful place !!! lots of entertainment all free and the scenery is out of this world and yes you are right down town too. A must see ...."
        }, 
        {
            "index": 455, 
            "rating": "4", 
            "review": "Nice sight when heading to the ferry. Such a neat place to take a picture, we came in the morning before the cruise ships let the passengers off, so it was quiet here at the park. The view cannot be beat, I wish we had more time to sit and look out over the water."
        }, 
        {
            "index": 456, 
            "rating": "4", 
            "review": "Lovely square. A lovely place just to enjoy a quick drink/bite to eat. Lots of little stalls around the perimeter and just off 5th Avenue, there's plenty to do and a stroll down the beach never hurt anybody! When I was there Mexico and the Gulf had a huge seaweed problem, whether that will become a recurring issue is unknown to anybody. It didn't bother me too much but I can understand it could put some people off."
        }, 
        {
            "index": 457, 
            "rating": "5", 
            "review": "mexico anniversary 2015. Lovely place to have a beer or an ice cream this statue in person is amazing the faces on the women are lovely very nice plaza"
        }, 
        {
            "index": 458, 
            "rating": "5", 
            "review": "Sit and watch the world go by. This is quite a nice place to watch the world go by,and just take a rest from shopping,good photo opportunities,I loved this place,very relaxing"
        }, 
        {
            "index": 459, 
            "rating": "2", 
            "review": "An ongoing seaweed issue. The Parque has lots of attractions, particularly the Danza de los Voladores (Flying Dancers), however the entire coastline of Playa Del Carmen has suffered an ingress of seaweed for over twelve months and the smell is very off-putting. Major hotels and beach clubs clean up their brach frontage (daily?) but the public areas and the ongoing smell is very unpleasant. You even get wafts of smell while walking down Quinta Avenida.If you are prepared and aren't that sensitive to smell, then this is worth a visit. Otherwise, you may wish to reconsider staying outside of Playa Del Carmen (Cozumel is an option) and making day trips. Just be sure you ask your hotel about any smells from the seaweed."
        }, 
        {
            "index": 460, 
            "rating": "4", 
            "review": "N. They have native Mayan Indians playing indigenous instruments as they climb a tall pole and descend swirling around Very interesting"
        }, 
        {
            "index": 461, 
            "rating": "5", 
            "review": "Wodnerful Addition to Playa Del Carmen. absolutely wonderful addition to the area, (I hadn't been back since 2009) this park was not there when I last traveled, wonderful way to see some authentic Mexican traditions/ceremonies and the kids got to play in the sand park."
        }, 
        {
            "index": 462, 
            "rating": "4", 
            "review": "worth the trip to playa del carmen. its so beautiful here, u have to come and experieince the show they put on.. its a very busy area, u are with all the locals hanging out here too."
        }, 
        {
            "index": 463, 
            "rating": "5", 
            "review": "Relax and Pics.. Great place to take pictures Meet your friends, and to sit and relax. This is one really neat statue. There are bars there to enjoy."
        }, 
        {
            "index": 464, 
            "rating": "5", 
            "review": "smells like **!!!!. Don't go to this beach, currently it is invaded by seaweed, which are so stink that I can't stay at this beach more than a minute."
        }, 
        {
            "index": 465, 
            "rating": "4", 
            "review": "Fundadores Park. This is a oceanside park in Playa Del Carmen near the Ferry terminal. There just happened to be some local performers putting on a show that night. This is nice place to relax while shopping on 5th avenue."
        }, 
        {
            "index": 466, 
            "rating": "4", 
            "review": "Culture + free beach = ¡Sí!. We had an hour and a half to kill between our awesome visit to Rio Secreto and our ferry back to Cozumel and our cruise ship, so we walked over to the public beach right by the Cozumel ferry pier.I had no idea that while my kids were enjoying the waves, I'd be watching an amazing cultural display with music, dancing, and some very daring men twirling down from a pole in the middle of the plaza, dangling by one ankle!The only reason I gave it 4 instead of 5 stars (well, two reasons) - I didn't see any bathroom facilities, and the jackhammer sounds from the construction happening in/near the plaza made it a little hard to relax. :)"
        }
    ]
}