{
    "category": "Playa-del-Carmen", 
    "entity": "Nuestra-Senora-del-Carmen-Catholic-Church", 
    "avg_rating_stars": 4.668067226890757, 
    "review_count": 238, 
    "rating_stats": {
        "poor": 1, 
        "average": 10, 
        "terrible": 0, 
        "very_good": 56, 
        "excellent": 171
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "Beautiful and open Church. This Church is located on top of the hill and offers service or mass Sunday's at 4:30 pm. Make sure you visit this beautiful Church"
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "What a beautiful church!. It was such a refreshing sight to the eyes to see a church with coconut trees on the background of the tabernacle. We arrived on Saturday night so it was nice to find a church with an English mass near the resort where we stayed at. It was a full house when we went and it was heartwarming."
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "Beautiful..... Beautiful small church. It has a peaceful atmosphere that is felt right away once you step inside,a very special place indeed. You will love it. Decorated with lots of natural flowers it is a well- kept church. A lovely sight to remember, also a very intimate church to pray among locals and tourists for those you care as well."
        }, 
        {
            "index": 4, 
            "rating": "5", 
            "review": "Mass. It happened to be that we arrived to 5th Ave, and by this church, when the mass was about to start. The sun was almost down, and decided to stay. Lots of people were arriving, and a lot had to stay outside, but also taking part of the ceremony. The surprise was that when we got outside, the illumination of the church was so beautiful! Not really a big one, but really cute. As mexican people are very catholic practising, the ceremony was nice and full of energy; devout."
        }, 
        {
            "index": 5, 
            "rating": "5", 
            "review": "We start off our yearly trip with a little prayer at N.S.del Carmen!. We visit Playa del Carmen each year and always start off with a little prayer at Nuesta Senora del Carmen Catholic Church. This little church in the city's plaza on Quinta Avenida is a beautiful welcome sight. Catholic Mass is held nightly in Spanish at 7PM and on Sunday's in English at 10AM."
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "Very nice place.. This is very nice and is worth the time to stop and see. You can see how the church is like. Very special to the loacals. They are proud people and love there church."
        }, 
        {
            "index": 7, 
            "rating": "4", 
            "review": "Beautiful Church. My husband and I were able to walk to this church from The Royal Playa del Carmen. It's very quaint in the middle of a bustling area. You could say that it's the calm in the midst of a storm for the location. It's beautiful and great place to reflect on how beautiful Playa del Carmen is."
        }, 
        {
            "index": 8, 
            "rating": "5", 
            "review": "Beautiful Catholic Church!. We went to Sunday mass at 10 am at the Nuestra Senora del Carmen and were surprised by this tiny gem. It is tiny; it has about 80 seats total so get there early for a seat. each pew seats 4 tightly. The 10 am mass is suppose to be in English but there was only one reading in English and the rest in Spanish; still it was lovely. This church is on 5th Ave and the main cross street so it is easy to find - right near the beach. Would definitely go again if in the area!"
        }, 
        {
            "index": 9, 
            "rating": "5", 
            "review": "Small Church Beautiful Interior. From the outside it looks small, but the style stands out. Inside it seems very peaceful, always people praying. Its seems to be a stop, even for a quick look, by just about everyone. In front of the park, beach backround can make for great pictures."
        }, 
        {
            "index": 10, 
            "rating": "5", 
            "review": "Lovely little chapel. A must to visit and take pictures, as well as just take time to give thanks to the lord if desired. Very cute, sometimes you can see weddings or else."
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "This a beautiful church!. This is a beautiful church and a must see. It is amazing to see the architecture, colors and just the love that was put in to build this church. It is stunning and a must see."
        }, 
        {
            "index": 12, 
            "rating": "5", 
            "review": "beautiful. very beautiful church in the heart of playa del carmen which is the 5th ave you should check it out if you have time"
        }, 
        {
            "index": 13, 
            "rating": "4", 
            "review": "Newer church. This was a nice church. We took a stroll and visited and it was very quaint to see. This is a newer church (the older church is near the ferry dock I was told)."
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "Piece of Heaven amidst Babylon. I was amazed to see this church there in the middle of all commotions, touristy crowds, drum beats and noisy merchants."
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "Watched a Wedding. Very beautiful place to visit and see the sites of Mexico. The wedding was lovely and I didn't know if real or fake but we watched."
        }, 
        {
            "index": 16, 
            "rating": "4", 
            "review": "Right in the middle of the action.. It was nice to visit this quaint llittle church which is found on the busy 5th avenue or Quinta Avenida. It is small but is nice to visit just to reflect the day or visit for a moment when you need time for yourself. If you are religious, there are masses held and we even saw a small wedding. Quite nice to visit."
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "Pretty church. located in the heart of Playa del Carmen, 5th avenue and just by the water, super clean, small and pretty, it gets busy very fast, mostly on weekends, so if you are planning to visit, try to go early or during the week."
        }, 
        {
            "index": 18, 
            "rating": "5", 
            "review": "Beautiful Church . This church has sunday masses and wedding ceremonies. Large windows in the church look out at the Caribbean! Very pretty"
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "Check out the little Church!. As we were shopping and walking around, we arrive at the end of the street and the beach is in view. We noticed a few tables of locals selling items and among the locals, there was a couple of tables that were tended by nuns. I was thinking that was pretty cool that the nuns had some very nice hand crafted items to sell, but looking beyond the nuns, there was a church right behind them! I couldnt help but think, along with all of these people, local and tourist, live music playing, and a beautiful beach in the backround was this little church! The doors were open and noticed a few people inside, so we went inside. It was Saturday night, and the people inside were locals participating in a prayer service, so we joined them for a moment. There are a few photos inside of wedding ceremonys that have been performed at this church, and with the closed end of the church being one large window, and the beach in plain view, the vows are given in this setting. Simply fantastic! Make a point to check out this little gem, you wont be sorry."
        }, 
        {
            "index": 20, 
            "rating": "5", 
            "review": "English speaking Mass at 10:00 am on Sun morning. The sisters and priest were very welcoming. Church is beautiful and right on 5th ave.We are catholic but even if you are not it is a must see.They have many times for mass but the 10:00am on Sun is english speaking but it was very enlightening going to a spanish speaking mass."
        }, 
        {
            "index": 21, 
            "rating": "4", 
            "review": "Adorable Church. This church is very near the park and the ferry landing in Playa del Carmen. It sits right on 5th avenue and it always seems very busy. I am not sure if we are always passing during the times when they are holding mass or if it is just that busy with tourists. Either way it is a precious church and has a great location. It would be prefect for a small wedding ceremony. I think its picture perfect."
        }, 
        {
            "index": 22, 
            "rating": "2", 
            "review": "On the strip. Little church/chapel along the shopping strip of Avenida 5 (5th Avenue).Not much here but good for a quick peekNuns outside selling their wares . . ."
        }, 
        {
            "index": 23, 
            "rating": "5", 
            "review": "Charming Church. Such a pleasant surprise! The church is charming and a beautiful site on Quinta Avenida. It's the perfect church for your destination wedding!"
        }, 
        {
            "index": 24, 
            "rating": "4", 
            "review": "Beautiful Little Church. This beautiful church is surrounded by palm trees and located near the beach and Parque Los Fundadores. We got to see a wedding the day we visited."
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "Excellent chuch. Excellent mass....excellent priest...my family really enjoyed the saturday 8:00 p.m mass. And since the church is located 2 blocks from the fifth Avenue, we just walked after mass..."
        }, 
        {
            "index": 26, 
            "rating": "4", 
            "review": "Beautiful chapel and ceremony. Went to Sunday Mass. A lovely little church in the heart of the town that is an oasis of peace and community and family prayer."
        }, 
        {
            "index": 27, 
            "rating": "5", 
            "review": "Lovely chapel. We visited the chapel off 5th Ave for Sunday mass. Bonus - the 10 AM mass was in english. Bigger bonus - the chapel is air conditioned (when we went to mass at the main church a few years ago it was definitely not). The priest was running a little late, but the service was quick and beautiful."
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "white chapel. beautiful church.white beautiful little church. didnt stay fr service but just beautiful.great for picture taking, always open."
        }, 
        {
            "index": 29, 
            "rating": "4", 
            "review": "Beautiful church. Beautiful church, peaceful and meticulously maintained. Glad my wife suggested we visit it. Great location, walking distance from most hotels, well from the Royal anyway. Perfect place for solemn thought and reflection."
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Beautiful little church by the beach. This is a beautiful little Catholic church. I have stepped into it to say prayers. It always closes early."
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "Classic Mexico Beauty. This place is a landmark in the town of Playa Del Carmen. Built in the Colonial times its classic architecture stands out when in person. Def worth the visit inside. Just steps away from the spot where the \"Danza de los Voladores\" is preformed is a plus as well."
        }, 
        {
            "index": 32, 
            "rating": "4", 
            "review": "Sweet Solemn Santuary. Sat, prayed and had a wonderful and educational talk with a woman taking care of the premises. Beautiful little place."
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "soooooo cute. I wish to get married again. its on 5th av. its just perfect, small romantic, simple. its nice to enter even for a minute"
        }, 
        {
            "index": 34, 
            "rating": "4", 
            "review": "Lovely spot to pause and reflect. This wee church is very special. An island of peace and calm in a sea of hustle and bustle. We love to see churches and places of worship, not matter the religion, and this small RC church was very beautiful in its simplicity. Beautiful white paint and tropical plants make it a warm and peaceful place. A must visit if you are on 5th Ave."
        }, 
        {
            "index": 35, 
            "rating": "4", 
            "review": "Beautiful little church. . This is a beautiful little church right on 5th Avenue. It has Sunday mass in English. Nice place to sit and give thanks."
        }, 
        {
            "index": 36, 
            "rating": "5", 
            "review": "Great experience! . We just got married here and it was fantastic! We couldn't have asked a more perfect setting! The priest and staff were wonderful! ❤️"
        }, 
        {
            "index": 37, 
            "rating": "4", 
            "review": "Nuns. Only seen but didn't go in ,the nuns were outside selling bits .did stop to have a little look ,didn't bye anything ,"
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "Sunday Mass in English at 10 AM. THis small church is about a 5 minute walk from the Playacar Palace where we were staying and is an absolute joy to attend. Quite impressive is the nave is nearly covered up with growing plants that surround the rear picture window out the back and just add awonderful air about the church"
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "Lovely location. this cute small chapel is often the backdrop for small weddings. What a lovely spot. We have walked in during simple mass service, very emotional"
        }, 
        {
            "index": 40, 
            "rating": "5", 
            "review": "Beautiful little church. We were able to see a mass but had to stand outside but you can hear the mass over the loud speaker."
        }, 
        {
            "index": 41, 
            "rating": "4", 
            "review": "Very lovely and quaint. This is classic of classic churches in PDC. During Christmas time the congregation extends out into the street. Its only open during certain times but worth passing by especially if you are strolling la Quinta (5th ave)"
        }, 
        {
            "index": 42, 
            "rating": "4", 
            "review": "Always stop by. This is a great little church right on the 5th Avenue where you can escape from all the noise and the crowds of the area. Sometimes they have mass in English and if you are in the area you should attend. The church has a view of the palm trees and the ocean. It is extremely peaceful and beautiful during Easter and Christmas. It is a beautiful white church right on 5th Avenue near the bus station. It is also beautiful inside and the fact that it is small makes it even more special.Keep in mind that this is a church so it is not recommended to go in with bikini or a swimsuit. I mention this because I have seen people walk in like this and believe me they get the look from the other people. Cover up."
        }, 
        {
            "index": 43, 
            "rating": "5", 
            "review": "Hermosa!!. Such a little tiny little church in a little plaza de armas looking like place, we found her when we were walking by, get in to pray, and we feel so much peace. If you are around, stop and look inside, is so beautiful, and with a nice views just steps away from the beach."
        }, 
        {
            "index": 44, 
            "rating": "4", 
            "review": "Tiny church. Right in the middle of the town is a tiny white church very quaint and beautiful  The church is open but is very small "
        }, 
        {
            "index": 45, 
            "rating": "5", 
            "review": "A few minutes away from the cloud. That contrast could not be greater: Quinta Avenida with all the rushing tourists, and then you enter this church and all of a sudden, you are away from the crowds, seeing the sea and the palm trees through the window, and nobody bothering you. Worth it."
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "easter sunday. The parish priest, very nice, bicultural and speaks many languages.this church is very near the fifth avenue area."
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "A Nice Quiet Place to Visit. Used to be much smaller before the storm..Nice tey rebuilt and fixed it up. Peaceful place to stop and pray, just sit and relax, think about how wonderful Playa and the Mexican people are......All so wonderful to just think...with in this crazy mixed up world today, the ugly news that is thrown at us......AND Remember thatGod is Good and so are the friendly Mexicans in this little seaside town.There is also English Mass on Sunday at 10 and sometimes other times, too.John"
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "I ALWAYS COME HERE DURING MY VISITS !!!. My first visit here was more than 50 years ago and I have come to this church in every visit since. This is a very beautiful, peaceful place to come and get away from the crazy fun at Playa del Carmen. I would never miss the opportunity to take time to meditate and take a spiritual break while in this area."
        }, 
        {
            "index": 49, 
            "rating": "5", 
            "review": "Church in Playa del Carmen. beautiful little Catholic Church on 5th Avenue in the heart of Playa Del Carmen. my husband attended mass there and commented on the simplicity of it yet very elegant. A must see if you visit downtown Playa."
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "Palm Sunday. The church was so pretty with flower sprays on each pew, and it smelled beautiful like the lilies that decorated it for the special day. So many walk by and make the sign of the cross. How mice to have a reminder of our Lord right in the hustle bustle of 5th Avenue. There was a table out front selling some religious articles. I bought a crucifix made out of palm for 20 pesos. It is a work of art. Other times I have seen religious artwork for sale there. I'm not sure if the money goes to the church though."
        }, 
        {
            "index": 51, 
            "rating": "4", 
            "review": "small but special. An interesting church, but small so you hardly see it from the outside! It is worth to step inside to admire unusual look . the big open space and window around the altar. Unique design ad a place to spend some quiet minutes"
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "Peaceful chapel. Wonderful priest, nice place to go to mass when your on vacation in Playa del Carmen. Small chapel, come early if you want a place to sit."
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "Sunday Mass 10 am in English. very nice surprise after walking along beach from Riu hotel. Well maintained chapel. Small but beautiful."
        }, 
        {
            "index": 54, 
            "rating": "5", 
            "review": "Beautiful church!. This gem is on Quinta Avenida among all the shopping. The outside of the church is very beautiful and very bright white! The inside of the church is even more stunning. If you're in the area, walk in and check it out. It's a quaint, peaceful place to get away from the crowds!"
        }, 
        {
            "index": 55, 
            "rating": "5", 
            "review": "Wedding. If you want to have a traditional Catholic wedding and also have it by a great beach resort area this is it. The church is small but beautiful. It will fit close to a hundred people. You can bring your own priest. There will be crowds of gawker outside. Where else can you listen to a wedding ceremony and be able to look out the window and see four Indians spiraling toward the earth."
        }, 
        {
            "index": 56, 
            "rating": "5", 
            "review": "Beautiful church. Hard to believe this beautiful churches on fifth Avenue, It's amazing to see weddings there. It's probably one more quaint and beautiful churches"
        }, 
        {
            "index": 57, 
            "rating": "4", 
            "review": "Quaint and simply beautiful!. We happened to be walking by just as a young couple were about to be married. The bride stood at the end of the procession just outside the entrance to the church, as local people and spectators stood by cameras ready capturing the moment. The church is small, right out in the open with views of the ocean and is simple yet elegant. It's worth stopping by to take a look at, who knows, you may just come across a beautiful wedding moment at the same time!"
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "Stark contrast to the hustle and bustle. It was amazing to be walking 5th Avenue and see such a beautiful little church in the middle of all the hustle and bustle of life passing by. It made you stop and take a breath and be reminded of what's important in life. And when passing by, they were having a service inside with the doors open so anyone could participate, so inviting. I am not Catholic but a photographer instead so I walked around the outside taking photos and loved the stark contrast of the white building next to the green palm trees. Such a beautiful little place!"
        }, 
        {
            "index": 59, 
            "rating": "5", 
            "review": "What a great little Chirch. English mass was fantastic and convenient. I highly recommend even if you are not catholic. What a great experience."
        }, 
        {
            "index": 60, 
            "rating": "5", 
            "review": "Must See !!!!!. Walking down 5th Ave you will come across a small but beautiful church. Be sure to stop to pray if needed and take in the amazing interior."
        }, 
        {
            "index": 61, 
            "rating": "5", 
            "review": "A cultural place of peace the middle of chaos. This little church is at the beginning of 5th avenue where you take the ferry to Cozumel. One of the first structures to support Playa Del Carmen when it was a small fishing village.It's architecture is authentic and remenisant of an older time in Mexico. Worth a visit on your way to the beach. If you're a Christian stop in and say a prayer for safe travels and your family.Worth a stop."
        }, 
        {
            "index": 62, 
            "rating": "4", 
            "review": "Centrally Located. Lots of masses, none in English though, at 8 pm Saturday, 6, 8,10, noon and 6 pm on Sunday's. Near CocoBongo corner of 12 st and 15 ave."
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "Beautiful. We attended a Catholic mass and were overwhelmed with the religious and spiritual nature of the locals. The packed church of many locals and tourists was neat and nicely adorned. The celebration and service was all in Spanish but we didn't mind. The service was like our services in Connecticut so we were able to take part using English. For the offertory we saw many small donations in the basket and added our $20 US too. A beautiful elderly woman seated next to us look us in the eye and smiled from ear to ear. We strongly recommend taking in a service and commune with such wonderful Christians."
        }, 
        {
            "index": 64, 
            "rating": "5", 
            "review": "A breath of fresh air in the bustling center of Playa Del Carmen. I live in Akumal and attend the 10 am Mass on most Sundays. The chapel is a beautiful, simple place of worship that welcomes all. The 10 am Mass is usually half in English and half in Spanish depending on the priest. Many of the priests that say Mass are visitors themselves and are always extremely friendly. It is worth a short visit to just step in on any day at any time of day for a few moments of reflection."
        }, 
        {
            "index": 65, 
            "rating": "4", 
            "review": "Very interesting. We did not attend a mass but you could tell that the locals feel this is a very special religious place."
        }, 
        {
            "index": 66, 
            "rating": "5", 
            "review": "Charming church in Playa Del Carmen. I was fortunate to attend mass at Nuestra Senora del Carmen Catholic Church twice while on my vacation. Once for Ash Wednesday and then for Sunday mass which was in English. The church is small and was packed, standing room only so get there early if you want a seat. I was very staying at Playacar Palace which is within walking distance to the church. If you're in the area and want to just stop in for a prayer or meditation the doors are open and I would recommend it. If you want to attend mass I highly recommend this quaint, welcoming church.I will be going back to Playa del Carmen again this year and will definetely be attending mass here."
        }, 
        {
            "index": 67, 
            "rating": "4", 
            "review": "So Spiritual. The church is very beautiful and serene. We did not get to attend a mass here, but we're able to sit and say a prayer. The carvings on the walls are beautiful. Also, the nuns had a small table of goods to purchase which were made by the sisters. Must see!"
        }, 
        {
            "index": 68, 
            "rating": "5", 
            "review": "Beautiful. This chapel at the end of 5th avenue has Mass in English at ?10? a.m. in Sunday and at Noon In Spanish. If you want to attend Mass on Sunday, get there early to get a seat. The view is beautiful with the Large window behind the alter you look out onto Palm Trees and the Ocean."
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "Beautiful, seems out of place on the tourist strip.. Walking the avenue we saw this place and it is awesome. Nobody bothering you, was a mass when we stopped in, really an oasis on this street."
        }, 
        {
            "index": 70, 
            "rating": "5", 
            "review": "Always full of locals and tourists alike.. Lots of weddings were witnessed while we were here. It is in such a great location right on 5th kitty corner to the bus depot. The beach is at the end of the block and the main square is right behind the church so there are is lots going on in this little spot. The church itself is small and quite ornate for the size. I am not sure about how the priest is as I don't attend church. I have always admired it just the same."
        }, 
        {
            "index": 71, 
            "rating": "5", 
            "review": "Wonderful Oasis. This church was the site of a family baptismal service in 2015. It is an absolutely wonderful small and beautiful edifice on 5th Avenue. A \"must see\" during your visit. Our little church service was uplifting and rewarding in every aspect.\nThis church is a jewel in the middle of busy and bustling Playa del Carmen."
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "Old Mexican church. Right down centre in Playa Del Carmen we watched a wedding. If no one inside they will let you take pictures. Great view and good area for pictures."
        }, 
        {
            "index": 73, 
            "rating": "4", 
            "review": "The Church On The Plaza In Playa. Simple and small Catholic church of Playa Del Carmen. If you happen to visit the plaza at the right time, you are able to witness the Danza de los Voladores (Dance of the Flyers), a ritual ceremony dance performed by 5 participants on/from a 30 meter pole."
        }, 
        {
            "index": 74, 
            "rating": "5", 
            "review": "Peaceful little church . We love coming to playa and always going to mass at this church .. Very quaint ... Come here every year . Love being there . Just wish it had more mass times"
        }, 
        {
            "index": 75, 
            "rating": "4", 
            "review": "small but nice. we pass this beautiful little church each time we go into Playa Del Carmen to visit Senor Frogs usually there is a wedding going on. we stop and go in if room. it does not hold many but you should stop in"
        }, 
        {
            "index": 76, 
            "rating": "5", 
            "review": "Christmas Day mass. We attended this church for Christmas mass and it was beautifully decorated. The sermon was very poignant for the troubled times we live in, the service was excellent and it felt great to feel part of a community."
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "Standing room only services for all. A beautiful structure that sets the tone for the Playa del Carmen waterfront. I was deeply touched by the variety of people sharing their faith at the frequent services during the Christmas season - wealthy tourists, local vendors, homeless, poor. A reminder that we are all equal in the eyes of the lord.Make sure to catch the beauty of an evening service."
        }, 
        {
            "index": 78, 
            "rating": "4", 
            "review": "Something always happening. There is always something interesting to watch inside or outside, always seems to be a celebration of some sort, wedding..."
        }, 
        {
            "index": 79, 
            "rating": "3", 
            "review": "A Catholic Church. One (and the bigger) of two churches close to Quinta Avenida. Services are all in local dialect. It is not so big and probably seats about 300 people."
        }, 
        {
            "index": 80, 
            "rating": "3", 
            "review": "Christmas mass. Found this small church on Trip Advisor and emailed in advance to get their times for Christmas mass. Kind of disappointed they did not have midnight mass the night before (Mexican style). So came for the noon mass on Christmas day. Church is nice and very basic. Some ornamentation and decorations, but of no particular architectural style. Service was traditional. I recommend it for anyone looking for a Catholic service walking distance to downtown. Not noteworthy if you are looking for some good pictures or a church with architectural significance. Parishoners were friendly. Service was 95% in Spanish."
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "Cute little church. What a cute little church right in the center of playa del Carmen on 5th ave ...I always stop by and visit this church when in playa and if ur lucky u will even see someone getting married there as I did last time I visited..."
        }, 
        {
            "index": 82, 
            "rating": "5", 
            "review": "Sunday mass. Pretty church, lots of fans going. Mass all in Spanish, did have English printed sheet of readings however. Priests bless everyone with holy water sprinkles, or head or handfuls for children. Peaceful and uplifting. Young woman selling simple crosses necklaces and rosaries very reasonable."
        }, 
        {
            "index": 83, 
            "rating": "5", 
            "review": "nice place to see and attend a mass. We attended the Sunday 10 o' clock mass. Lot of people here and a nice celebration. If you are in Playa del Carmen and you value to attend a Sunday mass in a church, just go here. You'll be contented. the mass was in Spanish, but why does it matter ?"
        }, 
        {
            "index": 84, 
            "rating": "5", 
            "review": "Lovely. Nice little Church mass half in English and half in Spanish. At sign of peace priest came and shook the hand of entire congregation. Spanish hymns from cassette. Come early only seats 80 rest stand outside."
        }, 
        {
            "index": 85, 
            "rating": "5", 
            "review": "Church. This is a cute little church. A must stop and see, the atmosphere was peaceful. Had the pleasure of witnessing a wedding ceremony."
        }, 
        {
            "index": 86, 
            "rating": "5", 
            "review": "Quick Visit. Went by and entered at night is a beautiful place, perfect for a quick visit if you are catholic and in the area, sometimes you see locals getting married there, is a very good looking Church"
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "Nice mix of Spanish and English. I recently attended Sunday Mass here. The Mass at 10 am was said half in English and half in Spanish. There were two homily's,one in English and one in Spanish. If was a really nice mix. The chapel is beautiful and only added to my experience."
        }, 
        {
            "index": 88, 
            "rating": "5", 
            "review": "close to the square. We spent a few moments here and would have gone in but they were having a mass. Wanted to come back to just sit and reflect."
        }, 
        {
            "index": 89, 
            "rating": "5", 
            "review": "Darling and quaint.. I always pop in here to say a few prayers while in Playa. It's a unique and historic spot. Add it to your list, especially if you are Catholic!"
        }, 
        {
            "index": 90, 
            "rating": "5", 
            "review": "A place for quiet contemplation in the middle of chaos.. This is a very sweet chapel. I visit and contribute every time I go to Playa Del Carmen. It is such a peacful place. Upon entering you leave the outside world behind. The chapel is quite and simple, just as its visitors. The view from the chapel window behind the pulpit perfectly frames the beach and sea."
        }, 
        {
            "index": 91, 
            "rating": "5", 
            "review": "Short Walk to Sunday Mass. Church is a short walk from the hotel. Arrive early on Sundays to get seats. Mass delivered in English. They encourage participation and my son read 1st Reading."
        }, 
        {
            "index": 92, 
            "rating": "5", 
            "review": "pretty church. Attended a very nice mass at this church . Right on 5th.the mass is done in spanish but easy to follow."
        }, 
        {
            "index": 93, 
            "rating": "5", 
            "review": "Wedding. My girlfriend didn't know a wedding was being shared just wanted me to share this beautiful Iglesia so near millions of shopping dollars. We arrived, luckily not in beach attire during a wedding ceremony, beautiful!"
        }, 
        {
            "index": 94, 
            "rating": "5", 
            "review": "You might miss it if you blink. Walked by it at first because it's so small. Worth a visit to give thanks for many blessings and to say a few prayers."
        }, 
        {
            "index": 95, 
            "rating": "5", 
            "review": "Hot without AC.. Mucho Hot. Nice experience to attend mass with the locals in a very hot and humid Sunday, but it was well worth it. The chapel and the surrounding grounds with very clean and inviting."
        }, 
        {
            "index": 96, 
            "rating": "5", 
            "review": "Serene Retreat. Beautiful small cathedral in Playa del Carmen. Very serene place to visit amidst all the hub-bub of 5th Avenue."
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "pretty chapel. On the famous 5th avenue and corner of ADO bus station,downtown Playa del Carmen.\nThis chapel has lot of plants inside and a big glass window on the back where you can see the Mexican Caribbean, after shopping you can enjoy a break and take a sit here for a while."
        }, 
        {
            "index": 98, 
            "rating": "4", 
            "review": "Mass mexican style. With my wife we atended Sunday mass at 6 pm. Even though I had read in other reviews that this church had air conditioning, it only had ceiling fans and the temperature was oppresive. Mass is in Spanish. At that time of day there was a woman who sung with a very beautiful voice. Very spiritualistic."
        }, 
        {
            "index": 99, 
            "rating": "4", 
            "review": "Sunday mass. We returned here for mass while vacationing in Playa del Carmen, having been here a few years ago for a family wedding. It is a pretty little church and the priest was very friendly."
        }, 
        {
            "index": 100, 
            "rating": "4", 
            "review": "Wonderful church. This church has a clear glass window on the back of the altar. it gives a peaceful feeling seeing the leaves of the tree and the sky behind it. I make sure I get in this church which is very close to the Ado bus station when I visit Playa del Carmen.. Very convenient as it is located on 5th avenue."
        }, 
        {
            "index": 101, 
            "rating": "4", 
            "review": "very nice. Very nice ! the nuns were outside selling homemade items to raise money for a charity.. Not once were we pressured into buying anything. Just beautiful people"
        }, 
        {
            "index": 102, 
            "rating": "4", 
            "review": "Small church in town center. A quaint little church right in the town center and always open! They sell rosaries there for 150 pesos. Worth a peek inside this cute church."
        }, 
        {
            "index": 103, 
            "rating": "5", 
            "review": "Right on the Zocalo. A lot of weddings are done here. Small but very nice. Right on the Zocalo steps away from the beach and 5th avenue"
        }, 
        {
            "index": 104, 
            "rating": "5", 
            "review": "renewed our vows in this church. After having survived brain cancer and returning back to Playa Del Carmen after my treatment I thought what a wonderful place to renew our wedding vows, at the cutest church in town. The service exceeded our expectations. The priest was wonderful as were the locals who happened upon our ceremony at their church, when leaving the locals were kind enough to give us hugs and kisses and well wishes. It was a very warm and inviting experience... highly recommend this church to everyone who visits Playa, its adorable as are the people that are affiliated with the church. It was a heartwarming experience for our family."
        }, 
        {
            "index": 105, 
            "rating": "4", 
            "review": "Cute Church. This is a cute church at the begining of 5th Avenue. It is nice to see it is actually used on Sundays and for weddings. Not worth going out of your way for but you will see it while walking on 5th Avenue."
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "Mexico anniversary 2015. Nice little church almost walked right past it when visiting avenida 5 but glad we did not miss did not walk inside just viewed from the outside hall keep in mind this is a church and not a tour or museum people still go there to pray and have services. Be respectful even if you are not catholic."
        }, 
        {
            "index": 107, 
            "rating": "3", 
            "review": "Nice little Chapel, but if you want full mass schedule, there is a church 6 blocks away. Also: Save $. This pretty well appointed little chapel is right on the main drag (5th Ave), usually open and worth a quick look.While you are busy walking the 11/2 mile 5th Ave shopping street, here is a way you can save quite a bit of money. Virtually every commercial establishment permits you to pay in pesos or USD. For almost every transaction made, I found out that if you make a quick calculation, one alternative is better than another. Here is what to do: Take USD with you and use a debit card that does not charge a fee and also reimburses you for any third party charges. The savings really add up. I saved about $40 just on the hotel bill."
        }, 
        {
            "index": 108, 
            "rating": "4", 
            "review": "Very festive Mass!. They have very convenient masses (6, 8, 10, 12, etc.) A Mariachi band played at the mass we went to a noon! No AC, but sitting in the balcony helps because of the cross breeze."
        }, 
        {
            "index": 109, 
            "rating": "5", 
            "review": "wedding. Went there for a wedding at Nuestra Sentara del Carman Catholic Church. It was a amazing wedding. Beautiful church."
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "A gift from heaven!. We were walking towards the pier to take the ferry to Cozumel, when we looked to the left, not really realizing we were walking by a church, and saw the Blessed Sacrament exposed... We had to walk in, and give thanks, it was my husband's birthday and he wanted to celebrate spending the day in Cozumel. Normally we would've gone to mass but being away from home, we figured we were out of luck. Thank you Jesus!"
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "Worth stopping in and taking a look.. Very pretty little church right off of 5th Ave. Step inside and it is quiet. A good place to stop and reflect and thank God for all the beauty around you."
        }, 
        {
            "index": 112, 
            "rating": "5", 
            "review": "Cozy church. Beautiful surprise to come across this small church on our way back from Cozumel, it was perfect because it was a sunday and we were able to stay for mass"
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "Beautiful Chapel. If you like to visit chapels, this is a beautifu small chapel. I don't recomend mass here because there is not enough place, but if you like to visit and have time for yourself and the magnificent view, it worth the time."
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "Beautiful!. Beautiful small Roman Catholic Church... My family and I went for a Sunday mass- of course service was in Spanish, but who cares...beautiful... There are only few rows of seats but there is place to stand... Priest very friendly and welcomes everybody with open arm... Stop by if need to pray and reflect!"
        }, 
        {
            "index": 115, 
            "rating": "4", 
            "review": "Cute little church, worth a visit or taking in a Mass while on vacation. Its hard to miss this little white church while in Playa del Carmen as it certainly stands out amongst all the bars and shops. Just past the church, behind it, is one of the main entrances to the beach itself with a nice monument arch. The church itself is small and quaint, very reverent and peaceful feeling upon stepping inside. Although we didn't stay for a Mass, I can see this church being a nice place to take in a Mass while on vacation."
        }, 
        {
            "index": 116, 
            "rating": "5", 
            "review": "Beautiful church. Really nice church is a must to visit when traveling to playa del carmen. You will love it. Definitely brill be coming back"
        }, 
        {
            "index": 117, 
            "rating": "4", 
            "review": "Beautiful Church. What a lovely Church in the heart of the city near the beach, shops and the bus station. Easy to pop into for peace and a prayer."
        }, 
        {
            "index": 118, 
            "rating": "4", 
            "review": "A Beautiful Mass. We were aiming for the Capella de Nuestra Senora de Carmen which is at Av. Benito Juarez and Quinta Avenida, but we ended up here instead...the challenges of our first venture out while in Mexico. The church was beautiful, vibrantly decorated inside. We went to 10am mass, which was predominantly in Spanish, altough the first reading was in English. There was an English translation of the mass available, but it was easier to follow the Spanish missal. At the end of mass, many people pressed forward toward the altar...unusual in our experience. The priest and the deacon sprinkled the congregation with holy water and gave a blessing, and it was great to see the families come forward.I suspect that we had a more authentic experience of a parish than if we had gone to the Chapel by the beach. Most of the pictures appear to be of the Chapel, not the Parish."
        }, 
        {
            "index": 119, 
            "rating": "5", 
            "review": "Senora del Carmen. absolutely beautiful it was a moment to really take a moment to stop and be thankful. I would stop in my next time around..."
        }, 
        {
            "index": 120, 
            "rating": "5", 
            "review": "Wonderful Mass for Visitors. We do not speak Spanish but we really enjoyed attending Mass at Nuestra Senora del Carmen Catholic Church. We were welcomed right away by the Priest and all of the parishioners were very welcoming. There is no A.C. but we didn't care. Dress was casual and many people were wearing a t-shirt and jeans with sandals. Their music ministry was wonderful and, for me, was the best part of the service!! I would recommend this church for everyone visiting the area."
        }, 
        {
            "index": 121, 
            "rating": "5", 
            "review": "The Mass Was Beautiful!!!. mass was great! My wife and I couldn't understand a word but the community was vibrant and we had a great experience."
        }, 
        {
            "index": 122, 
            "rating": "5", 
            "review": "What an atmosphere !. The church is rather simple, unlike western churches, and the atmosphere is serene and peaceful.\nThe 8 o'clock mass gathers a few people but everyone prays seriously, no tourists taking pictures nor curious passers by."
        }, 
        {
            "index": 123, 
            "rating": "5", 
            "review": "What a beautiful church. Right in town but so lovely;even tho closed the pictures are great close to everything in PDC, ferry, park shops, hotels\n...wished we could have stayed in PDC, came from one of the big resorts, fun town, very lively felt very safe in Playa"
        }, 
        {
            "index": 124, 
            "rating": "3", 
            "review": "Cute little church. This church was a real surprise in the middle of the tourist area. Very small, peaceful and serene. It's not ornate at all just a pretty little church with a lovely view.It is a working church, with people praying or attending services throughout the day. So it was disappointing to see some people walk in loudly, take pictures and walk out again.Worth a visit if passing."
        }, 
        {
            "index": 125, 
            "rating": "5", 
            "review": "Beautiful Church. Worth a quick visit when walking along 5th Ave heading towards 1 Sur. It is a beautiful and peaceful church."
        }, 
        {
            "index": 126, 
            "rating": "5", 
            "review": "A gem close to beach. Although I did not go inside the church, my friends did. They stated that it was very beautiful inside. It is situated around a busy shopping district so it was nice for them to go inside and find some tranquility."
        }, 
        {
            "index": 127, 
            "rating": "5", 
            "review": "Beautiful Little Church. This is a beautiful church in the heart of Playa del Carmen, it is a dream-like beach church with a beautiful insides and with view to the beach. It is centrally located in 5ta Avenida you won't miss it and shouldn't miss visiting this landmark"
        }, 
        {
            "index": 128, 
            "rating": "5", 
            "review": "Beautiful. Gorgeous view. Ideal location for a beach wedding. Small & intimate church. Good place to stop & relax gather your thoughts!"
        }, 
        {
            "index": 129, 
            "rating": "5", 
            "review": "Small but Very Beatiful Church. We usually visit this church when we are in Playa del Carmen. During our visits we were initially surprised, but pleased, to find the Blessed Sacrament exposed in a monstrance on the altar. This is a very special little chapel for those of us who are Roman Catholic, and we always look forward to visit."
        }, 
        {
            "index": 130, 
            "rating": "5", 
            "review": "Very quaint little church. . My wife and I travel to PDC every year and every time we pass this church it is normally having a wedding. Its is a beautiful place to see you can see the beach from the alter. It is a humbling place together away from the chaos . Well recommended."
        }, 
        {
            "index": 131, 
            "rating": "4", 
            "review": "Beautiful little church. Very beautiful and small church. From the altar window you can see the sea. Worth visiting if you are in playa, and it is close to the maya portal."
        }, 
        {
            "index": 132, 
            "rating": "4", 
            "review": "Nuestra Senora del Caarmen Catholic Church. Quaint little church worth visiting. I did not attend their service. It is located at the south end of the pedestrian mall."
        }, 
        {
            "index": 133, 
            "rating": "4", 
            "review": "wonderful church. We enjoyed attending mass here, but beware it is not air conditioned. The ceiling fans help, but it was a little uncomfortable. There is an english mass at 10am, but our experience was that only part was in english, yet with the handout it is fun to follow along wit the Spanish. We attended the church on 15th ave nte"
        }, 
        {
            "index": 134, 
            "rating": "5", 
            "review": "Beautiful church. At the south end of 5th ave, right off the beach, stands this beautiful, bright white church. If I were to getting married I would use this church. I've seen a photography company's pictures of a wedding done here and they were gorgeous! I think the company was Bohemia photography in Playa. You should check this place out."
        }, 
        {
            "index": 135, 
            "rating": "4", 
            "review": "Church on the Chacras Square. acing Chacras square is the architectural beauty of Nuestra Señora del Perpetuo Socorro Church built in 1935, standing out amidst the landscape. Sunday mass is heard both inside and outside the church as numerous people congregate on the beautiful grounds in front of the church. Check out the magnificent stone altar carved in the Mendocino-Colonial style. Visitors are invited."
        }, 
        {
            "index": 136, 
            "rating": "5", 
            "review": "Nice quaint church.. Mass in spanish. Parishioners very friendly. Easy and inexpensive to get there by cab from the RIU compound. Or give yourself about 30 minutes and take a casual walk."
        }, 
        {
            "index": 137, 
            "rating": "4", 
            "review": "A respite in the midst of the hubbub. A beautiful quiet spot along a very busy avenue. A unique piece of Mexico overlooking the ocean, a cool spot in the midst of the heat. A great spot to photograph, to have a little rest, or to contemplate the wonders."
        }, 
        {
            "index": 138, 
            "rating": "4", 
            "review": "Small and intimate. The pure white paint is so dazzling. The smooth stucco structure is humble in size and adornment. It is done in a style unlike the big cathedral structures elsewhere. It is intimate in size, and the interior is so well maintained and clean. The wood absolutely gleams. The setting makes it such a part of everyday life in this part of Mexico: near the water, close to all the pedestrian activity, and it stands as a reminder of the spiritual side of life in this area."
        }, 
        {
            "index": 139, 
            "rating": "5", 
            "review": "Error Of Location versus PIctures. The majority of the pictures shown in this listing are of the smaller Catholic Chapel on 5th Avenue NOT the main church on 15th Avenue. Trip Advisor needs to distinguish between these two locations. The photographs showing the walk through arch from the street and the large window at the front of the interior of the church overlooking the Caribbean Sea are not of the 15th Avenue location they are of the 5th Avenue location.The Catholic Chapel on 5th Avenue is a beautiful and serene chapel. You walk in right off busy 5th Avenue and are immediately hit with an uncanny sense of peace and serenity. The feeling you get when you walk into this chapel really cannot be described...it just is. My wife and I visit this chapel every time we're in Playa del Carmen, and I'm not even Catholic! We love this little chapel...what else can I say!"
        }, 
        {
            "index": 140, 
            "rating": "4", 
            "review": "A very pretty and interesting little church. The church on the ever popular 5th Avenue. It is well worth a look and it is a nice break from all of the tourist shopping. While it is a very nice church, I wouldn't make a special trip just to see the church."
        }, 
        {
            "index": 141, 
            "rating": "5", 
            "review": "Quiet and elegant cult place. Small, but really beautiful, if you take a walk by the 5th, you really have to take a look into this peacemaker little church."
        }, 
        {
            "index": 142, 
            "rating": "5", 
            "review": "A very busy place on a Sunday. A full house with a lot of the congregation stood outside listening to mass on the permanent speakers. A very pretty church if you are able to take a look inside."
        }, 
        {
            "index": 143, 
            "rating": "5", 
            "review": "Awesome Catholic Church. Very nice Catholic church within a 3 minute walk of 5th avenue. Masses at 8 pm Saturday, and 8, 10, 12 on Sunday. 10 am Sunday Mass is English."
        }, 
        {
            "index": 144, 
            "rating": "4", 
            "review": "Surprising Location. I had seen this church on Trip Advisor before coming to Mexico, but was surprised to find this pretty church amidst bars, a bus depot, restaurants and souvenir shops. The church's doors were open, welcoming passerby, and once inside, a sign politely asked visitors to be quiet and respectful. The interior is simple, yet beautiful. The exterior is the same. It was a neat and surprising outpost in a bustling, touristy neighborhood. It is small, so 15 minutes would suffice to see the interior and take some pictures of the exterior, unless a person wanted to stay longer for reflection purposes."
        }, 
        {
            "index": 145, 
            "rating": "5", 
            "review": "nice quaint. it is an old beautiful church in the middle of everything overlooking the bay at the center of everything"
        }, 
        {
            "index": 146, 
            "rating": "5", 
            "review": "Beautiful Setting. This church is very peaceful with the view behind the alter of the palm trees and the ocean. The singing was beautiful and even though we do not speak Spanish, the melodies were familiar."
        }, 
        {
            "index": 147, 
            "rating": "5", 
            "review": "Beautiful. A lovely respite from the bustling crowds on 5th ave., a peaceful little bit of heaven on earth in playa. Like the other, larger church on 15th you will never find the chapel empty, which I find very comforting. This is the first time I have seen the sale of rosaries and cards etc. at the entrance doors, and I find this a nice way to contribute a few pesos. If you sit outside the building you can hear the Mass being said and very frequently on Saturdays you will see the weddings. Beautiful."
        }, 
        {
            "index": 148, 
            "rating": "5", 
            "review": "Beautiful. A really beautiful little church to spend 10 minutes in quiet reflection. Situated in the centre of town with an amazing view of the sea"
        }, 
        {
            "index": 149, 
            "rating": "5", 
            "review": "Sacred. A sacred place to say a prayer on bended knee. A beautiful spot for photos outside, right on the beach and a lovely space for some quiet time."
        }, 
        {
            "index": 150, 
            "rating": "5", 
            "review": "Beautiful Catholic Service. Towards the south end of 5th Ave. a 16th street mall like experience. If you like night life this is where it's at. This isn't a sleepy fishing village"
        }, 
        {
            "index": 151, 
            "rating": "5", 
            "review": "Don't miss visiting this historic church!. We actually saw a wedding being performed here. It was awesome! It's a beautiful, local church, close to the beach."
        }, 
        {
            "index": 152, 
            "rating": "4", 
            "review": "The view is breathtaking. It is almost a window with a chapel frame, totally charming and relaxing when you don't go on specific religious holidays when it is crowded as hell, considering is a small place for a handful only. Great for ocean view photos! :D"
        }, 
        {
            "index": 153, 
            "rating": "5", 
            "review": "Church with activities for all. We visited the Church over Christmas and was very happy with all the activities for adults and children. It was very refreshing to see how engaged the priest were with the congregation of all ages. The Posada was very impressive and all participated fully. After that there was pinatas for the children but I think the adults enjoyed seeing them even more. After that there was hot punch and treats for all there. This went on for nine nights. We also attended the late night mass on Christmas Eve which was a beautiful experience. John Pascucci"
        }, 
        {
            "index": 154, 
            "rating": "5", 
            "review": "Mariachi Music at Mass. I went to the 8:00 mass this morning and was very grateful for the English flyer at the entrance to the church which included all the readings and prayers and a summary of the homily. The priest was very engaged with his community, getting them to chuckle every now and then. The best part for me was the 5 piece mariachi band that did the music for the service. Perhaps that was something special for the last day of the Christmas season, the baptism of our Lord. Many of the comments and pictures are in referrance to the chapel on the beach NOT the main parish church. Go to the website for mass times and information http://iglesiadelcarmen.org.mx/"
        }, 
        {
            "index": 155, 
            "rating": "5", 
            "review": "Beautiful Church. Beautiful opened air Church that we attended on a HOT Sunday morning. Overhead fans could not keep up, but it did not detract from the mood that prevailed inside. Even though the Mass was in Spanish it was so nice to see so many young children/teens participating and so many families attending. It was standing room only at the 10:00 service. We walked by many times and it was always very well attended. Will definitely attend again on our return trip."
        }, 
        {
            "index": 156, 
            "rating": "5", 
            "review": "Lovely energetic Spanish priest. Convenient times, well ventilated and nice services.The priest speaks English if he sees a lot of the congregation are non Spanish speakers and he always makes time for confession before or after MassLittle book shop next to it"
        }, 
        {
            "index": 157, 
            "rating": "5", 
            "review": "Christmas Eve mass. Despite that mass was in Spanish it was very, very moving. An Italian did some translating for us! There was a 10 yr old boy that absolutely sang his heart out.Our Christmas blessing."
        }, 
        {
            "index": 158, 
            "rating": "3", 
            "review": "idnight mass was uninspiring. nice to see whole families praying together. Attire was casual and natural, no pretense. A simple church, compared to the wealthy ones in Europe, for the people. Communal singing was pleasing."
        }, 
        {
            "index": 159, 
            "rating": "4", 
            "review": "Nice old church. The church is a place to visit,there is a nice plaza besides to relax and take pictures. Ferry terminal to Cozumel is around the corner."
        }, 
        {
            "index": 160, 
            "rating": "5", 
            "review": "Simple and pretty. A simple place of prayer and a nice place to celebrate Catholic faith. Peaceful. Exposition of the blessed sacrament was on when I was there."
        }, 
        {
            "index": 161, 
            "rating": "5", 
            "review": "Christmas Eve Mass. Went to 8pm Christmas Eve mass. Crowded but really nice atmosphere very warm and inviting. All in Spanish but it was very nice to be engulfed in the culture."
        }, 
        {
            "index": 162, 
            "rating": "5", 
            "review": "A Peaceful Refuge in Playa. It is a small peaceful church with a pretty altar and music. To me, it reminds me of the style of church that you might find in Santorini, Greece. You can sit, comtemplate, or pray as long as you wish."
        }, 
        {
            "index": 163, 
            "rating": "5", 
            "review": "XV's bday. All church staff, very helpful. Great mass and Priest was excellent\nGracias P. Fernando y Carmita\nDios los bendiga"
        }, 
        {
            "index": 164, 
            "rating": "4", 
            "review": "GREAT LANDMARK. The Chapel is the 1st thing you will see when you exit the ADO Bus Terminal in Playa del Carmen, so therefore you could easily use it as a landmark to meet friends or business associates. It is very clean and mostly quietly until the weekend when they hold services there. It is also a nice feature to add to your photos of Playa del Carmen. Most of all it is free to enter and look around. Donations are accepted and you can sign the guest log. Happy Travels!!!"
        }, 
        {
            "index": 165, 
            "rating": "5", 
            "review": "Beautiful Church... . We attended mass twice during our two weeks in Playa del Carmen it's a beautiful charming church 4 blocks from the beginning of 5th Ave. The mass was at 10:00 am and it was in Spanish but both times had readings in English, they provide you with a program in either Spanish or English to follow along. The music was beautiful and brought me to tears both times. The Priest was very welcoming always with a smile on his face. They sell beautiful hand crafted Rosaries which the money is used towards the parish. Thank you"
        }, 
        {
            "index": 166, 
            "rating": "4", 
            "review": "Charming Church in the Heart of Town. This pretty church is worth a visit for pictures both inside and out. There are lots of Buganvillia of many colours which look wonderful against the white plaster walls of the church. I am not a church goer, so I went for the aesthetic beauty, rather than for a service."
        }, 
        {
            "index": 167, 
            "rating": "5", 
            "review": "Wrong address in reviews. ple walking into the church to get married. if you are very lucky you will see the bride in traditional in Mexican dress."
        }, 
        {
            "index": 168, 
            "rating": "5", 
            "review": "Beautiful Catholic Church. I was able to walk to mass at this Catholic Church. One reading was in English and we were given an English translation of all readings and the Gospel. The people were genuinely kind and friendly."
        }, 
        {
            "index": 169, 
            "rating": "5", 
            "review": "Small Beautiful Church. What is there to say about a church? Just go and enjoy. One thing it is very very small Lol No A/C too."
        }, 
        {
            "index": 170, 
            "rating": "4", 
            "review": "Very nice. Stopped here to pray for a bit as we would be traveling on Sunday. Very peaceful and respected grounds! Beautiful respite from the normal tourist stuff."
        }, 
        {
            "index": 171, 
            "rating": "5", 
            "review": "Religious obligation. We were able to attend Mass and fulfill our Sunday obligation hoping that it was an all- English mass as stated in the schedule. This should be considered being that a lot of the people going to this mass are tourists"
        }, 
        {
            "index": 172, 
            "rating": "5", 
            "review": "Uplifting!. Beautiful Catholic Church, Mass each day at 8am and 8pm, plenty of options on Sunday, easy to get to from several hotels in downtown Playa del Carmen. Praise the Lord in Word and Eucharist!"
        }, 
        {
            "index": 173, 
            "rating": "5", 
            "review": "Be Among People of Faith and Family. This is about the larger church 2 blocks west of 5th ave.They have Mass at 6PM and 8 PM Sundays.Go here to be immersed in a transcendent experience among a people of faith and family.The highlight of my visit to Playa."
        }, 
        {
            "index": 174, 
            "rating": "5", 
            "review": "Not in Kansas anymore 2. This is a beautiful & small church, there is always something going on inside. Church ceremonies become interactive as you can go inside any time during open hours."
        }, 
        {
            "index": 175, 
            "rating": "4", 
            "review": "Beautiful Church in Middle of Shopping District. Wonderful place to stop for a few moments for meditation or prayer. Located at the ferry end of 5th Avenue. Both Spanish and English language masses were listed for the next day."
        }, 
        {
            "index": 176, 
            "rating": "5", 
            "review": "RC CHURCH Playe del Carmen. Mass in English is held each Sunday at 10am. Ask taxi driver to drop you off at Nuestra Señora del Carmen at the port end of 5th Avenue. It saves as long walk."
        }, 
        {
            "index": 177, 
            "rating": "5", 
            "review": "excellent singer. What very close to the center and the lady singing was simply impressive on her voice.\nThe mass is everyday at 8 PM at night so perfect time."
        }, 
        {
            "index": 178, 
            "rating": "5", 
            "review": "A wonderful ancient colonial church with a warm Mexican heart.. Even if you're not catholic, a visit to this church is more than worthwhile.What I like most were the messes on Sunday with a live Mariachi band.\nDuring the week it's a sanctuary for those who are searching for help, protection, forgiveness, enlightment and sometimes a hide out from the busy people and streets in the neighbourhood."
        }, 
        {
            "index": 179, 
            "rating": "5", 
            "review": "Mass. Great service, mass in Spanish and English, beautiful church, must do!\nSAFE to walk in the 5th avenue"
        }, 
        {
            "index": 180, 
            "rating": "5", 
            "review": "Incredible. church is incredible and very nice really a nice to see place yhe history related to it woth the view and the visit"
        }, 
        {
            "index": 181, 
            "rating": "5", 
            "review": "Beautiful Church. Love this little church and it's wonderful to go to mass at as you can take it the beauty of the chapel, enjoy quiet meditation, etc..."
        }, 
        {
            "index": 182, 
            "rating": "5", 
            "review": "Charming. Is a charming little chapel located on the 5th. Av. Some friends of ours had their 50th wedding anniversary mass held there and the experience is great. The views behind the altar of the ocean and well maintained landscape adds up to the experience."
        }, 
        {
            "index": 183, 
            "rating": "5", 
            "review": "A perfect wedding. We had our wedding at the chapel on 5th avenue on August 14, 2014 and it was amazing! We made all of the arrangements with Carmita and everything went absolutely perfectly. It was a pleasure working with her in arranging everything. Carmita gave us refererrals for flowers, mariachis, and even set up our transportation for us from the chapel to our reception site. The priest was wonderful and it was clear that he was excited for us and truly took joy in performing our marriage ceremony. It was the most wonderful experience and I thank the church for making this dream come true for us."
        }, 
        {
            "index": 184, 
            "rating": "4", 
            "review": "Cute and quaint. The church is quite quaint with enough seating for about 60 people or more and is a nice place to stop for some quiet time. You can pray if you like and the priest is there if you need to talk to him. No donation required but I am sure they would accept one."
        }, 
        {
            "index": 185, 
            "rating": "5", 
            "review": "Beautiful small church located in the main square.. The weekend we were there they celebrated the feast of St. Carmrn. The service was bilingual (Spanish & English)."
        }, 
        {
            "index": 186, 
            "rating": "5", 
            "review": "Catholic Church. quaint little chapel in the middle of the tourist plaza. we were able to witness a wedding being held while we were there. cute and picturesque!"
        }, 
        {
            "index": 187, 
            "rating": "5", 
            "review": "Our Wedding was Beautiful!. Our wedding was at the Capilla and everything was beautiful. The girls at the office are great when communicating through email. The priest gave a beautiful mass, and my guests were extremely happy with everything. If you are planning on getting married at the Capilla and have any questions let me know, I might be able to answer. I know I had a lot of questions."
        }, 
        {
            "index": 188, 
            "rating": "5", 
            "review": "Ethereal. Lovely church . . . enjoy the amazing music at the noon Mass . . . but with summer here, a useful tip is that there is an air-conditioned Catholic Mass at the Banyan Tree in Mayakoba every sunday at 9 am. And stay for breakfast afterwards !"
        }, 
        {
            "index": 189, 
            "rating": "5", 
            "review": "Beautiful!. I was recently married here. The ceremony was amazing and the pictures were beautiful! Father Hubert conducted the ceremony and all my guests loved him. He was very friendly and made the ceremony fun and had everyone smiling and laughing. I did not have a wedding coordinator and I took care of all the paperwork with the help of Carmita. She was available to answer all my questions, which were many! It does help if you speak Spanish to get a faster response from her, but even if you do not, she does ask someone to reply to you. She also suggested a few vendors which I ended up using, such as the florists and mariachis. There were three weddings scheduled the day I got married (including mine) and I ended up sharing the ceremony flowers with the other two brides. You can ask Carmita for the contact person or ask her to send your information to them so you can discuss sharing the flowers. It was very cost effective and the flowers turned out beautiful! The flowers used at the ceremony have to be left behind, since they're viewed as an offering, so sharing the flowers is the way to go. I was very happy with the wedding ceremony and I'm very happy we choose this chapel."
        }, 
        {
            "index": 190, 
            "rating": "5", 
            "review": "Chapel near the ocean. This is a must see. Many weddings are held in this little chapel over looking the ocean just at the south end of Avenida Quinta. With Mass held every Sunday"
        }, 
        {
            "index": 191, 
            "rating": "4", 
            "review": "easter service. very authentic. Good experience. thought it would be in English as stated but not.....locals didn't seem happy with tourist in there church....but I'm sure they are happy when they count the money"
        }, 
        {
            "index": 192, 
            "rating": "5", 
            "review": "Beautiful Chapel. Beautiful chapel right on the beach in the heart of 5th Ave. Quiet...a good place to meditate, reflect and give thanks."
        }, 
        {
            "index": 193, 
            "rating": "3", 
            "review": "Evening wedding. My husband and i stopped to watch a wedding on an evening walk down 5th ave, lovely little chapel, its worth a look."
        }, 
        {
            "index": 194, 
            "rating": "5", 
            "review": "Happily married here. My husband and I just got married at the chapel near the beach, and were so so happy with how everything turned out. The music for the mass itself is provided. There were also flowers there that were left over from a wedding earlier in the day, so we really didn't have to do much planning in that department. Father Gregory is the kindest man, and gave the nicest service. We were so happy with how everything turned out, and had a beautiful ceremony."
        }, 
        {
            "index": 195, 
            "rating": "5", 
            "review": "Beautiful. There was nothing to dislike The church is rather small but comfortable and you felt at Home when inside. We were there at 10 am the place was packed and there was not a mass going on ,just visitors . If in downtown Playa check out the church, then go shopping . playa del Carmen has a huge Gigantic shopping strip I have ever saw, it goes on and on ,something for everyone"
        }, 
        {
            "index": 196, 
            "rating": "3", 
            "review": "Glad I was able to make mass. the church itself off 12th is not very attractive, but they have an 8pm mass on sunday, and daily masses so that is what matters most. they have a Saturday evening mass with confessions prior to all masses. the adoration chapel on 5th ave, OL Mt Carmel is most beautiful and should not be missed."
        }, 
        {
            "index": 197, 
            "rating": "5", 
            "review": "Were blessed to attend mass at this glorious little church.. I am friends to MANY many MANY priests and I try to attend mass every day AND the priest at this small church was AMAZING!! Not only was his homily good, but his approach to greeting people who come to his church maybe only once in their lives, really impressed me. At the moment of offering the peace of the Lord he went around to very single person in the church to give them the peace of the Lord. It was so beautiful and impressive. The church itself is breathtaking, small but glorious. Although sunday non mass was packed, the peace felt was refreshing.You definitely must visit and plan to stay a while to pray and contemplate God's beauty and if you can, attend mass you will be happy you did!!"
        }, 
        {
            "index": 198, 
            "rating": "5", 
            "review": "Marriage celebration. we were permitted to attend and watch the wedding ceremony in church of a true Mexican couple. Wonderful."
        }, 
        {
            "index": 199, 
            "rating": "5", 
            "review": "Different, simple but beautiful. It is simple, plain but architecturally very beautiful building. Many weddings performed here and quite a few people attend regular mass. Spend ten/fifteen minutes, unless you worship, and admire its beauty."
        }, 
        {
            "index": 200, 
            "rating": "5", 
            "review": "A lovely view of a different Catholic culture.. I always enjoy visiting Catholic churches in different cultures. I found this church to be extremely serene and peaceful."
        }, 
        {
            "index": 201, 
            "rating": "4", 
            "review": "very unusual church. The view through the church on the beach is very unique. The whole thing is very unusual. Worth the stop."
        }, 
        {
            "index": 202, 
            "rating": "3", 
            "review": "good location!!. small church location right in the center of playa del carmen. I like the white color and beautiful roof and ceiling."
        }, 
        {
            "index": 203, 
            "rating": "5", 
            "review": "Lovely little Church!. We attend Mass there. It is one of my favorite places in the world. The Blessed Sacrament is exposed every Sunday."
        }, 
        {
            "index": 204, 
            "rating": "5", 
            "review": "Beautiful church. I attended a wedding here and it was beautiful. The large window behind the altar gives a view of the ocean."
        }, 
        {
            "index": 205, 
            "rating": "5", 
            "review": "comfortable church. We go to this church almost every visit. It is welcoming and surprisingly cool inside. When I saw we could review this church...I recalled one visit when we went in for the 8pm Saturday mass and the place was packed and the patrons unusually well dressed. After mass began a young woman (around 18-20) wearing a canary yellow dress walked to the front of the pulpit and a bench was placed there to make her the focal point. At the homily the priest came and sat beside her and spoke(in Spanish) directly to her. Many people then brought her flowers and small gifts. Many pictures were taken. I sure wish I understood Spanish....our best guess...it she was entering a convent. But that IS just a guess. Try and visit this church near Christmas or Easter as they decorate it so nicely. youw ill be welcome there anytime you go."
        }, 
        {
            "index": 206, 
            "rating": "5", 
            "review": "Walked in oand fell in love. On one of our trips to Playa del Carmen we walked in to Nuestra Senora church and fell in love :) It is a very intimate and inviting setting. We plan on getting married and would like for it to happen at Nuestra Senora church. Would love comments from anyone who has gotten married there. Btw we do not speak Spanish"
        }, 
        {
            "index": 207, 
            "rating": "5", 
            "review": "Beautiful!. Beautiful little church! Please stop by and see the inside, went two days in a row and bumped into weddings both times! You will not miss it, really traditional and white!"
        }, 
        {
            "index": 208, 
            "rating": "5", 
            "review": "Beautiful Wedding!. This church was the venue for my cousin's wedding in May. Not an extremely big place, but nice and acommodating. The priest preached both in english and spanish. Since it's not as big as a regular church, and there were many people, it was very hot due to the muggy weather. However, it's a beautiful place to get married at."
        }, 
        {
            "index": 209, 
            "rating": "4", 
            "review": "Quaint little church. Very pretty church, as you walk in you can smell the flowers and there are numerous flowers inside the church. Nothing fancy but pretty"
        }, 
        {
            "index": 210, 
            "rating": "5", 
            "review": "Be a among people of faith and family. I always attend mass in Mexico They are a people of faith and and family.Despite my limited Spanish attending Mass and taking communion and kneeling beside a humble people of Mayan and Spanish descent is for me a transcendent experience."
        }, 
        {
            "index": 211, 
            "rating": "5", 
            "review": "Best little church. Have gone to this church for Easter Mass the last two years. Like everywhere we've been, we were welcomed like we were a local. And the pastor even gave us an English Easter blessing.\nGreat Church."
        }, 
        {
            "index": 212, 
            "rating": "5", 
            "review": "Beautiful Church. I just stopped by for a short visit and it was worth finding the church. There are beautiful but simple stained class windows. It was a very peaceful place to sit for a moment and be thankful for all I have."
        }, 
        {
            "index": 213, 
            "rating": "5", 
            "review": "Beautiful church. Located on 5th Avenue,this is a beautiful church. It's open day and night to pop in for a visit. 10 AM mass on Sundays is in English."
        }, 
        {
            "index": 214, 
            "rating": "5", 
            "review": "Beautiful church. We were delighted to attend church here twice while staying in Playa del Car.The Sunday mass was complete with mariachi band.We felt very welcome here and enjoyed the music and the service."
        }, 
        {
            "index": 215, 
            "rating": "5", 
            "review": "Love this Church!!!. My wife and I enjoyed being able to go to Mass at Nuestra Senora del Carmen Catholic Church and at Capilla de Nta Señora del Carmen on the beach."
        }, 
        {
            "index": 216, 
            "rating": "5", 
            "review": "an oasis. a really nice surprise to find this chapel! It was beautiful and a very peaceful stop. My kids were our scuba diving in fairly rough conditions and I was glad to have a quiet moment to ask Mary to watch over them!"
        }, 
        {
            "index": 217, 
            "rating": "5", 
            "review": "Beautiful Mass. My husband and I got to attend Sunday Mass at Nuestra Senora del Carmen and it was such a lovely experience. It was all in Spanish (as expected), but they did provide a pamphlet with the readings in English. It isn't air-conditioned, but there was good ventilation and I was fairly comfortable. The Mass only lasted 50 minutes and that was even with it being a First Communion day. The fantastic music was a highlight.Note: if you'd like to attend Mass in English, the church has a pretty chapel at the end of 5th Ave. near the ferry dock. They have many English Mass options on Sundays."
        }, 
        {
            "index": 218, 
            "rating": "5", 
            "review": "Beautiful Little Church. While visiting Playa del Carmen during the day, we strolled upon this beautiful church right in the heart of 5th avenue. What a awesome setting right next to the beach!!"
        }, 
        {
            "index": 219, 
            "rating": "5", 
            "review": "churces how they used to be. What a lovely little church this is and so welcoming. Even at night time (which is when we visited) the church was more than half full with local people and travellers alike. It seemed a bit odd in the middle of 5th Avenue but on reflection, how convenient for travellers to take a moment out and enjoy the peaceful and quiet composure of this little building"
        }, 
        {
            "index": 220, 
            "rating": "5", 
            "review": "Truly Inspirational. One visit to this beautiful little church, and I was mesmerized. I actually came back with rosaries for my family, asked Padre to bless them, and worshiped here. I can't describe to you the peace and spirit that was in my heart. Simply moving."
        }, 
        {
            "index": 221, 
            "rating": "5", 
            "review": "Beautiful little church. I am catholic so this isn't a tourist attraction for me but rather a place of worship. Daily mass at 7:00. Adoration. Loved the mass. Beautiful. For non Catholics please do come in and feel the Holy Spirit here."
        }, 
        {
            "index": 222, 
            "rating": "5", 
            "review": "Gorgeous Church overlooking the Ocean. This is a must see beautiful church overlooking the ocean. It sits at the begining of La Quinta (5th ave in Playa del Carmen)"
        }, 
        {
            "index": 223, 
            "rating": "4", 
            "review": "Beautiful and Serene!. Whenever I come to Playa I attend english mass at 10am on Sundays. I also pop in during the day for a few minutes of quiet prayer whenever I am passing by. My dream is to celebrate our 25th wedding anniversary here with family and friends."
        }, 
        {
            "index": 224, 
            "rating": "5", 
            "review": "BEAUTIFUL. Very beautiful little church in playa del carmen,loved the sea view while in mass.once out of mass you can stroll through 5ta avenida."
        }, 
        {
            "index": 225, 
            "rating": "5", 
            "review": "just nice!. nice please to stay for a while, even if you don`t believe in church, usually people get married there, with white and gold mariachi."
        }, 
        {
            "index": 226, 
            "rating": "3", 
            "review": "local church. Very quaint church in the middle of a busy intersection. There appeared to be a service when we were there so we did not disturb it. Took pictures from the entry way and around it but it seemed simple."
        }, 
        {
            "index": 227, 
            "rating": "3", 
            "review": "As a mexican, this doesn't impress me. But has a great view.. It's a beautiful place, actually its the first church in Playa del Carmen and around 12 years ago some people wanted to take it down because it's located in such a commercial spot but the local people, thankfully, didn't allow it. Now I think it gives a nice touch to La Quinta Ave. but, in my opinion, it's not such a splendorous church, I prefer colonial style because I believe the are much more traditional and full of history."
        }, 
        {
            "index": 228, 
            "rating": "4", 
            "review": "Nice place for Mass. We enjoy going to Mass with locals when traveling, so sought out this church. The Sunday evening Mass seems to the the most popular. The church is full of young families, older couples, and residents and some tourists, a nice mix. The mass I went to was in Spanish, but you can check their schedule for English masses. The church is easy to find in Playa, a few streets off 5th Avenue."
        }, 
        {
            "index": 229, 
            "rating": "4", 
            "review": "Inspiring. A must see, gorgeous. It was amazing as to how many people were there to just sit and pray. A very religious place."
        }, 
        {
            "index": 230, 
            "rating": "5", 
            "review": "Beautiful. Very traditional if you are catholic and even if your not it's a nice church to visit. Go here when you are on a tour or exploring the city."
        }, 
        {
            "index": 231, 
            "rating": "5", 
            "review": "Adorable Church. We got married here, the church is small, simple, but beautiful. It's naturally decorated, so we didn't have to spend money on flowers and decorations."
        }, 
        {
            "index": 232, 
            "rating": "5", 
            "review": "Beautiful little church. I atteneded an english mass on the last Sunday in December 2012. It was a beautiful service since the church is small but it was not crowded. Wonderful music. There is a glass wall behind the atlar overlooking the beach, palms, and the sea (you may be easily distracted:)\nThe prist spoke fluent English. Highly recommended!"
        }, 
        {
            "index": 233, 
            "rating": "4", 
            "review": "Christmas eve mass. A beautiful little chapel overlooking the sea.\nWe went to the english mass on Christmas eve together with so many tourists\nfrom all over the world. The chapel was packed but the experience was quite special."
        }, 
        {
            "index": 234, 
            "rating": "5", 
            "review": "Pretty white chapel by the sea. Mass in English at 10 am Sundays , lovely little chapel with sea view behind the altar. Must be a great place to be married, very romantic."
        }, 
        {
            "index": 235, 
            "rating": "5", 
            "review": "A wonderful place to worship. Had our wedding here. Local priest, Father Hubert, gave an incredible mass and the services were attended by our group as well as some locals. Beautiful Chapel and a memorable place to get married."
        }, 
        {
            "index": 236, 
            "rating": "4", 
            "review": "Church. very accessible and great to visit and reflect after walking around.\nIt very small so not intimidating."
        }, 
        {
            "index": 237, 
            "rating": "5", 
            "review": "Perfection!. We had our wedding here, just perfect!Father fernando is the best! Gives mass in a short, sweet, simple and concise fashion without beating around the bushes and makes it enjoyable and spiritual. The chapel is just the right size, not too big or not to small. Has air conditioning. The view is to the sea and nature. Great location at the start of 5th avenue! "
        }, 
        {
            "index": 238, 
            "rating": "4", 
            "review": "very nice. Wonderful experience here for Sunday morning mass. They even asked an American tourist to read the first reading, which was very thoughtful. They provide you English versions of the readings so you can follow along. It was very warm as there is no air conditioning, so if you can sit near the door it will be cooler."
        }
    ]
}