{
    "category": "Siem-Reap", 
    "entity": "Banteay-Samre", 
    "avg_rating_stars": 4.508928571428571, 
    "review_count": 336, 
    "rating_stats": {
        "poor": 3, 
        "average": 24, 
        "terrible": 1, 
        "very_good": 104, 
        "excellent": 204
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "Another interesting temple. The temples are not to be missed!!! If you're visiting Siem Reap or Cambodia, seeing these are amazing (although the most important, imo, are Angkor Wat and Angkor Thom)."
        }, 
        {
            "index": 2, 
            "rating": "4", 
            "review": "Not so crowded. This is the most desolated temple I have visited in Siem Reap. It is not very popular among the others. Anyway, if you do not like crowd you will enjoy visiting here."
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "Nice temple. This temple has some similarities with Angkor wat temple.\nThe architecture is similar.\nWorth a watch,Magnificent in its own way."
        }, 
        {
            "index": 4, 
            "rating": "4", 
            "review": "Small, but perfectly formed . Spent about 45 minutes here with my guide. It's not huge and a lot of it is off limits, but it is in great condition and is pink in places. A real little gem. Definitely worth a visit"
        }, 
        {
            "index": 5, 
            "rating": "4", 
            "review": "The First Temple We Visited. This was the first temple we visited. Arriving at about 8am we had it virtually to ourselves. It was a lovely 'first' as it was quiet, we got some wonderful photos and it was not yet overly hot.Make sure you get to the causeway which is lovely - some great shots to be had looking over the same from the temple.I've only rated it a four as if you have limited time it is not a MUST see - but if you have more than two days it is a good addition to an itinerary.I was pleasantly surprised by how clean the bathroom facilities were here!"
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "well worth the trip. the architecture was simply amazing. If it wasn't so hot that day I could have spent at least 2 hours taking pictures and admiring it. We read up a good bit before visiting, so we knew who the characters were that were represented and had some idea what the meaning was. Because it's remote there's not nearly as many tourists. It may be my favorite temple out of the bunch. We negotiated a tuktuk to take us here and the 'nearby' (actually about 15km) Kbal Spean for $23. The coffee at the little coffee shop near the entrance was terrible. Unless your children have an abnormal interest in Khmer history or architecture and bas reliefs, I'm not sure why you'd bring them. Seems they won't enjoy it."
        }, 
        {
            "index": 7, 
            "rating": "4", 
            "review": "Nice temple. This temple is out of Angkor area and do not have many people going to visit there but it is nice place for visit "
        }, 
        {
            "index": 8, 
            "rating": "4", 
            "review": "Another amazing citadel. This is another citadel- like temple in Siam reap. It is around the same region as the rest of the temples and is reachable by either tuk tuk or cab. There are some families that travel by bicycle. Do enjoy the scenery and reading up before the trip would help alot."
        }, 
        {
            "index": 9, 
            "rating": "5", 
            "review": "Awe some. I have already done a review of this attraction. What else can i say except a must see and worth the trip."
        }, 
        {
            "index": 10, 
            "rating": "5", 
            "review": "Highlight of Khmer Architecture -Splendor. After Visiting Bantea Srei i headed to Bantea Samre , its one of the finest temples built in Hindu temple -Indian Architecture . the temple is bit far from Siem reap town, hiring a tuk tuk for a day will do good. There are some restaurants and refreshments around and vendors along the side , its not much crowded . The temple sructre is well bult with intricate carvings , the sanctum of the temple is built on a elevated platform and the surrounding the prdasstal platform of the temple sanctum is adorned with nagas sculpture . The main entrance and the causway is built in traditional Khmet Angkorian architectural style. I spent an hour strolling around the temple . Its really a wonder to reflect upon the the intricate details and the precision of the temple engineering that Khmer Kings have evolved over the ages and it still stands as a legacy and epitome of their empire and glorious past."
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "beautiful!!. I really enjoyed visiting this temple, it is small and we went late in the afternoon so there was no one there except for us which is really nice, the ride there was also very fun in the tuktuk!!!"
        }, 
        {
            "index": 12, 
            "rating": "5", 
            "review": "Another cool temple. Another cool and amazingly detailed temple...but beware of temple overload...you could probably skip this one."
        }, 
        {
            "index": 13, 
            "rating": "5", 
            "review": "Amazing. Don't be afraid by the stairs as it worth a visit definitively !\nBut please be carefull especially on the return way. It is very tight and dangerous especially on a rainy day"
        }, 
        {
            "index": 14, 
            "rating": "4", 
            "review": "Beautiful!. I don't know what it is about ruins, but they are beautiful. This one has stunning stonework, slightly different than the others, and it was far less crowded as well."
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "No Crowds - quiet and peaceful!. You can visit Banteay Samre on the same trip as the Butterfly Farm, Banteay Srei, and the Landmine Museum. Visit Banteay Samre after you have visited the other attractions. The tuk-tuk ride is interesting and enjoyable.The temple is beautiful with lovely colours and tones. There was no body else in the temple when we visited - it was very quiet and peaceful."
        }, 
        {
            "index": 16, 
            "rating": "5", 
            "review": "My Favorite Temple this is a must see!. I friend recommended this as a must and although it was $28 US for the day for a tuk tuk and driver(not guide) it was worth every cent this temple is gorgeous ,lovely colored stone and amazing detailed carving"
        }, 
        {
            "index": 17, 
            "rating": "4", 
            "review": "History. Stocked with carvings and history..you wish the walls could share..well worth visiting but always don't be rushed..enjoy all you find as often you see much more"
        }, 
        {
            "index": 18, 
            "rating": "4", 
            "review": "Worth the trip. This Hindu temple is more than an hour away from Angkor by Tuk Tuk (maybe half that time by car). But it is worth the trip to see the rose-colored sandstones, very nice and still recognizable carvings and structures which actually look like mini temples spaced apart. A trip here also gives an opportunity to see the Cambodian countryside. Serene and enjoyable."
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "Must visit though out of the way. Banteay Samre is not in the usual itinerary for most tourists to Angkor Wat complex but worth a visit. It is similar in architecture style to Angkor Wat on a smaller scale. It is probably built around same period given the similarities. This temple is not that visited so one can spend hours here admiring the stone carvings. A unique feature of the temple is a moat around it (but no water) similar to Angkor Wat. Interesting place."
        }, 
        {
            "index": 20, 
            "rating": "5", 
            "review": "Close To The Landmine Museum. Part of the Angkor complex of ancient temples built to honour the Hindu Gods. Close to Angkor Wat, a must see."
        }, 
        {
            "index": 21, 
            "rating": "5", 
            "review": "Excellent. About an hour and a half drive from Siem Reap, this temple is in reasonable order and less crowded due to it being further away. Very interesting with the trees trying to take over the temple. Worth the drive."
        }, 
        {
            "index": 22, 
            "rating": "5", 
            "review": "The hidden gem of Angkor. An absolute gem! Forget Banteay Srei, this one is far better - especially if you have young kids - plenty of places to climb and plenty of areas to get lost inside the temples. I understand it is even better in rainy season as the moat can fill up with water. Well worth the trip here and with plenty of shade to escape the heat it is a must. Avoid the restaurant opposite though as they charge stupid prices for standard food. This temple is also hardly visited by tourists so you really will have the place to yourself for those classic Angkor photos."
        }, 
        {
            "index": 23, 
            "rating": "5", 
            "review": "A treasure, and less-visited than most. It's the Wandering Yank here. Mrs. Yank and I spent 3 wonderful days touring the Angkor area. Our guide, bless him, suggested this temple, and we're glad he did.We had it almost to ourselves. The walls, carvings and temple buildings are in excellent condition, although like elsewhere some of it is in ruins. It was a very worthwhile stop, which I recommend unless you're trying to see all of Angkor in 1 day.2 thumbs up!"
        }, 
        {
            "index": 24, 
            "rating": "4", 
            "review": "fine carvings. the extra effort needed to reach Banteay Samre proves worthwhile because you get to see the magnificent elaborate temple architecture and the fine carvings."
        }, 
        {
            "index": 25, 
            "rating": "4", 
            "review": "Another amazing medieval Khmer temple. Another amazing medieval Khmer temple. One of my most favourite across this beautiful archaeological park. Dedicate at least an hour to walk across these amazing stones and then dine out in one of the open air Cambodian restaurants. A delicious traditional Khmer dish is a must for you to connect more fully with the meaningful Cambodian history."
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "A Wow place!. Amazing place! There is no bad angle so anywhere you stand the photo will be awesome! We had hired a guide for the entire day to accompany us to all sites and it was money well spent. Yeah you should go and be wowed!"
        }, 
        {
            "index": 27, 
            "rating": "5", 
            "review": "One of the queiter places. Not as many visitors. But still beautiful and hauntingly attractive. Most of the time it felt like we have th whole site to ourselves, with plenty of great photo opportunities"
        }, 
        {
            "index": 28, 
            "rating": "4", 
            "review": "on the big loop!. Angkor Wat, Ta Prohm, Bayon and others are of course the biggest but not always the one that will touch you. Many small temples located on the big loop worth a visit. Their atmosphere will take you away."
        }, 
        {
            "index": 29, 
            "rating": "4", 
            "review": "Beautiful and Isolated. When we visited Banteay Samre, we were the only people in the entire complex, aside from a guard (who followed us around a little bit). Although it wasn't the most incredible temple we visited, we certainly enjoyed being the only people around. It is still very beautiful and well preserved, so if you have the time, add it to your list! It's a nice change of pace from overcrowded temples like Angkor Wat!"
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "beautiful building. We are heading for Banteay Srei when we stop here. So many beautiful details here. The building structure is attractive. We spent about 2 hours in this place"
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "Uplifting and spiritual. We rode bicycles the 25+ miles to Banteay Srei (50+ round trip depending on where you are staying), and the bike journey added to the spiritual nature of the temple itself. I felt a higher sense of consciousness as I walked the temple grounds. And after the journey, a Cambodian beer tastes like nectar of the gods."
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "Another part of this amazing area. This is yet another impressive portion with yet more stunning photo opportunities while wondering at the endless detail and workmanship involved!"
        }, 
        {
            "index": 33, 
            "rating": "3", 
            "review": "after Banteay Srei, you usally continue to Banteay Samre. It's quite far from Banteay Srei but usually you will go to this temple after Banteay Srei. After sometime, you feel like all temples are the same ;-))"
        }, 
        {
            "index": 34, 
            "rating": "5", 
            "review": "Charming and a lot less crowded. Banteay Samre (built in the first half of the 12th century) is in a relatively isolated location so receives less visitors than the temples at Angkor. Amazing carvings and definitely worth visiting."
        }, 
        {
            "index": 35, 
            "rating": "4", 
            "review": "Nice and quite. This temple is outside main Angkor Wat temple complex.\nThe construction and the artwork is lovely.\nWe enjoyed visiting this beautiful temple as it was not over crowded."
        }, 
        {
            "index": 36, 
            "rating": "5", 
            "review": "Quiet. This temple is a little bit off the beaten track and offers everything a Khmer temple needs in a very small area. So not many tourists and not much walking..."
        }, 
        {
            "index": 37, 
            "rating": "5", 
            "review": "Great place to explore!. Defiantly add this to your list of temples. My children loved that they could climb around and explore the temples. Go early, as it gets busy!"
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "Very nice temple located about 7 o8 kms from Angkor Wat & Angkor Thom.. Much fewer visitors than Angkor Wat and Angkor Thom but well worth the trip. The temple was renovated a long time ago so it is visually very nice and great for photo ops."
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "good. Good but not obligatory to see it if you dont have much time. its quite in good condition not crowded"
        }, 
        {
            "index": 40, 
            "rating": "4", 
            "review": "Fine temple. May have been getting templed out by this time, it was our third day. But just wasn't as impressed with this temple as the others. Smaller and limited access to the interior of the temple."
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "I'm awed!!. Majority of the ruins and temples of Siem reap are just simply amazing, stunning, All you can do is look at it, internalize the beauty and wonder how these ancient people constructed these temples with their hands. Thinking that we are advance now? i dont think so, after seeing these ruins and temples i am convinced that we are just startng to discover new things. But these people in ancient times are way better ahead of us. all the walls have intricate carvings??? who would do that?"
        }, 
        {
            "index": 42, 
            "rating": "3", 
            "review": "Not as great as the \"major\" temples. This large and relatively flat temple is interesting and easy to hike around, but not as spectacular as the other major draws in the area. If you have to skip something, this is the one to skip."
        }, 
        {
            "index": 43, 
            "rating": "5", 
            "review": "Another Siem Reap Must. The ruins are Banteay Samre are stunning, amazing, and provide for some outstanding photo opportunities."
        }, 
        {
            "index": 44, 
            "rating": "4", 
            "review": "It's easy to be the only people here .... Some reviewers may have confused this temple with Banteay Srei, which is further from the whole Angkor complex. Banteay Samre is a short distance east of the reservoir of Srah Srang and can be visited after sunrise at the reservoir - we did this and found that by arriving at the temple around seven thirty in the morning there was absolutely no one there apart from a sleeping cat and two local women sweeping - and even they all disappeared ...It's a wonderful experience to have an Angkor temple entirely to yourself and it felt very special as we walked around the (dry) moat in the golden early morning sun, which cast a lovely glow on the stones. The temple was built in a sort of Angkor Wat style in the 12th century and must have been very beautiful when there was water in the moat to reflect the walls and towers.Between Srah Srang and Banteay Samre are a couple of villages where it's well worth stopping to take photos - we were lucky enough to see a small herd of water buffalo tethered by the road who were as interested in us as we were in them!"
        }, 
        {
            "index": 45, 
            "rating": "3", 
            "review": "beautiful to see, but less than other temples. Even this temple is worth to see, but not as much interesting as other big temples. Banteay Samre is to visit together with Banteay Srei, they are in the same region."
        }, 
        {
            "index": 46, 
            "rating": "3", 
            "review": "Nice and peaceful temple. Quiet nice and peaceful. Carvings on the two libraries are nice and so is the site. Good to combine with Bantai Srei."
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "The 2nd best temple in Siem Reap. This is the 2nd best temple in Siem Reap (after Angkor Wat) in my opinion. I love it because it's very different from other temples and really stands out, except that it's far too crowded, best to go in early morning or late afternoon to avoid tour groups."
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "Banteay Srei & Kbal Spean. We had another day tour with Tivorn Vun of Angkor Amazing Adventure to Kbal Spean & Banteay Srei. Although it was rather had to go up the mountain for Kbal Spean, we could walk under the shade of the trees and the ruins were interesting to see. I was surprised to see so many beautiful curvings left so clearly in Banteay Srei. Our guide was knowledgeable and often made us laugh with lot of nice jokes."
        }, 
        {
            "index": 49, 
            "rating": "2", 
            "review": "Heavily looted. . I was tired after biking to Bantey Srei and then to Bantey Samre. It was also hot. But I did not care too much for this temple as the looting of door panels was really noticeable. Faces hacked off, panels missing. It lacked the finer details that make a temple great. I don't think you are missing much if you skip it."
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "Another temple worth visiting. There are so many temples to visit each with their own features. This one is well w oath a visit with its many carvings"
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "A trip to Banteay Srie. Located about 35kms (40mins) from the main complex this small temple is beautiful and well worth the trip. The reliefs are all much shaper than Angkor Wat and Angkor Thom. It will take about 1 hr to look at this properly."
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "Lovely to spend quiet time!. This was one of those temples for us which was not being milled around by tourists. I spent a quiet time with a lazying cat, my husband spent quiet time with his camera and I saw other people who also enjoyed this one at a leisurely pace. Would recommend!"
        }, 
        {
            "index": 53, 
            "rating": "4", 
            "review": "Excellent Visit. We particularly enjoyed the approachable scale of Banteay Samre and it was possibly our favorite temple. Although largely unrestored, the quality and artistry of the carvings and layout of the architectural elements of the temple are charming and special."
        }, 
        {
            "index": 54, 
            "rating": "5", 
            "review": "Fine handicraft of this temple is just amazing!. This is my favourite of all the temples I visited, 6 altogether! The fine carvings of these temples seem wood carvings, the details and colours of the carvings were made with love and dedication,"
        }, 
        {
            "index": 55, 
            "rating": "5", 
            "review": "Great. It seems to be a bit more modern, however it is awesome, a bit different but eually impresive, visit it."
        }, 
        {
            "index": 56, 
            "rating": "5", 
            "review": "Little different. Very close to Bantey Srei this temple dedicated to Shiva has been subject to mutilation by thieves seeking antiques. Elaborate architecture and carvings are hallmarks of this monument. A unique characteristic is the interior moat. All the buildings around the moat are on a raised base decorated with horizontal mouldings and statues."
        }, 
        {
            "index": 57, 
            "rating": "4", 
            "review": "Nice remote not restored temple.. If you decide to visit this temple, try to avoid China. I have been there at around 9am, their buses arrived at around 10am. Then it became extremely crowed."
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "Great site. Like all the rest of the complex this is an outstanding site. The carvings are rather different than others and thus well worth the visit."
        }, 
        {
            "index": 59, 
            "rating": "5", 
            "review": "Worth the trip. Angkor Wat is beautiful but awfully crowded. This charming temple is built in the same style and is a lot quieter so you can really appreciate it. Don't miss the view from down the steps which would have been the original entrance"
        }, 
        {
            "index": 60, 
            "rating": "5", 
            "review": "A very delicate temple. A nice day trip is first to Kbal Sprean, the river of the thousand linga's and the head to Bantey srei. A very nice carved temple"
        }, 
        {
            "index": 61, 
            "rating": "5", 
            "review": "Beautiful Rose color sandstone. This site is farther away from Siem Reap but I think it well worth the effort. Less crowded and the carvings and stone color make this site remarkable."
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "Beautiful, small temple complex that must not be missed.. Banteay Srei is a bit out of town and away from the main archaeological park. It is small and takes little time to go through compared to the larger temples. But it is singular in its apparent state of preservation of the stone carvings and is really an expression of high art and craftsmanship.Because the temple is small, you are likely to find yourself behind hordes of people who are all vying to take a photo at the spot you wanted. Relax, be patient and take your time. Most of these folks are in tour groups and have buses to catch and they will pass -- until another bus shows up. Having time to look and take photos at your leisure is your best asset, so I prefer coming without a tour group.Take the time to walk around the moat that surrounds the temple complex. There are lovely views to be had, reflections in the moat and some shade and breezes. At least that is the case before the full-blown dry season, when the moat may be empty. "
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "I think visiting the further temples is worth it. If you are short in time, it's not an absolute must although it is really beautiful. What I liked about going further out is just understanding the sheer size of this old magical kingdom. Can't imagine what it must have been like hundreds of years ago on elephant back through the jungles."
        }, 
        {
            "index": 64, 
            "rating": "4", 
            "review": "Different and empty. This temple is different from all the others and well worth a visit even if you don’t need to spend too much time here. Rather few visitors. Maybe not a temple to go to exclusively, but well worth a stop on the way to the others around it."
        }, 
        {
            "index": 65, 
            "rating": "5", 
            "review": "Calm. Another beautiful temple to visit, but much calmer than the others so you have more of a chance to take it in in your own pace. Look out for the two temple cats!"
        }, 
        {
            "index": 66, 
            "rating": "4", 
            "review": "Ancient Temple. Be prepared to walk alot. Hugh build up. Very old and falling structure being propped up. Uneven floors with steps. Wear comfortable shoes."
        }, 
        {
            "index": 67, 
            "rating": "4", 
            "review": "Temple for the Farmers. It was quite intriguing to learn that Banteay Samre meant the temple for farmers from our guide, David. He told us the legend of the king who loved sweet cucumber planted by certain farmer which ended in tragedy. The complex of the temples was interesting however it involve certain climbing of steep steps. The inner court of the temple has several libraries with various carving of Hindu gods on its roofs. The place is worth an hour to walk through."
        }, 
        {
            "index": 68, 
            "rating": "4", 
            "review": "Nicely combined with the rest of the nearby temples.. Very interesting ruins and older than the nearby popular Angkor Wat temples. If you want to make it to the top of the temple, try going there as early as possible, because sun can get really annoying. Luckily, this temple is not so crowded like Bakan top, but still you need to be appropriately dressed."
        }, 
        {
            "index": 69, 
            "rating": "3", 
            "review": "Large but I was not overly impressed . Not sure whether I wasn't fussed about this temple because it was he end of a long day or that we had just come from Banteay Stei which is incredibly ornamented with carvings.In any case, this temple is large enough but underwhelmed us.Come by if you have spare time but in my view, not worth missing other sites for."
        }, 
        {
            "index": 70, 
            "rating": "3", 
            "review": "A small ruin, but interesting architecture.. Banteay Samre wass a long drive from Siem Reip and other main ruins such as Angkor Wat. We made a mistake of seeing Angkor Wat, Angkor Thom, Bayon etc. and Banteay Samre on the same day. Plan to see Banteay Samre another day because it was a long drive. We were too tired by the time we reached there."
        }, 
        {
            "index": 71, 
            "rating": "5", 
            "review": "Peaceful temple. We had the most fun in this temple as it was not as crowded as Angkor Wat/Bayon/ Ta Phrom temple. We were able to walk around freely, explore every walkway and take our time taking pictures.This temple is located further away from Ang kor Wat and I would recommend to combine in into a day trip to Bantrey Srei."
        }, 
        {
            "index": 72, 
            "rating": "4", 
            "review": "Worth the drive. This temple is quite a distant north-east of the main Angkor Wat area but is worth visiting. We visited it the day before we did Angkor Wat and Angkor Thom and it is a great entree into the history and culture of the area."
        }, 
        {
            "index": 73, 
            "rating": "4", 
            "review": "Serene and pleasant. A Hindu temple in the Angkor Wat style from the early 12th century. This a serene place to stop by. The Named \"Samré\", comes from ancient people of Indochina"
        }, 
        {
            "index": 74, 
            "rating": "5", 
            "review": "Avoid the crowds. Not the most intricate temple in Siem Reap but it was the least crowded of all the ones I visited. You are guaranteed to get some great photo ops with no tourists in the background."
        }, 
        {
            "index": 75, 
            "rating": "5", 
            "review": "A nice site to visit. Being part of Angkor Wat archaeology site, it is worth a visit. Quite some details can be seen on the walls."
        }, 
        {
            "index": 76, 
            "rating": "4", 
            "review": "Visit on your way back from Banteay Srey. It's not as visited as the other temples, but that makes it more serene and pleasant to visit peacefully. Worth a visit if you plan a day to the Phnom Kulen, then Banteay Srey - include Banteay Samre on your way back."
        }, 
        {
            "index": 77, 
            "rating": "4", 
            "review": "One of the oldest. As one of the oldest temples, it is impressive. The carvings are slightly different than other carvings in other temple due to archeological dating. A large part of the temples is already crumbling, also fused with the nature."
        }, 
        {
            "index": 78, 
            "rating": "5", 
            "review": "Just an incredible structure. We really enjoyed seeing Banteay Samre and recommend adding this one to your list of temples. A little bit less crowded which was nice and still as interesting as many of the other structures."
        }, 
        {
            "index": 79, 
            "rating": "5", 
            "review": "Smaller peaceful temple. It's a drive to get here but worth the trip. The carvings and sandstone are different than the other temples we visited. Beautiful"
        }, 
        {
            "index": 80, 
            "rating": "5", 
            "review": "Known as the \"Women's Citadel\". The carvings at this temple were done by women and the best of its kind. We visited a lot of temple and by far this one was the most intricately carved. Leave it to the women to make things right. Beautiful pink sandstone remains unpainted. Truly a gem among temples. Glad we visited."
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "A must for all travellers.. My absolute favourite. A must!\nIt is so delicate, small and with such wonderful day colours and awe-inspiring."
        }, 
        {
            "index": 82, 
            "rating": "5", 
            "review": "Combined with Banteay Srey, Landmine Museum and Butterfly Center. Small and quiet. I came here after visited Banteay Srey and Landmine Museum. It was noon and totally enjoyed the place by myself. It is well preserved and worth the time if you plan to visit Bantey Srey, Landmine Museum and Butterfly Center as well."
        }, 
        {
            "index": 83, 
            "rating": "5", 
            "review": "Amazing! Another great visit in Siem Reap. Just like many other places, Banteay Samre is spectacular. Must include this on your trip while visiting the landmarks of Siem Reap"
        }, 
        {
            "index": 84, 
            "rating": "5", 
            "review": "A Quieter Temple. Banteay Samre is a beautiful place to visit. The architecture of the stones and temple are classic Khmer in style and the colors of the bricks and pillars have been favored with age. Beautiful!"
        }, 
        {
            "index": 85, 
            "rating": "4", 
            "review": "Angkor Wat style. This temple was located east of the East Baray. It was built by the same architect of Angkor Wat but it's much smaller in scale. If you have already visited Angkor Wat, you can skip this temple. However, this temple was rather quiet with fewer tourists so I enjoyed my visit there too."
        }, 
        {
            "index": 86, 
            "rating": "5", 
            "review": "Impressive Complex. Well worth a visit. Lovely temple complex and far, far fewer visitors than other sites so you can explore at your own pace and in relative quiet."
        }, 
        {
            "index": 87, 
            "rating": "2", 
            "review": "so-so temple, Angkor Wat style. this one requires an enjoyable ride through rice fields to get to. the temple itself is in good shape, however it is quite similar in style to Angkor Wat, so there will be nothing you havent seen before, and it is quite a ways off the Grand Tour circuit. I would visit Banteay Srei instead, if choosing between the two."
        }, 
        {
            "index": 88, 
            "rating": "4", 
            "review": "Peacefull. Good place to come after Banteay Srei. Very peaceful place to walk around. Reminded me of Mexico Yucutan with straight roads leading out into the jungle to get to other temples."
        }, 
        {
            "index": 89, 
            "rating": "5", 
            "review": "A lovely little treasure.... If you've already visited the bigger temples, with the thousands and the hordes, and you've got a couple of spare hours and not feeling too templed out, this temple could provide a bit of peace and quiet, yet you're still seeing something quite spectacular. Personally, I really loved this temple. Banteay Samre is like a miniature of the big Angkor-wat style temples, although there is a big wall that goes all the way around, which is made of laterite, and so has that lovely orange glow. The towers are smaller, and more compact and pushed together. The carvings are in good condition, so take some time to get a closer look.I went late afternoon, and was practically the only person there. There were more guards than visitors! The only shelter there is under the trees next to a small line of shops. You can cover this temple in less than an hour. No climbing is required as it is completely flat. Surprisingly, there’s a lawn inside, between the wall and the temples.It’s a bit of a way out, and so is recommended to stop here, on the way back from Banteay Srei, which is even further out."
        }, 
        {
            "index": 90, 
            "rating": "4", 
            "review": "Very nice! . Another quality structure! Quite beautiful as its set in the back of the trees and it's not so busy here either which is nice to wander round"
        }, 
        {
            "index": 91, 
            "rating": "3", 
            "review": "Small but great to see on the way to Kbal Spean. It is small but very close to the Kbal Spean falls recommend you see it if you are already in the area."
        }, 
        {
            "index": 92, 
            "rating": "5", 
            "review": "The highlight of the Angkor Watt visit. We managed to fit a trip in as part of our busy Angkor Watt trip! It's a bit of a way out, about 40 minute taxi drive but is worth it. It is very well preserved, and the detail on the temple is excellent. Different from the other temples in terms of its colour. There is an interesting exhibition there as well."
        }, 
        {
            "index": 93, 
            "rating": "4", 
            "review": "Banteay Samre - Temple with great structure. The structure of the temple still well kept. Not amazed by the temple as we already seen too much similar temple. Anyway, it's still worth to visit if you are booking a tuk tuk for whole day."
        }, 
        {
            "index": 94, 
            "rating": "4", 
            "review": "Small bumblebee. Quite far far away and isolated from the complex's major sites, still, it worth giving it time to see well-preserved and delicated artworks in there."
        }, 
        {
            "index": 95, 
            "rating": "5", 
            "review": "Amazing detail and a true wonder.. It's all been said, but when you walk around and view the vast amount of buildings and carving and the detail it just makes you marvel at it's construction. The detailed carving is everywhere on the stone. The circular carved stone window pillars amazed me how 1000 years ago these were turned and carved like a piece of wood would be carved on a motorised lathe to day, just incredible"
        }, 
        {
            "index": 96, 
            "rating": "5", 
            "review": "Quited, Romatic temple. Cambodia is wonderful and its my own country. Bantey Samre Temple is one of the most beautiful Temples in Kingdom of wonder."
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "Beautiful site !. Fantastic site in the jungle with enourmous trees, birds and wild buffalo. The old buildings are Amazing. Do not lose this great attraction."
        }, 
        {
            "index": 98, 
            "rating": "4", 
            "review": "See History before it breaks down. Restoration work in progress. It is much less crowded so you can get to see and discuss more. you need a guide"
        }, 
        {
            "index": 99, 
            "rating": "4", 
            "review": "Amazing humbling place.. Make sure you bring supplies of water and snacks. This place can get really hot. Make it part of your week's tour of Angkor Wat. Please be respectful of other tourists, and take your camera. It's a very spiritual place."
        }, 
        {
            "index": 100, 
            "rating": "5", 
            "review": "One more gem!. Another exotic Temple worth the efforts to get there!It wasnt on our \"list\" but our guide Kimthet Lay from Beyond Unique Excursions took us as its his favorite. We are so glad he did!"
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "Underrated. There is nothing more to add than had already been said a million times on here. In a time that we Europeans arrogantly call the \"dark ages\", the Khmer empire was at it's apex. Very little remains in Europe from this time period, yet the Khmer still have these treasure troves of history. It's sad that they are owned by Vietnam rather than Cambodia, but that's the way it is. I had this amazing place to myself for an hour. One of the most serene experiences of my life..."
        }, 
        {
            "index": 102, 
            "rating": "3", 
            "review": "Great. Small temple of the temple track. You still need your pass. Not many people come and visit abut it is in an extremely good shape. It original so no alteration has been done to the building itself you will have to climb on small steps. Read about it so you can place this temple in terms of time and history."
        }, 
        {
            "index": 103, 
            "rating": "5", 
            "review": "Thoroughly worth the very pleasant journey away from the main temple complex. The longer run out to this temple is in itself a treat, allowing one to see more of rural life (and stopping at the Landmine Museum is also worthwhile on the way there or the way back).The temple itself is small with no climbing involved, but very well preserved (albeit still a ruin!). The carvings are particulalrly exquisite."
        }, 
        {
            "index": 104, 
            "rating": "5", 
            "review": "Has a serene feel to it. This temple is less visited, probably because it is a little far from the city centre and the Angkor complex. This temple has an amazing symmetry. It has pathways interspersed with tiny halls that contain the Shivalinga. These pathways lead to an open hall that has a path covering its four sides and the temple building in the middle. This inner place provides you with the peace and the room to reflect on the great Khmer era gone by."
        }, 
        {
            "index": 105, 
            "rating": "4", 
            "review": "Oftern Overlooked. This Temple is often overlooked as not as well known, but certainly worth a visit. You will be able to enjoy this place in relative peace as it is quite compared to the busy temples such as Angkor Wat and Angkor Thom"
        }, 
        {
            "index": 106, 
            "rating": "4", 
            "review": "Special place to see. Banteay Samre is probably not as famous as other temples but still as beautiful as all. A little walk in and around the temple is worth it. Another one that is perfect for photographs to be taken after learning the history of the temple."
        }, 
        {
            "index": 107, 
            "rating": "5", 
            "review": "Relatively quiet with beautiful carvings. This is one of my favourite temples around the Angkor complex. It is usually relatively peaceful and has some very interesting carvings. Features include an extensive walkway that must have been truly impressive in its day. It is a lovely spot to relax and take it easy after looking at some of the more popular temples."
        }, 
        {
            "index": 108, 
            "rating": "5", 
            "review": "Banteay Samre. as ever in Cambodia every thing is So Special and wonderful... I could stay here for ever a wonderful place"
        }, 
        {
            "index": 109, 
            "rating": "3", 
            "review": "So many superlatives for these temples. A temple from the middle period of the Khymer civilization influenced people think by the mountain people of the country (due to inscriptions)."
        }, 
        {
            "index": 110, 
            "rating": "4", 
            "review": "Beautiful window and an amphitreatre. This temple has a well kept beautiful window and a large amphitheatre like platform at the rear entrance. The fertility water container is unique in Siem Reap because it combines both male and female symbols into one structure. Other than these, its another beautiful temple in Siem Reap."
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "Lovely wat. We could have been \" temples out\" with the inordinate amount of ways on our private tour but this one was slightly different- they all are. . it was a lot smaller and we spent a good time wandering about. Love Cambodia ..."
        }, 
        {
            "index": 112, 
            "rating": "5", 
            "review": "Worth the 30 klm tuk tuk ride - more along the way. Although its about 35klms north of Siem Reap its worth a visit. We hire a Tuk Tuk for half a day, left about 8am and it was a relaxed 60 min trip through the country side. The stone work is a distinctive red stone and the temple complex is compack and surrounded by a small water filled moat. We stopped off at the Land mine museum on the way back as its on the same road. Passes by the future Park Entry complex"
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "A gem. This is one of my fav temples in the Angkor region. I'm an archaeologist and I've worked in Angkor on and off for the last 20 years. I've seen the temples on the standard tourist route become too crowded. This temple, just off the standard route is quiet and it offers beatifull see-throughs. Worth going to."
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "Worth the longer trip. Small but amazingly sculpted Wat a bit of a drive outside of Siem Reap. But definitely worth the trip. Bateay Samre was amazing sculpted and a very different feel than larger Angkor area. Also seeing the rural communities was nearly as interesting. If you have the time, make the trip."
        }, 
        {
            "index": 115, 
            "rating": "4", 
            "review": "Similar design like Angkor Wat. If you choose the grand tour, tuk tuk will take you to place outside angkor thom. One of the temple is Banteay Samre. It look similar to Angkorwat because it was built unde King Suryavarman II rulings, using both red stone(Banteay Srei) and sand stone. That's the beauty of this temple. We took around 2hours to go around this place. Make sure bring a bottle of mineral water because there are no shops near by."
        }, 
        {
            "index": 116, 
            "rating": "5", 
            "review": "Well-preserved temple on the outskirts of Angkor.. Banteay Samre may be quite a distance from the center of all the temple-visiting action, but don't be deterred - it is worth it!A pathway lined with stone posts lead to the perimeter walls and the gopuras, finally to the central temple, which is reminiscent of Angkor Wat itself, only in a smaller scale. The level of preservation is astonishing - even the roof decorations are still present! The reliefs are in a similar state of preservation. With less tourists, this can offer a more peaceful alternative to some of the more famous temples. Definitely recommended!"
        }, 
        {
            "index": 117, 
            "rating": "4", 
            "review": "Far temple but worth seeing. We had to pay extra for our rental car (additional $5) but we are happy to see the temples. They were very organized in leading the people where to go, entrances and exits. They restrooms are clean enough."
        }, 
        {
            "index": 118, 
            "rating": "4", 
            "review": "Sweet. it is a Hindu temple in the Angkor Wat style, with a well preserved wall and inner courtyard, not to be missed."
        }, 
        {
            "index": 119, 
            "rating": "5", 
            "review": "Incredible Temple!. It is very nice temple with good view during rainy season. Do not miss it, must visit when you are in Cambodia. So peaceful!"
        }, 
        {
            "index": 120, 
            "rating": "4", 
            "review": "A lot still standing . This temple was part of our third day of touring temples and I'm glad we did so many days, as I would have missed this one.It's got a lot of the walls and buildings still standing, so it's great to get a feel of these temples and what they were actually like.A lot less people here, in fact I lost my husband and we didn't find each other until we were both ready to leave.I prefer these lesser known temples, as they are so much quieter and have a lot more atmosphere.If this review is helpful, please tick below:"
        }, 
        {
            "index": 121, 
            "rating": "5", 
            "review": "Wow what a lovely temple. This is a Hindu temple built in the 12th century. It is just off the grand tour route but not to far away. The temple is unusual in having an interior moat which you can walk around entirely. The centre area has some lovely stone carvings and I liked that there was hardly anyone here. A big contrast to Beyon Temple or Anghor Wat. The red sandstone is lovely and it is not a huge temple so easy to wander around enjoying the lintels and stone carvings as well as the peace and quiet.If you found the review useful I always appreciate a helpful vote."
        }, 
        {
            "index": 122, 
            "rating": "4", 
            "review": "A quiet place of reflection.. The architecture, the grand entrance and the beautiful reliefs give this place a real sense of peace and tranquillity.This is apparently, a Hindu temple build in the style of Ankor. I particularly liked the decorated barred windows and the red sandstone."
        }, 
        {
            "index": 123, 
            "rating": "5", 
            "review": "Just Amazing......... I just loved all the temples we visited, they were all amazing.......The design and architecture in that time period was something special......"
        }, 
        {
            "index": 124, 
            "rating": "5", 
            "review": "Beautiful Temple.. Worth the drive... Get here early. You get to see the countryside! Been 6 times.Very hot! Take a cooler with you!"
        }, 
        {
            "index": 125, 
            "rating": "5", 
            "review": "very well conserved temple. small temple which remains its beauty through the time. the carvings are original and very well conserved. very less people visiting this temple make it much easier to discover it and take beautiful photos. definitely one of my favorite!!"
        }, 
        {
            "index": 126, 
            "rating": "5", 
            "review": "Less Crowded, More Intact Temples. It was one of the best temples in the Angkor Complex to avoid the crowd of tourists. The architecture of the temple is also much more intact and seems to be well maintained than others. The carvings are much more pronounced and deep compared to other temples. The mixture of the pink sandstone and lava rocks that compose the temple is quite interesting."
        }, 
        {
            "index": 127, 
            "rating": "3", 
            "review": "Another one of the first day temples. We just did the small circle , and it's enough to appreciate the beauty of these buildings . The guide helped understand the building and the special interest , allow yourself time to really see the temples and don't rush"
        }, 
        {
            "index": 128, 
            "rating": "5", 
            "review": "Hidden building in forest. The temple one hidden in forest that most of people travel pass by without inspect . Most of part is keep good condition and design . Temple himself, keep long standing and environment so fresh."
        }, 
        {
            "index": 129, 
            "rating": "5", 
            "review": "Underrated . I loved Banteay Sre. There were very few people there and I wandered around aimlessly, with no other tourist to distract me. I felt like I had slipped back in time and was the first person to discover this place. I even had a scare as three or four cows wandered through the brush at the back of the temple, but I had been so caught up in the being alone aspect I almost imagined a wild tiger was about to attack ;) jokes aside, this temple has an atmosphere of quiet mystery about it, which some of the others lacked despite their size or beauty. This is a must see in my opinion. Sadly I barely took any photos of the place, I was too busy soaking it in..."
        }, 
        {
            "index": 130, 
            "rating": "5", 
            "review": "One of my favourites. This temple is a little bit away from the main temples so isn't quite as crowded as most even though it's only a few minutes' further out. There are lots of details still clear in the friezes and it's worth taking your time. There are also nagas everywhere. There were no bus groups in the time I was there and the guides tended to whisk their tourists in and out quickly so, with a little patience, you could see most of it without other people around."
        }, 
        {
            "index": 131, 
            "rating": "5", 
            "review": "So delicate!. it's a pity that we didn't have access to the main tower for a close look at the delicate carvings on the wall. The place is so so so beautiful soaked in morning sunshine!"
        }, 
        {
            "index": 132, 
            "rating": "5", 
            "review": "Off the beaten path but well worth the visit- no crowds and easy to navigate.. Banteay Samre is off the beaten path but well worth the time and effort. It is by far the easiest temple to navigate as much of it is flat compared to the other temples. The best part is that it was virtually empty when we visited and it was easy to take great photos. Because it is out of the way, you are also treated to some great scenery and you get a chance to see how the locals live. Lots of great pictures of rice paddies and small communities along the way. The 12 century Hindu Temple is dedicated to Vishnu and it appears to be a miniature Angkor Wat - similar style. The carvings and reliefs are in great shape as it must have been restored recently. Banteay Samre is one of the best temples to visit as you do not feel rushed by the crowds and you can explore the temple in a leisurely manner. Be sure to have water with you as it get really hot in the afternoon."
        }, 
        {
            "index": 133, 
            "rating": "4", 
            "review": "Red Sandstone Temple, Worth a Look. This is the farthest eastern temple. I wanted to see these temple because they used a special red sandstone to build it; making the color of the temple unique."
        }, 
        {
            "index": 134, 
            "rating": "4", 
            "review": "You should see them all!!. This is a bit out of the park but not far and worth a look. The temple has been some what restored and gives a good view of temples in this period. Small and a bit quieter then some of the others which was a good thing."
        }, 
        {
            "index": 135, 
            "rating": "5", 
            "review": "Banteay Samre. A good temple with excellent bas reliefs and much quieter. This temple is within easy reach of Siem Reap and can be visited en route to Banteay Serai."
        }, 
        {
            "index": 136, 
            "rating": "5", 
            "review": "Angkor Wat style, but without the crowds.. This is a restored Angkor Wat style temple with a single tower. It is a little drive out, by East Baray, so there were not as many tourists, which we appreciated! This temple, flanked by two libraries, has been restored. Banteay Samre has a long causeway. It was built for boats to be able to come to the temple. Because this is a fairly small temple, it seemed more intimate and approachable to me. This should be seen when you are also touring Banteay Srei, but it should be seen!"
        }, 
        {
            "index": 137, 
            "rating": "5", 
            "review": "My favorite @ Siem Reap. Not the most famous one but ended up being my favorite. Not many visitors around and those being there (around a handful) were quiet and enjoyed the tranquility). The stones yielded different shades of color under the sun and you can sit in the shades to wonder back thousand years. Highly recommend to have a quiet hour there, doing nothing, see everything."
        }, 
        {
            "index": 138, 
            "rating": "5", 
            "review": "Smaller, more compact temple. We were pretty much alone at this temple when we visited, it is smaller and has a bit of a fortress feel. There are unique spires on the roof tops, lending a slight Victorian look. Try to find a good version of the fable of the 'sweet-cucumber king' (we had ours in a Japanese guide book) and reading while sitting there in the shades."
        }, 
        {
            "index": 139, 
            "rating": "3", 
            "review": "Tour groups do go there!. Tuktuk drivers will tell you to go here and that tour groups don't go, yet they most certainly do!!We pulled up here on the advice of our tuktuk driver, walked for about 30 seconds, and a coach full of French tourists pulled up right behind us. Granted, nobody else was in the temple but it's naive to think tuktuk drivers know something tour guides and coach companies are not aware of!The temple itself is a few mins walk from the road but it's a nice walk. Once within the temple you have some decent photo opporunities and some nice views of the temple, although both the temple and grass are well worn by the thousands of tourists (seemingly only brought here by tuktuk) each day.A nice temple but nothing that makes it especially interesting. There are much better options available."
        }, 
        {
            "index": 140, 
            "rating": "5", 
            "review": "One of My Favorites. My driver recommended my visiting this temple because it is not on the hit list for the large busloads of tourists that can easily overwhelm a site. This ancient Hindu temple was a favorite of mine probably because I could spend time without the hordes of tourists that are seemingly everywhere. The carvings and design are similar to other Khmer temples, but you have the time and the space to explore them on your own. It was one of the highlights of my week in Siem Reap."
        }, 
        {
            "index": 141, 
            "rating": "5", 
            "review": "fantastic carvings. Another beautiful temple, one of the top 12, with fantastic carvings. Tour groups don't go there, so it's much more peaceful and charming than the other big temples"
        }, 
        {
            "index": 142, 
            "rating": "5", 
            "review": "Small temple that well worth a visit. A temple with very intricate carvings and some great opportunities for some fantastic photos, be sure to try and squeeze this little gem into your itinerary whilst in Siem Reap."
        }, 
        {
            "index": 143, 
            "rating": "4", 
            "review": "Wonderful. Just wonderful and beautiful. There is such sublime beauty in the ancient ruins. Come earlier in the day to avoid the hordes of tourists. Ugh!!"
        }, 
        {
            "index": 144, 
            "rating": "4", 
            "review": "Very beautiful and peaceful place. Small and beautiful. Important place in temple architecture and a nice place to watch the setting sun go down"
        }, 
        {
            "index": 145, 
            "rating": "5", 
            "review": "Small but beautiful temple. It is small temple, a little outside of Siem Reap. One of best thing is it is not crowded. I could strolled very slowly and stayed in a shade quite for a while, enjoying it beauty."
        }, 
        {
            "index": 146, 
            "rating": "4", 
            "review": "Picturesque and peaceful. Like the other temples the architecture is remarkable, however, unlike most of the other sites it is very peaceful. Having navigated through crowds at the other sites it was wonderful to be here almost alone. Amazingly you can walk over, through and around most of the site. Worth the visit."
        }, 
        {
            "index": 147, 
            "rating": "5", 
            "review": "Well worth it. Low tourist numbers make this place worth visiting. If you want to take pictures without lots of people in the way this is the site to visit. Thoroughly recommended."
        }, 
        {
            "index": 148, 
            "rating": "5", 
            "review": "good pictures. not a lot of tourists around, it was good to take pictures. Not the famous landscapes from siem reap, but worthy."
        }, 
        {
            "index": 149, 
            "rating": "5", 
            "review": "Less Crowded Temple. This is one of my favorite. Not as crowded as the other temples. I personally love the structure of the building."
        }, 
        {
            "index": 150, 
            "rating": "5", 
            "review": "Fabulous!. I am glad the Banteay Samre was on our itinerary created for us by ZiZ Asia, Ltd. as we may not have found it on our own. Our wonderful and knowledgeable guide, Dy, with ICS Travel, constantly provided us with an abundance of fascinating history about each temple. The Banteay Samre temple was incredible. In comparison to our visit at Angkor Wat earlier that morning, the Banteay Samre almost felt secluded. I read that the Banteay Samre doesn't always make it to people's top list of temples to visit and isn't on the route of most tour buses. The temple was beautifully preserved and was described to us as being a miniature Angkor Wat. While it had similarities to the Angkor Wat Temple, it was smaller and more compact, but there were vast similarities between the architectural design and engravings. The Banteay Samre Temple had only one tower, instead of 5 like the famed Angkor Wat, and the Banteay Samre Temple had two libraries, instead of 6 like the Angkor Wat. The Banteay Samre had galleries and its' sole tower was in the shape of a lotus bud.Always, remember, that even though its scorching hot, while visiting temples to wear proper temple attires, which requires ladies shoulders to be covered as well as their knees. I wore pants to be safe. I wore lightweight clothes since the temperatures are hot!! I definitely recommend a guide because you learn so much more about each temple and truly makes you appreciate everything about the temples that you might overlook completely."
        }, 
        {
            "index": 151, 
            "rating": "5", 
            "review": "Under rated. Many people take the time to visit Banteay Srei for the fine sculpture, but I'm not sure how many see this one on the way there or back. It wasn't rated that highly in some of the guidebooks I read but I thought it was one of the better sites, especially once you exclude the top 4 or 5 obvious ones. It was very quiet, almost intact, and easy to gain an overall perspective of how it may have looked many centuries ago. One guidebook suggests entering from the east (rather than entering from the road) and this did seem to enhance the first impressions, plus you get to see causeway."
        }, 
        {
            "index": 152, 
            "rating": "5", 
            "review": "Off the main circuit. This is one of the best restored temples. Since it's a bit off the main circuit it is less crowded, so you can enjoy it almost to yourself (if you are lucky)."
        }, 
        {
            "index": 153, 
            "rating": "5", 
            "review": "Add to your list. This is worth seeing, and is one of the most important temples in the area. Take a guide with you to appreciate the history and detail of this temple (indeed all of them)."
        }, 
        {
            "index": 154, 
            "rating": "5", 
            "review": "Surprised. We were on our way to Banteay Srei and our driver suggested us to see this set of ruins first. SO glad we did. Secluded, quiet, beautiful, vast. My kids and I loved it!"
        }, 
        {
            "index": 155, 
            "rating": "5", 
            "review": "Well worth it. I hadn't planned on visiting Banteay Samre, but our B&B owner suggested we go on our way back from Banteay Srey. I'm glad we listened, because it was the highlight of our day. Maybe it was because we had the whole place to ourselves for a little while.It's a wonderful temple with plenty of corridors and rooms and walkways. Well worth adding it to the list. Hard to imagine that it is ever packed."
        }, 
        {
            "index": 156, 
            "rating": "4", 
            "review": "Off the Main Path. This temple is smaller and a bit away from the main Angkor temples. The walk up the temple road is nice and generally not overly crowded. We found some unique artwork here for our souvenirs. And lots of little nooks to explore!"
        }, 
        {
            "index": 157, 
            "rating": "4", 
            "review": "Smaller but still nice. We had a quick visit here . Very small temple in relation to others in the area, but interesting all the same. Its 12 century and Hindu not Buddhist .Made of finely textured rose coloured sandstone.There were some stalls offering local crafts, paintings and silk items on the walk up to the temple from the road - very nice and a lot cheaper than most of the bigger temple sites."
        }, 
        {
            "index": 158, 
            "rating": "5", 
            "review": "Hidden gem. Bandeau Samre is a little off the usual tourist grid of Angkor area. It you reach here early in the morning around opening time or later in the afternoon, it is not crowded at all and allows you a leisurely exploration of 12th century architecture and sculpture. It is not as grand as Angkor Wat but certainly very beautiful."
        }, 
        {
            "index": 159, 
            "rating": "5", 
            "review": "A real gem. This small temple is beautifully preserved and not overcrowded with tourists, which allows you to take your time to explore the carvings, which are one of the best in Angkor. The temple itself looks as a small copy of Angkor Wat, however, we liked it more than the original."
        }, 
        {
            "index": 160, 
            "rating": "5", 
            "review": "A respite from the crowds!. Banteay Samre is not on the route of most of the tour buses, so it's a good place to see the Angkor Wat style without the crowds. I had read about it and had to ask our tuk-tuk driver to take us there specifically. No problem. This temple dates to the early 1100's and is more compact that Angkor Wat...but the architectural style and stone carvings are very similar. Well worth the time!"
        }, 
        {
            "index": 161, 
            "rating": "4", 
            "review": "Full of surprises. The best time to visit this temple is morning to avoid not only the heat but some of the tourist buses. The architecture of this temple is also seen at Angkor Wat only on a smaller scale. Be sure to check out the 200m long causeway leading up to one of the entrances. The causeway is lined by Naga balustrades. Take the time to walk around the outside of the temple; you'll find lots of little nooks & crannies that many of the other tourists miss. The day we visited there was loads of gorgeous children from a local village running around who were more than happy to pose for photos.Our guide shared some beautiful stories about this temple with us. He told us about the meaning behind all the mythological carvings & how there was once a large moat around the first enclosure. It would have been a stunning temple in it's time.If you need to know any further information about our guide; PM me & I would be more than happy to share details."
        }, 
        {
            "index": 162, 
            "rating": "5", 
            "review": "Very nice pink temple. Very nice place in Siem Reap but far from the city. you need to hire a tuk-tuk and do the outside of angkor wat trip to get in here. must see!"
        }, 
        {
            "index": 163, 
            "rating": "4", 
            "review": "Really wonderful!. We really enjoyed our time visiting Banteay Samre. It is certainly a beautiful temple and there are some amazing carvings/reliefs to be seen. Bigger than a lot of the other temples, you can see that it was built along the same lines as Angkor Wat, and shares a lot of the design similarities.Before you enter the main temple be sure to walk across to the top of the stairs opposite, that are flanked by two huge Singhas, and look down the long paved causeway. This is the original road to enter the complex and was decorated along its complete length with carved Nagas. The day we visited a group of monks were enjoying the shade at the top of the stairs and happily posed for photos.Wandering around the temple you can just imagine how beautiful it would have been, and how wonderful the interior moat would have been filled with water lillies and birds. Take your time to enjoy the beautiful carvings and the skill of craftsmen that built the complex. It isn't hard to imagine how it would have been in its day.In the forest out the back of the temple there is a village and on the day we visited they were having a celebration, so we enjoyed the music playing and had fun with the hordes of children running about the place. We took our time to really explore this temple and enjoyed the wonderful stories our lovely guide had to share. As with each temple, the history is just incredible and having a very knowledgeable guide just added to the whole experience.A lovely place to visit indeed!Things to remember when visiting:-* Be sure to book a private guide so you can move at your own pace. Make sure you get one that really knows their stuff as hearing the stories and legends around each temple was far more interesting than just hearing the facts. (If you need a guide then feel free to PM me - I'm more than happy to give you a recommendation!)* Wear sunblock and a hat. It is HOT.* Go early to avoid the majority of the tourist buses.* Be sure to take the time to just sit quietly and drink it all in. Bus loads of tourist will come along but they're gone soon enough so be patient. * Please remember to dress respectfully. Yes, you're on holiday and yes, it's hot but this is a temple.Enjoy! :)"
        }, 
        {
            "index": 164, 
            "rating": "5", 
            "review": "A little mini Angkor. So small and well laid out! We visited this temple first before the main ones so it was a perfect introduction ."
        }, 
        {
            "index": 165, 
            "rating": "5", 
            "review": "a miniature. this temple is covered in minutely detailed bas reliefs. I visited this on the way back from the Kulen Hills."
        }, 
        {
            "index": 166, 
            "rating": "5", 
            "review": "Not such an overpopulated temple. Nice temple to get away from the crowds. Pleasant drive through local villages to get there. Great view from the top after steep climb."
        }, 
        {
            "index": 167, 
            "rating": "5", 
            "review": "Special Temple in Siem Reap. This is not a big temple. It is quiet but this is the most beautiful temples when compare to others that we had visit. Worth to go."
        }, 
        {
            "index": 168, 
            "rating": "4", 
            "review": "Worth it. As the temple is about 6km from the main group of temples, Banteay Samre is a bit quieter. Its worth a visit - if not for the temple then for the journey there. You go through a few kilometres of beautiful rural landscape. Would recommend you go by bike or tuk tuk so you can savour the journey through the countryside and village."
        }, 
        {
            "index": 169, 
            "rating": "4", 
            "review": "Worth a visit. Most temples are worth visiting. It was worth to visit this temple. You will be amazed on how the temples look almost the same but are very different. Definitely worth visiting even if it is a bit far."
        }, 
        {
            "index": 170, 
            "rating": "5", 
            "review": "Enjoy every step. It's raining when I was there. Quite muddy but the rain seems like washing away all the dirts and eventually gives a better environment. Very shadowy and breezy when I was there. Quite small but very historic temple. Full of carvings about Ramayana and the kings. Able to get free guide here from locals who is visiting the temple."
        }, 
        {
            "index": 171, 
            "rating": "5", 
            "review": "Away from the maddening crowds. The main temples on Angkor can get very, very crowded and my experience was somewhat spoilt by this.Banteay Samre is quite a distance from the main cluster and so the number of tourists heading this way declines accordingly. I didn't actually go into the temple itself but the road and village along the way are a fascinating snapshot of rural Cambodian life. Move a few yards behind the roadside restaurants and you will see the real Cambodian farmers going about their daily tasks."
        }, 
        {
            "index": 172, 
            "rating": "2", 
            "review": "Worth a visit ........in \"a second day tour\"!. Not in my top 3 temples however it's definitely worth a visit if you have a second day visiting the temple area. It's located a bit far away from the crowded area of Angkor Wat in a quite a peaceful location. The temple is well maintained and offers good background for photos."
        }, 
        {
            "index": 173, 
            "rating": "4", 
            "review": "Quiet visit. We were pretty much alone when we visited here in October 2013. Nice, quiet visit. A little off the beaten path away from the main temple complex so I don't think many people make the trek. There wasn't anything over-the-top special about this temple that stood out to me, but it was a nice opportunity to have a quieter visit and enjoy a temple at your own pace."
        }, 
        {
            "index": 174, 
            "rating": "5", 
            "review": "Quiet peaceful temple. Large flat temple off the beaten track. We visited after Kbal Spean and Banteay Srei. It is situated at the T-junction turning back to Angkor from Banteay Srei on a dirt road of about 3 km through villages and paddy fields. Not many visitors so the temple can be enjoyed in relative quiet and peace. Many of the carvings here are in really good condition. There was even a cat chilling in the corridors of this temple. Worth a visit."
        }, 
        {
            "index": 175, 
            "rating": "5", 
            "review": "Great background for photos. Come before 10 am or during sunset so the pink hue of the temples will be very visible. 2 or 3 hours away from town so be prepared to have a looong tuktuk ride. The travel itself will give you a glimpse of how the locals live."
        }, 
        {
            "index": 176, 
            "rating": "5", 
            "review": "Angkor-Wat Artistry. Large, comparatively flat temple displaying distinctively Angkor Wat-style architecture and artistry. Banteay Samre was constructed around the same time as Angkor Wat and has seen some recent restorations. The style of the towers and balustrades bear strong resemblance to the towers of Angkor Wat and even more so to Khmer temple of Phimai in Thailand. Many of the carvings are in excellent condition. Banteay Samre is a bit off the beaten path, southeast of the East Baray. The trip there is a nice little 2 miles or so road excursion through villages. Combine a visit to Banteay Srei with a stop at Banteay Samre on the way back. Be sure to do Srei first."
        }, 
        {
            "index": 177, 
            "rating": "5", 
            "review": "Biggest Surprise. By far the best preserved temple that isnt crowded any time of the day. The location makes some people avoid it, but trust me, it is totally worth the effort. Much like Banteay Srei but less crowded and better preserved."
        }, 
        {
            "index": 178, 
            "rating": "3", 
            "review": "Semi-dissappointed. Had very high expectations of Bantey Samre, however I think we hit the worst conditions to go there for. We went early morning, around 9-ish. The place was small and packed with tourist. It was raining so there was red mud everywhere. Umbrellas photobombing pictures and very impatient tourists. I heard from a friend who went four months prior that you used to be able to walk into the center, however, that area now is closed off. So inside the main area, you are only able to view from the outer circle. Maybe that was why the area was so packed."
        }, 
        {
            "index": 179, 
            "rating": "5", 
            "review": "good temple. Banteau Samre it is very nice temple it is far from siem reap town about 15km.it is have a lof of the caving an the wall and in side it"
        }, 
        {
            "index": 180, 
            "rating": "4", 
            "review": "Another place to visit.. This temple is located quite far from the hustle and bustle of the people and when we're there, not many tourists were around.Interesting story from what I have heard from my guide on the reason the temple was built."
        }, 
        {
            "index": 181, 
            "rating": "5", 
            "review": "Amazing. One of the bigger temples that we visited. Just amazing to see in its grandeur. Every temple I have reviewed I have given 5 stars because they all deserve them. You will not be disappointed if you visit this temple as it is very impressive to see."
        }, 
        {
            "index": 182, 
            "rating": "5", 
            "review": "The finest carvings in the Angkor area. Really beautiful carvings, too bad there are way too many people, including whole buses, which ruined our visit."
        }, 
        {
            "index": 183, 
            "rating": "5", 
            "review": "They say that this temple may have been a place of learning.. I loved this temple. It felt like a university and they say it may have been one. Small but beautiful."
        }, 
        {
            "index": 184, 
            "rating": "4", 
            "review": "Good place to visit. It is on the way from Bantey srei temple so it would be a good combination to visit. the place is 3 usd for the tickets. it is a good museum. I can recommend it to tourists."
        }, 
        {
            "index": 185, 
            "rating": "5", 
            "review": "Well worth a visit. This temple is a little way out from the most popular circuits travelled around Angkor, but it's an easy 60 minute bike ride from Siem Reap, taking you past some less crowded areas and temples, and through the village of Pradak, which is fascinating in itself.Banteay Samre is a relatively small, but quite intact temple built in a similar style to its great big brother, Angkor Wat. The buildings are in very good condition, and work in beautiful harmony together. The dried out moats in the middle of the courtyards are very pretty spaces. There's some wonderful carvings, and a lovely central sanctuary which again is like a mini Angkor Wat.One tip: the entrance to this temple is from the north. Make sure you turn left once you enter, and walk round to, and out of, the east gate, to see the remains of the very impressive causeway complete with lion statues leading to the east gate entrance."
        }, 
        {
            "index": 186, 
            "rating": "5", 
            "review": "Cute little temple. I loved this temple, it's smaller than the famous Angkor Wat of course, but it's a quaint one. It's far from the main Angkor area, about an hour to get there but it's worth going to see. The color of the temple is a bit pinkish which is quite different from the usual temples we have visited. The detailed carvings also offer an interesting twist.The area seems to be managed quite well, you can see some of the staff roving the area. A lot of locals too, who visit towards the end of the day. The lighting was great also towards the end of the day, but I did read that the pinkish colors stand out more during early mornings.Not crowded at all, and this allows us to have a relaxing walk to and around the temple. I think this is the best way to really appreciate the serenity of the place.We did this as part of a Beng Mealea, Kbal Spean and Bantay Srei loop, so our last stop was Bantay Srei. Great way to end the day and the overall temple visit, we went to the main Angkor temples the day before.Bantay Srei is part of the Angkor Wat ticket so make sure you have a valid one.As with any temple, there are kids selling postcards, souvenirs, etc. One particular kid was trying to sell me a pack of 12 postcards for USD1. Expecting that they will be pushy, I told him that I already have one and no I'm not interested in getting another. But this kid was smart, he stayed on to show me where the entrance is, walk beside me until the entrance and answered my questions and told me that he will wait for me outside and maybe I'll buy his postcards later, without sounding like pushy or whiny. And indeed, I saw him running back to me with a big wide smile on his face when we came out. And because he wasn't pushy, I decided to buy a pack of postcards from him :-)"
        }, 
        {
            "index": 187, 
            "rating": "5", 
            "review": "Well preserved and compact. Having read some the earlier reviews, I think there is some confusion between Banteay Samre and Banteay Srei. Banteay Samre is the one made from grey sandstone near the south east corner of the Eatsern Baray. Banteay Srei is the one made from red sandstone, located about 20km north east of Angkor Thom.Anyway Banteay Samre is a well preserved (restored) compact temple with a single tower (very much like the main Angkor Wat tower), surrounded by the usual galleries and walls. It is very compact with small spaces between the structures which gives the illusion of the building and walls being much higher - a bit like midtown Manhattan.There are fewer (group) tourists here so one can spend a quiet time wondering around and understanding the basic concepts behind Angkorian architecture, making a visit here before the major sites such as Angkore Wat or Preah Khan a worthy investment."
        }, 
        {
            "index": 188, 
            "rating": "5", 
            "review": "Another amazing Temple.. Great temple to explore and not many other tourists around to spoil your shot.Very peacful place that is not too far away from Angkor Wat to discover.Some of the steps are steep but worth it to see this temple up close.Restaurant across road from entrance is good for food/drink break."
        }, 
        {
            "index": 189, 
            "rating": "5", 
            "review": "My number 2 of all Angkor temples. This temple is my number 2 of all Angkor temples (after Ta Prohm). Although it is located outside of the small and big rounds, and you need to pay extra 15$ to the taxi driver(for fuel), it worth the visit. We visited this temple on the way to Banteay Srey (to pay extra only once :) ) This temple is awesome and it was completely empty. We took amazing shots.We had an awesome driver/guide, which I recommend to all of you:http://www.tripadvisor.co.uk/Attraction_Review-g297390-d6522493-Reviews-Angkor_Guide_Sam_Day_Tour-Siem_Reap_Siem_Reap_Province.html"
        }, 
        {
            "index": 190, 
            "rating": "5", 
            "review": "My favourite temple. Don't know why I like this temple above the 10 others we visited but its just stunning. Possibly more of the Indiana Jones feel as opposed to the Lara Croft feel ?"
        }, 
        {
            "index": 191, 
            "rating": "4", 
            "review": "Very Peaceful Setting. Its distance from East Baray this Wat ensures that is receives fewer visitors than most others at Angkor. Because of this distance this Wat has had plenty of time to be excellently restored.We really enjoyed this Wat because of the peace and quite you got here. Thanks to the heads up our yuk yuk driver this happened to be a place where we sat and snacked."
        }, 
        {
            "index": 192, 
            "rating": "5", 
            "review": "Less People. One of the temples you can actually take some time to really see as there seemed to be a ton less people. The temples are endlessly facinating and I recommend seeing all of them you can."
        }, 
        {
            "index": 193, 
            "rating": "5", 
            "review": "Interesting Temple. Banteay Samre is a well preserved, laterite structure, which featured internal moats and is very different to the other Angkor Temples. The red stone provides some great photo opportunities. Don't forget to look for the \"crouching lions\" guarding the main entrance."
        }, 
        {
            "index": 194, 
            "rating": "5", 
            "review": "Dont Miss this temple. Banteay Samre Is by far one the best temples to visit But one of the most missed out from your visit to Siem Reap. If you enjoy Ankor Wat you will love this one its made from a red sand stone bricks which makes it so photogenic ...The big down fall is that its off the main track from all the other temples. But is include in the main pass you buy. Its only a 30 min ride by tut tut and guess what no crowds .. A quick note not far from her is Banteay Srey give it a miss over crowded and very limited where you can walk .."
        }, 
        {
            "index": 195, 
            "rating": "5", 
            "review": "great. Well what a place. Again it's hard to imagine these temples being built and being used. They stand so majestically."
        }, 
        {
            "index": 196, 
            "rating": "4", 
            "review": "Hidden gem. This site is not covered in the standard 'small tour' or 'big tour'. However, it is definitely worth the 15min ride out.Much less crowd and a very well presented site."
        }, 
        {
            "index": 197, 
            "rating": "4", 
            "review": "Hidden... i reached this temple in the afternoon when i thought the tour was over... it's quite far from the rest and is kinda hidden.. it is situate near another lake where you can see local fishermen fishing for their living.. the area is very nice and there's excellent shade from the towering trees surrounding the area."
        }, 
        {
            "index": 198, 
            "rating": "3", 
            "review": "Almost templed out that afternoon. Banteay Samre was our 5th temple of the day, maybe a temple too far, maybe we were templed out.It is still impressive when you think it was built 800 years ago, but to a tired photographer & builder it didn't hold too much interest and known of the features had the \"WOW\" factor after visiting Baneay Srei. To be honest Banteay Srei is a very hard act to follow.Maybe I would have appreciated Banteay Srei earlier in the day."
        }, 
        {
            "index": 199, 
            "rating": "4", 
            "review": "Less Travelled but Worth It. There were not many people around when we were there. This is not on the must do list for the big tours, perhaps because it is quite a distance from some of the main temples. But the fact that we were there with so few people is one of the attractions given that Angkor Wat can be overrun with people.The temple is in the north and can be combined well with visiting Banteay Srei and the Landmine Museum, both of which I highly recommend.There is a nice example in the back on of the temple site of how the roots of a strangler fig have become entwined with the structure of the temple. Of course you see much more of this in Ta Phrom which is an absolute must see."
        }, 
        {
            "index": 200, 
            "rating": "5", 
            "review": "Good Preserved and peaceful. Bamteay Samre is best place to visit , it is very nice and best preserve , it locate opposite Banteay Samre primary school , on the way to the temple , they will be pass many villages and rice field , that is amazing to visit this temple ."
        }, 
        {
            "index": 201, 
            "rating": "4", 
            "review": "FLOODED TEMPLE. very nice intact temple with buffalo grazing outside and\na nice causeway and lions. Inside was flooded which may haver\nalways been intended. Not too many people there."
        }, 
        {
            "index": 202, 
            "rating": "3", 
            "review": "Well Restored Angkorian Temple. About half km from E of East Baray. The anctuary tower is nicely restored. The bas-reliefs are also in good condition. This is a less-visted temple and you are away from the crowds of Angkor Wat and angkor Thom."
        }, 
        {
            "index": 203, 
            "rating": "5", 
            "review": "An overlooked gem!. We visited this temple in the middle of the afternoon and it was almost devoid of tourists! It seems that this temple is often left out of the tourist circuit because it was constructed in the same style as it's grander sister Angkor Wat. Nevertheless, it was a worthwhile visit! This is one of the most intact temples in Angkor and a must-see if you want to immerse yourself in Angkorian history and architecture!"
        }, 
        {
            "index": 204, 
            "rating": "5", 
            "review": "Lonely temple. not many tourist go to this place. I was recommended by my tour guide, it really a good place to see and a bit out of busy tourists. at the same time i can enjoy real local review in the rural area"
        }, 
        {
            "index": 205, 
            "rating": "5", 
            "review": "Loved the Feel of this Place. This was the last temple of the day for me starting with Bakong, Beng Mealea, Banteay Srei and is perhaps my favourite out of the group. Think it was because of how you could walk around the circumference without interruption, were up higher and the scale of it felt really well balanced. I would return here to sketch and write."
        }, 
        {
            "index": 206, 
            "rating": "5", 
            "review": "Interesting temple. This temple was lovely, it was very pink in colour and had lots of interesting areas to look and take photos. We even saw a fluro green snake! There was even some musicians playing at this temple which made for a nice atmosphere."
        }, 
        {
            "index": 207, 
            "rating": "5", 
            "review": "Excellent Tower. Some way out of town by the state of the restored tower makes the drive worthwhile in a very peaceful setting"
        }, 
        {
            "index": 208, 
            "rating": "4", 
            "review": "Worth visiting if you have the time. This is a smaller temple complex with stone carvings worth visiting if you have the time and because it is quieter and less frequented."
        }, 
        {
            "index": 209, 
            "rating": "4", 
            "review": "Well worth the drive. Great to be able to sleep on the drive here, lots of tourists when we came, but that's part of the deal here. My fav temple so far :) About 1 hour drive out from SRP."
        }, 
        {
            "index": 210, 
            "rating": "5", 
            "review": "nice. An hours drive by car , great scenery on the way of the countryside .We went late in the afternoon and watched the sunset , really spectacular temple ."
        }, 
        {
            "index": 211, 
            "rating": "5", 
            "review": "My favourite temple. This temple has something very special, I think it is the stone paths with balustrades headed by large lion statues looking down long avenues of trees so that all those approaching would have seen this awesome temple in its full glory colour and all. The temple is also in my opinion the best preserved with fabulous stone carvings, arches even the smallest carvings are retained. There is also a well laid out 4 bathing pools which with all the colour and dramatic carvings must have made this place very special. Like all the other temples, the amount of work needed to build such structures is mind boggling without mechanical help and there must have been an army of stone masons, all Cambodians???. The surrounding landscape must have been a hive of activity to support the temple, I wish that CGI could recreate the wonders that this temple must have given all visitors. Suggest that you buy your. 3 day pass the day before you visit, they are valid for 7 days and you can use the for any 3 days, will save you a 2 hrs wait at the ticket office, hot and crowded."
        }, 
        {
            "index": 212, 
            "rating": "5", 
            "review": "so many photo opportunities. All the temples are great, and this is another one, so many photo opportunities. Worth visiting this temple."
        }, 
        {
            "index": 213, 
            "rating": "5", 
            "review": "Quiet and peaceful. Wonderful temple if you wish to escape the large hordes of tourists that visit the popular temples in Angkor. A morning visit is recommended to avoid the afternoon crowd."
        }, 
        {
            "index": 214, 
            "rating": "5", 
            "review": "Amazing detail on the red sandstone.. One of many temples in the National Park, this one stands out and is worth the extra long trip to get to because the condition of the carvings on the temple. Its also the only one I know of done in red sandstone. The details are so intricate, with dancers, warriors, and nagas coating just about every inch of the walls. Really impressive. There are lotus ponds on the outside of the temples walls, making for some nice pictures. This is a small temple, so you don't need huge amount of time here, but with all the details its nice to enjoy at your leisure.They also have a great little museum/gallery exhibit, detailing the history, archeology, and tales of archeology theirs trying to steal parts of the temple to sell to museums."
        }, 
        {
            "index": 215, 
            "rating": "5", 
            "review": "Pretty Temple and a great ride through the countryside. We saw this temple on our 3rd day of intensive touring. It is a gem and about 65k outside of the city limits. The drive through the countryside and many little villages was wonderful. If you have the time, go visit this temple!"
        }, 
        {
            "index": 216, 
            "rating": "5", 
            "review": "Small but Gorgeous. This is a small temple and it is best to go there early in the morning before the crowds get there. There were 2 small tour groups ahead of us and as it was, it got crowded inside this small temple. The carvings here are very ornate as the stone in this temple is sandstone, which is soft, and so the artists could go into intricate detail."
        }, 
        {
            "index": 217, 
            "rating": "5", 
            "review": "The Nicest. This is really very cool, I liked just as much as Angkor Wat. It was a woman's citadel and what's left of it is really cool."
        }, 
        {
            "index": 218, 
            "rating": "4", 
            "review": "Really liked it. Very calm place: there were 4 or 5 tourists there at the same time as I was. The architecture is different from what you will see at Angkor and the Bayon. Enjoy some quiet time there before going to a more touristy place..."
        }, 
        {
            "index": 219, 
            "rating": "4", 
            "review": "Beautiful architecture. This particular temple is quite far off as compared to other temples and it is collaborated with China Cambodia Conversation. Hence, there are many China tourist in this area. Beautiful temple with low walls and lesser shelters than the rest of them. Worth a visit!"
        }, 
        {
            "index": 220, 
            "rating": "4", 
            "review": "A Bit far from the city, but a nice temple. if you have time, you should see this temple, it is bit out of the city, but on the way you get to see a lot of local villages, how people live day to day life."
        }, 
        {
            "index": 221, 
            "rating": "5", 
            "review": "Another favorite. Smaller and easier to manuever. Lots of good photo moments. Check out the area around the temple. Very interesting trying to preserve the ruins."
        }, 
        {
            "index": 222, 
            "rating": "5", 
            "review": "Another favorite. This was another nice temple that was not over-run with tourists. A resident monk was feeding a stray cat on the premises so we are appreciative of such kindness. We also bought a drawing from a young artist at the site who was sketching as we watched. Very nice stop for us!"
        }, 
        {
            "index": 223, 
            "rating": "4", 
            "review": "Cute little temple. Along the way to Banteay Srei temple. A must visit site. Banteay Samre is a small but lovely temple. I went there with my little toddler and she was ridding a pram. There is no pram parking (stroller parking) but you can ask the police(or temple guard there to keep the pram for you and they happily accept your request with a lovely smile)"
        }, 
        {
            "index": 224, 
            "rating": "4", 
            "review": "Beautiful and not overly crowded . We explored this place during our second day of temple exploration (having bought a 3 day pass). As other reviewers reflect a real plus to doing the big circuit, which includes this temple is that it is much less crowded than the small circuit (Ta Prohm, bayon and Angkor wat), but still has such amazing architecture and breathtaking views. I absolutely loved walking around temples like this without there being too many other tourists around."
        }, 
        {
            "index": 225, 
            "rating": "5", 
            "review": "One to see.. One must be selective in the temples one tours at Angkor, as temple fatigue can quickly set in. This is one of the smaller temples to see. It apparently receives less visitors, and we were two of about ten people there. The carvings are lovely and the foliage growing out of some create an added sense of mystery. It was the closest I came to feeling like the Kings felt upon being in the revered central sanctuary.Forget the thongs and wear sturdy shoes for all the steps in these temples. Cover up. I found long pants and shorter sleeves topped by long sleeved shirts the most comfortable, with an umbrella to protect against the always-hot sun."
        }, 
        {
            "index": 226, 
            "rating": "4", 
            "review": "very quiet and nice. teh stone colors are really nice, the surrounding enviroment is very nice and also this temple is rarely visited.all in all i loved it. visited it on the way from ruolus to bantay srei so it was a nice stop along the way and we were alone there which added to the overall mood"
        }, 
        {
            "index": 227, 
            "rating": "5", 
            "review": "a smaller temple, easier access. this is a very different temple from Angkor Wat, smaller, built from sand stone, which is unique, in that the colour is pinkish/red due to iron content in the stones.Angkor Wat is difficult to access for those with walking problems, very uneven ground where as Banteay Samre is flatter making walking easier."
        }, 
        {
            "index": 228, 
            "rating": "4", 
            "review": "Away from the crowds. Isn't it wonderful to find a well maintained and preserved temple without crowds. I guess we struck it lucky that day. We'd just done the nearby beautiful pink Banteay Srei which was close to deserted, and this was our last stop. Once again we almost had it to ourselves. This is a medium sized temple that's a bit off the normal circuit, but certainly worth a visit. It's in remarkably good shape and far more \"intact\" than most temples. Inside it's quiet and serene. A lone monk sat praying or meditating in the center. Other than that just a handful of people amongst one of the nicest temples of its size in Siem Reap. Outside herdsmen were taking their cattle to pasture. It's a great place to sit and ponder on the lost people who erected so many magnificent temples in the area so long ago. There isn't the wealth of highly detailed carvings you get at nearby Bantea Srei (and as an aside many of the reviewer's photos included with this temple are actually Banteay Srei) and the walls aren't the same deep pink color. In fact, similar names, but like chalk and cheese. Both are definitely worth a visit though."
        }, 
        {
            "index": 229, 
            "rating": "5", 
            "review": "Often overlooked but well worth seeing. We stopped in on our way back from Bantreay Srei and the Landmine Museum as almost an afterthought and were sure glad we did. Passing through the center of the small village, we were greeted by local life and one of the nicest, intact temples of our trip.Though smaller, Banteay Samre was packed with features and nice photo ops with little competition from other sight-seers making it relaxing. It turned out that this was one of the top temple sites of our trip. Easy to continue on to Preah Rup and Ta Prohm from here and stop for lunch on the way. Highly recommended."
        }, 
        {
            "index": 230, 
            "rating": "5", 
            "review": "My favourite temple. This is a really lovely temple, not huge but really classy! We were really fortunate that there was no one there when we arrived so I'm sure that added to the serenity. There was plenty of water in the moat with some of the same red colour stone you see at Banteay Srei so the contrast makes for great photos. Gorgeous detail in the towers and doors as well. Really beautiful!"
        }, 
        {
            "index": 231, 
            "rating": "5", 
            "review": "beautiful, quiet temple. We arrived here late in the afternoon, after visiting Banteay Srei. I dragged my legs at first and wondered why I had agreed to yet another temple. But I quickly picked up when we walked into a delightful, and again, quite different temple. There were examples of unfinished carving in the door frames, wonderful statues and we just a special experience in the pre twilight hour. Definitely worth the effort. Even the vendors at that time were happy with a laugh and 'no thanks'"
        }, 
        {
            "index": 232, 
            "rating": "5", 
            "review": "This Small Temple is Orange Stone Mastepeace of Art Work..!!. I have not seen such a great architechture, art works, stone carvings, in such small temple, which has so much to offer in that little place.You can spend at least 2 hours in temple, and its still not enough to cover most of the Hindu mythological scenes carved on stones, pillars, walls, ..!!Simply Amazing..!!!"
        }, 
        {
            "index": 233, 
            "rating": "4", 
            "review": "All the bells and whistles. Large flat temple displaying Angkor Wat-style architecture and artistry. Its got towers and balustrades to keep anyone happy. Combine this visit with one to Banteay Srey as this is 38 km fro home base,but the villages and paddies along the way are worth it."
        }, 
        {
            "index": 234, 
            "rating": "5", 
            "review": "This temple complex was just amazing. Despite the water and the bloody rain this place had the most amazing relief's and carvings. It was really eerie with all the rain and water and there were thousands of photo opportunities available. this is well worth the visit come rain or shine."
        }, 
        {
            "index": 235, 
            "rating": "5", 
            "review": "Over looked temple. Almost no other tourists at this site, with similar features to the more famous temples. It was lovely to explore almost on our own"
        }, 
        {
            "index": 236, 
            "rating": "3", 
            "review": "Nice temple. A nice little temple worth visiting, being away from the crowds.Interesting carvings in very good conditions can be seen on frontons.Best seen on the road visiting Banteay Srei."
        }, 
        {
            "index": 237, 
            "rating": "5", 
            "review": "Best homage to Dainty Ladies. Very intricately carved lady figurines with neatly placed bas reliefs and fairly well maintained temple complexes"
        }, 
        {
            "index": 238, 
            "rating": "5", 
            "review": "Short Drive. This site is just a short drive from Angkor Wat, so it is worth the time. Different architecture and great carvings."
        }, 
        {
            "index": 239, 
            "rating": "4", 
            "review": "Beautiful temple off the grand circuit. Combine this with a trip to Banteay Srei and Kbal Spean. It is a bit off the grand circuit and involves a nice excursion by a side road through villages and padi fields. The temple is large and display distinctive angkor style architecture. Carvings seem in excellent condition and may have been restored. Walk and explore in relative quiet as visitors here are less. Enjoyed our visit and took loads of photos."
        }, 
        {
            "index": 240, 
            "rating": "3", 
            "review": "Nice Temple. It's a nice temple but quite far. There are a lot of better temple near the city. Plus, beware of the vendors selling souvenir items. They will not let you go when you try to ask for price. They can also get rude sometimes."
        }, 
        {
            "index": 241, 
            "rating": "4", 
            "review": "A not to be missed temple. If you're headed out to Banteay Srei, then don't miss Banteay Samre. It's a nice little temple that is worth a visit because of its uniqueness. One of the great things is that it's generally not overrun with tourists.While you're there, take some time in the village nearby, Prey Dak, It's a great place to enjoy traditional Cambodian noodles in the morning, shop for baskets and other handicrafts, or watch them make palm sugar."
        }, 
        {
            "index": 242, 
            "rating": "3", 
            "review": "Part of a long day. If you are getting tired and want to miss some temples you could omit this one. Still interesting but nothing over and above many of the other temples. Worth doing if you still have energy and determination!"
        }, 
        {
            "index": 243, 
            "rating": "5", 
            "review": "loved this. this was a wonderful contrast to angkor wat--not that there was anything wrong with angkor wat!the sandstone was an interesting difference, and the intricacy of design of the sandstone itself was fascinating."
        }, 
        {
            "index": 244, 
            "rating": "5", 
            "review": "A smaller temple which we saw on our way back to Siem Reap. A smaller temple which we saw on our way back to Siem Reap after visiting Banteay Srei and Kbal Spean. Not many tourists. As with other temples good carvings and interesting structures. Go with a guide and take hat and water."
        }, 
        {
            "index": 245, 
            "rating": "3", 
            "review": "Cycling. Cycling pass big circle Angkor areathrough to Banteay Samre.It's a pair of Banteay Srey.Compare both difference design but both are small small temple.Not many tourist there as Banteay Srey."
        }, 
        {
            "index": 246, 
            "rating": "5", 
            "review": "Bantay Srei. Once a beautiful temple now it's dying but behind the ruins , one can see how beautiful it was once."
        }, 
        {
            "index": 247, 
            "rating": "5", 
            "review": "Picture Perfect. Out of all the buildings and temple structures, think my perfect shots were at Banteay Samre. Here again, the buildings were awesome and will come alive when the guide starts explaining the course of nature that took place."
        }, 
        {
            "index": 248, 
            "rating": "5", 
            "review": "One of the nicest temples in Angkor Wat. The Banteay Samre was for me one of the nicest temples in Angkor Wat.The artwork is amazing.It's more special than Ta Prohm or some other famous temples.Don't miss it!"
        }, 
        {
            "index": 249, 
            "rating": "5", 
            "review": "Like buried treasure. Banteay Samre was my second favourite of all the temples I visited in Angkor park. In my opinion it is more special even than Ta Prohm and Angkor Wat itself. There is a beautiful energy in the complex and, while smaller than some of the other temples, the carving is so beautiful that it really is a wonderful place to visit. Best of all it's not as popular as other temples so you may find yourself nearly alone here.Well worth a visit. Make the effort and you will be rewarded :)"
        }, 
        {
            "index": 250, 
            "rating": "4", 
            "review": "An out of the way gem. we were tired by the time we got to this temple. But it was worth it. We did our usual wander round, and then as we were leaving we found some very interesting \"unfinished\" carving ariund the widow openings. It gave us a fantastic insight into the process of the carving as you could see just where they \"stopped\""
        }, 
        {
            "index": 251, 
            "rating": "3", 
            "review": "If you are in the area. This is a nice temple but it cannot be compared to the most famous ones. If you are visiting with a tuk tuk, it may not be worth the trip as it is a little out of town."
        }, 
        {
            "index": 252, 
            "rating": "4", 
            "review": "A grey temple. Some of the photos posted by previous reviewers are for Banteay Srei (which is not far from this temple); not for Banteay Samre. Do those people even know where they went? When we visited this temple, it was not crowded (hardly anyone else). See attached photos (no one else in sight). We enjoyed the drive from Siem Reap to this area."
        }, 
        {
            "index": 253, 
            "rating": "5", 
            "review": "great place. nice place where you will see ancient ruin,,i am sure u would enjoy there especially for those who like taking picsdon't forget bring your umbrella,, it is open area and the sunny and rainy weather over the year"
        }, 
        {
            "index": 254, 
            "rating": "3", 
            "review": "small but powerfull. i like the idea to have small but strong concept :)should come and see it only for 2 hour round trip will be enough"
        }, 
        {
            "index": 255, 
            "rating": "5", 
            "review": "Beautiful temple. A visit to Banteay Samre can be combined with an excursion to Banteay Srei, which it should precede if possible. The whole trip takes perhaps 2 hours and is best made in the morning."
        }, 
        {
            "index": 256, 
            "rating": "5", 
            "review": "Little Angkor Wat. Don't mix Banteay Srei (the one with the pink-ish coloured stones) with Banteay Samre. Banteay Samre is known as the little Angkor Wat, because is just as beautiful and well preserved. You will need a tuk-tuk to get there, but it is worth it. There are toilet and eating facilities just outside the entrance of this temple and not many people come here, so it is a real treat.We had a great tuk-tuk driver in Siem Reap, so if you need one, you can find him just outside the Tara Angkor Hotel (On the road to Angkor Wat) his name is Rado Doung and he drives tuk-tuk number 5. He will take you to this temple and all the others."
        }, 
        {
            "index": 257, 
            "rating": "4", 
            "review": "An oasis of peace - a miniaure of Angkor Wat. Banteay Samre is one of the best preserved temples on the Angkor circuit, but it is surprisingly little visited. In consequence, it is one of the best temples to choose for a visit.There is no visitors' centre or other facilities, and the temple itself is rather isolated.It has often been described as Angkor Wat in miniature, as it shares so many distinctive architectural features with Angkor Wat (especially the lotus tower), but for me the real attraction of Banteay Samre is in the detail: there are numerous fine flourishes and miniature carvings on lintels and pillars to be discovered. The peaceful atmosphere of this temple also lets you imagine how it was 500 years ago, with a community and a daily ritual."
        }, 
        {
            "index": 258, 
            "rating": "5", 
            "review": "Very nice. Very nice structure with not so big size like other temples. Have a good time to tour thru.It locates remote to other circled temples but really worth visiting"
        }, 
        {
            "index": 259, 
            "rating": "5", 
            "review": "Best of the ruins. After Angkor Wat, Angkor Tom etc., etc., I thought I had seen all the old ruined temples I wanted to see. What a pleasant suprise to find that Banteay Samre was something a bit different and interesting. And, we enjoyed to drive through the coutryside to get there."
        }, 
        {
            "index": 260, 
            "rating": "5", 
            "review": "Excellent temple - great condition. I went here in the afternoon and it was so lovely.the inner courtyard was in really good condition and it was such a lovely place.I highly recommend as a combination going to Bantey Srei and the landmine Museum.Its a good hike if you add the other two attractions so for this day we hired a car instead of a tuk tuk and we were so glad"
        }, 
        {
            "index": 261, 
            "rating": "4", 
            "review": "Banteay Samre. Stopped here after visiting Banteay Srey. Quite large and mostly flat temple with towers similar to those of Angkor Wat. The carvings are still in very good condition and photograph well."
        }, 
        {
            "index": 262, 
            "rating": "5", 
            "review": "a beautiful, smaller scale temple. This temple is smaller than most of the Angkor temples, with intricate stone carvings. It was my favourite Angkor temple."
        }, 
        {
            "index": 263, 
            "rating": "5", 
            "review": "One of my favorites!. Banteay Samre is a very beautiful 12th century Hindu Temple that was constructed around the same time as Angkor Wat with similar style architecture.Banteay Samre is also known as the Child of Angkor Wat and it is a bit off the normal tourist track but is definitely worth the effort to visit here as there are many carvings that are in excellent condition, well preserved buildings and very quiet, not many tourists at all. I actually liked it a lot more than Banteay Srey. Combine a visit here with a stop at Banteay Srey; the trip is lovely passing through villages and rice paddies."
        }, 
        {
            "index": 264, 
            "rating": "4", 
            "review": "Banteay Samre. Our 2nd spots to visit at Angkor on our 1st day in Siem Reap. Facinating. Taken quite a number of photos and stayed for about half an hour to appreciate the carving on the stones. Great job of the people in the 12th century."
        }, 
        {
            "index": 265, 
            "rating": "5", 
            "review": "Wonderful. 5th out of 6 temples visited on the Outlying Adventure Tour with Beyond Unique Escapes. Beautiful temple with gorgeous carvings, constructed around the same time as Angkor Wat. Would never had seen this temple if we hadn't done tour as its a little bit out of the way, well worth a visit."
        }, 
        {
            "index": 266, 
            "rating": "4", 
            "review": "See with Banteay Srei. A smaller temple which we saw on our way back to Siem Reap after visiting Banteay Srei and Kbal Spean. Not many tourists. As with other temples good carvings and interesting structures. Go with a guide and take hat and water."
        }, 
        {
            "index": 267, 
            "rating": "4", 
            "review": "Peaceful setting. Much of the protective wall has been restored. Interesting to speculate on what the pillars originally held up. Distinctive carvings."
        }, 
        {
            "index": 268, 
            "rating": "3", 
            "review": "A Good, Relatively Small, Introductuion to the Angkor Complex. We visited this temple and found it quite accessible. There was almost no one here, and that was a notable plus. You could see the type of stones used and the style of construction that could be found in perhaps parts of the various other structures in the overall Angkor temple complex. What was interesting was the window areas that had what looked to be circular, intricately-carved, stone columns or poles, placed within the open part, that supported them. There could be four or more of them within each opening, seeming to provide support for the parts of the temple above the openings. The carving designs, all in circular patterns, may show that they were first cut and then rotated in some fashion to allow the carvers to produce what I though were really interesting circular patterns. Parts were thicker, other parts thinner, in what gave a sense of how advanced these artisans were with the tools they had to design and execute such items.An aside - walking to a nearby restroom after visiting Bante Samre, I came upon a huge spider web with a huge spider on it. Black, white, red, and yellow, with some stripes - I'd never seem anything like it. It was just off the trail, so easy to see and get to."
        }, 
        {
            "index": 269, 
            "rating": "4", 
            "review": "an interesting temple. worth seeing on the trip to Bantey seri. It is different again and has an interesting floor plan. It is more compact and not too time consuming."
        }, 
        {
            "index": 270, 
            "rating": "4", 
            "review": "Worth a visit. Quite interesting structure with some nice carvings. This was worth a visit because it is quieter and less visited than other temples. This allows you to soak up the atmosphere and really see the structures"
        }, 
        {
            "index": 271, 
            "rating": "5", 
            "review": "Amazingly intact!. This was one of our favourite temples, not too crowded, a bit off the beaten path. The buildings have been restored, sort of reminds you of a cloistered abbey! But with the Angkor style stone, and the heavy barrel roofs. We hired a taxi for two days travel to the Angkor complexes, more expensive than a Tuk Tuk, The third day had a tuk tuk, to the Rolios group. Saw more of the scenery fron the tuk tuk!"
        }, 
        {
            "index": 272, 
            "rating": "5", 
            "review": "One of the top 10 tempes to visit. Not at all as crowded as the main temples, but a beauty in its own right. When you have a few hours to spare, include this one in your itinerary"
        }, 
        {
            "index": 273, 
            "rating": "4", 
            "review": "Worth a visit if you are going to Bantey Srei. This is a smaller temple but well worth the visit on the way to Bantey srei. The architecture is similar to Bantey srei but not as delicate.We went in the morning and it was not very crowded since the tours were on their way to Bantey srei."
        }, 
        {
            "index": 274, 
            "rating": "3", 
            "review": "An average temple. Nothing to much to see here,but if your temple touring and its part of your route go for it.A few interesting carvings.Half an hour is plenty enough here.Part of Angkor ticket price."
        }, 
        {
            "index": 275, 
            "rating": "4", 
            "review": "Similar to Angkor Wat, Less Visited, Well Worth It. The most memorable part was the long pathway leading up to the outer gate of the temple and the large most/river in front where kids were playing in a boat. Beautiful and a bit more removed from the more touristy temples. I liked the grass growing in the temple grounds and the various levels that you can climb up and down. The only thing that ruined my time here was a group of Russians who shoved me told me to \"get out of the way\" so they could take a picture. Seriously? Calm down Russkies."
        }, 
        {
            "index": 276, 
            "rating": "5", 
            "review": "Not very visited, I don't know why. There was hardly anyone here and I don't understand why as it was my favorite temple. There is a huge promenade around the whole thing you can walk around and see. Then there are several temples on different levels you can explore, it's nice that you can climb around to discover the place."
        }, 
        {
            "index": 277, 
            "rating": "4", 
            "review": "B. Samre... take out the photos of Bantaey Srei about 12-15 of them. it was most disappointing to see the photos of bantaey srei among the 71 you show..I think accuracy and credibility is important. I usually visit B. Samre about 40 times a year as I have some good friends working there. I have visited to Siem Reap 3 times in 2011 and 3 times in 2012 and stay a month each time and I'm going in 4 days fo another 15 visits to B. Samre"
        }, 
        {
            "index": 278, 
            "rating": "4", 
            "review": "Flat and good. Enjoyed this temple. Pleasant surprise with it being flat, so not heaps of steep stairs like some of them."
        }, 
        {
            "index": 279, 
            "rating": "5", 
            "review": "Another Must See. Simply beautiful and a must go as well, its not far from Bantey Srei, so you might as well go to this temple as well."
        }, 
        {
            "index": 280, 
            "rating": "4", 
            "review": "Peaceful Temple. My friend and I went to Banteay Samre on the way back from banteay Srei. There were not a lot of people visiting this out of the way temple which made it less crowded and peaceful. If you've seen the other temples in Angkor Wat and Angkor Thom, you'd be seeing more of the same here but nonetheless its still worth visiting simply because there are not a lot of people going here."
        }, 
        {
            "index": 281, 
            "rating": "5", 
            "review": "Spiritual Banteay Samre. We visited Banteay Samre on the way back from Santeay Srei. We got there about 10h00 and not many visitors so this was great as it gave us time to explore the temple at a good pace. We felt that of all the temples, Banteay Samre had a serene and spiritual feel to it. Not sure if this is because it was not as crowded."
        }, 
        {
            "index": 282, 
            "rating": "5", 
            "review": "One of my favorite stops. It was a bit of a drive, but this temple was a little less busy and was very nice to see. There is almost no climbing on this tour, which was a nice change!The color and small details on this temple were amazing.There was a band playing at the end of the temple, and we sat and listened to a song and made a donation.On the long walk back to the front of the temple, we were grabbed by an older lady who wanted money and a younger man later who might have been with her. It was not violent in any way, but the rural setting of this area and fewer travelers may have made this more likely.I don't recommend visiting the shops here -- it was even worse than normal and I didn't see anything different than I'd seen in town."
        }, 
        {
            "index": 283, 
            "rating": "5", 
            "review": "Felt like Indian Jones. This was not part of my tour but our guide was able to setup a driver to take us out there on our last morning in Siem Reap. It is a very long drive out of town 60 - 90 minutes but well worth the trip and I think a must see. We got there early enough that the place was not crowded and as I approached the ruins I felt like I was Indian Jones discovering some new ruined temple in my quest for some lost artifact. Unlike the places closer to Siem Reap this place has not been restored and only in a few places will you find wooden walk ways or support structures where it is too dangerous to do with out. This means lots of ducking in under low fallen stones or climbing up piles of ruble as you explore and nothing is off limits (though some places were hard to get to). We picked up a guide at the entrance, a Khmar woman around mid to lat 30s with a wooden leg which may have been the result of a land mine. She led us through showing us various things and pointing out interesting parts of the ruins and I think we paid her about 10 or 20 USD at the end, well worth it.Unfortunatly our time was limited as we had a flight to catch so I would recommend dedicating a day to this and maybe some of the surrounding areas.I will try to post some pictures later.erik"
        }, 
        {
            "index": 284, 
            "rating": "4", 
            "review": "Another great temple. Similar to Angkor Watt on a much smaller scale, but well worth a visit. Internal moat but no water when we were there."
        }, 
        {
            "index": 285, 
            "rating": "4", 
            "review": "Worth the visit. It's one of the lesser visited wat's. It is small in size but still very interesting as the carvings are much finer than Angkor Wat. So you actually get time to take some great photos without a tourist in sight"
        }, 
        {
            "index": 286, 
            "rating": "5", 
            "review": "Great and less touristy. Great temple because its quiet and just off the main routes. Has been really well restored and has slightly different architecture to some of the others include great terraces on one of the sides."
        }, 
        {
            "index": 287, 
            "rating": "5", 
            "review": "Angkor Wat in miniature. Lovely calm atmosphere, prob about 5 miles from Angkor Wat but I would guess, little visited as we had the site almost to ourselves, fine, elaborate carving, well preserved, not to be missed."
        }, 
        {
            "index": 288, 
            "rating": "4", 
            "review": "A smaller temple but well worth a visit. If you are travelling out to Banteay Srei, make sure you visit Samre on the way. Quality over quantity."
        }, 
        {
            "index": 289, 
            "rating": "4", 
            "review": "Small temple, less frequently visited. This is a nice temple in good condition. It doesn't take long to walk around, but it has some great long corridors and stone work, and far fewer people than most other temples."
        }, 
        {
            "index": 290, 
            "rating": "4", 
            "review": "Peaceful temple. Somewhat off the beaten track this is an interesting temple that attracts relatively few visitiors so it is a pleasure to discover."
        }, 
        {
            "index": 291, 
            "rating": "4", 
            "review": "Incredible carvings. The most detailed carvings are to be found on the pink sandstone encased temple. It has been roped off to protect the carvings, which makes it feel more distant and not as up close and personal as it was in earlier years, but still a marvel to behold. Smaller and easy to navigate, but a bit of a drive from Siem Reap and most of the Angkor complex but worth it if you have time, which you should make for this awesome place."
        }, 
        {
            "index": 292, 
            "rating": "5", 
            "review": "Restored. This place was a welcomed visit, a restored temple and barely a crowd. We would certainly recommend this temple."
        }, 
        {
            "index": 293, 
            "rating": "4", 
            "review": "Enchanting.... This is near Banteay Srei. Less crowd but a must see temple list in siem reap. Carvings are also amazing. Easy to take photos since not much crowd here."
        }, 
        {
            "index": 294, 
            "rating": "5", 
            "review": "Great Temple without the Crowds. Banteay Samre was one of my favorite temples visited during my tour of the Angkor Temples. The temple itself is amazing in terms of carvings and detail, but what made it different from the other temples was the somewhat remote location. Whereas most of the other temples had swarms of visitors, Banteay Samre was relatively deserted when we visited. It really gave that sense of discovery that we search for. Also allowed for some great photographs without having to wait for other people to move out of the way. One of the better temples to visit among the Angkor complex."
        }, 
        {
            "index": 295, 
            "rating": "5", 
            "review": "one of the favourites. This temple is close to Siem Reap, but just off the Grand Circuit making it less popular with the crowds which is perhaps one of its best features.It has been restored to very good condition, is easy to navigate and has lots of interesting 'nooks & crannies' (excuse the technical talk here). There are some great carvings and towers in a similar style to those at Angkor Wat.We visited early afternoon and despite being a very hot & humid day it seemed to have lots of cool spots to escape the sun. All of these things would put it in my top 3 of about 15 temples that I visited."
        }, 
        {
            "index": 296, 
            "rating": "4", 
            "review": "Diminishing returns. The Siem Reap area is an embarrassment of riches. This temple, were it located anywhere else, would be a must see. But although it's not, strictly speaking, very far away, you also don't get more than about 20-30 km an hour out here on a tuk tuk). So if you've only got 2-3 days here, you probably want to budget your time carefully. This is simply not as memorable as the top 7 or 8 sites in the Angkor area, including Bantei Srei, which is indeed worth a visit. Do the big route and the small route first. If you have more than 3 days, absolutely make it out here. But if you don't, you may regret not having had those two extra hours to see one of those temples that really caught your fancy one last time."
        }, 
        {
            "index": 297, 
            "rating": "3", 
            "review": "Small and calm ruins. Compared to Angkor Wat, there are not so many tourists around here so you can chill out.The original ruins without much renovation attract you.On the other hand, little renovation makes your feet sort of burden."
        }, 
        {
            "index": 298, 
            "rating": "5", 
            "review": "Real ruins!. When we visit Angkor Wat, people say we are visiting ruins. But if you are really interested in seeing temple ruins, visit Bantey Samre. A massive renovation is under progress and it feels good that governments from all over the world like France & India with UN are supporting this renovations to save one of the oldest sites of this world. These temples are very close to Bayon and main Angkor temples. A little bit of imagination can do wonders and can surely take you to th at era."
        }, 
        {
            "index": 299, 
            "rating": "5", 
            "review": "Try not to miss this temple. It is hard to decide which temples to visit if you only have a few days (that is why you should try to stay in Siem Reap for at least 5 days), but try not to miss this temple. It has important carvings and it is very beautiful. It can be visited easily on your way back from Banteay Srei, and because it is not very big it will not take too long."
        }, 
        {
            "index": 300, 
            "rating": "4", 
            "review": "Hardly any visitors. This temple seems small and when I was there only one other visitor was around. It was actually a bit sad. I find the place quite beautiful and the carvings are still quite beautiful."
        }, 
        {
            "index": 301, 
            "rating": "4", 
            "review": "Peaceful and well restored. The temple is a little off the standard round - about 3 km east of the East Mebon. This means that you stand a good chance of having it to yourself.The impressive surrounding wall is about 6m high. The gopuras have some good deep relief carvings of scenes from the Ramayana. There are more relatively well preserved carvings on the lintels and pediments of the inner enclosure surrounding the single tower."
        }, 
        {
            "index": 302, 
            "rating": "1", 
            "review": "Not worth the time. When we went here,we were surprised that the ruins are too smalls.We spend much time to visit here,but no amazing and we think Angkor wat is enough.There are many ruins in Siem Reap,but almost ruins are similar and we cannot visit all ruins.You should think and go where you really want to go."
        }, 
        {
            "index": 303, 
            "rating": "5", 
            "review": "My favourite temple. This is a little off the beaten track and when we arrived there we had the place to ourselves. As well as the temple building there is an impressive terrace outside with an elevated walkway leading off into the jungle ... I wondered what it led to when the temple was in use. This is a special and serene place."
        }, 
        {
            "index": 304, 
            "rating": "4", 
            "review": "Too short time. We did not have enough time to visit this temple to its full extend, but were there long enough to experience the intimacy that is created through the fact that the temple has two moats (as the only one in Angkor). It closes at 5pm (we thought at 6pm, hence why we were late)"
        }, 
        {
            "index": 305, 
            "rating": "5", 
            "review": "Overlooked gem. This place is gorgeous. It's off the beaten track and very quiet so you can appreciate it in peace. It's smaller than the well-known temples, but with beautiful carvings that are very deep and relatively well-preserved."
        }, 
        {
            "index": 306, 
            "rating": "5", 
            "review": "Much quiter, time to explore. This was also a great temple. It is a lot quiter than the others and you can get around and explore everything. It also has been damaged from the war as our guide tolds the vietnamese hid here. There are many little girls trying to sell you things as you walk in, although these are quite clever as they get your name and remember you as you walk out!This temple should definitely be on your list."
        }, 
        {
            "index": 307, 
            "rating": "5", 
            "review": "My favourite temple. This temple is just amaizing.Is a small temple but ho boy is it good! is on the middle of nowhere and you have to walk a bit to get there but really worth it.the whole temple is complete so no rocks in the floor and if it looks so good now imagine 800 years ago.get there early in the morning 8am -8:30am and you will have some of the best photos of your holidays."
        }, 
        {
            "index": 308, 
            "rating": "5", 
            "review": "Smaller and less crowded. If you are out this way, this stop is a must. It was part of our tour package so we had a driver and tour guide the whole day. The guide was very knowledgeable and had good insights as to what we were seeing. A lot less crowded so able to get some great pics with no one in them. Annoying that the hawkers - a of of kids - latch themselves onto you as soon as you exit the car and when you return. How many times do I have to say \"no thank you\" before it gets old and I get angry..."
        }, 
        {
            "index": 309, 
            "rating": "5", 
            "review": "beautiful carvings. Most people go to angkor wat, bayon and ta phrom, 3 of the more popular temples. But if you have time, try going to some of the other temples like banteay samre and banteay srey. The carvings and bas relief are more intact and so detailed, you can spend hours just looking at them. Also, because banteay samre is less known, you get more chances for photo-ops."
        }, 
        {
            "index": 310, 
            "rating": "5", 
            "review": "Another amazing site. This is another temple at Angkor, located east of Baray built under Suryavarman the 2nd and Yasovarman the 2nd in the early 12th century it is a hindu temple in the Angkor Wat style named after Samre an ancient people of Indochina, it also uses the same stone as Banteay Srei"
        }, 
        {
            "index": 311, 
            "rating": "4", 
            "review": "Nice temple. Banteay Samre is a little far away from Angkor and can best be visited using a taxi. A Tuktuk would be more romantic but would probably take more than 1/2 an hour. Nice temple but for us not as interesting as for instance Ta Prohm or Preah Khan."
        }, 
        {
            "index": 312, 
            "rating": "4", 
            "review": "Hidden gem. Not many people make the effort to visit this temple that's a little out of the way & that's the magic of this temple - uncrowded. Worth a stop if you happen to be heading out to Banteay Srei."
        }, 
        {
            "index": 313, 
            "rating": "5", 
            "review": "Small Temple - Big on Character and Color. This was one of the most beautiful temples with the colored stone and carvings! It was fascinating to walk thru! Take a picture inside the \"picture frame\" temple door!"
        }, 
        {
            "index": 314, 
            "rating": "3", 
            "review": "Miniature of Angkor Wat. To me, this temple is just like small Angkor Wat. Nice to visit in the afternoon and see sunset from the temple."
        }, 
        {
            "index": 315, 
            "rating": "4", 
            "review": "Of the track. One of the lesser visited Angkorian temple. Which allows for taking architectural picture with no tourist in the way. The temple isn't built by a King unlike others. but built by a community dedicated to a king. As such the temple is small and isn't as grand as Angkor Wat despite being built by the same people that built Angkor Wat. The base isn't made of sand stone like Angkor Wat, probably they ran out of stones or that sand stones from Kulem is expensive to get. It's less ornate compared to the pink Banteay Srei but it's complex is bigger and has it's own solitude to bolster it's charm. Come here together with the Banteay Srei tour, as it's on the same route."
        }, 
        {
            "index": 316, 
            "rating": "5", 
            "review": "Wow!. Honestly I prefer this then angkor Wat. It isSmall but full of details. A little off though."
        }, 
        {
            "index": 317, 
            "rating": "5", 
            "review": "Small but Impressive temple!. Well All I can can say is I wish I had seen this temple on my first visit. The ornateness and carvings on this temple are awe inspiring. This temple also sees less visitors so it is possible to view it almost entirely by ones self. I had only to wait 10 minutes for 2 others to leave and then had the temple to myself for about 20 minutes. The carvings remind me of the detail you find at Banteay Srei. I almost hate to write a review as this will send more visitors to this lovely temple."
        }, 
        {
            "index": 318, 
            "rating": "5", 
            "review": "Wow. Even though it is small, this is probably the best site we visited in Siem Reap"
        }, 
        {
            "index": 319, 
            "rating": "5", 
            "review": "Beautiful bas reliefs abound. This quiet temple is worth visiting. You can admire the bas reliefs in peace and quiet, away from the crowds of the top rated temples."
        }, 
        {
            "index": 320, 
            "rating": "4", 
            "review": "Well worth visit. This place is well worth the visit! just mind your step...."
        }, 
        {
            "index": 321, 
            "rating": "4", 
            "review": "A lovely experience. This temple, along with Banteay Srei and a handful of others make up the \"grand tour\" as is the local jargon among guesthouses and drivers. If you're going on any part of the grand tour, you might as well see Banteay Samre. It is a pleasant temple, free of the myriad of tourists who flock to the main Angkor attractions located toward the center of the complex. I particularly enjoyed strolling around unmolested by peddlers and monks selling either goods or blessings. In fact, I've had a lovely conversation with a monk there and decided to get a blessing after all. The whole experience was lovely."
        }, 
        {
            "index": 322, 
            "rating": "5", 
            "review": "Off the beaten path but well worth the visit.. Slightly off the main road, Banteay Samre is a 12th century temple, beautifully restored, and well worth a look. Frangipani trees grow inside the compound making for some great photography. Passed over by the large groups, go and check it out and enjoy some solitude."
        }, 
        {
            "index": 323, 
            "rating": "5", 
            "review": "mini angkor wat. the guide said this temple is very similar to angkor wat in design...not a hard temple to visit oming from banteay srei. it is not that big and we were done in 30 min."
        }, 
        {
            "index": 324, 
            "rating": "5", 
            "review": "beautiful temple. We visited this temple after many others and it still managed to surprise us. The decorations of the walls are more detailed than in many other temples"
        }, 
        {
            "index": 325, 
            "rating": "5", 
            "review": "Beautifully Restored. I like this place because the restoration easily provokes a vision of what it once was. Combine visit to Banteay Samre with Banteay Srei. While the volume of tourists flocking this temple is relatively low, I recommend being there around 8:00AM to 10:00AM if you like to take photos (without any tourists obstructing the view as with the other more popular temples)."
        }, 
        {
            "index": 326, 
            "rating": "5", 
            "review": "Worth a visit. If time permits, it is worth visiting this temple which was completely restored using the anastylosis method. Tour groups tend to skip this temple so when we were there, there were perhaps no more than 8 to 10 people. There is a spiritual aura about this place -- quiet, serene, reflective -- one of our favorite temples."
        }, 
        {
            "index": 327, 
            "rating": "5", 
            "review": "Look for the meteorite .... Take your time; it's worth it. Look for the meteorite on one of its buildings, very interesting and life-like! Pleasant surprise."
        }, 
        {
            "index": 328, 
            "rating": "5", 
            "review": "Worth the trip. Its a long way to get to but well worth the trip hire a tuk tuk for the day $15 and see other sites in the area long day!"
        }, 
        {
            "index": 329, 
            "rating": "5", 
            "review": "Beautifully restored temple. A well restored temple, one of the most complete for you to see. Fairly quiet here too compared to other temples closer to Angkor Wat. Make sure you don't miss it."
        }, 
        {
            "index": 330, 
            "rating": "5", 
            "review": "Banteay Samre. A beach in the middle of historic structures. Just stop by Banteay Samre when you feel hot and tired during your visit to the ancient Angkor city."
        }, 
        {
            "index": 331, 
            "rating": "5", 
            "review": "Small but impressive.. We included a trip to this temple with one to Banteay Srei. Compact and a bit out of the way, we enjoyed exploring it moreso because there were so few other people there. Well worth the detour."
        }, 
        {
            "index": 332, 
            "rating": "5", 
            "review": "Amazing. Another great temple. Quite tranquill and magical.Get around the back of the wall and there you will find an oasis"
        }, 
        {
            "index": 333, 
            "rating": "5", 
            "review": "Well restored temple. We allocated one day to the temples that were a little further out (this one is only a short drive from the others) and our tuk tuk driver suggested including it and I am so glad he did. This temple has been completely restored and has a sanctuary tower in the centre. There were hardly any tourists at all there, very nice and peaceful after the masses at Angkor Wat, Ta Prohm etc. They have done such a good job with the restoration and this one was not on my list so we nearly missed it. There are two libraries and a high wall around the outside, several interesting carvings on the doorways of the inner enclosure. Great photography opportunities due to having it almost to ourselves. Include this one as its completeness make it really worth a visit."
        }, 
        {
            "index": 334, 
            "rating": "4", 
            "review": "Compact enough for exploration; a little out of the way. Banteay Samré is outside of the Grand Tour Circuit so it is slightly out of the main attractions such as Angkor Wat and Angkor Thom. If you plan to visit this temple, pair it up with a visit to Banteay Srey and possibly the Angkor Butterfly Centre, Cambodia Landmine Museum and the shooting range.It is not as small as Ta Som but I wouldn’t call it medium either. I guess the word “compact” is more appropriate. The size is about right for exploration but it should not take you more than one hour to do so. There is a short path on the left side of the temple that you can also explore."
        }, 
        {
            "index": 335, 
            "rating": "4", 
            "review": "Banteay Samre is Quite A Gem. I was there in July, during the low season, and Banteay Samre was very quiet and peaceful. There were less than 10 tourists. Definitely great to visit, as you can feel like you own this huge temple with green surroundings all to yourself. Banteay Samre is very well preserved, there was some ongoing restoration work; as with all other temples in Siem Reap.Your tuk-tuk driver will most probably drop you off at the N entrance. Following suggestion from the guidebook Ancient Angkor, I walked all the way towards the N gate, but turn left and walk along the wall until I reached E gate. Then, I backtracked to see the terrance and walkway, which has some nice sculptures of ruined lions.The temple buildings in the enclosure are quite small, compact and they stood on a platform risen from the ground floor. This makes the temple quite special. Really worth your time."
        }, 
        {
            "index": 336, 
            "rating": "4", 
            "review": "Good pictures. Did this Angkor Wat era temple on the way to Bantei Srei on the two occasions I was in Siem Reap. On both times, pictures of this temple soemhow turned out to be among the best. It is a slight walk in from the main road and is walled, with the main temple inside in quite a good state.The inner moat (with no water of course) within the temple's compound is the only one I have noticed of the Angkor temples and walking around and accross it from one wing to another was good fun. As with each different temple in the Angkor area, this too gives you a different feel. Worth a visit"
        }
    ]
}