{
    "category": "Siem-Reap", 
    "entity": "Backstreet-Academy", 
    "avg_rating_stars": 4.783333333333333, 
    "review_count": 300, 
    "rating_stats": {
        "poor": 4, 
        "average": 7, 
        "terrible": 1, 
        "very_good": 35, 
        "excellent": 253
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "Cement Bag Laptop Case: Witnessing a talented artison. After three days of temple touring, I spent the day in activities with Backstreet Academy, an NGO that pairs interested tourists with local artisans for lessons, giving the artists a substantial part of the course fee. The afternoon was a sewing class for “Cement Bag Handbags.” I thought we’d be knocking off some simple shopping bags – I had no idea that the seamstress Sreemom and I would spend 4 hours together to make two reinforced computer bags out of Thai cement plastic bags, one of her designs. We cut pieces of Thai cement bags, black cotton for lining, thick clear plastic for the covers, and foam padding. The materials were cheap and recycled, but each part had to be measured, pinned, fitted, sewn on an ancient Brother sewing machine, with mistakes ripped open and fixed, and a zipper installed at the top. I am weak with a sewing machine and chose a very-ambitious project - Sreemon was astounding in her patience and ability to help me do as much of this as I was able! She is a true artist - what I learned from her is patience, attention to detail, and being proud of what you do. Great way to spend an afternoon, and I love the bags we made."
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "Great experience making a handbag from tyre tubes!. Had a great morning with Vat Chantra making a bag from recycled tyre tubes. She was a lovely lady and very helpful. Plenty of designs to choose and was so happy with mine that I started using it straight away. She has a disability but still fosters 12 children through an NGO so nice to support her family. Was told by Backstreet Academy that they would take me from the meeting point to her house. They didn't mention it was on the back of a motorbike so being a 50 something woman I decided to have my tuk tuk dei per follow the guide. This wasn't a problem just a bit of a bumpy ride in the countryside!"
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "My son and I liked this a lot. My son of 13 and I took the coconut carving class. We went there in the morning while the rest of the family was still asleep. We made three keychains each, which turned out really nice. Part of the work is done by the craftsman, and there was always an English speaking lady with us. We both had a fun morning."
        }, 
        {
            "index": 4, 
            "rating": "5", 
            "review": "Incredible Off The Beaten Path Experience. The temples of Angkor Wat were amazing but I longed to meet the local people and experience typical Cambodian life while in Siem Reap. I didn't travel half way around the world to isolate myself in tourist areas that strive to replicate home.Luckily I came across Backstreet Academy's website. They offered a lot of different programs ranging from a couple hours doing crafts or other activities with local artisans to full day excursions.We selected the \"Unseen Cambodia: An Unforgettable Day In The Countryside\" tour. We had difficulty booking on their website and also with email communication. We phoned the local office and they were very accommodating arranging the tour for the very next day.As promised a tuk tuk driver arrived at our hotel at the agreed upon time and took us for the 30 minute ride to the village. We were greeted by our host Heng Sophean. He is warm and welcoming and speaks English very well. I am extremely inquisitive and he answered all my questions throughout the day without judgement.The structure to the day was consistent with the itinerary detailed on the website (rice farming and processing education and tour, crab fishing, visit to the local school, lunch, crafting) and all were very enjoyable. What I did not expect and what made the greatest impression was how the members of the community, most of whom do not speak English, allowed us to have an intimate look into their daily lives. Upon request we were able to look inside a home and see what a typical family lives like. We saw how the children play together and the approach to parenting, the interactions and connectedness of the members of the community and we experienced the amazing warmth and generosity of the people feeling much more like relatives invited over for a family gathering than tourists on a purchased tour. The cost was $48 per person for the 3 of us which initially struck us as high, but it was well worth the cost as we were the exclusive guests that day, no one else, and received a very personalized and flexible experience. I highly recommend this tour if my description appeals to you."
        }, 
        {
            "index": 5, 
            "rating": "4", 
            "review": "Returned from Siem Reap with a lovely self-made souvenir(a copper cuff)!. I found the place easily enough. I was the only student at that time, but there were three other artisans at work around the same table. Seeing their patient and skilled work was inspiring. My young instructor spoke English well. Since I had not taken a design along he asked me to select one from two/three simple options. The etching itself did not take too long and they cut and curved the finished plate for me. I wish I had taken notes on the steps regarding the acid bath and blowtorch. That went by rather quickly. Though my queries were answered, it would have been helpful to have had a written record. The finished bracelet was in my hands in about an hour and half.I appreciated this opportunity to learn and interact with the locals. Will definitely be checking out Backstreet Academy offerings whenever I travel in the future."
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "Palm Weaving & Carving.... I booked two classes with the Academy online for my family. We really enjoyed the experience and I left humbled."
        }, 
        {
            "index": 7, 
            "rating": "5", 
            "review": "EXCEPTIONAL. Great place to see first hand some exceptional skills at work from wood sculpting to tile painting & lovely shop to browse & get tempted."
        }, 
        {
            "index": 8, 
            "rating": "5", 
            "review": "Wow!!. Absolutely loved this place!! A truly awesome creative space with really great people! We did woodcarving and I was surprised at how well I did and how fun it was! Felt good to be able to help support these local artists too!! Got some fantastic gifts too! Highly recommend this place even if you're not the \"creative type\"!"
        }, 
        {
            "index": 9, 
            "rating": "5", 
            "review": "Warrior initiation. We had a great day, making a knife, learning bokator, preparing and cooking our own lunch of frogs and eels, and making a cross bow. And they were great with the kids, thank you so much, would definitely use backstreet again!"
        }, 
        {
            "index": 10, 
            "rating": "5", 
            "review": "Had some spare time, was not disappointed!. So I went here twice in one day. that's how cool it was.Morning- I was meeting up with a friend after lunch so I had some time to kill, I found this place on TA and thought 'what the hell'. got there and pottery was the only option at that time. signed up, paid $19 (I think) and started making a mess. Make sure you wear cloths you don't care if they get dirty, mine did and I looked silly all day. At the end of producing 5-6 pieces, you pick 1 to have glazed and for you to keep, while the other pieces are sold at the markets where the proceeds to back into the academy. This place is amazing and there should be more like it around the world!Afternoon- since I had such a great time earlier, after lunch I forced my friends to come and craft with me. I decided at that point to do the oil painting and paid $20 I think. I, apparently, am not the Picasso I thought I was but I still had a blast! The artist had only me at the time so it was really a one on one class. He was so kind and patient (when I was not at times).1) they bring your stuff to your hotel when it is dry, wrapped wonderfully for travel! 2) oil paintings don't dry quickly!Plan on spending a lot of time, most classes that I've witnessed were over 2-3 hours. and I would have stayed for more classes if I could but didn't have any more time."
        }, 
        {
            "index": 11, 
            "rating": "4", 
            "review": "Appreciate the craftmanship and support the artisans. Get a first hand look at just how much work goes into making many of the items seen in the markets. The skill, time and patience required becomes evident as you observe different techniques being employed to create wood, metal and ceramic pieces."
        }, 
        {
            "index": 12, 
            "rating": "5", 
            "review": "Vietnamese Cooking Class. Vietnamese cooking classWe attended the cooking class with Ms. Hang and we couldn’t have asked for a better food experience in Vietnam than this cooking class. We met our guide in front of fashion store and little did we know that our cooking class was to held right behind the fashion store where Ms. Hang lives. A house of modest means but of a big heart and even bigger cooking spirit. It’s apparent from the very beginning that she’s passionate about cooking and that comes across when she is teaching you to make the various dishes. My favorite was the Bun Cha. Had I known about this earlier I would have probably come back for a few more meals at Ms Hang’s."
        }, 
        {
            "index": 13, 
            "rating": "5", 
            "review": "Horse riding through the village. This 2 hour horse riding experience has been one of the most memorable parts of my Cambodia trip. It was offbeat, unique and didn't feel \"touristy\" - I felt privileged to be able to get on a horse and go through the villages, rice fields and see the beautiful and peaceful side of Siem Reap. I was cautious and afraid initially but the staff were confident and happy to address all my concerns. Highly recommend it to people who love nature, outdoors and can appreciate the simple life. Thank you to Happy Ranch Horse Farm and especially Taun for guiding us (and our lovable horses!)."
        }, 
        {
            "index": 14, 
            "rating": "3", 
            "review": "knife making. i booked and paid a deposit for the knife making and was picked up as planned went to the place where i was to make the knife with my driver, i guess i was expecting too much but thought i would be doing more hands on than i did, i probably spent 5 minutes of the hour doing something, the rest of the time sitting watching. no one talked to me my interrupter sat talking to the guys there in there language, i guess i did get a knife in the end but i cant say i made it......the most disappointing thing was that my driver/ interrupter tried to overcharge me the balance, when i questioned him he said i was mistaken and he was right.....when i told him i had the email with the price on my phone he backed down very quickly......no he didn't get a tip.....if you want to basically watch a knife being made for $33.00 go for it, if you want to make a knife yourself...don't bother"
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "Coolness with Copper. Siem Reap has more to offer besides its amazing archeological park. I wanted a unique experience and I got one at the Sam Orn silver shop. My instructor patiently guided me through all the steps of creating my very own unique copper bracelet. We sketched out the design and discussed which tools would work best to create it. He carefully demonstrated each move all the while chatting with me about life in Cambodia and asking me about my travels. If you enjoy hands-on experiences this is the place to go."
        }, 
        {
            "index": 16, 
            "rating": "5", 
            "review": "Great visit to learn and shop. One of your favorite experience was visiting the Angkor Handicraft Association (AHA) on the outskirts of town for a pottery class and to do some craft shopping-- highly recommended if you have time after the temples! Our children loved it and will remember it for years. While they learned, we shopped around and enjoyed looking at the all the beautiful handicrafts that were available."
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "Good fun but hard work . We did the stone carving course and had a choice of two tea light holder designs. It felt like hard work for a novice but as it started to take shape it really became quite therapeutic.Our instructor told us about how he was working to help restore one of the nearby temple, Banteay Srei, so he clearly knew his stuff. He gave us great advice to help make sure we finished with a great product and helped the younger ones in our group finish off. A great afternoon out but maybe not stimulating enough for the young 'uns."
        }, 
        {
            "index": 18, 
            "rating": "4", 
            "review": "Fantastic . My friend and I did the copper bracelet making at Sam Orn Silver Handicrafts. After a little trouble finding the shop (essentially don't follow the address sent to you that starts with st 30, trapeang ses village.. and ask your tuk tuk driver to go to the street behind Sofitel Angkor Phokeetra Hotel and from there you will see the shop) we were welcomed warmly and quickly got started choosing designs and getting stuck in. We were the only 2 in our group and so the guy in charge had plenty of time and patience for the both of us, he was chatty and friendly with excellent English. We chose custom designs and each had our names translated into Khmer to use on the bracelet. The whole process took around 2 hours (assuming this would be closer to 3 if the group was bigger) and was really interesting and enjoyable from start to finish. Absolutely would recommend this to anyone wanting to create a unique souvenir of their time in Cambodia or just travellers wanting to do something a little different if/when suffering from temple overload!"
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "Amazing . We did the copper bracelet workshop. Super patient instructors, and it was only myself and my friend there for the session which meant we got a private lesson! They were all very helpful, even translating our names into Khmer for us and telling us the best way to make the (probably unnecessarily complicated) designs we had chosen. The whole session took about 2 hours, and it was great to see the whole process including cutting and treating the metal! Although not perfect, the end results looked really good and I don't think you have to be an artist to create something beautiful there"
        }, 
        {
            "index": 20, 
            "rating": "5", 
            "review": "If I can do it.... I did the stone carving, making a tea light holder from pink sandstone. I looked at the sample presented by the skilled and patient host Khet somewhat dubiously (no way I could do that in three hours), and yet three hours later I had myself a quite reasonable facsimile! Khet was adept at knowing when to intervene and also at showing me how to fix mistakes. He has a quiet enthusiasm for his work and shares some of his life history and how he came to love his craft. If this is a typical sample of Backstreet Academy, I am eager for more."
        }, 
        {
            "index": 21, 
            "rating": "5", 
            "review": "Cocktail Making in Siem Reap. A lot of fun at a very quaint venue in a lane way off Pub Street. Made with local fresh ingredients ( limes, mint, green peppercorns, galangal, turmeric, ginger, rice paddy herb etc). We made 3 cocktails each, the last one being our own creation. Highly recommend this activity."
        }, 
        {
            "index": 22, 
            "rating": "5", 
            "review": "A Must Visit. A great place to view artists at work and buy fair trade crafts at a fair price. The variety is large and the quality is high. You get scarves, pottery, recycled products, carvings, clothing and more. I highly recommend a visit here."
        }, 
        {
            "index": 23, 
            "rating": "4", 
            "review": "If you want to have personalised gift, this is the one. my friend and I really enjoyed this workshop. Both of us would like to bring a unique souvenir back from Cambodia, the workshop runner translated our name in Cambodian, also drew the design skillfully. with his great help, finally, we got our beautiful copper bangle. It only took us 1 and half an hour, it is a fun experience."
        }, 
        {
            "index": 24, 
            "rating": "4", 
            "review": "Overall Great Experinece. I participated in 4 Backstreet Academy classes: Stone Carving, Knife Making, Crossbow Making, and a cooking class. The first three were great, and the cooking class was a huge let-down. The carving, knife making and crossbow classes all followed a similar format - they let you start off the project with some of the easier parts, and then finish off the more challenging aspects themselves so you walk away with a nice product. My two suggestions for improving these classes: 1) Have a model of the finished product on hand, or have the instructor complete their own so you can see the next steps ( many times I wasn't sure where we were headed, such as how much to take off in stone carving, and would have been more successful and had more fun if I knew what the goal was of the current step)2) Include a little bit more teaching, such as a little history or some general tips (such as - don't worry about taking too much off in stone carving - we can always fix it OR make sure you don't take off too much - it cannot be repaired). Some general guidelines about the crafts would have made the experience more enjoyable. The cooking class was not good at all - it was supposed to be 3 hours, including a trip to the market and a cooking experience in someone's home - it was none of these things. It lasted a little over an hour, was at a restaurant, and there was no trip to the market. The cooking itself was not engaging at all: put the fish in the oil...turn it now...turn it again....okay it's done. And to top it all off, I was charged $1 for the bottle of water they gave me. The food was okay but the experience was terrible. I love the idea of backstreet academy, and with a little improvement in the structure of the classes I would give it the final star."
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "Arts with the locals. My daughter and I made jewellery at the home of a wonderful young woman who also looks after 16 orphans in her spare time.My son and his friend was taught wood carving with a local expert at the main off street ship. Great experience and the proceeds go to a good cause."
        }, 
        {
            "index": 26, 
            "rating": "4", 
            "review": "Make your own souvenir. Booked online and took a class the next day with Mr Kheoun Sok at Sam Orn silversmith shop, who showed us how to make our own copper bangles. He provided helpful suggestions for designing a personalised item and patiently guided us through the process of chiselling, forging and polishing. It was a fun and educational hands-on activity with a unique memento at the end. More importantly, classes like this directly support the artisans and help keep traditional crafts alive."
        }, 
        {
            "index": 27, 
            "rating": "5", 
            "review": "Had a great time, and actually painted something pretty cool. I took a painting class in Siem Reap, and although I am really, really, REALLY not an artist, I managed to create an awesome painting. I had a lot of help (and absolutely no judgement or rush) from Svay. Everyone else in the class was very nice, and all of us had a great time, including a drop-in (which included a family and their young daughter)."
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "Great fun, something different. We had a fab time doing our rock carving our teacher was great, super patient and very instructive. Nice to do something different and get to take home a hand carved creation, my wife did the shopping bag creation and equally enjoyed it, great afternoon, rock carving takes 2 to 3 hours, don't wear good clothes (I wore white lol, it was red when I finished) support artists and do something different"
        }, 
        {
            "index": 29, 
            "rating": "5", 
            "review": "Lovely rainy afternoon activity. We organised our water colour painting class for 3pm. Only organised it on the website at noon! Very quickly response to my booking. All very easy. My boys aged 9 and 10 absolutely loved our lesson. Our teacher was very calm and helped us a lot. We each came away with great paintings of the temples! Good enough to hang on the wall at home! The class was held out the back of the Angkor handicraft association. We didn't get picked up there at all like the booking said. All in all a fantastic way too spend two hours during rain!!! I wish I was here longer to do more classes. Excellent promotion of local crafts and a great experience for the humble tourist. Enjoy!"
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Terrific Classes: Sketching, Soapstone Carving, Cement Handbags . My teenage daughter and I took three classes through Backstreet Academy: pencil sketching, soapstone carving, and making handbags. All were taught at the Angkor Handicrafts Association (where we also got some great local souvenirs for gifts). I can't say enough great things about Backstreet Academy. The instructors were pleasant and helpful, the classes all started and finished on time, and we got a wonderful chance to meet local people, chat with them, and learn a little of their skills. I wish we had more time to take more classes. We'll be looking for Backstreet Academy on our next trip."
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "Im so glad I found Backstreet Academy before our trip to Cambodia.. Would you like to feel like a local. This is the company to choose. The concept of touring with a local is amazing. We used Backstreet for 4 tours through Cambodia and each of them were well organised and a fantastic opportunity to see a city with a local."
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "Oil Painting workshop even for non painter!. Had an excellent time. My husband who claims he can't draw cam away with a painting I would be very happy to hang on the wall. The teacher was very good. Would be happy to do another workshop with them!"
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "Amazing Time in Siem Reap. My partner and I visited Siem Reap last week and took advantage of several activities offered by Backstreet Academy. We took a motorcycle tour of Cambodian village life, which included a boat ride to Tonle Sap floating village. We also went on a camping trip with temple exploration, as well as learned how to net fish from local fishermen. Our guides on all three tours were extremely kind, generous, and we felt like family. We met with local villagers and were welcomed into their home as if they had known us for years. I would highly recommend any of the three tours that we did and can almost guarantee that all of the activities offered, will provide a great experience. Thank you for showing me a truly authentic Siem Reap"
        }, 
        {
            "index": 34, 
            "rating": "4", 
            "review": "Lovely local lesson!. It was a great session, with the instructors teaching us step by step one of the dances and explaining the meaning of each movement. It's a lot harder than it looks! A lot of fun to try! We got dressed up in the traditional skirts."
        }, 
        {
            "index": 35, 
            "rating": "5", 
            "review": "Buddhist water blessing - amazing experience. We took the buddhist blessing trip and it was an amazing experience. Our guide + driver picked us up at the hotel right on time, took us to one of the pagodas down town and explained everything he could about buddhism, festivals, monks and history. He showed us how to pray ob pagodas followed by water blessing (loads of water :)) by a buddhist monk for health and good luck! Amazing experience as you feel like being shown something very intimate and exclusive. Would highly recommend to anyone who wants to learn more about buddhism and Khmer culture. Word of advise: take some clothes to change into - incl. Underwear;))"
        }, 
        {
            "index": 36, 
            "rating": "3", 
            "review": "Cultural Immersion with Locals. Backstreet Academy connects locals to tourists, an opportunity to immerse oneself into the local everyday culture of a city. I signed up for a lesson with a local Apsara dance performer. A local guide is supposed to accompany me to the performers’ home but we cross paths and never meet. The instructor, a young woman of 20 speaks no English. She dressed me in a costume sarong and we did our best to communicate but it becomes strained when the instructor’s impatience with my lack of flexibility to bend my fingers and legs begins to show on her face. I reached out to Backstreet after my lesson and they were received the constructive criticism graciously and credited a portion of the class to my account although I haven't been able to use it to date."
        }, 
        {
            "index": 37, 
            "rating": "4", 
            "review": "Cooking class!. We had a great time at a Cambodian cooking class in Siem Reap. Finally learned how to make the Amok we had been eating so much of. The translator and chef were both absolutely lovely. It was just me and my partner and we thought a lot of the preparation steps were already done which was disappointing (eg. the Amok curry powder was done so we still don't know how to make THAT) but we also know we couldn't possibly have done it all ourselves anyway so that might be something you do more of with more people. The food was great and it was a lot of fun - was a nice last day on our trip!"
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "A rainy afternoon with local artist - very cool. I booked a 2 hour painting class with a local artist who was very talented and nice. The results surprised me - I am not an artist - and the experience was unique and fun. I highly recommend it!"
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "Perfect activity for a change of pace during your trip. My friend and I had one day left in Siem Reap after seeing all the temples and other sights we were interested in and weren't sure what to do with it when we came across Backstreet Academy on tripadvisor. We stuggled to choose a course with so many great options available but in the end we decided to make cement bags. The activity was held at the Angkor Handicraft Association Market, which was really interesting because we could see local craftsmen making beautiful pieces and could make purchases knowing where they were made and where the money would go. Making the bags took around 3 hours, and we each got one-on-one attention from our kind and very patient teachers the whole time. My friend and I were very happy with our finished products - she made a fanny-pack and I made a laptop case. (Though one thing to note - make sure you add on at least an inch to the dimensions of your laptop if you are making a case, I very stupidly only added half an inch and now my beautiful laptop case will be a file folder forever more.)"
        }, 
        {
            "index": 40, 
            "rating": "5", 
            "review": "Amazing experience!. We made shopping bags and a laptop case! It was so much fun and the guides are really helpful, they totally go at your pace.I would 100% recommend this even if you haven't done anything like it before.Have fun!"
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "Give back to Cambodia. This trip was booked last minute but it was my second favorite experience in Cambodia. The Academy helps the local community by providing jobs and circulating money back into the Cambodian economy. If you want to buy goods- please come here. Many of the night markets goods are not made in Cambodia. As a result, the money does not circulate into the local economy.I decided to make a cement fanny pack and the experience was incredible. With the help of our teacher the step as easy as 1-2-3-4-5-6-7-8-9-10! You cannot miss this!"
        }, 
        {
            "index": 42, 
            "rating": "5", 
            "review": "A different experience for the kids. The wood Carving and stone Carving masters were friendly and patient to teach my daughters. They were very happy with the carved stone and wood pieces they made."
        }, 
        {
            "index": 43, 
            "rating": "5", 
            "review": "Wonderful skills for a lifetime. Backstreet Academy places you with local artisans where you learn a craft for a morning/afternoon. We choose to do the wood burning art work. What a unique experience. My sons really had a blast working with the irons. The carvings are going to go in a prominent position in our house once we're back. The cost is a little high for the average tourist but it's really the extra cash and it goes to helping the craftsmen survive. I couldn't recommend this more highly."
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "Knife making. Pricey at $32, and a little short, this was still a really cool activity. I have had limited experience with metalwork before, and this was a good introduction to forging. Was involved in the process, but all the finishing at each step was done by the smith - to be honest, I would have preferred to do more and make a cruddier knife. Call first to book a class"
        }, 
        {
            "index": 45, 
            "rating": "5", 
            "review": "Private stone carving lesson. After visiting the temples of Siem Reap, I thought it might be fun to try some stone carving. When I went to check on availability of the class, they didn't have any openings. However, I noticed that the same instructor also did a soapstone carving class, so I sent a request asking if I could do the stone carving rather than the soapstone. I got an immediate positive answer. When I arrived, my instructor was running a bit late. However, that was perfectly fine, because I was able to stroll around the area and look at other artisan made crafts. The thing I especially appreciated was knowing fully that the money was going to real locals and not some imitation from China. They really had some beautiful craft items. In fact, I also purchased 2 Kromar loomed scarves that my wonderful guide was wearing on our temple tour. There was a significant difference in quality between some cheap imitation knock-offs I bought for gifts vs 2 cotton material hand loomed kromar scarves - a little bit more pricey.Mr. Khet Poy was extremely patient and helpful during the 3 hour process. It certainly is more difficult than it looks. I don't have any innate artistic ability, but found I could handle this. However, my fine motor skills sure got a workout between my thumb and fingers - all the chipping and carving that's required.Since I was his only client, he was more than happy to discuss the local politics and history (he certainly did his best, but my fault for not speaking khmer). Toward the end, he was able to finish the product for me and it came out looking very nice. Despite the heat - easily 38 celsius, he offered me water and we worked under a shaded area with a fan blowing. He frequently threw water on the surrounding concrete to lessen the heat too. Definitely worth doing! Plus you have a personal product."
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "Cooking Tour and Oil Painting . Did 2 things with Backstreet Academy, Cooking with a Local and Oil Painting. Both were amazing.The cooking tour started with a trip to the local market before we went to the host's house to learn how to make traditional Cambodian dishes. Facilitator was very friendly, food was amazing and it was a great experience.I am terrible at art but the oil painting class turned out enjoyable and the facilitator was very patient and helpful.Overall a great, affordable way to experience local culture. Would definitely do it again."
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "Stone carving for 3hrs. We all spent few hours during the hottest part of the day making candle holders from stone under the cooling fan. The instructor was excellent and although work a bit reparative it was enjoyed by our kids of 12,11 and 10 which is a difficult age to entertain. They liked it much better then the temples"
        }, 
        {
            "index": 48, 
            "rating": "4", 
            "review": "Good Support for the local. After seeing the trip advisor review we decided to do something except the Angkor tour, we joined the copper bangle workshop and it is a pretty interesting experience, we would recommend to people want to do something special than joining the tour, also get the chance to supporting the local!"
        }, 
        {
            "index": 49, 
            "rating": "5", 
            "review": "A brilliant initiative. After being temples out and wanting something different for our last two days on hols and in siem reap I stumbled accross backstreet academy on trip advisor. Sooooo glad. I think this is a brilliant scheme. My husband and I did the ancient knife making course with Ly , which is mesmerising, we didn't expect to get to keep our knives but now we have two very cool , unique souvenirs. It's fun hard work. We also did the wood carving workshop with Ann. Turns out I should stick to cheffing but we had an awesome morning. He is very patient and helpful. I highly recommend BSA."
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "Amazing courses, 5 star service standards!!. When you do an activity with Backstreet Academy, you can be rest assured that you're signing up for excellent service and an unforgettable experience. All communications are done in perfect English, and the team are highly responsive. I was in Siem Reap, and signed up for three courses:-the Phare Circus:HIGHLY recommended. The circus tells a moving, intimate story of one of the founders who suffered during the time of the Khmer Rouge but survived and came out believing in the future of youths. The circus also offers sessions where you can learn some of the acrobatics! Not only is the act world-class, but it's also part of an amazing, life-changing social enterprise. Definitely a must attend.-Day trip to Mount Kulen:Our guides were passionate and very knowledgeable about Mount Kulen and Cambodian history - he was able to go all the way to BC!! Both guides also went out of their way to ensure that we were comfortable and happy. -Sunset quad bike:Safety was of the highest priority here; a rider in front and behind come along to stop traffic on public roads and ensure that everything's all right. The country side was scenic, and the sunset over the rice fields with grazing cows was a sight to behold.Thank you Backstreet for providing top notch experiences with reliable services."
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "Great way to experience Siem Real. We had arrived early to Siem Reap and were looking for other activities to do. After searching other attractions on TripAdvisor we saw BackStreet academy. This turned into one of the best things we did. They were very reaponsive to our request. The pickups were very smooth and our chapperones were very nice. We learned how to cook Cambodian food, which turned out amazing. Another of our group did knife making. If you do this, make sure you wear closed shoes. Would highly recommend this to anyone!"
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "Wonderful! Opportunity to see Cambodia beyond temples.. Copper wire bracelet workshop with Chanra at her home neat Angkor Wat. Backstreet guide picked me up and took me through her little village so it was also a chance to see local village life.Chanra was a very sweet and patient instructor, very creative also. She created a brand new design to the bracelet I made. I have 2 beautiful bracelets (paid additional to do second bracelet and also bought a pair of earrings).We talked (guide interpreted) about her family (husband injured in war) and work (ideas from Internet!) - she is a special lady."
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "Great time at the Palm weaving class. Took the class on making gift boxes. It's harder than you think and probably not good for kids or big groups. I had a 1:1 class with the teacher and didn't really need the translator that was provided. I finished a container but the teacher's friend didn't, and this was her third or fourth attempt. Making a square box is not possible because of the level of difficulty -it takes the instructor 4 hours to make a small one. I made more of an envelope but still got a lot of likes on Facebook! This is a great local experience. The place is not far from Old Market - I ride my bike there."
        }, 
        {
            "index": 54, 
            "rating": "5", 
            "review": "Great are the shadow puppet maker and wood carver handcraft workshops.. Our interpreters spoke very well English - better than we.The Masters are helpful and patient. We selected \"Rama\" and \"Sita\" shadow puppet figures which we wanted to make. It took a long time, but we finished. Thanks to all! It was great!"
        }, 
        {
            "index": 55, 
            "rating": "5", 
            "review": "A wonderful local tour experience. We have a wonderful experience with local family in a village. Heng Sophean is a very nice and patient tour guide. He can speak fluent English. He brings the villagers together and they teach us how to make rice, catch crabs and frogs. We have a happy lunch hour together. After that, we have a basket making lesson and a chance to listen Khmer traditional music. Besides, we have a visit to the village school and play football with the kids. At the end, we receive some souvenir from them. We have unforgettable experience in Siem Reap!"
        }, 
        {
            "index": 56, 
            "rating": "5", 
            "review": "Street Food Tour. Highly recommend! A quique experience and wonderful insight into Cambodian life, sites and food.We started the day with a trip to the market - what a place, full of activity with plenty of hustle!! We purchased our food for the day and the guide explained about how the markets work and how the local people shop. Once we had our food we were off to our Chefs house. Her kitchen was amazing and although she didn't speak English she was very friendly and you knew exactly what she wanted you to do when it was your turn to cook. We all had a go at cooking the food from our menu and she was happy to accommodate all of our tastes. The kitchen was very clean and the food was delicious. After a small break back at our hotel to let lunch settle we headed out again to the markets and the street food tour. We arranged to meet at 1645 and the team were right on time as promised. This time we explored the markets like a local and got to sample fruit, cakes and drinks.... all delicious. Once we finished exploring all of the market we headed out of town and experience the street food there. A great day..... I would do this again on my next visit"
        }, 
        {
            "index": 57, 
            "rating": "5", 
            "review": "Must do tour in Siem reap . We loved our time with backstreet academy and would highly recommend this tour. We got to see a side of the place we wouldn't have on our own - cooked some fantastic dishes in a authentic setting and were able to see how local people live away from the tourist traps of pub street but all with a helpful guide - highly recommend this to anyone - u don't have to eat the bugs - beer and chicken wings were gladly on offer in their place for those less daring"
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "The Ultimate Foodies Tour. We really didn't know what to expect when we booked this all day tour with Back Street Academy, but I must say my husband and I thoroughly enjoyed it all! We were met at the Handicraft Centre by our translator and guide Soy and a lady whose name I forget, we then proceeded to a local market via tuk tuk to buy our ingredients. After we had everything we needed and we had nose around the market, we went again by tuk tuk to the ladies restaurant/ kitchen to cook our food. We were given chef's whites, chef's hats and plastic gloves, everything was clean and came out of a fridge (however we did cook outside so there were a few flies but nothing too bad). We chose to cook fish amok, vegetable soup, banana flower salad and sweet potato in coconut. We were guided though each stage and once we had finished we sat down to eat our food (which I must say was excellent). After we had finished we asked if we could go back to our hotel and be picked up later for the final part of the tour. Our guide Soy made the arrangements and we went back for a few hours, we decided to be picked up at 5 so it was a bit cooler and at 4:45, he was waiting for us at the hotel with a tuk tuk! The second part of our tour took us to three different markets, the first was mainly vegetables, some meat and fish and some other interesting stalls like hairdressers, fan shops and even an eyebrow threading place! The second market and definitely the most real life experience I have ever had! Sold all sorts. We saw everything.... Live fish, cow entrails, red ants, fermented fish and even a wedding dress shop that sold steak! It truly gave us a look into Cambodian life. The final market was more light hearted and gave us a chance to try some street food, including some crickets, palm tree grubs and deep fried frog. I can honestly say we were stuffed and had a really interesting time! Our guide spoke excellent English and was a really enterprising, he was running the tour and finishing his final year at University. We finally got dropped off at a bar near pub street and completed a cocktail course, out host here was adorable, she was funny and quite dry! All in all a cracking day, we really did have a taste of Cambodian life, but in a well managed and safe way! A big thanks to everyone who hosted the day! "
        }, 
        {
            "index": 59, 
            "rating": "5", 
            "review": "Good support for locals. You pay the artist and 7% admin fee. So you support the local people directly. We booked a pencil and wood crave session for my 6 year old. The kid did well, but the courses are mainly for adults. I guess they do not have to many kids there in this age."
        }, 
        {
            "index": 60, 
            "rating": "5", 
            "review": "Fishing on the rice fields in Siem Reap with Soy was such a highlight!. We came across this adventure via Backstreet Academy and can say honestly that it's been a trip highlight. Net fishing is how many of the locals, to this day, fish for their families on a daily basis. Our guide/teacher/new friend, Soy created this course to help share with others, what he and his father used to do every day. He showed us how to to cast the net for the best catch, remove the fish from the net once caught, and how to spot where bigger (catfish-like) fish were swimming. He had become friends with the people who lived nearby the rice fields where we were fishing, so once we were done for the day, we worked with them to clean off everything we caught. We then spent the evening cooking up a delicious meal from our day's hard work and enjoyed the local drink (Angkor Beer, Black Panther beer and some version of Cambodian sangria) with our new friends. The woman of the house even cooked us jasmine rice from her own field as a special treat. A very memorable and special experience and a must do if you have the time!"
        }, 
        {
            "index": 61, 
            "rating": "5", 
            "review": "Authentic cooking experience. Loved our authentic cooking experience. Easy to arrange. Learning from experienced local cook Mrs Lam at her home with Manath as an excellent guide and translator. We loved the market experience and then cooking a huge amount of food! If you are worried about Western levels of hygiene rules this may not be for you as rustic outdoor cooking area but we all ate and no problems! Food was delicious. Great value for the amount of food and experience."
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "Great opportunity to learn something new if you have some time to spare. We did sandstone carving course (about 3 and half hours) and though we are not very artistically gifted, this was a great experience."
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "Trip highlight. This was the highlight of our trip to Siem Reap...as much or even more so than the temples. Our host was kind and patient, and our interpreter was really fun to work with. This class is held at a fair trade handicraft village, and everybody there is exceptionally lovely. Just a fair warning, the weaving is really really hard to do, but meeting the folks here is the real reward. Thanks for a great experience!"
        }, 
        {
            "index": 64, 
            "rating": "5", 
            "review": "Bokator. Really enjoyed this class with Grand Master San Kim Sean but we only booked for one hour and were disappointed we had not booked more time for this class. Master San Kim Sean is a great educator in the area of bokator. Definitely worth doing if you have time in Siem reap!!!"
        }, 
        {
            "index": 65, 
            "rating": "5", 
            "review": "Very enjoyable and used my artistic skills. After booking for 2 activities (wood carving and spoon painting) we only managed to do the wood carving due to time constraints on our side.We were welcomed very warmly by the academy.It was such a pleasant experience. I ahve never carved wood before but under the guidance of Oun Ann I managed to make a fantastic artwork. I was also gloating with pride when Oun Ann told me that I was very good. (he only said that to 1 person in our group). They gave us water as we were there for about 3 and a half hours.I would definitely go back again to do something else if I ever had the chance."
        }, 
        {
            "index": 66, 
            "rating": "5", 
            "review": "Fun way to spend a few hrs. We had seen enough temple ruins, so we were lucky to find out about the opportunity to learn a craft with a local artist. We met with Uhn Ann to learn wood carving. He and his translator were patient with us, and we really enjoyed our time with them. We were able to talk about many things besides wood carving. Uhn Ann is wheelchair bound, and it felt especially good to help support him in his craft. You meet at the workshop area - just give tuk tuk driver the address."
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "Copper Wire and Stone Carving in Siem Reap. Absolutley amazing, the artists where patient an friendly. We learnt alot and most importantly we loved meeting the people and hearing their stories."
        }, 
        {
            "index": 68, 
            "rating": "5", 
            "review": "A Fantastic Non-Temple Morning. After feeling a little burnt out from temple overload, my friend and I decided to search for something a little different in Siem Reap. We found a copper jewelry class that was available same-day and jumped on it - and we couldn't have been happier. Our morning was spent out a small orphanage just a few km's outside the city being (patiently) shown how to create a design of our choosing. It was such wonderful company and the perfect way to do something a little different on your Siem Reap trip.Backstreet Academy is an incredible organization and I highly recommend everyone find a class to participate in while in Siem Reap!"
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "Lovely morning!. I booked 'recyled bag making' through Backstreet. Booking and payment straightforward, and there was someone to meet me at the location which was easy to find. Instructor and translator were friendly, and patient with a sewing machine novice. I got a great messenger bag at the end of the session, costing not a lot more the ones for sale at the night market!"
        }, 
        {
            "index": 70, 
            "rating": "5", 
            "review": "Alternative to noisy quad rides. We loved our experience of the Cambodian rural life....pick up from our hotel, friendly and warm family, travel around the villages in the ox-cart, drink a fresh coconut and ride of a buffalo in the sunset...beats the noisy and dusty quad bikes hands down ...plus the whole community benefits"
        }, 
        {
            "index": 71, 
            "rating": "4", 
            "review": "woodcarving. Four of us did an afternoon of woodcarving. We had a choice of three projects and we all produced a finished carving. There was a translator and plenty of help to show us what to do next. We all enjoyed the activity and got a sense of satisfaction in doing something we had never tried before and I have the plaque to show off to my friends. You can also look around at the other crafts that the local people have made and buy some. They were obviously a lot more skilled than me!"
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "Great time making ceramics. Our 3 kids (ages 14,11,9) had a great time learning about local ceramics and practicing on the potter's wheel. They made several items and then chose one piece each to be glazed and fired. The pieces were delivered to us the following day. Son Seyhak and the other teachers were very knowledgable and patient. So many talented artists. A great afternoon."
        }, 
        {
            "index": 73, 
            "rating": "5", 
            "review": "Wood carving class with Oun Ann. Girlfriend and I had lots of fun in the wood carving class. Oun Ann was a very talented carver and helped us along the way whenever we needed his guidance. There were three different designs to choose from and the whole class took around 3 hours. It's helping out a great cause too, with the place having the seal of authentic handicrafts. There are lots of crafts shops aimed at tourists which have items shipped in from China so Backstreet is a great place to visit even if you're just browsing the shop, but highly recommend a workshop!"
        }, 
        {
            "index": 74, 
            "rating": "5", 
            "review": "excellent fun with kids. we went there with our 4 yr old toddlers and the guy attending to us was great. we had chosen spoon-painting and he guided us (adults) through it, the kids had a ball and went (expectedly) creative - he finished their artwork off by adding the initially planned elephant & buddah face and they look lovely - so the kids did make 90% of the artwork, and with his kind help, it turned into something memorable of the trip. good that we did it on our 1st day and they had 4 days to dry before flying as they do take a long time to dry. we had to wedge them a bit so we could still pack them safely. highly recommend. run by nice people - very child friendly too."
        }, 
        {
            "index": 75, 
            "rating": "5", 
            "review": "Had fun painting!. My friends and i signed up for the Oil Painting workshop and we all enjoyed ourselves tremendously. Our facilitator was a local painter who guided us with the right colours and strokes to use and gave us good tips when we were really bad at painting. We came up with decent art pieces after 2 hours and although we got our hands really dirty, it was all worth it. The session cost USD$18 and i felt it was worth it as they provided all the materials and paint. Session was also private which allowed us to work in piece and had plenty of attention from the professional himself. Do note that the place is a little far off from the city area and you would require some time to reach. Also to note that if you are doing the painting, you would require some time for it to dry before you can easily bring it home. Ours was still wet even after a day and we had some challenges hand carrying it back to out country."
        }, 
        {
            "index": 76, 
            "rating": "5", 
            "review": "Great family time!. Fantastic way to get your kids immersed in the local ways of producing goods while also providing a great souvenir with some memories. Classes were private and we spent a few hours making pottery. I'd highly recommend it for families with kids. Side benefit is that you are also at one of the best places to buy unique Cambodian gifts where the money goes right back to the community."
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "Funstuff!. My friend and I had a great time. We are both in our 20s and study different martial arts at home. We had a great hour of learning. The grand master is very friendly, a mix of serious an fun, and has a great passion for this art."
        }, 
        {
            "index": 78, 
            "rating": "5", 
            "review": "Unwind from busy temples!. My boyfriend and I did the oil painting at Backstreet with Svay Em and had such a great experience. As first time painters, we weren't expecting to produce anything spectacular but were pleasantly surprised by what we achieved under Mr Em's guidance. It was a great, relaxing escape after seeing endless temples and made our last day in Siem reap really special and unique for us. Mr Em was clearly extremely talented as an artist but he was also very talented as a teacher, having lots of patience with us (even though we took far longer than the recommended 2/3 hours). I have been inspired to keep painting when I get home! He even packed our paintings so they would stay safe and dry for our bus trip the next day. This is an easy recommendation, thank you Backstreet!"
        }, 
        {
            "index": 79, 
            "rating": "5", 
            "review": "Really the highlight of our trip. My husband and I signed up for the knife making class and stone-carving. I was impressed by the website, ease of payment and response. The classes were excellent. Our translator for the knife-making class didn't have the best English, but Mr. Ly and his assistants were amiable and quick to laugh with me at my attempts to swing the sledgehammer. Stone carving was more tedious, but appropriate after seeing all the temples; you come away with additional respect for the amount of work that went into them. Highly recommend you check out the website for you trip to Siem Reap."
        }, 
        {
            "index": 80, 
            "rating": "2", 
            "review": "ceramic pottery class review. Unlike my previous iron pencil course by Bunhak on 13th feb which was very professionally conducted, my lesson of ceramic pottery on 15th feb was the direct opposite. The teacher started doing the first 3 pieces for me, after which i attempted to complete the fourth piece by myself. He was not attentive during lesson and seemed uninterested in teaching. At the end of moulding, he told us we are entitled to send one piece for firing, but tried to sell us the idea of paying extra $5 for each additional piece. I wasnt interested because only 1 piece was done by myself which I chose, the rest are extras he wanted to earn. At the end, he passed us a receipt of $38 for 2 pax. I took out my phone to check the amount in my email and it was only $35.5, another attempt to slice a little more off us. We asked if we could see the firing process and he said no. So we left our hotel (Santa Clara) and room number (11) and was told the pieces will be sent over by 12pm on 16th feb. We didnt receive by noon on 16th feb and decided to walk over to check and were told the pieces were not ready. I gave the staff there a lecturing on responsibility and told them they could have called me or my hotel to inform us if they could not meet timing as we had a flight to catch that day. The products were finally sent over. They were all blue in colour. I realised then that I could have chosen my favourite colour for my piece which the teacher didnt bother to highlight to me. What a great disappointment. This experience is in great contrast to my iron pencil course which was fantastically, honestly, professionally conducted."
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "Great listing of interesting \"off the beaten track\" activities. I'm glad I found out about this organization. It's good to know that there are plenty of other interesting things to do around besides the usual big touristy attractions. I got to discover a local artist who created a new art form and had the chance to work with him to create a personalized souvenir! I never would have found out about it if it wasn't for Backstreet Academy!"
        }, 
        {
            "index": 82, 
            "rating": "5", 
            "review": "Oil painting was incredible. I made an oil painting and it was just amazing. With the help o the local I was able to made by myself an excellent painting. It was a peaceful activity."
        }, 
        {
            "index": 83, 
            "rating": "5", 
            "review": "Awesome Cooking Class in Cambodia. We did a cooking class with a group of four people. Our host was a lovely Khmer woman. Though she spoke no English, Backstreet provided an excellent interpreter who joined us for dinner. We toured a market, bought all of our ingredients fresh, and went to the chef's home to cook. We chose to make traditional Khmer dishes, and loved everything we made. Especially the pumpkin custard - I recommend it."
        }, 
        {
            "index": 84, 
            "rating": "5", 
            "review": "very good. We did the copper bracelet, cement bag creation and Boxing, it was all very good! The website to subscribe was a bit challenging to operate but they helped by email and phone when I got stuck."
        }, 
        {
            "index": 85, 
            "rating": "5", 
            "review": "Amazing spoon painting experience . We had a great time spoon painting with our lovely teacher Em. It was great to have a good chat and walk away with an amazing painting. Would highly recommend!!"
        }, 
        {
            "index": 86, 
            "rating": "5", 
            "review": "Outstanding - holiday highlight. We did pottery making and copper bracelets. Sadly I was totally unskilled at both however our tutors pulled out all the stops and even managed to help me produce authentic and passable souvenirs! We loved it, everyone was so friendly and helpful - much mess was made and much fun and giggling later we managed to present 4 items for firing and then created two recognisably bracelet type things! We took our bracelets there and then but our pottery was to be delivered to our hotel when we returned from battenbang - it wasn't there and we were moving on to Sihanoukville - we resigned ourselves to not receiving it even when AHA agreed to send the items to our last stop in PP in time for our flights home... Well if there was a 6 rating this cynic would give it... Our pottery was ready and waiting when we arrived in PP! Bravo! Book this - you won't regret it!"
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "Absolutely fantastic!!. We opted for the 3 hour sandstone carving class with an amazing teacher, poy khet. With over 17 years of experience, we was extremely patient (with novices such as ourselves) and encouraging. It's incredibly difficult but totally worth it. We now have a beautiful piece to cherish for the rest of our lives and have new found respect for the sculptors of angkor wat.It's well worth every cent!"
        }, 
        {
            "index": 88, 
            "rating": "5", 
            "review": "Rare Opportunity for a Meaningful Travel Experience. This site is amazing and everyone should check it out. When I looked for activities in siem reap I found 64 options, something for all types of people and budgets. I did the sandstone carving and really felt a strong connection to what it was like to build the great temples at Angkor. A very skilled artisan named Khet showed me how to do it and guided me through three hours of careful work. The finished product was great and I got to keep it. I wish I had more time to try the other options the site has to offer!"
        }, 
        {
            "index": 89, 
            "rating": "5", 
            "review": "Best thing to do in Siem Reap. My husband and I did copper bracelet making with Bel and his lovely wife in their garden. Bel lost a leg in a landmine and although very intelligent has found it difficult to get work (people with disabilities are sometimes marginalised in his country). We spent a perfectly relaxing few hours making bracelets. It's great fun and we also learnt about the project and the country as well as seeing how happy these people were despite their hardships. They also now have their products for sale. A fantastic experience. Highly recommended. Suitable for everyone."
        }, 
        {
            "index": 90, 
            "rating": "5", 
            "review": "Sandstone carving -after seeing Angkor wat & all the temples .... It's a must do!. It was a great experience. Khet is a master at his craft of sandstone sculpture and a good instructor. Our projects even turned out pretty impressive!"
        }, 
        {
            "index": 91, 
            "rating": "5", 
            "review": "Hoi An. A hightlight of our vacation was lantern making in Hoi An. You do get an authentic experience working with locals to create a lantern to take home. They are kind and generous. Ask for Tom as your guide - he was a delight - enthusiastic and knowledgable. He suggested lantern making when our fishing trip fell through."
        }, 
        {
            "index": 92, 
            "rating": "5", 
            "review": "An Awesome Experience. This class was awesome! Spending time with our teacher and his translator was an excellent way to end our time in Siem Reap. Iron pencil drawing is exceptionally difficult, but Bun Hak is a patient teacher and will help you fix your creation so you can hang it on the wall when you get home. I wish we would have booked more sessions with Backstreet Academy."
        }, 
        {
            "index": 93, 
            "rating": "4", 
            "review": "Making Bracelets in a village near Siem Reap. Signed up to make a beautiful copper bracelet in a local village and got more than I bargained for in a good way!!!Found myself in a little village and the couple that helped me with my bracelet also house, feed and lovingly care for orphans. They are a special family. They are also involved with the Landmine Museum. Bel, himself, is an landmine victim but more importantly he is an artisan and creates beautiful necklaces, bracelets and paintings.A Spanish volunteer was teaching the children English. 'Chico' would go there for a couple hours every day after the kids finished school to teach them. He could only stay for 2 weeks so they are looking for others to help.This was an incredible experience and I have a pretty bracelet and ring to remember it by. Plus, I bought one of Bel's necklaces. Couldn't resist."
        }, 
        {
            "index": 94, 
            "rating": "5", 
            "review": "Great experience. We have just done iron pencil sketching class. This is my second time for this class and I have loved it both times. Three of us took 4 hours to complete an amazing memento of the Angkor temples. The teacher was very helpful because it is his own creation, using palm leaves as the canvas for your hot poker drawing. He was interviewed for a tv program the next day on artists in Cambodia. It is a unique technique and we had to practise first to get the correct degree of angle and time for the different parts of the drawing. Try doing Angkor Wat itself and do it before you go to visit. It makes seeing it so much more interesting as you hunt out the various lotus flowers that you KNOW adorn this amazing building as you have drawn them! Highly recommend it and the copper bracelet which my husband wants to repeat."
        }, 
        {
            "index": 95, 
            "rating": "5", 
            "review": "Surprisingly delightful experience. When I booked the 'Fear Factor Experience with the Backstreet Academy in Siem Reap, I truly did not expect our experience to be as fantastic as it was! We were met by our wonderful translator Manath at our designated meeting place and walked to the host's garden to learn how to cook grasshoppers, silk worm and tarantulas! The host, Ouch spoke very little English however he was very pleasant, funny and very accommodating. I was slightly worried about actually eating the grasshoppers, silk worm and tarantulas however Manath and Ouch put us totally at ease. We were surprised at the tasty flavour of the insects, we practically devoured the grasshoppers! This is a great experience and I totally recommend it for anyone who is visiting Siem Reap, even if you are screamish!! Thank you Manath and Ouch!!"
        }, 
        {
            "index": 96, 
            "rating": "5", 
            "review": "Interesting spoon printing experience for a novice. On a hot afternoon in siem reap, we decided to run away from the heat and try out something different. Picked spoon-printing without knowing anything about it. For someone like myself who has zero artistic talent and struggle to draw stick figures, my heart sinks when our tutor asked me to pick a picture to print. But somehow, after disturbing him every 5 minutes about what to do next, my printing turned out amazing beyond my wildest dream! For those who wishes to try something different, this is something to consider!"
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "Personalised cement bags with a local seamstress. It was great fun! The teacher was very patient and skilled and I ended up making a fantastic beach bag, which I will definitely use. Although a translator, also a local woman, was present, there were no language difficulties because of the nature of the activity. However it was more fun having two local women to interact with. It's the best kind of souvenir! I agree with the concept of supporting local people's entrepreneurship which enables them to improve their (and the family's) standard of living."
        }, 
        {
            "index": 98, 
            "rating": "4", 
            "review": "Siem Reap 2 separate courses. My partner and I took 2 separate courses in the same day organised through Backstreet Academy. Using the site is really easy. It's intuitive and very simple. No problems there. We decided to do the copper bracelet making (from metal to masterpiece) in the morning and the coconut carving in the afternoon. Both courses delivered what they said they would do in terms of the outcome. However the experiences themselves were quite different. In the coconut carving we were warmly welcomed. Of the 3 hosts that we had only one spoke very good English. However this was not a problem. She was excellent at making sure we had everything that we needed and that we understood what we needed to do. We were expecting to come away with a keyring made from coconut shell which we had carved and we actually came away with 3 each. Excellent value for money and based in a communal space where a number of different activities could be seen and participated in. Very worthwhile. The copper bracelet making however was a bit of a different story. The course was supposed to take 3.5 hours. We were there for a little over an hour. We both left having bashed out a design on a piece of copper that became a bracelet. However the host was very impatient (this wasn't the lady advertised as it is a family business. We think probably her son) and kept taking over. We were also sat outside a silver shop for our tuition so anyone coming to the store could just stand over our sholders and watch which when you're trying to do something fiddly is very disconcerting. Overall the experience felt rushed and impersonal. The end product was good and we have a nice momento of our time in Siem Reap. I want to finish by saying that we wouldn't hesitate to use the site again and would recommend to others. Especially if you are I Siem Reap. Please check out the Angkor Handicrafts Association. It's a not for profit organisation that allows local people to make, sell and show others how to make their crafts. Doing brilliant work and we really enjoyed it."
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "Excellent 'Crafting' Experience. We booked a bag making class through Backstreet Academy. It was held at the Angkor Handicrafts Association - a fantastic place in itself (see my separate review). Both the instructor and the translator were really helpful and patient with me and my boyfriend - we were not good at the activity to start with! Its well paced, everything is well explained and there's time to practice and perfect your sewing skills! We both came away with decent-looking bags and has a fantastic three hours. We would have done more activities with Backstreet Academy had time allowed."
        }, 
        {
            "index": 100, 
            "rating": "3", 
            "review": "Too expensive. The artist was very good and skilled, but the price is simply too high for this activity. If all the money we spent (-7% for the service charge) went to the artist, we would be more than happy."
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "Make your own souvenirs and fun memories. Taking one of the Backstreet Academy programs is a great way to interact with the real people of Siem Reap. It is well organised with translators on hand. We did the iron pencil sketching program and created some unique pieces to artwork with much help from the very talented teacher. With four of us all doing our own picture of the Angkor temples, the class ran for four hours. They also provided complimentary water and beers to help sustain our efforts.Our daughters (15 & 18 yrs) also had a lot of fun at the Apsara Dance Class."
        }, 
        {
            "index": 102, 
            "rating": "5", 
            "review": "Mountain Visit and swim in Waterfall. Great personal service, we really enjoyed the knowledge and warmth of our guide and driver. A must do for all ages when visiting Siem Reap. Amazing day!"
        }, 
        {
            "index": 103, 
            "rating": "5", 
            "review": "You will miss so much if you don't experience. Took the leather carving class and ended up with very pleasing result. Not too hard, easy going and learned some techniques to inspire. Recommend. Took cocktail making class, refreshing drinks that don't require lots of bottles of different spirits, unique recipes, may now take up drinking! Recommend. Dessert making class eye-opener, new ways to combine familiar ingredients into sweet course. Great range to choose from, surely some will be on our menu at home. Recommend. Aspara dancing was great fun, though I don't see us doing it at home. Fascinating to become truly aware of grace and charm of finger and hand poses. Recommend.. Traditional music can be challenging or relaxing, demanding or a giggle, depending on what you bring to it. Recommend. There is so much more to do on holidays than eat, visit museums, temples, art galleries and read by the pool! We discovered backstreet academy (Siem reap) half way through our visit and now we will try to come back to do many other activities and also check out what is on offer in other SE Asian cities as well.Loved it, recommend it, and all kudos to local people who want to share their culture with you, not just put up \"happy hour\" signs. All teachers were genuinely happy to respond to questions and adjust teaching to suit your needs and requests."
        }, 
        {
            "index": 104, 
            "rating": "5", 
            "review": "Hidden Gem of Angkor Wat. Don't miss this temple..it was our favourite and far less crowned than the Big 3. The walk through the trees to arrive there gives a sense of adventure, good spot for a picnic.. ask tuk tuk driver to pick you up on other side from where you are dropped off so you don't have to double back"
        }, 
        {
            "index": 105, 
            "rating": "5", 
            "review": "Authentic, fun and worthwhile. I took the Iron Pencil Sketching class, and I had a fantastic time. Reoum Bunhak is a masterful artist who was so much fun to watch, and who helped me whenever I needed assistance. I brought my own picture to draw and the staff were accommodating (they even gave me a lift to a nearby ATM and provided beer and soft drink towards the end of the class!). Backstreet Academy is a very worthwhile endeavour which I encourage people to support. The Angkor Handicraft Association, where the class is held, is a souvenir buyer's delight. Everything for sale is produced there, and all of the revenue goes directly to the artists. Overall, a fantastic artistic experience!"
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "Dessert making & Cement bags. We throughly enjoyed!!!. My husband and don went off to try their hand at dessert making while the girls and I did cement bag making. Booking was really easy through backstreet academy. Communication confirming booking etc was also excellent and both activities were loads if fun. Great for kids and adults."
        }, 
        {
            "index": 107, 
            "rating": "5", 
            "review": "Insect cooking and eating experience . Never thought that crickets, grasshoppers, silk worms, and tarantulas could taste so good. Highly recommended it for those who are not squeamish."
        }, 
        {
            "index": 108, 
            "rating": "4", 
            "review": "Ultimate foodie tour is so worthwhile. Apart from some confusion over our itinerary and food choice we had an amazing time with Sam, our guide. We began at 10.00am and were taken by Tuk Tuk with Mrs Lam to the local market. No other Europeans there. After shopping was complete we went to the back garden area of her brother in laws house. The kitchen is set up with to burners, curtains and a small tabs and chairs. Very basic but clean and tidy. We were given encouragement to start preparing the food and could take notes. This is difficult as some things get lost in translation. Maybe some recipes on the website would be good so customers can download or print off when home again.After a lovely lunch Sam took us back to our hotel, about 1.30. We were not expecting this but it was ok. He picked us up again at 4.30 and we went to a large local market again only locals. Very busy and fascinating with all kinds of food available. We tried lots of fruits and delicious rice cakes.We then went on to a larger market where thy sold all,sorts. It was a little out of town and very busy with a vibrant atmosphere. Here we tried cricket, silk worm and stuffs fog. Our choice to do,so, no pressure.We returned at about 8.30pm.We had a great day and felt that we saw a little of the Cambodian town life. We would thoroughly recommend this tour, just think the admin side and itinerary on the booking form should be clearer as to what the day will be."
        }, 
        {
            "index": 109, 
            "rating": "5", 
            "review": "Interesting and worthwhile.. The Angkor Handicraft Assocaiation (AHA) help people in local communities. The people use their craft skills to create souvenirs from which the money goes to the local people.Yes it maybe a little out of the way, and yes the items maybe a dollar or so more expensive than the markets in SR but at least the items are not mass produced imported stuff and the money goes to a worth while cause.Depending when you go you may see some of the people working and using their skill in actions. I saw potters and some iron sketching in action when I went."
        }, 
        {
            "index": 110, 
            "rating": "4", 
            "review": "Khmer Cooking Class with a Local. A friend and I spent the afternoon cooking with a local Cambodian woman and a translator. The afternoon included a trip to the market to purchase fresh ingredients, helping to prepare a four-course meal, and of course enjoying the tasty dishes in the company of our new friends. We particularly appreciated the help and enthusiasm of our translator, Radha (sp?). He was fantastic! Thanks for allowing us to enjoy such a fun, local experience in Siem Reap!"
        }, 
        {
            "index": 111, 
            "rating": "4", 
            "review": "Authentic activities with real Cambodians. We did the copper jewellery and Bokatar Boxing.\nBoth were set in genuine venues.\nYou should see how fast The Grand Master is at his art of Bokatar.\nPerfect for all ages, our 15 ad 17y girls copped really well and learnt some fantastic skills in just a few hours."
        }, 
        {
            "index": 112, 
            "rating": "5", 
            "review": "Great experience. Stone carving, great expedience. Took 4 hours to make an elephant and flower. Would highly recommend."
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "A chance to meet and work with local residents. Really interesting. Thw village women were very informative and communicative. A real chance to share similar roles from different cultures. And you walk away with a bag created from local materials."
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "A memorable experience. We did iron pencil sketching with Mr. Bunhak. Both our instructor and our facilitator Srey Leak were very patient with helping us along. They also taught us some Kumer culture, which is very interesting to know. The hot iron pencil sketching came with Mr. Bunhak's original idea. Highly recommend that you go for this unique experience in Siem Reap, rather than doing just the temples."
        }, 
        {
            "index": 115, 
            "rating": "5", 
            "review": "Woodcarving at the knee of a master. I truly enjoyed this class with master wood carver Un Ann, and I felt good about supporting such a great program as Backstreet Academy which puts local artists and tourists in contact with each other throughout cities in Asia. Such a sweet, patient man, Un Ann guided my hands through the process and put the finishing touches on the wood flower we carved together. An experience I won't forget!"
        }, 
        {
            "index": 116, 
            "rating": "5", 
            "review": "Great Cambodian experience. I learned of the Backstreet Academy from Trip Advisor and signed up for iron painting on palm leaves. For more than two hours I was personally instructed by Bun-Hak who is the originator of this technique, and ably interpreted by Ve Koeu throughout the process. I handled hot pokers to burn the template, and tried my best. Eventually Bun- Hak tidied up my feeble attempts and then I filled in the easy parts. Looking at the finished product I am totally pleased and will hang this proudly on my wall at home. And best yet, I have happy memori s chatting with Ve Koeu and learning more about Cambodia Life. it is an experience well worth the time and money!"
        }, 
        {
            "index": 117, 
            "rating": "5", 
            "review": "Awesome Experience. This was the highlight of our trip. We learned how to paint using a burning iron on dried leaf/paper. Our teacher and the staffs there were so friendly and nice. We painted Angor Wat and took the painting home as souvenirs. The best souvenirs ever!Backstreet Academy also offers many other classes. Wish we had more time there to try them all. If we go back to Cambodia again, this sure would be the place to visit again. The experience was memorable and great. Thank you Backstreet Academy!"
        }, 
        {
            "index": 118, 
            "rating": "5", 
            "review": "A different way to experience the arts of Angkor. If you are like us, amazed by the beautiful apsaras in Angkor temples, come here and take a stone smith lesson. Our teacher is a professional artist with a lot of patience. After 3.5 hours of hard work, we made a pair of candle holders out of pink sandstone, which is the only \"souvenir\" we brought back home. Highly recommended! "
        }, 
        {
            "index": 119, 
            "rating": "5", 
            "review": "Ultimate foodies your . Did the foodie tour today , what a treat cooked papaya salad, amok fish and chicken curry after collecting all the ingredients from the market. Great hosts had so much fun and the food was awesome. Highly recommend"
        }, 
        {
            "index": 120, 
            "rating": "5", 
            "review": "Make your own bag - great experience! . I really wanted to make my own bag and was lucks to find another girl who woukd join. This way I didn't have to pay 5$ extra in order for the \"class\" to take place.We booked it the morning we went there (2 hrs before) and it all worked out perfectly. After booking we received the location and the tuk tuk driver had no problem finding the place.Right when we arrived we started by choosing which design of bag we wanted.I had an idea in my head and with Google and the translator the girl understood very quickly what I wanted to make. They all have great understanding of sewing patterns and had no trouble showing me how to cut and sew the pieces together. I didn't have a lot of trouble with the stitches so she let me work pretty independently :)We all had a lot of fun together, I feel very proud of what I accomplished and also amazed at how well all the girls know their stuff and how patient they are.Even if you've never used a sewing machine, this class is great fun and you have something to be proud of in the end! :)"
        }, 
        {
            "index": 121, 
            "rating": "5", 
            "review": "Recycled concrete/cement bag making . Saw concrete / cement bags in the market and wanted to make my own. Booked it online.\nIt's a few dollars from town in a tuk tuk. At the Angkor Handicraft Association and plenty of other things to do, pottery, cross bow making, knife making.\nGreat experience!"
        }, 
        {
            "index": 122, 
            "rating": "5", 
            "review": "Learning by doing - iron pencil sketching. We were deciding between oil painting and iron pencil sketching and decided on iron pencil sketching because we were intrigued with this art that only Bunhak knows and discovered. Bunhak is very talented. He makes it appear very simple but when it was our time to do it on our own, the results aren't as nice. The translator told as that is expected because Bunhak has been doing this for years already and it was just our first time doing it. I learned a lot in 4 hours. Bunhak laid the ground works and made us do simple tasks. Tip - bring gloves or a cloth as it is easier to hold the stick (as it is hot to hold). We were each given a cold drink of our choice (although we asked for coke light, there was only 1 available, and we got Fanta berry and orange instead. no biggie.). We finished in about 4 hours. I'm not sure if you can finish the whole thing in 3-4 hours without Bunhak's help or if it would turn out nice. In the beginning, I already told Bunhak that I want the Angkor Wat design and if he can help me with it. He is very generous with his time. He does not speak good English but the translators are there to translate for you :)The finished product is something you would want to have framed as it brings back good memories of the afternoon bonding with friends and Bunhak and our translators.Try this when you are in Siem Reap!"
        }, 
        {
            "index": 123, 
            "rating": "5", 
            "review": "A fantastic experience with iron pencil sketching. We did the Iron pencil sketching class with Roeum Bunhak, an incredible artist based in Siem Reap. He developed this unique art form of burning imagery into palm leaves and he's a very patient and gracious teacher of this difficult craft. This was one of the more genuine experiences we had in tourist driven Siem Reap and it was a joy and privilege to spend an afternoon in the studio with him. We picked the image from his collection that we wanted to create and he then drew it on the palm canvas. Then we worked to trace his lines with the hot iron tools and to learn the shading and texture techniques. He did a great deal of work on the pieces, too, with was so generous of him. We were able to see the refinement of his skill and take away two finished pieces truly worthy of framing. Highly recommend this class!!"
        }, 
        {
            "index": 124, 
            "rating": "5", 
            "review": "Best experiences in Cambodia. Best experiences I have had in Cambodia by far, I hope Backstreet continues to grow and find popularity!!! I enjoyed the Ultimate foodie tour with Sam and long the Bike trip with Soy. I got out of the tourist scene and got to learn and experience what it is like for the people in Cambodia.The copper wire bracelet making class with Muy was humbling and a must see experience. I do not think you could go wrong with any tour from Backstreet in Siem Reap."
        }, 
        {
            "index": 125, 
            "rating": "5", 
            "review": "Backyard academy- making bags. It was an amazing experience making your own bag using rice bags.You were able to design your own bag. The ladies were extremely helpful and chatty.Learnt so much.Can recommend this experience to anyone, it also supports the locals as well :)"
        }, 
        {
            "index": 126, 
            "rating": "5", 
            "review": "Made our visit to Siem Reap special . We did four activities; Khmer cocktail making, horse riding, cycling and concrete bag making. We loved all of them especially cocktails and cycling! The bag making was tricky at times but the seamstresses made it easier and fun as we are total beginners. It was great to have the end result! The cycling and horse riding were a lovely way of getting out and seeing the countryside and local villages. The cocktail night we went on was the last Friday of the month at The Wooden House when there is also live jazz and a BBQ and this would be a good night to go as there isn't as much atmosphere in the bars on other nights. Very unique cocktails and lovely teacher. We didn't fancy several hours of bug eating but we sought out the stall for the 'Fear Factor' challenge and tried one bug each! I would highly recommend the activities we carried out and the Backstreet Academy."
        }, 
        {
            "index": 127, 
            "rating": "5", 
            "review": "a great days fishing. My wife and I went fishing. We went to the local markets, bought some fish, learnt how to throw a fishing net, caught some fish, ate fish for lunch, and had a very enjoyable time. Would certainly recommend this for an excellent day out."
        }, 
        {
            "index": 128, 
            "rating": "5", 
            "review": "touched my heart. we visited the handicraft village and watched the workshops...people were so helpful and welcoming...such a great project to help the every day people earn their own income with their talents in handi crafts."
        }, 
        {
            "index": 129, 
            "rating": "5", 
            "review": "Oil Painting with Local Artist via Backstreet Academy. One of the most relaxing experiences ever. First and foremost, kudos to Backstreet Academy online support for being very helpful. They write very good English and was able to answer all our inquiries on the activity, details, payments, etc. Secondly, the actual experience was awesome. Local artist Houen was very patient and helpful. We were first time painters and we absolutely loved the experience. 3 hours went by without any worry. We were also served cool water as part of the package. Thank you so much! Read about the advocacy of Backstreet Academy in their website as well. Inspiring!"
        }, 
        {
            "index": 130, 
            "rating": "4", 
            "review": "Traditional instrument music lesson in Siem Reap. Great experience with very friendly people at the local music academy, trying out various instruments. Highly enjoyable!"
        }, 
        {
            "index": 131, 
            "rating": "5", 
            "review": "Who knew leather work could be so much fun!. Took the leather work 3 hour workshop with another tourist. We were both looking for something to fill time between other activities. Instead this became a real highlight of my holiday. As a complete non-crafty person (who actually managed to fail ceramics in high school) the thought of spending 3 hours creating an Elephant shaped leather work seemed some what surreal (I had already prepared my 'well I tried' shoulder shrug.) However, what I created was perhaps my finest craft work ever. It was heaps of fun, they provide a lot of help (and re-touching when you've stuffed up) and an effective upper body work out as well! I've given it 5 stars for the fun, the organisation and plus I now have my very own handcrafted keepsake from Cambodia! Woo hoo!"
        }, 
        {
            "index": 132, 
            "rating": "5", 
            "review": "LOVED IT.. Had been planning to visit the Back Street Academy for months. As I wanted to meet the real people of Siem Reap. To be taught their hand crafts. Sand stone carving with Khet was so much fun. Not as easy as it looks to do. Khet helps me with the positions of the chisels which have been handed down from his father. I enjoy doing it so much that I plan on doing a pottery class and soap stone carving and the iron burning class, Please come and try your hand at any of the crafts here or the dancing classes. Families are more than welcome."
        }, 
        {
            "index": 133, 
            "rating": "4", 
            "review": "Food tour. Recently did the ultimate food tour in Siem Reap with Sam from backstreet academy. First part was with local Um Lam who conducted the cooking class. What a great experience. First to the local market to purchase ingredients (a real eye opener!) and then on to her home where we cooked 4 dishes. Truly a local experience. Sam then took us to a local market where we sampled local produce, the \"boom boom cakes\" were fantastic. Onto another market that sets up at 4pm. Hardly saw another tourist, all locals. Ate crickets and stuffed frog. Tarantulas were not available - shame about that! All in all, if you want to see the real locals and eat as they do, don't miss this. Sam was great, and if you need a tuk tuk driver while you are there, he's the man. Kevin and Heather"
        }, 
        {
            "index": 134, 
            "rating": "5", 
            "review": "Very good middleman to introduce one to Cambodian arts and crafts. We got our introduction to 3 Cambodian art and crafts usiing Backstreet Academy: Bokator self defence, crossbow making and iron pencil sketching. An English-speaking staff member met us at an appointed place to bring us to each activity. Where the artist, e.g. the iron-sketching specialist is not able to communicate exactly what to do, a translator is there for us. Every activity was booked online, with payment instructions clearly stated. Well organised.For Bokator, the self defence class, the Grandmaster is able to speak English, so no translator was provided. My son and I had so much fun we plan to do it again when we next visit Siem Reap. For the iron pencil sketching, it is not an easy task for a 10 year old. As a result, the bulk of the sketching of the picture chosen by my daughter was completed by the artist himself. Nonetheless, my daughter enjoyed herself as she learnt how to handle an iron rod and the novelty of drawing a picture through burning a material. As for the crossbow making, it was an eye opener for a city kid to watch the craftsman shape the bow and the materials they used. It was like watching DIscovery Channel live, for him.Overall it was good fun for the family to do activities together and the children enjoyed these activities more than touring the sights."
        }, 
        {
            "index": 135, 
            "rating": "5", 
            "review": "Copper Wire Bracelet making with Bel and Chanra. My two children and I spent a lovely morning with Bel and Chanra at the KILT (Khmer Independent Life Team) homestead learning how to make copper wire bracelets. The money they raise from selling and teaching people to make jewellery helps them to support and educate 8 adults and 12 children who live in the homestead. Bel himself was badly injured as a 7 year old by a landmine. We took some snacks that we shared and the children played football together. A great activity - worthwhile on many levels...with lovely bracelets to take home too! We booked online the day before through Backstreet Academy. Booking was simple and fast with clear instructions for the day."
        }, 
        {
            "index": 136, 
            "rating": "5", 
            "review": "Highly recommended. We took the stonecarving class on our last day of the trip and spent an afternoon in the Academy. The teacher was very sophisticated, knowledgeable and patient in teaching us to finish our first stone carving pieces. It was an interesting experience to do after visiting the Angkor Wat. We enjoyed it very much."
        }, 
        {
            "index": 137, 
            "rating": "2", 
            "review": "Annoyed . I turned up at the address given on TripAdvisor wanting to make a booking for the following day only to be told that I had to make the booking through the Internet via there website. This should be stated on TripAdvisor so as to not waste people's time driving to your address given out"
        }, 
        {
            "index": 138, 
            "rating": "5", 
            "review": "Great local experience! Must-do!. We did the Fishing and Hunting Tour and the Camboidan Cocktail class. Both of them are really well organized. All hosts were very welcoming and showed us a lot of their local specialties. The Hunting tour in the woods were an eye-opener, and offers a good peek into the local village life. The Cocktail class was a sweet and nice treat after dinner where we got to taste local spices and use them in our tasty refreshing cocktails. We wish we could have more time to join the other activities offered by Backstreet Academy. A must-do in Siem Reap!"
        }, 
        {
            "index": 139, 
            "rating": "5", 
            "review": "Best thing we did in Siem Reap, excellent family time!. We did palm leaf box weaving with Sopheap - four of us, two children aged 7 and 8. We had a great time and came away with professional looking boxes that we made (with some help of course!). For me, it was the best time spent so far with the kids, they had a fabulous time learning a new skill and in two and a half hours I didn't hear \"I'm bored\" once! Amazing!! It did look complicated to begin with but once we started it we got the hang of it and Sopheap and her friends were happy to help us along! The arts and crafts on display were lovely and I would much rather support the local people of Siem Reap rather than buy mass produced goods that are probably made outside Cambodia. All very reasonably priced as well. Thanks for a great afternoon out :)"
        }, 
        {
            "index": 140, 
            "rating": "4", 
            "review": "Bokator and ultimate food tour. My girlfriend and I did 2 activities through this privately run organisation. Did the ultimate foodies tour which was brilliant. Really good to cook up a big lunch (go hungry!) in Mrs Lam's front garden. Food tour later on was also interesting, turns out frog is actually fairly tasty. We also did the Bokator lesson for an hour. This was one of the highlights of our trip and definitely recommend if you want to do something different. Small annoyance was being met by the backstreet representative at a hotel then advised to pay a tuk tuk to get 200 metres down the road where the lesson was. Then the lesson was interrupted 10 minutes in to be told to make our own way home and we never saw the backstreet guy again. It's $20 per person per lesson but only $10 goes to the grandmaster and the rest to Backstreet. Best to book directly for this one."
        }, 
        {
            "index": 141, 
            "rating": "5", 
            "review": "A fun, interesting and well organised experience! . A friend and I found backstreet academy whilst visiting Siem Reap. We had never heard of the organisation before but once we had we found lots of things on their site that looked like fun! We settled for the Cement bags workshop. When we arrived we were greeted by two warm and welcoming Cambodian women. They were so helpful and patient and supported us throughout the afternoon in making our bags! We chose a material and style and left as two happy customers. I would highly recommend this workshop and look forward to trying backstreet academy in the future! Thanks for a great afternoon."
        }, 
        {
            "index": 142, 
            "rating": "5", 
            "review": "Amazing food tour!. We did a food tour with Sam, and it was amazing! We were taken to a few different local markets and got to sample all sorts of amazing food, from fresh fruit to delicious fried rice cakes to stuffed frog to tarantulas and crickets (took me a good half an hour to get over my fear and sample those). Sam was extremely accommodating to the endless barrage of questions we had and whenever we asked about a fruit/food we had never seen before he would just buy it and let us sample it! Great way to see Siem Reap off the beaten track and see where the locals go. Most of the places that Sam took us to we were the only non-locals there! Overall a great experience and one of the best things I did in Siem Reap!"
        }, 
        {
            "index": 143, 
            "rating": "5", 
            "review": "Stone carving. Stone carving is not as simple as u think. just join the class n u will appreciate the temple carvings. our teacher Poy Khet is a very good instructor. Leave things to him when u mess things up with the carving. he can do wonders."
        }, 
        {
            "index": 144, 
            "rating": "5", 
            "review": "Brilliant Fun. We booked in to do the stone carving, wanting to try something different. What a fabulous experience. We carved a candle holder each, and the work and skill required is something to be tried. A great few hours with a fantastic souvenir to take home, all hand made by yourself. Highly recommended"
        }, 
        {
            "index": 145, 
            "rating": "5", 
            "review": "Thanks Sam!!!!. We did the local street food evening tour with Sam the Man. Sam showed us a side of Siem Reap I'm sure that most foreigners never see. We visited three markets, tried fresh sugar cane juice, I ate my first dragon fruit as well! Try the dip (a fruit)! At the second market we gorged ourselves on fruit and we saw a lot of raw fish and pork being prepared to be sold which was we opening. It's fasinating to see where your food comes from. At the third market, we ate frog stuffed with spices and pork which was mouth watering. And we ate crickets and tarantula! It sounds scary but it was the tastiest thing I ate all evening, and Sam had a good laugh at it. We made him try the spider as well! He was pleasant company and was very accommodating to our every need. If you're feeling adventurous, take a food tour with Sam! Thanks again my friend. "
        }, 
        {
            "index": 146, 
            "rating": "4", 
            "review": "Great way to spend a few hours. My 11 year old daughter and I did a copper bracelet course with Backstreet Academy. We had a great time, trainers were very helpful and patient. It took about 1 1/2 hours to complete and we came home with a really nice keepsake."
        }, 
        {
            "index": 147, 
            "rating": "5", 
            "review": "Great experience!. I've loved all of the classes I did through Backstreet; the instructors were always very nice and patient and the translators were always so personable and informative."
        }, 
        {
            "index": 148, 
            "rating": "4", 
            "review": "Great food tour . We did the Local Street Food Evening Tour with Soy Kosal. Highly recommend this tour for those who want to try real Cambodian food. We tasted food from local markets and stalls (Kosal selected stalls were the food was prepared cleanly). Kosal was very accommodating and delayed the start time to suit us. Kosal was very knowledgeable and friendly. Our 12 year old really enjoyed it too."
        }, 
        {
            "index": 149, 
            "rating": "5", 
            "review": "Thats why you come here. This is why you come to Siem Reap,to see these magnificent structures.Absolutely mind blowing,you will take hundreds of photos trying to catch the reality,but the photos still dont show the true feeling you experience when your there live.We came in September i was prepared dor some rain,but the weather has been wonderful,we had 2 showers nothing to uncomfortable.It was humid and hot but not as bad/hot and humid as it can get.The crowds no problem this time of year.I believe we came here at the perfect time.We didnt bother coming for sunset or sunrise but I can image it would be spectacular.We will certainly visit here again in the future,still many more temples to explore."
        }, 
        {
            "index": 150, 
            "rating": "5", 
            "review": "Cement bag making 😁. Had so much fun today making my elephant cement bag! The ladies aiding my sewing skills (laughable to begin with) were so kind and patient!! It was a lovely experience to do with girls on a chill day from the temples!! Highly recommend this!!"
        }, 
        {
            "index": 151, 
            "rating": "5", 
            "review": "Knife Making. Only tried one class and it was the knife making class and we loved it. It was so authentic. It was a little shed and the instructor did not speak any English. There was an interpreter who was really great. He even bought us some coconuts as he could tell that we were very hot and sweaty on our walk over to the pickup point. We even got to take home the knives we made! Definitely recommend doing it."
        }, 
        {
            "index": 152, 
            "rating": "5", 
            "review": "Experiencing local culture. We joined 2 activities offered by Backstreet Academy, namely the Cambodian cuisine cooking class and Bokator (Cambodian boxing). Our translator Kert was helpful and friendly. He was definitely a big help in translating what our host, Ohm Lam was trying to communicate to us. We are truly grateful for Ohm as she opened up her kitchen to us and taught us how to cook Cambodian cuisine.A representative, Ve from Backstreet Academy also came to Ohm's house midway to ensure that all was good. It's small acts like this that made our trip so much more memorable. Ve also followed us to our next activity which was the Bokator class. He helped us to take some pics to capture our attempts to become the next Manny Pacquiao, haha.. All in all, Backstreet Academy is definitely something you should consider for your trip in Siem Reap!"
        }, 
        {
            "index": 153, 
            "rating": "5", 
            "review": "True Cambodian Experiences! . In August 2015 my partner and I took two courses in Siem Reap. The first was a two-day overnight homestay at a working Cambodian farm. During our stay we made our own slingshots and learnt to fire them, made and set traps in the jungle, went fishing in a pond for our dinner, heard traditional Khmer music played by our host, went rice farming and helped a little with some cooking. The second was a flute making course where we made our own traditional Khmer flutes out of bamboo. For both courses the hosts were friendly, informative, helpful and professional. Our courses were real hands-on experiences and we enjoyed learning new skills and about the Cambodian lifestyle. We would recommend Backstreet Academy to anyone who is visiting this part of Asia and wants to learn more about the life and traditions of a different culture."
        }, 
        {
            "index": 154, 
            "rating": "5", 
            "review": "A must visit project!. This is a great project went with my sons to make handmade crossbows. It was really good fun.We were introduced to Mr. Mien who comes from a tribe who used to make these bows for hunting.My youngest (8 years old) said \" it was amazing! Really good fun. It was quite difficult to make but it was worth the effort as it was so much fun shooting them. Really looking forward to showing my friends back home.\"The project run other activities that were fun. Check out their website. If crossbowsis not your thing then some of the other workshops will be!!"
        }, 
        {
            "index": 155, 
            "rating": "5", 
            "review": "Rice farmers for a day....and so much more! Wonderful day with a Cambodian family!. We signed up for a day of rice farming and a Cambodian cooking class for the same day. Our host was Mr. Mean Nhean and his family, a 30 minute motorcycle ride away from Siem Reap. We (two young adults, 19 and 21, and Mom) were picked up by 3 motorcycles which were conducted by the son, the son-in-law and the guide Gaad, very safe drivers. Welcomed by the entire family of Mr. Nhean. Fitted us with huge hats for sun protection before we went to the rice fields. Had so much fun working in the fields, picking rice plants, ploughing (had a wonderful bonding moment with the family while laughing our heads off at our attempts on plouging), planting rice. Then went fishing in the pond. No rods, just getting into the water fully dressed with Gaad and the son of the family, using a net for fishing. Great fund and successful. Then back to the house, cooked with the daughter who showed us how to fix coconut soup with lots of veggies, chicken and pork, then a famous Cambodian dish called Amok fish, then a banana coconut dessert. All three of us worked with her, carefully watched by the entire family, lots of laughing on both sides. Mother-in-law watching carefully! We chopped veggies and chicken, made coconut flakes from a coconut just taken off the tree, wrapped fish into banana leaves, cooked bananas and a lot more. We shared the meal with the entire family which was an honor for us. After lunch, the Dad played music for us on this traditional Cambodian instrument with 2 strings, the son playing a drum. What a wondrful day! We felt honored that the family let us get a glimpse of what their life is like, let us sit at their table (or rather on it, Cambodian style). Our gude Gaad was incredible. He explained everything along the way and was the interpretor for the day as well. Lots of fun. Made us laugh a lot. With a lot of thank you's and bows we gave our good-byes and were taken back to Siem Reap. What a wonderful day that truly connected us with Cambodia. We received VIP treatment and felt humbled and happy."
        }, 
        {
            "index": 156, 
            "rating": "5", 
            "review": "Wonderful experience--see another side of Cambodia. We had a fantastic time at Backstreet doing a crossbow workshop with my two sons, ages 7 and 8. They will never forget this. Allow plenty of time--this took over 3 hours. Also allow time to shop at Angkor Handicraft Association's market, which is in the same building."
        }, 
        {
            "index": 157, 
            "rating": "5", 
            "review": "Simply amazing. Firstly I want to be very clear, this was an amazing experience that I would not have missed for anything!After falling in love with the cement bags at the markets we decided to do the half day course and make our own. On arrival we got to choose our own design with some members of our group going for the cool satchels, but me electing for the safer lower end of the skill scale with the shopping bag. Even after thoroughly testing the patience of our teachers they never once stopped smiling, encouraging or, in my case, assisting. And in the end I managed to complete my simple shopping bag (complete with hidden pockets and zippered lining).What I did discover is that their is no way I would be able to sustain my family in this industry and that those skilled artisans who do this work day in and day out are amazing. Don't take the soft option and buy these from the markets, do yourself a favour and make a memory of your own and you might just learn a thing or two along the way."
        }, 
        {
            "index": 158, 
            "rating": "5", 
            "review": "AMAZING! I can't say enough positive things about it!. I booked 2 in one day (cement bag and the copper bracelet with Bel). What an amazing experience from start to finish. A long day and hot as it's summer in Cambodia, but wow, what fun, and what a great break from the tourist stuff! It was great to learn some crafts (despite being dreadful at them!) while integrating with local people. Everyone was so kind and patient, and I left both places with two wonderful pieces. At the cement bag one I made a toiletries kit (thanks to the help of the staff there!). and my copper bracelet came out fantastic (also thanks to staff assistance...they even gave me a gift, a copper ring to match my bracelet)I can't wait to book another Backstreet Academy activity when I am traveling again! Thanks for an experience that I will never forget!Sorry I was so terrible at sewing my cement bag :)"
        }, 
        {
            "index": 159, 
            "rating": "4", 
            "review": "bug cooking class by friendly locals. loved this - 2 young Cambodian students, in a small alley yard, showing us how to season and cook a selection of insects - crickets, worms and tarantulas!!! - in oil in a huge wok over a wood stove on the ground - and eat them. Our hosts were charming, friendly and knowledgable,explaining how people turned to eating bugs in the famine of the 1970s and bugs are now part of 'traditional' cuisine. Surprisingly tasty (crickets are a bit like crisps) and informative, and fun - and giving money to the local community."
        }, 
        {
            "index": 160, 
            "rating": "5", 
            "review": "Great lecturer.. We went for Stone Carving Class, our lecturer Khet is very very good, he is very careful person, we r very tired of stone carving but when we complete our work it look fabulous, thanks alot khet, our unforgettable experience ever in Cambodia."
        }, 
        {
            "index": 161, 
            "rating": "5", 
            "review": "family fun. We were booking the cement-bag-course the night before but the people at the Backstreet Academy made it work. The place is great to watch and the making of the bags was lots of fun for the whole family. Very nice and helpful people. We can strongly recommend this course. The kids are still proud of their bags, many thanks!"
        }, 
        {
            "index": 162, 
            "rating": "5", 
            "review": "You MUST visit !!. A small, out of the way place where stallholders off 100% Authenticated Khmer products. Shop here for your souvenirs, gifts and that stunning woven piece of silk and you will supporting local village women & men trying their hardest to make a living out of their craft. Unlike some items on offer at Phsar Chas, the tourist market, you WILL NOT be buying a mass produced factor product from Thailand or China. Visit AHA and you will see the difference, purchase one or more of their beautiful 'Made in Cambodia\" products and you will MAKE a difference !"
        }, 
        {
            "index": 163, 
            "rating": "5", 
            "review": "Blacksmithing. My girlfriend and I did the blacksmithing course offered through backstreet academy and we really enjoyed it. He gives you a piece of rio and guides you through the process of flattening it into a blade. Most of the finer work is done by him or an assistant and a good thing too as we would have mucked it up. Maybe bring along a set of ear plugs as the grinder can be a bit noisy. Great experience though, something I've always wanted to try."
        }, 
        {
            "index": 164, 
            "rating": "5", 
            "review": "Unique and Local Fun Activities. Great resource for unique local activities in Siem Reap. We did the Escape the Room challenge with our family of 6, kids aged 8,10 and 14, it was great."
        }, 
        {
            "index": 165, 
            "rating": "5", 
            "review": "Absolutely lovely!. Me and my boyfriend did a spoon painting course with Backstreet Academy, and we both loved it. The instructor was super supportive, But didn't intrude unless we asked him too, so we got to make work that was truly our own. And some of the other instructors even came over and admired our finished work and chatted with us - it was a super friendly, really laid back, just generally lovely atmosphere. AND For only $20 it was a great way to take home something that was legitimately unique."
        }, 
        {
            "index": 166, 
            "rating": "5", 
            "review": "A highlight of our trip. When our plans for part of our visit in Siem Reap fell through, we got on line to figure out what to do. We immediately happened upon BackStreet Academy and signed up for the cooking class with Long Lam. Everyone from our great interpreter to the BackStreet Academy coordinator, Samon was so friendly and helpful, and we made an amazing Cambodian feast. We had such a good time that we signed up for two more classes the next day - Knife Making and Iron Pencil Sketching. Both were extremely unique and loads of fun. With Knife making, the blacksmiths to the majority of the work, but you get to pound a piece of rebar into a proper knife and do a bit of the finishing as well. The Iron Pencil sketching is not easy, but the key is to pick a simple design. While Bunhok definitely helps a lot, if you have patience and pick a simple design (or if you're just really artistic and coordinated), you will walk away with an amazing and completely unique souvenir that you made yourself (mostly). Samon was very accommodating, facilitating our last minute requests and spending time with us at each of the classes. Having the chance to learn from and engage with locals was truly enjoyable and made us happy to have had our original plans fall through."
        }, 
        {
            "index": 167, 
            "rating": "5", 
            "review": "Nice first day!. My boyfriend and I decided to take the cooking class right upon our arrival to Siem Reap - it was a fabulous idea! The teacher was friendly and her interpreter was energetic and enthusiastic. The class was a good introduction for us to the food, culture and market for our trip. It was also great timing because it allowed us to see sunset at the temples! This was our first class with backstreet academy, but I would absolutely do another!"
        }, 
        {
            "index": 168, 
            "rating": "4", 
            "review": "Worthwhile experience!. We enjoyed the cooking class and it was nice to be invited into a home setting. The only improvement would have been written recipes in varying languages to take away. You work on various elements of dishes rather than completing them all so it is difficult to do prep and watch.Our guide was particularly good and a very talented artist, we were able to see some of his work."
        }, 
        {
            "index": 169, 
            "rating": "5", 
            "review": "Fear Factor is a must. So I completed the Fear Factor class on my own one afternoon. Ate fried crickets, silk worms and tarantulas. The kicker was definitely the tarantula wine though. Not for the weak-stomached. The course is well put together though and Backstreet does an amazing job."
        }, 
        {
            "index": 170, 
            "rating": "5", 
            "review": "Great fun...and a souvenir! Wish we had found Backstreet sooner. Had a great time at the copper bracelet-making session in Siam Reap. The site was a small silversmith's shop and they were great to work with - very patient with our neophyte's efforts. It was very informative and we took away two great bracelets...and a new appreciation for just how meticulous and time-consuming this craft really is. Thank you!"
        }, 
        {
            "index": 171, 
            "rating": "4", 
            "review": "Snap, crackle, pop...fried crickets. My family thoroughly enjoyed this experience. The crickets, tarantulas and silk worms were fun to cook and sample...loved visiting with the cooks son...he was a cutie and put us at ease as he munched on a tarantula with us:)"
        }, 
        {
            "index": 172, 
            "rating": "5", 
            "review": "Local Street Food with Kosal Soy. Kosal is a fantastic host. He is friendly and patient and speaks English fluently. This is a truly authentic tour of the local markets and street food scene. It is not for the faint-heated as the places Kosal takes you to are busy, dusty, bustling and crowded; and definitely not tourist traps. They are local as local can be. The included foods are interesting and delicious and plentiful.It's a pity that we did the tour on arrival, when we were feeling tired and queasy from our long flight. We would have enjoyed it so much more (and eaten more) had we arranged the tour for Day 3 or 4 of our holiday.Keep up the great work, Kosal!"
        }, 
        {
            "index": 173, 
            "rating": "4", 
            "review": "Stone carving with a professional. My friend and I spent 3 hours with a local craftsman trying our best to create a stone carved candle holder. It was very difficult but gave us a real appreciation for the wonderful carvings around all the temples."
        }, 
        {
            "index": 174, 
            "rating": "4", 
            "review": "A good experience. I took the \"Making palmleaf boxes course\". My teacher was late but very nice. She could not speak any english which complicated my learning. An interpreter was present during the entire course. She was also very nice and caring."
        }, 
        {
            "index": 175, 
            "rating": "5", 
            "review": "A cool little 'aside' the whole family enjoyed. We signed up through the Backstreet academy who offer a huge range of local activities and act as the 'middle men' to connect travellers with local artisans etc. we signed up to do the copper bracelet making. Now we are comprised of 2 completely craft free adults, 2 teen boys and a 9 year old girl. That's a tough gig for a craft workshop but we all had a great time and emerged with very respectably attractive copper bracelets although some with more hand-made authenticity than others :). Great option to provide a change of pace to temple tours, pub street and markets. An interesting and fun morning without being exhausting or overly expensive. Thoroughly recommended. Suspect kids under about 8 might struggle a little but there is plenty of help on hand to help them along."
        }, 
        {
            "index": 176, 
            "rating": "4", 
            "review": "We had fun during the pottery class!. We enjoyed the pottery classes even though it was pretty challenging. Thank you to our instructor and his assistance for the great knowledge and time."
        }, 
        {
            "index": 177, 
            "rating": "5", 
            "review": "Real taste of Cambodian life!. We joined the fishing experience with Soy Kosal and it gave us a real taste of the local life! We started off visiting a local market which was further off from the touristy hotspots to buy two big fish in case we couldn't fish any, and then headed to a village near Tonle Sap (20-30min ride away from town). We then got down to business and learnt how to fish with a fishing net, which was very interesting but tough. The water was very low so we only found some small fish, but we also found small crabs! After an hour or so, Koy and the driver set up a fire with charcoal and wood and we grilled all the fish and crab. We talked about Cambodian daily life, and knew much more about Siem Reap as a touristy town but also the culture and religion and life of an ordinary Cambodian. Soy and the driver were very nice and spoke excellent English! It was a highlight of our trip, and through Backstreet Academy, the money goes to the local people whilst we could also get an authentic local experience. Would definitely recommend these rural tours!"
        }, 
        {
            "index": 178, 
            "rating": "5", 
            "review": "One-of-a-kind experience!. We booked the iron pencil sketching class with Mr Bun Hak, assisted by Wey the facilitator. This was such a different and unique experience for all three of us as we have never done anything like this before. Wey told us that Bun Hak created this art 8 years ago by accident, so to speak. You'd have to book a class with them to know more ;) It was quite hard at first but we managed to finish our sketches with their unending help. The atmosphere was chilled and relaxed, we shared experiences and stories (even favorite songs) with each other. Mr Bun Hak is such a cool person and I love his taste in music haha! We highly recommend booking any courses offered by Backstreet Academy to anyone who is looking for something else to do in Siem Reap besides visiting temples. Thank you Backstreet Academy for such a memorable experience!"
        }, 
        {
            "index": 179, 
            "rating": "5", 
            "review": "A fun morning!. We spent a morning making wooden flutes with a craftsman and a translator (who were both very friendly and helpful). The tools were more difficult to master than they looked but we both managed to make an approximation of a flute and both flutes are playable (we were also given the flute that the flute-make had made to demonstrate the techniques). We did around 90% ourselves - the flutes were finished-off for us with a very sharp knife which we were happy not to handle! It took around 2-3 hours in total. We would recommend this experience to other travellers and tourists; we had fun, learnt something about Cambodian culture, made a souvenir to take home and we were left with the feeling that we contributed some funds to locals who might otherwise struggle to engage with tourists."
        }, 
        {
            "index": 180, 
            "rating": "5", 
            "review": "Unforgettable experience. My friends and I had the opportunity to experience iron pencil sketching with Mr Bun Hak. He is the founder and only person who knows about this art in cambodia. He is a very talented man and i am honoured to have met him. He was very patient with us and helped us along the way. It was an unforgettable experience and the highlight of my trip to Siem Reap. And again i couldnt help but mention how friendly and hospitable the people of Siem Reap was during our entire stay."
        }, 
        {
            "index": 181, 
            "rating": "5", 
            "review": "Cooking course, Great fun, great food. I did the cooking course on my last day. On of the best things I did on holiday.We started in the market with Sophia and Madam Lon Lam, possibly one of the best double acts of all time, real insight into the food as Madam Lam threw a sub standard catfish back in disgust and then onto Madams home where the cooking began outside. Lots of dishes, raw beef salad, red chicken curry, fish amok and sticky sweet rice with custard more like a blancmange with coconut milk and duck eggs. Sophia was a great teacher, English very good, funny and charming and her and Madam Lam sparked off each other very well.Great to spend time in someone's home as people came and went and then of course a sit down to fine food , so much better than any of the restaurant food. Sophie was cool and gave me a lift back to the hotel on her Moto with a bag of grub for my \"madam\" . As always charming real,people who have a story to tell and who can give you a great insight into the day to day life of Cambodia, as well as teaching you to cook lovely grub.. Thank you Madam Lam and Sophia, it was great and a privilege to meet you both."
        }, 
        {
            "index": 182, 
            "rating": "5", 
            "review": "Street food tour with Soy Kosal. Loved it!!!! So good to get away from tourist areas and learn about what cambodians really eat. Kosal is just lovely and full of information. All the food he offers is delicious - and there is plenty of it.A very unique experience. Highly recommended."
        }, 
        {
            "index": 183, 
            "rating": "5", 
            "review": "Interesting and educational!. We ended up doing 4 Backstreet Academy classes and enjoyed them all! Would highly recommend this to get a close up experience with local people and learn traditional crafts!"
        }, 
        {
            "index": 184, 
            "rating": "5", 
            "review": "Dont miss this experience - cookery class with Mrs Long Lam & Sophea. We are just back from this fantastic experience. Watching Mrs Long Lam work her way discerningly round the market was great fun, we toddled behind her as willing slaves carrying her purchases as she picked, prodded and bargained her way to the best produce.Back at her home in the large outdoor kitchen, Sophea - Who speaks excellent english, showed her masterful cookery skills under the watchful eye of Mrs Lam with some occasional guidance. Sophea was very patience and encouraging, taking the time to explain and even google each ingredient, the relationship she has with mrs Lam is a delight too, they are like family and treat you as such too. We have so far eaten in some of the best restaurants in Phnom Penh and Siem Reap but the fish amok we cooked with them was streets ahead in flavour and freshness to anything we have had before. This was a true highlight, Mrs Lam & Sophea make a winning team"
        }, 
        {
            "index": 185, 
            "rating": "5", 
            "review": "Something to do other than temples. Took my wife to the copper wire bracelet making class. We ended up making them in a couple's house, who gave very good instruction and were really helpful. Enjoyed the experience a lot."
        }, 
        {
            "index": 186, 
            "rating": "5", 
            "review": "Copper bracelets. My sister, cousin and I spent my cousin's birthday making copper bracelets. I have worn mine several times. The instructor offered great assistance. My only issue is that they had no copper products to buy. I would have loved to bought a few more as presents for people."
        }, 
        {
            "index": 187, 
            "rating": "4", 
            "review": "Variety of classes. We took 4 classes:Copper wire bracelet making: 5/5, we went to an orphanage run by mr bel (who had stepped on a landmine) and his wife. We spent about an hour and a half making beautiful copper wire bracelets and rings and got nice souvenirs.Knife making: 4/5, we hammered hot steel to make knives and polished it with a metal grinder afterwards. A bit hot (since we were near the furnace), but how many people can say they made their own knives? We only did about 25% of the work, though.Cocktail class: 4/5, we mixed ginger, khafir leaves and rice paddies to make interesting and surprisingly refreshing cocktails. Enjoyable.Foodie vespa tour: 5/5, we rode vespas to the local market to inspect ingredients, then to a street outside of thr city where we tasted crickets, beetles, snails and cocoons, as well as various local fruits. After that we had frog barbecue and grilled stomachs, then beef with red ants and fried duck tongues (i didn't even know that ducks had tongues that big!). We ended in the simbai rice- wine shop where we had a wine tasting of the different infused soirits. A bit more expensive than the other classes, though."
        }, 
        {
            "index": 188, 
            "rating": "5", 
            "review": "Wonderful rice farming with Local. After 2 day of temple tour, I went to join the rice farming tour at local farm that located about 30 km from Siem Reap town. It was wonderful experience, i had learned a lot about how Cambodian people growing rice, vegetable and their life style with a beautiful green village. Local food was wonderful, we love the test of fresh grilled chicken with traditional source that was great! Highly recommending to everyone who love to travel and exploring the authentic local's life."
        }, 
        {
            "index": 189, 
            "rating": "4", 
            "review": "Budding Artists!. Booked a bracelet making course for 3 of us before arriving in Siem Reap. Thought we would be going to the central location as per the pictures on the website to be taught by the lady who we had emailed. Turned out, she was out of town and our course was not taught at the central location. Was a little disappointed in this however the gentleman who did teach us had a table set up for us , all the equipment needed to make the bracelets and he was very experienced in jewellery making, so all turned out well. A representative from Backstreet Academy came to the site partway thru the course and was very helpful, taking pictures for us etc. All in all it was a wonderful experience and we all have a beautiful bracelets to show for our efforts. Would recommend"
        }, 
        {
            "index": 190, 
            "rating": "5", 
            "review": "Great time fishing with Soy Kosal. We had Soy Kosal as our guide and he took us to a pond near his hometown. It was really good fun and interesting to see how the local people live and what they do to survive.He was very patient and took a lot of time to teach us how to prepare the net and then throw it to catch fish. It was really good fun and we both really enjoyed our time. It was also the low season so we caught a lot of small fish. I'm sure in the wet season there will be a lot of bigger fish to catch. We also went to the local market to buy some fish and we grilled it up beside the pond (you won't get hungry). We also bbq the rest of the smaller fish to eat for lunch. There is a lot of cool water and beer so just bring yourself sunscreen and a hat.Really enjoyed this - it's something different to the temples in Siem Reap. Thanks Soy!"
        }, 
        {
            "index": 191, 
            "rating": "5", 
            "review": "Wonderful cooking class in Siem Reap. We did the cooking class with Long Lam in Siem Reap and it was fantastic! Really a great way to see local life and learn a local dish. We have already made the beef salad back in Sydney for friends and they were blown away! The translator Sophia was wonderful as well and a very good cook herself."
        }, 
        {
            "index": 192, 
            "rating": "5", 
            "review": "Interesting. The host was patient and thoughtful in teaching us. The stone carving activity made us appreciate the carving on Angkor Wat. We had fun, learn something new and got to bring a beautiful hand craft stone souvenir."
        }, 
        {
            "index": 193, 
            "rating": "4", 
            "review": "Help the people and book through Backstreet. You can book direct for tours or through Backstreet and pay a little extra, but the extra helps people of Cambodia and the knowledge and information given by the operators of each tour is worth it. I met some wonderful people and shown more wonderful things that I wouldn't have if tried myself."
        }, 
        {
            "index": 194, 
            "rating": "5", 
            "review": "Best Part of our Trip to Siem Reap. Hands down, our best memory of the trip. We did two classes - kick boxing and the copper wire bracelet making class. Both were unique and fun in their own way.We had the same tour guide for the whole day and she helped make the experience memorable at the pick up location. She picked us up on her scooter and the three of us drove off (which was an experience in itself) to first class - kickboxing.The kickboxing instructors were fun and worked us hard. The class was in the middle of a local neighborhood so we felt like we were off the tourist path. The bracelet making class was one of my most memorable experiences in my Asia travels (and I have gone many places as I lived in Shanghai for 3 years). The instructor is a land mind victim who is really making a difference in his community. After having his mother die, his father abandon him, putting himself through college, and being rejected from a government desk job because of his disability he decided to use his frustration for good - and create a NGO that focuses on providing life skills to kids with disabilities from land mines. Hence his bracelet making course. Not only is his organization an inspiration, the class itself was fun and the jewelry we made was beautiful - I get compliments every time I wear it!Do one of these classes. It will be the story you tell your friends about your trip. Trust me."
        }, 
        {
            "index": 195, 
            "rating": "1", 
            "review": "Ceramic Painting Class. Arrived for the ceramic painting class and were provided with some paint, brushes and 6 of the same mugs to paint. We were given very limited colours (brown, dark orange, off white) and therefore we asked for more paints to be provided - green, blue, pink, red, yellow etc. We were told by the host then that they could not supply these colours as they had run out of them. For me this is unacceptable and if they are putting on an activity and charging for it they should have the materials required to allow you to create the designs you want. My wife wanted to paint a flower but couldn't as there isn't a lot you can do without green, red, yellow etc. We left after about 40 mins.The next day we received our mugs and the quality of them was terrible. Prior to them being fired they were glazed however the person glazing has clearly put on too much and therefore all of the colours have run into each other making the designs a total mess. We ended up just chucking the mugs in the bin.Avoid this activity - there are much better ones to do!"
        }, 
        {
            "index": 196, 
            "rating": "5", 
            "review": "A great way to make your own souvenirs. We did the coconut carving class, and it was everything we expected and more. My fiancée and I were the only ones there with the instructor and a translator. Even when working one-on-one with the instructor, the language barrier was not an issue in figuring out what to do. They took us step-by step through making three coconut keychains. We got to choose two of the designs and the third was an Ankor Wat design. They turned out great (with a little help)! It was great to have a unique experience and self-made souvenirs to take home with us. Although I can only speak to this class, I highly recommend looking into the Backstreet Academy classes as a great alternative to the usual tourist activities."
        }, 
        {
            "index": 197, 
            "rating": "4", 
            "review": "Morning Martial arts (Cambodian Boxing). A very enjoyable martial arts session with Mork Samrith. Backstreet Academy provided a translator to help communicate. You will go to the backstreet to find Mork's hidden gym, and get to learn Bokator techniques along side of his young students. My girlfriend did not want to participate and decided to watch and laugh....a lot.Definitely a unique experience for anyone interested in Martial Arts and has a bit of time to sweat a lot. lol."
        }, 
        {
            "index": 198, 
            "rating": "4", 
            "review": "Do it. We did the bag making and the bangle making. The bag making was great, the women were fantastic and very patient do it as its not something you will do. The bangle making though was over priced and we actually didn't do much so disappointed with that"
        }, 
        {
            "index": 199, 
            "rating": "5", 
            "review": "A way to see more than the typical tourist stuff. I did the copper wire bracelet workshop and the apsara dance workshop. Both were fun and I came away with a lovely bracelet I (mostly!) made by myself. I was the only participant at both - the apsara dance might have been better with more people and felt a little long with just the one of me. A great idea and a nice way to see more than just the temples in Siem Reap. Great value. Lovely people."
        }, 
        {
            "index": 200, 
            "rating": "5", 
            "review": "Best local experience ever! . My boyfriend and I participated in 4 courses, stone carving, knife making, iron pencil sketching and copper wire bracelets. All of them were unique experiences and worth all the money! The stone carving and iron pencil sketching were located at the local handicraft association, and here you could look and buy a lot of different things made from local artists. The knife making was located at a local blacksmith, who didn't speak English, but was in the best mood anyway, he just laughed all the time and it was contagious! The bracelet making was located at another organization helping victims from land mines make a living. If the host didn't speak good English, a translator was provided. We got to know the hosts and the country pretty well, and it was a really different and personal experience. If your looking for something to do that is not too touristy, do this!"
        }, 
        {
            "index": 201, 
            "rating": "5", 
            "review": "Delightful way to spend a morning. My sister and I did wire copper bangle making workshop. Bel and his wife were an absolute delight and their story is so inspiration and KILT (http://kiltjewellery.weebly.com/) is such a worthwhile cause. We chose quite simple bracelets so the workshop only lasted an hour (which suited us in the heat) but the real highlight was meeting a local family, getting a small insight into their lives and knowing you are supporting local artisans PLUS you get a bracket to boot... I think this would be great for kids as well."
        }, 
        {
            "index": 202, 
            "rating": "5", 
            "review": "Cambodian Cocktails. My wife and I did the Cambodian Cocktail course, what a brilliant way to while away and hours or so. We chatted with our host as she showed us how to mix amazing drinks using fresh herbs and spices. The setting is very chilled out, away from the hustle and bustle that is Pub Street. Highly recommend booking this, we might just have to go back while her for another drink.."
        }, 
        {
            "index": 203, 
            "rating": "5", 
            "review": "Great experiences. So this is not really about the skill being taught, more about the opportunity to support locals who are trying to make a living from their craft - the benefit is you get to do this is learn about the craft, and the artisan, and often their family and life. We did two classes (copper bangle making and tyre bag making) and loved both of them and the whole experience they provided. Would be great for anyone of any age and you come away feeling enrichened by the experience. Would really encourage you to give it a go - will be definitely doing more of these in the future."
        }, 
        {
            "index": 204, 
            "rating": "2", 
            "review": "One hour not worth $30.. I signed up my daughter and me for the 2-hour Apsara dance class. Though the instructor was pleasant, she gave no introduction or explanations, or even talked to us, so the translator did all the talking. We just had to copy her movements repeatedly, but with her back to us, we couldn't see her hand movements. We took several breaks, then she was done after an hour. The translator, also pleasant, said some people take a full two hours to learn the routine (as if we'd learned it!), as an excuse for why the class was finished so early. My daughter preferred playing the musical instrument, and I would have liked learning anything about the culture and history of Apsara dance, besides just mirroring the instructor's movements."
        }, 
        {
            "index": 205, 
            "rating": "5", 
            "review": "Beautiful Bangle Making. My wife and i were looking for an interactive experience with local Cambodians. Backstreet Acadamy delivered. The three hour class was lead by the nephew of a local artisan. We were impressed with the eagerness of the instructor and his drive to show us how to make something we would be proud of. The shop owner also took time to help us properly form the bracelet. Everyone at the shop was helpful and friendly. It is great to support the local economy is a direct and interesting way. I am sure that you will get as much out of the experience as you are willing to put in. HAVE FUN!"
        }, 
        {
            "index": 206, 
            "rating": "5", 
            "review": "Excellent authentic experience with the locals. We learnt copper bracelet making with the teacher and his wife at their Home which is also the association of landmines victims. Our three hour class took place under the mango tree. Though hot, it was an unforgettable experience of not only learning the bracelet making skills but also learning inside stories of the local people. With Cambodia new year arriving, we talked about the ways of celebration, and How children would give respect by serving the baths to their Parents."
        }, 
        {
            "index": 207, 
            "rating": "5", 
            "review": "Great fun! . Three of us did the cement bags workshop today and loved it! Arranged very easily by emailing the night before. We are now the proud owners of our very own handmade tote bags; who needs the night market?! The instructions were easy to follow even for someone who has never been near a sewing machine in 20 years, and the whole session was fun and relaxed. Great experience, thanks guys :) we also bought lots of goodies from AHA!"
        }, 
        {
            "index": 208, 
            "rating": "5", 
            "review": "Cement Bags. Partner and I did the Cement Bags course one afternoon. Where else can you get a Cambodian recycled bag (lined and all) that you have made yourself! - I can't think of a better souvenir. Very friendly instructors, We went on a day when the power was out in town (quite common in hot season) so I got to experience the old fashioned manual sewing machines - quite a laugh and work out, my partner got lucky as power came back on for him so he used electric sewing machine. Neither of us had touched a sewing machine since back in school home education days. Very impressed with finished product.Highly recommend for both men and women of all ages! choose the bag you want to make, the cement bag material (elephant, eagles, fish etc..) and support local artists. Wish we had more time to experience all the other wonderful courses they provide ( I walked around and saw some great work there) Thanks for the great experience!"
        }, 
        {
            "index": 209, 
            "rating": "5", 
            "review": "Wonderful way to meet locals. The favourite activity of our 8 day stay in Siem Reap! My 14 yr. old daughter and I took the copper wire bracelet class. We found this very out of the way location easily and Muy Sua Bel and his wife were ready and waiting to help us with our bracelets. They have several samples to decide from and then we sat under a mango tree and worked away under their guidance. Since we were the only 2, it took just over 2 hours - with me needing lots of help - to produce really great bracelets. It is a very relaxing pace sitting outside and talking with our hosts whose English was certainly good enough for conversation. The family lives in the compound with several other families and there were lots of children playing around. It was a wonderful chance to talk about and observe ordinary life. They have more jewelry to purchase if you want (no hard sales pitch) DEFINITELY recommend this class and organization."
        }, 
        {
            "index": 210, 
            "rating": "5", 
            "review": "Catching and eating fish. Our guide was Samon, who was extremely friendly and helpful. He took us to a smaller village outside Siem Reap where we got to go to an outside market and try some different foods. We then sat on a truck bed and went out to a pond, where we were able to try net fishing. I was able to catch a few fish, as well as some others. The fishing was very enjoyable. Our main contact there was Kosal, who was great at helping us learn to fish as well as prepare and cook the meal. We got to eat some delicious Cambodian dishes, all cooked with the fish we caught that day. Afterwards, we were able to ride some boats around the lake and relax. Overall, a great experience that I highly recommend!"
        }, 
        {
            "index": 211, 
            "rating": "5", 
            "review": "Wonderful Experience! Samon was the best!. I thought Backstreet Academy was a great way to meet local people as well as take home a wonderful souvenir. I did both the Iron Pencil class with Bunhak, who is an amazing artist and can help anyone to make a beautiful scene (no art experience necessary). I then did the copper bracelets where the owner of one of the best silver shops in Siem Reap helps you to construct your bracelet! Samon was my translator for the day and he was amazing. He was so kind and made my experience in Siem Reap unforgettable."
        }, 
        {
            "index": 212, 
            "rating": "5", 
            "review": "Apsara Dance - fun!. I was traveling alone and decided to sign up for the Apsara dance class. I've had a few years of dance training in ballet and ballroom, so I thought it would be an easy and fun way to learn about Cambodian culture. It was and it wasn't. It was surely fun and interesting, but the dance was harder than I expected! It's good the instructor gave me breaks and the translator helped me take plenty of photos to take home!"
        }, 
        {
            "index": 213, 
            "rating": "4", 
            "review": "Bokator - Backstreet Academy. Mork was our instructor for the Bokator backstreet academy class. We warmed up for about 10 min, then we were taught basic Bokator punching, blocking and counter moves. Next we moved on to kick and punch combinations followed by blocks and leg holds. We finished up with a quick core workout for cooldown. Mork himself was an experienced (National Bokator champion) and patient instructor, and we had help from a backstreet academy employee to translate when needed. The workout itself is moderate if you're in shape but may be difficult if you're not. For me, I can finally carry out my lifelong dream of rising to UFC greatness,defeating Anderson Silva in an underground cage match, and becoming the undisputed world pound-for-pound Bokator champion."
        }, 
        {
            "index": 214, 
            "rating": "5", 
            "review": "Excellent . The cement bag activity was great fun! The ladies were very friendly. Great concept. Would have done some of the other activities if we had more time. Amazingly talented artists here, some of the work in the shop is amazing. Highly recommend. Thanks!"
        }, 
        {
            "index": 215, 
            "rating": "5", 
            "review": "Awesome.. I signed up for a copper bracelet making class. The guy who ran it was very kind and patient (took me a while to get the hang of it!). They book you in for 3 hours but about 1.5hrs of this is after you've finished your part and they do all the tough stuff with blow torches and hammers etc. First in best dressed so I'd recommend finishing first! Or if you're with a big group, bring snacks :P A lot of fun to make your own souvenir."
        }, 
        {
            "index": 216, 
            "rating": "5", 
            "review": "Intimate Experience -Up Close and Personal. My husband and I spent a couple of days visiting temples in Siem Reap and we spent time on Pub Street and Night Market but we had some extra time so we decided to sign up for a jewelry making workshop.We never expected that this would be one of the high points of our trip but it was. We were the only people to sign up for the class that morning. We meet or interpreter at the specified hotel and then walked to our workshop and met our instructor. I had not realized that he was a landmine victim having lost his leg when he was only 7. He some how survived the horrendous injuries to both his leg and stomach and is now married, with a baby, and he has taught himself a number of crafts/skills and shares them with others in these workshops. We spent 3 hous sitting under a mango tree coiling, wrapping, and ever so slowly, making our respective bracelets. He helped us whenever we'd created a mess (frequently) but otherwise encouraged our efforts and all the while we quietly chatted. We had the help of our interpreter but actually Muy Sua Bel could do quite well himself. We were completely relaxed and comfortable and this morning gave us a very different understanding of the harsh realities of Cambodia's past as well as the challenges of the present. But mostly, it was again a chance to see up close these people's generous and resilient spirit. I would highly recommend this experience."
        }, 
        {
            "index": 217, 
            "rating": "5", 
            "review": "Street food tour: recommended!. We did the street food tour after visiting the temples, the old market, the floating village, national museum and so on, and I can say it was one the best experiences we had in siem reap. We tasted local fruits, typical cambodian street food, desserts, insects and even frogs (at least we were supposed to!), in many different places only locals go. Soy is a great guide, so this is higly recommended."
        }, 
        {
            "index": 218, 
            "rating": "5", 
            "review": "Great activities in Siem Reap.. We participated in a bag making class and martial arts class with our young son. Both were well organized and worth the money. I do wonder how much money the locals running the activities actually receive. We had an English speaking translator for both classes."
        }, 
        {
            "index": 219, 
            "rating": "5", 
            "review": "A lot of fun, highly recommended.. My wife, 9 year old son and I experienced the Fear Factor experience comprised of cooking and eating grasshoppers, silkworms and tarantulas. Our host was excellent and is a vendor in the market, and our facilitator was also friendly and helped us to understand the process, and also context. The host's young son was also there which was a bonus as it was great having him interact with our son encouraging him to sample the food as he was a bit reluctant. This experience involved deep-frying in hot oil so may not be appropriate for very young children. This is a wonderful social enterprise that supports families and communities directly. One tip - given that this fare is usually served with beer, I suggest you bring a couple of cold brews with you. Highly recommended and will challenge you on what is considered food, and why- at least it did for me."
        }, 
        {
            "index": 220, 
            "rating": "5", 
            "review": "Street food tour. We did the local street food tour in Siem Reap. It was absolutely fantastic! We were with just the two of us. Our guide Soy Kosal came to pick us up at the hotel with a tuktuk. We drove straight to one of the markets, where only local people come. We were amazed by what we saw and tasted. This is the real cambodia, no tourists here! We could say what we wanted to try. We tasted several fruits, desserts, insects and so on. Also had a stuffed frog. It was really tasty and the guide was very friendly and spoke good English. He was happy to answer al our questions about the food and Cambodian life in general. I can highly recommend this tour to anyone who wants to taste something different and be a part of real Cambodian lifestyle."
        }, 
        {
            "index": 221, 
            "rating": "5", 
            "review": "Incredible and unique experience. Our family had an a great time with the fear factor challenge. The whole experience was fascinating. Our host, translator, and the local program manger were fantastic. If you are a participant in life and not just a spectator, you'll enjoy this adventure."
        }, 
        {
            "index": 222, 
            "rating": "5", 
            "review": "Excellent activity. We have been to backstreet academy twice during our stay in Siem Reap. We first went to the stone carving class, which was great. The teacher was very good and spoke good English. We were able to chat to him about Cambodia while we made our carving and we were pleased with the tea light holders we made. We went back for another class in Palm wood carving which was also excellent. This time we had an interpreter, provided by the academy. The teachers were both patient, kind and helpful. We were pleased with all of the things we made. This is a great way to support local people and to learn more about Cambodian skills and life. One tip: wear old clothes as the work can be dusty. We would really recommend this activity."
        }, 
        {
            "index": 223, 
            "rating": "5", 
            "review": "Cement bags and Iron pencil sketching. Our family of four (2 adults and 2 kids of 3 and 4 years old) decided to take a break from the temples. We booked two courses: the cement bags making for the girls and the iron pencil sketching for the boys. We had a wonderful time. The kids, although small, had such a blast because the staff was so attentive and willing to involve them in the different classes. We keep fantastic memories of the morning spent with the Backstreet Academy!"
        }, 
        {
            "index": 224, 
            "rating": "5", 
            "review": "Cambodian cooking. We had a great time on this cooking course and made and tasted some delicious traditional Khmer food. Both our host cook and our English speaking guide were lovely and made us feel very welcome. Be prepared that the market tour at the beginning is quite dirty and very Cambodian but once you get back to the guides house it's fine. She had a fan and bottled water which was fantastic in the hot weather! A great afternoon!"
        }, 
        {
            "index": 225, 
            "rating": "3", 
            "review": "Cambodian Cooking Class. This was our second Backstreet Academy experience, and like the other, it was a tremendous experience. We like the whole concept and the well-organzied way it is put together.The highlight of our Cambodian Cooking Class was the translator, Manath (last name Duong). She was fun, intelligent, personable, and very helpful throughout the course. She made the course for us. It was difficult to get to know the host, mostly because of the language barrier. This was more of a Cambodian Cooking Demonstration rather than a Cambodian Cooking Class. She did the shopping while we watched, and Manath told us what she knew of the foods. The host did most of the cooking and we chopped a few vegetables. The market where we shopped was fascinating, out in the counry, full of local women doing their shopping, but filthy. The host is the mother of ten children. Several of them were around while she cooked and we had a great time interacting with them. If you would like an unrefined gritty experience of Cambodian rural markets and eating local food with a Cambodian family, as it really is for many Cambodians, then you should really enjoy this class."
        }, 
        {
            "index": 226, 
            "rating": "5", 
            "review": "Iron Pencil Class. We did the Iron Pencil Sketching class & it was wonderful! It is absolutely amazing how good Reoum Bunhak is with an iron pencil! We had so much fun learning from him. It is a great way to connect with local people in a meaningful way. Reoum helped each of us with our chosen picture & we were able to come away with really nice & meaningful souvenirs. Iron pencil carving is challenging but Reoum makes it fun. Take a class at Backstreet. You will have a wonderful time!"
        }, 
        {
            "index": 227, 
            "rating": "5", 
            "review": "Awesome coconut carving. I'm so glad we found this place on Tripadvisor!. We were looking for something to do other than temples, and booked the coconut shell carving at about 8 pm last night. We were confimed last night for a 12 pm session today. This is a little pricey, but well worth the money. My family spent about 2 hours cutting out little shapes (stars, bunnies, fish, etc) from coconut shells. as a previous reviewer said, the coconut is much harder to cut than I thougt it would be. My eight year old was fine, but my six year old struggled. Both the artist and interpreter were very patient and kind to her especially when she cut off her bunny head by accident and knicked her finger with the little saw that we were using :( After we cut out the shapes, the artist turned them into beautiful keys chains. My girls helped polish them after he sanded them and added his finishing accent touches. It was really fun to spend time making something together as a family. The place where we did the carving has lots of other classes going on and you can buy some really nice gifts. It's quiet and tranquil, quite a nice change from the chaos of the temples that we explored the day before. Assuming that the money really does go to a good cause, and I have no reason to suspect otherwise, it was definietly money and time well spent."
        }, 
        {
            "index": 228, 
            "rating": "5", 
            "review": "Copper bangle making was awesome. Myself and the wife did the copper bangle making,it was so much fun.Friendly and helpful staffFinal product was amazing if I do say so myself :)Definitely worth doing.The place is a little hard to find but it is about 200m on the right walking away from the hospital on the road behind Sofitel Hotel."
        }, 
        {
            "index": 229, 
            "rating": "5", 
            "review": "Great human experience and so much fun !. We did the flute making and the cambodian boxing in the same day and it was perfect ! The cambodian boxing was taught by two young boxers, as funny as skilled in their art, so we had a really good time. The flute making was in the BackStreet Academy HQ, in a sunny courtyard and we learned a lot through our instructor, at the end we left with our flutes and the one he made and gave us as a gift ! Our facilitator and the BackStreet Academy manager also took a lot of time to talk with us between the two classes, it was great to spend quality time with them while drinking the good coconuts they offered us. This is a real human experience, an ecotouristic choice and a funny moment you can't miss."
        }, 
        {
            "index": 230, 
            "rating": "5", 
            "review": "Wish we found this sooner!. After checking out some attractions in Siem Reap we came across Backstreet Academy and quickly started reading through the potential classes. Torn between at least 3 we opted for the wood carving class. At times we have sporadic WiFi in our hotel room, so after putting a booking in and paying the booking fee we got a little worried we didn't hear back, however with the WiFi being sporadic and us heading out to dinner we shouldn't have worried as an email was waiting with instructions. When we arrived we met our translator who was a lovely lady, and our instructor Ann. He was very skilled, and although he was a quiet man, he didn't hesitate to help hold the tools right for us as we banged away with the mallet, he had a lot of trust in us! At times I wish I could if just watched Ann work on a more elaborate piece, as when he took over to assist or show us what to do for part of the carving, I was mesmerised by his skill. After this taster I am really keen to try some other classes and even more so to develop my skill in Wood Carving. We were also treated with a coconut milk drink during our visit, that was a fantastic gesture, and it was tasty!Thank you to Backstreet Academy for providing these classes, and thankyou to Ann for sharing your skill with us!"
        }, 
        {
            "index": 231, 
            "rating": "5", 
            "review": "Do it! Wonderful experience. Great memories.. I did the Dessert Making class (http://www.backstreetacademy.com/course/details/339) and it was one of my favorite experiences in Cambodia. When people think of Siem Reap they think (much like I did) Angkor Wat, and that's it. I had a day spare though and wanted to delve deeper into the social culture. Sometimes the easiest way to do that is through food, so I decided to search online for a cooking class. My translator was so friendly, a great conversationalist, she answered all my questions. My host was very welcoming, organised and so talented - I have no cooking talent, so the fact she managed to get me to make something that tasted delicious was a miracle - well done!I was so happy I got to spend time with people who were local to the area, they were so warm and fun to be around and left me with great memories. I highly recommend this course and the Siem Reap Backstreet Academy."
        }, 
        {
            "index": 232, 
            "rating": "5", 
            "review": "Very fun and a great break from the temples. I actually read the reviews here and decided to join a class with Backstreet Academy and now I really recommend people doing it if they would like a break from the temples. I joined the copper bracelet class and it was so much fun hammering patterns into the copper plate. The teachers there are very patient and they have given good instructions to a beginner like me. It's so rewarding to get my final product!"
        }, 
        {
            "index": 233, 
            "rating": "5", 
            "review": "Fantastic Experience!. I had an Apsara Dance lesson. The staff and dance teacher were very friendly and I really enjoyed the lesson.I will coming back for that and want to try interesting culture classes. Thanks!!!Thank you!!"
        }, 
        {
            "index": 234, 
            "rating": "5", 
            "review": "Great idea, allows local people to teach and inspire. We have done two backstreet academies and loved them both. A proper local taste of arts and crafts and the money goes to the person teaching you."
        }, 
        {
            "index": 235, 
            "rating": "5", 
            "review": "Great Apsara dance class. I took an Apsara dance class with a friend. We had a local coordinator who spoke English and helped us with the communication with the instructor. Booking was very easy - made through the website, and received a confirmation a few hours later. Very good price too."
        }, 
        {
            "index": 236, 
            "rating": "5", 
            "review": "Learn from true craftspeople while in Siem Reap - a must do!. Take a break from monuments to spend creative time with local craftspeople! We took the soapstone carving and iron pencil sketching classes and wish we had more days to spend exploring their other options. What a great way to spend time with locals! This organization is about creating access to markets for local artisans and communities that might not otherwise have an outlet for their creative endeavors or the ability to make a living with them. A big part of their mission is re-invigorating economically disadvantaged communities and preserving and maintaining local arts. The artists don't always speak a lot of English, so the organization assigns facilitators to act as welcoming hosts for the students and as translators. While working, we swapped vocabulary words with the instructor, shared food and laughter (lots of laughter!), and felt like we came away with new friends. We also did a LOT of our shopping in their marketplace area, which felt great since we knew the funds were going to support the communities that make the crafts rather than a lot of middlemen. There was zero pressure to buy anything, we simply wanted to after taking the classes. A great experience and a fantastic way to spend a day!"
        }, 
        {
            "index": 237, 
            "rating": "5", 
            "review": "Unique Iron Pencil Sketching. We had a fantastic iron pencil sketching with our Cambodian master Bun Hak, founder of a unique new type of art--Iron Pencil Sketching. Using hot iron to \"scar\" the wood, Bun Hak is able to create some really amazing sketches and under his tutelage I was able to complete a grand sketch of Angkor Wat complete with elephants and giant Buddhist carvings. I left Cambodia with a unique souvenir that I don't think people would ever believe was sketched by me (and the master). I would definitely try Backstreet Academy courses the next time I head to any places where they are available!"
        }, 
        {
            "index": 238, 
            "rating": "5", 
            "review": "Excellent experience- a must do for Siem Reap. Copper Bracelet - completed the copper bracelet class today. Booked it all via emails, all very easy with fast replies. The whole class was very well set up, teachers were amazing, and loved my bracelet at the end! I really would recommend anyone coming to Siem Reap to do this class! Cement Bag- my boyfriend did this class while I did my bracelet. He said the teachers were really great and helped a sewing beginner make an iPad case. He was really pleased with his bag! The whole team at Backstreet Academy were all so lovely and I urge people to try one of the classes!!"
        }, 
        {
            "index": 239, 
            "rating": "5", 
            "review": "Nice Bugs cooking class. Backstreet Academy tries to help local artisans making up their wages teaching tourists what they best do. I applied for the Fear Factor Challenge and it was really fun! There was a nice girl being the translator for the day. The course was held in the garden of the \"teacher\", that actually sells cooked bugs for a living at the Siem Reap market. I had the chance to cook (and eat) a lot of delicious crickets, silk worms, and tarantulas (very tasty!). I had a lot of fun and in the end, most of what i paid went directly to the teacher (I saw the facilitator splitting the money, and just a couple of dollars or so was taken by the Academy)."
        }, 
        {
            "index": 240, 
            "rating": "4", 
            "review": "(DYI) Brilliant Brass Bracelets!. Great, great idea: you go to an atelier where they have hand-crafted jewelry and they show you how to make it yourself! Granted, our versions were all of the simplified variety, but it was still an amazing experience and one that had us hammering away whilst humming \"whistle while you work\". Okay, maybe not the last bit, but it was incredible all the same.The skinny: you have to allot about 3 hours for the whole process, so if you're on a tight schedule, this workshop is not for you. In other words, if you're in Siem Reap for just one day, you should skip this. However, if you're in town for 3-4 days, this is an excellent way to mix things up and take a break from the temple tours. The best part: the local craftsmen show you exactly how to pound out your designs, so even if you're doing only the decorative work and they're doing the heavy lifting with the butane flame, etc., your handiwork is what people see as the end-product. The bad:- you must be a little \"crafty\", i.e. not afraid to pound out your design with a hammer- it's a little slow-going at first- you can only choose the simpler designs as templates (because of time constraints)The good:- definitely a one-of-a-kind experience- really nice to have to final product in hand (that you made!)- totally cool to watch the whole process unfold in front of youSo if you're in Siem Reap and you're a bit templed-out, definitely carve out an afternoon and go for one of Backstreet Academy's workshops. Totally worth it!"
        }, 
        {
            "index": 241, 
            "rating": "5", 
            "review": "Brilliant Bug Cooking Class - yum!. Two of us had a 'fear factor' bug cooking class this morning and we loved the experience! Our teacher, Rathana, was an expert, and our facilitator/translator, Srey Leak, was lovely and spoke great English. We had a really good time with them and they even got us to eat a whole tarantula each! It was really hands on too. Highly recommended :)"
        }, 
        {
            "index": 242, 
            "rating": "5", 
            "review": "Arts n craft fun for the family!. This is a social enterprise that seeks to direct tourist $ directly & more efficiently into the local economy. It brings together local craftsmen and tourists for fun-filled arts n craft classes!Activities suit all ages. My 5 & 8 yr olds had flute making and coconut carving classes while we had iron pencil classes.We took 3hrs to complete - it can be tough going but we had a lot of fun. Best of all we talked to the locals and saw the direct beneficiaries of our tourist $. A wonderful 3hrs spent.This place is new so tuk tuk drivers may not know how to get there. Call ahead to setup appointment with instructors."
        }, 
        {
            "index": 243, 
            "rating": "5", 
            "review": "Iron pencil drawing.. Great fun, and we had a wonderful souvenir to take home at the end of the class! The people were kind, helpful and spoke good English."
        }, 
        {
            "index": 244, 
            "rating": "5", 
            "review": "So much talent. Did the iron drawing workshop and learnt an art that only one man does, it is his own creation. It was amazing to see his skills where he took a hot iron rod out of the fire and burnt a A4 size Palm tree board to create gorgeous pictures of the Angkor temples and any picture you wish. He created his Art over 13 years and we barely managed an artist straight line in 4 hours when we tried but he turned our attempts into masterpieces. A wonder organization that supports local artists, gives you an expectional experience, a uni student English practice and a souvenir with meaning! Great activites and there is lots of choices for the kids too."
        }, 
        {
            "index": 245, 
            "rating": "5", 
            "review": "Flute making class - enjoyable . We did the flute making class and it was very enjoyable. The interpreter was charming and enjoyable to chat to with excellent English and the teacher spoke some English too and was very patient. He had a very high level of skill and although my husband did most of the work to make the flute which he was very happy with, the teacher kindly added some nice finishing touches. They were also very considerate setting up a fan for us and bringing us fresh coconut and water to keep us hydrated. Great experience."
        }, 
        {
            "index": 246, 
            "rating": "5", 
            "review": "Great Fun!. Palm wood carving was the only class available on short notice, and though the chisel was scary and the electric sander heavy, Chum Kiel was a patient teacher and our jointly crafted project (a plate, fork and spoon) came out wonderfully. Make sure to tell your tuktuk driver to wait for you. The artisan workshop is a bit off the beaten track for tuktuks, but fortunately someone offered to take me back to the hotel on her motorbike. A great way to meet the locals."
        }, 
        {
            "index": 247, 
            "rating": "3", 
            "review": "Nice but not as expected. If you have some spare time you will enjoy it, but their are not much artists and the things are more expensive than the night market. Its worth going if you want to learn how to make some cambodian craft but it will take you at least two hrs."
        }, 
        {
            "index": 248, 
            "rating": "5", 
            "review": "Having fun with new experience. Today morning my boyfriend and me was having \"flute making class\". We did it step by step as what instructor told us.The instructor was very patient. I never had made it before. Everyone are friendly and they knew how to flute in very properly. I can't understand what song they were fluting. I just fluted it to make a noise not a song. That was very funny time for us and I enjoyed this class so much. we can share the experience with the local people, the way they live and learn about Cambodian culture more. Don't forget try it!"
        }, 
        {
            "index": 249, 
            "rating": "5", 
            "review": "Delightful Experience!. I had a wonderful experience as a participant in the Backstreet Academy! I took the \"Iron Pencil\" class and was amazed at the talent of the instructor. He was not only a true artist, but was incredibly patient as he supported me through the process. The philosophy of this NGO is fabulous as it not only offers a fair wage to the artists but also provides a valuable learning opportunity for the participants. I highly recommend this wonderful opportunity!"
        }, 
        {
            "index": 250, 
            "rating": "4", 
            "review": "Soap stone carving having fun. Good experience. Instructors English was limited, as was the translators. We carved a 2D elephant out of soapstone. When I say \"we\" the instructor did over half of it, but I guess the idea was to make sure we had something to show at the end. My 9 year old son really enjoyed the carving, not so much the watching and got a little bored by the end of it. Would have been good to have a choice on what to carve and to have seen a finished version before we started as we were a little in the dark as to what it was supposed to look like. But overall a good time was had and it was a different way to spend the morning."
        }, 
        {
            "index": 251, 
            "rating": "5", 
            "review": "Fun Time!. Even though I have never taken a dance class in my life, I thought it would be fun to try the Apsara class to learn more about this exquisitely beautiful, traditional form of movement. Although it was quite tricky to pick up the moves, I had fun trying and laughing at myself. I think I gave the girls a good laugh, too! My guide and the dance instructor were both very friendly, fun and patient. More than anything, I enjoyed chatting with them and learning more about their lives.I also wanted to take the cooking class, however it was unfortunately booked. This is a great program with a wide variety of interesting opportunities to learn about Cambodian culture. Definitely worth checking out."
        }, 
        {
            "index": 252, 
            "rating": "2", 
            "review": "Potery class with NO instructions, disapointing.. My boyfriend and I decided to do the pottery class. We decided to go with backstreet academy instead of khmer ceramics fine arts center since backstreet appeared to be more of an experience with the locals. Having read the good reviews we had high expectations. However, we were pretty disapointed. When we got there they made us sit at the pottery station and basicly told us to push on the thing with our feet. The lady was then making the pottery with her hands. It went on like this with no explanation for a while and we had to ask if we could try ourselves. (The ladies where really good and it was impressive to see their work, but when it was our turn the translator didnt provide any explanations on how to do it and it always ended up being the ladies finishing the project). The website says the course is supposed to last 2-3 hours but after an hour and a half they said that it would be better if we finished now because \"the road gets silent\" ( the place where you do the pottery is 300m from the airport road so it is not a silent road at 6pm).I am aware that pottery isnt easy, and not something you can be succesful at after a 2 hour class, however having basic instructions and tricks would have made the experience totaly different.p.s. if they tell you to meet at the ankhor mundial restaurant, this restaurant has moved a few months ago so be sure to go at the one located on the airport street. I wouldnt recommend doing the pottery class, but backstreet academy seems to have other options so maybe try another class!"
        }, 
        {
            "index": 253, 
            "rating": "5", 
            "review": "A Must do. Did the iron pencil scetching,had a fantastic time. Highly recommend, it is great fun and you get a unique souviener"
        }, 
        {
            "index": 254, 
            "rating": "5", 
            "review": "Great Way to Meet the Locals. My husband and I did three Backstreet Academy activities this week. We did the copper/silver bracelet class, the copper wire bracelet class and the cement bag class. All were excellent, I learned news skills, gained appreciation for what these craftsmen do and interacted with some lovely locals. I was most impressed by Bel, our teacher at the copper wire jewelry class and founder of the NGO KILT. Despite a hard upbringing and loss of a leg from a land mind, Bel has a can do attitude and today, he not only provides for his families, but helps others with disabilities that might otherwise be neglected. Backstreet Academy opens your mind and your heart."
        }, 
        {
            "index": 255, 
            "rating": "5", 
            "review": "Great experience with lovely people. My husband and I booked a jewellery making course over the Internet from Australia. Samon from Backstreet Academy was easy to communicate with and extremely helpful. The course was fun and it was great chatting with some local people while we made our creations. Highly recommended as something different to do when you get sick of the temples and the money goes to charity"
        }, 
        {
            "index": 256, 
            "rating": "5", 
            "review": "Amazing!. An amazing experience - a real highlight of my two weeks in Cambodia. We did the rubber tire making course that was an eye opener and i got to experience a different side of cambodia. We also so enjoyed our experience and what the Backstreet Academy is trying to do we also took the copper bracelet course (which is much harder than it looks!)"
        }, 
        {
            "index": 257, 
            "rating": "5", 
            "review": "Great experience. I've learned via Backstreet academy to do wood carving, and my friend did apsara dance.We had both a really nice time, learning those cambodgian traditions, with the help of very nice persons to translate us.I definitely recommend Backstreet academy, it's one of the best memories of our stay in Siem Reap!"
        }, 
        {
            "index": 258, 
            "rating": "5", 
            "review": "Backstreet cooking class. We had a great time on Thursday 20th November doing the cooking class in Siem Reap. Great company, delicious food and we learnt recipes that we could definitely use back home in Australia."
        }, 
        {
            "index": 259, 
            "rating": "5", 
            "review": "Made an ipad case out of used cement bags!. I'm a tree hugger so you could imagine how I was in love with the idea of making an ipad case out of used cement bags! We were able to book a class via e-mail. We didn't have to make any deposit but the class cost us $15 per head. It's fun and for a great cause too because Backstreet Academy is a social enterprise. The course took us two hours to finish with the help of three instructors for three students. We were asked to describe what kind of bag we wanted to make. From creating the measurements, cutting the bags, lining, foam, to using sewing machines to put it all together, we were guided every step of the way. Even if I had absolutely no skill in cutting and sewing whatsoever, the instructors will make sure that the product you come up with will still come out beautiful and worthy to bring home as a souvenir."
        }, 
        {
            "index": 260, 
            "rating": "5", 
            "review": "Excellent company. We have been to three classes and loved each one of them. The copper bracelet was so exciting to learn and we ended up with a beautiful memento. The iron pencil craft or hot poker work was so interesting and we all have a wonderful picture for our walls. We also enjoyed water colours and painted two typical Cambodian scenes. The company is very efficient and professional and is such a bonus for Siem Reap. The tutors are lovely and there is a translator provided. I am going back!"
        }, 
        {
            "index": 261, 
            "rating": "5", 
            "review": "Incredible. My sister wanted to do this and initially I was hesitant because I didn't know if I wanted to take time away from seeing more of the Angkor temples to do arts and crafts which I wasn't really into as much. But then I went to the website and realized they have a ton of different types of activities, from Kmer martial arts to horseback riding you can do through Backstreet academy. We had a hard time deciding what to do. We took the stone carving course with Mr. Poy Khet and I am so glad we did! Most of the temples in the Angkor complex are carved out of sandstone, which is exactly what we used for carving. You feel a great connection to the people who built the temple complexes as you use a hammer and chisel to create something out of it. You also gain a huge appreciation for how difficult it must have been to create the vast temple complexes. We created stone flowers that could hold candles. It was a much better souvenir to bring home than anything from the touristy markets in the area. Mr. Poy Khet is a great teacher. He is very experienced and patient and will help you in any way he can."
        }, 
        {
            "index": 262, 
            "rating": "5", 
            "review": "Pencil Sketching Class. My wife attended the pencil sketching class on November 9, 2014. We found out about program on Tripadvisor as the academy is one of the top rated things to do in Siem Reap. After browsing all of the available activities, my wife decided to try out the afternoon pencil sketching class. We were able to make a booking on November 9 at 5PM on November 8 because of the fast reply from the academy.  On the day, the instructor and facilitator arrived 15 minutes before the course time at the Angkor Handicraft Association. My wife was offered to pick a picture she wants to sketch from a list of photos, and she selected the 4-face temple in Angkor Thom. Both the instructor and facilitator were very friendly and patiently taught my wife how to sketch.  After about 2 hours, my wife was able to finish her very first pencil sketching in Siem Reap. She found the course to be extremely fun and rewarding. The instructor also gave us his copy for free - what an amazing gift! It was also relaxing to shop at the Angkor Handicraft association which is entirely dedicated to the local talented artists in Siem Reap."
        }, 
        {
            "index": 263, 
            "rating": "3", 
            "review": "Only ok. Didn't enjoy the class as much as I thought I would.... Translation was hard to understand and didn't do very much painting at all- instructor painted most of the picture"
        }, 
        {
            "index": 264, 
            "rating": "5", 
            "review": "make your best souvenir. I did my sandstone course with Mr. Poy. He constructed me for the 3hrs with patient and his 16years experience. At the same time, he shared his knowledge about carving,materials and even his carving life. Finally he carved my name on the Khmer alphabet under my art work. That is the best souvenirs I got in SR.while I was waiting for the teacher, they have someone explained to me about the flower that we are going to carve and why it got chosen, they were able to answer all my questions about sandstone carving. I am now more understand and appreciate the hard work behind stone carving. This experience keeps reminding me those carving I have seen in Angkor temples."
        }, 
        {
            "index": 265, 
            "rating": "5", 
            "review": "Brilliant fun at Angkor Handicraft Association. We had an excellent time at the Angkor Handicraft Association (back street academy) in Siem Reap, doing a bit of coconut carving. The people were very friendly and even managed to teach a useless bunch like us. Lots of other activities going on and a great shop, with the proceeds going back into the local community, most of which I would have taken home baggage allowance permitting."
        }, 
        {
            "index": 266, 
            "rating": "5", 
            "review": "fun and creative, learn from local khmer artist. I had a couple of hours to spare and wanted to try something different away from hoardes of tourists, and Backstreet Academy was all that! This place is fantastic and I highly recommend if you are looking for something a little different and want to spend time chatting with locals while you are at it.From my initial phone call, they were incredibly friendly and helpful, and when I couldn't find them, they sent a staff member on moto to come and meet me! I took the pencil sketching session as this was available at short notice on the day that I called, and it was a lot of fun, and a nice relaxed activity after a lot of time out and about in the heat. I thoroughly enjoyed my visit, my teacher was superb, and the translator was great fun and very encouraging. And I had a lovely pencil sketch to take away as a momento. They have a great set-up, I never felt rushed or stuck on a timetable, and it really seemed that they love sharing what they do with others. Next time I am back in Siem Reap, I will be back to try another of their classes! Really impressed with my experience at Backstreet Academy!"
        }, 
        {
            "index": 267, 
            "rating": "5", 
            "review": "Done with Temples? Meet lovely people & create a Cambodian souvenir. I needed a day off to recover between hot, long days at the temples so I looked on Tripadvisor & found Backstreet Academy! The reviews were fantastic, so I decided to try it. The Khmer snack class I initially wanted to take wasn't available but they quickly emailed me back to tell me they had a cement bag laptop sleeve class. It was $15 and was supposed to take 3 hours, but since I was the only person in class I got it finished in 1.5 hours, with the help of the fantastic teacher & translator they provided! The ladies were a joy to spend time with and I am now looking forward to taking other BA classes in Phnom Pehn or Hanoi. Their location is a bit off the beaten trail but absolutely worth finding! Their location also has a large gallery of crafts for sale at reasonable prices, so buy your souvenirs here! Thank you for a memorable afternoon, Backstreet Academy!"
        }, 
        {
            "index": 268, 
            "rating": "5", 
            "review": "Fun activity and definitely something new!. These mini-experiences are a great idea and well executed by Backstreet academy. I live in Siem Reap and have now done a couple and they are a great time. The bracelet making was an awesome and fun opportunity to meet a local silversmith and I ended up with a really cute piece of jewellery. I did it with a group of friends and we had a good laugh about how untalented we were. With the instructors help though, the finished product always kinda works out. I've also done the oil painting, which again was a hoot. Of course you aren't going to learn how to be a professional oil painter in an afternoon at a cost of $12 -- what you will get is a tonne of laughs, the opportunity to chat with local artists and a beautiful souvenir that you can brag about back home. They are really good value for money experiences and offer a controlled setting to talk to Khmer artists about anything you want to."
        }, 
        {
            "index": 269, 
            "rating": "5", 
            "review": "Coconut carving: Different and memorable experience. Our family of five took the coconut carving workshop, and had a great time! Something very different in addition to the temples, floating villages and markets. This experience was hands-on, with two local artisans and our translator, who joined in as well. Our youngest at six years was a bit young to use the tools, so she helped out with various jobs rather than making her own carving, and she felt just as accomplished as the rest of us once we had finished our three key rings each in various designs. (I recommend a minimum age of around 8 to do the carving). It turns out that coconut carving is quite a skill! This will be a memory that will last a long time."
        }, 
        {
            "index": 270, 
            "rating": "5", 
            "review": "Something speical at Siem Reap. Four of us joined the 2 hours horse riding. We all have no experience for this. An experience leader went with us at front and he took us to the village and temple nearby and introduced in details. This is a very speical experience to allow us to know more about local Siem Reap.There are also 2 guys help leading our horse at the begining to make sure we all riding ok. They are all very friendly and helpful. We enjoyed it very much. I wish I could enrolled some other activities next time."
        }, 
        {
            "index": 271, 
            "rating": "5", 
            "review": "Absolutely wonderful experience. I took a class in sewing cement bags and had a wonderful time. The teacher was pleasant, patient and lots of fun. Translator and facilitator joined in and I had an unforgettable experience. I took the class the day before I left Siem Reap or I would have enrolled in some others as I enjoyed this one so much. An absolute must do. (review submitted on behalf of my travelling companion Christine Bowman)"
        }, 
        {
            "index": 272, 
            "rating": "5", 
            "review": "Great morning painting. The oil painting class was extraordinary. We had a delightful tutor, Mr Mallivan, who showed us a bunch of interesting and effective painting techniques. Our products were great too - thanks in most part to the skills of Mr Mallivan. Mr Samon was an absolute delight who escorted us personally to the site of the class. Sitting under the trees painting is one of those things that just makes you feel good! Great company, great class, great morning! Thanks to all at Backstreet Academy in Siem Reap."
        }, 
        {
            "index": 273, 
            "rating": "4", 
            "review": "Awesome. I actually took several different classes, stone carving, cement bags, and copper bracelet. The artisan were amazing and so helpful as I bungled my way through. There is a little reassure to buy something from their shops but after try to make something for myself I was even more impressed by the skills of the teacher."
        }, 
        {
            "index": 274, 
            "rating": "5", 
            "review": "Local craft experience Luang Prabang, Laos. Going on an outing with Backstreet academy to visit a local crafts person in Luang Prabang, Laos provided me with an opportunity to experience something that normally I would have definitely missed.I’d seen the multitude of local crafts displayed at the famous night market of Luang Prabang, but my outing with Backstreet Academy took my beyond that, to the world of the people who sell their crafts at the night market, day in day out, in order to make a living.I was collected at about nine o’clock in the morning by a tuktuk that carried also my Backstreet Academy guide, or as they are called, ‘facilitator’ who explained to me our plan for the morning as well as the way Backstreet Academy works. In all the aspects of a trip we were on, BA’s objective is to let the local people involved in their activities benefit from it financially. This applies to the crafts person hosting the visitor, the facilitator, who’s a young Lao student trying to improve language and interaction skills with foreigners as well as making some cash, as well as the tuktuk driver who’s ensured to, working with Backstreet Academy, have a steady amount of work. I’d learned this before on the BA website and it was the main reason that I joined Backstreet Academy on one of their outings. After a friendly chat with my facilitator we arrived at the place of Ms Ga Thor, a kind young lady who was going to be our host for the next few hours in which she would show me how the cute and warm house-slippers that I’d seen displayed everywhere at the night market, are made. During the process it was fascinating to see how Ms Ga Thor lives and learn a little about her life. At 30 years of age she is the mother of 4, her oldest being 15. She lives in a 5 by 8 metre one-room house in which 3 corners are occupied by beds that, at night, accommodate the 8 people living in the house. In the fourth corner is the kitchen.In the middle of this Ms Ga Thor has her hand-powered sewing machine which is essential in the production of the house-slippers. While neighbours and relatives gathered around to watch us, Ms Ga Thor showed me how to make house-slippers, demonstrating that it was not so easy, by letting me having a go at it. I was happy that in the end she rescued me from my poor attempts to work the sewing machine to produce 2 lovely looking house-slippers which she then presented to me. It had been a worthwhile undertaking from the moment I had stepped into Ms Ga Thor’s home but after receiving the house-slippers I was honoured with another gift when Ms Ga Thor handed me, and put a pretty hand-made bracelet on my wrist. From my visit to Ms Ga Thor it was clear that she and her family do depend greatly on each little bit of income that they can gather, and the idea that some of the money I paid for this outing (which I thought was little) goes to Ms Ga Thor (and, not to forget, to the tuktuk driver as well as the facilitator), made the whole experience for me a very pleasant one.‘Good show’ Backstreet Academy."
        }, 
        {
            "index": 275, 
            "rating": "5", 
            "review": "Oil painting in Siem Reap. I did the oil painting class while visiting Siem Reap and I must say that it was one of the most unique experiences I've had on my travels! I'm not an artistic person but with the help of the teacher and translator, I was able to produce a small oil painting of my own in about 2 hours! The teacher and translator were incredibly warm and friendly which made the experience so enjoyable, and I have a nice momento of my trip to take home! Highly recommended!"
        }, 
        {
            "index": 276, 
            "rating": "5", 
            "review": "Such a wonderful cultural immersion. I took the stone carving and palm wood carving class in Backstreet Academy and it was so fun and memorable! Both my teachers were extremely skilled craftsmen and great teachers and I learned a lot from them. It was really interesting to see and be able to make my own version Cambodian art. It made me appreciate those local art pieces so much more, knowing how much work is put into each and every one. It was such a nice way to immerse myself with the locals and in local art too-- truly one of the things I'll never forget about my Cambodia adventure. Thanks to the great staff behind Backstreet Academy (operations manager, teachers) for being efficient and helpful from the first time I enrolled in the class to my actual participation! You guys rock! :)"
        }, 
        {
            "index": 277, 
            "rating": "5", 
            "review": "Iron Pencil Sketching. One of my favourite experiences from Cambodia so far! Wonderful people, an amazing talent and an incredibly enjoyable morning. Bun Hak showed us his craft of Hot Iron Pencil Sketching where a hot iron is used to burn a picture onto Palm leaves. Bun Hak made it look incredibly easy, his workmanship is incredible, a true artisan! He helped us to create some magnificent work, without his help it would have been tricky but it was a nice technique to try, my wife has a steadier hand than I so took to it very well which surprised Bun Hak given how tricky his craft is!Our translator Srey Net was on hand, who was incredibly helpful and attentive, providing us with fresh coconut water in the hot sun.Samon and Navy run an excellent business, a brilliant idea that should be expanded to all countries. Trying your hand at local artistic techniques is something everyone should try while travelling especially in Siem Reap. It's unique and a great way to experience Cambodian craft.The team at Backstreet Academy were all lovely and Bun Hak had even created an iron pencil sketch just for us as we were on our honeymoon.All in all, easily one of my favourite experiences from Cambodia, even if I wasn't a natural!"
        }, 
        {
            "index": 278, 
            "rating": "5", 
            "review": "\"Fear factor\" aka cooking and eating bugs . My gf and I did the fear factor course today. It was a fun experience! After meeting the translator they took us to Mr. Ratana's backyard (which can get hot so bring water and suncream!) where we met our 'guide'. The house was also full of children playing around and keen to watch which was fun. The whole thing was very authentic, we really were hanging out with the locals.We cooked crickets, worms and the the big prize, some tarantulas. I actually really enjoyed the crickets! My gf liked the worms, and the tarantula was..an experience! Overall couldn't recommend this more, was a welcome break from the tourist circuit that is siem reap"
        }, 
        {
            "index": 279, 
            "rating": "5", 
            "review": "Too much temples and sightseeing? Come here.. My sister and I spent a few days in Siem Reap doing all the touristy stuff. We went to Angkor and saw those temples, we went to the markets, we even went hours out of the city to see other temples and ruins. So for our last day, with our bus leaving in the evening, we quickly searched for something different to do for a few hours during the day. My sister found Backstreet Academy on Tripadvisor. We quickly read over the reviews and saw that everyone seemed to really like it. So we sent an email the night before and didn't think that we would get a response in time for their 9am class the next day. When we got up the next morning (without any plans of what to do) we received an email from them telling us that they could take us for the cement bag class. Our tuk-tuk driver had a hard time finding the place, he ended up having to call them and they directed him there. They stood outside and greeted us. My sister and I each had a lady help us do our own project (i made a bag and she made a laptop/ipad case). After talking we found out that the ladies were sisters too. There was also another girl whom was like an interpreter. She was really helpful in explaining and answering our questions. They were all so nice and friendly. They provided us with water bottles and let us do everything on our own. The class was about 3hrs and once we were done everyone clapped and you just feel so accomplished. They had a tuk-tuk driver ready to bring us back and they even gave us key chains. After talking to the program manager here I realized that they have these classes in other cities as well. If i were to visit them I'd definitely go to a class. But for now, I definitely recommend these people here at Backstreet Academy in Siem Reap. They're just so genuine and friendly!"
        }, 
        {
            "index": 280, 
            "rating": "5", 
            "review": "Horse Riding and Cement Bags. I came across the Tripadvisor reviews for Backstreet Academy so decided to have a relaxing day with the horse riding and cement bag courses. Both places were extremely accommodating, especially in light of my sprained ankle.Both of these were great fun and I really enjoyed the experience that both offered.I had Chey as my horse riding guide - he had great English and was giving a commentary of the area whilst walking past rice paddies, lotus flower ponds and local homes. The horses were well looked after and the owner is enabling these guys (and girls!) skills and experience they would not have.I love my laptop bag from the cement bag course - although I would attribute it more to my instructor's guidance, not my (lack of) inner seamstress. It was a relaxing way to pass the afternoon and get to know the ladies (and guy!). If I was staying longer, I would have booked in more courses :)"
        }, 
        {
            "index": 281, 
            "rating": "5", 
            "review": "Authentic and a bit different. We found the Backstreet Academy on Trip Advisor and booked last minute to take the class where you can make bags from recycled cement sacks.After experiencing so many tourist traps on our travels it was really nice to spend a quiet afternoon with the local girls. They were so lovely and very patient with the complicated and fiddly process of bag making.At the end we came away with a unique souvenir rather than the generic stuff you find in the markets. I highly recommend to anyone looking to do something a bit different. I would try one of the other classes if I went back to Siem Reap (or any of the other places they have the Backstreet Academy)."
        }, 
        {
            "index": 282, 
            "rating": "5", 
            "review": "\"Fear Factor Challenge\". We booked the \"Fear Factor Challenge\" and where picked up in time and where driven to Mr. Ratanas backyard for todays cooking class. It was just us two. We got a very warm welcoming by the crew and got introduced to the food. 3 types of creepy crawlers ready to be prepared. We where really suprised by the good taste of all these insects and to learn about the background story of eating them."
        }, 
        {
            "index": 283, 
            "rating": "5", 
            "review": "Iron Pencil Sketching - we LOVED it!. We had a really special afternoon working with our wonderful instructor Bunhak and facilitator. Bunhak let us chose our favorite designs then showed us how to create beautiful works of art on palm canvases using hot iron 'pencils' to burn away areas to give a really unusual finsh. He was very patient and kind and under his guidance we very quickly managed to get a hang of the technique. Bunhak was there to help whenever we got a bit stuck and at the end he gave our pictures a wonderful finishing touch. For a really unique experience we highly recommend iron pencil sketching - get to meet and watch the amazing skills of Bunhak, choice from a range of images and create a personal and memorable souvenir. Thanks Backstreet!"
        }, 
        {
            "index": 284, 
            "rating": "5", 
            "review": "Cement bags. We spend the afternoon making our own cement bags and enjoyed every minute of the workshop. It was a great experience with patient wonderful staff with the added bonus of finishing the afternoon with our indivdual cement bags to take home. Would recommend Backstreet Academy as a low cost way of experiencing Camodian handicrafts and learning a hands on skill. Judy & Debra"
        }, 
        {
            "index": 285, 
            "rating": "5", 
            "review": "Leather Carving. My daughter chose to do the Leather Carving course and I went along a bit reluctantly, but we both enjoyed it and are very pleased with want we made. Its a great way to meet the local people, and really makes you appreciated all the hard work that goes into the craft that can be bought for very little in the markets. Our hosts/instructors were much younger that I had expected (early 20s), yet were very attentive and patient. It takes longer than the advertised time to complete your work so it will probably be finished off by the instructor (they a happy to do this for you). The pick up point for the leather carving is the Entrance of Cambodian Cultural Village yet it is best to stop across the road. That is where the course takes place in the Batiment Khmer d' Angkor Thom. The criticism I have of the course is that Backstreet Academy have contracted with the school to have the visitor make a overly ambitious puppet. It is very time consuming and difficult to display once you get it home. A smaller carving without the sticks would be more practical."
        }, 
        {
            "index": 286, 
            "rating": "5", 
            "review": "Create a gorgeous souvenir smelling palm leaves yourself in a friendly and relaxing atmosphere :). I spent 4 hours at the Backstreet Academy doing the \"iron-pencil\" sketching of Angkor Wat temple today. This was an amazing experience since I am into handicrafts and a handicraft class taught by a local person is especially interesting. The staff is super friendly: they would accompany you, chat with you and bring you coconut juice ;)Your working table is outdoors but has a roof. First, you will draw a sketch of your future picture (you can use stencil plates with a variety of designs: Bayon, Angkor Wat, Apsara dancers, jungle trees etc). Then you will use long metal sticks to burn the contours, shadows, patterns on your palm leaf. If later on you want to hang your picture on the wall, the artist, Mr.Bun-Hak will make it for you.Consider going to Backstreet Academy- it's really worth visiting, and I hope to visit it again! Many thanks and warm wishes to the Backstreet Academy staff&artists :)"
        }, 
        {
            "index": 287, 
            "rating": "5", 
            "review": "Ceramics painting class!. Backstreet Academy is great! I was recommend by my friend to do the mug painting course. It was so much fun. I made my own drawing on the mugs."
        }, 
        {
            "index": 288, 
            "rating": "5", 
            "review": "Great experience!!!. I'm a local people, I was finding the place to do the mug painting for my parents. I found a course in Backstreet Academy from my friend! It was so much fun"
        }, 
        {
            "index": 289, 
            "rating": "5", 
            "review": "Loved it!!. I took the Cement Bag class. It was a lot of fun! A lot of work goes into the bags, more than you might think. I loved the bag I made. I picked out the bag and pattern I wanted and cut and did most of the sewing myself with the help of the seamstress. This was a great way to experience the local culture and take a break from the temples."
        }, 
        {
            "index": 290, 
            "rating": "5", 
            "review": "Amazing cocktail class!. I did the Cambodian Cocktail making class which was brilliant! Our 'teacher' introduced us to all the herbs and spices we would be using first (no 'ordinary' cocktails here!) then we started making. At only $15 I thought it was very good value. The bar itself (Asana) is gorgeous, with floating beds, fairy lights and chilled music. Thank you for a lovely class!"
        }, 
        {
            "index": 291, 
            "rating": "5", 
            "review": "An absolute blast!. I did the \"Fear Factor\" class with Samon in Siem Reap, and boy was it an experience. I met with Samon and the bug chef, Rapana, outside of Rapana's home not far from the center of town. All the ingredients were ready to go: crickets, grasshoppers, tarantulas, water snake, along with plenty of seasonings. They walked me through preparing each type of bug before frying them up in cooking oil. The crickets were definitely my favorite! Samon was happy to take pictures and a video of me cooking the bugs and trying them (so glad I have a video of me eating a tarantula to show off to my friends). Both guys were seriously super nice, and were excited to share a bit of their culture with me. If you are feeling a bit adventurous, and want an amazing story, then I highly recommend taking the Fear Factor class in Siem Reap."
        }, 
        {
            "index": 292, 
            "rating": "5", 
            "review": "Amazing time!!. Me and wife had an entire evening free in Siem Reap. We did the temples, the shopping, the eating and we pretty much ran out of things to do. We happen to come across Backstreet Academy's courses and decided to partake in the Khmer cocktail class to pass by the evening, not knowing what to expect. The experience we had completely took us by surprise! A very well organized course got started at a beautiful setting at what they supposedly call the only wooden house in town. One by one, the bartender got us to sample all the spices we would be using before we got onto the drinks. That was quite useful as some of the spices were completely new to us and this also acquainted us with the smell and taste. We made four drinks, three we had a hands on training while the fourth was pretty much free and easy. I really liked that arrangement where the structure was well balanced. The cocktails themselves were delicious, every one of them. Except I would have personally put in an extra shot or two in mine. But that being said, all of them impressed me thoroughly. Later I found that Backstreet Academy also has many other courses around town and checking them out is definitely worth your time. Backstreet Academy should be on every visitor's itinerary!"
        }, 
        {
            "index": 293, 
            "rating": "5", 
            "review": "Very interesting and fun classes. We did two classes with Backstreet Academy - Khmer Cocktails and Cement Bags. Both were fantastic. The cocktail class is in a nice little outdoor bar right in the middle of town. All the ingredients and equipment were set up ready for us when we arrived, and as well as the teacher a representative from Backstreet Academy was there to welcome us. We learned how to make three cocktails, all of which were delicious - especially 'Tamarind Sauce'. The teacher spoke decent English and was really good fun. It's also worth mentioning what outstanding value this was - to order the same three cocktails from the menu would only have cost $1.50 less than taking the class!The following day we did the Cement Bag class in the morning. Actually, we had been supposed to do this the previous day, but our tuk-tuk driver couldn't find the meeting place, and after driving around aimlessly for an hour we had to give up and return to our hotel. I then called Akash at Backstreet Academy, who was extremely apologetic (despite the fact that the problem was in no way their fault) and arranged for us to do the class the next day at no extra cost. He also sent a staff member to meet us at our hotel to prevent the same problem occuring. As the regular instructor was not available, we were taught how to make the bags by two sisters who were doing their first lesson, although I would never have guessed this if we had not been told, as both were great. Throughout the bag-making process, two staff members from Backstreet Academy also helped out, and Akash was also present (and told us lots of interesting information about Backstreet Academy's history and plans). From start to finish the class lasted about 3 hours, by the end of which we each had a great new bag, and were also given a matching wallet and purse, which was a lovely surprise.Overall, we couldn't have had a better experience with Backstreet Academy - everyone we met, staff and teachers, were incredibly friendly and very professional. Our only regret is that we didn't have time to take any more classes, but if in future we visit any of the other cities where they operate then we shall certainly take the chance to learn some new skills! Many thanks to Akash and everyone at Backstreet Academy!"
        }, 
        {
            "index": 294, 
            "rating": "5", 
            "review": "I had such a great time!. I did the leather carving class and even though it was hard work, I was so happy and proud of what I accomplished. I felt like I was taking a long time, but the student teacher and Samon were so patient with me! I highly recommend this experience for anyone hoping to really learn about cultural aspect of Cambodian culture and to give back to a good cause!This backstreet location just opened up a month ago so that's why it only has 4 reviews. I expect it to really take off over the next few months!Please come and participate!"
        }, 
        {
            "index": 295, 
            "rating": "5", 
            "review": "Turn your idea into jewelry you can wear. I had a wonderful morning crafting a copper band bracelet with Backstreet Academy's silversmith. The business was family run and after a bit of ogling in amazement as I watched one of the assistants etch out an intricate classical design for a wall piece, I got to work on my mini piece of art. I brought my own design and step by step, with the guidance of my teacher, I came out with my own handmade bracelet. The feeling of satisfaction put a smile on my face. Overall I had a fantastic time and would highly encourage others to check out and select from Backstreet's offerings for a unique experience."
        }, 
        {
            "index": 296, 
            "rating": "5", 
            "review": "Rewarding Fear Factor Challenge Experience. The Fear Factor Challenge experience was interesting in an unexpected way.My partner's biggest fear is insects. However, he decided to test his limits by signing up for the Fear Factor Challenge. Seeing him so excited about his experience made me excited too.What was unexpected was that the experience of watching Mr Ratana (insect chef) clean, trim, season and fry his insects was very appetizing. So experienced he looked as he fried his insects, it made the insects feel no different from other regular food. Smells really good with the spices too. My partner did the unexpected and partook of the crickets. And... Enjoyed it. And there after went on a rampage with the tarantula and the grasshopper. In his words, \"After you get over the initial shock of looking at the insect and you put it in your mouth, it's actually quite tasty.\" I diligently took mental notes of all the ingredients going with the insects and helped to do the marination of the insects myself. It was an interesting experience. I would be able to fry crickets now if anyone tasks me too! Bring it on. Haahahaahah...The whole experience was very well organised and felt really special. Transport was arranged for us and we travelled through a maze of Cambodian houses before arriving to Mr Ratana's place. Its completely unlike the typical tourist experience as it felt like Mr Ratana is sharing a part of his daily life with us. So much more genuine and personal.Whilst Mr Ratana was teaching us how to fry the insects, his wife was at the side trimming the wings of grasshoppers one by one. And his super cute son was playing with all the live grasshoppers. Its fun playing with his son. Not at all shy and though we didn't speak the same language, fun is an international language I suppose.The facilitators at Backstreet were really nice too. They got us a big bottle of water on their own accord. Samon from Backstreet shared a funny personal story about how he used to catch grasshoppers to sell to hawkers such as Mr Ratana. The facilitators were really fluent in both Khmer and English, so they could translate all our questions to Mr Ratana and translate his answers back to us.My partner became quite addicted to crickets in specific after this rewarding experience. Even craving for crickets to go with wine! Now it's time for Backstreet to come up with a cricket catching course so I learn how to get most vital ingredient to fried crickets. :)"
        }, 
        {
            "index": 297, 
            "rating": "5", 
            "review": "Excellent bracelet making. My friend and I are from Siem Reap. We had very FUN and interesting experience in bracelet making last weekend! The instructors were very friendly, skillful and structured. Also, staffs who came along with us also very helpful as well, show us around workshop and explain history. At the end, we have got bracelet home with our own designed! I would recommend you to try this course!"
        }, 
        {
            "index": 298, 
            "rating": "5", 
            "review": "Delightful evening with Backstreet Academy!. After a tiring day at the temples, me and my partner stumbled onto Backstreet Academy's Khmer cocktail class and thought it might be a nice way to unwind the evening. We were not sure what to expect but decided to go anyway. We contacted them on the day itself and received a prompt response with a confirmation for 6 pm. Communication was not a problem and the location was easy to find. Once we arrived at the place, preparation had already been made and we soon got the course underway. The experience I must say was brilliant. Spices and alcohol mixed together to create a wide mix of cocktails. Some refreshing, some spicy and some simply twists on classics like the mojito and singapore sling. Nonetheless, every one of the cocktails we made delighted our senses. The aroma and the taste was unlike anything you would get out a of glass of cocktail. The instructor, charming and professional, was very knowledgeable and friendly too. Go to the temples, get a massage and end the evening with this inspiring experience!"
        }, 
        {
            "index": 299, 
            "rating": "3", 
            "review": "Massage course. We went on themassage course. Everyone was very charmng and we really enjoyed our afternoon in the company of the massage team who clearly knew alot about the topic. However we think more work needs to go into the course which was more of a demonstration to show us a full cambodian body massage. Although interesting, it was too much to learn in a few hours and I would have no chance of repeating what I saw. That said I would recommend backstreet academy who clearly have thier heart in the right place and will do thier best for you."
        }, 
        {
            "index": 300, 
            "rating": "5", 
            "review": "Unforgettable one off experience- fear factor challenge. In one word, unmissable. If you get the chance I could not recommend this whole company highly enough We did both the horse riding and fear factor challenge in Siem Reap. The horse riding was very professional with the guide fluent in English and very helpful taking us around the town and rice fields for an hour. Fear factor challenge was a highlight with us being taught how to prepare, cook and eat tradional insects by one of the street sellers at his home. It was totally different to any cooking classes we had seen before and so much more authentic. The bugs were totally differerent to what i expected too, tarantulas now a firm favourite. The cook and translators were very knowledgeable and helpful and a good laugh too. Would definitely recommend this experience, great fun and a total one off."
        }
    ]
}