{
    "category": "Siem-Reap", 
    "entity": "Baphuon-Temple", 
    "avg_rating_stars": 4.364383561643836, 
    "review_count": 365, 
    "rating_stats": {
        "poor": 5, 
        "average": 35, 
        "terrible": 0, 
        "very_good": 147, 
        "excellent": 178
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "Exciting. Baphuon temple is a great and requisite temple with sophisticated designs and structure. People usually go there to explore a feeling of inner peace, since when you get there, you would feel no interrupted and feel relaxed. A hidden God is on the wall if you notice thoroughly. That is a great place and can make you excited as well."
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "Children under 12 are not allowed to climb. But they are allowed all the way up the TA KEO which is almost as steep. The view from the top is breathtaking and because of the off-putting climb, there are fewer people."
        }, 
        {
            "index": 3, 
            "rating": "4", 
            "review": "Good historical site to see. Baphuon Temple is part of Angkor Thom and is a huge rectangular building, requiring the climbing up of some pretty steep stairs. At the elevated levels the view is quite good. It is necessary to note where one goes up and to try to get down at the same place (down the same stairs) because going down at another location could get you confused. It is very large and takes a while to walk around once."
        }, 
        {
            "index": 4, 
            "rating": "5", 
            "review": "Nice Temple. This temple is part of Ankoor Wat Temple and very unique. Temples are build using stones. Good to visit with multiple times."
        }, 
        {
            "index": 5, 
            "rating": "4", 
            "review": "Built on Sand. The Baphuon is a huge temple near the more famous Bayon temple, but as it was built in the 11th Century it predates it by 200 years.Originally built as a Hindu temple dedicated to Shiva, it was converted to a Buddhist temple in the 15th Century.The Baphuon was built on sand and was inherently unstable from the beginning, which goes a long way to explaining its sorry state of repair compared to many of the other monuments at the Angkor Archaeological Park. Attempts have been made to restore parts of the temple, but it is a mammoth task.One of the features to look for is a massive reclining Buddha which lies across the entire western wall of the temple. It is also in a sorry state of repair, so you have to look closely and use your imagination to work out its dimensions and shape."
        }, 
        {
            "index": 6, 
            "rating": "4", 
            "review": "Temple climbing. This temple requires some stamina as you have to climb up some stairs. At the top, you can see some beautiful views around compound.One thing to be aware of is there might be some strangers trying to explain things to you here and there. Please ignore them and dont follow their instructions, At the end of the very brief and pointless \"guidance\", they will ask for some money. It is definitely not worth the money for their poor service. Just be careful of it"
        }, 
        {
            "index": 7, 
            "rating": "5", 
            "review": "Well worth visiting. A must see among with many other temple ruins in this area. If you are lucky it is not too crowded. Bring your guide book and take your time."
        }, 
        {
            "index": 8, 
            "rating": "3", 
            "review": "Impressive temple. The view of the temple as you approach along the long walkway is very imposing and rather different from some of the other Angkor temples. My husband went into the temple and the views from the top were definitely worth the climb.....but beware: this temple is not open to children under the age of 12, which our two miniature explorers found a bit disappointing."
        }, 
        {
            "index": 9, 
            "rating": "4", 
            "review": "good view. A good place to explore, but those with leg sick, older, child or less stamina, please avoid this route. Slanting and long staircase from level 1 to level 3, level 4 closed. Nice view from top."
        }, 
        {
            "index": 10, 
            "rating": "4", 
            "review": "Spend a little time here.... Even if you are pressed for time, you can still squeeze this temple in your itinerary since it's along the way to other big temples. Marvel at the foot bridge before reaching the temple. I find the ruins to be nice back drop for a photo shoot, too."
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "Another enjoyable site!. If you don't mind walking and climbing, and if you aren't already \"templed out\", then you have to add this one to your list! All of the temples in the Angkor area are worth visiting, and if you have a guide, even better - the stories in the carvings make it a worthwhile stop!"
        }, 
        {
            "index": 12, 
            "rating": "4", 
            "review": "Impressive, close to Bayon. Those ruins are a short walk from Bayon. Refresh yourself with a fruit smoothie on the way, and head to there with energy enough to climb the steep stairs that lead to the top of the pyramid (take care to not fall). It is interesting to know that on ancient times this pyramid rivalized with Bayon as the most impressive temple in the area."
        }, 
        {
            "index": 13, 
            "rating": "4", 
            "review": "Good Physical Challenge. This was one of my favorite temples in the area. The bridge walk to the main structure was a nice stroll. The stairways to the top of the temple were a bit more of a challenge. The structure has a good feeling about it and helps one appreciate the effort it took to put such a building together."
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "Shouldn't miss. Yeap, it is great. Unique experince that one should not miss. You will not be dissapointed... Amazing place."
        }, 
        {
            "index": 15, 
            "rating": "4", 
            "review": "Huge Temple. Long walkway leads up to this beautiful temple. Steep stairs to get to the top but worth the effort to see the magnificent views."
        }, 
        {
            "index": 16, 
            "rating": "4", 
            "review": "Must do temple. this is a must view area for a photography I had some GREAT shots here early morning. So start here away from the crowds While many are out front of ankor wat this is a great area to get some shots early."
        }, 
        {
            "index": 17, 
            "rating": "4", 
            "review": "Worth a visit. Generally once you buy your ticket for Angkor Watt you can travel to these other attractions on the same ticket, so take them in as they all have something to offer"
        }, 
        {
            "index": 18, 
            "rating": "5", 
            "review": "Surprisingly beautiful. When I was figuring out which temples to visit, a guidebook I was using didn't list Baphuon as a priority. I ended up stopping by on the way to Bayon, and wow. I'm so glad I did.The walkway to the temple is a spectacle in and of itself, and the main level inside of the temple has some interesting features, including the rock stools (that's what I call them, anyway). The view of the grounds from the highest accessible level was breathtaking.After being out and about for the whole day, I'd been a bit tired, but Baphuon woke me right up and reminded me: Dude. You're in Angkor.Don't pass it up!"
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "Lovely temple. Another gem of a temple in Angkor Thom that's well worth spending time in. Really beautiful architecture."
        }, 
        {
            "index": 20, 
            "rating": "5", 
            "review": "My favourite among the 4-5 temples that I visited. Baphuon Temple is a great sight in comparison to the more well-known temples in Angkor Thom and the surrounding region, because it has less people and a FANTASTIC view at the top! My tip is to start at the front, walk down the elevated processional walkway (great for catching a cool photo of orange-clad monks hurrying down it) and admire the grounds in front, then find your way to the top. When I went, I was the only one at the top for several minutes, and the view of the pounds, processional walkway, and the building itself was the best one I had among the ruins of Siem Reap!"
        }, 
        {
            "index": 21, 
            "rating": "5", 
            "review": "Amazing climb for amzing clicks. Quite an experience walking the long path leading up to the temple, the steep stairs climbing up, taking some excellent pictures and catching some quite rest in the shade in a corner"
        }, 
        {
            "index": 22, 
            "rating": "4", 
            "review": "Impressive temple-mountain. Coming just after a visit of the Bayon, what is striking is: much less tourists and more rustic wall decoration. The steps to the higher platforms are so steep that guards will prevent access to children less than 12 years old. The views as you ascend gets better and better and the whole visit is rewarding. At the end of the circuit you’ll pass by the huge Reclining Buddha, barely visible in the supporting wall of the (ruined) pyramid."
        }, 
        {
            "index": 23, 
            "rating": "5", 
            "review": "So very pretty. All of the temples in Siem Reap are truly extraordinary and Baphuon Temple was no exception. There are a lot of stairs at this temple, but even if stairs were a problem for you then the landscape views from afar are worth the visit."
        }, 
        {
            "index": 24, 
            "rating": "5", 
            "review": "Don't Miss out on this one!. A lot of people might miss out on this one as there are other more famous attractions within the ancient city of Ankor Thom. This temple is one of the most difficult to restore as the foundations of this were largely destroyed when they tried to convert this Shiva temple into a Buddhist temple in 15th century. You can observe a reclining Buddha that was attempted to mark this transition. Amazingly steep steps lead you all the way to the top and are a great workout. The size of each step is also astonishingly small ."
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "beautiful. walk there from bayon and admire the elephants at the terrace. recently restored and very different style from angkor watt"
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "Remember you have to wear a nice uniform.. I and my wife live in siem reap. We enjoyed this temple very much. Nice place to see in Angkor Thom temples. This temple is required you to wear long clothes. Should be under you knee and on your bowl."
        }, 
        {
            "index": 27, 
            "rating": "5", 
            "review": "Beautiful temple - brace yourself for the near vertical climb . This temple is part of the Angkor Thom complex and you will see it if you take the small temple tour. It is connected by a stone terrace to the terraces of the elephants and leper king. It's a three tiered temple. There are stairs which are nearly vertical so be careful and don't wear flip flops. One thing I remember vividly is all the dragonflies floating around. Thousands of them. It was hypnotic."
        }, 
        {
            "index": 28, 
            "rating": "3", 
            "review": "Worth sparing some time . Part of Angkor Thom complex, this temple is not so famous, not frequently visited compared to its neighbor. It's a shame since you can go on top and have a nice view, apart from this, there is a very pleasant forrest walk to another one just north from Baphuon. "
        }, 
        {
            "index": 29, 
            "rating": "5", 
            "review": "Put it on Your List of Things To See. Fascinating stone carvings produced many centuries before power tools were invented. Try to go with a guide who can set the historical context and provide an explanation of the carvings."
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Good temple. unusually shaped building with nice views. Lovely walkway to get to it through ponds. set back from other larger temples but still lovely."
        }, 
        {
            "index": 31, 
            "rating": "4", 
            "review": "Another great temple must see. Beautiful temple, It has lots of very steep stairs but it wasn't too hard to climb, beautiful view from the top, visited right after Bayon, definitely worth it!"
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "Wonderful Mesmerizing Pyramidal Construction--Worth Visit. Baphuon temple ,originall built dedicated to Hindu God Shiva, will be the second spot in Angkor Thom Complex after visiting Bayon Temple . the Baphuom Temple Complex is fantastically built in a pyramidal structure the long path walk way from main entrance leading the temple is beautifully built in a elevated platform . There is a swimming pool tank at the left side of the walk way to harvest water during the ancient regime. The temple is so precisely engineered in such a manner the structure's base is built heavily and broadened in a three tier -structure , Its requires a knee breaking job to climb the pinnacle of the temple top crest , where we can take some of the breath taking views and photograph of the temple tombs , leapers. At the rear side of the temple we can see a huge reclining statue of Bhudda , which is simply amazing and the spectacular construction of the face of Buddha by assembling huge stones and carving it but it is incomplete . The temple has been restored using Anastylosis method. Most of the temple rumbled and collapsed stones was dismantled and the hundreds of thousands of stones laid out and numbered and re-assembled and erected to complete the structure . The unstable base of the monument was reinforced. Several decades of restorations took place and the Baphuon was opened to the public . Its really a marvelous engineering that Khmer King Udayadityavarman II has evolved centuries ago in Erecting such a magnificent Three-tired temple in 11 th century."
        }, 
        {
            "index": 33, 
            "rating": "4", 
            "review": "Beautiful temple!!!. This was not my favorite temple to visit however they all deserve a visit. It is incredible to have such a complex centuries old construction."
        }, 
        {
            "index": 34, 
            "rating": "5", 
            "review": "You will see it.... You will see it as part of Angkor Tom...it is part of any standard tour...so it gets the same review."
        }, 
        {
            "index": 35, 
            "rating": "4", 
            "review": "Beautiful. I'm such a sucker for architecture site and temple and for me, every temple is worth the visit and if you need to climb to get to the top, go climb and see the view yourself."
        }, 
        {
            "index": 36, 
            "rating": "4", 
            "review": "Worth a visit. Much quieter than main temples. Set in beautiful surroundings. Much restoration to do as dismantled and then records of where stones to go were destroyed by Khymer Rouge. Many dangerous stairs but worth the climb to top. Lovely walk around temple."
        }, 
        {
            "index": 37, 
            "rating": "5", 
            "review": "Simply beautiful. This is a simple but beauiful temple. Never miss this site. Great for photo ops. Hope you visit Siem Reap when it's not too hot."
        }, 
        {
            "index": 38, 
            "rating": "4", 
            "review": "Baphuon Temple at Angkor Tom. This temple is near to the Bayon Temple. This temple is surrounded by many big trees. To reach the top, you need to climb using the wood ladder and you must be careful. On the top, you can see the beautiful nature around this temple."
        }, 
        {
            "index": 39, 
            "rating": "4", 
            "review": "Giant Pyramid of South East Asia... not for a rainy day!. The Baphuon Temple is in the heart of Angkor Tom. This should be visited after the Bayon temple. The climb here is steep, and proper shoes are required.Do not visit this attraction on a rainy day as you will be sorely disappointed. The slippery nature of the climb makes it dangerous to attempt this on a rainy day. I was disappointed for not being able to climb due to the rain."
        }, 
        {
            "index": 40, 
            "rating": "5", 
            "review": "Fantastic!. When I visited Bayon, I was also able to visit Baphuon, that is located on the northwest side of Bayon. You can go up to the higher level as they have provided timber steeps that make the climbing easier. It is a fantastic view fro the top and a must do climb. when hot is very tiring but carry plenty of water."
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "mesmerizing. surrounded by the forest with their sky scrapper trees this temple stands majestically amidst it. the steps are steep and is exciting to climb it. the view form the top is mesmerising. soak in the environment as much as you can!"
        }, 
        {
            "index": 42, 
            "rating": "4", 
            "review": "suprising. first thought was a pile of rubble but opens up to the amazing hidden secrets in history..look out for the squirrels"
        }, 
        {
            "index": 43, 
            "rating": "4", 
            "review": "One of the temples to see if you're checking out Bayon.. Looks majestic especially when viewed from the walkway leading to the temple. The view from the top is glorious although the steps going there are plenty and kind of steep.The only thing I didn't like is that you can't go back the way you came in once you're at the top because you have to exit through the opposite direction. This is a bit of an irritation when you've been walking all day and plan on seeing just this particular attraction but is forced to go through all the other temples."
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "Temple. Awesome to see & appreciate just amazing what was built so long ago without machinery to assist worth the time to visit."
        }, 
        {
            "index": 45, 
            "rating": "4", 
            "review": "Lovely temple. This is a lovely and ancient temple in the Angkor complex. We enjoyed walking through, and we very much enjoyed seeing history come to life. Great photo ops, too."
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "Walk along the causeway!. One of my other favourite sites was built by Udayadityavarman II in 1060 as his state temple. It's current state of being something of a ruin should not elude from how important this temple pyramid was. I particularly liked walking across the causeway supported by many fine pillars. A word of warning, climbing to the top and back down again is quite a feat as the stairway is very very narrow in length."
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "Climb to the top!. Worth the climb up to the top of this just for the view. It is very steep though, so bring good shoes!!"
        }, 
        {
            "index": 48, 
            "rating": "4", 
            "review": "more temples more rocks... on a hot and humid day, the temples do loose their historic lustre, and starts to feel like a severe excercise in endurance and dehydration. Hats / water / good shoes.. all required to climb through here to be rewarded with stunning views of the complex and the creeping jungle."
        }, 
        {
            "index": 49, 
            "rating": "5", 
            "review": "Don't rush. Take your time and don't miss any of it. I wander off alone and the feeling of the past is so present. The jungle is alive, the temples are amazing."
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "Finally restored, now one of the more interesting structures at Angkor. Baphuon used to be more or less a big mess of looted stones that seemed to follow no particular structure. Now it has been restored and turns out to be one of the most interesting complexes of central Angkor. Go there in the late afternoon and you will enjoy the special light, and no other tourists around you!"
        }, 
        {
            "index": 51, 
            "rating": "4", 
            "review": "Neat recently restore temple!. Baphuon is a short walk from Angkor Thom, so we went there right after. While Angkor Thom was more spectacular, we really enjoyed climbing this temple and walking around it! A great stop to make!"
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "Worth see it!. Another great temple worth to see it! You can climb high enough for nice view. Just enjoy the visit and climb up the temple"
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "Right beside Bayon, dont miss it! Another temple climb challenge!. It is just 3mins walk from Bayon. On your long walkway into temple, you can see local kids happily playing in pond (now become their play pool)..you instantly feel local ( and happy) too! Do wear appropriate clothing, the guard religiously checking my short sleeves whether length was too short! Strictly no bare shoulders and no shorts above knee. I saw visitors asked to leave and its such a pity, cuz the temple top was amazing."
        }, 
        {
            "index": 54, 
            "rating": "5", 
            "review": "My personal favorite of so many gorgeous temples. It's the Wandering Yank here. Mrs. Yank and I spent 3 wonderful days touring the Angkor area. We saw all of the best-known temples, plus several off the beaten track (thank you, our excellent guide). Why was this my favorite? It wasn't the fact that it wasn't nearly as crowded as adjacent Bayon, although that was a very good thing. It wasn't the view from the top of the stairs, although it was very rewarding. It was the outline of the reclining Buddha which one can only see near the exit. It was almost eerie, and a reminder of the stages this complex has gone through over hundreds of years. Very cool.2 thumbs way up!"
        }, 
        {
            "index": 55, 
            "rating": "5", 
            "review": "Huge pyramid-like temple accessed from a terrace risen from empty pool. It is a huge and amazing temple of pyramid style. It is accessed from a long terraced path which is used to serve as a bridge on a pool of water. The stairs to the top are very steep but there is a newly built wooden steps, less steep, on one side. Highly recommended. Do note, there was a local boy trying to collect signature of tourist. I doubt he was trying to beg. Say no thanks, and ignore him."
        }, 
        {
            "index": 56, 
            "rating": "4", 
            "review": "Baphuon temple. considered to be one of the grandest of the angkor temples, Baphuon was a hindu temple. it can be approached by a raised walkway and has four gateways decorated with bas reliefs depicting scenes from the hindu mythology of ramayana and mahabharata."
        }, 
        {
            "index": 57, 
            "rating": "5", 
            "review": "Huge site.. Baphuon Temple is a very big site. There are simply so many fabulous temples in this huge area. All of them truly spectacular."
        }, 
        {
            "index": 58, 
            "rating": "4", 
            "review": "I enjoyed the reclining budah and my wife loved the child free view from the top!. So this is not the most beautiful of temples in the area but it still has presence. You could easily take a decision not to spend the time walking to it and or up it, but both are worthwhile. Given the stairs etc this was not a child friendly temple and in actual fact they were not aloud up. However the kids and spent time exploring the surrounds and really loved it - from the back their is a huge reclining budah that you could easily miss if you didn't know it was there. My wife on the other hand climbed to the top. She talked of it being extremely peaceful and serene with a beautiful view of the jungle canopy. She said there were butterflies and she enjoyed it very much. Id say its one of the understated temples of the area, right near some of the favourites so worth the investment of an additional 30 minutes to check it out."
        }, 
        {
            "index": 59, 
            "rating": "4", 
            "review": "In Angkor Thom. If you are already visiting the ancient city of Angkor Thom then it is worth seeing this temple. It has a 'pyramid' style and has undergone a great deal of restoration."
        }, 
        {
            "index": 60, 
            "rating": "3", 
            "review": "Not my favorite, steep climbing. We went to this temple directly after Bayon (it's right next door) and I have to say, it was certainly my least favorite temple. It's on the small side, and there's not much to see. That being said, I definitely say \"go!\" if the weather is on the average side - we had just spent a long time at Bayon and were totally overheated, and Bayon is so grand and stunning that going directly here in 100+ degree heat in direct sunlight was not the best time. Also, a minor warning: There are a decent amount of steps in the temple, which wouldn't be as much of an issue if they weren't so steep. One of my friends chose to climb them on \"all fours,\" whereas I needed to hold onto both railings to feel secure. The way up is steep, but keep in mind the way down is an identical set of stairs - you need to take them very slowly and carefully or you could easily slip and fall. We are all in our 20s and this was manageable for us, but could be bad for young children and older people."
        }, 
        {
            "index": 61, 
            "rating": "5", 
            "review": "Baphuon Temple. This temple is situated inside of Angkor Thom and is an awesome temple to visit. It has a lot of very steep steps so if you don't have good footing you should definitely take care when climbing the steps.The view from the top of Baphuon temple is breathtaking and be sure to go round the back to see the awesome reclining Buddha statue. you may miss it because it is not an actual statue but built into the temple itself."
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "Just go!. Love! Love love! This place is a must see, for one time pass fee, you get to see as much temples as you want. Everything is amazing!"
        }, 
        {
            "index": 63, 
            "rating": "3", 
            "review": "Active temple. Over 12s only because of steep steps. Guards also ensure no bare knees and no bare shoulders for men and women since this is an active temple.Not so much to see at the temple, but good views of the surroundings."
        }, 
        {
            "index": 64, 
            "rating": "4", 
            "review": "Still worth a visit. It belongs to group of temples in Angkor Thom and worth to visit as well. You will have a nice walk from Bayon temple. This small temple is opposite to Phimeanakas, located in Angkor Thom northwest of the Bayon temples, to get the bigger temple Phimeanakas you will pass Baphuon first. If you stood on top of Phimeanakas you'll have a nice view of the Baphuon temple. This temple was built around 1150 AD by King Udai Adityavarman II, he dedicated the temple to the Hindu god Shiva. In the 20th century a large part of the temple collapsed, inter alia earthquakes. In 1960 there has been an attempt to rebuild the temple, but when this was not allowed by the Khmer regime. They have made a second attempt in 1996, but this failed. In 2003 it managed and restored much of the temple. As archaeologists did not have the location of all the stones not everything could be restored."
        }, 
        {
            "index": 65, 
            "rating": "5", 
            "review": "Brilliant. See this as part of a tour of all the temples, such as Angkor Wat, Bayon and Ta Prohm. We visited them all in one day with a private guide. It could easily be spread over 2 or even 3 days. I thoroughly recommend having a guide as it adds a lot you might otherwise miss out on."
        }, 
        {
            "index": 66, 
            "rating": "5", 
            "review": "lots of stairs. lot of stairs to get on a top so if you are lazy or have problems with your healt condition just look at this one from the street"
        }, 
        {
            "index": 67, 
            "rating": "3", 
            "review": "Looks similar. Once you've seen the main Angkor temple, the others are very similar. The museum has very good preserved and labelled statues."
        }, 
        {
            "index": 68, 
            "rating": "5", 
            "review": "A large temple located in Angkor Thom. Should be on your to do list after Angkor war. Angkor Thom has several major temples (Bayon, Phimeankas, Elephant Terrace and more) and sites and temples and is well worth investing your time at this site."
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "Amazing architecture. This was but one of the twelve or so temples we visited over a three day period. This was one where the dress code was policed so my daughter and I couldn't go n. We walked around the back and waited for the remainder of our party and had a good view of the lying down Buddha."
        }, 
        {
            "index": 70, 
            "rating": "4", 
            "review": "Interesting. We were too exhausted to go inside this temple but it was really nice to look at from a far under a shade of the tree. Per our guide, the place does not have sculptures unlike others. We were contented looking around at it, observing people and monks walking around."
        }, 
        {
            "index": 71, 
            "rating": "5", 
            "review": "Amazing. Came upon the section of the Temples on our tour of Angkor Wat and Thom, beautifully sculptured, which fascinates the mind. Well worth visiting this part of the site"
        }, 
        {
            "index": 72, 
            "rating": "4", 
            "review": "Nice Temple. A really big temple just across the elephant terrace. One of the nicest temple in Angkor Thom. You can just walk from Bayon to here, and ask your tuk2 driver to pick you up at elephant terrace just like what I did"
        }, 
        {
            "index": 73, 
            "rating": "5", 
            "review": "Magnificent!. This particular Temple was very impressive. The sheer size of it and the climb to the top was epic, especially in the heat... And i was there early morning. One of my favourites for sure in the whole complex."
        }, 
        {
            "index": 74, 
            "rating": "3", 
            "review": "wonderful. Great example of the type of temples in Angkor our ramrook driver was so knowledgeable he recommended we stop her , worth the time , plenty of photo opportunities and like all other temples walking and climbing steps is on the cards."
        }, 
        {
            "index": 75, 
            "rating": "3", 
            "review": "No kids inside the temple. This was apparently one of the most spectacular temples in its heyday but only adults are allowed in now due to safety precautions so we admired it from the 200m long elevated walkway. We liked the jigsaw restoration story of Baphuon so was disappointed my 8 yro couldn't go inside. Its called the world largest 3d jigsaw because it was totally dismantled piece by piece (300,000 blocks) as part of the restoration process in 1960 but due to the civil war the project was abandoned for 25 years and the plans were lost. In 1996 they started again and took 16 years to fit all the pieces back together !"
        }, 
        {
            "index": 76, 
            "rating": "4", 
            "review": "Simple yet mesmerising. The Baphuon Temple is a Hindu Temple and I was told that it has inspired the creators of the then-famous iPhone game, Temple Run. As I walked into the temple, I am able to imagine where the creators got their imagination from. There is a platform towards the temple which is surrounded by water and there are trees surrounding the building. This temple is smaller and has simpler artwork compared to the Bayon Temple. As you are climbing up the tower, be sure to watch your step and make sure you wear decently during your visit."
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "One of our favorite Angkor temples. This was one of our favorite temples in the Angkor complex. Maybe because it wasn't as crowded as the others. Maybe because it was so tall and we practically climbed to the top. In any case, if you're close to it, I recommend spending some time at this one."
        }, 
        {
            "index": 78, 
            "rating": "5", 
            "review": "Amazing Temple....... This is a very beautiful and amazing looking temple. This temple is large and well preserved for the age. Definitely a must see with beautiful design and architecture."
        }, 
        {
            "index": 79, 
            "rating": "2", 
            "review": "Children under 12 not allowed!. I am not able to review the temple itself as I was not allowed in with my children. This was my own fault, as I had not researched this particular temple and we simply stopped on a whim on the way back from the other temples we had planned to see. I am giving a 2 star review only to help others from making the same mistake. Do not plan to go unless your kids are 12+. Our boys were very disappointed."
        }, 
        {
            "index": 80, 
            "rating": "4", 
            "review": "not as amazing as the Bayon, but well worth a visit. Very interesting to see. This temple is at this days a working temple, so children and pregnant woman may not enter. Every visitor need to be well dressed (no shorts ore naked shoulders). It's a climb to reach the central temple, but it is worth to do so."
        }, 
        {
            "index": 81, 
            "rating": "2", 
            "review": "absolute must to visit. Take your camera and wear good walking shoes, there's lots of walking, we went early morning, so as to miss the heat of the day, well worth it, and dont forget water you, ll need it."
        }, 
        {
            "index": 82, 
            "rating": "4", 
            "review": "Amazing Scenery and Good Photo Spot. It's high temple and you must climb steep steps, even they already constructing wooden steps. The original steps will be almost impossible to step up. It's located next to Bayon Temple, so you just need walk a few to reach it.If you came here at summer, make sure you're well hydrated since the site are big and the weather is very hot and dry."
        }, 
        {
            "index": 83, 
            "rating": "5", 
            "review": "Amazing view from top of this temple. One of the few famous temples inside Angkor Wat temple complex, just behind Bayon temple.Quite a steep ascent to the top of the temple, go slow, steps are narrow and steep. Once at the top, the view is amazing, worth the effort. Though the temple is surrounded by nice greenery, however at the top of the temple it is quite sunny and it is difficult to stay long without cap/ umbrella. Comfortable walking shoes are recommended, high heels are certainly a no no. Descent from the top is equally steep, some people prefer walking backwards down, so plan your backpacks and hand held items accordingly as both the hands might be required for backward descent. It is difficult for young children, parents should accompany them all the time. Ticket in included in Angkor Wat temple complex pass."
        }, 
        {
            "index": 84, 
            "rating": "5", 
            "review": "Amazing view. You have to climb up very steep steps to get to the top but it's worth it. The view on top is amazing."
        }, 
        {
            "index": 85, 
            "rating": "4", 
            "review": "Baphuon. My favourite temple in the Angkor Thom complex. You can climb to the very top and survey the sights. The steps to the top are quite steep but worth it."
        }, 
        {
            "index": 86, 
            "rating": "5", 
            "review": "A different temple from Ankor Thom. A different temple from Ankor Thom that deserves the tourists attention as much as Bayon temple. It is the only temple where tourists are not allowed if knees and shoulders are not covered. My wife and many others had only a \"limited\" T shirt with short sleeves so they were simply not allowed inside. On the back side a very interesting reclining Buddha is built in the wall."
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "One of my favourites. The promenade up to the temple is impressive and the view from the top is not too shabby. Not as crowded as some of the other temples which makes it all the more enjoyable."
        }, 
        {
            "index": 88, 
            "rating": "4", 
            "review": "I found the walk in to be the best part.. I visited in January which is the dry season and I don't know if this is ever full of water like the elevated walk would make you think it may have been - but that would very impressive to see. I enjoyed the stroll up on the elevated walk and you can climb to the top and enjoy a view of the surroundings below but I honestly found it a little underwhelming up top. The stairs are very steep and while I hustled down them several older or scared people where taking quite a bit of time making there way up and down - could be a problem if it was crowded."
        }, 
        {
            "index": 89, 
            "rating": "4", 
            "review": "Baphuon Temple. Temple has an impressive promenade leading up to it. Most impressive feature is the shape of a reclining buddha around the west side of the temple. One really have to focus on it to see the outline. Good portion of temple was out of bounds, however still an interesting site. Temple located within Royal compounds."
        }, 
        {
            "index": 90, 
            "rating": "5", 
            "review": "Climb a mountain!. A very impressive temple in the Angkor Thom complex and one that you can climb too! The views from the top are pretty impressive and as others have said make sure you dress appropriately.There is supposed to be one way up and one way down so please make sure you read the signs and don't be one of those tourists who goes up the down stairs and causes a jam. On your way out don't forgot to see the huge sleeping Buddha on the backside of the temple！"
        }, 
        {
            "index": 91, 
            "rating": "3", 
            "review": "Do not Go there to Try to Watch the Sunset!. The word is out that this is one of the best places to watch the sunset. The result, amusement park type lines of people waiting to get a view of the sunset. Too crowded & a fairly long walk uphill to get to the coveted, best sunset spot. You probably won't get in unless you're willing to camp out a few hours before sunset. Don't waste your time. "
        }, 
        {
            "index": 92, 
            "rating": "4", 
            "review": "Quieter and really enjoyable. I really enjoyed visiting here if only for the fact that there were far fewer other visitors than the other major sites. The temple is in a fairly ruined state there is still plenty to see and you can get a good impression of what it would have been like. From the entrance there is a long promenade up to the pyramid of the temple which is fully accessible to climb. With there being fewer other visitors you get the opportunity to find your own space.The exit is at the rear and the return path takes you around the outer wall of the temple through the trees. On the one hand it's a bit of a trek in the heat but, equally, it's quite a pleasant walk."
        }, 
        {
            "index": 93, 
            "rating": "4", 
            "review": "Strict dress code, a lot of climbing, but one of my favourites. We went to almost all of the temples in the Angkor Wat area, so I think it's right to say that this temple has one of the highest staircases in the area. There are 2 tall flights of steps, and it's a steep climb up. It's a good challenge if you're acrophobic. We didn't read up on this temple, so it was a pleasant surprise to discover that the entire temple was a reclining Buddha when viewed from the back, after climbing down. Do note that the dress code is very strict - we sat near the entrance when taking a rest, and many female tourists were turned away. Some tried to wear long skirts in front of the guards, but they were still denied entry. Best to cover up shoulders and knees before going near the entrance (and the guards). Male tourists were also denied entry when they wore mid-thigh shorts/FBTs."
        }, 
        {
            "index": 94, 
            "rating": "4", 
            "review": "Impression after impression. The Angkor Thom area generates impression after impression. After the extensive visit to the Boyon Temple, the next visit of the Angkor Thom tour was to the Wat Baphuon. The Wat Baphuon is an impressive temple, but with very steep steps. The size and architecture is a bit overwhelming. See my picture."
        }, 
        {
            "index": 95, 
            "rating": "5", 
            "review": "A steep climb, brilliant views, strict clothing policy, calming and dragon flies at the top!. This was a surprise for me, I really enjoyed this temple on the way to Bayon Temple. In fact I preferred it to the over crowded Bayon Temple. A steep climb and I couldn't believe the butterflies and dragon flies. It was such a calming experience at the level of the trees and wonderful views and I could have stayed all day. Stunning and a must climb, although scary coming back down again. Elephant terrace is so close too :-)"
        }, 
        {
            "index": 96, 
            "rating": "3", 
            "review": "Not unmissable . Part of our tour of Angkor Thom, we went to have a look here. Unfortunately, my girlfriend couldn't get in (scarf over bare shoulders is not allowed, so I went in for a quick run. The temple is not exceptional, not too much decoration, but the view from the top is nice."
        }, 
        {
            "index": 97, 
            "rating": "4", 
            "review": "Mighty and daunting. This is pyramidal in shape. The steps are very steep and not to be recommended to the elderly and to children. And yet, we, in our seventies, managed it very well. Do visit the Terrace of the Elephants and the Leper King nearby."
        }, 
        {
            "index": 98, 
            "rating": "4", 
            "review": "A good climb. The stairs which lead to the temple was quite steep. Children under 12 are not allowed to enter. I personally enjoy visiting Baphuon, though 30min-1hr was quite enough.If you have a bad knee, or have a fear of height, maybe you can skip this place."
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "Temple mountain. Situated inside Angkor Thom, this temple has scenes carved in small squares. Unfortunately most of them are faintly visible due to deterioration and poor upkeep."
        }, 
        {
            "index": 100, 
            "rating": "5", 
            "review": "Remember to dress \"properly\". Amazing structure, absolutely stunning spot for photos, comparatively less crowded (we were there at around noon), but very very strict dress code - girls cover your shoulders, no vest, no shorts, must cover your knees. Our guide Kheng Yon reminded us about this and I got a skirt from the local shop for 5 usd. We bumped into an Italian girl who was wearing shorts and vest, and was turned away by the guards :( luckily she has got a sweater with her, therefore I lend her my skirt - ta daa the guard was finally happy to let her in! Strict strict strict code here"
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "Make sure to visit the back of the temple. A simple temple compared to the others but definitely worth a visit.Take the walk to the top of the temple and go around to the back to see the entire layout. Not many people visit here since it doesn't seem like there is much to see from the entrance but they are missing out. Don't be one of the masses and pass this by.Take in all the sights around the temple to enjoy it fully."
        }, 
        {
            "index": 102, 
            "rating": "4", 
            "review": "Simple but beautiful . This temple lacks the carvings of other temples but is still worth a visit. You will have to climb a lot of steep steps to get to the top, but it gives you nice view of the whole complex. The reclining Bhudda near the exit is pretty incredible.The temple closes at 5pm. When we arrived at 4:45 we were not allowed in and had to come back another day."
        }, 
        {
            "index": 103, 
            "rating": "5", 
            "review": "Angkor Tom. It was raining again so I did not spend as much time as I might have. Also, most say to visit this temple FIrST. I did not follow their advice, and was not up to a lot of exploring by this time. I did find the carvings fascinating and the altars colorful. (some set up inside-not large.)"
        }, 
        {
            "index": 104, 
            "rating": "5", 
            "review": "Great. Another overlooked temple it is wonderful, albeit, there is some considerable climbing. It has a rather different feel from Angkor."
        }, 
        {
            "index": 105, 
            "rating": "3", 
            "review": "Strict Jobsworth At The Front Gate. Be sure to adhere to the dress code as, regardless of your gender the guard will not allow you access if you are not dressed appropriately. This happens no where else in the entire Angkor area but this guy deems it necessary to put himself in the way of your enjoyment on what could potentially be your only day to enjoy this temple.That being said there is something cathartic about seeing a man unable to gain access to a temple, this hasn't happened anywhere else in SE Asia to date.I went up and my fiancé sat with the other people who were rejected entry and it was good although a lot was blocked off."
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "Wait to the surprise at the end. The back of the temple was so unique it made the visit there extremely special. Walking it and then through the back getting to the terrace of elephants was truly unique and also quiet. I guess not many people do that so that in itself makes it worth it."
        }, 
        {
            "index": 107, 
            "rating": "3", 
            "review": "Whole day temple visit. The temple is nice if you're following the whole map of Central Angkor Thom. hut of course if you wi compare this to Angkor Wat and Ta Phrom, it's smaller"
        }, 
        {
            "index": 108, 
            "rating": "4", 
            "review": "Just beautiful! One of our favorites.. We saw a number of females being denied access to Baphuon Temple because of the way they were dressed. It doesn't matter how many thousands of miles you flew to get here. The dress code is strictly enforced: Female shoulders and knees should be covered. Bringing shawls does not help. The guards' reasoning is clear: there are so many steps to climb, and if you're not decently dressed, you would be exposing body parts unintentionally and unnecessarily. After all, it's a temple which accords respect."
        }, 
        {
            "index": 109, 
            "rating": "5", 
            "review": "Tall and impressive . This is a very tall temple that reminds me of a pyramid, young children are not allowed to climb it and you will also need to wear long pants due to their religious beliefs."
        }, 
        {
            "index": 110, 
            "rating": "4", 
            "review": "Keep in mind that children under 8-10 are not allowed to climb!. We were early in the morning there, but we missed some time while waiting at Bakan's queue, (approx 30 minutes) so we decided not climbing to the top. Obviously it is worth trying, but you can always skip it! This temple is very close to the Elephants' terrace and you can still walk it on the ground easily. Keep in mind that children under 8-10 are not allowed to climb!"
        }, 
        {
            "index": 111, 
            "rating": "4", 
            "review": "Unique and impressively large. The elevated walkway was just the start of unique details with this temple.It is impressive in it scale and also very steep. They did not allow my 5 and 7 year old to climb which frankly I was grateful for as it really was very steep and once you got up the top, not roped off or secure and very easy to take a tumble off.Great views of the complex from the top and also some impressive carvings.At he back, they have taken some bricks from the original temple and tried to construct t a reclining Buddha. It kind of bulges out from the building!"
        }, 
        {
            "index": 112, 
            "rating": "2", 
            "review": "Can't take children under 12. We were disappointed when they turned us away with our 8 year old child. They said it was too steep, but we had climbed many others the day before that were treacherous with no problem."
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "Awe Inspiring. A fantastic pyramid like temple, looks huge close up. It is part of Angkor Thom and very near Terrace of Elephants and other sites. The only downside is that they do not allow children under 12-13 to climb up the temple, so our 8 year old could not go up."
        }, 
        {
            "index": 114, 
            "rating": "3", 
            "review": "Beautiful Temple, pity our 11 year old could not enter.. Unfortunately, I had to wait outside with my 11 year old while my husband and 13 year old daughter visited. I think age restrictions need to be reviewed. I understand there are some steep parts, as there are at Angkor Tho, which my son was able to climb. I am sure an 11 year old could manage the step stairs much better then some of the 60+ tourists we say around the temples attempting to climb the steep steps."
        }, 
        {
            "index": 115, 
            "rating": "4", 
            "review": "Great temple - reclining buddha at the back. This temple is in the Angkor Thom complex and is one of many! You can climb to the top (if you don't get sunstroke first) and the views are lovely. Steep steps. There is a reclining Buddha at the back of the temple that you could easily miss, but once you keep looking at it, it will take shape eventually. There is a lovely long walkway to get to the temple and if you've got time, definitely worth a visit."
        }, 
        {
            "index": 116, 
            "rating": "5", 
            "review": "Gorgeous views! . The view on the bridge to the temple helps you to realize just how large it is. This has many steps, so certainly recommended for someone that is good condition. At the top there is a slight breeze which makes the sweat worth it, alongside the view!"
        }, 
        {
            "index": 117, 
            "rating": "4", 
            "review": "Respect Dress Code When Visiting Temples. I like the drama of the long walk on the bridge heading to the main temple. I got few good shots from the far view alone.Tip: be prepared to climb. The main structure is like a huge building of staircases, all going to the center top. The solid proportion and angular structure makes the site pleasing and easy for photography, if you into it."
        }, 
        {
            "index": 118, 
            "rating": "4", 
            "review": "Good to see but steep steps, not for the faint hearted . Enjoyed our walk round the temple and climbing to the highest allowable point. But stairs were steep and got a little crowded at points. Buddha was interesting to see."
        }, 
        {
            "index": 119, 
            "rating": "4", 
            "review": "Climb as high as you get !. At start pretty basic temple with (yet again) amazing story. Highly recomend to climb as high up as they allow, really nice to see the temple area from a different angle. The stairs are steep!!"
        }, 
        {
            "index": 120, 
            "rating": "4", 
            "review": "Nice temple. Nice temple and depending the stage of your visit, it may end up being a case of too many temples. Still worth a visit."
        }, 
        {
            "index": 121, 
            "rating": "5", 
            "review": "My favourite!!. Of all the temples, this was my fabourite. The most beautiful, tallest and atmopheric temple there is."
        }, 
        {
            "index": 122, 
            "rating": "5", 
            "review": "Again visited as part of the mini tour. Visited as part of the mi ni tour and was as magnificent as the rest of the temples. Get a Tuk Tuk to make it easier to visit and you wont be disappointed."
        }, 
        {
            "index": 123, 
            "rating": "5", 
            "review": "Beautiful and great walk between waters. Magnificent, worth a visit. Make sure to include in your list of priorities of Angkor Wat visits. Great walk between waters."
        }, 
        {
            "index": 124, 
            "rating": "4", 
            "review": "One of the oldest temples. Located on the west side of Angkor Thom, the Baphuon is one of the oldest temples in the city that existed before the Angkor Thom itself. Climbing up to the top of Baphuon offers visitors great view of the surroundings."
        }, 
        {
            "index": 125, 
            "rating": "4", 
            "review": "Many stairs. We visited many temples during our stay and this temple is one of those temples with a lot of stairs. So, if you're planning to visit this, make sure you have enough water with you and wear enough coverage to protect you from sunburn!"
        }, 
        {
            "index": 126, 
            "rating": "4", 
            "review": "Part of Angkor Tom Complex. Take your time to walk through this complex of at least 3 main structures and ancient palace grounds. Very interesting. Make note of the \"Sleeping Buddha\" on the back side of the main structure - it may be a bit obscure but it is indeed visible in the constructions lines of the building - pretty neat!!"
        }, 
        {
            "index": 127, 
            "rating": "4", 
            "review": "Surprise at the back. The temple is less appealing compared to it's famous neighbor, Bayon, but is nonetheless an interesting site to visit, mostly due to the story behind its restoration. Coined as the world's largest jigsaw puzzle, Baphuon was once torn apart & put together piece by piece. The reclining Buddha at the back wall of the temple was another interesting thing to see, though one has to use some imagination to visualize it.Just be sure to dress appropriately when visiting the place cos I saw other tourists denied entry due to their sleeveless tops & shorts. Mines was long enough to cover half my knees & was allowed to enter."
        }, 
        {
            "index": 128, 
            "rating": "3", 
            "review": "Beautiful temple, worth the visit. This temple is a big temple of Ankor. It's beautiful, not so much details as other temples but very beautiful and nice to see."
        }, 
        {
            "index": 129, 
            "rating": "5", 
            "review": "Ready to climb. Baphuon is recently opened and there are less tourist but the temple is fanscinating. This is the only mountain temple in Angkor Thom. Need stamina to climb on a hot weather but you it worth it when you reach the top."
        }, 
        {
            "index": 130, 
            "rating": "3", 
            "review": "Obligatory visit because it is adjacent to Bayon. This temple is not as beautiful as Bayon however it is much older and since it is right beside Bayon you may as well walk the 300 meters and go give it a half hour walkabout. When you exit this temple make sure you walk behind Bayon so you can take the water photos. You may also find ripe starfruit on the trees outside Baphuon which tastes great on a hot day."
        }, 
        {
            "index": 131, 
            "rating": "5", 
            "review": "Less tourists makes it more spectacular. A stunning long stone walkway leads to this temple, where you can climb to the top on a very steep, near ladder like set of steps. The view is incredible from the top, as is walking along the corridors inside. Lots of random placed stones lay on the grounds which apparently were ready for restoration works until the time of the Khmer Rouge. Maybe one day they'll get back to it, although sometimes it's nice to see it in the state it is, safety hazards and all."
        }, 
        {
            "index": 132, 
            "rating": "5", 
            "review": "Hidden find . Our 7th temple and the sun was hot! Bring lots of water and suncream. We enjoyed this temple with it's long walkway path and steep climb up into the small temple. We enjoyed our visit by tuk tuk and a guide book no noisy tour groups. Be prepared for fake guides that charge you, sellers calling you to buy things and book sellers. But that's at every popular attraction. Please don't give money to the children they are working for someone the money won't go to them and they will go out and do the same thing the next day. Remember to promote good tourism in the country."
        }, 
        {
            "index": 133, 
            "rating": "4", 
            "review": "Siem Reap Adventure. first temple that I actually noticed the security guards enforcing the dress code law. So why only this temple and not the rest as well? Is it just because this was the royal palace temple? I quite enjoyed the climb and view from the top. Good to know that they are restoring this temple."
        }, 
        {
            "index": 134, 
            "rating": "5", 
            "review": "Buddhist temple inside Angkor Thom. Baphuon was one of the amazing temples inside Angkor Thom. There was a long stone bridge built over the sandy surface which led to the main entrance of the temple. Climbing up the stairs you could walk round the temple along the corridor on the first level. You could go to the top by climbing up a very steep staircase to have a better view. It was a Buddhist temple and a 9 meter x 70 meter statue of a reclining Buddha was built on the external wall at the western side of the second level but you need some imagination to admire the statue as the features of Buddha were not so prominent."
        }, 
        {
            "index": 135, 
            "rating": "5", 
            "review": "Still being retired, very elegant. This huge temple is still being restored. We saw 4-5 Buddhist monks dressed in orange going in and out and along the long causeway. Impressive site."
        }, 
        {
            "index": 136, 
            "rating": "5", 
            "review": "Life time experience. A lifetime experience to watch, climb and walk around. If you love hiking this is the place for you but beware of risk of falling down and breaking bones."
        }, 
        {
            "index": 137, 
            "rating": "4", 
            "review": "One of the big temples. Located next to the Elephant Terrace and the main stopping point for a lot of tour buses, this temple can get very crowded and it being the halfway point of many temple tours, most people would've visited this temple during the heat-intense noon period. It can get pretty exhausting. A three-tiered temple that allows visitors to climb all the way to the top, this temple is another well-preserved monument that has lots of details intact."
        }, 
        {
            "index": 138, 
            "rating": "5", 
            "review": "Amazing place. One of main temples to visit n the area, for me the architecture was amongst the best of them all. Definitely organise a guide there is so much to understand about the different temples and the history"
        }, 
        {
            "index": 139, 
            "rating": "5", 
            "review": "Enchanting!!. This is one of the really big temples of the Angkor Wat Empire. Another winner! If you will check the other side of it from afar, you will actually see a leaning Buddha. Try it."
        }, 
        {
            "index": 140, 
            "rating": "5", 
            "review": "Central of Angkor Thom. Baphuon is the central temple of Angkor Thom. We climbed up the temple and enjoy another different view across the park. Please note that you need to cover your knees and shoulder in order to enter Baphuon."
        }, 
        {
            "index": 141, 
            "rating": "5", 
            "review": "Well Worth the Trip. The Baphuon is a little off the road, but it should be visited in conjunction with Angkor the Bayon in Angkor Thom. Far fewer peolpe were at this temple, and it was not as completely restored as the Bayon or Angkor Wat."
        }, 
        {
            "index": 142, 
            "rating": "5", 
            "review": "Good place to visit. I love this temple .. Outside Angkor Thom is the Terrace of the Elephants and next is BAphuon temple .less tourist nice architecture and great view .."
        }, 
        {
            "index": 143, 
            "rating": "5", 
            "review": "Underrated.....Better than Bayon. Yeah yeah yeah Bayon's got all those faces, but doesn't match up to Baphuon and it's towering pinnacle. If you can make it all the way to the top (there's some pretty imposing steps), you'll get the best views outside of Angkor Wat. The cleared field and long walkway are amazing. It seems less visited than the others but it's definitely was #2 outside of Angkor Wat."
        }, 
        {
            "index": 144, 
            "rating": "5", 
            "review": "Nice view on top!. It is worth the climbs of steps. Be careful though. Not suitable for the elderly. Visit this temple after your visit to Bayon; and proceed to the Terrace of the Elephants after this."
        }, 
        {
            "index": 145, 
            "rating": "5", 
            "review": "One of my favorites despite the steepness of stairs. This is one of my favorites because of the majestic nature of this temple. We climbed steep stairs just to explore it and so worth the view from above. Fortunately, they built wooden stairs with barristers so it was easier and safer to climb vs the other temples. Don't forget to see the reclining Buddha as you exit the temple.As with all the other temples in Siem Reap, this has undergone restoration after being ravaged by war. This temple is still beautiful to see - pictures do not do it justice. Hearing from the tour guide on what it looked like as it was originally built makes you think and imagine what could have been."
        }, 
        {
            "index": 146, 
            "rating": "5", 
            "review": "Great Views. Scary climb up some very steep stair to the top where the views were quite amazing. This is a nice temple but the real attraction in in the terraces nearby with the elephant terrace and the terrace of the leper king having amazing carvings"
        }, 
        {
            "index": 147, 
            "rating": "4", 
            "review": "Worth a wander. More ancient ruins, with the amazing carvings & sculptures you see at most of them. Have a slow look around & enjoy. Locals selling things at the entrance & can be very in your face, but try to remember that this is their livelihood & they dont realize how annoying this is, so try to be patient :-)"
        }, 
        {
            "index": 148, 
            "rating": "3", 
            "review": "Baphuon Temple. Near to Bayon. Less tourist compare to bayon. The temple mountain still stands. But most of the structure already ruin. The stairs to the pyramid top is very steep and there is nothing much to see up there."
        }, 
        {
            "index": 149, 
            "rating": "4", 
            "review": "Picturesque. Very nice place less crowded and quite panaromic views from the temple..Tip:Take water and umbrella this place can get very hot and humid during day.."
        }, 
        {
            "index": 150, 
            "rating": "5", 
            "review": "My favorite temple to climb at Angkor. Of all the temples we climbed at Angkor, and we did quite a few in one day, Baphuon seemed to be the one where everyone was having a good time. There is something particularly enjoyable here: the jungle views, the steepness, the thrill, location, etc. Watch your head as you climb through several stone doorways, arches, etc. I was wearing a cap with a button on top, and that helped me as I did hit the top of my head once. Enjoy the climb up and down, just take your time."
        }, 
        {
            "index": 151, 
            "rating": "4", 
            "review": "Scenic view from above.. Climbing up the top storey and sweating, I found it another good place to see around. But one do need quite a lot energy."
        }, 
        {
            "index": 152, 
            "rating": "5", 
            "review": "Largest jigsaw ever!. Be prepared to climb. Incredibly steep staircases, almost ladders - you need to be relatively fit to get to the top. The final top piece is still not open to the public.It is the world's largest jigsaw puzzle ever after the Cambodian war that caused untold damage.Keep an eye out for the Reclining Buddha at the end of the tour, 60 metres long and reinstated a few years ago."
        }, 
        {
            "index": 153, 
            "rating": "5", 
            "review": "Another amazing site. It's hard to stay focused when visiting Angkor as getting templed out is a real danger. Spread the highlights out. This is a highlight."
        }, 
        {
            "index": 154, 
            "rating": "4", 
            "review": "The climb is worth it but watch your step - the treads are very narrow!. A long causeway leads to a central complex with three long steep climbs to the centre. Not for those with vertigo!"
        }, 
        {
            "index": 155, 
            "rating": "5", 
            "review": "Less touristy but as majestic as Angkor Wat. For me, this temple is as majestic as Angkor Wat so I was quite surprised that it did not receive as many tourists as Angkor Wat. It was a blessing anyway because I can appreciate more about this temple and enjoy our visit here. It is located just a short distance after Bayon Temple, on your left hand side. You can climb to the top of the temple which gives you a very nice view. Please be careful because the stairs are very steep and climbing down would be very challenging. Make sure you use a proper shoes with good traction for your safety.We went there unprepared and without a guide so we missed the reclining Buddha. So make sure you dont miss it. Based on previous reviews, the reclining Buddha is located on the west side."
        }, 
        {
            "index": 156, 
            "rating": "5", 
            "review": "Magnificent Ancient Temple. A long walk towards this temple and get ready yourself with a good pair of shoes..I totally felt in love with this temple and there is a section of the temple whereby you need to climb up and great view on top of it..It is a very quiet temple and during my visit, there was not much of a crowd here which I totally love its serenity and totally amazed at this ancient building itself...I would recommend anyone who wants to visit here to spend about 3 to 4 hours and do not forget to bring lots of drinking water as it really hot out here.."
        }, 
        {
            "index": 157, 
            "rating": "4", 
            "review": "Worth a visit. Baphuon seems to be a less known destination for the masses. But I would recommend it. Both because it has less tourists but also because it has its beauty in its own right.You can climb almost to the very top of this temple giving you a fantastic view over the area. On your way down don't miss the reclining Buddha on the west side."
        }, 
        {
            "index": 158, 
            "rating": "4", 
            "review": "Nice temple. Nice temple to have a look at on the way from Bayon to the terrace of the Elephants. It was closed when we visited but had a look around the outside"
        }, 
        {
            "index": 159, 
            "rating": "4", 
            "review": "Angkor. Great temple around Angkor Wat.You will get to see a few along the way and it was a nice drive with great greenery scenery."
        }, 
        {
            "index": 160, 
            "rating": "4", 
            "review": "Amazing temple and not as busy as others. It was good to wonder around in this place, not that many people took the time to go there, so that makes it good to chill around, take the time for photos, rest relax. There is a big climb to the top, and in the back of it there is a reclining Buddha in the bricks (which is in ruins)."
        }, 
        {
            "index": 161, 
            "rating": "5", 
            "review": "Don't miss this one out.. A better temple to visit that some of the other more-frequented temples by most tourists. It's more impressive than some and far quieter - we got shots with NO-ONE IN THEM. Try that at Angkor Wat."
        }, 
        {
            "index": 162, 
            "rating": "4", 
            "review": "Worth the climb!. This temple was an accidental detour as our tuktuk had a flattie on the way to the elephant terrace. But what a lucky accident it was.\nThis was the tallest temple we visited (3 stories) with some very steep stairs to climb.\nSimilar architecture to the Bayon temple and worth a visit if you go to the elephant terrace."
        }, 
        {
            "index": 163, 
            "rating": "5", 
            "review": "A wonder. An amazing view with a 3D reclining Buddha on the wall.\nI had a beautiful view from the top!\nI was so happy to come here!"
        }, 
        {
            "index": 164, 
            "rating": "4", 
            "review": "You can't go to Siem Reap without doing the temples. After you have been around, most of the temples they begin to merge into one, but if you look closely you can see they are built differently. They are so interesting you can't go to Siem Reap without trying to do all of them."
        }, 
        {
            "index": 165, 
            "rating": "4", 
            "review": "Another temple to enjoy. Make sure you view this temple too. A very spiritual place, but well worth the look. Take the time to stay in Siem Reap to see all the temples you can."
        }, 
        {
            "index": 166, 
            "rating": "4", 
            "review": "Lots of stairs but it gave you a goof view from the top. It has lots of stairs. I climbed up to the very top and very satisfied tih the view from the top.\nThe journey back downstairs was damn scary. The stairs was very sloping. You need to be careful not to fall down."
        }, 
        {
            "index": 167, 
            "rating": "5", 
            "review": "Great view of the area from the top of the complex. This was an interesting temple to explore. If you climb to the top, you get a great view of the area. The only downside are the guys who follow you around trying to show you photo opps for tips. I spent about an hour here."
        }, 
        {
            "index": 168, 
            "rating": "5", 
            "review": "Worth the visit. This is a great place to go visit a buddhist temple. This temple takes at least 1 hour of your time. Make sure you are wearing proper clothes. Take picture on top, its a worth the effort to get there. In the back of the temple there is a sleeping buddha embedded in the rocks. Follow the path for the visit after wards"
        }, 
        {
            "index": 169, 
            "rating": "3", 
            "review": "A boy suprised me. The location is easy to find, but also easy to miss it.I was passed by and miss this place when I first get to the temple. When you visit the small tour for a whole day, you will find this temple is just similar to the others. So, not really a big surprise when you visit this. I have a bad experience over there. I was guided by a \"volunteer student\" that he shows me all around the place and explain some history for me.However, he was asking me for donation at last.Well, it is fine if you raise out this at the very beginning.I really feel not very comfortable after he showed me the way and a little bit pushy on the donation amount. Finally I just give a very small amount and he asked for tips for himself. I was quite surprise about what he did.Remember to wear sleeves clothes and long pants on the date you visit. Many place had dress code for visiting the temple. You may buy some traditional goods outside the attractons and all the pants. Long pants is quite good for visitng Angkor Wat as the weater is far too hot and sweat a lot."
        }, 
        {
            "index": 170, 
            "rating": "4", 
            "review": "Baphuon worth the walk.. Baphuon is a smaller temple but still worth visiting. It is a bit less than a kilometre north from Bayon temple in the Angkor Thom complex. There is a nice walk into the temple along a terrace between two ponds - great for photos."
        }, 
        {
            "index": 171, 
            "rating": "4", 
            "review": "Hidden Gem - tucked away in the woods, don't miss it.. This temple is tucked away in the woods so could easily be missed. You have walk down a long bridge like path way to reach this temple which adds to the beauty of the temple. It's a magnificent temple with a small pyramid at the top. Not as busy as the other temples, very quiet and calm feel to this temple. The steps are not for the faint hearted or anyone with walking difficulties. They are extremely steep but so worth climbing to experience the view from the top. Take your time going up and down these steps, you don't want to be falling down these steps - trust me! Some tourists were even over taking other people on these stairs - not a good move could easily cause an accident as well as making other people feel even more nervous about their decent as these people over take them.Beautiful pictures from the top of this temple. Do remember ladies you will need to cover your shoulders and wear appropriate length shorts - nothing too short! I used a scarf that I'd bought to cover my shoulders whilst in this site as it was too hot to be wearing a sleeved top. Their are guards at the entrance to the temple that will turn you away if you're not dressed appropriately."
        }, 
        {
            "index": 172, 
            "rating": "5", 
            "review": "Part of Angkor Thom Mini Tour. As part of the Angkor Thom Mini Tour, Baphuon Temple was hidden inside the forest covered with trees. Very big temple with a small pyramid on top."
        }, 
        {
            "index": 173, 
            "rating": "5", 
            "review": "beautiful. it's beautiful, not many people, calm, serene and i like it more than bayon which is just nearby...."
        }, 
        {
            "index": 174, 
            "rating": "5", 
            "review": "Baphuon is a wonderful temple in Angkor Thom. Baphuon is in the Angkor Thom area situated in serene surroundings that allow you to appreciate the beauty of the building and consider it's history and that is was restored so we can enjoy & learn. The giant reclining Buddha on an outer wall is remarkable and the views from the top are wonderful"
        }, 
        {
            "index": 175, 
            "rating": "5", 
            "review": "Great temple. Beautiful temple set a part of the other temple compound, the temple was ruin but you will be amazed with the structure and architect. Worth to pay a visit"
        }, 
        {
            "index": 176, 
            "rating": "3", 
            "review": "The Baphuon, another older temple to see. The Baphuon, another older temple to seeI appreciated the alley of stones, slightly covered walkway caratère as found in other civilizations (see the pictures)."
        }, 
        {
            "index": 177, 
            "rating": "4", 
            "review": "Magnificent.. Climb to the top. Its worth it. One of my favourite temple in Angkor. Remember to wear long skirt and cover your shoulder for woman."
        }, 
        {
            "index": 178, 
            "rating": "5", 
            "review": "Beautiful. I felt this was one of the most beautiful. The big walk in \"bridge\" makes for a sight. Felt it was huge and awe inspiring. Too bad it was closed at the time we went by. I am pretty sure it opens because there were stairs and visit guidelines but we oursleves didn´t get to climb up top. Seems to be in pretty good shape compared to some of the others. This is a mandatory passage when you follow the Angkor Thom visit guidelines just after Bayon, so you will certainly have a look here if your ever come visit, so don´t bother making time in your schedule just for it."
        }, 
        {
            "index": 179, 
            "rating": "4", 
            "review": "Shiva Temple. This amazing three tiered Temple is dedicated to the Hindu God Shiva. This temple took 51 years to restore and was only opened in 2011. There are a lot of steps so make sure you wear good shoes and some water. But the views are marvelous. If your not so ambitious then take a stroll along the Walkway."
        }, 
        {
            "index": 180, 
            "rating": "5", 
            "review": "Impressive temple. The temple is very impressive and unique. The views from the top of the temple is stunning as well. However, do keep in mind the stairs are very narrow and amazingly steep. Many tourist were afraid to get down but they probably did in the end! All in all, don't skip this temple. Simply stunning indeed."
        }, 
        {
            "index": 181, 
            "rating": "5", 
            "review": "Beautiful Temple - Even if you are Heights Challenged!. This was the first temple I visited in the Angkor Thom complex. It is beautiful, and at the very top--if you have the stomach--you can get a lay of the Land of Thom! Particularly beautiful is the West end of the Baphuon. During the 1960's to the 1970's, the entire Baphuon was taken apart stone by stone, and lay in a rubble when war broke out. I don't think the re-assembling began until after the war. It's quite beautiful. General Recommendation for Wat-seeing - go early in the morning or late in the afternoon--avoid the heat of the day."
        }, 
        {
            "index": 182, 
            "rating": "5", 
            "review": "Pyramid Temple. A stone causeway connected the three tired temple. It was built in mid 11 th century by Udayadityabarman II . It was dedicated to Lord Shiva later it was transformed into Buddhist temple. To visit upper tiers one need to use steep wooden stairs . A word of caution those who are not physically fit should not try to climb up specially senior people . It is suggested to avoid tight pant and shoe with heel which will be hazardous for stair climbing .At the top tier there is tower . From distance the temple look so beautiful and from the top also the surrounding is eye soothing."
        }, 
        {
            "index": 183, 
            "rating": "5", 
            "review": "very impressive. Walking up to this temple (near bayon) that I had never even read about, I was stunned. it is almost as impressive as Bayon & Angkor Wat themselves. It is a very high, with very steep stairs, but the view from the top (and the cool breeze) is worth it. The entrance way from the front is beautifully picturesque and a great place to stop for a rest after exploring bayon. You of course have to have knees and shoulders covered here as it is a temple."
        }, 
        {
            "index": 184, 
            "rating": "3", 
            "review": "Temple dedicated to Hindu God Shiva. This temple was built in mid 11th century. The temple was dedicated to Hindu God Shiva. The architecture is fine. View from the top is very good but with a tough climb."
        }, 
        {
            "index": 185, 
            "rating": "5", 
            "review": "Staggering temple. Watch the mossies but a fantastic temple. Be warned there are many steep wooden steps here. Apparently the original stone steps are too steep & too high!"
        }, 
        {
            "index": 186, 
            "rating": "5", 
            "review": "World's largest jigsaw . Part of the Angkor Thom complex , the royal palace has a very different feel to Angkor Watt , a very steep pyramid type structure , not many people there , part of the walk from Bayon to Leaper King Terrace , worth the climb"
        }, 
        {
            "index": 187, 
            "rating": "5", 
            "review": "Baphuon Temple is large but easily overlooked. Being situated between the Bayon and the Elephant Terrace, the fairly large Baphuon temple can't really not be noticed but nevertheless it is easy to overlook. Fortunately for a repeat visitor like myself, it can be explored a little bit at a time. The long elevated walkway is actually quite spectacular and during the many years of reconstruction it was the only part many visitors ever saw. On my last visit I rode my bicycle around the outside of the massive structure and explored the outer perimeters, that may not sound very exciting, but it is something I always like to do after getting to know the main structures of any Angkor temple."
        }, 
        {
            "index": 188, 
            "rating": "5", 
            "review": "Off the beaten path temple, set back in the woods and no crowds. Go during dusk for best pictures. Even though this is not a \"famous\" temple within the complex it is still a nice temple with timeless history. Be sure to stop here for zero crowd picture. It is on the way out of the bigger complex."
        }, 
        {
            "index": 189, 
            "rating": "5", 
            "review": "Amazing. Also known as the royal palace. Build different yet again and an amazing experience after the Bayon temple. On the long pathway you can take perfect photos and from the top you have an amazing view!!\\Worth a visit and in my eyes a must in Siem Reap!!"
        }, 
        {
            "index": 190, 
            "rating": "4", 
            "review": "Look Out For The Huge Reclining Buddha at The Back of Temple. The long walkway towards the temple is quite impressive. Inside, it requires a lot of climbing of stairs. What's most special about this temple is the huge reclining Buddha at the back of the temple. As you are leaving the temple following the guided path, stop while you are at the back of temple. You can see a gigantic reclining Buddha on the temple - there is a small signage that points this out."
        }, 
        {
            "index": 191, 
            "rating": "4", 
            "review": "Worth a visit . Great to walk up stairs and see the view of the surrounding area, bit of a steep climb but worth it so be careful with climb and decent.Of all the temples I visited this was the one with less people so you can get a good experience, but for me I like others more so if you have time constraints and can't visit all I would cut this one."
        }, 
        {
            "index": 192, 
            "rating": "5", 
            "review": "\"World's biggest jigsaw\". This temple is completely underrated and not recommended enough. This was likely one of the best experiences within Angkor, in my opinion.There were so few people there, which was great!! (2pm on a monday)There are 3 levels which you can transcend - tough climbing but worth it. It's hilarious to walk around and wondr what it was supposed to look like had the original instructions on how to put it all (300,000 stones) back together. What an adventure! !!!"
        }, 
        {
            "index": 193, 
            "rating": "5", 
            "review": "What a view, what a temple.. I've visited this temple a couple of times over the decaded while it was still under restauration. This year was the first time I climbed all the way to the top of the fully restaured temple. The climb on the modern wooden stars is steep, very steep. Going up is not easy and sweaty. Climbing down is all out dangerous, keep your hands to the rail and move slowly. But it is worth the efford. The temple is beautiful. Pity we couldn't climb to the highest point."
        }, 
        {
            "index": 194, 
            "rating": "4", 
            "review": "Great view. The view afforded from the top of this temple was excellent, buts do be careful on the way up, as them stairs are lethal!!!"
        }, 
        {
            "index": 195, 
            "rating": "5", 
            "review": "Dedicated to Lord Shiva. Baphuon Temple is very near to Bayon. you can access by walking distance. The design of this temple is unique and it's believed that those days King will have their prayers in this temple. So its considered as one of the powerful place in angkor. After visiting Baphuon temple, you can walk around the other side of the temple to visit elephant tarrace and lapper king tarrace."
        }, 
        {
            "index": 196, 
            "rating": "3", 
            "review": "A tad underwhelming. Given the magnificence of some of the other temples (particularly Bayon), I found Baphuon underwhelming - particularly given the energy sapping climbing. At times it felt like a chore and I was expecting much more after the draining scale to the top.Maybe it would be an idea to explore this temple before Bayon."
        }, 
        {
            "index": 197, 
            "rating": "5", 
            "review": "Amazing landscape. It was resurrected recently and opened to public as recent as two years back. You must go on top of the temple to witness beautiful landscape of the temple complex."
        }, 
        {
            "index": 198, 
            "rating": "5", 
            "review": "One of my favorites of the Temples of Angkor. Located close to Bayon this temple is a lot of fun. You can explore both in one day easily. Views from the top are great although accessibility is by very steep stairs both up and down. The condition of the remaining temple is pretty good since it was restored. You will be greeted by the monkeys at the beginning of the walkway."
        }, 
        {
            "index": 199, 
            "rating": "4", 
            "review": "The detail is incredible.. I read up on Ankor before I came but there is so much here and each temple is so similar yet different. The amount of detail is what blew me away and in Baphuon Temple, the beautiful pools. There were steps to ascend to the very top where, no doubt, the view is spectacular. Unfortunately I would have been stuck up there forever so I didn't go up. (pout) Also, Ladies need to cover their shoulders to access some of these places so its a good idea to wear a t-shirt, not a tank top, it's so ease to get sunburned out here too so T-shirt is just a really good idea all round."
        }, 
        {
            "index": 200, 
            "rating": "5", 
            "review": "Climb up and enjoy the nature around it. One of the best temples of Angkor Thom, not suitable for old folks or kinds though. You have to climb some wood stairs and they are a little scary."
        }, 
        {
            "index": 201, 
            "rating": "4", 
            "review": "The Temple of the Sleeping Buddha. He's not hard to spot, but the tragic thing about Baphuon, a mid-eleventh-century temple, was to be restored after French excavations. All the stones were laid out and meticulous records kept, but subsequently burnt by the Khmer rouge. Today a large portion of the stones still lie sitting in the jungle beside the temple. No one has the foggiest idea of how to put the shrine back together again now. Tragic."
        }, 
        {
            "index": 202, 
            "rating": "4", 
            "review": "Angkor Thom. As recommended in other posts, I'd suggest getting a map of the Angkor Thom complex before visiting. Make sure you check out Baphuon, learning its history. It's a large area and right near the king's giant pool and the queen's smaller one. Definitely worth a look, especially if you have a book/ info on what they assume it originally looked like!"
        }, 
        {
            "index": 203, 
            "rating": "4", 
            "review": "Do the climb, and enjoy the view on top. This is another beautiful temple within the Angkor Thom. And worth the trip. This temple is known as the stairway to heaven, with the rainbow bridge, according to the tour guide. We walked the narrow bridge which lead to the temple, and then began to climb slowly up the 3 levels. The climb is steep, and we had to be really careful.When we reached the top, we felt that the climb was totally worth the effort - the view was gorgeous, and it was also windy. That was a good break from the dry heat. We stayed up there for a while to enjoy the place. The climb down was a little more overwhelming, but we managed to get down with lots of caution taken. Love the Baphuon!"
        }, 
        {
            "index": 204, 
            "rating": "4", 
            "review": "It's tiring, but worth it!. It's a pretty high climb up insanely steep stairs, but it's definitely worth it, especially since the view from above was gorgeous!Getting to climb this landmark was memorable, and I loved looking for the face of the supposed Reclining Buddha by the back.By the way, you've to cover your shoulders and knees for this temple! :)"
        }, 
        {
            "index": 205, 
            "rating": "4", 
            "review": "Another temple worth visiting. The Baphuon temple is worth visiting. It's a big area and has a nice view over that area. Also a lot of stairs."
        }, 
        {
            "index": 206, 
            "rating": "5", 
            "review": "Find the reclining Buddha!. Up to the top for a superb view! Really, one of the best temples in the Angkor Thom complex. Again, built on several levels, you'll climb many stairs, but it's worth it.Then go to the side with the reclining Buddha. It took us a while to figure this out, but once you make it out, it becomes as plain as day, to state the obvious! It is incredibly well done, and bear in mind this goes back a thousand years.From here you can move on to the Terraces of the Elephants and the Leper King. Definitely well worthwhile to visit Baphuon.We had a tour guide, and this certainly helped us."
        }, 
        {
            "index": 207, 
            "rating": "5", 
            "review": "Royal!!. I loved this temple amongst other temples. It is very royal and it has a wonderful entrance and bridge. Don't miss it. Clime to the top and take pictures to the land under, it gives you a real royal feeling."
        }, 
        {
            "index": 208, 
            "rating": "4", 
            "review": "No go for vertigo! . Passed by and got lost in the gardens on our way to Bayon, the surrounds are beautiful just watch out for the biting ants! Steps were very steep to get up to the top, and normal temple rules apply, although some visitors thought they could get in in a vest top and shorts! Views are amazing and there's a shady spot to rest after your descent."
        }, 
        {
            "index": 209, 
            "rating": "4", 
            "review": "steep stairs, nice view. This is a 3-tier pyramid structure that you need to climb two sets of steep staircaes to the top. The interior corridors and walls are magnificent. Sadly, I cannot locate the outline of the sleeping Buddha from the back side of the temple. Two reminders: 1) no tank tops for visiting this temple; 2) beware of the teens hiding inside the temple, giving you info of the temple and asking for tip afterwards."
        }, 
        {
            "index": 210, 
            "rating": "5", 
            "review": "Lots of climbing. This temple is a tough steep climb but it is worth it, the view from the top is very nice indeed. It is joined to the elephant terrace by a long walkway which I thought was very cool. If you visit in the early afternoon there really aren't too many crowds but take care on the stairs. Definitely one of the temples I would recommend in the park."
        }, 
        {
            "index": 211, 
            "rating": "5", 
            "review": "Impressive but smaller. Smaller temple than the more famous areas. Dont just visit what the guides and taxis recommend. Good condition and better than some of the other temples. Very much a sun trap though."
        }, 
        {
            "index": 212, 
            "rating": "4", 
            "review": "Why do most temples have to be tall? Are they sun worshippers?. I walked from Bayon temple to get there. This temple looked different as well. It has a unique design. It is a 3-tiered temple mountain built as a state temple. Here I needed to catch some breath since you need to climb the steep stairway to get to the top. The view on top of the temple was great but it was still hot. Not that I complained a lot of the weather being too sunny that day."
        }, 
        {
            "index": 213, 
            "rating": "4", 
            "review": "Three tiered temple. Baphuon temple is located in Angkor Thom, northwest of Bayon. It was built in mid 11th century. It is a three-tiered temple mountain built as the state temple of Udayadityavarman II. It was dedicated to Hindu God Shiva. Its architecture is fine. View from the top is very good but the climb is bit tough."
        }, 
        {
            "index": 214, 
            "rating": "4", 
            "review": "Picturesque, but the climb is tough.. I would have loved to see the view from the top of the temple, but even my physically fit daughter found the steep stairs and the crowds a challenge."
        }, 
        {
            "index": 215, 
            "rating": "5", 
            "review": "Temple of the reclining Buddha. The Baphuon is one of the temples inside the Angkor Thom city. It is a pyramid style temple under reconstruction. It is possible to climb all the way to the top. On the west face a large reclining Buddha can be found, it has been part of the reconstruction. Good to visit as part of a visit to Angkor Thom. Of course the Bayon temple is the real centerpiece of Angkor Thom."
        }, 
        {
            "index": 216, 
            "rating": "3", 
            "review": "Other temples are more impressive. I didn't find this temple quite as impressive. It is steep if you walk up and the carvings aren't in quite as good condition as others elsewhere in the park. Not a 'must see' but OK if you are visiting Angkor Thom to have a quick look."
        }, 
        {
            "index": 217, 
            "rating": "5", 
            "review": "Kids under 12 not allowed to climb up. Wish I had seen this mentioned before. Other than that, another awesome set of ancient bricks. Unique feature is the raised walk way up to the temple. And then you (if you are over 12) can climb some rather steep stairs all the way up ... once you get back down and circle to the back, you can make out, very faintly, the outlines of a very large sleeping Buddha."
        }, 
        {
            "index": 218, 
            "rating": "4", 
            "review": "Dedicated to Lord Shiva!. Bapuhuon temple is located inside Angkor Thom. It is three tired mountain temple, and it was the State temple of King Udayadityavarman. This temple is dedicated to Lord Shiva, and it stands 34-35 meters tall. Later in 15 th century, this has been converted to Buddhist temple. A huge reclining Buddha can be found on the upper level. It is very dull and dim, and if you look at it very alertly only, your eyes can find it. This temple was built of sand stone, and due to its huge, immense size, this has been unstable in the years to come. Large portions are already in ruins. It's architectural style is Khmer. Our group consisted of 6 people, and a private tour had been arranged. The Angkor Tour Guide Service took care of us so well. Mr. Sok Chea, who beautifully took us to all the places in his nicely air conditioned van, stayed with us throughout the day, always with a smiling face, always willing to be helpful. He is such a wonderful person, and I would recommend his name to anyone who is thinking of planning a trip to Cambodia."
        }, 
        {
            "index": 219, 
            "rating": "4", 
            "review": "Between Bayon & Terrace of Elephants. We visited Bayon first and came here before the Terrace of Elephants, and really enjoyed this part.It's setback back a little but visible from the road, which makes for some great views.The walk up it is nice but the steps are pretty steep, although newly built and with a rail.It's impressive at the top but unfortunately the very top is closed off, so you'll have to settle for the views two-thirds of the way up.Well worth it!"
        }, 
        {
            "index": 220, 
            "rating": "4", 
            "review": "Nice view on top. Beautiful temple and the entrance walkway of the temple is very impressive. To get on the top of the temple, you must climb many stairs but it worth to climb. The view from the top of the temple is so nice."
        }, 
        {
            "index": 221, 
            "rating": "5", 
            "review": "steep climb. The Baphuon is close to the Bayon. It's steep and tricky to climb and the carvings aren't so well-preserved. There's a long causeway leading to it . On the North side, the upper terrace is in the form of a sleeping Buddha; it's quite hard to make out; see if you can spot it!"
        }, 
        {
            "index": 222, 
            "rating": "5", 
            "review": "Mostly overlooked. We found this temple on our 2nd temple visit day. This temple is not much advertised not sure why but it has become my favourite temple. It is well maintained, from the top you have got a great view, not too many carvings, clear design, sleeping Buddha on the back of the temple, nice forest walk around just a good atmospheric place where you can rest with a lesser crowd of visitors at the top and enjoy some moments for yourself."
        }, 
        {
            "index": 223, 
            "rating": "4", 
            "review": "Few tourists. We visited after Bayon and walked along a impressive walkway up to the entrance of the temple. Worth it just for the walkway with great views from the top. We were surprised how few tourists were here."
        }, 
        {
            "index": 224, 
            "rating": "4", 
            "review": "Impressive access. Definitely below Angkor Wart and Bayon. But the paved access is \"royal\" and you can appreciate it from the top of the temple. The temple itself is OK. It can be visited after the Bayon, next door. Good to know you need to have long trousers to access. Best time for photos would be early afternoon. Toilets are around 10 min walk away."
        }, 
        {
            "index": 225, 
            "rating": "4", 
            "review": "IN RUINS -worth visiting. on the way to famous TAPROHM Temple we can just stop for a while to see this Baphuhon temple which is in ruins.WORTH PRESERVING FOR FUTURE GENERTION."
        }, 
        {
            "index": 226, 
            "rating": "5", 
            "review": "Highly recommended temple. such a beautiful restored temple complex, we were on our own so we explored the cr*p out of it! loved every section and area and the walkway was just amazing, we walked around the back, dont forget to do that, there are many beautiful huge trees worth seeing here"
        }, 
        {
            "index": 227, 
            "rating": "5", 
            "review": "My favourite temple, by far. Rented a bicycle and was riding along the cluster of temples near Bayon (though without a map - totally impromptu and highly recommended if you're into relaxing/exploring) and wandered here by chance (the elevated walkway surrounded by a lake attracted me). Turned out to be my favourite. The stairs up are tough (lots of them and seems to deter some), but the view from the top is very rewarding. Too bad the topmost section is closed off but from the highest platform it does look like a \"Stairway to Heaven\". I rested there for about 30 minutes under one of the 'windows'/arches and it was very, very relaxing with occasional wind breeze and view over the lake."
        }, 
        {
            "index": 228, 
            "rating": "5", 
            "review": "Beautiful. In my personal opinion this is the most beautiful structure in the Angkor complex. Sadly what we see is just a shadow of the original. Sign boards that explain recent restoration work give an idea of what the original looked like. For example the pinnacle tower had totally collapsed without a trace but must have appeared dazzling."
        }, 
        {
            "index": 229, 
            "rating": "4", 
            "review": "Inside the Angkor Thom complex!. This temple inside the Angkor Thom complex is interesting, because the temple was original built as a Hindu temple & then was converted to a Buddhist temple in 15th century. You can actually see where the stone workers have changed the carvings to reflect the change in religion."
        }, 
        {
            "index": 230, 
            "rating": "3", 
            "review": "Very amazing.. but annoyed by the minor tourist guide there... Very amazing building. The restoration information board needs to repair as the document displayed quite torn down. There are minor tourist guides stationed there looking for targets to offer rough commentary and request tips in return, quite annoyed by their aggressiveness. Quite steep to climb all the way up but cant go to top as its been blocked. Feel like getting closer to the heaven.."
        }, 
        {
            "index": 231, 
            "rating": "3", 
            "review": "Historic temple. Located in the Angkor Thom complex, it was originally erected as a Hindu temple in mid-11th century by Udayadityavarman II, later converted to a Buddhist temple in the 15th century. Recently restored with the aid of French archaelogists."
        }, 
        {
            "index": 232, 
            "rating": "5", 
            "review": "Causeway, climb, concealed.... Another of the amazing temples to see in the area. This one has a particularly striking causeway leading up to it, and some very steep stairs to climbs to reach the summit.\nAround the back, there is a slightly hidden, not quite all there, huge reclining Buddha built into the second level."
        }, 
        {
            "index": 233, 
            "rating": "5", 
            "review": "Peaceful and picturesque place in Angkor Area. My favorite next to Angkor Wat. The peak of the temple is amazing. Although all temples look the same, Baphuon kinda gave me the relaxing vibe among all other temples. The smiling Buddha behind the temple, which was restored, gives your eyes a refreshing feel after going through a sea of temples in Angkor. Make sure you dont wear tank tops! :)"
        }, 
        {
            "index": 234, 
            "rating": "4", 
            "review": "Restored and revealing. Baphuon is not as famous as the Bayon or Angkor Wat but it is as special. The restoration work going on here is trying to bring back the exactness of the architecture. It's worth a visit just for observing archaeological conservation and its importance in action."
        }, 
        {
            "index": 235, 
            "rating": "4", 
            "review": "Good restoration project. This is my second time and Siem Reap, so glad I was able to go around Baphuon Temple. Our guide gave us an insight on how it was restored by a French team."
        }, 
        {
            "index": 236, 
            "rating": "4", 
            "review": "Intricate. This temple as all temples are unique. Outstanding is the reclining Buddha, makes rocket science out of Lego. Intriguing, just as all the temples are."
        }, 
        {
            "index": 237, 
            "rating": "5", 
            "review": "Gem of a temple, tucked away. We were heading to the elephant terrace when we found Baphuon. They are right next to each other, yet all of the hordes or tourists were passing by this temple. Their loss was our gain! This is a hidden gem in the Angkor temples. We had a phenomenal time exploring it. The walkway is held up by hundreds of pillars. It is beautiful. There are lakes surrounding it and forestry behind it. There is even a path that leads you around the back to the elephant terrace. Highly recommend adding this to your list of temples to see!"
        }, 
        {
            "index": 238, 
            "rating": "5", 
            "review": "An Example OF Restoration Challenges. A short walk from the Bayon temple, Baphuon Temple is a clear example of the challenge in restoring these ancient structures. Approaching the temple, the ground is covered with numbered stones the location of which are now unknown as the restoration has been progress for more than fifty years. Though it may appear daunting, climb the two levels to the top - great views, but some may find the steepness of the stairs unsettling."
        }, 
        {
            "index": 239, 
            "rating": "4", 
            "review": "Interesting temple. After visiting Angkor Wat and Ta Prohm, you kinda feel tired of visiting other temples.I nearly missed this temple as it was recommended by my tuktuk driver. But gladly I did go there and climbed up the stairs. It was a stunning view up there."
        }, 
        {
            "index": 240, 
            "rating": "4", 
            "review": "Photographers Dream. Up the road a bit from Bayon Temple and next the Elephant Terraces, this temple is a great one for those tired from 'Angkor Wat walking'. This template has a compartively small footprint, however it does make up for it with the raised stone causeway and vertical scope.Make the effort to climb the steep staircases to the very top as the view is spectacular. However, when decending the stairs its best to adopt a sideways gait, focus on your feet, and don't look at the ground."
        }, 
        {
            "index": 241, 
            "rating": "5", 
            "review": "Giant puzzle. Hats off to human race for building such structure making us think with astonishment, \"how did they do this 1000 years back\".You might not find anything unusual about this place unless you really read the history of this temple, so please read before exploring and it will then reveal its secrets.Turn on: Well managed, proper signageTurn off: None"
        }, 
        {
            "index": 242, 
            "rating": "5", 
            "review": "Baphuon Temple - Good Workout. The Baphuon Temple is a grand temple, a must see when you visit Angkor Thom. It is quite a workout to climb to the top of the temple and the view from the top is just magnificent. It is nice walk from the front gate of the temple, along a raised walkway, to the temple. There are a number of steep and narrow stairs you have to negotiate to get to the top. Well work a visit. Highly recommended."
        }, 
        {
            "index": 243, 
            "rating": "4", 
            "review": "Astonishing temple.. Wow this is great Baphuon Temple, located within the area of Angkor Thom, this beautiful temple presents itself perfectly preserved and adjacent to a fantastic natural pool, to reach this temple you must take the road that leads up to it just by walking near the large pool of water. Fantastic place but even more fantastic scenery for wonderful photographs."
        }, 
        {
            "index": 244, 
            "rating": "4", 
            "review": "Nice view from the top!. Stairs are steep, but very exciting and rewarding when you get to the top. A nice place for a rest after all the walking, and travelling from Angkor Wat and other temples."
        }, 
        {
            "index": 245, 
            "rating": "5", 
            "review": "Keep climbing to the top!. Very big temple in the middle of Lake. Very beautiful and do climb until the top and you will view the most amazing views around the temple. Tiring but worth every steps."
        }, 
        {
            "index": 246, 
            "rating": "4", 
            "review": "Great views!. This temple is a little set back from the main track. The elevated walkway out to the temple is pretty cool. Climb the stairs to the top, the views are worth it! I definitely recommend stopping here. It won't take long to see and it is definitely worth it.There are a lot of stairs to the top so if climbing is difficult for you, you may want to skip this part. Around the backside of the temple some of the stones have been rearranged to create a reclining Buddha. It is pretty cool to see and doesn't require a lot of stairs to see."
        }, 
        {
            "index": 247, 
            "rating": "5", 
            "review": "My favorite temple!. It's not that famous as compared to Angkor Wat and Bayon but among all the temples, I can say that this one is my favorite. The temple is a pyramid-like structure and seems symmetrical. Tourists can go up by level but the stairs are too steep! Going up will not be a problem but going down can be a challenge. My favorite pictures are also from this temple. Views from the top are very scenic as compared to the views of Angkor Wat. Let me know if you are able to spot the reclining Buddha. ;)"
        }, 
        {
            "index": 248, 
            "rating": "4", 
            "review": "Awesome. I watched local kids swim butt naked in a pound next to the temple picking Lillie flowers then watching them make things with the flowers and they where only around 5/6 years old was very interesting to watch ! I also got some wicked photos of the temples as it was a good day ! try go on a sunny day not to clowdy as you get better photos! remember water !! also be aware there will be lots of locals trying to sell you thing like books and pants and magnets ect ect so beware you will get a bit harassed and mainly outside the temples u will"
        }, 
        {
            "index": 249, 
            "rating": "5", 
            "review": "Picture perfect. Inside Angkor Thom & Very Beautiful. Quiet in the morning recommend walking up then. Unfortunately many tourists leave their rubbish at this temple which is disgraceful."
        }, 
        {
            "index": 250, 
            "rating": "3", 
            "review": "Climb all the way up!. We witnessed a lady being denied entry to this temple as her knees were not covered-up. Didn't notice this policy being strictly upheld in the other temples. This temple resembles a pyramid and the best part of it is at the top. The stairs at the sides are very steep and the elderly will definitely have problems...even we went slightly wobbly in the knees when looking down. We had a good rest while enjoying the view from above."
        }, 
        {
            "index": 251, 
            "rating": "4", 
            "review": "Reclining Buddha and good views. The temple has many great photo-ops. It starts at the long elevated walkway to ther entrance, then up top you can take nice pictures with the lotus flowers and the views and on the back is a huge reclining Buddha built in to the temple base. On the way from Bayon to the terraces."
        }, 
        {
            "index": 252, 
            "rating": "4", 
            "review": "Stairways to heaven. Once was covered by bronze this spectacular temple is located inside Angkhor Thom. Spectacular view on top of the majestic temple. But be prepared for a long and hard work of climbing stairs. Our guide loong a local boy, told us that most temples built with many levels and with steep steps is to allow us humans to understand that it is hard to enter heaven. Interesting concept. Do visit this temple and explore its surrounding."
        }, 
        {
            "index": 253, 
            "rating": "5", 
            "review": "One of my favourite temples!. You must have your shoulders and knees covered to enter this temple! I wandered through the grounds in my tank and shorts on my second day of temple sight-seeing, but I made sure to come back on my third day, properly dressed, just to see this temple...and I'm so glad I did! There were perhaps 5-7 other people in the whole place, so it was a wonderful photograph opportunity, and you really got to feel the ancient atmosphere around you as you perused the galleries and terraces. You can't go all the way up to the tippy top anymore, but you can still climb pretty high on skinny, steep steps."
        }, 
        {
            "index": 254, 
            "rating": "5", 
            "review": "Be prepared to climb. This temple was restored in 2011.There is a long walkway to the temple. During the wet season, there will be lotus and water lilies fronting the temple. Children below the age of 12 not allowed in and proper attire, that is covering of knees and shoulders, required here. Prepare to climb to the top for a great view of the surrounding area."
        }, 
        {
            "index": 255, 
            "rating": "4", 
            "review": "Worth the climb!. This temple is one of the most recently excavated temples, according to my guidebook. The temple has a long walkway from the entrance to the actual temple. Once you reach the temple, you have to climb steep stairways to reach the upper levels.The carvings are in good condition and the view from the top is excellent. It's worth the climb."
        }, 
        {
            "index": 256, 
            "rating": "4", 
            "review": "Beautiful temple, but hard to climb. CC ( 2014.07.26 ) This temple was beautiful like another Angkor remains, too. There was beautiful to see on the ground, and more beautiful on the top of the temple. It was to hard work to climb to steep slope, but was to worth to climb. On the top of the temple, view of looking down was very impressive and beautiful. Must go on the top, though it was dangerous."
        }, 
        {
            "index": 257, 
            "rating": "4", 
            "review": "Worth the Climb. This temple lies between the royal complex - Premeenaka and the Bayon. From the main road, you have to walk a couple of hundred metres on an elevated pathway to reach the base of the temple. The climb is steep so they don't allow kids below 12. Due to eh presence of Ta Prohm, Angkor Vat and Bayon, this temple often gets overlooked, so its comparatively less noisy and the views from the top are spectacular. There was originally a reclining Buddha on the top, however, not much remains now. Most people climb the temple for the views and the remains of the Buddha, thereby missing the hidden gems. On the 2nd level of the temple (it s a 3 level temple) there is a covered walkway on all sides, with stairs to the upper level on the north, east, west and south. The base of the stairways are covered with a chamber and on the outside walls of these chambers are brilliant bas reliefs depicting scenes from the Ramayana and Mahabharata - the two great Indian epics, not surprising since this was, originally a Shiva temple. You will miss these carvings if you walk through the walkway, you will have to get out on the platforms between the walkway and the base of the upper level to see these. The same ticket for the Angkor Archaeological Park is valid here.If you suffer from altophobia (fear of heights) or vertigo, please do not try to climb, its quite dizzy, especially while climbing down the stairs."
        }, 
        {
            "index": 258, 
            "rating": "5", 
            "review": "Hard to climb but absolutely worth it!. The Baphuon is located in Angkor Thom, northwest of the Bayon. Built in the mid-11th century, it is a three-tiered temple mountain, dedicated to the Hindu God Shiva. It is a nightmare to climb the steep stairs but the view and the walk in the corridors is absolutely worth it. Tip: Cover your shoulders and knees."
        }, 
        {
            "index": 259, 
            "rating": "4", 
            "review": "Steep Climb - Kids Aren't allowed. After walking through Bayon at Angkor Thom, this is probably the next \"major\" temple in the area. This temple mountain, is what it is...a man made mountain of sorts. Expect a power climb on really steep stairs. Vertigo will never be your friend especially after entering this temple. The tourism folks at the bottom of the temple (fronting the bridge) have a height requirement (I guess) in determining who gets to go in or not.Bas reliefs, APSARAs and the works may be found inside it, not to mention the amazing Khmer architecture."
        }, 
        {
            "index": 260, 
            "rating": "2", 
            "review": "No kids under 12 can climb. Like Angkor Wat and I am sure others, children under 12 and pregnant women are not allowed to climb up the temple. Disappointing and I am not sure why this rule exists. Frustrating when visiting with children (5 and 7) who are great climbers and I believe would have been safe… Certainly we have climbed many temples in other countries which are steeper/higher."
        }, 
        {
            "index": 261, 
            "rating": "5", 
            "review": "good temple. Baphuon temple it is best temple in siem reap .\nit in side Bayon temple , it is far siem reap town about 8km.\nit is very hinge , it have a lot caving on the wall."
        }, 
        {
            "index": 262, 
            "rating": "4", 
            "review": "Large and spectacular, but do not tarry unless you have lots of time. Famous for its now barely-recognisable, elevated 40 m sleeping Buddha on the west side - which it took me two visits to actually identify - Baphuan is one of the larger temples in the area. Much EFEO work continues, but I believe that there are more impressive temples for the newcomer to visit. The approach via the 200m sandstone walkway is certainly impressive, however. A worthwhile entree to the adjoining Royal Enclosure and Phimeanakas, I suggest."
        }, 
        {
            "index": 263, 
            "rating": "4", 
            "review": "Sky High. The main attraction of this place is basically how high up it is, so if you're not a person that's impressed by heights this might not be your kind of thing. This temple's structure is much simpler than the other temples in Angkor Thom but it makes up for that with its size. I was very impressed by how massive this temple looked and by the pillar-supported walkway at the entrance. The temple is really tall and you can climb up stairs to get all the way up to the top. Watch out for the steep steps though. The view at the top is fairly refreshing and you'd be quite surprised when you realize that you've gone up all those stairs! This visit was part of an itinerary planned out by our tuk tuk driver. It included Angkor Wat and most places in Angkor Thom. Walking around from temple to temple can get very exhausting (especially around noon) so I recommend resting adequately beforehand, using sunblock and drinking as much water as you can. And wear knee-covering pants when coming here; otherwise you might be denied access to certain temples."
        }, 
        {
            "index": 264, 
            "rating": "4", 
            "review": "For Women, Don't Wear Shorts. We went here on our own without a tour guide. We were not informed that wearing shorts for women is not allowed. And too bad I was wearing shorts because it was too hot in Siem Reap! So I was forced to buy local pants sold around Angkor Thom. This temple is pretty high. It's beautiful but prepare your legs for some huge climb. We went to Baphuon Temple before lunch (around 11am). There were a lot of people already. Perhaps you can visiting earlier."
        }, 
        {
            "index": 265, 
            "rating": "2", 
            "review": "The walk is nice, but you could probably skip it.. After visiting Bayon Temple, Baphuon is a bit of a let down. You might want to check it out first before exploring Bayon. Walk around the temple and take advantage of the tall trees and their shade. Checking out the grounds is more worth your time than checking out the ruins."
        }, 
        {
            "index": 266, 
            "rating": "5", 
            "review": "Outstanding Ancient Structure. Another great structure within the Angkor Thom area, don't forget to take the stairs all the way up, and head to the back of the complex as well to spot the sleeping Buddha!"
        }, 
        {
            "index": 267, 
            "rating": "4", 
            "review": "Angkor - Baphuon Temple - Looked so much bigger from ground level. Moving from the Bayan Temple and heading towards the Terrace of Elephants you will find a superbly restored smaller temple called the Baphuon Temple which looks very large and impressive as you walk towards it through the various water storage lakes and along its raised walkway. Seemingly it is not a big as it seems, but it does stand out proud and would appear to be a fairly intact structure. The day we visited the gate was closed at the bottom of the steps leading up so we didn't venture to the top and possibly missed out on some great views if you read these other reports here on TA. However, for me it had a sense of grandeur in any event and the raised walkway leading to and from the temple added to this. The green coloured water surrounding it also added to the attraction. A great addition to the Angkor complex."
        }, 
        {
            "index": 268, 
            "rating": "3", 
            "review": "recently restored. Very close to the Bayon in the middle of Angkor Thom complex at the end of a raised walkway. A Hindu temple from the mid 11thC recently restored. Easily combined with visits to other nearby temples within walking distance."
        }, 
        {
            "index": 269, 
            "rating": "5", 
            "review": "My favorite temple here in Siem Reap.. The temple amazed me the courtyard on top was really great. It is close near other temples so you should definitley visit this if you are in the area near the other temples."
        }, 
        {
            "index": 270, 
            "rating": "4", 
            "review": "Nice Temple. All of these temples are pretty close so you should check this one out if you're nearby. You can climb up pretty high and get some nice pictures from above."
        }, 
        {
            "index": 271, 
            "rating": "5", 
            "review": "Simply beautiful.... I explored this temple alone... I was just walking around and saw this mountain-like temple.. i started walking through the \"bridge\" going to the temple... there were steel stairs built on the sides of that highly steep temple.. on top are courtyards and balconies and beautiful galleries... once on top, you will feel like you're a king!"
        }, 
        {
            "index": 272, 
            "rating": "4", 
            "review": "Beautiful Temple. We went by tuk-tuk to Baphuon Temple and explored ourselves. Definitely worth visiting while in Siem Reap."
        }, 
        {
            "index": 273, 
            "rating": "3", 
            "review": "Might as well visit. We bought the 3 day pass to see and tour the temples, 1st day was awesome, 2nd day was great.. 3rd day was.. All I can say was you might as well see while you're there."
        }, 
        {
            "index": 274, 
            "rating": "5", 
            "review": "Temple run, anyone?. I think when the temple run creators saw this place, they were given the inspiration to start the game. Majestic view, but with lots of climbing, but worth it as the view from the top is truly spectacular. Who knows, you might reach the door to heaven."
        }, 
        {
            "index": 275, 
            "rating": "5", 
            "review": "Beautifully restored temple. It was my good luck that the Baphuon Temple was already reconstructed when I visited it last November 2013. The first stage is reached by a wood staircase with metal railings - better and more reassuring than the rickety narrow wood staircase at Phimeanakas. At the first level were long galleries with gopuras at certain points. It was also delightful to see bas-reliefs, some with animals, and the ubiquitous apsaras. The higher levels are reached by yet another steep wooden stairs. The view from the top is great, and the breeze keeps one cool even in the heat of a Cambodian afternoon. The galleries, though, are ruined, reduced only to columns. At the middle sits the ruined central tower, its four steps of laterite cordoned off. I went down and then, at the back, saw the rough outline of the massive reclining Buddha that was carved onto the back of the Hindu temple when it turned Buddhist.For its complexity and the great views, as well as being a prime example of monument restoration, Baphuon Temple is definitely worth a visit!"
        }, 
        {
            "index": 276, 
            "rating": "4", 
            "review": "Similar to others but an excellent view. I didn't spend a lot of time wondering through the different areas of the temple. The draw is definitely the view over the manmade lakes."
        }, 
        {
            "index": 277, 
            "rating": "5", 
            "review": "Steep, Beautiful Climb. This temple was a highlight of the Angkor Thom area for me. The climb to the top is steep but the views are beautiful and it was not overly crowded at the top. Bring your camera and some water as I would consider myself in good shape but was definitely a little winded and parched as the climb is steep and the midday heat is intense."
        }, 
        {
            "index": 278, 
            "rating": "3", 
            "review": "Not for small children. If you have small children with you give this temple a pass. the reason being that children under 12 years are not alowed in the temple because of the steep climb. The guard at the gate will say no. You can still circle around the right and and see the temple from the bank on the side. Going this way also leads to a giant tree that makes good photo shot and then leadson to the back of Phimeanakas Old Gate. (Another place where children are not alowed because of the steep steps."
        }, 
        {
            "index": 279, 
            "rating": "5", 
            "review": "Just stunning!. This place is one of the highlights of the trip to Angkor Tom - so long as you can manage the climb to the top. Despite the signs of decay and the desperate need for restart of the restoration work, there is still so much to be seen and to be amazed by."
        }, 
        {
            "index": 280, 
            "rating": "5", 
            "review": "Another great temple.. There are unique carvings at the entrance of this temple. A steep ladder takes you to the top of the temple. However I missed the recling Buddha to the west of the temple. Lots of repairs are still needed."
        }, 
        {
            "index": 281, 
            "rating": "5", 
            "review": "Beware the steep climb!. The view is well-worth the climb, but if you have trouble with mobility, you should give this one a miss. A beautiful uncrowded visit, we visited just after sunrise in the morning mist."
        }, 
        {
            "index": 282, 
            "rating": "4", 
            "review": "Wonderful View from the Top. Baphuon Temples found in the Angkor Thom. You should not miss this temple because the view is absolutely amazing. There is a long bridge going into the front east gate and the ruins are fabulous. I cant explain in words you just have to go there. I would say this place is a must if you are visiting Siem Reap. You can also climb up three levels to get a view of everything around. You have to go!"
        }, 
        {
            "index": 283, 
            "rating": "4", 
            "review": "A must when in Angkor Thom. From Bayon, do not miss this temple. The French were responsible for its conservation and there are plenty of explanations about how this was done. Alas, women who wear skimpy clothing or spaghetti blouses are not allowed to climb up this pyramid-like temple."
        }, 
        {
            "index": 284, 
            "rating": "5", 
            "review": "Fantastic temple but You will need goats feet to climb the steps!!!. A fantastic temple in the Angkor Thom complex with very steep steps, Monserrat steps have been put in with handrail but even these mean that if you have any walking problems forget it!!!. If you can make it to the top it is really worth while for the view. Baphoun has many carvings, arches and would have been amazing in its full glory. On the outer wall as you leave, there is a brilliant carving of Bhudda built in to the external wall, it is about 15 meters high and approx 50 long, not complete bug if you stand back you can marvel at the craftsmanship of the stone masons a thousand years ago with no mechanical help to build something on this scale, truly amazing. Don't forget to but your 3 day pass for the temples the day before you plan your trip, you can pick up the day before from the ticket office and save yourself 2 hrs min and avoid the crowds. The tickets are valid for 7 days and can be used for any 3 days within that time."
        }, 
        {
            "index": 285, 
            "rating": "5", 
            "review": "Worth visitng. You can't have enough of it. Ancient and so much to see. You need much more time to visit this temple and feel the time."
        }, 
        {
            "index": 286, 
            "rating": "5", 
            "review": "Worth the steep hike up. Visiting the Baphuon Temple was kind of eerie, as so much of the top portion reminded me of ruins in Greece. It is absolutely beautiful and a peaceful place to visit in the midst of the Angkor crowds."
        }, 
        {
            "index": 287, 
            "rating": "4", 
            "review": "Get away from the crowds. This large temple, only a short walk from Bayon, gets remarkably few visitors. It is worth climbing all the way to the top for the views and the story about how it was put back together after the era of the Khmer Rouge is fascinating. Get your driver to drop you at Bayon and meet up with him later opposite the terrace of the Leper King"
        }, 
        {
            "index": 288, 
            "rating": "4", 
            "review": "Small but gorgeous temple. This temple was closed to the public last time I came. The unique causeway upon water was already a must see, now with the temple open, you can enjoy great view on the top, and a fully interesting discovery. The fact that there wasn't too much people visiting it was also a relief. I visited it in the evening and the lights were gorgeous through the multiple columned ways."
        }, 
        {
            "index": 289, 
            "rating": "4", 
            "review": "Climbing. NIce to get up. It is on the way to Banteay SreI, so a nice stop. The steps are not easy. Strangely the only temple that my 11 year old son was allowed to climb."
        }, 
        {
            "index": 290, 
            "rating": "5", 
            "review": "Missed it first time. Did the tour round bayan first time on bikes and completey missed Baphoun temple. Booked tuk tuk and went again, this time we got to it and its a gem, almost better than Bayan, less crowds."
        }, 
        {
            "index": 291, 
            "rating": "5", 
            "review": "worth the climb. take care and climb the stairs if you can. The view is worth it!\ndon't forget to look back to see the reclining buddha as you climb down"
        }, 
        {
            "index": 292, 
            "rating": "4", 
            "review": "Nice history to the building of it.... Bauphon seemed just another temple at first, with lots of stairs to climb! Once up top it was worth it for the views and space to move around easily, but the most interesting aspect for me was the stories and the history of the building itself. Its a collection of rebuilds, including the reuse of some of the early stones to build the later dated Reclining Buddha on the rear side. A lovely causeway leading from the road way into the temple area."
        }, 
        {
            "index": 293, 
            "rating": "4", 
            "review": "Small temple. This is much smaller as compared to Bayon Temple. But nested in a lush surroundings. If you are physically fit, go for the climb within the temple, offers a bird's eye view of the surroundings."
        }, 
        {
            "index": 294, 
            "rating": "4", 
            "review": "very nice architecture. Loved all the stone work. I need to come back when it is not high season as the amount of tourists make it very hard to enjoy such wonders, pictures are hard to take without handfuls of people walking by and barely walking room on the platforms."
        }, 
        {
            "index": 295, 
            "rating": "4", 
            "review": "Steep Climb, Cool View. It doesn't take too long to explore this mountain-style temple in the Angkor Thom complex, but it is definitely worth giving a little time to. Be sure to walk fully around its exterior in addition to climbing it, as there is an unfinished reclining Buddha worked into the stone around the back side of the temple that might otherwise be missed. The view of the surrounding forest from the top is quite superb. During rainy season the surrounding moat makes the temple especially photogenic."
        }, 
        {
            "index": 296, 
            "rating": "3", 
            "review": "Ok, but .... It was not far from the Terrace of the Elephants, so we walked to it. I liked it but there was not much to see other than pyramid structure. Still interesting though."
        }, 
        {
            "index": 297, 
            "rating": "4", 
            "review": "Second Largest Temple in Angkor Thom Complex. Aside from Bayon, this is the most significant ruin in the Angkor Thom complex and, if you are going to see Bayon you should plan on stopping here as it is just across the road. There is a long, very nicely rebuilt, causeway leading from the road out to the temple. The temple is multi-tiered and warrants a bit of exploration, as long as you are up for the very steep stirs. Unfortunately, when we visited the very top level was closed. On the back side is a very large but poorly constructed reclining Buddha that was completed when the temple was renovated from a Hindu to Buddhist temple. This is the only temple we visited where we saw them enforcing the temple dress standards so, if you have been enjoying touring in your shorts be prepared for a dress change requirement when you get here."
        }, 
        {
            "index": 298, 
            "rating": "5", 
            "review": "my favorite pyramid. walking towards baphuon is like walking into a scene of stargate movie. very imposing and dark colors you feel like there is some strange music in the background. once there the stairs are extremely steep but the view from the top is very nice. my advice, walk slowly as you aproach it and suck the atmosphere. on your way down you can either go back to where you came from or walk for a couple hundered meters in the woods to reach phimeanakas"
        }, 
        {
            "index": 299, 
            "rating": "4", 
            "review": "Great terrace. Something a little different.Something more compact.Something recently restored.Top tip?As you leave toward the rear, don't forget to turn round and try to pick out the \"reclining Buddha\" (lying on it's side) built in to the back wall."
        }, 
        {
            "index": 300, 
            "rating": "5", 
            "review": "Don't miss the Buddha lying at the side of the temple. Beautiful temple surrounded by a forest with mossy stones. There's a large Buddha lying on his side and its formed with the stones near the back. Nice to climb to the top and get a view of the surrounding areas as well."
        }, 
        {
            "index": 301, 
            "rating": "4", 
            "review": "A little different. Wonderfully restored approach to the temple and ease of access is a plus. The causeway approach is a wonderful entry with a pool of water on one side. One of the easiest temples take photos inside. A added bonus is he lack of other tourists meaning photos can be taken without others being in them."
        }, 
        {
            "index": 302, 
            "rating": "4", 
            "review": "The only way is up.. It's a short walk from Bayon to Baphuon Temple so we headed that way. It was cool to walk the long path that leads to the temple from the road. It's a three-tiered temple with the typical steep stairs and the view from the top was alright - don't expect to see an overhead view of too many things nearby, it's not \"that\" tall a structure. The climb, although steep, was not too difficult thanks to the railings. Just remember that going down is more tricky sometimes when the steps are narrow. It's still well worth the climb if you can manage it, for the satisfaction of getting the top."
        }, 
        {
            "index": 303, 
            "rating": "4", 
            "review": "its in Bayon Temple Area. Must do -if you do Bayon its not a long walk to this temple -If you only have one day In Siem Riep This is must do! Allow good 2 hours -has a steep climb via stairs but good views-also see lying buddha on rock face as you leave-you can get a guide book at site for $4-$5 and self guide thats what we did!"
        }, 
        {
            "index": 304, 
            "rating": "5", 
            "review": "Another Great Temple. Loved the reclining Buddha built into one wall. Easy to miss, but very cool and massive. Lots of art and history to enjoy at this place. Go with a tour guide for best results."
        }, 
        {
            "index": 305, 
            "rating": "4", 
            "review": "Another great temple complex.... This is another one worth adding to the list! We really enjoyed walking around here, but once again, I would try to see as many as you can after sunrise at Angkor Wat so there are less tourists around!!"
        }, 
        {
            "index": 306, 
            "rating": "3", 
            "review": "High temple mountain. This temple is still under restoration, since Khmer Rouge destroyed all the records about its structure, giving the experts many head-aches. No special carvings or bas-reliefs here, but great and rewarding views from atop if you manage your way to it through a very steep staircase, with the usual irregular steps typical of all temple mountains.A good reason for a visit is the manageable number of tourists here, you won't start screaming after a while trying to escape the temple and the hords of people."
        }, 
        {
            "index": 307, 
            "rating": "3", 
            "review": "not the original site. This site is a restored monument. Most of it is restored to give an impression of the original site. Therefore not in the same league as the rest of the monuments such as Bayon, Angkor Wat etc."
        }, 
        {
            "index": 308, 
            "rating": "4", 
            "review": "Vertigo inducing clamber. I have no head for heights but it is worth gritting your teeth and clambering to the top if only to see how many blocks remain to be put back as part of the restoration."
        }, 
        {
            "index": 309, 
            "rating": "5", 
            "review": "A puzzling dilemma from on high. This one had interesting grounds. Beautiful greenery surrounding the stones laid out during a pre-Khmer Rouge restoration project on the grounds outside. The work was resumed after that, but the KR had destroyed the records of the disassembly. So the restoration looks mostly done, but the original stones are still laid out in an unknown pattern on the grass.The tower is steep, but the wooden stairs over the stone steps make it easier to climb with the help of the guardrail (use it! The steep stairs are fairly vertiginous, and it would make your trip considerably less fun to tumble down them).Not very crowded, and worth the visit!"
        }, 
        {
            "index": 310, 
            "rating": "5", 
            "review": "Huge temple-mountain. This is one huge temple-mountain in the heart of of Angkor Thom.It is sadly collapsed and in ruined condition.However,it is under a reconstruction programme. Note the unique animal carvings at the walkway entrance. They are similar to to the ones in west Mebon. Take note of the large reclining Buddha which differs from others you will encounter."
        }, 
        {
            "index": 311, 
            "rating": "5", 
            "review": "One of my favourites!. I spent 3 days going around all the temples at Angkor Tom and Angkor Wat and this was probably one of my favourites, mainly because of the elephants and the view from the 3 levels. Also it was easy to access and move around."
        }, 
        {
            "index": 312, 
            "rating": "5", 
            "review": "What a place to be 1000years ago. if you were part of this planet 1000 years ago, i think this place is where you'd want to be instead of anything civilized and occupied/ livable condition locations on this planet then."
        }, 
        {
            "index": 313, 
            "rating": "4", 
            "review": "Interesting Temple. Fabulous temple. Fully restored. Definitely worth a look. To climb up to heaven is hot and arduous but really is worth it."
        }, 
        {
            "index": 314, 
            "rating": "4", 
            "review": "Beautiful Baphuon. Baphuon temple is like a smaller version of Pre Rup. a smaller temple which serves as your stairs to Heaven. Its like it is built so you can view the magnificent view from above. If you are not afraid of heights, you can climb to the top of this temple. We sat for few minutes to enjoy such beautiful view in such a beautiful temple."
        }, 
        {
            "index": 315, 
            "rating": "4", 
            "review": "The Pyramid. Ba Phuon temple requires sleeved clothing and covered legs upon entrance so make sure you're dressed properly. The stairs leading to the top of this 3-tiered temple are very steep so be careful. But the view is rewarding from the top. Isn't it great that they finally reconstructed this last 2011? :)"
        }, 
        {
            "index": 316, 
            "rating": "5", 
            "review": "Like a pyramid. this was my favorite site it was awe inspiring to just look at it. No visitors were allowed inside as there was work going on but I would love to go back to check it out."
        }, 
        {
            "index": 317, 
            "rating": "4", 
            "review": "Mountain temple. Huge Hindu temple largely restored. Long walkway to the entrance with water on both sides due to the rainy weather. Children below the age of 12 not allowed to enter and proper attire is required i.e clothes to cover arms and knees. Climb to the top for a view of the surroundings."
        }, 
        {
            "index": 318, 
            "rating": "5", 
            "review": "Largest 3-Dimensional Jigsaw Puzzle in the World. Seeing The Baphuon temple mountain (which was originally Hindu, then Buddhist) was a pleasant surprise on my Angkor Thom tour. While not as impressive as the nearby Bayon Temple, which is also part of Angkor Thom, it’s still an impressive sight. It was originally built in the 11th Century but large portions of it had collapsed over the centuries. When reconstruction began in the 20th Century, a 300 member team found 300,000 pieces of the temple surrounded by a jungle. It was like trying to put together a large jigsaw puzzle but they were successful and reconstruction is now complete. It’s a beautiful sight to see from afar but it’s worth climbing up the steep stairs to get a magnificent view of the surrounding jungle. Definitely make this part of your Angkor Thom tour."
        }, 
        {
            "index": 319, 
            "rating": "4", 
            "review": "A temple slowly growing in popularity. The Baphuon was originally a Hindu temple built in the 11th century but it was later converted to a Buddhist temple in the late 15th century. It is actually located within the walls of the ancient royal capital city of Angkor Thom and sits only about 200m northwest of the Bayon Temple.As the temple complex was built on sandy soil, much of the original structure had crumbled and collapsed and restoration work on the extensive ruins in later years have proven very difficult. Now, the officially restored temple draws a fairly good crowd and there are still many stone sculptures and bas reliefs on the walls and they are in fairly good condition. Although fully restored for viewing, there were still many stone slabs and blocks lying around the temple grounds waiting to be fitted into the big jigsaw puzzle. There’s no denying that the restoration work done thus far has been nothing short of fantastic and retains the many original features found in the ancient Khmer architecture.We visited the temple ruins during the rainy spell and both sides of the causeway leading to the temple complex were flooded with most of the vegetation under water. The temple building itself was a three-tier structure and built on a high square base and the highest level we ascended to was at least 30 meters high. Many visitors had decided against climbing up the extremely steep and high staircase to the top and were contented with exploring the lower level perimeter pathway, due the rain which was still drizzling the whole day. Although it was very dangerous, we took the challenge and climbed up the wet wooden steps but fortunately there were metal handrails all along the staircase to at least provide some sense of safety not only when ascending but also when descending by the same way later.After conquering the steep and wet staircase to the topmost level of the Baphuon, it was time to enjoy the breathtaking view from up there. Then it was time to descend and you can imagine the sense of relief when we touched the bottom of the stairs. Phew, what an experience!"
        }, 
        {
            "index": 320, 
            "rating": "5", 
            "review": "One for mountain goats!. A really interesting temple that is not as heavily trafficked as Bayon and Ta Prom even though it is right next door to Bayon. Great architecture and worth a look even if you don't want to climb it.But the very steep steps are worth the effort. The view from the top is terrific"
        }, 
        {
            "index": 321, 
            "rating": "5", 
            "review": "Love the elevated walkway. Adjacent to this structure is a lengthy elevated walkway that I love. Steep stairs/climbs and well-preserved archways make this structure worth a visit."
        }, 
        {
            "index": 322, 
            "rating": "5", 
            "review": "definitely worth the visit. This temple is not as popular as the others but definitely worth the visit. The walk along the bridge going to the entrance is surrounded by greenery. & the long climb up rewards you with a spectacular view. It can be quite hot going up the temple since it's mostly open (very little shade) so bring a cap/hat & lots of water. This temple also reminds me of the mobile game \"temple run\". You'll understand once you visit it.  *Visited this temple twice. It was crawling with tourists on a Saturday afternoon and practically empty on a Sunday afternoon. :)"
        }, 
        {
            "index": 323, 
            "rating": "4", 
            "review": "Worth the climb. Spectacular views from the top but a bit of a steep climb in places. There are wooden steps through out rather than having to climb on the slippery stone but still some care needs to be taken. In various stages of repair but still worth the time."
        }, 
        {
            "index": 324, 
            "rating": "5", 
            "review": "This temple is recently re-open. This temple has the Royal Enclosure, Phimeanakas, the Elephant terrace and the Terrace of the Leper King. It's very big and beautiful you can climb on top and it has an amazing view, great for pictures. And every were you walk you find all kinds of ruins is breathtaking"
        }, 
        {
            "index": 325, 
            "rating": "5", 
            "review": "newly recovered temple open for visit (lucky me, coming at right time), no shorts and no sleeveless, Not Allowed to enter if vio. interesting, huge and pretty temple, a long causeway to the temple is simply amazing. viewing from top is yet another stunning scenery. not many tourist most of the time except sunrise or sunset. tourist with shorts and sleeveless shirt are not allowed into this temple. but you can try another \"exit\" at the back of the temple to go in, if no choice."
        }, 
        {
            "index": 326, 
            "rating": "4", 
            "review": "BEAUTIFUL. The Baphuon is located in Angkor Thom, 200 meters northwest of the Bayon. But it is NOT crowded as expected - do not know why? But it made less troublesome to go up and down the stairs. It was also less noisy."
        }, 
        {
            "index": 327, 
            "rating": "5", 
            "review": "Worth the climb. Baphuon is not visited by as many people as the Bayon, which I don't quite understand because it's literally a few hundred metres away. But I guess that people who are on a tight schedule wouldn't probably bother to include most of the other temples of Angkor Thom. Therefore if you are willing to spend a bit of extra time or be thorough with your visit, Baphuon is a nice place. There are still plenty of people, just LESS people. Baphuon was the Royal Temple of the city, and they are strict about what you're wearing, so ensure your shoulders and knees are covered. They will not hesitate to turn you away if you are not properly covered. There are also a lot of incredibly steep steps but it's worth the climb and the scaffolding is safe, so take your time and enjoy the view once you get up the top.Also be careful walking through some of the low doorways, as I saw a lady hit her head and it looked quite painful. Remember that the people who used these temples were much more petite than many of us nowadays."
        }, 
        {
            "index": 328, 
            "rating": "5", 
            "review": "Simple yet Beautiful!. The touristy crowd doesn't come here, there is beautiful lush greenery surrounding this temple, and it is mounted in 4 distinct layers, its a giddy climb all the way to the top. The heat almost killed us, but we enjoyed this temple despite that."
        }, 
        {
            "index": 329, 
            "rating": "5", 
            "review": "Another beautiful temple. The temples of Bayon, Baphoun, Terrace of Elephants and Terrace of the Leper King are situated right next to one another (it's one tuk-tuk or cycle stop) and it is worth spending 2-3 hours seeing all of them. All the temples/terraces look different. The walk to the Baphoun over a bridge is amazing! Beyond the Baphoun, there is a path through the forest to two lesser-known jungle temples, which cannot be missed! You see trees and stones growing together in a way so strange, that it takes you away right to some magical 'Inca'-like universe!"
        }, 
        {
            "index": 330, 
            "rating": "4", 
            "review": "Huge Temple. Baphuon is a huge temple, it has 3 levels. There is a quite long bridge as a path to the temple, on each side of the bridge there must have been a pond, but's it's almost dry now."
        }, 
        {
            "index": 331, 
            "rating": "5", 
            "review": "Called a \"temple mountain\" by my tour guide. It is a steep and long climb up narrow stairs to the top of this temple, but the views from the top are fantastic. Best to wear a hat as the sunlight is very hot and intense."
        }, 
        {
            "index": 332, 
            "rating": "4", 
            "review": "Nice. The Baphuon is a temple at Angkor, Cambodia. It is located in Angkor Thom, northwest of the Bayon. Built in the mid-11th century, it is a three-tiered temple mountain built as the state temple of Udayadityavarman II dedicated to the Hindu God Shiva."
        }, 
        {
            "index": 333, 
            "rating": "4", 
            "review": "Probably the most spectacular Angkor temple in its time. The renovation of Baphuon Temple was interrupted by the civil war and, having taken 300,000 pieces apart the plans were destroyed so the challenge now is to restore those pieces...Even so there is a lot to see here, it is reputed to have been the most spectacular of the Angkor temples in its time and with a little imagination that is quite possible. The only way to do justice to this site is to climb and all the stairs are very steep - good shoes and take it slowly.There is a small set of display panels showing restoration work and how the temple may have looked - worth spending a bit of time over.There is a large unfinished reclining Buddha carved into the western wall at the second level, from the waist up it is clear but nothing much exists of the lower body.There are some interesting inside walkways.Our guide skipped this site on the first day of our tour so two of us went back on our own a day later and we were both glad we did - I would say do not miss it, but take your imagination along with those good shoes."
        }, 
        {
            "index": 334, 
            "rating": "4", 
            "review": "Worth the trip!. Must obey the dress code! covering with shawl doesn't help at all.I was rejected the first time, went back the other morning and it was closed. Lucky it open again after I visited Terrence of Leper King!the view from on top is awesome, you are able to walk around it to get different view. Climbing all the way up and coming down is scary too. That era people must have not afraid of heights at all!Get a guide to explain everything to you, else you will be feeling so lost up there."
        }, 
        {
            "index": 335, 
            "rating": "5", 
            "review": "Just Amazing. Baphuon was built in the middle of the 11th Century and is located 200 meters north-west of the Bayon. This single temple mountain sanctuary is situated on a high base which symbolizes Mount Meru. A highlight of the temple is the bas reliefs which are different from most others as they are carved in small stone squares set above one another on the temple walls. Much of this Temple has collapsed or been dismantled and is still under going intensive restoration. Worth the steep climb, amazing views!Allow about 1 hour to see the Baphuon."
        }, 
        {
            "index": 336, 
            "rating": "5", 
            "review": "Beautiful. Another one of the must-see sites in the Angkor region. Baphuon is a temple dedicated to Shiva and has engendered its own architectural style. Built on multiple levels, it has suffered the ravages of time but is still a beautiful sight to behold.See it."
        }, 
        {
            "index": 337, 
            "rating": "5", 
            "review": "Steep stairs. We visited here after going to see the sunrise at Angkor Wat, then Bayon. Amazing carvings as at other temples. The stairs to the top and quite steep and narrow but there is a handrail. The view from the top is worthwhile. Coming down the other side are another set of steep stairs which also have a handrail. Wear good footwear, cover knees and shoulders, take hat and water. We had a private guide to explain features and the history to us, quite necessary I think at all temples."
        }, 
        {
            "index": 338, 
            "rating": "5", 
            "review": "Amazing temple in Angkor Thom - climb to the top. Another amazing temple - there is a long way to access the temple. Take your time to fully explore the temple, around 2-3 hours. There are steep stairways up the temple and also steep stairways down the temple. The view from the top is spectacular."
        }, 
        {
            "index": 339, 
            "rating": "5", 
            "review": "Really enjoyed it. The view over the water towards the temple is breathtaking. I enjoyed this temple a lot despite all the steep climbing to get to the very top...it's a bit scary to climb down as the steps are very narrow and steep but worth the effort as you get rewarded with lovely views."
        }, 
        {
            "index": 340, 
            "rating": "5", 
            "review": "Beautiful Temple. This is one of the temple I liked the most.Firstly because it is beautiful but also because there weren't as much tourist there as everywhere else - because you have to wear over-knee and over-shoulder clothes already to get in to the temple. Take some time and rest in the shadow of Baphuon Temple or read the reliefs around it. It is beautiful!"
        }, 
        {
            "index": 341, 
            "rating": "4", 
            "review": "It will tire and scare you. The only thing I remember about this temple is that it's a grueling climb and a frightening descent."
        }, 
        {
            "index": 342, 
            "rating": "4", 
            "review": "Exercise. The stairs however are very steep and hard to get up and even more difficult to get down, but once you are there you can see Angkor Thom. Go and just do it !!!"
        }, 
        {
            "index": 343, 
            "rating": "3", 
            "review": "A little disappointing. After having seen many other temples in Angkor, Baphuon, although well restored by the French, hasn't much extras to offer. You can walk around the temple and look for the lying Bouddha at the west side."
        }, 
        {
            "index": 344, 
            "rating": "5", 
            "review": "Worth the climb!. Make sure to go all the way to the top. The view is breathtaking! Stay for a couple of minutes on top just to relax and take everything in. Go early as well to avoid the large chinese tour groups."
        }, 
        {
            "index": 345, 
            "rating": "4", 
            "review": "Climb the steps for a wonderful view. We visited the Baphoun Temple immediately after the Bayon Temple and whilst not nearly as beautiful it is very atmospheric, probably because there were very few tourists around when we arrived in the late afternoon.Largely overgrown, there are some incredibly steep steps up to the top. Halfway up, I started to regret the climb, but the view from the top was beautiful over the tree tops. Climbing down was not quite as frightening as I feared, but if you do not like heights it may be helpful to just concentrate on each step at a time."
        }, 
        {
            "index": 346, 
            "rating": "5", 
            "review": "Brilliant site which is surprisingly less recommended. Another fantastic Angkor complex site. Baphuon is located within Angkor Thom and has only recently been renovated. The causeway access to the Temple is a nice introduction to the Temple. Once inside there is information about the Temple and the restoration. Then you can climb to the top of this Temple but be warned It is a steep climb, especially in the heat, to get to the very top though well worth it. Equally I would recommend visiting if you were only able to partially climb the Temple. As said by others, the back of the Temple is not to be missed. There is a fantastic reclining Buddha built in to the wall at the back, It is a wonderful image. I would say this is a must see within the Angkor complex."
        }, 
        {
            "index": 347, 
            "rating": "5", 
            "review": "Get ready for the climb.. Baphuon is a recently restored temple in the Angkor Thom complex. It is open to the public to scale to its summit. If you want to see how Baphuon looked like before restoration, there are information boards put up at the first level of the temple as you enter through the temple's eastern gopura and across the raised causeway. Do not miss reading these boards as they give a mountain of information about the amazing restoration process and just gives you the heaviness and the complexity of putting this jigsaw of a temple together --- from the mound of dirt it started from to the temple you climb today. Outstanding difference! They even placed what the temple looked like during the Angkor Thom era (I've also uploaded it for your wonderment). After seeing this picture, you will surely go... I would've loved to see this temple in its fullness back during those day. A fair warning to visitors: even if they have built stairs over the damaged original stairs, these stairs are just as steep as the original ones. It will really test your nerves! The authorities have placed tour routes which give the visitor a route to follow around the temple. You may opt to follow this or not. However, you must at least follow the signs saying if the flight of stairs are for going up or down. It's just basic courtesy to the one going up or down and basic rule-abiding. If you conquered your fears and went up the whole temple mountain, savor your victory by looking at the view from the top. It is not really a great view. It's just tree tops and a view of the causeway and gopura below. Remember the whole area around the temple is forested so other sites will be blocked from view by the trees. Still, savor your victory. It is one of the hardest temple mountains to scale --- you had two flights of steep stairs to go up and there's still the way down. If you go down the first of the two flight of stairs down, before you go to the second, detour to your left and go outside the corridor through the windows on your left. After jumping out of this window, go left again and check out the carvings near the stairs from which you went down from. You will see carvings on the walls of typical animals: birds, deer, horses, etc. It's quite unique since I never saw any of these types of carvings at other temples. If you're done, go down the second flight of stairs.Leave at the back of the temple. Again, you will be seeing information boards, but this time it tells you about a unique sight of this temple. The whole back side of the temple is a figure of a reclining Buddha albeit not initially discernible! Another complexity of the restoration process! Wonderful indeed! DO NOT MISS! It's a unique feature unseen in other Angkor temples. I went to this temple a little past noontime. There were very few people scaling this temple so it made it less troublesome to go up and down the stairs. It was also less noisy. But, it was too hot. Remember to put on some sunscreen first! Do not miss this temple! It's the hardest to scale. It has unique carvings. It has a reclining Buddha carved to the back side of the temple. That's three enough reasons to visit this temple mountain."
        }, 
        {
            "index": 348, 
            "rating": "3", 
            "review": "\"More of the same\", anyone? :). This is a rather new addition to the touristic hype of Siem Reap, and what can I say - \"more of the same\" sums it up pretty much.There are many, many, many steps to climb, and while the view from the top IS nice, once you've visited Angkor Wat, you can skip this one for sure.A 30-minute visit is over the top for this temple."
        }, 
        {
            "index": 349, 
            "rating": "5", 
            "review": "Dress Properly. They didn't let me in because my attire was a bit inappropriate. No hurt feelings though. That I completely understand and respect. Baphuon is still an active Theravada Buddhist temple. I should've brought a long cover-up skirt to be allowed to climb this beautiful temple. I'll be more appropriate next time :)))"
        }, 
        {
            "index": 350, 
            "rating": "5", 
            "review": "Climb every mountain... temple.. Don't miss this! This isn't in most of the guidebooks (yet), and has a surprisingly low rating in Trip Advisor, presumably because this temple was recently opened to the public, after restoration work was completed some 2 years ago. I would have missed this, had my tour guide not worked this into the itinerary. What many don't know is that Baphuon is older than Angkor Wat. The view from the top is breathtaking. Best time to see it is now, when the tourist hordes haven't yet discovered it. Couple of helpful tips: (1) Make sure you wear comfortable shoes with a good grip, if you plan to scale up this temple. Baphoun is a mountain temple. Expect to walk up several flights of steep stairwells. The view of Angkor Thom once you reach the top, is worth the effort. (2) Heed the advice, offered by other reviewers, on appropriate attire; i.e. shoulders and knees must be covered. The dress code is strictly enforced."
        }, 
        {
            "index": 351, 
            "rating": "5", 
            "review": "Very tall and magnificent. This temple is very big and get ready to go up stairs. but once you are there yo can see the whole Angkor Thom."
        }, 
        {
            "index": 352, 
            "rating": "4", 
            "review": "one more !. by this time you must have seen all the great temples and therefore this one wud seem not much different... but if you have had the chance and time to see this , its a good visit !"
        }, 
        {
            "index": 353, 
            "rating": "4", 
            "review": "Ladies cover your legs and shoulders. I was not allowed to enter this temple as I had my shoulders showing, there was another lady I saw who couldnt enter as her shorts were above her knees.\nMy husband still went in and said it was fantastic so next time we go to Siem Reap I will make sure I wear a long shirt instead."
        }, 
        {
            "index": 354, 
            "rating": "3", 
            "review": "couldnt take children. I just wanted to share with everyone that you cannot take children under 12 years old into the temple or pregnant women. It must be dangerous. Just for everyone to consider. I have given it an average review only because I never got to see it as Im travelling with my 6 year old daughter."
        }, 
        {
            "index": 355, 
            "rating": "4", 
            "review": "A 'Cambodian' Pyramid. The newly look of Baphuon after long person of preservation by French government. Beautiful site in the Bayon complex. When you visiting the Terrace of Elephant then do quick visit to this monument. But many tourists visit this site."
        }, 
        {
            "index": 356, 
            "rating": "5", 
            "review": "Spectacular. This is the tallest of the temples situated on a high base. We were lucky to visit Baphuon last year, a day after it was reopened in an official ceremony after restoration and was allowed to climb right up to the top most level where a door frame stands. The time around the top level was off limits. Be prepared to climb up steep steps for a view that is truly spectacular!"
        }, 
        {
            "index": 357, 
            "rating": "5", 
            "review": "After a long restoration..finally it's open!. This temple took very long to restore. Its pyramidal shape is unique compared to the rest. But due to its shape, the stairs are steep. If not for wooden steps it will be much worse."
        }, 
        {
            "index": 358, 
            "rating": "5", 
            "review": "A steep climb. Another amazing temple populated by the Orange smilley monks.Watch the monks when no one is around and they are very funny. A sly cigaret or two.The temple is still under resurection but looks amazing a great place to sit and chill.y"
        }, 
        {
            "index": 359, 
            "rating": "5", 
            "review": "Another gem, but make sure you're prepared.... The restoration of the Baphuon has take decades but the wait and many interruptions have been worth it. This is undoubtedly one of the great sites at Angkor; the most Pyramid-like of all the temples. The modern steps up to the top (almost) on the north side of the temple offer a great view. You descend by an equally steep set of steps on the south side.But one important warning: kids under 12, pregnant women and inappropriately dressed people are not allowed in (bare shoulders seemed particularly offensive - carry a scarf in your bag and it will keep them happy). The restriction on kids does, sort of, make sense.....the climb to the top is precipitous. However, there's a question about whether - with appropriate warnings and all the doubtless legal caveats - that should be the responsibility of responsible adults. Therse is not upper age limit but I know that I'd back a 10 year old over an 80 year old to get to the top and down again."
        }, 
        {
            "index": 360, 
            "rating": "5", 
            "review": "Steep Stairs to get to the Top. Children under 12 are not allowed in this Temple as there is steep climb to the top. The view after one reaches the temple top is amazing and worth experiencing the vastness of the place. We enoyed are brief visit to this temple."
        }, 
        {
            "index": 361, 
            "rating": "3", 
            "review": "Your daily dose of exercise. Really steep stairs but once you are up, the view can be breathtaking. Try locating the face of the reclining buddha at the back of the temple. It's not very much visible as the reclining buddha was never completed. Nevertheless, it's worth the visit as it will be on your after exiting Bayon."
        }, 
        {
            "index": 362, 
            "rating": "4", 
            "review": "Steep climb to the top. This temple is nice as you can get on top of it and get some great pictures of the beautiful pathway which leads into it. The stairs however are very very steep and hard to get up and even more difficult to get down. They are strangely strict on their dress code here and didn't allow my girlfriend in with short pants. This is odd as all other temples didn't care. Something to consider."
        }, 
        {
            "index": 363, 
            "rating": "5", 
            "review": "Hidden Treasure. The Baphoun wasnt mentioned to us by guides or guidebooks and we only found it as we were at the Terrace of the Elephant king but it is amazing! A long (perhaps 400m?) pillared walkway approach then a multi tiered large temple surrounded by outlying pools and smaller structured. On the rear face is a massive (if now i poor repair) reclining Bhudda. A true hidden Treasure! Beautiful"
        }, 
        {
            "index": 364, 
            "rating": "3", 
            "review": "A real great temple. Oh dear, it is definately a great temple, or else, what took it so long to be restored? Now, Dec 2010, not yet complete.The temple was built around 1060 A.D., one hundred years before Angkor Wat. The temple, said, measured 50 m high, 130 x 103 m on the base, with 420 x 125 m enclosure, and a 200 m long causeway was built to connect the temple from the entrance gopura. According to my guidebook, the upper part of the temple fall because of the basement of the temple cannot support the weight of the whole temple. This temple is clustered together (or to be more accurate, stick together) with Terrace of Elephants, Terrace of the Leper King, and the Royal Temple. It is just 400 m from Bayon. So, although it might take more time for the temple to reclaim its former glory, it will be no harm for us to stop by and take a visit on it.http://bettyandlingshing.blogspot.com/2010/12/phnom-bakheng-and-baphuon.html"
        }, 
        {
            "index": 365, 
            "rating": "3", 
            "review": "Still hoarded up. This is within Angkor Thom a relatively short walk away from the Terrace of Elephants. Guide books will tell you that this temple would have been one of the greatest. However restoration works are still under way and you will see hoardings. It was last year and it still is as of the end of August 2008."
        }
    ]
}