{
    "category": "St-Petersburg", 
    "entity": "Grand-Maket-Russia-Interactive-Museum", 
    "avg_rating_stars": 4.609589041095891, 
    "review_count": 146, 
    "rating_stats": {
        "poor": 2, 
        "average": 6, 
        "terrible": 3, 
        "very_good": 27, 
        "excellent": 108
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "4", 
            "review": "An incredible trip to miniature land!. We went to check out this museum based on reviews in TripAdvisor. I must say, that visit was really interesting and there was much to see also for teens (and adults).. Warmly recommend! Also the film in the kino room was interesting, with subtitles in English it would have been even better. What I especially appreciate was the humour and small statements written in scenery info plates. LOL a man with saw..In general I highly respect the professional craftsmen, who offer these realistic sceneries to public! And variety of genious little details!"
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "Amazingly detailed model!. The ultimate train set. Wonderfully detailed and some tongue in cheek social commentary. Plenty to look at, so ideal for a rainy day. Obviously great for kids and adult boys!"
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "Great entertainment. Great interavtive entertainment for adults and kids ( young and teenagers). Good to visit. Takes 1,5-2 h."
        }, 
        {
            "index": 4, 
            "rating": "5", 
            "review": "спасибо ! отличное место! perfect work! thanks!. this is maga place and have nice time to see a lot of views in movement so cool !!! best time to visit on the week not at holydays . очень хорошее место лучше приходить на буднях с утра лучше все посмотрите"
        }, 
        {
            "index": 5, 
            "rating": "5", 
            "review": "Great fun for all, no matter how old you are.. We are thrilled by all the details, people who live in those cities, trains, cars, every day incidents on show. And water, like real water. Awesome. Everything was great!"
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "Unusual and interesting. A must-visit place: great miniature models of the whole country, from The Siberia to the South ( Sochi)"
        }, 
        {
            "index": 7, 
            "rating": "4", 
            "review": "very interesting visit, especially for kids. Amusing, fun, sorta interactive. Kids wold love it. As for downside its located far from center of the city, and its pretty much impossible to get out if here when it rains: all cabs are taken and closest public transportation towards the city center is solid 20 minutes walk, and then it took another 45 to get the correct bus/trolley.Do not go here during a rainy day unless you have own car or hotel is within walking distance Trip back ruined this visit."
        }, 
        {
            "index": 8, 
            "rating": "5", 
            "review": "Great fun for all ages. You will be thrilled by all the details, trains, cars, landscapes, cities, every day incidents on show. Everything created by great artistic ingenuity, technical ability and humor.You will experience life at night and during day.All of Russia on display, made real in miniature.Lights on buildings, cars, trains, signal lights create an atmosphere of real life. The site might be difficult to find. Situated 10 minutes walk from Moskovsky Prospekt and the Moskovsky Vorota metro station.Open every day.Tickets, adults 400 rubles, children 2oo rubles.Modern cafeteia serving lunch."
        }, 
        {
            "index": 9, 
            "rating": "4", 
            "review": "Enjoyed . We went with our 3 year old during one of the many rainy days of St Petersburg.We really enjoyed as a family, the models are amazing and so well done in every detail.You will not regret the visit even if it's a bit far from the centre.They are well organized: no line for the tickets and fast friendly staff at the wardrobe.The price is reasonable: 900 rubles for a family of 3."
        }, 
        {
            "index": 10, 
            "rating": "4", 
            "review": "Wonderful place to visit!. A good way to discover Russia from east to west !!Go there without any hesitation the markets are very well done and realistic"
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "Fantastic for all the family including toddlers. Went with 6 adults and 5 kids under 5. Everyone loved it. Absolutely breathtaking model of Russia complete with moving trains and other vehicles. Buttons to press to activate scenes. My 2 year old loved the fire engine scene. You can see trains underground and above ground. My 4 year old was amazed by the setup for linking east and west Russia trains in the model (they go up a spiral coil slope and through a glass tunnel above your head then down another spiral oil). Around model is a step so toddlers 3+ can easily see. You may have to lift 2 year olds in parts to give them best view.Toilets the cleanest I have ever been in! Toilet seats for toddlers, antiseptic for seats, low sinks for toddlers.Self service ikea style restaurant good value and tasty. Food Russian. options of plain pasta or rice if your toddler is particular.Recommend get there early as got a bit too busy to see with toddlers from 1pm. We got there 11 and it was pretty empty till 11:30. Need to leave prams outside and leave rucksacks in cloakroom. Can't recommend highly enough."
        }, 
        {
            "index": 12, 
            "rating": "5", 
            "review": "Great model of Russia. It has 800m2 of mini Russia, it has mini fires, lighting storms and a lot more than you can imagine in a small model. Definitely a must visit in St. Petersburg"
        }, 
        {
            "index": 13, 
            "rating": "5", 
            "review": "Must see. Its very interesting unusual museum. For every age! Open till late time. Better to visit on weekdays!"
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "Nothing but Immense Admiration for this Museum. From the minute you step inside this establishment, you immediately sense the pride and professionalism of the owner and staff. The layout itself is nothing short of absolutely amazing, and even then the staff continue to enhance and develop it, which you are able to observe through the windows of their workshop. Currently it's the second largest globally at 800 sqm. My daughter is 6 and really loved the interactive buttons to set various localised scenes in motion, a great touch. As a Marklin model railway collector myself, I was astounded. Even my initially doubtful Wife was highly impressed. My only regret is that I didn't know about it 2 years ago when I first visited St Petersburg! Recommend spending several hours here, and the bright, airy restaurant serves good, reasonably priced food. Improvements? It's easy to find with Google maps, but for those without mobile phone roaming, a simple map from Moskovskiye Vorata Metro station would be helpful on the website. Also I would suspect if the shop had a wider range of souvenirs and model railway related gifts, then it would prove very successful. Summing up however, I have Nothing but Immense Admiration for this Museum, and there is clearly a reason for its popularity amongst people of all ages. Grand Maket will definitely prove as memorable as the Marinsky and the Hermitage in St Petersburg. Fantastic."
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "Defenetly need to come back. It's really wonderful place where you can deeply dive into not real and at the same time real life. You can see all Russia less then in 1 hour and got so many new information that you won't find anywhere else.It's really nice place to visit for any age people.There is number of interactive situations: you can start a work at factory by yourself or make bikers to sing at rock-festival. You can fing different geografic zones, it's landscape, animal world and everyday normal human life in very funny, smart ot even touching details) I strongly recommend to visit this place! For getting overall view - just to spend 1 hour but it's really better to keep approx 3 hour for it -for getting all advantages of Grand Maket. You can have a rest in wonderful cafe in the midle of your trip and then continue)"
        }, 
        {
            "index": 16, 
            "rating": "5", 
            "review": "The best thing to do in St Petersburg. This place was awesome.You can reach it by Metro - get off at the Moskovskie Vorota Metro and follow the directions on the map I have included in my photos.It is an 800 m² model village / train / everything else layout depicting scenes from across Russia. They even have ceiling lights that roll across the length of the display simulating sunrise, day, sunset, and night. So much detail you couldn’t hope to see everything.Every few feet there is another button you can press to animate a section of it, like dancers, a concert, a cow getting milked, cranes operating, etc. Two sections have timed fire displays – one grass and another buildings – where the “fire” starts out small and then spreads with fire appliances coming in, lights flashing, from near and far to help douse the flames. Just brilliant. Also look underneath the surface for things like the prisoners digging an escape tunnel.If you have children, bring them here and I guarantee that no matter how much time you've spent in St Petersburg, or what you've seen THIS will be what they remember.It's all controlled by staff in a control centre that some television stations would envy.English guides are available, as are binoculars. Let that fact sink in. This is how incredibly detailed this tableau is. Look for many hidden things like some farm pigs getting intimate. My favourite was a guy in a tree sawing off the limb he is sitting on with a label that reads simply: \"Idiot.\"We had morning tea in the café which was reasonably priced and very nice.Our hotel (The Anturage) had 10% discount vouchers to Grand Maket Rossiya, so I would recommend staying there - or at least ask your hotel if they have the vouchers.There is a gift shop that sells all sorts of wonderful souvenirs. I got a set of books on St Petersburg sights that are fully legible actual books, with dust jackets, that are only 1cm tall.Just love this place - you could easily spend an entire day here."
        }, 
        {
            "index": 17, 
            "rating": "4", 
            "review": " Amazing place, but crowded . We loved the place. Amazing artworks, but crowded. Needed to be little determined in order to actually see the exhibition."
        }, 
        {
            "index": 18, 
            "rating": "5", 
            "review": "Cool place, kids and adults all enjoy!. I recommend for a ll ages! High quality reproduction of many places and activities of Russia along with geographical zones. Some funny stuff included."
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "Interesting for everyone. Even though the venue is located not in the city centre, it's easy to reach by tube. I would recommend the place for a tourist bored by common museums."
        }, 
        {
            "index": 20, 
            "rating": "4", 
            "review": "Worth the effort 👍. We visited grand maket on our own by public transport and walking our way to the venue. Tickets were a little pricy (400 roub/person, student billets couldn't get discounts), but the sheer scale and amount of detailed paid to the exhibition and miniatures made it worth the price. Burnt about 2 hours there, would have stayed even longer if we had the whole day there"
        }, 
        {
            "index": 21, 
            "rating": "5", 
            "review": "The best layout we have seen.. My son and I are very interested in modelling.\nI came here with my family as part of a two day SPB tour from a cruise ship. We were not disappointed at all\nWe all loved it and it was respite from palaces and galleries\nThis is a great place for families with a great cafe."
        }, 
        {
            "index": 22, 
            "rating": "5", 
            "review": "Very well done and interesting to see. Took the kids to the Grand Maket, thought it would be good to spend an hour since we did not have much to do on that day... And wow, ended up spending a good 3 hours, the kids did not want to leave... It is an interactive maket so well done, that adult as well as children would marvel at looking into the details... Night/ day, rain and even snow interactive event.. We love it!!!"
        }, 
        {
            "index": 23, 
            "rating": "5", 
            "review": "Unbelievable!. Wonderful and amazing! I hope that I can go back soon. But I wonder why they do not provide us some tour guides? Audio is very boring."
        }, 
        {
            "index": 24, 
            "rating": "5", 
            "review": "Very intresting!. Really recomened going there specially with children (small or teenagers), very intresting models and a proffesional work. The museum presents the smallest items from whole Russia."
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "Unique experience. It doesn't show the main cities attractions - it captures the lives of ordinary people in their natural environment. A man picking up mushroom in a forest and reading a mushroom guide about it. Spetznaz arresting smugglers on a boat - some lying face down, some standing against the wall. Great number of details. So many people, each and everyone of them is doing something.The western part was more detailed and interesting when we visited, but they keep adding things as I understand."
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "Great place to go with or without children. This is a fantastic place for everyone, Russia in miniature with moving trains, cars, etc. The lighting simulates day/night in all regions depending on the time zone. The developers' sense of humor is great (unfortunately, available only for Russian-speaking tourist)."
        }, 
        {
            "index": 27, 
            "rating": "5", 
            "review": "Fantastic Model of All Russia. The Museum has only been open a few years. It is a fantastic model of 'All Russia', such to the extent if you stay long enough you will see the phases of a normal day where the auditorium will enter darkness. Look out for the control room in the middle."
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "Amazing model of all Russian regions. This model with moving parts, 24-hour lighting, weather, etc. is great for all ages. How one can represent the essence of all Russia in one long room is a tribute to the skill of its creators. This is a fine family destination. Popular with local population."
        }, 
        {
            "index": 29, 
            "rating": "5", 
            "review": "Entertaining, detailed and with a sense of humor. An almost one-for-one replication of Russia's landscape and life, you can see each of the country's regions shown in cute toy-size towns, monuments, industrial and military sites etc.Don't expect a propaganda piece of work - apart from the achievements of Russia, you can also see oligarch's yachts, traffic jams, people scavenging metal scrap etc."
        }, 
        {
            "index": 30, 
            "rating": "1", 
            "review": "Acceptable maket but terrible staff!. Quite good maket but completely is not relevant for the real Russia. It would be much better, if it will be some of the main buildings from different region. And the staff!!!! It it impossible to be so angry and non smiling persons. This place oriented for children and the staff should be oriented for children. After some notifications - children started crying, and it is not acceptable!"
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "\"Very much entertaining and educational\". An excellent view of progress in Russia. Very useful to educate children and adults of how a good transportation system will develop the economy. Congratulation on your success !"
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "Incredible!. Another must-visit among classical route for Hermitage, Peterhof and Tsarskoe selo.Spent 2h there on my own, never bored Beside the unique idea itself, the facility is clean and safe, there are wardrobe, cafe, clean WC, small sovenir shop, Wi-Fi.Location is not the best but still doable. 10-15 min walk from metro station. Maybe i would go there by taxi next time."
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "My 7 year-old loved it!. And so did I. It's a little out of the way from the centre of town, but just 2 blocks from the Metro so still accessible.The food on location looked great (though we just had ice cream) - a range of options hot and cold, good value, and clean and attractive eating area. I would not hesitate to have lunch here.The displays are, as others have noted, comprehensive, whimsical, and expertly executed. It was great to talk about some of the different regions in Russia with my son (including Kaliningrad and polar station). It was heaving with staff, including an impressive command centre with a wall of screens for what must be one of the most sophisticated model railroads in the world. There are a number of interactive buttons for kids to push - be sure to watch the fire engines race from several stations to put out 'fires', and 'steam engines' puff into and out of stations."
        }, 
        {
            "index": 34, 
            "rating": "5", 
            "review": "Mindblowing scale, full of humour and intricately detailed. 👍. So much thought has been put into the design of this model, and so much care into it's construction and so much love into its maintenance. To allow people to get so close is generous, I can't imagine how many accidents must occur which they quickly fix.It doesn't feature all the famous monuments, but maybe that would be a waste of space; there's instead room for exciting train journeys and glimpses into everyday experiences that bring it to life. Thousands of miniatures, thousands of little moments which most people won't even notice. This place is worth spending hours at. And for everyone complaining about the children, put yourself in their shoes: imagine the wonder you had at models as a child in your home, then multiply that by a thousand.One of my favourite features is the simulation of night-time. The room gets gradually darker from East to West as the lights of buildings and vehicles illuminate, and the room hushes as storms break in the clouds. It's captivating.By no means should this be a replacement for exploring Russia in person. In fact, it should be an inspiration for exploring Russia in person. Well done, Maket team."
        }, 
        {
            "index": 35, 
            "rating": "5", 
            "review": "Great for childrens!. It is one pf the recent private museums in the city. Very interesting for childrens of for persons who are for the 1st time in Russia anf fon't understand the dimensions and variety of Russia."
        }, 
        {
            "index": 36, 
            "rating": "5", 
            "review": "Unbelievable. The whole of Russia! So many details, with so precise attention to everything. Amazing. Really hard work, but Great result!"
        }, 
        {
            "index": 37, 
            "rating": "5", 
            "review": "A good place to visit with the whole family. It is really enjoyable place. I've spent a lot of time watching these nice models of towns, trains and cars. Everything is moving, flashing, acting so no time to get bored.It is possible to rent an audioguide for an extra fee but if you choose not to do so - you will still have a plenty of good emotions.Also this place accomodates an eatery on ground floor so you can have snacks or lunch for an affordable price.Definitely it is one of the best attractions in St.Petersburg"
        }, 
        {
            "index": 38, 
            "rating": "4", 
            "review": "Amazing model. The maket was truly amazing. Full of details and so nice. When I traveled from St Petersburg to Moscow by train, I saw that nature is exactly like that maket. Actually the maket was exactly like the nature:-DOne point that made me disappointed was that, they depicted the nature of every where in Russia the same but I don't think they're the same."
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "Not to be missed. It is easy to locate using either Google Maps or Here Maps. We took the nearest metro and then walked to this place. As far as I remember, the place closes at 8 PM. It definitely requires one hour of your time.The models are very detailed. From the swimmers, depiction of a road accident and my favorite steam engine puffing smoke, every model leaves you awe struck. If I ever visit St. Pete' s again, I will definitely return to this place. A special thanks to the friendly staff here. There is a discount on the entrance ticket if you visit with your family of 4."
        }, 
        {
            "index": 40, 
            "rating": "5", 
            "review": "Great stuff. Bit of a walk but once inside the unassuming building, it is 'small boy heaven'. Someone has taken his teenage dream to the extreme and made it accessible to and enjoyable for everyone. Find the little idiosyncracies created with a good sense of humour. Easy to spend a few hours on a rainy day."
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "Amazing large scale model train set. I spent a couple of hours here and loved it. Not only is it a great train model but it's also an interesting way to get to know more about Russia. At 800 square metres the scale is impressive but in addition so much effort has gone into making it an interesting model. Male sure you look closely at each section, you will see many unique features Bd lots of little things to make you laugh."
        }, 
        {
            "index": 42, 
            "rating": "5", 
            "review": "Impressive. Highly impressive--craftsmanship, technology, creativity, and really well organized and presented. One of the best spots I've visited in Russia. Kids and parents enjoyed it!"
        }, 
        {
            "index": 43, 
            "rating": "4", 
            "review": "Model Trains for Days ( Bring Binoculars!! ). This is sold as Russia in Miniature, which is true, but coming from a place where lots of people love model trains, I'd say it's a model train exhibit. It does show all of Russia, though I doubt it's really to scale. Certain areas certainly seem to get more \"landmass\" than they really hold. The best part is noticing little scenes, like a boat being robbed or the devil in the cemetery. Really though, either bring binoculars or rent some there, because otherwise you will miss a lot. I purposefully did not rent any so that I would have something more to see when I visit again!"
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "A place to stay young. 800 square meters of miniature preentation of different cities and regions of Russia. Opened a couple of years ago and already one favourite place to visit for anybody with a young mind."
        }, 
        {
            "index": 45, 
            "rating": "5", 
            "review": "Amazing detail. Very good experience. Appreciate the detail and time spend. For all ages. Amazing. Food also good and price good. Takes about 1h30."
        }, 
        {
            "index": 46, 
            "rating": "4", 
            "review": "Amazing. I absolutely liked the ministure Russia. Lots of trains and railways. Very nice details. Would have given 5/5 if the audio guide story were a bit more \"honest\". Still highly recommend."
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "Just awesome. Just awesome. Good for grownup for kids and families. Day and night changes. Simulates storms. All signed in English. Has interactive things. Has parking and nice cafe like in Ikea. Must visit after all other musts in St.Pete."
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "Amazing!. Had so much fun, would definitely recommend to anyone! It takes at least 1.5h to go around it but you can easily spend way more time there if you want to see every detail."
        }, 
        {
            "index": 49, 
            "rating": "4", 
            "review": "Good entertainment. During our trip, we visited this place and that was really looking alike what we could see during the previous days. This was really entertaining and we recommend this \"fast\" visit."
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "Hints on this great place. If you want to have a brief look on Russia in one place — this is it!Hints:1) Try to visit it on a weekday — this place is very popular2) Prepare to spend 3-4 hours exploring Grand Maket3) Rent a binocular (250 RUR) if you want to see all that lovely details4) Rent an audio guide to get explanation on different scenes inside maquette5) Push buttons on a front panel — they activate interactive elements6) There are lot of easter eggs — try to find them all! Druncards, lovers, lovemaking animals, bigfut, UFO etc. )"
        }, 
        {
            "index": 51, 
            "rating": "4", 
            "review": "Very interesting and marvellous detail. A great way to spend a couple of hours. The models are so detailed with touches of humour and some interaction possible with the models. The staff are friendly, they have moved on from the surly Russian service of old.\nFood in the cafe was nice."
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "thrilling for visitors of any age. Once you've been to St.P. all the attractions might become boring: well, not this one. I was there with my 40 - some years old sister and both of us enjoyed it immensely!!! You can see all aspects of Russian life there: small countryside and big city life, a lot of moving parts like busses, cars, trains, cranes, etc. Military and productions sites, winter and summer, day and night... believe me, it's worth a trip.Practical advise: if you go by subway, turn right as soon as you are outside and then cross the street at second traffic lights and continue along the smaller adjoining street. If you are driving, there's a separate parking lot, so you won't have any headaches parking. Inside you get a cafe and wardrobe to leave your outside wear."
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "For the boys of all ages!. In one word - STUNNING! Great detalization, you may explore each small part of the maquette - there are no randomly putted figures or vehicles, each group of figures is a miniature presentation (I liked \"The garage secret\"). Kids would like to press special buttons and cause some actions. I did not expect the maquette is SOO BIG. I came with my kids (2 and 4 years old) and I thought we would not spend too much time there. We stayed 2 hours! My eldest son pressed all buttons, asked millions of questions and was hyper excited! 2 year old daugter was impressen by moving trains! The only problem - the maquette is quite high - so I had to lift them up in turns each 2 meters :) So if you are going with small kids - there should be one pair of hands for one kid.We visited this attraction on Tuesday evening (at 7 pm) and there were 6 more visitors, so it was no queues to the \"magic\" buttons and we were examining each object without crowding."
        }, 
        {
            "index": 54, 
            "rating": "5", 
            "review": "A joy for children!. A joy for children! The idea is great,informative,kids love to participate in miniature on the life of Russia,to discuss what they saw,in General,not in vain! I recommend!"
        }, 
        {
            "index": 55, 
            "rating": "5", 
            "review": "A must see place in St Peterburg. Amazing place to visit in St Peterburg, you can see the difference between Russian regions and their beauty in reduced view, 5 hours over there went through like an hour, careful with bringing your kids over, might be quite difficult to take them home afterwards."
        }, 
        {
            "index": 56, 
            "rating": "3", 
            "review": "Nice work with the details. I was here with a group of students but we did not have a guide which would have been nice. i am not sure if there are audio guides available but if there is I recommend. Probably Russian tourist get more out of it than foreign ones…"
        }, 
        {
            "index": 57, 
            "rating": "5", 
            "review": "Great attempt to establish a russian version of the model wonderland in Hamburg.. Not the same level of detail and fun, but on a high technical level and featuring a russian touch (like a cut trough model of a Russian nucklear submarine approaching a harbor somewhere in far north east"
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "Russia is a huge country and this is a way to get a feel of its incredible size!. We have been to THE train museum in Hamburg which is truly incredible but this is great for the glimpse it gives of Russia and all the different geographical areas. We were just visiting Moscow and Saint Petersburg. I have a feeling the people are very different all across this country- and the resources that they have are extensive. This is a good option for those with kids- younger or older. My teens did most of the palaces and the museums, so great to have something lighter that doesn't need a whole lot of explanations."
        }, 
        {
            "index": 59, 
            "rating": "3", 
            "review": "An interesting project. I went there with a group of elementary students. We all loved it. It was really great to see how massive Russia is, to see all the climatic zones and the time zones, different animals and people groups. However, it is a little bit pricey and the kids got yelled at every time they tried to touch anything. Don't go with kids!"
        }, 
        {
            "index": 60, 
            "rating": "5", 
            "review": "Amazing exhibition, just go there now! ;). I didn't expect much but I was really excited when get there. The exhibition is huge, detailed, ironical and totally awesome. Everything moves, day/night changes, different locations. Recommend to visit it before 12 pm because of many children coming there later after school. Not a good place for children (so many \"toys\" are not allowed to be touched), they only ruin the perseption of this amazing exhibition."
        }, 
        {
            "index": 61, 
            "rating": "5", 
            "review": "just absolutely cool :) for all ages. it is a total surprise, in the middle of nowhere, such very elaborate attraction, and really for all ages. We took all our kids but the youngest one (1,5 years old) and we later thought that even he would have been pleased."
        }, 
        {
            "index": 62, 
            "rating": "4", 
            "review": "For kids and miniature railway lovers. Interesting place to visit with children. Great miniatures of Russian cities with working trains, lights etc."
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "Model railways and so much more. Outstanding family attraction. We spent 2 hours walking around this wonderful attraction. 400 Roubles well spent. A little off the beaten track but still not difficult to find if you print off a map, 10 minutes walk from the metro. Even if you don't like trains, the models are exquisite, beautiful and faithful to the country. Keep an afternoon free, great on a rainy day for the whole family"
        }, 
        {
            "index": 64, 
            "rating": "1", 
            "review": "Servise accident . After we ( me and mine girlfriend) left coats in cloak area, we approached Cash box and very politely asked for two ticked. My girlfriend added that we are student. Cashier looked at us like on thieves and told very arrogant and unfriendly \" congratulations \". Then started to make tickets and so on. After couple seconds, again extremely impolite \" you have student cards?\". We gave her student cards and she immediately \" not valid, expired, 2 years old \" and gave card back. I showed her that there is sticker to confirm that card is valid. She looked at us like on thieves and gave us ticket. Not very good start, I felt all the time inside like we are not very welcomed. Cashier was old upset woman with blond hairs."
        }, 
        {
            "index": 65, 
            "rating": "5", 
            "review": "Must see if you like train layouts. This layout claims to be bigger than Miniature Wonderland in Hamburg, Germany. I'm not sure if it is bigger, but it is not better. While the Russian version is indeed spectacular and strongly recommended, the level of detail, variety, and design creativity is a bit better in Hamburg. I agree with others that you should leave 2 hours to see it. Note that there is a gift shop with an outside entrance as well as the smaller gift shop inside the main lobby. The outside one has expensive items for serious modelers. The inside one less expensive mementos"
        }, 
        {
            "index": 66, 
            "rating": "5", 
            "review": "Great place to spend 2 hours with kids. Great place to spend 2 hours with kids - to study the native country in a fascinating way. Grand Maket is a masterpiece and a must see"
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "I think, great time for everybody!. Smallest Russia ever!You should reserve 2-3 hours to explore it as it contains many awesome details that can be found not at once. ;)It's a \"must see\"."
        }, 
        {
            "index": 68, 
            "rating": "5", 
            "review": "Must see. We had wonderful time visiting this layout of Russia. The work that lies behind these beautiful sceneries is truly enormous. Beyond doubt it is a must see for all young visitors of Saint Petersburg and a great experience for adults as well."
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "Excellent view of Russia. It was amazing when I entered, I took the twin and audio in order to get the best of it.Without the audio, you will miss some important comments & as well the technical explanation of the interactive museum.The détails are very good that's why you need to take twin if you are passionate to understand this grand market.I highly recomment it with your family to have tour."
        }, 
        {
            "index": 70, 
            "rating": "5", 
            "review": "This was great! A little hard to find. I researched the museum before going to SPB but I was still blown away when I got there. I was amazed at the imagination people have to construct something like that and the details. My daughter who is 11 loved it. We crawled along looking at all the details and funny scenes and could have taken all day. The place was not very crowded which was nice. But I found the museum a little hard to find. We took a subway but had to follow GPS to walk to the museum from there. It was about 20-25 minute walk. A couple of signs to the museum would have been useful."
        }, 
        {
            "index": 71, 
            "rating": "4", 
            "review": "Great place for families with kids. My kids had a great time at this place. We went during the week, the place was not very crowded. We did not get an audio guide, just walked around, it took 2-3 hours to see it."
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "Fascinating no matter how many times you've been there. I was there with different people - young, older, men, women, IT guys, housewives, prosperous businessmen, desperate travellers who've seen a lot in their lives, etc etc, and every time everyone was amazed and couldn't stop making pictures :))) Grand Maket is done with unbelievable fantasy which excites anyone's mind!"
        }, 
        {
            "index": 73, 
            "rating": "5", 
            "review": "UNDERSTATED AND UNDER-APPRECIATED ATTRACTION. We were recommended to come here by the hotel we were staying at. As others say, a bit off the beaten track. Take the metro to Moskovskie Vorota and it is a short walk, about 10 minutes. I'd suggest you look this up and get a map before you leave.Once you are there it is a wonderful model of Russia across all its time zones, with HO gauge model trains and all the scenery that involves covering over 800 square metres. There are several levels of scenery and the whole scene shifts from night to day from Vladivostock to St Petersburg, covering every aspect of Russian commerce and life. The children will love it, as will any adult who has an appreciation for detail and modelling. My wife loved it ! The detail is exquisite."
        }, 
        {
            "index": 74, 
            "rating": "4", 
            "review": "Nice to see with kids. Nice place to see. We visited already in the past Miniatur Wunderland in Hamburg (Germany) and this is same system, just bit smaller. Nice to see details of the country. Nice for kids. You can spent there hours, but I was there with my kids near 2 hours and they enjoyed it."
        }, 
        {
            "index": 75, 
            "rating": "4", 
            "review": "Family Visit. Great for a half day visit. Russia in miniature. Incredible detail with moving trains and cars. Changed from day to night. Younger children particularly liked it. Would recommend for a visit."
        }, 
        {
            "index": 76, 
            "rating": "5", 
            "review": "Not just a children's museum!. After weeks of research to figure out what to do in Russia, I told our private guide that I wanted to go to the Grand Maket. She questioned me at first because it is known as a children's museum and we are adults in our 40's! However, I insisted we add it to our itinerary and I'm so glad we went! The only way to truly see the magnitude of Russia is to go to the Grand Maket! Wow! My husband loved it and we were truly wide eyed the entire time. I can see how this is also a fantastic place for children as well. We went on a Monday at 10am right when it opened, and had the entire place to ourselves. Great time and very educational! Russia is amazing!"
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "Awesome. Really good project about Russia, russian people and theirs life. Must see exibition for everyone take you back to the childhood."
        }, 
        {
            "index": 78, 
            "rating": "5", 
            "review": "Something for everyone. Children and adults alike will find something that catches their eye in this excellent feat of creativity and engineering. The rail network is truly astonishing with its workings on show for all to see. The night/day simulation works extremely well and is exciting for the younger party members, especially when a mock fire breaks out or lightning strikes.It's incredible to consider the amount of time that has gone into building this wonderful representation of different parts of Russia... and the longer you look, the more of the exquisite details you will see.Truly remarkable!"
        }, 
        {
            "index": 79, 
            "rating": "5", 
            "review": "Went for the kids but the adults loved it too!. If you like model trains, you will not want to miss this!We were traveling on a Baltic cruise and chose this as one of our stops on our private tour with Alla Tours. We had a party of 9, including three children ages 7, 11, and 13. The facility is new and clean and has a cafe and gift shop.The display is enormous and so incredibly detailed. Each person sees different things. Many displays were specific to Russia but many were just every day life activities and it was so fun discovering the little details. The room light turns dark and the display experiences night time and all of the building, street, and vehicle lights turn on. There are buttons to push along the way that make things move. Two of the buttons create a fire (one building, one forest) and the fire trucks arrive with sirens and extinguish the fire. Kids will love it and so will the adults!"
        }, 
        {
            "index": 80, 
            "rating": "5", 
            "review": "Very intersting museum. During the visit you can learn very much about Russia´s geogrphie and culture. A must see in Saint-Petersburg. People over 65 years pay on Monday the half-price!"
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "Miniature Russia. This museum is near Moskovsky Prospect (another part of the city). To go there, you need to hop onto the metro (choose the 2nd line which is blue) and get off at the metro station of the same name (some people say, the earlier station is more convenient). From the metro, it's a ten minutes walk. But this is worth it - less crowded and almost the same architecture as in the city centre but without the fuss.Once you reach the museum, be ready to spend at least 2 hours. The craftsmanship is breathtaking and you may spend several minutes before an exhibit trying to take everything in. As mentioned in earlier descriptions, Spb and other Russian cities are depicted in minature form.The tickets are priced slightly higher than other museums but not too steep. Enjoy"
        }, 
        {
            "index": 82, 
            "rating": "5", 
            "review": "Great persepective on Russia. Located in a 'ordinary' area, but worth the trip. A scale, complicated moving model of the regions of Russia with a large wall map at the bottom of the stairs to help you see where the places are. Russia is SO vast it covers 9 time zones, rich in oil and minerals etc ... You will come away with a much better understanding of Russia as a whole. Audio guides available. Spend 1-3 hours. For children and adults. look out for humour such as storks delivering babies to the cabbage patch!"
        }, 
        {
            "index": 83, 
            "rating": "4", 
            "review": "Actually very cool. Wasn't sure about going to this, but it's actually pretty amazing. I think if you tried to listen to all of the bits of information on your way around you'd have to be there for a week - we listened to some here and there and still spent close to 3 hours. It is definitely worth a visit!"
        }, 
        {
            "index": 84, 
            "rating": "4", 
            "review": "Interesting change from the great historical sites. We decided to visit here just for something different. The scale and detail of it is amazing, and definitely worth seeing - we haven't seen anything like it before.We all thought it was definitely worth the visit, and it has a pretty decent café there too. The only drawback is that it is rather out of the way location in a rather nondescript industrial park - there is a metro 20 minutes walk away, or go by taxi/car"
        }, 
        {
            "index": 85, 
            "rating": "4", 
            "review": "Lovely toy country!. Great fun for kids, toy lovers, model makers and anyone who loves fairy tales! The Maket represents different regions of Russia with little toy trains and buses running through. It is very lively and fun to watch, there are little scenes at every little location: a man thrown out the house, neighbours chatting over balconies, kids playing at a playground and so on. Plenty of tiny stories associated with each fragment of the layout. Time spent watching the Maket will not be wasted."
        }, 
        {
            "index": 86, 
            "rating": "5", 
            "review": "Great historical place - lots of wonderful sites. I really liked St. Petersburg, however we were constantly reminded of beware of pick-pockets. Be careful."
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "Very interesting for both kids and adults. This is very good museum both for kids and adults. You can see whole Russia within one visit, both day and night time simulated. Pay attention for little details, there is so much going on there. This maket is done with serious mind not forgetting humour. You can really spend there quite many hours if you want. Don't forget to visit the cafeteria, it was also very good."
        }, 
        {
            "index": 88, 
            "rating": "5", 
            "review": "The whole Russia within one hall!. Grand Maket Rossiya means grand model (layout) of Russia.It's a modern and very interesting museum.With the help of hundreds of moving trains and cars, people, machines one can learn of the main Russian regions, its main industries, nature, architecture etc. The whole country, from St.Petersburg to Siberia, within one hall! "
        }, 
        {
            "index": 89, 
            "rating": "5", 
            "review": "A great way to see the whole Russia. Spent 3 yrs. living in St. Pete and this place was one of the first I visited after I had moved. It's a tiny copy of the whole country within small premises. Everything is alive - trains traveling across the country, cars are moving and even overtake each other with turn lights flashing :) There're so many tiny details all across the exhibition - make sure to look deeper and find some funny details.A must-visit place while in St. Petersburg (a.k.a \"Piter\" as it's call in Russia)."
        }, 
        {
            "index": 90, 
            "rating": "4", 
            "review": "Good.... Not so bad...not really a place you travel to for fun! Maybe just for knowledge...visit it for your own experience...take your family or friends with you...its quite a good experience"
        }, 
        {
            "index": 91, 
            "rating": "5", 
            "review": "We liked it. We like models, so we really liked this one. It has some very interesting details and astonishing number of different trains!"
        }, 
        {
            "index": 92, 
            "rating": "5", 
            "review": "Fantastic overview of Russia. Really enjoyed the details of each region especially St Petersburg. The miniatures were the best I have ever seen."
        }, 
        {
            "index": 93, 
            "rating": "5", 
            "review": "Giant model village of Russia. Really detailed and interested \"model village\" representing the whole of Russia, great for kids or just for nerds. Moving parts and detailed buildings from across Mother Russia, well worth a visit!"
        }, 
        {
            "index": 94, 
            "rating": "5", 
            "review": "Visit all Russia shown in a miniature world from Siberia to Europe. Amazing miniature Russia in a 800 sqm hall. Here you will see major sights, cities and regions of Russia. Hundreds of moving trains and cars with sound and light effects. Even forest fires and traffic accidents occur. Astonishing effect of day and night changing and lights coming on in houses, cars etc. in the dark."
        }, 
        {
            "index": 95, 
            "rating": "5", 
            "review": "Excellent. Great place to visit for natives and foreigners, alone and with friends, with and without children. But plan for it not less than 1,5-2 hours!"
        }, 
        {
            "index": 96, 
            "rating": "3", 
            "review": "Russia in miniature. Imagine seeing the highlights of Russia, north to south and east to west in miniature, in a single huge room. I'm not a model/miniatures type of person but this was pretty impressive. It was crowded and took about 2 hrs to see everything w/o spending too much time in one place. If you're traveling w kids this may be a good option as a break from churches and museums."
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "Good fun for children of all ages. Most of the visitors on our early Monday morning visit were teenagers or older, but there's something magical about this attraction that makes it work no matter how old you are. The intricacy and detail is insane, from a field of 40,000 sunflowers, each no larger than your pinky nail, to little tableau of crowds and vehicles. The magic of pushing buttons and seeing these little scenes come to life is always fun, and when the room darkens and a storm strikes, you can't help but wonder at all the love that's been put into this massive, massive scene. You could easily spend an hour or two here, and on your second circuit you'll spot a bunch of details that you missed the first time around. A must-see in St. Petersburg in my opinion."
        }, 
        {
            "index": 98, 
            "rating": "5", 
            "review": "fantastic maket. absolutely must visit in saint-petersburg! seems to be quite expensive but definitely worth it. every detail is elaborated perfectly. though its not the collection of all russia's sightseeings in every region but rather generalized russia's image of all its parts it still impresses by its likelihood. u can pass there 3-4 hours scrutinizing every little detail: a cat on the car, different curtains in the windows, bears and wolves, mountain climbers, lying on the earth drunk people, different scenes of everyday life, pressing every button to see the fire being extinguished or the steaming train. children are absolutely excited, and so are the adults. you can even use binoculars and they also have audioguide."
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "Very impressive!. Very interesting and informative! Especially for the children! But adults can also here return to the childhood :) Quite a lot of interactive moments - you press the button and figures come alive. Very fun to watch the movement of trains, helicopters, fire trucks and so on. Very impressive the day and night cycles, all in the lights at night time, beautiful!I do highly recommend!"
        }, 
        {
            "index": 100, 
            "rating": "5", 
            "review": "The largest model railway in Europe?. This is the most amazing HO scale model railway I have ever seen for size and detail. It gives a tremendous panorama and insight into the railways of Russia. Most of the model motive power and rolling stock is of Russian outline, although a number of Swiss electrics are also used. Lights are dimmed for night-time sequences. The railway is massive, and reputedly larger than Miniatur Wunderland in Hamburg. For me personally, I would visit this exhibition every time I visit St Petersburg. Also next door is an excellent model shop for the purchase of Russian model railway items. This Place is a must!"
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "Must visit for at least 2 hours!!!!!!!!. This is a must visit for every adult and child. Highly informative and interactive museum about Russia, its geography, history, economy and daily life. Dont forget to buy audioguide (in german, english or russia) which will provide you with lots of useful information (the english audio is recorded by russians so due to the accent it was a bit dificult to understand sometimes). I spent over 2 hours inside, but it was worth it! There are makets- mini versions of different parts of Russia - from Moscow to Sochi to Siberia and Far East with little trains, buses, buildings - everything moves and shines, its really cool! There is also cafeteria in the buildings and cool souvenir shop where you can buy paper makets."
        }, 
        {
            "index": 102, 
            "rating": "4", 
            "review": "Very Interesting off beat thing to do in SPB. This may have been built for kids, but its very interesting for even adults! Its definitely worth seeing. The museum has a huge model of Russia.. yes, the entire country (!!) with cars and trains running through it. The detailing is very impressive. No 2 people (even though they are very tiny) look the same! You have tiny people farming, lazing on a beach, enjoying a concert, working in a submarine and even enjoying a rock concert! If there are parts of Russia you havent seen, you can see them here. You can easily spend a few hours here and hence you should go in the morning so you have enough time. This is an absolute must do if you have kids with you. They will love it."
        }, 
        {
            "index": 103, 
            "rating": "5", 
            "review": "very well done. This is one of the most interesting new attractions/alternative to a museum in St.-Petersburg. This maquet of the whole Russia is really quality made with all small details, trains, cars, buildings, trees and etc. so you could have just a small impression of how enormously huge and different Russia is. You are allowed to make photos but be careful - do not come too close because otherwise alarm system will work, the whole object is controlled with cameras and alarms system sensors. Location is not too central but it is close to \"Moskovskie vorota\" tube station. So, if it is a rainy day in St-Petersburg during your trip and it is impossible to walk around (which I always prefer to any museums even if very good museums) take your time to visit this attraction."
        }, 
        {
            "index": 104, 
            "rating": "4", 
            "review": "Cool place to go with kids. WHY WORTH SEEING: this is a gigantic model of Russia. Here you can see the main landmarks of all the parts of our country. Plus, everything is very elaborate, is I'm not mistaken, the model took 8 years to make. BEST TIME TO COME: I think the best time to go there is in the morning, so start your day of sightseeing with that. Later in the day in gets more crowded, and there is not very much free space in there in general. People crowd around the model, so you might not be able to see some parts at all. Also, of course, same as all the other things to do in St Pete, this one is way less crowded from October to April.HOW TO GET THERE: this is the hardest part of the whole review, because even I can't explain in writing how you can get there. My advice is check the map before you go and plan your route beforehand. The place in about 10-15 minutes walking from the metro station \"Moskovskie vorota\"NOT TO MISS: 1) when you enter the territory of the model, you will see people sitting behind the glass wall. They are making models and you're welcome to look at them. it's pretty cool!2) the model has all sorts of buttons. Feel free to press them (when they turn green) and some of the things will move.3) Don't miss the \"fire\" in the Northwestern part.PLEASE NOTE: I would not recommend eating in their cafe. The food is not very good quality."
        }, 
        {
            "index": 105, 
            "rating": "4", 
            "review": "Astonishingly detailed!. Huge model of various areas in Russia, covering the entire first floor of the building.This took 8 years to build and contains a number of humerous touches by the modellers - you have to look closely at what the people are doing!"
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "Mini Russia. Russia being the biggest country, would take a loong time to travel around and see the diverse parts of it. But, if you want to make a choice or see how different parts of Russia look like, you can visit this place and find out. The Grand Maket is a mini model of Russia, complete with replicas of the landscape and major attractions of each of the regions of Russia. It also gives you a view of these places at different times of the day, with changes in the lighting for day, night, evenings. Plus, for additional entertainment, there are some interactive actions that you can perform and watch the fun begin."
        }, 
        {
            "index": 107, 
            "rating": "5", 
            "review": "Perfect place for my inner child. My third miniature world and exactly as nice as the others. I love how many tiny funny jokes there are to see (escaping prisoners, boy stealing bikini top, monkey escaped from zoo with stolen handbag, etc), when you take your time to really enjoy it. We spent 4 hours at the site of which 30 minutes was spent watching a behind the scenes movie (every 2 hours in English). We spent a Saturday afternoon/evening here and it was not at all crowdedMy favourite was the two fire sites that had even fire engines arriving on site.There is a cafe on site. Easily reachable by metro and a 10-15 minute walk."
        }, 
        {
            "index": 108, 
            "rating": "3", 
            "review": "Fascinating and intricate design. This miniature scale of Russia was very well done with every train, car, person, building and animal hand painted and very realistic on a mini scale. The only thing that was kinda upsetting was there were so many kids running around push buttons for the the animations to begin and then having to wait a few minutes for it to reset. Several kids were running rampant throughout the facility and which made it kind hard to enjoy yourself. I could defiantly tell how intricate all the pieces were to make and it truly made this interactive museum very worth while. I recommend going when school would be in session to help eliminate the problem I encountered."
        }, 
        {
            "index": 109, 
            "rating": "1", 
            "review": "Overcrowded place with screaming kids. Unless you'd like to teach your under-7-year old kid about Russia with the use of cheaply assembled toys while struggling to find any information in English and being shouted at by staff who learned what customer service is from the finest USSR factories while having other children's cries ring in your ears non-stop, then this is not for you. Go out and explore yourself rather than stare at toys doing so!!!"
        }, 
        {
            "index": 110, 
            "rating": "4", 
            "review": "Very Cool, Top Notch Facility. This attraction was really well-kept. Very clean, nice little cafe near the lobby, clean restrooms. However, the scale models of the different areas of Russia were outstanding. All of the cities are displayed in painstaking detail. It's really fascinating to walk around and look at the different scenes - you push buttons and little activities happen - a tree falls over, fire trucks come to put out a fire, little ski lifts work. Then, the lights dim and simulate nightfall, then morning, then daylight. It's hard to describe, but trust me, it's really a neat place to spend a couple of hours and a great way to get a crash course on the gigantic country of Russia. Would highly recommend for a unique diversion."
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "Amazing place. Must see.. It's just fascinating. The attention to detail. Easy to get to, great facilities. Set aside 2 or 3 hours minimum to see it."
        }, 
        {
            "index": 112, 
            "rating": "5", 
            "review": "Interesting. Very interesting design of Maket with traditional Russian features. Rather big, but smaller than analog projects at europe. Reccomended for children of all ages."
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "Quirky and interesting. I never knew a model village type attraction could be so fun. I went with a massive group of school friends, and everyone seemed to love it. I would recommend this to anyone - the concept is so simply, yet so well executed. I love the interactive buttons and all the lighting and sound effects. So, so, so enjoyable!"
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "Çok hoş:). İf you travelling with child,it is a must! Very nice done makets of all regions of Russia.Trains cars and the other interactive things:)Take a binocle to see better a little surprises inside buildings and small details.Nice place! İt will take you to your childhood,especially if you have a train set when you was a little child:) Note: have in mind that this place is quite a walk from metro station !!! But it is worth it!"
        }, 
        {
            "index": 115, 
            "rating": "5", 
            "review": "Such a treasure!. We took a short taxi ride to get here, as our hotel staff advised that it was not well served by public transport. This is a dream-come-true for anyone who pays attention to detail. All of Russia is spread out in miniature with moving trains, cars, amusement parks, falling trees, flashing lightening, even chickens pecking in the dirt. The artistry is beautiful, the technology is breathtaking and our family loved it. Most impressive: although the staff spoke little English and we spoke very little Russian, they made a point of communicating to us details such as the \"making-of\" film downstairs and other details. They went out of their way to make sure we understood and that was lovely."
        }, 
        {
            "index": 116, 
            "rating": "5", 
            "review": "Astounding!. Make sure to come and see it at the beginning of the opening hours, otherwise there might be far too many people for you to enjoy the whole maket properly. However it is most definitely worth it. I have seen many museums and exhibitions during my travels, but honestly, nothing like this one. It's basically a massive set of model-train tracks on 800 square metres. The whole maket represents different regions of Russia.The detail and thought put into making it is simply amazing, you'll be stunned by how meticulously each small person or prop is. Many parts are interactive, you push the button and something happens. Fires are happening on the maket regularly, there's smoke and water from the firebrigade's pipes. Trains are running through the set, along with cars, the light is changing so you can see the whole maket in an emulated night.Unbelievable amount of work must have been put into it, so I understand there are some basic rules to make sure it won't be destroyed, i.e. taking pictures only from behind the borders of the maket and not touching anything. I believe this is a well-run attraction really worth seing, if not on your first trip to St. Petersburg, then on subsequent ones."
        }, 
        {
            "index": 117, 
            "rating": "2", 
            "review": "not worth the try. lots of unnecessary rules, long waits and gaps between the galleries. you may visit though, it is not a must. all in all i did not like it. it was not what i had expected."
        }, 
        {
            "index": 118, 
            "rating": "5", 
            "review": "Train Modeler's Dream. My wife and I visted the Grand Maket Museum. Make sure you have a map to find it, but once you get close there are signs directing you to the museum.I found it to be a great place to visit and very entertaining. There is a coat room that you have to check your coat in, for the displays are right next to you and you will see why you shouldn't have a coat with you.we were detailed at the detail of the different regions of Russia from cities, down to subways, people climbing mountains, fire engines racing to put out fires and military installtions, including cut out views of buildings and ships.They had trains and vehicles running continously. while watching they had the whole area starting in the far east go to night time and you watched as building lights came on.They have a audio guide, but we didn't take it, my wife is fluent in Russian and translated as required.They also had made models of various cruise ships in great detail, we had travel on one of them and found that interesting. As we left we saw through a glass wall the people working making building and lighting fixtures for futrure setups. While not modeler, I found this a great visit.There was also a cafe and toilet facilities that were excellent"
        }, 
        {
            "index": 119, 
            "rating": "4", 
            "review": "Good place. I've been there in summer 2014, and I was totally stunned by the size of the attraction. They filled a whole floor with a miniature world of all the nice places in Russia! From Moscow to Wladiwostok, you can find a lot of nice small places. 400 rub might be a little but to much money, but I enjoyed it anyway."
        }, 
        {
            "index": 120, 
            "rating": "5", 
            "review": "Splendid idea! Perfectly implemented!. A must-see for the whole family! Located in a ghastly region, accessible only by car, but worth the trouble."
        }, 
        {
            "index": 121, 
            "rating": "5", 
            "review": "Amazing!!!. Great installation! 3 hours as 1 minute. I intend to see Grandmaket next time, visiting Sankt-Petersburg"
        }, 
        {
            "index": 122, 
            "rating": "5", 
            "review": "PERFECT FAMILY ALTERNATIVE: A VERITABLE HERMITAGE FOR MODEL TRAIN BUFFS. I'm a solo traveler who frequently entertains visiting friends from around the world here in Saint Petersburg. I never miss a chance to take them to Grand Market Russia when they tire of the museums and the churches, and they never fail to find their \"inner child\" at this remarkable \"city\" within a city.It's hard to know how to refer to Grand Market. To call it a \"model train\" exhibit is woefully inadequate. And \"market\" seems out of place. GRAND...well, THAT is absolutely true.This particular visit was no exception - we spent well over an our marveling at this labor of love by adults who were lucky enough to turn their childhood infatuation with models into their life's work. For children, it's like Christmas morning in their wildest dreams; for adults, an impressive wonderland that will have you shaking your head at the intricacy and detail.The very BEST part is when the lights go down and night falls on the \"the city.\" You'll find yourself waiting for the next \"sunset\" several times during your visit.I've never really seen anything like Grand Market, in the 48 countries I've visited. If you have kids, your only problem is likely to be their begging and pleading to return tomorrow - and the next day, and the next.For most people, it's probably a \"Don't Miss\" experience."
        }, 
        {
            "index": 123, 
            "rating": "4", 
            "review": "Not your typical attraction.... We'd been in St Petersburg for 3 full days and quite frankly we had seen enough gold leaf, art work and amazing museums etc to last a life time. On to TA and found this place. It is a huge area, shown in the model train format, that goes through everything Russian, the regions, major cities, rivers, industries and so on. You can get an English audio guide, which I'd recommend. Kids would love it here as well."
        }, 
        {
            "index": 124, 
            "rating": "5", 
            "review": "Impressive... . I've been there in summer 2014, and I was totally stunned by the size of the attraction. They filled a whole floor with a miniature world of all the nice places in Russia! From Moscow to Wladiwostok, you can find a lot of nice small places. 400 rub might be a little but to much money, but I enjoyed it anyway."
        }, 
        {
            "index": 125, 
            "rating": "5", 
            "review": "Must see!. Amazing and unbelievable place. 800 sq.m size maquette of Russian landscape - cities, roads, trains, ships. Thousands of human figures, hundreds of moving en-route cars, scenes of life - marriage and funeral, road accidents and mass protest actions. Hard to describe it all, better to see it."
        }, 
        {
            "index": 126, 
            "rating": "5", 
            "review": "I never thought model trains could be so much fun. First, the Grand Maket Russia is a whole lot more than model trains, though the trains are at the heart of the display. It is a model of all Russia, a giant model train and car display with each region of Russia represented with representative scenery and buildings. There are churches and forest fires, archeological digs and military encampments, miniature chickens eating while equally tiny people harvest crops. It is a child's delight. Several school groups came through and one of the joys was watching the children react to a world in miniature. However, it is not just a place for kids. As an adult I was fascinated with the intricate detail and amazed as I saw models of buildings I recognized from my visits to Russia. It is indeed interactive with opportunities to press buttons which activate various actions. I was particularly taken with the tiny forest fire, complete with smoke and fire engines pumping simulated water on the flames. It is worth the visit."
        }, 
        {
            "index": 127, 
            "rating": "5", 
            "review": "Awesome place!. Cool place, absolutely should be visited! Will be interested for all genders and all ages :) A bit far from subway station."
        }, 
        {
            "index": 128, 
            "rating": "5", 
            "review": "Amazing museum. Hello from Croatia!!!I was in Saint-Petersburg for the first time with my family. My friends suggested us to visit Гранд Макет Россия)) And well.... I had great time there!!!))Everything they did there is amazing!!! It's so much work, patience, and love there!!! Every piece of it is made with love, believe me, I saw it with my own eyes.We spent at the museum more than 2 hours.And we were hungry.Yes, they have a cafe on the first floor. But! We were still hungry after it. Portions are super small :( We, Croatians, love to eat. But the cafe made us sad. The choice isn't big enough. And too much of mayonnaise!! It's not healthy!! And not so much food for kids.So, my advice: visit museum for sure!!! It's a must thing :) You'll like it!!But also you should eat somewhere before, or you'll be hungry as we were.. Yes - to museum :) , no - to a cafe :("
        }, 
        {
            "index": 129, 
            "rating": "4", 
            "review": "The perfect antidote to the high culture of St.Petersburg. After spending 4 enjoyable, but highly cultural hours in the Hermitage Museum we had scheduled an afternoon at Grand Maket. My wife was sceptical, but prepared to amuse my boyhood fascination with model trains. She became even less enthusiastic as we made the 10 minute walk from the metro station, though not the prettiest part of St.Petersburg. However, once we entered the building she was blown away, & couldn't stop taking photos. This is basically the best model railway set-up I have ever seen. It provides snap shots of all of the Russian regions, with models that are of high detail, & also with plenty of humour. We did two tours around the complex to take in all of the detail & spent about 2 hours there. I think it goes without saying that kids would love it. But it was pretty good for a couple of 50 year olds as well."
        }, 
        {
            "index": 130, 
            "rating": "3", 
            "review": "miniature world. Kids love this one - you get to see Russia with all its faces in model size. It is quite limited when it comes to interaction -just pressing some buttons to light a few places or move some things but to get a general view of Russia it's a good introduction. Also good for school children or students who are interested in Russian culture and geography."
        }, 
        {
            "index": 131, 
            "rating": "4", 
            "review": "nice for family visit. prepare to spend 2-3 hrs there. better to take an audioguide, without it you'llmiss half of pleasure."
        }, 
        {
            "index": 132, 
            "rating": "5", 
            "review": "Condensed ingenuity!. Do not miss this museum, especially when travelling with children! Its super-realistic model of all of Russia blew my mind with its detailed and candid depiction, including a hidden production site (секретный завод) and an area labelled desolation (разруха), all criss-crossed by endless numbers of moving trains. It is perhaps the most educational museum I have ever seen, teaching you about the culture, geography and economy of Russia in most compelling ways, including the pattern of day and night across the country. Dads can relive their affinity for model train sets as this is as big a train set as you will ever encounter. Just a few subway stops from the city center, this gem is an absolute must!"
        }, 
        {
            "index": 133, 
            "rating": "5", 
            "review": "Full of Witty Detail. This out-of-the-way museum is a hidden pearl of St. Petersburg, so if you have time in between your visits to all those obligatory sites, take a trip to this museum. It give you a great picture of Russia endorsed with stereotypes, generalizations and main attractions of every region. Some of the spots are interactive, which means you can press a button to make the little figurines perform some action. The miniature Russia is not done yet and is being built every day. If you take a close look, you will see memorable little scenes where the plastic people are living their lives, having good times and bad. There is even a miniature of the museum itself inside the museum! If you ask the personnel, they will tell you more about the project, but take care not to get to close to it or they will yell at you."
        }, 
        {
            "index": 134, 
            "rating": "5", 
            "review": "WOW!!! It'fantastic!. The idea as it's implemented, is really great. Worth visiting and seeing. Big generalized model of Russia that represents all the principal areas and in minor details the life scenes!"
        }, 
        {
            "index": 135, 
            "rating": "5", 
            "review": "Fantastic !!!. Never seen such wonder before, all Russia in one room. Small figures of people live their own lifes. When in st-petersburg definitely visit this place."
        }, 
        {
            "index": 136, 
            "rating": "5", 
            "review": "Spectacular. This is really a must see. A big building, very clean (you just clean your shoes before entering), with a nice Russian self service restaurant and then the exhibition. An enormous room with the miniature of the entire Russia. I think there were more than 5000 little men an women and a hundred trains all running through the room and the sceneries are really detailed. All personnel is very kind and explains how it was made"
        }, 
        {
            "index": 137, 
            "rating": "5", 
            "review": "Must see. After visiting several wonderful gardens and parks in saint petersburg this was a complete change of mood. I strongly advice anybody who visits this city to spend some hours on this masterpiece."
        }, 
        {
            "index": 138, 
            "rating": "5", 
            "review": "Must See!. Our guide had this on our itinerary because we travel with our children. This turned out to be the favorite stop for the whole family. I cannot even put into words the amount of fascination for which we all felt upon first sight of this extraordinary display of time, detail, and workmanship. You cannot help but be completely engaged as soon as you see it. I have never seen anything like it, especially of this scale, any where in the world. There is no fanfare leading up to it. The parking lot was quiet and it almost seemed as though they were not that interested in having visitors. The gift shop is small so don't worry about a big sales pitch. Just go and enjoy the most detailed model of Russia that can only be described as pure Genius!!"
        }, 
        {
            "index": 139, 
            "rating": "5", 
            "review": "Not just for kids. At first it seems like a paradise for children only, and maybe it's magic which also returns me to childhood. I also wanted toy trains as a child and the place have many of them. Houses, mountains, animals, trees and snow. Cars and trucks on the move. Buses moving in orbits stoping at stations and continue. And above all trains. Passenger trains and freight trains. Getting in and out of tunnels, Stoping in red lights and starting again. A real pleasure."
        }, 
        {
            "index": 140, 
            "rating": "5", 
            "review": "Russia in a glance. In case you'd love to travel throughout Russia but have no time/money/courage - Grand Maket is the right place to visit :) It is not the geographic model - so don't expect cities and adjusted to scale landscapes. But it shows railroads & roads, industrial sites, mountains & rivers and so on. The essence is - gallery of typical Russian life scenes that are made with great attention to details. You'll see air modelling, coal mine works, a prison, deers' pasture, Sochi ski resorts, paintball, hiking, country side houses, harvesting, garage (even with a graffity on it's wall!) and so on, and so on. Don't expect here history or cultural items, but be ready to turn into a child for three hours!"
        }, 
        {
            "index": 141, 
            "rating": "3", 
            "review": "Kid's dream or a 20 minute entertainment for an adult. 90% of visitors are kids with parents. If you're grown up enough to stop aweing from a huge toy railway set - skip that attraction, it's a enormous mechanical illumination for kids mostly ))) and has no intellectual load )))"
        }, 
        {
            "index": 142, 
            "rating": "5", 
            "review": "Visit all of Russia while watching Russians have fun with their kids. Not many tourists the day we visited, but lots of locals enjoying seeing their country through the eyes of their children. The layout of the Russian map is of course highlights - seasoned with small, everyday happenings. You can tell that the people who work on this have fun at work!"
        }, 
        {
            "index": 143, 
            "rating": "2", 
            "review": "Quite simple. Really not sure what the rave reviews are about - think exhibits are quite average at best. There are so so many other more worthwhile attractions in the city that I wouldn't recommend adding this one to your itinerary"
        }, 
        {
            "index": 144, 
            "rating": "5", 
            "review": "Thoroughly enjoyable for all ages!. As a young (29 year old) man and an engineer I was awestruck by this exhibition, an enormous display of life in Russia, all in miniatures. Every possible aspect of life is on display here, from nature to cities, industries to transportation, people working to relaxing. The attention to detail is absolutely incredible!Museum is a 10 minute walk from Moskovskii Vorota (Moscow gate) Metro, costs 450 rubles (about 11 euros) for an adult to enter, all bags must be checked, and photography is free. Beware, the place was very busy when I was there, and there were lots and lots of kids, which made it feel claustrophobic at times. In fact, I would have stayed longer if it weren't for the crowd.If you have kids, I definitely recommend bring them here, but it is truly an amazing exhibition for all ages."
        }, 
        {
            "index": 145, 
            "rating": "5", 
            "review": "An amazing work of engineering!. I was blown away by the Grand Maket! Almost all of Russia is represented here in miniature. This isn't your kid's train set! You could spend all day here and still not see all the cool details that have been worked into the scenery. The more you pay attention to the details, the more you'll be rewarded. All in all, the Grand Maket is sure to be a hit with the kids or make you feel like a kid again. A nice bonus is the command center where all the automation is monitored. Also be sure to pick up a picture book for a few bucks (not advertised, just ask)!"
        }, 
        {
            "index": 146, 
            "rating": "5", 
            "review": "The world's biggest country in miniature. As we all know Russia is the biggest country in the world. And to travel it all through is pretty hard... But this exibitions offers perfect opportunity to have slight look at the every part of the country!Don't expect every detail will be realistic and exact copy of the originals. No - to do it they would have to build the museum equal to the city by it's size! Lots of installations are schematic. But still it is amazing to watch \"sun goes down\" above plastick country in the right side of the showroom and already \"comes up\" in the left side! More than that. The installations are not static! Trains are moving, farmers are working and the lights turn on when \"the night comes\"! Really cool! St.Peresburg is represented on the biggest part of the maket and this one is the small copy of the most famous city's attractions!You can take pictures without any additional price! Worth seeing!"
        }
    ]
}