{
    "category": "St-Petersburg", 
    "entity": "State-Russian-Museum", 
    "avg_rating_stars": 4.6395939086294415, 
    "review_count": 591, 
    "rating_stats": {
        "poor": 4, 
        "average": 29, 
        "terrible": 3, 
        "very_good": 131, 
        "excellent": 424
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "The dessert for the Hermitage meal. A short distance from the Church of the Spilled blood, this museum is a treat for art lovers. I found no long lines at the ticket booth nor large tourist groups in the galleries allowing you to enjoy these great works of art at leisure.Housed in the beautiful Mikhailovsky Palace this Museum exhibits an impressive collection of Russian art from early medieval Icons to the great 19th and 20th century paintings of Surkov, Vanetsov, Vrubel, Roerich, Goncharova Kandinsky to name a few."
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "Amazing art for all senses - a jewel!. Here you find Ilja Repin, Vruebel, everything. Also the special exhibitions are always wonderful. Reserve at least 2-3 hours, and do not go hungry or tired - it is huge! Thursday evenings are for free but also very busy.Do not miss this jewel for an art museum!"
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "art collections in a beautiful palace. More do-able than the Hermitage, the collections here are fabulous - icons particularly stunning. Cheap little cafe on the premises, too, handy for tea & maybe a snack. There's even a post office there, too (we wasted ages looking for one in St P)."
        }, 
        {
            "index": 4, 
            "rating": "4", 
            "review": "Student trip to museum. Lots things to see. There must be few hours time if you would like see everything. Our guide speaks English well and the tour were interesting."
        }, 
        {
            "index": 5, 
            "rating": "5", 
            "review": "Superb. On this museum you find Russian arts from mid XIX to XX. It has also a section about folk Russian art. It with a visit for knowing more about Russian painting and have great surprises."
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "Jewel of St. Petersburg. While the Hermitage is excellent, the State Museum is the ideal place to see any Russian painters or sculptors that you love. Exhibiting only Russian artists from different periods of Russia's history, this huge museum needs a large portion of your time. It's just that good."
        }, 
        {
            "index": 7, 
            "rating": "5", 
            "review": "Great Russian collection!. Mostly visited by me for Malevich Kandinsky and other modern painters who can really make changes in Russian art. Of course something old is great too.)Toilet is too dirty for such a great museum..("
        }, 
        {
            "index": 8, 
            "rating": "5", 
            "review": "Amazing museum. What a understated gem of a museum which houses the biggest collection of Russian art and the biggest secret is, it is not crowded"
        }, 
        {
            "index": 9, 
            "rating": "5", 
            "review": "Excellent palace. This museum was once used by the erstwhile kings in the past, now maintained by the state. The interior paintings and carvings on the ceilings, walls and doors are simply superb. The craftsmen have extensively used gold to add lot of glitter to the carvings. Though in general the kings palace is very large, some of the rooms said to have been used by the family look to be compact. Anyway it's a reality and everyone visiting Russia must visit this place and enjoy the grandeur."
        }, 
        {
            "index": 10, 
            "rating": "5", 
            "review": "Great collection. This is a fantastic museum with a great collection of Russian art. We especially loved the Malevich and Kandinsky paintings and the works of some of the Russian Fauvre artists. This is a huge museum which, for some reason attracts only limited tourist interest which means one can walk straight in and purchase a ticket without any delay and the museum is quiet and uncrowded. The display of the art is also excellent. Definitely a place we would return to if we revisited St. Petersburg."
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "Definitely not second best. One hears so much about the Winter Palace and the Hermitage that it is easy to forget this wonderful museum. It was quite a revelation to us. Why had we never heard of all these talented Russian artists, we asked?\nThe displays and descriptions, helpfully translated into English, were excellent and we were impressed by the quality of the work."
        }, 
        {
            "index": 12, 
            "rating": "5", 
            "review": "Preferred to the Hermitage. A much more rewarding experience than trying to fight through the football crowds at the Hermitage. Very large and diverse exhibit, focusing more on art and related items than on building architecture. Provides an excellent overview of the history of Russian art, imagination and creativity, from the earliest iconography through to the 20th century. Very nice display of Vrubel's work, if you already been introduced to him at the Tretyakov. I would choose this over the Hermitage anyday."
        }, 
        {
            "index": 13, 
            "rating": "5", 
            "review": "One of the best in Russia. The Russian museum has a special, very calm and peaceful atmosphere. The museum has a vast collection of premium Russian painters, which is an absolute must, you've got to see and admire that."
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "Last Stop--Glad we made it. We'd had a week of seeing the glories of St Petersburg and were not at our best. Verging on exhausted and a bit glazed. But we were so very glad we made the effort to see the Russian Museum. Though we couldn't make it through the many rooms and exhibitions, we saw enough to gain a much finer appreciation of the country, the people, their history, pain, and glory, all expressed through art by artists we'd never heard of. The thematic and Scriptural parallels with great Renaissance artists and sculpture meant that many works felt familiar and were as moving as pieces we'd seen at the Hermitage. We're not proud that we knew so little of Russian art and artists prior to this visit."
        }, 
        {
            "index": 15, 
            "rating": "4", 
            "review": "Great collection of Russian artist!. Once again, it is a HUGE museum...The collection is very large and valuable, usually unknown to foreign tourists. The entire building has one spot for toilettes..."
        }, 
        {
            "index": 16, 
            "rating": "3", 
            "review": "Non accompanied visit. Interesting exhibit but more relevance to the history of Russian art and culture rather than uniformly high quality of the works"
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "A truly great Russian art gallery!. Don't skip this museum is you are an art lover. The collection is hand picked and of a manageable size. You'll never see russian art like this out side of Russia!"
        }, 
        {
            "index": 18, 
            "rating": "5", 
            "review": "Wonderful Museum.. I really like this Museum, and prefer it to the too-vast Hermitage. Apart from the art, the interior architecture is wonderful. How I would have liked to be an aristocrat! I amazed one curator by pointing out my copy of a Polenov - Moscovskiy Dvorik - was different to theirs. She explained he painted several slightly different versions. Go find it!"
        }, 
        {
            "index": 19, 
            "rating": "4", 
            "review": "Interesting for art lovers. It was interesting at first, hoewever, since the inner architecture is not as astonishing as the hermitage it got hard to look at all of these paintings."
        }, 
        {
            "index": 20, 
            "rating": "5", 
            "review": "Excellent Presentation. The State Russian Museum is extremely well presented in the Russian ethnic and diverse multicultural societies. The pride of the great mix by referring to their lifestyle and habitats give the visitors a very educational experience. Much of the museum can be easily covered with 2-3 hours without being bored. The presentation was done in such that visitors of different ages can enjoy without much reading the explanation. The plan of the museum gave the idea of seeing floor-by-floor however the place can only be visited wing-by-wing."
        }, 
        {
            "index": 21, 
            "rating": "5", 
            "review": "Amazing. Amazing museum. However, it was a bit chaotic.\nWe discovered great artists we never knew before.\nA must.\nPS. Eating at the cafeteria was nice and unexpensive."
        }, 
        {
            "index": 22, 
            "rating": "5", 
            "review": "No crowds here. As far as it comes to culture (and not to \"must see\"), the global mass group tourism has no interest. Fine! You can spend hours in this museum, and among others you can really enjoy the works of Repin."
        }, 
        {
            "index": 23, 
            "rating": "3", 
            "review": "not the first thing to do. Nice museum but should not be among the very first things to do on your list in my opinion. The collection is a bit thrown together."
        }, 
        {
            "index": 24, 
            "rating": "4", 
            "review": "A place to perceive the Russian art and culture. The museum is really interesting. I think it's one of those not numerous galleries where you actually meet the Russian art and culture, where you can observe the masterpieces of all times. Highly recommend"
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "Better than the Hermitage IMHO. Nothing short of excellent. It was my impression that here you get really interesting first-rate Russian art. The amount is manageable in one day or two half days, without the long queues and hordes of selfie-posing tourists that clog the Hermitage.\nAlso recommended: the larger of the two cafés inside."
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "Fascinating collection of Russian art. This museum is really worth visiting and much less crowded than The Hermitage! It is fascinating to see how much Russian artists were influenced by what was happening elsewhere in the world for the first two decades of the twentieth century and then how they developed, when those contacts were broken. The building itself - the Mikhailovsky Palace - is also interesting and the park outside is delightful."
        }, 
        {
            "index": 27, 
            "rating": "4", 
            "review": "Lovely Range of Russian Art. Works rarely if ever reproduced in the west, this will be a unique treat for must, of beautiful portraiture (Russian painters have a knack for capturing the personality, the essence of the subject), many grand 19th century works and a few more modern pieces, as well as a fantastic range of folk art, including a wonderful collection of spectacular Russian lacquer miniatures, on boxes and other pieces. Well worth the visit if you can fit it in with all the other gems to see in St Pete's!"
        }, 
        {
            "index": 28, 
            "rating": "4", 
            "review": "Don't miss it.. It is the largest collection of Russian art, several times the size of Tretyakov Gallery in Moscow. Don't miss to see icons, Nikitin's potraits , Ratrelli's sculpture of Anna Ivannovna wit a little Arab, the art works from the second half of the 19th century (e.g Ilya Repin) and the Russian Avant-Garde. Since museum is not crowded you'll have enough time to carefully explore artifacts. For only 800 R (cca. 11 Eur) you can buy excellent guidebook (160 pages) with illustrations much better than photos you can shoot in museum."
        }, 
        {
            "index": 29, 
            "rating": "5", 
            "review": "Stunning icons, Malevich, Serov & Repin. It takes a bit of an effort not to get lost in a complex system of stairs, but it would still be worth it! Impressive Icon collection, and jumping from there to the late 19th century: some beautiful work of Repon and Serov. Not to forget Malevich... It is quiet a miracle that the line here is so short compared to the Hermitage."
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Don't miss it! amazing... Less crowded and a bit less hunted by hungry tourists, this is surely the second best museum after Hermitage. I would recommend it even only for the wonderful palace into which it is located. You will understand a lot about russian art and culture. Plus, you'll have a more relaxing time cause is less crowded and definitely smaller than Hermitage."
        }, 
        {
            "index": 31, 
            "rating": "4", 
            "review": "A good alternative to the Hermitage. A very very good museum with works from very different times, ancient and contemporary and from different genres, sculpture, painting. Depicts very well the exquisite excellence of Russian art."
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "Russian art at its best. This museum has a wonderful collection of Russian fine and applied art as opposed to the art generally collected by museums. For those interested in Russia and its history it is a must see."
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "A hidden gem. This museum is a lot less crowded, a lot fewer non-Russian visitors - then hermitage and full of some very impressive Russian collections."
        }, 
        {
            "index": 34, 
            "rating": "5", 
            "review": "Russian Art!. If you want to see Russian Art, you come to the State Russian Museum located in the majestic white white-columned Mikhailovsky Palace and home to an extensive collection of Russian art from the 12th to the 20th centuries. This museum offers an impressive collection of 19th century works, which are housed on the second floor of the Mikhailovsky Palace which was built in 1925. This is another building designed by the Italian architect Carlo Rossi, whose work is evident across the city. In 1890, Tsar Nicholas II decided to purchase the palace for the purpose of becoming Russia’s first national gallery. It was opened to the public in 1898. The Russian Museum collection contains more than 400,000 exhibits. Over the past twenty years, the museum complex has grown to include the Stroganov Palace, St Michael's (Engineers) Castle and the Marble Palace. The complex also includes the Mikhailovsky Gardens, Engineering Gardens, Summer Garden (including the Summer Palace) and the House of Peter the Great. Admission Fee – limited wheelchair accessibility."
        }, 
        {
            "index": 35, 
            "rating": "5", 
            "review": "Worth seeing!. Great Russian art through the ages, I enjoyed Ilja Repin the most, you can have an English guide and no such crowds as in the Ermitage!"
        }, 
        {
            "index": 36, 
            "rating": "5", 
            "review": "collection of rare masterpieces. Everey time i visit \"nothern capital\" i try to reach The Russian Museum or Hermitage - last time i succeded bothso, impressions - this part of history of russsian art and painting in particular was less familiar for me, so I really enjoyed discovering itThere are always various exebitions (amids the regular ones), so U might get really lucky and see some rear exibits"
        }, 
        {
            "index": 37, 
            "rating": "4", 
            "review": "Not to be Missed. Virtually every visitor to St. Petersburg goes to the Winter Palace and Church of Spilled Blood, but the State Russian Museum should join this duo. Just a short distance from the latter site, the art collection here is very extensive, featuring Russian artists. You won't feel the oppressive crowds that you likely experience at the Winter Palace and can enjoy the art at your leisure. Most works at least have the title and artist identified in English with occasional longer explanations."
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "Exquisite altar of Russian art. A wow sort of place containing endless masterpieces less known in the West. Much lesser crowds compared to the Hermitage."
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "Collection great Russian painters. The museum not far from the Erimitage Museum. Located in the city center.You should viist if interested in Russian culture and history. Less crowded than the Erimitage museum."
        }, 
        {
            "index": 40, 
            "rating": "5", 
            "review": "An absolute highlight. The footfall here is comparatively light and there is plenty of time for the visitor to look at the truly magnificent setting as well as the art collection. And what art! A wonderful collection of icons; the developments in portraiture in the 18th century, the major movements of the 19th century. The latter included a wonderful collection of pictures by the Wanderers, with masterpieces by Ge, Repin and Brulov. If you want to get close to the Russian artistic soul come here. I could have stayed here all day (but alas had booked tickets elsewhere) and was sad to iss its more modern exhibits."
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "Museum. Just Brilliant - a definite must see. Give yourself a day, and try not to get too lost, note there are two entrances to the Palace."
        }, 
        {
            "index": 42, 
            "rating": "5", 
            "review": "First meeting with Russian art. As i grew up on westren art,i did not realised what a great treasures are waiting for us on the other side of the wall.The visit of the state Ruswsian museum is a must for every visitor and not only for art loverss.IGAL"
        }, 
        {
            "index": 43, 
            "rating": "4", 
            "review": "Instead of the Hermitage. The Hermitage is supposed to be brilliant but with 400 rooms was too much for me to consider. This Museum was still very large but somewhere that you could take in over a couple of hours or so (depending on your interest in art). Here you will find more contemporary art than you will find at the Hermitage."
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "A nice museum . So much to be seen in this Russian museum. May it be a rainy or a sunny day, the visit is worth it. From past to present and beyond. Many interesting pieces of history."
        }, 
        {
            "index": 45, 
            "rating": "5", 
            "review": "Interesting and rich. Very interesting museum, exceeding over many buildings, incl. Ethnographical museum, Museum of modern art, Marble palace"
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "Favorite of All St. Peterburg Museums. I am an avid museum go-er. I can't say anything bad about the Hermitage except if you are short on time, skip it and visit the Russian Museum! You can see European art in Western Europe, but no where else can you see the magnificence, significance and brilliance of the history of Russian (& then Soviet) art! Start with iconography and keep on going! Folk art, fine art, ceramics, lace all the way up to the present. Unfortunately the Soviet Realism is temporarily nomadic, but hopefully it'll come back soon. Plan on spending a full day (or get a 3-day pass) and get an audio guide if you can't afford to go with a tour guide! I highly recommend and will return every time I'm in the city! BTW- Vrubel is my personal favorite!"
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "More enjoyable than the hermitage . You can not and should not compare this to the hermitage with its vast collection. But the place is smaller, manageable in few hours and is focused on Russian art...we went there on Monday ( it is open while most places are closed) and it was raining. It was an enjoyable time and the only problem is the lack of English descriptions which is a real problem in Russia in general. You see different kind of artist with different landscapes and interesting modern section. Few interesting statues. I like it and would spend there 2 hours easily enjoying the place."
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "Worth every minute of visit. Precious Russian folk to fine art. The late-XIX century collection is wonderful as well as that of the interwar period. A hall is dedicated to the great Vereshchagin and several halls to carved bone and textile crafts. Take the museum plan with you, you will need it! Be sure to visit both wings, it can be confusing once you're in."
        }, 
        {
            "index": 49, 
            "rating": "3", 
            "review": "Huge art museum.. Disabled access is very poor. Disabled lift to upper floors of the annex was not working during our visit.However, the museum does contain a huge collection of art across the ages."
        }, 
        {
            "index": 50, 
            "rating": "3", 
            "review": "No Ayvazovsky . Unfortunately Ayvazovsky pictures aren't there anymore. Museum without the most popular painter is not the same anymore.Anyway you can enjoy beautiful pictures of other Russian painters, e.g. Shishkin, Repin..."
        }, 
        {
            "index": 51, 
            "rating": "4", 
            "review": "A pleasant afternoon. As we found out, St. Petersburg centre is not as vast is may appear on the tourist maps and, although the Russian Museum is a little way out if you head from Nevsky Prospeckt towards 'On The Spilled Blood' it isn't much of a walk and well worth it as, with just about everything in St. Petersburg, it is in a beautiful building. I would recommend a visit when you've ticked all your other boxes"
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "must go again. there is never enough time to enjoy the museum. amazing sculptures that attracts for hours. like the place very much. strongly recommend"
        }, 
        {
            "index": 53, 
            "rating": "3", 
            "review": "Poor. After the Hermitage, it is nothing to do here. As for me I was expecting to see different folk and historical exhibits. Unfortunately it is just a gallery of Russian paintings."
        }, 
        {
            "index": 54, 
            "rating": "5", 
            "review": "Fascinating art. Really enjoyed strolling around this museum looking at art by Russian Nationals. It wasn't all \"great art\" but it was very interesting and a rewarding experience. Also it was not awash with guided tours, although they are available if you want them.I enjoyed the folk art section too, particularly the textiles, but if you like textiles you need the Ethnographic museum next door!"
        }, 
        {
            "index": 55, 
            "rating": "5", 
            "review": "Small crowds, big art!. The most memorable museum visit while in this city rich with museums. Focused on Russian artists, the museum offers a in-depth look at art through its history. Highly recommend visiting the State Russian Museum!"
        }, 
        {
            "index": 56, 
            "rating": "4", 
            "review": "Mixed. There were,paintings for all tastes and sculptures some it was hard to others were the artist had a very good view on what the viewer would like to see."
        }, 
        {
            "index": 57, 
            "rating": "4", 
            "review": "Covers 700 years of Russian art. Has a huge range of Russian art on display ranging from medieval icons to Kandinsky all displayed within a palace. Nice way to spend a rainy day."
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "Russian Masters. All Russian artists - a great collection - if you like religious icons their collection is stunning!"
        }, 
        {
            "index": 59, 
            "rating": "4", 
            "review": "Interessting. Less crowd than ermitage. Had to wait for 35 minutes. Be early to avoid long lines. Inside restaurant is not mandatory. Food and service ok. Ambiente not what you are looking for."
        }, 
        {
            "index": 60, 
            "rating": "4", 
            "review": "Russian.... Russian museum with mainly paintings, all from Russian artists. Very good impression of Russian painting and social life.Nice palace is housing the museum. Beware of queues. They can be very long and slow..."
        }, 
        {
            "index": 61, 
            "rating": "5", 
            "review": "Loved it. A visit to this museum gives a good idea of Russian art through the centuries. We visited between 5 - 6pm, which allowed us only to see a fraction of the exhibits, but without any crowds."
        }, 
        {
            "index": 62, 
            "rating": "4", 
            "review": "Many famous paintings. In State Russian Museum you can see many famous paintings such as Repin's \"Barge Haulers on the Volga\". Unfortunately, quite many paintings have description only in Russian. This can be annoying if you are not an expert in arts. The museum is large and it is easy to get lost, if you don't take a map from the ticket office. There is a free locker where you can leave your bag."
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "A musem to see. Absolutely. A beautiful museum I visited the first night when I was in St. Petersburg.The museum is open until 21 and costs 450 rubles per person.They are works of many artists mainly Russians but also the Europeans. both paintings and sculptures.You can see a bust dedicated to Rastrelli, who designed many buildings in St. Petersburg, including the ermitage.One of the best museums I've seen, even if you have a lot of Hermitage's competition..It deserves to be seen."
        }, 
        {
            "index": 64, 
            "rating": "5", 
            "review": "A quick hour. We most enjoyed the modern art and crafts exhibit. This museum is large, but not as busy as the Hermitage and focuses on Russian art."
        }, 
        {
            "index": 65, 
            "rating": "5", 
            "review": "Love it more than Hermitage. Not so crowded, great art collection, audio guide is a must if you are not a part of a guided tour group."
        }, 
        {
            "index": 66, 
            "rating": "5", 
            "review": "Best Russian Fine Art .. Nothing for Free ,but Very cheap to get in Museum,Churches ,Etc ($ 5-7/each) .To see so much history ,art all in one place ,painting,drawing and Sculpture the best of the best in the last 1000 years ,simply amazing"
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "Spans the centuries of Russian art. The State Russian Museum occupies the Mikhailovsky Palace plus two wings (Rossi and Benois). Because my husband really needed to have a wheelchair, it was a tad challenging to get around, but the staff were helpful. I scooted up on my own to see the medieval Russian art -- not icons, as I’d expected, but some beautiful paintings of religious subjects on wood panels. We also skipped the folk and the decorative and applied art collections. All of the paintings were by Russian artists, and they spanned the 18th through the 20th Centuries, giving us a sense of how they had influenced each other, what many of them had learned in Paris, and how individual artists like Repin had developed. (Like their Danish counterparts, 19th Century Russian artists liked to paint landscapes in Italy and other sunny places.) We found the Soviet Realism especially interesting and were disappointed that the museum didn’t include propaganda posters and was rather thin on the Russian avant garde."
        }, 
        {
            "index": 68, 
            "rating": "5", 
            "review": "very good. I recomend.. I really liked, there were different type of works. I would say, that maybe even better than State Hermitage Museum"
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "Amazing Russian painters. Highly recommended if you wish to see art by Russian painters. Some pieces were huge but still so crisp and painted at such a high level, it was breathtaking. There was an upper part of the exhibition, showcasing a bit more careless and rough art style: not my thing. The museum is also way smaller than I expected, compared to the Hermitage. Nonetheless I am happy I got to see true Russian art while in St Petersburg."
        }, 
        {
            "index": 70, 
            "rating": "5", 
            "review": "Fabulous selection of Russian art. This is a tremendous selection of Russian art over many centuries, well hung in an impressive traditional building. Personnel are everywhere and can be very helpful for wayfinding."
        }, 
        {
            "index": 71, 
            "rating": "4", 
            "review": "Plan ahead to get most out. Great cafe, good value food freshly made. Very helpful staff. The 20th art work was worth seeing, enjoyed seeing Russian art work and folk crafts, discount for uk students,"
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "The Russian Museum - A Window on Rudsian Culture. The Russian Museum is a very interesting museum located in the vicinity of the Church of the Savior on Spilled Blood.What makes this museum particularly interesting is the fact that its collection features only Russian made objects. These amazing works of art range from humble folk art to imperious portraiture. This museum is an ideal companion to the Hermitage, as both museums together give a better picture of the Russian spirit."
        }, 
        {
            "index": 73, 
            "rating": "4", 
            "review": "Amazingly good and surprisingly broad collection.. Our visit to the Russian Museum was very informative. I must admit that we are not very familiar with most of the Russian painters (except the modern ones like Kandinsky, Malewitch etc.). So most of the paintings were new to us. And of course we did not like them all, but I am glad we went there and spent some time. Important to us was also the fact that there were not so many visitors (compared to for instance the Hermitage) so we could quietly walk around and look in more detail at the things that looked interesting."
        }, 
        {
            "index": 74, 
            "rating": "4", 
            "review": "Large Art Museum. This is the largest art museum in St. Petersburg after The Hermitage. While each art museum tends to be unique and specialize in a particular style. If you like the style of art they house, then you must go!"
        }, 
        {
            "index": 75, 
            "rating": "5", 
            "review": "Great museum of rich russian heritage concerning the art, design and history !. That is the site we wanted to see beside the great Hermitage Museum, since as in Moscow, we looked for something genuine russian in its provenance. And such edifice of wonderful russian art we found within the State Russian Museum. It is located in Inzhenernaya Street that is accessible from the Metro Station Gostiny Dvor in Nevsky Prospekt.The Museum has a nice location, with view at the Church of Savior on Spilled Blood, the Monument to A.S. Pushkin in front of the building,the beautiful Mikhailovsky Garden behind.Again, after the Tretyakov Gallery in Moscow we met with the great russian artists, painters. Here they are, Nikitin, Brullov, Aivazovsky ( great marin painter), then magic Ilya Repin, Victor Vasnetsov, Vasily Surikov, Valentin Serov, Boris Kustodiev and Kasimir Malevich.As to the building of the Museum, so called Mikhailovsky Palace, it has done in Neoclassical architectural design.Great pleasure for us was our visit to this splendid Museum."
        }, 
        {
            "index": 76, 
            "rating": "5", 
            "review": "Wonderful Art and Design. This is a spectacular museum. It is a maze of history, artifacts and art, with something for everyone. I particularly liked the folk art and textiles, which offered a clear insight into Russian cultures of dress and display. The artworks were great, offering a broad overview of art history, with some contemporary pieces too. You need a good 4 hours to race through, so do take your time."
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "Savor Russian artists who are less well known outside of Russia. The highlight was the very broad range of output of Russian artists, the great majority of them unknown to normal Americans like myself. For virtually every esthetic movement in Western painting in the 19th and 20th century – 19th-century everyday realism, pastoralism, impressionism, expressionism, cubism, and more – there were skilled Russian practitioners working in the same movement, and possibly others as well. Of course, the paintings also contain many references to Russian historical and cultural themes, a few of which I was able to appreciate, and the majority of which I didn’t know enough to recognize.A few other comments on the museum visit. First, we only visited the main building – Mikhailovsky Palace. The building is impressive from the outside, but much more modest on the inside, at least when compared with the Winter Palace/Hermitage interiors we’d visited the day before. It’s less spectacular, but this also can be a good thing, because the artwork doesn’t have to compete with the walls, floors, ceilings, and decorations as much. It was busy, but nowhere near as crowded as the Hermitage, or other most-popular sights in St. Petersburg, particularly with fewer tour groups. The museum is laid out in such a way that if you want to follow an easy route to tour virtually all of the rooms in chronological order, you can do so, although you don’t have to do it this way. Finally, as a practical note, use the restrooms when you first come in – we saw bathrooms right near both the main entrance and the Benois Wing entrance – because we didn’t see ones available elsewhere in the museum."
        }, 
        {
            "index": 78, 
            "rating": "5", 
            "review": "you have to see ilja Repin pictures. take the audio guide and just tell yourself that you only would like to see a part.. do not rush and for that part take your time..stick to your promise, otherwise you get the feeling you missed out so much.. better than erimitage"
        }, 
        {
            "index": 79, 
            "rating": "5", 
            "review": "Brilliant museum/art gallery.. This is a very do-able gallery with a wide range of Russian art through the ages and folk art. I had been hoping to see some art from 20th century and was delighted to find some here. Good toilets too."
        }, 
        {
            "index": 80, 
            "rating": "5", 
            "review": "Excellent addition to Hermitage visit. It has many great painting by Russian artist. To me it was especial since I saw many works previously on my textbooks. it also has a great view of old Russia."
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "Beautiful collection of Russian art. It is an impressive collection of Russian art through the ages. The buildings need a face-lift, but impressed by the breadth of the collection. The café staff were very pleasant, but the menu is limited and the space is dingy."
        }, 
        {
            "index": 82, 
            "rating": "4", 
            "review": "Much better than the Hermitage. An incredible collection, well displayed and laid out - only let downs were the very rude staff and the old-fashioned, dingy cafe."
        }, 
        {
            "index": 83, 
            "rating": "5", 
            "review": "Impressive Collection. If you go there, take the rest of the day off. It's so big, you will a have a hard time to fully get in one shot. One of the biggest collections there is."
        }, 
        {
            "index": 84, 
            "rating": "4", 
            "review": "another huge museum! Just Russian art. Well worth a walk through if you have a few days in St. Petersburg, and a quick spin - not stopping much - would take about an hour. Right next to the excellent ethnographic museum, so the two of them make a great way to spend a couple hours. 10 mins walk from Faberge."
        }, 
        {
            "index": 85, 
            "rating": "5", 
            "review": "Excellent in all ways. The museum has everything you could want to see. It is all kept in exquisite shape. Clean and beautiful. It is definitely a strong representation of all that was and is wrong with government. The museum is amazing."
        }, 
        {
            "index": 86, 
            "rating": "5", 
            "review": "Ms.. This is a wonderful museum of artworks by of very talented Russian artists. All genres of art are represented. I highly recommend it."
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "Wow! Authenic images of landscapes and events before photos. My favorite museum in St. Petersburg. They have an excellent collection of iconography and Russian Orthodox church items. However the enormous collections of art work depicting villages, battle scenes, political events and landscapes give you the history and beauty of Russia from centuries long ago."
        }, 
        {
            "index": 88, 
            "rating": "5", 
            "review": "My favourite in St.Petersbourg. If you want to know more about the russian art and to see the best russian artists - you must go the the Russia State Museum. It is huge and the collection is very rich from the ancient russian art to the modernt art such as Kandinsky and Malevitch."
        }, 
        {
            "index": 89, 
            "rating": "5", 
            "review": "Great museum . Been there a few times, very beautiful museum, a must see in Saint Petersburg, located at the center of the city, 5 minutes walking from Nevsky street. it is allowed to go in with stroller (not an often thing in Russian museums)"
        }, 
        {
            "index": 90, 
            "rating": "5", 
            "review": "Brilliant collection. The museum collection can be compared of that in Tretyakov Art Gallery in Moscow. The works of art are incredible, many of them are well-known not only to Russian people but abroad. Don`t miss it if you appreciate pictorial art."
        }, 
        {
            "index": 91, 
            "rating": "4", 
            "review": "Must-see museum, could use a few small improvements.. This is a must-see museum if you enjoy classical art. The major focus of the museum is on art of Russian artists from the 17th to the 20th centuries (mainly 18th and 19th century). There are some other exhibits as well, such as Russian folk art and Circus Arts exhibits. The museum consists of the main building and the Benoit building to which it is connected. You start out by going up the magnificent stairs to the second floor and then viewing the rooms in a counter clockwise direction. After that down to the first floor and rooms 18-35, and proceed to the Benoit building. Some featured artists are Shishkin, Repin, Serov, Kandinsky, Malevich and many others. I would give 5 stars for the collection, and 3 or even 2.5 for overall museum environment. Some reasons for the low rating of the environment. The labeling on many of the paintings is in really tiny print, and very difficult to read until you walk right up to it, even with my 20/20 vision. A significant number of the paintings are missing the year they were painted. Some translations and spelling into English are wrong or misspelled. When I first started viewing on the second floor all of the rooms were unbearably hot, even with me just wearing a tee-shirt. On top of being extremely annoying for the visitors, this cannot be good for the paintings, especially those that do not have glass protection of which there are many. Other rooms later on had open windows, which was great was the cool breeze, but again, I imagine this cannot be good for those paintings that are unprotected by glass. It also appears that the curators have not yet mastered the art of lighting displays and idea of non-reflective glass. It is virtually useless to take pictures of many of the paintings due to the really strong reflection of the the light. These were just some of my pet peeves, but do not let them stop you from visiting. Again, the collection deserves 5 stars on its own. Also, a guide might be a worthwhile idea, although I did the whole museum by myself in 3 hours and saw virtually everything."
        }, 
        {
            "index": 92, 
            "rating": "5", 
            "review": "Must see the gold Peacock Clock. Can't possibly get round everything, boiling hot day, but no liquids allowed, till you get to the Café."
        }, 
        {
            "index": 93, 
            "rating": "4", 
            "review": "Don't pay for expensive tours you Can do it yourself. State museum has lots of artBuy the 600 ruble pass to see 5 sites in one passLots of little gift shops everywhere in the museumHave cashYou can do these tours by yourself you can walk everywhereI enjoyed the decorative artsI spent 2 hours "
        }, 
        {
            "index": 94, 
            "rating": "5", 
            "review": "Marvellous Russian Art. This Museum only contains Russian art which was removed from The Winter Palace. It was quite a revelation to us, as we had never really seen any before. Really marvellous works of art and I am only sorry, we did not have longer to really look at everything, as we had for the Airport. Charming staff too."
        }, 
        {
            "index": 95, 
            "rating": "4", 
            "review": "Comprehensive collection of Russian paintings over the years. For anyone unfamiliar with Russian paintings over the year, from icons - which are fascinating - onwards this might be demanding. It is very big indeed but there are some very good works"
        }, 
        {
            "index": 96, 
            "rating": "4", 
            "review": "It's a nice musea to have a visit. If you like musea buy the allround ticket for 650 rubles and you can visit 6 musea's who work together. It was interesting musea to visit, not extreme big, 3 hours spending."
        }, 
        {
            "index": 97, 
            "rating": "3", 
            "review": "Grumpy staff. Worth a visit but make sure you are not there anywhere near closing time. Museum closes at 6 but by 5.30 pm staff are tutting and constantly checking watches as you go from room to room, shops were all locked up by 5.45 as well, unwelcoming which is a shame as a treasure trove of Russian art here."
        }, 
        {
            "index": 98, 
            "rating": "5", 
            "review": "Great art. Brilliant selection of Russian art in a more manageable quantity than other museums. Great explanations and well displayed, beautiful Malevich et al, near the Spilled Blood so can be combined with both finish at Jamies Italian for a totally inauthentic end!"
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "Incredibly large selection of top Russion paintings. Russian painters are not so well known in Europe, but they painted gigantic pictures of battles and scenes of early Russia and it's emperors. I am often visiting art museums, but I have seldom seen such beautiful paintings of Russian artists (such as their most famous painter: I. J. Repin). If you love Rembrandt and Rubens, you will love Repin. This is an art museum which is not such known to Europeans, but for the Russians an absolute MUST. I would recommend to visit it, but you should have at least some 4 hours time available."
        }, 
        {
            "index": 100, 
            "rating": "5", 
            "review": "Surprisingly not so huge as Hermitage and with perfectly arranged collection. It is located in a great palace, specially built to house an art muzeum. So after a rather tricky ground floor, which is really a labirinth where you will search for a yours cloakroom and toilets and also exits to the street or to the exposition, you will walk to a perfectly arranged collection. It is not as large as it looks, so 1 day is really enough to visit it and calmly observe the main exposition + maybe another day for the temporary excibitions. It is not inhumanly huge, complex and overcrowded like the Hermitage. Its collection is housed in rather small rooms, each of which precisely reflects steps in the history of Russian art with rather small number of paintings per each, but houses some of the most famous masterpieces of Russian artists. It`s for quality, not quantity."
        }, 
        {
            "index": 101, 
            "rating": "3", 
            "review": "Do your homework before visting. To get the best out of the Russian museum you need to do your research before you go. The place is enormous and has temporary as well as permanent exhibits - we made the mistake of just turning up and going round a large modern art exhibition which isn't my thing at all.I'd love to go back and do some research before visiting as I'm sure we missed loads but just ran out of time. Nice restaurant / café though.As with all Russian museums, check opening days and times - they often have all day and half day closing even in the height of the tourist season."
        }, 
        {
            "index": 102, 
            "rating": "5", 
            "review": "What a place!. As with all the museums, galleries etc in StP there is so much to see that a half day visit did not do this justice! An art collection you won't see anywhere else in the world."
        }, 
        {
            "index": 103, 
            "rating": "4", 
            "review": "Very helpful staff, great art. We only visited the Benois Wing:Not the palatial experience of the Hermitage, but very enjoyable as an art museum. Loved the Kandinsky, Finolov, and others. Loved the two Roerich's lining the staircase."
        }, 
        {
            "index": 104, 
            "rating": "5", 
            "review": "wonderful collection. we wandered past the Saviour of the blood church through the park and around the back to the museum. A lovely walk and a nice contrast between nature and the collection of art inside the museum. The museum is a bit more manageable that the hermitage so you don't end up getting hot and bothered and bog-eyed by the sheer vastness of the art on view. Some amazing art on display."
        }, 
        {
            "index": 105, 
            "rating": "5", 
            "review": "A must see. Fantastic museum which we hadn't intended to go to but so glad we did. Amazing paintings - we spent a good couple of hours in here."
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "Grand Art of Russia!. The State Russian Museum is the mecca of Russian Art. Take at least a day to explore the huge collection. If you are on a cultural journey through Russia, a visit here is really a must to begin piecing together the country's vast and complicated history."
        }, 
        {
            "index": 107, 
            "rating": "5", 
            "review": "History of Art. From iconic painting to modern Russian art, this is a must-visit attraction for art lovers. This could well be at least a half-day visit and ideally during the off tourist season so you are under no pressure to move on too fast inside."
        }, 
        {
            "index": 108, 
            "rating": "5", 
            "review": "invaluable art heritage. Great museum with invaluable art collection! Quite a lot of time is needed just to look it through and I think one day won't be enough to look over all exhibits.There are permanent and also temporary exhibitions. The staff is very friendly and will do all the best to help u and provide explanations if requested. Quite a lot of tiny shops on different floors for souvenir hunters. Audio guides are provided for extra charge. Very useful option for those who has time - 3-days complex ticket which is valid in all Russian Museum buildings."
        }, 
        {
            "index": 109, 
            "rating": "5", 
            "review": "For everyone who loves Russian painters. State Hermitage is amazing museum but Russian Museum is the right place for those who want to discover Russian artists (mainly painters). I have never been to Tretyakov Gallery so this was my first \"real\" encounter with Savrasov, Levitan, Aivazovsky, Shiskin, Kuindzi, Polenov, Repin and other great artists."
        }, 
        {
            "index": 110, 
            "rating": "4", 
            "review": "Great Russian paintings here. I initially wasn't too interested in coming here but am glad I did. The artworks are quite impressive in a range of styles. It is largely paintings and ranges from portraits to landscape and religious."
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "Great art museum. It only costs 400 ruble to go in and it has a very good modern Russian art section ( all I had time to see)."
        }, 
        {
            "index": 112, 
            "rating": "2", 
            "review": "Had expected more of it. I thought the Russian museum was one of the least impressive museums to visit in St Petersburg: mostly just sculptures and paintings (and a lot of paintings were from Russian painters painting in Italy or other European countries), but very few iconic paintings from the Orthodox church, virtually no communist art, no Russian photography... If you like Russian artists copying Western artists, you are at the right address, but we had hoped to see more variation."
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "The red-headed Wednesdays stepchild of the Hermitage but superb.. This is like the Hermitage \"Lite\". I highly recommend because there's a whole lot less people, tons and tons of wonderful Russian art which most people don't know anything about, even though they should and it's much smaller and can be done in 2 hours if you so desire."
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "Fairylike Russian Museum. Slowly walking and there is an wonderfull world coming to you: Beautiful paintings,furniture,statues..every room is a surprise,I do not what is nr1: the Hermitage or the Russian Museum"
        }, 
        {
            "index": 115, 
            "rating": "4", 
            "review": "Russian Art Museum is unique. Museum offers collection of Russian Art from icons to modern art, self-guided tours are available in many languages"
        }, 
        {
            "index": 116, 
            "rating": "5", 
            "review": "Great museum of Russian art. Went in not knowing much about Russian art and discovered some amazing artists that should probably be better known. I would definitely recommend this to anyone who enjoys great paintings or even to see some images of Russian history."
        }, 
        {
            "index": 117, 
            "rating": "4", 
            "review": "Beautiful. The main building of the museum is the Mikhailovsky Palace, a splendid Neoclassical residence of Grand Duke Michael Pavlovich, erected in 1819-25. Just a wonderful palace to host a wonderful collection of Russian art. The museum is rather informative and it clearly points out the development of Russian Art. If you are coming to Saint Petersburg this place is a must see."
        }, 
        {
            "index": 118, 
            "rating": "5", 
            "review": "Excellent and informative museum. I went round this museum with my daughter who is studying Russian at University and she thought it represented Russian history and culture very well. We think this should be a key visit on a visitor's itinerary."
        }, 
        {
            "index": 119, 
            "rating": "5", 
            "review": "Best Musuem to see Russian art. I visited this museum multiple times while studying in Russia. The critical artwork collection is amazing, and I consider it to be a MUST-SEE if you're visiting Petersburg."
        }, 
        {
            "index": 120, 
            "rating": "5", 
            "review": "Not to be missed!. This was a great afternoon of art. From icons to modern, the art was excellent. I rented the audio guide and that was really interesting. Plan on about 4 hours to see all the areas of this museum. I loved it."
        }, 
        {
            "index": 121, 
            "rating": "5", 
            "review": "A superb and comprehensive collection of Russias golden period. A collection covering the Academic stile to the to Russian impressionists and expresionists all together in a beautifull palace close to the Hermitage and other landmark sights in the center. If you want a focussed collection go there if you are tired of the Hermitage."
        }, 
        {
            "index": 122, 
            "rating": "5", 
            "review": "Worth it. I absolutely recommend this museum. Its collection ist just amazing! More than that - the building inside is another piece of art!"
        }, 
        {
            "index": 123, 
            "rating": "4", 
            "review": "Art place. Love art? It is defiantly your cup of tea Visit, enjoy, learn, and tell everyone to come and see It will not disappoint art lovers"
        }, 
        {
            "index": 124, 
            "rating": "5", 
            "review": "Must be seen. It is an essential to see if you are in the city. But if you like only painting. Otherwise I see it is boring."
        }, 
        {
            "index": 125, 
            "rating": "5", 
            "review": "Fantastic museum. You should not skip it. It is one of greatest museums of Russian art. Do not forget to enjoy paintings of Ivan Aivazovsky."
        }, 
        {
            "index": 126, 
            "rating": "4", 
            "review": "History galore!. Great for the whole family or solo travellers. I went and walked around the museum which is in variuous buildings, quite a good walk. Spend at least 2 hours here if you have time."
        }, 
        {
            "index": 127, 
            "rating": "5", 
            "review": "Russian Museum-the national art collection.. Russian Museum-the national art collection.Beautiful Palace created by Carlo Rossi in the 19th century holds a collection of paintings by Russian artists,together with the Tretyakov gallery and the Pushkin Museum in Moscow,will be the full experience and enjoyment by Russian masters of the brush!"
        }, 
        {
            "index": 128, 
            "rating": "5", 
            "review": "Must see. This is a \"must-see\" if you are in St. Petersburg - on of the most prominent art collections in Russia. I admit there are some flaws (mentioned by other tripadvisor members and rather typical for all Russian museums) - imperfect lighting, not very pleasant toilets, queue at the wardrobe). But they are 100% outweighted by the unique collection of Russian paintings and sculptures."
        }, 
        {
            "index": 129, 
            "rating": "4", 
            "review": "Wonderful Museum but best to schedule an excursion. Very cool museum. Good descriptions of the works in English to help, but I would suggest having a tour guide for 2 reasons. First, they are licensed and can give you a much more fulfilling experience. Secondly, they can get you into the museum without a wait, which can sometimes last for a couple hours.My favorite displays are the 6 ton bronze of Catherine the Great, the Russian folk art, and the Knight at the Crossroads.Wear comfortable shoes and plan on a few hours (inside) to get the most out of your visit."
        }, 
        {
            "index": 130, 
            "rating": "4", 
            "review": "Nice museum with a vast collection of Russian art. A nice museum with a vast collection of art. Good to visit this museum before you visit the Hermitage as the hermitage is so overwhelming. Worth to spend an afternoon here."
        }, 
        {
            "index": 131, 
            "rating": "5", 
            "review": "Good alternative to the busy Hermitage. The Russian museum is a mandatory stop each time I visit St. Petersburg. In contrast to the Hermitage, it is usually quiet, allowing for a casual stroll along my favourite works of art. Queues at the entrance are rare, and it allows exploring the various exhibits ay my own pace. The Benois wing features an impressive collection of modern Russian art in its permanent collection, as well as interesting temporary exhibits. It can be a bit hard to find, so be sure to get a map when entering the museum. It is by far my favourite museum in St. Petersburg."
        }, 
        {
            "index": 132, 
            "rating": "4", 
            "review": "One of my favorite museums !. I was born and growing up in St.Petersburg and finally after more than 20 years I visited Russian Museum again...I definitely was not disappointed: everything looked the same. I again admired the historical building and great collection of art.Please, try to spend the business day in the Russian museum: from 10 am to 6 pm. It's enough time to observe everything.You could have a lunch in the museum's cafe, but remember: credit cards are not accepted there ( though you could use it to buy tickets). I recommend to get the audio guide. And don't miss Ivan Aivazovsky's collection!"
        }, 
        {
            "index": 133, 
            "rating": "5", 
            "review": "A true gem. When we visited at Christmas we seem to be almost the only Non-Russian visitors. Wee laid out, and if you don't know Russian art you will be overwhelmed by the vast mix of subjects."
        }, 
        {
            "index": 134, 
            "rating": "5", 
            "review": "Beautiful park and amazing exhibits. The museum had a park outside of the building itself and the staff working there were very friendly. They were willing to show and guide us inside the building. Enjoyed the art exhibits the most and the QR code was definitely helpful as an alternative to having a guide for the tour."
        }, 
        {
            "index": 135, 
            "rating": "4", 
            "review": "Beautiful building and collection!. Have to say I like the looking of the museum more than the collections inside... Maybe because I did Hermitage first so Russian museum cannot easily impress me after that... Inside was a bit dated to be honest, but the collections are amazing - mainly Russian painting and art pieces - great venue to learn about Russian art of different time period!"
        }, 
        {
            "index": 136, 
            "rating": "5", 
            "review": "Don't miss the folk. A Russian friend and museum aficionado shared that the babushkas staffing each room are one of the real stressors of his museum experience. They can be possessive, grumpy sometimes even downright hostile. If it helps, remember They're also horribly underpaid. For me they add to the Russian ness of the whole thing. Nowhere more true than at the Russian museum. I was taking pictures of my favorite wooden miniatures of a posse of mice parading a bound cat and was on the receiving end first of one of the fiercest scowls I've ever witnessed, then, once I'd noticed the eyes boring into the back of my head - a heated and clearly disapproving lecture in Russian, with arm waving. Saw others, Russians, also snapping pics with impunity so I'm still not sure what was going on. Anyway, this museum has some extraordinary holdings, including great grim and charming Russian folk art. Definitely go."
        }, 
        {
            "index": 137, 
            "rating": "5", 
            "review": "wonderful. I spent all day but it was not enough,one of the reason I vent this museum to see ivan ayvazovski ,and many more famous painter such van gogh,I definetly recomend and I will definetly visit again"
        }, 
        {
            "index": 138, 
            "rating": "5", 
            "review": "Russian Art in Its Best. It originally was New Michael Palace designed by Rossi and built by Alexander I for his younger brother.If you like Russian Icons, and Russian art of the 18-20th centuries, it is the place to visit.Plan at least 3-4 hours .If you do not have much time you can see a small section of the museum based in Benua building. There are usually temporary exhibitions there."
        }, 
        {
            "index": 139, 
            "rating": "5", 
            "review": "Worth spending the whole afternoon. So many interesting local pieces! I am not an art person but the works there still impress me and hold me for the whole afternoon."
        }, 
        {
            "index": 140, 
            "rating": "5", 
            "review": "Great museum. One another must...Classical, modern art...Make sure you have one whole day...If there is a big line from the main door, go around and get inside from the Griboedov channel door."
        }, 
        {
            "index": 141, 
            "rating": "3", 
            "review": "Only for real art lovers. This is the only museum which I suggest to visit only for a real deep art lover. This museum is dedicated only to Russian art and only to paintings."
        }, 
        {
            "index": 142, 
            "rating": "5", 
            "review": "Educational introduction to Russian Artists. If icons are your thing - it is wonderful to see such ancient works from 13th and 14th Centuries. I liked the portraiture and the landscapes by artists I had not previously heard of - wonderful work. Our guide's husband gave us excellent insight into the history of Russian art."
        }, 
        {
            "index": 143, 
            "rating": "5", 
            "review": "So easy to just drop in to and enjoy. After joining a Russians only Boat Cruise that allowed us just take pictures we found just enough time to do a quick walk through this amazing collection. The Taster as after 2 hours that was all it could be has us wanting to return for more"
        }, 
        {
            "index": 144, 
            "rating": "5", 
            "review": "Wonderful museum of Russian art. This museum is definitely worth a visit! So much fabulous art which I was appalled to discover I knew nothing about!! All is displayed beautifully in splendid palatial rooms. Russian museums require you to leave your coat and bags in a cloakroom and special mention must be made of the ladies who work so hard there!! No restrictions on cameras and photography. I thought the museums icon collection was marvellous."
        }, 
        {
            "index": 145, 
            "rating": "4", 
            "review": "Large, rich, and quite beautiful. While everyone goes to the Hermitage — perhaps even more than once —, it seems that few people come to the Russian Museum, which is a shame.The collection is quite rich, the rooms beautiful, and the visit very pleasant, as I sometimes had a room to myself! You will see objects from every period of Russian civilization, up to the very modern stuff. The only thing missing, in my opinion, was \"Socialist Realism\" and Soviet art, which there were very few examples of.Enjoy your visit!"
        }, 
        {
            "index": 146, 
            "rating": "3", 
            "review": "Nothing special- not recommended for tourists. There are of course a handful of famous/beautiful works of art here but most of the artists are not well known outside Russia. Not worth the amount of time to walk through the whole thing. You would be better off spending more time at the Hermitage. The park behind the palace is beautiful."
        }, 
        {
            "index": 147, 
            "rating": "5", 
            "review": "Worth a return visit!. My husband & I were taken to the Russian Museum by our private guide & were so engaged by it, that we returned on our own for a full day. It was a real learning about Russian (only) art & the whole Russian culture - a very different experience than the collections of international art which tend to get more attention. Great English audio-guide enhanced our time & it was a pleasant walk from our Helvetia Hotel."
        }, 
        {
            "index": 148, 
            "rating": "4", 
            "review": "Nice place to visit. As opposed to the Hermitage, this place is full of Russian works. Most of them are unknown to us but they were well done. This is another place in St. P that should not be missed."
        }, 
        {
            "index": 149, 
            "rating": "5", 
            "review": "One of the greatest museums. I have always liked the Russian Museum featuring many great Russian artists. Unfortunately, my last visit was spoiled by an unbelievable rudeness of the staff in the halls."
        }, 
        {
            "index": 150, 
            "rating": "5", 
            "review": "Go for the art not the architecture.. We hired a private guide to see some places \"off the beaten path\" of the usual tours in St Petersburg and were so happy we did. Our guide was amazing. She knew every picture, artist and style of painting in the museum. While the Hermitage is on every standard tour, it has European art, and we wanted to see Russian art. It is in a palace, just not one of the more spectacular ones. But we were so glad we chose the Russian Museum. Really enjoyed the experience. Not sure how it would have been without the guide though."
        }, 
        {
            "index": 151, 
            "rating": "5", 
            "review": "Russian Museum. A great museum full of incredible Russian paintings. Each room made your eyes even wider and wider. Well worth a visit."
        }, 
        {
            "index": 152, 
            "rating": "5", 
            "review": "A really nice museum. Like I always say, I'm not really a museum person, but the museums in SPB impressed me. This museum is not quite as stunning as the Hermitage, but definitely worth seeing, as it has cool art of its own and also has memorable walls/ceilings."
        }, 
        {
            "index": 153, 
            "rating": "5", 
            "review": "More Russian art than you thought you'd ever see. Largest collection of Russian art; displayed in magnificent palace. Collections well organized. I read up on the museum before going because I didn't remember or know many artists. Was unable to take a tour. Easier on the eyes and feet than the Hermitage."
        }, 
        {
            "index": 154, 
            "rating": "5", 
            "review": "Do not miss this art palace - it can rival any art gallery in the world. Very big if not bigger than the famous Tretyakov Gallery (also only housing Russian artist works). It's a confusing to me which is which since I went into two separate buildings with separate admission ticket. The first building I went in is probably The Stroganov Palace, built on the corner of Nevsky Prospekt . Since I didn't see some of the famous paintings I was expecting to see, I asked where they are. Then I was directed to The Mikhailovsky Palace, which is the main building. Yes, you need to buy a separate ticket here but it's so worth it. There are noticeably some of the same paintings you would see in Tretyakov Gallery and I don't understand why. I'm still digging into the information. BTW-there's very limited English translation anywhere in Russia. I usually purchase the museum guide book (catalogue) for me to read during and after my visit. This is a grand museum with beautiful palaces. Those paintings are memorable and you can only experience by seeing the color, the large scale and the striking depiction in person."
        }, 
        {
            "index": 155, 
            "rating": "5", 
            "review": "Enjoy!. This is a huge building. I was impressed by how well-maintained this and other Russian attractions are kept."
        }, 
        {
            "index": 156, 
            "rating": "4", 
            "review": "Perfect day off from Hermitage. We visited the museum on Monday (the day the Hermitage is closed) and we're glad we did. Unlike the Hermitage it ONLY features Russian artists and exhibited a wonderful display from early iconography through to 20 century/ modernist masters. It is not as \"well loved\" on the inside (some chipped/ mismatched paint) but the main interiors and salons are spacious and well lit. It also houses two beautiful and MASSIVE works from Ivan Aivazovsky. A Russian master who did stunning seascapes -- (actually he painted over 6000 pieces). It also holds a very impressive Last Day of Pompeii and Bruni's The Brazen Serpent (which is the largest canvas in their collection). There are also smaller table sized showcases (covered with velvet flaps) around the edges of the largest rooms. It's a little confusing but visitors are welcome to lift these little flaps and view beautiful little pen and ink, oil and watercolor drawings hidden beneath them (to prevent them from fading) The only thing I didn't like was the museum itself was a little disjointed/ maze like as it is comprised of 2 separate buildings. I also thought the rented audio guide was good-- but wished more artworks were covered by it."
        }, 
        {
            "index": 157, 
            "rating": "4", 
            "review": "Russian paintings. a place to go if you like Russian painters, a huge collection of paintings there, including Vrubel..."
        }, 
        {
            "index": 158, 
            "rating": "5", 
            "review": "Magnificent. The 19th Century Russian painters are superb and this Museum accounts for that. It also houses an interesting exhibition of the 20th Century Russian art. A must visit."
        }, 
        {
            "index": 159, 
            "rating": "5", 
            "review": "Don't miss this!. We toured this museum on our own, following the advice of hotel staff who recommended it for its Russian art. (Understand that the Hermitage is full of European art.) Decent audio guide, although I would have liked more pieces to have been included. Glad I chose this over seeing yet another palace. In this case, art definitely reflects culture. Even if we weren't thrilled to see this art, seeing the babuschki guarding each and every room was art unto itself."
        }, 
        {
            "index": 160, 
            "rating": "5", 
            "review": "Russian Museum. We were in St Petersburg long enough that we could see some of the Museums not on the must see lists! We were the only people wandering through when we arrived at opening time. The cost is modest, the art quite lovely though not on par with the Hermitage, it is relaxing to walk through the galleries and not feel crushed by crowds as is the case at the Hermitage. It is a collection of art by Russian artists, many who were influenced by French and other European artists."
        }, 
        {
            "index": 161, 
            "rating": "5", 
            "review": "Well worth the visit. While the contents are not as \"glamorous\" or \"famous\" as in the Hermitage (no Rembrandts or Rubens) it is, nonetheless, very much worth visiting. An incredible array of paintings, folk crafts, ceramics, glass and porcelain. A couple of Kandinsky and Malevich paintings, too, but they should not be the reason for your visit. All the other stuff is much more interesting."
        }, 
        {
            "index": 162, 
            "rating": "5", 
            "review": "Well worth a visit.... Great afternoon spent in here, was a bit complex to work out where to go and not get lost but I got there by asking the friendly staff."
        }, 
        {
            "index": 163, 
            "rating": "4", 
            "review": "Worth a visit even after seeing the Hermitage. The museum is in an impressive palace building. The collection is interesting. The sheer size of some of the pieces make it worth seeing. You need at least and hour and a half to two hours to visit. I would do it on a day other than when you visit the Hermitage. It is conveniently located off Nevsky Pr."
        }, 
        {
            "index": 164, 
            "rating": "5", 
            "review": "Russian paintings by Russian painters. Marvelous paintings of Russian life and landscapes. It is a door to the vastness of Russia and it's mysterious soul!We spent a half a day being enchanted. You truly appreciate the Russian genius."
        }, 
        {
            "index": 165, 
            "rating": "5", 
            "review": "Russian Art, Excellent Visit. This has been a museum since 1895, so I'd say they have some experience in showcasing art and handling visitors. Nicholas II offered this former palace as well as an enormous personal collection for the public and it has grown since then. Magnificent collection of Russian art. The gallery of Icons was a wonderful way to start. Wonderful selection of paintings, and the sculptures - Vitali's Venus! exquisite. I would be happy to revisit on my next trip.Recommended.The museum is closed on Tuesdays, and opens at 1300 on Thursdays. There are heaps of food choices within a short walk, including Italian and Indian food. We went for a well-deserved lunch before walking to our next stop."
        }, 
        {
            "index": 166, 
            "rating": "4", 
            "review": "Former palace, museum now. This museum is in the city center. It is located in a former palace. Again, this building is nice also form the outside. The inside is may be even nicer to see. They have a lot of Russian art, paintings, ceramics, furniture, statues, …… One should have seen this. Be careful, on Thursday open only from 13:00 hours onwards."
        }, 
        {
            "index": 167, 
            "rating": "5", 
            "review": "Excellent collection of Russian art!. The collection is huge, so It's really recommended to everybody who is fond of Russian art! The best way to discover it is to take an audio guide or with a private guide cause there's so much history behind it. This museum is not in the top of the things to do in St Petersburg, it's more for interested people, but it's really amazing!"
        }, 
        {
            "index": 168, 
            "rating": "5", 
            "review": "russian art in all its ways. when visiting petersburg one wants to see the highlights such as hermitage, pushkin and peterhof, of course. but there is so much more to explore in and around this magnificent city.the russian museum is one good example. in the main building of it, which is the mikhailovsky palace, they offer a vast collection of russian art in every way and every style. that was very interesting. I wonder why not more of those are better known around the globe. there is tsaristic art, too, and other items of imperial times. the other branches of the russian museum are splendid as well: stroganov palace, marble palace, mikhailovsky castle,..."
        }, 
        {
            "index": 169, 
            "rating": "4", 
            "review": "The Russian Museum has a rich collection. The Russian Museum has a rich collection of icons, paintings and sculptures by Russian artists from the 14th to the 21st century. I know and love the main collection therefore often I visit the temporary exhibitions held in the Benois Wing branch of the museum.The last exhibition I saw was an exhibition of paintings by artists of the 30s of the 20th century.The Russian Museum is the former Palace of Grand Duke Mikhail therefore the museum is surrounded by a very picturesque Mikhailovsky Garden."
        }, 
        {
            "index": 170, 
            "rating": "5", 
            "review": "Complete and amazing collection. It has something for everybody. Old and new. Classic and contemporary. Barroque and modern. From paintings, to sculptures and home utensils. Its a great journey through Russian art. I've spend 4 hours in the museum, I've really took my time to enjoy this trip and it was totally worth it."
        }, 
        {
            "index": 171, 
            "rating": "5", 
            "review": "Superb Collection!. This museum holds a breathtaking collection of Russian art well arranged and exhibited. (For artists from other countries, visit the Hermitage.) Beginning with medieval church iconography and royal portraits one can observe the development of art and the wonderful expansion of artists' subjects and styles. I was thrilled to see two rooms filled with stunning works by Repin. I had limited time and had to leave after viewing some of the late 19th Century, early 20th Century art, so I didn't get to see any of the new additions such as the sculpture or folk art collections, or the Marble or Stroganov Palaces. This collection and the Hermitage will probably draw me back for an extended visit to the city. Audio tours are available, but I didn't get one because I didn't have much time (90 minutes) and wanted to see as much as possible."
        }, 
        {
            "index": 172, 
            "rating": "5", 
            "review": "Enlightening and beautifully curated collection. Not only does St Petersburg, as the cultural center of the country, have a large and diverse number of museums to visit, but they are all very affordable when compared to many other famous European museums. When I entered the state art museum, I'll admit that I had very little knowledge of the country's contributions. I exited the museum with a broadened understanding of and appreciation for their rich history. Some of the most striking paintings I've ever seen were ones I found here. Highly, highly recommended. Don't miss this museum."
        }, 
        {
            "index": 173, 
            "rating": "4", 
            "review": "If you love Russian art. It is not as impressive as Hermitage as it is only a gallery, but if you want to see Russian paintings this is the best place to see them."
        }, 
        {
            "index": 174, 
            "rating": "5", 
            "review": "Skip the Hermitage. Save it for later. Start here, instead. Admission is 350 RUB - about 6 USD. And there are never any lines.I mean, why stand in line to see a few relatively minor paintings by the old Italian & Dutch masters, when you could instead see Ilya Repin's \"Reply of the Zaporozhian Cossacks\" and so much else that is really, really *Russian* for next to nothing?"
        }, 
        {
            "index": 175, 
            "rating": "5", 
            "review": "Best Museum of Russian Art. Gives the history of Russia in art--fabulous collection of Russian art. Walk through the history of Russia through its famous art---beginning with historical icons from early Russia and Kiev andante the portraits of famous early Russians, fabulous art of historical events, interesting collection of Russian Impressionists- the Wanderers, art describing Russian stories and myths, night art, and contemporary Russian art---showing the impact of the revolution on art. Also an interesting exhibit of art during World War II--The Great Patriotic War."
        }, 
        {
            "index": 176, 
            "rating": "5", 
            "review": "Come here to see fantastic Russian art!. If you are interested in Russian art from early icons to the 20th century, come here rather than the Hermitage! It is not crowded even in August and there is so much to see, including the buildings themselves. We had a private guide but the shop sells a very good Guidebook which helps you to learn about these artists who are relatively unknown to us in the UK. This was the top attraction for us, along with the Peterhof gardens."
        }, 
        {
            "index": 177, 
            "rating": "4", 
            "review": "Nice historical reference for the city. While the Heritage is often the focus of most visits to the city, if you have the time, don't skip this museum. We found that this offered a more historical reference point for the city and housed only Russian art and works. This was a nice change."
        }, 
        {
            "index": 178, 
            "rating": "5", 
            "review": "Sublime Russian art. Love this museum of all Russian art and craft. The exhibition to commemorate WW2 and the Siege of Leningrad moved me to tears- very raw powerful works. The earlier classical art is gorgeous and it was marvellous to see painters' works for the first time. The decorative arts collection is extensive and very well displayed with a history of their development. This was a highlight of my St Petersburg visit."
        }, 
        {
            "index": 179, 
            "rating": "4", 
            "review": "For Art lovers. This museum is good for people who want to see paintings fromdifferent centuries. and from some famous russian artists likeAivasovski, Repin, etc.Reserve min 2-3 hours to see the main halls."
        }, 
        {
            "index": 180, 
            "rating": "5", 
            "review": "As Interesting as the State Hermitage Museum. Spare a day for the Russian Museum in your plans. It was recommended by a Russian friend and both the building and its contents are superb. We were particularly impressed by the very large collection of Russian paintings, the majority by artists previously unknown to us, and of excellent quality and interest. They range from enormous canvases many metres in dimension, to fascinating portraits and scenes. There is an extensive collection by Shishkin and Repkin, including the latter's fascinating \"Zaporozhye Cossacks Writing a Mocking Letter to the Turkish Sultan\". The sculptures on display are equally interesting. As with the Hermitage, as the collection is within a palace with large windows, the lighting in a number of instances is far from ideal because reflections obscure parts of the picture wherever you stand. On the plus side, photography (but no flash) is permitted, enabling you to keep a comprehensive memento of your visit."
        }, 
        {
            "index": 181, 
            "rating": "5", 
            "review": "Most Fabulous Collection of Russian Art!. Spend at least 3 hours or more here. It has a wonderful collection of Russian fine arts. We discovered most beautiful works of art by artists until now, unknown to us. They have a nice little cafe for tea to rest your legs mid-visit. You can buy stamps there for a few postcards. It is a short walk from Nevsky Prospekt near Arts Square. A very special place and a must while in St Petersburg."
        }, 
        {
            "index": 182, 
            "rating": "5", 
            "review": "Best museum of Russian art. Great collection of Russian artists, particularly Russian avantgarde. Most probably, the best in the world. Do not miss!"
        }, 
        {
            "index": 183, 
            "rating": "5", 
            "review": "A must see.. If you love art, this place is a must. There are more hugh paintings in this building than I have ever seen before. Also beautiful textiles, costumes and lace work. There's a nice park across the street where you can sit and relax at the end of the day."
        }, 
        {
            "index": 184, 
            "rating": "4", 
            "review": "Interesting History and Art. This museum only receives four stars because the competition in St Petersburg is so great! This museum in any other city would be the top sight seeing venue, but St Petersburg has so many other places to see. This museum is a great second or third day tour if you are visiting the city for a few days."
        }, 
        {
            "index": 185, 
            "rating": "5", 
            "review": "Excellent museum!. Has a nice collection of artefacts and drawings. This is besides the armoury collection. The gold leaves are real! =)"
        }, 
        {
            "index": 186, 
            "rating": "5", 
            "review": "Delightful. The Russian Museum is simply amazing! Housing the works of Russian artists,I was delighted with the incredible artwork. And it was certainly less crowded than the Hermitage!"
        }, 
        {
            "index": 187, 
            "rating": "5", 
            "review": "packed with treasures. one of our best visits in st. petersburg. the museum encompases thousands of artworks from old to modern eras if Russia. we had a giude with us who took us around and explained history behind each work. this place needs a minimum of a full day to absorb all. Great eye opening to Russian art."
        }, 
        {
            "index": 188, 
            "rating": "4", 
            "review": "Worth going to. This is a great place to check out if you're interested in Russian artists, and want to be in an environment that is far calmer and less crowded than the Hermitage. The museum is pretty easy to navigate after a few minutes of wandering around, and their collection includes a variety of different artists and different time eras"
        }, 
        {
            "index": 189, 
            "rating": "4", 
            "review": "Very interesting collections. We found the visit more interesting than expected. The collection covers a lot of Russian art and history. I certainly recommend it."
        }, 
        {
            "index": 190, 
            "rating": "2", 
            "review": "Visit if you have too much free time. I'm an art lover but this museum is not that impressive. Just visit it if you have nothing else to do otherwise instead of going to this museum go for the second day visit to Hermitage Museum."
        }, 
        {
            "index": 191, 
            "rating": "5", 
            "review": "From Icons to contemporary art, only Russian Art. The Hermitage Museum houses the European art and the Russian Museum houses the Russian art. We've seen icons before, but we have very little exposure to Russian art otherwise. Ivan Aivazovsky's work, Russia's great sea/maritime painter, really intrigued me. There's a monumental painting of a ship going down in a storm that's worth a visit to the museum on its own. Note: The museum is in a former palace, but don't expect the beautiful excesses of the palace that houses the Hermitage museum!"
        }, 
        {
            "index": 192, 
            "rating": "5", 
            "review": "Amazing Russia. If you want to learn about Russian fine arts, visit this place with its most excellent collection, starting with Icons from the time of Rubljov, showing the beginnings of western style Portraits from the 18th century and then entering Russia's great cultural period in the 19th and early 20th centuries: Repin, Levitan, Venezianov, Kuindzhi, Shishkin, see the exceptional Serov, go all the the Benois Wing including Soviet paintings, and do not miss the bookshops."
        }, 
        {
            "index": 193, 
            "rating": "5", 
            "review": "Worthwhile detour, buy a book or audio guide. I went on a Thursday afternoon (1pm-9pm opening hours) and surprisingly there was a long line of mostly Russian tourists to get in. But it moved fast enough.Tickets were ₽350 and I bought a guide book from one of the gift shops for ₽440. Most of the paintings listed in the book were on display but out of order. Photography quality was sound but unfortunately the descriptions were mostly a single paragraphs that comprised of a brief artist or subject biography. Still it had a good history of the building, the collections and was worthwhile enough to use while browsing the gallery.Inside the museum the directional signage was all bilingual as was the artist and title descriptions for the permanent collections. But other than that there was very little curation for either language until the Modern galleries. While the temporary collections were limited to Russian.As others have said there are some striking masterpieces in here that make it a memorable experience and a worthwhile detour from the usual tourist traps. I just wished the museum received more funding as there were a number of rooms that could do with a new coat of paint and floor polish."
        }, 
        {
            "index": 194, 
            "rating": "5", 
            "review": "Humbled by my ignorance of Russian art. Cannot believe how little I knew of Russian art and how impressive it was to see the history of Russian art. Given the tremendous geography of Russia, its art stretches from the far east to Persia and Cairo with dozens of wars in between! The modern artists were most impressive with Russian artists matching teh skills of Western Impressionists and other avant garde movements of the 19th and 20th Centuries."
        }, 
        {
            "index": 195, 
            "rating": "5", 
            "review": "State Russian Museum. Amazing art from Russian artists, all kinds, painting, sculpture, decorations, enamels, bone carving, textiles. The museum is huge and would take days to see it all. The entrance is via a small door on the side, and you have to go through a mazelike basement to get to the first floor where the exhibitions begin. The price is a very reasonable 350 rubles (about $7)."
        }, 
        {
            "index": 196, 
            "rating": "5", 
            "review": "Impressed about Russian art. Being honest: I didn't know anything about Russian art before going to this museum and after I went I realized that Russian art is as good as the western european art. Some times, better. Travellers usually think about visiting the Hermitage, but once in Saint Petersburg, the Russian Museum is a must see!"
        }, 
        {
            "index": 197, 
            "rating": "5", 
            "review": "I Great museum of Russia Art. I you wants to know more about Russian History and see all the ages of Russian art, go to Russian Museum and get an audio guide. Getting in was easy, line was minimal."
        }, 
        {
            "index": 198, 
            "rating": "5", 
            "review": "\"A living memory...\". \"...this artistic store to be a living memory of the regal concerns of the one, who so ardently loved the Motherland and has dedicated all His life to serve it.\" This sentence closed the order of the Russian Tsar Nikolai II on the foundation of the State Russian Museum in the memory of His father Alexander III of Russia. After so many years this place remains 'the living memory' of the whole epoch of Russian art, where every exhibit renders the twists of destinies, professional pathways, failures and successes... which are as captivating as their artistic expression! Indeed, the memory is living :)"
        }, 
        {
            "index": 199, 
            "rating": "5", 
            "review": "interesting colection of communist art. besides the expected collection of old russian art, church art, treasures of the royal family and Russian nobelty, there is a rich collection of arts generated during the comunist period, where classical motives were adjusted to the \"red\" idealogy - recruited art. the ceramics generated in that period is decorated with the sickle and hammer and there is a lot of abstacr ceramics pretending to be tough and useful but these are pieces of modern \"decadent\" art. the modern sculptures are very modern and similar to European exprionists. very interesting and atractive."
        }, 
        {
            "index": 200, 
            "rating": "5", 
            "review": "Don't miss the Hermitage, but do save some time for the incredible Russian Museum. Another incredible collection that goes beyond paintings and sculptures, up to decorative arts, furniture and objects from the 20th Century and Russia's Soviet times. The fine arts collection is also completely breathtaking - unfortunately for those who don't speak Russian, like most museums in the country, the texts and captions are mostly Russian only."
        }, 
        {
            "index": 201, 
            "rating": "5", 
            "review": "We really enjoyed this museum!. We thoroughly enjoyed this museum although we had to find a way to get in because of renovations. I am glad we had the time to visit and made the effort to slip away from the crowd. The surrounding park is lovely as well."
        }, 
        {
            "index": 202, 
            "rating": "5", 
            "review": "Stunning Collection. Shouldn't Be Missed.. Quite impressive and should be on the list of things to do while in St. Petersburg. Makes one understand that there are many masters way beyond the more well publicized artists of the past and present. Wasn't overly crowded for a Saturday and central to other historical sites. The interior is also beautiful and varies from room to room. Some of the beautiful work are actually the chandeliers and details applied to the walls as well as the ceilings. The bookstore offers an affordable catalog of the collection should you want a lifetime memory of this wonderful museum."
        }, 
        {
            "index": 203, 
            "rating": "4", 
            "review": "A complete course on Russian art. Particularly enjoyed the avant garde period. A nice collection of iconostasis as well. A good way to escape the tour masses as well."
        }, 
        {
            "index": 204, 
            "rating": "4", 
            "review": "Different from the others. This museum focused more on the Russian artists which was very interesting, informative and enjoyable."
        }, 
        {
            "index": 205, 
            "rating": "5", 
            "review": "Terrific surprise. This museum doesn't get hyped in guide books, yet it is by far the best art museum here. Very little English signage but it is all arranged chronologically so one easily gets the gist of it. Wonderful to witness the way broader art currents affected Russian artists, and the turbulent history of Russia as reflected in its art. We spent an afternoon here and wished we'd allotted a day."
        }, 
        {
            "index": 206, 
            "rating": "4", 
            "review": "Great beautiful building with God exhibits. This lesser known museum is a real sleeper and well worth the visit. Not that crowded but full of terrific stuff it is both educational and enjoyable to visit. They have periodic seats to rest weary bones, well lit galleries, a good gift shop and a decent restaurant and gift store. Although clearly not as popular as the hermitage ,fabrege and other museums it is important as an outpost of Russian history and should be seen"
        }, 
        {
            "index": 207, 
            "rating": "5", 
            "review": "Alternative to Hermitage. The Hermitage is hopelessly overrun with tourists, many in groups making it difficult to get around. The Russian Museum is quieter with some fabulous Russian Art."
        }, 
        {
            "index": 208, 
            "rating": "5", 
            "review": "A gem.. This was by far my favorite museum in St Petersburg. It is much quieter than the Hermitage and hosts a collection of Russian art from the Middle Ages to the 20th c. Paintings, furniture, ceramics... Not to be missed."
        }, 
        {
            "index": 209, 
            "rating": "4", 
            "review": "Leisurely stroll through history. This museum is a gem for the Russian people. Loved that there were no crowds and we could go through the museum at our own pace. Loved the outsized paintings with a place to sit and observe them on a bench. The art was outstanding and the grounds were serene."
        }, 
        {
            "index": 210, 
            "rating": "5", 
            "review": "Surprisingly Unique !!. Before visiting the Russian state Museum, I wasn;t so much into museums and into art in general. However after visiting this museum. it totally changed my perspective. The paintings are mindblowing. you feel as if they are talking to you. This is a must visit in st Petersburg. Russian art is great and it will exceed your expectations.Note: The Museum offers discounts on tickets for students, (via students card)"
        }, 
        {
            "index": 211, 
            "rating": "5", 
            "review": "Superb collection of Russian art. Superb collection of Russian art from all ages. I specially loved the late XIX and early XX century collections (Malevich, Kadinsky etc). The Soviet-era art was unknown to me and very beautiful and expressive."
        }, 
        {
            "index": 212, 
            "rating": "5", 
            "review": "A must see if you like russian history. Very good museum, the ticket is really cheap (moree than another museum in Piter) and you can see and learn a lot of the Russian/soviet histoey"
        }, 
        {
            "index": 213, 
            "rating": "5", 
            "review": "Beautiful museum with amazing art collection!. I visited museum with my children and opted out of the tour as we prefer to wonder around on our own. Russian Museum has an amazing collection of paintings and sculpturs by Russian artists. My favorites are Bruilov and, Ayvasovsky. You can spend a long time studying expressions on the face of the people on \"The Last day of Pompei\" by Karl Bruilov and amazing details of the backgrounds and realistic colors of the water of Ayvazovskiy paintings."
        }, 
        {
            "index": 214, 
            "rating": "5", 
            "review": "Amazing collection. From Icons to Malevich - is a name of the book I bought at the Russian museum which exactly captures the essence of this great place that has collection of Russian masters from 8 century to today. If you have time 3-4 hours for one museum visit in St. Petersburg - choose this place"
        }, 
        {
            "index": 215, 
            "rating": "5", 
            "review": "alive russian art. we had a great impression from the museum about the culture and history of russian artists. İt deserves to spend your valuable time, evrything was made with high spirit :)"
        }, 
        {
            "index": 216, 
            "rating": "5", 
            "review": "Don't miss it if you want to understand Russia. My wife guided me here, she is a professional artist. I was completely new to Russian art, so I am grateful. The Russian Museum is a must go place if you want to understand Russia. I became a big fan of Serov. His painting \"The rape of Europe\" was shockingly beautiful."
        }, 
        {
            "index": 217, 
            "rating": "5", 
            "review": "Don't miss opportunity to view Russian artists. Why go and see Italian & French art at the very crowded Hermitage, when you can see works by Russian masters. See/learn something new. Very nice museum with impressive works."
        }, 
        {
            "index": 218, 
            "rating": "5", 
            "review": "A must. Don´t miss this museum. You´ll see the Works of all the Russian painters. Wonderful Museum in a beautiful palace"
        }, 
        {
            "index": 219, 
            "rating": "5", 
            "review": "a gem. this museum is the best place to see Russian art, from icons to contemporary. the galleries are in a former palace and are just spectacular. GO!!"
        }, 
        {
            "index": 220, 
            "rating": "1", 
            "review": "Don't wast your time here. This was one of the most disappointing stop while I was in St Petersburg. Yes, it's another check off the list. But had I spend more time else where even in places like the Political museum it would have made my experience much better."
        }, 
        {
            "index": 221, 
            "rating": "5", 
            "review": "Best Place to Experience Russian Art. Love all the huge, life-sized paintings of the peasants, soldiers, politicians, generals, emperors and empresses."
        }, 
        {
            "index": 222, 
            "rating": "5", 
            "review": "unique. Russian art at its best. Rarely represented on such a scale and quality outside of Russia. A must for anyone interested in Russian culture/history"
        }, 
        {
            "index": 223, 
            "rating": "5", 
            "review": "There is not any other Museum that I have visited in Europe that compares.. The sheer size of the museum is overwhelming and the displays are so well laid out that they are easy to maneuver (so long as you do not visit during tourist season). St. Petersburg is nothing like the rest of Russia as it is truly a tourist town. People are welcoming as much as any Russian will welcome an American and it is easy to get around by bus or taxi."
        }, 
        {
            "index": 224, 
            "rating": "5", 
            "review": "Amazing. As an American expat working in Moscow, I had opportunity to see numerous areas of the country. The State Russian Museum is a must for anyone traveling to SP. It holds much history and culture of this great country. What impressed me most about the museum are the docents who cherish their positions to share. If you take the time to learn a few key Russian words such as please and thank you, they will reward you with great effort to show you what they cherish..."
        }, 
        {
            "index": 225, 
            "rating": "5", 
            "review": "Art by Russian artists. Fabulous works of art by Russian artists. Some are enormous and a must to see after you have visited the Hermitage"
        }, 
        {
            "index": 226, 
            "rating": "5", 
            "review": "To become au fait with the Russian Fine Art &Culture. I recommend this Museum to everyone who would be sick of long queues and crowd in the Hermitage and to every single one who wants to become more familiar with the Russian Fine Art as the Russian preserves this type of Art. You do not have to stand near each painting and scrutinise it. Just take a quick walk round all the halls to understand how Russians were tending to paint several centuries ago. It is really worth your money."
        }, 
        {
            "index": 227, 
            "rating": "5", 
            "review": "Not to be missed!. We took over 7 hours to visit this museum - there is so much to see that we ended up having to run thru the Gloriously decorated 2nd floor rooms in the main Palace - the art in the more modern sections was completely outstanding. We opted for the expensive - but well worth it - audio guides - which explains our speed. Each painting that is numbered is described in extensive detail, and then the biography of the artist is also provided. There are some standout images - particularly the paintings by Serov. His ability to give his subjects a specific identity (not always the one they would have chosen) was incredible. I was also very impressed by how 'uncrowded' the halls of the massive museum were. While you weren't alone - you definitely didn't have to fight for viewing space with hordes of tour groups and their guides. A wonderful museum, glorious art, some surprising new to me artists to discover - and a very reasonable price. Definitely a 5 star day."
        }, 
        {
            "index": 228, 
            "rating": "4", 
            "review": "A feat for the eyes. The day we visited the museum, there were few visitors - compared with the Hermitage - and so we had the space to walk around at our leisure and learn much from the paintings. An English language audio guide was invaluable, giving the background to many of the exhibits, which range from the earliest icons to the latest art. The café caters for Russians, which means the food is freshly prepared and, for the high quality, less expensive than on Nevsky Prospect."
        }, 
        {
            "index": 229, 
            "rating": "5", 
            "review": "Great way to learn of Russian art, culture and history. Russian museum is a great journey to Russian culture and art.The museum houses a huge collection of Russian art, starting with ancient icons up to modern art. It takes around 2 hours to see the highlights.If you are interested in modern art only, you should enter the museum not from the front, but from the Griboyedov canal. There is another entrance (Griboyedov canal,2) to the museum there which will bring straight to the beginning of the collection of Russian avantgarde art. The Museum is closed on Tuesday"
        }, 
        {
            "index": 230, 
            "rating": "5", 
            "review": "An essential flavour of Russian life and history. Marvellous collection, especially of modern Russian painters of the 19th and 20th centuries, ceramics, furniture, folk art, old paintings, an incredible collection of rare icons, and much more, in a stunningly beautiful palace building. Really worth the effort and not to be missed even if you are faggedout by the Hermitage already!"
        }, 
        {
            "index": 231, 
            "rating": "3", 
            "review": "Do only if you have plenty of time..hermitage way better. nice visit . Do not use St-Petersburg Card... it is a waste of money and most important attraction in St-Petersburg are not included (hermitage, peterhoff palace, Catherine palace, imperial porcelain museum, and many other sites; you will either only recuperate 30% to break even..."
        }, 
        {
            "index": 232, 
            "rating": "5", 
            "review": "Much easier than the Hermitage. The Russian Museum is a wonderful place to visit and I would highly recommend it to any foreigners (and Russians too). Many people from the West have never heard of these Russian artists and are very pleasantly surprised. It's much smaller than the Hermitage and as a result, a lot less intimidating. The crowds are smaller and the whole thing is much less exhausting. Read a little about the history of the building and the area surrounding it before going - it's very interesting."
        }, 
        {
            "index": 233, 
            "rating": "5", 
            "review": "Very beautiful. The museum is very spacious and well organized. The enormous halls and rooms give the place a majestic feeling you can'[t experience except in those museums at St. Petersburg. Highly recommended to visit this museum!"
        }, 
        {
            "index": 234, 
            "rating": "4", 
            "review": "Very good place overall. Art is just awesome. So many pictures are just memories from the childhood of any Russian - museum visits while with your kindergarten fellows, school books illustrations, pictures from children's books, scenes from the history readings. I spent almost 15 minutes by Ilya Repin's \"Session of the State Council\" which is just a-w-e-s-o-m-e.The museum shop is also great - there're a lot of famous paintings' copies sold there so if you really like it, just buy your own copy."
        }, 
        {
            "index": 235, 
            "rating": "5", 
            "review": "A Must Do. Fantastic place with wonderful art and changing temporary displays. Really good value for money. All museums etc. have free cloakrooms for coats."
        }, 
        {
            "index": 236, 
            "rating": "5", 
            "review": "Worth visiting. Come for the best in terms of Russian icons, crafts and paintings of the 19th century and the Russian Avant-Garde.1 May - 30 September the Summer Garden is open daily (except Tuesday) from 10.00 a.m. till 10.00 p.m.(entrance until 9.30 p.m.)Free entranceThe Summer Palace of Peter the Great is closed for the restoration works. Monday, Wednesday, Friday, Saturday, Sunday – 10:00 a.m. – 6:00 p.m. Thursday – 1:00 p.m. – 9:00 p.m.The Museum remains closed on Tuesdays!"
        }, 
        {
            "index": 237, 
            "rating": "5", 
            "review": "the best russian art ever seen. it all depends what you like. we concentrated in the 20th century russian art, influenced by europe but so totally russian and powerful. we really liked it. Many of these artists are really shown outside of Russia and therefore , in some ways, this is the most interesting museum one can see as we cannot see anywhere else. We intend to go back to look at Russian art from earlier periods as well."
        }, 
        {
            "index": 238, 
            "rating": "5", 
            "review": "An absolute must. Reserve 3-4 hours for your visit. Excellent museum next to a nice park and the Church of the Savior on Spilled Blood. So it is wise to plan visiting both of these places. But reserve at least 3 hours for the Russian museum. The 18th cent. portraits of honoured aristocrats - you can give it a miss. The real gems are of course Bryullov and Aivazovsky, and Shishkin and Repin, and Serov and Vasnetsov. But don't stop there. The XX cent. halls are also worth visiting. Petrov-Vodkin, Deineka... Soviet art collection is very much recommended. And don't forget the museum shop!"
        }, 
        {
            "index": 239, 
            "rating": "5", 
            "review": "Pure Russian and amazing art works. This is a truly great collection of art from early icons to great paintings. Some of these works kept me spellbound and many are of cultural and historic significance. Try not miss this museum and don't get so carried away that you miss the Kadinski exhibition.On the downside: Russia has lots of money for war and the destabilisation of the Ukraine, but art is not high on the Kremlins agenda.This museum requires work on its building and exhibition space and their lighting is truly bad. The staff told me that the little money allowed for art goes mainly to the Hermitage, it being the great flagship. I would recommend this museum to anyone. Great Art!!!!"
        }, 
        {
            "index": 240, 
            "rating": "4", 
            "review": "Interesting. Positively surprised. Definitely interesting, full of Russian art and only...Traditional classic museum full of paintings and wide range of crafts."
        }, 
        {
            "index": 241, 
            "rating": "4", 
            "review": "You have to be into Russian art. It's a beautiful building and filled with Russian art and lots of sculptures. I loved the second floor of the main building because of the building itself. These paintings weren't my thing, but doesn't mean the place deserves a bad rating."
        }, 
        {
            "index": 242, 
            "rating": "5", 
            "review": "The Russian Museum. My dear English teacher asked me to write review about Saint-Petersburg sights for foreign people. It is good time to do it because of the high season for tourists. Let's start! This Museum was opened in 1898. Nicholas the Second issued the edict about establishment of the special museum “Russian Museum of Alexander the Third”.Museum is situated in the Center of Saint Petersburg. It will be very convenient to find it. In this museum there are many really wonderful pictures of Russian artists: Ayvazovskiy I.K., Repin E.A., Brullov K.P., Shishkin I.I. and others. My favorite picture is “ The Wave” by Ayvazovskiy I.K. Many pictures are very big, it is amazed You its majesty and power.You can buy a special device and You should stop near a picture and press the number, which is under the picture and the voice of guide will tell You about artist and the creation history of this work of art.If You are a big fan of art You should go to this Museum – it will be very interesting for You."
        }, 
        {
            "index": 243, 
            "rating": "3", 
            "review": "A little disappointed. I was expecting to see a lot of Russian art, but it cannot compete with the Tretyakov gallery in Moscow."
        }, 
        {
            "index": 244, 
            "rating": "5", 
            "review": "Extraordinary. Another true treasure in st Petersburg, as well as Hermitage, ...... a wonderful place to visit, a very GOOD organisation INSIDE thé muséum ...."
        }, 
        {
            "index": 245, 
            "rating": "5", 
            "review": "Very Impressionable!. I was very pleasantly surprised by my visit to the Russian Museum. They have a very good collection of Russian Icons, and the Peredvizhniki (Wanderer) movement is well represented. All of those were very worth seeing. But I was very pleasantly surprised by the outstanding collection of Russian 20th century pieces that are included in the museum. The pieces are organized chronologically by movement, and there are descriptions on the wall of each room in the 20th century wing that help you to understand what characterize the currents of that group of painters in that era. It is rather pedagogical, helping you understand the development of Russian art in the 20th century from Art Nouveau, Blue Rose symbolists, early Abstractionists, the Knave of Diamonds group, Cubists, Futurists, clear into and through the Soviet era. A fascinating journey through one of the most interesting developments in contemporary art history. And it's a major plus that you can see the 20th century wing without having to buy a separate ticket (unlike the Hermitage, the Tretyakov, and the Pushkin Gallery, which require separate ticket for the modern art galleries)."
        }, 
        {
            "index": 246, 
            "rating": "5", 
            "review": "visit in april 2015. we visit the museum in cold days . the museum is very friendly and as it was eastern it was a bit full with visitors. you leave you jacket + bags and baby chair to cloak room as you always do in russia . the pictures and all shows are really magnificent ."
        }, 
        {
            "index": 247, 
            "rating": "4", 
            "review": "Beautiful..... Watched the guards trooping around front. Bit like our trooping of the colour.... The Museum is gorgeous."
        }, 
        {
            "index": 248, 
            "rating": "5", 
            "review": "For Russian art Lovers. If you adore Russian art or want to explore some part of its wealth it's the place to go. All in all The Russian State Museum is placed in 3 different buildings - soo really a lot to explore! As the Hermitage presents masterpieces from around the world, here you will experience the touch from only Russian marvellous art!"
        }, 
        {
            "index": 249, 
            "rating": "3", 
            "review": "Russian Art. I don't know Russian art history, and it didn't keep my from enjoying the experience. This is a window into Russian history. The interior building and displays were lovely, too.If you know what you'll be getting and that it's a lot of the beautiful but unknown, its worth the experience. Patience, willingness and stamina are necessary, I think. Probably not for those who don't enjoy artistry. I did need a nap afterwards, since it takes 4-5 hours, at least, to really go through the whole museum.{ September 2012 visit }"
        }, 
        {
            "index": 250, 
            "rating": "4", 
            "review": "must see. the collection of truly great paintings is limited, true, but a handful of masterpieces are there, a good collection of traditional russian art and then the palace itself. but why do foreigners always have to pay more, not a very welcoming policy, not known in my own country"
        }, 
        {
            "index": 251, 
            "rating": "5", 
            "review": "must see. This museum was less crowded than the Hermitage and offered a real insight into the russian culture.The Hermitage is amazing, but it does contain things that you would find in any number of european museums."
        }, 
        {
            "index": 252, 
            "rating": "5", 
            "review": "One of the less well-known Museums in St Pete's: well worth a visit. This museum has some relatively little known Russian art, and can be a real eye opener for West European visitors. For those who find the Hermitage queues intimidating, I'd heartily recommend this as a back-up option."
        }, 
        {
            "index": 253, 
            "rating": "5", 
            "review": "Proud Russian Heritage and arts exhibition. Visited on 3 Oct 2012. Back then I couldn't find where exactly was the entrance until I walked near by the small entrance on the right of the main gate. Nevertheless, inside the museum are collections of many national paintings including Jesus Christ at the Cross, Eastern Orthodoxy depictions, monuments of artists and sculptures of David, Venus, and other Italian style sculptures. Outside, sits the TALL STATUE OF PUSHKIN, the most renowned Russian Writer!"
        }, 
        {
            "index": 254, 
            "rating": "5", 
            "review": "No Monets, Pissarro's Rembrandts - Just loverly Russian Paintings.. This is what you come to see when you visit another countries Art Gallery. Their paintings, local artists and their history. All this is here, and beautifully presented.This is my type of Art Gallery; real paintings- an exhibition of skill and talent, and showing real life in this part of the world. Thank heavens this Modern Art 'stuff' has not yet reached SPB - where handfuls of good paint are thrown at a wall, floor of ceiling!! Here are beautiful works of art. I visited the State Gallery in Moscow too, and again excellent Russian works by painters I have never heard of - but I loved their paintings.Brian, from Perth. W. Australia"
        }, 
        {
            "index": 255, 
            "rating": "5", 
            "review": "Under-rated and Excellent - must see Russian greats. The State Museum is grossly under-rated and deserves more attention when you put together your St Petersburg itinerary.You will find that while the Hermitage focuses on artwork from outside Russia, the State Museum has some amazing pieces. Must see pieces include Aivozovsky's Ninth Wave and The Wave, Repin's Barge Haulers, Polenov, Makovsky, Myasoyedov, and my favourite the brilliant Shishkin.Some very bleak subjects but typical of the art of the times in Russia.Apart from the great art, the museum is normally far-less crowded than many other venues in St Petersburg. We had a nice stroll across a snowy park filled with snowmen on the way to the museum.Visited February 2013."
        }, 
        {
            "index": 256, 
            "rating": "5", 
            "review": "Great art collection and craft collection. Museums own a lot of famous pictures by most significant Russian artists. What is more there is great collection of ivory and wooden carvings."
        }, 
        {
            "index": 257, 
            "rating": "5", 
            "review": "Place where national culture is materialized. We just love art and conside it to be a perfect reflection of culture. Rich national culture - rich art gallery exhibiting local artists. Russian Museum is the place to see quite impressive art works."
        }, 
        {
            "index": 258, 
            "rating": "5", 
            "review": "Need to visit. Collection of Russian art from old Russion icon painters ( Rublev, Ushakov) to Avangard (Malevich) 20 th century. Russian painting, sculpture, the graphic, decorative and folk arts from the 10-th century to the present day. To understand all the historical events in this pictures and to be admired you need 3 days and more. But a few hours are also enough to have the imagination about the first national museum in Russia, opened its doors in 1889 year."
        }, 
        {
            "index": 259, 
            "rating": "5", 
            "review": "Worth a Visit. The State Russian Museum is definitely worth a visit if you can while in St. Petersburg. It's right next to the Church on the Spilled Blood. The building itself of the State Russian Museum is a beautiful Neoclassical former palace of one of the Romanov grand dukes. The exhibits in this museum are first rate and some of the opulent rooms are fascinating as well. The crowds are also less than in the more famous Hermitage. The park in the back of the museum provides a quiet oasis and is pleasant to visit. Expect to spend at least two hours for your visit to get an appreciation of the museum and its collection."
        }, 
        {
            "index": 260, 
            "rating": "4", 
            "review": "A Nice Experience in Russian Art. The State Russian Museum is located \"Art Square\" featuring a Statue of Alexander Pushkin. This magnificent sprawling building houses a wonderful collection of Russian art. The Hermitage it is not, but that was not a problem for us. We just enjoyed what we witnessed here. When you enter get the mobile audio tour system they provide for a little extra. Get there early to avoid crowds. Even my wife enjoyed(not normal)"
        }, 
        {
            "index": 261, 
            "rating": "5", 
            "review": "Stunning Russian Art. This was a wonderful experience. We spent hours here looking at paintings by artists we'd never seen before. The building itself is of course fabulous and not as overwhelming as the Hermitage however it is the art that is the star here. For us in particular the late 19th and 20th century art represented by people such as Vrubel. It is a must along with the Hermitage and easier to take in!"
        }, 
        {
            "index": 262, 
            "rating": "5", 
            "review": "Wonderful collection of Russian art.. the wonderful thing about this as well as other galleries in Russia is one proximity to the art. I was looking forward to the Soviet art but unhappily that masterpiece of Stalin addressing in party congress was not on display when I visited. Maybe Putin has had it put back by now."
        }, 
        {
            "index": 263, 
            "rating": "5", 
            "review": "Russian masterpieces. The history of russian art from icon painting to the canvasas of soviet painters - development of russian pictorial art spread out before you. Very impressive huge canvases by Aivazovskiy is just something one must see at least once..I would define the magnifisent collection as the richest heritage of russian art - dont forget to put this museum to your list of places to see in St Petersburg."
        }, 
        {
            "index": 264, 
            "rating": "2", 
            "review": "Not so impressed. Perhaps it was wrong to head here straight after the Hermitage but as a result, it kind of paled by comparison in my head. Maybe I would have enjoyed it more if I did it on another day. But the bottom line is - if you only have a couple days in the city, spend some proper time at the Hermitage and avoid the State Russian Museum altogether, it's a no-contest."
        }, 
        {
            "index": 265, 
            "rating": "3", 
            "review": "A Formal State Museum. Large paintings, portraits, and lots of gold on the frames. Not so different from most museums, well the old ladies who sit in each room are always there in all old Soviet countries. In Bulgaria, they waited until you walked in to the exhibit room to turn on the lights, and would then turn them off as soon as you left. My father would have approved.Don't try to look at everything on the walls,( overload),but do look AT the walls and ceilings this was, after all, a palace in its former life."
        }, 
        {
            "index": 266, 
            "rating": "5", 
            "review": "Great at every single visit. I first visited the Museum in 1999 and subsequently at every visit to St. Petersburg. It's just that good. The Ermitage never really impressed me (me being not an art lover), but somehow the Russian Museum hits a note with me. What's more, I find I look at the same pictures every time. The portrait of Shishkin, Suvorov in the alps, the Saporog Cossacks,... and yet I never tire of it.THe first time I visited, I had an SPB guide book with a lot of stuff on the Russian Museum, which was good, later I visited without a guidebook or anything - this time, though, I decided not to be cheap and went for the audioguide. More expensive than the entrance fee (but of course cheap in real-life terms) this was a good thing, highly recommended.On practical issue - the museum tends to get full quickly, and especially in winter the limiting factor are the wardrobes, so expect queues from midday on. OTOH; this means that if you come early, you'll be very comfortable. Life in Russia tends to get going around 11am (I stay with friends and they seem to believe to life in GMT time zone) - so try to be there early!!Time-wise we were there about 3h, this included a snack in the café, though (not really recommended). I could have stayed longer, but my 12yo was exhausted. The fact alone that he held up for so long speaks for the museum, though."
        }, 
        {
            "index": 267, 
            "rating": "3", 
            "review": "a bit crowdd. Not far from Palace Square (and surrounded by decent restaurants), is the most excellent Mikhaelovski Palace more commonly known as the Russian Museum. This was my second favorite museum in Russia - behind only the Hermitage. First of all, it's in a palace beautiful in its own right. Second, you're not as likely to be subject to the mass crowds at the Hermitage. (Although you will run into the occasional tour gruop or students led by a teacher)Most importantly, it is filled with beautiful art by artists you've likely never heard of. Some you may have, if you've studied Russian history (Repin and the like), but Schedrin, Ivazovski, Roerich - the list goes on and on. This isn't just boring icons -beautiful seascapes, modern art and excellent impressionism is intermixed with your standard portraits and well-done marble work.When you leave you're treated to a beautiful view of the Church on Spilled Blood (Spas na Kravi) to your right."
        }, 
        {
            "index": 268, 
            "rating": "5", 
            "review": "Russian. I believe that all of the pieces of art in this museum are from native Russians. I think that I only knew 2 paintings before I went in but I have some new favorites. I brought my camera in and took lots of pictures. I also loved how some of the paintings were as tall as the walls which are taller than 10 feet in places."
        }, 
        {
            "index": 269, 
            "rating": "4", 
            "review": "...the heart of Russia will not forget you. My husband and I visited this museum in October, 2014. The cloakroom and toilet rooms were modern and clean, and the exhibits were well displayed. Several famous ones that I anticipated were missing, (perhaps for cleaning or on loan?), so that was a disappointment. There were some fabulous portraits of some parliamentary figures, and that was really interesting. Again, too bad there was no information about these paintings at the gift shop. It was nice to see the palace that Alexander II had visited (to convince his cousin to accept his morganic wife) just immediately before his assassination and the stair case is a marvel. We recommend this museum for its collection."
        }, 
        {
            "index": 270, 
            "rating": "5", 
            "review": "Impossible to understand Russia without this museum. The masterpieces on display are jewells in Russian arts. They depict rich cultural and historical heritage, often in dramatic way. Grand canvases are especially magnificent."
        }, 
        {
            "index": 271, 
            "rating": "5", 
            "review": "Icons and Aivasovsky. Well worth a day's visit. Particularly the bottom floor with stunning icons and the upper floor with Aivasovsky's \"Wave\" make for a memorable visit. The guides are interesting to listen to even if you don't understand Russian. Their love for these masterpieces is clear in their gestures, facial expressions and tone of voice. Some are so excited it sounds like they are almost singing."
        }, 
        {
            "index": 272, 
            "rating": "5", 
            "review": "Russian Museum - St. Petersburg. Fantastic collection of Russian Art. There are over 400,000 paintings, ranging from historic icons to modern art of the twentieth century. These are all works by Russian artists. Museum is well designed, easy to get around and is 'warm and inviting'.Entrance fee was 350 rubles. There is a nice cloak room, museum shop, refreshments and bathroom. Well worth the visit!Jon Lefeber"
        }, 
        {
            "index": 273, 
            "rating": "5", 
            "review": "Hermitage first, then this one--DONT SKIP THIS ONE. For history buffs, this museum will move you chronologically through the centuries of Russian history. The dramatic shifts in history are well-represented. One moves between \"Old Rus\" rooms (icons) and \"Imperial Russia\" (the European-style rooms), for example, and \"Imperial Russia\"/early 20th c to \"Soviet style\" art. The shifts are shocking; the presentations make a big impact. A long hall of \"craft,\" again presented \"through the centuries,\" was excellent. Don't miss this museum."
        }, 
        {
            "index": 274, 
            "rating": "5", 
            "review": "More interesting than the Hermitage. The Hermitage seems to be the top of everyone's list of art museums to see in St. Petersburg, but in my opinion, The Russian Museum was far more interesting and a good place to learn about Russian history and culture. All of the art work in this museum is by Russian artists. The collection spans Russian history from the early times to the present. Although most of the collection consists of paintings, there are small collections of other media including sculpture, wood carvings, and lacquer-decorated objects. The paintings by Russians are simply amazing. They depict important moments in history, famous characters, as well as ordinary life and people. Many of the paintings are enormous and cover and entire wall of the gallery. I found that touring this museum gave me a good introduction to a cross-section of Russian history as well as a taste of the complex soul of the Russian people. This will be the first place I re-visit if I go back to St. Petersburg."
        }, 
        {
            "index": 275, 
            "rating": "5", 
            "review": "Excellent. One of the best museums in Russia, not even St.-Petersburg, where you could find most beautifull creatures of great artists."
        }, 
        {
            "index": 276, 
            "rating": "5", 
            "review": "A different feel from the Hermitage. This is where you see art by Russian artists. I wasn't familiar with them, but am very glad I went. You would probably want to allow at least two hours there, depending on your level of interest. Most of the souvenir shops sell videos of the museum, but they are not in the system the US uses. You can get programs on the internet to convert it. I haven't had time to do that yet, but I was so impressed with the collection that I wanted something to remember it by. It is close to Church of the Savior on Spilled Blood, so you can combine visits for a half day of touring."
        }, 
        {
            "index": 277, 
            "rating": "5", 
            "review": "One day is not enough.. One day is not enough. You can be lost there. Great museum, but you need hours. And the entrance in the park can be closed in winter times - take another one from the canal."
        }, 
        {
            "index": 278, 
            "rating": "5", 
            "review": "Impressive collection!. This State Russian Museum collection is housed in the impressive neoclassical Mikhailovskiy Palace and traces the complete history of Russian art, from magnificent 11th century icons to contemporary works. The palace itself (former imperial residence built for Grand Duke Michael Pavlovich) is a sight to see as many of the halls retain their original opulent Italianate interiors. We enjoyed our time at the Russian Museum as much as our time at the Hermitage and WITHOUT the huge crowds associated with the Hermitage."
        }, 
        {
            "index": 279, 
            "rating": "4", 
            "review": "Wonderful variety of art and craft. We visited on a Sunday in late October, when the museum can get very busy with local people and groups of children exploring the place. The busyness was not a problem - just part of the experience. There are some fascinating things to see. All exhibits have an English translation along with Russian, so it is easy to discover what is being seen. I particularly enjoyed the section with some art-crafts - lacquered boxes, lace, wooden toys and models - but other may prefer more 'classic' art. What you won't find here is anything covering the Second World War or later - perhaps that is displayed in a different museum. We went to the small cafe in the basement and had great soup for lunch. Both of the ladies serving spoke a few words of English, and were helpful, so it didn't feel too difficult making an order."
        }, 
        {
            "index": 280, 
            "rating": "5", 
            "review": "Impressive art and (interior)architecture.. A visit to the Russian Museum is very recommended. If you want to explore more Russian Art than this visit is a must be. The Russian art is fantastic, I have never seen such a vast collection except Repin. The interior is also overwhelming. Try to see what materials are used. The main staircase is also impressive. I took many fabulous pictures with my new camera Nikon D810 and oh it was worthwhile. Hermitage and Russian Museum, both are worth visiting. You can say both are excellent but only different more complementary."
        }, 
        {
            "index": 281, 
            "rating": "5", 
            "review": "Russian fine art.. I have been to many of the major museums ,and this was my first visit to an all \"Russian\" museum. i love it. Highly recommend getting to this one. i loved most of the works & paintings there which are really something to see , enterance cost 350 rubles per person."
        }, 
        {
            "index": 282, 
            "rating": "5", 
            "review": "must see place. one of the best and must see place in Saint Petersburg. Wonderfull plcace with biggest collection of russian art in every field from icons till modern art. Beautiful Mikhailovsk's palace. You will enjoy this luxuriest atmosphere of russian emperors."
        }, 
        {
            "index": 283, 
            "rating": "3", 
            "review": "Authentic Russian. Finally something really Russian, after the Hermitage which ignores all that is Russian this Museum gave us a great impression of the development of the Russian arts. We found it interesting that most of the developments that took place in Europe in the 13th/14th century took quite some time until they arrived on the canvas of the Russian artists. The collection is unfortunately not as well restored as the one in the Hermitage. Also the displays and the rooms could use some renovation. I hope they invest a bit of money to keep these unique pieces of art."
        }, 
        {
            "index": 284, 
            "rating": "5", 
            "review": "We preferred this one to the Hermitage... believe it or not :). Great collection of Russian art. The Hermitage has art from around the world so we found it very interesting to see only Russian artist (or foreign artists that lived in Russia at least). We both agreed that this museum had a bigger impression on us than the Hermitage."
        }, 
        {
            "index": 285, 
            "rating": "5", 
            "review": "Uncrowned rival IMHO of the Hermitage.. The Russian artists of the 1880's and impressionists era are collected here. See for yourself if some of the massive sized paintings don't impress you more than the two small Davinci s in the Hermitage. Easy to get to and easy to do in a couple hours without the crowds."
        }, 
        {
            "index": 286, 
            "rating": "4", 
            "review": "Enjoyed my visit. I liked this museum. Some of the paintings were excellent. I am not too big on seeing every little thing on display as you can see from the time I spent there but I have to say I did enjoy this one."
        }, 
        {
            "index": 287, 
            "rating": "5", 
            "review": "Good Overview of Russian Painting with a Newly Renovated C19 and C20 Wing. The museum is uncrowded and, yes, the arrangement is chronological yet slightly confusing. Nevertheless, it is delightful and important. Particularly for anyone with a keen interest in nineteenth and twentieth century painting, the new installation helps connect the dots, so to speak, in the history of Russian art.Note that, like the Hermitage, you cannot re-enter the museum, although you can of course back track. So there is a cafe with light food near the present visitor entry and a full-service restaurant just before the exit. (At the Hermitage, you need to look for the Internet Cafe.) Plan to spend the greater part of a day in either museum."
        }, 
        {
            "index": 288, 
            "rating": "3", 
            "review": "Doesn't compare to the Hermitage. This was okay, but after seeing the Hermitage was not very impressed by the museum or the art. If you have to make a choice - choose the Hermitage. Plus, the way this place is designed is very confusing. It is like a big maze. I would not really recommend this museum."
        }, 
        {
            "index": 289, 
            "rating": "5", 
            "review": "Not only Mondrian and Kandinsky. This museum was a great sorprise. I went with no knowledge about russian art and i was very glad to discover the rich history of it. The Museum is really big, but have a cronological order. And all the rooms and pictures have exhaustive explanations in english.The souvenir and book store is very complete and cheap, so you can go deep with a good book."
        }, 
        {
            "index": 290, 
            "rating": "4", 
            "review": "Lots of history !. Nicely situated just a few minutes walk off the Nevsky Prospekt, this museum is well worth a visit. Lots of information and exhibits showing some of the history of this big country with such a long and hard history."
        }, 
        {
            "index": 291, 
            "rating": "5", 
            "review": "A delightful surprise. After the mobs at the Catherine Palace and the Hermitage, we were delighted with the beautiful and uncrowded Russian Museum. The art, although previously unknown to us, is gorgeous and the Russian impressionists rival those of France.\nWe actually enjoyed this hidden treasure more than our visit to the Hermitage."
        }, 
        {
            "index": 292, 
            "rating": "5", 
            "review": "Do not miss this museum. The art is magnificent! We had not heard of most of the artists because one generally does not get to see these paintings. We were awed by the quality of the artists."
        }, 
        {
            "index": 293, 
            "rating": "5", 
            "review": "Superb. A superb collection of Russian art, beautifully and thoughtfully displayed. Probably a better presentation than the Hermitage on a bright day. Well worth a visit, although finding the front entrance can be a challenge. Once you have twisted and turned through the basement corridors/maze you emerge into a lovely gallery."
        }, 
        {
            "index": 294, 
            "rating": "3", 
            "review": "Tick the box by visiting but there are more enjoyable places. It's a kind of a \"must-see\" landmark that every concierge will tell you to stop by at. If you love Repin et al, then you'll spend a very enjoyable 3-odd hours here but overall, it feels a little bit soulless and you're better off seeing the grandeur of Tsars at the Hermitage. So yes, if you're in the city for 3 days, you're going to end up here anyway but if you've only got a day to cram sightseeing into, there are better places."
        }, 
        {
            "index": 295, 
            "rating": "5", 
            "review": "See this as well as the Hermitage. I loved visiting the Hermitage but the Russian Museum is very worth your limited tourist time.As other reviewers have said:- you can't see this art anywhere else and some of it is astounding- it is a lot less crowded than the Hermitage- there is a nice progression from icons to modern I wish we had more time, as we wound up literally running through the Museum as it closed down around us. Allow more time than you think, because you'll need it."
        }, 
        {
            "index": 296, 
            "rating": "5", 
            "review": "Great Russian art--maybe skip the Hermitage. This is a fascinating and fantastic museum of Russian art. The works may be especially interesting to Americans and Western Europeans since many of these artists are unknown outside of Russia. If you are really pressed for time in St. Petersburg, consider skipping the Hermitage since the art in the museum is available in many other places in the world."
        }, 
        {
            "index": 297, 
            "rating": "5", 
            "review": "Fascinating museum - much better managed than the Hermitage!. This museum is really fascinating and gives you a great insight into Russian art over the centuries. It is very manageable and easy to navigate - a big contrast to the Hermitage which was a living nightmare. This museum has far fewer guests and can be done within a couple of hours. Highly recommend getting the audioguide as you won't be able to understand anything otherwise."
        }, 
        {
            "index": 298, 
            "rating": "4", 
            "review": "Huge art gallery of Russian stuff. We spent a couple of hours, and saw only a tiny proportion of the pieces on display. The tempory exhibits of glass & porcelain were impressive & very well displayed."
        }, 
        {
            "index": 299, 
            "rating": "5", 
            "review": "Amazing art collection. I was absolutely amazed by how vast and rich the collection is. I have been in the museum for 5 and a half hours and didn't feel the time pass. Try to have several visits, it's very exhausting and almost impossible to see it all at once."
        }, 
        {
            "index": 300, 
            "rating": "5", 
            "review": "Russian immersion. Great to browse through Russian history from icon painting to after soviet art. I found it great to browse through and read all the Russian history on Wikipedia whilst I was seeing the related art."
        }, 
        {
            "index": 301, 
            "rating": "5", 
            "review": "You Can't See This Anywhere Else, So Go There. Over 100 rooms of Russian art from icons to iconoclasts. There were at least 20 artists we learned about that we found extraordinary (courtesy of our guide Olga from Marina Wilson tours) and none of this beautiful work is known outside the country it seems. For those who love impressionists, don't miss \"Moonlit Night on the Dnieper\" by A.I. Kuinji. For more traditional excellence, Ilya Repin is most famous but we were also taken with Aivazovsky's maritime scenes, Rokotov's portraits and Rublev's icons. There are many more, so come and see something Russian while you are here."
        }, 
        {
            "index": 302, 
            "rating": "4", 
            "review": "Best collection of Russian art in the world. After the size and grandeur and crowds of the Hermitage, this was a relaxing few hours to browse Russian art. After all, we were in Russia. After entering through a small door and negotiating somewhat of a maze we did manage to get through the museum in a few hours, albeit not in detail. Only Russian art here but some excellent and large works from Renaissance times and some interesting Soviet era art. Worth it for the price."
        }, 
        {
            "index": 303, 
            "rating": "5", 
            "review": "My favorite museum in St Petersburg - Repin. I have a particular fondness for Ilya Repin who is well displayed here but I also love almost all things Russia. This is my favorite place. You won't have the brutal crowds of the Hermitage and its a wonderful place. Please take the time to visit this museum."
        }, 
        {
            "index": 304, 
            "rating": "5", 
            "review": "Superb!. The Russian painting has started relatively late, and while the rest of Europe was developing art for centuries. the Russians did it in a few decades. This museum displays the fantastic collection of Russian masters, showing that there wasn't lack of talent between Russian artists and there are incredible paintings all over the museum. If you are not familiar with th Russian art this museum is highly recommended!"
        }, 
        {
            "index": 305, 
            "rating": "4", 
            "review": "Some amazing large paintings?... There are many cultural attractions in St.Petersburg Russia...92 that I know of!This is worth a visit to see Russian art and there are some very impressive pieces worth seeing that alone justify the price of admission. Plan on minimum 3 hours but recommend 5 hours and take your time. Upon first entering you will see some large pieces that seem like they are about 120 square feet each! One wonders how the accuracy could be so good on such a large canvas. But then again this is Russia...a much misunderstood country and one of great achievements that become lost in the vestiges of politics."
        }, 
        {
            "index": 306, 
            "rating": "4", 
            "review": "Wished we could have had a bit more time. We were running out of time and just managed a few rooms in this museum but found it very interesting. Very different to what one sees in the other sights in St Petersburg. Russia artworks with a lot of historical significance. So much to see and so little time....."
        }, 
        {
            "index": 307, 
            "rating": "5", 
            "review": "The place to go for Russian art. As I've said in my previous review, when it comes to the Hermitage, it's certainly not a place to admire paintings, with far too many distractions. On the other hand, the State Russian Museum is just the place to go if you wish to concentrate solely on the beautiful paintings and sculptures. All of the important names are under a single roof, my favourite part of the galleries being the displays of works of Aivazovskiy, Andreyevich, Repin and some more Malevich, though his famous Black Square is in Moscow's New Tretiakov Gallery. It's manageable to walk through in one session.Only two nuissances: higher prices of entrance tickets to foreigners and some parts of the gallery being closed because of the renovation so instead of doing a round walk of the buildings you have to return and then go other way."
        }, 
        {
            "index": 308, 
            "rating": "5", 
            "review": "Excellent for art lovers. After the Hermitage with its poor lighting and mad crowds, this museum was so refreshing. Only the odd tour group, lots of quiet spaces to enjoy a vast historical sweep of Russian art. The audio guide was excellent too."
        }, 
        {
            "index": 309, 
            "rating": "5", 
            "review": "A Good Alternative to the Hermitage. A great collection of Russian art, and a better museum to visit than the Hermitage, which tends to be swarming with tourists."
        }, 
        {
            "index": 310, 
            "rating": "5", 
            "review": "Rarefied opportunity to view Russian paintings from the 19th and 20th century. Rarefied opportunity to view Russian paintings from the 19th and 20th century. The Hermitage is such a zoo these days, do yourself a favor if you are an art lover and spend a half day viewing this collection which you won't find anywhere else in the world."
        }, 
        {
            "index": 311, 
            "rating": "4", 
            "review": "A niche of world treasures. certainly the Russian repository for Egyptian, Greek and all world class historical art and artifacts. All a bit of a rush to get through but you just can't see everything and have to really scan everywhere as you go through."
        }, 
        {
            "index": 312, 
            "rating": "3", 
            "review": "Old style Museum. What a warren of rooms!\nA large palace of many rooms, small collection works of Tatlin and Malevich making it worthwhile once they are located."
        }, 
        {
            "index": 313, 
            "rating": "4", 
            "review": "Worth a visit if you haven’t visited similar museum. Comparing to The Hermitage, the collection here is smaller, but there were much less people here, making it a lot easier to enjoy the artworks. Though, as I am not really an art addict, I found that the artworks become slightly repetitive as majority of the religious icons are of similar subject, but it is still worth a visit."
        }, 
        {
            "index": 314, 
            "rating": "5", 
            "review": "A Must. We found that every word of \"Kiev October\" was correct. We were interested mostly with Art in the end of the 19th &20th centuries. Amazing collection of paintings and sculptures. Mostly unknown to the us as \"westerners\" but all the same a splendid and rich collection in a beautiful setting. We were only in the exhibition in the Michilovsky Palace. There are more 4 buildings in the city! Something to expect for our next visit in this outstanding city."
        }, 
        {
            "index": 315, 
            "rating": "4", 
            "review": "If you are willing to learn something new.... WHY WORTH SEEING: as a tour guide, I must admit that not that many people know and care about Russian art. So if you are one of those people and you are not willing to spend your precious time trying to pronounce \"Ay-va-zov-sky\", then go to the Hermitage instead. On the other hand, if you want to see and learn something new and aviod crowds, go there. There were periods in Russian art, when we truly were like nobody else, and those periods are very well represented in this museum.Another great thing about this museum is that there is no BEST TIME TO VISIT or BEST WAY TO GET THERE, because it's never too crowded (just a couple Russian groups here and there) and it's located right next to the Church on Spillt Blood or Grand Hotel Europe and Nevsky prospect.MUST SEE: as I said before, there were periods in Russian art, when it was very different from every other art in the world. What you must see is the pieces created in those periods.The first one is represented by Russian icons, which in my opinion are perfect examples of something truly spiritual. All of them are located on the second floor.After that for quite a while Russian art was really influenced by Europe and we didn't create anything unique. All the pieces from that period is everything on the second floor, except for the icons, so I recommend to skip that.But then, starting the second half of the 19th century, something happened to our art and it became truly unique. Every artist had his own style and his own ideas. That's where the true Russian art comes and it starts on the 1st floor. Go around the whole 1st floor until you see the sign \"To the Benois wing\". Do not skip that wing and you will see some great Russian and Soviet art (19th-20th centuries).PLEASE NOTE:- The museum has wierd working hours. On Thursday is doesn't open till 1PM.- The museum is closed on Tuesday.- The museum is not really handicapt accessible, you have to go up the stairs in order to see anything.- They ask you to pay extra for taking photos, but nobody ever checks.- The cafe in the Benois wing is quite decent."
        }, 
        {
            "index": 316, 
            "rating": "5", 
            "review": "Worth a visit. Huge collection of Russian antique and contemporary art.Not to miss the astonishing \" The Wave\", by Aivazovsky."
        }, 
        {
            "index": 317, 
            "rating": "4", 
            "review": "Outshine the Hermitage (is that possible?). I'm actually not an art fan, but I love portraits. I had actually planned to see the Hermitage on Monday but found, to my chagrin, that Monday is their day off. So went to the Russian Museum by chance. Wow!Just around the corner from the Cathedral of the Spilled blood; short lines and not nearly as crowded as the Hermitage; fabulous collection of Russian painters including my favorite Brulov.Don't miss it!"
        }, 
        {
            "index": 318, 
            "rating": "5", 
            "review": "Alla tours of ST. Petersburg, Russia. A group of us from Canada who were on a Baltic Sea cruise hired guides Katherine, the tour guide and Sergei, the bus driver, from Alla Tours to help us tour St. Petersburg for 2 days. We visited the Yusupov Palace, Peterhof Upper Garden and Fountains Park, the Catherine Palace, took the hydrofoil boat, visited the Hermitage, rode the subway, took a canal ride and had lunch at a Russian restaurant on the second day and then to the Church on the BLood. It was very much a packed 2 days. We walked a lot. Lunch had been included in the price of the tour for both days. Catherine was a very knowledgable guide, explaining many details and the history of the city to us. She made it an extremely interesting tour. St. Petersburg is a dynamic and big city and very busy. Lots of tourists and of course, lots of traffic. Sergei did an excellent job driving us around. He spoke little English but Katherine would interpret for him. They both appreciated the humour of us Canadians and were even laughing with us by the end of the second day. It was worth the price and all the walking. I would highly recommend this tour to anyone visiting St. Petersburg."
        }, 
        {
            "index": 319, 
            "rating": "4", 
            "review": "A great Russian art collection. I loved this museum. Not such a sumptuous and ornate building as the Hermitage and Winter Palace, but the building is still huge and impressive, and so is the collection. Scores and scores of rooms, with plenty of information in English as well as Russian. I concentrated on the paintings and there's far more here than I could take in during a 90-minute visit but I was so pleased to have gone. Lots of reminders of Russia's noble and grand past, spectacular landscapes, the violence of some of its history - and its very close links with Europe in the past few centuries and its shared artistic heritage as well as its own distinct traditions. Next time I'd come with a guide or at least hire an audio-guide, but for a first visit I was delighted just to soak up impressions and enjoy the sheer range of what's exhibited."
        }, 
        {
            "index": 320, 
            "rating": "4", 
            "review": "unexpected. I voluntarily skipped this museum on my first trip to St. Petersburg, and must admit I should have gone there rightaway. It is very instructive and gives an unbiased view on russian art and culture."
        }, 
        {
            "index": 321, 
            "rating": "5", 
            "review": "Russian art history at its best. Fantastic museum - if you are into Russian art, it will take you on a journey from the time when the first icons were created by local artists to the 20th century."
        }, 
        {
            "index": 322, 
            "rating": "5", 
            "review": "Smaller that Hermitage but nicely curated. This museum's collection of Russian art is well-curated and easy to navigate. We spent about 2 hours here and saw the best of the displays. The gift shop also is the place to buy authentic crafts."
        }, 
        {
            "index": 323, 
            "rating": "4", 
            "review": "Eye opening for many Westerners. The museum is set up chronologically, from religious art to current times. It is interesting to contrast what was happening in Russia with what was happening in Western Europe at the time, and see how religion and governments influenced the styles. It was also quiet during our visit, welcome after the crowds at other sites in St Petersburg. Maybe not a must see, but well worth it if you can find the time."
        }, 
        {
            "index": 324, 
            "rating": "5", 
            "review": "Wonderful icons and folk art. I enjoyed this museum more than the Hermitage, which is so crowded in high season that you can hardly walk through it. The Russian museum is much more manageable. There is a wonderful collection of Russian icons including a half dozen masterpieces. The folk art is also terrific."
        }, 
        {
            "index": 325, 
            "rating": "5", 
            "review": "russian realism. I left the Russian Museum bigger impression than the famous Hermitage. Beautiful Russian works, especially realism, the current exhibition of the first World War is authentic."
        }, 
        {
            "index": 326, 
            "rating": "5", 
            "review": "Great museum for Russian art. The State Russian Museum is around the corner from the Church on Spilled Blood. It houses only Russian art, and is much smaller and less crowded than the Hermitage. It's definitely worth visiting for a look into the history of Russian culture. Get the self-guided audio tour to understand the artists and the art."
        }, 
        {
            "index": 327, 
            "rating": "4", 
            "review": "You've seen everything else--now see RUSSIAN art and artists!. This museum contains over 400,000 works of Russian art--drawings, paintings, sculptures, icons, folk art, etc--from ancient to modern art--which is spread over four beautiful palaces in the center of St. Petersburg. It is definitely worth a visit if you have the time or the inclination. It gives a visitor a more complete view of Russia, its people, its history, and its methods of survival."
        }, 
        {
            "index": 328, 
            "rating": "4", 
            "review": "A Must For Anyone Wanting To See Russian Art. Starts with the earliest Russian times and continues through the 20th century. Takes about 2 hours to complete at an appropriate pace."
        }, 
        {
            "index": 329, 
            "rating": "5", 
            "review": "Worth a visit just for the Constructivist Art. This museum is not as popular as the Hermitage but offers some beautiful examples of contemporary Russian art - Malevich and Kandinsky are represented. In the relatively quiet surrounds and lack of crowds it makes a nice and easy detour after the more popular museums. Good bookshop and some interesting icons and Russian craft and rural art too."
        }, 
        {
            "index": 330, 
            "rating": "5", 
            "review": "A great national museum. The Hermitage has great art, but in summer the lines are very long and the crowds within are shoulder-to-shoulder. The Russian Museum has wonderful art from painters like Repin and Kramskoy, the hallways aren't crammed with tourists, and the site in Arts Square is lovely. Highly recommended."
        }, 
        {
            "index": 331, 
            "rating": "4", 
            "review": "Buy the audio guide or take a personal guide with you. Hardly anybody was at this museum (unilke the hectic Hermitage) but I found it much more interesting to see local Russian art when in Russia than a collection of foreign art in the Hermitage. Here you will see the first paintings in Russia, the largest, the history and some pretty famous pictures as well (ex. Kandinski). But for us, we needed someone to point out the important work or else we would not have seen all the elements at work and known about the history behind some of the masterpieces. The audio guide helped a lot but i suppose a real life guide would be good as well :)"
        }, 
        {
            "index": 332, 
            "rating": "5", 
            "review": "Amazing art - especially the C20th wing. Pushes the Hermitage for top museum in this city of museums and galleries. We started with the outstanding collection of Russian art from the 20th century - to my mind the best part of the gallery... the crowds there are much less than in the main part of the palace..."
        }, 
        {
            "index": 333, 
            "rating": "5", 
            "review": "One of the best museums in the world. I love State Russian Museum. It is often overlooked because of Hermitage - but it shouldn't be. It has unique collection of the 19th and 20th centuries Russian art, including such gems as Goncharova, Filonov, Roerich, and Kuindzhi - some of these you will hardly find anywhere else. The exhibit on the \"other\" Soviet art is also very interesting and creates a much more comprehensive picture of what was happening in the Soviet society.During my visit, the Museum had Roerich's exhibit on display which was simply stunning and included not only paintings but also letters, quotes from his writing, and sketches.Both permanent and temporary exhibits are also very well organized visually. Nothing distracts you from the artworks, and there are helpful and elegantly done descriptions on the entrance to each room. Sometimes I wish these were a bit more detailed, but that's the only thing I would improve."
        }, 
        {
            "index": 334, 
            "rating": "4", 
            "review": "Well worth a visit. Excellent special exhibit of political posters and paintings from the WW I era. Permanent exhibit of constructive paintings was also very interesting."
        }, 
        {
            "index": 335, 
            "rating": "4", 
            "review": "Russian Museum. It was interesting to see the Russian art and compare it with Western art, it is very different, but worth a visit, since it is near the Church of the Saviour on teh Spilled Blood one can visit both the same day."
        }, 
        {
            "index": 336, 
            "rating": "5", 
            "review": "Not to be missed. A superb collection of russian art. While not nearly as huge as the Eremitage, this museum is unique in that its collection consists solely of russian art. There were not large queues when we visited and the audio guide - available in various languages - was excellent and well worth the money. Photography is allowed. The collection spans everything from icons to russian constructivism and beyond. For me the most impressive sight I visited while in St Petersburg."
        }, 
        {
            "index": 337, 
            "rating": "5", 
            "review": "No queues great museum. The artwork on display in the main museum is stunning. Pay extra to take pictures. The entry is worth it for the Aivazorsky paintings alone but there are far more. lacquer work, folk art, lace, modern and old paintings. Cafe served good cakes and coffee. If you want to see Russian art forget the hermitage this the place."
        }, 
        {
            "index": 338, 
            "rating": "5", 
            "review": "REAL RUSSIA. You have done the Hermitage, now do not miss the REAL RUSSIA museum which is not overflowing with tourists & which allows you to stop & look without a tour guide plus her group smashing past you -pure joy! The paintings of early Russian history were an eye opener as was the group of school children been taught their history via paintings - nice one of the Czar holding his council,which again had a history group sitting down in front of it.The Benois wing contains painting from the 19th. & 20th. century which introduced me to a new set of artists plus of course they have Kandinsky and Malevich. Nice section on folk art plus a great statue of Ivan the Terrible. Pushkin statue as you go towards the museum with the usual pigeon either sitting on his head or on his arm. A different experience during your visit to St. Petersburg & a very good one."
        }, 
        {
            "index": 339, 
            "rating": "5", 
            "review": "Don't miss. Ok - this museum has the MASSIVE benefit of not being over run with Da Vinci hungry tourists. It also has amazing art work on display. I loved it here. Great building as well. Less overwhelming than the Hermitage. Also, so much of the art was new to me which made it really exciting. Loved it. The folk art section was great too - so interesting to see decorative art in a museum like this."
        }, 
        {
            "index": 340, 
            "rating": "4", 
            "review": "Delightful Surprise. We were very peased that we added a stop to the Russian Museum, it made us appreciate they had their own Cowboy and Indians (eskimos/Mongolian warlords etc,,,) going down as did we.Their style and taste were very similar to the rest of Europe but quite a few more Grand Pictures taking over the room that I would have guessed. Wood work was exquisite"
        }, 
        {
            "index": 341, 
            "rating": "5", 
            "review": "Allow enough time. This place is much bigger than it looks. Enter on the canal side and see the special exhibit first. Be prepared with your map because it's a maze inside. Also be prepared to walk up and down stairs."
        }, 
        {
            "index": 342, 
            "rating": "5", 
            "review": "it is not the Hermitage, it's really Russian!. Visit this museum and you'll never be sorry for it. There are a lot of paintings of Russian artists:Aivasovsky, Syshkin,Vasnetsov and many others. It is placed in the wonderful Palace, that looks like a Russian estate,but much larger. There are no crowd of people here and you will ave a chance to spend pleasant time in a really impressive place."
        }, 
        {
            "index": 343, 
            "rating": "5", 
            "review": "A hidden gem. Most people travelling to St. Petersburg miss this wonderful museum because they spend so much time in the Hermitage. The wonderful artwork on display at this museum is well worth a visit. It's a fairly small museum in comparison to the Hermitage so it will only take half a day but you will not be disappointed."
        }, 
        {
            "index": 344, 
            "rating": "5", 
            "review": "Best of Russian Art under one roof. One cannot visit Russia without learning of its culture and the Russian Museum is a fantastic place to start. The museum encompasses art through the ages including handicrafts ranging from a wooden sculpture of mice carrying a cat tied up in ropes (the cat symbolizes the czar), ceramic toys (actually intact), traditional costumes and textiles to paintings that range from icons to the soviet period. It certainly is an impressive collection all housed in a former palace.Make the time and you will not be disappointed."
        }, 
        {
            "index": 345, 
            "rating": "5", 
            "review": "Very good!. Huge and full of interesting items: paint exposition as well handcraft from all Russia and different periods.Very nice to visit also the garden on the side of the palace…. don’t miss it: should be a pity!"
        }, 
        {
            "index": 346, 
            "rating": "5", 
            "review": "Well worth a visit. The State Russian Museum is well worth a visit as well as the Hermitage if you have the time. It is quite different from the Hermitage and traces purely Russian art from very early times up to the present day. It starts with icons and illustrates well how art developed in Russia from then onwards. It is interesting how Russians have copied other European artists over the years. There is also some interesting Russian folk art. We were pleased we saw this interesting museum even though we had already spent many hours in the Hermitage. We liked being able to see some specifically Russian art whilst in Russia and, unlike the Hermitage, a lot of the artists were new to us."
        }, 
        {
            "index": 347, 
            "rating": "5", 
            "review": "A must when in Russia. The most fantastic place to experience Russian art at one place. What a collection! The contemporary section was full of great pieces quite far from the image of Soviet art I had before visiting the museum"
        }, 
        {
            "index": 348, 
            "rating": "5", 
            "review": "Don't stop after The Hermitage. The State Russian Museum also has an interesting collection and the Mikhailovsky Palace is a lovely setting for it."
        }, 
        {
            "index": 349, 
            "rating": "5", 
            "review": "Less Crowded. The Russian Museum holds Russian artwork running from early icons through soviet junk. Some of the best and most famous artists of Russia are represented. The crowds are typically much smaller and the experience better than the Hermitage."
        }, 
        {
            "index": 350, 
            "rating": "5", 
            "review": "Keep returning there. I keep returning there and everytime there is something new I haven't seen or noticed before.There are no long queues to enter so if you cannot make it to State Hermitage - try Russian museum."
        }, 
        {
            "index": 351, 
            "rating": "5", 
            "review": "My favourite. This was determinately my favourite. Much smaller than the Hermitage it is more accessible. The best thing for me was the russian Art. There were paintings by artists I had never heard of and the more contemporary art was wonderful. There were 20th century paintings so evocative (look out for \"The Queue\" 0 hat I felt I had shared something wonderful. The Hermitage is brilliant, but most of the paintings in there were by artists whose work I had previously had the opportunity to see. This was something new. And if you appreciate costumes,, the display on the ground floor is amazing."
        }, 
        {
            "index": 352, 
            "rating": "5", 
            "review": "Do not miss!. I thought that after seeing the Tretyakov and Pushkin Museums in Moscow, this would be more of the same. Boy was I wrong. This is a huge museum that covers Russian history and art through the ages, so give yourself time. It takes you from early Christian iconography through the centuries, with paintings from the masters: Repin, Vrubel, Kramskoi, Goncharova, Surikov and more. Names many of us Westerners aren't familiar with, but you'll really appreciate them after you've been to Russia. Don't miss because you think you've \"seen it all\" already. This was a real high point in my St. Petersburg cultural experience. There's an audioguide that covers the entire museum, which is excellent, and very worth purchasing."
        }, 
        {
            "index": 353, 
            "rating": "5", 
            "review": "Worth a visit. Take your time going round here - there is plenty of art to see. We don't usally go around art galleries, but this was well worth a visit. Don't forget to buy your Photo permit."
        }, 
        {
            "index": 354, 
            "rating": "4", 
            "review": "megalomaniac. The Russian museum provides a fascinating and comprehensive overview of Russian art and showcases some truly megalomanica pieces with some bizarre images. So very worthwile to just wander around and be impressed by all those massive paintings whose name you've never heard. The works from Kandinsky and Malevich are wonderful to see here! We felt that information and context on the paintings was missing, our viewing trip would have been more rewarding if we could have put the paintings in context. Is very worthwile to pair your visit to the Hermitage with the Russian Museum."
        }, 
        {
            "index": 355, 
            "rating": "5", 
            "review": "An excellent museum. The russian museum provides an excellent and comprehensive view of the Russian painting from the 10th to the 20th century. The section dedicated to the Russian avant-guard painters of the early 20th century is great (although it could be larger), while I had the chance to appreciate more the artistic production of the post-war soviet era."
        }, 
        {
            "index": 356, 
            "rating": "4", 
            "review": "nice exhibitions. they offer very informative temporary and permanent exhibitions. pay attention to works by Paolo Antokolskii , Malyavin,"
        }, 
        {
            "index": 357, 
            "rating": "5", 
            "review": "great value. So much to see. Palace, art, ceramics and a cookery display.Wonderful. Easy to get lost there and it was exhausting but a really good experience"
        }, 
        {
            "index": 358, 
            "rating": "5", 
            "review": "rich collections. There is a lot to this museum and we did not see it all. The collection of Russian art on the main site is very rich and fascinating, and we also saw some lovely folk art - carved wooden furniture and other artefacts and lacquerwork. On a separate site (beside the bridge with takes Nevsky Prospect over the Moyka) we went round the Stroganov Palace, which has marvellous recently restored interiors. There is more on the main site, in the Michailovsky Castle and in the Marble Palace which we did not have time to see."
        }, 
        {
            "index": 359, 
            "rating": "5", 
            "review": "Fascinating, great collection, but take a compass!. One of the great collections of Russian Art, from the very beginning to the present, including early soviet style porcelain, some of the most technically skilled propaganda pieces you'll ever see. Not only great art but a beautiful building as well. Keep track of where you go however, the building layout itself is a bit confusing and the 'guards' in each room do not speak English. At all."
        }, 
        {
            "index": 360, 
            "rating": "5", 
            "review": "Museum ladies = BEST. The Russian museum is a strictly chronological trip through Russian history, beginning with (and you MUST begin at the beginning, the museum ladies will allow nothing else) medieval religious iconography through soviet to modern post-Soviet art. A beautiful and wondrous collection. While I wouldn't say, go here over the Hermitage, this is bar none, my second pick of things to see in St. Petersburg. I must see."
        }, 
        {
            "index": 361, 
            "rating": "4", 
            "review": "An excellant introduction to Russian art. Few museums in western Europe or North America have more than the most cursory collection of Russian art. The State Russian Museum has the best collection in St.Petersburg and one of the two best collections in Russia. I would recommend spending a few hours relatively early in your stay to get a sense of Russian art and culture. Along with many galleries of paintings from various eras there is also displays of folk art, costumes, architectural details from various buildings and the best collection of historical icons in St.Petersburg. The Mikhailovsky Palace in which the collection is located is very handsome."
        }, 
        {
            "index": 362, 
            "rating": "4", 
            "review": "50/50. The museum itself is great not all of the staff is friendly, cashier especially. Audio guide was helpful though, the lady who sold it to me was very nice gave a full instruction on usage and a few very useful tips on museum visiting."
        }, 
        {
            "index": 363, 
            "rating": "5", 
            "review": "Only available in Russia!. I visited St Petersburg in September 2013 and had no plan to visit the State Russian Museum!On a private guided tour of the Hermitage Museum our Russian born tour guide/school teacher/art lover made a strong case for visiting the State Russian Museum.Since this museum was close to my hotel I was there at opening time one morning around 10am, paid the 350 Rubles to get in and did my own walk through the countless rooms displaying a wide variety of artwork which you would certainly not find in different parts of the world. All of it is Russian art and craft!It's also not all art I found coins and sculptures and glass and porcelain and furniture from as far back as 250 years.This visit can be done in a much shorter time than visiting the Hermitage Museum as it is quite a bit smaller.There is plenty of restroom access and I did find a nice break at the café for a little sit down during my walking tour.I spent around 2,5 hours here in total and would consider this an excellent museum and worthwhile visit but only after visiting some of the main attractions in SPB."
        }, 
        {
            "index": 364, 
            "rating": "5", 
            "review": "One of the most outstanding collections of Russian paintings. This museum is a must for those who want to get closer to Russian art and culture. It contains the richest collection of Russian art and covers a wide range of styles and epochs from Rublev and Brullov to Malevich and Petrov-Vodkin.Quite often the different exhibitions are demonstrated there. The visit to this museum is a nice way to understand better Russian history and culture."
        }, 
        {
            "index": 365, 
            "rating": "5", 
            "review": "A gem!. I came for the Hermitage, but my guide suiggested this museum for Russian art. And it is an absolute gem! All phases of history are covered, in much more detail than the Hermitage. Get yourself a guide though..."
        }, 
        {
            "index": 366, 
            "rating": "4", 
            "review": "Impressive collection of Russian art. We had a 2 hour guided trip. We were moving at a reasonable pace and we maybe saw half of the museum. It is not everyday that you find an art museum that concentrates only on artists from one country. A good concept."
        }, 
        {
            "index": 367, 
            "rating": "5", 
            "review": "Beautiful and Unique!. I really enjoyed my rather quick tour through this museum, and would have loved to spend a little more time there, even. It was refreshing to see a collection of Russian art, apart from all of the other classical art within St. Petersburg. Granted, there is plenty of classicism within this museum, as well, but visitors are privy to an exploration of art's evolution within Russia, following trends, European imitations, and art demonstrative of peasant life.. Perhaps it's overly common, but my favorite pieces were two portraits of Anna Akhmatova, as well as the Ivan Aivazovsky paintings and a striking sculpture of Catherine the Great.. It's definitely worth a visit while in St. Petersburg. =)"
        }, 
        {
            "index": 368, 
            "rating": "5", 
            "review": "Fantastic museum in a grand building. You need a whole day to visit. you can have a break at the cafe.. Fantastic museum. Start with the Icons and go through Russias history. There are som very famous painter displayed in each room. You can finishe With both modern art and hanycraft.The building itself are a fantastic old castle"
        }, 
        {
            "index": 369, 
            "rating": "5", 
            "review": "10 centuries of Russian Art in a beautiful palace.. The Russian Museum houses one of the best collections of Russian art and craft in the World, from medieval icons to masterpieces by 20th century artists, and includes many landmarks in the history of Russian art, such as Bruillov's 'The Last Day of Pompeii', and Repin's 'The Barge Haulers'. The museum consists of two connected buildings, the Mikhailovsky Palace houses Russian art and sculpture up to 1900, while 20th century art is housed in the Benois Wing.The museum is laid out chronologically, starting with early religious icons in Room 1, and moving on through the centuries. The rooms of 20th century art are particularly interesting, featuring many artists’ work you won’t have seen outside of Russia. The Avant-garde was particularly active in Russia between 1910 and 1930, developing entirely new genres including Cubo-Futurism, Rayonism, Suprematism and Constructivism. The collection has works by every major Russian artist of the 1920’s; Exter, Rodchenko, Filonov, Goncharova, Malevich, Tatlin and many more. From 1932 onwards the only acceptable style of art and literature was Socialist Realism, with its heroic idealised workers, and socialist themes, which are represented in paintings here.In addition to paintings the museum has collections of drawings, graphic design, sculpture, coins, folk art, glass, porcelain, and furniture from the past 300 years, together with contemporary art, installations, video and photography.The museum also has a charming 8 hectare garden, laid out to a 19th century design. The Russian Museum is definitely worth a visit, and is a much more manageable size then the State Hermitage Museum, which can be rather overwhelming. Opening times: 10am-5pm Monday. 10am-6pm Wednesday, Friday, Saturday, Sunday. 1pm till 9pm on Thursday. Closed Tuesdays.The ticket office shuts 30 minutes before the museum closes.Admission: Adults 350 rubles. Students and children150 rubles. Public transport: Nearest Metro, Nevsky Prospekt and Gostiny Dvor.For further information check the museum website.www.rusmuseum.ru"
        }, 
        {
            "index": 370, 
            "rating": "4", 
            "review": "Some wonderful exhibits, great for an afternoon. Although still housing a vast collection the state museum is much more manageable than some of the larger collections in the city. There is a considerable diversity of exhibits including some rather unusual, folk art springs to kind. Entry fee is pretty minimal and there are some great modern collections too, it's all not all Russian nobility although you might want to speed up on the first floor if that's not your bag!"
        }, 
        {
            "index": 371, 
            "rating": "5", 
            "review": "The cafe worths the visit. Amazing building, very nice expositions, very good location - close to all what you will have to see. Had a wonderful break in the cafe."
        }, 
        {
            "index": 372, 
            "rating": "5", 
            "review": "Be prepared to spend several hours. I believe they have a better collection than the Hermitage. The place is a maze of galleries, and the diversity of the artifacts is just too much for one visit. Plan on making more than one visit"
        }, 
        {
            "index": 373, 
            "rating": "5", 
            "review": "Incredible collection from Icons to Contemporary. It is frankly stupid that the Russian Museum continues to apply a dual pricing system that charges non-citizens more. But that cannot take away from works by Rublev, Serov, Levitan and Kandinsky (to name a few). One of the two greatest collections of Russian art and a beautiful building on Square of the Arts. So unfortunately one has to ignore the discrimination against foreigners, which is offensive and lowers the image of the museum. It's almost sad in a way to tarnish the standing of a great museum for a few more rubles. If the Russian museum wants to earn more money, it should not bother with nonsense like overcharging foreigners, but should go \"commercial\" like the Louvre and Metropolitan. I must add though that most Russian museums continue to charge foreigners a higher rate. The Hermitage does it. The Pushkin Museum in Moscow does it and the Tretyakov too. It's wrong. I condemn it. But it does nothing to affect my deep love for these wonderful masters. Five stars is much too low a rating for the collection of the State Russian Museum. It is one of the top sites in St Petersburg."
        }, 
        {
            "index": 374, 
            "rating": "5", 
            "review": "Russian Museum. Great exhibits; superb collection of paintings (including Impressionists whose work seems to be kept in Russia). A truly enjoyable visit. Great excursion for a rainy/cloudy day. 2-3 hours well-spent!"
        }, 
        {
            "index": 375, 
            "rating": "5", 
            "review": "The realy Russian artist!. This I a must see! Just to find out about Russian specifics in art! I liked very corner! Actually, it was not included in our paid tour but we asked for it and they accommodate us. Was great!"
        }, 
        {
            "index": 376, 
            "rating": "4", 
            "review": "some of the best artists you've never heard of. The Hermitage is Western European art collected by the Czars. This museum on the other hand is RUSSIAN art. And lots of it. And much of it very good. We spent a half day and left more because our minds were saturated than because we were sated. There is a nice cafeteria on the ground floor.... and a visit refreshed feet and body before we went back into the fray. A guide can be useful although we went on our own. There is a lot to learn here. The lighting of the paintings is sometimes distracting and I was surprised to see direct sunlight coming through windows and striking paintings. That can't bode well for their longterm health. A person can get very disoriented in the passageways through which you go to check coats, find restrooms, visit gift ships. Pay attention to where you are going."
        }, 
        {
            "index": 377, 
            "rating": "5", 
            "review": "Almost better than Hermitage. Here the art has room to breath. Some rooms are devoted to a single artist. I was so taken specifically with the paintings of Valentin Serov. The souvenir stands inside the museum do not take credit cards and accept only rubles. Be sure to either have a guide or rent an audio device."
        }, 
        {
            "index": 378, 
            "rating": "1", 
            "review": "Unlawful pricing discrimination disappoints visitors. I was extremely disappointed to learn the Russian State Museum continues to follow a discriminatory price policy, forcing foreign citizens to pay 40% more than Russians. Not only is this downright hostile to the city's foreign guests, but it is outright illegal under Russian law. Article 62(3) of the Russian Constitution provides, \"Foreign nationals and stateless persons shall enjoy in the Russian Federation the rights...of citizens of the Russian Federation, except for cases envisaged by federal law or international treaty...\" In other words, for a museum in Russia lawfully to adopt discriminatory pricing against foreigners, a federal law must explicitly authorise this. There is no such law. It is ironic that any museum in Russia, a country with highest number of millionaires and billionaires in the world, would continue to cling to such misconceived discrimination, let alone a museum in St. Petersburg, a city striving to promote itself as a world-class tourist destination. Wake up and smell the coffee, Russian State Museum administrators. This is a blight to the city and its reputation."
        }, 
        {
            "index": 379, 
            "rating": "4", 
            "review": "Definitely Include. Was not prepared for how good this was - do your homework to decide what you want to see...beautiful building and impressive collection"
        }, 
        {
            "index": 380, 
            "rating": "4", 
            "review": "some wonderful paintings. enjoyed the Russian folk art, and learning about Russian art.nice to be able to leave coats and bags securely as the museum is warm."
        }, 
        {
            "index": 381, 
            "rating": "5", 
            "review": "very good. this place is great pity you can not take photos but very interesting and plenty to see. takes about an hour but very good"
        }, 
        {
            "index": 382, 
            "rating": "4", 
            "review": "Unbelievable works of art. I've been to many museums in Europe and never really noticed much Russian art. This museum should not be missed. You can buy a 3-day pass that includes a few museums within the Russian Museum. The Russian art we saw was wonderful and made us wonder why we've never heard of many of the Russian artists in the museum."
        }, 
        {
            "index": 383, 
            "rating": "5", 
            "review": "Well worth a visit. Of course this is not the Hermitage but we found it more enjoyable in some ways. There were less crowds yet the works of art are wonderful.An extensive collection of Icons from all over the country. Paintings of every7 description and period. It is not just paintings there are all kinds of beautiful things on display from lace to wood and bone carvings, ceramic and china. You get a real sense of the diversity of the talent in the country. There is a nice bright coffee shop in the basement. We would highly recommend this first rate museum."
        }, 
        {
            "index": 384, 
            "rating": "4", 
            "review": "The Only Place for Russian Art. The Hermitage is great, but if you want to see art by Russian artists, this is the place. My husband went with a private guide 9to maximize the experience) but I know I would have enjoyed it even on my own. We spent 3 very wonderful hours, learning about the evolution of Russian art, beginning at the time of the tsars. We were so glad we went."
        }, 
        {
            "index": 385, 
            "rating": "5", 
            "review": "If you love art this is a must. Amazing and truly inspiring, I don't consider myself an aficionado of art, but I was totally blown away.Well worth investing a day to visit."
        }, 
        {
            "index": 386, 
            "rating": "5", 
            "review": "Another must visit!. For a extensive overview of Russian art through the ages this museum is a must. The museum is doable in a 1/2 day. There are audio guides and this is also a converted palace so the museum itself is pretty amazing!"
        }, 
        {
            "index": 387, 
            "rating": "5", 
            "review": "Superb Overview of Russian Art. Having just spent 3 days in the State Russian Museum I can only reiterate here what I have been telling everyone - it is without doubt the best lit, displayed and visitor-friendly museum in St Petersburg. Once you have located the Kassa (ticket office) entrance, a rather badly signposted doorway to the right of the main façade, the visit is a total delight. The staff are friendly and knowledgeable, eager to help and obviously proud of their wonderful museum. Arranged chronologically over two floors in adjoining buildings, the 400 000 works in the collection offer an incredible overview of Russian painting and sculpture from the middle ages to the fall of communism.The curator must have an astonishingly difficult job deciding which of the works in the collection to place on show, but what is on display is not crowded onto the walls - each work is sensitively placed and has sufficient \"breathing space\" - the special exhibition of works by Bruillov from private collections was beautifully hung - and the labeling is clear, at a convenient height, and in English as well as Russian.The guidebooks are well-written and informative, ranging from a pocket companion to a coffee-table tome. The entire premises look clean and well-cared for, and most of the rooms look out on pleasing vistas of park and courtyard.AND - there is a small café in the basement run by very friendly staff with a good selection of beverages, cakes and lunch options, an enormous contrast to the horrors on offer at the Hermitage!A big plus is that tickets are valid for the entire day and multiple entries, so if you need a little while to recover from sensory overload, you can go for a short breather or a snack and go back later for a second dose of this wonderful museum!!Would not have missed this for the world!"
        }, 
        {
            "index": 388, 
            "rating": "5", 
            "review": "A necessary complement to the Hermitage. For those like myself to whom a trip to Russia is not so trivial, it is a unique opportunity to make contact with a huge amount of Russian art of all times. I was deeply impressed by the quality of the works of the times of the \"socialist realism\". Moreover, the pamphlets, posters and banners of the Soviet period brings a certain nostalgia."
        }, 
        {
            "index": 389, 
            "rating": "5", 
            "review": "Better than the hermitage I thought. I loved the art in this museum. Russian artists. The works may not always have been as detailed and the hermitage eurpopean art work but the pictures in the russian museum had lots of movement in them and gave a great insight into russian life in the past. I found the art works very moving and impressive."
        }, 
        {
            "index": 390, 
            "rating": "5", 
            "review": "Russian art at its best. This was not on the 'included' part of our tour to Russia, but it should have been. Some excellent paintings and a really good introduction to Russian artists. And there were not many tourists there.Great place."
        }, 
        {
            "index": 391, 
            "rating": "5", 
            "review": "All Russian culture. I didn't know anything about Russian arts and in this museum it's possible to have a culture about it. The building is a nice neoclassical building in front of a square in italianskaya ulitza. Inside it's a little bit difficult to understand where is the ticket office, the audio guide desk and the cloak room, but the personnel is almost always very kind (and speaking English). The tour is very well organised in chronological way. A lot of portraits (more or less interesting then the really interesting ones (19th century). Very well organised and very rich collection"
        }, 
        {
            "index": 392, 
            "rating": "5", 
            "review": "brilliant collections. If u ask me what would i choose - Tretyakov Gallery in Moscow or Russian Museam in Saint Petersburg i will defintely recommend you the last. The whole collection is located in a very old buiding and while walking and watching masterpieces you could enjoy the interior as well and dive into old times.My recommends to find time to stand near Aivazoskiy's paintings. His manner of painting marine sceneries is something. Go to see Kuingee's \"Moon light over the Dneper\" - a mysterious one. \"last night of Pompeas\" by Brulov is thrilling."
        }, 
        {
            "index": 393, 
            "rating": "5", 
            "review": "Russian art through the centuries. Allow plenty of time for this one. Here one kind find Russian art from religious icons dating back to the 11th century to modern art of today and everything in between. Wonderful experience."
        }, 
        {
            "index": 394, 
            "rating": "5", 
            "review": "Don't Overlook This Excellent Museum. The Hermitage is far larger and has much better known works but we found the Russian Museum's work by Russian born artists to be very attractive and it is far easier to manage than the Hermitage. The collection ranges from ancient icons and folk art through the 18th and 19th century through Russia's revolutionary and Soviet periods."
        }, 
        {
            "index": 395, 
            "rating": "5", 
            "review": "Another great Museum here in St.P. Another fantastic art museum here in the city. While not as large as the Heritage, it is still full of lots of great works of art. Great for a rainy or cold day here in the city."
        }, 
        {
            "index": 396, 
            "rating": "4", 
            "review": "Another good museum. While the Hermitage impresses with wealth, incredible beautiful interiors and highly esteemed collections, the Russian State Museum is more normal... This is a place where without any stirring you can learn a lot about Russian national art. There are presented different expositions and suppose everyone can find something interesting to his taste."
        }, 
        {
            "index": 397, 
            "rating": "4", 
            "review": "Basement maze. Did a too quick and unguided visit here - the basement with toilets tickets etc is a bit of a maze, but lots of good Russian art above"
        }, 
        {
            "index": 398, 
            "rating": "5", 
            "review": "Better than the hermitage. Ok, so in terms of content that is clearly not true. But as a visitor I felt I got a better feel for Russia and the national identity and heritage than from the Hermitage which is simply huge and grand and not full of Russian art or artifacts to the same extent. Ideally go to both. Several times."
        }, 
        {
            "index": 399, 
            "rating": "4", 
            "review": "A very good museum. I did not know much about russian modern art and this museum is perhaps one of the best places I have been to learn a bit about it. And at the same time I found the staff much more friendy than in the Hermitage."
        }, 
        {
            "index": 400, 
            "rating": "5", 
            "review": "Well worth visiting. I knew nothing about Russian Art - but it is well worth visiting if only to put the artists on the map - they ought to be far more widely known"
        }, 
        {
            "index": 401, 
            "rating": "5", 
            "review": "Time well spent, very pleased the hermitage was closed.. I spent 3 nights in Russia which really isn't enough time to see everything. I had wanted to go back through the hermitage museum on my own as I felt rushed with my husband. On Monday (our last day) we decided to split up and visit different attractions however when I got to he hermitage it was closed. I decided to head to the Russian museum and was very pleased I did. The art is more modern and contemporary steering away from the biblical depictions and naked cherubs. I think there really is something for everyone's tastes there and you could go about at a leisurely pace without the crowds. So many great Russian artists I had never heard of, thank goodness the hermitage was closed!"
        }, 
        {
            "index": 402, 
            "rating": "3", 
            "review": "Go for the Folk Art. We really liked the Tretykov in Moscow which also showcases Russian art, but we didn't fall in love with this museum. We love Russian icons and the State Russian Museum has very few, especially compared to the Tretykov or Novgorod. On a more positive note, the folk art was amazing. If I were to do it again, I would start with the folk art and skip many of the other areas. The folk art collection is varied and extensive and gorgeous."
        }, 
        {
            "index": 403, 
            "rating": "5", 
            "review": "If you don't like the crowds at the Hermitage.... Try the Russian Museum. There are some really positive aspects to visting the Russian Museum. It is usually less crowded than the Hermitage and you are able to view the collection at closer views. The collection here is less overwhelming than at the hermitage, and the collection gives the viewer a better picture of Russian life. Especially go to this museum if you are a fan of the Russian rurals. The gift store in the museum is also worth mentioning. The have a good selection of souvenirs for a better price than other museums. When I was there I purchased some beautiful scarves for a really good price."
        }, 
        {
            "index": 404, 
            "rating": "3", 
            "review": "not as interesting for non russians. especially when you already visit the \"heavy duty\" hermitage, this might just be one museum too many if you're not russian and don't have a feeling for what they call \"must see\""
        }, 
        {
            "index": 405, 
            "rating": "5", 
            "review": "A hidden jewel. We went here because it was raining and how lucky that turned out to be! There was a special exhibition of the work of Alexander Golovin. He was a painter and set designer. Worth the entrance money on its own."
        }, 
        {
            "index": 406, 
            "rating": "5", 
            "review": "This is big. This is worth seeing but it is a lot of walking and climbing stairs. Nothing else like it and worth the 3-4hr it takes."
        }, 
        {
            "index": 407, 
            "rating": "5", 
            "review": "The Hermitage. This world class museum and Winter Palace are a must see if one is to call themselves a world traveler. The treasure it is and the treasures it holds within should be permanently and lovingly preserved for the world to view."
        }, 
        {
            "index": 408, 
            "rating": "5", 
            "review": "Loved the Russian Museum. Went to the Russian Museum a day after the Hermitage. It was much quieter and so more enjoyable, with remarkable art collection that has not been as popularized as others (at least for non-Russians!). We were fortunate to have a Russian friend point out his favourite items. Ranges from fine old paintings to Soviet era to lacquer boxes, carvings, pottery, and much more. Don't miss it."
        }, 
        {
            "index": 409, 
            "rating": "4", 
            "review": "A very attractive, airy, and uncrowded gallery - rather a hidden gem.. Just off Nevsky Prospect (next to the Church of Spilled Blood), this large art gallery is a little off the beaten track, off the major tourist radar, and is consequently much quieter (few coach parties with pushy guides).It focuses on home-grown Russian art, with a large collection of works from over 500 years of their history, with paintings, sculpture, and ceramics from the classical era, Soviet period, and modern art.Large, light, and airy rooms make it a pleasant place to spend time."
        }, 
        {
            "index": 410, 
            "rating": "5", 
            "review": "Great collection of the Russian art. The exposition covers a period of one thousand years, from Andrei Rublev to the modern art. Amazing collection of 19th century paintings represents all great names. Strongly recommended."
        }, 
        {
            "index": 411, 
            "rating": "4", 
            "review": "Interesting collection of Russian art. Every time I visit Russian museum I find something new for me. I know very well its old collection of Rerih, Shishkin, Vasnetsov, Repin, etc. and I admire it. Last visit I knew the contemporaneous art collection and was very impressed."
        }, 
        {
            "index": 412, 
            "rating": "5", 
            "review": "Don't miss this gem of a museum. Everyone visiting St Petersburg goes to the Hermitage, and rightly so. But you won't see any Russian painting there, because all those paintings are in this museum. We entered through the Benois wing right by the Church of the Spilled Blood and loved the exhibition of modern Russian painting there. Then we went into the Mikhailovsky Palace for earlier Russian paintings and the amazing architecture. It was like visiting the Tate Britain and Modern in one go. Not to be missed. All of us thought this was as well worth visiting as the Hermitage."
        }, 
        {
            "index": 413, 
            "rating": "5", 
            "review": "Fine collection of 19th and 20th century Russian Art. Everybody rushes to see the Hermitage and given it can take so long to see everything there, tend to give this a miss. Mistake. This is a fantastic collection of Russian Art with a particularly fine section covering the last 200 years. Just round the corner from the Church on the Spilled Blood so you can do the 2 sights on the same day."
        }, 
        {
            "index": 414, 
            "rating": "5", 
            "review": "I love this place. Very nice museum which i love to come. Huge collection of Russian artists from 14th century to nowadays, i.e. from Russian icons till contemporary art. Not as huge as Hermitage, convenient location in the very centre of the city. Located in the former Great Price Mikhail palace that is another beautiful palace itself in the ‘gold ring’ of many St.Petersburg palaces."
        }, 
        {
            "index": 415, 
            "rating": "5", 
            "review": "Not crowded and great overview of Russia. Don't miss this opportunity to leisurely get an introduction to Russia and its art. Few tourist, mostly Russians strolling through this museum."
        }, 
        {
            "index": 416, 
            "rating": "5", 
            "review": "Dont miss it. You may overlook it because of the grandeur of Hermitage, but I would strongly recommend to devote almost as much time for this museum. Breathtaking collections."
        }, 
        {
            "index": 417, 
            "rating": "5", 
            "review": "A museum the city can be truly proud of.. First class art and sculpture in a fabulous setting. My wife loved the folk art and I loved the simplicity of a painting called the queue and the sadness of seeing the painting of Peter the Great on his deathbed. One room is from the original palace and the wooden floor work is stunning together with the splendour within the room. Take time to enjoy the superb ceiling work. Admission of 350 roubles is a bargain and allow a good 3 hours if you want to do it justice. A plea on behalf of my wife is to offer more facilities for the ladies as the queues were too long and there were just not enough within the building."
        }, 
        {
            "index": 418, 
            "rating": "5", 
            "review": "art!!!!!!. what a fabulous museum.around the corner from our hotel.a jewel.....art that you don' see in many other places"
        }, 
        {
            "index": 419, 
            "rating": "4", 
            "review": "Quieter than the Hermitage. The Russian Museum has more art dedicated to Russian painters/sculptors than the nearby Hermitage museum and is a lot smaller so allows you to amble around without the pressure of the crowds. I'd highly recommend Lonely Planet's St Petersburg guide as it details all of the rooms and contents which helps as very little is labelled in detail on the walls. There are more examples of early Russian icon art than the Hermitage and given that the rooms are still very large, you can take your time and look at each piece without being disturbed. There is a natural flow to the rooms that lead you from one section to the next so no worries about being lost. The central grand staircase is a good place to orientate yourself. The cloakrooms however are truly baffling and we laughed when we couldn't find the right desk, going around in circles for 10 minutes down identical corridors. There is no cafe here so bring a drink and the last 2 hours of the day are an ideal time to visit. The schools have left and tourists are back on their coaches so you can have the place more or less to yourself on a weekday. It's also very hot inside even when the heating is off and summer hasn't warmed up yet. Dress light and with practical shoes as there isn't any seating we could find."
        }, 
        {
            "index": 420, 
            "rating": "5", 
            "review": "A favorite museum. I love the Hermitage, but this is where the Russian art is. Also in a former palace, the museum is chock a block full of beautiful portraits, landscapes and art from icons to contemporary."
        }, 
        {
            "index": 421, 
            "rating": "5", 
            "review": "Not to missed. One of the biggest Russian art collection. Extremely pleasant to visit. Make sure to have the audio guide. No waiting lignes"
        }, 
        {
            "index": 422, 
            "rating": "5", 
            "review": "My favorite museum in Petersburg. So many of Petersburg's many treasures are from or directly inspired by Western Europe. This museum emphasizes Russian artists instead, and is both educational and well as a treat for the eyes to see so many excellent and original pieces and styles of art."
        }, 
        {
            "index": 423, 
            "rating": "5", 
            "review": "Interesting thematic museum. This was a great museum to visit. We came as part of a tour, and only spent about a bit more than an hour there (we didn't get to the exhibits of more recent material), but the museum was well-organized sequentially, as you got a history of Russian art simply by going from room to room. I did like the Hermitage more for the chance to visit rooms that were once part of a palace, and the Hermitage did have great collections of, e.g., Impressionist paintings, but I found the Russian museum more informative about Russia's own art."
        }, 
        {
            "index": 424, 
            "rating": "5", 
            "review": "Beautiful Galleries. The Russian Museum is an excellent place to see examples of Russian art through the ages. In addition there are exhibits of armory and other art forms. . Some of the ancient Iconic painting such as the Madonna and child are exceptional. When you are exhausted from walking and looking at the art work go across the street from the main entrance and sit for awhile in a lovely park and people watch."
        }, 
        {
            "index": 425, 
            "rating": "5", 
            "review": "If you like Russian art and iconography, go here. They have \"The Wave\" and many ancient icons and wooden items taken from ancient churches, it's something I really enjoyed. Ignore the guys walking around with loaded Kalishnakovs."
        }, 
        {
            "index": 426, 
            "rating": "5", 
            "review": "Great collection of Russian artworks. The place is less popular than others but we found it worth a visit to see a great collection. For those art lovers, you will appreciate and like the russian art works. Compare to hermitage this place is much less crowded. It is next to the spilled blood church, better go on the same day. We have more pix to share at https://picasaweb.google.com/100092841543065224921/StPetersburgRussia2013"
        }, 
        {
            "index": 427, 
            "rating": "5", 
            "review": "great. What a lovely surprise. A large and spacious museum and not overcrowded. A must if you are interested in Russian art. An excellent selection of 19th and 20th century Russian art. not to be missed"
        }, 
        {
            "index": 428, 
            "rating": "3", 
            "review": "Hermitage better. Hermitage covers almost everything. If you have more time and want to understand more Russian art then worthwhile going. It is well organized and tickets cost 350 rubbles. It is the lane to hotel the Europe. The shops inside the museum are reasonable and nice."
        }, 
        {
            "index": 429, 
            "rating": "5", 
            "review": "Definitely Worth a Visit. I am not a fan or art, nor will I ever be. But I always visit art galleries when I travel because of the vast historical significance that they typically hold. The State Russian Museum was a hidden gem. There was a lot of wonderful art to see here with many great pieces. I really liked that it focuses on Russian art and its history. Not a must see, but worth it for art fans and if you have some time in the city."
        }, 
        {
            "index": 430, 
            "rating": "5", 
            "review": "not to be missed. 4 rooms dedicated to beautiful icons and Natalia at the ground floor + Natalia Goronchova painting in the Benois aisle"
        }, 
        {
            "index": 431, 
            "rating": "3", 
            "review": "Okay but Not a Must-see. Extensive collection of works by Russian artists, but we thought the Tretyakov Gallery in Moscow had a better collection more attractively displayed."
        }, 
        {
            "index": 432, 
            "rating": "5", 
            "review": "Fabulous Collection. The State Russian Museum provides a superb overview of Russian Art. Without a deep or thorough education in art history, I was unfamiliar with many of the artists, Quickly getting past this, I thought the selected art works were uniformly superior in quality and present the parallel courses and divergences between Western European art movements and Russian artists and the unique Russian schools. After having spent two days at the Hermitage, I really enjoyed the fact that this museum was uncrowded and the art was accessible. BTW, the paintings of Kandinsky and Chagall were out on loan according to a docent.The folk art collection is not to be missed. To be crass, the selected pieces of folk art are exactly what you hope to find while shopping for souvenirs but never find!"
        }, 
        {
            "index": 433, 
            "rating": "5", 
            "review": "Might not be the most glamorous, but the collection is worth seeing!. This museum deserves more accolades than it gets. The collection of Russian art is absolutely amazing. If you have time, be sure to stop by. Definitely worth a visit!"
        }, 
        {
            "index": 434, 
            "rating": "5", 
            "review": "A MUST See. This museum is often overshadowed by the Hermitage but is also a fabulous to experience and should not be missed. Featuring a wide range of Russian art one can spen"
        }, 
        {
            "index": 435, 
            "rating": "4", 
            "review": "Russian Art Treat. It was my first time at the State Russian Museum and I really enjoyed it! I'm not much into art in general but this museum had some really interesting works, especially those of Aivazowski. The museum is a nice size, not too large and you can easily see everything in 2-3 hours. They have pretty good toilet and cloakroom facilities. Only downside was that you aren't allowed to drink any water as you go around (unless you do it sneakily!). In some of the rooms it was quite stuffy and hot."
        }, 
        {
            "index": 436, 
            "rating": "4", 
            "review": "Wonderful collection. If interested in Russian painting, don't miss the large collection of Repin works. As for landscapes, Shishkin is amazing. Also worth the visit is the building, in large part due to Carlo Rossi, the Italian architect."
        }, 
        {
            "index": 437, 
            "rating": "5", 
            "review": "Fabulous art. What a brilliant collection of paintings. And their Rembrandt's were magnificent. I always though that Rembrandt painted small pictures - not so, they have some very large canvases painted by him. Well worth a visit."
        }, 
        {
            "index": 438, 
            "rating": "4", 
            "review": "Worth a visit but not essential. Lost of other palaces in St Petersburg are as grand or ornate. Most interesting for us were Peter the Great's death mask and portrait on his death bed, as well as portraits of the rest of the royal family. You can see the resemblances, and his death mask makes you feel as if you are meeting Peter himself!"
        }, 
        {
            "index": 439, 
            "rating": "5", 
            "review": "So you don't think you'd be interested in Russian Art?. 4 hours was not enough time to savor all that is here...do not miss the Repin paintings! The early Russian works are equally interesting and the hall with the largest paintings we've ever seen is overwhelming...Do not miss the cases in the rooms under velvet covers to see exquisite paper works..."
        }, 
        {
            "index": 440, 
            "rating": "4", 
            "review": "Russian art by Russian artists. Small but excellent collection of Russian religious art, in addition to the usual portraits. These portraits are all by Russian artists however. A short walk from the Church of the Spilled Blood or Nevsky Prospekt. Good way to pass a few hours. You can take photos of the exhibits but cannot use the flash."
        }, 
        {
            "index": 441, 
            "rating": "5", 
            "review": "Art, Art, Art. Not to be missed. The only problem is that at the end of the visit you are so tired you don´t have energy enough to enjoy all the precious jewels you have seen. The best would be to go there more than once if possible."
        }, 
        {
            "index": 442, 
            "rating": "4", 
            "review": "Good but not as impressive as the Hermitage. After navigating through the Hermitage, one of the highlights here for me was the absence of tour groups and the relative peace and quiet. That said the art collection here is not as extensive or impressive.Entrance is 350 rbls and we spent 2 hours here enjoying the art. You could easily spend more.Our favourite section was in the Benois gallery, which had a great collection of modern 20th century art, housed in a beautifully light and airy space.I'd also highly recommend finding a map, to get the most out of this building. Upstairs is easy to navigate, however downstairs there are entire wings of the museum, either hidden round dark corners or down small staircases!"
        }, 
        {
            "index": 443, 
            "rating": "5", 
            "review": "Closed. Such a pitty, this museum was specially recommended to us, but when we found it after a long walk, it turned out to be closed on Tuesdays! Didn't have the time to go on another day. So, we'll have to visit St. Petersburg again;-)...."
        }, 
        {
            "index": 444, 
            "rating": "5", 
            "review": "My Favorite. Our favorite museum experience in SPB. The museum is a former palace and worth touring on its own. Combined w the incredible Russian art from all periods go history just can not be beat. For us, better than the Hermitage. Call us heathen!"
        }, 
        {
            "index": 445, 
            "rating": "5", 
            "review": "Blew me away. Extremely interesting museum, packed full of top notch russian art, which you had little idea about. Take your time and soak up the russian experience reflected in un-usual scenes and periods in time. Probably the next best sight to take in after the Hermitage."
        }, 
        {
            "index": 446, 
            "rating": "5", 
            "review": "give yourself a day!. What a treat - a feast of russian art. There is alot of it and have never heard of most of the artists - but really enjoyed every room. the Kandinsky's are on tour this year!"
        }, 
        {
            "index": 447, 
            "rating": "1", 
            "review": "A big disappointment. Dedicated the same amount of time to it as the Hermitage and was frankly disappointed. Not in the same league of cultural significance but also, didn't find it as pleasant to walk the halls. Have previously read reviews of extremely unfriendly service - all those were confirmed. So basically, all in all, didn't really enjoy being continually shouted at by the \"babushkas\" for seemingly not doing anything wrong."
        }, 
        {
            "index": 448, 
            "rating": "5", 
            "review": "Incredibly Interesting. Really enjoyed all the exhibits here, the folk art was amazing. Take a look out in the external wings as they are really worth a look - here you will find pottery, clothing, building materials, lace etc. We spent a fascinating afternoon here."
        }, 
        {
            "index": 449, 
            "rating": "5", 
            "review": "To discover Russia. This was one of my favorite museum as it was trully unique, containing Russian work of art, which I am not very familiar with, as well as beautiful folk craft. Truly eye opening on the rich heritage of Russian art and craft."
        }, 
        {
            "index": 450, 
            "rating": "5", 
            "review": "Remarkable. The museum's collection includes over 400,000 artworks covering the complete history of Russian art, from 11-th century icons to works by contemporary artists. For someone wanting to understand Russian culture and history, I would recommend a visit to the Russian Museum. It’s not crowded like the Hermitage, but has a plenty to offer."
        }, 
        {
            "index": 451, 
            "rating": "4", 
            "review": "Neatly organized. Excellent collections, I loved the portraits and other depictions of Russian monarchs. The buildings itself are very interesting and beautiful, even though not as distracting as richly decorated Hermitage. Even though I would heartilly recommend even here to look both to the ground and ceiling."
        }, 
        {
            "index": 452, 
            "rating": "4", 
            "review": "Enjoyable, Interesting. We went with a toddler in a baby carrier, who drew our attention to the ceilings of the main building of the museum (I believe there are 5 buildings). Some truly fun and interesting ceiling designs on the top floor. We enjoyed the primer on Russian art."
        }, 
        {
            "index": 453, 
            "rating": "5", 
            "review": "Beautiful collection and special exhibit. We enjoyed this collection very much, especially the special exhibit in one of the wings. All russian art, but the exhibit comprised artists from the late 1800's to the present. The paintings were beautiful, and I have a new appreciation for Russian artists."
        }, 
        {
            "index": 454, 
            "rating": "4", 
            "review": "Enjoy the history and culture of Russian through visual art and craft. One of my greatest pleasures when travelling is visiting the local museums. While it is sometimes expedient to have a guide point out some of the highlights of a particular venue, I generally find it more satisfying to follow my interests and wander at my own pace. My problem with many of the museums/galleries we visited while in Russia was the lack of signage in English [or any other language, for that matter.] So I was happy to read that the Russian Museum in St. Petersburg provided a printed guide and wall signs in English. And what a wonderful collection of Russian art is displayed within the walls of the Mikhaylovsky Palace! The building alone is worth a visit with its grand staircases and statuary. The collection is well organized in chronological order with the earliest items dating back to the 12th century and ending with a large section devoted to folk art. This was the highlight of the museum for me – colourful toys of wood and porcelain, regional clothing, table ware, and of course, the originals of the lacquered spoons that so many people buy as souvenirs. It was a perfect way to spend a rainy afternoon -- learning more about the history and culture of Russia and surprise – when we left the museum, the sun was shining and we took another walk along the canals."
        }, 
        {
            "index": 455, 
            "rating": "3", 
            "review": "Not as interesting as the rest. Went there for 3 hours that I can't really recall very well now that I've left - yes, there's some good stuff here but I was more impressed by other St Pete landmarks"
        }, 
        {
            "index": 456, 
            "rating": "5", 
            "review": "Amazing collection of folk art. I loved the folk art displays - lots of lace, woodworking, fabric design. Look out for the mice burying the cat - a wooden toy."
        }, 
        {
            "index": 457, 
            "rating": "5", 
            "review": "Surprise dinner!. The guided tour was very educational, and the dinner accompanied by a string quartet was incredible!"
        }, 
        {
            "index": 458, 
            "rating": "5", 
            "review": "Beauty. The first four rooms with icons and old russian art are pure beauty. If you're medieval geek do not hesitate to visit this place. There's of course a lot of other great things to see. For me it was for example Ivan Shishkin's landscapes or Repin's masterpieces"
        }, 
        {
            "index": 459, 
            "rating": "5", 
            "review": "Russian Museum St. Petersburg.. We went on a Sunday morning before the crowds. On a Sunday it gets very busy with families and school groups ( in winter at least). I am not overly keen on Modern Russian art but the old exhibits were very good as were some of the old icons, well worth the visit. allow several hours."
        }, 
        {
            "index": 460, 
            "rating": "4", 
            "review": "Do not miss it. I was not familiar with Russian artists so this was a first experience. I was truly impressive; the collection was comprehensive and representative of Russian art through the ages. I was so glad that I did not miss it."
        }, 
        {
            "index": 461, 
            "rating": "4", 
            "review": "Well presented and lots to see. This museum only shows Russian art and artefacts, rather than the Hermitage, which is world-wide exhibits. However, it was a fascinating study of the Russian heritage and past."
        }, 
        {
            "index": 462, 
            "rating": "5", 
            "review": "Unexpected. I never new much about Russian paintings until I visited this one. The collection is marvelous!!! I know that this tour is not considered to be the most popular - but after visiting this museum I simply can not understand why. My guide added a lot to this experience explaining about the paintings and the artists and the Russian History behind some of the paintings. I was not sure about taking this tour at first and I am so happy I finally decided to go!!!"
        }, 
        {
            "index": 463, 
            "rating": "5", 
            "review": "better than the Hermitage!. This is a great place to see Russian art from a variety of eras. (Socialist Realism, Russian Masters, etc). For me, it was more interesting that the Hermitage!"
        }, 
        {
            "index": 464, 
            "rating": "5", 
            "review": "A must see. You should definitely visit this place during your stay in the city! There you can find many masterpieces from Russian visual art, audio guides in many different languages are available."
        }, 
        {
            "index": 465, 
            "rating": "5", 
            "review": "Do not miss this museum. Wonderful collection of Russian art which allows you to understand so much about Russia and the aesthetic that shapes the people. Do not miss the Benois wing."
        }, 
        {
            "index": 466, 
            "rating": "3", 
            "review": "Not quite like the Hermitage. Doesn't have the same iconic appeal and I found the place a little bit harder to navigate around in terms of finding some specific pieces that I was looking for. Staff spoke only very basic English and I ran into a problem at the cloakroom which thankfully was rectified after a lot of stress"
        }, 
        {
            "index": 467, 
            "rating": "5", 
            "review": "Amazing Collection. I like to visit this museum every time I am in St Petersburg. It is very comprehensive, including fine and applied arts, and they have also got a marvelous collection of contemporary Russian art. Their temporary exhibitions are usually excellent. The paintings by Repin are a must as well as their icon paintings. I particularly like the folk art, too, and their works from the revolutionary period. There are kiosks scattered throughout the museum which sell some very good material, some in English."
        }, 
        {
            "index": 468, 
            "rating": "5", 
            "review": "Guided tour a must for real experience. I highly recommend to buy a guided tour to get the max info and enjoyment out of the visit. It is a very large collection with lots of history and interesting facts attached which your tour guide will share with you. Very well worth the money spent on guided tour."
        }, 
        {
            "index": 469, 
            "rating": "4", 
            "review": "Interesting museum. Interesting museum and is not as crowded as The Hermitage Museum. Information is also provided in English"
        }, 
        {
            "index": 470, 
            "rating": "5", 
            "review": "Better than Hermittage. It was very interesting to visit this museum. A lot of paintings and very nice exhibitions. It is definitely Worth spending a few times in that museum! Enjoy"
        }, 
        {
            "index": 471, 
            "rating": "4", 
            "review": "Into to Russian art. Scored free tickets otherwise I wouldn't have bothered to visit yet another museum but it was a great introduction to Russian art. The palace it's hoped in is worth seeing as well."
        }, 
        {
            "index": 472, 
            "rating": "5", 
            "review": "The real gem of the city!. My favourite museum in St.Petersburg.\nIts collection of the Russian icons is unique in the world. Very educative and heartrending.\nVrubel and Aivasovskiy masterpieces are unforgettable and very impressive.\nThe Russian painting of the early 20 century sometimes reaches the height of the European mpressionism, post-impressionism and analitycal abstractionism. (See Petrov-Vodkin, Filonov, Golovin)\nEntrance fee -200rub. It's a MUST!"
        }, 
        {
            "index": 473, 
            "rating": "5", 
            "review": "The Best of Russian Fine Arts. The Main Building, the splendid Mikhailovsky Palace houses the world's largest collection of russian art from icons to 20th century paintings. The museum is well organised and well kept. Extremely interesting."
        }, 
        {
            "index": 474, 
            "rating": "4", 
            "review": "Wonder Russian works of art. Buy the combine ticket to get into 3 other venues which are all within walking distance and wonderful building and art works. Go early to avoid the tour groups."
        }, 
        {
            "index": 475, 
            "rating": "2", 
            "review": "Poor service in the central museum of St. Petersburg. We visited the museum with my wife this weekend and almost regretted. The place is marked \"Tripadvisor suggested\". Well, I propose foreigners to visit Ethnographic museum situated 1 minute walk nearby. It was disagreeably even for me as a citizen to confront this soviet-type service:- long awkward labyrinth from the cash office to the cloakroom: ending which you are already tired :)- boorishness of the cloakroom staff: you can not carry big luggage and backpacks with you so you are asked to leave it in cloakroom, nevertheless the staff says they take only not valuable things; I received \"This is your problem\" when I politely explained how inconvenient it is to visit museum with my notebook and camera with me; cashier was talking on the phone all time- poor signing within the halls, disturbing window lights when examining the exhibits, rude staff (not all but in general)The exhibits were interesting. I also liked the idea with QR codes which shows you info on the work. Regretfully it only works with local soft which is aweful.Nevertheless management shows a lack of interest to its clients. Frankly speaking you go to museum to see something interesting and receive a service. This place provides none and you go mad in the beginning. I propose RM management to carefully inspect all elements of the modern museum service and implement it quickly - it is a shame to propose such service nowadays."
        }, 
        {
            "index": 476, 
            "rating": "5", 
            "review": "The place to see Russian Art. This museum houses a wonderful collection of Russian art and artifacts. The Marble Palace is also under this heading, but be careful about opening and closing times. We went according to the brochure we obtained at the headquarters of the Russian Museum itself, only to be told that the Marble Palace was not open when we arrived."
        }, 
        {
            "index": 477, 
            "rating": "5", 
            "review": "A must in St.Pete. This museum needs 2 days to really see how fantastic collection it is.You can also do photography there.They also have good restaurant and there are less crowds than in Hermitage.you can also get a better understanding of Russia.I can direct you to pleasant Russian guide who made our visit well worth it.The Russian visa is expensive and nightmare.Latest \"agreement \" benefits the Russian site but not US.ffiber41@gmail.com"
        }, 
        {
            "index": 478, 
            "rating": "4", 
            "review": "Russian Folk Art. We went there just for the folk art, and were not disappointed. A good display of woven, embroidered and wooden art forms were quite well displayed. Close to the Spilled Blood Church, and in easy walking distance to Nevsky Prospekt."
        }, 
        {
            "index": 479, 
            "rating": "5", 
            "review": "My favorite museum in St Petersburg!. Although it is smaller and less opulent than the Hermitage this is a truly Russian museum unlike the Hermitage. I loved the focus on Russian art and history and there are some truly special paintings and icons in this museum. We even watched a movie clip of the palace guards firing on the demonstrators on Bloody Sunday in the Palace Square! It was truly jaw dropping. Don’t miss this little gem! Plus it has a fabulous cafe with great ambiance and food (much better than the Hermitage cafe!) Spend several hours here."
        }, 
        {
            "index": 480, 
            "rating": "5", 
            "review": "Fabulous!. I'm not a big fan of art museums, but the State Russian Museum was fantastic. I went twice; once by myself and back again with my wife. Toured for over four hours each visit. Audio guide is very good. Don't get mesmerized by the amazing art and forget to look at the Rossi designed Mikhaylovskiy palace. A toss up with the Hermitage for me. Look for the guy texting in Repin's \"Barge-Haulers on the Volga\"."
        }, 
        {
            "index": 481, 
            "rating": "5", 
            "review": "Don't Miss this one. The Hermitage is the culture draw, but the Russian Museum exposes the depth and breadth of Russian culture. I always visit here and the Marble Palace first, then the Hermitage."
        }, 
        {
            "index": 482, 
            "rating": "4", 
            "review": "A Hidden Gem. I had never heard of this museum before I visited St Petersburg as it is somewhat dwarfed by it's famous counterpart the Hermitage. The museum is located close to the Church of the Spilled Blood, there are also some nice cafe's close where you can have a good lunch. You can easily vist both and have a spot of lunch all in a day.As the museum is not so well known it is not that busy and much more easier to gain entry than the Hermitage. We turned up at 11am and got in within 2 minutes!Once inside you are rewarded with a museum that focuses solely on Russian art over the centuries including more recent modern art.We highly recommend this museum."
        }, 
        {
            "index": 483, 
            "rating": "5", 
            "review": "Lots to see. This is a vast museum. I really liked the art being displayed in a chronological order. That made It easy to see how art styles developed in Russia. How most of the art was amassed is a rather sad story."
        }, 
        {
            "index": 484, 
            "rating": "4", 
            "review": "Another stunning building. Different to the Hermitage less grand but still very interesting displays of ethnic crafts alongside the huge historical paintings."
        }, 
        {
            "index": 485, 
            "rating": "5", 
            "review": "Good contrast to the Hermitage. The Hermitage is brilliant but not very Russian. This in contrast is just Russian art so arguably tells you more about the country than the Hermitage. The audio guide adds to the enjoyment enormously."
        }, 
        {
            "index": 486, 
            "rating": "5", 
            "review": "The most important museum to see in the city for art lovers. The museum is nicely located in the surrounding of the other monuments. My advice is to go to the museum from the very first hour since it is opened. The old building still has problems with ventilation and after the night the air is better inside. You need any way to spend there at least two hours just to walk around the museum. You will be tired, especially if you will pay attention to the art and spend there 3-4 hours. The park behind the museum is connected to the Summer Park - another attraction. It is rather good, especially after recent restorations. It may be very nice to walk through these parks after the museum. Unfortunately it is the advise only to summer time visitors - winter time in SPb the light day is very short."
        }, 
        {
            "index": 487, 
            "rating": "5", 
            "review": "Russian Museum. There is a wonderful show right now -unknown artist who painted portraits of the Tsarist families. the who museum is so historical. Here, as in most places directions for how to get about are vague."
        }, 
        {
            "index": 488, 
            "rating": "5", 
            "review": "Don't miss this. This museum houses Russian artists from about the 15th century to the end of the 20th/beginning of the 21st. Other than Chagall and Kandinsky, these are artists we do not see in the West."
        }, 
        {
            "index": 489, 
            "rating": "5", 
            "review": "Pre Plan. As its been calulated that it would take you 17 years to view all the exhibits, its perhaps best if you identified the rooms where your particular interests lie before the visit . Independent guides appear to have more flexibility in this regard."
        }, 
        {
            "index": 490, 
            "rating": "5", 
            "review": "Unique opportunity. Wonderful collection from all periods . The big canvases are breathtaking . A good way to learn about Russian history and art . Lovely settings and arrangement"
        }, 
        {
            "index": 491, 
            "rating": "5", 
            "review": "Wonderful experience, great Russian art unknown to us in the west. Easy museum entry unlike the Hermitage. Never a line at the door. Fabulous collection of Russian Art not seen in the west. About 10 pieces by Malevich and 3 pieces by Kandinsky. Plus a great collection of other Russian modernists. Collection ranges from 20th century back to the 15th century. Also a lot of early furniture. You must have cash to purchase in the museum bookstores. I visited this museum 4 times in a week. Postcards of artwork very inexpensive (50 cents per card). This mueum is next door to the Sacred Blood Russian Orthodox church."
        }, 
        {
            "index": 492, 
            "rating": "5", 
            "review": "Great!. Another vast palace filled with art. I was most interested in the historic paintings and the modern art. One paining of people hauling a boat on the Volga river was very powerful, evoking the hard work of the poor people."
        }, 
        {
            "index": 493, 
            "rating": "5", 
            "review": "Russki Muzei. Venetsianov, Brulov, Repin, Surikov, Serov, Levitan, Malevitch, Rerikh... you name it. Russian art is worth another day, spent in museum. Constant rain outside makes this option even more reasonable."
        }, 
        {
            "index": 494, 
            "rating": "5", 
            "review": "Russian Treasures. The highlights of Russian treasures are well presented in the displays here. Missed the special collection of jewels but it's worth visiting to get a view of history and grandeur."
        }, 
        {
            "index": 495, 
            "rating": "5", 
            "review": "Deservs a visit. Nice museum, good art collections (if you want to see Russian painters). I'd certainly recommend. Plus, it's located in a beautiful spot of the city."
        }, 
        {
            "index": 496, 
            "rating": "5", 
            "review": "Fabulous Russian art. Less crowded than the Hermitage. Some very nice Russian paintings by Shishkin, Repin and Aivazovsky. Good museum shops."
        }, 
        {
            "index": 497, 
            "rating": "5", 
            "review": "A nice surprise!. Beautiful Russian art. It is well displayed. Audioguides are good although you may not need them. Just enjoy the paintings! Wonderful art from the 20th century is displayed at the end. Do not miss it!"
        }, 
        {
            "index": 498, 
            "rating": "5", 
            "review": "Great collection of Russian art. A number of famous original paintings are located in this museum, definitely second museum to visit in St Petersburg after Hermitage. To see main pieces of art allocate couple of hours, a building itself is quite beautiful as most palaces of that era."
        }, 
        {
            "index": 499, 
            "rating": "5", 
            "review": "Great Collections of art. On the day when we arrived, we could pay double the price of one ticket and see 4 museums. The museums were the Marble Palace, Stroganoff Palace, Mikailovsky Palace and the Russian Museum. We only saw the latter three.Stroganoff Palace's interior was awesome. No photos allowed.One must always check in the coats when they arrive. Each of the entrances is guarded.Not many of the people in the museum speak English, so don't expect to be understood. I made the mistake of saying good day in Russian, and the woman thought I spoke russian and she spoke no English, so that was a bit difficult.All of the museums that we visited were worth the price of admission."
        }, 
        {
            "index": 500, 
            "rating": "4", 
            "review": "Very interesting. This museum is in a huge building but entered by a small side door which then leads you through low tunnel like corridors in a maze until you find yourself at the ticket office. then you have to retrace your steps back through these \"tunnels\" and finally after several old ladies (the guides sitting at every corner) have pointed you in the right direction, you go up to the museum. After the Hermitage it is an altogether more ccessible museum and well worth visiting for some fabulous art and statues."
        }, 
        {
            "index": 501, 
            "rating": "3", 
            "review": "Development of Russian art. We expected great art, but found it a historical presentation of the development of Russian art. Art arranged chronilogically."
        }, 
        {
            "index": 502, 
            "rating": "4", 
            "review": "worth your time. this museum is not on the usual tours, but with a good guide you will be treated to Russian art starting with special icons"
        }, 
        {
            "index": 503, 
            "rating": "5", 
            "review": "best russian painters. Really good collection of best Russian painters, starting from Rublov and a lot of others, Shishkin, Aivazovski, nearly all famouse paintings are ther"
        }, 
        {
            "index": 504, 
            "rating": "5", 
            "review": "Baltic Cruise July 2012. Just back for a memorable Baltic cruise. We went on the Royal Carribean Jewel fo the Seas. We sailed from Harwich and this was brilliant no luggage restrictions and dragging cases round. We went to Denmark, Finland, Sweden Tallin and Russia. We have never been on a cruise before and were not sure we would enjoy it. We are both in our early 50s and had always considered cruise for retired people, we were so wrong. The ship was a fantastic experience and the itinery was amazing waking up each day in a new place. We cannot fault the ship on cleaniness and excellent service. Also if you don't like dressing for dinner you don't have to there are casual dinning rooms that serve excellent food with lots of choice and you can eat any time the only draw back is the cost of drinks at the bar and 15% service charge. The sunsets are amazing and very romantic, we have some great photographs and wonderful memories. I would recommend a cruise for any age and you will not be dissapointed. Its like staying in a 5* hotel that takes you to so many different countries, you even forget your on a ship until you go on deck. You meet lots of people from all over the world and there is always a quiet place to sit and read your book if you have never tried a cruise I recommend you do."
        }, 
        {
            "index": 505, 
            "rating": "5", 
            "review": "a great surprise. This is the best museum in town and one of the best I've ever seen.It gives the oportunity to discover great russian painters, almost unknown to the most people of west Europe.The museum is small, but a very beautiful jewel.And the Mikhailkovsky gardens in front of the museum are so romantic and beautiful."
        }, 
        {
            "index": 506, 
            "rating": "5", 
            "review": "NOT TO BE MISSED. The top museum of Art in St Pertsburg! If you have time for only one museum leave out Hermitage and come here!! The Russian school of Paintings is something unbeliavable.!! Less known to the west because of the long Soviet period but here you come face to face with the great names such as :Repin , Kuindji, Aivasovsky, Vrubel etc"
        }, 
        {
            "index": 507, 
            "rating": "5", 
            "review": "Russian Museum was wonderful!. Following the advice of all of my guidebooks, I went to see the Russian art collection in the Russian Museum and it was WONDERFUL! The collection was wide-ranging -- including Russian Orthodox Church icons, portraits and furnishings of Russian monarchy, 18th and 19th century Russian art, porcelain and majolica, lace and other fabrics, lacquer boxes, even historical Russian housing architecture and more. Because I went in the afternoon and was tired when I entered, I only did the Michaelovsky Castle, which is huge. I did splurge on the English audiotape guide which was worth the extra $350.00 rubles since there was very little text --Russian or English -- accompanying the exhibits. Because I was tired, I told myself I'd only stay an hour or so, and didn't expect to get my money's worth for the $350.00 rubles admission. But the exhibits kept changing and were so varied and reflected things I'd actually seen in the country (e.g., lacquer boxes) that I just kept walking --for 3-4 hours. That's what a great museum should do -- grab your attention and hold on for dear life. The Russian Museum was GREAT!"
        }, 
        {
            "index": 508, 
            "rating": "5", 
            "review": "Worth a visit to see excellent Russian Art. A good collection of Russian Art covering many periods. Your chance to see what was and is going on. The audio-guide is very good and helps to make sure you really enjoy the visit."
        }, 
        {
            "index": 509, 
            "rating": "5", 
            "review": "I loved this museum. The day I went the museum was quiet. It has a very intimate feel with stunning art. I liked the variety of art they showed as well as the building. I also earned about several Russian artists I had never seen. I thoroughly enjoyed my visit here and highly recommend it."
        }, 
        {
            "index": 510, 
            "rating": "5", 
            "review": "Worth a visit. All the Russian classics are here, if you have time, a definite must-see. Now the Marble Palace is also part of the Russian Museum"
        }, 
        {
            "index": 511, 
            "rating": "5", 
            "review": "Trip into the ART OF PAINTINGS. My last time I visited this palace of Art in 1984. This is amazing place, collections, etc...\nThe pleasure begins with the first thought that you are going to visit this Museum.\nBest of the best - Polenov Hall, Repin. I can spend hours and hours ...."
        }, 
        {
            "index": 512, 
            "rating": "5", 
            "review": "Very good and well organized place. Big, interesting and beautiful works. Simple and well organized. Hermitage should learn from them! Staff was friendly and helpfull, what a delight to be able to get the answers to our questions without being told off every time! We really enjoyed this museum."
        }, 
        {
            "index": 513, 
            "rating": "3", 
            "review": "Felt this was unnecessary after the Hermitage. From the perspective of the casual art goer, the State museum was not at all a highlight of St. Petersburg. I was expecting something almost as exceptional as the Hermitage after seeing the raves here, but think you must be a bit more in the know about Russian art than we are to really love this. At $10 each, I think you can skip it if you only have a couple days in the city and are not particularly into Russian art. You will be delighted at the Hermitage even if you know nothing about art, would suggest you spend a few extra hours there instead of going here."
        }, 
        {
            "index": 514, 
            "rating": "5", 
            "review": "A Must to See.. If you feel that the Hermitage is a wondrous display then you must see the Russian artists in this Museum. The exhibitions are tastefully and movingly displayed and moved me to tears.Allow time to explore the Museum - you will not be disappointed and the staff are very friendly."
        }, 
        {
            "index": 515, 
            "rating": "5", 
            "review": "A wealth of wonderful art. Very interesting indeed, so much to see and enjoy, however the same thing applies about lining up outside for ages whilst groups took priority. This I believe should be taken care of!"
        }, 
        {
            "index": 516, 
            "rating": "4", 
            "review": "Informative Displays, though not all had English translations. Lots to see, in depth look at the different cultures that make up Russia. Features many costumes, daily life artifacts, crafts, etc."
        }, 
        {
            "index": 517, 
            "rating": "5", 
            "review": "Russian applied arts must be seen. The best russian applied arts collection collected in this museum - we had 3 full hours of diving in the past of Russian culture."
        }, 
        {
            "index": 518, 
            "rating": "5", 
            "review": "Must see. If you want to get to know Russia better do not miss State Russian Museum! You can find the painting by famous Russian artist as Repin, Levitan, Bryullov, Aivazovsky, Shishkin, Polenov ext. It is grate museum with a special atmosphere and Russian soul."
        }, 
        {
            "index": 519, 
            "rating": "5", 
            "review": "Small and easy to navigate. Holds works worth seeing. Only takes an hour to see the entire museum. In a very touristy area, beware of large buses!"
        }, 
        {
            "index": 520, 
            "rating": "5", 
            "review": "Wow!!!!. Faberges,jewels and artifacts galore to help you understand the culture of a people. Not to be missed."
        }, 
        {
            "index": 521, 
            "rating": "5", 
            "review": "Russian Art at its best. Learn more about Russias Christian heritage at this beautiful museum."
        }, 
        {
            "index": 522, 
            "rating": "4", 
            "review": "All Russian works of art but some Surprises!. I really wasn't interested in most of the portraits, sculpture of Russian historical figures and landscapes. Some interesting historical scenes.My surprise was that the architectural elements of the rooms were exquisite, one - the empire room - was full of original empire furniture and just incredible. The other was the three very large Victorian era paintings of incredible beauty by Russian artist and I hope I can attach two to my review, the file may be to large."
        }, 
        {
            "index": 523, 
            "rating": "5", 
            "review": "fabulous. Need to spend more time here, one needs 3 hours at least, the gardens in front are neatly laid out.The courtyard and gardens in front give glimpses of the spires and coloured domes of the Church of the Spilled Blood in the background."
        }, 
        {
            "index": 524, 
            "rating": "4", 
            "review": "it is quite nice. they have quite a collection, and watching the people that work there, dozing off is quite good fun - picture retired age people, they are well tired and bored... lots of items to see..takes about 3 hours to go through."
        }, 
        {
            "index": 525, 
            "rating": "5", 
            "review": "State Russian Museum. This is an absolute MUST SEE! Overwhelmed by those majestic paintings! Please buy the book!"
        }, 
        {
            "index": 526, 
            "rating": "5", 
            "review": "Fantastic Museaum better Art than the Hermitage. this was probably the highlight of the trip, a museum that isn't crowded and has some excellent pieces in. it is near the church of the spilled blood so do both the buildings together. The cafe is ok but not great, forget the coffee and buy water"
        }, 
        {
            "index": 527, 
            "rating": "4", 
            "review": "Must visit for Russian art lovers!. This is a must visit place for Russian art lovers. One will find mostly paintings of popular Russian artists here including impressionist painters like Konstantin Korovin, Vasily Polenov and others. For us, 3 hours is enough for this museum."
        }, 
        {
            "index": 528, 
            "rating": "5", 
            "review": "Better than Hermitage for Russian Art. If you want to see real Russian art go to the State Russian Museum and skip the Hermitage. We saw both and all four of us preferred the State Russian Museum for the Russian icon art and 19th - 20th cent Russian artist and Russian content art. We wanted to see Russian art while in Russia and it was excellent. We have been to other great European art museums and the content in the Russian Museum was unique vs the Hermitage which was same \"European master art\" as in other museums. This was an add on to a busy schedule and we had app 1 hr with our guide. We were in St Petersburg via a cruise ship for 2 days touring with Denrus in a 4 person group."
        }, 
        {
            "index": 529, 
            "rating": "5", 
            "review": "Russian Museum. Fine collection particularly of 19th century Russian art. Some ENORMOUS paintings"
        }, 
        {
            "index": 530, 
            "rating": "5", 
            "review": "Russian art. We found a great display of Russian Art here. We did not allow enough time as it is far bigger than we thought."
        }, 
        {
            "index": 531, 
            "rating": "5", 
            "review": "Blown away by the quality of art here!. I learned so much about Russia here. And some of the canvasses, like Ivan Aivazovsky's \"The Wave,\" literally feel like you are swept away along with the ship-- it is so huge! Starts with Byzantine beginnings and ends with modern. A must-see in St. Petersburg!"
        }, 
        {
            "index": 532, 
            "rating": "5", 
            "review": "State Russian Museum, St Petersburg former Petrograd, Leningrad. As everyone know is this the finest museum in the town if you are interested in russian paintings from the time before the revolution and after.Why visit The Eremitage where you are among thousends of other visitors daily ? A few travelers understand to choose Russian Museum instead of the Eremitage I belive ? I use to travel to russia every year and every time I go there because of the reason I explained."
        }, 
        {
            "index": 533, 
            "rating": "5", 
            "review": "One of the best Arts museum in the world. This museum has a superb collection of many Russians genius artists from the 18th - 20th centures. Among the artists Aivazovsky, Kuindghi, Surikov, Repin, Levitan, Brullov. The Russian Museum today is a unique depository of artistic treasures."
        }, 
        {
            "index": 534, 
            "rating": "5", 
            "review": "My favorite museum in St. Petersburg. I go to the State Russian Museum because it is all about Russian art, every era from early icons to the constructivst era to contemporary art. It is laid out by period, and there is new explanatory material for a number of the exhibits. Also check out the rooms devoted to traditional crafts."
        }, 
        {
            "index": 535, 
            "rating": "5", 
            "review": "art gallery. The museum is the Mikhailovsky Palace, the main exposure and has several branches in St. Petersburg. The museum features Russian artists such as Rublev, Shubin, Levitsky, Repin, Vrubel, Malevich, Kandinsky, Chagall and others."
        }, 
        {
            "index": 536, 
            "rating": "5", 
            "review": "Fantastic Museam of Strickly Russian Art. After the Hermitage which is international in nature, this museam must not be missed. Fine examples of very exquisite paintings of the russian masters. Tastful interior and great value. give yourself at least 4 yrs for a superficial visit a full day if you really want to take in the views. Extra to be able to take photos without flash. Try that in a western museum!"
        }, 
        {
            "index": 537, 
            "rating": "5", 
            "review": "A must visit for Russian history, art, culture!!. You will never experience this culture elsewhere. A must visit in StP!"
        }, 
        {
            "index": 538, 
            "rating": "4", 
            "review": "A little of modern Russia. Art from after the Rev. For the most part. Does have a few rooms of older items but the interesting work is the more current work. Don't give up on he maze of rooms press on!"
        }, 
        {
            "index": 539, 
            "rating": "5", 
            "review": "Wonderful. Russian art arranged in chronological order. Really easy to see development through 19th 20th century particularly."
        }, 
        {
            "index": 540, 
            "rating": "4", 
            "review": "Interesting. It doesn't compare to The Hermitage but it does show art by Russian artists. We even saw some work done under the communist regime. Again, the architecture is a must see."
        }, 
        {
            "index": 541, 
            "rating": "5", 
            "review": "The best museum in St. Petersburg. It is the best museum in the Northern Capital of Russia. The paintings of famous artists attract visitors from all countries of the world."
        }, 
        {
            "index": 542, 
            "rating": "5", 
            "review": "One of the great art galleries of the world. This is made up of 5 separate and spread apart buildings each with their own focus so it was confusing to arrive at the one we wanted. We wanted the Modern Russian Art one and it is both amazing and fascinating and big. Some stuff not as fully represented as I would have liked though - Socialist Realism and the Structuralists for example and there is very little indication of the output of young contemporaries - such of the moment stuff that there was was in a special show and was very laboured, pretty-pretty and sentimental. But nowhere is perfect and there is so much and so varied great and sometimes famous stuff (painting, a little sculpture and a tiny bit of video) to see and it is all well laid out and well lit and there are nice art history type wall texts in Russian and English to introduce each section. There was a big contemporary photo show at one of the other buildings, but we did not have the time to get to it."
        }, 
        {
            "index": 543, 
            "rating": "5", 
            "review": "superb. wonderful Pete - one of those places you HAVE TO go visit"
        }, 
        {
            "index": 544, 
            "rating": "5", 
            "review": "Amazing art. I am proud to say I had a pleasure of seeing this amazing Russian art which I know and have learned so little because it's not so represented in Europe. Truly a must see if you want to close in to the Russian tradition and art. For using a camera you need to pay extra. Take your time and see this attraction, you won't regret it. And when you see Kazimir's Black Square you will laugh in yourself how much it is simple, but brilliant and original. Just don't laugh loudly, you will get some strange looks :)"
        }, 
        {
            "index": 545, 
            "rating": "3", 
            "review": "Small & Manageable but boring without a guide or audio help. Credit card connection not working so we paid cash. Required to check coats and backpacks - and pay extra to use camera. It's a maze to find the same point at which you checked in. Art has no language barriers - Russian art to me is indistinguishable from other countries. I'm illiterate in art appreciation."
        }, 
        {
            "index": 546, 
            "rating": "4", 
            "review": "A Good Permanent Exhibit. The chronologically placed permanent collection of 20th Century Russian art allowed me to better understand its development. There are ever-changing temporary exhibits as well. A suggestion: use the entrance by the canal rather than the main entrance, if you wish to see the works of the 19th and 20th centuries. Otherwise it is a very long walk from the building with the earlier works."
        }, 
        {
            "index": 547, 
            "rating": "5", 
            "review": "Manageable & Lovely. Russian art is beautiful & largely unknown in the west. Be prepared for some wonderful surprises. The Accoustiguide is recommended as the explanations are excellent."
        }, 
        {
            "index": 548, 
            "rating": "5", 
            "review": "One of a kind collection of Russian art. Was here in July 2010 during the freat heatwave in Russia. Had a private guide, Olga. This museum is my fav in Petersburg, more than the Hermitage. It is much smaller (but not small!). And its artworks highlight Russian artists exclusively, most unknown to the West. Had my notebook with me, and learned so much about these artists and their paintings. Serov, Filonov, Schedrin, Venetsianov, Repin, and others. I would rank this museum on par with the Orsay in Paris, for its sheer sublimity in displaying exclusively Russian art. Highly recommended, and yet, off the radar for most tourists."
        }, 
        {
            "index": 549, 
            "rating": "5", 
            "review": "Excellent. St. Petersburg it is not all about the Hermitage. It is little known that the Hermitage houses almost no significant Russian artworks, therefore if you want to see Russian artworks you have to go to the Russian Museum.The Museum dominates the beautiful Arts Square, also home to the Mikhailovsky Theatre, the Great Philarmonic Hall and the venerable Hotel Europe.The collections are impressive, and you can get lost in visiting them. I found the collection of Soviet Art especially interesting and challenging. But there is much more. Fellow travelers, make sure not to miss this fantastic Museum!"
        }, 
        {
            "index": 550, 
            "rating": "5", 
            "review": "A true gem of Russian Culture. The Hermitage normally attracts all the attention since it's a world-renowned museum, so The Russian Museum gets side-tracked, which is a pity. I think it's always good to get a flavour of the authentic culture of the country one travels to. A comprehensive collection of Russian art is housed in sumptuous yet elegant palace. Genuine Russian Icons, masterful landscapes and a range of paintings on classical plots by the russian artists are true gems. The exhibitions give fantastic insights into the country's rich cultural heritage to say nothing about art lover's pleasure."
        }, 
        {
            "index": 551, 
            "rating": "5", 
            "review": "Art you don't see outside Russia. Fascinating to see beautiful works of art that you won't see elsewhere."
        }, 
        {
            "index": 552, 
            "rating": "3", 
            "review": "State Russian Museum. Lovely grounds, but almost swamped by the grandeur of The Hermitage."
        }, 
        {
            "index": 553, 
            "rating": "5", 
            "review": "The history of russian art. Russia is worldwide known for its artists, and here you can see a lot of them under one roof. Don't forget to visit The Benois Wing."
        }, 
        {
            "index": 554, 
            "rating": "5", 
            "review": "certainly a must. perhaps a half day might be enough for everyone. Not too interested by the Russian folk art. Beware the place is bigger than you think. THe Malevitch and co are worth the trip of course"
        }, 
        {
            "index": 555, 
            "rating": "5", 
            "review": "A glimpse into the Russian psyche. This museum is all about being Russian and some of the older art work is quite touching and evocative."
        }, 
        {
            "index": 556, 
            "rating": "5", 
            "review": "Visit it. Here you will see items related to Russian artists and great paintings and icons, do not miss a visit"
        }, 
        {
            "index": 557, 
            "rating": "4", 
            "review": "A gallery well worth visiting. Not as large as the Hermitage but still enormous. Definitely the place to see Russian art. We tried to see bits of it in less than an hour but it was too big for that. You need at least a couple of hours to do it any justice."
        }, 
        {
            "index": 558, 
            "rating": "4", 
            "review": "Interesting art. Interesting art but I preferred the Hermitage and visiting the Churches"
        }, 
        {
            "index": 559, 
            "rating": "5", 
            "review": "Great place to experience Russian culture. The Russian Museum today is one of the major cultural and educational centers in Russia, and a research and instructional centre of art museums of the Russian Federation, overseeing activities of 260 art museums in Russia.Currently there are several exhibition that will last till mid February. The first one ‘From Moscow to the country’s outskirts’ . The exhibition is devoted to the Russian art of the 18th - beginning of the 21 centuries where the significant and versatile theme of outskirt received the various interpretation. The exposition includes about 100 paintings, graphic works, sculptures and applied art works from the collection of the Russian Museum. Another one is devoted to famous Russian painters ‘Collections of Mikhail and Sergei Botkin’. The exhibition consists of two independent parts that sufficiently fully present the gatherings of Mikhail Botkin (1839-1914) and Sergey Botkin (1859-1910) who were the greatest collectors of art works in Russia in the second half of the 19th - beginning of the 20th century."
        }, 
        {
            "index": 560, 
            "rating": "5", 
            "review": "do not miss it. The museum is beautiful on the outside and inside. There are some of the most famous paintings by Russian artists in it."
        }, 
        {
            "index": 561, 
            "rating": "5", 
            "review": "Wonderful Art in a Beautiful Building. I wandered into this museum because it was in the guide book not intending to stay all that long. I ended up staying two hours, there's an enormous collection of art from various periods all very well laid out in a beautiful palace. Definitely worth a visit."
        }, 
        {
            "index": 562, 
            "rating": "4", 
            "review": "Must see. A real surprise. I was advised to go by a Russian colleague and have visited the museum 3 times since that time. Please go and visit the Russian museum and see the paintings of Ilya Repin. What a great artist!"
        }, 
        {
            "index": 563, 
            "rating": "4", 
            "review": "Confusing but enjoyable. A rather eclectic assemblage of exhibits, arranged with absolute daubs set alongside fine works. Also a most confusing set of buildings and linking stairs. Could have been disappointing but the certainty and optimism of so many Russian works made it an uplifting experience."
        }, 
        {
            "index": 564, 
            "rating": "5", 
            "review": "Now that's what i call a museum!. I've been to maby museums in many countries, Paris, Vienna, Madrid and New york amongst them but this is the biggest and most spectacular. Amazing!"
        }, 
        {
            "index": 565, 
            "rating": "5", 
            "review": "A Copious Collection of Outstanding Russian Art. I spent several days this week enjoying its very extensive collection of Russian Art.This museum has many Russian icons,splendid examples of Russian Folk Art,and an encyclopedic collection of Russian paintings from the Baroque Period(Ivan Nikitin,Fyodor Rokotov)up to the Twenty-first Century.Personal favorites at this huge art museum were;Konstantin Flavitsky's\"Christian Martyts in Colisseum\",Isaac Levitan's\"Twilight Moon\".Mikhail Nesterov's\"Hermit\".Boris Kustodiev's\"Shrovetide\".Marc Chagall's\"Promenade\"and Zenaida Serebryakova's\"Bath House\".This art museum is open on Mondays,but closed on Tuesdays.There is plenty of labelling in English and sincere spasibas to their staff for being so kind and helpful."
        }, 
        {
            "index": 566, 
            "rating": "5", 
            "review": "The best museum. This is my favorite museum in St. Petersburg. I prefer it to the Hermitage. The Hermitage is great and you must see it on your first tour. But the Russian museum is unique, has fantastic art (all Russian as you can guess from its name), and much less crowded. Enjoy!"
        }, 
        {
            "index": 567, 
            "rating": "5", 
            "review": "Don't Miss This!. Nowhere near as famous as the Hermitage but the art is not to be missed. Some incredibly large and deeply beautiful paintings, especially the one of the storm at sea and the one of the boatmen pulling a river boat with straps and human power."
        }, 
        {
            "index": 568, 
            "rating": "4", 
            "review": "Impressive collection but staff cost a star. Was very impressed by the pieces on exhibit, however, entrance staff weren't helpful and those inside the museumndidn't even speak basic English and couldn't help with queries. Still, delighted i could see this on my trip to Russia but they don't make the process very easy for a foreigner"
        }, 
        {
            "index": 569, 
            "rating": "5", 
            "review": "after the Hermitage.... Everyone with an interest in fine art and architecture makes the Hermitage an indispensable part of a visit to St. Petersburg. Far fewer Western tourists allow time for a visit to this extraordinary palace/gallery, where the most amazing treasures of Russian art are housed. I cannot recommend this place highly enough, as it is clearly among the finest places of its kind in the world. The Hermitage offers great European art from every country and period, but the State Museum gives one a very special impression of the greatest Russian painters and sculptors."
        }, 
        {
            "index": 570, 
            "rating": "5", 
            "review": "Amazing experience. This museums has really outstanding collection, spacing between centuries, and the quality of the works is so high! I especially appreciated the avant-guards of XX century, a great exhibition with perfect lights, took many pictures to save the memories. Again, I paid extra ticket for photography but nobody checked it. The museum is really a must-see in my opinion, beyond the Ermitage."
        }, 
        {
            "index": 571, 
            "rating": "5", 
            "review": "Don't miss!. I am very pleased I did find time to go to the Russian Museum. It was excellent collections of Russian artists. I was very impressed! Just WOW!"
        }, 
        {
            "index": 572, 
            "rating": "5", 
            "review": "Loved the manageable size, loved the art, loved the lack of crowds. Enjoyed this visit more than the Hermitage. Loved the concentration on just Russian art. The museum wasn't too crowded, or too big. Less stressful, more leisurely visit. Highly recommend."
        }, 
        {
            "index": 573, 
            "rating": "4", 
            "review": "The Russian Stuff. It's the place to go to see the local Russian artists; many of whom I'd never come across. Don't just rely on a visit to the Hermitage."
        }, 
        {
            "index": 574, 
            "rating": "5", 
            "review": "Better than I expected. Since the museum is almost entirely Russian Art and artifacts I didn't know if I would like it that much. However, the museum is a cultural lesson in Russian art and life and I thought is was almost as great as the Hermitage. There are some amazing religious painting of epic size and although those aren't usually what I like, here I did. Even though you probably don't know of more than Kandinsky, the talent is of top quality."
        }, 
        {
            "index": 575, 
            "rating": "3", 
            "review": "Average Museum. Nothing particular to highlight if you are short of time you may skip it."
        }, 
        {
            "index": 576, 
            "rating": "4", 
            "review": "Very interesting. I really enjoyed the museum, although some of the exhibits did not have any English explanations. The audioguide was helpful."
        }, 
        {
            "index": 577, 
            "rating": "5", 
            "review": "great. this place houses the best collection of portraits I've seen untill now"
        }, 
        {
            "index": 578, 
            "rating": "5", 
            "review": "Don't Miss this Gem. This collection of Russian art, especially paintings, is unmatched and mostly unknown outside Russia. The main collection of paintings is from 19th and 20th Century artists who rebelled against traditional, safe forms that emphasized mythic subjects and heroic events in order to portray real life. Many of the later works were also influenced by the Impressionist Movement."
        }, 
        {
            "index": 579, 
            "rating": "5", 
            "review": "Remarkable and worth visiting. Thsi museum is not as highly sought after as the Hermitage however some of the exhibits are equally as good.The entrance is below ground to the side and kind of hard to find. Once inside it is filled with remarkable art and treasures and we were so happy to have gone.Some of the art is astounding and the building itself incredible. You do not need the same amount of time as the Herimatge so it's worth checking out and we would rate it a 5 as well for different reasons."
        }, 
        {
            "index": 580, 
            "rating": "5", 
            "review": "Amazing paintings you've never seen. . Although I have knowledge of art, I had never heard of most of these artists, but the paintings are created by talented people who rival those we know in the West. I assume that the fact that Russians weren't permitted access to the West kept word of these Russian painters within Russia, If you have any interest in art, you should see this museum."
        }, 
        {
            "index": 581, 
            "rating": "5", 
            "review": "For a concentrated Russian experience.... After the Hermitage this museum focuses mainly on Russian artists. It does not have the magnificence or the square footage but is packed with Russian history. Currently closed on Tuesdays as Russia alternates museum closed days to ensure there is always something to do. Best to avoid the museums on the weekends as they are always busy."
        }, 
        {
            "index": 582, 
            "rating": "4", 
            "review": "Awesome. Really really.. Students get in cheaper here. Flash your student card (it doesn't have to be an ISIC). The rooms are numbered coherently and you can really see how Russian art evolved over the years. Also, unlike the Ermitage every painting has a label in English alongside the Russian, with a short description of the painting that allows an unknowledgeable person like me to understand what was going on. Take the map which shows the floorplan of the museum and start from upstairs. The museum wardens (do you call them that!)/the ladies sitting in each room are atypical and will actually greet you back with a smile when you say zdrastvooyte to them (: For someone looking to be exposed to Russian art the Russian Museum cannot come recommended enough. I guess the Hermitage is a must-see but it can get overcrowded, and frankly I don't want to see so much of western European Art when I've traveled specially to Russia, even if some of its artists are indeed influenced by italian art..."
        }, 
        {
            "index": 583, 
            "rating": "5", 
            "review": "favorite museum in St Petersburg. Gave real insight into the Russian character, values, political experience."
        }, 
        {
            "index": 584, 
            "rating": "4", 
            "review": "I loved this museum.. The museum is beautiful on the outside and inside. There are some of the most famous paintings by Russian artists in it. Just to name a few of my favorites: paintings by Ilya Repin \"Bargemen on the Volga\", \"Sadko in the Underwater Kingdom\", and \"Zaporozhye Cossaks\"; Karl Brullov's \"The Last Day of Pompeii\"; the original painting by Ivanov \"The Appearance of Christ to the People\" (it is though much smaller than the gigantic painting by Ivanov in Tretyakov's gallery; but this smaller one was the one he spent 20 years working on and only after that he painted the gigantic version). I wish we had more time in thsi museum. You definitely need at least two-three hours to see all the highlights."
        }, 
        {
            "index": 585, 
            "rating": "5", 
            "review": "GREAT MUSEUM, DO NOT MISS IT. It has been an amazing experiences to visit this museum.I have had the opportunity to discover painters that I never heard of before.It is not so overwhelming as Hermitage Museum.... and it is really beautiful.Really, it is not so often that one discovers painters that have fascinating paintings and are completely new to me and I am sure to many other people."
        }, 
        {
            "index": 586, 
            "rating": "4", 
            "review": "If you love the Hermitage, do not pass this up!. 45 minutes was definitely not enough for this place! If time had permitted I would have revisited this musuem. Halls of equal grandeur as the Hermitage. Artwork by russian artists are pretty amazing, especially love Vasily Perov and Ivan Kramskoi (actually these were the only ones I rem, I'm sure there are many more amazing artists). Other than paintings, there are many many sculptures to admire too!Do not pass up!"
        }, 
        {
            "index": 587, 
            "rating": "5", 
            "review": "Underrated, But Gorgeous Museum. Do not pass up on seeing this incredible museum, it really does an excellent job in showing the Russian culture throughout history and the contributions Russians made to the art community. This museum is filled with the well known and lesser known artist, but is also has many beautiful handcarved wood and bone relics. While the Hermitage gets all the glory, this museum is definitely worth the visit; it will certainly help give a better appreciation of the Russian culture. In fact, some of the pieces are a marvel just by their size alone. We went mid-week, during the day and while the crowds at times were a little heavy, for the most part they were quite sparse in comparison to other sites. This is another museum that's best to leave the jackets and bags behind, or your going to be stuck checking it all in."
        }, 
        {
            "index": 588, 
            "rating": "5", 
            "review": "From icons to avant-garde to Russian folk art.. While the Hermitage is hailed as the most important Petersburg museum, the State Russian Museum is definitely number one when it comes to purely Russian art.The collection includes some of the oldest Russian icons, a walk through the mainstream Russian paintings including works by Wrubel and Riepin and by avant-garde artists like Malevich (his Red Cavalry and Red Square are displayed just like that, on on the wall in the corner of a small room with no specific reverence). There are also a number of folk art collections, moss figurines for children being my favorite.It's cheap, it's close to the center and it's really worth it. Just watch out when planning your visit here as the museum and the neighboring park could sometimes be closed without prior notice as it seems to be *the* place for the societe's parties (read: fireworks, militia blocking out half of the city center etc.)."
        }, 
        {
            "index": 589, 
            "rating": "5", 
            "review": "Hermitage gets all the press, but don't pass a chance to visit this museum. We were very pleasantly surprised with the Russian Museum. Even after seeing the Hermitage first, we found this collection more than worth our time and attention. This is a top 5 for us in St. Petersburg, no question."
        }, 
        {
            "index": 590, 
            "rating": "5", 
            "review": "Do the Hermitage - but don't skip the Russian Museum!. Our original itinerary was to skip the Russian Museum and only see the Hermitage, but our Russian friends insisted that we see the Russian Museum. And boy were they right! The museum collects Russian artwork from the 18th, 19th, and 20th centuries. Most of the greatest Russian artists are unknown outside of Russia, so if you're like us, you've never heard of artists like Repin and Surikov. But their works are collected here - and they are AMAZING. There's something about seeing great art that blows you away that you've never ever heard about before. We felt like we were somehow discovering these gems. Unlike the Hermitage, it's not difficult to get inside and not crowded at all (except maybe the downstairs coat check area). The Hermitage is unmissable, but don't think \"one museum is enough.\" You'd be doing yourself a disservice."
        }, 
        {
            "index": 591, 
            "rating": "5", 
            "review": "Incredible Art in a beautiful setting.. Not far from Palace Square (and surrounded by decent restaurants), is the most excellent Mikhaelovski Palace more commonly known as the Russian Museum. This was my second favorite museum in Russia - behind only the Hermitage. First of all, it's in a palace beautiful in its own right. Second, you're not as likely to be subject to the mass crowds at the Hermitage. (Although you will run into the occasional tour gruop or students led by a teacher)Most importantly, it is filled with beautiful art by artists you've likely never heard of. Some you may have, if you've studied Russian history (Repin and the like), but Schedrin, Ivazovski, Roerich - the list goes on and on. This isn't just boring icons -beautiful seascapes, modern art and excellent impressionism is intermixed with your standard portraits and well-done marble work. When you leave you're treated to a beautiful view of the Church on Spilled Blood (Spas na Kravi) to your right.The two of them followed by an excellent Georgian restaurant make for a day well-spent."
        }
    ]
}