{
    "category": "St-Petersburg", 
    "entity": "Palace-Bridge", 
    "avg_rating_stars": 4.420454545454546, 
    "review_count": 176, 
    "rating_stats": {
        "poor": 2, 
        "average": 11, 
        "terrible": 1, 
        "very_good": 70, 
        "excellent": 92
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "Time your visit to view when it is open. You will need an early start and set the alarm but its worth watching the bridges being raised .\nDouble check the maps as some are incorrectly labeled with opening times . If in doubt pick a time when another nearby bridge is scheduled to open too"
        }, 
        {
            "index": 2, 
            "rating": "4", 
            "review": "Nice view. During the night, when the bridges are open, you will have a nice view. Recommendable in combination with a night walk."
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "Amazing City!. We visited St. Petersburg Russia and it was amazing.. Visiting the bridges at night is wonderful. They turn the lights on at a certain time and it is magical. Great place to eat, visit the Church of the Spilt Blood, is a must to understand the history of the city. The bridges open up to the ships delivering goods at night and it is a very exciting time."
        }, 
        {
            "index": 4, 
            "rating": "3", 
            "review": "It's a bridge. Went past it and under it on our 2 day Alla Tours Faberge Museum shore excursions. Interesting history. Maybe of more interest to engineers and architects."
        }, 
        {
            "index": 5, 
            "rating": "4", 
            "review": "Draw bridge. There are boat tours at night that you can take and it takes you by the bridge to see when it opens up at midnight"
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "Beautiful. ... worth the waiting. The opening starts at 1:25 am (in the morning ) the bridge opens to it full so the boats can pass throw. The opening takds arround 10 mins and the boats start passing. Beautiful thing to watch. Deserves the waiting in the cold weather ( it was 7°c) ... we had much of fun time. Place: directly near the hermitage palace."
        }, 
        {
            "index": 7, 
            "rating": "4", 
            "review": "Picturesque. Very good walk along the esplanade with great views of the city. A guide here makes all the difference to explain all the details of this area."
        }, 
        {
            "index": 8, 
            "rating": "5", 
            "review": "Huge Drawbridge by the Palace. With our guide we drove back and forth over this major transportation link several times and it is a really big drawbridge. The bridge is illuminated at night and each night around 1:30 am the bridge is opened, sometimes with classical music."
        }, 
        {
            "index": 9, 
            "rating": "4", 
            "review": "Singing(?) Bridge. All the bridges that I've seen in St Petersburg are impressive, but I had never seen the bridges raised, so I was determined to make that happen this trip. The Palace Bridge, closest to our hotel, was supposed to have the added feature of classical music and lights until the end of September, so I made my way out there for the 1:25 AM opening. Maybe it was where I was positioned, but I heard no music, but the bridge was raised right on time. Impressive to a degree, and I'm glad I did it and took pictures and video, but I won't need to lose sleep to do it again. ."
        }, 
        {
            "index": 10, 
            "rating": "5", 
            "review": "Unforgettable impression. Even though it takes place at 1:30 am it worth staying awake to see the opening of the bridge. Lucky we were to be there during the Music Bridge week so the whole process was accompanied by the sounds of classic music."
        }, 
        {
            "index": 11, 
            "rating": "4", 
            "review": "Nice to see. After a walk at midnight the palace bridge is a great thing to do especially if you are couples. Recommended"
        }, 
        {
            "index": 12, 
            "rating": "4", 
            "review": "Cool to see but annoying if you have to wait to cross it.. The Palace Bridge adds character and charm to and already charming city, but the traffic is horrendous and when the bridge is up its even worse. The wait to get over can be long, but it's a great photo opportunity if you're a visitor to the city. If you're local you probably hate this bridge."
        }, 
        {
            "index": 13, 
            "rating": "4", 
            "review": "Fantastic Evening on the River. This is certainly a sight which will stay in your memory forever. The river at night is spectacular and well worth taking a midnight river cruise. We visited the Fort and then boarded the boat for a river tour. The buildings are spectacular but the most impressive sight is the opening of the three bridges. This takes place at 1:20 am."
        }, 
        {
            "index": 14, 
            "rating": "4", 
            "review": "Well, its a bridge, but they've got 500 of them!. I didn't see the draw bridges when they open at night -- I think it occurs around 1 a.m. -- but I'll take the locals word for it -- it's something to see."
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "My fav view in the city!. I'm in love with this amazing city, and especially I love this view. I always come here while visiting Saint petersburg. I wish I could make some nice pictures, but I''m not really good in photography..."
        }, 
        {
            "index": 16, 
            "rating": "5", 
            "review": "A must if you go for the first time. I`ve been in st.peterburg 4 years ago and went on a river trip to see the bridges open at night and it was really interesting. When you go second time it becomes not so impressive. Do not go on long cruises )3 hours) since it becomes cold and boring."
        }, 
        {
            "index": 17, 
            "rating": "4", 
            "review": "Main bridge. This is a major bridge across the river and gives a good view of the Winter Palace. It is a draw bridge and backs up traffic after one in the morning"
        }, 
        {
            "index": 18, 
            "rating": "5", 
            "review": "Is beautiful. I went to the port in front of the palace. Ito cross to the island of summer palace. Is beautiful how they build the bridge and I will come back ti see the view by the night"
        }, 
        {
            "index": 19, 
            "rating": "4", 
            "review": "Where crowds gather at night. It was fun to gather at the riverbanks at night to watch the drawing of the bridges. Music blasted on loud speakers and everyone had their cameras out. It was quite the fanfare."
        }, 
        {
            "index": 20, 
            "rating": "4", 
            "review": "Must do on your St Petersburg trip. Bridges in St Petersburg open in the night at 1.25 am and stay open till 5 in the morning to let the big ships pass. The opening of the palace bridge is beautiful with lights and music. There are 2 ways to enjoy the attraction - 1) Stand on the road adjoining palace bridge (which is the most beautiful one); or 2) Take a night time cruise which covers opening of all the bridges. On a rainy day, prefer option 1 given it can get cold and windy on the cruise (we learnt the hard way). On a clear day, cruise would be better as it is a nice way to enjoy the city view in the night. Couple of pointers:1) Ensure you are on the same side of the bridge as your hotel. Else you will be stuck till 5 on the wrong side.2) Figure out a way to reach back late night to your hotel. Taxis will fleece you if they figure out you are a tourise."
        }, 
        {
            "index": 21, 
            "rating": "4", 
            "review": "good night time activity. It appears that the whole city is out to witness the opening of the bridges after midnight. The tours start after 11 pm and go on till 3 am. It gets very cold and one must be prepared."
        }, 
        {
            "index": 22, 
            "rating": "5", 
            "review": "Nighttime boat tour a must. We took a short nap so that we could fully enjoy the nighttime bridge tour. It was a wonderful way to get acquainted with the layout of the St Petersburg and to see if from such a unique perspective. We enjoyed seeing all of the other boats out, stopped by the opening and closing bridges. There were blankets on board and at some point, we went into the cabin, where everything could still be viewed perfectly."
        }, 
        {
            "index": 23, 
            "rating": "5", 
            "review": "Beautiful!. We were there during fleet week and it was a truly beautiful site to see all the Russian ships, especially the submarine!"
        }, 
        {
            "index": 24, 
            "rating": "3", 
            "review": "nice place. It is interesting in night and when we got there, there was a local band near the bridge signing in Russian which was kinda cool. The bridge is also fine. It's a good place to visit at 1am but in order to have a good view, it's better to be there earlier but be aware of the pick picketers coz when we were there, a group of people tried to steel my mother's phone from her purse"
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "Center of St Petersburg . The Palace Bridge is in the center of the city. It gives you a great view of the Nevski and Winter Palace. You will be able to find the hydrofoils to Peterhoff and river tours."
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "Midnight cruise. Midnight cruise during which you see the bridges being raised is a must do. Sailing on the Neva river in the open boat with brightly lit palaces on the banks is a unique sight."
        }, 
        {
            "index": 27, 
            "rating": "4", 
            "review": "Nice at night. Great to see at night, beatiful lit. During the day it is a busy bridge with a lot of traffic which makes it just another bridge. Do not end up at the wrong side of the bridge when it opens! Seems to happen to a lot of people..."
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "Wow!. The bridge ipens at 1:25 am.classic music was playing it was awsome! Also, when I visited a live band was playing russian rock hits wich was very cool"
        }, 
        {
            "index": 29, 
            "rating": "4", 
            "review": "Great views. Again this bridge does not let you down. It provides you with fantastic views of both sides of the river of St Petersburg. The pavements are deep and not great if you have kids in a buggy"
        }, 
        {
            "index": 30, 
            "rating": "4", 
            "review": "Wow. The Palace Bridge connects the Vasili island right to the Winter Palace and Ermitage and is very close to the main high street. It is a bridge they open in the night and that is something one should go and see, they lit the bridges and the military boats fro river Neva can float forward."
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "Interesting Bridge!. If you come to St. Petersburg, you will be crossing this bridge several times to move between the Palace Square (Hermitage and Winter Palace) and the sights on Vasilevskiy Ostrov. This bridge is a 20th century creation and is probably one of the most famous sights of St. Petersburg. The height was limited so as to not obstruct the view of the monuments around it. There is a draw bridge to allow ships to pass up the Neva River. The history of Palace Bridge dates back to 1901, they had a competition to design a permanent bridge. This was no easy feat – it took eight years for them to decide a winner. The winner was Andrey Pshensitsky, a recent graduate of the St. Petersburg Institute of Communications Engineering. Celebrated Art Nouveau designer and artist Roman Meltzer was commissioned to design the bridge's architectural decorations, and construction eventually began in 1912. Free"
        }, 
        {
            "index": 32, 
            "rating": "4", 
            "review": "Cool thing to see while chilling with some buddies. The bridge lifting to let ships pass is a bit overrated, but hanging out with people during the white nights while waiting for it to happen is the best part of this experience. Look the times in advance as sometimes they are quite late and bring a jacket for the fresh air."
        }, 
        {
            "index": 33, 
            "rating": "4", 
            "review": "Great Photos. The Palace bridge opens every night in the summer time between 1 am and 4 am but we were lucky enough to see it open when we arrived in St Petersburg on \"National Navy day\". Many naval ships and submarines were docked in the river and the bridge was raised which was an incredible sight."
        }, 
        {
            "index": 34, 
            "rating": "4", 
            "review": "Stay up late and it is a nice view. When we were there in July the bridges opened to music at 1:30am. The bridges have various lights on them and some ships that pass."
        }, 
        {
            "index": 35, 
            "rating": "4", 
            "review": "NICE VIEW AFTER MIDNIGHT. This is an unique experience.It was a cool night with little rain. The cruise boat started around 00.30 am and the bridges were started being drawn open at around 01.30 am one by one. The scene was thrilling.The cruise boat had partly fully covered sitting area and smaller part being open to sky. The problem is the crowd in the boat. They jostled for space in the open area for pictures and it was really ugly experience. Why can not people be more disciplined ? Irrespective of nationalities this is an issue to solve.The boat had some outdoor chairs in the open space but the travellers ignored it and some stood on it.But this does not take away from the fantastic show being unravelled. The few kilometres cruise to see the bridges being drawn open is really cool.It was about an one hour show in the dark night. The buildings at the shores both side were fantastic view with lighting.Reccommended show when in St. Petersburg,one of the greatest and most beautiful cities in the world."
        }, 
        {
            "index": 36, 
            "rating": "5", 
            "review": "City of dreams . I'm in sokos palace bridge hotel and its only aten minute walk to the palace bridge ... The very famous bridge which opens at night so that the boats can cross ... The sign of st.peterburg Crossing that bridge you will have the amazing experience ✨❣ at this time of the year days are very long here until 11pm there is still light in the sky All the city is faced to great Nova river & the buildings lighting up at night ... With the reflection of the lights in the water even when its dark you can see the BLUE in the river ... & in the background ships, boats, fire works ... U can see the glorious Hermitage with its fantastique colors ❣♥️ believe me you dont want to miss the beauty"
        }, 
        {
            "index": 37, 
            "rating": "5", 
            "review": "Good view and good viewers. It has nice view,and viewers are so excited.The bridge opens at midnight until morning .In the summer the weather is cool and lovely therefore opening bridge moment and moving ships are more memorable."
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "Great views. Standing midway across the bridge gives you a wonderful view of several of St Petersberg's magnificent buildings. My wife and I spent quite a while just admiring the view (even though it was raining!)"
        }, 
        {
            "index": 39, 
            "rating": "4", 
            "review": "Worth staying up for. One of the waitress at the Astoria told us that the bridge opening was something we should not miss.Taking her word for it ,we set off to the bridge by the Hermitage and arrived at 1 o'clock in the early morning.There was a party atmosphere,hundreds of people,a rock band,and lots of dancing.At approx 01.30 the bridge opened up,all other bridges along the river opened up at same time to allow ships to go up river.Happens every night and is well worth going to."
        }, 
        {
            "index": 40, 
            "rating": "5", 
            "review": "Beautiful & Amazing. This is a mid night attraction , Bridges open all mist at 1 AM and remain open till 5 AM, but if you can manage to awake this something you should must do."
        }, 
        {
            "index": 41, 
            "rating": "3", 
            "review": "A well known historic side. From my point of view, I was suprised why so many people gathered by Neve to watch how the bridge rises at 1:00 in the night - but am still gald we went to see it :-)"
        }, 
        {
            "index": 42, 
            "rating": "5", 
            "review": "Spectacular. Spectacular view at night while the bridge is up to let river traffic through to mainland. Watched by hundreds/thousands of spectators every night."
        }, 
        {
            "index": 43, 
            "rating": "5", 
            "review": "Interesting experience. St. Petersburg is definitely place where you will get many times more than you expect.Some compare it with Venice, to me it is way too different and both places are unique on it's own.This bridge was one of many magnificant things to explore.And I could finish description for any atractions in this great city the same way I will end this one:Hermitage museum is a must!"
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "Impressive. A must in St. Petersburg.. Each night at about 1:30 the bridges of St. Petersburg really steal the show. Worth staying awake. Truly impressive!"
        }, 
        {
            "index": 45, 
            "rating": "4", 
            "review": "Beautiful bridge. The views of this bridge are fascinating especially if you have the opportunity to observe it around sunrise."
        }, 
        {
            "index": 46, 
            "rating": "4", 
            "review": "Nice at night. Came here day andNight looks better at night, all the bridges close between 1-5 am for big ships to pass through. Alongside the river you have 100s of palaces."
        }, 
        {
            "index": 47, 
            "rating": "2", 
            "review": "A bridge to far. This looks interesting in the picture and if you want to see an illuminated bridge opening then this one’s for you but do not waste your money on one of the pleasure boat nighttime cruises to see all the drawbridges open; it really isn’t such a big deal, it is so cold (“in July?) at night that they provide fleeces in which to wrap yourself and definitely not worth the fare. Better you should spend your money on a cruise around the city on the canals as you will find it far more interesting."
        }, 
        {
            "index": 48, 
            "rating": "4", 
            "review": "Excellent pedestrian walkway across the Neva.. Be careful. The bridge opens (and closes access) about 1:00 am until 5:00 and you don't want to get trapped, unable to get back to your hotel."
        }, 
        {
            "index": 49, 
            "rating": "5", 
            "review": "Beautiful bridge in the heart of the city. St Petersburg had crazy busy traffic and this bridge is over busy but impressive. You're sure to go over it in your travels and if not, make the effort"
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "Awsome exprience. Unique attraction of St.Petersburg. Absolutely recommend take a boat at the midnight to enjoy bridge opening from below."
        }, 
        {
            "index": 51, 
            "rating": "4", 
            "review": "Amazing bridge. At 1,30 am ,the bridge risees ,boats and ships horn,people and tourists clap.everythingś romantic.its not uniqe in the world but worths to see and be there."
        }, 
        {
            "index": 52, 
            "rating": "4", 
            "review": "Walked across in a parade!. We walked across during a parade that was going the other way because we wanted to get to the hydrofoil station on the other side and the bridge was closed to traffic. What grand views from the bridge. Worth a walk over to see a lot of St.P icon buildings"
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "Drawbridge. It was fascinating to see the opening of drawbridges, we chose not to talk the cruise into the Neva river, but stood on the sides of the draw bridge to see it open, it was splendid, a very unique experience to see the road being lifted till such time the lamp post is parallel to the river, a must see"
        }, 
        {
            "index": 54, 
            "rating": "4", 
            "review": "Busy bridge. This bridge is one of the main crossings over t he Neva River and is therefore always busy. Being a bascule bridge it can be raised to allow shipping to pass. This is usually done at night so as not to interrupt the flow of traffic. Being on a cruise ship with a group visa, we did not have the opportunity to see the bridge open, but even during the day time, it is a busy, exciting bridge."
        }, 
        {
            "index": 55, 
            "rating": "5", 
            "review": "Drawbridges by night cruise. Absolutely a must when visiting St Petersburg during the white nights that's June. Cruises leave at 1.10am and after to see the bridges go up and hundreds of boats are racing together. It's really heart racing experience. If the boat doesn't have bar most don't BYO."
        }, 
        {
            "index": 56, 
            "rating": "5", 
            "review": "Main imperial bridge on Neva River !. That is a bridge we often used to cross on the other side of Bolshaya Neva River, on the Vasilievsky Island.It connects Palace Square and a greatest island of 42 islands in total having on Neva River. By the way Neva river is by the volume of the water one of the largest in Europe but by length one of the shortest ,only 74 km.The bridge is the road traffic and foot bascule bridge with five spans.Walking late in the evening one day on the Palace Embankment between Winter Palace and Admiralty, we saw the operation of drawing(basculing) the bridge, after what all traffic across Neva to the Vasilievsky Island interrupted.Before the current structure and design of the cast-iron bridge, the same was temporary pontoon bridge but set about 50 meters downstream from the nowadays position.Great bridge and wonderful views from it on the both coast of Neva River !"
        }, 
        {
            "index": 57, 
            "rating": "5", 
            "review": "White Nights!. Rent a boat, get a bottle of nice red wine, some delicious Russian dark chocolates, and travel the canals during the White Nights. End up at this bridge when it opens after midnight. It's a unique experience."
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "Quite a sight to see. I didn't realize this was such a popular attraction. Half of the town turns out to watch the openings. Beautiful night-time views (when it is dark outside)."
        }, 
        {
            "index": 59, 
            "rating": "4", 
            "review": "A good option for a night activity. It won't be as good as the bridges in London but it ha it's own charm, specially if u get to see the vessels pass by..do wait for few of them to cross..it's a great night activity and u will find the whole lot of tourists accumulated at the same spot..take care of pickpocket,,it's very common here.."
        }, 
        {
            "index": 60, 
            "rating": "4", 
            "review": "See it open!. Rent a boat for the opening hours close after midnight. It's one big party every time. Next best options would be sitting alongside the Neva or joining one of those bus-tours. But boat is best!"
        }, 
        {
            "index": 61, 
            "rating": "5", 
            "review": "Join the crowds and watch it open. It seemed a little crazy to stay out until 1:30am in the rain just to see a drawbridge... but with all the other people, the river full of tour boats, and the immense size of the bridge - yep, it's worth it!"
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "Enchanting night boat ride. Breathtaking view during the night on the boat. We were awestruck with beautiful monuments lighted passing by with a slow drizzle n pleasant weather. The cream was we saw the opening n closing of the bridges....it was awesome."
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "cruise view!. take a 1:am boat ride! and see all the bridges open at night! the boat can have live music too! and the view along the way is charming! its cold! so be dressed warmly."
        }, 
        {
            "index": 64, 
            "rating": "5", 
            "review": "Don't miss it opening during night!. We took night trip by boat to see opening the bridges. One of MUST while visiting St. Petersburg. It's just amazing to see all the lights. Only one point: keep in mind that bridges are opened for about 3 hours, so be sure you are on the right side of Neva river. Otherwise you have no chance to go back to the right island!"
        }, 
        {
            "index": 65, 
            "rating": "4", 
            "review": "Night excursion under this bridge. We have a chance to see it opened during our night excursion by boat. Nice to see opening this bridge during night when lights are on."
        }, 
        {
            "index": 66, 
            "rating": "4", 
            "review": "Palace Bridge. i was there on white nights i saw the ships passing under that bridge its awesome be there around 1am"
        }, 
        {
            "index": 67, 
            "rating": "4", 
            "review": "Beautiful. We did not have the chance to see it open cause they just open it for the \"good weather\" with the season of tourists, when the boats start cruising (some parts of the lake were still frozen now, March-April 2016), but is beautiful and worth visiting!"
        }, 
        {
            "index": 68, 
            "rating": "4", 
            "review": "Romantic at Summer Night. Must see once or twice or many times... Very cold and windy place in the fall and winter and early spring. Always full of traffic. Bur summer mights are amazing! Bridge is close open the way for ships starting about 2:30 till 4:30 (check the schedule). Very romantic place. Good of all people in love from 2 till 100 years old :)"
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "Best to see during the White Nights. Beautiful bridge when seen at night, friends recommended to see its 1:25 am opening! Unbelievable! Make sure you stay on the correct side of the Neva river, there is no water taxis at night between the islands :)"
        }, 
        {
            "index": 70, 
            "rating": "5", 
            "review": "A good sight.... While taking the cruise on River Neva... which again must not be missed while in St Petersburgh.. the sight of the Palace Bridge is wonderful..."
        }, 
        {
            "index": 71, 
            "rating": "3", 
            "review": "Good visual of surrounding area. When we were there the river was partial frozen. So no boats however great for watching the ducks. Great place to take pictures of palace etc"
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "Great view. Absolutely beautiful view of the city and a fantastic bridge itself. Went in the depths of winter so didn't see the bridge open as the river was completely frozen but still worth visiting."
        }, 
        {
            "index": 73, 
            "rating": "5", 
            "review": "St Petersburg was designed to be seen from the river.... .... And looking at the city around this bridge, you can see it so well. Really beautiful at night!!"
        }, 
        {
            "index": 74, 
            "rating": "5", 
            "review": "Must see it to belive it. Amazing view So pretty and delightful. One has to take a ship cruise to see it all and would be very pleased by it."
        }, 
        {
            "index": 75, 
            "rating": "4", 
            "review": "Get there before it opens!. The bridge I think opens at both morning and dusk, I got there at 6am and it was quite a view. Lots of people doing the same thing."
        }, 
        {
            "index": 76, 
            "rating": "5", 
            "review": "The city splits in two. A very nice and attractive ceremony takes place every night in St Petersburg. Had a little party going on during a beautiful moonlit night on a boat whilst cruising the Neva River. Three bridges open one after the other commencing at 1.30am, splitting the city into two for a period of 3 hours. Cruise booze and music. You'll be up and down the river for ~2 hours enjoying the beautifully structured and lit buildings along the banks in the city as well as the old school bridge opening ceremony. Tends to get chilly at night even during \"summer\". The city has to be a top European tourist destination!"
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "The symbol of St. Petersburg white nights!. The symbol of St. Petersburg white nights! Mosto in the city appeared relatively later, connecting Vasilievsky island and Palace of the king,size. I recommend a sail on the boat in white nights and love here!"
        }, 
        {
            "index": 78, 
            "rating": "5", 
            "review": "The connector of Vasilievsky Island to Winter Palace & Admiralty & Palace Square. You have crossed most likely this bridge, if you have crossed the river and arrived to Palace Square immediately. If you have chosen a hotel in Valievsky Island, remember Cinderella story, be home before midnight, as this Palace Bridge is also a bascule bridge aka Drawbridge. It has small decorations and gives nice view to Winter Palace embankment.Windy place."
        }, 
        {
            "index": 79, 
            "rating": "5", 
            "review": "Great views. St.Petersburg is famous with the rivers, Lakes and the nice bridges which opened automatically everyday at specific times all over the rivers.I took a ferry boat for the bridge tours at late time, It was Very nice and I enjoyed it a lot. You can book that tour separately through your hotel or you can find booths along side the river bank sells the tickets.A city card is a great options with very good deals for the attractions includes the ferry tour, You can buy it online.This tour is highly recommended."
        }, 
        {
            "index": 80, 
            "rating": "5", 
            "review": "Summer-night-must-see!. Breathtaking view of bridges moving apart from embankment or from a boat at summer night is definitely one of the best attractions in Saint-P."
        }, 
        {
            "index": 81, 
            "rating": "3", 
            "review": "Walk over this when going from the Hermitage area to the Peter and Paul Fortress. We had a blustery walk over this but its a good way to see a different perspective on the city. Walking is best to get a sense of the scale of things."
        }, 
        {
            "index": 82, 
            "rating": "4", 
            "review": "Late at night. The bridge opens at 1 am and 1 pm and the Russians go mainly to the 1am as the bridge is illuminated. It may just be a bridge that opens and closes but it is a good evening which would be better appreciated on a summer night"
        }, 
        {
            "index": 83, 
            "rating": "4", 
            "review": "very pretty. as someone who has lived in a coastal area with draw bridge this one is very pretty, but im not sure why everyone wants to stay up till after midnight to watch it being drawn up. seen one go up seen them all right. lol"
        }, 
        {
            "index": 84, 
            "rating": "4", 
            "review": "A \"must see\" in st petersburg. It's not fair go to st Petersburg and miss its bridges ,specially I advise to have a night tour on neva river and see their rising up."
        }, 
        {
            "index": 85, 
            "rating": "5", 
            "review": "Romantic in the night . It is a very nice bridge and it is very pretty in the night because it is lit up.\nIt isn't very big compared to others around the world but it was still nice to see."
        }, 
        {
            "index": 86, 
            "rating": "4", 
            "review": "Opening bridges. Our guide told us to expect a late night (but it would be worth it). After dinner a Georgian restaurant we walked to the Palace Bridge, it the shadow of the Hermitage Museum. At 1.30am the traffic was stopped and the bridge opened. There were tourists everywhere. Then the next bridge down the river opened and so on till they were all open and then the commercial ships moved through. You can find out what time they closed yourselves.."
        }, 
        {
            "index": 87, 
            "rating": "4", 
            "review": "Remarkable panoramic view. The bridge itself is interesting only when it opens and closes. Otherwise it's the views. Splendid during the day, beautiful at night.What's not to like? The weather? Winter's not the best time to visit. Celebrations like \"Scarlet Sails\" are spectacular."
        }, 
        {
            "index": 88, 
            "rating": "4", 
            "review": "Good View. Interesting feature. This bridge closes every night at 1am so don't get stuck on the wrong side of the bridge if you want to get home at night. It's a nice bridge with some great views."
        }, 
        {
            "index": 89, 
            "rating": "5", 
            "review": "Beautifull. A must see if you happen to be in St.Petersburg at times of so calles white nights, when it never gets completely dark and you can make photos of the bridge lifting (so the ships can pass) in the blue light"
        }, 
        {
            "index": 90, 
            "rating": "4", 
            "review": "Must see....Drawing of the Bridges. Excellent and must see for drawing of the bridges every night at 0125 hrs. Good lighting and good crowd to see this unique feature every night."
        }, 
        {
            "index": 91, 
            "rating": "4", 
            "review": "Well worth the walk. Good views of the Neva. This a decent walk but worth the effort. It can be used to get from the Hermitage to the Peter Paul fortress."
        }, 
        {
            "index": 92, 
            "rating": "4", 
            "review": "Nice boat ride scenery.. Went through the Palace bridge during our boat ride along the river of St. Petersburg. It was a great experience, though especially when we're enjoying our great Russian meal during this boat ride."
        }, 
        {
            "index": 93, 
            "rating": "5", 
            "review": "Very cool. They go up at midnight and down at 5am so it was a little difficult to see them in action. If you suffer from a little jet lag and find yourself up at 4am, go for a stroll!"
        }, 
        {
            "index": 94, 
            "rating": "4", 
            "review": "Beautiful. Quite an ornate bridge leading to the beautiful palace. Steady stream of traffic on top and lots of tourist boats below to enjoy the view"
        }, 
        {
            "index": 95, 
            "rating": "5", 
            "review": "Should be visited by a group of cheerful companions! Or a Romantic Atmosphere!. It is very nice to see the bridges opening. It is specially can be seen at 1.00 a.m. and if you take a night tour to it, you may even enjoy the cruising and if you are lucky you can enjoy the night dance and cheerful atmosphere of the ferry club as well!"
        }, 
        {
            "index": 96, 
            "rating": "4", 
            "review": "Great and Unusual Bridge Opening Up at 01:30 past Misnight. Interesting to see the bridge open up at 01:30 in the morning to allow large ship to sail down the Neva River."
        }, 
        {
            "index": 97, 
            "rating": "4", 
            "review": "St Petersburg highlights. Highlight of the day tour was Catherine's Palace which was rather spectacular, especially if you haven't seen the Palace at Versailles, followed by Peterhof"
        }, 
        {
            "index": 98, 
            "rating": "5", 
            "review": "I didn't see it open!!. A popular sight in St Petersburg, but often depicted open, I only saw it closed with a lot of traffic but it's an interesting sight. Best seen from a boat."
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "Neva bridges. You need to stay up late to see the bridge being raised but well worth it, plenty of cruises available which allow you to see it from the river. Important if you are watching from the banks that you are on the same side of the river as your hotel, or you will have a long wait to get back to it in the morning"
        }, 
        {
            "index": 100, 
            "rating": "4", 
            "review": "The riverside of St.Petersurg. The most attractive feature of Petersubrg at a night time and late evenings. Also this bridge is considered to be the symbol of the city and thus it's pictured on the majority of souvenirs. Don't miss an opportunity to see how ships are sailing under the bridge when darkness covers the city"
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "at night even more impressive. a beautiful sight after all.\nand coming here at night when the bridges open for the huge ships to pass through is a must. very romantic as well as a massive party along the embankment."
        }, 
        {
            "index": 102, 
            "rating": "4", 
            "review": "A good tourist thing to do at Night. This is on the biggest draw-bridges in the city. You must see the opening of the bridges in the night. There are proper cruises available to see the opening of the various bridges at night. These are called Night cruise/"
        }, 
        {
            "index": 103, 
            "rating": "5", 
            "review": "\"bridge wonder.\".......... its a mid night ..trip\noh exciting ......to see the bridges opening....every few minutes....\nseeing is believing.....worth the effort of the midnight trip...."
        }, 
        {
            "index": 104, 
            "rating": "4", 
            "review": "Lifting up touristic attraction. At mid-night thousand of people and tourists awaited for this daily event. Every night bridges are lifted up. You can also buy a boat ticket and improve your experience from a different view point."
        }, 
        {
            "index": 105, 
            "rating": "3", 
            "review": "Bridge opening. if you don't mind staying up till a little after 1:25 or 1:35 am and watching how a bridge lifts up then this can be of an interest.\nif you do, then bring a coat or a warm jacket. it does get fresh and windy by the shores."
        }, 
        {
            "index": 106, 
            "rating": "4", 
            "review": "A Bridge. Crossed the Neva (pronounced Neever) several times during the two days we were in St. Petersburg. At night, the bridges are up...sorry, I do not remember why. But, our guide said it caused major transportation problems."
        }, 
        {
            "index": 107, 
            "rating": "4", 
            "review": "Cool at night. The palace bridge is cool to see at night or late evening when the sun is down. During the day its just an ordinary bridge but in the night its a pretty sight amongst the glows and lights of the city."
        }, 
        {
            "index": 108, 
            "rating": "3", 
            "review": "Palace Bridge. Though we crossed this bridge several times, nothing to draw attention. The bridge opens up at certain times to allow shipping but we did not get to see the same."
        }, 
        {
            "index": 109, 
            "rating": "5", 
            "review": "A must see. Excellent during the famous white nights, because it does not get completely dark and you can make photos of the lifted bridge in blue light. It is also the time when everything is happening around it, lots of people having fun, street artists,... Best time to go from June 18th to July 10th"
        }, 
        {
            "index": 110, 
            "rating": "4", 
            "review": "Stay up late night to experience this. With its crazy traffic jams and flood of tourists, St Petersburg remains a major shipping port. Which means large ships have to be able to make it through Neva River - they can do so only at night. Find the schedule when this and other bridges are drawn (closed for foot and car traffic) and large ships parade in. During the day, you can take ferry and other tourists boats under the bridge."
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "Stunning. Totally new and different experience and the whole thing ends to great excitement.\nYou can see either by being on the cruise or parked on the sides of the bridges."
        }, 
        {
            "index": 112, 
            "rating": "4", 
            "review": "Magic. Better going this on night or dusk, because the light so incredible but dont forget wearing jacket the wind so hard, you can take metro or by walk if your hotel Nevsky Prospect"
        }, 
        {
            "index": 113, 
            "rating": "4", 
            "review": "Beautiful bridge both day and night.. Beautiful bridge both day and night. Many of the boat tours go under it as they tour the city canals."
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "Stunning!. It was a memorable event to see the bridge open up - I could not believe the number of people who came to see it, it was comparable to my city, Budapest's big firework on our country celebrate day, 20th of August!\nMagnificent, indeed!"
        }, 
        {
            "index": 115, 
            "rating": "5", 
            "review": "Sight not to be forgotten. Stayed up till the early hours of the morning to see this. Pretty unforgettable sight. If you are in St. Petersburg in June or July, definitely stay up to see the bridges raised!"
        }, 
        {
            "index": 116, 
            "rating": "5", 
            "review": "My best photo!. My best photo from Saint Petersburg was taken here at night. Drawing of this bridge is something you should not miss!"
        }, 
        {
            "index": 117, 
            "rating": "5", 
            "review": "excellent. take the night cruise which starts at 12 at night to see the bridges open at 1.30,we went during white nights and saw the sun rising at that time.an unforgettable sight....."
        }, 
        {
            "index": 118, 
            "rating": "5", 
            "review": "A celebrated draw bridge. . palace bridge is a landmark of\nst.petersburg. its a postcard item that reminds tourists of the great time they had in the city.\na very popular bridge that draws olen at night and till dawn allowing the ships to pass."
        }, 
        {
            "index": 119, 
            "rating": "4", 
            "review": "The city postcard. Impressive construction which must be seen both during the day and at night, when open for the ship transit. Be sure to follow the schedule of its opening. It might be found at any hotel desk or tourism information office."
        }, 
        {
            "index": 120, 
            "rating": "5", 
            "review": "Good hotel. Palace Bridge hotel,maybe not nessessary Palace but like castle....many restaurants and interiour especially when build ,nice.restaurant interiour like old castle too and food good and not so bad price what you are waIting\nfrom 5 star hotel.they also serve numerous health and bath cures.Swimming pool nice and inc many different style of saunas."
        }, 
        {
            "index": 121, 
            "rating": "5", 
            "review": "Learn of the St. Petersburg Excuse. It's well known by the locals that the bridge remains up from 1:00 - 5:00 am to allow ships to pass through. Often referred to as the St. Petersburg excuse for those that party too long and then are forced to remain on the island until the bridge lowers at 5:00 am."
        }, 
        {
            "index": 122, 
            "rating": "4", 
            "review": "Must go watch this. Its a treat to watch for sure. The drawbridge is an experience one must watch although the timing of the same is odd. Coming back after the cruise to watch the drawbridge is after 0230 hrs in the morning. There were more than a thousand people having the experience though. Most recommended."
        }, 
        {
            "index": 123, 
            "rating": "5", 
            "review": "Spectacular View @ Night. Let me put it this way, WOW !!\nOne of the best place to witness the beauty of SPB.\nThe bridge is lifted after 1 am (if I remember it correctly), probably the best time to witness the whole scene.\nYou would love the cloud formation + lights : if you are lucky.."
        }, 
        {
            "index": 124, 
            "rating": "5", 
            "review": "Amazing. beautiful lights and impressive view.You would better look at it at night when river water become to be as mirror .You can also take a boat and pass under bridge. Breathtaking view :-)"
        }, 
        {
            "index": 125, 
            "rating": "5", 
            "review": "Watch the Bridge Open at Night. Went to the river to watch the opening of the bridges late at night (around 1:30am) after visiting some wine bars (recommend this process). I wasn't expecting much but it was actually very cool to see all the bridges opening. They are lit in a cool way and are very beautiful to see. Quite romantic if you are with someone. Then the boats come through and you get to watch them. If you are there during summer like I was, it is relatively light all night so you can take a walk back through the main squares or by the cathedrals afterwards. Highly recommend."
        }, 
        {
            "index": 126, 
            "rating": "5", 
            "review": "Go there earlier than the bridge opens.... St.Petersburg apparently is famous for so many bridges opening at night for the boats passing by? Out of all of those bridges, the location of this bridge is probably one of the best. If you want to take good photos, I think this bridge is the place to come also because of the backgrounds. However, try be there at least 1 hour before the bridge opens, because there will be so many people right before and you won't be able to find a spot.."
        }, 
        {
            "index": 127, 
            "rating": "5", 
            "review": "Do not miss. Ofcours u need to see it.at midnight there r too many people come to visit it. And sooo many young boys and girls playing music and sing. Good time for walk and enjoy yr free time."
        }, 
        {
            "index": 128, 
            "rating": "5", 
            "review": "to be attended. the bridge open on night, I believe at 1:25 am. we went there, and got a great surprise, full of people waiting for it. once they are open, you will see the boat passing (the one that have to wait the opening)"
        }, 
        {
            "index": 129, 
            "rating": "5", 
            "review": "beautiful at night. got lights installed during the 2013 renovation: a good photo op at night. As always, noisy and unpleasant to walk during the day, so to avoid this, one may consider taking a trolley-bus just to cross over."
        }, 
        {
            "index": 130, 
            "rating": "5", 
            "review": "Go for the White Nights Bridge Opening. During White Nights (in the summer) the bridges open very late at night or early morning (the day we went it opened at 1:25am). Its a big deal, the bridges are lit up, dozens of boats are lined up to pass under the bridge, and thousands of people gather to take in the festivities. Quiet a unique and fun experience."
        }, 
        {
            "index": 131, 
            "rating": "5", 
            "review": "Cool!. You have to see it! It opens at 1:25 in the morning. Especially in June or mid of July. Whet white nights in St. Petersburg."
        }, 
        {
            "index": 132, 
            "rating": "4", 
            "review": "Nice at night. This drawbridge, like all that cross the Neva, is raised at 01:30 nightly for large vessels to pass. It is lit up and makes for a good show. I recommend a night-time stroll to see the Hermitage, the nearby churches, etc. because everything sparkles at night. I was alone but felt safe."
        }, 
        {
            "index": 133, 
            "rating": "5", 
            "review": "Beautiful place. Beautiful place to see during white nights and just in the evening, the best place is the bar on a caravelle nearby :)"
        }, 
        {
            "index": 134, 
            "rating": "4", 
            "review": "Spectacular. The midnight river cruise on the River Neva takes about an hour and forty five minutes. There are a number of cruise operators on both embankments. We started at 0100 hrs and finished by 0245 hrs. The bridges open one by one and the buildings on both embankments are lit. We saw about 6 odd bridges opening and it was spectacular."
        }, 
        {
            "index": 135, 
            "rating": "5", 
            "review": "Walk It. Unlike my dear GG Bridge, this one is short and very walkable, and the views of the city's palaces on both sides are amazing. Come at 3AM when it gets drawn to see a whole other side to it."
        }, 
        {
            "index": 136, 
            "rating": "5", 
            "review": "Gorgeous scene. one of the most beautiful scenes in Peters burg is the opening of the bridges ceremony in which bridges of Neva river open up in the mid night. the most beautiful bridges among the 22 movable bridges is Palace bridge. the combination of the lights of the Hermitage which illuminates the river creates a very gorgeous scene which lights even the sky. the Palace bridge opens up at 1:25 but do not cross the bridge if you wanna come back to your Hotel. :-))))))))))))))"
        }, 
        {
            "index": 137, 
            "rating": "3", 
            "review": "it's a bridge. really it's a bridge, there are literally hundreds in the city. this isn't something you should go out of your way to see. it looks like you think it does."
        }, 
        {
            "index": 138, 
            "rating": "3", 
            "review": "Romantic place. everything like purposed romantically with lights and the view altogether. When we were there ıt was cold but really exciting memories :)"
        }, 
        {
            "index": 139, 
            "rating": "5", 
            "review": "Most romentic view. Most romentic view of petersburg at 1.30am. I advice you to book a boat or cruise ride...and enjoy the view from boat. Too many people gether at that time."
        }, 
        {
            "index": 140, 
            "rating": "4", 
            "review": "Nice view. This is just one of the many bridges in a row. It opens at night (around 130 AM) and remains open for the night to allow freight traffic to go through. If you can, take a few minutes to take a stroll across during the day."
        }, 
        {
            "index": 141, 
            "rating": "5", 
            "review": "Amazing view. If possible one should take the boat tour. The night view is absolutely breathtaking. Weather is a factor so do take note of the local forecast."
        }, 
        {
            "index": 142, 
            "rating": "5", 
            "review": "Good for a walk !!. The bridge opens at certain times for ships to pass. however, it's really good for a walk. especially at night, The view of the city is magnificent"
        }, 
        {
            "index": 143, 
            "rating": "4", 
            "review": "A Good View. If you're walking around St. Petersburg then try and walk on this bridge. The views of the central districts are not to be missed!"
        }, 
        {
            "index": 144, 
            "rating": "2", 
            "review": "Really this is a place to visit. I guess the fourth world looks up to this one too...OOH a bridge! Oh and it opens up!. Gee, I guess they never heard of the Golden Gate, or the Verazano Narrows, those are bridges, Geez!!!"
        }, 
        {
            "index": 145, 
            "rating": "4", 
            "review": "Great Bridge and Location . Fantastic bridge to see day or night, very good location to visit and also good for photo ops.\nYou don't see these bridges very often around the world and its amazing to see, try to hang around till they open the bridge!"
        }, 
        {
            "index": 146, 
            "rating": "4", 
            "review": "Very nice bridge with decorative motif. One of the many bridges in the city this one has some art reliefs on it. It is also a draw bridge as all of them are."
        }, 
        {
            "index": 147, 
            "rating": "5", 
            "review": "Pure Saint Petersburg! . It is extremely beautiful and many heritage buildings like winter palace and Alexander Column are there."
        }, 
        {
            "index": 148, 
            "rating": "5", 
            "review": "Great Location. This is a great place to get a glimpse of the city. Great views, traffic and people. This was the first place I went when I left my hotel. Get your bearings on the area and plan a nice walk along the river."
        }, 
        {
            "index": 149, 
            "rating": "5", 
            "review": "It's a main bridge in the city. I would call it an entrance to the palace square. The best time to visit an watch how it opens - is in white nights time."
        }, 
        {
            "index": 150, 
            "rating": "4", 
            "review": "A nice bridge surrounded by onion shapped domed buildings.. We were in Russia during the summer and while standing on the bridge, we saw many couples getting married. Very picturesque and charming. If the opportunity came up again I would go."
        }, 
        {
            "index": 151, 
            "rating": "4", 
            "review": "It's the view you get, not the bridge itselk. Yes, it's a bridge, a nice one, but you need to walk out and then look back along the Neva River. The view from the bridge in all directions Is quite something special, and if you are lucky to be there news or at sunset you are in for even nicer view down the river.When I visit the city, this is always one of my stops to enjoy.Recommended."
        }, 
        {
            "index": 152, 
            "rating": "5", 
            "review": "Palace bridge. took a walk in freezing cold night, but it was worth it. new illumination makes it a lovely object for taking pictures and with millions of lights on Neva embankment it is just a stunning view..."
        }, 
        {
            "index": 153, 
            "rating": "1", 
            "review": "Shouldn't be this high on the list. It's just a bridge. Yes, if you walk it, you get a spectacular view of the city's most important landmarks such as the Hermitage, the Strelka, the Kunstkamera etc. but in the Winter it's just plain dirty and you don't get the summer romance of staying up late to see drawbridges going up. So all the good reviews should be attributed to the actual sights you see from it, not the bridge itself"
        }, 
        {
            "index": 154, 
            "rating": "5", 
            "review": "Old classic bridge.. This bridge takes you straight to the winter palace. It opens at night to let boats go through. If you travel to St Petersburg during May-June, stay at night (which is more like a day) to watch the bridges open. It's fun!"
        }, 
        {
            "index": 155, 
            "rating": "5", 
            "review": "A milestone for a true Petersburg-ian. Being a St. Petersburg native and having grown up on Vasilievsky island, nothing represents my youth better than Palace Bridge. Not only it separates the city center from the island, University and Kunstkamera but it plays a huge role in lives of those living on that tiny island by the sea. During the summer navigation period, it is open each night, making it impossible to get from one part of the city of another. To me, it depicts perfectly the old St. Petersburg, during the summer times, when you spend you night walking outside in between the cathedrals and parks waiting to cross over. The architecture of the bridge is beautiful, too and you get a nice view on the Fortress of Peter and Paul."
        }, 
        {
            "index": 156, 
            "rating": "5", 
            "review": "Night visit is the best. This brigde is best appreciated during night boat trip, especially when it opens together with other bridges."
        }, 
        {
            "index": 157, 
            "rating": "3", 
            "review": "The not-very-palatial bridge. Completed only in 1916, 15 years after the competition that took 8 years to choose the winning designer, this was the first bridge to break Peter the Great’s embargo on building bridges over the Neva in the city he had created. It joins Palace Square with the historic area of Vasilevsky Ostrov. Comprising 5 cast-iron spans resting on granite pillars, and sitting very low above the water, it presents a fairly functional appearance that to some extent contrasts with its opulent surroundings, although a certain amount of decorative work in the form of iron railings, lamp-posts, monumental lions’ heads and pavilions were added only just before the onset of WWll. I did not manage to see the central span open for the passage of boats ------ an event that is said to frame the glorious cathedral of St. Peter and St. Paul between its two halves that rise to an angle of 45 degrees. It certainly makes a major contribution to the flow of traffic in this city without disrupting navigation by river, and is a dramatic sight although neither truly beautiful or memorable."
        }, 
        {
            "index": 158, 
            "rating": "4", 
            "review": "White nights gathering. Come here in June during the White Nights and at around midnight/1am, people gather to watch the bridges rise whilst it's pretty much still daylight. Just don't get stuck on the wrong side of the bridge as they don't come down again till 5am!"
        }, 
        {
            "index": 159, 
            "rating": "5", 
            "review": "It's an entrance to Palace Square. For me is a No1 amoung of the all bridges in St-Petersburg. It's an entrance to the main square - Palace Square. I think it is a part of the Square museum complex including Genshtag building, Hermitage, Alexander's Column."
        }, 
        {
            "index": 160, 
            "rating": "5", 
            "review": "beautiful day and night. a very very good place to be. to see the neva river, to see the other reigons of the city, to see the Peter's castle. and make sure to visit the bridge during the white nights to see it open."
        }, 
        {
            "index": 161, 
            "rating": "4", 
            "review": "Another must see in St Petersburg. If you get the time and are lucky enough, you can watch the bridge in action. Quite amazing, never thought I would be that interested in seeing a bridge open up....but I was. As were many other people watching on."
        }, 
        {
            "index": 162, 
            "rating": "5", 
            "review": "Beautiful view. Greta view and architecture of the bridge. A wonderful historical place of the city and famous place for tourist."
        }, 
        {
            "index": 163, 
            "rating": "5", 
            "review": "Great to watch in action!. This bridge is a staple of St.Petersburg and very amusing to watch when in action. I was lucky enough to be able to watch in on a boat tour and it made for a great end of a day."
        }, 
        {
            "index": 164, 
            "rating": "5", 
            "review": "Our family vacation with celebrity constellation to St. Petersburg. Must see this place is majestic spill blood church, peters of & Pushkin palaces as well as Cathrines palace and fountain gardens just return 8.25.14"
        }, 
        {
            "index": 165, 
            "rating": "4", 
            "review": "Free and beatiful!!. Every night they open bridges across the Neva river. It is really romantic place to be when that happens. Friends and couples gather there to watch how it all happens with a bottle of champange. Extremely nice happening with a good company! And hey, its free!"
        }, 
        {
            "index": 166, 
            "rating": "5", 
            "review": "Good hotel, good value. Russia can be expensive. This is an extremely nice hotel, deserving of its 5-star ranking. The rooms were fabulous! The fod is good and it has a nice health spa. The Palace Bridge is not in the heart of the tourist area of St. Petersburg, but the Hermitage and other attractions are an easy walk. The best part is that I had a rate that one might pay for a three or four-star hotel. I would come back and I certainly would recommend it to others."
        }, 
        {
            "index": 167, 
            "rating": "4", 
            "review": "a Sight at Night. We went to see the drawing of this bridge at night, at around 1:30AM both sides of the bridge go up, it's a fun and beautiful experience. Stay a bit to see the barges go through the opening when the bridge is drawn. Remember to watch it from the correct side of the Neva river, or you'll have to spend the night on the wrong side. ;)"
        }, 
        {
            "index": 168, 
            "rating": "5", 
            "review": "Great experience . It was a very good and great experience to see this bridge opened at 1:30 am and it was still light there , There is also another bridges open befor and after that you can watch it from there"
        }, 
        {
            "index": 169, 
            "rating": "4", 
            "review": "Great night experience.. The Palace Bridge across the Neva River Saint Petersburg is a truly beautiful Bridge. Excellent photo opportunity late at night when the bridge is open. The river is full of tourist boats all waiting for this spectacular bridge to open its wings. I think it is a must to see when you visit Saint Petersburg even when it is cold."
        }, 
        {
            "index": 170, 
            "rating": "5", 
            "review": "Nice walk across the bridge. We visited aurora ship and walk back to our hotel a cross the bridge, nice walk, nice view not far from winter palace."
        }, 
        {
            "index": 171, 
            "rating": "3", 
            "review": "Palace Bridge. Perhaps we are just jaded travelers. We have been blessed to travel widely and it is not a bridge on the Seine in Paris."
        }, 
        {
            "index": 172, 
            "rating": "4", 
            "review": "Truly a beautiful sight. We saw the bridge during a late night boat tour when all the drawbridges are raised. The bridge is beautifully lit and indeed frames beautiful buildings in the background."
        }, 
        {
            "index": 173, 
            "rating": "5", 
            "review": "Try it at 3 AM in the summer. Watch the barges go by as the bridge is drawn open, it's a spectacular site. Best viewed by boat underneath at night. Has a sidewalk to be able to walk in the daytime."
        }, 
        {
            "index": 174, 
            "rating": "5", 
            "review": "Great place to observe when it is raised. This year it is raised about 01:15 AM. Come to watch from Neva shores or take one of many water tours to observe from closer distance. This is huge happening during White Nights season."
        }, 
        {
            "index": 175, 
            "rating": "4", 
            "review": "Good lunch buffet, higly recommended. Much different foor to choose from, both cold and warm, and high quality."
        }, 
        {
            "index": 176, 
            "rating": "5", 
            "review": "Imrepssive view from the water. Have visited St. Petersburg in June 2012 and took the night city tour (which included the boat trip to see all the bridges opening) - definitely a MUST, when in St. Petersburg and the weather permits"
        }
    ]
}