{
    "category": "St-Petersburg", 
    "entity": "Kazan-Cathedral", 
    "avg_rating_stars": 4.398625429553265, 
    "review_count": 582, 
    "rating_stats": {
        "poor": 8, 
        "average": 57, 
        "terrible": 1, 
        "very_good": 208, 
        "excellent": 308
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "4", 
            "review": "Free entrance. Went to visit the Cathedral while waiting for my family. Entrance is free of charge, and I felt a good atmosphere inside. Lots of candles and despite long queue to kiss the icons, it was quite inside and you could sit and do you prayers."
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "Attend the Service at 6pm. Its a beautiful Cathedral and a little busy one too. We were told that the service takes place twice a day.. One at 6pm daily and its surely a right time to visit the Cathedral.\nThere two desks selling souvenirs within the Cathedral and they seemed better priced than those outside."
        }, 
        {
            "index": 3, 
            "rating": "4", 
            "review": "Get there in the morning. Kazan is gorgeous. But, it's even better when there aren't people, vendors, and tour buses obstructing your view. The cathedral is situated pretty close to the Spilt Blood Church and really within walking distance of the Winter Palace and the waterway. I suggest getting up early and getting out there within an hour after sunrise. It's really worth it to capture the cathedral in all it's glory!"
        }, 
        {
            "index": 4, 
            "rating": "3", 
            "review": "Icon Cathedral. Lots of icons here and lots of people queuing up to kiss them and pray. Beautiful paintings, but not as nice as St Isaac for me. However, worth a visit on your itinerary"
        }, 
        {
            "index": 5, 
            "rating": "4", 
            "review": "Right on Nevsky Prospekt. Kazan Cathedral is situated on Nevsky Prospekt, across the street from the Singer house and close to the Bank Bridge with beautiful winged lions.The colonnade to both sides of the entrance is impressive and reminds of St. Peter's basilica in Rome."
        }, 
        {
            "index": 6, 
            "rating": "3", 
            "review": "Nice. It is on the Nevsky Prospekt street so it is easy to find. The cathedral is quite huge. The location is near to the Church of the Savior on Spilled Blood which you can clearly see from the opposite side."
        }, 
        {
            "index": 7, 
            "rating": "5", 
            "review": "Mason cathedral, Kutuzov burial place, worth the visit. After seeing the Church of our Savior on Spilled Blood, we continued up - having the canal on our right - and ended in front of the wonder. Reminds me of the Karlskirche in Vienna for it's Masonic symbols and numerous exterior and interior columns. My recommendation is to see it during day time. The entrance into the church is free of charge.If you have some interest in Masonic symbols and architecture, look above the front main entrance, and have a walk around the cathedral before going inside. The inside also hosts, apart from the eye of providence above the altar, the burial tomb of Field Marshal Kutuzov, an 18th-19th century hero for the Russian Empire - think about how Napoleon lost in Russia to get the idea.Absolutely worth a visit, inside and out."
        }, 
        {
            "index": 8, 
            "rating": "5", 
            "review": "A suprise service. As an independant tourist I was informed that there was some type of worship at 5 pm on a Sunday. I was keen to hear some singing. I travelled by bus from my hotel. ON arrival there was a fascinating type of wedding ceremony with accompanying choral music. The couple being blessed seem to have three children so it was a little difficult to determine what exactly was the ceremony that was takinig place. Anyhow a memorable visit."
        }, 
        {
            "index": 9, 
            "rating": "5", 
            "review": "Imposing religious monument.. Huge imposing building which bears testament to religous beliefs.Visit when a service is being held for amazing experience."
        }, 
        {
            "index": 10, 
            "rating": "4", 
            "review": "Beautiful church. It is a massive church with active service. We were impressed by the paintings on the roof and the huge pillars"
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "Our Lady of Kazan. Kazan Cathedral alongside Nevsky Prospekt at Griboyedov Canal has several names: Kazanskiy Kafedralniy Sobor (in Russian language, Каза́нский кафедра́льный собо́р), or Cathedral of Our Lady of Kazan. A rose by any other name… This is a cathedral of the Russian Orthodox Church, meaning there are no pews. Worshipers must stand during services. Construction began in 1801 and continued for 10 years, completed just before Napoleon invaded Russia’s capital at the time (St Pete). Mikhail Kutuzov was Russia’s commander-in-chief and prevailed over Napoleon. Kutuzov is interred in the cathedral in 1813, two years after the cathedral’s consecration. Architect Andrey Voronikhin modelled the Empire Style design after St Peter Basilica in Rome. The distinctive semicircular colonnade caught my attention when walking along Nevsky Prospekt. The interior has numerous columns, which echoes the exterior colonnade and seems inspired by a palatial hall, towering 70 meters long and 62 meters high. There are oodles of sculptures and religious icons from the early 1800s, and a gilded iron grille separating the small square behind is exquisite."
        }, 
        {
            "index": 12, 
            "rating": "3", 
            "review": "Still functional. This is still a functional worship place. it is not as beautiful or preserved as St Isaacs cathedral, but it worths a visit for the architecture and the ongoing action."
        }, 
        {
            "index": 13, 
            "rating": "5", 
            "review": "Momentous from the outside and gorgeous inside. A marvel of architecture and a work of art. The icons and arts will inspire anyone regardless of their faith. I found it beautiful and inspiring. Many visitors are praying and that is also nice to see."
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "Architecture and the spirituality. This is a truly amazing building. It is not your traditional Russian Orthodox Church. It is a classical building yet full of Russian Orthodox icons.It is a wonderful living place - just to sit and appreciate the devotion of so many people."
        }, 
        {
            "index": 15, 
            "rating": "4", 
            "review": "Another nice tourist spot.. This is also close to the Lions Gate Bridge and the Church of the Spilled Blood. It is also across the Singer Building"
        }, 
        {
            "index": 16, 
            "rating": "5", 
            "review": "Breath taking.. Sooo beautiful... we visited on a Sunday so we had the opportunity to participate to the Holy ceremony. Breath taking church. Breath taking experience. You can feel the holiness of the place. No entry fees are required. There are few souvenir shops for church items.Amazing church."
        }, 
        {
            "index": 17, 
            "rating": "4", 
            "review": "A living church. We enjoyed being able to share the experience of this extraordinary cathedral with local attending confession"
        }, 
        {
            "index": 18, 
            "rating": "5", 
            "review": "Beautiful!. Definitely worht it! The cafe Singer in front of the cathedral is an excellent spot to sit and have a coffee while enjoyning the view with this beautiful cathedral"
        }, 
        {
            "index": 19, 
            "rating": "4", 
            "review": "Very elaborate interior. With the gardens and fountain outside Kazan Cathedral is in a perfect setting and when you go inside you will not be disappointed. It is beautiful and highly decorated and free to get in. Well worth a look."
        }, 
        {
            "index": 20, 
            "rating": "5", 
            "review": "Beautiful. I felt that I just visited some place that was very holy, wonderfully decorated as all Russian churches are"
        }, 
        {
            "index": 21, 
            "rating": "4", 
            "review": "Good. In nevsky street you will find every where you should visit.it is located there.and you can enjoy watching the building"
        }, 
        {
            "index": 22, 
            "rating": "4", 
            "review": "nevsky prospekt. very impressive facade and interiors, easy to get to, near gostiny dvor, easy access from metro station"
        }, 
        {
            "index": 23, 
            "rating": "5", 
            "review": "Is a must!. Impressive orthodox cathedral at the very heart of St. Petersburg. Unusual architecture, Kutuzov's tomb along with french castles keys and other trophies which became a part of the Russian history."
        }, 
        {
            "index": 24, 
            "rating": "4", 
            "review": "Another architectural gem!. In a historic city full of impressive architecture and design Kazan Cathedral is another stand out building. I barely had much time to see anything in full detail, but I definitely noticed this as we drove by and later stopped quickly for some photos on my tour. Very nice and worthy of a bit of your time in the city. Enjoy."
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "A peaceful visit . The minute you enter you just sense the peacefulness this church brings. No picture taking is allowed here just absorb the ambience. Open confession you can see how the Russians do their confessions. With a priest, bible and rosary."
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "Beautiful Roman Style. Felt more like a Roman temple than a church given the architecture. The area around the church is worth a visit in and of itself. The inside offers a stunning display of Russian Orthodox icons and decorations, and Roman Style frescoes depicting biblical events. If your seeking a destination that fills your urge to bathe in the atmosphere of the 19th century in Russia, you absolutely must visit this extraordinary cathedral. *free entry as well"
        }, 
        {
            "index": 27, 
            "rating": "5", 
            "review": "Very nice Cathedral. Kazan Cathedral is very nice and impressive. The Cathedral is located on Nevsky Prospect so you can't miss it."
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "A very meaningful place for Christians. A very gorgeous cathedral, it is free and is used for religious services so the dress code matters and no pictures allowed inside. It has a very important religious icon so this place is visited by Christians from different countries, there is normally a long line to the icon inside."
        }, 
        {
            "index": 29, 
            "rating": "4", 
            "review": "Beautiful Cathedral. This cathedral is located just along the Nevsky Prospect , it is surrounded by a nice garden but what is capturing your attention is the huge colonnade which seems to hug what is all around. Inside there are beautiful frescos, religious icons and rich chandeliers and all of them are enriched by gold and precious gems. What is a real beauty is the magnificent portal finely decorated and full of gem which can give you the real measurement of an Orthodox Church."
        }, 
        {
            "index": 30, 
            "rating": "4", 
            "review": "Very impressive!!!. Occasionally we attended a pray. It was real spectacle.. Staying there, I was thinking where were all these people just 15 years ago in Soviet period???"
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "Huge, beautiful and impressive!. This is an orthodox church of amazing scale and beauty. It is an active church so you will be surrounded by tourists but mainly worshipers. You really should see it!"
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "One of the main monuments of the city. Close to ths gostiny dvor and a must visit for a first time visitor of the city. For non chrisitans it takes just a few minutes to visit this cathedral."
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "Greek Architecture. The cathedral has Greek Architecture outside. It is a functioning Cathedral and the interiors provide an atmosphere to open your hearts in prayer. A must see when in St. Petersburg"
        }, 
        {
            "index": 34, 
            "rating": "5", 
            "review": "The Church.. Working church which is open daily gathering a lot of religious people. In the same time architect monument gathering a lot of tourists. Very beautiful inside and magnificent outside. Must see."
        }, 
        {
            "index": 35, 
            "rating": "4", 
            "review": "Worth seeing for the icon of Our Lady of Kazan. Even though it looks massive from the outside and lots of people were inside, there was a respectful hush and serenity so it was a much more peaceful experience than I expected. It's an active church so there was no fee for entrance but you could buy candles to light. There was a big queue to pay respects to the Our Lady of Kazan icon. Women generally cover their heads as a mark of respect."
        }, 
        {
            "index": 36, 
            "rating": "3", 
            "review": "Nice Landmark . The Kazan Cathedral with its extended arms toward the Nevsky Avenue is a very impressive sight. However when it come to photograph the site, it is almost impossible due to its size and limited space. During the morning hours, the sun make it even more awkward to take any snap shot. The interior of the cathedral is different. The local come to pay respect and worship in the cathedral. With photograph is allow in a discreet way, wonderful photos can be taken. Spend most time inside instead of outside."
        }, 
        {
            "index": 37, 
            "rating": "5", 
            "review": "I left my heart there.. Went to Russia with a tour group, however as I am Russian Orthodox I left the hotel we were staying at early each morning to attend Divine Liturgy. My fellow worshippers helped me as much as they could with the language barrier, providing me with a translator for confession. I was made to feel welcome and it was the best start one could have to the day."
        }, 
        {
            "index": 38, 
            "rating": "4", 
            "review": "Big stone big building. Enjoy this cathedral from the street. Cross away is the bleeding church and the bridge walking area. I hear that there is a lion statue behind the cathedral that you touch the feet gonna bring you prospherity. Well worth to try . Fortune calling"
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "Interesting to see. One of the oldest church. If you are careful, you can find on the walls the keys of French city that Russians brought back after the defeat of Napoleon."
        }, 
        {
            "index": 40, 
            "rating": "5", 
            "review": "Beautiful Cathedral . This is a working cathedral so no flashes and noise should be kept to a minimal. The place is huge and so beautiful inside. It felt very peaceful and serene. "
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "Kazan Cathedral...St Petersburg. The cathedral looks enormous with its semi circular wide expanse of 96 columns. Because the altar of an orthodox church is supposed to face east, the cathedral 'entrance' from Nevsky Prospekt is actually the back of the church. As with the other churches, it is striking to me to see that there are no seats. It is considered rude to sit in the presence of God. This is particularly interesting as religion was forbidden during most of the communist years. So many generations have grown up with no religious leanings, much less teachings. With no pews however, it is easier to get a feel for the layout of the church and to appreciate the beautiful mosaic floors and the opulent frescoes on the walls and ceilings. The cathedral since 1991 is currently used for religious purposes, but in the past as with all Russian cathedrals, it was repurposed as the times were changing and there was no need for religious buildings.Women should wear a hat or a scarf over their hair."
        }, 
        {
            "index": 42, 
            "rating": "5", 
            "review": "Mini st pauls cathedral . On the Nevsky prospect looking spectacular in the middle of the shopping streets, didn't go in as very busy but beautiful in its own right."
        }, 
        {
            "index": 43, 
            "rating": "4", 
            "review": "Nice...although not that spectacular. This is a nice cathedral, although not as impressive as others you will find in St Petersburg. It's a bit dark and the entrance is free since it is a worship place.Very nice altar."
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "Excellent icons. Beautiful Cathedral. Wonderful to see so many people at prayer. and lighting candles and enjoying the Cathedral. Icons were beautiful and we took our time walking around looking at them. Really worth a visit."
        }, 
        {
            "index": 45, 
            "rating": "5", 
            "review": "A great cathedral. For me, this was a \"true\" cathedral with people praying and taking comfort from the icons located in the church. The icons on the walls were the most \"contemporary\" for me. I just loved the place and recommend it."
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "Interesting. You can see people queing for a private praying at an icon. The church is beatiful, and somewhat gives an \"exotic\" impression. Highly recommended."
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "love it. another magical place at St peter, spare 2 hours to check most of it, such a wonderful place as a must see in the city.Enjoy it"
        }, 
        {
            "index": 48, 
            "rating": "4", 
            "review": "Impressive. Great interior, classic Russian style. Luckily we visited the interior when the religious cult was ongoing, quite impressive. A must in Saint Petersburg. Pictures can't be taken in the interior. Free visit."
        }, 
        {
            "index": 49, 
            "rating": "1", 
            "review": "You're part of a Tour, you're ok, not on your own in this place.. Entered this church attracted by the \"sacra music\" from the street while passing by. As I entered the recint, noticed the signs \"no photography\", so, I acknowledged. Once inside the first thing I noticed was people taking videos and photos with flash!. Those people were parts of several tours. Observing that, I pulled my iPhone and started recording. Immediately I got a bunch of babushkas, and a man, pushing me, shoving and screaming at me; they kicked me out of that place.Basically, religion is not the issue, it is money; you are paying for a tour, you take all the video and pics you want. You're on your own?, watch out for those religious freaks.Not very nice people.Later on I entered another church, and I recorded all I wanted of video, no issues."
        }, 
        {
            "index": 50, 
            "rating": "4", 
            "review": "Religious and peaceful place. I'm not a religious people, but once I've walked in, I could feel that strong power of p3 ace. Inside was terribly quiet, many religious people came and standed in a queue to wait for praying. They sold some religious books and accessories inside. Photos are allowed and free."
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "Beautiful place of worship. The Kazan Cathedral is an active place of worship and female visitors are advised to take a scarf to cover their heads, whilst male visitors should remove their hats. It is an excellent place to visit."
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "Beautiful Cathedral. An other beautiful piece of architecture in the heart of Saint Petersburg. Unlike the Saint Isaak's Catherdal and The Church of Our Savior on the Spilled Blood, Kazan Cathedral is a functional Orthodox church. Very beautiful inside with the crystal columns at the altar."
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "Definitely worth a 'drop in' while on Nevsky. This is a very impressive cathedral containing countless beautiful mosaics. We were fortunate to view a religious ceremony, which provided an authentic experience. It's definitely worth a 'drop in' while on Nevsky."
        }, 
        {
            "index": 54, 
            "rating": "5", 
            "review": "Just awesome. Kazan Cathedral is just one of many places of interest in St. Petersburg. The interior is mesmerizing with old iconic pictures ."
        }, 
        {
            "index": 55, 
            "rating": "5", 
            "review": "Beautiful Sunset over the Kazan. I caught the sunset here and it was stunning. The grass areas are a nice place to sit on a sunny day and take in the City. Right by the main street with a lot happening."
        }, 
        {
            "index": 56, 
            "rating": "2", 
            "review": "Not interesting. We visited the church at 8/16. We like the garden in the yard. Nice stop. But inside we didnt find anything interesting."
        }, 
        {
            "index": 57, 
            "rating": "5", 
            "review": "Functioning Cathedral at Nevsky Prospekt. While perhaps not as spectacular as Our Saviour on the Spilled Blood or St Isaac's (how spoiled we can get after those!), Kazan is an impressive cathedral with a unique neoclassical columned promenade at its north side (facing Nevsky). This is a functional Christian orthodox cathedral so be sure to remain respectful and quiet (no photography permitted) while there. Whatever your orientation, slender beeswax candles can be purchased and placed in one of the many votive stands for your prayer of thanks for your spectacular STPB vacation, to the God of your choosing."
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "One of the Five must sees in St Petersburg. With Catherine's Palace, Peterhof, Spilled Blood and St Issacs this is one of my five must sees in St Petersburg. Be ready to be overwhelmed in this city."
        }, 
        {
            "index": 59, 
            "rating": "4", 
            "review": "Massive building. Massive building having huge pillars flanking the cathedral. Inside is a small though much revered icon of Mother Mary. It was dimly lit inside."
        }, 
        {
            "index": 60, 
            "rating": "4", 
            "review": "Huge but a bit gloomy. Definitely worth a visit just for its size alone. It's a bit gloomier than other churches but interesting as part of the whole picture of St. Petersburg."
        }, 
        {
            "index": 61, 
            "rating": "4", 
            "review": "Little Vatican. Little Vatican and a remarkable landmark. The best viewe is from the first floor of the Dom Knigi, opposite of the street. It is a cafe so enjoy a coffee and a view."
        }, 
        {
            "index": 62, 
            "rating": "4", 
            "review": "Very beautiful cathedral. Been there at 8:30 am and it was open. Good start for a visiting day as almost all other monuments of St. Petersburg only open after 10:30 am."
        }, 
        {
            "index": 63, 
            "rating": "4", 
            "review": "Free and near the subway Nevsky Prospect. Inside the church in small it's the outside that impresses the tourist. Enter, see and go on to the next attraction."
        }, 
        {
            "index": 64, 
            "rating": "4", 
            "review": "Great place to visit!. It's a nice place to visit when you're in the city centre. I just dislike a small fence around this building."
        }, 
        {
            "index": 65, 
            "rating": "3", 
            "review": "Yet another church, but worth stopping into.. We were lucky enough to go twice - once two years ago and once on the Orthodox version of Easter Sunday. Whilst there we saw a ceremony taking place and that really WAS worth seeing. If you go at any other time its a nice, big, impressive church - just like the thousands of others in the world. Its infamy means that you should probably stop by nonetheless just to tick the box. Fortunately you are almost certain to walk past it during you time in St Petes so take the 15 mins required. Ladies will have to cover up a bit. If you happen to be religious then you may get a bit more from the experience, but either way you can make this really worth you time by going when there is a service on."
        }, 
        {
            "index": 66, 
            "rating": "5", 
            "review": "Great Building. Did a private tour to see this. Did not get inside but really wanted to see the outside. Worth a look."
        }, 
        {
            "index": 67, 
            "rating": "4", 
            "review": "Holy place - must see. We went to the church on a rainy day. No entrance fees is required and inside u cannot take pictures. Great place for prayer and grandiose structure. No loud speaking inside. Love it and recommend visiting."
        }, 
        {
            "index": 68, 
            "rating": "4", 
            "review": "The exterior draws you to it. Unique architecture prompts one to stop and look. This Cathedral is home to one of the most important icons to Russians/ in Russian history. Did not visit the interior."
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "Wonderful Orthodox Church. A wonderful orthodox church. Notre-Dame-de-Kazan it's on the Boulevard Nevsky. Please note that taking pictures are forbidden."
        }, 
        {
            "index": 70, 
            "rating": "4", 
            "review": "Beautiful church. An actual house of worship, so be respectful if you want to venture inside to see the beautiful architecture and decor - no photos. A place of peace and reflection."
        }, 
        {
            "index": 71, 
            "rating": "5", 
            "review": "Free to enter. It is stuffed full of icons and beautiful paintings but very busy. Its hard to manoeuvre around but well worth going in. We were lucky enough to be tyere when a choir was singing too."
        }, 
        {
            "index": 72, 
            "rating": "4", 
            "review": "It was returned to Russian Orthodox Church. The Kazan Cathedral was an 'Atheism and Religion' museum in the times of the Soviet Union. I remember when I went there with my classmates looking at stands of photographs telling about atheism and religion in USSR. Later the Kazan Cathedral was returned to Russian Orthodox Church and there services are held. Especially beautiful service takes place on Easter night.The Kazan Cathedral was built by architect Voronikhin and reminds small copy of the St.Peter Catedral in Rome. A beautiful fluted colonnade decorates its facade."
        }, 
        {
            "index": 73, 
            "rating": "4", 
            "review": "Historic Cathedral Now A Living Church Again. It would be hard to miss Kazan Cathedral as it sits dramatically on Nevsky Prospect in St. Petersburg near the center of just about everything.The Cathedral itself was built at the beginning of the 1800s, but was turned into a memorial to the Russian victory over Napoleon after1812. There is a statue of Mikhail Kutuzov, the Russian general who orchestrated that victory, out front, and his remains are interred inside.The exterior is dramatic and was modelled after St. Peter's Basilica in Rome. While large, the neoclassical interior isn't quite as impressive as those in nearby St. Isaac's Cathedral or the Church of the Savior on Spilled Blood.The cathedral was closed with the Communist revolution in 1917 and later converted, oddly enough, into a \"Museum of Atheism\" that was viewed with embarassment even at the time. It has now been returned to the Russian Orthodox Church. A couple of notes: First, this is now a living church, so you'll need to respect the worshipers and many areas are inaccessible during service times. They also expect women to wear scarves over their heads, although we saw many who did not.Second, the area around the cathedral is fine, but a few blocks to the west there is an area we were warned by locals to avoid.This impressive cathedral is easy to visit and free. It's definitely worth your time to come here while in St. Petersburg."
        }, 
        {
            "index": 74, 
            "rating": "5", 
            "review": "Imressive. This cathedral is impressive in its size and the that interior features numerous sculptures and icons created by the best Russian artists of the day."
        }, 
        {
            "index": 75, 
            "rating": "5", 
            "review": "St. Peter's Rome Look Alike!. If you travel down Nevsky Prospekt, you cannot fail to notice the impressive Cathedral of Our Lady of Kazan. The Kazan Cathedral looks very similar to the Basilica of St. Peter’s in Rome. It was built in 1801 by the Russian architect Andrei Voronikhin. Although closed for services during most of the Soviet era, the cathedral is open today and is a wonderful example of a working Russian Orthodox Church. It has an impressive stone colonnade, encircling a small garden and central fountain. It was intended to be the country's main Orthodox Church. After the war of 1812 (during which Napoleon was defeated) the church became a monument to Russian victory. Captured enemy banners were put in the cathedral and the famous Russian Field Marshal Mikhail Kutuzov, who won the most important campaign of 1812, was buried inside the church. Open Monday-Friday: 8:30 a.m.-8:00 p.m. - Saturday & Sunday: 6:30 a.m.-8:00 p.m. Admission: Free – Women should cover their hair with a scarf, hat or hood while inside the Kazan Cathedral."
        }, 
        {
            "index": 76, 
            "rating": "4", 
            "review": "Big and impressive . The line was long. Many people tried to enter but the view inside was worthwhile. It's part of Russian history. And an important part so make en effort to enter and be impressed"
        }, 
        {
            "index": 77, 
            "rating": "4", 
            "review": "True House of Worship. This house of worship is a Russian Orthodox Church on the Nevsky Prospekt in Saint Petersburg. It is dedicated to Our Lady of Kazan, probably the most venerated icon in Russia. During our visit there were numerous individuals praying, worshipping and in a queue to touch and pray at the relic of Holy Mother of Kazan. The exterior actually looks like a building of Parliament but the interior contains beautiful religious adornments."
        }, 
        {
            "index": 78, 
            "rating": "4", 
            "review": "A real place of worship - not a museum. We visited this cathedral as part of a tour with the Church on Spilled Blood and St Isaac's cathedral. This one is a full-time working church and whilst not nearly as opulent as the other two churches it had a much more spiritual feeling. There were queues of the faithful visiting a shrine of the Holy Mother of Kazan and Russian Orthodox nuns were in evidence. Whilst not as impressive architecturally, this was for me the most interesting in showing the revival of Russian Orthodox religion after the Soviet era. It was modelled on St Peter's in Rome.Some visitors did not seem to honour the fact that this is a living church - knees and shoulders should be covered but not everyone abided by this simple rule of respect. Photography is not allowed."
        }, 
        {
            "index": 79, 
            "rating": "5", 
            "review": "Kazan Cathedral. A very very busy place, not as stunning as other Cathedrals, it is a working Cathedral so plenty people praying and touching different areas within."
        }, 
        {
            "index": 80, 
            "rating": "3", 
            "review": "Interesting Architecture in a Functioning Church. A Russian Orthodox Church with a flavor of Rome, namely St. Peters. The architecture on the outside is frankly more interesting than the interior, although it was unique to see worshipers praying while visitors were gazing around. Admision is free, I would rate this place as much less important than the other major churches."
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "Interesting building. Nice architecture.It is Orthodox, but from outside reminds a little on St.Peter Basilica in Rome. Worth entering."
        }, 
        {
            "index": 82, 
            "rating": "5", 
            "review": "Nice cathedral. It is nice, but a pity they do not let taking pictures. It is full of observant people, and it is free of charge."
        }, 
        {
            "index": 83, 
            "rating": "4", 
            "review": "A living place of worship. It was pouring rain when we visited so it was good to get inside. Unlike most Russian cathedrals, this one is no longer a museum, but is once again a living place of worship. Hence, entry is free, and photography forbidden. As a matter of courtesy, women should wear a head scarf and men remove your hats.More austere interior than most other churches with large pillars and icons rather than paintings and mosaics. Very atmospheric."
        }, 
        {
            "index": 84, 
            "rating": "5", 
            "review": "You simply have no reason not to visit Kazan Cathedral. The Kazan Cathedral is on your way from Nevsky prospekt, it is free to enter because it is an operating church and interior is beautiful. Don't miss this place because the icon of Holy Mother of Kazan is on display there."
        }, 
        {
            "index": 85, 
            "rating": "4", 
            "review": "Good for Photographs. Nice cathedral, visited during my city tour. Spent 30 minutes which is more than enough. Good for taking photos and roam around."
        }, 
        {
            "index": 86, 
            "rating": "4", 
            "review": "Lovely working cathedral, and very different to the usual Orthodox over the top explosion in a paint shop!. This is on the main drag, Nevsky Prospekt. The first thing that struck me is how this building looks like St. Peter’s in Rome. And when you read the blurb, it did in fact follow the design of St Peters. It was free to enter, and is well worth a peek inside.Be respectful, this is a working cathedral and although it is not so over-the-top compared to the typical religious monuments of Russia (in fact it is comparatively dull), it has its own inner peace with queues of worshippers taking communion and lighting candles when we were there. I am not a religious person (brought up a protestant, converted to Islam, and am a confirmed atheist), but I am fascinated by the seductive emotive power of religion – and this place absolutely oozes it. Lovely feeling !"
        }, 
        {
            "index": 87, 
            "rating": "4", 
            "review": "Majestic. The church is big, high and long. Let's say that's just Russian proportions. The church is free and it was full of locals praying there,so try to be respectful and quiet while walking around. It's definitely a good stop to do in the Nevsky Prospekt."
        }, 
        {
            "index": 88, 
            "rating": "5", 
            "review": "An insight into religion. The exterior is imposing. The interior is quite dark and restrained, with the focus being the eponymous icon. For War and Peace fans, it is the site of Kutuzov's burial and there is a statue of him outside in some pleasant gardens."
        }, 
        {
            "index": 89, 
            "rating": "5", 
            "review": "Stunning, and so easy to visit.. Right on Nevsky Prospekt this is a church you must visit. Unlike many other churches in SPB this is not a museum. Here you will see stunning icons and if you are as lucky as I was you will get a taste of the acoustics when the choir accompanies the service."
        }, 
        {
            "index": 90, 
            "rating": "4", 
            "review": "Colonnade Inspired by St. Peter's. We had some extra time before The Hermitage opened so stopped by this Cathedral during a morning service. It was not as ornate as Church of Spilled Blood, but was a handsome church. This was also the 'birthday' of the icon for the church, so it was a special time. We were able to see the doors at the altar opened."
        }, 
        {
            "index": 91, 
            "rating": "5", 
            "review": "Beautiful. This is one of the functioning churches in St.Peterburg, very beautiful baroque church, no admission fee."
        }, 
        {
            "index": 92, 
            "rating": "5", 
            "review": "Nice for stopping and exploring. Really good place to stop on the schedule of exploring St. Petersburg. A lot of history inside as well as some seating outside to have a rest."
        }, 
        {
            "index": 93, 
            "rating": "4", 
            "review": "Landmark just at the Nevsky prospect!. Another icon of the orthodox architecture!\nWomen have to cover their hair, so take this into account."
        }, 
        {
            "index": 94, 
            "rating": "4", 
            "review": "Nice Place. the cathedral is real huge and look like big castle\nthe interior designs and icons are from 14's century ."
        }, 
        {
            "index": 95, 
            "rating": "5", 
            "review": "Must go . If you go to St Petersburg and don't here you're crazy. Amazing inside and out. Could spend all day there. The specticle is incredible. A must see."
        }, 
        {
            "index": 96, 
            "rating": "5", 
            "review": "A beautiful cathedral. One of the most beautiful cathedrals in Russia. To appreciate the true beauty of the cathedral, you should attend on a Sunday morning when you can see a service."
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "Still in Use, be respectful. As we were entering my wife was having difficulty with her head scarf (always cover in churches,and men a note here, as in Europe only children and tourists wear shorts) and a Sweet babushka swooped in and assisted her, commenting pleasantly in Russian something or other. We noticed that all these churches and Cathedrals are still used by observant orthodox, young and old alike"
        }, 
        {
            "index": 98, 
            "rating": "4", 
            "review": "Beautiful inside - worth a visit. It is worth a visit, and you should time your visit to coincide with a service. This was my first visit to a Russian Orthodox cathedral so the unique style compared to other cathedrals was very interesting to see."
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "Beautiful cathedral in St. Petersburg. The Kazan Cathedral is located along the Nevsky Prospekt; it’s the U-shaped building with lots of columns. While nowhere as colourful as the Church of the Saviour on Spilled Blood, nor as ornate as the gold-domed St. Isaac’s Cathedral, Kazan Cathedral is still quite beautiful nonetheless, especially the interior! Entrance to the cathedral is free, and visitors are welcome to enter and observe. The cathedral also happens to open daily, so you can visit any day.If you are interested in visiting the Church of the Saviour on Spilled Blood, you can cross over to the opposite side and walk along the waterway to reach it. It’s quite fool-proof since you can already see the colourful church from Kazan Cathedral."
        }, 
        {
            "index": 100, 
            "rating": "5", 
            "review": "Amazing!. Really interesting and beautiful place! Very high ceilings! It is a cultural heritage of Russia! I am very impressed… The place is located in the city centre, around the flowers grow and it's all very inspiring. Amazing!"
        }, 
        {
            "index": 101, 
            "rating": "4", 
            "review": "Worth a visit!. Kazan Cathedral is worth of visit while in St. Petersburg. Although it cannot rival The Church of the Savior on Spilled Blood and St. Isaac;s Cathedral, it is very beautiful inside. When we visited, in November, there were many locals praying and kneeling in the church, which gave us the impression that the cathedral still works for mass."
        }, 
        {
            "index": 102, 
            "rating": "5", 
            "review": "Iconic Cathedral. A prominent icon on Nevsky Prospekt, this was my favorite cathedral in St. Petersburg. Although not as spectacular looking as the nearby Church on Spilled Blood, you get a sense of real Russian Orthodox worship inside here. Entrance is free and you get a chance to observe, pray, meditate on your own schedule. Prices for icons, worship items, etc. are more reasonably priced than at other cathedrals as well."
        }, 
        {
            "index": 103, 
            "rating": "3", 
            "review": "Dominates Nevsky Prospect. Interesting building. Did not go inside, but the gardens provide a welcome (and free) spot to sit down on a hot summer's day."
        }, 
        {
            "index": 104, 
            "rating": "5", 
            "review": "Russian orthodox church. This is a working church and not a museum so no photography is allowed. Most of the Russian women covered their heads but I didn't feel uncomfortable with mine uncovered. There was a long line to approach and I he a special icon. Free. Took less than one hour to see."
        }, 
        {
            "index": 105, 
            "rating": "5", 
            "review": "Unheralded gem. Sandwiched midway between the more famous St Isaacs cathedral and church of the Spilled Blood - this small sweet active church is a great antidote to the over crowded tour crammed more famous places When services are on, seeing locals line up for blessings deepens the majesty of the setting. Tiny enough to see quickly yet detailed enough to enjoy - you won't be disappointed and you can easily walk to it from either of the others. Enjoyed it the most of the three - including the small collection of reliquaries."
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "So glad we went to this gem. If i wasn't for our guide, we'd not have visited this cathedral which, as you can tell, is modelled on the Vatican because the Russians wanted it as a centre of the Orthodox religion. It's stunning to look at from the outside and inside it houses a religious picture people queue up to touch and make a wish through. It's definitely one to check out and it's right there at the side of the main shopping street. So glad our guide took us in and explained the history behind the place (village kids says there's a religious picture buried somewhere, adults dig, find it, put it in this church to bring Russia lots of good luck)."
        }, 
        {
            "index": 107, 
            "rating": "4", 
            "review": "Impressive building with free access. This is the only great building in St. Petersburg which is open to the public. It is a functioning Orthodox church, so expect to find religious service or chanting virtually anytime. Impressive interiors."
        }, 
        {
            "index": 108, 
            "rating": "4", 
            "review": "Another beautiful cathedral. Situated right next to a metro station. Does not disappoint us when we visit its interior. And the entrance is free of charge."
        }, 
        {
            "index": 109, 
            "rating": "5", 
            "review": "Russian Orthodox Mass - Unique Experience. This is a great church to see and visit. No pictures are allowed because it is a working church today. We were able to watch a mass, which was such a unique experience. The church was built to commemorate a victory over the French, and there are still historical pieces in the church from the victory. Beautiful building, the size is enormous, would highly recommend."
        }, 
        {
            "index": 110, 
            "rating": "4", 
            "review": "impressive classic cathedral. Worth visiting to eyewitness that even after 80 years of communist rule the faith in God remain .Watch the prayers standing in a long queue to kiss an icon.Convenient location on the west side of Nevsky Prospect.Free entrance."
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "Awesome icon!. Amazing to see the number of people in line to see the famous icon - definitely worth your time to stop in!"
        }, 
        {
            "index": 112, 
            "rating": "4", 
            "review": "Witness real orthodox mass!. Camera was not allowed, because unlike touristy spilt blood, this is real working cathedral. I was lucky to walk in when they were conducting mass (not sure, if it's not called mass). There were about 6 priests chanting and reading, people were praying and crossing themselves. Other people were lighting candles, kissing icons, while nuns in black habits cleaning candle stands. Very somber atmosphere. Also this is the resting place of kutzsov who led Russian army to victory against French. his resting place was surrounded by French standards and keys of the city taken from surrendering French army. kutzsov statue is outside as well. middle of the centre roof outside has Freemason symbol. Well worth a visit."
        }, 
        {
            "index": 113, 
            "rating": "3", 
            "review": "nice too see. nice to see, but not too spectacular in my eyes. However, many orthodox come here to get blessed after praying."
        }, 
        {
            "index": 114, 
            "rating": "4", 
            "review": "The less impressive cultural attraction in St Petersburg. Do not get me wrong, it is a great place, specially inside with its richness of icons. Outside, for me as roman, was less impressive and also the colors not so attractive like the ther cathedral in town. One point in its favor, you do not need to pay for the entrance. we were lucky , there was a function ongoing and listened to the chores and the very unusual way of the believers of praying and do the cross with genuflection and head on the floor.Place to be visited for sure, if in hurry though you could privilege others."
        }, 
        {
            "index": 115, 
            "rating": "5", 
            "review": "Nice birds!. I heard that it is a bad copy of Kazan Cathedral in Rome. But I think it was beautifull. There are lots of birds waiting for you to give them food!"
        }, 
        {
            "index": 116, 
            "rating": "4", 
            "review": "To be seen . The cathedral is quite big. A nice thermal to visit in the city.It is local in the city center. Atypical cathedral from the outside classical from inside. Nice to see but not spectacular."
        }, 
        {
            "index": 117, 
            "rating": "4", 
            "review": "Part of History. Another good place to visit, recommended to have a guide to explain the historical significance of the building too"
        }, 
        {
            "index": 118, 
            "rating": "3", 
            "review": "Take a look in. From the outside the heavy classicism is rather solid and over powering. It was built by Tsar Paul to mimic St Peters RomeInside it's a functioning church. Many queue to kiss the silver coated iconWorth a look as close to main street"
        }, 
        {
            "index": 119, 
            "rating": "5", 
            "review": "Wonderful Cathedral. We only got to see the Outside and Surrounding area of this Church. The area had wonderful Buildings and sites"
        }, 
        {
            "index": 120, 
            "rating": "4", 
            "review": "Stunning location. Remember be respectful, as it not a museum and is serving its original purpose as a place of worship .."
        }, 
        {
            "index": 121, 
            "rating": "5", 
            "review": "Beautiful Day and Especially at Night. The Kazan Cathedral is the main cathedral of St. Petersburg. We visited both the cathedral and the Church of Spilled Blood as they are within easy walking distance to each other. We briefly visited the interior of the church to see the Icon of the Virgin Mary and returned in the evening to see the cathedral at night. The semi circular columns that flank both sides of the cathedral are illuminated at night so if you are a budding photographer you will definitely be rewarded with some great pictures."
        }, 
        {
            "index": 122, 
            "rating": "4", 
            "review": "Nice Cathedral!. Nice place to visit in Petersburg. Specially if youre a history lover. Kazan Cathedral is free to the public."
        }, 
        {
            "index": 123, 
            "rating": "5", 
            "review": "Beautiful. Free to visit. Enormous and breathtaking interior, but know that you can't take photos. Most women cover their head, so bring a scarf if you have one. If you are lucky enough to be there while the vesper choir is singing, it's a truly beautiful experience."
        }, 
        {
            "index": 124, 
            "rating": "3", 
            "review": "Not much to it, a big Cathedral that's all . There's nothing bad or good to it, it's just an orthodox place of worship. There are more interesting highlights in the city worth a visit. One advantage of the Kazan Cathedral is that it's free."
        }, 
        {
            "index": 125, 
            "rating": "5", 
            "review": "Huge and amazing. While you were walking on the levski street you will see that building also you can find people inside praying so you need to care your wearings before you come"
        }, 
        {
            "index": 126, 
            "rating": "5", 
            "review": "walking down nevsky street. In a heart of the city next to Church on the Spilled Blood, Singer Sewing Company building. Rather gloomy and spiritual place. Not a museum and full of worshipers lining to get blessing from a sacred Russian icon of Godmother."
        }, 
        {
            "index": 127, 
            "rating": "4", 
            "review": "Peaceful. Peacefully, we were really glad to be Kazan Cathedral. Nice walk from Train station on Sunny Sunday. Was built in 1708."
        }, 
        {
            "index": 128, 
            "rating": "5", 
            "review": "Loved it. Not as glamourous as church of the savior but I loved it more due to its simplicity. There were many people praying and lighting candles so it felt like a more sacred place in a way. Five min walk from church of the savior so very easy to see both in one day."
        }, 
        {
            "index": 129, 
            "rating": "5", 
            "review": "Look for the photographic depictions outside. We've been travelling for a year worldwide and are pretty much ABC'd (Another Bloody Church/Castle). We did enjoy the grounds, setting and location of this church, but if you visit, hopefully the photograph displays just outside will still be there (They did look somewhat permanent). The photographs showed a street in St. Petersburg in color with the former Lenningrad around WWII in black and white superimposed. Very cleverly and tastefully done. I was mesmerized."
        }, 
        {
            "index": 130, 
            "rating": "5", 
            "review": "Huge cathedral with interesting history. Unfortunately photos are not allowed inside. It's an opulent interior and we happened to visit during a choir performance. It's well worth a visit."
        }, 
        {
            "index": 131, 
            "rating": "4", 
            "review": "Impressive cathedral. Our schedule did not allow us time to see inside this cathedral but from the outside it certainly appears to be very impressive. The building dates from 1801 when it was built to house the Russian Orthodox,s precious icon. It is situated close to the Church of the Spilt Blood so the two can be visited together."
        }, 
        {
            "index": 132, 
            "rating": "5", 
            "review": "Stunning interior. This is a very beautiful cathedral with spectacular art and religious items. It's free to visit and is open quite late."
        }, 
        {
            "index": 133, 
            "rating": "5", 
            "review": "Another monument to be visited. Another monument to be visited in the city. Right on nevesky prospekt. The roman architecture is worth praising. In summers one can see the huge crowds on the front parks."
        }, 
        {
            "index": 134, 
            "rating": "4", 
            "review": "You'll Be Nearby Anyway. The Kazan Cathedral is near the lower end of Nevsky Prospect so you will walk by it anyway. Admission is free. Plenty of room inside. Worth you time. No picture taking."
        }, 
        {
            "index": 135, 
            "rating": "5", 
            "review": "True Orthodox Church. This is a beautiful representation of another Orthodox Church in St. Petersburg. We actually attended the Liturgy and the chanting in Russian style is very harmonic and if I could describe what heaven sounds like this would be it. I think the only comment would be that tourist in general need to be aware this is a real church and need to be respectful."
        }, 
        {
            "index": 136, 
            "rating": "4", 
            "review": "Russian Orthodox Church. It is dedicated to Our Lady of Kazan, probably the most venerated icon in Russia. The entrance is free of charge."
        }, 
        {
            "index": 137, 
            "rating": "3", 
            "review": "Old normal. Was visited and is just another church...a place to take a picture and move on.There is nothing much more to say about this place."
        }, 
        {
            "index": 138, 
            "rating": "4", 
            "review": "Beautiful and interesting. This is one of the most beautiful religious places I have ever seen. Both outside and inside. My only issue with this place is the fact it highlights the well known corruption."
        }, 
        {
            "index": 139, 
            "rating": "5", 
            "review": "One of the most beautiful churches of St.Petersburg. Magnificient both from the outside and inside, the Kazan is a huge-scale piece of art from the early 19th century. Outside it appears not only as a church but as a military victory monument which it partially is.Inside you can see Russian general Kutuzov's grave as well as memorabilia from Russian military victories in the Napoleonic wars."
        }, 
        {
            "index": 140, 
            "rating": "5", 
            "review": "A centre of calm. On Nevsky Prospect and with a design based on St Peter's in Rome, this is a must visit Cathedral. The icon of Our Lady of Kazan is placed in this working cathedral and many people come to pray to the icon. There are services twice a day. It is customary for ladies to cover their heads in the cathedral, so keeping a scarf in your bag would be an advantage."
        }, 
        {
            "index": 141, 
            "rating": "5", 
            "review": "Serene & peaceful. It is a working church. There was a service going on when we reach the cathedral. It was a peaceful and serene experience. The cathedral itself is very beautiful and gave great positive vibes."
        }, 
        {
            "index": 142, 
            "rating": "4", 
            "review": "Visit to Kazan. There was a service taking place when we entered. The place is lovely and there are a lot of icons and statutes to see. Worth a visit"
        }, 
        {
            "index": 143, 
            "rating": "5", 
            "review": "Just stunning cathedral in Nevsky Prospekt !. This elegant, arched colonnade of one magnificent and sacred edifice, we just couldn't miss, being in Nevsky Prospekt. The location is great, since it is situated in the magnificent Nevsky Prospekt, and with its right wing, it is adjacent to the kanal of Griboyedov ( great russian poet and dramatist). This Cathedral is also known as the Cathedral of Our Lady of Kazan. So, it is an Orthodox Church that is dedicated to Our Lady of Kazan probably the most respected icon in Russia. And from this fact, there is an issue, that this Kazan Sobor (Cathedral) is not only one remarkable museum but also a church with full service. It consists of one main and central columned portal with the pediment on the top of it, and behind arises a colossal dome with the golden cross. To the right and left, range the curved colonnade and end with the two medium, triumphal portals as a memorial to the Russian victory against Napoleon.Here in Cathedral is interred Mikhail Kutuzov himself and Alexander Pushkin wrote some celebrated verses about him, while the poet meditated over his sepulchre.In front of this flanked portals are placed the bronze statues of Kutuzov and Barclay de Tolly ( Kutuzov's eminent general).There is a very nice lawn before the Cathedral and also a fountain and wooden benches on the tiny gravelled path. Very pleasant spot for meetings with acquaintances.We really enjoyed here, within this Kazanskaya Square, formed by the elegant design and structure of Kazansky Sobor."
        }, 
        {
            "index": 144, 
            "rating": "4", 
            "review": "Church services twice a day.. We had been hoping to find a church that was NOT just a museum. This one has services at 10am and 6.00pm each day so we were able to join in with one. I took a scarf for my head as wanted to feel part of it rather than just watch. The singng was lovely."
        }, 
        {
            "index": 145, 
            "rating": "4", 
            "review": "Legend along Nevsky Prospekt. I passed Kazansky Cathedral during my walk along Nevsky Prospekt and the cathedral was large enough to keep attention - a stunning sight from the main street, I would say!If you have strong passion for roman arts, you'll definitely see Kazansky Cathedral.Enjoy the legend along Nevsky Prospekt."
        }, 
        {
            "index": 146, 
            "rating": "4", 
            "review": "Impressive.... The first impression is that is a similar to St. Peters, Rome.Beuatifully decorated inside, the main attraction is an icon which is highly revered."
        }, 
        {
            "index": 147, 
            "rating": "4", 
            "review": "Cavernous cathedral, still very much in use.. While tourists come here it is still very much a cathedral used by the locals. There was a long line to pray at the Icon of Our Lady of Kazan. In a side chapel a priest was offering mass for a small group of worshipers. It is very dark inside but seems authentic because of this. From the outside the resemblance to St Peters in Rome is unmistakable."
        }, 
        {
            "index": 148, 
            "rating": "3", 
            "review": "Lots of religious art objects. I'm not much interested in cathedrals, but this one was interesting, partly because of the nice little park out front, and it was free! There are lots of icons, paintings and other religious stuff on the walls. I was lucky enough to see a service by eight priests in beautiful robes, accompanied by a choir. I was there at 11am on a Sunday, so this service could be a weekly event."
        }, 
        {
            "index": 149, 
            "rating": "4", 
            "review": "Stunning St. Petersburg. Modeled after St. Peter's in Rome, this Church is absolutely stunning. You can just photograph it on your way to the Hermitage."
        }, 
        {
            "index": 150, 
            "rating": "5", 
            "review": "Awesome visit to a working church. This Cathedral is a working church as opposed to a museum. We didn't go during a service but did walk through as others were worshipping. It is very interesting to see how different and how much the same Russian Orthodox worship is from Catholicism."
        }, 
        {
            "index": 151, 
            "rating": "5", 
            "review": "Beautiful open Cathedral . This appears to be a \"working\" Cathedral in that there were clergy attending to people in the prayer area. Beautiful paintings, floors and ceilings. Very different from Saviour on the Spilt Blood."
        }, 
        {
            "index": 152, 
            "rating": "5", 
            "review": "Nice building, free entry. Nice attraction to observe for free. Close to the Metro. It is an active church. Not as glamorous as St Isaac's, but still a must-see."
        }, 
        {
            "index": 153, 
            "rating": "5", 
            "review": "Russian Art treasury. First of all, it's a real miracle. You are going to find certain things in common with the famous St.Peter's cathedral in Vatican. Astonishing decorations as outside as inside will fill your heart with inspiration. I highly recommend to look through the web page which tells us about the masterpieces which are presented in there or you always can participate in excursions where a guide tells you numerous facts about the place, history and of course superstitions. To people who are interested in art of Rafael! There is a picture \"Вознесение Богородицы\". It's considered one of the best ones by famous Russian artist Brulov. It has a few things in common with the well-know \"Madonna\" by Rafael. It can be seen ONLY during evening or morning services. I can tell you about the evening time. 6pm. Good luck"
        }, 
        {
            "index": 154, 
            "rating": "4", 
            "review": "A landmark. Inspired by St. Peter's Cathedral in Vatican Kazan Cathedral is a landmark of St Petersburg. You won't miss it walking along Nevski Prospect. However more impressive from outside than inside"
        }, 
        {
            "index": 155, 
            "rating": "4", 
            "review": "Imposing Cathedral, worth a look. We walked by and based on the grandiose exterior popped in for a look. So glad we did. Full of locals paying their respects and praying. We bought some candles and lit them at an icon. Free to go in."
        }, 
        {
            "index": 156, 
            "rating": "3", 
            "review": "Rom or St. Petersburg?. The two long rows of columns on the two sides of the church are looking similar to the one in St. Peter Cathedral in Rom. But this is the only notice, unfortunately..."
        }, 
        {
            "index": 157, 
            "rating": "5", 
            "review": "Central, grand imitation. Clearly a place of worship and active. Shameless miniature St. Peter's outside! But amazing icons inside."
        }, 
        {
            "index": 158, 
            "rating": "5", 
            "review": "Nice but. Quite a few drunkards being a bit shifty. Nice for a little sit down though if the weather is nice, probably not one for winter"
        }, 
        {
            "index": 159, 
            "rating": "5", 
            "review": "A great experience. We visited Kazan Cathedral on the Russian Orthodox celebration of Palm Sunday. The Cathedral was busy with worshippers and tourists, but this was not a problem. We were able to experience a religious service with the appropriate singing and chanting - along with a choir which sang from the balcony. A beautiful building and a great experience."
        }, 
        {
            "index": 160, 
            "rating": "5", 
            "review": "kazan cathedral. very nice cathedral on the main street just stop and take some nice wide angle photos .it has a nice history you can read it or buy the book ."
        }, 
        {
            "index": 161, 
            "rating": "5", 
            "review": "Superb. I visited Kazan Carhedral in St Petersburg last week. It stands majestically on Nevsky Prospect with symmetrical colonnades on either side of the main Cathedral. It dates from 1801.The interior is absolutely stunning with soaring ceilings and exquisite art at every turn.The admittance is free and due to its large scale it doesn't seem crowded which allows you time and space to really see its beauty. It is place of great peace and history that I highly recommend.After your visit you can sit in the lovely park in front of the cathedral."
        }, 
        {
            "index": 162, 
            "rating": "5", 
            "review": "Fabulous interior. From the outside it looks over-grand but has a great atmosphere with wonderful icons and mosaics. A very holy place"
        }, 
        {
            "index": 163, 
            "rating": "5", 
            "review": "Kazan cathedral. Great place to visit, spectacular icons and ceilings. A little crowded but didn'tMatter. Worth a visit, doesn't take too long but spectacular"
        }, 
        {
            "index": 164, 
            "rating": "5", 
            "review": "An oasis of calm. In s bustling city with so many pay to enter cathedrals, all of which are beautiful, it's nice to see an operational church which is free to enter!Good to see the locals make their own connections with the man upstairs whilst us tourists take pictures of the beauty of the building itself!"
        }, 
        {
            "index": 165, 
            "rating": "5", 
            "review": "Go there right now.. Im proud that we have so amazing building. In a second World war in Kazanskiu people save saint image of God and a lot of them believe - it's save from germany bullet."
        }, 
        {
            "index": 166, 
            "rating": "4", 
            "review": "Magnificent landmark. Though this cathedral has no special purpose currently, but as on of landmark of st Petersburg, you must take a photo here. It's beautiful during afternoon time."
        }, 
        {
            "index": 167, 
            "rating": "5", 
            "review": "One of the most beautiful Cathedral in Russia!. Kazan Cathedral was planned as a half copy of San Pietro Cathedral, but in fact it became an absolutely unique and well known symbol of the city. It has it own tales and legends. Past through centuries, hard times and survived keeping royal beauty and dignity.You should see that Cathedral at night time, when the lights make it magnificent and magic."
        }, 
        {
            "index": 168, 
            "rating": "4", 
            "review": "Worth a visit for Christians and architecture fans. I enjoyed this visit. It is free and peacefully quiet. If you enjoy architecture, you can easily drop 45 minutes to an hour here. As a Roman Catholic, I enjoyed comparing and contrasting the Orthodox-style architecture to that which I've seen in the hundreds of Roman-style churches I've been in. The usual rules apply for visiting a holy place: Men should be covered past the knees - preferably pants - and no hats; women should be dressed conservatively and preferably have some kind of head cover, though I don't think any of this is tightly enforced, I visited in the early Spring when it was still cool outside, so nobody was dressed in shorts etc. anyway. This is a good place to sit and silently pray if you are religious. There are also gift/merchandise stands on either exit where you can buy icons or Christian jewelry for quite a reasonable price. N.B.: The sign on the outside of the cathedral says (in Russian) to not take photos. Again, this is not enforced and architecture geeks like myself will not be able to resist the temptation to snap an occasional photo. Just be respectful and discreet and turn off your flash, and I don't think anyone will care."
        }, 
        {
            "index": 169, 
            "rating": "4", 
            "review": "Pleasant hour spent here. Nice functioning church visited by travellers as well as locals. Pleasant, free and easy to visit. Doesn't require much time"
        }, 
        {
            "index": 170, 
            "rating": "5", 
            "review": "This is an active church. This Church is different from the others in that services are held here everyday so you can feel the energy from the people."
        }, 
        {
            "index": 171, 
            "rating": "4", 
            "review": "Unusual architecture, attractive interior. Kazan Cathedral's exterior is a very impressive semi-circle of columns, somewhat like the Vatican in Rome. However, this initial grandeur is a bit deceptive - if you enter the door in the middle, you find yourself in a relatively small church (and in the transept, or side, not at the base of the nave as I'd expected). The interior is relatively decorated, and there are 2 kiosks selling items. It is a working church, so you may hear a service in progress when you visit (I did)."
        }, 
        {
            "index": 172, 
            "rating": "4", 
            "review": "Lovely church. This church is lovely. It's not like St Isaac's or the church of spilt blood because it is in normal operation and you don't have to buy tickets or anything to visit."
        }, 
        {
            "index": 173, 
            "rating": "5", 
            "review": "nice cathedral to visit... this cathedral is near to Church of the Savior on Spilt Blood just five minutes walk and must visit this also one of the tourist attraction..."
        }, 
        {
            "index": 174, 
            "rating": "5", 
            "review": "Beautiful cathedral, still in function.. The Kazan Cathedral is a very holy place for the orthodox people, especially for the Russians. Inside the cathedral there is the holy icon of Virgin Mary, also known as the \"Our Lady of Kazan\". Many people go there to pray to the icon, so I strongly advise you to be quite inside the cathedral, take of your hat off and try not to be annoying with you camera. Show respect no matter of you religious beliefs.The story about the icon is very interesting, so ask your tour guide about it, or just google it. :)Best time to visit the cathedral would be the night before Easter, for the Orthodox Easter ceremony.It's architecture is influenced by the Vatican. The entrance is free of charge."
        }, 
        {
            "index": 175, 
            "rating": "5", 
            "review": "👍🏽👍🏽👍🏽. Must've place in SPB. Number one in the list of places that you need to visit in this incredible and beautiful city. "
        }, 
        {
            "index": 176, 
            "rating": "4", 
            "review": "Good photo opportunity. Nice photos, but you will have to get there at the right time such that the sun is shining on it rather than from behind. For that, I think you have to go there in the morning? Cause I went there in the afternoon and the sun was setting and behind it."
        }, 
        {
            "index": 177, 
            "rating": "3", 
            "review": "Working church- observe and show respect . Typical church that is perpetually crowded. As it is along the Main Street in St Petersburg as well as the fact that it is a very large church, it is worth 10 minutes of your time to drop in and observe how the Eastern Orthodox Christians pray. Do show proper respect and not be so obvious snapping pictures ."
        }, 
        {
            "index": 178, 
            "rating": "5", 
            "review": "Great place in the middle of Piter. I think you already seen this place. This beatiful Palace staied near the center metro. In the middle of the Nevskiy. I loved this kathedral becouse it looked like monumental. It is very old and i thought that I went to the Past. One negative moment - it is cost too much."
        }, 
        {
            "index": 179, 
            "rating": "5", 
            "review": "Hidden gem. We did not know who we were walking into but we were amazed at wha was behind the doors. A fully functional church. Magnificently beautiful."
        }, 
        {
            "index": 180, 
            "rating": "5", 
            "review": "Grand exterior and cosy interior. Beautiful Orthodox Church with lovely artwork of saints. We visited on a Saturday and there was a choir singing mass, so the atmosphere was serene with lots of locals praying and lighting candles."
        }, 
        {
            "index": 181, 
            "rating": "4", 
            "review": "A lovely cathedral in the heart of St. Pete. Semblance may petray you; despite of the dilapidated outside, this cathedral is very beautiful and decorative in the inside."
        }, 
        {
            "index": 182, 
            "rating": "4", 
            "review": "Lovely cathedral . Rare for Russia, this church has no entrance fee. It is a beautiful construction. It has an influence from St Peters in the Vatican, the colanade is beautiful as are the marble columns inside. Be prepared for services being active in the morning and be respectful, guys take your hat/beanie off."
        }, 
        {
            "index": 183, 
            "rating": "5", 
            "review": "the victorious Napoleonic War. Kazan Cathedral or Kazanskiy Kafedralniy Sobor, also known as the Cathedral of Our Lady of Kazan, is a cathedral of the Russian Orthodox Church on the Nevsky Prospekt in Saint Petersburg.People from all over Russia visit Kazansky Cathedral to pray by the icon of Our Lady of Kazan."
        }, 
        {
            "index": 184, 
            "rating": "4", 
            "review": "best view. didn't go inside as was a bit tired of all the cathedrals and churches, but the best view from outside is from book house across the street, go to 2 floor cafee, get seat by window and order pancakes with blackcurrants and ice-cream."
        }, 
        {
            "index": 185, 
            "rating": "5", 
            "review": "Magnificent. Large church and museum in one, well worth visitng. Impressive scale, high dome, ambient atmosphere, and one of the most prased icons of Russian Orthodoxy - Kazan Mother of God is on display."
        }, 
        {
            "index": 186, 
            "rating": "5", 
            "review": "Not on most lists but worth the time. Not on most lists but worth the time.We stumbled in here by accident and felt rewarded . Not the crowds that were every where else."
        }, 
        {
            "index": 187, 
            "rating": "5", 
            "review": "Oooh those Tsars..... This was the attempt to blend Catholicism with Orthodoxy and inside you'll see a queue of people lining up to kiss the icon of 'our lady of kazan'. And it's free!!"
        }, 
        {
            "index": 188, 
            "rating": "5", 
            "review": "Beautiful. Fascinating to see a \"working\" orthodox cathedral as opposed to museum like buildings such as St. Isac's.\nVery grand."
        }, 
        {
            "index": 189, 
            "rating": "4", 
            "review": "Interesting to see. Very interesting to see a working Cathedral with services that are ongoing. This was definitely more about the culture than the interiors of the cathedral (which were incredible but not quite as intricate as the other main churches in St. Petersburg). The smell of incense as you walk in is quite overpowering but this is a great way to view the Orthodox Christian aspects of Russia. Note to women - you must have your head covered whilst you're inside the cathedral. They don't mention this on the signage."
        }, 
        {
            "index": 190, 
            "rating": "5", 
            "review": "Very beautiful . Definitely worth seeing if you like architecture or art. Women should make sure their heads are covered with a scarf or a hat. Free entry"
        }, 
        {
            "index": 191, 
            "rating": "5", 
            "review": "Astonishing monumental. It is one the must view attractions in St.Petersburg.\nPlease obey the spiritual customs of the Russian Orthodox Church. Ladies shall wear a headscarf."
        }, 
        {
            "index": 192, 
            "rating": "5", 
            "review": "Fairylike St Petersburg. Walking in the streets of St Petersburg you will discover the most beautiful buildings,cathedrals,statues"
        }, 
        {
            "index": 193, 
            "rating": "4", 
            "review": "Very nice. It has been modeled after St. Peters in Rome although it is far from the grandeur and elegance of the original. The interior are stunning, as in most orthodox churches; very rich indeed. Apart from the Icons, the cathedral hosts the grave of general Kutuzov, who defeated Napoleon.The attempt to resemble to St. Peters in Rome is a bit clumsy but the interiors are well-arranged. The most thrilling part, if you're not particularly interested in the Sacred Icons, is the grave of general Kutuzov, the one who defeated Napoleon, surrounded by the insignia of the disbanded regiments of the Grand Armée."
        }, 
        {
            "index": 194, 
            "rating": "5", 
            "review": "Wonderful. When you are around this place you can feel the magnific spirit of Saint Petersburg, with the power of Nevsky Prospekt."
        }, 
        {
            "index": 195, 
            "rating": "5", 
            "review": "A spiritual break that fed my soul.. Our Lady of Kazan has a very loyal following. Young, old, male and female. They all come to pray to this saint and ask her for guidance. It was so moving that I stayed for almost 2 hours. I purchased my bundle of candles. Lit them slowly, one by one, and prayed for many people I love. This is a real working church with devout members. Be sure to cover your head when you go into this house of worship. This church has a wonderful vibe."
        }, 
        {
            "index": 196, 
            "rating": "5", 
            "review": "Beatty. Gorgeous architecture, must visit placeWould recommend to spend time there for every one It is very attractive"
        }, 
        {
            "index": 197, 
            "rating": "4", 
            "review": "An impressive monument. Only by its size it will impress you, but the details of the architecture are also easy to recognize, inside is not such a great thing but still deserve a visit"
        }, 
        {
            "index": 198, 
            "rating": "4", 
            "review": "The thrill on the grave of Kutuzov. The attempt to resemble to St. Peters in Rome is a bit clumsy but the interiors are well-arranged. The most thrilling part, if you're not particularly interested in the Sacred Icons, is the grave of general Kutuzov, the one who defeated Napoleon, surrounded by the insignia of the disbanded regiments of the Grand Armée."
        }, 
        {
            "index": 199, 
            "rating": "5", 
            "review": "Impressive Cathedral of Our Lady of Kazan. Whilst taking a stroll along Nevsky Prospekt, the main thoroughfare in St. Petersburg, one cannot fail to notice the impressive Cathedral of Our Lady of Kazan. The cathedral was inspired by the Basilica of St. Peter's in Rome. The cathedral was named after the \"miracle-making\" icon of Our Lady of Kazan. After the war of 1812 (during which Napoleon was defeated) the church became a monument to Russian victory. Russian Field Marshal Mikhail Kutuzov, who won the most important campaign of 1812, was buried inside the church. The cathedral's interior, with its numerous columns, echoes the exterior colonnade and is reminiscent of a palatial hall, being 69 metres in length and 62 metres in height. The interior features numerous sculptures and icons created by the best Russian artists of the day. A wrought iron grille separating the cathedral from a small square behind it is sometimes cited as one of the finest ever created."
        }, 
        {
            "index": 200, 
            "rating": "5", 
            "review": "The main Cathedral of St. Petersburg.. The main Cathedral of St. Petersburg. Built by former slave - Voronikhin,who was able to teach and give scope for talent count Stroganov.the Cathedral of the great things of religion ,is buried here the winner of Napoleon, Mikhail Kutuzov!"
        }, 
        {
            "index": 201, 
            "rating": "3", 
            "review": "So so. Interior free to see but better to spend time on other attractions. Not bad at all but take a photo from outside and keep driving is the best idea"
        }, 
        {
            "index": 202, 
            "rating": "4", 
            "review": "Copy of Rome in St Petersburg. The church is basically a copy of St Peters church in Rome. It doesn't reduce the beauty of the church. The church has an icon, which is claimed to be miracle making, so locals are queuing to kiss it and to lit a candle next to it.\nIt is absolutely worth visiting."
        }, 
        {
            "index": 203, 
            "rating": "4", 
            "review": "Lovely. We visited here our first day (New Years Day) not knowing what to expect and were pleasantly surprised\nLovely\nYou are told no cameras but many were using them\nA little shop inside allows you to but candles etc"
        }, 
        {
            "index": 204, 
            "rating": "5", 
            "review": "Always bust y inside. Try and visit at the time of a service the sining is spectacular. The Cathedral, inspired by St Peter's in Rome was built to house the 'miracle making' Kazan icon, which always has a long queue of individuals waiting to pray at and kiss. As with all Russian churches there are almost no seats."
        }, 
        {
            "index": 205, 
            "rating": "5", 
            "review": "Interesting architecture.. Definitely worth a visit if you are in the area. Dn't miss the wonderful art nouveau cafe on the opposite side ofthe street. Stunning architecture, amazing interior and the most wonderful confectionery you will ever eat. Gifts available too."
        }, 
        {
            "index": 206, 
            "rating": "4", 
            "review": "Big as everything in Russia . Located directly at the Newsky prospekt, one cannot miss it - it is totally worth a photo and to take a quick view inside"
        }, 
        {
            "index": 207, 
            "rating": "4", 
            "review": "Beautiful. Lovely but very busy on New Years Day so be prepared to queue inside to pray or purchase goods\nThough it says no cameras as you enter many people used them without any problems"
        }, 
        {
            "index": 208, 
            "rating": "4", 
            "review": "Nice architecture. Eventhough we did not go inside there but we were still impressed by the architecture from outside. It was snowing when we get there, hence we just sat outside and played at the front of the cathedral at the park facing Nevsky Prospekt."
        }, 
        {
            "index": 209, 
            "rating": "5", 
            "review": "Tour with audio guide. Audio guide is worth purchasing. You will know about the history of the cathedral along with the information about the particular attractions (Kutuzov grave, for example, of the icons)."
        }, 
        {
            "index": 210, 
            "rating": "5", 
            "review": "Imposing Orthodox Church. Imposing Orthodox church. Includes inside some more chapels. Nice and quiet place. If you get any ceremony or religious music concert it's recommended."
        }, 
        {
            "index": 211, 
            "rating": "5", 
            "review": "Remarkable attraction. Amazing Catherdral, what I was really wondering about while wolking across is how the hell it remains a whole piece after the WW2 siege, since it is so enormous, therefore, easy to notice by an enemy pilot. Miracle."
        }, 
        {
            "index": 212, 
            "rating": "5", 
            "review": "Very spiritual place. This place is beautiful of the outside and on the inside, but you do have to make sure that you are respectful because it is an active place of worship."
        }, 
        {
            "index": 213, 
            "rating": "4", 
            "review": "nice. I visited this cathedral after visited other cathedral ,but please start with this one you would enjoy it more ,it looks ordinary but it is not very interesting building"
        }, 
        {
            "index": 214, 
            "rating": "4", 
            "review": "Functional Church. The Cathedral is built by a favourite of Count Stroganoff -unknown beginner in architecture- Voronikhin. The wise construction on a marshy lands with widely spread wings which nicely keep the whole construction up. It was a museum of atheism in Soveit times and now it is a functional church = what a fortune.! You can see the beautiful interior of the Church as well as the grave of a fomous Russian general Kutuzov inside. it is with the keys and flags of the cities he had captured once."
        }, 
        {
            "index": 215, 
            "rating": "5", 
            "review": "Beauty of Nevskiy Prospect. Everyone coming to St. Pete heard of Kazan Cathedral. You can't miss seeing it even if you wanted to as it's situated in the heart of the city. Very easy to access, Cathedral would be a nice place to just stop for a minute and enjoy tranquilness and beauty of this giant."
        }, 
        {
            "index": 216, 
            "rating": "5", 
            "review": "Very beautifull. In center of newsky prospect located this very beautifull cathedral.this summer government of city,i think did improvementOutside and now its even more nice,also here is small nice park with coffeeshop."
        }, 
        {
            "index": 217, 
            "rating": "4", 
            "review": "Accessible cathedral on Nevsky avenue.. I had passed this catherdral several times in the pasted years. When I finally entered I was very impressed. Please be aware that it is not a tourist attraction."
        }, 
        {
            "index": 218, 
            "rating": "4", 
            "review": "An interesting church. The church is located at the main tourist road (nevsky prospect) and has a wonderfull decoration inside, also the line inside of people waiting to pray was impressive"
        }, 
        {
            "index": 219, 
            "rating": "5", 
            "review": "Lady of Kazan. Active church and a service was on when we visited.Our Lady of Kazan icon was the main attraction for obvious reason's and Kutosov is interred there.There is also a statue of him outside the church.Known as the mother cathedral of St Petes.This church also has giant impressive bronze door's.Worth a visit."
        }, 
        {
            "index": 220, 
            "rating": "5", 
            "review": "Amazing beautiful. I was there during mid day mass and got a chance to see how the mass was being held. The interior is magnificent and very grande.it's very easy to find as it's on the most popular street in St Petersburg; Nevsky Prospekt"
        }, 
        {
            "index": 221, 
            "rating": "5", 
            "review": "Kazan Cathedral. Kazan cathedral is one of most beautiful church in the Sankt Petersburg. Arhitecture is impressive,at the beginning you would think that the church. Interior is very reach..."
        }, 
        {
            "index": 222, 
            "rating": "5", 
            "review": "Must see. This sight was not in the itinerary of the Czar Tours and we visited it while having a walk down Nevsky street. It is right opposit the Church on the spilled blood. I loved this place for it is a practicing church, not a museum (St-Isaacs Cathedral, Church on the Spilled blood and Peter and Paul's Cathedral are museums packed with tourists.) It wasn't rennovated and you feel the spirit of the Cathedral while watching ancient icons and listening to the bell music."
        }, 
        {
            "index": 223, 
            "rating": "4", 
            "review": "Authentic church. This is still an active church so free for visitors and beautiful on the inside, it is a absolute must to visit when in st. Pete"
        }, 
        {
            "index": 224, 
            "rating": "5", 
            "review": "awesome working church. this is still a working church and again another unreal how pretty place to see while in peter. the size and scale of this place is amazing and the inside is beautiful . lite a candle and say a prayer while inside"
        }, 
        {
            "index": 225, 
            "rating": "5", 
            "review": "Day or Night, Clear or snow dusted -ever changing. It's Solid Grandeur and columns give this sense of a solid presence and nearly intimidates by day but by night it is just a sight that needs seeing and with a sprinkling or more of snow would be magical"
        }, 
        {
            "index": 226, 
            "rating": "5", 
            "review": "Worth seeing if time permites. I would like to note, that it is functioning cathedral, in contrast to the St. Isaac's Cathedral, that's why the entrance is free of charge. Very powerful building with a beautiful facade. I was on Saturday evening and got into the service, the choir sang very nicely."
        }, 
        {
            "index": 227, 
            "rating": "5", 
            "review": "Fantastic!. Fantastic building in the very heart of the city.It is a must.You have to visit it and take some pictures over there."
        }, 
        {
            "index": 228, 
            "rating": "5", 
            "review": "Fine building . Well worth a visit (we did so several times) to experience the importance of icons in Russian religious devotion. The cathedral is very atmospheric and quite dark. Many queue to pray to the icon of Our Lady of Kazan, but there are many other icons too."
        }, 
        {
            "index": 229, 
            "rating": "5", 
            "review": "Beautiful old church. I went here and just paid a few hundred rubles to go to the top of the church and look down on the outside view. I did not go to the interior of the church. The view from the top is pretty good though. The spiral staircase is nice, and 200 some steps). It is interesting that the stairs have such a big gap in between them, as opposed to Notre Dame in France where it al most feels claustrophobic when you go up the spiral staircase. This was not on my agenda, but I got lost and saw it in the distance so I figured I might as well stop. It was worth it, and it is obviously considered one of the big landmarks of St. Petersburg."
        }, 
        {
            "index": 230, 
            "rating": "3", 
            "review": "Not interesting compared to Spilled Blood and St Isaac's. Good if you want to see a service.. Interior is not decorated like the other sites in St. P's. This is a working church and while an impressive building, there is not a lot to keep you interested inside unless you want to be part of a service. You need to keep your head covered ladies, and hats off for the men. No photos inside."
        }, 
        {
            "index": 231, 
            "rating": "5", 
            "review": "Kazan Cathedral. very similar at Saint Pedro of Vatican\ntake picture in front of this fantastic Catheral\nafther this go in peace with your mind, to the interior of this Church"
        }, 
        {
            "index": 232, 
            "rating": "4", 
            "review": "Interesting church but be respectful as services take place. An Italian style church which was interesting but please be aware that services that place and so respectful behaviour is required and photos inside are not allowed."
        }, 
        {
            "index": 233, 
            "rating": "3", 
            "review": "Nicer on the outside. Interior is very plain. The best part is what you can see from the outside. Go to the Church on the Spilled Blood instead"
        }, 
        {
            "index": 234, 
            "rating": "5", 
            "review": "Beautiful. Amazing church inside and out! Most visit while in Saint Petersburg! Very distinguished architecture from the outside, amazing on the inside!"
        }, 
        {
            "index": 235, 
            "rating": "4", 
            "review": "Worth to visit. This great church is different from the others ,with big columns looks like a palace more than a cathedral ,by d way it's beautiful"
        }, 
        {
            "index": 236, 
            "rating": "5", 
            "review": "A moving experience. An impressive building, but what struck us most was the numbers of worshipers present during both of our visits. There were always queues to kiss the main icon and it was particularly good to see how many young people attended. Find a place to sit quietly and listen to one of the services - the deep bass of the priest at the altar answered by the women choristers high in the balcony is a memorable experience."
        }, 
        {
            "index": 237, 
            "rating": "5", 
            "review": "The Ceilings alone make it worthwhile. A must see and easy to access from the main strip. Most of the women cover their hair in here but it isn't mandatory. Bring your camera and a buck or two to light a candle. We were lucky and happened to be there on a wedding day and got to watch two lovely strangers getting married in a traditional ceremony with incredible singers and musicians performing."
        }, 
        {
            "index": 238, 
            "rating": "2", 
            "review": "Not interesting. I was very disappointed both by the exterior and interior of the building. The outside does not look like a church. It looks like the parliament building. When you enter the church, you do not feel that serenity you have in many other churches."
        }, 
        {
            "index": 239, 
            "rating": "5", 
            "review": "Interesting church as it is an active place of worship and not a museum. Active church. Looks like St Peters at the Vatican. Russian Orthodox Christian religion. Large number of icons with a large number of worshippers paying tribute by kissing the glass. Cover your head with a scarf to pay proper respect."
        }, 
        {
            "index": 240, 
            "rating": "4", 
            "review": "Kazan Cathedral. Of historical interest, purchases here at some stalls may only be made in Rubles however there is one near the exit that accepts the Euro as well."
        }, 
        {
            "index": 241, 
            "rating": "5", 
            "review": "Beautiful cathedral. Built in early 19th c. With semi-circular colonnade this is a striking building which contains a very early copy of the Our Lady of Kazan icon. Discovered underground in 1579 this icon was raised to Palladian status - that is to say an icon capable of defending the country. The original was stolen from Kazan in 1904 for its gold and bejewelled frame and the icon was probably destroyed , though this is disputed. The old copies in St Petersburg and Moscow are highly venerated and you will see the continuous queue waiting patiently to kiss the icon, which it is rumoured was carried round the fortifications during the ww2 siege."
        }, 
        {
            "index": 242, 
            "rating": "3", 
            "review": "another attraction near saviour of blood. entry is free, photography is prohibited, some part of the cathedral was undergoing some repair work, very peaceful place ."
        }, 
        {
            "index": 243, 
            "rating": "5", 
            "review": "Breathtaking. Design based on St.Peter's Cathedral in Rome a truly breathtaking monument built at the beginning of 19th century. Prayers to Mary Mother of God of Kazan believed to have helped conquer Napoleon in 1812. Beautifully restored after a stormy history in communist times. A MUST while in St.Petersburg."
        }, 
        {
            "index": 244, 
            "rating": "5", 
            "review": "One of a kind and magnificent Orthodox cathedral. Grand and very religious. It doesn't look like a cathedral from the outside. There are ongoing Orthodox religious processions for you to experience the atmosphere. It is one of the larget cathedrals in St. Pet. It resemble St. Peter's Basilica in Vatican City. The cathedral is the monument to glory of Russian arms. The famous Russian Field Marshal Mikhail Kutuzov, who won the most important campaign of 1812 against Napoleon was buried inside the Kazan Cathedral."
        }, 
        {
            "index": 245, 
            "rating": "5", 
            "review": "Grand church!. Kazan church was very near the apartment I stayed in Nevsky Prospekt and we were very impressed by the architecture. Instead of other churches that are museums, Kazan church is a functioning church with worshippers coming in droves. Everything here is done in grand scale and there is a long line of people to see the icon of Madonna. It has a very powerful vibe and when we were there, a wedding was taking place so we got to hear the accoustics of the place which was amazing. If you're on Nevsky prospekt drop by for a while and see the granduer of this beautiful and serene church."
        }, 
        {
            "index": 246, 
            "rating": "5", 
            "review": "Worth a short visit. Very cool cathedral in the middle of the city close to other attractions. It is free to visit and much less of a tourist atmosphere than Isaac's or Spilled Blood. Here it is quiet and there are services going on every day, so you should be quiet and respectful while inside. But it is very beautiful inside and has a different feeling because it is less of just a museum."
        }, 
        {
            "index": 247, 
            "rating": "5", 
            "review": "Very impressive Cathedral.. We were staying quite close to this Cathedral and visited it on a few occasions. It has a very attractive interior with beautiful icons and altar. It also contains historical artefacts from the Napoleonic wars."
        }, 
        {
            "index": 248, 
            "rating": "5", 
            "review": "A stunning free must see .. This cathedral is free to enter. It's situated just set off Nevsky prospect. The beautiful artwork and architecture is amazing. I noticed nearly all the women had a headscarf to cover their head , so it might be worth bringing one with you ."
        }, 
        {
            "index": 249, 
            "rating": "4", 
            "review": "Impressive Cathedral. Easy to get to along Nevsky Pr. Part of the outside is under of construction but if you are there well worth going in for a visit."
        }, 
        {
            "index": 250, 
            "rating": "4", 
            "review": "Another 18th /19th century Russian Orthodox Church. It is also known as Cathedral of Our Lady of Kazan and falls under the category of Russian Orthodox Church. It resembles St Peter's Basilica in Vatican City (Rome). Late in 19th century this Church also became the Centre of first political meeting. It would not be out of place to mention that today its the Mother Cathedral in St. Petersburg. I have been to Rome, Florence and Vatican and I find the architecture, doors and columns of this Church very much similar to the Cathedrals in those cities."
        }, 
        {
            "index": 251, 
            "rating": "5", 
            "review": "impressive. One of the most impressive church I've ever seen, enormous pillars and those floor tiles! Also the outside is awesome, so incredibly big!"
        }, 
        {
            "index": 252, 
            "rating": "3", 
            "review": "Under Restoration. Visited after The Hermitage museum. A lot of walking but not a lot to see at the Kazan as it was closed for restorations. Looked like a massive cleaning project had been carried out. You can obviously see the cleaned and the uncleaned parts of the cathedral."
        }, 
        {
            "index": 253, 
            "rating": "5", 
            "review": "A living beatiful church. Entrance: Free\nAmbience: A lot\nA live church: Yes (a wedding was in progress when we visited)\nBeatiful: Yes\nTrue to style: Yes\nPhotography: Not allowed"
        }, 
        {
            "index": 254, 
            "rating": "2", 
            "review": "Nice. Very impressive place to stay most amazingly maintained. Free nice to see\nWorth a visit near the center"
        }, 
        {
            "index": 255, 
            "rating": "5", 
            "review": "A must see!. In this cathedral there is a very highly revered Orthodox icon - Our Lady of Kazan, and the tomb of a Russian general as revered - Mihail Kutuzov. Like all Russian cathedrals and this is very big with beautiful icons.Interestingly that this Orthodox cathedral resembles the shape of St Peter church in Rome."
        }, 
        {
            "index": 256, 
            "rating": "3", 
            "review": "Question about outside; is this a churge?. This is a special building. From the outside one can hardly see that this is a church. Inside it is large, but not very special. The church is located close / next to the Nevski Prospect."
        }, 
        {
            "index": 257, 
            "rating": "5", 
            "review": "atmosphere!!!. at first I thought: 'oh well, just another orthodox church of splendour'. but already by entering I noticed it's different. even though it's a huge building one feels comfortable and some warmth. while I was in there a wedding took place. this wonderful mix of parishers, tourists and guests of the wedding gave the hall a special atmosphere. very respectful. this ceremony was wonderful. and obviously everyone inside kazan cathedral thought so, cause most were facing the ceremony. afterwards I walked around in the cathedral that bares orthodox art in many designs."
        }, 
        {
            "index": 258, 
            "rating": "3", 
            "review": "A good cathedral styled in lines of the Vatican. It is styled like the vatican. When i went, renovation work was happening on the exteriors so I could not get good pictures. But inside, it is quite calm and peaceful. It has a free entry and is not crowded with tourists."
        }, 
        {
            "index": 259, 
            "rating": "4", 
            "review": "Well worth a visit.. Well worth a stroll through this cathedral. Some stunning Russian iconography and a beautiful building."
        }, 
        {
            "index": 260, 
            "rating": "5", 
            "review": "Huge colonnades, huge church. Built in a western style with paintings of holy people, not the usual Russian church with frescoes adorning walls.The miracle icon of Our Lady of Kazan has a huge line of people to venerate it. Very quite and cool atmosphere"
        }, 
        {
            "index": 261, 
            "rating": "3", 
            "review": "St Petersburg's most important church. Quite a dramatic exterior but not the most imposing I felt. I've seen my fare share of churches and cathedrals this trip so perhaps I have church fatigue. Still, interior does have some nice pieces; the golden sun symbol is quite startling. No photos as usual inside but a 15 mins walk about inside will allow you to see everything."
        }, 
        {
            "index": 262, 
            "rating": "4", 
            "review": "interesting architecture. Impressive architecture. Interesting inside. It's a dhame you can't take photo's but on the other hand also understandable."
        }, 
        {
            "index": 263, 
            "rating": "4", 
            "review": "Kazan. Free entrance as far as i remember. Photos not authorized inside.\nallow about 30 minutes to enjoy this beautiful cathedral."
        }, 
        {
            "index": 264, 
            "rating": "3", 
            "review": "Historical place. Nothing so much. Always has activities inside. People go in and out the whole day.\nAround the area quite dirty"
        }, 
        {
            "index": 265, 
            "rating": "5", 
            "review": "Huge....Outstanding Cathedral!. Centrally located, about 7-10 minute walk before getting to the Chrst of the Spilled Blood Cathedral, and by Nevsky Prospect street (one of the main streets in St. Petersburg), the structure of this Church is monumental! I got in by a door on the left side, and as soon as I was inside I felt deeply in awe of the beautifullness of the icons and paintings, marvelous chandeliers....and the people...quietly and respectfully making line for kissing The Beloved Mother Mry....women still wearing scarfs to cover their heads....Solemn ! ......Moving experience! .....Highly recommended Cathedral to visit!"
        }, 
        {
            "index": 266, 
            "rating": "5", 
            "review": "Authentic and Unique Cathedral. This Cathedral near Metro Station at Nevsky Prospect, jump from the metro station turn right and around 200 meters you will find this. The take photography session will be great at evening, cause the sunlight will shine over the dome. maybe you can enter this cathedral, when i came there the cathedral have ceremoby so close for the public, the garden in front of Cathedral is very beautiful"
        }, 
        {
            "index": 267, 
            "rating": "4", 
            "review": "Kazan Cathedral St Petersburg. Lovely colonnaded exterior, does not really look like a cathedral from the outside. The interior is lovely, lots of icons and lovely altar. You are not supposed to take photos though lots where."
        }, 
        {
            "index": 268, 
            "rating": "3", 
            "review": "Try to go while the choir is singing. Indeed is a very beautiful building but not so different from any other orthodox Russian church. If you are already in the center it is worth a visit. Nevertheless if you plan to go there, make sure to go while they are having service and the choir is singing, them you have the perfect scenario to see and learn more about the traditions."
        }, 
        {
            "index": 269, 
            "rating": "4", 
            "review": "Majestic . I was not at all impressed with the st-peters knock off but so many people told us to go so I did. The inside is beautiful! A must see"
        }, 
        {
            "index": 270, 
            "rating": "4", 
            "review": "Beautifull. I prefer it at night because it is lighted and you can make great photos of it from the Nevsky avenue."
        }, 
        {
            "index": 271, 
            "rating": "4", 
            "review": "Nice attraction. Very impressive church both from the outside and the inside. Right on Nevskiy avenue, worth visiting while strollinng on St. Petersburg most touristic road. Very well lighted at night as well."
        }, 
        {
            "index": 272, 
            "rating": "5", 
            "review": "Piece of history. I middle of Newsky propect and in heart of city...beatifull old building at the moment under reconscruction,small park in front of it and opposite one of the most beatifull newsky building cafe singer,also opposite this popular canal with blood church."
        }, 
        {
            "index": 273, 
            "rating": "5", 
            "review": "Very Beautiful Cathedral in Central Location. This is a grand church, built in the style of St. Peter's in Rome. It has a most important icon to Our Lady of Kazan, venerated by Russian Orthodox worshippers. You will see long queues of folks waiting to pray at the icon. It has a most beautiful interior with many details, paintings and sculptures. You can easily visit without charge and may take photos discretely. It is very centrally located, across Nevsky Prospekt from the beautiful Singer building that has the very large bookshop, Dom Knigi. This is very much worth a visit to see the interior."
        }, 
        {
            "index": 274, 
            "rating": "5", 
            "review": "Make sure to visit. Be sure to head to the top and enjoy the view of the city.The orthodox Cathedral is found in the central city and easily accessible"
        }, 
        {
            "index": 275, 
            "rating": "4", 
            "review": "Free Entrance. It is one of the old Cathedral and on the main road and very close to Metro stn.inside is very huge and very well decorated. Being a Sunday we could watch some programme."
        }, 
        {
            "index": 276, 
            "rating": "5", 
            "review": "Very Beautiful Orthodox Cathedral in St. Petersburg!. Kazan Cathedral is the mother cathedral of the metropolis of St. Petersburg! Both exterior and interior are decorated with numerous columns. The interior is also decorated with spectacular sculptures and icons. One of the most beautiful cathedrals of St. Petersburg!"
        }, 
        {
            "index": 277, 
            "rating": "5", 
            "review": "Kazan Cathedral. There is no entrance fee . The place is an orthodox church . Picture taking inside is not allowed . Inside are lines of worshipper before the image of the VIrgin Mary . Outside the cathedral are seats where one can use to relax ."
        }, 
        {
            "index": 278, 
            "rating": "5", 
            "review": "Divine place. great cathedral .one will sure feel blessed when entering the holy place.must be visited location is easy to reach.all buses& trams stop infront of the cathedral .photography is not allowed inside the cathedral."
        }, 
        {
            "index": 279, 
            "rating": "3", 
            "review": "Centrally located historic Cathedral. Easily accessed central Cathedral, built in the spirit of Russian Cathedrals ,large and amazing!! No entrance fee.Well worth a visit !!"
        }, 
        {
            "index": 280, 
            "rating": "5", 
            "review": "Too stunning . Too stunning place and great and amazing sightseeing near nevski st .besid singer bulding also with blood savior view"
        }, 
        {
            "index": 281, 
            "rating": "3", 
            "review": "A working cathedral. It is a working cathedral of orthodox church in Nevskey Prospect.Enterance is free.when we went a service was going on and hence could attend an orthodox service which is a lot different to an anglican one."
        }, 
        {
            "index": 282, 
            "rating": "5", 
            "review": "Great. Photos don't reflect the size and beauty of it at all. When you are entering the cathedral you feel so small, amazing architecture, blown away."
        }, 
        {
            "index": 283, 
            "rating": "4", 
            "review": "Impressive. Very grand on the outside and, with its looks, you can imagine it as a parliamentary or congress building. Needs a bit of love and attention to the exterior but still a dominating sight. Inside is expansive but a lot darker than many other churches we visited. We dropped in twice and both times there was a form of religious service happening. Very much a working church."
        }, 
        {
            "index": 284, 
            "rating": "4", 
            "review": "Incredible Iconograpy. We happened to visit while a wedding was in progress, making the experience somewhat mystical. Beautiful icons and hundreds of candles throughout the cathedral make it the perfect sanctuary for an escape from the bustle of Nevsky Prospect."
        }, 
        {
            "index": 285, 
            "rating": "5", 
            "review": "Beautiful. Unlike Saviour on spilled blood, or St. Isaac's, its a fully functioning, beautiful cathedral. Feels a bit odd to be walking and staring when people around you are praying. But a beautiful building nonetheless"
        }, 
        {
            "index": 286, 
            "rating": "4", 
            "review": "Impressive and symmetrical. Impressive building, I only checked it out from the outside. There's a small park in front of it with benches and fountains, inviting visitors to rest and contemplate. it's right at the busy nevsky prospekt, so it's not the quietest place."
        }, 
        {
            "index": 287, 
            "rating": "5", 
            "review": "Solemn. The outside looks quite severe and powerful, based on St Peter's, but given a military overtone to fit the early 19th century wars, but inside it is stunning to see hundreds of people, mainly women, worshipping at particular paintings, making the sign of the cross and kissing the portrait, lighting candles, and having a long queue to pray at the Our Lady of Kazan icon. The church itself is not as colourful on the inside as many churches, but makes up for this by being a living, breathing church full of worshippers. Quite humbling."
        }, 
        {
            "index": 288, 
            "rating": "5", 
            "review": "OUR FIRST STOP IN ST. PETERSBURG. We only saw from the outside but very impressive to see. Next trip we will go inside but we had so much planned this 3-day shore excursion we were happy to just see the outside of Kazan."
        }, 
        {
            "index": 289, 
            "rating": "4", 
            "review": "\"The most....\". Do not be misled into thinking that this epithet could \"be skipped\" for something you see in St Petersburg! One way or another, you will see only what is \"the most\" here :)If you do not like \"an attraction\" from one side, just circle it around! This time you will see \"the most\" refined and delicate bars from cast iron - Voronikhin's Bar which is by its perfect proportions and 'lace' appearance is attributed to the pearls of High Classicism! Enjoy!"
        }, 
        {
            "index": 290, 
            "rating": "5", 
            "review": "Grand!. What an amazing building. Kazan looks very impressive from the outside, and it is equally impressive on the inside. There is something special about being in a Cathedral that is full of local women in scarves doing \"their thing\", honouring saints, adoring the Madonna, lighting candles, praying in the dimly lit interior. Beautiful. Women should wear a scarf over their head. Take one in your bag for all cathedrals and churches,"
        }, 
        {
            "index": 291, 
            "rating": "4", 
            "review": "Impressive cathedral complex on the main street. Kazan Cathedral has a very impressive front gallery with 2 arms of very big granite colonades that envelope the front garden. The columns continues inside the cathedral. The inside is also very nice with lots of gilded work, paintings, etc. I particularly like the big gilden sun over the door into the inner sanctum. Since there are so many nice cathedral, I would say the unique thing about Kazan really is the colonades outside."
        }, 
        {
            "index": 292, 
            "rating": "3", 
            "review": "Not as Beautiful as the Others. this is a church and not a museum. Live service was in progress while we were there. It is a magnificent structure, just not as ornate and as beautiful as the others. Save this for last if you have limited time."
        }, 
        {
            "index": 293, 
            "rating": "5", 
            "review": "Large Simple Beautiful Place Of Worship. Would recommend visiting Kazan Cathedral to get a glimpse of the Russian faithful. Not over the top in decor which is refreshing. Projects a calm serene energy. Not over run by large groups and has free admission. Simply beautiful."
        }, 
        {
            "index": 294, 
            "rating": "5", 
            "review": "Meaning church. This is a beautiful church but also of great significance to the Russian people. Most of the Eastern Orthodox churches in Russia require women to wear a head cover and this one is no different. There is a beautiful rose garden in front."
        }, 
        {
            "index": 295, 
            "rating": "5", 
            "review": "Grand. This is a grand cathedral just out side the metro station. Very easy access and once inside it is quiet and grand. The front of the cathedral is behind an arch of huge columns that belie the fact that right behind this is a huge cathedral.The insides have beautiful stained glass windows and so many artifacts that one looses focus.The prayer are is separate and so tourists can move around."
        }, 
        {
            "index": 296, 
            "rating": "4", 
            "review": "Vatican Copy..... Another Kazan Cathedral (one of the most venerated icon within the Russian Culture), this in particular was design by Voronikhin as a copy of St. Peters Basilica in the Vatican. Consider as an offense by many while it was constructed, it was finalized in the capital of the Empire at the time, in what it was a show of opulence. As a symbol, the Kazan Cathedral was involve in even the Napoleonic wars and was the place of the first political Demonstration in Russia. With different uses during a long period of time, now a days serves a Cathedral since 1992, when it was returned to the Russian Orthodox Church. An interesting place to visit...."
        }, 
        {
            "index": 297, 
            "rating": "4", 
            "review": "Beautiful Cathedral. We visited the Orthodox Kazan Cathedral on a Sunday afternoon. The faithful waited in a long line to kiss the holy relic, the Icon of Our Lady of Kazan. The icon was discovered in a tunnel under the city of Kazan and distributed to Russian cities. The relic here was missing for many years. Even though it is a replica it is venerated none the less. The interior of the church is dim with dazzling gold and silver. The exterior with its long curving portico and columns resembles St. Pete's in Rome. There is a lovely park with a water fountain in front of the church. On this sunny afternoon, it was a great place to people watch."
        }, 
        {
            "index": 298, 
            "rating": "4", 
            "review": "A church, not a museum. It was a privilege to be able to witness an Orthodox service and to see the people lining up to kiss the icon. A different slice of life in this very touristy part of the city."
        }, 
        {
            "index": 299, 
            "rating": "4", 
            "review": "St. Petersburg City Highlight!. Located on the main Nevsky prospect, it is convenient to visit either by the Metro or by taking a bus which stops right in front of the Cathedral. Very impressive colonnade! Reminded me of a Court of Justice or the Vatican City, though on a much smaller scale. Interior was a little dark. Attraction within is to get to kiss the icon of Our lady of Kazan. One may have to queue up to do this. The Cathedral closes at about 8 p.m. so you can make it the last on your itinerary for the day."
        }, 
        {
            "index": 300, 
            "rating": "5", 
            "review": "Great Cathedral. Great Cathedral where you can see a lot of locals going there to pray. This is one of more others churches what you can enjoy in Petersburg."
        }, 
        {
            "index": 301, 
            "rating": "5", 
            "review": "One of the most beautiful places. To call it the best place in St. Petersburg is an overstatement. Every 500 m, you come across a monument or a church or a square and you forget which one is the best.Nevertheless, this cathedral is beautiful and if you enter the Singer Building (the VKONTAKT hq is on the 5th, 6th and 7th floor while the cafe is on rhe 2nd) you will not be disappointed with the view."
        }, 
        {
            "index": 302, 
            "rating": "2", 
            "review": "Not special. Visit this when you're nearby and have plenty of time to loose.when not, stay away. There's much more interesting churches in St Petersburg than this one. The place could also use some restauration works"
        }, 
        {
            "index": 303, 
            "rating": "4", 
            "review": "A working Cathedral. We were fortunate enough to visit while a service was going on. If you are passing by it is well worth going in to view the interior."
        }, 
        {
            "index": 304, 
            "rating": "4", 
            "review": "Beautiful. Very impressive structure as from outside as well as inside. The church is working. You can order a tour right inside. The fountain in front is very nice and always overcrowded."
        }, 
        {
            "index": 305, 
            "rating": "5", 
            "review": "Well worth a visit. This beautiful Cathedral had many beautiful stained glass windows and lavish decoration. A special place of peace used by many genuine worshipers."
        }, 
        {
            "index": 306, 
            "rating": "5", 
            "review": "Victor over Napoleon. The Cathedral has a large statue of Kuznetzov outside and a well-tended grave inside.It is a working church and most worshippers have come to see the Icon of Our Lady of Kazan."
        }, 
        {
            "index": 307, 
            "rating": "5", 
            "review": "Stunning interior. Built to house a famous icon Kazan is a functioning church where the faithful go to express their devotion to Our Lady of Kazan. The exterior is patterned on St. Peter's in Rome. The interior is stunning. The crowds of faithful even more stunning. Less baroque than most cathedrals. Well worth a visit."
        }, 
        {
            "index": 308, 
            "rating": "5", 
            "review": "Spiritual Cathedral. if you wanna see the copy of saint Pedro cathedral in Russia do not hesitate to visit Kazan Cathedral in Saint Peters burg. the cathedral is active and you are not allowed to speak or take photo but some take photo and nothing happen. you can also visit General Kotozov's tomb in the cathedral and copy of Christ confine."
        }, 
        {
            "index": 309, 
            "rating": "5", 
            "review": "Another Gem. Kazan cathedral is another of St Pete's religious gems. Based on the design of St Peter's in Rome this church is another feast for the senses. Phenomenal architecture and the artworks inside are truly beautiful. Its location right on the Nevskiy Prospekt and the banks of the Griboyedova canal is spectacular and it has a small park right outside with a fountain. This Is still an active place of worship so be respectful of worshippers but this another spectacular church which should be on your list when visiting St. Petersburg."
        }, 
        {
            "index": 310, 
            "rating": "4", 
            "review": "Interesting cathedral. The catedral will instantly remind you of a miniscule rendition of Saint Peter´s Basilica in Rome. The building in currently being restored and looks much better with the clean stone. Historically very interesting."
        }, 
        {
            "index": 311, 
            "rating": "4", 
            "review": "Gloomy grandeur. This mini St Peters Rome with its colonaded arcs either side is built to stand forever. Very solid affair. Inside it is all rather dark. Many people queuing to kiss/pray to our Lady of Kazan - a copy of one of Russia's most important icons. Worth a look as it is Tsar Paul's attempt to bring together the Russian Orthodox religion and Catholicism."
        }, 
        {
            "index": 312, 
            "rating": "4", 
            "review": "Good contrast to St Isaac's. Spacious and in a very different style to St Isaac's cathedral, this is another pleasant visit. Very large icons!"
        }, 
        {
            "index": 313, 
            "rating": "5", 
            "review": "Very beautiful church!. One of the most amazing churches in our country what make you to feel real Russia. If you are first time in Russia than go to Moscow to see St Basil Church, because one architect made these two churches."
        }, 
        {
            "index": 314, 
            "rating": "5", 
            "review": "A Cathederal Building on a mamouth scale. Thr decour was typical of a Russian Orthodox Church whilst the interior lighting was somewhat on the darker side.Here we witnessed a church wedding coplete with a choir singing."
        }, 
        {
            "index": 315, 
            "rating": "5", 
            "review": "A very impressive building and campus. Could not see the inside; this is now a concert venue. Beautiful garden open to the public with a grand fountain and benches to relax on."
        }, 
        {
            "index": 316, 
            "rating": "5", 
            "review": "You have to see it!. Very nice place to visit. This one of the best places of St. Petersburg. Located in the center city and all other places to visit are very close."
        }, 
        {
            "index": 317, 
            "rating": "3", 
            "review": "nice working cathedral - very busy with tourist, no audio guide. free entrance, nice ceremony, beautiful singing, well decorated. - very busy with tourist, no audio guide, . Do not use St-Petersburg Card... it is a waste of money and most important attraction in St-Petersburg are not included (hermitage, peterhoff palace, Catherine palace, imperial porcelain museum, and many other sites; you will either only recuperate 30% to break even..."
        }, 
        {
            "index": 318, 
            "rating": "4", 
            "review": "Working church. We used \"Best Guides\" tour company in St. Petersburg. They took care of our travel visa! This was a nice serene stop in our tour. There was a service going on while we were there. It was a chance to see Russian life as a local."
        }, 
        {
            "index": 319, 
            "rating": "4", 
            "review": "Nice. Located on the Nevsky prospekt, this church is different to other churches in St Petersburg. It was built by an Italian architect and reminds the italian Basilica."
        }, 
        {
            "index": 320, 
            "rating": "3", 
            "review": "Huge but not magnificent. Another cathedral to visit but third in my list for churches in Saint Petersburg. If you have the time pay it a visit."
        }, 
        {
            "index": 321, 
            "rating": "5", 
            "review": "Well worth a visit to experience Russian Orthodoxy. Not the most subtle of buildings, it's imposing presence on Nevsky Prospect almost demands a visit! The interior is dark and moody, saturated with the sent of incense. It is impressive. Women are encouraged to cover their hair, although I did see women who hadn't done so and this didn't seem to be an issue. The ubiquitous religious shop is at the entry and indeed looking at what people are doing is interesting there as well. No photography is allowed."
        }, 
        {
            "index": 322, 
            "rating": "5", 
            "review": "Grand Monument. This Cathedral is must visit for tourists and entry ticket is 250 py6 which permits you to admire the rich interiors of this Cathedral. It is 10 mins walk from Nevsky Prospect."
        }, 
        {
            "index": 323, 
            "rating": "5", 
            "review": "Unusual exterior. the columns reflect those of the Vatican and make an imposing entrance. the interior is llovely and there are some fabulous icons. well worth a visit."
        }, 
        {
            "index": 324, 
            "rating": "5", 
            "review": "An island of peace in the middle of a city.. The people, normal people, are to be seen here to say a quiet prayer or to share a thought in the heart of the city. If lucky, you'll visit coincides with a service; the chanting is beautiful, you just have to sit down and settle down. Only crack to the serenity is presented by an occasional group of tourists with their selfie sticks. Leave them."
        }, 
        {
            "index": 325, 
            "rating": "4", 
            "review": "With respect. This is a place of worship so be respectful while visiting. There was a service in progress during our visit and a queue to pray at the icon of Our Lady of Kazan. A good place for some quiet time away from the bustle of Nevskiy Prospekt"
        }, 
        {
            "index": 326, 
            "rating": "5", 
            "review": "Step inside, don't rely on the external look. Just wonderful inside. Another extremely beautiful and awesome cathedral. Extremely worth of visiting. Outside maybe slightly rugged but don't let it mislead."
        }, 
        {
            "index": 327, 
            "rating": "3", 
            "review": "visit in eastern april 2015. i visit in time of ceremony . it is nice clean , inside with some shopping buffets and nice pictures"
        }, 
        {
            "index": 328, 
            "rating": "4", 
            "review": "Go inside... This place is huge and impressive but the best bit is on the inside! I was impressed by the size of it while we walked around but it's only when we entered did we discover the real beauty. This place is so spiritual, it feels old and it feels authentic. I'm not a religious person but it certainly made me feel that way!"
        }, 
        {
            "index": 329, 
            "rating": "5", 
            "review": "An impressive building though the real beauty is inside. Firstly the Kazan Cathedral is a fully working church so it doesn't have the same information or guides as the likes of St Isaac's. This means no photos as well but it also means it is free to go in.The building itself is impressive and worth walking all the way round the small grounds. Inside are fabulous icons and impressive, if opulent decoration. Again to see a large part of the art work you need to walk around looking up but well worth the a slight crick in the neck.I visited on Easter Sunday and everything was in full flow which was an added bonus.This is a short walk from the Winter Palace, etc on Nevesky Prospect and well worth a small amount of shoe leather."
        }, 
        {
            "index": 330, 
            "rating": "5", 
            "review": "Beautiful. There was a service there when I went and it was a truest amazing experience. Went back again to show my friend"
        }, 
        {
            "index": 331, 
            "rating": "3", 
            "review": "Beautiful but there are better ones. Yes is big and beautiful, but in Saint Petersburg there are other churches which are much more remarkable."
        }, 
        {
            "index": 332, 
            "rating": "5", 
            "review": "Amazing place. A fully working church so need to be carefully about moving around but well worth a stop to look around."
        }, 
        {
            "index": 333, 
            "rating": "3", 
            "review": "Rather dull and drab for a church. This church is much more appealing to worshippers than those interested in art or history. Many worshippers were making the rounds of all the icons, with prayers before each one"
        }, 
        {
            "index": 334, 
            "rating": "5", 
            "review": "Well worth a visit.. We were able to take photos in here as there was a lot of others doing the same, it may depend on who is running the place at the time of your visit.\nA great experience and would suggest that if you are passing this Cathedral pop in and be pleasantly surprised at how beautiful the interior it too."
        }, 
        {
            "index": 335, 
            "rating": "5", 
            "review": "Can't take pictures inside. Very serene cathedral. You will need to cover your head with a scarf if you are female. The interiors are beautiful!"
        }, 
        {
            "index": 336, 
            "rating": "4", 
            "review": "great ortodox ceremony. by chance we stumled on an ortodox religious ceremony, my first, very impressive, especially the chorals, at both ends of the church simultaneously. otherwise church is more impressive from the outside"
        }, 
        {
            "index": 337, 
            "rating": "5", 
            "review": "Fabulous cathedral!. Kazanskiy Kafedralniy Sobor (Kazan Cathedral), also known as the Cathedral of Our Lady of Kazan is one of the largest churches in St. Petersburg. Here, the famous Russian Field Marshal Mikhail Illarionovich Kutuzov himself is interred. Built in 1801-1811 by architect A. Voronikhin, the cathedral is consecrated to the miraculous icon of Our Lady of Kazan. In 1932, the cathedral turned into a museum of the history of religion. Since 1991, services were resumed and from 2000, the cathedral returned to the Russian Orthodox church and was ascribed to the eparchy of St. Petersburg. Emperor Paul wanted the cathedral to resemble the St. Peter's cathedral basilica in Rome. To achieve the demands, a tremendous colonnade consisting of 96 columns was erected in front of the northern facade."
        }, 
        {
            "index": 338, 
            "rating": "4", 
            "review": "Interesting and larger than it looks from outside. An interesting Cathedral with a different design. It is modeled on the St Peters Basilica in Rome so has a familiar look about it. It is far larger than it looks from it's exterior when viewed from Nevsky Prospekt.It is still a working church today and a focus for worship by many Russians as it is also partly seen as a memorial to the Russian victory over Napoleon.It is dedicated to Our Lady of Kazan, one of the holiest icons in Russia.Visited February 2013"
        }, 
        {
            "index": 339, 
            "rating": "4", 
            "review": "Wonderful. On Nevsky Prospect and easy to get to but definitely worth a visit as you stroll up the street. It doesn't really look like a cathedral from the out side but inside it definitely is. Beautifully decorated and quite impressive."
        }, 
        {
            "index": 340, 
            "rating": "4", 
            "review": "Imposing. I cannot tell you precisely why I find this cathedral ugly, but it is at least ugly in a somewhat interesting way. It is worth a stop inside. Be aware that it is a working church, so you will find worshippers inside (including a long line of people waiting to pay homage to the famous Our Lady of Kazan icon). Also, you cannot take photographs, though the cathedral interior, all grey marble with even deeper grey detailing, is probably too dark anyway."
        }, 
        {
            "index": 341, 
            "rating": "4", 
            "review": "Lovely. Very impressive both inside and out. The interior is especially wonderful and we were lucky enough to be there for a service which added to the enjoyment."
        }, 
        {
            "index": 342, 
            "rating": "5", 
            "review": "Old world. Absolutely vast building and incredible inside, the air is thick with incense and there are icons everywhere which people will queue infront of to say their prayers to and also to kiss. Photos are allowed although not with flash. There is a gift shop which sells lovely trinkets and although nobody tells you to, its expected that you should cover your head out of respect."
        }, 
        {
            "index": 343, 
            "rating": "4", 
            "review": "A symbol of petersburg. It is a huge building and a must visit place. Inside is like a church and there is no entrance fee. There is religious practice at nights."
        }, 
        {
            "index": 344, 
            "rating": "4", 
            "review": "Large and Grand on a Grand Street. This huge fronted Cathedral makes a strong statement as is resides Predominantly on Nevsky Prospect. Externally and internally it is worth visiting and consuming. After way too many decades of neglect it wasn't til the mid 90's that this building started to come back to life."
        }, 
        {
            "index": 345, 
            "rating": "4", 
            "review": "Same as St. Isaacs - nice to look at for 15 minutes and then move on. There isn't much to see besides the statue of the general at the front and then admire the beautiful colonnade (which still has imperfections post WW2!) - it's something to take in briefly as you stroll Nevsky Prospect to get a feel of the vibe of the city"
        }, 
        {
            "index": 346, 
            "rating": "2", 
            "review": "I wish I had known. I walked by this Cathedral every day I was in St Petersburg, even went in once. It seemed really ordinary. Then when I read some of the reviews, I discovered that there was singing/ chanting during the services. I realized I missed something I know I would have loved. So although my experience was \"poor\", yours could be \"excellent \" if you managed to time your visit to the services."
        }, 
        {
            "index": 347, 
            "rating": "4", 
            "review": "Kazan at christmas. During the festive period they have a beautiful christmas tree lit up outside the cathedral. This looked extra special in the winter snow. The cathedral is on the citys main street, Nevsky Prospekt and is walking distance to all the main attractions."
        }, 
        {
            "index": 348, 
            "rating": "4", 
            "review": "Dirty on the outside but beautiful on the inside. Huge cathedral which looks like it could use a big renovation. But on the inside beautiful with lots of icons. Even more beautiful when the choir is singing."
        }, 
        {
            "index": 349, 
            "rating": "4", 
            "review": "The Roman Orthodox Church. The main entrance of this early 19th Cent. Orthodox Cathedral occupies an impressive situation in the city’s main street, Nevsky Prospekt. You would be hard pressed to recognize it as an Orthodox structure, as it has only a single enormous dome without any of the traditional onion skin decorations, and is flanked on both sides by an extensive colonnade. This ambivalence stems from the curious paradox that its design was inspired by that of St. Peter’s in Rome, and can be construed as an ecumenical gesture towards the Roman Catholic Church aimed at improving relations between the two great early branches of Christianity. Unlike its Roman model, the area in front is covered by a well manicured lawn that includes a single vertical fountain. Not only Rome, but Florence also managed to get involved in the complimentary plagiarism, since the large doors of the Cathedral imitate those that Ghiberti created for the Florence Baptistery. The interior has much more to tell us about Russian history, as it was completed only a year before Napoleon’s invasion, and his nemesis ---- Field-Marshall Kutuzov ----- is buried within. He is reputed to have dedicated his ultimate victory to Our Lady of Kazan, a celebrated icon whose intervention he sought, and that was embedded in the iconostasis of the newly-built Cathedral. The sacristy also contains the keys of many European cities and castles that were conquered by the Russian Army prior to Napoleon’s downfall at Waterloo. The height of the interior is emphasized by the immensity of the dome, and the height of the many pillars within. The church is well endowed with fine works of religious art ---- sculptures and icons ---- produced for the original by some of the greatest Russian craftsmen of the day. After the 1917 Revolution, it suffered the customary fate of conversion to a Museum of Religion and Atheism, and only in 1996 was it returned to the Orthodox Church for public worship. It is now considered to be the Mother Church of St. Petersburg’s Orthodox Community, and as such is certainly well worth while getting to know."
        }, 
        {
            "index": 350, 
            "rating": "4", 
            "review": "Beautiful building in St P. This was built to rival the Vatican in Rome and looks like it.We were fortunate to see a Russian wedding taking place when we visited. Go with your camera during the day and again at night when it's lit up."
        }, 
        {
            "index": 351, 
            "rating": "4", 
            "review": "Impressive place. Impressive building and active church, worth a stop on your explorations of the city. Beautiful inside with many mementos of past battles. Some unit standards from the war with Napoleon honoring the general that won the battle."
        }, 
        {
            "index": 352, 
            "rating": "5", 
            "review": "Stunning. One of the most Beautiful awe inspiring churches in St Petersburg, within easy walk of our hotel. The history attached to it is most interesting and out guide filled us in on all it's details. Do not miss this Cathedral"
        }, 
        {
            "index": 353, 
            "rating": "4", 
            "review": "Just walked around ant it was nice. Just walked around when was on Nevskiy Prospect and it was nice. Never been inside. Seems that it is still working orthodox church."
        }, 
        {
            "index": 354, 
            "rating": "4", 
            "review": "Stunning building. This cathedral is simply stunning, sitting just back off Nevsky Prospect, right by the metro. Looks good during daylight but simply magnificent by night (have your camera at the ready). Has retained all its ancient charm internally. Worth a browse around if you like these types of buildings as I do."
        }, 
        {
            "index": 355, 
            "rating": "5", 
            "review": "Kazan Icon worth a visit. Russian Field Marshall Mikhall Kutuzov, who defeated Napolean in 1812 is buried inside. The elegance & simplicity of the interior of the cathedral is quite stunning."
        }, 
        {
            "index": 356, 
            "rating": "5", 
            "review": "Beautiful. On Nevskiy Prospect, this is well-worth a visit. We were lucky enough to be there when a service was taking place. The singing was out of this world..."
        }, 
        {
            "index": 357, 
            "rating": "4", 
            "review": "Worth a visit. It's a church that people still line up to kiss the portrait!\nFrom outside, the architecture resembles St. Peters in Rome, in a much smaller scale of course.\nInside, a beautiful church glistering in gold, covered with paintings and a soaring dome.\nAbsolutely worth a visit if you are into architecture, and it's free."
        }, 
        {
            "index": 358, 
            "rating": "5", 
            "review": "Impressive building. This building is one of the most impressive ones in St. Petersburg. You can't miss it because it is alongside Nevsky avenue.Although it seems big, the Cathedral itself is small (relatively speaking).Go there in the morning when there is a mass between 9 and 10am. You will see how they celebrate it. Very powerful choir and people standing all the time. There is a lot of movement inside and it is very beautifully decorated.Free entrance but no pictures allowed.Woman must wear a scarf on their head and men without hat.I like it very much."
        }, 
        {
            "index": 359, 
            "rating": "5", 
            "review": "imposing on the outside, a gem on the inside. Centrally located near the Nevskiy Prospect shops, hotels and restaurants. I bustled past it several times before venturing in, Glad I did - it was an unexpected treasure."
        }, 
        {
            "index": 360, 
            "rating": "5", 
            "review": "Loved It!. It looks intimidating from the outside with it's massive pillars forming a colonnaded crescent. As you wonder through the doors of this Russian Orthodox Cathedral you will be captivated by it's magnificence. It's a working church so there will be locals going about their daily rituals and prayers. Highly recommended!"
        }, 
        {
            "index": 361, 
            "rating": "5", 
            "review": "Great place. We stayed about a minute away from here and so passed it every day intending on going in on our last day which we did. From the outside it looks big, ok, nothing too special - and then you get inside. No fee. It was just great. I stayed a while inside looking at all the different areas and the roof etc. It really was fantastic. Husband was told to go outside as he only had a singlet on so had to wait for me for a while as I could not get enough. Def recommend going here."
        }, 
        {
            "index": 362, 
            "rating": "5", 
            "review": "Lovely Cathedral. This is a working orthodox cathedral and has a very nice interior. It is free entry and I would recommend a visit."
        }, 
        {
            "index": 363, 
            "rating": "4", 
            "review": "Beautiful cathedral. The Kazan Cathedral is amazingly beautiful. An orthodox church which from the outside looks more like a museum, but once inside you forget what the exterior looks like. Everywhere you look, every inch is a piece of art. I enjoyed watching the locals partake in their prayers and rituals around the cathedral, especially a picture of Kazan herself. People queue for over 20 minutes to pray and kiss the picture of \"Our Lady of Kazan\". Such an amazing sight."
        }, 
        {
            "index": 364, 
            "rating": "5", 
            "review": "very nice.. Kazan's cathedral located on the main avenu Nevskiy prospect and Griboedov canal.In the USSR time was ateism museum.Present moment orthodox church.It is very beautiful architecture .front of cathedral nice lilac's trees blooming on the spring.Across street bigest and oldest Books House."
        }, 
        {
            "index": 365, 
            "rating": "5", 
            "review": "Beautiful and breath taking. Very remarkable church and amazing architecture. There is no fee for entrance and walking around inside was well worth visiting!"
        }, 
        {
            "index": 366, 
            "rating": "4", 
            "review": "Still functioning Russian Orthodox Cathedral. No photographs are allowed since this is a still functioning cathedral. The many icons on display were very interesting and the feeling inside is very serene. Many Orthodox pilgrimage to this cathedral to pray to a famous icon."
        }, 
        {
            "index": 367, 
            "rating": "4", 
            "review": "Kazan. The outside is very interesting. Doesn't really look like a church. This Russian Orthodox Church has an amazing altar. Full of silver where most are in gold. The icons are great."
        }, 
        {
            "index": 368, 
            "rating": "4", 
            "review": "An extraordinary cathedral to feel the spirit of religion. From the outside I never guesses what was waiting for me inside. The beauty of the cathedral with so many people praying in front of different icons was overwhelming me. It was just entering a different world and feeling the spirit of the praers. The interior is beautifuk, the size is stunning and the athmosphere was really catching me. Take your time and you won't regret it."
        }, 
        {
            "index": 369, 
            "rating": "5", 
            "review": "impressive. we visited on a Saturday and a service was taking place in one corner of this big cathedral....so wonderful to stand quietly and have an insight into another faith and their way of life."
        }, 
        {
            "index": 370, 
            "rating": "5", 
            "review": "An actual working Cathedral. St. Isaac Cathedral is not a place of worship. It is a museum. Our Lady of Kazan is a worshipful church. There are many who are in the cathedral to only worship or pray in front of an icon. The outside of the cathedral does not prepare you for the beauty within. I sat for half and hour to pray and could feel the prayers of people who have prayed there for the last couple hundred years. The beauty of the interior and the worshipful atmosphere make this extraordinary church a must visit."
        }, 
        {
            "index": 371, 
            "rating": "5", 
            "review": "Another fantastic church. Reminding a bit of St. Peter's Church in Rome, the Kazan offers a wonderful exteriour as well as an impressive inside. It was an ongoing service while we were there so couldn't walk freely around, however we got a very good impression of the grandeur of this place."
        }, 
        {
            "index": 372, 
            "rating": "5", 
            "review": "Can't miss the Kazan Cathedral. There's plenty of big buildings to see in St Petersburg, and the Kazan Cathedral is another one not to miss. it's also a great landmark to use as a meeting point if you are all shopping in different directions on the Nevsky Prospect. Our shuttle bus left from just behind the Kazan Cathedral"
        }, 
        {
            "index": 373, 
            "rating": "5", 
            "review": "Another stunning site in St. Petersburg. We made a quick stop in this cathedral at the end of our visit. It is stunning inside. It definitely is worth a much longer visit. Lots to see and absorb. Long line of pilgrims to visit a relic that is located here. This will be on my list of must -sees for my next visit."
        }, 
        {
            "index": 374, 
            "rating": "5", 
            "review": "Magnificent and Majestic Cathedral. It's very stunning, magnificent and majestic cathedral especially their neoclassic style architect. I don't see a lot of cathedral designing like this place in St. Petersburg."
        }, 
        {
            "index": 375, 
            "rating": "5", 
            "review": "Try and catch a Russian Orthodox service. We went in early in the morning on a weekday and there was a service going on, there were several clergymen with banners doing the stations of the cross followed by a steady stream of old women with headscarves. For anyone who hasn't seen a Russian Orthodox service, its well worth going to. All of it sung, when the priests aren't singing the parishioners do and when neither of them are, there is a choir in the eves singing. The Cathedral itself is great, there is a special place received fro the Romanovs and their paintings are on the walls. As the church celebrates the defeat of Napoleon at Borodino their are several French battle standards on display which would be of great interest to anyone interested in history or literature. The emphasis on the victory is heightened by the approach into the Cathedral which is flanked on either side by (I think) large statues of Kutuzov and De Tolly. Its certainly worth a pop in!"
        }, 
        {
            "index": 376, 
            "rating": "4", 
            "review": "Atypical. Free. Atypical architecture. The part located on the main street (Nevsky Prospekt) is actually the back of the cathedral. Entrance is free. You can take pictures inside. It contains the mostf venerate icon of Russia. Long queues are formed to kiss the icon."
        }, 
        {
            "index": 377, 
            "rating": "4", 
            "review": "atmospheric and remarkable. If the Orthodox religion wishes to emhasize atmosphere over intellect, it achieves this is spades. Piety and aesthetics meet here. The queue for those kissing the icon was very impressive"
        }, 
        {
            "index": 378, 
            "rating": "4", 
            "review": "Fascinating View of the Russian Soul. This church isn't the quintessential onion dome church. It has a Roman colonnade in front and doesn't fit our western idea of a Russian church. However, this is a true working church and is not attempting to cater to tourists. Be respectful. Don't take photographs. You will see a true place of worship. Try to understand the long lines of people waiting to kiss the icon of Our Lady of Kazan and what it means to them. See the hundreds of candles lit in front of the icons. This was all very different from my western religious experience, and gave me a fascinating glimpse of something very different. Appreciate it, but don't intrude."
        }, 
        {
            "index": 379, 
            "rating": "5", 
            "review": "Well worth a visit!. Incredible curving double colonnade facade, on a mighty scale frets your first look from the Nevskij Prospect. The interior is equally grandiose and sombre in tone compared to other places of worship in SP and well worth a visit."
        }, 
        {
            "index": 380, 
            "rating": "3", 
            "review": "You'll walk past it for sure. Take a photo of the facade and you're set.. You'll pass by it for sure as you walk around the Nevsky Prospect to feel the rhythm of the city. Is it particularly worth exploring? No, not really. But it's a marvellous view of the facade and the Kutuzov statue from the outside and you'll definitely get a photo there. Still, probably best keep walking past and dedicate more time to Saviour on Spilled Blood."
        }, 
        {
            "index": 381, 
            "rating": "4", 
            "review": "Beautiful church. This is an active church and a service was in progress when we visited. Out of respect we didn't take photos. Again a beautiful church."
        }, 
        {
            "index": 382, 
            "rating": "5", 
            "review": "Accessible. This is a most accessible cathedral, being on Nevskiy Prospect. Parts of the cathedral are roped off for people worshiping. There is a palpable reverence as many people go about their religious rituals. Could be a good idea to carry a small scarf if you intend visiting.Interesting that there are photos of the interior posted on Trip Advisor when there are clear signs on the doors saying no photos!! This also seems disrespectful while in a 'working church'."
        }, 
        {
            "index": 383, 
            "rating": "5", 
            "review": "A Must See!. The Cathedral of Our Lady of Kazan is a definite must see when in St. Petersburg. The interior is beautiful and it's moving to see many locals coming to pray before the miraculous icon of Our Lady of Kazan. There's also a large icon devoted to the last imperial family and the grave of Marshall Kutuzov who helped defeat Napoleon. Unlike the other large cathedrals in the city, this one is a working house of worship and so one gets a feel for the beauty of the rituals of the Russian Orthodox church and the devotion of the locals. Also, be sure to check out the icons being sold, they are very reasonably priced. All in all, highly recommended!"
        }, 
        {
            "index": 384, 
            "rating": "4", 
            "review": "Very nice.. Located right on the main street of St. Petersburg. It's very beatifull and you can have nice pictures there. During the summer it's a very nice place to spend few hours with your friends. We loved it."
        }, 
        {
            "index": 385, 
            "rating": "5", 
            "review": "special. This cathedral has a unique architecture ,and inside you will find some magnificent master pieces,I highly recommend visiting this place from inside and out."
        }, 
        {
            "index": 386, 
            "rating": "4", 
            "review": "Spiritual experince. We attended the 7h00 service on the Sunday morning. The choir members stand as part of the congregation and they sing beautifully. Well worth it."
        }, 
        {
            "index": 387, 
            "rating": "5", 
            "review": "Excellent!. The collonade, the statues of Kutuzov and Barclay de Tolly, and the beautiful church bearing the name of Russia's holiest (lost) icon, this site is must see in St. Petersburg!"
        }, 
        {
            "index": 388, 
            "rating": "5", 
            "review": "This is the real deal. As practicing Catholics we felt fine at the Russian Orthodox service. It is a bit like the reverence of Latin services from long ago. It is VERY poor taste to talk during a service and some tourist children were playing loudly with the candles which was disrespectful but fortunately they got bored and left. There is a great sense of loyalty, devotion and faith which is palpable."
        }, 
        {
            "index": 389, 
            "rating": "4", 
            "review": "beautiful. when you think about Russian cathedrals you imagine colored Stupas ,....but when you face with Kazan cathedral you find it too different . it was more like as a historical victory monument . inside was like as other famous church's and cathedrals , too beautiful and too spiritual. "
        }, 
        {
            "index": 390, 
            "rating": "5", 
            "review": "saw a wedding!!!. A cathedral with history and ambience. It was a strange experience I was viewing it as a tourist but a wedding was being conducted which felt an immense privilege to witness and something i will always remember. there is also a cathedral cat ther that looks like hitler!"
        }, 
        {
            "index": 391, 
            "rating": "3", 
            "review": "Ordinary. I think It's ordinary and plagiarised from Italy. I think Italy has better ones. But I went there, because it's quite near the city center..."
        }, 
        {
            "index": 392, 
            "rating": "5", 
            "review": "A must. Amazing Church. In the morning there is a service and a choir of men. Fantastic. in the afternoon a long line to kiss the icon of our Lady of Kazan. Amazing.And even better, the modestly decorated grave of Field Marshal Kutuzov, the hero of the 1812 War against Napoleon. French flags caught during the offensive against the invading French decorate the grave."
        }, 
        {
            "index": 393, 
            "rating": "4", 
            "review": "Great Visit!. The outside of this cathedral was more beautiful of the outside and it is located on the best street (Nevskiy) for sightseeing. We were in St. Petersburg on the Day of our Lady Kazan so this place was busy! Right across the street from the Zinger Building which holds a huge book store and café. One of my favorite restaurants, La Taressa, overlooks this cathedral."
        }, 
        {
            "index": 394, 
            "rating": "4", 
            "review": "Peaceful and quiet. Despite there are many people inside the church, it was very quiet as it still function as a church rather than a museum. I think it is worth to take a look as it is one of the key churches in St. Petersburg."
        }, 
        {
            "index": 395, 
            "rating": "4", 
            "review": "Peaceful. There are many striking buildings in this city, none more so than the cathedral, it features in the television transmissions on the Russian Christmas Eve celebrations alongside the naval cathedral on Krondstadt and has a certain noble quality that makes it good to look at.Obviously it is a venerated building with many people coming to pray and to pay respect to whichever icon they perceive to be the most holy, although can's say I would fancy kissing the same spot on a wood framed glass cabinet as the other hundreds of lips!If you want to get a clear and panoramic view then take coffee in the Singer building opposite at first floor level (that's the second in Russia) and the sweeping wings and columns will have your eyes in awe, it really does look a well balanced and cared for place. No doubt others can give you an insight as to its uses during the first stages of the \"lovely\" Soviet period, what a bunch.Inside there is peace and an air of quiet contemplation, the smell of candle wax and incense, a quietness that is the exact opposite of what is happening on Nevsky. Although, only here could you get two guys carrying a makeshift structure in wood about 20 feet long and the crowd of visitors just part as though its a portable icon.The decorations, actual bas relief and painting is very well designed and restored, not too much gold and very muted colours, many icons beautiful columns and floors.Take some time to sit and look, respect the traditions, ladies to cover their heads and legs, no hats etc. many people here appear to have genuine affinity to the Orthodox Church which is a nice counterbalance to the mayhem outside."
        }, 
        {
            "index": 396, 
            "rating": "4", 
            "review": "Worth a look. There are lots of Orthodox churches to see in St P's but this Cathedral has some interesting art to compliment its vast space and history. There was a service being conducted at one end whilst we were there which gave us an insight to the Russian religion. Across the road is a famous bookshop and cafe on the second floor which gives you a great view whilst having a coffee."
        }, 
        {
            "index": 397, 
            "rating": "5", 
            "review": "Incredible colums supporting a beautiful church. The outside was like a mini St Peter's Square in Rome with the columns on either side of the church in the same style. Inside was amazing, with massive columns supporting the structure. It was beautifully decorated and has an icon which appears to be a 'mecca' to church goers, queuing for hours to pay homage and kiss it. I was very taken by the architecture of this church, probably more so than by it's actual beauty."
        }, 
        {
            "index": 398, 
            "rating": "4", 
            "review": "Russian Orthodox Church. Impressive amount of gold around and lots of interesting old icons. Huge church with porticoed arms."
        }, 
        {
            "index": 399, 
            "rating": "5", 
            "review": "Bring binoculars. The church is lovely. The now-famous art is behind a rope that kept us about 20 feet away so that to me it looked like a flat black panel. So bring binoculars to see it. We had 3x opera glasses and it really helped."
        }, 
        {
            "index": 400, 
            "rating": "5", 
            "review": "Beautiful active church. This church is really beautiful and is an active church , its very Russian typical, great experience"
        }, 
        {
            "index": 401, 
            "rating": "4", 
            "review": "Dark, vast, and inspiring during a service. We came into the Cathedral during a service, with beautiful music and an ornate display of the treasures of the Cathedral. We appreciated their accommodation to respectful visitors at that time. The Cathedral itself is vast, and it seems darker than other churches we visited."
        }, 
        {
            "index": 402, 
            "rating": "5", 
            "review": "Magnificent edifice definitely worth visiting. Even if you are tired of Russian Orthodox churches as a result of having seen so many during a trip through Russia, this one is important and should not be missed. It houses two very significant things: first, one of the most revered copies of the icon of Our Lady of Kazan; and second; the grave of the great Russian general Mikhail Kutuzhov, hero of the War of 1812 and a central figure in Tolstoy's epic War and Peace.The Icon of Our Lady of Kazan has been appealed to over and over again in Russian history, particularly in times of war. Allegedly, it was even used by Soviet authorities out of desperation, who reportedly used it in processions around Leningrad fortifications during the lengthy siege of that city. There were even rumors Stalin was so desperate during Hitler's invasion of Russia that he had it brought to Moscow, where atheist Soviet officials paraded it around the Kremlin Walls.General Kutuzhov is the man who ordered the retreat from and evacuation of Moscow in the face of Napoleon's Grand Army, with the intent to lure the French into the empty city as Winter approached –– while the Russian Army recuperated and prepared to harass the French once they were forced to retreat back to France through the horrific Russian Winter. Kutuzhov was obviously successful in his gigantic gamble. His grave is not ostentatious, and even easy to miss. It's worth seeing. The captured banners of the French Army are on display, as well as the keys of the Russian Cities that Napoleon waited in vain to receive while he aimlessly waited in Moscow through the Autumn months.We enjoyed our visit to this Cathedral very much, particularly since we were unaware that either of these treasures was housed here, and were pleasantly surprised and excited to discover them."
        }, 
        {
            "index": 403, 
            "rating": "4", 
            "review": "Really interesting cathedral to visit. We visited most of the main cathedrals in St Petersburg during our five-day visit. This isn't the most showy, but it's great if you want to get a sense of the Russian Orthodox church and some of its differences from Catholicism (no statues or stained glass, just icons, no seats, etc). We were really grateful to have an excellent guide showing us round though: there is some information in English but it was so much better having someone to explain what we were seeing. And the Kazan Cathedral is nothing like as crowded as the Church on Spilled Blood, or St Isaac's or the St Peter and St Paul Cathedral, which is a big plus - few huge tour groups following their guides around. It's hard to get a good photograph of the cathedral though. The best is probably from the far side of the rose garden in front of it, facing onto Nevsky Prospekt."
        }, 
        {
            "index": 404, 
            "rating": "5", 
            "review": "Something authentic. WHY WORTH A VISIT: of all the main Russian orthdox churches in St Petersburg, this is the only working church, not a museum. So here your impression of the place will not be ruines by numerous cameras flashing, lound talking and crowds. It's decorated with different kinds of marble and granit, and all the granit is local. Last but not the least, it's the home of the miraculour icon of \"Our Lady of Kazan\".HOW TO GET THERE: it's not hard at all, as the church is located in the middle of Nevsky prospect, across the street from \"Dom Knigi\" (former Singer sawing machine store). It's walkable from most hotels in the center, but if you take the metro, the station is called \"Nevsky prospekt/ Gorstiny Dvor\" and the exit you need is \"Kanal Griboedova\".BEST TIME TO GO: Around 10AM or 6PM, which is when the mass takes place. PLEASE NOTE:- As it is a working church, be respectful. Don't talk too loud and don't take pictures inside. It's preferable that ladies cover their heads and gents take their hats off. Try not to wear really short skirts or shorts. - The church has some space closer to the altar, which is separated with a rope and a sign \"only for the prayers\". It means that it's for the people who actually want to listen to the servise and pray. It doesn't mean that tourists are not allowed in. If you really want to participate, just prepare for it. If you are a female visitor, cover your head with a scarf or something and wear pants or a long skirt. Male visitors should take off their hats. You will see that the priest sings a prayer and from time to time everybody makes some gestures with their hands. Try to repeat after them.- You don't have to stay during the mass. Everybody is always free to leave whenever they want. Try to wander around and discover all sorts of little icons hidden in the corners. If you have some rubles, you can buy candles, light them and place them in front of icons as you pray.MUST SEE:- The miraculous icon of Pur Lady of Kazan in the center of the altar wall. You'll recognise it because there will be a line of people waiting to come closer to it and kiss it.-In the corner behind the kiosk you'll see some flags and a memorial space. It's actually a burial place of a Russian field marshal from the war with Napoleon - Kutuzov. The flags you see are rwal French banners and there are also keys from different French towns conquered by Russians.- In the opposite corners look up a little bit and you will see a balcony for the quire. It's not allowed to play musical instruments in orthodox churches, so that's the only source of spiritual music."
        }, 
        {
            "index": 405, 
            "rating": "4", 
            "review": "An impressive cathedral. The interior is very ornate.We were very lucky to visit the cathedral while there was a wedding in progress."
        }, 
        {
            "index": 406, 
            "rating": "5", 
            "review": "Surprise!. heard about it - but didn't meant o go. saw it by surprise and went over there just to take some photos - finaly stayed for over 2 hours.recommended!!!"
        }, 
        {
            "index": 407, 
            "rating": "5", 
            "review": "Beautiful cathedral. Huge cathedral with free entrance. Beautiful, awe-inspiring exterior, with a simpler interior, though in no way unimpressive. Still an active place of worship though, so be considerate when visiting!"
        }, 
        {
            "index": 408, 
            "rating": "5", 
            "review": "Magical. The small entrance almost lead to the fact that we almost missed this church. But I'm glad we did see it. It was magical inside. It was really dark and people were singing en queuing to pray to the icon of the Lady of Kazan."
        }, 
        {
            "index": 409, 
            "rating": "3", 
            "review": "Not high on the list. A functioning church, looks better on the outside than inside. The other churches in town are much better."
        }, 
        {
            "index": 410, 
            "rating": "5", 
            "review": "Very spiritual and beautiful. Unlike the church of the Spilled Blood and St. Isaac's cathedral, this is a working Russian Orthodox cathedral and not a museum. As such, it is free to visit (although there is box for donations but this isn't pushed), there is no photography within the church and the ladies are encouraged to cover their heads. There is a real spiritual feeling inside the cathedral. I happened on a service which was very special. There are a few seats around to rest and reflect on the cathedral. This was one place that I visited that wasn't full of tours from the cruise ships, just ordinary Russian people paying their respects to the icon. Well worth a visit."
        }, 
        {
            "index": 411, 
            "rating": "4", 
            "review": "A 15 minute visit. It doesn't take more than 15 minutes to visit this cathedral and it's definitely worth it. With no entry fee and located on the Nevsky Prospect, the cathedral on the outside is a colonnade with a garden in between. Since its a functioning church, it will be difficult to spend a longer time inside as a tourist. No audio guides available."
        }, 
        {
            "index": 412, 
            "rating": "5", 
            "review": "A spiritual respite. Amid the tourist trappings of St. Petersburg, many of which are great to visit, this church offers a spiritual respite. Note the lines of women in head scarves who await their chance to kiss and pray to the icon of Maria, in the form of Our Lady of Kazan. The place is just dark enough, not glitzy, and you can find icons of saints and prophets to light a candle to if you so desire. Even if you are not a believer, it is one of the only holy places in St. Petersburg and worth visiting in that light."
        }, 
        {
            "index": 413, 
            "rating": "4", 
            "review": "Must see. This church is in the very middle of the Nevskiy Prospect - can't miss it! It named after an icon of lady of Kasan, that is on the display inside the cathedral - said that this icon saved Leningrad during German occupation of over a year!"
        }, 
        {
            "index": 414, 
            "rating": "5", 
            "review": "Best. St. Petersburg church. Only this cathedral of top ranked attractions is still used for religious purposes."
        }, 
        {
            "index": 415, 
            "rating": "5", 
            "review": "Very Spiritual Russian Orthodox Cathedral. We were very overwhelmed with the beauty and spirituality of this Orthodox Cathedral. The outside facade does not prepare you for entering into this place of holy worship. A religious mass had just finished along with a small wedding. The interior is dimly lit and along with the smell of the incense, one is transported into a different world.The icon of the Lady of Kazan is a replica of the original, however, the devotion and piety of the worshipers' is fantastic. Mu husband and I were very impressed with the lines of people who come in to \"kiss\" the image of the icon.The murals and icons are magnificent!"
        }, 
        {
            "index": 416, 
            "rating": "5", 
            "review": "Georgian chanting. Just walked in as hotel very close.... Built as a small replica of St. Peter's in Rome. PLEASE LADIES COVER YOUR HEAD WITH A SCARF. Parishioners fervently worshipping and very reverent public. Live Georgian chanting was like listening to heaven.... What a gift!"
        }, 
        {
            "index": 417, 
            "rating": "4", 
            "review": "A bit like St Paul's Cathedral in Rome. The cathedral is laid out in such a way that it reminds one of St Paul's Cathedral in Rome. Rather austere on the outside and very dirty, The interior is huge but the decoration more subdued and less grandiose than other cathedrals we saw, with the exception of the Altar areas."
        }, 
        {
            "index": 418, 
            "rating": "5", 
            "review": "Very interesting history. This church has a very interesting history of at one time being an atheist museum. Originally it was a church. Now it is a Russian Orthodox church and quite actively used. We went to enjoy the art. Some of the murals are quite impressive."
        }, 
        {
            "index": 419, 
            "rating": "5", 
            "review": "Check it out. Surprisingly large inside, nicely decorated and we were fortunate enough to be there when some guys and girls were singing.Couldn't help but think how much cooler it would have been if the Norse gods were the dominant religion at the time of construction vs Mr J and his buddies."
        }, 
        {
            "index": 420, 
            "rating": "5", 
            "review": "Nice church . It is a very old church but it is not open always I think it was allowed to enter at 6 pm only 2 days maybe Monday is one of them it is located on novosberky street , you have a lot of cafe there to go and sit beside"
        }, 
        {
            "index": 421, 
            "rating": "3", 
            "review": "I expected more.. It seems more a political building (like the Capitol) than a cathedral. Inside is beautiful, but after you see other churches in St. Petersburg, this one is not so impressive. No pictures allowed and you will see at the entrance an advise: \"Please, be careful, or become a victim of theft\"."
        }, 
        {
            "index": 422, 
            "rating": "5", 
            "review": "The pulsing spiritual heart of a great city. The Cathedral of Our Lady of Kazan was described to me by a Russian guide who is a native of St. Petersburg as the \"pulsing spiritual heart of the city.\" I could not agree more. First, it is a magnificent building. The story of how it was used as a \"Museum of Atheism\" will rend the heart of anyone who values freedom of religion. Its rebirth as a cathedral and parish is a story of people trying to do things right. The cathedral is not only a place of worship but a center for active ministry meeting needs ranging from helping the homeless to feeding the hungry to providing summer respite at a rural dacha for under privileged children. I fell in love with Kazansky."
        }, 
        {
            "index": 423, 
            "rating": "5", 
            "review": "Our Lady of Kazan. This Church drew us continuously, there is a venerated Icon there and the lines trying to get to touch it were very long. The first day we were there we had the opportunity to hear an Orthodox service which was movin, although we did not understand the words, but just watching the devout people around us was very moving, it made me realize what they had been deprived of for so long."
        }, 
        {
            "index": 424, 
            "rating": "5", 
            "review": "must-visit place. This church is very beautiful both inside and outside. It is huge. the entrance is free. You can also pay for an excursion."
        }, 
        {
            "index": 425, 
            "rating": "5", 
            "review": "Imposing & Dismal Exterior But Go Inside. We attended a wedding at the cathedral so we felt privileged to see the iconostasis both closed and open. The space is huge and the acoustics make even a quartet choir or a chanting priest sound magnificent. No photos allowed as this is a working cathedral, which means there's no charge for entry."
        }, 
        {
            "index": 426, 
            "rating": "4", 
            "review": "A HOLY CHURCH. Reverted from the Museum of Atheism under the Soviets to a fully functioning church & one that it is held in special regard by Russians due to the icon Our Lady of Kazan. It was moving to see the queues waiting to kiss, light a candle & pray in front of the icon.The church also contains a statue of Marshal Kutuzov one of the heroes in Tolstoy's War and Peace. The external half circle of colonnades can not missed as you walk down Nevsky prospect. Certainly worth a visit and afterwards treat yourself to tea & cakes at the Singer House cafe( bookshop on the ground floor).As you enjoy your refreshments you have a fantastic views."
        }, 
        {
            "index": 427, 
            "rating": "3", 
            "review": "Huge Queue for Lady of Kazan Icon. If you are in St Petersburg you are bound to stroll down Nevskiy Prospekt and this church is in a prominent position so perhaps worth spending ten minutes having a look. Nothing special essentially built to house the Kazan Icon and most people stand in a long queue to view close up. Unless this has a religious significance for you then not worth the time."
        }, 
        {
            "index": 428, 
            "rating": "5", 
            "review": "Stunning. Visit late in the afternoon to join the locals in prayer. Looking up you are greater by amazing ceilings"
        }, 
        {
            "index": 429, 
            "rating": "5", 
            "review": "Holiness & Sanctity Personified.. On entering the Huge Holy Precints, it is as if you are transported to another world. You have to pull yourself into your shell, block all outside disturbances, to really feel the Sanctity of the place. Tourists do tend to be noisy at times. The Altars are something to see. To me, Our Lady, Is Our Lady of Perpetual Help. You must buy an Icon, as a Memento of your visit."
        }, 
        {
            "index": 430, 
            "rating": "5", 
            "review": "Worth \"Popping In\". We liked that most of the people in this Cathedral were Russian. They were in a long queue to touch/kiss an icon. The Cathedral is not a particular \"must\" but if you are passing it is worth a look inside and does not need to take long."
        }, 
        {
            "index": 431, 
            "rating": "3", 
            "review": "Ok but really a quick visit. This is a fully operational Russian Orthodox Church and a very Holy Place to worshipers.Visitors are allowed in and it is a very impressive Church but photographs are not openly allowed, It is a place where people's right to worship needs to be respected. As I dont speak Russian I didnt know what was going on and couldnt ask anybody what the visitor protocol was. We enjoyed our visit but as we like to photograph some memories we would not rate it high on your list if time is of the essence."
        }, 
        {
            "index": 432, 
            "rating": "5", 
            "review": "Must visit in St.Petersburg . This place should be visited by everyone coming to St.Petersburg. It is really historical and one of the most beautiful buildings of the city. You may come inside and see the service or just put a candle. Or just to seat outside and enjoy the beauty of architecture and religion."
        }, 
        {
            "index": 433, 
            "rating": "5", 
            "review": "very impressive. nothing to say much.very impressive.It is in the center of the city. U pray and thank god to be here"
        }, 
        {
            "index": 434, 
            "rating": "4", 
            "review": "No photos inside. Very decorative, but in use for services - so no photos. Remember ladies must cover their heads. A huge cathedral - it is located off Nevsky Prospekt"
        }, 
        {
            "index": 435, 
            "rating": "5", 
            "review": "marvellous experience!!. Me and my husband went there to see the Kazan church with its Madonna. Wonderfull experience to wait our turn for preying and kissing the Madonna, people from everywhere were here for this magic Madonna... we felt something deep in our soul."
        }, 
        {
            "index": 436, 
            "rating": "5", 
            "review": "Russian Orthodox Cathedral in NeoClassical Architecture. This cathredral is unique in Russia; while it's not the only Renaissance-style cathedral (St. Issac's is further down the road) it's fairly small and intimate, looking a bit like a jewelbox version of St. Peter's in Rome. Mass is held here regularly and you needn't leave the building if it starts while you're there; in fact you should stay because it's quite a moving experience, even if you're not Orthodox. I had no idea what the ritual protocol was, and actually I felt I had no business trying to follow along, but whenever I was making a faux pas by just standing there--when I was going to be in the way of a procession--one of the elderly ladies would gently touch my arm and move me to the proper place, no scolding or anything. If you're quiet and respectful, they have no problem with you being there. As far as attire, you don't have to be dressed up, but don't look grungy. Men should not wear hats in an Orthodox cathedral, and women should cover their heads (a scarf is typical)."
        }, 
        {
            "index": 437, 
            "rating": "5", 
            "review": "Stunning architecture on Nevsky Prospect. Visited St Petersburg in September 2013. I was out enjoying a tour of the city by foot when I stumbled across this gorgeous architectural maze of colonnades and was simply too dramatic in appearance to resist a visit. This turned out to be Kazan Cathedral which today still functions as an operating church in St Petersburg. Quite refreshing as compared to so many other great churches which are now museums.Great history but then is St Petersburg, a city that literally stretches back hundreds of years. The actual cathedral/church is located at the back of the colonnade so from first inspection you are absolutely unaware that this is a cathedral of any kind. It makes a very easy visit, if you are on Nevsky Prospect just checking out the neighborhood, it is also very close to the Metro which makes it easily accessible.Several viewers commented on their visit during a church service which I did not do. The time I visited was outside of their services but is absolutely worth a walk around - there is no charge to get in and it is a delightful visit.Certainly one of the most impressive architectural buildings in and around the popular tourist sites of St Petersburg.My advice is quite simple - if you are in St Petersburg this is a must visit!"
        }, 
        {
            "index": 438, 
            "rating": "4", 
            "review": "Experience a \"working\" cathedral in St.Petersburg. Our Lady of Kazan cathedral is one of the few major churches in central St.Petersburg which is a working cathedral rather than a state museum. Architecturally it is quite striking with its dome and huge semi-circular collonade which reaches out to Nevsky Prospect. Much work has been done on it recently and behind it it still looks like a construction site. As a working church, one needs to dress conservitively and photos are not allowed. It is however completely free rather than a couple hundred roubles. The interor is beautiful with scores of icons, mosaics, magnificent iconostases. I would urge visitors to consider comming during services (on Sunday 10 and 1800h) to truly experience it. The music supplied by male choir as well as the priests is unearthly, ancient, dark and deeply spiritual. The smell of incense, hundreds of candles also adds. Just stay quiet, reverent and do what the lady standing next to you is doing and you will have a very special experience even if you can't fully follow what is transpiring or even if you are secular."
        }, 
        {
            "index": 439, 
            "rating": "4", 
            "review": "Stunning. When one thinks of Russian Cathedrals it is images of St Basil's or Church of the Saviour on the Blood that come to mind. Although those are trully stunning building what makes Kazansky Sobor so fascinating is that it looks completely diferent.Looking more like a palace than a cathedral and placed neatly by Nevsky prospekt this is an easy must-see when visiting Piter!"
        }, 
        {
            "index": 440, 
            "rating": "4", 
            "review": "Church meets world. The beauty of this building keeps a little surprize: A lady in the church constantly is weeping the floor cleaning the wax of the candles brought to the icoon the Holy Mother and child.Seen from the Nevskiy Prospect, you don't see a church in it. But behind this range of colums there is an immense cathedral, repeating the colums inside."
        }, 
        {
            "index": 441, 
            "rating": "4", 
            "review": "Easy to See. This cathedral is right off the metro on Nevsky Prospekt, so you have no reason why not to visit. and it faces the Church on Spilled Blood, at the end of the canal, another must. This is an actual working cathedral so you can possibly catch a service here if you wish. While is't not a opulent as some of the others, it is right on Nevsky, which makes it an easy target to visit. And when you consider it was a \"Museum of the History of Atheism and Religion\" during the Soviet period, it makes the visit even more interesting."
        }, 
        {
            "index": 442, 
            "rating": "5", 
            "review": "Excellent central landmark. When I got out of the metro on Nevskiy Prospekt station on my first day, this was the first thing that caught my eye. I directly went to see it. Looks impressive from outside, and it has this huge entrance like a garden, which has a festive-like atmosphere.It is located right in front of the Nevskiy Prospekt, which made it a place to memorize for me, which helped me find my way during my visit."
        }, 
        {
            "index": 443, 
            "rating": "5", 
            "review": "loved it!. I have noticed i love cathedrals! Not a big person on actually attending church but do love the cathedrals! I simply loved this one! The way it is shaped catches your eye first. It is not shaped like your normal cathedrals! I would say it is unique. The look from the inside does not disappoint. It is simply breathtaking! Something hits you when you walk in and you feel like you are in a special place. The good thing is this cathedral is right down nevsky with alot of other tourist things so you can't miss it."
        }, 
        {
            "index": 444, 
            "rating": "5", 
            "review": "Surprising!. This church is enormous with countless icons and art pieces. There were services going on as tourists roamed around, with women covering their hair with scarves looking for solace kissing icons of their chosen saints or the virgin mother. Sitting on a bench and taking it all in was an experience in it self."
        }, 
        {
            "index": 445, 
            "rating": "4", 
            "review": "WOW. Along Nevsky Prospekt this Cathdral is impressive - facing a fascinating shop with a dome-like top and a short walk along a canal to deliver you to a beautiful domed church, this building stands out along Nevsky."
        }, 
        {
            "index": 446, 
            "rating": "4", 
            "review": "The risk is to repeat myself. Cathedrals are a must in St. Petersburg and Cathedral of Our Lady of Kazan does not make an exception."
        }, 
        {
            "index": 447, 
            "rating": "4", 
            "review": "Central location. You probably walk past this church in Saint Petersburg, so why not go inside as well? It's free, unlike St. Isaac's Cathedral and Church of Our Savior on Spilled Blood. With some luck, you can even see some real action inside... Don't miss Napoleon's standards inside!"
        }, 
        {
            "index": 448, 
            "rating": "4", 
            "review": "What a change. The main Cathedral for St. Petersburg, this used to be the \"Museum of the History of Atheism and Religion\" during the Soviet period. Now it is a church again and the main Cathedral for the city. Not necessary to tour, but definitely worth a visit when strolling along Nevsky Prospect. Ladies be sure to wear a head scarf as it is a working church."
        }, 
        {
            "index": 449, 
            "rating": "5", 
            "review": "Experience an orthodox mass!. Singing mass is beautiful, and it is nice to see people praying to get little understanding about Russian religion and traditions."
        }, 
        {
            "index": 450, 
            "rating": "4", 
            "review": "Impressive outside. We didnt want to miss the visit, as from the outside it did look very inviting, but again, it was ok, but really nothing special inside the Cathedral."
        }, 
        {
            "index": 451, 
            "rating": "2", 
            "review": "plain interior, durty exterior. nothing special but free and central, you cannot visit SP and don't pass it at least one, so have a look"
        }, 
        {
            "index": 452, 
            "rating": "5", 
            "review": "Lovely, powerful stop. A beautiful church--I really enjoyed getting to touch and pray by the figure of Lady of Kazan by the altar (despite the long line). The souvenir shop has great treasures. While longer skirts/pants and covered heads (for women) are not obligatory, I'd recommend it as a sign of respect for those who are there to pray."
        }, 
        {
            "index": 453, 
            "rating": "5", 
            "review": "A beautiful \"working\" church. Unlike some other churches in St Petersburg this one is used as a church and so is different fro others that have been restored as attractions. There was a young couple getting married while we visited and many devout visitors. Note that non-tourist visitors cover their heads. A lovely old church."
        }, 
        {
            "index": 454, 
            "rating": "5", 
            "review": "stay for a mass. I am Catholic and when I visited Kazan Cathedral, I am glad I stayed on to hear the mass. Good to see their traditions. The church has lots of icons, paintings and how I wish I had someone explain the religion and introduce the icons to me. Maybe some day, when I return."
        }, 
        {
            "index": 455, 
            "rating": "5", 
            "review": "Old spirit. It's a church and museum at same time! Some people come here to pray and some to see greatest general who won Napoleon - Mikhail Kutuzov. There are many keys from cities which he has conquered"
        }, 
        {
            "index": 456, 
            "rating": "4", 
            "review": "Not to be missed when you're on Nevinsky Prospekt. We were staying opposite this huge church and so developed a real fondness for it.\nThe exterior is imposing, and inside dark and equally awesome."
        }, 
        {
            "index": 457, 
            "rating": "5", 
            "review": "Somber and beautiful. A very interesting place. Women should wear a scarf or a hooded sweatshirt or anything to cover their heads. This is a very serious place for the faithful and it's a bit insulting to go in there without respecting their beliefs."
        }, 
        {
            "index": 458, 
            "rating": "4", 
            "review": "One of the few free attractions in St Petersburg. Coming from a city where all the state museums are world famous and free, it was a bit of a shock to pay so much for all the St Petersburg churches and museums. Because the Kazan is a working Orthodox church it is free and well worth visiting. From the outside it is a mini St Peters with a colonnade to match (though about half the size). Inside you can see (or join) the queue of those venerating the icon to the Virgin Mary."
        }, 
        {
            "index": 459, 
            "rating": "4", 
            "review": "A view on St P. Very interesting cathedral. Try to walk upstair outside the coupola and have a breathtaking view over the roofs of St P"
        }, 
        {
            "index": 460, 
            "rating": "5", 
            "review": "Russian Version of St. Peter's Basilica. Having visited Rome just a year ago, we were amazed to find a cathedral modeled on St. Peter's in downtown St. Petersburg. It is a functioning Russian Orthodox church, so proper dress is required, but it is every bit worth the visit. While much smaller than its Roman model, Kazan Cathedral is beautiful inside and out, and does not have an admission fee or long line up to get in."
        }, 
        {
            "index": 461, 
            "rating": "4", 
            "review": "Unique church. Very unlike the other churches you'll see, so it's worth a visit (and it's free!) the interior is dark and reminds more of a state building than a church, but it's a nice change of pace from the other cathedrals in the area."
        }, 
        {
            "index": 462, 
            "rating": "5", 
            "review": "This is a freebie and you don't get many.. A fabulous example of colonnade architecture which was designed with similarity to the Vatican in mind. It is a working church and services were taking place during our visit. It has many interesting internal features and it is good to see that religion still commands great respect. Do however note the warning sign against pick pockets because some will stoop lower than the low if you are momentarily distracted."
        }, 
        {
            "index": 463, 
            "rating": "5", 
            "review": "One of the main attractions. In a city full of must see churches, museums and other attractions, this is one of you need to squeeze in your schedule. Location is great in Nevsky Prospekt(main street), so you find lots of other things to see and do over there."
        }, 
        {
            "index": 464, 
            "rating": "5", 
            "review": "Try to fit this one in.. The Church on Spilled Blood and St. Isaac's are the traditional church/museums that tourists see. Try to fit this one in. It is still a functioning church and as such, you are not supposed to take pictures. Some people were, some were not - there was no one screaming at you if you did. It added additional depth to the two days in St. Petersburg to see the local faithful lining up to pay their respects to the Icon of Our Lady of Kazan. The Colonnade out front was to rival St. Peter's in Rome, but it was never fully realized. It is still impressive."
        }, 
        {
            "index": 465, 
            "rating": "3", 
            "review": "Outside Entrance columns. Impressive entrance that resembles the entrance to St Peter's in Rome and the famous columns that embrace the Cathedral square done by Bernini. Inside again was rather dark and not sure if during religious divine services it it is artificially lite."
        }, 
        {
            "index": 466, 
            "rating": "5", 
            "review": "Underrated. This place is pretty neat. From the outside, it's a mini St Peters (Rome). The inside is a traditional cathedral. Would seem at home in any European city."
        }, 
        {
            "index": 467, 
            "rating": "5", 
            "review": "Glorious. Beware, this is not a tourist attraction, but a functioning cathedral, so you can't take photos and women should wear a headscarf. I loved this place and went several times just to observe and feel the atmosphere. A very interesting place to spend some quiet time in."
        }, 
        {
            "index": 468, 
            "rating": "5", 
            "review": "Big Suprise :). Not what I expected at all from looking at the outside. This church was huge, and beautiful inside. I would have never imagined that from standing out on Nevsky Prospekt. I remember this church being free and would definitely take a peek inside again if I were in St. Petes. You will most likely walk by it multiple times while in the city so you might as well take a look inside. Won't cost you but 15-30 minutes and it is definitely worth it."
        }, 
        {
            "index": 469, 
            "rating": "5", 
            "review": "tell a tale cathedral. Located on the prominent Nevisky Prospekt is this semicricular Cathedral, the only attraction in St Petersburg without entry fee. The design of Kazan is more or less similar to St Peters of Vatican while It is debatable as to which design was emulated. Now a functional Church after the plunder and pillage of the Soviet regime, it is quite serene to walk in and around this attraction."
        }, 
        {
            "index": 470, 
            "rating": "5", 
            "review": "High level Russian Orthodox. The sheer size of the building is quiet overwhelming and then you see the decorations inside and it takes your breath away. As a working cathedral a visit during a service is a must to get the full experience (standing only in Russian Orthodox so be prepared!)."
        }, 
        {
            "index": 471, 
            "rating": "5", 
            "review": "A warm reception for the heart of the city. Another great religious monument, that absolutwly cannot be unoticed, placed right in the middle of the Nevsky Prospect, somehow is shadowed by the other big attractions nearby (as Spas na Krovi, Hermitage, Neva Embankment), but still it is an unique attraction. No matter which season, the cathedral invites you for a short walk into it's garden, so that you would be placed in a manner that the Cathedral itself lays around the visitor, just as if it was hugging and wishing a pleasant stay."
        }, 
        {
            "index": 472, 
            "rating": "5", 
            "review": "Architecture. This Cathedral is all about Architecture, The circular shape of its left/right wings adds something special to this Orthodox shrine. In my opinion, this Cathedral is best enjoyed at nightfall (if the night ever falls at this period of the year...). You can sip a coffee on the opposite side of the Nevsky Prospect and appreciate all the details of the building."
        }, 
        {
            "index": 473, 
            "rating": "5", 
            "review": "Beautiful Cathedral. A must see, the Icon of Our Lady of Kazan is revered by the locals. A long line of worshippers, it was my understanding, is a daily sight. Worshippers pay their respects and it is one of the most beautiful Icon you will ever see."
        }, 
        {
            "index": 474, 
            "rating": "4", 
            "review": "Impressive architecture. You may find the decoration of official buildings somewhat overdone, but not the Lady of Kazan Cathedral, an impressive achievement. Try to attend a service if you're not familiar with the Orthodox rites."
        }, 
        {
            "index": 475, 
            "rating": "4", 
            "review": "Beautiful!. I'm alway in awe of the decoration and architecture of Eurpopean cathedrals - and this one is certainly in my top 4 or 5."
        }, 
        {
            "index": 476, 
            "rating": "4", 
            "review": "Beautiful Architecture. Like so many of the buildings in St. Petersburg, the architecture is lovely to look at. A working cathedral, but lovely inside. Well worth a visit"
        }, 
        {
            "index": 477, 
            "rating": "4", 
            "review": "Not a museum but a real cathedral. It is worth a stop to see a real cathedral that is in use. Make sure you dress appropriately and bring a scarf to cover your head to show respect."
        }, 
        {
            "index": 478, 
            "rating": "3", 
            "review": "Not as impressive as others in the city. Whilst this cathedral is very imposing from the outside, personally I found the interior rather dark and gloomy. It's a working cathedral and there are many people observing daily religious rituals, so it's is worthwhile bring a headscarf, wondering around in silence and not taking pictures. It is free to get in, and there are many other attractions nearby. So it's worth popping in if you are passing."
        }, 
        {
            "index": 479, 
            "rating": "5", 
            "review": "The under-rated cathedral, yet just as pretty as St Isaac. I think Kazan is fundamentally under-rated by travellers, yet its magnificent colonnade at the front is something to truly behold. Some still carry signs of bombardment by the Germans, yet that doesn't take anything away - rather, if anything, it adds to the beauty. You only need about 20-30 minutes to take this place in but it's a great addition to the city tour"
        }, 
        {
            "index": 480, 
            "rating": "5", 
            "review": "main orthodox cathedral. imposing from outside but not very beautiful as the brick work is a dull brown. it is a very religious building and women have to cover their hair upon entering. it is very large inside and no photos are allowed as its the main orthodox cathedral in st petersburg. they ask that you observe silence within the building."
        }, 
        {
            "index": 481, 
            "rating": "3", 
            "review": "Impressive from the outside, dont bother with the inside. A very impressive building but very dour on the inside and there were numerous unsavoury people waiting outside and just inside with signs warning of criminal activity. Not pleasant inside and if you are tempted to go in be mindful we witnessed a couple of bag attempts with dipping obvious. This is clearly a place of religious values with devout followers, marred by the unsavoury presence of a minority."
        }, 
        {
            "index": 482, 
            "rating": "4", 
            "review": "A bit out of place, but certainly a great sight. The cathedral is on Nevsky Prospekt, and looks out of place- almost Roman. Its fabulous. I got a cup of coffee just across the street and enjoyed the view."
        }, 
        {
            "index": 483, 
            "rating": "5", 
            "review": "Unbelievable majesty. It was so mind blowing, gorgeous and breath taking, that you can't say you've been to SPb unless you saw this place."
        }, 
        {
            "index": 484, 
            "rating": "5", 
            "review": "lovely Cathedral in the nevsky. this lovely Cathedral location is quite weird (as nevsky is busiest street), but.... with the lovely architecture... you can't miss this!"
        }, 
        {
            "index": 485, 
            "rating": "5", 
            "review": "powerful place. Powerful from outside as a monument and very cozy on the inside. It's fascinating to see all this wall decorated with beautiful icons and to think for a moment about all the history that is related to this place."
        }, 
        {
            "index": 486, 
            "rating": "4", 
            "review": "See the bronze doors. The most impressive things here are the oversize bronze front doors (altho this is not the main entrance), which are an exact copy of Ghiberti's Baptistry doors in Florence, Italy. For those unable to travel to Russia, however, another exact replica of the doors can be seen at Grace Cathedral in San Francisco, CA (and they're better polished, too. . .) The other thing the Kazan Cathedral exemplifies is the curious linkage Russians assign to building cathedrals/churches to commemorate their battles and victories."
        }, 
        {
            "index": 487, 
            "rating": "5", 
            "review": "Simply a must. Whether you are religious or not, you must see Kazan Cathedral. Not just the outside, but this inside as well. The architecture is gorgeous. I was able to go to a service tonight with a friend and it was the most amazing feeling, something I had never experienced before. I highly recommend this place to everyone, of all ages and religious backgrounds."
        }, 
        {
            "index": 488, 
            "rating": "4", 
            "review": "Breathtaking. Like others have said, the inside while still impressive, is a letdown after seeing the exterior. Still though this is a great site to see and looks like something out of a fantasy movie."
        }, 
        {
            "index": 489, 
            "rating": "3", 
            "review": "More impressive outside than inside. A great photo stop, but not an amazing church inside. However, there is no entrance fee, so it is not surprising it is not that brilliant. There was very little information available about the church, so it is probably worth reading up prior to visiting."
        }, 
        {
            "index": 490, 
            "rating": "3", 
            "review": "OUR LADY OF KAZAN. Stunning exterior - reminiscent of St Peter's in Rome. Interior so-so. Good view of the Cathedral can be had from the Singer Cafe."
        }, 
        {
            "index": 491, 
            "rating": "4", 
            "review": "Impressive. If you stroll down the Nevsky, it's a worthwhile stop to make.\nA perfect spot is to stand on the other side of the road where you have a view of the cathedral on one side and a view on the Spilled Blood church on the other. Breathtaking."
        }, 
        {
            "index": 492, 
            "rating": "5", 
            "review": "Deeply moving. An historic building - with the flags of e defeated Napoleon and the famous icon - but also a deeply spiritual place."
        }, 
        {
            "index": 493, 
            "rating": "5", 
            "review": "Very impressive!. It is a landmark of St. Petersburg with Spiritual, historicaly and art importance. It is located in the center of the city on main street Nevsky Prospect. Allow enough time to explore. It is not a quick stop."
        }, 
        {
            "index": 494, 
            "rating": "3", 
            "review": "Beautiful but no photos. It was nice to see but there where no photos allowed. It was nice to see but there where no photos allowed."
        }, 
        {
            "index": 495, 
            "rating": "3", 
            "review": "Special ceremony. I happen to visit the cathedral on a Sunday when some special ceremony was taking place. It was quite interesting to see, even if you aren't religious. Everyone stood for the whole service, though people where coming and going during the service, as did I."
        }, 
        {
            "index": 496, 
            "rating": "5", 
            "review": "Excellent church and history, plus free. You could not get a better Cathedral to view with history and fabulous icons and it is free. Easy as part of the walk of Nevsky Prospekt."
        }, 
        {
            "index": 497, 
            "rating": "5", 
            "review": "We attended a wedding here, what an experience.. First whilst the wedding was going on people were still visiting the Cathedral so don't be put off if you are there and there is something going on.you can still visit.Apart from having to stand for three hours it was a wonderful experience The inside of the Cathedral is spectacular. We have since been back for a christening which takes place in the cellars.Whilst the outside looks a little tired the inside was magnificent take time to look in all the corners.The chanting by one of the Russian orthodox vicars was also well worth listening to."
        }, 
        {
            "index": 498, 
            "rating": "4", 
            "review": "Nearly converted on the spot. We happened on a service, and it was a deeply impressive experience. Processional priests, a capella singing (with a deep base included), priests reading in an ancient form of Russian, a real sense of the mystery and magic that most religions have lost. The Gates of Heaven and the rest of the altar area is richly decorated. The rest of the cathedral is dotted with icons, each with a small group of worshippers. Just a lovely space."
        }, 
        {
            "index": 499, 
            "rating": "4", 
            "review": "Try to Attend a Service in this church!. We were lucky to be on Nevsky Prospect at the time when a service was going on inside this church! The candlelight, haunting melodies of the choir echoing off the tall stone interior and the faithful in prayer made this experience one I won't soon forget. (And be sure to go across the street to Cafe Singer for hot chocolate after!)"
        }, 
        {
            "index": 500, 
            "rating": "4", 
            "review": "Well worth putting your head in the door. Beautiful interior and nice retreat from the cold! Free to enter so worth a look if you're not cathedral-ed out"
        }, 
        {
            "index": 501, 
            "rating": "4", 
            "review": "Beutiful orthodox church. This church is truly a peaceful oasis in the busy city. The calm atmosphere with burning candles combined with some nice artwork, makes this church a must see. There are lots of people worshipping, so you should be a respectful tourist when visiting this place. I even get so see a marriage seremony when I visited."
        }, 
        {
            "index": 502, 
            "rating": "4", 
            "review": "A working cathedral. Located on Nevsky Prospect opposite the Singer Building is the Cathedral of Our Lady Kazan. What makes this different from other Cathedral's is that it is a working cathedral with services and ceromonies happening all the time. Another benefit is you don't have to wait in line to get in, not crowded and it's free entry.Once inside the cathedral is ornate but not overly so like other cathedral's in St Petersburg. What makes it special are the regular services that take place which gives it a special aura. There are also some very good restaurants located nearby. Well worth a visit."
        }, 
        {
            "index": 503, 
            "rating": "5", 
            "review": "Beautiful. The exterior is a copy of St. Peter's in Rome on a smaller scale. The stories of the icons were inspiring. The interior was very ornate."
        }, 
        {
            "index": 504, 
            "rating": "4", 
            "review": "Grand building. This was a very busy cathedral with people actually worshipping so more lively less museum like feeling."
        }, 
        {
            "index": 505, 
            "rating": "3", 
            "review": "Can't miss and is on main street,. Ams as in st peters in Rome with crypt of most famous russian general who defeated Napoleon. You can go in with no trouble and no lines."
        }, 
        {
            "index": 506, 
            "rating": "4", 
            "review": "Impressive chandelier and interior. The interior is quite stunning although its pretty dark. Its very peaceful with a large queue to see the Lady. Ladies remember to cover your head"
        }, 
        {
            "index": 507, 
            "rating": "5", 
            "review": "Great architecture, must see. Kazansky Cathedral is one of the key Cathedrals of Saint Petersburg. Beautiful design and architecture you defiantly want to come inside. The icons are beautiful. I absolutely love that Cathedral, you can feel the special spirit when you visit it."
        }, 
        {
            "index": 508, 
            "rating": "5", 
            "review": "Imposing and impressive. A very imposing church, although the entry was hidden away due to renovations being undertaken at the time of our visit. Inside the church is magnificent.The current renovations are external and the restored columns are almost cream after the dirt and grime of age and pollution are removed."
        }, 
        {
            "index": 509, 
            "rating": "5", 
            "review": "Reminds you of Roman Architecture.. The second best cathedral I have seen after the Vatican. The architecture reminds you of the Roman ones with tall colonnaded portico. The garden in front is very well maintained and is a delight to spend some quality time. The inside of the Church needs to be seen to be believed. It's just Grand and we visited at a time when the prayer was going on and the organ played later on. It transferred me to some other world. But sadly photography or videography inside the church is not permitted, otherwise I could have bought back its memories along with me."
        }, 
        {
            "index": 510, 
            "rating": "4", 
            "review": "Gorgeous structures both day and night. You can miss it along Nevsky Prospect. Very impressive structure. Stroll through it. Just watch your purse and lens of your SLR camera."
        }, 
        {
            "index": 511, 
            "rating": "4", 
            "review": "Worth seeing it!. It is an orthodox church. Inside is discrete and full of icons. They do not charge to go inside. Just be respectful. Do not wear short pants or muscle shirts. For men a nice t-shirt and pants is enough. For women long skirts and a shall to cover their head is acceptable. Do not walk with your hands inside your pockets."
        }, 
        {
            "index": 512, 
            "rating": "3", 
            "review": "big church. enjoyed this church more from the outside...very big and grey inside although there were some interesting things to see, so if you have the time, check it out"
        }, 
        {
            "index": 513, 
            "rating": "5", 
            "review": "classical elegance. it is not the most extravagant or grand. but the beautiful romanisque exterior with tall strait architectural line, i think makes it the most elegent yet grand building in the city center."
        }, 
        {
            "index": 514, 
            "rating": "5", 
            "review": "Kazandky Sobor. Just grndeur and art, and artwork. sorry that we don't have weeks to walk and take in the magnificence. And the poor common people barely make it on their paultry salaries."
        }, 
        {
            "index": 515, 
            "rating": "3", 
            "review": "Impressive from outside and inside. A miniature of Vatican's St Peter , the church is attractive nevertheles and above all in ..very convenient location along Nevsky Avenue. So easily you can check the interior at no cost. Is an active church so dress properly."
        }, 
        {
            "index": 516, 
            "rating": "3", 
            "review": "include a part of your Nevsky Prospekt tour. It's interesting and imposing ... somewhat forbidding, certainly not my favourite church or cathedral in St. Petersburg. Still ...worth stopping by on your walking tour of Nevsky (especially since the kafe Singer is just across the street)."
        }, 
        {
            "index": 517, 
            "rating": "4", 
            "review": "Much recommended. Located on the Nevsky prospekt, this church is different to other Orthodox churches in St Petersburg. It was built by an Italian architect and reminds the italian Basilica. Very grand and free entry."
        }, 
        {
            "index": 518, 
            "rating": "5", 
            "review": "Great cathedral. A must to visit if in St.Petersburg. It gives you an idea of an Orthodox church. Nice interior and atmosphere."
        }, 
        {
            "index": 519, 
            "rating": "3", 
            "review": "Imposing from the outside. This cathedral is very imposing from the exterior and we weren't even sure what the structure was until we got up close. It lacks the opulence inside of other cathedrals in the city but it's interesting. I wouldn't make a special trip to see this one but if you're walking by (it's right on Nevsky Prospekt), then do stop."
        }, 
        {
            "index": 520, 
            "rating": "4", 
            "review": "Old big church. Very nice building and very old. It's not renovated so you can see the oldness of it all over the building ."
        }, 
        {
            "index": 521, 
            "rating": "5", 
            "review": "Very moving when there is an active worship service. I actually was more moved by my time spent inside Our lady of Kazan than I was by St Isaacs or Spilled Blood. Those two were so full of people taking pictures that one could not see let alone really connect emotionally with the surroundings.This was the first active Orthodox worship service I had seen, but tourists seemed welcome to walk around and observe the service and view the tomb of the warrior who fought Napoleon. There was a long line of people waiting to pray to the Icon of Our Lady as well as a roped-off area where people were praying. Orthodox women were all in headscarves. I was worried about my sleeveless shirt and not having anything that I could use to cover my shoulders, but that did not seem to be a problem as many people were in tank tops, etc. There is a garden area out front with benches, and it was a nice early evening in summer, so many people were gathered there also. I recommend!"
        }, 
        {
            "index": 522, 
            "rating": "5", 
            "review": "Combination of active place of worship and classical architecture landmark. Loose your way between the columns outside. The effect is especially striking in the night.When you enter go to the right. This is the tomb of great field marshal Kutuzov along with banners captured from Napoleon armies and keys of fallen cities.This is working church so follow Russian tradition: man should take their hat off and women cover their hair.No charge entrance."
        }, 
        {
            "index": 523, 
            "rating": "4", 
            "review": "Soothing and Uplifting. Fromt he hustle and bustle on the Nevsy Prospect this is an oasis of calm.A service was in progress which enhanced the experience.I left revived and enthused."
        }, 
        {
            "index": 524, 
            "rating": "4", 
            "review": "Impressive but overwhelming. Overcrowded by peeps just hanging out, seems like a big rendez-vous point :)"
        }, 
        {
            "index": 525, 
            "rating": "4", 
            "review": "Hey, no charge, can you believe it!. I got so tired of being charged for everything (including bathrooms) in St. Petersburg. Therefore, I was surprised not to be charged to go into this church. Quite impressive structure and if you are a believer, you will make this a pilgrimage."
        }, 
        {
            "index": 526, 
            "rating": "4", 
            "review": "Our Lady of Kazan Cathedral. Free admission and conveniently located, recommend stop."
        }, 
        {
            "index": 527, 
            "rating": "3", 
            "review": "Visit it before Isaac Cathedral and Church of our Savoir on the Blood. This cathedral is in restoration process now, and could be seen gloomy and grey after the above mentioned two cathedrals."
        }, 
        {
            "index": 528, 
            "rating": "4", 
            "review": "Very Russian. Great place and full of history. Don't miss the Kutuzov tomb."
        }, 
        {
            "index": 529, 
            "rating": "4", 
            "review": "Full of history. it is something I would define as strongly and typically Russian: monumental, with the Napoleon flags, icons,..."
        }, 
        {
            "index": 530, 
            "rating": "5", 
            "review": "No words..... There was a service going on when we visited the place. So quiet and peaceful still..."
        }, 
        {
            "index": 531, 
            "rating": "5", 
            "review": "A true religious experience.. Beautiful church with amazing architecture. Stand on line and pray in front of the saint. Tradition has it that if you need a miracle she will answer your prayers."
        }, 
        {
            "index": 532, 
            "rating": "5", 
            "review": "Breathtaking. We were lucky to be there on a Sunday and heard the service. The spiritual ambience was electrifying. And soon after we heard music from the choir group floating down from the first floor. We were floored and did not want to move. This is a Russian Orthodox Church. Pictures are not allowed inside. The cathedrals in Russia are built in a manner the priest can be heard from any corner of the cathedral without the use of mikes. The choir also sings without mikes or musical instruments. But are they melodious!!! U do not feel anything missing. Understand earthen pots are placed in the roofs of the cathedrals which assists in the marvellous acoustics. Needless to say the icons, the frescoes and mural are beautiful."
        }, 
        {
            "index": 533, 
            "rating": "5", 
            "review": "Classic Collonade. Superb classical architecture, another stunning interior of this working church opposite the singer sewing machine building"
        }, 
        {
            "index": 534, 
            "rating": "5", 
            "review": "In the city center. Near Nevskiy and Fontanka - must visit place! Go inside and injoy the beaty!"
        }, 
        {
            "index": 535, 
            "rating": "4", 
            "review": "magnificent. Very central.. Looks like Rome. You may have a rest in park which takes part in front of the cathedral.."
        }, 
        {
            "index": 536, 
            "rating": "4", 
            "review": "Beautiful. Very nice , not my favorite but not to be passed up."
        }, 
        {
            "index": 537, 
            "rating": "5", 
            "review": "Unique. Unique in that this is a functioning Russian Orthodox church. Ladies, be sure to have a head covering. Men, remove your hats. We were fortunate to arrive during a service--really other-wordly! We also saw worshippers on line to venerate the icon of Our Lady of Kazan. Our visit was a window into a very fascinating world"
        }, 
        {
            "index": 538, 
            "rating": "5", 
            "review": "Beautiful. Must-see if you're in St.Petersburg. Located on the Nevsky prospekt, you just can't pass it by."
        }, 
        {
            "index": 539, 
            "rating": "3", 
            "review": "Disappointing. disappointing - whilst impressive from the out side the shape is likened to an eagle spreading its wings - it was really quite dull inside"
        }, 
        {
            "index": 540, 
            "rating": "4", 
            "review": "Best seen from Singer Cafe. Looks good at ground level, from one floor up in the Singer Cafe, it is stunning"
        }, 
        {
            "index": 541, 
            "rating": "5", 
            "review": "Beautiful Interiors and Exterior!. Must see this church (entry is free!).. centrally located, and has a grand first impact on you! Lovely monument to photograph and the interiors are as aesthetically pleasing as the exteriors.. def take a peak inside, esp as there is no entry charge!"
        }, 
        {
            "index": 542, 
            "rating": "5", 
            "review": "WONDERFUL!!!. One of the most beautiful cathedrals! It is worth visiting every time you are in St. Pete"
        }, 
        {
            "index": 543, 
            "rating": "5", 
            "review": "Definitely worth a visit. When we walked in the coir was singing when we got there and we got to see the last part of the church service. We drank some blessed water for good health and admired the cathedral's interior, with its numerous columns and an outward colonnade. The interior features numerous sculptures and icons executed by the best Russian artists of the day.The inside is definitely more impressive than the outside!!"
        }, 
        {
            "index": 544, 
            "rating": "5", 
            "review": "to pray. don't forget the Icone of our Lady of Kazan which protect Moscow and St Petersburg of tyrans and destruction... if in town for Easter come to our Easter service from 11 till 1am - last longer but just amazing voices from the Chrorus !"
        }, 
        {
            "index": 545, 
            "rating": "3", 
            "review": "Well.... a nice place to see. It is very good located - right on the cross of Nevsky ave and Griboyedov channel. From the main street of the city you can see a charming view of the Cathedral, which is very beautiful from the outside. When you get closer, you see a lot of poor people, who ask for money, some children, other people you will not want to get closer to... It's relatively safe, but better not to play with the faith. Entrance is free. The Cathedral houses of the most important icons of Russian Orthodox church. During the religious holidays, there're long queues to enter the Cathedral."
        }, 
        {
            "index": 546, 
            "rating": "5", 
            "review": "vast and atmospheric. Many churches housed museums of atheism during the Soviet era, and this cathedral was no exception. It's now restored to its role as a place of worship, and is well frequented. Women should cover the head when entering any Russian church, but it's fine to go in even during a service. There are no pews and people are just sort of standing or milling about, kissing the icons and so on. There are signs up to beware of pickpockets, however... even in church."
        }, 
        {
            "index": 547, 
            "rating": "2", 
            "review": "Operating Cathedral. It is open at 9am and is free because people actually come here to pray before going to work!Women folk cover their heads, so prepare a scarf.There's nothing much to see here anyway,.. so, just photograph the outside and hop on over to the church of our saviour who spilled blood, which is a museum now"
        }, 
        {
            "index": 548, 
            "rating": "4", 
            "review": "Extraordinary towering catherdral. Loved the magnificent and towering exterior. Very different from the catherdrals found in Europe or North America. Still bears testimony of the brutal wounds of WWII on the exteriour. Blasts from mortars, bullets and tankshells but fortunately not worse."
        }, 
        {
            "index": 549, 
            "rating": "4", 
            "review": "Very impressive. Impressive and humbling. Please no photos, to respect services going on."
        }, 
        {
            "index": 550, 
            "rating": "5", 
            "review": "Very moving. We visited more than once. Lucky enough to be staying nearby, we saw Kazan daily. On our first visit, we saw a mass being held and confession being held. Very different than I've known in the Russian Orthodox Church back home."
        }, 
        {
            "index": 551, 
            "rating": "5", 
            "review": "Doesn't look like much from the outside, but go in!. This looks like the most European of the churches we saw, but upon entering it was the only church we visited that seemed alive and full of spirit. LOVED it! Babushkas kissing icons and lighting candles, people lined up in a long line at one particular icon, thick clouds of incense.......free to enter but consider making a donation and lighting a candle."
        }, 
        {
            "index": 552, 
            "rating": "5", 
            "review": "What an affection!. Russians stand in huge lines in order to light her a candle and ask for something, it's amazing to see this side of the russian culture!"
        }, 
        {
            "index": 553, 
            "rating": "4", 
            "review": "Worth a look. This is a active church so they don't charge you to get in, that said the place needs a clean and a renovation. There are long queues to offer devotion at the famous icon so it's hard to get a look at this but it is the overall place is worth seeing."
        }, 
        {
            "index": 554, 
            "rating": "5", 
            "review": "Must See!. Centrally located & free (donations toward restoration are nice!). Magnificent."
        }, 
        {
            "index": 555, 
            "rating": "2", 
            "review": "Rather disappointing. Having seen the other reviews perhaps we had over-raised our expectations about this Cathedral. Also having already visited the St Nicholas, St Isaacs and Peter & Paul Fortress Cathedrals we were rather disappointed with The Cathedral of our Lady of Kazan. The outside architecture is odd with huge 'wings leading to the entrance seemingly without any purpose. Inside the Church is relatively plain and dark without anything significant to see. All in all- not as good as expected."
        }, 
        {
            "index": 556, 
            "rating": "4", 
            "review": "Impressive cathedral inspired by the basilica of St. Peter’s in Rome.. This impressive Russian orthodox cathedral, named after the \"miraculous\" icon of Our Lady of Kazan, is located at: 2, Nevsky Prospekt, Kazanskaya Square. It's interior boasts impressive columns, sculptures and icons by a variety of famous russian artists."
        }, 
        {
            "index": 557, 
            "rating": "5", 
            "review": "A Russian Orthodox experience. The working Russian Orthodox central cathedral is quite imposing on Nevsky Prospekt and decidedly non-Russian in style. With no entrance fee to marvel at the inside (no photos), it is a must. It appears to be in the midst of a clean-up on the outside."
        }, 
        {
            "index": 558, 
            "rating": "5", 
            "review": "Must see. It is in the centre, and a great Cathedral, we really enjoyed it."
        }, 
        {
            "index": 559, 
            "rating": "5", 
            "review": "My favourite site. I personally found this to be my favourite site just by grand presence in the centre of Nevskiy Prospekt.There is a great restaurant at the top of the building behind the Cathedral to the right. They have a outdoor patio on the 6th floor."
        }, 
        {
            "index": 560, 
            "rating": "4", 
            "review": "Impressive outside and dark inside. We happened to visit on a special day where the russians were all collecting water inside the church and it was very very crowded so difficult to see as much."
        }, 
        {
            "index": 561, 
            "rating": "5", 
            "review": "Moving. If you can go when there is a service on then it's a very moving experience."
        }, 
        {
            "index": 562, 
            "rating": "5", 
            "review": "Lovely choir. This ancient, ancient cathedral, dismal on the outside, is as beautiful inside as any onion-clad Russian church. An ancient example of Byzantium, it is not to be missed."
        }, 
        {
            "index": 563, 
            "rating": "3", 
            "review": "not impressive during the renewal. It should be one of the best tourist place. But it was ridiculous that the cathedral was during the renewal and the outside was cover with the green net. However, inside is worthvisiting"
        }, 
        {
            "index": 564, 
            "rating": "3", 
            "review": "Another Russian cathedral. We were there during a service and it is interesting to see an orthodox church service. I was not too much impressed with the church itself. Both the Nicolas church and the church of the savior of the spilled blood are more beautiful."
        }, 
        {
            "index": 565, 
            "rating": "5", 
            "review": "very impressive. It is really huge and beautiful. Must see. You will be impressed"
        }, 
        {
            "index": 566, 
            "rating": "5", 
            "review": "Very interesting. Highly recommended if you are interested in the history of religion, art and architecture."
        }, 
        {
            "index": 567, 
            "rating": "5", 
            "review": "Grand Church on Nevsky. Come to see great general Kutuzov's grave and the original russian fleet flag. The colonade outside is very impressive as well."
        }, 
        {
            "index": 568, 
            "rating": "5", 
            "review": "free entry. this is right near where we stayed, on Nevsky Prospekt. we were surprised when we walked in and it was free, this was possibly because it is a working church? people were queuing inside to kiss/pray to the miracle working icon."
        }, 
        {
            "index": 569, 
            "rating": "4", 
            "review": "Different kind of church. Very different kind of church, remember's me the Vatican"
        }, 
        {
            "index": 570, 
            "rating": "4", 
            "review": "Interesting cathedral. Based on St Peter's of Rome, this cathedral and its arcades is well worth a visit. Very central location."
        }, 
        {
            "index": 571, 
            "rating": "5", 
            "review": "Unique atchitecture. Kazansky Sobor is a unique cathedral built with collonades on the both sides. It even doesn't look like a cathedral at the first sight."
        }, 
        {
            "index": 572, 
            "rating": "5", 
            "review": "Brilliant!. A real gem in St. Petersburg. Worth a visit inside to see all the colorful icons, frescoes, and the services."
        }, 
        {
            "index": 573, 
            "rating": "4", 
            "review": "Wandered inside one evening and watched a service in progress, beautiful singing. Impressive inside and out. Went in one evening and quietly observed a service going on. A choir high in a loft and a priest were singing beautifully. Very special atmosphere. Definitely worth a look."
        }, 
        {
            "index": 574, 
            "rating": "5", 
            "review": "Beautiful Cathedral. I really love orthodox churches, worth visiting! It's a beautiful church..."
        }, 
        {
            "index": 575, 
            "rating": "5", 
            "review": "A Holy Place. This is a true, working church, filled when we were there, in the middle of the day, with many worshippers, mostly women. I loved it here. Quiet. Peaceful. A place to contemplate Russian history, and be thankful for the survival, through the years of Communist rule, of this cathedral. A place to reflect on the survival of the faith of the Russian people. A deeply spiritual place. Also, as it is a church, and not a museum, entrance is free. Worth lighting a candle or two."
        }, 
        {
            "index": 576, 
            "rating": "5", 
            "review": "Right on Nevsky Prospekt. Beautiful cathedral where you will find many locals paying respects and lighting candles. Short stroll from the Spilled Blood Church. Beautiful inside!"
        }, 
        {
            "index": 577, 
            "rating": "3", 
            "review": "Looks like it needs a clean. I was disappointed. Having been to St.P a number of times I tried to do the attractions that I hadn't done or were on the top list. It is an imposing building and probably the weather dint put it in good light as it had been raining all day and the area in the front of the cathedral was packed with parked cars and hard to get around with all the standing water. Was quiet inside with very few visitors and a few buckets capturing leaking water. What is impressive fare the colonnades drawing you into the building.All around are parked tourist buses"
        }, 
        {
            "index": 578, 
            "rating": "4", 
            "review": "Major Church. This is the largest and main Russian Orthodox church in St Petersburg. A steady trail of folk queue to worship at a major icon each day while even more attend prayers each evening."
        }, 
        {
            "index": 579, 
            "rating": "4", 
            "review": "Amazing and fulfilling - definitely worth a visit. You don't need to be Christian or orthodox to admire an amazing building and culture! or to appreciate and respect the people praying inside. The church has seen better days but don't let this put you off, but rather let it add to the experience of realism. Not everything needs to be shiny and freshly painted to be admired.This is not meant to be a tourist attraction, it's an active church and doesn't get the tourist funding of the decommissioned churches. I recommend you go in and see the intricate details inside and if you can, get there for a service / the choir. Be sure to observe a few things: do not use your camera, be respectful, take in a scarf for your head (for the ladies).It's worth it to experience an active orthodox church."
        }, 
        {
            "index": 580, 
            "rating": "3", 
            "review": "Off Nevsky Prospekt, not far from Church of our Lady on Spilled Blood. A distant second or third in terms of attractiveness, far less impressive than the famous Church of our Lady on Spilled Blood. We visited mid afternoon and found few people inside, making the visit to the Kazan Cathedral nice. The exterior is not too attractive, looked tired and in need of a cleaning. The inside wasn't a lot better, offering some decor to admire but was very dark at the time of our visit, making photography conditions quite poor. We sat on some benches inside and admired the ceiling and wall paintings for a while, probably spent 20 minutes altogether before being on our way to the next attraction. Overall, we found it difficult to recommend the Kazan Cathedral off Nevsky Prospect unless you've significant time in St. Petersburg. Its not a highlight so make sure you see more important attractions first. If time remains, you can try to squeeze this one in."
        }, 
        {
            "index": 581, 
            "rating": "5", 
            "review": "St Petersburg’s main cathedral. The Cathedral of Our Lady of Kazan (also known as Kazan Cathedral) is St Petersburg’s major Russian Orthodox cathedral. It is located in the city’s central street, Nevsky Prospect. During the Soviet era, its building was used to house the Museum of the History of Religion and Atheism, but now it is active again as a church.Try to get there around 10 o’clock in the morning to listen to one of the best church choirs in the city singing at the morning liturgy. Organ music is not used in Russian churches – all services are accompanied by a capella singing.Inside, the classical décor of the church is quite impressive. The exquisite iconostasis used to be made of solid silver, but was melted down during the Soviet era, so its present-day replica is just covered with silver leaf. The wonder-working icon of Our Lady of Kazan, found in the city of Kazan at the time of Ivan the Terrible’s rule, is to the left of the iconostasis – you will see people lining up in front of the icon to kiss it and pray to it.The cathedral, completed in 1811, became a memorial of Russia’s victory over Napoleon won in 1812, and the famous Field Marshall Kutuzov was buried inside it. If you enter the cathedral from Nevsky Prospect (which is actually a side entrance - the main one is from a side street), you will see his gravestone right opposite the entrance. Besides, one of the two statues in front of the cathedral represents Kutuzov (the other one features Barclay de Tolly, the other General who commanded Russian army during the Napoleonic War).Russian Orthodox churches have rather strict rules, so make sure you do not use your camera inside and do not talk loudly. Shorts and short skirts are not recommended, and men are requested to take their hats off when they enter a church. Postcards and booklets of the church are available in the gift shop, which also has a big choice of inexpensive small-sized icons."
        }, 
        {
            "index": 582, 
            "rating": "4", 
            "review": "Beautiful music. Monumental cathedral at the centre. Step in and listen the beatiful music inside. Costs nothing if I remember right."
        }
    ]
}