{
    "category": "St-Petersburg", 
    "entity": "Pavlovsk-Palace-and-Park", 
    "avg_rating_stars": 4.641025641025641, 
    "review_count": 195, 
    "rating_stats": {
        "poor": 0, 
        "average": 13, 
        "terrible": 0, 
        "very_good": 44, 
        "excellent": 138
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "Just an Amazing Place!. Our friends had been in St Petersburg one time and never went to Pavlovsk, so we couldn't skip it as we wanted to have unique experience. I think it is an excellent way to explore the Russian countryside and get out of the city. There are lots of different areas in Pavlovsk Park which you can explore. We used the audio guide to walk around. Also Pavlovsk palace is a fantastic building with lovely architecture. I am sure you will come back to your hotel with many bright memories!"
        }, 
        {
            "index": 2, 
            "rating": "4", 
            "review": "Worth to visit it.. I went to this palace with a good tour guide to explain the history of each furniture and enjoy the garden. When you visit the Catherine summer palace, try to take some time to visit this palace."
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "A beautiful small castle. Lost in the woods, not so far from Tsarskoe Tselo, you will find the beautiful castle. The english level there is extremely poor, you need to speak a bit Russian. They also have guides speaking english who can give you a visit."
        }, 
        {
            "index": 4, 
            "rating": "4", 
            "review": "Beautiful place. Worth a visit. This is a beautiful, well furnished place. You could easily guess how they lived there. The library is absolutely impressive."
        }, 
        {
            "index": 5, 
            "rating": "3", 
            "review": "Check box for St Petersburg. If you see one palace you see them all. This is true for Pavlovsk Palace. This is close to Catherine Palace and so a easy visit."
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "Wonderful Palace. Catherine The Great build this palace for her son. While not quite as grand as her own living arrangements, he certainly lived comfortably. This is a great architectural treasure filled with many fine pieces of artwork. The grounds are lovely and make a wonderful stroll on a nice day, but they aren't as extensive as some other places around the area. Still, very much worth a visit if you have the time."
        }, 
        {
            "index": 7, 
            "rating": "5", 
            "review": "Thoroughly enjoyed our tour of this Palace. We thoroughly enjoyed our tour of this palace....it wasn't nearly as busy as Catherine's Palace and it was nowhere near as glitzy....the sort of place you could live in! Very interesting to hear the many stories....wouldn't be as good without a knowledgeable guide though....recommend you drop in when in the area."
        }, 
        {
            "index": 8, 
            "rating": "5", 
            "review": "PAVLOVSK or PAUL'S PALACE EASILY COMBINED IN A DAY WITH THE CATHERINE PALACE. Catherine the Great had the Palace built for her son Paul and his wife Maria Fiodorona it sharply contrasts to the glitz of her Palace and in my view remembered not just for its collection of clocks but chandeliers...look up and marvel! Another striking feature of this Palace is that in every room there are pictures to bear testimony to the Nazi destruction and the extent of the restoration programme. It is a Palace Park complex...the grounds are less formal and in winter it is great to take a troika ride through the Park"
        }, 
        {
            "index": 9, 
            "rating": "4", 
            "review": "Day Trip for both Pavlovsk Palace and Catherine Palace.. Pavlovsk Palace and Catherine Palace are only a few minutes apart, so see them both on a day trip from St. Petersburg. But be sure to head out early to see everything in one day ... as there is a lot to see. The gates to Pavlovsk Park are immediately across the street from the Pavlovsk Train Station. Buy tickets at the gates to enter the park and grounds. A beautiful walk through the park leads you to the magnificent Pavlovsk Palace. Separate tickets are needed for a tour inside the Palace. We had no problem getting tickets for the interior tour. Dramatic interiors. Beautiful grounds. Pavlovsk Palace is not as grand as Catherine Palace, so if you only have time for one, I recommend Catherine Palace. But Pavlovsk Palace is certainly worth it. Also, take a taxi between Pavlovsk Palace and Catherine Place. The short 10 minute ride only cost us 500 RUB and was much easier than the train or bus."
        }, 
        {
            "index": 10, 
            "rating": "5", 
            "review": "A rather intimate and beautiful palace.. You get a feel for the human scale here and the family that loved each other and lived here. Don't miss the 300 clocks!"
        }, 
        {
            "index": 11, 
            "rating": "4", 
            "review": "Nice place. You will probably do a joint tour with the Catherine Palace. Pavlosk is less grand - although I wouldn't refuse it - and makes and interesting contrast"
        }, 
        {
            "index": 12, 
            "rating": "5", 
            "review": "Outstanding place to walk and learn about the emperor Pavel 1st. Very impressive nature and a very large park to walk through. We took a horse carrige ride through the park and rented a boat. We were lucky to go on a school day so the park was empty."
        }, 
        {
            "index": 13, 
            "rating": "5", 
            "review": "A Palace Home. It is nice to escape the relentless gilding of the Catherine Palace and see the much more restrained neoclassical style of the late 18th century to early 19th century. Interestingly, the stunning illusionistic ceiling in the largest room was designed but never painted during the time of the Tsars. It was painted for the first time by Soviet artists to the original designs. The Soviet restorers are probably the finest in the world in the 20th century."
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "A nice compliment to Catherine Palace. Definitely worth a visit if you are planning to see nearby Catherine Palace. Not nearly as crowded (no tour buses there the day we visited) and much more of home-like atmosphere. Be sure to look for the cupid painting (the eyes appear to follow you) and the screen that some believe Emperor Paul hid behind the night he was murdered."
        }, 
        {
            "index": 15, 
            "rating": "4", 
            "review": "amazing. we had such an amazing guide for 2days showing us amazing sights of St Petersburg she gave us great commentary of all rooms+items inside was very interesting+magnificent to see such lovely gardens we was so lucky with such great weather was fantastic we enjoyed our visit very much indeed well worth visiting"
        }, 
        {
            "index": 16, 
            "rating": "5", 
            "review": "Beautiful, Ornate, and The Ability to Enjoy It. The tsars from Peter the Great onward built or expanded a series of impossibly ornate palaces outside of St. Petersburg. The Catherine's Palace in the Tsars' Village and Peterhoff are perhaps the largest and fanciest, but this one is equally beautiful but has the benefit of being far less crowded.Pavlov is Russian for \"Paul,\" who was tsar from 1796 to 1801. Not a successful tsar (in fact he was kind of an odd duck and was killed by palace guards), he stood between Catherine the Great and Alexander I (who defeated Napoleon). Worse, Paul's relations with Catherine, his mother, due to lingering and likely correct concerns that she had been complicit in his father's murder.This palace is seeped in that unhappy history, plus later events, but that doesn't detract from the fact that this is a magnificent structure. In World War II, the Nazis first occupied it and then set in on fire during their retreat, destroying most of it.The palace is amazing on two levels. First, it is quite beautiful with many exquisite rooms and decorative items. We've heard others comment that this is their favorite of the Russian palaces. Second, it is an amazing testament to the preservation and restoration efforts of the Russian people. When war broke out they cleverly preserved many artistic works through careful selection and either sending samples off-site or even burying them outside so deeply that the Nazi's never found them. After the palace was torched, they spent decades restoring portions of the palace that were basically ruins. These rooms today are as stunning today as they were in the early 1800s.There grounds are designed like English gardens with pleasant walks and architectural features.Because this palace is smaller than some of the other attractions, it is not on the \"A\" list for tour groups and is therefore much less crowded, which we liked. We would still recommend using a guide because there is a great deal to see, many of the pieces warrant special consideration, and the palace's tortured history is worth hearing as you are actually viewing the rooms.Pavlovsk is a good choice to visit and easy to combine with other sites in the area."
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "Beautiful garden. A lovely place to walk on pathways. There are benches to sit on when you need to stop. There is also a playground for kids. I was pleasantly surprised to see petunias, marigolds, and maple trees."
        }, 
        {
            "index": 18, 
            "rating": "5", 
            "review": "Peacefully Park. Peacefully Pavlovsk Park And Palace only in not rainy day.Big tour in wonderful park may be good for 3 hours and even more.Great views,nature and sculptures.Quet athmosphere"
        }, 
        {
            "index": 19, 
            "rating": "4", 
            "review": "Something different from nearby Tsarskoe selo. Totally different style from nearby Catherine palace. Less crowd, more peaceful, but absolutely worth seeing."
        }, 
        {
            "index": 20, 
            "rating": "5", 
            "review": "The most harmonious of St Petersburg's palaces. While not as spectacular or overwhelmingly decorated as Petrodvorets, Catherine's Palace etc, this residence is, I find, more graceful and human-sized. It also houses a great collection of antique statues from Pompeii and around, as well as less prominent paintings of all periods from the Middle Ages to the 19th century, all in its suite of \"theme-decorated\", stylish rooms. The park is also well worth a pleasant walk - an English structure filled with Russian flora, some squirrels and a few decorative monuments."
        }, 
        {
            "index": 21, 
            "rating": "5", 
            "review": "Smaller palace but homier and more real. Catherine the Great gifted her son and his wife with this palace. Again, just majestic, but even so it is easier to believe that people actually lived and played in this location."
        }, 
        {
            "index": 22, 
            "rating": "5", 
            "review": "More personal and less crowded. We travelled in a small group of 4 with Marie Rose Tours with an English-speaking guide. Not exactly cheap, but good value to fully understand what you are seeing and to by-pass many of the queues. A small group also meant that we could take more time in every place.Pavlovsk was built for Czar Paul 1, the son of Catherine the Great whose much larger palace is nearby. Paul's place is a much more intimate palace, still spectacularly opulent but with a more homely feel. There were also less tourists here so if you had to choose one place to go in Pushkin, I would recommend Pavlovsk.It was extensively damaged during WW2 but has been lovingly restored using photographs and expert craftsmanship. A lot of the original works of art were buried for safekeeping, and recovered after the Germans left.There are a lot of original 1st Century A.D. roman sculptures and the portrait gallery contains an original REUBENS.Look out for the Cupid painting whose arrow follows you around the room."
        }, 
        {
            "index": 23, 
            "rating": "5", 
            "review": "Another great palace and park close to St. Petersburg. Easy to reach by local buses. Less crowded than other palaces.Well worth seeing the palace interior and the lovely park."
        }, 
        {
            "index": 24, 
            "rating": "4", 
            "review": "Less Opulent than other palaces. The Pavlovsk Palace was in a much simpler style than the other palaces such as the Catherine Palace. It was elegant but seemed very plain after the golden opulence we had visited previously. Our group of 6 ate a simple lunch in the cafe a short walk away in the grounds. The meal was quite good and very reasonably priced in an interesting room which I believe used to be the kitchens for the palace. The park was delightful."
        }, 
        {
            "index": 25, 
            "rating": "4", 
            "review": "Beautiful Palace and Gardens. We went there as part of a Catherine\"s Palace tour. It was a nice contrast to the crowds at Catherine's Palace. Beautiful architecture."
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "Glorious. This Neo-Classical gem is not as popular on the main stream tourist trail as other palaces, so it was a joy to go round these elegant rooms and most attractive gardens."
        }, 
        {
            "index": 27, 
            "rating": "4", 
            "review": "Beautiful landscape . Best place to ride a bicycle and to discover the huge park, there is renting bikes shop there and we enjoyed 1 hour riding through huge trees and green fields"
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "Unique atmosfare. It almost seems that this is place of quite and peace. Positive atmosphere like a better aura than any other palace in St.Petersburg. Loved this. One of the best guided tours."
        }, 
        {
            "index": 29, 
            "rating": "5", 
            "review": "a great addition to catherine palace tour. most tours to Catherine palace don't go here but it's well worthwhile - more homely and great gardens. a great addition to the whole experience"
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Another must do.. The place has such a peaceful feeling. We were there early and so enjoyed it. It was nt as buy as some of the attractions."
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "Wedgwood on steroids. Made it out here on a shared minibus from the end of the blue metro line for just 40R. Easier if you are with Russian speakers This charming Paladian villa in the Neo classical style is well worth a visit and quieter than the bigger palaces. Build for Tsar Paul by British Architect Cameron, it echos London's Chiswick house. Inside the elaborate decoration resembles Wedgwood . Remember that most is a recent full restoration as it was almost gutted in the war. The painting in the large ball room was apparently reconstructed from drawings and never actual there in the original. The opulence even if recreated certainly gives a cue on the Tsars livesThe cafe is in a splendid room, but one of those Russian experiences with cold pasties and non specific soup"
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "Elegant and, as palaces go, gracefully restrained. In terms of proportion and relationship to the natural landscape, the palace that Catherine the Great provided for her son, Paul, outshone her own. She gave Paul the land, six kilometers from her own estate (perhaps to prevent him and his wife from hanging around and being in the way), as a wedding present, and the palace grounds now make up the largest public park in the country. The palace sits on a grassy hill above a small lake – or large reflecting pond. Closing time was nearing, and inky clouds were gathering overhead, so we didn’t go inside the palace; but strolling around the circular courtyard led me to appreciate the elegance of its graceful design and how impressed 18th Century visitors must have been when their carriages drove them to the entrance."
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "Vist Pavlovsk before Catherine's Palace. If you have time for both I suggest you visit Pavlovsk before Catherine's Palace. You will appreciate the simplicity of this palace compared to Catherine's. Also, in terms of crowds when we visited there were only a few visitors compared to wall to wall people at Catherine's. Catherine gave this estate to her son Paul and his wife Maria The park is also worth exploring, especially the Centaur Bridge, the Temple of Friendship with it's beautiful white columns and the Rose Pavilion."
        }, 
        {
            "index": 34, 
            "rating": "5", 
            "review": "This was my favourite palace. This does not have the most \"wow\" factor but it felt more like a place that was lived in. It was filled with what felt like how they acutally lived during that period. To see the acutal dining set given by Marie Antoinette was interesting.Not on the must see trail but we found it very worthwhile."
        }, 
        {
            "index": 35, 
            "rating": "3", 
            "review": "Good to see on the way to or from Catherine's Palace. To see a place where a family that loved each other lived was a different experience from the intrigues connected to the larger palaces."
        }, 
        {
            "index": 36, 
            "rating": "4", 
            "review": "Not the most popular palace, but certainly worthwhile.. It was not possible for us to visit the Catharina Palace in Pushkin, mainly it was too crowded (you to be part of a guided group, or book well in advance). But 5 km from Pushkin is the Pavlovsk Palace, with in comparison few visitors. It was built by Tsar Paul 1, and it is impressive both outside and inside. The different wings and floors each have a different style (Italian, French etc.) and the palace is completely furnished. There is also a large park with small rivers, many bridges, pavilions etc. where you can have a long and relaxing walk.The easiest way to get there is to take minibus (marshrutka) K299 that leaves near the Moskovskaya metrostation. There may be other minibuses as well, try to find out before you go to Moskovskaya (very few Russians speak English)."
        }, 
        {
            "index": 37, 
            "rating": "5", 
            "review": "The enchantment of Pavlovsk. Pavlovsk is altogether on a much smaller scale and is therefore very easy to relate to. It is beautiful and a wonderful piece of architecture - very English in influence. The library, on a curve, and made if birchwood is very interesting. Many of the rooms are exquisite and it is good to see the original furnishings in situ and many of the soft furnishings copied and replaced - as is the case with many sets of chairs - of which an original one is left unrestored so comparison is possible"
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "Place to relax. Really liked this place - it is a refurbished palace of Tsar Paul in classicism style, everything is nice, calm and pretty. It's not as mannered as Catherine Palace, but if you like such architecture, I really recommend to come there and stay a whole day."
        }, 
        {
            "index": 39, 
            "rating": "4", 
            "review": "Winter wonderland. Troika rides around the snowy park were a highlight; very knowledgable licensed guide (organised through @PetersWalk) took us through the museum and showed us all the points of interest. Other palaces are bigger and more grandiose but this fitted the bill for our winter day out"
        }, 
        {
            "index": 40, 
            "rating": "5", 
            "review": "Serene and beautiful. Somehow overlooked by many compare to Pushkin, this park has much to offer- it's by far the largest of the suburban palace parks of St Petersburg, and one of the largest in Europe. The palace is built in neo-classicism style by the Brotish architect Cameron, and harmoniously fits into English landscape park around . Summer activities include carriage riding , boats on the lake, biking etcBeautiful in autumn and refreshing in summer it's one of my favourite landscape parks - you can spend you whole day here if the weather is good, enjoying you coffee break at the Pavillion."
        }, 
        {
            "index": 41, 
            "rating": "4", 
            "review": "Smaller palace. Gift to her son from Catherine the Great and deliberately smaller, still beautiful but if you do not have time then go to Catherine's Palace"
        }, 
        {
            "index": 42, 
            "rating": "5", 
            "review": "Elegant and intimate palace. The palace has a more intimate feel in comparison to Tsarskye Tselo or Peterhof, but is definitely worth the trip. The park is great can easily reached by train."
        }, 
        {
            "index": 43, 
            "rating": "5", 
            "review": "Love it Love it. Amazing little (comparing to other Russian parks and castles) place that takes you beyond history and opens it heart to a caring traveler."
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "A romantic park. Although I am not a tourist, but the St.Petersburg resident, I recommend the tourists who happent to visit this marvellous place, some sights off the beaten track. Apart from the Palace and its park, Pavlovsk is well known for its weekend concers, which usually take place in the Rose Pavilion or Round Hall. It is the tradition which comes from the XIX century when Johann Strauss, the world famous King of Waltzes , gave the regualr performances. You won't regret about the wasted time, taking into account the fact that the their price is very cheap, what's more. the concerts in the Round Hall are free. You won't be dissappointed with the reppertoir and the outstanding proficiency of the musicians. Unfortunately. the schedule of most tourists is very busy, so that they don't have a spare time to wakd around the beautiful park. It is very relaxing, positive activity, indeed."
        }, 
        {
            "index": 45, 
            "rating": "4", 
            "review": "Wow. Came here and looked around. Lovely gardens. Did get lost. Took lovely pics. There are loads of places to go in and visit. On the tour you have to take of your shoes or cover them up. They will give you a portable ear piece if wanted to walk round on own. Can't touch nothing in the rooms. Gardens you can get photo opportunities. Small price to get in and look. Enjoyed it took average 2-3 hours I. There to get round and look round"
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "Another Palace that has been restored and conserved.. Quite a different period palace after all the baroque bling! YES this ruin has been very faithfully conserved and restored in the true Palladian style in which it had been conceived.Also the contents clearly show the \"grand tour\" aqisitive collection of its first owner ,however brief his tenure , with many Italian and Greek inspired sculptures Also there is a good sense of the French ' napoleons ' style throughout being the fashion of the day. Being mid winter we were unable to REALY enjoy the parkland but the bonus of this was a complete lack of other visitors so we had the place to ourselves a RESL treat after the business of the other PlacesWell worth the visits and fits in well with a day trip to Pushkin if you worked hard you could also fit in Alexandria Palace as well if your not palaces out by now!!"
        }, 
        {
            "index": 47, 
            "rating": "4", 
            "review": "Lovely Palace but needs restoration. I visited in December with a guide. You can get here by public transport but I didn't. The palace is lovely but needs restoration as you can see paint peeling,etc. Sadly, there aren't funds for this. But the interior was lovely and you really get a sense of what it had been like. There were also displays of photos of how the palace looked post WWII which was really sad. It is great that some many items were rescued and not found by the Nazis. The park was nice but we didn't explore much because of the weather. I think I would like to come back in the autumn when the leaves have changed - must be stunning."
        }, 
        {
            "index": 48, 
            "rating": "4", 
            "review": "Elegant palace. Surprisingly Pavlovsk Palace was different from all the other Palaces visited in St. Petersburg. It is not frequented by all the tourists so one can view it leisurely and it is worth a visit. It is a good change from the flashy gold found in other palaces. Beautiful grounds too!"
        }, 
        {
            "index": 49, 
            "rating": "5", 
            "review": "Away from maddening crowds. My husband and I spent 10 days in St Petersburg and since we didn't see Pavlovsk on our last visit it was this time at the top of our list. If you want to get away from crowds and hordes of people, Pavlovsk is a great choice.How to get there? We went by taxi. We told our receptionist at the hotel that we want to go to Pavlovsk and they ordered us a taxi and told us beforehand that the price would be RUB 1500 ( $ 25 US$ ). Considering, Pavlovsk is 19 mi outside St Petersburg, this is not bad. We arrived at the park entrance of the palace and had a beautiful walk through the park and along the canals. There are directional signs to the palace.There are sumptuous rooms on the middle floor of the central building. Especially nice is the bedroom with a beautiful bed and matching silk wall coverings. Although, the palace was destroyed by the Germans in 1944, almost all furniture, clocks, and objets d'art were previously removed from the palace, because the Russians were expecting the Germans to take it over, which they did. The Russians rebuilt the palace after the war. When you view the left wing, previously occupied by Maria Feodorovna ( Paul I wife - you have to buy another ticket to view them), we had the feeling like she just left the rooms not long ago. The rooms are small and cozy with beautiful objets d'art. Afterwards, walk back through the park or explore it further ( it's beautiful). At the same park entrance there are usually a few cabs or you can take a marshrutka ( small white buses that stop there ) 2.5 mi to Catherine Palace, which we did. A taxi from there back to St.Petersburg cost us RUB 2000 ( US$ 32 ). We negotiated the fare beforehand with the driver - they all understand numbers. PS The nearby Alexander Palace was closed for renovation, but the park is open."
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "one of the last imperial palaces. Easily accessible from St Petersburg by train:One of the last big imperial palaces in Russia, this time in neoclassical style. This palace has also been heavily affected by the World War II, but restauration has done a superb job. Not as overrun as Puschkin or Peterhof it offers (together with Gatchina) a nice alternative. By train accessible from St Petersburg roughly each 30 mins, it is also just a station after Puschkin, so you could combine a morning trip to Pavlovsk and then the afternoon in Puschkin (there the palace opens for individual visitors at 2 pm, but since tickets are timed, you might want to prebook Puschkin tickets onine). It can also be done in the opposite order. All rooms are richly decorated both the private apartments as well as the state rooms. I wasn't particularly interested in the museum of fashion, so cannot judge this part. Pictures can be taken inside after paying for a fee (which I personally think is totally worth it). The park is not as over the top as in Peterhof and Puschkin, but still nice for a walk through. If you should come by train, the 30 minute walk leads through the park. I personally visited Pavlovsk and Gatchina on the same day, but then you need to switch between different stations in St Petersburg and you need to be ready for an additional 40 minute walk in Gatchina between the station and the palace, so that combination is not for everyone."
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "they had style, they had taste.. compared to other imperial estates pavlovsk is rather small. yet in comparison to other countries nad their measurements of royal estates it's still big. when knowing that so much of it had been destroyed in WWII it's even more surprising to see all the splendour of the in- and exterior. I visited when a flower show was going on in the park. that was so cool. the courtyard was nicely decorated, there was a stage, a flowery fashion show, kids of the town had decorated their bikes with flowers and were riding in a procession of which the tsar and his wife were the highlight. the park is never ending. "
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "Very light and airy palace, spacious gardens.. Light and airy, pastel colors, unbelievable beautiful, not something you will see in Western Europe, all rooms have furniture, priceless accessories.You ride in a troika in the garden which we did, fabulous feeling."
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "Arrive in the morning when the fountains turn on for best experience.. Excellent grounds, fantastic fountains. Arrive in the morning for the best ambiance and lighting! Fun!"
        }, 
        {
            "index": 54, 
            "rating": "5", 
            "review": "many nice restaurants, coffee shops.. It was very interesting trip, we really liked it except the service we got at the hotel Dostoevsky and the taxi drivers,The guide was very unfriendly as well.The city is amazing."
        }, 
        {
            "index": 55, 
            "rating": "4", 
            "review": "Less well known but most worthwhile. When is St Petersburg it is hard to find time for all the great attractions but try to arrange your schedule so you visit Catherine's Palace at Pushkin/Tsarskoe Selo and Pavlovsk the same day as they are close together. It is possible to come here by train, the station is only a short walk from the entrance. You buy a ticket to the park at the gate then a separate ticket to the Baroque Palace/Museum when inside. On a sunny day the park deserves 1-2 hours and the Palace will be about 2 hours also. Everything inside is original and authentic."
        }, 
        {
            "index": 56, 
            "rating": "4", 
            "review": "\"The Perfect Lady & the Heavy Luggage\". Sobriquets given the Czarist creators of this magnificent palace, an apparently loving and creative couple. Her taste & his money are a unique look into Russian nobility -- at least as beautiful and much, much less crowded than the Summer Palace."
        }, 
        {
            "index": 57, 
            "rating": "4", 
            "review": "See before Catherine's palace. This palace is very different than the others. The house is a semi-circle. The photos after the war let you see how much was destroyed. The nice parquet floors car from Catherine's palace. Visit this house before Catherine's, otherwise it will be a let down."
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "Wonderful day trip from St. Petersburg. My favorite day trip outside of St. Petersburg. Somewhat of a low key palace, not as gaudy as some of the others. Lovely stroll in the gardens."
        }, 
        {
            "index": 59, 
            "rating": "5", 
            "review": "outstanding park. I've been there for the second time and once again enjoyed the palace with the gorgeous park. It would be lovely to see it in autumn when all the trees are coloured. I fully understand the poets to whom Pavlovsk was a source of inspiration. Palace is also very interesting and beautiful inside (outside it seems rather modest)."
        }, 
        {
            "index": 60, 
            "rating": "5", 
            "review": "Stunning!. Just lovely. One of Piter's great places to visit. The palace is in a huge area with green all over. I went in the winter and although we could not sit just the walk from the palace to the train station was great! Inside the palace hold many treasures. Really worth the visit."
        }, 
        {
            "index": 61, 
            "rating": "3", 
            "review": "Huge park. We took minibus from Pushkin to Pavblovsk. There are several entrance to the park. We happen to get off at first bus stop at rail station. It took 2km to reach the palace along forest trail. Around the palace is beautiful.However when I lined at ticket office, there was another long line to enter the museum. During 10 minutes to reach kasa, only 5 people wew admitted to enter waiting another 30-40 people.I gave up to enter.There was another bus stop near the palace. My leg soars!"
        }, 
        {
            "index": 62, 
            "rating": "4", 
            "review": "Lovely!. Gorgeous place! We were there for my brothers wedding so didn't see the whole place but the grounds and buildings are a delight."
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "Spectacular Fountains. We did not go into the palace due to time constraints but the park and fountains are not to be missed! Try to end your visit at closing time ... it is quite an experience to see the fountains shut down to rousing music."
        }, 
        {
            "index": 64, 
            "rating": "5", 
            "review": "\"Home to very Russian tsar... \". The palace is memorable as home for the large family of the Russian Emperor Paul I, who although seemingly having been underestimated by some, by others was highly honoured as a martyr assassinated for the freedom of the commons (his was the first attempt to abolish serfdom). His wife was a talented woman, with an unusual hobby of engraving gemstones, some of which are still displayed at the diamond chamber of the Hermitage. She was a true wife and mother to 10 children! The island of peaceful family life for the son, whose mother had no desire to share the throne with... coupled with his 'crazy' idea that all public money should be spent on public purposes... after the death of his mother Catherine II the external debt of the country was h-u-u-u-u-uge... so the palace is humble as compared to any other opulence.. but this is already another story :))"
        }, 
        {
            "index": 65, 
            "rating": "5", 
            "review": "Great outdoor destination. Most of the tourists go to Peterhof and Pushkin. Well, it only means Pawlowsk remains quite and suitable for silent walks along picturesque Slawianka river and in the parks. The palace is reconstructed and worth visiting, restorers made great job. It is not so pompous and rich as two above mentioned palaces, but it is stylish, accurate and home-like."
        }, 
        {
            "index": 66, 
            "rating": "5", 
            "review": "finally a pallace for the family. this pallace is very different from the other Tzars pallaces. Pavel was a family man, he loved his wife and kids and they preferred living together in this palace rather than separate the family as the tzars did. Pave's wife was unusual by the fact that she was doing a lot of non-royal works like gardening, hand-crafts, etc. Very interesing to visit after the other glorious and monumental pallaces, just to understand the difference."
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "WOW. this place is just amazing. the building is full of history and the tour guide was full of knowledge about the place. It took our breath away. A must in St Petersburg"
        }, 
        {
            "index": 68, 
            "rating": "5", 
            "review": "Paul I and Maria Feodorovna's palace of beauty. This palace is just outside St Petersburg (and not far from Catherine's Palace & Park) and the town of Pushkin where the palace is has many other little places to visit. The palace is decorated beautifully, more understated (for a palace) and more homely. It was Czar Nikolas II's favourite palace. We did this as part of a tour with an independent guide, who had a driver and we did this, Catherine's palace and Peterhof gardens in one day. It was a full day but well worth it. We were here slightly out of season in early May and it is the best time to come. No queues, in fact anything but. So pleasant to be able to walk around unhindered.You will be asked to wear overshoes to avoid damaging the original floors. Also, you are not allowed to take pictures unless you buy a \"photography ticket\". It was not terribly expensive and I did so - it was totally worth it as there were many pictures we ended up taking. We did not have time to visit the gardens here but as we were able to visit those in Catherine's Park as well as the large gardens at the Peterhoff, it did not seem like we missed anything."
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "Worth Visiting!. Not as grand looking as Catherine's Palace. Despite its scaled down grandeur, I loved its interior,The toned down opulence gave it a touch of simplicity which was attractive. The sculptures, murals, chandeliers in the halls and rooms were magnificent."
        }, 
        {
            "index": 70, 
            "rating": "3", 
            "review": "A nice complement to Catherine's Palace for a full day of palaces.. Nice palace and grounds. This visit is usually combined with a visit to Catherine's Palace. I would not recommend visiting this one palace on its own. It is very much \"junior varsity\" compared to Catherine's Palace. Seeing both palaces makes for a full day. The St. Petersburg area is full of palaces. If time forces you to choose, hands down visit Catherine's Palace first and foremost."
        }, 
        {
            "index": 71, 
            "rating": "4", 
            "review": "Prepare for Queues!. The whole area of Pavlovsk(Pushkin,) is steeped with places to see. Of course the Palace is the main attraction,and many coaches arrive all day with cruise ship passengers. They are by appointment,so you may get jumped in the queue. Inside is fantastic,as you would expect..every room has oppulance,plus a security woman in every corner,sitting watching,so dont go a millimetre out of bounds! Once in the tour takes 45mins to as long as you want. You have to leave coats etc in the cloakroom,so dont leave belongings in them,although there seems to be little problem with items going missing. The park itself is nice in June(ive been in the winter and its forlorn!) well groomed,and several other small buildings worth a visit. And the sqirrells are tame!"
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "Stunning surroundings !!. Was here in February, when the statues were covered in boxes to prevent ice-damage. Still worth a visit, although quite difficult to find - it's worth the effort to learn about the history of the people and culture of country."
        }, 
        {
            "index": 73, 
            "rating": "4", 
            "review": "Are you up for the challenge of finding this gem?. The museum was closed - surprise cleaning - but the park itself is huge, lovely, and relaxing. Don't do this as a special trip, combine it with something else - but it's pretty good. We loved watching the brides getting their portraits done."
        }, 
        {
            "index": 74, 
            "rating": "5", 
            "review": "Beautiful gardens. Impressed by the grounds and seeing a red stirred for the first time. It is important to visit these parts of Russia's past history to better understand what is important to them."
        }, 
        {
            "index": 75, 
            "rating": "5", 
            "review": "marvelous nature. we were feeling like we are in a paradise :) everywhere is covered with green colour, could smell real natüre. The statues and the castle are really art, recommended..."
        }, 
        {
            "index": 76, 
            "rating": "5", 
            "review": "A Gem. Pavlovsk is one of the smaller palaces and is very splendid yet not intimidating. It was designed by the Scottish architect Charles Cameron who worked for Catherine the Great. Pavlovsk Park was designed in the English landscape tradition and is absolutely beautiful."
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "Beautiful grounds!. The grounds are exceptionally beautiful-- worth a visit! Very different from the manicured gardens found elsewhere."
        }, 
        {
            "index": 78, 
            "rating": "5", 
            "review": "Visiting a Great Structure with a solid history. The Palace itself is well designed and decorated internally , whilst a stroll in the grounds is a must to see what landscape garden layout is all about"
        }, 
        {
            "index": 79, 
            "rating": "5", 
            "review": "Park and palace full with love. Most beautiful park, palace built and equiped with love to each and every small thing. Really makes your iimagination work. Very authentic. A lot of originals. Visit together with Gatchina palace."
        }, 
        {
            "index": 80, 
            "rating": "5", 
            "review": "Preserved from the War. As the Nazis advanced, the inhabitants of Pavlovsk were able to bury Roman statues in the yard and ship most of the beautiful furniture, art, china and decorations away and hide them in the basement of St. Isaacs cathedral. Now you can appreciate the beauty of all the original items back in this lovely restored palace."
        }, 
        {
            "index": 81, 
            "rating": "4", 
            "review": "Pavlovsk Palace. We did this first before Catherine's Palace.\nIt was a wonderful palace for Catherine's son and family of 11 Children. Lovely home. Amazing clocks and statues.\nGreat guide Kate Wes of tours by locals.\nLouise from Canada"
        }, 
        {
            "index": 82, 
            "rating": "4", 
            "review": "Lovely Park and Palace worth your time to go. This was one of the surprises that i had in St Petersburg and would encourage those of you who like some nice relaxation away from the larger crowds to come here. The entire visit was delightful and it helped to have good weather as well."
        }, 
        {
            "index": 83, 
            "rating": "4", 
            "review": "Very peaceful. Pavlovsk is a former summer residence of Russian Emperor Paul I with a palace and an English landscape park in front of it. One should come here to enjoy its serene and so aristocratic atmosphere.\nBe aware it's closed on Friday and the last Monday of each month."
        }, 
        {
            "index": 84, 
            "rating": "5", 
            "review": "Another stunner. lovely gardens and rooms on a more modest scale than in other palaces but still very grand. restoration still going on but there is more than enough to see."
        }, 
        {
            "index": 85, 
            "rating": "5", 
            "review": "Homiest palace in the world. Simple, modest but beautiful palace that would make you feel at home. You can feel the Tzar's family presence like they just stepped out to the park and will be back in a moment."
        }, 
        {
            "index": 86, 
            "rating": "5", 
            "review": "Love this place. It reminds me of Fountainbleu outside of Paris, a hunting palass, but this one inspired by Palladio, outstanding architecture. Small, but well thought out. And the park and surrounding area is very romantic, exiting, full of life."
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "Loved it. Beautiful\"small\" palace well restored. Quite intimate for a palace. Some fabulous interiors and well displayed. The park is also lovely...we took a troika ride (arranged separately) which was magic!"
        }, 
        {
            "index": 88, 
            "rating": "5", 
            "review": "A beautiful palace and grounds.. We were there after a snowfall and as a resold were able to go on a troika ride through the park.\nThe palace is beautiful and has been fully restored from the extensive damage the Nazis left in the scorched earth retreat policy. (Senseless vandalism)"
        }, 
        {
            "index": 89, 
            "rating": "5", 
            "review": "an exquisit palace. This palace is more human in terms of its size Tsarski Selo which belonged to Pavel's Mother, Catherine the Great. Pavlovsk is probably however the most exquisit of the palaces, due to its delicate design, which is not all about grandeur but exquisit taste. It still contains many original tea sets and china"
        }, 
        {
            "index": 90, 
            "rating": "5", 
            "review": "A Jewel of a Palace - All Style, Taste and Class.. Home of Cathrine the Great's probably illegitimate and neglected son Paul the First and his second wife, the wonderful (German) Empress Maria Feodorov. I really loved this place for its magnificent wood and marbled tiled floors. Just Spectacular. I thought the wonderful chandeliers and the lighting in general was also a hi-light. (Well., it would have to be, wouldn't it!?) I love the Russian use of the pastel colours blue and green, not only on the Hermitage Palace and Cathrine's Palace, but on the interior here too. It really works.The curved long room with it paintings again was different, who else has a curved long room? And the floor with its marquetry - absolutely wonderful.I thought the Malachite Room with its malachite green ornamental columns just marvelous too.But the cafe on the left was also beautifully set up, and the coffee and cake were very welcome. Please do not miss this Palace, if you love Style, Taste and Class.Brian, from Perth. Western Australia."
        }, 
        {
            "index": 91, 
            "rating": "5", 
            "review": "Beautiful place.. Just like Pushkin, it's a beautiful place and palace. You can't stop surprising how much wealth and beauty old Russia had. You can't find anything like this anywhere in the world."
        }, 
        {
            "index": 92, 
            "rating": "4", 
            "review": "Little gem away from St-Petersburg. The palace is beautiful - the tsarina loved collecting foreign artworks from Western Europe. So indulge yourself into a rich and diverse art collection!"
        }, 
        {
            "index": 93, 
            "rating": "5", 
            "review": "A GREAT PALACE BUT TRAFFIC CURTAILED OUR VISIT. The 'problem' with St Petersburg is that there is too much to see! At the end of a two-day Fabergé Symposium we had two days of sightseeing. The Saturday seemed fine, The morning at The Hermitage, lunch at Vladimir's Palace and then on a coach to Pavlovsk Palace. Things started to go awry when those who had opted to tour the Vladimir Palace instead of lunching there, then decided to stay on for lunch. We therefore started an hour late and then ran into the most horrendous traffic jams. We therefore arrived very late. Thankfully, the Director kept the Palace open for us. Three hardstone figurines had been taken from the vault so, upon arrival, we were taken in a side entrance to go immediately to the library to see those. We then had a very quick tour of the Palace. We did not do it justice, but, I do not think anyone visiting would certaoinly not be disappointed. It is well furnished and was a joy - but, not when you are rushing! If time is scarce in St Petersburg it would come after Catherine and Peterhof Palaces but before Alexander. However, if you can squeeze another palace in after these two but don't want to travel, consider Yusupov Palace in the city centre."
        }, 
        {
            "index": 94, 
            "rating": "5", 
            "review": "Special Palace. Don't miss seeing this palace. It is not as big as the Czar's estates, but it is really special The grounds are very beautiful and although the Palace is much smaller, it is still very beautiful inside. There are so many beautiful pieces of furniture and art on display. We just enjoyed the afternoon taking in how the Russian nobility lived during that time."
        }, 
        {
            "index": 95, 
            "rating": "5", 
            "review": "One of the best experience. After reading so many reviews we decided to go to Pavlovsk, and it was worth the visit, we didn't only experience the park and palace we also experience the suburbs of st. peters burg, and also its public transport, the locals in pavlovsk are very helpful, they guided us in a proper way though they don't know English but we communicated with them. when we went to the park it was enormous and beautiful, the palace is not as big as hermitage but i love it as its beautiful you can give time to stay there and enjoy the beauty of the nature."
        }, 
        {
            "index": 96, 
            "rating": "4", 
            "review": "Not as grand as Catherine's palace but.... This place is not as grand as Catherine's Palace, but it's quite charming. You can almost imagine how Paul and his wife, Maria, used to live before. This palace is more \"homey\" and the stuff that you see inside are more practical. If you have extra time at St Petersburg (maybe more than 4 days), visit this palace as well."
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "Huge park, beautiful palace.. Park is really old and enormous, there is some wide part, a well-groomed part and spacious famous russian fields. You can spend a whole day walking there. Not crowded, cheaper then the others, free of charge after 6 p.m. (as most of the parks). There are a lot of squirrels, and nuts for sale, so you can feed them. Palace is beautiful and good for those who are interested in palace interiors."
        }, 
        {
            "index": 98, 
            "rating": "5", 
            "review": "I agree. A previous reviewer has said that \"if you don't see Pavlovsky, you have not seen Russia\" What I liked about is was that it was not as 'over-the-top' as some of the other palaces."
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "Really interesting. We didn't take photos in this one, you have to pay an extra fee to do so and to be honest had I known how cool it was inside I would have paid the extra! As it was not a royal palace I expected it to be not as interesting... wrong! It seemed to have the most original items in it and wow for a non royal they lived really really well! It is also where Rasputin was killed, that comes with an interesting story (which most of us know a version of) and atmosphere. Definitely worth a visit!"
        }, 
        {
            "index": 100, 
            "rating": "5", 
            "review": "Fantastic. Beautiful place to visit...the sun shine made it even more wonderfulDon't visit St. Petersburg and miss this"
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "If You Don't Go to Pavlovsk, You Have Not seen Russia!!!!. Pavlovsk Palace is, by far, the best of all the sights in and around St. Petersburg. I've made forty trips to Russia and speak from experience. This palace was the elegant, charming and gracious home of Emperor Paul I of Russia and his incredible wife, Marie Feodorovna…a role model for all women. The other palaces in and around St. Petersburg are grand and breath-taking; Pavlovsk is all of that and more. It is easy to envision Paul and Marie raising their large family in this charming home which is surrounded by gardens and a most incredible park with nooks and crannies and incredible vistas, pavilions, streams, bridges, look-outs…. Plan to spend an entire day in the Park and it will be time well spent. Plan to spend another day in the Palace and you will see art and artifacts which are mind boggling. Pavlovsk Palace and Park will provide you with an unforgettable glimpse into Russia's fascinating history and its people."
        }, 
        {
            "index": 102, 
            "rating": "5", 
            "review": "Pavlovsk. Pavlovsk palace and park so intresting and so charming placecollections so rich - Franch bronze and furniture Italian painting and a lot a lot others treasures, all rooms so beautiful park just like paradise - huge and beautifull, and also a lot pavilions, sculptures, i am ready back again and again at this so beautifull place"
        }, 
        {
            "index": 103, 
            "rating": "3", 
            "review": "Behind Pushkin (1) and Peterhof (2). It's a perfectly nice St. Petersburg outer area with a beautiful park and a historically important palace to visit. However, it should only be on your radar if you're in the city for a week and have time to take everything in. If you're pressed for time, head for Pushkin first (Catherine Palace and Park) and then Peterhof (fountains) and only then come here."
        }, 
        {
            "index": 104, 
            "rating": "5", 
            "review": "I could live here!. After seeing a few palaces it was refreshing to see one that looked like you could actually live there (if you were a princess of course!) The flow was great and it truly showed off it's loveliness. It was beautiful and we loved it!"
        }, 
        {
            "index": 105, 
            "rating": "5", 
            "review": "For those who know!. Indeed, if you are to select just one palace to visit while in Saint Pete, go for Pavlovsk. We have been in Saint Pete more than 20 times over past 30 years and Pavlovsk remains a hidden gem worth of all the traffic. Its cozy, natural, impeccably beautiful and different for every room you see. Someone here on Tripadvisor rightly said: you can just move in and live there! True as it sounds. One advice: beat the crowd and visit in a.m., when the mainstream storms the sights in Pushkin. Somehow everyone gets to see it only as a free compliment to Kathrine the Great Pushkin Palace, as it is nearby by modern standards. Do the opposite and do enjoy!"
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "Worthwhile to visit. The Palace is beautiful to visit. Lots of treasures to see in the beautifully appointed rooms. A flower event was being hosted in the palace courtyard on the day we visited. Antique carriages were available for rides through the grounds. Actors dressed in period costumes strolled or marched in the area of the palace."
        }, 
        {
            "index": 107, 
            "rating": "5", 
            "review": "How the mighty lived. We went to Paul's palace after visiting Catherine's palace and while it was no where near as opulent (since it was designed as a working palace to live in rather than a show palace), I was still amazed at all the details in the rooms. I'm always fascinated by the floors and ceilings in palaces, and this one doesn't disappoint. Not as heavily visited as Catherine's Palace, but definitely worth visiting for a glimpse into a slightly different way of life for the son of the Empress."
        }, 
        {
            "index": 108, 
            "rating": "5", 
            "review": "Another Russian Palace. This was the second palace we visited on the same tour (following Catherine's Palace). It is quite different. Our guide told us this was actually where the royals preferred to stay/live. There were people here, but not in the numbers we had waited through in the morning at Catherine's Palace). Like Catherine's Palace, this residence also suffered destruction during WWII, but has been restored. Many of the furnishings, artwork, etc. were thankfully crated up before the Nazis arrived and has since been returned for all to enjoy. We enjoyed seeing the beauty of this palace. While not as large as Catherine's Palace, it still has opulence and beauty everywhere one looks."
        }, 
        {
            "index": 109, 
            "rating": "5", 
            "review": "A good visit. Relaxing park with small train to go round, and splendid house (and we even managed the metro/railway/bus to get there!"
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "Lovely, on a human scale. We chose to visit this smaller of the royal palaces, and were delighted. The palace itself is a gem, every room a masterpiece, but not overwhelming - a very pleasant 45-minute visit. The park is wonderful, with meadows and wood and lakes, which we shared with lovers, families and old couples; out to enjoy the sun. it's an easy train ride from Vitebsky station, Saint Petersburg to Pavlovsk station, just across the road from the park gates. (150 R to visit the park)."
        }, 
        {
            "index": 111, 
            "rating": "3", 
            "review": "The palace is not worth the line. Pavlovsk residence is pretty and the most important thing about it is IT'S NOT CROWDED, even in summer, becand, to be honest, the palace is not worth standing in line, especially if you see other palaces during your stay. Just walk around the park, discover beautiful hidden pavilions, statues etc. The place is perfect for a romantic getaway.The greatest thing ablut Pavlovsk is that it pretty and fun the wholeyear around. In summer they have a little train tour around the park, and in winter you can ride a \"troika\" - traditional Russian sleigh with 3 horses, slide down the hill, play snowballs and so on.Try to get there by suburban train and then get a little minibus to the museum from the train station (almost all of them have the word \"Pavlovsk\" written on them in English). The train station is a part of THE FIRST RUSSIAN RAILROAD ever built (it was between St Petersburg and Pavlovsk). Back in the day it was considered so awesome, that even the famous composer Strauss gave concerts there for quite a while, so it's worth a look."
        }, 
        {
            "index": 112, 
            "rating": "5", 
            "review": "Another gem. Just when you think you've seen more palaces than you'd ever want to visit, you come to Pavlovsk. Utterly charming, this palace was considered a rather modest family home and, despite its size and the beauty of the architecture and rooms, you get the feeling that this was the well loved home of real (if incredibly wealthy and privileged) people. Very worth the trip, although, if you only have time to see the \"highlights\" it wouldn't be the end of the world if it was missed."
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "Full of History!. There was nothing I disliked! Did feel a little uncomfortable because you were watched very closely while there. Felt like they didn't trust anyone.... but understandable... so much history!"
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "A spectacular small palace. We were still impressed with this Palace even after visitig Catherine's Palace. Not all of the rooms can be visited, but those that can are well worth the visit. Some surprising large rooms among many smaller gems."
        }, 
        {
            "index": 115, 
            "rating": "5", 
            "review": "A Palace You Could Live In. Catherine's son, Paul, worked with architects to create a real home at his personal palace for his wife and children. Each of the huge windows affords a different view of the park. He had the palace divided into the men's wing with hunting and war themes and the women's wing with more genteel decor. The furnishings are beautiful and it's definitely worth a morning's sojourn."
        }, 
        {
            "index": 116, 
            "rating": "3", 
            "review": "great place but unfair for foreigners. Russian pay 350, foreigner 500 rubles but now the 3rd floor with the furniture of Russia have an additional 60 rubles to pay. Cashier should inform tourist accordingly but still a great palace to visit, great park."
        }, 
        {
            "index": 117, 
            "rating": "5", 
            "review": "Well Worth a Visit. We visited this Palace, Park and Pavilions on the same day as the Catherine Palace as they are quite close together. It did not seem rushed to do the two in one day and they were quite different. Pavlovsk receives less visitors so is a lot quieter which is pleasant. Well worth a visit if you have time but not quite so essential as The Catherine Palace if time is short."
        }, 
        {
            "index": 118, 
            "rating": "4", 
            "review": "Well worth a visit. Interesting palace to see. Not as busy as Catherine's palace. Nothing on a small scale here. Beautifully decorated inside and well preserved.."
        }, 
        {
            "index": 119, 
            "rating": "5", 
            "review": "Amazing grounds and a 'small' palace feel?!. Small palace, yes I said that! In comparison to the others we visited in and around St P, it was. You do get more of sense of the owners having lived here, though there are still some extremely grand rooms and a big scale, there are others which give more of a homely feel than other palaces. The grounds however are enormous and if we had had more time I would have loved to spend time strolling amongst the trees and by the river enjoying the calm and pleasant views. There is much to be explored here - plus my hubby enjoyed the green onion pie he bought by the entrance (in case you are peckish!)."
        }, 
        {
            "index": 120, 
            "rating": "5", 
            "review": "More intimate than Catherine's palace. We liked this palace better than the more famous Catherine's palace. It feels more like you could actually picture living there -- more intimate. The park looks glorious but as we visited in winter and did not have cross country skis, we did not explore. I bought a Russian scarf here and would say the quality and price at their gift shop was better than at the shops in town."
        }, 
        {
            "index": 121, 
            "rating": "5", 
            "review": "Worth the trip. worth going to see a slice of the Tsarist lifestyle. We were there on a beautiful cold sunny day with all the snow sparkling. Took a troika ride through the grounds which was a highlight."
        }, 
        {
            "index": 122, 
            "rating": "5", 
            "review": "PAVLOVSK. If you visit the Catherine Palace (Tserkoe Selo or Pushkin) then the Pavlovsk palace is in the vicinity - some 10 mins drive by taxi. This one is a less grandiose site but more of a \"human\" palace. Go for it!"
        }, 
        {
            "index": 123, 
            "rating": "5", 
            "review": "Cosy and family palace. Pavlovsk Palace was built as summer residence for the russian tsar Paul I and his family by order of his mother Catherine the Great. It is unusual place with a very nice atmosphere. Not big rooms with a lot of beautiful exhibits and you can feel the taste of the owners, good taste. And besides it is the only museum of St. Peterburg which boasts 99 per cent of original objects de art despite it was ocuppied and badly damaged during world war II. Park surrounding the Palace seems to be just a forest. Quiet place. Worth visiting."
        }, 
        {
            "index": 124, 
            "rating": "4", 
            "review": "Very Interesting. Pavlovsk Palace and Park were very interesting. Not yet completely restored but still worth the visit for the history alone. Staff were not as friendly or welcoming as the other sites."
        }, 
        {
            "index": 125, 
            "rating": "4", 
            "review": "This is a \"small\" Palace with wonderful park and grounds. What a relief after the Catherine Palace and Peterhof! This one is much smaller. There are many fewer tour buses. There are fewer vendors everywhere. It has the look of actual people having lived there, and things having been chosen by the residents (they were). I loved the library.You can there on a convenient commuter train."
        }, 
        {
            "index": 126, 
            "rating": "5", 
            "review": "Breathtaking oppulence open for all to see. Pavlovsk Palace lets one use all his/her senses to take in the place as the stories of the people involved in it's creation. Moving along in a tour with a permit to Videotape was a chance to see Catherine the Great in action, to see her British Architect break much of the Russian Architectural tradition in the creation of the estate - and then Paul, becoming Tsar after a 42 year wait for his Mother Catherine to complete her directional change for the country following the pattern established by Peter the Great. Our videotape of the visit is a regular reminder of that Mission. To see the loving care of putting more than 40,000 shards used to recreate one ceiling after the German occupation pulled back following the long siege. WOW, My in the flesh visit was in 1998 but my Video recreation was this month (August, 2013) Harold L La Duke. Auburn, WA."
        }, 
        {
            "index": 127, 
            "rating": "5", 
            "review": "Not to be missed. While this Palace and Park are off the usual tourist path, it is well worth the ride to get there. Like many of the palaces outside of the city, the grounds are huge, and breathtaking. My wife and I spend the day there, and we know we missed things. We fully plan on making a return trip, as we did not get to tour the palace itself. It was a beautiful day and we did not want to be indoors."
        }, 
        {
            "index": 128, 
            "rating": "5", 
            "review": "Enormous, beautiful park. I felt so lucky to be able to spend the day in this gorgeous park. It was really the highlight of my trip to St Petersburg. The palace was nice, but if you only visit it and the formal gardens around it, you're missing out! Don't miss the temple of friendship, and the haunting mausoleum deeper into the woods. There is a beautiful winding river that goes through forest and meadows, with little row boats. Supposedly there are as many miles of walking path here as the distance from Moscow to St Petersburg. I don't know if that's actually true, but you could easily wander for a whole day."
        }, 
        {
            "index": 129, 
            "rating": "5", 
            "review": "Beautiful park, close to St Petersburg. Compared to the unbelievable palaces in Peterhof and Pushkin, Pavlovsk is more modest I would say and the park is huge and beautiful with small ponds and rivers, bridges and tracks.Historical fact for dutch people; In 1816 prince willem II (later king of Holland) married in the rosepavilion of Pavlovsk park with his wife: Anna Paulowna, later queen of Holland, daughter of Tsar Paul I, granddaughter of Catherine the great. Grandmother of Queen Wilhelmina."
        }, 
        {
            "index": 130, 
            "rating": "5", 
            "review": "Beautiful. This is my favorite palace probably because there is no sign of Elizabeth anywhere on the premises. No gold!!!! Just a beautiful, more intimate palace. I wish I could have spent more time exploring the gardens."
        }, 
        {
            "index": 131, 
            "rating": "5", 
            "review": "Simply beautiful and elegant. This is the favorite palace of our tour guide. It is also my favorite palace. It does not have the \"gold overwhelm\". It is simply beautiful and elegant. There are much less tourists than Peterhof and Catherine Palace so we can enjoy and appreciate at our own leisure. This was a living palace of Paul, the son of Catherine the Great, and his family before he became a tsar. Both Paul and Maria were well educated and Maria was a gardening expert. There is much more connection with daily life in this Palace than the others. The palace was well designed and maintained. I agree that this attraction is under rated. It is definitely a germ and not to be missed."
        }, 
        {
            "index": 132, 
            "rating": "3", 
            "review": "Less impressive than other sites. To be seen after Hermitage, after Catherine Palace and Summer Palace. Also to been seen after the nigh boat tour when bridge opens. Nothing outstanding and less impressive than other sites."
        }, 
        {
            "index": 133, 
            "rating": "4", 
            "review": "Pretty and peaceful. All but destroyed during the war and still undergoing restoration but the rooms that are open to the public are beautifully restored. Opulent whilst retaining a homely feel. No queues and crowds – what a relief! Photography allowed inside. Well worth a visit."
        }, 
        {
            "index": 134, 
            "rating": "5", 
            "review": "The Jewel. Pavlovsk does not have the tourists that descend on the Catherine Palace, but what a gem! This palace is nestled in a beautiful park and is another example of Russian expertise in reconstruction and preservation."
        }, 
        {
            "index": 135, 
            "rating": "5", 
            "review": "Different style palace for the others. This palace is in the classic style, beautiful in a very different way from all the other major palaces in the St. Petersburg area. We were lucky to have visited the Palace when the number of tourists was low, probably because it was first thing in the morning. Another of the incredible and amazing Russian palaces in this area."
        }, 
        {
            "index": 136, 
            "rating": "5", 
            "review": "A Vastly Underated experience by Tourists. This thousand acre park and Palace are beautiful, serene. This is the home of Tsar Paul and his wife Maria Fyodorovna. She loved this place and nurtured it for another 28 years after her husbands assassination. Everything is impeccable. The Park itself would be worth the trip out of St petersburg and lots of Russians make a day trip out of enjoying this park with loads of trails, hills and lakes."
        }, 
        {
            "index": 137, 
            "rating": "3", 
            "review": "The wonder of 'new build'. This palace was a shell after WW2 - so it was reassuring to see all the building and craft skills still exist.The gardens are beautiful."
        }, 
        {
            "index": 138, 
            "rating": "5", 
            "review": "Just Heavenly.. As a frequent visitor to the lovely St. Petersburg, I have to say that Pavlovsk is one of the most beautiful places I have ever seen. The alleyway of trees leading you to the park is so peaceful- and being off the beaten track, you don't have the same issue of crowds like at Peterhof Palace or Catherine's Palace. Then, once you set your eyes on the park.. Its breathtaking. Really, its just one of those special places that you promise yourself you will see again someday."
        }, 
        {
            "index": 139, 
            "rating": "5", 
            "review": "a forgotten gem. off the beaten track, no crowds -- and a lovey way to spend a quiet afternoon -- if you are exhausted by catherine' palace, try this for a refesher"
        }, 
        {
            "index": 140, 
            "rating": "5", 
            "review": "My favourite palace-home. I fell for Pavlovsk, both for the palace and the park at first sight many years ago. And I decided to come again not only because I wanted to show it to my teen-daughter, but also because when we were visiting the Sanssouci palace in Potsdam, near Berlin, Germany, I was struck by the thought about how alike those two palaces were. Not in the meaning of being a 'replica' but in the style, elegance and atmosphere. The palace of Pavlovsk is not that 'posh' or luxurious as the Kathrine's palace in Tsarskoye Selo (now -Pushkin) is, or the Winter Palace (the Hermitage) of Petergoff are, It is a palace, yes, but it's also a nice home built and decorated with a phenomenal taste of the owners (then Grand Duke Paul (future Emperor Paul I and his wife Maria) and the Russian Architect Andrey Voronikhin. You certainly want to stay there for a while. Ruined to the ground by the Nazi in the WWII, it was completely restored by the devotion and commitment of one young lady (at that time), whose name was Anna Zelenova. She became the director of the museum just before the war time and she managed to save most of the valuables from the palace and then persuaded the authorities to restore the palace, although some thought that it was impossible to bring it back to life. Moreover, most of the trees in the park were cut down and it was turned into a mine-field as fascists were afraid of partisan attacks. Zelenova was the first to enter the place with the very first soldiers of the Soviet Army, liberating it and immediatelly set out to work. This year is her 100-anniversary. She literally laid down her life to Pavlovsk and although she passed away quite a while ago, this is a person worth remembering. The romantic park in the English style is now fully restored too and full of flowers (when we were there many lawns were covered with snowdrops), various birds and numerous squirrels which seem to be very busy but rather friendly. Pavlovsk was a source of inspiration for Johann Strauss II , who spent a couple of summers there as a guest violinist and conducter, had a romance with the Russian noble daughter Olga Smirnitskaya, whose parents refused to give their consent to their daughter's marrying Strauss. He had a broken heart but now we have lots of fantastic music composed there, including such gems as Polka Olga, Persian March, Waltz 'Farewell to Petersburg' and many others. If you are interested in what brought about all this - do not miss Pavlovsk if you happen to be in Russia's northern capital. It's just a 15-min. journey by local train from the subway station 'Kupchino'. You can also get there by some shuttle buses as well or from the Vitebsky railway terminus (about 35 min.). in the center of St.Pete, Come, enjoy and relax!"
        }, 
        {
            "index": 141, 
            "rating": "5", 
            "review": "inspring building. The fact that the curator took a big risk because she could have been killed on stalin's orders for panicking as she decided to start packing up valuables when Nazi's were on their way to invade st petersburg makes this a remarkable building. although nazi's burned and destroyed shell of palace so many items were saved prior to their arrival that the rooms are furnished in original furniture. A must see!"
        }, 
        {
            "index": 142, 
            "rating": "4", 
            "review": "A charming, delightful place. Like many others, I imagine, we were taken to Pavlovsk after Catherines Palace, and found it peaceful and charming with few visitors. It has been beautifully restored from WW2 and I understood that more of the beautiful furniture was original as it had been put into store at the outset of the war. The gardens were beautiful too, including the very ancient avenue of Linden trees. However, we did not have too much time to explore before we had to leave.The only downside was the Cafe, which was suddenly crowded and noisy with a large party of tourists, pushing and shoving to get served first. We had mushroom soup and bread, which was only warm and tasted awful and were glad to escape outside to peace again."
        }, 
        {
            "index": 143, 
            "rating": "4", 
            "review": "Very nice park. Didn't visited the palace, but the park is very nice - great place to rest and calm...... Easy to get using train or marshrutka."
        }, 
        {
            "index": 144, 
            "rating": "5", 
            "review": "A beautiful setting. We enjoyed all the palaces, but this was one of our favorites. It was so empty, we had the place all to ourselves. Also a amazing restoration since WW2."
        }, 
        {
            "index": 145, 
            "rating": "5", 
            "review": "The Forgotten Palace in Tsarskoye Selo. In comparison to the Catherine & Alexander Palaces in Tsarskoye Selo, Pavlovsk was less frequented by foreign tourists like myself. It was less than 10 minutes by car from the other two on the other side of Tsarskoye Selo in expansive wild grounds more like an unattended forest park.Interiors were well maintained, its opulence & grandeur was somewhere in between the Catherine & Alexander Palaces. My favourites were the Italian Hall, the imperial suites of Maria Fiodorovna, Nicholas II's mother. The park grounds running along the Slavianka River, Maria Fiodorovna's private garden & the Three Graces Pavilion were all well worth visiting."
        }, 
        {
            "index": 146, 
            "rating": "5", 
            "review": "Relaxing day trip outside of the city centre. I highly recommend going outside of the city centre if you come to St Petersburg. It may seem daunting to take an electrichka or bus, but there are plenty of explanations online about where to go and what to do, etc. Pavlovsk is just a nice big park/woods with meandering paths and Russian feeding birds and squirrels. It's a nice place to let loose, let the kids run around without the fear of a crazy driver hitting them, and to get some fresh air."
        }, 
        {
            "index": 147, 
            "rating": "5", 
            "review": "Walking and bird watching. The park and its paths can get you away from other visitors and closer to the avian nature found in the region. Oh, yes, and watch for the squirrels."
        }, 
        {
            "index": 148, 
            "rating": "4", 
            "review": "Really interesting place. Visited here in December - there was a great ice sculpture outside of the nativity which was an added bonus! After the Catherine palace it was hard to be amazed again, but this place did fairly well in comparison. It is much less visited and therefore less busy which was nice. It is not as grand as the Catherine Palace, but the history is very interesting and the style of decoration is more classical. Definately worth combining with the Catherine Palace."
        }, 
        {
            "index": 149, 
            "rating": "5", 
            "review": "A Dream Fulfilled. Twenty years ago, my wife gave to me a book about Pavlovsk. It was a compelling story and well presented. I thought that if I ever was fortunate enough to be able to travel there, I would visit Pavlovsk. We had that opportunity this year, and were not disappointed. After the Catherine Palace at Pushkin, Pavlovsk is almost 'homey'. It is also much more remarkable, in its own way. If you cannot see both places (they are near each other) see Pavlovsk."
        }, 
        {
            "index": 150, 
            "rating": "5", 
            "review": "Classic style with French Influences. I liked Paul's palace better than Catherine's palace, and I was really glad that we had hired a private guide, Sergei, to drive us so that we could see both of them, in addition to Alexander's Palace, in the same trip. Also by having a car, he knew where the closest parking was available, or he was able to drop us off close to an entrance. If you like that late 18th C style, this is something to see. It is too bad that most visitors don't have time to see this one, as the rooms and gardens are exquistely beautful. We were able to look at our own pace, and even retrace our steps. There is an interesting furniture exhibition, which occupies 16 rooms and is located on the III floor of the central building of the palace, which is a reconstruction of the interiors of living rooms of the upper class in Russia and the history of decorative art XIX - early XX centuries. Reconstruction were drawn from photographs, drawings and paintings with images of mansions and houses of Russia. You can view panoramic images of the rooms and this exhibition at pavlovskmuseum.ru"
        }, 
        {
            "index": 151, 
            "rating": "5", 
            "review": "different flavor after catherine's palace. after we had visited the royal grounds and the catherine's palace, we took the bus with the board Pavlosk ... a lady guided us to get down at the palace... we entered at the garden gate and after buying tickets (availing student discount also) we trekked through the gardens... these are wild yet beautiful... there was a steady drizzle, and since we had done a lot of walking through out our trip, we were quite tired after the 2 mile trek... reached the palace entrance, bought the tickets, and went through the several rooms on both the floors... here the rooms are furnished exactly as they were when in use and we could almost sense the charged atmosphere... though not as ornate as catherine palace with all its gold, this was beautiful and tastefully done up... the docents were switching off the lights behind us as we left each room, and we were almost scared of getting locked in!!left the palace when it closed... started to trek back the same way we had come in... as we had seen several visitors doing that on our way in... however, by sheer chance, a maintenance worker asked us where we were going in russian and said the palace was closed... we said... avtoboos... meaning bus... he pointed to a gate quite nearby... we happily walked to that exit and boarded the bus (minibus #286, 299, 545)which was going back to catherine palace... we had saved ourselves a 2 mile trek back... none of our research had told us of this entrance/exit... so that was the story of our day which ended with 2 royal palaces and 2 royal gardens in a single day!!"
        }, 
        {
            "index": 152, 
            "rating": "5", 
            "review": "Amazing. This was interesting as most all of it is a restoration. A marvelous job. Very interesting, a beautiful place."
        }, 
        {
            "index": 153, 
            "rating": "5", 
            "review": "Not as well known but well worth the visit!. History, history, history. Beautiful and intimate palace with amazing antiquities. The grounds are expansive and if you can, plan a picnic here to really appreciate the quiet beauty and elegance of the home of Tsar Paul I and the mother of Emperor Nicholas I. You can read more at my blog: www.mytb.org/kelleygirl"
        }, 
        {
            "index": 154, 
            "rating": "5", 
            "review": "Pavlosky. Very different and a real sense of the military emphasis. It is so large and I wish we had spent more time there."
        }, 
        {
            "index": 155, 
            "rating": "5", 
            "review": "More Classical Style. Pavlovsk Palace is a different style than the more rococo style of Catherine Palace. It's more classical and subdued, though how can you say subdued when such a large building was to be used by two people. Gardens are of an English style with a more rustic look about them."
        }, 
        {
            "index": 156, 
            "rating": "4", 
            "review": "Sad son of Catherine.. But he still got a great palace. More restrained. Loved the views of joint garden. Didn't like not having shuttles between each palace. If you plan this trip, plan a whole day."
        }, 
        {
            "index": 157, 
            "rating": "4", 
            "review": "Less flashy outside than Catherines palace. We stopped here for lunch on our tour then visited the palace. The interiors we beautifully presented and full of art, but little furniture. As with other palaces there were huge queues and you shuffled round but it was worth it."
        }, 
        {
            "index": 158, 
            "rating": "5", 
            "review": "Beautiful palace and nice french park. If you have some spare time, go to Pavlovsk. It is only 35 minutes by train from the center of Saint-Peterburg. On the weekends there are free concerts in the park, some horse-riding and nice food in restaurants around (although might be costly)."
        }, 
        {
            "index": 159, 
            "rating": "3", 
            "review": "Could be avoided. It isn't too far from Peters Palace.However there are too many palaces;and one has to select the more important ones.The only advantage is the glimpse of the suburbs of Petersburg."
        }, 
        {
            "index": 160, 
            "rating": "4", 
            "review": "his & hers palace. Not as huge or ornate as othe St. Petersburg palaces. U shaped palace with one part for him & the other for her (often mirror iamged). Much quieter thatn other St. Petersburg palaces.Good to visit combined with Catherine's palace"
        }, 
        {
            "index": 161, 
            "rating": "5", 
            "review": "greatest park/mini forest you'll ever see. the park was initially designed and arranged for the Russian tsar Paul I. it is one of the biggest and most beautiful parks in Europe. It is over 660 hectares in area, and turns from a simple park around the palace to a lovely mini forest where you can easily manage to be lost. in the park you can find a lot of squirrels that come close if you have something in hands to feed them, so make sure you carry seeds (you can buy them slightly after the entrance) and photo camera to take nice and amazing photos not only of these animals but of the nature and architecture itself. the entrance to park is not free (but it is considerably low) however before 9 am and 18 am the entrance is free. It is also nice to have a tour in the park with a bike of your own or a rented one which is usually at the entrance from the city side. There are three main entrance from the railway, from the city and by the palace. If you are in Pushkin you can get to Pavlovsk by public transport on buses 370 383 and 545. as well as several private ones with same and other numbers. (they usually mention in english palaces and parks route). Enjoy"
        }, 
        {
            "index": 162, 
            "rating": "5", 
            "review": "Beautiful palace and vast park on the outskirts of St. Petersburg. This place sees lot less visitors than the Peterhof or Pushkin (which is really close by). After seen the dozen or so furnished rooms in the palace you have a pleasure scanning the vast park.Take a small tourist train just in one direction and walk your way back to make the most of the sightseeing."
        }, 
        {
            "index": 163, 
            "rating": "5", 
            "review": "A hidden jem that should be 'a must' for any visitor to St Petersburg. Whilst the Peterhoff and Catherine Palace make such an impact due to their vast size and grandeur, the Pavlosk Palace makes a big impact due to the fact it is a lot smaller, is not quite so ott in decor but much more 'homely', is more relaxed to walk around and I felt, gave you a real impression of being a 'lived in' and 'liveable in' building not one really just for show. I would recommend going to see it quickly before word gets out and it becomes a victim of it's own success and gets over crowded.You are given plastic 'gloves' to wear over your shoes to protect the floors but they are comfortable and no problem to walk around in, even in sandals.It is incredible how beautifully it has been restored considering the horrendous damage it suffered in war. It has a lot of furniture in it, many paintings, and some stunning ceilings, coving and plasterwork. The grand dining room is set up wonderfully with a big display of crockery and table decorations. It is lovely and light to walk around and there is a lot to see.It is set in a vast park and we went on a carriage ride (each carriage seated 6) around the park which in the glorious sunshine we had, was a delightful thing to do. It lasted over 45 minutes and we all thoroughly enjoyed it. The seats were comfortable and we went at a nice slow speed. It really is a park, not formal gardens (the palace has some small formal gardens at the rear of it) full of meadows, trees, and a lake, I'd really recommend doing this.It also had free, well kept, clean loos!It turned out to be a real bonus for us to visit the Pavlosk Palace, as having seen the Peterhoff and Catherine Palace we did wonder if it would be a bit 'second best' in comparison to the larger palaces but it certainly was not, it is a superb palace in it's own right to visit."
        }, 
        {
            "index": 164, 
            "rating": "5", 
            "review": "Magnificent panorama to the city. Not only does it look great from the river, but also the place itself is very nice."
        }, 
        {
            "index": 165, 
            "rating": "4", 
            "review": "Wonderful day out in Pavlovsk Park. I hadn't visited the palace but the park itself is great, sometimed you feeling yourself like in the forest. You could see and feed several squirrels in the park, take the rest in it's quite parts - the only advices is again to visit it before Peterhof and Pushkino and to take something against the insects."
        }, 
        {
            "index": 166, 
            "rating": "5", 
            "review": "Huge area. There is lot too see so make sure your timetable is not full with other engagements"
        }, 
        {
            "index": 167, 
            "rating": "5", 
            "review": "The best of all the palaces.. Paul was given some of the hunting grounds from his mother Catherine. The grounds are beautifully natural when you enter. The palace is the only one where the furnishings and the artwork was saved by hiding them before the Germans came.Much of the rooms are in the classical revival motif and are beautiful, particularly with the original furnishings/art. Not only I but the tour guides, and the citizens consider this to be their favorite palace. Yet it is the least visited and quite a nice leisurely pace to enjoy the palace and grounds. They will allow photos for a fee. I bought a small book.I do recommend that you visit with a tour guide because the palace is at least 30km out of the city. Marina Wilson did an excellent tour (see my review) of this and Catherines' palace on the same day."
        }, 
        {
            "index": 168, 
            "rating": "5", 
            "review": "What to see where locals get away to.... Pavlovsk Park is the most beloved park in the region, luckily it is so large that even on a busy weekend, one wishing solitude, can find it. It is a natural wooded park mixed with dense forest, stunning meadows covered with wildflowers, creeks, a river, ponds and lakes, a palace, and trails that criss-cross the vast area of the park. It is very easy to get here by electric train for 42 rubles, where the station is directly across the street to one of the entrances to the park. If you forget to bring stale bread or raw nuts, don't worry, there are sellers of all sorts of nuts that the park's famous squirrels will eat from your hand. Not that many foreign visitors go but if they have time they would soon discover why it is a favorite of locals."
        }, 
        {
            "index": 169, 
            "rating": "5", 
            "review": "Gem. The one palace which is not so enormous as most others. You might even imagine living there. Still an absolute beauty. As with the other palaces and gardens, spend a bit extra on a very good guide and keep the group small (3 to 5 people max.)"
        }, 
        {
            "index": 170, 
            "rating": "5", 
            "review": "Remarkably uncrowded and a joy to see again.. We loved this in 1986 and in 2012 it was even better. The restoration is complete. There is even a restaurant but the service at counter is deplorably slow. The rooms are beautiful and worth a slow meander."
        }, 
        {
            "index": 171, 
            "rating": "5", 
            "review": "This palace is worth a visit if you have some extra time.. We travelled to St. Petersburg by cruise ship and Pavlovsk Palace was included as a stop on one of our tours. As mentioned, it is quite different from Catherine's Palace and much less crowded. It is very beautiful and well worth the visit if you have the time. It is definitely a hidden gem!"
        }, 
        {
            "index": 172, 
            "rating": "5", 
            "review": "nice tour. The only problem is found a tour in english, but you can take a tour in russian and enjoy the visit too. is not so popular like Petershof and Puskin but if you have a extra half a day dont miss this place."
        }, 
        {
            "index": 173, 
            "rating": "5", 
            "review": "Pavlosk. This is a hidden jewel that doesnt get much publicity. Amazingly restored after almost complete destruction in WW2. Read the book first of its history and the story of its orginal construction and subsequent restoration."
        }, 
        {
            "index": 174, 
            "rating": "5", 
            "review": "My favorite park in St.Petersburg. Pavlovsks is very different from Peterhof or Catherine park. It does not have their pomposity and gloss, but I love this place and always come back here when I'm in St.Petersburg. This is very serene and quiet park with long alleys, beautiful lakes and old bridges. I could never walk it through because it is very big, but this time we found the bike rental spot near cafe Slavyanka and rented them for 2 hours. The bikes look old, but they are good. We had absolutely wonderful experience. I didn't visit the palace this time, I've been there before, but the time we spent in the park was great, as always. One tip: don't be afraid to go to Pavlovsk on your own, not with the bus tour. It's very easy and cheap to get there from Moskovskaya metro station. There are many buses going to the park and the palace. Going on your own gives you the great opportunity to trully experience this place and contemplate the destinies of people who created it and lived there."
        }, 
        {
            "index": 175, 
            "rating": "4", 
            "review": "The best of all palaces. Furniture inside beautiful, beeter than other palaces. Guides horrible, bad behaviour, Beautiful park."
        }, 
        {
            "index": 176, 
            "rating": "3", 
            "review": "Get out of the city. Try to get your guide to show you typical houses and impress on them that Russian things should get more attention. Old Russian buildings are hard to come by except in arch park halfway between Moscow and ST PETE"
        }, 
        {
            "index": 177, 
            "rating": "4", 
            "review": "Ooooh, a troijka ride..... We took the train to Pavlovsk, quite an experience with nobody speaking one word of English at the station... We went there especially for a troijka ride and yes, at the entrance of the palace you will find the troijkas...Loved it !.."
        }, 
        {
            "index": 178, 
            "rating": "5", 
            "review": "Beautiful Classical Palace. The palace is a real gem; the Peterhof and Pushkin Parks are better."
        }, 
        {
            "index": 179, 
            "rating": "5", 
            "review": "Enjoyable. This was a smaller palace but nonetheless quite lovely in its own right. If you are going to St. Catherine's, then you should include this palace on your trip."
        }, 
        {
            "index": 180, 
            "rating": "3", 
            "review": "the spirit of central Russia. I never feel it like St-Petersburg, it has much more Moskow spirit. Quite wild park, not durty, but very haotic. It seems more like a big village house than a palace"
        }, 
        {
            "index": 181, 
            "rating": "5", 
            "review": "Palace for life. I love the Palace Museum in Pavlovsk because it's more \"a home\" than ceremonial palace, shows the royal family as usual people.\nIn a beautiful park you can relax and dream on a hot afternoon in the shadow of old trees"
        }, 
        {
            "index": 182, 
            "rating": "5", 
            "review": "Stunningly restored , world class example of neo-classical design.. Located at Pavlovsk, south of the summer palace of Catherine I at Tsarskoye Selo, Pavlovsk Palace and Park is accessible to and from there by minibus. You can also take the metro (line 2, blue) from central St. Petersburg to Moskovskaya, and from there catch a minibus to Catherine's Palace or Pavlovsk.The palace and its vast park were a gift from Catherine II (the Great) to her son Paul, who became Tsar Paul I of Russia. The palace dates from the early 1780s and is designed in the Palladian style. Together with its sumptuous interiors and beautifully landscaped surrounding park, Pavlovsk Palace has become an icon of neo-classical style. The palace was almost completely destroyed by the Germans during WW II, but has been stunningly restored.Entrance to the park is advertised as being free, although the lady at the entrance by the Pavilion of the 3 Graces may want to sell you a ticket (150 R). Entry tickets to the palace proper (500R) are available from a booth to the left of the main entrance in the horseshoe-shaped courtyard. The palace is closed on Fridays. In contrast to Catherine's Summer Palace at Tsarskoye Selo, Pavlovsk is relatively uncrowded. When I was there, I practically had the whole place to myself."
        }, 
        {
            "index": 183, 
            "rating": "5", 
            "review": "another must see!. A beautiful park that is worth a visit when you are in St. Petersburg."
        }, 
        {
            "index": 184, 
            "rating": "4", 
            "review": "A nice change of pace.. If Rococo isn't your thing, the Great Palace in Pavlovsk offers something a little different. The style is much more sedate and \"homey\" than most of the other big tourist draws. You will also not be tripping over hoards of other tourists. There is a lovely library which I had to myself to explore. I also really enjoyed the park area. I believe it was the old hunting grounds and though there are some paths and out-buildings, it still has a more natural feel than the Tsarskoe Selo parks. I'm a Canadian but live in the middle east and really enjoyed the nostalgic feeling of seeing birch trees and tall pines. A lovely place for a walk on a fall day."
        }, 
        {
            "index": 185, 
            "rating": "4", 
            "review": "A more relaxed place to visit. Not as many tourists as the other palaces, probably because of the distance. But it's a much more human scale, and the gardens are well worth a stroll.Visit at the same time you're going to Catherine Palace"
        }, 
        {
            "index": 186, 
            "rating": "4", 
            "review": "Impressive. We visited this palace after seeing Peterhof and Catherine Palace, so we were exhausted. However it was still quite beautiful; certainly not as opulent as the previous ones."
        }, 
        {
            "index": 187, 
            "rating": "5", 
            "review": "Excellent Second Palace to Visit after Catherine's. After our trip to Catherine's Palace, we had planned to visit Alexander Palace, the one where Nicholas II and his family lived and were imprisoned, but our guide suggested Pavlovsk instead. Alexander Palace is mainly a memorial to the last tzar and his family, while Pavlovsk is a suburb neoclassical palace worth seeing in its own right. A gift from Catherine to her son, it's much smaller than her palace, but in many ways, it is more liveable and comfortable. Yes, it has its public rooms which are beautiful, but it also has private quarters where Paul and his family lived. If you go to Catherine's Palace and have a choice of visiting a second one, we recommend Pavlovsk. (It also has an excellent cafe where you can have a bite to eat and some sit-down time between the two visits.)"
        }, 
        {
            "index": 188, 
            "rating": "5", 
            "review": "dazzling and historic. this is a spectacular restoration of a palace wrecked during World War II. It has 2 floors of gorgeous rooms that aew a primer in neoclassical design. Reach it by the 545 bus from Moskoskaya."
        }, 
        {
            "index": 189, 
            "rating": "3", 
            "review": "Enormous nautural park. If you like strolling through parks, natural ones, this is the place for you. The palace meant nothing much to me."
        }, 
        {
            "index": 190, 
            "rating": "4", 
            "review": "GORGEOUS PARK AND WEALTHY IMPERIAL RESIDENCE. I went there wit some friends that live in southern St`Petersburg , by car. We meet at Moskovskaya metro station ad departured , towards Pavlovsk. Nearby the metro station , I immediately saw the \"Monumentto to the heoic defenders of Leningrad , a high obelisk.By car , we did the route in around 30 minutes , and it was easy to park there.We started taking a walk at the magnific Pavlovsk Park that is not an urban park : I felt myself at a forest or something like that , full of green trees , birds , squiers , lakes...It was very nice to wander around there.Then , we reached the Pavlovsk Palace: from outside it didnt catch my attention at all , but inside it was wonderful. There are guided tours in russian though the fine rooms: Italian Hall, Grecian Hall , Hall of War , Hall of Peace , Paul´s throne room."
        }, 
        {
            "index": 191, 
            "rating": "4", 
            "review": "The park district is a big star.. What we know about Paul I. Here is his encyclopedic presentation: \"The son of Peter III and Catherine II. Emperor 1796 - 1801 (5 years). Sons, Alexander (the future Emperor Alexander I), Constantine, Nicholas (the future Emperor Nicholas I), Michael and 6 daughters. \" He was married twice, both times in the brides eyes he chose Catherine II, but the second time he accidentally found his soul mate - Prussian Princess Sophia Dorothea of Wurttemberg, daughter of Frederick II Eugene, Duke of Württemberg (Maria Feodorovna). It was a happy marriage. He lived for 47 years. Their children are beginning Holstein-Gottorp branch of the Russian imperial family tree. He put the blame that he has reformed Russian army on the Prussian model. And relied on a favorite Arakcheeva. But the emperor has introduced a decree on 3-day corvee, ie, facilitated the peasants life and led the Russian army put Alexander Suvorov, who in 1899. made a brilliant Italian and Swiss campaign. The Palace: Arch. Charles Cameron - 1st floor: Dance hall, old room, billiard room and dining room white; Arch. V. Brenna - 2nd Floor: Italian and Greek hall, front bedroom, living room war and peace, as well as the Art Gallery, the Throne Hall and Kavalersky; Arch. J. Quarenghi - 1st floor: Old or crimson, General, New and Pilyastrovy rooms, Dressing Room; Arch. Voronihin working to restore the interior after the fire; Arch. Rossi - Library. Pay attention to the ceiling (painted ceiling) in the Throne Room or the State Dining Room (lean-to P. Gonzaga) - an optical effect of a flat surface. The blue vase in the hall of the World - a gift of Napoleon I's son Paul, Alexander I, is very beautiful its silhouette against the background of the park, vidneyuschegosya out the window. In the portraits of his wife Maria Feodorovna Paul full-length (thin-to A. Roslin) in the Small Hall and a charming portrait (thin-to M-B. Voile) in Freylinskoy. Instead it hangs a picture \"Cupidon\" the bow, the arrow is always aimed at the viewer, I do not know why, but it is very memorable, and often found on the stalls near the palace as a souvenir, perhaps a kind of Pavlovsk`s souvenir. The park district is a big star. The square itself, from which radiating 12 lanes, bordered with bronze statues of Greek gods 2 - Apollo (the leader of the Muses, the god of the Sun) Mercury, 7ми muses - Thalia (Muse of comedy), Melpomene (muse of tragedy), Erato (muse of love poetry) Terpsichore (muse of dance), Calliope (muse of epic poetry), Urania (muse of astronomy), Clio (muse of history) and 2 Goddess - Flora (goddess of vegetation) and Venus (the goddess of love and beauty).After Paul strangled his wife and children lived in Pavlovsk. In one of the inaccessible areas of the park (on the edge of the ravine), she built a mausoleum in honor of her husband. They've loved each other. And written on the pediment: \"Wife-benefactor. When we left the palace on the square a band played and was a wonderful children's musical ballet costume. We were told that right now there is something like the Feast of Roses (flowers). He wanted so badly to walk from the heart of Landscape Park. In Pavlovsk many artists with easels - because this is really beautiful natural images."
        }, 
        {
            "index": 192, 
            "rating": "5", 
            "review": "Pavlovsk Palace has many unique qualities. We went to Pavlovsk Palace as part of the \"The Last Romanovs\" excursion with Celebrity. We really enjoyed the authentic Russian lunch in the palace's restaurant - including the shot of vodka - prior to our tour of the palace. The rooms had so many unique qualities and contents. It was a very pleasant visit and the park was beautiful. There were horse drawn carriages you could rent to go through the park if you wanted to as well."
        }, 
        {
            "index": 193, 
            "rating": "5", 
            "review": "Pavlovsk Palace & Park. One of the nicest imperial residences we visited while on our shore day tours was a side trip of Pavlovsk Palace & Park located about 16 miles from St Petersburg - just outside of Pushkin. When taking the day trip to Pushkin make sure to plan time to visit the lovely palce of Pavlovsk and the park which is a gold and while palace built by Catherin the Great for her son Paul I (Pavel) in the 1700's. Pavel moved into this palace with his family of 10 children and they roamed through the 1500 acrea estate during the youth. Pavlovsk was never a \"state palace\" but was an actual home for this royal couple and the decoration and feel of the palace show you how much love and affection was present in this home. My grand-kids ages 18 & 21 loved Pavovsk Palace and we very much enjoyed our time spent touring the palace and walking the park after our visit to Catherine's Palace in Puskin. Thank you Red October USA for suggesting and make this wonderful day trip available for our enjoyment for without your suggestions we never would have found this lovely palace and park."
        }, 
        {
            "index": 194, 
            "rating": "5", 
            "review": "A must-see for palace fans. We went to Pavlovsk Palace as part of the \"The Last Romanovs\" shore excursion with Royal Caribbean. We had a lovely Russian lunch in the palace's restaurant, and then took a tour of the palace and the grounds. The rooms are breathtaking, and the grounds are lovely as well. Well worth a trip, especially for tourists who are fans of the royal palaces as well as history buffs."
        }, 
        {
            "index": 195, 
            "rating": "5", 
            "review": "The Most Beautiful and Interesting Palace in Russia. In October I visited Pavlovsk Palace just outside St. Petersburg with a group called Russia: Making Connections. It was the most incredible experience I've ever had and a very important trip for anyone interested in Russia art, architecture and history...and I really DID \"make connections\"!!!We learned about Pavlovsk Palace in depth, met with curators of the decorative arts, textile, painting/sculpture departments and other experts - including members of the restoration staff. As Pavlovsk was almost totally destroyed during World War II, that was a story in itself! Then, as part of the program, we visited five additional palaces in the St. Petersburg area to learn about the people who lived on these grand estates, to compare architectural styles and to learn more about Russian history. Accommodations were a real treat - provided in a lovely palace-turned-private-hotel and we felt like tsars and tsarinas in the midst of all this splendor.There was much to see within walking distance of \"our palace\". The parks in this area are stuff of dreams with pagodas, delicate footbridges over streams, wildlife, formal and informal gardens and vistas designed for an empress. During leisure time, we could set our own pace and choose activities based on our own interests - which I appreciated.I understand that an optional program to Moscow will soon be offered in conjunction with the Pavlovsk / St. Petersburg program and hope to do that also at some point.This was a remarkable experience and unique in that I really felt I had connected with Russian people, interacted with them, learned from them and, as a result, now share their pride and appreciation of their old and rich culture."
        }
    ]
}